{"duration": 1.4460854530334473, "input_args": {"text": "'Search Zineb el Rhazoui, Charlie Hebdo Survivor, Discusses Why the World Needs to ‘Destroy Islamic Fascism’ Undeterred by fatwas and death threats, the author has released an incendiary and thoughtful new book, bound to provoke debate. October 28, 2016 \\nReprinted from NyTimes.com. \\n\\nShe leads a clandestine existence, on the move and under 24-hour guard as France’s most protected woman. Yet Zineb El Rhazoui, the Charlie Hebdo journalist who happened to be in Casablanca on January 7 last year, the day terrorists “avenging the Prophet” massacred nine people at the satirical magazine in Paris, believes she has a duty to defy Islamists desperate to silence her. \\nShaken but undeterred by the fatwas and relentless, precise death threats issued via social media to “kill the bitch” since she helped produce the publication’s first survivors’ issue following the attack — and spoke about it in Arabic for the Arab press — the Moroccan-French writer refuses to assume an anonymous identity. Fleeing Paris or abandoning her human rights activism, and her unforgiving critiques of the religion she grew up with, are also out of the question. \\n“I don’t have the right to renounce my struggle, or to give up my freedom,” says the reporter and sociologist of religion in an interview with Women in the World, during a recent trip to New York, as part of French president Francois Hollande’s delegation when he received the Appeal of Conscience Foundation’s World Statesman Award for 2016. “If the French state protects me it is not little individual me: What is being protected is my freedom to be irreverent, and freedom of expression, so I should exercise this even more because I enjoy this protection.” \\n“It’s totally crazy. I have done nothing against the law and have nothing to hide, yet I live with security while those who threaten us are free,” El Rhazoui declares with an air of shock and anger that underscores the arbitrariness and brutality visited on a 34-year-old woman condemned to living on the run and mostly in the shadows. “And if you call them by their names you are Islamophobic and racist. I am racist? I can teach them a few things about Arab culture. I can show them how to discover its richness and the diversity of their culture. I believe this culture deserves universality because you can be Arab, Muslim and a free thinker.” \\nResisting terror \\nSweeping in to the offices of Women in the World in Manhattan, accompanied by bodyguards, the world-renowned journalist is living proof of her pledge to keep “living her life beyond its limits” as a key way of resisting terror. Elegant and beautiful, with her long, wavy hair flowing freely and in an impeccably tailored black dress, El Rhazoui is reminiscent of 1940s cinema’s cerebral heroines — her eloquence and composure only occasionally betraying the trauma of the past 20 months. Each time we speak about the aftermath of the massacre at her magazine and how she is coping personally her voice quavers, but when the subject comes back to her fight for reform in Islamic civilization she is fearless. \\nIn this spirit, El Rhazoui, obliged to spend most of her time in hiding, like Salman Rushdie after his 1989 publication of The Satanic Verses , has taken the high-risk option of publishing an explosive new book about Islam. \\nDetruire Le Fascisme Islamique ( Destroy Islamic Fascism ), being released in France this week, takes the battle of ideas directly to the ideologically-driven zealots who inspired the assassins of her dear friend Charb (Stephane Charbonnier), late editor of Charlie Hebdo who preferred “to die standing than to live on my knees.” \\nObtained exclusively by Women in the World, the book dedicated to “Muslim atheists” is an unapologetic strike against the strict application of Islam by imitating the first Salafists or “pious ancestors.” The Prophet Mohammed and his companions, whose violent exploits are contained in “bellicose texts from a barbaric 7th-century Bedouin tribal context,” exhibited codes of behavior El Rhazoui insists have no place in the modern world and can be directly connected to terrorism. “The most abject crimes of Islamic State are but a 21st-century remake of what the first Muslims accomplished under the guidance of the Prophet,” she writes, noting that sexual and domestic slavery, the massacre of non-Muslims (notably Jews), pedophilia, pillage, polygamy and summary executions were all adopted from pre-Islamic societies. The book is also the journalist’s way of carrying on the legacy of her dead comrades, who reveled in their right to mock established religion and fanatics everywhere — with Islam no exception to their traditional French anti-clerical ridicule — through satire and caricature. \\nFormerly the magazine’s religion writer, El Rhazoui is in the throes of joining the exodus of staff breaking from the magazine under its new management. Flush with cash from international donations, the fundamentally altered publication, she disappointedly explained, “ will probably never again draw the Prophet ” out of fear of more reprisals. \\n“[And] those who think that only a handful of madmen are capable of killing for a cartoon of Mohammed forget that everywhere that Islam reigns as the religion of the state, caricatures and cartoons in the press are repressed”. El Rhazoui’s book, dedicated to “Muslim atheists,” is an unapologetic strike against the strict application of Islam. Religion of peace and love? \\n“We need to admit that Islamism today is applied Islam,” El Rhazoui — who describes herself as an “atheist of Muslim culture” –writes, responding to politicians, religious figures, Islamophobia opponents and media commentators who claim after every jihadist attack that “real Islam” has nothing to do with such terror. \\n“When we apply Islam to the letter it gives Islamism, and when we apply Islamism to the letter it gives terrorism. So we need to stop saying Islam is a religion of peace and love. What is a moderate Islamist? An Islamist who doesn’t kill?” \\nThe essay-length book is in the grand French polemical tradition of Emile Zola whose J’accuse denounced the anti-Semitism of the French state and establishment during the Dreyfus Affair, on the eve of the 20th century. El Rhazoui, who holds Moroccan and French citizenship, takes aim at a very 21st-century phenomenon: what she abhors as the “intellectual fraud” of Islamophobia, which pretends to be about anti-racism but in her reckoning is used as a weapon to silence all critics of Islam and the ideas behind it as automatically hostile towards all Muslims. Epitomized by the French Collective Against Islamophobia (CCIF), this deliberate strategy vilifies as Islamophobic voices such as El Rhazoui’s who dare question the religion the CCIF and fellow travelers define only through the prism of their own fundamentalism. \\nThe notion of Islamophobia doesn’t even exist in Muslim countries, the author points out, because outside the West, criticism of the religion or Mohammed is officially “categorized as blasphemy.” \\n“Unable to pass blasphemy laws in Europe, groups like the CCIF employ a dangerous “semantic confusion,” she said. On the CCIF site it is written “Islamophobia is not an opinion: it is an offense.” \\n“This is very dangerous because it has even entered the dictionary as hostility towards Islam and Muslims. Yet criticism of an idea, of Islam or of a religion cannot be characterized as an offense or a crime. I was born and lived under the Islam of Morocco and live in France and I have the right criticize religion and this dictatorship of Islamophobia that says I have no right to criticize! If we criticize Christianity it doesn’t mean we are Christianophobes or racist towards the ‘Christian race.’” \\nThe widespread pressure to self-censor is severe, El Rhazoui says. \\n“You can no longer speak about Islam without saying it’s a religion of peace and love. But when you open any book in Islam what do you find? Violence, blood, oppression of women and hate for other religions. \\n“Of course you can find this in other religions, however we are talking about something written many centuries ago during a barbaric time for humanity. As long as we don’t talk about this, and keep repeating that Islam is a religion of peace and love, many people will continue to believe the Koran is a constitution, and that rather than being a book written 15 centuries ago reflecting a particular context, it is a legal constitution to apply today.” \\nZineb El Rhazoui feels she is carrying on the legacy of her dead Charlie Hebdo comrades. \\nAfter completing high school in Morocco, El Rhazoui studied languages and the sociology of religion, obtaining a Master’s degree from Paris’s prestigious social science graduate school EHESS. In her twenties she returned to the country of her birth to work as a journalist at Le Journal Hebdomadaire, becoming a campaigner for secular liberties, such as the right to break the fast and even snack in public during the month of Ramadan. This act of non-violent resistance earned her her first fatwa, ahead of her involvement in the movement supporting the Arab Spring in 2011. The wave of personal attacks and threats that came after her collective protest against Ramadan rules prompted her to leave Morocco again for France where she began to report for Charlie Hebdo, bringing her memories of having “vomited up compulsory religious classes” in a country where “being Muslim is not a choice” unless you’re Jewish or Christian. \\nExtreme personality cult \\nSo-called Islamic fascism, seen in its most extreme form in groups like ISIS, shares characteristics in common with all extreme-right fascisms, El Rhazoui argues, because it combines an intense personality cult around Mohammed as the incarnation of the nation. It also employs widespread systems of suspicion and denunciation, exemplified by “sartorial branding” — for example Burkinis or niqabs — that allow for immediate identification and targeting of non-adherents. There are also familiar fascist tropes of repressive sexism against women and homosexuals, armed militias, adoption of a flag, and a strategy that confers the benign status of ‘Muslim women’ to heavily veiled adherents in the West, and characterizes them, disingenuously, as victimized objects of exclusion. \\n“The literary corpus of Islam is so stuffed with damning accounts it would be difficult to cleanse it without altering the fundamentals of dogma,” El Rhazoui writes. \\n“If the terrorists of Daesh [ISIS] behead those they judge to be miscreants, that is because they draw on their legislation in the texts like the 8th surah of the Koran, al-Anfal, verse 12: “Remember what Your Lord revealed to the angels : I am with you, so support those who have believed. I will cast terror into the hearts of those who disbelieve. You can strike them above the neck and strike off every fingertip”. \\n‘You can be Arab, Muslim and a free thinker’ \\nDrawing on her personal experience and scholarly knowledge of Islam’s core Arabic texts, the politics of the post-Arab Spring Middle East, and the wellspring of reformism and dissidence embraced within the multi-faceted Islamic civilization, El Rhazoui’s book is an impassioned response to all the extremists who want to see her and her fellow opponents of politico-religious repression dead. \\nThe greatest racism is, El Rhazoui argues, the racism of the Islamist ideology that forbids marriage with people who are not Muslims, and that rejects women. “That is the definition of racism and fascism and we must say it,” the writer adds. \\n“Today Islam in the world only has a role as a civilization. A civilization is defined by many things and not uniquely by religion — but also by its geographical heritage, its artistic, culinary and sartorial traditions and by literature. \\n“The Muslim religion has its place in the modern world if it submits itself fully to the laws that rule humanity today: universal principles of equality between men and women, sexual and individual freedom, and equality for all, no matter your creed or religion. Until Islam has admitted this and accepted that the freedom of men and women is superior to it, Islam will not be acceptable.” \\n‘Islamophobia whiners’ \\nDestroy Islamic Fascism aims to puncture the hypocrisy and faux-intellectual “fakery” (the author’s word) of “Islamophobia whiners” and other “collaborationists” from across the political spectrum — particularly the hard left, “Crypto-Islamist” anti-racists on a quest for a new “Muslim proletariat,” certain feminists, cultural relativists and so-called moderate Imams. All these “willing accomplices” do is distort the noble cause of fighting racism to give undeserved legitimacy to an ideology that at its most extreme results in the horrors of Islamic State, the author says, but also makes the lives of millions of Muslims living in Islamic countries downright miserable. \\n“What do these Islamophobia whiners say to the millions of individuals who live in Islamic theocracies and dream of liberty?” El Rhazoui concludes in her book. “Who speaks about the nightmare of a woman who decides to cross the streets of Algiers, Casablanca or Cairo in a skirt?… those who would like to drink a glass of alcohol in countries where you have to flout the law to do it? … about homosexuals, pariahs of Muslim societies, who often only have the choice of death, prison or exile? Who speaks about this youth born Muslim but dreaming of a normal life, these teens attacked for having had a romance?” \\n\\n\\nThe summer furore over Burkini bans in France agitated the author who deplored the cynical rush of Islamists and their Western sympathizers in the media, academia and politics to celebrate the controversial swimsuit as a form of “liberation” and simultaneously a banal piece of cloth preferred by “Muslim women,” even though most never wear it. \\n“Western media, in an intolerable readiness to oblige, have defended the Burkini as a ‘freedom’ and a legitimate cultural expression of a part of humanity,” she said, but pointed out that “in Muslim countries the beaches are not filling up with Burkinis, but they are emptying themselves of women. From one year to another, they are disappearing from the public space, because the veil has never been anything except an extension of the walls of their harem to the exterior.” \\nAs for mainstream or moderate Muslim clerics, El Rhazoui tells Women in the World that during the Burkini debate in France not one Imam stood up and said “Hey, wait a minute, you can be Muslim and wear a [regular] bathing suit.” \\nHistory will judge those who have monopolized the debate, given a platform to Islamist fundamentalism and even given it a guarantee of acceptability, the author of Destroy Islamic Fascism told Women in the World. “This is just betrayal and it is collaboration with one of the worst forms of fascism that exists today,” she said. \\nAccording to the writer, who is repeatedly accused of bigotry, the “Islamophobia ruse” is driven by “great ignorance” and a lack of understanding of the culture of Islam and what Islam with a big ‘I’ is — “they ignore its complexity and that there have always been opposition currents and progressive and liberal pushes from within.” \\n“The accomplices don’t recognize the struggles playing out today in Arab countries will inevitably be won by the democrats and free people. No fascism or totalitarianism has ever been able to win in the long haul of history. The people who are the allies and collaborators of this totalitarianism today will be judged by history and seen as accomplices to this criminal ideology to which they have given a veneer of respectability.” \\nFor El Rhazoui the true racism emerges from a condescending approach to Islamic culture that decrees an Islamic woman in a burqa is congenitally not free and that her “race” is the burqa. “We present the fundamentalists as being a race and this only shows the contempt we have for this culture. It is absolutely intolerable,” she says. \\nSurvivor syndrome \\nWomen in the World asked El Rhazoui how she manages to keep up her spirits, and continue her struggle for the freedom to dissent after everything that has happened since January 2015. \\n“It is a question people often ask me,” she said with a perceptible tremor in her voice. “But when you live through these moments in which you are confronted by a reality as cruel and simple as life and death, you realize can put many things in perspective. \\n“Straight after the attacks, like many of my colleagues I felt guilty for having stayed alive. I said to myself ‘Those who are dead are dead for all our work, and some are dead when it wasn’t even their work. But it was my work because I am a journalist and I am still here.’ And then you understand this is all part of survivor syndrome, which is normal when you survive a massacre like that. \\n“As you start to heal you say, ‘I am lucky to be alive and if I am still here perhaps that is because I still have something to do.’ I understood long before the attack on Charlie, when I engaged in a struggle for individual liberties and democracy in Morocco, that when you fight against totalitarianism, whether it is political or religious, you should never give your enemies the pleasure of stopping living. We fight so that everyone can have a free and happy life and we must continue to live this same life. \\nZineb El Rhazoui (C) attends the funeral of French cartoonist and Charlie Hebdo editor Stephane “Charb” Charbonnier, on January 16, 2015 in Pontoise, outside Paris. (MARTIN BUREAU/AFP/Getty Images) \\nStill a day doesn’t go past when she doesn’t think of her old colleague Charb and their many heated discussions. \\n“He was someone who was extremely lucid and for whom the concepts were clear. He was a true humanist who didn’t fear being accused of being racist because for him it was absurd.” \\nEl Rhazoui’s deconstruction of Islam is also a defense of Muslims, she reasoned, as “salvation will come when we stop aligning the identity of an entire community with the most fundamentalist people who pretend to represent it.” \\n“We have to extend a hand to all these Muslims who are free people, who have questioned their heritage, and who are fighters for liberty, battling for the same values as us but in a context controlled by Islamists,” she says. \\nLife in a moving jail \\nSince January 2015, the survivor from Charlie Hebdo has traveled frequently to speak at universities and meetings of the Freedom Forum, in Europe and the U.S., under the protection assured by the French state and the countries that receive her. She says she would never complain about living under permanent armed guard and having her freedom of mobility curtailed, because so many other writers and political figures around the world — and especially in Islamist-controlled or influenced countries — are taking the brave decisions to do as she does but without any security. \\n“I always find some spaces of freedom. There are always little escape hatches. Life continues!” says the woman who has just written her second book since the Charlie attacks, and recently became a first-time mother, in what she laughingly called the surprise “baby boom” at a publication that used to have “one of the lowest birthrates in French media.” \\n“Today I wander around in a moving jail — it’s a moving cage — but in reality I am more free in my head than those who threaten me. Because their cage is inside their head. They have this cage in their brain and even if they have freedom of movement it is their spirit and their reason and intelligence that is imprisoned. I am much freer than them.” \\nFollow Emma-Kate Symons on Twitter @eksymons.'"}, "time": 1742562625.38875}