{"duration": 0.0968790054321289, "input_args": {"text": "'RIO DE JANEIRO  —   Simone Manuel woke up Friday morning to confirmation that her victory in the   freestyle a few hours earlier had not been a dream. The proof was perhaps more surreal than Thursday night’s payoff: Instagram posts from LeBron James and Serena Williams. Manuel’s friend and fellow trailblazer Lia Neal had forwarded the messages after stumbling across them on Twitter. “I was like, ‘Oh my God, I wish I could see her reaction right now,’” Neal said. “She doesn’t need to hear from anyone else. Those are like her two favorite athletes. ” Manuel’s popularity got an emphatic spike after she became the first   woman to win an individual swimming event at the Olympics. Manuel, a    Texan, shared the gold medal with    Penny Oleksiak, who also made history, becoming the youngest gold medalist from Canada. James wrote that he watched the race with his daughter. Williams posted a picture of Manuel and Simone Biles, who won the gymnastics   gold medal, and called them  “amazing. ” One mother posted a photograph on Twitter of her exuberant young black daughter posing in front of a television screen that showed Manuel being interviewed. By early Friday evening, it had more than 12, 000 likes. “I saw that picture,” Neal said. “I retweeted it. I was tearing up again. ” The top of the medals podium at Olympic Aquatics Stadium was crowded Thursday night, and not because there were   medalists for the first time in the Olympics since 2000, when Anthony Ervin, whose father is   and American Indian, tied his teammate Gary Hall Jr. in the 50 freestyle. Standing on the podium with her, Manuel said, were Neal, Ervin, Maritza Correira, Cullen Jones and all the black swimmers whose success shaped Manuel’s dreams. “This medal is not just for me, it’s for some of the   that have come before me, have been inspirations and mentors to me,” Manuel said. In 2012, Neal became the second   woman to make a United States Olympic swim team, after Correia in 2004. Neal was 17 and a rising senior in high school. Neal and Correia earned medals as members of 4x100 freestyle relays in their first Olympics. Correia won a silver, Neal a bronze. On Saturday, Neal raced in the morning heat for the American 4x100 relay team, which later took the silver. Neal, a rising senior at Stanford who grew up in Brooklyn, was asked which medal she considers more precious, her silver or the gold that Manuel earned in an upset. “I think Simone’s gold,” Neal said. “I just felt more when she touched the wall and saw that she won. I knew exactly what went into winning that gold medal. ” Neal feels a sisterly bond to Manuel, who is one year behind her at Stanford. In the   to the Olympics, they often felt as if people saw their stories as being only skin deep. On the way to becoming the first two black women to grace the same United States Olympic swimming team, Neal and Manuel often compared notes after news media interviews. To their growing frustration, race was often discussed more than their races. “We talk about it and acknowledge that other people talk about it,” Neal said, “but we’re like ‘O. K. we’re here, like everyone else here we’re training toward winning, toward representing their country in the best way possible. History comes along with that. ” She added, “It’s cool because we’re not seeking to make history or change lives, we’re just doing what we love. ” Neal sat with Manuel roughly two hours before Thursday’s final. They listened to music, including the song “1, 2 Step” by Ciara and Missy Elliott. Neal’s parting words were “Pipe It Up,” from Migos. Neal said she was shaking before Manuel’s race and started crying during the last 10 meters when it dawned on her that Manuel might win. The prerace favorites were Cate Campbell of Australia, who lowered the world record to 52. 08 in July, and her sister, Bronte, who had clocked a 52. 58 in April. Manuel posted a 53. 32 in the heats, a 53. 11 in the semifinals and a 52. 70 in the final. “I was super surprised,” Manuel said after the race. “I don’t think there was a definitive point where I thought I had the race. ” How shocking was the outcome? Sarah Sjostrom, the Swede who finished third, said, “Penny and the American girl winning, I think that was the biggest surprise of the meet. ” (Never mind that “the American girl” had finished sixth, four places behind Sjostrom, in the   freestyle final at last summer’s World Championships in Kazan, Russia). After Manuel finished giving interviews in the mixed zone, she fell into the arms of Neal and another Stanford teammate, Maya DiRado. “She was just bawling,” Neal said. “She was like: ‘I’m so happy you guys are my teammates. I couldn’t have done this without you guys. I love you. ’” Manuel’s sentiments meant the world to Neal, who was disappointed when she did not qualify for these Games in an individual event. “Why I broke down in tears and why I felt so much emotion when she won was because I was there with her every step of the way,” Neal said. “I knew exactly what it took to get to that point and win a gold medal firsthand. ” How long will it take for swimming in the United States to become colorblind? Is one gold enough to change the questions Manuel and Neal face? “I think this definitely catapults us many steps forward,” Neal said, adding, “I think just that one medal will bring so many different people into the sport and inspire so many different people. ” Manuel, who on Friday qualified for Saturday’s   freestyle final, said she looked forward to the day when she is known simply as a champion. After the 100 final, she said, “I would like there to be a day where there are more of us and it’s not Simone, the black swimmer, because the title ‘black swimmer’ makes it seem like I’m not supposed to be able to win a gold medal or I’m not supposed to be able to break records. ”'"}, "time": 1742561701.4821358}