{"duration": 0.04344820976257324, "input_args": {"text": "'Journalist Chadwick Moore, who recently came out as conservative in a column for the New York Post, was shouted down by students during a recent event at Portland State University.[  Conservative journalist Chadwick Moore was shouted down by students at a recent event at Portland State University. Students, refusing to wait until the event’s QA, shouted at Moore during the lecture portion of the event. “I am black, I am disabled, I’m a woman,” one attendee shouted, before storming out of the room and pounding her fists on the windows. After mocking”Girl, there’s still time, we can punch you too,” another student shouted after Moore mocked the disrupters’ low energy. “Sorry, not a threat,” the student added after several attendees gasped at the suggestion that Moore would be punched. “Can you not wait until the QA and be polite?” Moore responded. “Why don’t you shut up and have respect for your fellow students?” Despite the interruptions, the event featured some positive moments. One female student told Moore that his story had helped her feel more comfortable in being herself. “I was one of those people who wrote you a message when you came out,” said a young woman in the audience. “I want to personally thank you for being as loud as you are because you’re speaking up for people like me. ” During the lecture, Moore cited a Gallup survey, which revealed that one in five gay Americans is conservative. “If you decide to shun a huge percentage of your community simply because they might not agree with your political views   …     you’re denying people a chance to true happiness of living authentically,” Moore said. Other members of the Portland State University community praised Moore’s lecture. “I was impressed by Chadwick standing up to these bullies and speaking his mind,” recent graduate Mykle Curton said. “Just because I disagree with him on politics doesn’t mean I can’t like and support him. I agree with him about his rejection of identity politics. They argue that you can lump people into groups and generalize their experiences and beliefs. ” Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742561922.6140969}