{"duration": 0.05864691734313965, "input_args": {"text": "'Emails show Clinton staff knew about private server in 2014 October 28, 2016 Hillary Clinton waves to the crowd after delivering her \"official launch speech\" at a campaign kick off rally in Franklin D. Roosevelt Four Freedoms Park on Roosevelt Island in New York City, June 13, 2015. REUTERS/Lucas Jackson \\nJohn Podesta’s Wiki-leaked Gmail shows that would-be-staff of Hillary Clinton’s campaign openly discussed her use of the private email account back in Summer 2014, but were told not to worry because “everything was taken care of.” John Podesta, Clinton campaign chairmen: “Did you have any idea of the depth of this story?” Robby Mook, Clinton campaign manager: “Nope. We brought up the existence of emails in reserach [sic] this summer but were told that everything was taken care of.” At the time of the exchange, Clinton had not officially announced her candidacy. According to NY Times: Clinton exclusively used a private email account while serving as secretary of state. Clinton violated State Department and Obama administration policies regarding email use. Clinton also flouted the Federal Records Act, which requires government officials to return their work product to their governing agency. Clinton did not give the State Department her work-related emails until Dec. 5, 2014. The State Department and Clinton’s legal team began negotiating the hand-over of Clinton’s emails in Summer 2014. Cheryl Mills, Clinton’s State Department chief of staff and her personal attorney: Led discussions with State Department about the email hand-over. Mills was also in frequent contact with Podesta and Mook in 2014. \\n(WASHINGTON, DC) Members of what would become Hillary Clinton’s campaign team discussed her use of a private email account as secretary of state in Summer 2014, months before her email practices were publicly revealed. But an email released on Thursday shows that Robby Mook, Clinton’s campaign manager, was not overly concerned about the issue at that time because he was told that “everything was taken care of.” \\nIt is not clear what Mook meant by the cryptic statement, which he made in an exchange with Clinton campaign chairman John Podesta. \\nThe email, which was hacked from Podesta’s Gmail account and released by WikiLeaks, is the first to show that the Clinton team was caught almost completely off guard by The New York Times’ March 2, 2015 story about Clinton’s email usage. \\n“Did you have any idea of the depth of this story?” Podesta asked Mook in the email. \\n“Nope,” wrote Mook. “We brought up the existence of emails in reserach [sic] this summer but were told that everything was taken care of.”'"}, "time": 1742562800.992151}