{"duration": 0.09047698974609375, "input_args": {"text": "'WASHINGTON  —   President Trump, who presented himself as a staunch supporter of Israel during last year’s campaign, took a harder line on settlements in an interview published on Friday and indicated that he was rethinking his promise to move the United States Embassy to Jerusalem. Mr. Trump told an Israeli newspaper that settlements “don’t help the process” and that he did not believe that “going forward with these settlements is a good thing for peace. ” He also did not reaffirm his past vow to move the embassy, saying that it “is not an easy decision” and “we will see what happens. ” The comments amounted to a striking recalibration of Mr. Trump’s approach to Israel just five days before Prime Minister Benjamin Netanyahu is scheduled to visit the White House. Mr. Trump and Jared Kushner, his    and senior adviser, have been exploring an   peace initiative that would enlist Arab allies, and a host of Arab leaders have told the new president that provocative   positions would not help. The interview was conducted with Israel Hayom, the newspaper owned by Sheldon Adelson, the casino magnate and close ally of Mr. Netanyahu. Mr. Trump hosted Mr. Adelson and his wife for dinner at the White House on Thursday night, along with Mr. Kushner and Secretary of State Rex W. Tillerson. The president’s language in the interview went beyond the carefully written statement issued by the White House last week saying that settlements were not an impediment to peace but they “may not be helpful. ” The statement was seen as a sign that Mr. Trump wanted Mr. Netanyahu to hold off contentious moves, at least until their meeting next week. Since Mr. Trump’s inauguration, Mr. Netanyahu’s government has announced the construction of 5, 500 new houses in the occupied West Bank, and the prime minister even raised the idea of building the first entirely new settlement in years. Mr. Netanyahu’s coalition pushed through Parliament a new bill retroactively authorizing thousands of houses built on   land that are illegal even under Israeli law. “They don’t help the process,” Mr. Trump said of settlements in the Israel Hayom interview. “I can say that. There is so much land left. And every time you take land for settlements, there is less land left. ” He added: “I am not somebody that believes that going forward with these settlements is a good thing for peace. ” Mr. Trump’s statement on the embassy move was also strikingly different than past comments. Arab leaders have warned him that moving the embassy to Jerusalem, which both Israelis and Palestinians claim, would lead to angry and possibly violent reactions because it would be seen as prejudging a final settlement between the two sides. The last three presidents refused to move the embassy there for that very reason. Last year, Mr. Trump said he would move the embassy “fairly quickly” after taking office. When approached by Boaz Bismuth of Israel Hayom on the eve of his inauguration last month, he reiterated his commitment by saying, “You know I’m not a person who breaks promises. ” But when Mr. Bismuth asked about it on Thursday, Mr. Trump did not repeat his vow. Instead, he said he was studying it. “The embassy is not an easy decision,” Mr. Trump said. “It has obviously been out there for many, many years and nobody has wanted to make that decision. I’m thinking about it very seriously and we will see what happens. ” Mr. Trump, who last year blistered his predecessor, President Barack Obama, for not being supportive enough of Israel, said he would not publicly criticize it. “I don’t want to condemn Israel,” he said. “Israel has had a long history of condemnation and difficulty. And I don’t want to be condemning Israel. ” But he also said he wanted Israel to compromise to make peace. “I want Israel to be reasonable with respect to peace,” he said. Mr. Trump did not offer support for a   solution, which has been American policy for years. However, he held out the prospect of a regional agreement. “Maybe there is even a chance for a bigger peace than just Israel and the Palestinians,” he said. “I would like to see a level of reasonableness of both parties and I think we have a good chance of doing that. ”'"}, "time": 1742563195.6477163}