{"duration": 0.12060141563415527, "input_args": {"text": "'Roger Daltrey, founder and lead singer of the English rock band The Who, reiterated his support for Britain’s independence from the European Union in an interview this week. [The United Kingdom officially filed to leave the European Union on Wednesday, and the   rocker says he supports Brexit because a “majority of this country felt that their voices weren’t being heard. ”  “We are getting out, and when the dust settles I think that it’ll be seen that it’s the right thing for this country to have done, that’s for sure,” Daltrey told NME. “I am not   but I am anti the present way we are being governed in Europe,” Daltrey explained “It’s got nothing to do with any of the immigration issues or any of that for me. It was to do with much more. The majority of this country felt that their voices weren’t being heard. It would have been nice to do a deal with Europe but they didn’t want to do a deal, and they sent Cameron back with a bag. ” He added: “I’m sad we voted how we voted, but I think we have to go with it now. This country will always be alright, I don’t worry about it. You know it’s going to be bumpy on the way —  we expected that the ones that voted to get out. But Iceland had it a bit bumpy when they went bankrupt, but oh not now. ” Daltrey previously expressed support for Brexit in May, saying the European Union was “set up by a bunch of crooks” and was “undemocratic” and “highly dysfunctional. ” When it comes to U. S. politics and the 2016 presidential election, the “My Generation” singer said he believes “a dead dog could have beaten” Democratic contender Hillary Clinton. “On other pieces of politics, let’s put it this way: when you say that middle America and the Democrats lost it, but Trump didn’t really win it because Democrats threw it away by putting [Hilary Clinton] up,” Daltrey told NME. “A dead dog would have won it against [her] look at that. ” The   also took a shot at Trump’s hair and language: “He needs it cut and as my mother would say, ‘wash your f*cking mouth out. ’”   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562534.397791}