{"duration": 0.11590313911437988, "input_args": {"text": "'RIO DE JANEIRO  —   Two American swimmers were pulled off their flight to the United States by the Brazilian authorities and detained for several hours on Wednesday night, Olympic officials said. It was the latest indication that the police were skeptical of the swimmers’ claims that they had been held up at gunpoint during the Rio Games. “We can confirm that Jack Conger and Gunnar Bentz were removed from their flight to the United States by Brazilian authorities,” a spokesman for the United States Olympic Committee said. “We are gathering further information. ” The men were released after agreeing to remain in the country and to speak with investigators about the episode on Thursday, according to officials with the United States Olympic team. In a case that has made headlines around the world, the gold medalist Ryan Lochte said that after leaving a party early Sunday, he, Mr. Conger, Mr. Bentz and one other American swimmer were robbed by men claiming to be police officers. The idea that such prominent athletes could be robbed by officers during the Olympics was a huge embarrassment for Brazil, underscoring longstanding concerns about holding the Games in a   city like Rio de Janeiro. But questions about the Americans’ testimony to the police turned that embarrassment into anger, with many Brazilians wondering whether the athletes had lied about the episode and smeared their country’s reputation. In a conversation on Wednesday with NBC’s Matt Lauer, Mr. Lochte  —   who has already returned to the United States  —   changed certain details of his account. After previously saying that an assailant had put a gun against his forehead, he said that the gun had been aimed in his “general direction. ” Mr. Lochte had also previously said that the swimmers had been robbed after the men identifying themselves as police officers pulled over their taxi. On Wednesday, however, he told NBC that the taxi had stopped at a gas station so they could use the bathroom. Mr. Lochte went on to say that the swimmers had been robbed upon returning to the taxi. He ascribed the inconsistencies to “traumatic mischaracterization” caused by stress. Mr. Lochte emphasized to Mr. Lauer that he considered himself as a victim. The episode has created a significant test for the newly collaborative relationship between American and Brazilian law enforcement officials. In the months leading up to the Olympics, the countries worked closely as they tried to improve Brazil’s ability to thwart a terrorist attack. But on Wednesday night, American officials seemed to be in the dark over the detention of Mr. Conger and Mr. Bentz. “We have seen media reports that two U. S. citizen athletes were detained,” said John Kirby, a State Department spokesman. “We stand ready to provide all appropriate consular assistance. ” Hours after the swimmers were removed from the plane, it was unclear where they were being held. When asked if United States Olympic officials knew where the American swimmers were, the U. S. O. C. spokesman, Patrick Sandusky, said, “At this point we are gathering details and have no further comment. ” Brazilian law enforcement officials have kept American diplomatic and law enforcement officials at arm’s length as they have moved forward with their investigation, according to senior American officials who spoke on the condition of anonymity because they did not want to be identified discussing a continuing Brazilian investigation. Earlier Wednesday, a Brazilian judge issued an order to prevent Mr. Lochte, a   Olympic medalist, and Jimmy Feigen, the fourth swimmer involved, from leaving the country as doubts emerged about their statements. Mr. Sandusky declined to comment when asked why United States Olympics officials had allowed Mr. Conger and Mr. Bentz to board a plane leaving Brazil despite the continuing investigation. Agents from Brazil’s Federal Police, an investigative force that oversees the country’s borders, detained Mr. Conger and Mr. Bentz at Rio de Janeiro’s main international airport, according to local news reports. Investigators from Rio’s Tourism Police had asked for their passports to be seized so they could be questioned. Shortly after they were removed from the plane, the two men were shown on the Globo television network being escorted to a police station in the airport. They declined to talk to a television reporter at the entrance to the station. Investigators have not found evidence corroborating the swimmers’ account, according to local news reports, prompting the judge’s order to seize their passports. “You can see the supposed victims arriving without signs of being physically or psychologically shaken, even joking amongst themselves,” Judge Keyla Blanc de Cnop said in a statement, referring to video of the swimmers returning to the Olympic Village after the party. The Brazilian authorities have come under scrutiny after a number of armed assaults during the Games, despite the deployment of an   security force to ease fears about violent crime. Mr. Sandusky said that the police had looked for the two swimmers on Wednesday, but that the athletes were no longer at the Olympic Village. “The swim team moved out of the village after their competition ended, so we were not able to make the athletes available,” Mr. Sandusky said. He added that the Olympic Committee’s security protocol prevented him from confirming the athletes’ current locations. Mr. Lochte’s lawyer, Jeff Ostrow, denied assertions that his client and the other swimmers might have fabricated details of their accounts, describing such claims as efforts by Brazilian officials to deflect criticism of problems in Rio. “The country has a dark cloud over it for a million and one reasons, from their economy to their crime to their management of the Olympics,” said Mr. Ostrow, who is based in Fort Lauderdale, Fla. “My client has cooperated thoroughly with the Brazilian authorities and stands behind his statement. ” Still, there was growing speculation in Brazil that the episode might not have unfolded as the swimmers described it. Mr. Lochte told NBC’s “Today” show that men had drawn guns and that one of them had taken his money and wallet, but left his cellphone and credentials. He also told USA Today that the swimmers did not initially tell the United States Olympic Committee about what had happened “because we were afraid we’d get into trouble. ” Mr. Lochte and Mr. Feigen told Brazilian investigators that they left the party at Club France, which was set up to promote the country during the Games, around 4 a. m. Sunday, according to local news reports. But video cameras showed the swimmers leaving the club at 5:50 a. m. about an hour before they arrived at the Olympic Village at 6:56 a. m. according to Extra, a Rio newspaper. There are other points of confusion in the accounts by Mr. Lochte and Mr. Feigen, the only swimmers who provided testimony to Brazilian investigators. The men, who said they had been intoxicated upon leaving the party, said they could not remember the color of the taxi they took, or where exactly the assault had taken place. Investigators have been unable to find the taxi driver who delivered the swimmers back to the village. A prosecutor in Rio, André Buonora, said in a statement that the swimmers could face charges of providing false testimony if they had lied to investigators. Despite the controversy, it is not uncommon for the police in Rio to be implicated in armed assaults. Shortly before the Olympics, Jason Lee, a jujitsu champion from New Zealand, said that he had been briefly kidnapped by police officers and forced to withdraw about $800 from his bank account. Despite a history of such episodes in Rio, many Brazilians have grown defensive over criticism of the city. Some lashed out at the American swimmers, contending that they were hiding something. “So the American swimmer lied about the robbery?” Mariana Godoy, a television news announcer, asked in a Twitter post. She implied that Lochte was trying to cover up something untoward. “He left one party and went to ‘another party’ and didn’t want to tell Mommy about it?” Ms. Godoy wrote.'"}, "time": 1742563491.487819}