{"duration": 0.06984925270080566, "input_args": {"text": "'A team of American chefs on Wednesday won the biennial Bocuse d’Or culinary competition  —   the equivalent of the Olympics for professional cooks  —   for the first time in the contest’s   history. In the finals in Lyon, France, a group of 10 chefs and helpers from the United States won the gold medal. Norway took the silver medal, and Iceland won the bronze. In 2015 an American team was awarded the silver medal in the competition, which was founded by the French chef Paul Bocuse. Teams from 24 countries competed this year. “I promised Monsieur Paul 10 years ago that we’d make it to the top of the podium,” said the chef Thomas Keller, who is the president of Team U. S. A. “We made it in nine. ” The team’s head chef was Mathew Peters, 33, from Meadville, Pa. who was most recently the executive   of Mr. Keller’s New York restaurant, Per Se. His commis, or helper, was Harrison Turone, 21, from Omaha, who also worked at Per Se. Both of the chefs took a year off to prepare for the contest, a fierce competition in which the American team is made up of younger chefs who can spare the time to train. Philip Tessier, a member of the team that won second place in 2015, was the Americans’ coach. This year the chefs were required to prepare a meat platter and a vegan dish in 5 hours 35 minutes. “We had to use two proteins, Bresse chicken and crayfish,” Mr. Peters said. “And this was the first year there was a vegan dish. ” The teams were required to interpret “Poulet de Bresse aux Écrevisses,” a Lyonnaise classic. The American version involved the chicken with morel mushroom sausage, braised wings, a wine glaze and sauce Américaine, a kind of lobster sauce. Alongside were a chicken liver quenelle with foie gras, corn custard,   peas and toasted pistachios, as well as lobster tail with Meyer lemon mousse. The garnishes included preparations using carrots, Vidalia onions, black truffles, carrots, peas and potatoes. They brought some of the ingredients from the United States. For the vegan dish, the chefs prepared California asparagus with cremini mushrooms, potatoes, a custard made of green almonds, Meyer lemon confit, a Bordelaise sauce and a crumble using an almond and vegetable yeast preparation that mimicked Parmesan cheese. The team arrived in Lyon 10 days ago. After the winners were announced at 7:25 p. m. local time, Mr. Peters, who had been cooking since 8:40 a. m. said his energy was starting to come back. An estimated 300 American supporters were in the hall to cheer the team. Unlike some teams, the Americans were supported only by commercial sponsors and contributions, with no government funding. “I don’t think our government knows who we are,” Mr. Keller said. Mr. Keller said he could not estimate how much participation in the contest cost. But he said that experience was essential. “We learned along the way,” he said. “Our win was built on the shoulders of a thousand people. ”'"}, "time": 1742562094.3693361}