{"duration": 1.4203901290893555, "input_args": {"text": "'Donald J. Trump addressed the massacre in Orlando, Fla. on Monday, one day after the deadliest mass shooting in American history, as part of a broader national security speech in Manchester, N. H. where he  also contrasted himself with Hillary Clinton. Here are the highlights from Mr. Trump’s speech: • Mr. Trump began his remarks saying he initially planned to focus on Hillary Clinton, “and all of the bad things and we all know what’s going on,” adding “especially how poor she’d do as president in these very, very troubled times of radical Islamic terrorism. ” He promised that speech would come “very, very soon. ” • Mr. Trump called for a moment of silence for the dead in Orlando, saying it was an attack against people and “an attack on the right of every single American to live in peace and safety. ” He continued, “We need to respond to this attack in America as one united people. ” • As his first policy proposal if elected president, Mr. Trump reiterated his plan to temporarily ban Muslim immigration. He said in particular that he would ban immigration from countries where terrorism was a threat. He said, referring to the assailant in Orlando, that “thousands and thousands of people, many of whom have the same thought process as this savage killer” are pouring into the country, and that the ban “will be lifted when and as a nation we are in a position to properly and perfectly screen these people coming into our country. ” • Even though he said at the top of his speech that it would not be about Mrs. Clinton, Mr. Trump criticized his likely opponent for her foreign policy, again sowing some conspiratorial bent on Mrs. Clinton’s grasp of the terror threat: “She has no clue in my opinion what radical Islam is, and she won’t speak honestly about it if she does, in fact, know. ” He quickly pivoted his criticism of Mrs. Clinton to the debate over gun laws, falsely saying she wants to abolish the Second Amendment, “leaving only the bad guys, terrorists with guns. ” He added: “Not gonna happen. ” • Mr. Trump repeatedly framed the threat of terrorism in the realm of immigration, claiming that there were “hundreds of thousands” of Muslim immigrants who are coming into the United States unscreened. (The United States does indeed have a screening process.) • Mr. Trump referred to himself as a better friend of women and the L. G. B. T. community than Hillary Clinton, referring to his immigration ban against Muslim immigrants as one against people “who reject our values. ” While it was notable how far Mr. Trump went in his efforts to embrace the L. G. B. T. community, often using inclusive pronouns like “our” and “we,” he remains opposed to   marriage. • Making blanket statements against an entire religion, Mr. Trump said that the Muslim community “know what’s going on” regarding terrorism, despite no evidence of that in the Orlando killings. He said the Muslim community had “to work with us. ” He added: “They knew the person in San Bernardino was bad. They have to turn them in. ” He was referring to the shooting in San Bernardino, Calif. last December when a Muslim couple shot and killed 14 people and wounded 22. • Mr. Trump concluded his remarks with a promise, if he were to be elected president, for a “safe society,” and he riffed on his campaign slogan: “We will make America rich again. We will make America safe again. We will make America great again. ” _____ Hillary Clinton  addressed the massacre in Orlando on Monday, during a speech in Cleveland where she outlined her broader plans to combat terrorism. Here are the highlights from Mrs. Clinton’s speech: • Mrs. Clinton, invoking a “nightmare that’s become   familiar,” said it was “not a day for politics. ” The shooter may be dead, she said, “but the virus that poisoned his mind remains very much alive. ” • Mrs. Clinton said that despite some progress in combating Islamic State forces on the ground in Iraq and Syria, the group would “seek to stage more attacks” wherever it could. She pledged to make the targeting of “lone wolves” a top priority as president. • Noting that the shooter in Orlando, Fla. had been on the F. B. I. ’s radar, Mrs. Clinton said the country required “more resources for this fight” and called for the removal of “weapons of war” from the streets. • Mrs. Clinton, noting the acrimonious national debate over guns, said everyone should be able to agree that “If the F. B. I. is watching you for suspected terrorist links, you shouldn’t be able to just go buy a gun. ” • Mrs. Clinton said it was “long past time” for the governments of Saudi Arabia, Qatar and Kuwait to stop allowing their citizens to finance extremists. • Mrs. Clinton, observing that the shooting targeted a gay nightclub, said that “an attack on any American is an attack on all Americans. ” Addressing gay Americans, she said, “You have millions of allies who will always have your back. And I am one of them. ” • Seeking to contrast her approach with the   impulses of Donald J. Trump, Mrs. Clinton said America was “not a land of winners and losers,” calling it “a country of ‘we,’ not ‘me. ’” • Mrs. Clinton called to mind the sense of national unity after the Sept. 11 attacks, reminding voters that President George W. Bush quickly “sent a message of unity and solidarity” to Muslims. “It is time to get back to the spirit of those days,” she said, “the spirit of  . ”'"}, "time": 1742563602.4861271}