{"duration": 0.1360487937927246, "input_args": {"text": "'\\nPosted by Lindsay Hayward | Nov 4, 2016 | Breaking News Hillary Clinton says Trump is “unstable” to be president and will start a nuclear war. \\nFormer president, Bill Clinton, allowed rangers to die in Somalia because he wouldn’t send air support. There were actually 4,417 military deaths from 1993-1996 alone under the reign of Clinton. He obviously rubbed off on his wife for not having any respect at all for our brave men and women in uniform. How to turn $12,000 in retirement savings into $1.3 Millon over the next 5 years.... Read More \\nHillary also denied air support to soldiers in Benghazi who died horrific deaths while she was Secretary of State. \\nAmbassador Chris Stevens was brutally beaten to death and murdered in Benghazi, his lifeless body dragged throughout streets of full-fledged violence, terrorists cheering and applauding. Secretary of State, Hillary Clinton and President Obama did nothing . \\nExcept for blame the tragedy on a video at the victims’ military funeral ceremony as their coffins crossed in front of the stage, where Hillary Clinton stood. \\nIt was a terrorist attack- the attack came in two separate waves, including suicide bombers. WikiLeaks confirms that Hillary told her daughter that she knew it was not because of ‘some video’. \\nSo, how else does Bill influence Hillary? Does he encourage her to lie because it’s what he personally does? Or does lying simply come naturally for her? \\nOver the past month, WikiLeaks has poured out incriminating evidence proving corruption within our liberal government. \\nThey’ve also released countless emails exposing the fraudulent activities tied to the Clinton Foundation, which is currently being investigated by the FBI. \\nWhat other shocking lies have been revealed about the Clintons by WikiLeaks? \\n“Instead of dark and divisive, it’s hopeful and inclusive. It’s big-hearted, not small-minded. It is about lifting people up, not putting them down,” Hillary Clinton stated in front of a “massive” crowd in Ohio, unveiled to be photo-shopped to include more people than were actually present by duplicating the ones that were already there. Hillary Clinton crowd in Ohio, photoshopping to make her rally look bigger \\n“It’s a vision that says, and I believe this with all my heart, we are stronger together.” Concludes former Secretary of State. \\nWords like “hopeful,””big-hearted,” and “lifting people up” are the same cliches she fed the people of Haiti. They bought what she was selling- Americans should not make this grave mistake. This will actually bring about the civil war she speaks of- instead of Haitian immigrants protesting in front of the Clinton Foundation office in NY, all Americans will be protesting in front of the White House in D.C.. \\nClinton warned that Trump could bring the nation to war “because of his unstable character,” which is hilarious. \\nAccording to Breitbart , “Clinton specifically referred to the Civil War, suggesting that the country faced a similar threat of divisiveness from Donald Trump.” \\nBreitbart continues, “Clinton warned that it would only take a few minutes of instability from Trump launching the United States into a full scale nuclear war.” \\nHow can she make a leader of another nation so distrusting of her after she sells them 20% of American uranium, aiding them in building the very nuclear technology she claims they will use? Putin hates her and she’s not even president! \\nHillary Clinton also said, “Abraham Lincoln understood a house divided against itself cannot stand, and that was over the greatest of challenges – the challenge posed by slavery – and we fought a civil war.” \\nCrooked Hillary Clinton doesn’t reserve the right to quote the great Abraham Lincoln. She is the one with the track record of inflicting people to slavery backed by her actions in Haiti. \\nShe is full of hypocrisy, her lack of character is exhausting from what’s been provided by WikiLeaks via her own email correspondence. But her own words are what incriminate her the most. \\n“It was called Hillarycare before Obamacare!” Then she claims she never supported Obamacare. \\n“Chelsea was jogging at the twin towers when they were hit.” No, Hillary, Chelsea was just at home, in bed, cited by you after people called you out for lying. Hillary Clinton is a pathological liar. \\nShe lies about everything, it’s in her nature. Hillary Clinton is a sociopath that lies for no apparent reason. \\nSpeaking of lies, WikiLeaks also proved that the women suddenly accusing Donald Trump of sexual misconduct were paid by the Clintons. \\nIt doesn’t take the support of deleted emails to show that women suddenly coming forward (against the only other candidate) with just weeks left until a huge election are obviously meant to shift attention away from the real issues of Hillary’s email server. \\nTrump has overcome lies and scandals perpetrated by Hillary Clinton, spewed by the mainstream media as well as our very own president and guess what? He has kept his cool. Donald J. Trump, American strength and integrity. \\nDonald Trump has overcome adversity throughout this presidential campaign and shown incredible strength in his character. He’s had to humbly address obvious lies and falsely organized scandals, media slander, biased-coverage, rape-allegations by women he met once and the list just keeps going. \\nNot once did President Donald Trump, I mean, republican presidential candidate, Donald Trump, get enraged and act like a looney. With everything thrown at him over the past few weeks, he has handled these vicious attacks swimmingly well. \\n“Imagine him in the Oval Office facing a real crisis,” she told her supporters. “Imagine him plunging us into a war because somebody got under his very thin skin.” \\nWe need a strong leader, one that is going to bring about change. We need someone who can remain calm when dealing with a crisis, not act petty or prioritize covering up corruption to saving lives. America needs Donald Trump as president. \\nHillary Clinton encourages our own people to fight with one another instead of come together. Vote for Donald Trump, let’s truly stand together as one, against the corruption Americans currently face. \\nIt’s time American citizens stopped sitting back, accepting another apology from Hillary Clinton for lying. We need to break up with her, not appoint her as leader of our nation. \\nLet’s truly make America great again. '"}, "time": 1742563538.4341645}