{"duration": 0.04773688316345215, "input_args": {"text": "'On April 28,  ’s Chris Cox lauded President Trump’s first 100 days for bolstering the Second Amendment and the exercise of the rights it protects. [Writing in USA Today, Cox pointed to the nomination and confirmation of Judge Neil Gorsuch to the Supreme Court, Jeff Sessions to attorney general, and Ryan Zinke to secretary of the Interior.  The confirmation of Gorsuch means that “we are now back to having a     majority on the U. S. Supreme Court” and upholding the crucial decision in District of Columbia v Heller (2008). Sessions’ confirmation means “the Department of Justice will return to focusing on prosecuting violent criminals instead of targeting   gun owners. ” And the confirmation of Zinke as secretary of the Interior means “hunting and shooting” opportunities on our public lands will be protected. In addition to these nominations and confirmations, Cox points out that Trump has repealed Obama’s Social Security gun ban, a ban which would have allowed the Social Security Administration to strip elderly beneficiaries of their Second Amendment rights without due process. Cox pointed out that more must be done. For example, the gun ban for military veterans needs to be repealed, national reciprocity for concealed carry needs to become law, and firearm suppressors need to be deregulated via the Hearing Protection Act. Yet the   successes of Trump’s first 100 days suggest the remaining   Amendment proposals will also succeed. Cox wrote, “After eight long years, we once again have a president who respects and cherishes individual freedom. For America’s   gun owners, the Trump administration is proving to be among the best in history. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742562982.5566976}