{"duration": 0.0819547176361084, "input_args": {"text": "'The CEO of the trade association for American fashion designers says supporting Planned Parenthood is a “civic responsibility,” since the abortion business faces the possible elimination of its taxpayer funding. [The Council of Fashion Designers of America (CFDA) is launching a collaboration with Planned Parenthood and a campaign to raise awareness of and support for the abortion industry giant with a pink pin that states, “Fashion Stands with Planned Parenthood”:  Fashion stands with @PPFA! Check out https:  .  for the full story on our new exciting partnership. #IStandWithPP pic. twitter.   —   CFDA (@CFDA) February 6, 2017,  The pins were designed by The Creative Group, Condé Nast, and will be distributed throughout the industry in time for New York Fashion Week, which begins Thursday, says CFDA. Steven Kolb, CFDA president and CEO,  said supporting Planned Parenthood is a “civic responsibility. ” “Defunding Planned Parenthood will impact millions of Americans,” he added. “We will raise awareness and support this fashion week and show that Fashion Stands with Planned Parenthood. ” According to CFDA, more than 40 designers and brands are participating in the campaign, “including Diane von Furstenberg, Carolina Herrera, Cushnie et Ochs, Public School, Jonathan Simkhai, kate spade new york, Rosetta Getty, Proenza Schouler, Mara Hoffman, Narciso Rodriguez, Milly, Prabal Gurung, Tory Burch, and Zac Posen. ” “We are truly thrilled by the Council of Fashion Designers of America’s show of support for Planned Parenthood at New York Fashion Week,” said Planned Parenthood President Cecile Richards in response. “Planned Parenthood has stood defiantly in the face of opposition for a century, and we’re not backing down now. ” “The American people overwhelmingly support our organization and strongly oppose ‘defunding’ care at our health centers,” she continued. “Planned Parenthood’s millions of supporters, including the CFDA, are mobilizing to protect access to reproductive health and rights for everyone, including the 2. 5 million patients we serve, and we will continue to fight to ensure that all people can get the care they need. ” However, a recent Marist poll found that 61 percent of Americans oppose taxpayer funding of abortion, including 40 percent of those who say they are “” and 41 percent of Democrats. The House recently approved the No Taxpayer Funding for Abortion and Abortion Insurance Full Disclosure Act, a measure that would permanently prohibit taxpayer dollars from being used to fund abortions and would make the Hyde Amendment permanent across all federal expenditures. “House passage of this legislation is the first step towards fulfilling a promise made by President Trump to keep taxpayers out of the abortion business,” said   Susan B. Anthony President Marjorie Dannenfelser. “He and his administration are working for the American people, not the abortion lobby. We urge the U. S. Senate to follow suit so that this bill can get to President Trump’s desk as soon as possible. ” According to NYMag. com, CFDA board member Tracy Reese said, “So many people stand with Planned Parenthood  —   including designers and entertainers  —   because they and their loved ones have relied on Planned Parenthood for health care, including   care like cancer screenings, birth control, STI testing and treatment and sex education. ” “Planned Parenthood is often the only option for this type of care in underserved communities,” she added. “By creating a visually engaging and fashionable pin, we hope to create an organic social media movement promoting awareness and education. ” Planned Parenthood, however, does not provide mammograms, and in  a new video series,   group Live Action is challenging the abortion business’s claim that it provides “  care. ” Live Action’s investigators seeking “  care” contacted 97 Planned Parenthood clinics across the country and were told at 92 of them that “  services” were not available. Similarly, investigators discovered that Planned Parenthood staff members admitted ultrasounds are only done prior to abortions and not for   care. “The reality is Planned Parenthood’s focus for pregnant women is abortion,” Live Action President Lila Rose said at a press conference on Capitol Hill Thursday. “It’s not   care. It’s not serving young mothers, promoting them, supporting them it’s abortion. ”   leaders and members of Congress also point out that federally qualified healthcare centers (FQHCs) provide more comprehensive medical and family planning services than Planned Parenthood to   women and families. Nationally, there are 13, 000 FQHCs  —   a figure that outnumbers Planned Parenthood facilities by 20 to 1. Republicans plan to redirect Planned Parenthood’s taxpayer funding to these thousands of other health centers that do not provide abortion. Planned Parenthood receives more than a   dollars in taxpayer funding annually and performs an excess of 300, 000 abortions per year.'"}, "time": 1742561725.14639}