{"duration": 0.03097081184387207, "input_args": {"text": "'By Lisa Brown\\nGood morning beautiful light family!\\nStargates are active and we have Quickening occurring too. These “shake” the density realms and align all to the light realms.\\nThese align Galactic/Heaven and Earth…. synchronizing realities to higher consciousness ones.\\nSo many experiencing the physicalness of their own separation/unconsciousness, without realizing what is truly occurring now. All when it’s time…. when the heart opens, as one takes their power back, truly opens up fully…..\\nThose unconscious programs run on a loop cycle, where the human aspect has much to “learn” about SOUL EXISTENCE and living as an ASCENDED BEING here.\\nThe entire external reality teaches us…. IT is our teacher, along with our higher self aspect until we integrate this inside.\\nThere is a process…. first you realize you have a higher self, then you open up to listening to it, then you let it tell you what to do/Guide you…. in every moment… then you become them (They) and THEY dissappear because you ARE THEM…. No more channeling, no more anyone to ask…. You work together, inside, with/AS the entire Universe…. no more separation….\\nYOU must achieve UNITY CONSCIOUSNESS within you. You don’t need the Universe to push you to step up, YOU STEP UP….. you observe your own humanness, you dissolve/resolve all within you, back into the PURITY of Love……\\nYOU observe, you see your own patterns and themes. Where you slack, come from lack, where you are holding back, where you judge, don’t support, share, give back, procrastinate and have fear. You see every time you don’t, when you had/have the capability, you see… what you couldn’t before….. you see the ENERGY that you hold that created/creates that…. and that this is all on you to shift/change/transform/do……\\nWE don’t need lessons anymore, because we are always observing, realizing, shifting, changing, transforming, tuning our own energy intentionally to SOURCE CONSCIOUSNESS and holding this inside at ALL TIMES…. We don’t allow ourselves to separate off anymore to go human…….\\nYou are the one that births NEW EARTH from inside of you and holds all in place. You hold the programming for every reality by what you believe, allow, transmit, do/don’t do… not from your head, but from your fully conscious higher-heart-mind. You don’t get to blame others or be a victim anymore. That scary (fear) for humans. Stepping up and taking responsibility for everything …\\nYour true power is within you. It’s when you STOP allowing/continuing the old programs yourself. You have to see them first. You break the patterns….\\nYou are here to inspire, support, honor, REMEMBER…… Open up fully. Step up fully. Into your SOUL’s roles….. Your human will always shortchange you……\\nI love you!\\nLisa Transcendence Brown\\nAwakening to Remember \\nVia: In5D \\n'"}, "time": 1742628401.5633423}