{"duration": 0.023962736129760742, "input_args": {"text": "'In an exit memorandum reflecting on eight years of United States foreign policy, Secretary of State John Kerry enumerated the Obama administration’s diplomatic accomplishments. But that record may be weakened or overturned by   Donald J. Trump, who has denigrated many of President Obama’s policies. Here is a look at how the secretary and the   see the major foreign policy issues differently. Kerry: Mr. Kerry praised the 2015 deal that the United States brokered with Iran to curtail that country’s ability to produce nuclear weapons. Mr. Kerry wrote that before the deal was struck, Iran was less than “90 days away from having the material necessary to produce one nuclear weapon,” but “today they are at least a year away. ” He wrote on Thursday, “In reaching and implementing this deal, we took a major security threat off the table without firing a single shot. ” Trump: Mr. Trump made criticism of the nuclear deal a major talking point of his foreign policy in the presidential campaign. He has called the agreement “the worst deal ever negotiated. ” At a speech to the American Israel Public Affairs Committee in March, he said, “My No. 1 priority is to dismantle the disastrous deal with Iran. ” Later, he said he would renegotiate the agreement. Kerry: The secretary said that the United States tried to reset relations with Russia early in President Obama’s first term, but that a series of aggressions including “unprecedented cyber intrusions,” “military intervention in Syria,” and the “illegal occupation” of Ukraine impeded that effort. Trump: Mr. Trump has made improved relations with President Vladimir V. Putin of Russia a cornerstone of his future foreign policy. After American intelligence agencies provided evidence that Russians hacked Democratic National Committee systems to help tip the election in his favor, Mr. Trump criticized the reliability of the intelligence community. He has praised Mr. Putin and said he would work closely with him to combat the Islamic State. Mr. Trump also seemed to upend American nuclear weapons policy when he declared in December: “Let it be an arms race. We will outmatch them at every pass and outlast them all. ” Kerry: Mr. Kerry devoted a significant portion of his memo to climate change, calling it “not just a threat to the future of our planet, but a growing and immediate threat to our national security. ” He lauded an agreement struck between President Obama and President Xi Jinping of China, which bolstered a global climate agreement reached in Paris in 2015 that he called the most “ambitious, inclusive climate agreement ever negotiated. ” Trump: Mr. Trump has called climate change a “hoax,” said he would “cancel” the Paris accords and vowed to dismantle the Environmental Protection Agency “in almost every form. ” His nominee to run that agency is Scott Pruitt, the Oklahoma attorney general and a close ally of the fossil fuel industry, who has led the legal battle against Mr. Obama’s   policies. Kerry: Though the Obama administration never fulfilled a promise to shutter the Guantánamo Bay detention center, Mr. Kerry wrote that ”no single action would do more to reaffirm our commitment to international human rights norms and remove a recruiting tool for terrorists than closing” the site. During Mr. Obama’s presidency, the number of detainees decreased to 59 from 242, with 20 approved for transfer. Trump: In a message posted to Twitter on Tuesday, Mr. Trump wrote: “There should be no further releases from Gitmo. These are extremely dangerous people and should not be allowed back onto the battlefield. ” Kerry: “It would be a moral failing of the highest caliber to turn our backs on those in need  —   including and especially from countries like Syria and Iraq,” Mr. Kerry wrote, adding that the United States had a “profound responsibility to help refugees. ” Trump: After the terrorist attack in San Bernardino, Calif. in December 2015, Mr. Trump called for “a total and complete shutdown of Muslims entering the United States. ” Later in the campaign, he said: “We must suspend immigration from regions linked with terrorism until a proven vetting method is in place. ”'"}, "time": 1742628579.9613647}