{"duration": 0.12786054611206055, "input_args": {"text": "'‘The Great Barrier Reef is dying’ claims the Washington Post. [This is classic fake news.  Like the thriving polar bear, like the recovering ice caps, like the    Pacific islands, the Great Barrier Reef has become a totem for the   not because it’s in any kind of danger but because it’s big and famous and photogenic and lots and lots of people would be really sad if it disappeared. But it’s not going to disappear. That’s just a #fakefakenews lie designed to promote the climate alarmist agenda. The annoying thing is, though, whenever I write another piece like this one  —   Shock Study: Australia’s Great Barrier Reef Doing Just Fine  —   I get besieged by greenies on Twitter telling me what an evil denier I am. Meet, for example, my nemesis Tripp Funderburk. @JamesDelingpole You ignore science and tweet lies. 100’s of miles of GBR died due to excessive heat. Shame on you. https:  .   —   Tripp Funderburk (@trippfunderburk) December 2, 2016,  Yes, if he didn’t exist you’d have to invent him. Tripp Funderburk describes himself as “a Duke football fan. Lover of coral reefs. Advocate for climate change solutions. ” There’s a big clue to where he’s coming from ideologically in that last sentence. Even so, it would be a mistake to dismiss him as just a random   with a funny name. As Tripp Funderburk thinks, so does pretty much everyone else in the entire    universe. “Is the Great Barrier Reef dying due to climate change caused by man’s selfishness and greed? I’ll lay money that if you asked this question to your kids’ biology teacher or to Bill Nye the Junk Science Guy or to that nice Richard Osman off Pointless or to Matt Damon or anyone else who would have voted for Hillary Clinton or to any Labour (and a good many Conservative) politicians or anyone who works for the ABC in Australia, the BBC, the Guardian, MSNBC, CNN and the New York Times or comedy Senator Al Franken or  Myles Allen, Professor of Geosystem science at Oxford University or pretty much any other science prof from Oxford, Cambridge, Harvard or Yale or any marine biologist or a lawyer from a big City law firm or anyone who voted Remain in the EU Referendum, you’d get the same answer: “Yes. ” How do they know? Have they been out there personally  —   as I have  —   to check? No, of course not. The reason all these people believe the Great Barrier Reef is dying is because they all get their fake news from the same    echo chamber. If you want to get the real facts, you have to seek them out at places like Jo Nova. In a nutshell: a governmment funded group finds some bleached coral on the Great Barrier Reef, and repackages the stats to come up with the apocalyptic statistic that only 7% of the reef is not bleached!  The SMH reported that “93% of the corals” are damaged. The reef is 2, 000 kilometers long. Did anyone really think about these headlines? Then in a development that “no one” could see coming, local tourism is damaged, potentially costing a lot of jobs. “And the loss of these tourists could cost our tourism industry a whopping $1 billion a year, a report out today by The Australia Institute warned. ” Or listen to honest experts like Professor Peter Ridd, a marine geophysicist from Australia’s James Cook University, who last year tried to blow the whistle on Great Barrier Reef fake news. Instead of being applauded for his integrity, he was censured in a kangaroo court orchestrated by his alarmist colleagues, and found guilty of “failing to act in a collegial way and in the academic spirit of the institution”. As Ridd told The Bolt Report: “We have got to the point where a large fraction of the science we see cannot be relied upon. ” I wonder if this applies to the dozens of names attached to the latest Nature study entitled Global Warming And The Recurrent Mass Bleaching of Corals? They’ve got earn a living somehow. And it always helps when your study summary concludes with the   line: “Consequently, immediate global action to curb future warming is essential to secure a future for coral reefs. ” Yes, of course. However could anyone dare think otherwise?'"}, "time": 1742562596.3125887}