{"duration": 1.5298521518707275, "input_args": {"text": "'Please read Introduction, Part IA and I B before this chapter. \\nThe Horn of Africa has the second most globally geostrategic location on the continent behind North Africa, straddling the commercially vital Red Sea and providing international access to the world’s fastest-growing economy of Ethiopia. In this sense, the coastal states acquire a dual maritime and mainland importance through which their territories can be simultaneously used to exert influence along the waterway and the regional interior. Furthermore, as it relates to the Red Sea, this body of water occupies a crucial role in China’s grand strategy because it serves as the most geographically convenient route for facilitating the transit of goods between the East Asian state and the EU, which is particularly expected to climb with the completion of the Balkan Silk Road in a few years’ time. Due to the importance that China places on the One Belt One Road grand strategy and the need that it has for maintaining and strengthening its overseas markets (especially the large and ever-promising EU one) in order to sustain domestic stability and long-term growth, it logically has an inherent interest in preserving stability in the Horn of Africa so as to safeguard its Sea Line of Communication (SLOC) to Europe. For similar reasons, it also wants to tap into the allied Ethiopian economy and assist in the maximization of its potential so as to acquire a strategic presence there that allows it to deepen its presence further inland into the continent’s resource-rich interior. \\nIt should be no surprise then that the Horn of Africa is the focal point of international military attention, as evidenced by the previous part of the research which described the vast array of foreign non-African military bases in Djibouti, the recent GCC presence in Eritrea, and the Turkish and Emirati plans for building a base in Somalia. Quite naturally and in accordance with its obvious interests, China is opening its first overseas military base in Djibouti in order take advantage of the country’s dual role in exercising maritime and mainland influence. It’s clear how and why the tiny coastal state can be used by Beijing for flexing its maritime muscles, but it’s less obvious how it plans to do this in the opposite mainland direction. It’s therefore relevant to recall the Ethiopia-Djibouti Railway that China is building between the coastal city and the inland capital, since this large-scale infrastructure project will serve as the umbilical cord between the Chinese and Ethiopian economies and also allow the later to finally and reliably access the global market in general. Moreover, the connective vision that China is pursuing is complemented by the Kenyan-originating LAPSSET project that it’s also helping to finance , which eventually plans to connect Addis Ababa with the Indian Ocean port of Lamu by rail . Suffice to say, the completion of both transnational railways and the Djibouti-based military facility will catapult China into being the most influential country in the Horn of Africa region, although this seemingly inevitable reality will expectedly be opposed by the US using the methods of Hybrid War. \\nThis part of the research therefore endeavors to explain all of the ways in which the US could apply Hybrid War strategy in order to conceivably offset China’s grand designs in the Horn of Africa region. It begins by offering a general overview of regional relations that sets the appropriate context for deeper analysis. After having established the state of affairs and provided a solid understanding of each examined countries’ interactions with the other, the second portion of the work then delves into a summary of these states’ strategic situations, focusing primarily on their most influential determinants. Finally, the last part of the regional study looks at the most realistic Hybrid War scenarios that the US could possibly provoke against China’s Horn of Africa interests. Thorny Relations In The Horn \\nThe four states that occupy the Horn of Africa region – Eritrea, Ethiopia, Djibouti, and Somalia – don’t all have pristine relations with one another, with the most obvious problems being between Eritrea & Somalia on one side and Ethiopia on the other. \\nEthiopia-Eritrea \\nTo explain the reason behind the abysmal relations between these two states, it’s necessary to begin by talking about Eritrea’s bloody three-decade-long secessionist war against Ethiopia which only ended in 1993. The roots of the conflict are many, but they can be summarized as starting during the imperial period when the Kingdom of Italy annexed Eritrea from the larger civilization-state of Abyssinia in 1890, thenceforth giving it a sense of identity separateness from Ethiopia and planting the seeds for future conflict after the two entities were reunified following the end of World War II. Addis Ababa’s unilateral 1962 abolishment of the ten-year-old Federation of Ethiopia and Eritrea sparked the separatist war that raged throughout the proceeding decades, and even after independence, the two countries remained at tense odds with one another over the expectation that there would eventually be a continuation war sometime in the future. \\nThis came to pass from 1998-2000, and despite ending in what has been described as a lingering stalemate , it killed over one hundred thousand people and undermined the economic development potential of these two dramatically impoverished states. In the years since, Ethiopia and Eritrea have still remained each other’s primary nemesis, with the two sides regularly accusing the other of attempting to subvert its stability and supporting various anti-government forces. Just like in the immediate years after independence, there still exists the very real possibility today that the two countries will go to war with one another at a moment’s notice, and this atmosphere of heightened militant tension is the most destabilizing interstate factor in the Horn of Africa. In fact, it will later be argued that this situation is being exploited by the out-of-regional powers inside the GCC as a means of acquiring leverage over Ethiopia and potentially pushing Eritrea into instigating a renewed round of debilitating violence. \\nEthiopia-Somalia \\nAlthough not as bad as its ties with Eritrea, Ethiopia’s relations with Somalia are objectively pretty poor. Granted, on the surface of things there is positive and pragmatic interaction between both states at the government-to-government level, but the primary issue between them has always been the enticing idea of “Greater Somalia” that has captivated some Somalians on both sides of the border and even led to the Ogaden War between 1977-1978. This conflict is notable as being the last conventional attempt to create “Greater Somalia” and also as being the only time when the Soviets and Americans switched sides during a proxy war. The issue was over the status of Somalians in Ethiopia’s sparsely populated eastern region which has now been revealed to be rich i n oil and natural gas deposits, with Addis Ababa claiming that this is an integral part of Ethiopia’s territory and a native people to the multiethnic country while Mogadishu and Somalian nationalists assert that it’s an occupied region whose people must be united with their namesake nation-state. While Somalia has no realistic means of ever reattempting another Ogaden land grab anytime again in the foreseeable future, the appeal of Somalian nationalism is dangerous for Ethiopia and can easily be used by the US and others in order to engineer destabilization inside of Africa’s second-most populous country. \\nComplicating matters even further is Ethiopia’s 2006 anti-terrorist intervention in Somalia which aimed to overthrow the extremist Islamic Courts Union (ICU) that had seized control of most of the country. Covertly supported and egged on by the US, Ethiopia invaded its neighbor and succeeded in expelling the militia from the capital, however its subsequent three-year occupation of the country generated a lot of hostility against it and led to a surge in Somalian nationalism. This in turn was taken advantage of by Al Shabaab, an Al Qaeda- and Daesh-linked terrorist group that grew out of the ICU’s youth wing, which blended anti-Ethiopian sentiment, Somalian nationalism, and Islamic extremism in creating a lethal cocktail of hate that has made the group one of the most feared in all of Africa. The Somalian government’s inability to appropriately combat Al Shabaab and the sympathy that misguided Somalians (especially the youth) have to the organization’s twisted message has made it a major regional threat which has the very real potential of actively causing chaos inside of Ethiopia’s Somali Region (formerly called Ogaden). In response, the authorities have been compelled to implement harsh security measures as an anti-terrorist precaution to any Daesh-like attempts to create a transnational territorially administered “Islamic State” within the region, though this has had the inadvertent effect of drawing the ire of some Somali locals and cyclically leading to the same type of anti-government attitudes that Addis Ababa has sought to avoid. \\nEthiopia-Djibouti \\nPerhaps the most fruitful and positive relationship in the region is between Ethiopia and its northern Djiboutian neighbor. Demographically and geographically mismatched, the two are inherently tied to one another due to regional circumstances. Ethiopia lost all of its coastal territory with Eritrea’s independence and thereafter became a landlocked state, and the sky-high tensions between it and its former province have precluded any possibility of pragmatic economic cooperation. Similarly, because of the anarchic instability and terrorist threat in Somalia, Ethiopia has been unable to use its territory in acquiring reliable access to the sea (although it has made some positive steps in this direction with the autonomous self-proclaimed and de-facto independent state of Somaliland via the port of Berbera). For the most part, Ethiopia’s economic potential was bottled up inside the Horn of Africa interior and unable to reach the global markets, but China’s visionary and proactive initiative in building the Ethiopia-Djibouti railroad changed all of that. The project essentially turned Djibouti into the ‘cork’ which controls the flow of economic riches into the Ethiopian ‘bottle’, making it a literal bottleneck state in pivotally opening up the massive economic possibilities of its southern neighbor. \\nAlong the same lines, however, this breakthrough infrastructure development means the tiny country is disproportionately important to Ethiopia and can be used indirectly as a means of destabilizing the much larger and expanding economy of former Abyssinia. Domestic disturbances such as Color Revolution unrest or possible Afar separatism in Djibouti could disrupt access to the railroad and indefinitely cut Ethiopia and its partners off from one another, thus making it totally dependent on the LAPSSET corridor to its south which runs through Oromo-populated territory and could quickly become a tantalizing target for ethnic-affiliated rebel and terrorist groups. With this in mind, it becomes even more apparent why China chose Djibouti as the location of its first overseas military base, since it’s substantially easier to exert positive influence on small Djibouti in safeguarding the viability of its prized railroad investment than in doing so inside of Kenya or anywhere else, and plus, there’s of course the added maritime advantage in being located on the Red Sea. As for how China could predictably protect its railroad, it might either employ the direct use of its military as hinted at in its first-ever 2015 white paper on military strategy in order to protect its foreign interests, or it could end up utilizing private military corporations (PMCs) to indirectly do this instead. \\nThe bottom line is that Djiboutian stability is absolutely integral for Ethiopia’s strategic security, and it’s for this reason that bilateral relations are extraordinarily close and will foreseeably remain so for the future. Djibouti benefits from this relationship by profiting off of its transit state status in facilitating access to and from the Ethiopian economy, so it has a vested self-interest in protecting the railroad as well. Therefore, it’s expected that it would use its military forces to safeguard the line in the event of any domestic troubles, likely applying the training that they acquired from their Chinese counterparts inside the country and probably even doing so under the supervision of Chinese advisors as well. By functioning as Ethiopia’s critical link to the outside world, Djibouti could also end up being targeted by Eritrea or by Somalian-based terrorist groups as a means of indirectly offsetting the regional hegemon, so this is of course a factor that must be considered. \\nEritrea-Djibouti \\nIn reference to the previous, Eritrea does not have positive relations with Djibouti and actually fought a brief border war with its neighbor in 2008. As per UN agreement, Qatar has deployed its troops to both countries in order to mediate the conflict and has remained in the region since 2010, presenting another factor of instability vis-à-vis Ethiopia which will be discussed later on. To continue with the state of bilateral relations between the two coastal countries, it’s worthwhile to also mention that Eritrea has actually had problems with all of its neighbors, and this includes Sudan and Yemen (the latter via the Hanish Islands conflict ), which together demonstrates a distinct pattern of Eritrean behavior. Therefore, the 2008 conflict with Djibouti mustn’t be seen in isolation, but rather as a continuation of long-standing Eritrean policy which regularly resorts to militant means to achieve its goals. It can’t be discounted that Qatar and Eritrea might conspire together in supporting Al Shabaab attacks inside of Djibouti in order to inflict strategic harm on Ethiopia, since not only has the Gulf state been convincingly linked to the terrorist organization, but Eritrea is actually under UNSC sanctions for allegedly aiding it in the past (although the latest findings indicate that this relationship may no longer be in effect). Therefore, Eritrea’s relations with Djibouti absolutely must be seen in the prism of its regional proxy war with Ethiopia which conceptualizes the neighboring state between them as a potential asymmetrical battleground. \\nDjibouti-Somalia \\nOn the other side of things, Djibouti’s relations with Somalia are warm and friendly, despite Mogadishu having no de-facto control over the bordering region with the autonomous and self-proclaimed independent state of Somaliland. While there isn’t anything substantial to speak of in this regard, it’s worthwhile mentioning the latent threat that non-state-actor-promoted militant Somali nationalism might pose to Djibouti (including the perverted version espoused by Al Shabaab). The country is mostly populated by the Issa clan, which itself is regarded as a subsect of the Somalis and thus places them within the within the purview of “Greater Somalia”. While this ideal may have had some sway in the Cold War-era past and in the years before and immediately after the former French Somaliland’s independence, it no longer has much of an appeal in Djibouti after Somalia descended into failed state status in 1991, although that isn’t to say that there might not be some people who are still attracted to the romanticized version of this ideology. What’s most threatening, however, isn’t the possibility of passively sympathetic Djiboutians supporting “Greater Somalia” slogans, but Al Shabaab and other terrorist groups violently targeting the country’s nationals and infrastructure projects in order to ostensibly support this vision. \\nThe varied deployment of so many international non-African military forces in Djibouti makes it unlikely that the terrorists would succeed in inflicting long-term harm to the country or the Ethiopia-Djibouti railroad, but their extremist ideology and willingness to die for their cause makes them very dangerous and leads to the impossibility of discounting this scenario. Still, the relatively better policed and more closely administrated Somaliland region serves as a stop gap in inhibiting Al Shabaab’s direct movement to Djibouti, although it’s of course possible that the organization could infiltrate its coastal target through more conventional means such as covertly entering it by means of the world-famous port and under an assumed cover instead of illegally sneaking across the international border. In any case, the only relevant factor of Djiboutian-Somalian affairs that’s applicable to the Hybrid War research is Al Shabaab and the ideology of “Greater Somalia”, neither of which are promoted at the state level but both of which could lead to serious problems for the targeted country. For this reason, the Djibouti-Somalia axis is the least relevant factor in the Horn of Africa’s regional political arrangement, at least on the official level, although it does have the potential to unconventionally become a major destabilizing issue in the future among certain non-state actors. \\nEritrea-Somalia \\nJust like Eritrea views Djibouti, it also holds the same proxy battleground mentality for Somalia as well. If the UNSC’s suspicions about Eritrea’s support of Al Shabaab are to be believed, then it’s clear to see that Asmara is simply employing whatever tool it can get its hands on in order to destabilize Addis Ababa. Whether reckless or justified depending on one’s political disposition, it’s unmistakable that Eritrea’s burning hate for Ethiopia has spread the proxy conflict between them from the joint border all the way to the Somalian frontier, thereby engulfing the region in this turmoil and turning their rivalry into the single most important driver of the Horn of Africa’s geopolitical destabilizations. It’s likely that the Eritrean leadership is no longer as close to Al Shabaab as it was suspected of being before, partly due to increased international stigma and awareness of this relationship, but that doesn’t remove the fact that Asmara may have played a key role in the group’s early development and consequently makes the country responsible to an extent for the organization’s present existence and violent rise. \\nAccordingly, the only logical way to view Eritrean-Somalian relations is through the prism of the greater Eritrean-Ethiopian proxy war in the region and the relative benefit that each respective actor gets from Somalia’s stability or insecurity. With that being considered, it can be argued that Eritrea benefits more from Somalia’s instability and the prevalence of militant non-state actors there (including Islamic-affiliated terrorists and “Greater Somalia” nationalists) than it does if normalcy were to return to the country. The arrival of stability would preclude Somalian territory from ever again being used by Eritrea as an asymmetrical springboard against Ethiopia, and it would correspondingly limit Asmara’s strategic flexibility in dealing with its larger and better equipped rival. Since Somalia is gradually becoming more stabilized over the past couple of years, Eritrea’s strategy might shift from allegedly working with terrorist groups to harnessing its new yet unofficial GCC military partnership in order to make inroads with the autonomous and self-proclaimed de-facto independent state of Somaliland. The strategic fusion of Eritrean and GCC capabilities on Ethiopia’s northeastern border might portend a more concerted destabilization sometime in the future, whether of an Islamic terrorist, “Greater Somalian”, or blended nature thereof. \\nTo be continued… \\nAndrew Korybko is the American political commentator currently working for the Sputnik agency. He is the author of the monograph “ Hybrid Wars: The Indirect Adaptive Approach To Regime Change ” (2015). This text will be included into his forthcoming book on the theory of Hybrid Warfare. \\nPREVIOUS CHAPTERS:'"}, "time": 1742564441.4541776}