{"duration": 0.12570929527282715, "input_args": {"text": "' (Want to get this briefing by email? Here’s the  .) Good morning. Here’s what you need to know: • Trump and taxes. The Times obtained documents that show that Donald J. Trump avoided reporting hundreds of millions of dollars in taxable income in the early 1990s by using a maneuver that his lawyers warned would most likely be deemed improper by an I. R. S. audit. “Whatever loophole existed was not ‘exploited’ here, but stretched beyond any recognition,” said one of the tax experts who reviewed the documents. Here’s how Mr. Trump structured his companies to gain personal tax advantages. • Clinton and emails. The F. B. I. is using a special computer program to see if recently discovered emails belonging to a top aide to Hillary Clinton contained classified information. The software should show whether the messages were already examined during the inquiry into Mrs. Clinton’s private server, officials said. James B. Comey’s decision to start the new review so close to Election Day has led some historians to draw parallels between the F. B. I. director and an infamous predecessor: J. Edgar Hoover, who ordered the bureau to wiretap the Rev. Dr. Martin Luther King Jr. • Interview with Bashar  . The Syrian president rejected any personal responsibility for the war raging in his country, and placed all the blame on the U. S. and on Islamic militants, during a recent interview with our reporter. Mr. Assad also said he will remain in office until at least 2021, when his third   term ends. • North Dakota oil pipeline protests. Demonstrators in the monthslong fight against the $3. 7 billion Dakota Access project say it will threaten water supplies, and members of the Standing Rock Sioux Tribe say it violates their right to sacred land. The protests have led to numerous clashes with local law enforcement. We interviewed a protester and a sheriff’s deputy to explore both sides of the debate. • Pope attempts to heal religious rift. Pope Francis was in Sweden on Monday to observe the 499th anniversary of Martin Luther’s protest of the sale of indulgences, which set off more than a century of religious warfare and forever changed the practice of Christianity. The pope noted the positive impact of Luther’s actions on Catholicism. “The Protestant Reformation helped give greater centrality to sacred Scripture in the church’s life,” he said. • Physical triumphs. “Having something foreign in my body after a cancer diagnosis is the last thing I wanted,” said Debbie Bowers, a breast cancer survivor. “I just wanted to heal. ” She is one of a growing number of women “going flat” rather than having additional surgery to reconstruct their breasts. Separately, we spent time with competitors in a megatriathlon race that requires 703 miles of swimming, biking and running over five days. “This is not good for my body,” one participant said, “but it is good for my soul. ” • The yogurt company Chobani and its founder, Hamdi Ulukaya, have been criticized for hiring refugees and are being targeted by racist attacks on social media. “He’s the xenophobe’s nightmare,” the executive director of Human Rights Watch said. “Here’s an immigrant who isn’t competing for jobs, but is creating jobs big time. ” • The tech billionaire Peter Thiel defended his support of Mr. Trump in a speech on Monday, and said that Silicon Valley was out of touch with most of the country. “I think the truth has been more one of specific success but more general failure,” he said, suggesting that the tech industry had not done much for people outside of Silicon Valley. • What happens to all the leftover Halloween candy? Buyback programs and donation drives for charities help absorb the surplus. • U. S. stocks were slightly down on Monday. Here’s a snapshot of global markets. • Be transported. We’re introducing a series of immersive 360 videos that let you experience Times journalism in a powerful new way. The first offers a rare glimpse of   Yemen after a deadly airstrike. Watch it here. • New to read. The ranks of the literary detective are getting a new member. His name is Isaiah Quintabe (the book is titled “IQ”) and he’s from the same part of Long Beach, Calif. as Snoop Dogg. Our reviewer calls Quintabe a “fine, durable character for the long run. ” We also recently reviewed the latest horror novels, and six new thrillers for fall. • World Series, Game 6. The Cleveland Indians can win their first title since 1948 tonight (8 p. m. Eastern, Fox) or the Chicago Cubs can force a    Game 7. Either way, relief pitching has been the dominant story of the series, our columnist writes. • Recipes of the day. Learn how to master two   side dishes: roasted vegetables and fried rice. Halloween may be over in the United States, but Mexico and Central America are celebrating Día de los Muertos, or Day of the Dead. Hundreds of years ago, the Aztecs of that region honored their dead with elaborate rituals in the summer. The invading Spanish could not stamp out the tradition, and it was eventually merged with the Roman Catholic holidays of All Saints Day (Nov. 1) and All Souls Day the next day. Decorative skulls made of sugar are the most famous symbols of the holiday. They’re sometimes eaten or used on masks and dolls to represent the sweetness of life. People honoring Day of the Dead also visit the graves of their relatives and build ofrendas, or small altars with flowers and gifts, inside their homes. On Saturday, Mexico City hosted its first official Día de los Muertos parade. The inspiration: last year’s James Bond movie. “Spectre” begins with a chase through a Day of the Dead parade, and Mexican officials saw an opportunity to promote the capital city. Tens of thousands of people attended the parade. Among the marchers was a troupe dressed as Aztec warriors on   skates. “It would be hard to conserve these traditions without any changes,” its leader said. Karen Zraick contributed reporting. Your Morning Briefing is published weekdays at 6 a. m. Eastern and updated on the web all morning. What would you like to see here? Contact us at briefing@nytimes. com. You can sign up here to get the briefing delivered to your inbox.'"}, "time": 1742564291.7375612}