{"duration": 0.142808198928833, "input_args": {"text": "'  \\nAs I discuss in my most recent piece for Asia Times, Duterte v. United States: The Empire Slaps Back , I find the US tunnel vision concerning Asian attitudes toward engagement with China puzzling. \\nThe big story in Asia IMO is the smaller powers trying to integrate with the PRC economically while keeping it at arms’ length militarily, but that doesn’t seem to drive the coverage I see. Perhaps as a function of that “salary depends on not understanding” Mark Twain crack, US diplos/generals/journos/wonks seem determined to ignore the centripetal forces at play in Asia with China at their heart. \\nThere’s also a gigantic blind spot in US coverage of the Philippines. If you read the papes, everybody in the Philippines is staring anxiously out at the South China Sea for “Chizilla” to emerge and wreak havoc on a jewel of Pacific democracy. \\nActually, if you read my piece, you’ll find that the forces ravaging the Philippines are poverty, inequality, social division, corruption, and the occasional megatyphoon and I have an idea the reason that Fidel Ramos championed Duterte is because he saw him as the one candidate who would focus on domestic issues and not pivot-friendly bullsh*t. \\nThe US story is that the threat of “China rising” must be contained militarily, its economic reach reduced, and Asia should look for a “high standards” trade bloc, TPP, for its growth story instead of canoodling with the Chicoms. \\nHowever, I think the CCP read its George Kennan and realized the containment strategy worked on the USSR because the Soviets thought, incorrectly, they could cut it as an autarky. Deng knew different, enabled inward and outward investment, and now we’re looking at not only Asia but much of the world anxious at how Chinese trouble will play out in their own economies. \\nIn my opinion, the US was only able to establish “China threat” as the top element on the Asian FP agenda temporarily, with considerable effort, and only by the active support of pro-US government officials in Japan and the Philippines who were willing to assist in engineering polarizing provocations with the PRC around the Senkakus and Scarborough Shoal. \\nNow the economic logic of Asian integration i.e. hoovering up the cash the PRC is willing to throw at the region is reasserting itself. \\nThailand, Malaysia, Myanmar, Vietnam, and now the Philippines are showing via engagement with China that their participation in any US crusade is conditional and equivocal. \\nThese countries are not democratic and human rights garden spots, so I guess the US could summon up some “birds of a feather” grumbling about why the jefes of these regimes are willing to cozy up to dictators instead of joining the crusade to contain, isolate, and degrade the PRC regime (and heroically put their own economic well-being at risk at the same time). \\nAnd then there’s this guy: \\nThat’s Shinzo Abe making nice with Rodrigo Duterte during Duterte’s recent visit to Japan. Actually, making the “iron fist”, the symbol of Duterte’s, shall we say, rather harsh vision of how to make Philippine democracy do the right thing “or I’ll punch the crap outta you. Or worse.” \\nI just love this picture. I don’t recall seeing it in US coverage of Duterte’s foray into Japan. \\nUS tunnel vision was in full force again, focused on the fact that Duterte said he wanted foreign militaries a.k.a. the US outta the Philippines in two years. \\nBut the big story was, to paraphrase Sherlock Holmes, “the dog that didn’t snarl.” Japan. \\nAbe reciprocated Duterte’s outreached fist, one might say, with his own, and competed with the PRC in offering various goodies to the Philippines. \\nAbe’s Japan, as I comment in my Asia Times piece, has a rather multi-jointed agenda. \\nJapan was in a pretty solid space, securitywise, if it was content to remain a security ward of the United States under the pacifist constitution. But ideology, opportunity, and necessity are driving Japan back into Asia as a security actor. \\nAbe, a revisionist nationalist (i.e. he rejects the victor’s justice narrative of World War II that Japan did wrong and deserved to be militarily neutered), is piggybacking on the pivot to enable Japan’s re-emergence as a full-fledged Asian power with an extensive network of relationships cum allies in East and South Asia. \\nChina’s rise is an indispensable element in Japan’s rise. \\nThe, let’s face it, hulking and goonish face of PRC regional engagement promotes a search for capable friends, and most Asian countries are pretty happy to have Japan in their corner—and not too upset about Japan’s return to the fray as a full-fledged military power. \\nSecond, after the United States signed on to the “China threat” narrative as the driver for its Asia pivot (something that Kurt Campbell, Hillary Clinton, and Seiji Maehara cahooted on in 2010), the US abandoned the honest broker position it had claimed in previous decades and lined up behind Japan and provided material, operational, and diplomatic support for the expansion of Japan’s military footprint in Asia. \\nHowever, I believe that Japanese strategists regard US anti-China resolve as a wasting asset, not just subject to the vagaries of American politics and conflicting economic/fiscal/trade priorities that undercut the containment strategy, but also because the ineluctable logic of Asian growth is sidelining the US as hegemon of the anti-China alliance. \\nThere is likely to come a day when the US faces its Suez moment and admits it’s not ready to fight a war in the west Pacific to protect US interests and sustain US prestige. \\nThat day is unlikely to come under the Clinton administration—which has preemptively committed itself to a policy of sustaining US global pre-eminence through the application of military force as needed—and that, depending on your appetite for combat with the Chicoms 8000 miles from home, is either a good or bad thing. \\nBut the day will probably come and if and when it does, Japan does not want to be standing there helplessly holding its daikon (as it did when Nixon went to China). Instead, it’s going to be militarily strong, probably with a Israel-style covert nuclear weapons capability it will discretely brandish, and with a strong regional network of friends and allies in East Asia. \\nI think a Japan-centric security regime facing China but complemented by regional economic integration is sustainable; I think a US-centric system based on forestalling economic integration and keeping allies submissive by maintaining a nuclear “umbrella” a.k.a. monopoly is not. \\nWe may de facto be heading towards such a regime, even as the Clinton administration continues its hypernationalist bluster. There’s the nibbling away at the pivot by the smaller and weaker allies, there’s Abe with Duterte and, if I’m reading Paul Krugman’s tea leaves correctly, it appears that President Clinton may give up on TPP as an Obama pipe dream. \\nNot to say peace and reduced tensions are in the offing for East Asia; particularly, if I was Duterte I’d watch my back as the Clinton administration will probably seek to punish his lese majeste toward the United States much more than the lame-duck Obama administration. And, I imagine the U.S. Navy will demand more of its precious FONOPs in order to provoke the Chinese, hopefully to the point of a confrontation that feeds the security polarization narrative and fattens its budget. \\nBut the general trend seems to be away from Hillary Clinton’s goal of “America’s Pacific Century” toward “The Pacific’s Pacific Century” and I think that’s a pretty good thing. (Reprinted from China Matters by permission of author or representative)'"}, "time": 1742561982.075168}