{"duration": 0.19027137756347656, "input_args": {"text": "'Black America has a lot of anthems. If you’re at a wedding in the Philadelphia area, for instance, and hear the opening keyboard blasts of “Before I Let Go” by Maze featuring Frankie Beverly, the secular spirit might compel you to the dance floor, spilling the “   ” of the first few seconds behind you as you sprint. For more than a century,   children have had a hard time escaping “This Little Light of Mine. ” And then there’s James Weldon Johnson and John Rosamond Johnson’s “Lift Ev’ry Voice and Sing,” regarded as the black national anthem and so beautifully deceptive in its uplift that it makes you think you can sing even when you can’t. But the blackest anthem that doesn’t seem all that obviously black might be the one that opens “The Greatest,” the biopic from 1977 of Muhammad Ali starring Muhammad Ali. It’s “The Greatest Love of All,” a song of such earnestness and fulgent   that under no circumstances could it also be cool, under no circumstances could it be “Before I Let Go. ” Its sense of hope borders on the axiomatic  —   who doesn’t believe that children are the future? If you were young, black and near a classroom in the late ’70s or the ’80s, this was the song you sang, especially to commemorate a matriculation benchmark. I sang it at least twice going from one grade to the next. George Benson recorded the original, which twinkled. In 1985, Whitney Houston recorded the astronomical,   version everybody knows  —   a comet wrapped in cheese. That was the version my class had to sing. But I didn’t feel particularly black when I did it. For one thing, there were a few white kids at my school. But when you’re 9 or 10 and into lyrics, you notice how empowering  —   and how fun  —   these are to belt: “Learning to love   is the greatest love of all. ” That’s so Ali. He didn’t write the song. That was Michael Masser and Linda Creed, two white people, two weeks after she underwent a mastectomy. Its nondenominational radiance is the reason for its longevity: We should all be loving ourselves. But I’ve been hung up on what, for me, is the operative word. “Learning. ” That’s the black part: overcoming the institutional myth that there’s less  —   or nothing  —   to love. Ali overcame it. He learned. Then he taught. We’ve come some way since both 1977 and 1985. Now American culture is as much black culture as it’s ever been: from handshakes and slang to the embrace of the booty. We’ve learned to love it, and sometimes that’s a problem. Other races refract themselves through the predominant prism of black culture. But in the years between Barack Obama’s election and Donald J. Trump’s presidential candidacy, with the concentrated accretion of seemingly wrongful   deaths, with outspoken activist movements, with more black people speaking so blackly  —   influentially  —   on   platforms, artists have put their blackness at the center of American popular culture. And yet it’s a change from simply having just the artists there. They’re learning to explore the politics of their blackness. There’s too much going on at the moment for them not to. Things have taken such a turn into this sort of   that the charisma and racial stratagems of the flamboyantly ideological Johnnie Cochran have reappeared in two different O. J. Simpson television events. The black people shaping the culture have grown not just comfortable in their blackness but also defiant in its depiction, insistent in its inextricability from their art. They’re investigating blackness, not exclusively in terms of racism but as a matter of ontology: What is it? That’s the question that   Key and Jordan Peele transferred from their old Comedy Central show to “Keanu,” a disposable but slyly deep action comedy in which a black stoner and his preppy friend impersonate gangstas to rescue a cat. ABC’s “ ” took its black existentialism into current events and   criticism for its most recent season. Black creators are making work that follows and reflects black life on the ground: the protests over the deaths of black Americans, often involving the police the demands for reforming prisons and changing the way the justice system treats black and Hispanic men the fury over Hollywood’s indifference to sectors of the populace that straight white men don’t exclusively inhabit. The visual side of “Lemonade,” Beyoncé’s    “visual album,” steeps the songs in  : from the attire of the antebellum South to the legacies of black female struggle and strength. “Hey! I’m a keep running,” she sings. “’Cause a winner don’t quit on themselves. ” That’s Ali, too. In that same song, “Freedom,” Kendrick Lamar raps about himself as an object of persecution, by the news media and consequently by law enforcement. There’s blackness  —   the mere state of one’s racial self  —   and there’s being politically black, which amounts to the degree to which one wields or weaponizes or calls attention to one’s blackness. “Freedom” constitutes a wielding. This kind of blatant statement is new for Beyoncé, who before the advent of the Black Lives Matter movement was thoughtful about the politics of the beauty of black women’s bodies, and since its arrival has wed the complexities of feminism and the vicissitudes of marriage with political blackness. She’s learned. And people are listening. “Lemonade” is the No. 2 album in the country. George C. Wolfe’s new musical, “Shuffle Along,” centers on that sort of wielding. But he wants you to do the learning. The musical rebuilds one of the first black shows to make it to Broadway, a forgotten pageant of song, dance and romantic comedy that ran for 484 performances 95 years ago and was also called “Shuffle Along. ” Mr. Wolfe works from the inside out, making his show about the making of the original show. His ambition gives the new musical a   quality. It’s set entirely in its era. Yet every mouth that begins to sing  —   and the singing here is astounding  —   seems to open a portal that whisks 2016 back to 1921, bringing with it several eras in between. The history here lives, breathes and tap dances. And at its best, it cagily uses the pride of the present against the prejudice of the past. There’s some suspense among the     show’s creative team about whether white audiences will tolerate seeing two of the musical’s stars embrace during a number. Mr. Wolfe casually juxtaposes that question with an affair between one of the stars, Lottie Gee (Audra McDonald) and Eubie Blake (Brandon Victor Dixon) the married half of the show’s songwriting duo. The only person who’d be offended by this nowadays would be Mrs. Blake. The tensions in the show are entirely  . Black people performing in blackface is the one thing that everyone in both periods would agree is a problem. And Mr. Wolfe doesn’t overthink that. It is what it was, and what it was is  . Mr. Wolfe is after something sophisticatedly didactic if less immediately rousing  —   the show’s subtitle is “Or, the Making of the Musical Sensation of 1921 and All That Followed. ” He wants the   of the old show to inform his winking reproduction. It also presumes the core ticket buyer is white, as was the case in the previous century. To that end, the 2016 show critiques, celebrates and speculates about the 1921 version while also finding the elated white audiences on both ends of the timeline inevitable. Instead of rage, you get affectionate hindsight that cuts the pervasive melancholy. The show’s   creative team ended their collaboration more over money than racism. If it had managed to stay together, Mr. Wolfe wonders, imagine what it could have done for blacks in the American theater. That’s a question more or less asked during the encyclopedia entry of a finale, but a poignant one. The historical irony (look at all the people of color on Broadway now!) cries out for the emotional pragmatism that closes “The Greatest Love of All”: It’s a low note for a soaring   anthem. (Houston sang it as if she were taking us to the moon.) But it’s also black in that, like Mr. Wolfe’s musical, it’s got a touch of the blues. The matter that’s also got Mr. Wolfe bummed out  —   downright angry  —   is the question of appropriation. It insinuates that George Gershwin stole from “Shuffle Along. ” It’s a spurious charge but one meant to address the wider historical swamp of race, influence and theft. In the show’s most chilling wink, he makes the white Harlem Renaissance gadfly Carl Van Vechten into a villainous scold who attacks the show while damning it to irrelevance. Maybe Van Vechten is right. Yet his condescension feels wrong. Black parlance has a word for all of this waking up: “woke. ” The meaning has expanded from black people’s discovery and maintained awareness of trouble (“Stay woke! ”) to white people’s acknowledgment of black trouble and also their awareness that sometimes the trouble lies with them. There’s a symbiosis at work. At the same time that black artists are coming into a sharper phase of their blackness, white Americans are coming into their whiteness, reckoning with it and embracing it. Part of what’s brought them to this identification of politicized whiteness is what’s brought   minorities to their racial politics: oppression and injustice and anger. Earlier this week, Louis C. K. told the writer David Marchese, in a long, illuminating Q. and A. on Vulture, that white guys are doing fine. He was responding to a question about the sense of oppression coursing through the white male electorate. These guys feel they can’t speak their mind anymore. So they’re glad that Bernie Sanders and Mr. Trump are speaking for them. But Louis C. K. suspects cultural hypochondria. “Nobody’s turning us down for a job,” he said. “There’s nothing that’s being taken away from us. ” Of course, that’s not entirely true. Some of the stuff being taken away from white people is stuff they previously took. Some of that stuff is being challenged, by the likes of Macklemore and Ryan Lewis, who in February released a brick of an album that, in part, atones for white privilege by incorporating white guilt. But that reclaiming is being done by filmmakers as well. Ava DuVernay’s “Selma” shouldn’t have seemed all that subversive. But the movies so frequently favor black stories from white perspectives that placing a crucial moment of the civil rights movement in the hands of black leadership constituted revolt. The actor Nate Parker has directed a film, due in the fall, about Nat Turner’s slave rebellion that sets up a contrast with William Styron’s novel “The Confession of Nat Turner” from 1967 and implicitly rebukes D. W. Griffith’s racist landmark, from 1915, which seduces you to root for the Ku Klux Klan. They’re both called “The Birth of a Nation. ” There’s even a revisionist version of “Roots” that isn’t more than serviceable but is remarkably more handsome and better acted than the original. It’s as much about black power as the original was concerned with narrative racial balance. Hey, Beyoncé, Kunta Kinte now breaks chains all by himself, too. The gist of some of this rethinking is defensive. Some of it’s tentative, even the very best of it.  ? It does also feel, however, like artists learning  —   how to be politically black and commercial, entertaining and listenable. And some of the country is learning with them. But having to learn also feels weirdly new. In the 1970s, when Ali owned American culture, and black movies and music weren’t shy about black politics, there was nothing to be “ish” about.'"}, "time": 1742561904.9159918}