{"duration": 0.07995176315307617, "input_args": {"text": "'Warplanes level a hospital in the   half of Aleppo, Syria, killing one of the city’s last pediatricians. A   military coalition bombs a hospital in Yemen. In Afghanistan, American aircraft pummel a hospital mistaken for a Taliban redoubt. The rules of war, enshrined for decades, require hospitals to be treated as sanctuaries from war  —   and for health workers to be left alone to do their jobs. But on today’s battlefields, attacks on hospitals and ambulances, surgeons, nurses and midwives have become common, punctuating what aid workers and United Nations officials describe as a new low in the savagery of war. On Tuesday, the Security Council unanimously adopted a resolution to remind warring parties everywhere of the rules, demanding protection for those who provide health care and accountability for violators. The measure urged member states to conduct independent investigations and prosecute those found responsible for violations “in accordance with domestic and international law. ” But the resolution also raised an awkward question: Can the world’s most powerful countries be expected to enforce the rules when they and their allies are accused of flouting them? Russian warplanes were blamed for the bombing of Syrian health centers, for instance, and Syrian soldiers, backed by the Kremlin, continue to remove lifesaving medicines, even painkillers, from United Nations aid convoys heading into   areas. At the same time, Britain and the United States back a   coalition that is accused of attacking health facilities in Yemen. China and Russia support the government of Sudan, which is accused of at least two attacks on health facilities supported by Doctors Without Borders, the international medical charity, in Kordofan State. From the charity’s international president, Dr. Joanne Liu, seated at the Security Council’s   table, came the sharpest rebuke to the Council’s five permanent,   members. “You therefore must live up to your extraordinary responsibilities, and set an example for all states,” she said. “I repeat: Stop these attacks. ” Without naming the countries, she criticized the United States  —   for having refused to submit the American attack in October on her organization’s hospital in Kunduz, Afghanistan, to an independent international inquiry  —   just as she scolded Russia for having denied that its warplanes had hit civilian targets in Syria. “Broad attacks on communities and precise attacks on health facilities are described as mistakes, are denied outright or are simply met with silence,” she said. Just hours before, a maternity hospital was  hit in Aleppo, on the   side. Syrian state news media reported fatalities and heavy damage at the hospital and blamed insurgent shelling. Last Wednesday, airstrikes believed to have been carried out by the Syrian government demolished a hospital in the   portion of Aleppo, killing dozens of people including one of the city’s last pediatricians. There is plenty of blame to go around. In 11 of the world’s war zones, between 2011 and 2014, the International Committee of the Red Cross tallied nearly 2, 400 acts of violence against those who were trying to provide health care. That works out to two attacks a day. Peter Maurer, the president of the International Committee of the Red Cross, who attended the Security Council vote, commended members for what he called a “strong” resolution, even if only to remind combatants of longstanding rules of war. He warned members not to grow accustomed to attacks on hospitals and ambulances. “These are not sad realities we have to get used to,” he said. “They are abominations to fight and trends to roll back. ” The United States said it had punished the American soldiers implicated in the Kunduz hospital bombing. Russia said it could not “corroborate accusations leveled” against Russian forces in Syria. That the resolution only echoed rules laid out decades ago was not lost on one of its main proponents, Gerard van Bohemen, the ambassador of New Zealand. “These legal requirements already exist,” he said. “Some are among the oldest rules of international humanitarian law. The problem is one of respect and compliance. ” There have been   attacks on health workers in the past. Serbian troops stormed a hospital in the Croatian town of Vukovar in 1991, removed several hundred patients and executed them. Sri Lankan forces were accused of attacking hospitals in the Tamil   towns of the north in 2008 and 2009, during the last few months of the civil war in that country. In Pakistan, Taliban militants have assassinated dozens of health workers trying to vaccinate children against polio. Targeting a medical facility is considered a war crime, if proved to be deliberate. That is a difficult legal hurdle, and few prosecutions have been made against warring parties accused of attacking hospitals and health workers. The Pentagon has said that the strike on the Doctors Without Borders hospital in Kunduz in October was unintentional. British and American officials have increasingly publicly urged their allies in the   coalition waging war in Yemen to abide by international law, though they have not called for international inquiries into possible rights violations in Yemen as they have in Syria. A United Nations panel of experts has documented what it described as “widespread” breaches, pointing to airstrikes by the   coalition as well as shelling of health facilities by Houthi rebels. In Yemen, the poorest country in the Middle East, a fourth of all health care facilities were destroyed or shuttered in one year of war, according to the United Nations. Saudi Arabia was among the   of the Security Council resolution, which was delicately worded. Drafted by Egypt, Japan, New Zealand, Spain and Uruguay, it avoids a direct reference to possible prosecutions by the International Criminal Court, a delicate topic for some countries. But the resolution cites the statute that created the court, condemns the “prevailing impunity” for attacks on health centers and calls on governments to carry out independent investigations. It also demands that armed combatants allow unimpeded access to health workers. Those demands have been repeatedly made in Syria  —   and been ignored. Millions of people living in besieged and    areas have no access to medicines.'"}, "time": 1742562955.965844}