{"duration": 0.09882140159606934, "input_args": {"text": "'RALEIGH, N. C.  —   Coursing beneath the boisterous chanting of the  ’s name Tuesday night  —   that single syllable that will now forever conjure more than just a gilded real estate empire  —   were the more nuanced hopes, fears and expectations of the Americans who shocked the world, and even themselves, by electing Donald J. Trump president of the United States. It was a combination of emotions that felt as novel and raw as the candidate himself. In interviews around the country, many supporters said they hoped for great things under a President Trump  —   though many also said they had no idea what they were in for. And nearly all of them agreed that Mr. Trump had, like many good businessmen before him, found a way to expertly tap a well of hidden demand  —   in this case, for a champion among what he called the nation’s “forgotten men and women. ” “There’s a great deal of mistrust between the people and their government in Washington, and that’s why you’re seeing a result like this,” said Ken Merrifield, 53, the mayor of Franklin, N. H. “It’s a revolution. ” On Tuesday evening at an election party here, Dennis M. English Jr. stood in the crowd in a tailored suit, clutching a fat celebratory cigar. He jabbed a fist in the air as Fox News recorded victory after victory for Mr. Trump. “This isn’t all white people!” yelled Mr. English, who is black. “Minorities are voting for Trump, I’m telling you!” (Exit polls showed 87 percent of Mr. Trump’s vote came from whites 2 percent came from blacks.) Mr. English is the director of a state office that helps businesses owned by minorities compete for government contracts. In his work, he said, he had toured some of the most depressed counties in eastern North Carolina. Before Mr. Trump, he said, it seemed that few politicians were addressing the grievances of people who were economically wounded by   deals that hastened the downfall of the textile industry. “We need to get those jobs back,” Mr. English said. “You’ve got to be on the ground. I’m talking thousands of people who are walking around those counties unemployed. ” In Wisconsin, Beth Schmidt, chairwoman of the Rock County Republican Party, said she woke up Wednesday morning feeling happy but a little stupefied. “As a Republican, I should be bouncing off the walls,” she said. “But I don’t know what to think. ” Ms. Schmidt, a    mother of three adult children, is fervently against abortion. She feels that welfare is necessary, but that it has become overused. She was not one of Mr. Trump’s earliest supporters, instead favoring Marco Rubio or Carly Fiorina in the primary season. But she “moved forward” in the general election, deciding to vote for Mr. Trump in the end. She is convinced that Mr. Trump will surround himself with smart and experienced people. “I think that you’re going to see that he will, surprisingly, bring people together,” she said. “I’m going to pray for this. As time goes on, people are going to see a different Trump. ” To Mark Harris, a businessman from Georgia, Mr. Trump’s indecorous outbursts and often crude behavior were a price worth paying for the   he believed Mr. Trump would bring to government. “A lot of the American people can put aside him being rough around the edges to take the chance on the change that he talked about,” he said. Mr. Harris, 49, a retailer in one of Atlanta’s northern suburbs, could hardly contain his glee over Tuesday’s outcome. It was, he said, an unrestrained rejection of politicians, lobbyists and the news media. “The American people are sick and tired of the government in Washington, D. C.,” he said. But he also had a warning for Mr. Trump: Break your promises at your peril. “In four years’ time, we’ll see if he’s smart enough to be able to go through with what he’s promised the American people,” Mr. Harris said. “If he’s able to put into motion what he has proposed over this election, he will win in four years, hands down. ” At the same time, some supporters seem to have installed a sort of   decoder of the Trumpian style, harboring a sense that some of his most audacious promises  —   like the plan to build a southern border wall, and make Mexico pay for it  —   are perhaps not best taken literally. Joseph Connor, of Bergen County, N. J. said it was the general principles in Mr. Trump’s message that were more important, particularly the idea of getting government out of the way of commerce. “I think it’s time to shed regulation and let Americans do great things in the world,” said Mr. Connor, who works in finance and belies the stereotype of Trump voters as working class and rural. “And I see that in Trump. ” At Republicans’ election night party in Phoenix, a pair of friends, Linda M. Wright and Susan Cheatham, pumped their fists and thanked Jesus for Mr. Trump’s victory. “He’s not going to raise our taxes,” said Ms. Wright, 58, of Phoenix. “He’s going to protect our borders,” said Ms. Cheatham, 53, of Scottsdale. “He won’t take our weapons away,” Ms. Wright said. “He will appoint Supreme Court justices who will protect our Constitution,” Ms. Cheatham said. “Yeah, protect the Constitution  —   that’s key,” Ms. Wright concluded. They agreed that Mr. Trump represents their version of America: a place that loves God and cares for its military. “Nobody has the right to come into our country and steal it from me,” Ms. Wright said. “If you don’t like our country, don’t move here. Don’t come here and try to impose your religion on us. ” “Yeah,” Ms. Cheatham said, “Shariah law. ” With his proposal to ban Muslims from entering the United States and to deport all of the nation’s illegal immigrants (positions that he seems to have since altered) Mr. Trump’s campaign was bound to speak to the country’s white nationalists: In Louisiana on Tuesday, David Duke, the former Ku Klux Klan leader who mounted an unsuccessful Senate bid, celebrated Mr. Trump’s victory. “The great mass of his supporters, the overwhelming white vote, they also have a right to respect their heritage, their values,” he said. “I believe he’s really an advocate of Western Christian civilization. ” But Mr. Duke rejected the idea that racism was part of Mr. Trump’s message. So did Bridg Webb, 21, who was walking into a celebratory Republican rally at the   football stadium of the University of Utah on Tuesday. On the way, Mr. Webb said, someone drove by him and shouted, “Nazis!” That, he said, was exactly what Mr. Trump’s opponents  —   in the news media, on the left, in urban centers  —   failed to grasp about voters like him. “I’ve been called a bigot I’ve been called a white supremacist,” he said. “I pride myself on being a good guy. I go out of my way to help people. All these things are so unfair, and it’s all because I said I like Donald Trump. ” Mr. Webb grew up in a Mormon family in Elk Ridge, Utah, a community outside the conservative city of Provo. Though it is a safe place, and though Utah is humming along with 3. 4 percent unemployment, Mr. Webb said he felt creeping fears about the threat of terrorism after attacks in San Bernardino, Calif. and Orlando, Fla. He worried the American economy would not have a stable job for him. He hopes to become a police officer, and he worried that Mrs. Clinton would pass gun restrictions that could disarm law enforcement. Mr. Trump, he said, was a balm for those fears. Supporters like Jeanne Koval, 57, and her husband, Alan, 59, see themselves as part of a global movement against corrupt governments run by insiders. The couple, who hail from Fenton, Mich. were playing the slots on the Las Vegas Strip on Tuesday night. Ms. Koval, a nurse, compared her support for Mr. Trump to the support that the Filipino nurses she works with have shown for the president of the Philippines, Rodrigo Duterte. “They were tired of the corruption, and they want someone who can get something done,” she said. Neither could specifically say what change they wanted Mr. Trump to make, but they voiced concern about rising health care costs and jobs going overseas. Ms. Koval said her parents’ health care premiums recently increased $600 a month. In Utah, Olivia Blackham, who was adopted from Guatemala as a baby, voted for Mr. Trump in her first presidential election. She did so in large part because, she said, she believed America’s immigration system was broken. Ms. Blackham said she had been frustrated after working with refugees who received free health care while her   friends and family had to pay high premiums and hundreds of dollars for prescriptions. She said she believed Mr. Trump could fix that. “I’m really passionate about getting it straight,” she said. But as the reality set in that Mr. Trump would become the 45th president of the United States, Ms. Blackham, 34, expressed a lingering uneasiness. “I think it’s going to be scary,” Ms. Blackham said. “We’re in for a change. ”'"}, "time": 1742628443.680213}