{"duration": 0.026727676391601562, "input_args": {"text": "'WASHINGTON  —   Gov. John Kasich of Ohio on Tuesday signed into law a ban on abortion after 20 weeks of pregnancy, but vetoed a far more restrictive measure that would have barred abortions after a fetal heartbeat was detected, as early as six weeks into a pregnancy. In reaching the split decision on the two bans, adopted last week by the Ohio legislature, Mr. Kasich said the   heartbeat bill was “clearly contrary to the Supreme Court’s current rulings on abortion. ” He called the   ban the “best, most legally sound and sustainable approach to protecting the sanctity of human life. ” The   ban has no exceptions for rape or incest, and abortion rights advocates consider it extreme. Under existing Ohio law, there will be an exception for life of the mother, Mr. Kasich’s office said. Current Ohio law bars abortion after 20 weeks unless doctors can show that the baby is not viable outside the womb. Many medical experts cite the age of viability as 24 weeks. With the governor’s signature, Ohio becomes the 18th state to adopt a   abortion ban, though two of the bans  —   in Arizona and Idaho  —   have been struck down as unconstitutional by federal courts. Legal experts say Ohio’s   ban is far more likely to survive a constitutional challenge than the heartbeat bill. Barring court action, the law will take effect in 90 days, but a legal challenge appears inevitable. The American Civil Liberties Union of Ohio, which said on Tuesday that the measure was “unconstitutional and will harm women and families,” was expected to file a suit to block it. “There’s no way we’re going to take this lying down,” said Gabriel Mann, a spokesman for Naral   Ohio, an advocacy group. “It’s too horrific of a restriction for women who are facing medical complications and situations where they need an abortion around that   period. ” About 20, 000 abortions are performed in Ohio each year, Mr. Mann said, and fewer than 2 percent occur after 20 weeks of pregnancy. While the state keeps track of the number of abortions, it does not track the reasons for termination. Abortion opponents argue that one abortion is one too many. Mr. Kasich’s actions come as abortion rights advocates and abortion opponents around the country are gearing up for intense battles in the wake of the election of Donald J. Trump to the White House. Mr. Trump’s victory has changed the political winds around abortion politics, emboldening the   movement. People on both sides of the debate see abortion rights in greater danger than at any time since the Supreme Court’s landmark Roe v. Wade decision in 1973, which found a legal right to abortion within the 14th Amendment. Mr. Trump has committed to appointing Supreme Court justices who would overturn Roe. Even so,   movement leaders in Ohio feared that the heartbeat bill would bring on a court challenge, and could ultimately set back their cause, given the current makeup of the Supreme Court. In June, after the death in February of Justice Antonin Scalia, the court struck down a   Texas   bill,  . But even if Mr. Trump fills Justice Scalia’s seat, the balance of the court will not change it will still tip in favor of Roe,   said Michael Gonidakis, the president of Ohio Right to Life, the organization that pushed for the   ban. “The governor got this right,” Mr. Gonidakis said. “At the end of the day, he had to exercise great restraint in what legislation he signed. ”'"}, "time": 1742628609.9632664}