{"duration": 0.1166839599609375, "input_args": {"text": "'BALTIMORE  —   Freddie Gray died after a “rough ride” in a police van, prosecutors here said on Thursday, laying out for the first time their murder case against the officer who drove the transport wagon in which Mr. Gray, a    black man, suffered the “  injury” that broke his neck and later killed him. With Mr. Gray shackled but not belted in the back of the van, Officer Caesar R. Goodson Jr. ran through a stop sign and took a sharp right turn, driving so fast that he did not stay in his lane, a prosecutor, Michael Schatzow, said. Had Officer Goodson buckled Mr. Gray, or called promptly for medical attention, he said, the young man would be alive today. “He was injured because he got a rough ride,” Mr. Schatzow told Judge Barry G. Williams of Baltimore City Circuit Court, adding: “There was no good reason for the officer to repeatedly fail to seatbelt Mr. Gray except to bounce him around. ” It was the first time that prosecutors have used the words “rough ride” in connection with Mr. Gray  —   a compelling opener to a   trial playing out more than a year after the violent unrest set off by Mr. Gray’s death in April 2015. Experts said the rough ride argument would be difficult to prove, adding to the challenges faced by prosecutors, who have already tried two of the six officers facing charges in Mr. Gray’s death, and so far failed to win any convictions. Officer Goodson, 47, a department veteran, faces the most serious charges of any of the six, and is the only one who did not give investigators a statement. Thursday was the first time his story has been told his defense lawyer, Andrew Graham, painted him as a “decent man” who acted in “good faith. ” Mr. Graham told the judge that Mr. Gray caused his own death, by thrashing around in the van or trying to stand up as it was moving. “An accident can be just an accident,” Mr. Graham said, “and the cause of the accident can be the person himself who was injured. ” At Officer Goodson’s request, the case will be decided by Judge Williams, not a jury. Even before it got underway Thursday, it took a dramatic turn, as a furious Judge Williams berated Mr. Schatzow and his team for withholding evidence critical to the officer’s defense  —   information about prosecutors’ meeting in May 2015 with Donta Allen, a suspect who rode in the back of the van with Mr. Gray and is a potential witness in the case. Prosecutors said the meeting, their second with Mr. Allen, produced only “silly” information that was not relevant. The judge sharply disagreed, declaring the meeting “extremely exculpatory. ” He ordered prosecutors to share any additional information that might be relevant by Monday morning, demanding: “What else is out there that you haven’t turned over?” Officer Goodson faces seven charges in all, including manslaughter and reckless endangerment, in addition to “second degree depraved heart murder. ” Legal experts say it will be especially difficult for prosecutors to prove the murder charge, which will require them to show that the officer acted with willful indifference to Mr. Gray’s life. “This is now about a rough ride,” said Warren Alperstein, who frequently represents police officers, but is not involved in the Gray cases. He said much would depend on what evidence the state produces to prove its case: “Is it going to be surveillance video? Is it going to be bystander witness testimony?” Many details of the case are familiar by now. On April 12, 2015, Mr. Gray was walking with friends in the downtrodden Sandtown neighborhood of West Baltimore when he spotted a group of police officers and ran. They pursued, detained and arrested Mr. Gray, and Officer Goodson responded to the scene with a prisoner transport van. The officers eventually placed Mr. Gray, who was handcuffed and wore leg shackles, inside the van, but did not secure him with a seatbelt. One of those arresting officers, Edward M. Nero, was acquitted late last month of four misdemeanors in the case. The trial of another officer, William Porter, who arrived as backup, ended in a hung jury last year. With Officer Goodson at the wheel, the van made a total of six stops through West Baltimore. In court on Thursday, Mr. Schatzow said medical evidence would show that Mr. Gray was injured by hitting his head before the fourth stop, and that doctors could have saved him. But Mr. Graham said defense experts would testify that Mr. Gray’s injury happened later, was catastrophic, and that medical care would not have made a difference. Officer Porter’s testimony is expected to be crucial to the case against Officer Goodson, because he can tell the court what he and Officer Goodson discussed about Mr. Gray’s condition, and when. Whether Officer Goodson will testify in his own defense is unclear defense lawyers have not said. But they did indicate on Thursday that they would call Mr. Allen, who rode in the van with Mr. Gray. He has said Mr. Gray was thrashing about in the back of the van  —   a remark that would seem to bolster the defense  —   but later recanted that statement in television interviews. The courtroom was packed for Thursday’s opening arguments, with a crew of familiar faces who have been sitting through the trials. Among them was Tessa   the president of Baltimore’s branch of the N. A. A. C. P. who said her organization often receives complaints of rough rides. She sounded pleased to hear the issue raised in court: “We’ve got to get some hits where someone is taking responsibility for Freddie Gray’s death. ”'"}, "time": 1742628496.6002913}