{"duration": 0.09600377082824707, "input_args": {"text": "'Politicians Will Feel the Heat From Rising Temperatures Posted on Nov 4, 2016 \\nBy Kieran Cooke / Climate News Network New research shows that the hotter it gets, the quicker the pace of political change. (Gabor Dvornik via Flickr) \\nLONDON—Voters who feel good about life—whether it is to do with their job, their marriage or even the success of their sports team—are more likely to support their politicians. On the other hand, those who are disgruntled and fed up are more prone to want a change of political leadership. That, at least, is the received wisdom of political pundits. Rising temperatures New research indicates that, in future, climate change—and specifically rising temperatures—could also be a key factor in undermining and determining political longevity. The hotter it gets, the theory goes, the quicker the pace of political change. \\nNick Obradovich, a researcher at Harvard University in the US, has conducted what is described as the first ever investigation into the relationship between temperature, electoral returns and future climate change. \\nIn a study published in the journal Climatic Change , Obradovich sets out to substantiate the idea that climate change, by threatening feelings of wellbeing, will lead to a quicker turnover of politicians and political parties. There is no doubting the thoroughness of his research: altogether, Obradovich analysed more than 1.5 billion votes cast in nearly 5,000 elections in 19 countries ranging from Argentina to Zambia between 1925 and 2011. This data was then set alongside meteorological records. The analysis indicates, says Obradovich, that “warmer than normal temperatures in the year prior to an election produce lower vote shares for parties already in power, driving quicker rates of political turnover”. “ Warmer than normal temperatures in the year prior to an election produce lower vote shares for parties already in power, quicker rates of political turnover” The study also finds that voter disgruntlement is more pronounced in warmer countries where average annual temperatures are above 21°C . “In these warmer places, voter support shrinks by nine percentage points from one election to the next, relative to office bearers in cooler electoral districts,” the study finds. Countries lacking historical electoral data—including those in sub-Saharan Africa already feeling the impact of climate change—were not included in the research. Obradovich also uses climate models to predict future voter behaviour, suggesting that the pace of political change in many countries between now and the end of the century is likely to considerably speed up. “Climate change may increase the frequency of democratic turnover most in warmer, poorer nations,” says the study. Fickle electorates Global warming is a complex problem that can only be tackled through international agreement and long-term planning. Obradovich says that faced with ever more fickle electorates, politicians in future will be tempted to focus on short-term policies instead of adopting longer-term strategies. This could not only hamper the fight against climate change but also cause economic and political upheaval. “Turnover in nations with weak democratic institutions can up-end political stability—if incumbents in weak democracies foresee a greater risk of losing office, they sometimes employ electoral fraud and pre-electoral violence to maintain power,” says Obradovich. “If these methods fail, incumbents’ loss occasionally precipitates post-electoral violence that can in turn induce broader civil conflict.” \\nKieran Cooke, a founding editor of Climate News Network, is a former foreign correspondent for the BBC and Financial Times. He now focuses on environmental issues \\nAdvertisement'"}, "time": 1742563006.3464916}