{"duration": 0.06300687789916992, "input_args": {"text": "'The Justice Department has found that the Baltimore Police Department for years has hounded black residents who make up most of the city’s population, systematically stopping, searching and arresting them, often with little provocation or rationale. In a blistering report, coming more than a year after Baltimore erupted into riots over the   death of a    black man, Freddie Gray, the Justice Department is sharply critical of policies that encouraged police officers to charge black residents with minor crimes. A copy of the report was obtained by The New York Times. The critique is the latest example of the Obama administration’s aggressive push for police reforms in cities where young   men have died at the hands of law enforcement. The findings, to be released Wednesday, are the first formal step toward the Justice Department’s reaching a settlement with Baltimore  —   known as a “consent decree”  —   in which police practices would be overhauled under the oversight of a federal judge. The department started the inquiry at the invitation of Mayor Stephanie  . To show how officers disproportionately stopped black pedestrians, the report cited the example of a black man in his   who was stopped 30 times in less than four years. None of the stops led to a citation or criminal charge. Black residents, the report said, accounted for 95 percent of the 410 individuals stopped at least 10 times in the five and a half years of data reviewed. The most pronounced racial disparities were in arrests for the most discretionary offenses: For example, 91 percent of those arrested solely for “failure to obey” or “trespassing” were   even though the city is 63 percent black, the report found. In one telling anecdote from the report, a shift commander provided officers with boilerplate language on how to write up trespassing arrest reports of people found near housing projects. The template contained an automatic description of the arrestee: “A BLACK MALE. ” “The supervisor’s template thus presumes that individuals arrested for trespassing will be ” the report stated, describing the sort of detentions the language was intended to facilitate as “facially unconstitutional. ” The report indicated that the frequency of arrests without probable cause was reflected in the fact that booking supervisors and prosecutors had declined to file charges, after arrests by their own officers, more than 11, 000 times since 2010. Two weeks ago, Maryland prosecutors dropped charges against the last of six officers charged in the April 2015 death of Mr. Gray, who sustained a fatal spinal cord injury while in custody. With that, Baltimore joined a growing list of cities where   deaths sparked outrage, and even riots, yet no one was held accountable in court. While no consent decree has been reached, the report states that the city and the Justice Department have agreed in principle to identify “categories of reforms the parties agree must be taken to remedy the violations of the Constitution and federal law described in this report. ” “I don’t think at this point, it’s about justice for Freddie Gray anymore,” said Ray Kelly, a director of the No Boundaries Coalition, a West Baltimore group that provided its own report on police abuses to the Justice Department. “Now it’s about justice for our community, for our people. ” City Councilman Brandon Scott, vice chairman of the council committee that oversees the department, said the next fight could be over how to pay for the police overhaul. Baltimore is among nearly two dozen cities that the Obama administration has investigated after they were accused of widespread unconstitutional policing. Using its broad latitude to enforce civil rights laws, the Justice Department has demanded wholesale change in how cities conduct policing. In several cities, including Seattle Cleveland and Ferguson, Mo. those investigations began in the aftermath of a   death that sparked protests and in some cases riots. Police chiefs, prosecutors and experts say the investigations have forced cities to address longstanding, entrenched issues far beyond the targeted cities. “Chiefs are constantly looking at these reports, not just to learn lessons and best practices from each other, but also what pitfalls we can avoid,” said Scott Thomson, the police chief in Camden, N. J. who is also the president of the Police Executive Research Forum. But   reform can take years, which does little to ease the frustration of activists who say that police officers too often go unpunished for deadly encounters with unarmed people. Dayvon Love, 29, a founder of the Baltimore advocacy group Leaders of a Beautiful Struggle, said that changes would come only when civilians have a say in whether officers should face punishment. Mr. Love described frustrating meetings with Justice Department officials  —   including Attorney General Loretta E. Lynch. “I was very skeptical and not really that enthused about meeting with them,” Mr. Love said. At one point, he said, he asked Ms. Lynch what she could do to change state law and give civilians more power over the police. “She said what I figured she’d say, which is that from her position as attorney general, she can’t really do anything about it. ” The Supreme Court has given police officers wide latitude in how they can use deadly force, which makes prosecuting them difficult, even in the killing of unarmed people. For the Justice Department to charge an officer with a federal crime, the bar is even higher. Prosecutors must show that the officer willfully violated someone’s civil rights. State and federal investigators cleared the officer who killed Michael Brown in Ferguson and those who killed    Tamir Rice in Cleveland. Federal prosecutors are still debating whether to bring charges in the death of Eric Garner on Staten Island. Local prosecutors did not. In Baltimore, black residents have been complaining for years of systematic abuse by the department. When the city’s top prosecutor, Marilyn Mosby, failed to get any convictions in Mr. Gray’s death, many in the city’s poorest   neighborhoods were not surprised. After the 1991 beating of Rodney King in Los Angeles, Congress gave the Justice Department the power to investigate police departments for patterns of civil rights violations. The Obama administration has used that authority more aggressively than any other. Prosecutors are enforcing consent decrees on police departments in 14 cities. “We tend to confront systemic problems only when forced to by seemingly extraordinary events,” Vanita Gupta, the Justice Department’s top civil rights prosecutor, said last year. In Seattle, the investigation followed an officer’s shooting of a Native American woodcarver in 2010. The shooting was ruled unjustified, but prosecutors said they could not meet the legal standard to file charges. The federal authorities, however, found a pattern of excessive force and ordered the Police Department to provide better training and oversight. In recent years, the Justice Department has held Seattle up as an example of how cities can best respond to scathing investigations. In other cities, the changes are just beginning. After months of arguing and delay, officials in Ferguson accepted a settlement in March that will force the city to change its policies on when officers can use stun guns, shoot at cars and stop pedestrians. Officials in Cleveland agreed in May to follow strict new standards governing how and when its officers can use force. The report is sure to fuel a broader debate on aggressive policing practices, as it blames much of Baltimore’s woes on   “ ” policies adopted in the late 1990s. They were aimed at anyone on the streets whom officers viewed as suspect, making heavy use of    and other confrontation techniques. But the approach, the report found, “led to repeated violations of the constitutional and statutory rights, further eroding the community’s trust in the police. ” While Baltimore officials have sought to curb the most extreme   policies, the legacy of the strategy continues to vex the department. One example the report cited was a police sergeant who recently posted on Facebook that the “solution to the murder rate is easy: flex cuffs and a line at” the central booking office, made up of people arrested on charges of loitering.'"}, "time": 1742628539.9046144}