{"duration": 0.05609750747680664, "input_args": {"text": "\"Barack Obama has been out campaigning on behalf of Hillary Clinton the last month or so trying to help his investment, Hillary Clinton. As the race has heated up with the FBI reopening their investigation into Hillary Clinton’s emails, Hillary Clinton and her camp are starting to go crazy trying to find ways to combat the Trump Train that is about to leave them in the dust. \\nVia USAPolitics \\n\\nFirst Hillary Clinton snapped at a protester at one of her rallies that shouted, “Bill Clinton is a rapist,” having him escorted out after his remarks. Now Obama is losing control and this time on a veteran. Yes, that’s right. A veteran!\\nBarack Obama doesn’t deserve to be Commander-in-Chief if he’s going to belittle the people that he sends into battle and harms way. An image of the Trump supporter protesting can be seen below.\\nHere's the pro-Trump protester who interrupted Obama rally pic.twitter.com/gbwzT3i1zU \\n— Josh Lederman (@joshledermanAP) November 4, 2016 \\n\\nWhat’s even worse it that right before he belittled this great American patriot, he was insulting trump for making fun of American POWs, most notably John McCain.\\nObama lost complete control after that screaming:\\n“Hey, he, hey, hey, hey!! HOLD UP! SIT DOWN! I’m speaking! BE QUIET!! HOLD UP!” \\nHe seems a bit desperate for attention to me.\\nBarack Obama and Hillary Clinton are losing control and they can’t stand to see it. They are going to try everything in their power to cheat the system and probably try and rig the election so that they can maintain their power because they are connected on so many levels.\\nYou can hear the screams and protests in the video above. Obama can’t even control a crowd let alone an entire country. This can’t be allowed to happen. We have to stop them for good and clean up the corrupt swamp that Washington has become.\\n \\n \\n\""}, "time": 1742561967.139542}