{"duration": 0.10322165489196777, "input_args": {"text": "'written by Admin by Eric Zuesse, originally posted at strategic-culture.org Before I start this condemnation of lies from ‘liberal’ ‘news’ media, I should indicate that I am a former lifelong Democrat who left the Party over the corruption of the Obama Administration when the corruption became capped by their Democratic National Committee using many devices to steal the Presidential nomination away from Bernie Sanders, to hand it to Obama’s chosen successor Hillary Clinton, whom Obama expected would complete his pro-Wall-Street legacy by passing into law some version of his trade treaties and by Hillary’s conquering Russia, the latter of which goal was a U.S. government project that had actually started in secret on the night of 24 February 1990 when the then-President George Herbert Walker Bush initiated what has since become a ceaseless behind-the-scenes U.S. government program to expand NATO right up to Russia’s borders and ultimately to conquer Russia itself. Though the Cold War ended authentically on Russia’s side in 1991, it never really did end on the U.S. side (that was just a lie) — and Obama-Clinton were hoping soon to culminate the U.S. aristocracy’s conquest of Russia. I remain a committed progressive journalist but am no longer committed to any political party, because now both of the major political parties are vile and no third party in a Presidential system of government stands a realistic chance of controlling either the Executive branch or the Legislative branch of government — its only function is to serve as “spoiler” for one or the other of the two. So: I am neither a Democrat nor a Republican, nor a supporter of some ‘third’ Party, but remain unchanged throughout, consistently a progressive, which means totally dedicated to truth and against lies (such as dominate all forms of conservatism). My criticisms of ‘news’media reflect that, no political-party orientation. \\nOn November 9th, Salon’s reporter Brendan Gauthier headlined Salon’s top-of-homepage headline of the day, “In Donald Trump’s cabinet from hell, corporatism and cronyism run rampant — and Sarah Palin may be there, too” and reported what was at the time speculation that was sourced to an NBC news report, titled “Gingrich, Giuliani, Priebus Eyed for Top Jobs in Trump White House: Sources” , which stated that: \\nAmong the names being considered, according to conversations with three campaign advisers who requested anonymity to speak freely: Rudy Giuliani for attorney general, Newt Gingrich for secretary of state, retired Lt. Gen Michael Flynn for defense secretary or national security adviser, Trump finance chairman Steve Mnuchin for Treasury secretary, and Republican National Committee finance chair Lew Eisenberg for commerce secretary. \\nTrump himself has not taken an active part in transition efforts, in part out of superstition: He fears too much planning before a victory might jinx the campaign. In 2012, he was shocked to read detailed stories on Mitt Romney’s preparations for the White House long before election day… \\nAlabama Senator Jeff Sessions, a loyal supporter, has taken a major role managing the transition effort, especially as the official transition chief, New Jersey Governor Chris Christie, has drifted from the campaign… \\nAsked for comment on the above names floated for cabinet posts, Trump campaign spokesman Hope Hicks replied by e-mail that “none of this is accurate.” \\nGauthier added nothing substantial to that NBC information (of which, maybe, “none of this is accurate”) except to say such uninformative things as that Gingrich “proved himself a rabid Trump surrogate” and as that Giuliani “has been a tireless, if controversial, surrogate for Trump on the trail and in the media.” But in one instance Gauthier linked to a New York Post op-ed by Michael Flynn as being his source by which to allege regarding: “ Department of Defense Retired Lt. Gen. Michael Flynn: Trump’s national security adviser was fired from his post as head of the Defense Intelligence Agency in 2014, which he attributed to his hawkishness.” \\nThat statement about Flynn is outright false. Here is all that Flynn’s op-ed — Gauthier’s cited source — actually said concerning his having been fired by Obama: \\nTwo years ago, I was called into a meeting with the undersecretary of defense for intelligence and the director of national intelligence, and after some “niceties,” I was told by the USDI that I was being let go from DIA. It was definitely an uncomfortable moment (I suspect more for them than me). \\nI asked the DNI (Gen. James Clapper) if my leadership of the agency was in question and he said it was not; had it been, he said, they would have relieved me on the spot. \\nI knew then it had more to do with the stand I took on radical Islamism and the expansion of al Qaeda and its associated movements. I felt the intel system was way too politicized, especially in the Defense Department… \\nI was pissed but knew that I had maintained my integrity and was determined in the few months I had left to continue the changes I was instituting and to keep beating the drum about the vicious enemy we were facing (still are)… \\nWe’re in a global war, facing an enemy alliance that … picks up radical Muslim countries and organizations such as Iran, al Qaeda, the Taliban and Islamic State. \\nThat’s a formidable coalition, and nobody should be shocked to discover that we are losing the war. \\nThere was no indication whatsoever in the article, that Flynn had been fired on account of any “hawkishness.” That allegation by Salon was simply fabricated. \\nThe reality about Flynn’s firing was the exact opposite: he was too ‘dovish’ to suit the neoconservative Barack Obama, who was now demanding that all of his top military generals support his goal of going to war against Russia. Flynn objected to that by saying that only one war at a time makes any sense, and that this war must be the defeat of jihadists, nothing else — certainly not a war against the other nuclear superpower. \\nRather than Flynn’s support of Trump being a reflection of their shared ‘hawkishness’, it reflects their strong belief that the view that Barack Obama holds and that Hillary Clinton holds even more strongly — that the war against jihadists must be subordinated to the war against Russia — is a totally upside-down view of the priorities, and that instead of the U.S. supporting jihadists who are warring against Russia and its allies, the U.S. ought to be supporting Russia and its allies who are warring against jihadists. \\nIf Salon wants to support the Obama-Clinton view and oppose the Trump view on the basis of truthful assertions, then that’s journalism and it is not mere political propaganda. \\nBut if Salon wants to deceive its readers into holding the political viewpoint that they hold, then what else is there to call Salon but a propaganda-site? '"}, "time": 1742628313.7031658}