{"duration": 0.09071660041809082, "input_args": {"text": "\"— Robert B -zee (@robkroese) October 29, 2016 \\nLess than two weeks before the presidential election, the FBI announced the re-opening of the   which includes focus on Anthony Weiner, the husband of top Clinton aide Huma Abedin. \\nThe Washington Post’s David Ignatius tried to lecture Comey about the timing: Note to Comey: In news business, you wouldn't publish story so thin 10 days before election, w/o providing details. https://t.co/dvdQIVWElm \\n— David Ignatius (@IgnatiusPost) October 28, 2016 \\nIs that so? \\n— David Burge (@iowahawkblog) October 29, 2016 You'd at least have the professional decency to forge some documents. https://t.co/3ZcTEZoEYF \\n— THE Chris Coon (@Coondawg68) October 29, 2016 \\nHa! Yes, the “no hits close to an election” lecture is hilarious. And besides: Note to @IgnatiusPost : Comey isn't in the news business, and the biased press is in no position to deliver sanctimonious lectures on ethics. https://t.co/pCH4XwalLJ \\n— (((David B. Cohen))) (@DavidBCohen1) October 29, 2016 @IgnatiusPost Note to Ignatius: He's not in the news business. And he didn't publish the story. You did. \\n— Joel Engel (@joelengel) October 29, 2016 \\nWell, there’s that. \\n— Silence is Consent! (@NoSilentConsent) October 29, 2016 This is fun. The Washington Post chiding the FBI about political ethics #JulietEilperin https://t.co/p3lRmHDOij \\n— Dean Skoreyko (@bcbluecon) October 29, 2016 Local journalist annoyed that FBI doesn't hold himself to journalistic standards https://t.co/itGOdzvsdY \\n— David Rutz (@DavidRutz) October 29, 2016 What a weird and not very useful comparison. https://t.co/WINbyveGcd \\n— Mark Hemingway (@Heminator) October 29, 2016 Note to @IgnatiusPost : in journalism, you wouldn't be condemning government transparency. If u were a journalist. https://t.co/ZUSKaUcC6q \\n— Simon Templar (@SimonTemplarPV) October 29, 2016 \\nA couple years ago, Ignatius called Obama “perhaps the least political president in modern U.S. history,” so nothing should be too surprising. Trending\""}, "time": 1742564514.7203376}