{"duration": 0.16732072830200195, "input_args": {"text": "'HAM LAKE, Minn.  —   One morning last week, Larry Laughlin, a retired business owner, opened his shiny black Dell laptop and scrolled through Facebook. Most of the posts were ordinary news stories from conservative sites: Donald J. Trump’s deal with the Carrier company. The political tussle over the recount. But a few items were his guilty pleasures. “I like this guy,” said Mr. Laughlin, looking at a post by the conservative commentator and author Mark Dice. Mr. Dice has promoted conspiracy theories that the Jade Helm military training exercise last year was preparation for martial law and that the Sept. 11 attacks were an “inside job. ” But Mr. Laughlin likes him for what he said was his humorous political commentary and his sarcastic     interviews. “I just like the satisfaction,” said Mr. Laughlin, who started his own business and lives in an affluent Twin Cities suburb. “It’s like a hockey game. Everyone’s got their goons. Their goons are pushing our guys around, and it’s great to see our goons push back. ” The proliferation of fake and hyperpartisan news that has flooded into Americans’ laptops and living rooms has prompted a national   with liberals across the country asking how a nation of millions could be marching to such a suspect drumbeat. But while some Americans may take the stories literally  —   like the North Carolina man who fired his gun in a Washington pizzeria on Sunday trying to investigate a false story spread online of a   ring led by Hillary Clinton  —   many do not. The larger problem, experts say, is less extreme but more insidious. Fake news, and the proliferation of raw opinion that passes for news, is creating confusion, punching holes in what is true, causing a kind of   effect that leaves the reader doubting everything, including real news. That has pushed up the political temperature and increased polarization. No longer burdened with wrestling with the possibility that they might be wrong, people on the right and the left have become more entrenched in their positions, experts say. In interviews, people said they felt more empowered, more attached to their own side and less inclined to listen to the other. Polarization is fun, like cheering a goal for the home team. “There are an alarming number of people who tend to be credulous and form beliefs based on the latest thing they’ve read, but that’s not the wider problem,” said Michael Lynch, a professor of philosophy at the University of Connecticut. “The wider problem is fake news has the effect of getting people not to believe real things. ” He described the thinking like this: “There’s no way for me to know what is objectively true, so we’ll stick to our guns and our own evidence. We’ll ignore the facts because nobody knows what’s really true anyway. ” News that is fake or only marginally real has lurked online  —   and in supermarket tabloids  —   for years, but never before has it played such a prominent role in an American election and its aftermath. Narrowly defined, “fake news” means a   story with an intention to deceive, often geared toward getting clicks. But the issue has become a political battering ram, with the left accusing the right of trafficking in disinformation, and the right accusing the left of tarring conservatives as a way to try to censor websites. In the process, the definition of fake news has blurred. “Fake news is subjective,” Mr. Laughlin said. “It depends on who’s defining it. One man’s trash is another man’s treasure. ” For Mr. Laughlin, conservative sites are a balm for the soul in a liberal world whose narrative of America, he says, seems to diminish him and all that he has accomplished. He was his own legal guardian at 16, after his mother fled his alcoholic father. He built his metal finishing business from scratch after earning an associate degree from a community college. The company he owned employs about 17 people. He and his wife adopted three   children. “My struggles in life are just dismissed,” he said, recalling being lectured by one of his children’s liberal friends at a party in his large home. “‘You have a nice house and got it made because you are a white guy.’ There are all of these preconceived notions that I’m a racist, idiot, a bigot, and oh, uneducated. ” He feels alienated from the conventional news media for some of the same reasons. “It’s like an inside joke for people on the left, and we are the butt of the joke,” he said of one   website. “At some point, we stopped listening. ” Mr. Laughlin likes news that strikes back against that. These days, he takes the most pleasure in watching clips strung together by conservative websites of liberal commentators sneering about how ridiculous Donald J. Trump was as a candidate and how he had no chance at becoming president. “This is like our sweet release after the election,” Mr. Laughlin said. He said the hyperpartisan environment left him craving intense content. “I’m picking through the fruit and looking for the reddest apple,” he said. But Mr. Laughlin avoids news that looks false, like a story after the election that Mr. Trump won the popular vote, and said he was careful not to click on such items to deny them advertising revenue. He said he cringed when he heard about the incident in the pizza restaurant. “It adds to the stereotype that we’re all nutters,” he said. “We’ll all get lumped together with this guy. ” Adding to the confusion is the fact that Mr. Trump and some members of his team have promoted false items, too, such as that millions of people voted illegally. A similar story had circulated on the site of the conspiracy theorist Alex Jones some days before. For Clayton Montgomery, 57, a retired state department of transportation worker in Waynesville, N. C. the numbers may not be precisely right, but the broad outlines rang true. “All of a sudden they got this big push of registered voters,” Mr. Montgomery said, referring to California. “They were all illegals. The same thing in the state of Washington, Los Angeles and Houston, too. ” He said that Mr. Jones, who has called the Sandy Hook massacre a hoax, “can get a little conspiratorial,” but added that he “raises some very logical and important questions. ” Mr. Montgomery has concerns about immigration. He lived for years in South Florida, where he had a painting business that was deeply affected by cheap labor from Hispanic immigrants. “They can’t say that these people are not taking jobs away from American citizens,” he said. “They come up and they lowball. It hurts a lot of people. ” Another story online alleged that Mexico had a wall along its southern border “with guard towers,” Mr. Montgomery said, to keep “all these other countries from coming in. ” (Mr. Laughlin saw that one, too, but pointed out that the photograph that accompanied the story was from Israel.) Mr. Montgomery pushed back: “Check it out, it’s true!” Mr. Montgomery said he was nostalgic for the news of old, when Walter Cronkite delivered it. But the reputation of the press has been tarnished, he said, and people are left to navigate the fractured landscape on their own. The online content can be frustrating, with headlines that promise more than the story delivers. He noted one with a headline along the lines of “The wait is over Hillary’s being indicted. ” “But then you click and there’s nothing in there about her being indicted,” Mr. Montgomery said. “It’s almost like looking at a menu in a restaurant. Oh, that sounds delicious, it sounds great, and then it’s this teeny weeny thing you maybe get three bites of. ” Fake and hyperpartisan news from the right has been more conspicuous than from the left, but both sides indulge. BuzzFeed analyses have found more on the right. Some purveyors have said   items are more profitable. But the left has its share. The   site Snopes said it found no evidence for a quotation, often attributed to Mr. Trump by the left, that Republican voters were stupid. That type of insult increases the partisan divide. Paul Indre, a project manager for a hardware goods company in Akron, Ohio, who gets his news from podcasts and television, avoids much of online news. But he understands why people go there in a polarized era. Mr. Indre, a moderate Republican, said he remained vigilant against fake news. “If I’m in a Trump group and someone will share something that’s fake news,” he said, “I’ll ask them ‘Hey did you check that? ’” But it is often impossible to tell whether “they are just lobbing a bomb, or do they really believe it?” he said. “You have some folks who are a little naïve, who don’t follow the news and believe it. I mean, people do buy The National Enquirer and believe it. ” “But some of it might be revenge factor, getting back at something they are hearing from the left,” he said. “Maybe they are just reacting to something. Maybe we are just in this reactionary period. ”'"}, "time": 1742561782.8272488}