{"duration": 0.18058037757873535, "input_args": {"text": "'November 22, 2016 -  Deena Stryker, Katehon -  \\n\\n\\nIn 1944, against a groundswell of concern for the democratic process, FDR ran and won a fourth presidential term, because Americans did not want an untried leader in the midst of two wars. (Unfortunately, Roosevelt died soon after that election, leaving President Truman to formulate the disastrous American policy toward the Soviet Union that brought us Cold Wars I and II.) \\nToday, FDR’s presidency would probably be considered ‘authoritarian’: he pretended not to see Japan preparing to attack Pearl Harbor, so that shocked Americans would finally be willing to declare war on both Japan and Germany. He is famous for packing the Supreme Court, and although they were milder than would have wanted the Progressive Movement, he wrung workers’ rights and protections out of Congress by signaling to his advisors “Make me do it.” He is still revered today, while one of the polities that ranks highest on key governance criteria is Singapore, a tiny, multi-ethnic country led by the same man for four decades. \\nAfter achieving independence from Great Britain, Lee Kuan Yew moved Singapore’s Third World economy to First World affluence in a single generation. According to Wikileaks: “Lee Kuan Yew\\'s emphasis on rapid economic growth, support for business entrepreneurship, and limitations on internal democracy shaped Singapore\\'s policies for the next half-century. Freedom House ranks Singapore as \"partly free” and The Economist ranks it as a \"flawed democracy\", however the ruling party gets 83 of 89 seats with 70% of the popular vote, while in the mid-eighties, Gallup reported Singaporeans’ confidence in the government and judicial system among the highest in the world. \\nAlthough Singapore ranks among the top countries for \"order and security\", \"absence of corruption\", and \"effective criminal justice,” gatherings of five or more people require police permits, and protests may legally be held only at the Speakers\\' Corner. Yet, this multi-lingual (English, Chinese and Hindu), country is among the top internationally in education and government supported health care. Although the system can only be classified as authoritarian, there is absolutely zero chance that a US president will declare that its leader “has to go”. That is because like Europe, it combines entre-preneurship with socialist citizen protections. \\nToday, ’authoritarianism’ is applied equally to the Saudi Arabian monarchy, where women are not allowed to drive, much less legislate, to China, where the Communist Party watches over the biggest ever economic miracle, and to Russian president Vladimir Putin. Interestingly, it was not applied to Dmitri Medvedev when he was President (Vladimir Putin serving as his Prime Minister). Medvedev was referred to as ‘a man we can work with’ —and even as ’Our man in the Kremlin’. \\nAt home, however, his ‘Atlanticist’, neo-liberal faction is referred to by Putin supporters, who cherish their social protections and believe the state should be in charge of a nation’s key sources of wealth, as a ‘fifth column’. \\nWhat was the state of Russia when Vladimir Putin succeeded Boris Yeltsin, America’s first ‘man in the Kremlin’? \\nPutin first won election in 2000, three months after Yeltsin’s resignation for ill health. At forty-eight, thanks to his steadfastness as a KGB officer, then as advisor on international affairs to the mayor of St Petersburg, as head of the KGB, then Prime Minister to Boris Yeltsin (a president famous for his drunken displays), Putin was his designated successor at a time when Russia was in a shambles. \\nIts crown jewels had been privatized at rock bottom prices to a group of men who became known as ‘the oligarchs’. State employees weren’t getting their paychecks on time — if at all — and virtually nothing had been done to build a fair liberal —or social democratic — system ten years after the dissolution of the Soviet Union. (When Vladimir Putin declared that this event had been a catastrophe, he was not, as the Western press implies, alluding to the demise of Communism, but to the terrible social conditions in which rabid privatization left most Russians.) \\nPutin is invariably tagged as a ‘former KGB officer’ by US journalists, who conveniently forget that the first President Bush ran the CIA for a year. The truth is that the Russian president’s wide-ranging jobs prepared him well for the challenge of reviving the largest country in the world, home to 160 ethnic groups speaking some 100 languages and practicing four different religions, Christianity, Judaism, Buddhism and Islam—(estimates for this latter ranging from 5 - 14%). \\nThe Western media claims that President Putin’s 80%+ ratings reflect a herd mentality, the result of centuries of autocratic rule under the Mongols (four centuries), the Tsars and the Communist Party. In reality, unbeknownst to most Americans, today’s Russians enjoy individualist lifestyles, vacations abroad and the latest cars. \\nFor twenty centuries, the lure of Athenian democracy (in which only free males participated) increased in tandem with the power of Kings. But applying democracy has proved ever more difficult as populations and threats grew larger. As he prepares to leave office after eight years of Republican refusal to cooperate with his laudable projects, I suspect President Obama, like most other Western heads of state, secretly envies Putin his ability to get things done. \\nWhen I was in Cuba in 1964, Fidel Castro was being billed in the US as a dictator. I asked then president Osvaldo Dorticos whether or not he agreed that it was risky to have a ‘king’, since one could never know whether inherited leadership would be good or bad. (The outside world did not know that the Cuban government was already experimenting with various forms of local democracy.) Today around the world, ‘the people’ are still impotent to prevent worsening economic conditions — and even war, which first fills the coffers of arms makers, then of industry, needed to rebuild what war has destroyed. Yet Raul Castro has overseen a transition toward a form of national participatory democracy, and Putin appears to be encouraging the same approach in Russia. Meanwhile, in the West it becomes increasingly difficult to affirm that free and fair elections guarantee efficient government or popular satisfaction. \\nIn the complex 21st century world, peace and prosperity are probably best achieved when strong central governments jointly deal with global challenges, while participatory local governments oversee domestic affairs. (Iceland, a country so sparsely populated that almost everyone knows everyone else, is successfully applying this system.) \\n\\nAlthough he has been elected ‘fair and square’, Donald Trump may not make it into the White House, whence he, together with Putin and Xi could move toward a multi-polar world organized along those lines. Guided by ‘an invisible hand’, thousands of people protest the neo-fascist, misogynist, racist president who defeated his neo-fascist rival preparing for nuclear-war against Russia, and whose backers, unlike the protesters, have the means to once again implement the ‘ultimate solution’ against an American president. \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742561687.5489814}