{"duration": 0.01580214500427246, "input_args": {"text": "'BORDER FLOOD BEFORE VOTE… 275,000 Born to Illegals — In One Year; 7% OF ALL USA BIRTHS… Agent: Admin Treats Crossings ‘Like Traffic Ticket’   Tweet Spike In Immigrants Illegally Crossing Into US Ahead Of Election \\nThere has been a surge of immigrants illegally crossing into the United States leading up to next month’s presidential election. \\nCBS News reports dozens of immigrants have been streaming through the streets of McAllen, Texas, on a daily basis. They have been taken to a migrant center at Sacred Heart Catholic Church where they were released by Border Patrol, with ankle monitors, while they file for asylum. \\n\\n\\nMoms in the United States illegally gave birth to 275,000 babies in 2014, enough birthright U.S. citizens to fill a city the size of Orlando, Florida, according to an analysis of data from the National Center for Health Statistics. \\nThe data showed that newborns to illegals accounted for 7 percent of all births in 2014, according to the analysis from the Pew Research Center. Feds: 275,000 born to illegals in one year, would fill city the size of Orlando \\n“In 2014, about 275,000 babies were born to unauthorized-immigrant parents in the U.S., accounting for about 7 percent of all U.S. births, and 32 percent of all U.S. births to foreign-born mothers,” said Pew’s newly released report. Border Patrol Agent: Admin Treats Illegal Crossings ‘Like a Traffic Ticket’ Chris Cabrera says the administration is actively trying to ‘circumvent their own laws’ \\nU.S. Border Patrol Agent Chris Cabrera said that the federal government is “trying to circumvent their own laws” by preventing the agents from securing the border and curbing illegal immigration during an interview Wednesday on “The Laura Ingraham Show.” \\nDuring an interview with CBS News Tuesday, Cabrera said the impending presidential election was one of the main causes of recent “mass spikes” in illegal crossings. Saying that the immigrants have been told that if Hillary Clinton is elected there will be “some sort of amnesty,” Cabrera added that they’ve been told if Donald Trump is elected, “there’s going to be some magical wall that pops up overnight and once that wall gets up, nobody will ever get in again.” \\nCabrera told Ingraham the federal government is impeding the agents’ efforts to contain the rush on the border. \\n“And you know, we’re just doing what the law says and what our job is,” Cabrera told Ingraham. “Apparently, they’re trying to circumvent their own laws, and we just want to do our jobs the way we know how to do it and the way we were trained to do it.”'"}, "time": 1742628561.5918646}