{"duration": 0.16584277153015137, "input_args": {"text": "'BAD NEWS: Hillary’s Pimping Past Exposed, Dirty Whoring Details Leaked Posted on October 31, 2016 by Robert Rich in Politics Share This \\nIf Hillary Clinton thought she was in big trouble with the FBI, she’s got another thing coming when she hears what’s just around the corner. In fact, it seems as though the presidential hopeful’s pimping past was just leaked – and every whoring detail is out there for the world to see. \\nHillary is no saint, despite what she would have you believe, and her apparent pimping past goes to prove just that. According to a recent leak, it seems that the female presidential wannabe is used to whoring out certain entities – so long as she gets to stuff her pockets. \\nSo, who exactly did Hillary force to grab their ankles so that she could rake in millions of dollars? Well, America – more specifically, the American working class. As explained by The Daily Caller , Hillary accepted a whopping $28 million donation to the Clinton Foundation in exchange for 2 favors granted to the country of Morocco. Bill Clinton (center right) and Hillary Clinton (center left) greet Mohammed VI, King of Morocco (right), and his sister, Lalla Meryem (left) \\nCome to find out, the first part of the payment came in at $15 million from the country’s King Mohammed VI. Just after that, Hillary miraculously got to work on the Mosaic Company – America’s largest phosphate mining facility. For those unaware, phosphates are used in a variety of products but are most well known for being used to make fertilizer for farmers. \\nAs it turns out, one of Morocco’s largest bases for income just so happens to be the selling of phosphates that they illegally rip from their lands. In order to put pressure on Mosaic, in hopes of shutting them down, Hillary deployed the use of both the Environmental Protection Agency (EPA) and the Department of Homeland Security (DHS) in an effort to deem the group an “environmental threat” to our country. \\nIn order to do so, Hillary had the DHS fly planes low over Mosaic’s operations in order to spy on them. From there, EPA chief Lisa Jackson got to putting the crunch on the organization by making their lives a living hell in every single way. Hillary Clinton \\nIn the meantime, Hillary used her position as Secretary of State to relax U.S. foreign aid restrictions on Morocco, thereby allowing the country to expand operations into phosphate mining. By the end, the American company was to be shut down, forcing America to look elsewhere for supply – which, if you can connect the dots, would be where Morocco would come sweeping in. \\nFortunately, Florida politicians were able to fight back and put the brakes on before tens of thousands of Americans were negatively influenced by the devious deed. However, Hillary and the King of Morocco weren’t done there as he pumped another few million into the Clinton Foundation’s account. \\nAs explained by The Daily Caller : \\nAn email WikiLeaks made public last week illustrated how Clinton, while acting as secretary of state, negotiated an additional $12 million donation to the Clinton Foundation from Muhammed in return for holding the 2015 Clinton Global Initiative (CGI) meeting in Marrakech, Morocco. \\nHillary also managed to squeeze another $1 million out of the King to cover the expenses of the CGI meeting. As one would imagine, the recent leak hasn’t made too many people happy, and it exposed how Hillary has been whoring out our nation any way she can in order to further fill her own pockets. \\nAccording to Rep. Marsha Blackburn, a Tennessee Republican, “these facts seem to reveal the possibility of more pay-to-play activities at the Clinton Foundation.” Personally, I don’t understand why we can’t call this what it is – bribery. \\nUsing fancy terms takes away from the criminal behavior that Hillary has been complicit in. Furthermore, she has proven that she is perfectly comfortable with illegal behavior – as well as pimping out the American people, specifically the working class – so long as she benefits from it. If she did all this in just the short time she was Secretary of State, I shudder to think what she will do with the full power of the presidency behind her.'"}, "time": 1742563042.943504}