{"duration": 0.03173398971557617, "input_args": {"text": "\"Font Size are they doing humankind? Elsewhere, the U.S. State Department operatives were busy little bees. Again through NGO involvement the warmongers set their sights on Ukraine. The bigger prize though was Russia. By launching the Maidan Color Revolution chicken hawks in the U.S. Congress hoped to establish a bridgehead on Russia's very borders; the duplicitous MSM reported this intervention in terms of their own bias; it was vital to stop to 'Russian aggression'. Each step of every day the Kiev coup murderers continued to vilify Russian President Vladimir Putin. Wise to the U.S. 'end game strategy', Crimea, home to the Russian Black Sea Naval fleet at Sevastopol, voted to accede to Russia. East Ukraine was not as fortunate. To this day, despite signing the Minsk II roadmap for peace agreement the Nazi Kiev hordes continue to terrorize Russian speakers in the Donbass region; innocent civilians are killed and maimed each day by prohibited artillery bombardment from Ukraine. Of course, the junta blames Russia for the hostilities. The Obama Administration goes further: it tries to lure President Putin into the fray. The Pentagon crazies chomp at the bit to engage Russia on an open but foreign battlefront. Several new war fronts. It will continue The Establishment was not done yet. With help from the usual suspect NGO's, NATO opened several new war fronts in the Middle East. Syria and its democratically elected President Assad are in their gun sights; tiny Yemen is another potential military target to be exploited by Washington; but the Houthi militia has put up a fierce resistance. Oddly enough ISIS or Daesh is never on America's military radar screens; but when Russia fights the Islamic Terrorists it is headline news. Since a desperate Clinton invoked the Big Daddy, err, Baghdadi name at the third debate, the Mosul Campaign in Northern Iraq has commenced. The biased MSM deny coincidence. No one buys it. Given the chaotic and disjointed foreign policy 'objectives' of this current U.S. Administration and its crooked backers, Republican candidate, Donald Trump was compelled to act; he stepped in. The Donald entered the breach. Using clear logic Donald Trump has enunciated to Americans what needs to be done: change course; turn 180 degrees. Moreover, Trump has identified and charged as incompetent the real culprits behind this disastrous policy. Chief amongst those is Democrat challenger Hillary Clinton. Clinton was the sole advocate for these failed foreign misadventures. And people are going to vote for her? As a former Secretary State, Clinton was the sole advocate for these failed foreign misadventures in the Middle East. While under oath she lied to Congress as to her real motivation: broker arms to 'moderate' rebel groups in Syria. She continues to lie to the American people about Benghazi. During the Commander-in-chief forum, Clinton claimed no Americans were lost in Libya. Clinton though was remiss to mention the deaths of Ambassador Stevens and three others. Those four were murdered on her watch. With his legions of supporters massed around the country, Donald Trump is now poised to march on Washington, DC. All of the Establishment stooges are broken. Although they tried mightily the complicit media could not put Humpty-Dumpty-Frumpy candidate Hillary Clinton back together again. She is too far gone; with the help of Wikileaks, the electorate will soon learn more about her scandals and wanton corruption that she keeps hidden. Her feckless campaign is lost. Yes indeed; the one per centers got more than they bargained for; much to their angst. Contempt.... Scorn.... Slight regard.... Defiance! Come Election Day that is 'the movement's' message to the Establishment. American patriots are going for the knockout on November 8th. With President elect Donald Trump's help they will take their country back; make it great again! Montresor\""}, "time": 1742628563.2718284}