{"duration": 0.055498600006103516, "input_args": {"text": "'Following up on a campaign promise that appealed directly to his Rust Belt base,   Donald J. Trump said Thursday that he had reached out to the Carrier air conditioner company in Indiana to ask it not to move more than 2, 000 factory jobs from Indiana to Mexico. In a post on Twitter Thursday morning, Mr. Trump said: “I am working hard, even on Thanksgiving, trying to get Carrier A. C. Company to stay in the U. S. (Indiana). MAKING PROGRESS   Will know soon!” During both the primary and general election campaigns, Mr. Trump frequently cited the February decision by Carrier and its corporate parent, United Technologies, to close two Indiana factories and move production to Mexico as an example of how Nafta and other   agreements had failed American workers. In a recent New York Times article, workers at one plant in Indianapolis warned that they would withdraw their support for Mr. Trump if he did not keep his promise to bring back overseas jobs. The two plants  —   a Carrier factory employing more than 1, 400 workers in Indianapolis and a United Technologies plant with 700 employees in Huntington  —   are profitable, but pay workers $15 to $26 an hour  —   about what the company’s workers in Monterrey, Mexico, earn in a day. In a time of slow economic growth and intense pressure from Wall Street to improve profits, moving production south of the border seemed like too good of an opportunity for United Technologies’ executives to pass up. However, a shaky video of the announcement on the Carrier factory floor  —   and the furious reaction of workers  —   went viral in February. It caught Mr. Trump’s attention, prompting a furor throughout the campaign. In a tweet Thursday after Mr. Trump’s tweet, Carrier confirmed that the   had reached out, but refused to say what steps, if any, management was now considering. “Carrier has had discussions with the incoming administration and we look forward to working together,” the company said. “Nothing to announce at this time. ” For workers in Indianapolis, the Twitter exchange provided a ray of hope on an otherwise anxious Thanksgiving holiday. “Everyone is posting about it on Facebook and there’s a lot of excitement,” said Paul Roell, who has worked at Carrier for 17 years and was an enthusiastic supporter of Mr. Trump in the election. “I’m a little more optimistic now,” he said. “Others are saying, let’s see if he’s really going to do this. ” “I was very surprised to see it on Thanksgiving today,” Mr. Roell added. “I figured he’d be like everyone else today, with his family, not thinking of Carrier. ” Earlier in the week, Indiana state officials had come to the factory to describe what benefits workers could expect as layoffs approach, Mr. Roell said. The first production lines are expected to shut down in August 2017. “If he can get them to stay here, I’m all for it,” said Robin Maynard, a Trump supporter. “I’m hoping he can get stuff done and also save me from having to look for a new job. ” Other workers, especially those who did not support Mr. Trump in the election, were more skeptical. “It’s baloney,” said Jennifer   who has worked at Carrier for a decade and a half and earns over $21 an hour, well above what similar   jobs pay in the area. “I could see him reaching out to Carrier, but I don’t think anything will happen,” said Ms.   who added that she “reluctantly” voted for Hillary Clinton this month. “He can try and talk to them, and it’s good that he mentioned it, but I think Carrier will still leave. ”'"}, "time": 1742563587.2612576}