{"duration": 0.07869863510131836, "input_args": {"text": "'Adam Morgan, Editor in Chief of the Chicago Review of Books, published an article in The Guardian today where he called MILO’s new book “hate speech” and claimed that it would inspire the likes of Omar Mateen and Dylann Roof. [Adam Morgan, the Editor in Chief of the Chicago Review of Books, published an article today in The Guardian explaining why the Chicago Review of Books chose to boycott Simon  Schuster, the company publishing MILO’s new book, DANGEROUS.   The title of the Guardian article reads, “Publishing Milo Yiannopoulos’ book is wrong. My magazine is fighting back. ” However the URL of the article and the Facebook sharing preview reveal the title, “Simon  Schuster is rewarding   hate speech. We cannot stay silent. ” This may be a simple error but it is also likely that the title calling MILO’s book “  hate speech” was the original tile of the article. The Guardian may have realised their error in calling MILO “ ” a political movement which MILO has repeatedly stated he is not part of, despite the media’s various attempts to paint him as a “leader” of the movement, and changed the article title. Morgan’s article goes on to make a number of claims such as, “2016 taught us that ridiculing women, people of colour, Muslims and members of the LGBTQ community can make someone immensely popular,” and that MILO is, “not a conservative intellectual leader with a political agenda. He’s a clickbait grifter who has made a name for himself spewing hate speech. ”  What Morgan considers to be “hate speech” have garnered MILO a position as Senior Editor of one of the largest political news website on the internet, media appearances on news outlets across the world, over one million Facebook likes and an army of fans that listen to him speak at his immensely successful Dangerous Faggot college tour. Morgan then states that he “made a decision that has nothing to do with political ideology and everything to do with human rights and decency,” by refusing to review Simon  Schuster books in 2017. Exactly what human rights MILO’s book is denying people, Morgan fails to state.  Morgan then states that MILO’s book may inspire terrorist acts. “Rhetoric like [MILO’s]  —   which targets racial, religious and cultural minorities  —   invites discrimination. It arguably encourages people such as Omar Mateen and Dylann Roof to think of entire groups of people as less than human. ” MILO of course gave a speech at the site of the Pulse nightclub shooting in Orlando where he urged the gay community to fight back, to let it be known that they will never let an attack such as the one at Pulse nightclub happen again, and that they will protect themselves if the left will not.  When asked for comment on the accusation that his words will lead to terrorism MILO said, “Following Omar Mateen’s horrific crimes, I travelled to Orlando and spoke out against Islam’s hatred of homosexuals outside Pulse nightclub. The websites Dylann Roof is associated with hate me as much as anyone. Regressives like Adam Morgan can’t stand free speech or opposing viewpoints being heard. ” Further discussing the Chicago Review of Books’ decision to refuse to review Simon  Schuster books in 2017, Morgan states “After the Chicago Review of Books attracted so much attention for our stance, and writers more talented than me asked us to reconsider, I lost sleep. But on Saturday, when the biographer of a lesbian artist criticised Simon  Schuster, Yiannopoulos responded: ‘There is only one place for lesbians: porn. ’” Read the article in full here. DANGEROUS is available to   now via Amazon, in hardcover and Kindle editions. And yes, MILO is reading the audiobook version himself! '"}, "time": 1742562404.5356011}