{"duration": 0.1354832649230957, "input_args": {"text": "'Were I healthy enough these days, I would be sipping a glass of free wine and running my hands over an exquisite accent pillow in an impossibly hip showroom called something like Space or Lust, while a sales assistant speaks to me of the virtues of aniline versus   leather. “So you really think   hardwood is worth the extra expense?” I’d be asking. And, “Does this come in a  ?” Instead, I’m propped in bed on a dozen pillows with my laptop, perusing online furniture stores: West Elm, Joybird, Crate  Barrel and something called Chairish. I am an internet   fiend. I take breaks only when the oxy overwhelms me and my head starts to loll. I cannot rest until I have considered every        sofa the worldwide web has to offer. I pore over design sites like Apartment Therapy, Design Sponge and Domino: searching, searching. Since John and I married 16 years ago, we have never had a real   couch. We’ve had plenty of   misfits: “as is” Ikea specials, parental handoffs, Craigslist   roadside rescues. First we were broke, and then we had babies. It never seemed like the right time to splurge on anything nice. And the misfits have been fine. We’re not fancy, and our taste is eclectic. Our house is full of objects that are stronger on personality than looks: the wood box my father and uncles sat on as children to lace their boots for sledding, a lumpy chaise by the front window in the world’s coziest reading nook. Anyway, whenever we have needed to get down to the serious business of life, we have always preferred to retreat to our bed: our war room, cocoon, escape hatch and, at times, dining room. But in the weeks after I learned that the breast cancer I have been in treatment for over the past year had spread to my bones  —   breaking my spine and becoming incurable and most likely fatal  —   finding the perfect   couch has begun to feel like the most important thing I’ve ever done. Except, just when I find one I love, it turns out I can’t click “buy now. ” And commitment issues have not generally been my problem. Houses, cars,            mastectomy: Bring it. Usually I just pick a   option and don’t look back. Within 10 minutes of meeting John at a summer job at 21, I had already mentally signed on for life  —   although I waited at least a week to tell him that. But the couch. I can’t do it. Maybe I’m holding off until after my next big oncology appointment, as though something my doctor may say will help determine whether I am willing to spend the extra money for Dacron batting and   cushions. She promised some new thoughts about treatment options: immunotherapy, clinical trials,   drugs, acupuncture, the dreaded “watchful waiting. ” It’s a complicated calculus. On the one hand, a basic   analysis: How much money do I want to spend on something I may not be around to really enjoy? On the other: Isn’t buying an expensive couch a kind of lovely expression of hopefulness? And after I’m gone, don’t I still want guests in my home to feel comfortable and stylish? None of this was supposed to happen. At 38, I wasn’t supposed to lie on my back in the E. R. on a late December morning and be told by a teary radiation oncology resident that the pain I’d been having for two months  —   that I’d been assured was from having a weak core after months of chemo  —   was actually from a tumor that had devoured my L2 vertebra. John wasn’t supposed to have to hold me up on the toilet. Put my pants on for me. Do Christmas Eve for the children without me. I’m not supposed to be thinking about where he will sit and hold my hand as I take my last breath. Despite all the pamphlets the social workers gave us when I was in the hospital, we don’t really know how to talk to our boys yet. They are 6 and 9. They know about the cancer and the back break, but they don’t really know what it all means. Instead I ask the    “What do you think of leather upholstery?” “Depends if it’s slippery or nuzzly,” he says. Excellent point. I think I need to take any bonded leather options  —   no matter how cute or economical they seem  —   off my favorites lists and go with  . The day after the emergency surgery, when my doctor was sitting on the end of my bed in the oncology ward, I saw her glance toward those pamphlets that had been left on the bedside table: “What to Tell Your Children About Your Progressive Disease. ” She’s a mother, too. Her children are only a couple of years older than mine. “Is it time to despair?” she said during a pause in our discussion about pain management and radiation, maybe reading one of the pamphlet headings. “No!” she proclaimed, staring straight at me. “No, it is not. ” I trust her completely, even after the chemo failed twice and the cancer spread when she said it wouldn’t. Whatever it is in oncologists that makes them want to be oncologists  —   that crazy mix of fierceness, optimism, arrogance and compassion  —   I get a contact high from it. It’s like love at first sight, or touching something on fire. It’s like making a choice and refusing to look back. John is mildly   averse, but he’s treading carefully. He knows me well enough to understand that when I’m dissertating on the merits of tufted cushions, I’m chewing on something else. “Custom upholstery, really? With two boys?” he asks, flipping through insurance statements on the counter. “O. K. well, I think you should get whatever you’re into. ” One big upside of being told I have incurable cancer is that after all these years, my husband has finally stopped smugly saying, “It’s your funeral,” when I make a decision he doesn’t agree with. “Did you spend thousands of dollars on the internet today?” he asks when he gets home from work and finds me with my pillows and   bottles on the   couch where he left me in the morning, a   rattan situation my parents bought as patio furniture in the early ’90s. “Not today,” I say. “Nice,” he says. “Do you want to go get in bed together and stare at the ceiling?” I do. We do. In January, the afternoon already looks like evening. “Can you believe we found out you have incurable cancer on, literally, the darkest day of the year?” John asks as we hold hands and stare up toward the same blank spot above our bed. “Yeah, I totally can,” I say. We both laugh. I have always loved the sound of him laughing: soft and comfortable, understated, offbeat, with unmistakably sleek midcentury lines. He takes me gingerly in his arms as if we are awkward teenagers. My back spasms, but I wiggle closer to him until I can put my head on his chest and hear his heart beating. Downstairs, the boys gaze at a screen on the old futon in the playroom. We will figure out what to do about them soon enough. They probably already know what’s up and are waiting for us to figure out how to say it. Despite not being much of a Christmas person myself, I hated not being able to watch them open presents and can’t bear the thought of never doing it again. Their very existence is the one dark piece I cannot get right with in all this. I can let go of a lot of things: plans, friends, career goals, places in the world I want to see, maybe even the love of my life. But I cannot figure out how to let go of mothering them. So maybe I don’t try to figure it out. Maybe I just aim to get the couch right: strong bones,   leather, something earthy and animal and real. A surface that knows something of what it was to be alive, that warms to our touch and cools in our absence. Also: an expansive bench that fits all of us. Something that will hold us through everything that lies ahead  —   the loving, collapsing and nuzzling. The dying, the grieving. I know my thoughts have probably diverged from whatever John is thinking about in the near dark of our bedroom. He is silent. Maybe he is dozing. Buying a sofa online, like many of life’s biggest decisions, takes research and trust, but mostly trust. As I lie here, with John’s chest rising and falling under my cheek, I realize that my careful calculations (How long do I have left? Who am I really buying this couch for? Am I getting a good deal?) are irrelevant. As in all things, I have to believe I’ll know what’s right when I see it.'"}, "time": 1742562440.894587}