{"duration": 0.08942246437072754, "input_args": {"text": "'FBI Reopens Hillary Clinton Email Case After New Information Surfaces Posted on Oct 28, 2016 FBI Director James Comey testified on Capitol Hill in July and said the probe of Hillary Clinton’s private email server was finished. ( Evan Vucci / AP ) \\nThe heat is back on Hillary Clinton. On Friday, the FBI told Congress that it is reviewing its investigation of her private email server after new emails emerged. \\nAccording to The New York Times, the new information came from Anthony Wiener’s electronic devices in an unrelated case. Wiener is the husband of Huma Abedin, one of Clinton’s top aides. \\nThe latest developments could lead to the FBI reopening its criminal investigation into Clinton. \\nIn the letter to Congress, FBI Director James Comey stated: \\nIn previous congressional testimony, I referred to the fact that the Federal Bureau of Investigation (FBI) had completed its investigation of former Secretary Clinton’s personal email server. Due to recent developments, I am writing to supplement my previous testimony. \\nIn connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation. I am writing to inform you that the investigative team briefed me on this yesterday, and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation. \\nAlthough the FBI cannot yet assess whether or not this material may be significant, and I cannot predict how long it will take us to complete this additional work, I believe it is important to update your Committee about our efforts in light of my previous testimony. \\nThe Associated Press reported that the Clinton campaign and White House did not have any immediate comments . \\nRepublican presidential nominee Donald Trump, who believes Clinton set up a “criminal scheme,” was happy with the news. \\n“Perhaps finally justice will be done,” Trump said. \\nState Department spokesman Mark Toner said the department would “cooperate to the full extent that we can.” \\nHouse Speaker Paul Ryan had little sympathy for Clinton and said she has “nobody but herself to blame.” \\n“She was entrusted with some of our nation’s most important secrets, and she betrayed that trust by carelessly mishandling highly classified information,” Ryan, R-Wis., expressed in a statement. “This decision, long overdue, is the result of her reckless use of a private email server, and her refusal to be forthcoming with federal investigators. I renew my call for the Director of National Intelligence to suspend all classified briefings for Secretary Clinton until this matter is fully resolved.” \\nREAD: The Podesta Emails From WikiLeaks \\nThe Democratic presidential nominee got a pass this summer on her “extremely careless” handling of classified information while secretary of state. We shall see if the latest developments lead to further criminal action against the Democratic presidential nominee or impact the election on Nov. 8.'"}, "time": 1742562441.8256936}