{"duration": 0.15135884284973145, "input_args": {"text": "'Richard N. Bolles, a former Harvard physics major, Episcopal minister and career counselor whose own twisting vocational path led to his writing “What Color Is Your Parachute?”  —   the most popular  ’s manual of the 1970s and beyond  —   died on Friday in San Ramon, Calif. He was 90. His son Gary said he died in San Ramon Regional Medical Center. Mr. Bolles lived nearby in Danville, Calif. Mr. Bolles (pronounced bowls) originally   his manual in 1970 as a photocopied   booklet for unemployed Protestant ministers. In 1972, he recast it to appeal to a wider audience and found an independent publisher in Berkeley, Calif. willing to print small batches so that it could be frequently updated. Since then, “Parachute” has sold more than 10 million copies worldwide and has never been out of print. In 1995, the Library of Congress placed Mr. Bolles’s book squarely within the canon of classic American   literature by including it, along with Dale Carnegie’s “How to Win Friends and Influence People” and the “The Autobiography of Benjamin Franklin,” in “25 Books That Have Shaped Readers’ Lives,” a list compiled as part of a nationwide   program. The book’s unconventional yet pragmatic advice, whimsical narrative style and vintage graphics  —   reminiscent of “The Whole Earth Catalog,” another   survivors’ manual of the time  —   earned it respectful reviews for its reliable research and an early    following among career counselors and personnel directors. It also found a fan base among   attracted to Mr. Bolles’s homespun style  —   a fusion of boot camp rigor (  should spend at least 40 hours a week hunting) practical advice (“If you’re being interviewed over lunch, never  —   never  —   order a drink . .. Don’t . .. do . .. it! . .. Even if they do it”) and muted spirituality.   was an art form, more like dating than like selling a used car, he told readers. “You may never understand why things sometimes work, and sometimes don’t,” he wrote. With that in mind, Mr. Bolles said, “What Color Is Your Parachute? ,” subtitled “A Practical Manual for   and Career Changers,” was framed less as a guide to the job market than as a guide to help readers understand themselves  —   to help them figure out what they really liked doing so that they could find the job that would let them do it. “You need firm ground to stand on,” Mr. Bolles told an interviewer in 2000. “From there you can deal with the change. ” Mr. Bolles, an ordained Episcopal minister until 2004, when he left the ministry, said the title of his book came from an   discussion he had in the 1960s with parishioners who were unhappy in their jobs. They would say they were thinking of bailing out. “And I always thought of an airplane when I heard that phrase,” he said. “So I would respond, ‘What color is your parachute?’ ” “Parachute” climbed   rankings slowly but steadily throughout the decade. In 1979, it reached the New York Times   list, where it remained for more than a decade, returning intermittently for years afterward. Mr. Bolles was well qualified to write a handbook on changing direction he had changed his own several times, from planning a career in the chemical industry to becoming a minister and then, at 41, experiencing being fired and enduring the anxiety of unemployment at a time when he and his wife then, the former Janet Price, had four small children. It had never entered his mind, though, that he would write a blockbuster. “I was just trying to help people be better prepared than I was when I was fired and started looking for a job,” he said in an interview for this obituary in 2014. Yet whether he knew it or not, Mr. Bolles had anticipated a sea change in the relationship between workers and employers in the United States, said Micki McGee, an associate professor of sociology at Fordham University and the author of “  Inc.: Makeover Culture in American Life,” a 2005 examination of   literature that includes an analysis of Mr. Bolles’s book. She said “Parachute” had come along at the beginning of a historic shift, when corporate strategies like outsourcing, subcontracting, downsizing and mergers were starting to erode traditional notions of job security. The idea that you could stay in one job for a lifetime began coming undone in the early 1970s, and “Parachute’s” perennial sales reflected, at least in part, this new reality. Mr. Bolles said he had come to acknowledge that connection over time, but, he added wryly, the success of “Parachute” had also reflected the fact that it was a pretty good book. Richard Nelson Bolles was born on March 19, 1927, in Milwaukee, the first of three children of Donald Clinton Bolles, an editor for The Associated Press, and the former Frances Fifield, a homemaker. His brother, Donald Jr. who followed his father into journalism, was killed in 1976 in Phoenix when a bomb detonated under his car. Don Bolles was then working as an investigative reporter for The Arizona Republic, and the killing was widely believed to be linked to a series of exposés he had been writing about corporate and organized crime in the state. The assassination resulted in the prosecution of one person but remained largely unsolved. After serving in the Navy at the tail end of World War II, Richard Bolles studied chemical engineering for two years at the Massachusetts Institute of Technology, then transferred to Harvard, where he earned his bachelor’s degree cum laude with a major in physics. While still an undergraduate, he was moved by a sermon he heard one Sunday at church about a critical shortage of ministers. After graduation, instead of accepting a lucrative job offer in the chemical industry, he decided to become an Episcopal minister. He attended General Theological Seminary in New York, where he received a master’s degree in New Testament studies and was ordained in 1953. He served as a rector at several churches in northern New Jersey, including St. John’s in Passaic, where he often counseled teenagers on sex and drug use. After participating in the 1963 March on Washington led by the Rev. Dr. Martin Luther King Jr. he reached out to an   church in Passaic and, with its pastor, the Rev. Avery Johnson, led the integration of their churches, despite the opposition of some parishioners. Mr. Bolles had been a clergyman for 18 years when a combination of budget problems and philosophical differences with superiors led to the elimination of his job and his dismissal in 1968 as a pastor at Grace Cathedral in San Francisco, the flagship church of the Episcopal Diocese of California. After six months of anxious searching, he landed a job in 1969 with United Ministries in Higher Education, an interdenominational church organization that had long been involved in recruiting and supporting college chaplains across the country. But college chaplains were increasingly being laid off, leaving Mr. Bolles a new mission: to help chaplains at campuses in seven Western states find new careers. That effort led him into research that inspired him to write the   manual that evolved into “What Color Is Your Parachute?” Among his other books was “The Three Boxes of Life and How to Get Out of Them,” on balancing work and personal life. Besides his son Gary, he is survived by his wife, Marci Mendoza Bolles two other children from his first marriage, Stephen and Sharon Bolles and 10 grandchildren. A third son, Mark, died in 2012. In the 2014 interview, Mr. Bolles said he hoped his franchise would continue after he was gone. His son Gary, he said, had asked him about updating future editions of “Parachute” and finding other   experts who might provide new advice. “I told him to make sure to find people who were funny, have a lightheartedness about them,” Mr. Bolles said. “When you are out of work and on the ropes, that is so important. ”'"}, "time": 1742561703.6875648}