{"duration": 0.17468881607055664, "input_args": {"text": "'YUCCA VALLEY, Calif.  —   The Pioneertown Motel is a dusty,   inn with 20 rooms in a remote community named Pioneertown, in the middle of the desert in Southern California. The motel, recently renovated by its new owners, has an outdoor makeshift lobby and offers few amenities aside from morning coffee,   and a parking space large enough for a pickup truck outside each room’s door. Across the parking lot is a street that was built as a film set, with an   saloon, post office, bowling alley and a trading post. In April, the motel was fully booked, with a wait list. Hundreds of music lovers had caravaned from the Coachella Valley Music and Arts Festival in Indio, Calif. looking for a party. They found it in Pioneertown where a   jamboree called the Speakeasy was in full swing.     and their   boyfriends sprawled out on colorful couches under tents outside the motel. They drank canned beer and smoked cigarettes by day, huddling around firepits at night, starlight and guitars in ample supply. This setting may seem incongruent to its backdrop. But this is the new Old West. Pioneertown, 125 miles outside Los Angeles, was founded in 1946 by a group of Hollywood legends including Roy Rogers, Gene Autry, Russell Hayden and Dick Curtis. They were tired of traveling far to film the westerns that were popular at the time. They built facades and spaces to replicate a   western town, as well as the motel, where they stayed up into the night, drinking, playing cards, staging duels and then sleeping it off before starting again. The dream of turning Pioneertown into a permanent playground with golf courses, hotels, restaurants and large homes never materialized. There wasn’t enough money or water. But 70 years later, Pioneertown is having something of a renaissance, thanks to an influx of artists, entrepreneurs and other beautiful people from Los Angeles, Silicon Valley and New York City looking for a new hub for work and play. Julian T. Pinder, a filmmaker, moved to Pioneertown in 2014 from Los Angeles with his wife, Yasmina Jones. Their friends were perplexed by their decision to do so, initially. “At first they are like: ‘What are you doing in the middle of the desert? What do you do up there? You are insane,” said Mr. Pinder, 34. “Then they come up here and stay for a weekend, and they meet all these amazing artists and everyone is just totally laid back and there is a stress level that is gone. ” Mr. Pinder and Ms. Jones were attracted to Pioneertown as an alternative to the Los Angeles lifestyle. “We were paying six grand a month, and we were doing jobs we didn’t want to do,” he said. “Finally, I said: ‘Forget it. Instead of wasting this money on rent, I can come here and buy 40 acres for 100 grand. ’” Theirs is one of the first homes seen when driving from the main highway into Pioneertown. Mr. Pinder and Ms. Jones renovated what was a     mining cabin into an airy family home that has huge windows, a beamed roof, an open kitchen and 40 acres of uncultivated land. Somewhat by necessity, Mr. Pinder has learned to kill rattlesnakes. Pioneertown is an unincorporated community, so small that you can address parcels with someone’s first name and they will arrive at the right place. You can drive for miles without seeing another human or even a building people’s homes can be about a   drive apart. The boulders, the sand and the Joshua trees make the landscape look otherworldly. Cellphone service is spotty. But the remoteness is among its greatest attributes, say people who have moved there recently. Yves Kamioner, a Belgian jewelry designer, and his partner, Hugh Glenn, a retired   executive, left their New York life and their Fifth Avenue apartment four years ago. Since then, they have bought and restored three homes in the area, including one that came with a church. “The desert is a blank page, and people come here to reinvent themselves,” said Mr. Kamioner, 59. “You are like a kid again. There is oxygen up here. ” Claire Wadsworth, a teacher, and Nikki Hill, a chef, were residents of Los Angeles when they took a weekend visit to Pioneertown in April 2015. They decided on the spot to move there. “Someone told us there was a restaurant for sale, and 10 days later we had the keys,” said Ms. Wadsworth, 31, who married Ms. Hill, 33, last year. “We were just so in love and wanting something different in life,” Ms. Wadsworth said. The couple opened the doors to their new restaurant, La Copine, in the area about six months ago. It would be hard to find the tiny restaurant, on the side of a sparsely populated   highway, if not for the crowds of people and cars that always surround it when it’s open  —   mostly for brunch, Thursday to Sunday. The crowd could rival that of the newest haunt in the West Village: Beautiful artist or graphic designer couples come with friends to laugh and gossip over juice spritzers and organic   grits. To kick off the Speakeasy festival in April, La Copine hosted an     dinner of spring pea and tendril salads and coq au vin (wine was B. Y. O. B.) for locals and tourists alike. The local music business is growing. Rocco Gardner, a   musician, has built a     music recording studio. “We now have the stuff you need to have Beyoncé come and stay and record,” he said. This spring, he gave a party to show off the studio. Musicians, actors and other scantily dressed,   partygoers took selfies in the hot tub against the unobstructed views of valleys and Joshua trees. The fashion scene, with an aesthetic influenced by Pioneertown’s proximity to music festivals, is developing as well. Promised Land, a vintage store, opened five months ago nearby. Its racks and shelves are overflowing with Bohemian skirts, maxi dresses, jumpsuits and leather jackets. Jay Carroll, 36, a brand consultant who once was a creative director for Levi’s, moved to Pioneertown in 2015. With a partner, he is starting a men’s wear line. With his wife, Alison, he is starting a company called Wonder Valley that sells olive oil. Mr. Carroll understands the lure of the dusty western town. “I’m sure it correlates to the fact that the market in L. A. has gone up,” he said. “There is also the fact that simple living is such a new hot topic with young people, and this is definitely a place you can do it with it being two hours from L. A. ” Not everyone is excited about the newness of the old Pioneertown. Jim Austin, 58, has lived there for 12 years in a house called Rimrock Ranch on a quirky plot of land with numerous structures, including a red barn with the word “breathe” written on it. Nearby, there is a display of rocks in the shape of a heart that surrounds two Joshua trees. From some vantage points, it looks like trees are kissing. Mr. Austin came to Pioneertown when it was truly a sleepy nowheresville. Now he thinks it is time to move on. He sold the ranch to a young couple from Oakland. “It is a little too crowded for me,” he said. “It was time for me to bug off rather than becoming that grumpy old dude trying to stop change. ” Matt and Mike French, brothers from Portland, Ore. are among those fueling the change. Mike, 27, and Matt, 32, bought the Pioneertown Motel in December 2014, after discovering it while visiting their parents in Palm Springs, 30 miles away. After a refurbishment of the hotel, the brothers celebrated its reopening, welcoming some 80 friends and relatives to Pioneertown. They enjoyed an outdoor dinner under the stars, a sunrise dance party and hikes in Pioneertown Mountains Preserve. “We want to be the door to the desert,” Mike said.'"}, "time": 1742564462.5834184}