{"duration": 0.04181647300720215, "input_args": {"text": "'Clinton Campaign STUNNED As FBI Reportedly Reopens Probe Into Hillary Clinton Emails Posted on Tweet Home » Headlines » World News » Clinton Campaign STUNNED As FBI Reportedly Reopens Probe Into Hillary Clinton Emails \\nA SHOCKING blow to the Clinton Campaign emerged unexpectedly Friday as the FBI has reportedly REOPENED probe into Hillary Clinton’s email server as “The FBI has learned of the existence of emails that appear to be pertinent to the investigation.” \\n\\n\\nHere we go… \\nYes. Exactly! \\nHe’ll own it once we vote him in there. \\nThen he’ll pull the plug and drain it and put all those corrupt SOBs in prison. Maybe you too ; ) \\nA ha ha ha ha ha ha ha ha ! \\nDrain the swamp! \\nReopened!??!?!??!? \\nThis monster needs to be opened, all right. \\nI’ll leave up to the readers to come up with ways to execute that idea. \\nHow many people were there when Nixon was reelected despite the fact that the Watergate investigation was in full swing? That ended pretty badly for Tricky Dick. And Killer was on the judicial investigation group at this time. This group was lead by a Democrat and he fired Killer for lying. I don’t recall the nature of the lie but it was enough to get her fired. \\nFrom Fox News Politics \\n\\nFBI Director James Comey wrote in a letter to top members of Congress Friday that the bureau has “learned of the existence of emails that appear to be pertinent to the investigation.” \\nComey did not detail those emails, saying only that they surfaced “in connection with an unrelated case.” \\nHe told lawmakers the investigative team briefed him on the information a day earlier, “and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.” \\nHe said the FBI could not yet assess whether the new material is significant and he could not predict how long it will take to complete “this additional work.”'"}, "time": 1742561630.0175993}