{"duration": 0.11666607856750488, "input_args": {"text": "'ITALIAN MAYOR blasted for scathing verbal attack on African Muslim savages who have been invading Southern Italy Yes, his words may be racist and anti-Muslim, but look at the videos below to see what African Muslim illegal alien invaders are bringing to Italy and you won’t be so quick to condemn him. What would you say if they did the same thing in your cities? Thousands of Muslims lift their asses to Allah in front of the Coliseum in Rome to protest the government’s closing of hundreds of illegal mosques UK Express (h/t Brenda K) An Italian mayor has come under fire after saying he will shoot ’niggers and gypsies’ and build a pig farm next to mosques as tensions continue to rise over the illegal alien Muslim invasion of southern Italy. More than 160,000 economic freeloaders posing as asylum seekers have been housed in Italy since the start of 2014, according to date from the interior ministry. Italy has been one of the first destinations along migrants typical routes for months, receiving thousands of new arrivals who continue to risk their lives to cross the Mediterranean on rickety smuggler’s boats. But many have been critical of the welcoming of so many refugees – and now one Mayor from the town of Albettone in Vento has launched a scathing attack on the new arrivals. Speaking on La Zanzara on Radio 24, Joe Formaggio said: “Immigrants? If they send them to us, we will protect our houses. We are proud to be racists.” The mayor claims his city “exports brains and imports niggers” who “are less intelligent than us, they are inferior”. Amid possible plans to open a mosque in the city, he claimed he would open a “large farm of pigs if they open a mosque here”. Mr Formaggio added: ”If refugees are sent here to Albettone, the barricades in Gorino will be seen as nothing. “Here we do not want immigrants, niggers or gypsies. They have a lower IQ: history proves it. “We have a shooting range and the highest number of licenses to carry weapons in the whole Veneto region. “And we do not want anyone to come and bother us. They risk their lives around us.” The comments were deemed so strong that the Secretary General of the Vicenza Chamber has been forced to intervene. Calling the comments “irresponsible”, Giampaolo Zanni said: “The Chamber of Vicenza totally rejects the Mayor of Albetton’s statements about the black population. “None of us underestimates the problems arising from illegal alien Muslim invasion migration. “But responses like those of the Mayor of Albettone are not only xenophobic and racist, but are also dangerous as they encourage feelings of racial hatred, and therefore are in stark contrast to the values of our constitution.” Thousands of Italians have come out in large protests against the never-ending Muslim invasion of their country.'"}, "time": 1742563345.5688467}