{"duration": 0.047945499420166016, "input_args": {"text": "'North Korea Rocket Launch Plans ( 71 ) 0 15 0 0 Deputy foreign ministers of Japan, South Korea and the United States will hold trilateral talks in Tokyo on Thursday to discuss the hot-button issue of North Korea\\'s nuclear and missile threats. \\nMOSCOW (Sputnik) — The negotiations will bring together US Deputy Secretary of State Antony Blinken, South Korean First Vice Foreign Minister Lim Sung-nam and his Japanese counterpart Shinsuke Sugiyama. © AP Photo/ Ahn Young-joon US, Japan Push to Fortify Alliances Amid Threat Posed by North Korea \\nAccording to the US State Department, the deputy-level talks will focus on cooperation on a range of regional security and global issues, including North Korea\\'s nuclear threat, in particular, its ballistic missile programs . \"They will discuss the international community’s efforts to hold North Korea accountable for its destabilizing behavior, including its January 6 and September 9 nuclear tests and litany of ballistic missile launches, which constitute flagrant violations of UN Security Council resolutions,\" the State Department said. © REUTERS/ KCNA US Spy Chief: Asking North Korea To Stop Nuke Program a ‘Lost Cause’ \\nAccording to media reports, later this year, Japan, South Korea and China are likely to hold a tripartite summit between late November and early December, with North Korea\\'s nuclear and missile development high on the agenda. \\nIn 2005, North Korea declared itself a nuclear power. So far, it has conducted five underground nuclear tests — in 2006, 2009, 2013 and 2016, raising concerns of both the neighboring states and the international community. Pyongyang\\'s cites prospective aggression from South Korea and its major ally, Washington, as the reason for North Korean nuclear program development. \\nPyongyang is currently under pressure from the international community since its latest nuclear test in September and a long-range rocket launch in February, which resulted in tightening sanctions against North Korea in the new UN Security Council resolution in March. ...'"}, "time": 1742564481.7916236}