{"duration": 0.03172874450683594, "input_args": {"text": "'The illuminati card ‘Enough Is Enough’ a harbinger of things to come? \\n\\nFor more than two decades the infamous Illuminati Card Game, created in 1994 by Steve Jackson, has been proven to be a remarkably accurate when it comes to the prediction for future events.\\n\\nAlready several worldwide events had their own card prior to the evening happening.\\n\\nNow The US elections are behind us and Donald Trump has been elected as the next US President, once again there are two cards which really stand out.\\n\\nBoth cards bear a striking resemblance to Donald Trump.\\n\\nThe first card ‘Charismatic Leader’ shows a man speaking to a fanatic crowd with the following text:\\n\\nThe increased power takes immediately effect. \\n\\n\\nThe second card ‘Enough is Enough’ shows the likeness to Donald Trump with a bullet whizzing by his head with the following text: \\nAt any time, our snipers lay you in every place. Have a nice day. \\n\\n\\nNow that Donald Trump has come so far to become the 45th president, the people in power want him stopped before he causes any more upset to their status quo. It means that he will become a target.\\n\\nSome of their methods to stop Donald Trump: Sabotage, economic crisis, civil unrest, false flag operations, cyber attacks and if they have no success to stop him then it is quite possible that they play their last card: Assassination.\\n\\nVery disturbing is also the warning of Baba Vanga, a Bulgarian-born prophet - who died in 1996 aged 85, and who had an alleged prediction success rate of 85 per cent.\\n\\nShe correctly predicted that the 44th President of the United States would be an African-American and this black President (Obama) would be the last US President.\\n\\nObama technically remains President until Donald Trump is sworn in on January 20, 2017 but if Baba Vanga’s prediction would be correct again then something will happen with Donald Trump before January 20, 2017 and Barack Obama will serve a third term with all its consequences.\\n\\nBaba Vanga’s prediction and especially the second card could be a warning for an upcoming assassination attempt against Donald Trump? \\n\\n\\nUFO Sighting Hotspot \\nSOURCE '"}, "time": 1742628451.1069136}