{"duration": 0.092529296875, "input_args": {"text": "'  This marks an important victory for the Inuit, who protested and went on hunger strikes in the wake of Harvard University studies that warned the project at Muskrat Falls would poison their food sources. They urged the government to wake up and step in to help keep methylmercury from making its way into their waterways. “The decisions that will be made, going forward, will not be at the whim of government,” announced Todd Russell , president of the NunatuKavut Community Council. “They will be made by science and it will incorporate the traditional knowledge of our people. This is a huge step forward.” People took the protesting to extremes, like Labrador Inuk artist and activist Billy Gauthier, who vowed he would die if that’s what it took to ensure the Muskrat Falls hydroelectric project was done right.”I know this is for a good reason, for a good cause, and I will stand for as long as I can,” he said . Ossie Michelin, another protestor, had reported not eating for nearly two weeks, and had lost 21 pounds. In Muskrat Falls, protesters had breached the gates at the project site, which is run by Nalcor Energy. The protestors explained that they weren’t opposed to the project moving forward, but wanted to make sure it was done the right way, and that involves eliminating methylmercury.   Methylmercury occurs in nature when bacteria react with mercury in water, soil, or plants. As it moves up the food chain, its levels increase. “You could drink a swimming pool of this water every day and it would not affect your health,” explained Trevor Bell , a Memorial University of Newfoundland geographer and project leader on a study of methylmercury risks with the Muskrat Falls project. “When you get to the top of [the food chain], the fish and the seals, that’s 10 million times the concentration as in the water.” The U.S. National Library of Medicine calls methylmercury a poison that causes severe brain and spinal cord damage. It can lead to blindness, growth problems, and birth defects, and hinder mental functioning. It may also lead to cerebral palsy. Mainstream media has been overwhelmingly quiet on this protest, as they seem to be with many important issues globally, but when the facts are presented, when people are risking their lives to stop others’ lives from being harmed, something must, and needs, to be said. Michelin noted that the flooding, if the project went the way it was initially supposed to, would contaminate “our fish, our seals, our game, our way of life.” He continued on to say, “This isn’t just our food source because we also have issues around food security, but our whole culture is is based upon hunting and fishing and gathering from the land. It’s who we are.” Much like the water protectors at DAPL, Michelin says people did not come to the site to cause trouble. “We’re not activists. We’re just normal people fighting for our home.” Initially, Nalcor Energy wanted to flood the Muskrat Falls reservoir to build its dam. The biggest problem with this plan is that it could cause the already-present mercury at the site to turn into methylmercury, since it would release carbon from the soil and plant life, triggering the process of methylation. This reservoir is just upstream from the Lake Melville marine estuary, which is the Inuit’s main source of fishing and hunting. Studies even concluded that the flooding could spike levels of methylmercury in Lake Melville far beyond what naturally occurs . And thanks to the plentiful information the protestors brought with them when occupying the reservoir to block the flooding, they were able to reach an agreement that will ensure scientists analyze ways to reduce methylmercury contamination, and hopefully reveal the potential to clear the reservoir. Bell called the agreement a win for grassroots democracy and science-based policy. “The agreement is important for Labradorians and for Muskrat Falls, but has an impact beyond Labrador and nationwide on hydroelectric developments and evidence-base decision-making,” he said . \\nThe Sacred Science follows eight people from around the world, with varying physical and psychological illnesses, as they embark on a one-month healing journey into the heart of the Amazon jungle. \\nYou can watch this documentary film FREE for 10 days by clicking here. \\n\"If “Survivor” was actually real and had stakes worth caring about, it would be what happens here, and “The Sacred Science” hopefully is merely one in a long line of exciting endeavors from this group.\" - Billy Okeefe, McClatchy Tribune'"}, "time": 1742562248.0081537}