{"duration": 0.04284381866455078, "input_args": {"text": "'Just 6 percent of millennials claimed that their social media accounts were a “completely true” depiction of them, according to a report by LendEDU. [54 percent of the nearly 8, 500 college students surveyed claimed that their online accounts were “somewhat true of me,” while 25 percent claimed their accounts were “mostly true of me,” and 15 percent claimed they were “not true of me at all. ”  “While not entirely surprising, the fact that only six percent of millennials said their social media accounts portrayed their lives completely truthfully confirms a long standing belief,” wrote LendEDU in their report. “Anything posted on social media should be taken with a grain of salt, because with a little cleverness and craftiness, a social media post can completely distort reality. ” “The interesting thing about this poll was that millennials were admitting to their own   on social media,” they continued, adding that “The 15 percent that said their social media was ‘not true of me at all’ know that they are totally fabricating their lives and have not only accepted it, but are are seemingly fine with it. ” “Remember, the next time you see someone post an awesome looking picture on Instagram or Facebook do not get jealous, but temper your reaction,” the report concluded. “There is a 94 percent chance that poster is either completely lying or stretching the truth. ” In a previous survey of 3, 701 students by LendEDU, Instagram was rated the most narcissistic social media platform. 65 percent of those surveyed placed Instagram at number one on the list, followed by Snapchat at 15 percent, Twitter at 11 percent, and Facebook at 10 percent. “For most of this demographic, social media is a powerful tool with the ability to create an entirely new persona, void of reality,” claimed LendEDU in their previous report. “The formula is quite simple. If you post enough artsy, chic pictures of yourself that rack up plenty of ‘likes,’ then real life accomplishments will not matter because the popularity of your social media accounts will determine your status on the social hierarchy. ” “This is especially true with Instagram, where ‘likes’ are the main way of interacting with pictures and videos that are posted by users,” they concluded, adding that “The large majority of Instagram users have formed unspoken alliances with each other to ensure they each tally enough ‘likes’ to make their posts stand out. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562275.198326}