{"duration": 0.12448859214782715, "input_args": {"text": "'\\nPosted by Elliot Bougis | Nov 16, 2016 | Breaking News Just when you thought it was safe to go back on the Internet… \\nI have been reporting for weeks now about the D.C.-based “pizza pedophilia” ring that is being exposed based on thousands of “Podesta emails” released by Wikileaks in the past month or two. \\nAs of last week, the case became even more explosive. \\n— Thomas Bernpaine (@ThomasBernpaine) November 11, 2016 \\nNow, don’t get nervous because it looks like computer mumbo-jumbo. You only need to remember two things. \\n1 –Every picture file is actually a code/pattern of numbers that our computers “translate” into images on the screen. \\n2 – Some “extra” information has been discovered in at least one picture code/pattern from a Wikileaks email. \\nI reported weeks ago about this “pedo ring” something called “photo steganography,” which is just the fancy term for the two points I explained just now. \\nThe image (.jpg) of the two girls eating pizza was discovered as an attachment in the Podesta emails by Wikileaks. Data can be hidden in a .jpg file. In that image, a zipped directory (PK) was hidden inside. That doesn’t happen by accident. The directory likely contains illegal imagery and/or discussion. It is highly suggestive of illegal activity connected to child pornography, child exploitation, and child abuse. \\nSome have objected that the pizza.jpg file size is simply too small to contain any useful data (like an image, a link, a message, etc.), but the point is this: all the file would have to “smuggle” is a short password to open a secret website or .zip file. The hidden data could literally just be a few bits of information but it could open up thousands of gigabytes of data in the right website or compressed file. That’s how the users would access the dirty pictures, videos, messages, etc. \\nSo, from a technical angle, this method is very possible, and it makes sense of why the Podesta emails include so many strange photo attachments. Are all those attachments little “Trojan ponies” for sharing images, videos, passwords, payment resources, etc.? \\nWATCH (Language/NSFW Warning): “Why do we even have an FBI? Is the FBI just covering for these people?” \\nLet me be honest: \\nI have researched corruption cases like this for many years, whether in current events or from historical records. So, I believe I have a somewhat thick skin when it comes to facing human sinfulness and evil like this. \\nLast Friday night, however, I won’t lie: I totally lost it. \\nAll of a sudden, too many lightbulbs went off at once, too many connections hit me at once, too many implications dawned on me at once–and I just went into a kind of panic attack about how massive this whole cartel is, how well protected it is, and how truly destructive it is in real children’s lives. \\nIf you want to get an idea of what set me off, let me show you three images. \\nBUT I WARN YOU: When you understand the context, these images are EXTREMELY DISTURBING. \\nFirst, here is a photo of Tony Podesta’s favorite work of art in his home: \\nTony Podesta is a big fan of “The Arch of Hysteria” \\nNext, here is an ad from Ping Pong Pizza, a restaurant in D.C. that has numerous, very disturbing connections to pedophilia and D.C. elites like the Podestas. Another “arch of hysteria”? \\nNext we come to a police photo from the Jeffrey Dahmer case. \\nVIEWER DISCRETION ADVISED: \\nI wonder if Tony Podesta would also like this “arch of hysteria”… \\nFinally, here is the logo for Comet Pizza, another D.C. restaurant with deep connections to Ping Pong Pizza and the Podestas. Can you see now why I “lost my [bleep]” last Friday? \\nWorse, in terms of how protected this satanic ring of perverts is, I recently reported that even the DOJ is compromised . \\nA man named Arun Rao has shown a disturbing interest in some sexually “creepy” images and expressions that are connected to the Podestas and this pedo ring. The problem is that Rao is an Assistant U.S. Attorney in the DOJ. \\nSpecifically, Rao is Supervisor of the Southern (“Greenbelt”) Division office for the DOJ’s District of Maryland in Chevy Chase, Maryland. This means that Rao’s district is virtually on top of the area in D.C. where Besta Pizza operates. In addition, Besta Pizza and two other associated properties are directly over abandoned underground tunnels, many of which could easily connect to Chevy Chase. \\nOn top of his social and geographical proximity to Alefantis, Rao’s DOJ division handles cases that seem tailor-made for busting—or covering up—the dark circles that sex traffickers hide in: federal racketeering, conspiracy, national and international fraud and corruption, immigration violations, counterfeiting, and —wait for it—child pornography . \\nIn closing I will leave you with three “infographics.” \\nThey are very complicated and “dense” so I don’t expect everyone to examine them. \\nHowever, even if you don’t look into the details yourself, I want you to be aware of how vast this whole network of evil is, and, therefore, of how many hands and prayers we need on deck to expose it and bring it down. \\n(NOTE: You don’t have to download these images to view them. You can just right-click open them in a separate internet browser tab, and click “+” to zoom in.) \\n— Thomas Bernpaine (@ThomasBernpaine) November 11, 2016 \\nFirst, a diagram of “key players” in the pizza restaurant side of the pedo ring. You can see the diagram for yourself here . \\nSecond, a much larger diagram of how this pizza-pedo ring connects to international kidnapping (esp. the Madeleine McCann case) and other DNC allies like “spirit cooker” Marina Abramovic. \\nFinally, a truly massive diagram of connections that implicate nations and leaders around the world, and put the sex trafficking cartel in the context of a global network of drug dealers, slave traders, murderers, and media elites. \\nThis is an ongoing investigation so stay tuned for more. Share this article to inform and encourage your friends and family! '"}, "time": 1742562836.6323392}