{"duration": 0.09416699409484863, "input_args": {"text": "'Note to President Obama: a Hillary Clinton pardon could heal a divided nation. After all, if it was good enough for Richard Nixon, it is certainly good enough for Clinton. The difference being that Tricky Dicky was actually guilty of the crimes insinuated against him, whereas the former Secretary of State, who was thoroughly investigated and cleared of any criminal wrongdoing twice, continues to be maligned and persecuted by the right-wing establishment, as well as politicos with decades-old grudges who view the Clinton witch hunt as their opportunity to exact revenge on the woman who should be America’s first female President of the United States , and proved it by carrying the nation’s popular vote if not the antiquated electoral college.\\nAs originally proposed by one-time presidential hopeful, Rev. Jesse Jackson, the nation should call upon President Barack Obama to issue a blanket pardon to the twice-exonerated Clinton, in order to call an end to the drawn-out attack on every aspect of the former New York senator’s character once and for all. In the 21st century, it is unthinkable to believe that U.S. citizens are so narrow-minded and circumspect that they seek to stop an empowered, idolized public servant from holding the highest office in the nation simply because she is a woman.\\nWhile it is abominable and heartbreaking to lend credence to this theory, there is strong evidence to support its existence, especially when considering some examples from other nations who have female world leaders:\\n— Indian Prime Minister Indira Gandhi (1966-77; 1980 to Oct. 31, 1984 (her assassination))\\n— British Prime Minister Margaret Thatcher (1979-90). Thatcher was the longest-serving British prime minister of the 20th century and first woman to have held the office.\\n— Israeli Prime Minister Golda Meir (1969-74)\\n— German Chancellor Angela Merkel (2005-present)\\n— Queen Elizabeth II of United Kingdom (U.K.), Great Britain, and Northern Ireland (1952-present)\\n— South Korean President Park Geun-hye (2013-present)\\n— Prime Minister Theresa May of U.K., Great Britain, and Northern Ireland (2016-present)\\n— Prime Minister Sheikh Hasina Wajed of Bangladesh (1996-2001; 2009-present)\\nFrom countries great and small, these women and countless others have achieved the ultimate seat of power in their respective nations. Some of these countries have a long, storied legacy of woman leaders that spans decades and even generations, while others are relatively new to welcoming a female presence as their central figurehead. Nonetheless, women all over the globe have been given the opportunity to lead their countries into a new era and provide their citizens with a different perspective, with the glaring exception of the United States, a nation that could benefit immensely from female influence at the helm.\\nPresidential pardons are not a foreign concept. Every U.S. president has the authority to grant pardons, which is also known as clemency, to anyone of their choosing. However, unlike most executive powers, presidential pardons are unchecked by Congress and cannot be blocked, overturned, or reviewed. The purpose of this power exists to help ease tensions, correct historic injustices, and heal political wounds. If any situation calls for its implementation, this scenario could not be more fitting. Yet, this authority does not come without controversy. In addition to President Gerald Ford’s pardoning of Richard Nixon in 1974, other controversial acts of clemency include President Bill Clinton’s pardon of Symbionese Liberation Army sympathizer and publishing heiress Patty Hearst in 2001, President Richard Nixon’s offer of clemency to Teamster boss Jimmy Hoffa in 1971, and President Jimmy Carter’s commutation of Watergate conspirator G. Gordon Liddy’s prison sentence in 1977.\\nAs evidenced by the vitriol of the 2016 Campaign and subsequent General Election , a Hillary Clinton pardon by President Obama could be the only way to end the vicious cycle of recrimination and violence observed throughout the so-called Democratic process , which has encountered its own foibles and criticisms. Namely, the ongoing debate about the necessity of the electoral college and its all-or-nothing allotment, which many consider unjust and obsolete. Instead, many believe the winner of the popular vote should be elected as U.S. commander in chief, which would have resulted in President-elect Clinton occupying the Oval Office. In the aftermath of the controversial election results, a blanket pardon for the veteran politician could be the first step in healing a divided nation, which has truly demonstrated its fractured populace via the chaotic antics and disdainful actions observed throughout the extended 2016 Campaign cycle, as well as in the aftermath of its divisive conclusion.\\nOpinion Written and Edited by Leigh Haugh\\nSources:\\nPersonal Opinions and Observations of the Author\\nDetroit Free Press –Obama Should Pardon Hillary Clinton, Jesse Jackson Says\\nNew York Times –Hillary Clinton, in Emotional Speech, Implores Supporters to Keep Believing in America\\nMTV –We Need Female Politicians Now More Than Ever\\nWashington Post –Here Are the Dozens of Democracies That Have Elected a Female Leader\\nAll Article Images Courtesy of WikiMedia Commons – Creative Commons License clinton , Donald Trump , Hillary Clinton , jesse jackson , President Barack Obama , Presidential Pardons'"}, "time": 1742561673.2929118}