{"duration": 0.1267414093017578, "input_args": {"text": "'After eluding prosecution in the United States for decades and escaping from prison twice in Mexico, the crime lord Joaquín Guzmán Loera, better known as El Chapo, appeared on Friday in federal court in Brooklyn and pleaded not guilty to charges that he had overseen a   drug empire. Prosecutors said the operation had moved at least 200 tons of cocaine into the United States, had earned $14 billion in profits and had been protected by an army of assassins who killed thousands of people. Mr. Guzmán’s arraignment, in Federal District Court, was both a news media spectacle and a pro forma counterpoint to his sudden extradition from Mexico on Thursday afternoon, when a police jet flew him from the border to MacArthur Airport in Islip, on Long Island. The brief court proceeding took place under tight security, with police vehicles, heavily armed guards and   dogs patrolling the grounds outside the courthouse. Dressed for his arraignment in a blue     blue pajama pants and blue sneakers, Mr. Guzmán, 59, stood with his   lawyers in front of Magistrate Judge James Orenstein in a   courtroom packed with prosecutors, federal agents and reporters. “Are you Mr. Guzmán?” Judge Orenstein asked the defendant. “Sí, señor,” Mr. Guzmán said. The judge then asked Mr. Guzmán if he understood the charges he was facing. “Sí, señor,” he said again. Those charges had been detailed earlier on Friday at a news conference. At the briefing, Robert L. Capers, the United States attorney in Brooklyn, called the extradition of Mr. Guzmán, whose nickname means Shorty, a milestone in the pursuit of a trafficker who achieved mythic status in his homeland as a Robin   outlaw and a serial prison escapee. Saying that Mr. Guzmán now faced life in prison on a charge of running a continuing criminal enterprise, Mr. Capers sought to play down Mr. Guzmán’s role as a folk hero and promised that he would not escape his American jailers. “Who is Chapo Guzmán?” Mr. Capers said, flanked by a phalanx of   officials from local, state and federal agencies. “In short, he is a man who has known no other life than one of crime, violence, death and destruction. ” Even at a courthouse that has seen the prosecution of Mafia dons like John J. Gotti, the onetime Gambino family boss, and corrupt public officials like Meade Esposito, the former Brooklyn Democratic leader, the arrival of Mr. Guzmán sent a charge through the building, where scores of international reporters were on hand. In an extraordinary confluence of events, Mr. Guzmán was taken from Mexico by plane on the eve of the inauguration of Donald J. Trump and was arraigned in Brooklyn only hours after Mr. Trump was sworn in. After the hearing, he was returned to the Metropolitan Correctional Center in Manhattan, a   federal jail that has housed some of New York’s   federal defendants, including many facing terrorism charges. As the day began, prosecutors in Brooklyn issued a memo laying out their arguments for keeping Mr. Guzmán in custody. They noted his vast wealth and asserted his propensity for violence and his penchant for escaping Mexican prisons  —   most notably, the   Altiplano prison, where he lived in isolation under   surveillance. Nonetheless, he managed to flee after his associates dug a tunnel directly into his shower. Speaking at the news conference, Angel M. Melendez, the special agent in charge of Homeland Security investigations in New York, said he had been at the airport Thursday night when Mr. Guzmán arrived. Mr. Melendez said he looked into Mr. Guzmán’s eyes and saw “surprise, shock and even a bit of fear” now that he was facing “American justice. ” Mr. Guzmán’s escapes in Mexico came while he was serving a long sentence on   offenses. Although officials at the gathering refused to discuss details about security measures, Mr. Melendez said, “I can assure you no tunnel will be built to his bathroom. ” Mr. Guzmán is facing charges in six federal districts, and Mr. Capers said the decision had been made to prosecute him in Brooklyn, with the assistance of federal prosecutors in Miami, because the two offices working together could bring “the most forceful punch” to the case against the leader of the Sinaloa cartel. Mr. Capers added that cases in Texas, in California, in Illinois and elsewhere would, for the moment, remain open. The investigation into Mr. Guzmán’s crimes was conducted by a host of agencies, including the Drug Enforcement Administration and the Federal Bureau of Investigation. In its memo filed Friday, Mr. Capers’s office said it would seek a criminal forfeiture of $14 billion against Mr. Guzmán and announced that it planned to call dozens of witnesses to testify about the staggering scope of Mr. Guzmán’s criminal enterprise: its   shipments of drugs in trucks, planes, yachts, fishing vessels, container ships and submersibles, as well as its numerous killings of witnesses, law enforcement agents, public officials and rival cartel members. The memo also said the government had a vast array of physical evidence, including seized drug stashes and electronic surveillance recordings. The   memorandum of law  —   supplemented with photographs of seized drugs and the planes, boats and submersibles used to smuggle them  —   reads like a history of the modern narcotics business. Prosecutors contend that Mr. Guzmán transformed the drug trade with unchecked brutality, remarkable efficiency and brazen corruption. The document tracks his progression from the 1980s, as a smuggler who transported Colombian cocaine to the United States and returned the profits to traffickers there so efficiently that he earned the nickname El Rápido, through the ’90s, when he began consolidating his control in Mexico. As Colombian traffickers faced increased enforcement of extradition laws, and thus greater threat of prosecution in the United States, they ceded elements of the distribution networks in the United States to Mexican cartels, according to the memo. As Mr. Guzmán’s operations grew, prosecutors say, they became increasingly sophisticated. Mr. Guzmán also established a complex communications network to allow him to speak covertly with his growing empire without detection by law enforcement, according to the memo. This included “the use of encrypted networks, multiple insulating layers of   and   methods of communicating with his workers. ” Mr. Guzmán also established distribution networks in New York, New Jersey, Georgia, Illinois, Texas and California and created “massive   efforts that delivered billions of dollars in illegal profits generated from the cocaine sales in the United States to the Mexican traffickers and their Colombian partners,” the memo said. “These changes,” it added, “enabled Guzmán to exponentially increase his profits to staggering levels. ”'"}, "time": 1742564465.516232}