{"duration": 0.14122223854064941, "input_args": {"text": "'After November 8, America may need legalized pot By Frank Scott Posted on November 7, 2016 by Frank Scott \\n“If we cast a vote for establishment politicians we are legitimizing establishment control of politics. It’s that simple.”—Michael K. Smith \\nAs millions prepare to do just what Smith warns against, including hundreds of thousands who think themselves dedicated to ending such control, it’s time we understand American mind management’s great success at reducing voters to herds of human cattle whether from a conservative right, a liberal left, or trapped in the middle of the political desert called the two party system under one class control. \\nReducing otherwise thoughtful Americans to sinking intellectually lower than those they are taught to disrespect as uneducated and worse, we find an allegedly liberal population that might make Germans during the Nazi era seem civil libertarians by comparison. The all consuming state of the mind managed and consciousness controlled—the greater the conflict, the tighter the control—finds supposedly educated groups reacting with all the critical thoughtfulness of a dog leaving its droppings on the pavement. And a likeness to excrement might be raising the level of debate, given the atrocities of persuasion used to reduce America’s political arena to a giant national toilet. Consider only a few of the glaring contradictions hardly given a thought by innocents who exercise more choice while shopping for clothes, pet food, weapons or drugs than in the political marketplace where they, instead of the products, are branded. And let’s remember the origin of this ugly overused term which originally meant burning into the flesh of an animal or human slave the “brand” of its owner. Whose “brand” are you? \\nPeople taught that freedom of speech and thought are cherished ideals are programmed into vilifying those who dare to speak or think differently than they. While the all too easy examples of religious fundamentalists suppressing the freedom of one or another minority or the right to openly speak about beliefs that contradict the accepted code are cited by a purportedly secular liberal sector as narrow minded bigotry, it is as guilty, often proudly so, of the same behavior. \\nFor example, when a rich, silicon valley techmeister dared to contradict the hypothetically free thinking libertarian mindset of the market fundamentalist community who make up the majority of the rich IT class, the reaction was swift and as tolerant as any Nazi embargo on thought. Previously lauded by a gay liberal publication for being rich and homosexual as well, he became a villain and un-gay for being a supporter of Donald Trump. And liberals too young to remember or too ignorant to know about the anti-Soviet frenzy of the Cold War are aroused to react to Putin and Russia the way the people they treat with utter contempt might react to an abortion being performed at the altar during their church service. A supposed community of gay rights advocates doesn’t accept gays who don’t toe the party line of such supporters, while alleged anti-war oriented people operate in a controlled mental state lusting for war as the country moves closer to a military confrontation with Russia, provoked by sources of propaganda they formerly opposed moving them to think—if at all—from their lower anatomy, in the fashion of the candidate they are programmed to hate. \\nA rapidly diminishing economic system that still rewards a substantial minority with comfort and privilege while giving the class above them that brands their professions measures of wealth beyond belief, is made to feel superior to the majority who carry the burden of social costs to finance their personal benefits. This results in great numbers of people looking down on those below them in the economic stratification of 21 st century capitalism, approaching that of its centuries old origins in comfort for some and squalor for most. Thus, those able to afford education, a shrinking minority and ”diverse” in the divide and conquer modes of identitarian affirmation, are taught to disrespect those with less ability to pay the educational premiums or qualify for the massive debt required. The majority of Americans, without college degrees and forced to accept even more limited work than those who make it through the paper mills and become lawyers, teachers or as often, baristas, are seen as less able to think or perform in the capitalist marketplace and become subjects of blame for all the worst aspects of the game. \\nInequality, racism, sexism, problems of immigration, gentrification and many other aspects of what passes for normal political economics are seen as the fault or responsibility of “others.” And the majority group, carefully splintered into as many ethnic, religious and ugliest and most ignorant of all, racial minorities—thus with less chance to perform as the majority we truly are—are driven to reactionary minority political organization which seems the only answer to other reactionary minority opposition given that action of a majority is treated as a work of fiction or desire of folly. Meanwhile, imperial warfare, Wall Street, Corporate America, the richest 1%, its well paid servants and Israeli interests continue to take up the lion’s share of the nation’s wealth as alleged market competition becomes the anti-social reality of the most while a perverted form of wealthy socialism exists with benefits for only the least. \\nWith established billionaires, through their banks and lobbies like NRAIPAC, maintaining control whichever of the deadly duo is elected by well meaning lesser evilites, the need for a radical politics of truly revolutionary and not simply social democratic change will become more pressing. The identity group of those with enough money to matter no matter what their skin tone, religion or ethnicity, needs to join with masses whose lives matter much less because they haven’t enough money to matter, no matter what their skin tone, ethnicity or religion. The most democratic, humane and efficient system will not happen until it’s created by people who understand that with all the horrid treatment of people of different caste and color, the primary division and barrier among all of humanity is that of economic class. With all the nonsense about an alleged problem of growing population, no one goes without food, shelter, education or healthcare because there isn’t enough of those things, but only because they haven’t enough money to pay for them and return a profit to the marketeers who sell them. \\nWe now have capital’s representatives from all supposed minorities in Congress, on Wall street, in the military, as CEOs of major corporations and just about everything else. Whether the private profits accrue to heterosexuals, homosexuals, people of light skin tone, dark skin tone, or with accents that identify them as from Mexico, Brooklyn or Serbo-Croatia, they come at public expense. Instead of seeking other mind management created minorities to blame or see as enemies, we need to direct our focus at the rigged system of human inequality which allows some to thrive only at others’ failure. The only minority to deal with on a confrontational basis is the billionaire gang formerly confronted by some dedicated followers of the Bernie Sanders campaign, before they became sheep led to a voting booth to make sure that billionaire minority retains its domination. If only 5% of them vote for Jill Stein, the Greens will receive millions of public dollars to continue building a real alternative of hope for the future. When slavish obedience to mind managed lesser evil ends, we will begin building a better nation and world, but not until then. On the eighth, vote, inhale deeply and try to relax, if you can. And on the ninth, begin working for that change, if you haven’t already. \\nFrank Scott‘s political commentary and satire is online at legalienate.blogspot.com . Email:'"}, "time": 1742563100.3368433}