{"duration": 0.14828991889953613, "input_args": {"text": "'AMERICANS DESPERATELY TRYING TO REMEMBER ELECTION SAFE WORD Nov 2, 2016 \\nWashington, D.C. (SatireWire.com) – Pushed to the limits of pain by an election that was initially entertaining but has clearly gotten out of hand, Americans today are frantically trying to remember the safe word that will stop this sadistic presidential race before it ends badly. \\n“Honestly, at first I thought it was just a little role-playing,” said Jessica Riley, 44, of Austin, Texas. “Donald Trump as President Trump? I was like, ‘It feels so wrong, but I can’t turn away.’ But then the FBI jumped into the race with more emails and suddenly I was like, ‘Oh God no, Donald Trump actually is going to be president! Apple! Baseball! Putin!’” \\n“Honestly, I can’t think of what it was!” added desperate 28-year-old Clay Toombs of Charlotte, N.C. “Pineapple? Oklahoma? Mussolini? Just please stop! And no I am not kidding, and no I am not saying this because I really want you to keep going! I mean it!” \\nW ith the election only days away, voters said they probably should have ended this dark, ‘50 Shades of Orange’ fantasy sooner, but conceded they didn’t recognize how abusive things would become. \\n“OK, intially it did spice things up,” said Seattle resident Taylor Bryant, 38. “Trump was really pushing the boundaries. He was into all the kinky stuff like gagging the press, handcuffing immigrants, stop and frisk. Plus he had this whole prison fantasy with Hillary. But then he got over-the-top dirty – pussy grabbing, blood coming out of her wherever, and, c’mon, suggesting he’d like to get it on with his daughter? \\n“I draw the line at scarring,” Bryant added. “I don’t want any visible scars, and right now I feel scarred for life.” \\nLike many voters, D.T. Fillion, 56, of Clemson, S.C., said he wishes the election campaign had never taken place. \\n“If what happened in 2016 could stay in 2016, that’d be great,” he said. “We’ll just say it was a phase. And hope my kids don’t find out.” \\nCarolyn Frate of Brooklyn, meanwhile, said she’s no longer excited by either candidate. \\n“If we could just have Tim Kaine and Mike Pence, I know that would be, like, the electoral missionary position, but right now I could do with boring,” she said. \\nFor the record, the safe word is “Vote.” \\n© 2016 SatireWire.com'"}, "time": 1742564075.620398}