{"duration": 0.011845111846923828, "input_args": {"text": "'Comment \\nFloyd Mayweather Jr. has so far been mum on whether he will don boxing gloves once again despite call-outs from Manny Pacquiao and Conor McGregor. Pacquiao is coming off an impressive win over Jesse Vargas while “The Notorious” was responding to Mayweather’s jabs. \\nOf the two, a rematch with Pacquiao is seen as a logical move as Mayweather eyes a 50-0 record. It would allow “Money” to break the tie though nothing has been set for now. Floyd Mayweather Sr. believes son should go for it \\nFloyd Mayweather Sr. has had his share of do’s and don’ts and the recent dish adds yet another angle to Floyd Jr.’s plans. According to him, Floyd Jr. should consider fighting at least one more time to break the tie believing it will take years before anyone can break it, Fighthype.com reported. \\nAlso read : Floyd Mayweather vs Manny Pacquiao Rematch Will Be A Disappointment, To Be Staged Just For Money? Floyd Sr. sends stern warning to Conor McGregor \\nSimilar to his son, Floyd Sr. believes Conor McGregor should slow down and keep quiet. He is confident that McGregor could be in for a beating, World Boxing News reported. As most know, this fantasy match is nowhere near of happening so perhaps it would be best to leave it as it is – a dream. \\nOn the serious side, a rematch with Pacquiao should be the perfect setting. The Filipino may do the necessary adjustments but it is still the logical and lucrative one. The revenue may not be similar to the first encounter but is nevertheless expected to be millions. \\nAny boxing return eventually falls on the hands of Floyd Mayweather Jr. He seems content living out his retirement though the urge to go for 50-0 is still in the air. His father believes he should go for it, same with boxing aficionados. At the end of the day, it all depends on whether “Money” is willing to enter the ring for one last fight. \\nLiked this story? Subscribe to our newsletter or follow us on Twitter and Facebook for more boxing news and updates. Continue Reading'"}, "time": 1742628552.6788852}