{"duration": 0.1332244873046875, "input_args": {"text": "'NAIROBI, Kenya  —   Ismail Ali Ibrahim gave away everything he owned: his bed, his sheets, his shirts, his pots, his pans, his plates, even his house. He didn’t care. He was going to America. But this week, he remained 7, 000 miles away, marooned with more than 100 other Somali refugees in a spartan transit center in central Nairobi that smelled of nervous sweat. Mr. Ibrahim and many of his displaced comrades had been waiting more than two decades to be resettled in the United States and were supposed to fly to America this week. But their hopes were crushed by President Trump’s executive order to freeze the refugee flow into the United States for at least four months. More than 25, 000 refugees from Somalia, one of the poorest, hungriest,   countries on earth, were in the pipeline to be resettled in the United States. Mr. Ibrahim was much closer than most  —   so close that, with his ticket, paperwork and bag all zipped up, the thought of it made his voice quiver. He had waited 26 long years for this, living in a sweltering, crowded,   refugee camp along the   border that is the opposite of hope. Now his worst fears are shaping up. The Somali refugees who had already been extensively vetted and approved by several American government agencies will most likely be bused back to the camps. Many said that they feared for their lives and that their situation was actually worse than it had been before they came so close to leaving. “Trump shocked us,” Mr. Ibrahim said. Most of them are now broke, having just two weeks ago given away their worldly possessions in a spree of happiness to friends less fortunate. But more worrisome, many refugees said as they gathered under the shade of a mango tree at the transit center, was the risk that they could be labeled “friends of America. ” That’s a dangerous tag in a poorly policed refugee camp crawling with Islamic militants. “The Shabab will be suspicious of us,” said Deck Abdi Korriyow, another refugee, referring to the militant group that has slaughtered thousands of people across eastern Africa. “They don’t want anyone resettled to the U. S. They’ll think we’ve been giving information to the Americans. ” Several men around him vigorously nodded when he added, “Who knows what will happen to us next?” Kenya is home to hundreds of thousands of Somali refugees and many are treated terribly  —   constantly harassed, arrested, often beaten, discriminated against, kept in large camps or locked in a soccer stadium during police roundups, and sometimes they have even disappeared. Many Kenyans see Somalia the way much of the world does: as a terrorist threat. So the refugees have set their sights on a faraway dream. It’s called America. The United States runs a vigorous resettlement program, taking in thousands of Somalis each year. Being one of them is like holding a winning lottery ticket and it generates a lot of envy. Some of the refugees said another reason they dreaded going back to the camps was because they knew some of their neighbors would barely be able to contain their glee that the resettlement had not worked out. “The people against me will be happy,” Mr. Ibrahim said. The more than 100 approved refugees here are now stuck because they don’t have proper papers to walk the streets of Nairobi. They were supposed to be walking the streets of Atlanta, Buffalo, Des Moines and St. Louis by now. They aren’t allowed to leave the transit center, which is in Nairobi’s old Indian quarter it was supposed to be their last stop. The gate here is large and unmarked. Security is serious many of the refugees who pass through here are hunted in their homelands. On Wednesday, the center was crowded but relatively quiet. The refugees seemed bored. Somali women in full veils lay on the sidewalk on their backs. Young men lounged in a row of scratched up chairs and were not even talking to one another. When a   mango fell from the tree, a little boy pounced on it, clearly hungry. The men spoke of “the stress. ” “Am I worried?” asked Salad Rage Saleh, thin and antsy. “Ever since I’ve been born I’ve been worried. ” American officials did not address the fears of Shabab reprisals directly. One State Department official said that the government would continue to show compassion to refugees but that it was also important to protect American citizens. Refugee officials said the Shabab fears could be real, but that some refugees also played up such concerns in an attempt to delay or stop their return to the camps, which can be depressing on a good day. Life for many Somali refugees means confronting famine, anarchy, pestilence and death on a daily basis. Ever since the government collapsed in 1991, Somalia has been stuck in perpetual crisis. One set of three brothers at the transit camp fled Somalia after their parents were killed 25 years ago, trudging across the Kenya border as three lost souls. For more than a   the brothers had been living together in a small makeshift house in a refugee camp, usually jobless and surviving off the monthly United Nations rations, which they said had been cut down to seven pounds of grain, one cup of oil and a bottle capful of salt. The Kenyans have been threatening to close this camp because of terrorism fears. The brothers had just cleared the final medical checks to be resettled in Rhode Island. Ahmed Hassan, the eldest, a quiet man with a red pen in his pocket, spoke proudly of how in recent days they had been “trained” to wear jackets, hats and gloves when it was cold. While some Americans have said in recent days that they oppose Mr. Trump’s block on refugees, others have said it makes them feel safer. Refugee officials in East Africa have been quick to point out that, in the Somalis’ case, these refugees are among the most vetted people entering the United States. The resettlement process usually takes four to six years to complete and involves database checks, fingerprinting, countless forms and hours of background interviews. The tiny percentage of refugees who make it all the way through are selected because they are considered the most vulnerable of the vulnerable. Most will now return to the same squalid camps where they had been living for years. Others in the pipeline will be put on what the State Department calls indefinite hold. When this was announced at the transit center on Saturday at a meeting in the yard, several men cried. “It was pretty shattering for me,” said Lori Seymour, the official with the International Organization for Migration who made the announcement. This week, the group spoke of all the things they had been looking forward to in America: security, freedom, pizza, meat, driving a car and seeing buildings made not of sticks, but of “mirrors and stone,” as one man put it. “I was even looking forward to paying taxes,” Mr. Hassan said. “If you pay taxes, that means you have a job and you’re making money, right?”'"}, "time": 1742562393.957978}