{"duration": 0.06182241439819336, "input_args": {"text": "'Talk show host Chelsea Handler is set to lead a “Women’s March” at the Sundance Film Festival in January to protest the inauguration of   Donald Trump. [The march, set for January 21, will reportedly be held as part of a nationwide series of simultaneous marches set for the same day in all 50 states.  The flagship march, set to occur in Washington D. C. is expected to draw more than 100, 000 participants and has drawn endorsements from some   celebrities, including Amy Schumer. The Park City, Utah march is not sponsored by the Sundance Film Festival, which runs from January 19 to the 29 this year. Variety reports that Handler will also host a rally following what’s being dubbed “The Women’s March on Main. ” “Sundance has always been a platform for change, not only for filmmakers and filmmaking but also for big ideas for the future,” Handler said in a statement. “If there’s anything I learned in the last year, it’s that we need to be louder and stronger than ever about what we believe in, so I joined some incredible women from around the country to bring our voices together in the streets of Park City. The Women’s March on Main will be an opportunity for the creative community and those in Utah to stand beside those in D. C. ” Handler has been an outspoken critic of Trump since well before Election Day. She previously posed   with an   message scrawled on her back, and has also posed with a piñata bearing Trump’s likeness. In an interview at Variety‘s Entertainment and Tech Summit in September, the    talk show host said that Trump “represents everything that’s wrong in the world. ” “It’s always a good thing to be able to look at somebody and be like, ‘That’s the worst thing that could happen,’” she said. “And I think we should keep him in the spotlight. Not as president, obviously, but, you know, as The Apprentice or whatever that show is called. ” After Trump defeated former Democratic presidential contender Hillary Clinton in November, Handler penned an essay in which she criticized white women for voting for the Republican. “We don’t just have a problem with men supporting women in this country we have a problem with women supporting women,” she wrote in the essay for Arianna Huffington’s new company Thrive Global. “We can wake up America and American women to do a better job going forward to create an activist fire under women to start treating other women and our America with more respect than we have obsequiously shown for our traditional male dominators. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562296.677005}