{"duration": 0.06260299682617188, "input_args": {"text": "'We Are Change \\n\\nScientists may have made a significant breakthrough in restoring human sight, as a woman who had been blind for seven years has regained the ability to see shapes and colors with a bionic eye implant. The 30-year-old woman had a wireless visual stimulator chip inserted into her brain by University of California, Los Angeles (UCLA) surgeons in the first human test of the product. As a result, she could see colored flashes, lines, and spots when signals were sent to her brain from a computer.\\nView image on Twitter The woman, who wished to remain anonymous, suffered no significant adverse side effects in the process, according to a statement.\\nThe device, which was developed as part of the Orion 1 program by Second Sight, uses technology to restore sight by bypassing the optic nerve to stimulate the brain’s visual cortex, according to chairman Robert Greenberg.\\nIt is designed for those who cannot benefit from the Argus II retinal system that was unveiled at Manchester Royal Eye Hospital last year, but has limited application, as it depends on the patient having some retinal cells.\\nThis new system goes one step further by sending signals directly to the brain. It has the potential to restore sight to those who have gone completely blind for virtually any reason, including glaucoma, cancer, diabetic retinopathy, or trauma, according to the manufacturer.\\nThe next step is to connect the implant to a camera on a pair of glasses, and the company plans to seek FDA approval in 2017 to get the go ahead to conduct these trials.\\nUCLA neurosurgeon Nader Pouratian, who implanted the stimulator, said the results of the surgery are promising.\\n“Based on these results, stimulation of the visual cortex has the potential to restore useful vision to the blind, which is important for independence and improving quality of life,” he said. \\nFollow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post New bionic eye implant connects directly to brain, allowing blind woman to see shapes & colors appeared first on We Are Change .\\n'"}, "time": 1742561810.681193}