{"duration": 0.013762950897216797, "input_args": {"text": "'George Soros is helping foot the bill for illegal immigrants’ legal services in Baltimore, Maryland. [Soros’ Open Society Foundation has donated $100, 000 to a Baltimore legal fund, created by a number of open borders groups, to pay for lawyers for illegal immigrants as they try to avoid deportation.  The Southeast Baltimore Open Society Foundation’s Director Diana Morris said illegal immigrants feel as though they are “under attack” by President Donald Trump’s administration, according to the Baltimore Sun, failing to mention that the vast majority of illegal immigrants deported from the U. S. had committed crimes. “We see children afraid to go to school,” Morris said during a press conference in front of a Catholic parish. “Parents afraid to drop their children off at school. ” So far, Soros’ Open Society Foundation is one of the biggest funders of the Baltimore illegal alien fund, with another $100, 000 coming from the Annie E. Casey Foundation and $25, 000 pouring in from Baltimore Community Foundation. Attorney General Jeff Sessions reiterated the Trump Administration’s commitment to prioritizing the deportation of criminal illegal immigrants, while also making clear that any individual living in the U. S. illegally is eligible for deportation. “Everybody in the country illegally is subject to being deported, so people come here and they stay here a few years and somehow they think they are not subject to being deported  —   well, they are,” Sessions said in an interview. Soros has been made famous due to his support for liberal leaders like former President Barack Obama and presidential candidate Hillary Clinton. Soros has previously blasted strong, national borders as an “obstacle” for illegal immigrants and foreign refugees trying to enter the Western world, Breitbart London reported. John Binder is a reporter for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742628561.5760624}