{"duration": 0.08888840675354004, "input_args": {"text": "'Irán reitera que el mundo internacional debe respetar al contenido de JCPOA 2016/11/12 09:15 Twitter El jefe de diplomacia de Irán insta a todas las partes implicadas en el pacto nuclear respeto a sus compromisos para beneficio de todo el mundo. \\nUSviewer, EEUU_ “El pacto nuclear es un acuerdo internacional y todas las partes tienen que respetar su contenido (…) No se trata de un acuerdo bilateral que pueda ser destruido por una sola parte”, recalcó en Praga (capital checa) el ministro persa, Mohamad Yavad Zarif. \\nEn una rueda de prensa celebrada junto a su homólogo checo, Lubomir Zaoralek, el ministro de Asuntos Exteriores iraní rechazó rumores sobre una eventual revisión del Plan Integral de Acción Conjunta (JCPOA, por sus siglas en inglés) durante la administración del presidente electo de EE.UU., Donald Trump. \\nA este respecto, Zarif ubrayó que el JCPOA es un acuerdo entre Irán y el Grupo 5+1 (EE.UU., el Reino Unido, Francia, Rusia y China, más Alemania), ratificado además por el Consejo de Seguridad de las Naciones Unidas (CSNU). \\n“Creemos que el JCPOA es un acuerdo razonable que ayuda a todos, pero esto no significa que Irán carezca de otras opciones para eventuales incumplimientos por las otras partes”, precisó. \\nLa República Islámica de Irán quiere seguir respetando sus compromisos y pide lo mismo a las otras partes con el fin de favorecer los intereses de todos, ha proseguido el jefe de la Diplomacia iraní. \\nSin embargo, añadió, es lamentable que Washington no haya cumplido con parte de sus obligaciones, cuando la parte iraní sí lo ha hecho, habiendo documentos que lo confirman. \\nCon respecto a las relaciones bilaterales Teherán-Praga, el canciller iraní ha elogiado el gran interés de ambas partes en extender y profundizar sus lazos en todos los campos y a todos los niveles, incluida la lucha contra el terrorismo. \\n“Estamos contentos con las propuestas de las autoridades checas sobre la solución de la crisis siria y la lucha contra Daesh (acrónimo en árabe para EIIL)”, concluyó Zarif. No hay comentarios para esta noticia Nombre : '"}, "time": 1742562089.4879608}