{"duration": 1.7318527698516846, "input_args": {"text": "'PRINCEVILLE, N. C.  —   Betty Cobb’s house is a shell nearly two months after floodwaters went halfway up the walls of her   home. Volunteers have ripped out moldy wallboard. Two small chandeliers hung over the bones of the living and dining rooms, the furniture and the carpeting long gone. On the kitchen counter lay a patchwork of family photographs, their vibrant colors washed away, and a book  —   “Hurricane Floyd and the Flood of the Century”  —   saved from the water. Hurricane Floyd, which roared through here in 1999, was supposed to be just that: a     event that caused flooding the likes of which this town’s residents would never see again. But that perception was shattered in early October when Hurricane Matthew barreled inland and sent water pouring around a levee built along the Tar River and into the town, inundating hundreds of homes, including Ms. Cobb’s. Seventeen years ago, Ms. Cobb decided to rebuild, here in a town that has a special place in American history. Princeville, population 2, 100, is believed to be the oldest town chartered by freed slaves, who founded a community that has survived numerous floods and the Jim Crow era. It remains 96 percent black. Ms. Cobb, 69, is now considering a question looming over many homeowners: After two devastating floods, does she want the option to sell her home to the Federal Emergency Management Agency, something that the town’s leaders voted down in 1999, fearing it would lead to the end of their community? “This is home, this is what I know,” said Ms. Cobb, who was leaning toward staying but worried about taking out a loan to rebuild. “I really don’t know. ” A number of residents have expressed an interest in selling to FEMA, which would prevent anyone from building again on their   land and lead to a reduction in the town’s tax base. The town’s four commissioners will vote at some point on whether to make that available to residents (the mayor votes in case of a tie). They can also consider elevation of homes and reconstruction of damaged ones. Residents on the nation’s coasts and along inland waterways have assessed storm damage and wondered if they should relocate  —   a painful and fairly uncommon form of hazard mitigation known as retreat. Here, the consideration has a wrenching historical dimension. This is where a freed slave, Turner Prince, established Freedom Hill in 1865, which became Princeville 20 years later, a town where extended families have proudly lived for generations. And many of them are determined to rebuild. This stretch along the Tar River is no stranger to flooding, and some say that it is probably the reason that   were able to settle the land in the first place. White landowners in the 19th century did not want it. “Their existence in this space was not a matter of chance or choice, but instead the discarded and unwanted space was what former slaveholders allowed them to occupy,” Richard M. Mizelle, Jr. an associate professor of history at the University of Houston, wrote earlier this year, tying Princeville’s location to environmental racism  —   the relegation of black people to   land and hazardous areas that expose them to greater levels of pollution. But many people are proud of what they have built here, and how it has endured. “The freed slaves made it what it is,” said Mayor Bobbie Jones, 55, who wants the levee improved and opposes the buyouts and hopes residents who want to leave will first seek private buyers, perhaps like himself. “If we decide to allow individuals to participate in the buyout, it will have a devastating effect,” Mr. Jones said, standing in front of more than 100 residents at a recent meeting. Other   towns like Eatonville, Fla. which was incorporated in 1887, still exist today. Many others have faded, like Nicodemus, Kan. which has about 25 residents, or Blackdom, N. M. which was abandoned after a drought. “I’m fighting so hard to make sure that Princeville is not one of the casualties,” Mr. Jones said. “It would be a devastating tragedy, not only for me, but for the world. ” Still, residents like Angela   46, want at least the option to move beyond this   land. “That history will never be lost,” said Ms.   whose small white house filled with floodwater after Matthew. The town’s founders, she said, would have settled safer land if they had the chance. “I really believe that they would want better for us,” Ms.   said. In 1967, the Army Corps of Engineers completed a levee that held off floods until Hurricane Floyd’s sent water over its top, forcing harrowing rooftop rescues  —   including Mr. Jones’s  —   and damaging or ruining nearly every home here. The town leadership rejected taking buyouts at that time and instead chose to rebuild the town and fix the levee. Last year, the Corps of Engineers completed another proposal to extend the levee, which officials with the corps say would have at least reduced the latest destruction, but it has not been funded. The flood inundated community pillars like the school and the fire station  —   which is currently operating out of a tent  —   and left residents displaced and streets still piled with debris. “So many people have lost so much, and we’ll have to start all over again,” Linda Worsley, 66, a retired telephone company analyst, said as she picked up the mail at her uninhabitable home even as it was being demolished. Ms. Worsley is determined to rebuild on land that has been in her family since her grandfather, a sharecropper, and his brother bought it in the 1920s. Ms. Worsley, who as a commissioner voted against buyouts in 1999, said residents should have the option this time, although she hopes few people will take them. “I have always been proud to say that I was from Princeville,” Ms. Worsley said, adding, “To just lose all of that, it would be like Princeville is another lost colony. ” It was her job to organize the town’s Christmas parade, which was scheduled for last Saturday but had to be canceled. Instead, Ms. Worsley and her neighbors gathered at the Quality Inn in Tarboro, which is across the Tar River from Princeville, for a lunch of pulled pork, chicken and green beans. So many displaced residents are staying at the hotel while they await FEMA trailers that it has become a stop for the school bus, its lobby a town square for Princeville residents. Mary Alston, a volunteer from Cary, N. C. put the question to Ms. Worsley and two of her friends, “Are y’all going to stay or   …    ” “I’m going to stay,” Annette Waller, 60, said. “Oh yes,” Brenda Hunter said, “I’m going to stay in Princeville,” and talk at the table turned to demolition, duct work and how long it would take to return home. Others in the hotel have decided to leave. David Birth, 70, a retired machine operator, whose home on Main Street was destroyed, said he had already bought land in Tarboro and would live there, in a trailer. “When the first flood came, it took the first house,’’ he said. “The second flood took this one. I’m not going to let my grandchildren be in the same situation. ” For now, many families are waiting: waiting to see how far flood insurance goes, what FEMA will offer, and what the town decides. Back at Ms. Cobb’s house, as volunteers carted away wheelbarrows filled with wallboard, Ms. Cobb’s daughter, Regina, 48, looked across the street where trees hide the Tar River. If it were up to her, she said, she would leave, although she said she would support her mother’s decision. “We were supposed to be on a   flood plain, and we only made it through 17 years,” Regina Cobb said. “That river isn’t going anywhere. ”'"}, "time": 1742563335.9306}