{"duration": 0.09814763069152832, "input_args": {"text": "'She compared him to Hitler, likened his campaign to a “racist” version of “Fun with Dick and Jane” and even said he evoked the murderous child star in “The Bad Seed. ” “I just think he’s” an idiot, Cher said of Donald J. Trump, adding a decidedly unprintable modifier. The crowd on Sunday in Provincetown, Mass. one of the country’s gay capitals, roared its approval at Cher’s succinct and salty assessment. But the famed singer and actress was not just riffing between songs at a concert: She was introducing Hillary Clinton at a   for her presidential campaign. Cher did more than just blister Mr. Trump. She also offered a blunt appraisal of Mrs. Clinton’s strengths and weaknesses. “This chick is just tougher than Chinese algebra,” Cher said of the Democratic nominee. Prompting a mix of nervous laughter and applause, she added, “She is shy, and she’s not the greatest speaker in the world. ” Cher said Mrs. Clinton had told her of being deeply affected by her failed effort to spearhead an overhaul of the nation’s health care system in 1993. “She got so crushed by the G. O. P. just for trying to set up health care, and she never thought it would be so personal, and she said it made her kind of pull in. ” “I hope she doesn’t mind my telling this story,” Cher said, adding: “Too late now!” Her   remarks, recorded by an attendee and posted on Facebook, offered a colorful glimpse at a part of the presidential campaign that has been mainly   to the general public and journalists this election cycle. Both Mrs. Clinton and Mr. Trump have generally barred reporters from attending their  . As Cher demonstrated, the language used in private settings like the event on Cape Cod  —   which brought in more than $1 million for Mrs. Clinton’s campaign  —   can be more inflammatory and raw than what is said with a bank of television cameras present. And it was not just the entertainer, whose Twitter posts often employ a toilet emoji instead of Mr. Trump’s name, who spoke bluntly. Mrs. Clinton, who often discusses how well she was able to work with Republicans during her tenure in the Senate, took the stage and acknowledged former Representative Barney Frank, Democrat of Massachusetts, noting that he has been promoting a new bumper sticker. “I think it is something like, ‘Democrats Aren’t Perfect  —   but They’re Nuts! ’” said Mrs. Clinton. “You understand that. ” But Mrs. Clinton, a portion of whose remarks was also posted online, was not onstage when Cher, 70, arrived to loud applause,   a few lines of her song “Woman’s World. ” Cher warned that Mr. Trump’s slogan, “Make America Great Again,” was only a guise for a more divisive message. “He means, ‘We want to make America straight and white,’” she said. And she belittled Mr. Trump for his stumbling reference at the Republican convention to the “L. G. B. T. Q. ” community. “It’s like he just learned it, you know?” she said to laughter. Speaking without notes, Cher’s performance was more of an   routine than a traditional political speech. “Do you remember ‘Fun with Dick and Jane? ’” she asked, referring to the 1970s comedy. “It’s like ‘Racist Fun with Dick and Jane.’ We’re going to build walls!” Mr. Trump, she added, reminded her of the pigtailed blond actress Patty McCormack from “The Bad Seed. ” “Consummate liar, doesn’t care who she hurts, insane and, you know, sociopathic narcissist,” she said. “I just wish he’d fall off the face of the earth. ” Veering into more incendiary territory, Cher invoked “old despots” and received a subdued response when she mentioned Hitler and Stalin. “We’re going to make Germany great again,” she said, before digressing to a bit on Britain’s vote to leave the European Union. Even as she sought to use her closing comments to praise Mrs. Clinton  —   “I believe in her so much,” she said  —   Cher could not help but return to the object of her ire, Mr. Trump. “I know that if he got into office, our world would be the worst place,” Cher said. “I don’t think we could imagine how bad it could get. ” She added that, “if breaking news ever happened and he had to go to the podium, we would just all go . .. ” She finished her thought with a   expression of disgust. Then she walked off to a roar of applause.'"}, "time": 1742563783.794108}