{"duration": 0.13147449493408203, "input_args": {"text": "'The president of the International Olympic Committee on Tuesday addressed problems with global antidoping efforts, which are led by officials from his organization. Tacitly acknowledging that the current structure was rife with conflicts, he ordered a complete rethinking of it. “We want to make the antidoping system independent from sports organizations,” the I. O. C. ’s president, Thomas Bach, said at a meeting of global sports officials in Switzerland. “The antidoping system has some deficiencies. ” A New York Times investigation this month found that the World   Agency, the global watchdog for sports doping, was hampered by politics and possible conflicts of interest. For years, the agency’s leadership failed to pursue allegations of widespread cheating in Russia. Many within WADA had varying views on the organization’s core purpose, some seeing it as more of a passive coordinator than a proactive policing authority. The organization is jointly funded by national governments and sports organizations, including the I. O. C. Its decision makers are government and Olympic officials, people who might not be inclined to reveal doping transgressions that could mar the integrity of the Games or discredit athletes from their countries. “We’re not going to turn to people and say, ‘These are the rules obey them,’” the agency’s current president, Craig Reedie, told The Times. Mr. Reedie, who is also an I. O. C. vice president, said WADA had not investigated   tips from inside Russia because the agency did not have explicit authority to do so until 2015. Mr. Bach, designating WADA as the leader in the global antidoping effort, said, “Everybody has to understand better who is doing what and who is responsible for what. ” Mr. Bach called on WADA to strengthen its investigative abilities. Last week, in the wake of the Times report, WADA announced that it was hiring a director of intelligence and investigations, Günter Younger, who currently leads the cybercrime unit in a division of the German criminal police. Mr. Bach said an Olympic summit meeting set for Oct. 8 would focus broadly on how to improve the antidoping system, and he called on WADA to convene an international meeting on the topic next year. Mr. Bach also expressed support for last week’s decision by the International Association of Athletics Federations, the ruling body of track and field, to bar Russian track and field athletes from the Rio Olympics. He openly questioned the integrity of athletes from Russia and Kenya, another country where antidoping efforts have been found lacking. But Mr. Bach suggested amending a key detail of the ruling against Russian athletes while emphasizing that specific sports federations had supreme control. The I. A. A. F. said Friday that only Russian track and field athletes who had been living outside the country and subjected to rigorous drug testing could petition to compete in Rio  —   and for a neutral team, not for Russia. Mr. Bach said, however, that Russian athletes who cleared that high hurdle could possibly compete under the Russian flag, and he defended the integrity of Russian Olympic officials. “The Russian Olympic Committee is not suspended,” he said, calling the organization ”very helpful in clearing up the difficult situation in Russia. ” After the announcement, the I. A. A. F. reiterated its belief that any Russian athletes who were cleared to compete “on an exceptional basis” should not compete on behalf of Russia. The organization said it planned to work with Olympic officials “to ensure the decision is respected and implemented in full. ” Russia has been accused of a     doping program extending across sports, although most investigations have been limited to track and field. Russian sports officials have apologized for doping problems but denied state involvement. In a statement on Tuesday, the Russian sports ministry expressed support for the I. O. C. ’s decision. As recently as this month, WADA said, Russian sports officials helped athletes evade drug testing, and federal customs agents and members of Russia’s Federal Security Service tampered with doping samples and intimidated drug testers. Responding to an outcry from athletes wanting broader inquiries, Mr. Bach on Tuesday called on the 27 other organizations overseeing summer Olympic sports  —   from gymnastics to weight lifting  —   to individually scrutinize athletes from Russia and Kenya and assess their ability to compete in Rio in six weeks. The allegations against Russia and Kenya, he said, “put very serious doubts on the presumption of innocence for athletes coming from these countries. ” The I. A. A. F. noted on Tuesday that a majority of athletes from Kenya competed in track and field. The organization said that Kenya’s runners were subject to rigorous testing and that their doping samples had been examined in Qatar and Stockholm in recent months. (Africa’s only   testing lab was decertified this year.) “This does not mean we can guarantee that all Kenyan athletes are clean,” an I. A. A. F. spokeswoman said. “We cannot give such guarantees for any country’s athletes. But we can be confident that an effective testing regime is in place. ” Any athlete who may take issue with a sports federation’s decision can appeal to the Court of Arbitration for Sport in Switzerland, Mr. Bach noted. He said he had learned that Russian athletes or the Russian Olympic Committee would probably file an appeal regarding the track and field decision. “That is the good right of everybody,” he said. WADA disciplined the national antidoping programs in Russia and Kenya in the wake of news media reports that called their integrity into question. For a country to be declared noncompliant by WADA means little, but depriving a nation’s antidoping operation of WADA’s endorsement is a strong signal to the I. O. C. and sports federations. Russia’s sports ministry said Tuesday that its track and field athletes were prepared to undergo a minimum of three extra drug tests before the Olympics. But last week, Rune Andersen, a former WADA official and the current chairman of the I. A. A. F. committee that is monitoring Russia, expressed skepticism about athletes’ ability to prove definitively that they were untainted by a possible   doping program. The former antidoping lab director in Russia has described a sophisticated system whereby athletes on drugs avoided testing positive. “Two or five or 100 negative tests do not mean an athlete is clean,” Mr. Andersen said. “History has shown that is not the case. ”'"}, "time": 1742563285.719388}