{"duration": 0.03201127052307129, "input_args": {"text": "'Female Veterans Release Anti-Trump Ad “The problem with Blue Falcons, like Donald Trump, is they get you killed.” | October 28, 2016 Be Sociable, Share! Donald Trump likes to boast about the endorsement he’s received from military personnel, but he’ll have to work a lot harder to win over those who serve if he is elected as the next Commander-in-Chief. As was recently reported, 55 generals denounced the Republican Presidential candidate in a historic rebuke last week. And now, a group of female veterans with the Common Defense PAC have released a compelling new ad called “Blue Falcon”. \\nThe Common Defense PAC defines itself as “a diverse group of male and female veterans” who represent the United States Army, Navy, Marine Corps, Army Reserves, and Air National Guard. In the ad below, women from various branches of the military explain their aspirations for serving, as well as their disgust with the business tycoon who is running for President. Said veteran Wendy Barranco: “As a migrant, I wanted to give something back to this country that had given me and my family so much. So I became an Army combat medic. When you’re fighting to save a fellow soldier’s life, things get real very quickly. You have to trust your team.” \\nIt’s made clear, however, that Donald Trump is not the guy you’d want on your team. Barranco continued: “Guys like Donald Trump? We call them Blue Falcons.” \\nIn case you’re not familiar with the term, it’s a derogatory euphemism for “buddy-fucker.” The women also explain that a Blue Falcon is the type of person who will step on their teammate to get ahead . \\nFrom his declaration that it should be “expected” for rape to take place in the military to his inappropriate and abrasive comments toward women, minorities, and disabled individuals, he is not the best candidate for President, the veterans assert. This work by Planet Free Will is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.'"}, "time": 1742562434.5515597}