{"duration": 0.07365036010742188, "input_args": {"text": "'WASHINGTON  —   By the time April D. Ryan left the White House briefing room on Tuesday, she was already making headlines: on live television, President Trump’s press secretary, Sean M. Spicer, had cut off her questions to chastise her for what he deemed an inappropriate shake of her head. In Ms. Ryan’s basement office in the West Wing, the phone started to ring. Her fans, it seemed, were having none of it. “I was appalled at the way Sean Spicer was treating you with such disrespect,” said a   woman named Pam, who said she had listened to Ms. Ryan, the White House correspondent for American Urban Radio Networks, for years. “I have people come at me in all sorts of ways,” Ms. Ryan told Pam, nodding. “I thank you so much. ” Hanging up, Ms. Ryan, whose workspace is about the size of a telephone booth, checked her Twitter account. After Mr. Spicer’s harangue, she had tweeted a single word  —   “Lawd! !!!”  —   which was rapidly going viral. (By week’s end, it would be retweeted more than 6, 000 times.) Somebody had replied with a video of Melissa McCarthy imitating Mr. Spicer on “Saturday Night Live” by shoving a lectern at a reporter. Ms. Ryan howled with delight. “I love Melissa McCarthy!” she said. One of the few black journalists in the White House press corps, Ms. Ryan has covered presidents and clashed with press secretaries for 20 years. But her encounters with the Trump administration are propelling the      journalist to a new level of prominence  —   and into a contentious debate over this White House’s attitudes toward gender and race. First there was Mr. Trump’s bizarre request, at a February news conference, that Ms. Ryan arrange a meeting between him and the Congressional Black Caucus. “Are they friends of yours?” the president asked, apparently oblivious to the racial undertones of posing such a query to a black journalist. Then came Tuesday, when Mr. Spicer laced into Ms. Ryan after she asked how the administration planned to revamp its image in light of reports about suspicious ties with Russia. “It seems like you’re hellbent on trying to make sure that whatever image you want to tell about this White House stays,” Mr. Spicer shot back from the lectern, after accusing Ms. Ryan of harboring an “agenda. ” When Ms. Ryan tried to clarify, he interrupted. “You’re asking me a question and I’m going to answer it,” he said, adding in a tone: “I’m sorry, please stop shaking your head again. ” Mr. Spicer is belligerent on the best of days. But his tone toward Ms. Ryan struck some viewers  —   including Hillary Clinton  —   as pointed and condescending, particularly because it was directed toward a black woman. “April Ryan, a respected journalist with unrivaled integrity, was doing her job just this afternoon in the White House press room, when she was patronized and cut off trying to ask a question,” Mrs. Clinton told a women’s group in California. (Mrs. Clinton, who has sat for interviews with Ms. Ryan, saw the exchange on Twitter that day and added the line to her speech.) The hashtag #BlackWomenatWork trended on Twitter, linking Ms. Ryan with Representative Maxine Waters of California, whose hairstyle was mocked by the Fox News host Bill O’Reilly (he later apologized). Whoopi Goldberg expressed her disgust on “The View. ” John Dingell, the former Democratic representative from Michigan, wrote on Twitter: “If the WH doesn’t want talented journalists like @AprilDRyan to shake their heads, perhaps they should stop acting like some damn children. ” For Ms. Ryan, the attention is energizing, and a bit unsettling. She posted supportive comments from fans and celebrities on her Twitter feed, but also some of the racist replies that she says are a byproduct of her job. When a Florida radio host requested a photo with her at the White House  —   “I just love the way you don’t take no for an answer”  —   Ms. Ryan politely declined. “It’s going to look like I’m gloating,” she said. “Look, I’m a black woman in a white male dominated town,” Ms. Ryan said later, when asked if she felt treated differently. But she said her primary goal was to remain focused on her work. “I like Sean Spicer,” Ms. Ryan said. “I don’t want this to hurt him. ” She paused. “I don’t want it to hurt me, either. ” By turns serious and ebullient, Ms. Ryan’s dispatches reach about 400 radio stations around the country, most with a primarily   audience. This is not her first time in the spotlight. Barack Obama’s first press secretary, Robert Gibbs, once tried to cut off her questions about a botched state dinner by instructing Ms. Ryan to “calm down,” adding, “This happens with my son, he does the same thing. ” The remark, widely circulated on cable news, prompted groans and glares from fellow journalists. “She is a force, and you really have to be a force when you are an   woman in one of the clubbiest rooms in the country, the White House press briefing room,” said Jonathan Capehart, the Washington Post opinion writer. “You’ve got to be tough, especially to be in that room for 20 years. ” When Mr. Trump, at his news conference, tried to deputize Ms. Ryan as a liaison with black lawmakers, Mr. Capehart recalled thinking: “What the hell just happened?” “Does he think that all black people know each other and she’s going to go run off and set up a meeting for him?” Mr. Capehart said. Adding of Ms. Ryan, “When she is belittled, she rises above it. ” Mr. Spicer has clashed with numerous journalists in the briefing room  —   men and women  —   and this week he described himself as “kind of astonished” that his    with Ms. Ryan was singled out. “April is a tough reporter who knows how to throw it out and take it back,” Mr. Spicer said in an interview with the radio host Hugh Hewitt. “But to suggest that somehow because of her gender or race she is treated differently, I think, is frankly demeaning to her. ” He added: “I’m treating April Ryan with the same pushback that I would any other reporter in that room. ” Ms. Ryan joined   American Urban Radio Networks in 1997 to cover the White House, after reporting at local stations in Baltimore and Tennessee. At first, she sat in the back of the West Wing briefing room, among the more obscure news outlets. Over the years, she made her way forward, sometimes taking the chairs of   reporters and eventually securing her current seat in the third row. She has published two books, “The Presidency in Black and White” and, last year, “At Mama’s Knee,” a look at motherhood and race. (Ms. Ryan is a single mother of two daughters.) Her purview is general politics, but she often pursues questions germane to a black audience, a rarity in a press room where white men are the majority. “The truth of the matter is, if she doesn’t ask the   questions, they may never get asked,” said Jerry Lopes, president of program operations at Ms. Ryan’s network. After Mr. Spicer’s remarks on Tuesday, Ms. Ryan was greeted by reporters with smiles and a rousing “Hey troublemaker!” from a passing cameraman. Asked who might play her on “S. N. L. ,” Ms. Ryan burst out laughing, started to dismiss the idea, then allowed that she was a fan of Taraji P. Henson, who plays Cookie on “Empire. ” In January, Ms. Ryan was spotted outside Mr. Spicer’s office, giving him a hard time about one of his answers. Mr. Spicer, who had taken pains to call on Ms. Ryan that day, was incredulous. “How many times did you get called on in the Obama administration?” he asked. “Now and again,” Ms. Ryan replied, slyly. The day after the   incident, Mr. Spicer walked into the briefing room and conspicuously called on Ms. Ryan first. “How are you today?” he asked with a smile from the lectern. “I’m fine, and how are you?” Ms. Ryan replied, drawing laughter. “Fantastic,” Mr. Spicer said. And then Ms. Ryan moved on to the news of the day.'"}, "time": 1742628494.63314}