{"duration": 0.3006916046142578, "input_args": {"text": "'The inmates were just starting their day on July 6 when dozens of corrections officers burst into their dormitory, shouting for everyone to get down on the floor. The raid at   Correctional Facility, outside Utica, N. Y. officials said, was a surprise search for weapons made urgent after a bloody injury to a guard three days earlier. But over the next two hours, according to inmates, officers beat and stomped on each of the more than 30 prisoners present that morning, screaming curses and racial epithets and destroying property. Several men said their ribs were broken by kicks and punches. A    prisoner said he was rammed, headfirst, through the Sheetrock wall in his room. Down the hall, a    inmate said his nose was broken as a guard repeatedly slammed a metal door into his face. In a whispered interview last month in the visiting room of the   prison, a    inmate from Brooklyn recalled how an officer knelt beside him as he lay on the floor. The prisoner, Raymond Broccoli, who is serving a   sentence for robbery, said the officer hissed, “You want to know what it feels like to feel weak?” Mr. Broccoli said the guard then jammed “something metal” into his rectum. “It was bigger than a pen, about the size of those small flashlights they carry,” he said. At least two other inmates have claimed they were similarly violated. The prisoners said they were warned to keep quiet and not seek medical treatment, otherwise the guards would attack again. But on Nov. 2, a week after a Marshall Project reporter asked about the episode, the state’s corrections commissioner suspended the prison’s two top officials, the superintendent and his deputy, pending an inquiry. A spokesman for the New York State Department of Corrections and Community Supervision said that its Office of Special Investigations and State Police officers were investigating the dormitory raid and the July 3 injury to the prison guard that preceded it. The department “will not tolerate any wrongdoing that puts the safety of its facilities at risk, and will not hesitate to pursue disciplinary charges or refer cases for criminal prosecution if warranted,” the spokesman said. Investigators face dueling narratives: The guards’ union insists the injured officer was the victim of a planned attack by two prisoners affiliated with the Bloods street gang. Inmates cite a different culprit, a rickety reclining chair from which the officer fell, gashing his head as the two prisoners rushed to his aid. As in most of the state’s prisons, there were no cameras to record the episodes, officials said. The guard, Nicholas Kahl, a Navy veteran in his   who had been a corrections officer for two years, has been out on medical leave since the injury, records show. He did not respond to emails or return phone calls. Whatever happened to him, the ensuing assault was indefensible, a lawyer retained by inmates’ relatives said. “The apparent breadth of involvement by correction officers and   supervisors at   in this barbaric and unjustified use of collective punishment is stunning,” said the lawyer, Edward Sivin, who has filed a notice of intent to sue in the state’s Court of Claims on behalf of 32 inmates. The union, the New York State Correctional Officers  Police Benevolent Association, declined to comment. “As with previous unsubstantiated allegations made by convicted felons, it is more prudent to allow the investigation to be completed so we know all of the facts,” said James Miller, a union spokesman. The allegations of brutality against inmates at   are the latest involving New York prisons. “Excessive use of force in prisons, we believe, has reached crisis proportions in New York State,” Preet Bharara, the United States attorney in Manhattan, said as he announced charges in September against five officers accused of beating an inmate at Downstate Correctional Facility in 2013. His office also investigated the death of an inmate at Fishkill Correctional Facility last year after a violent clash with officers, although no charges resulted. In March 2015, three officers at Attica Correctional Facility pleaded guilty to charges of official misconduct after their unprovoked beating of an inmate who had many bones broken. Jack Beck, a director of the Correctional Association of New York, a nonprofit authorized by the state to monitor prisons, said the scale of the alleged attack at   was surprising. “Do guards retaliate when an officer is injured? Yes,” he said. “They come in and throw property around, smack people. But to significantly assault large numbers of people, that’s unusual. ” The guards at the prison, in Marcy, a rural town along the Erie Canal, refused to accept that Officer Kahl’s injury had been an accident, inmates said. Ricardo Moore, chairman of an inmate liaison committee there, served in the Army during Operation Desert Storm and said he and Officer Kahl talked about their military experiences. “He was easygoing. No one was mad at him,” said Mr. Moore, 45, who is serving a   sentence for drug possession. He said the guard usually sat in a plexiglass office known as “the bubble” in the dormitory’s day room, with his legs propped up on the desk as he reclined in a chair. “I used to joke with him about that chair,” Mr. Moore said. “I said, ‘Look out, you are going to fall over. ’” That day, Mr. Moore recalled, Officer Kahl made his rounds and then went into the office, which included a desk and a locker, and was often unsecured. He said he saw the guard “leaning back in his chair with a book open, but his eyes were closed. ” Moments later, when he was in his room, Mr. Moore heard a commotion. He ran back to the day room. “I see two inmates inside the bubble and they are trying to help Kahl up off the floor. ” Stacey Wyne, 36, who was released in August after serving four years for selling drugs, said he also witnessed the guard reclining in the chair. “I even know the book he was reading, a Stuart Woods novel,” Mr. Wyne said. “He just fell over. ” He said two inmates entered the office to help Officer Kahl. “They were asking him was he O. K. and he says, ‘Yeah. ’” One of the inmates said he was going to pull an emergency alarm carried by officers to get help, Mr. Wyne recalled. In prison it is called “pulling the pin,” and considered a summons to a major emergency. Officer Kahl said no, Mr. Wyne said, but “they pulled it anyways. ” A news release issued by the union said guards responding to the alarm found Officer Kahl unconscious and bleeding. He received eight stitches over his eyebrow. Two inmates who guards believed were responsible for the wound were taken to solitary confinement. Four months later, no criminal charges have been filed or disciplinary actions taken against those inmates, a corrections department spokesman said. The prisoner accused of leading the attack, Darnell Getfield, 27, of Brooklyn, has since been moved to another   prison. Typically, inmates accused of assaulting officers are given lengthy sentences in isolation at   prisons. Mr. Getfield, who is serving a   sentence for assault and weapons possession, did not respond to a letter asking him to contact a reporter. Two inmates said Mr. Getfield may have had gang ties, but they noted he was also a member of the inmate liaison committee and appeared to have had a good relationship with Officer Kahl. Immediately after the guard was injured, Mr. Moore said, corrections officers and prison administrative employees began grilling inmates. As Mr. Moore was questioned, an officer loomed over him, threatening to beat him with a ream of copying paper, the inmate said. Later, Mr. Moore said he was handcuffed and underwent further interrogation. Officers held him over a stairwell by the waist of his pants. “They said, ‘Have you ever taken an elevator ride? ’” Mr. Moore recalled. “I was terrified. They said I had better tell the right story. ” Another inmate, Mr. Broccoli, said he was taken in handcuffs to a room where a guard stood beside him as he was questioned by an administrative employee. “He was saying: ‘We know who ordered it and we know who did it. You better tell us. ’” Each time he insisted he did not know, Mr. Broccoli said, the officer “smacks me and bangs my head against the wall. ” At one point, Mr. Broccoli said, the guard whispered in his ear, “What’s a white guy like you doing protecting” the inmates, describing them as animals and using a racial slur. Most of the dormitory residents were black or Latino, Mr. Broccoli said, while all of the officers involved were white. Mr. Broccoli was one of seven men interviewed in prison or after they were released who have provided accounts on the record of what happened three days later. Seven other inmates described the episode in letters to Mr. Sivin, the lawyer. (Their names were redacted in copies provided to a reporter because they did not want to be publicly identified.) “I will never forget that day,” Mr. Wyne said. “I made some mistakes. But I shouldn’t have been treated like that. ” He said as many as 40 officers raced into the dorm, known as House 4H, situated in one of a cluster of buildings at   which is adjacent to two other large state prisons. “They came running inside yelling and beating on everyone,” Mr. Wyne said. He and three roommates were punched and kicked as officers emptied prisoners’ lockers and tipped them over, he said. One guard, he recalled, said, “‘You look like you need your hair washed,’ and he dumped my VO5 on top of me. Then another cop kicks me in the head. ” When the raid was over, “the place looked like Hurricane Katrina,” Mr. Wyne said. “People were under mattresses they had thrown on top of them, they had lockers on top of them. ” Pablo Dones, 58, who is serving a   term for violating his drug conviction parole, said that when the guards came into the dorm, he flung himself on the floor, arms outstretched. “You could hear the slaps and the kicks, and everything getting smashed,” Mr. Dones said. “Guys were yelling in pain. ” He said the first guard who entered his room kicked one of his roommates, a    man named Tony King, in the head. “Hurt him bad,” Mr. Dones said. When a guard ordered him to stand, Mr. Dones, who had recently undergone hernia surgery, said he struggled to his feet. “I made it to one knee and he kicked me right where I had the operation. ” He screamed in pain, he said, but another guard grabbed him and began banging his head against the wall. “He was hitting me against the wall so many times, my head went right through it,” Mr. Dones said. For weeks, he said, he had a large    knob on his forehead. “They just ran amok,” he said. Matthew Petrillo, 41, recalled that as he lay on the floor beside his locker, a guard smashed its metal door into his face many times. He was released on parole last month after serving five years for selling drugs. His mother said she was shocked by his appearance when he came home. “His face was so messed up, I was crying I couldn’t believe it,” said his mother, Linda, who did not want her surname used because she fears official retaliation. “He did something wrong and he paid his dues. But send him back to me in one piece. You have no right to abuse him. ” Matthew Aliaga, 28, who is serving three years for grand larceny and forgery, said guards kicked him in the chest and the leg as another officer stood on his ankle. Mr. Aliaga, who is gay and taking hormones to transition to female, said officers called him “disgusting names,” including a gay slur. One officer ground his hormone medications to dust with his boot, he said. Another tore some of his books apart. “I had this book by Anderson Cooper about him and his mother that I was really looking forward to reading,” he said, “and they just destroyed it. ” Mr. Moore said most of the officers had removed their name tags. They hurled slurs and curses at the prisoners, he and other inmates remembered. “‘Oh, you like to pick on the weak? See how you like it,’” he recalled them saying. “They were telling the white guys, ‘You are a disgrace to the white race. ’” He said he was kicked in the head, the ribs and the legs, then beaten with fists. He and other inmates reported that officers sliced electric cords on appliances the inmates had in their rooms, including lamps, clocks and radios. As the raid wound down, Mr. Moore said he heard guards calling out, “The brass is coming. ” A few minutes later, he said, he saw the superintendent, Joseph Ward, and his top deputies walking down the hall. Mr. Ward and Joseph Corey, the deputy for security, were suspended this month. He and another inmate were later ordered to sweep up the dorm, he said. “We got to one room and there were two guards in there urinating on the floor, all over the guys’ stuff,” he said. One of the officers, Mr. Moore said, addressed him. “He said, ‘Moore, you’re a veteran, right?’ I said yes. He said, ‘What do you do when someone tries to injure one of your buddies?’ I said my military responsibility would be to hurt him back. He said: ‘So you see why we are doing this. You guys tried to kill one of ours. ’” The prisoners said they were warned not to talk. Phone calls and mail would be monitored. “We’ll be back to do this all over again,” a prison lieutenant threatened, Mr. Moore said. Still, word got out. Mr. Broccoli, who has since been moved to another prison, said that he was mocked by guards after the episode. They “snicker when I walk by,” he said. “I am so ashamed all the time. I’ve questioned my manhood. ” Nelson Friszell, 44, who is serving five years for selling drugs, asked his wife to relay to a reporter how he had also been beaten and sodomized with a metal object by the prison’s guards. “My husband is a big man,” said his wife, Deirdre Velez. “I think they were trying to take his dignity. ”'"}, "time": 1742564600.8560038}