{"duration": 0.04750871658325195, "input_args": {"text": "\"Deutsche Bank Unloading Asian Assets to Boost Ledger November 03, 2016 Deutsche Bank Unloading Asian Assets to Boost Ledger \\nDeutsche Bank's sale of a 20 percent stake in Chinese peer Hua Xia to PICC Property and Casualty has received regulatory approval, Germany's flagship lender said on Thursday. \\nHopes to expand into the Chinese banking market never materialized for Deutsche Bank as for several other Western lenders. Bank of America <BAC.N> reacted in 2013 by divesting a shareholding in China Construction Bank <601939.SS>, while Citigroup <C.N> sold its stake in Chinese lender Guangfa [GDDVB.UL] earlier this year. \\nDeutsche Bank, which faces large legal costs for cleaning up past missteps as well as for reinventing itself in a changed market and regulatory environment decided the sale of the Hua Xia stake, in which Deutsche Bank invested in 2006, in December 2015. \\nBut it took Hua Xia longer than expected to obtain clearance for the deal from the ChinaBanking Regulatory Commission, weighing on the price of the sale. \\nWhile Deutsche Bank had said last year that it was selling the stake for 23 to 25.7 billion yuan or 3.2 to 3.7 billion euros ($3.6-4.1 billion), a move in exchange rates means that the price has come down to 3 to 3.5 billion euros. \\nAt the beginning of 2015, the stake's market value stood at 4 billion euros, but it plunged in a global selloff of Chinese equities \\nDeutsche Bank wrote down the value of the stake to 2.8 billion euros in its books as of Sept. 30, among other due to dividend payments receives from Hua Xia. \\nNew bank rules make it disadvantageous for banks to hold minority stakes in other lenders. \\nThe Hua Xia divestment frees up capital and boosts Deutsche Bank's capital ratio by 50 basis points to 11.6 percent. The effect of the sale had already been taken into account in the European Central Bank's stress test of Europe's banks in summer. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories\""}, "time": 1742562085.3321006}