{"duration": 0.06854820251464844, "input_args": {"text": "'Council approves cleanup funding \\nCurrent retirees’ pensions and health care benefits will not be affected. \\nDuPont says it hopes to save $550 million over the years by freezing those pensions. It says it also will stop giving future retiree health benefits to staff currently younger than age 50, saving an additional $50 million. \\nThe Wilmington, Del.-based pesticides and materials maker, which employs about 50,000 after spinning off such companies as Axalta and Chemours in recent years and laying off 5,000 management, research, and other staff last winter, says it has followed Lockheed, Johnson Controls and other large manufacturers in switching workers from guaranteed pensions to 401(k) savings plans, whose value rises and falls with the investment markets. \\nIn 2007, DuPont stopped adding new hires to the pension plan. It continued to boost promised benefits to plan members still working at the company. \\nSince then, it has assigned new workers to 401(k) retirement plans. Instead of guaranteeing pensions whose value rises with years of service, the company pays the equivalent of up to 9 percent of employees’ salaries into investment accounts if they set aside up to 6 percent of their pay. \\nWorkers put that money into funds from a menu of investments, in hopes they can stretch the tax-protected accounts, plus Social Security, to pay their way in retirement. \\nThe freeze will take place in 2018 if the company stays on schedule to complete its planned merger with Dow Chemical Co. and split into separate pesticide, materials and specialized-products manufacturing companies, according to spokesman Daniel Turner. \\nTurner said the freeze was not connected to the Dow deal. Under CEO Edward Breen, DuPont has been cutting jobs, closing plants and consolidating vendors in an effort to boost profits and streamline operations in advance of the reorganization. \\n“Sadly, the ongoing cash buyout of 18,000 vested pensioners and today’s action to end pension accruals and health benefits project a company with little concern for those who have stayed with the company in order to build security for their families in the future,” Lawrence Craig Skaggs, a retired DuPont lobbyist, told the Philadelphia Inquirer. \\nSince the Dow merger was announced in 2015, Skaggs has posted details and questions concerning DuPont retirement issues at his 6,300-member DuPont Pensioners Facebook site. \\n“We remain concerned that the DuPont pension plan,” which covers 133,000 current workers and retirees, “is less than 70 percent funded,” Skaggs added, citing Labor Department reports. \\nRetirees have been pressing DuPont and Dow to put more assets into retirement plans before they divide the companies, to ensure the plans remain solvent. \\nPensioners in corporate plans that run out of cash typically are rescued by the federal Pension Benefit Guaranty Corp., which imposes limits on early retirement and payments above insured levels. \\nEarlier this year, DuPont offered some retirees who are not yet collecting pensions the options of taking their money in lump-sum payments, or replacing their pensions with insurance annuities, backed against loss by state insurance guaranty funds. Recommended for you'"}, "time": 1742564302.548786}