{"duration": 0.07887864112854004, "input_args": {"text": "'. 14 Outstanding Facts About the Anunnaki The Anunnaki, probably the number one topic when it comes to the Ancient alien theory, but what are ... Print Email http://humansarefree.com/2016/11/14-outstanding-facts-about-anunnaki.html The Anunnaki, probably the number one topic when it comes to the Ancient alien theory, but what are the facts? 1. In many depictions of the Anunnaki , we can see strange objects worn by “those who came from the stars”, one of the most interesting examples are “wrist watches” which appear in almost every single depiction of the Anunnaki. 2. The Sumerians were the first people who started building actual cities, organized using actual city grids like we see in modern day cities around the world, according to the Ancient Alien theory, the Anunnaki transferred this knowledge to ancient man. 3. In the 19th century archaeologists exploring the ancient ruins of Nineveh discovered 22,000 clay tablets which are directly connected to the Anunnaki . 4. In 1976 author Sitchin published his personal translations of the Sumerian texts in a series of books called “ The Earth Chronicles “. According to Sitchin the clay tablets describe an alien race known as the Anunnaki came to Earth to mine gold . 5. Gold reflects infrared light. Infrared is basically light you don’t see it, but we interact with it in the form of heat, the radiation interacts with our molecules and that makes them vibrate faster and you’ll feel that as heat, gold also makes a good heat shield, partly because it’s so malleable. You can make gold very thin; it’s easy to work with; and it has great properties for reflecting and heat protection making it a “must have” resource not only for us but potentially for extraterrestrial visitors as Sitchin suggests. 6. Sitchin theorized that “the Anunnaki” came from another planet in our solar system that has an 3,600-year elliptical orbit. 7. According to the ancient Sumerian tablets, the Anunnaki genetically altered primitive mankind and created a labor force which allowed them to mine gold faster. 8. According to Zecharia Sitchin, “the Adamu” were the first modern humans, they were created by the Anunnaki 450,000 years ago when they genetically mixed their DNA with that of prehistoric man and that way obtained a labor force which did what the Anunnaki wanted. 9. “Adam” in Hebrew stands for “man”. “Adamu” is what the Sumerians refer to as “first man,” the Anunnaki slaves. 10. Zulu legends speak of a time when “visitors from the stars” came to excavate gold and other natural resources. These mines were worked by slaves created by the “First People“. — By Ancient Code Bonus 11. According to both texts and depictions, the Anunnaki were giants (notice the Anunnaki god below, offering agriculture to mankind — seated, he is just as tall as the two Homo Sapiens standing in front of him). 12. The Anunnaki knew about 6,000 years ago that the sun and the planets in our solar system are spherical and that they revolve around the sun (see the above depiction of our solar system), which is clear evidence that their stories about coming to Earth from outer space were real. 13. According to the so called \" Lost Book of Enki ,\" the Anunnaki built the Egyptian pyramids after a great cataclysm that almost wiped out our species. 14. According to the Sumerian King List and the Sumerian tablets , the Anunnaki lived extremely long lives or, possibly, they could not die from natural causes. \"After the kingship descended from [the] heaven[s], the kingship was in Eridug. In Eridug, Alulim became king; he ruled for 28800 years. Alaljar ruled for 36000 years. 2 kings; they ruled for 64800 years.\" By HumansAreFree.com  '"}, "time": 1742564336.8650012}