{"duration": 0.11177587509155273, "input_args": {"text": "'Gawker Media, the irreverent company that pioneered the wry tone and    approach that came to embody a certain style of web journalism, put itself up for sale on Friday in an acknowledgment that its future as an independent news organization was in doubt. Gawker said it had filed for Chapter 11 bankruptcy and would conduct a sale through an auction. The company is under significant financial pressure from a $140 million legal judgment in an    lawsuit by the former wrestler Hulk Hogan and facing a determined foe in the Silicon Valley billionaire Peter Thiel, who is funding legal cases against it. Ziff Davis, a digital media company, has submitted an opening bid, which a person briefed on Gawker’s plans said was in the range of $90 million to $100 million. The person spoke on condition of anonymity to discuss the sale process. Gawker expects a sale to close by the end of the summer. But even as Gawker took stock of its next steps, it remained, in typical fashion, defiant. “Even with his billions, Thiel will not silence our writers,” Nick Denton, Gawker’s founder and chief executive, said on Twitter. “Our sites will thrive  —   under new ownership  —   and we’ll win in court. ” (Mr. Denton, through a spokesman, declined further comment.) Since its founding in 2002, Gawker has espoused a conversational tone that came to be mimicked across the internet and on social platforms like Twitter. Gawker and its affiliated sites  —   including the   Deadspin and Jezebel, which is aimed at women  —   have relentlessly and gleefully chronicled the lives of the powerful, and often delivered   exclusive stories, some of them too    for other publications. The company was also an incubator of talent: Employees went on to found websites like The Awl and work at publications like The New Yorker and Time. Gawker also had many detractors, who said it often went too far and published items with little news value that aimed to embarrass individuals. But over the last year Gawker. com has been going through something of a cultural transformation. Mr. Denton has vowed to make the site nicer and Gawker has shifted to politics and away from coverage of the New York media world and celebrity gossip. The decision to file for bankruptcy and put itself up for sale is the latest development for a company that has faced a seemingly unending barrage of bad news in the last year. There was the maelstrom last summer after Gawker published, and then removed, an article about a married male media executive who sought to hire a gay escort. That decision led to the resignations of two top editors. More recently, there was the lawsuit by Mr. Hogan, whose real name is Terry G. Bollea, which has roiled the company and raised questions about its path forward. “It really was an incredibly bad year,” said Hamilton Nolan, a writer who has worked at Gawker for eight years. “I think they’ll study this in journalism schools one day as being the single worst year in media company history. ” In Gawker’s new offices in Manhattan on Friday, the mood was somber. Around noon, Mr. Denton and Heather Dietrick, the company’s president and general counsel, held a meeting to inform employees of the company’s plans and provide reassurance that Gawker would operate as usual during the sale process. “They emphasized that the future is uncertain, but for now we’re going to keep doing what we do, and that was useful for people to hear,” said Alex Pareene, the editor in chief of Gawker. Employees said that few people had known before the meeting of the company’s decision to file for bankruptcy. A keg of beer was brought in and pizzas were ordered. “It was not a raucous or even particularly depressing affair,” Mr. Pareene said. “We’ve had more depressing meetings and we’ve had more argumentative meetings. ” Gawker’s sites published posts assuring readers they were not going anywhere. Filing for Chapter 11 stays claims from creditors, including court judgments  —   meaning Gawker will not need to begin paying the $140 million that was awarded in March to Mr. Bollea. It also allows companies more time and more control as they reorganize themselves. In its bankruptcy filing, Gawker listed $50 million to $100 million in assets and $100 million to $500 million in liabilities. The company still plans to appeal the case. Also on Friday, a judge in Pinellas County Circuit Court in Florida granted Gawker’s request for a stay of the judgment against it in the lawsuit, pending an appeal. That decision essentially became redundant once Gawker filed for bankruptcy. Weeks earlier, Mr. Thiel acknowledged in an interview with The New York Times that he was financially supporting Mr. Bollea’s lawsuit, as well as other lawsuits against the organization. Mr. Thiel, a founder of PayPal and one of the earliest investors in Facebook, was outed as being gay by one of Gawker’s blogs, the   Valleywag, nearly a decade ago. He said that Gawker published articles that “ruined people’s lives for no reason” and prompted his decision to finance cases against the company. “It’s less about revenge and more about specific deterrence,” Mr. Thiel said of his supporting Gawker’s legal opponents. “I saw Gawker pioneer a unique and incredibly damaging way of getting attention by bullying people even when there was no connection with the public interest. ” A spokesman for Mr. Thiel did not return a request for comment on Friday. Gawker is also exploring at least one lawsuit against Mr. Thiel, according to the person briefed on Gawker’s plans. The offer by Ziff Davis, whose online properties include IGN, Geek. com and AskMen. com, is what is known as a “  bid,” essentially setting a floor in a   auction. Money from a sale would be held aside to cover creditor claims, including any damages after the appeals process. In an internal memo obtained by The New York Times, Ziff Davis’s chief executive, Vivek Shah, said that under the terms of a potential agreement, the company would acquire Gawker Media’s properties but none of its liabilities. When discussing its plans for Gawker Media, he referred to the benefits of having all of the company’s sites, but conspicuously omitted any mention of Gawker. com. He said the auction would most likely take place at the end of July. Other bidders, which will probably include other media publishers, are expected, particularly with the threat of assuming legal claims removed with the bankruptcy filing. In January, Gawker sold a minority stake in the company to the investment company Columbus Nova Technology Partners, partly in preparation for the lawsuit by Mr. Bollea. Mr. Bollea sued Gawker Media in 2012 over Gawker. com’s publication of a    tape that showed Mr. Bollea having sex with a woman who was at the time the wife of a friend of his. In March, after a   trial, a Florida jury awarded $115 million in damages to Mr. Bollea. A jury later awarded $25 million more in punitive damages, bringing the total to $140 million. On Friday, some Gawker employees remained hopeful that a new owner might mean a fresh start, but there was also perhaps a tacit acknowledgment that Gawker as everyone knew it could soon be a thing of the past. “There’s not going to be the magical happy ending to the story,” Mr. Nolan said. “It doesn’t necessarily mean it’s going to be the worst ending to the story, but we’re not just going to go back to everything being how it was. ”'"}, "time": 1742564300.7846587}