{"duration": 0.04752087593078613, "input_args": {"text": "'. CDC Blocks Testimony of Vaccine Whistleblower in Medical Malpractice Case An important witness in a case focusing on the link between vaccines and autism has been stopped fro... Print Email http://humansarefree.com/2016/10/cdc-blocks-testimony-of-vaccine.html An important witness in a case focusing on the link between vaccines and autism has been stopped from testifying. Thomas Frieden, the director of the Center for Disease Control (CDC), has stopped CDC whistleblower Dr. William Thompson from giving evidence on scientific fraud and destruction of evidence by senior CDC officials in a recent case. Attorneys Bryan Smith and Robert F. Kennedy, Jr. , of Morgan & Morgan , have wanted to have Dr. Thompson testify in a medical malpractice case to explain how the CDC committed scientific fraud in a series of studies, which found no link between vaccines and autism. After denying the request, Dr. Frieden said, \"Dr. William Thompson\\'s deposition testimony would not substantially promote the objectives of CDC or HHS [Health and Human Services].\"Dr. Thompson is a 19-year veteran at the CDC and former senior vaccine safety scientist at the agency\\'s Immunology Safety Office, and is the co-author of four key studies that the CDC widely suspects will stop the use of the MMR vaccine and vaccines containing the mercury-based preservative thimerosal, from being linked to autism. Thompson\\'s current position is at the CDC\\'s National Center for HIV/AIDS, Viral Hepatitis, STD and TB Prevention. Back in August 2014, Dr. Thompson revealed that the data behind CDC\\'s principle vaccine safety studies demonstrated a causal link between vaccines and autism or autism symptoms, even though CDC claims the opposite is true. Thompson says,based upon interpretation of the data: \"There is biologic plausibility right now to say that thimerosal causes autism-like features.\" Dr. Thompson invoked federal whistleblower protection in August 2014. Shockingly Thompson has claimed that his bosses, including the CDC\\'s Immunization Safety Office Branch Chief Frank Destefano, specifically ordered him and three other CDC scientists to destroy data demonstrating vaccine induced autism in CDC\\'s seminal 2004 study (Destefano, et al. 2004). The data in question unexpectedly showed a 250 percent increase in autism among young black males who received the vaccine on time (before their third birthday) in comparison to those who were vaccinated after their third birthday. It also showed a significant link between the vaccine and isolated autism, which is an autism that occurs in normally developing children with no other medical problems. According to Thompson, Destefano called his four co-authors into a room and ordered them to dump the damning datasets into a giant garbage can. The published study left out those sets of data. This study is now cited in 91 other papers on PubMed as proof of vaccine safety, is the main building block on the idea that vaccines don\\'t cause autism. The case in question is to do with 16-year-old Yates Hazlehurst. The case is claiming that Yates is autistic as a direct result of vaccine injuries acquired in 2001 when the vaccine was improperly administered. Because of the Vaccine Injury Compensation Act of 1986 (VICA), which protects doctors from any liability to do with vaccine injuries, Hazlehurst v. The Jackson Clinic is the only vaccine injury case in 30 years that has reached a court in the US. Dr. Thompson wishes to reveal the scientific fraud and destruction of evidence that occurred in the studies he was involved in. The problem has arisen due to the Whistle Blower Protection Act, which means Dr. Thompson can not testify under oath without the permission of the director of the CDC, Dr. Thomas Friede. Hazelhurst\\'s lawyer Kennedy, who argued before Tennessee Senior Circuit Court Judge William Acree that Dr. Thompson\\'s testimony was necessary, said: \"Yates, and almost 5,000 other vaccine injured autistic children, lost their cases in vaccine court because CDC and the Justice Department submitted fraudulent science wrongly denying the vaccine-autism link.\" Judge Acree ordered on Feb. 5 that Dr. Thompson should be deposed, accepting the logic of the argument, and following this ruling, Smith filed a formal request to CDC to make Thompson available for deposition and trial testimony. \"Since that original study data is only available from Dr. Thompson,\" Hazelhurst\\'s other attourney Smith explained, \"We are very confident that a federal judge will order CDC to make Thompson available.\" Reference: organicandhealthy.org Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742628591.3418844}