{"duration": 0.0477147102355957, "input_args": {"text": "'The National Security Agency (NSA) continued to collect the phone records of U. S. citizens, despite a law change which limited the practice, according to a report. [“The report from the office of Director of National Intelligence Dan Coats was the first measure of the effects of the 2015 USA Freedom Act, which limited the NSA to collecting phone records and contacts of people U. S. and allied intelligence agencies suspect may have ties to terrorism,” reported Reuters on Tuesday. “It found that the NSA collected the 151 million records even though it had warrants from the secret Foreign Intelligence Surveillance court to spy on only 42 terrorism suspects in 2016, in addition to a handful identified the previous year. ”  “The NSA has been gathering a vast quantity of telephone ‘metadata,’ records of callers’ and recipients’ phone numbers and the times and durations of the calls  —   but not their content  —   since the September 11, 2001, attacks” they continued, adding that “On Friday, the NSA said it had stopped a form of surveillance that allowed it to collect the digital communications of Americans who mentioned a foreign intelligence target in their messages without a warrant. ” In April, a report published by the Intercept revealed that the NSA had spied on civilians using blimp in Maryland. “Back in 2004, a division of the NSA called the National Tactical Integration Office fitted a   diameter airship called the Hover Hammer with an eavesdropping device,” reported the Intercept, adding that “The agency launched the   airship at an airfield near Solomons Island, Maryland. ” “Unsurprisingly, privacy groups have expressed concerns about the prospect of the blimps being used domestically to spy on Americans. However, military officials have often been quick to dismiss such fears,” they continued. “In August 2015, Lt. Shane Glass told Baltimore broadcaster WBAL that the JLENS blimps being tested in Maryland were not equipped with cameras or eavesdropping devices. The same cannot be said, it seems, of the NSA’s Hover Hammer. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562042.4488304}