{"duration": 0.38356494903564453, "input_args": {"text": "'( theoccidentalobsever.net ) Pictures and captions by Darkmoon \\nYes, it’s just another Jewish plot. And the way they’re doing it is by scamming the public into believing that these illegal immigrants—all of them adult males—are helpless “child refugees”. \\nThese “child refugees”, who have conveniently lost their passports, claim to be under 18. Some of the child migrants even have bushy beards. The British government and the elite media argue that migrants tend to “age quickly”—because of their traumatic war experiences. You can’t make this up. \\nThe dismantling of the Calais “Jungle” refugee camp has been marked by huge scenes of disorder with rioting, at least one gang rape , and much of the camp going up in flames. But there has been uproar in Britain too since the realisation that most of the thousands of “child refugees” , which the Prime Minister had agreed to accept, were neither children nor refugees. \\nFrom the moment these healthy, strapping adult male migrants stepped off the bus in London it was obvious that the British people had been subjected to yet another massive immigration deception. Those who enabled and organised this “child refugee” scam are brazening it out, safe in the knowledge there will be no comebacks for them. \\nFirst they attempted to prevent any more embarrassing pictures by throwing blankets over the arrivals so they resembled state witnesses at a Mafia trial. Then a screened walkway from the bus alighting point to the door of the reception centre was erected overnight for the same purpose. Dental tests to determine the real age of these youths were ruled out as an “invasion of privacy.” And there is no question of having them deported, so nothing can be done now. They’re here. Get over it. \\nBut of course, it all works better if there is no clamour from the public. So the powers-that-be have resorted to the tried and tested method of stifling dissent. Anyone who sticks his head above the parapet to raise doubts is subjected to stern lectures about their moral shortcomings. BBC TV presenter Gary Lineker chastised his fellow British for their “shameful” attitudes, while Labour shadow Home Secretary Diane Abbot t attacked those who wanted to carry out dental tests to assess their age as “racist.” Pop singer Lily Allen became a media darling when, on behalf of the people of Britain, she made a tearful apology to the refugees for causing their plight. \\nLet that sink in. Britain caused the plight of the refugees. \\nAfter voting for Brexit, for ordinary British people, who have seen their schools, hospitals and welfare services strained to breaking point, a fresh influx of immigrants was not exactly what they had been looking forward to. After all, Britain has no legal or moral obligation to take these people. They were supposed to be the responsibility of the first country they arrived at in the EU. And why are they coming to racist Europe anyway? It’s incredibly short-sighted of them. Why not go to some Asian or African country? Or Israel? \\nThis fresh burden will be placed squarely on the local authorities that receive the immigrants, and they are going to have to dig deeply. While the government is providing £40,000 ($48,000) per annum for each young refugee, the total annual cost is around £133,000 ($162,000). So tax increases — or reduced services in other areas — are predicted. \\nNaturally little of this will fall on the prosperous London boroughs filled with BBC-watching, morally uplifted Whites. Instead many migrants are being located in far-flung areas such as Devon or poorer northern communities already thronging with refugees, such as Bradford. \\nThe tipping point in the long battle to admit these bogus “child refugees” seems to have been a multi-faith initiative in which more than 200 religious leaders led by the former Archbishop of Canterbury Lord Williams and senior representatives from the Buddhist, Hindu, Muslim and Sikh faiths — signed a letter urging the Prime Minister to admit 3,000. \\nIn a speech at a London synagogue, Lord Williams described the Calais camp as “a stain” on the British conscience. But in fact, this alleged multi-faith support was not what it appeared to be. It was largely organised by dozens of Jewish activists working through an organisation called Citizens UK that organised the casework and poured substantial resources into ensuring that the necessary amendments to the law would make it through Parliament. \\nThe Calais “Jungle” crisis has brought the Jewish community together in a unity of purpose rarely seen outside the occasion of Israel’s various wars. From the highest communal levels to the smallest youth groups, it seems everyone Jewish has been mobilised in the cause of getting uneducated, unassimilable Muslim economic migrants into Britain. \\nIt is a campaign they have chosen to frame in entirely moral terms. The Jewish community’s loud insistence has been that not only is Britain under a strict moral obligation to take these migrants but that there should be no upper limit. To do otherwise would be to undermine our reputation as a humanitarian country that wishes to describe itself as civilised. \\nTheir arguments have been formed around highly emotional anecdotes and images. Time and again we have been treated to stories of children struggling in the squalor at the Calais “Jungle” camp. The iconic photographs of the lifeless body of three-year-old Syrian boy Aylan Kurdi washed up on a Turkish beach are frequently invoked. The iconic picture (right) that reduced millions to tears and allowed the luvvies to cry “Let ’em all in!” You will notice that nowhere is there any consideration of the stress this is causing on existing British communities, especially those in the poorer areas where refugees are invariably housed. Nor is there any recognition of the profound unfairness this imposes on the native White community who will be required to support these strangers via the welfare system, health and housing services. Such a process is not only unaffordable, it makes a mockery of the basic idea that help from the welfare state is in return from previous tax contributions. \\nThere is a largely unspoken reason for this: resentment over Britain’s perceived inadequacy in admitting Jewish refugees before World War II. In fact, Britain admitted many tens of thousands of Jews in the 1930s, but it is an article of faith amongst many Jews that Britain could and should have admitted many more. \\nTypical of this attitude was the speech of Rabbi Herschel Gluck, founder of the Muslim-Jewish Forum. He says he lost over 100 relatives in the Holocaust and implied that Britain’s wartime attitudes to refugees were to blame for this. “I feel obliged to ensure we don’t make the same mistakes,” he said. \\nNumerous references were made to the Kindertransport programme by which Jewish children from Europe were smuggled into Britain. (The TOO has already debunked much of this greatly mythologised episode.) \\nA veteran of that same Kindertransport is the figurehead for the Calais refugee crusade. eighty-four year old Lord Alf Dubs , a veteran Labour politician. He has tirelessly campaigned for mass immigration all his life. A former director of the Refugee Council, he somehow arrived in Britain aged six in 1939 despite Britain’s horrendous attitudes at the time, and was shown much Christian charity. Since then, he has chosen to repay this kindness by devoting his life to opening Britain’s borders to non-Whites from around the globe. \\nAccording to EU law, refugees should have been processed at the first country they arrived at, so some ruse had to dreamed up whereby Britain could allow their entry. This was done through a device known as the EU’s Dublin III regulation, whereby lone refugee children could be taken to any European country where they have a relative. \\nThis was not enough for Lord Dubs. He wanted the “child refugees” in the Calais “Jungle” admitted to Britain without any “family reunion” qualification and pushed his own amendment which would oblige the British government to transfer to the UK any unaccompanied refugee children from Europe. \\nTo this end Lord Dubs was able to count on wholesale establishment support. Not just the Archbishop of Canterbury but charities , NGOs and even economists all rallied round. JEWISH POLITICIAN LORD ALF DUBS “He has ceaselessly campaigned for mass immigration all his life, devoting his life to opening Britain’s borders to non-Whites from around the globe.” \\nThe Occidental Observer has already shown the hugely disproportionate Jewish influence on a similar letter from senior lawyers. The same disproportionately Jewish influence can be seen in the plea from the 126 economists. One of the signatories was Jonathan Portes, who can be fairly regarded as the architect of Tony Blair’s mass immigration disaster . \\nSo it seemed as if the passing of the Dubs amendment to an immigration bill was a foregone conclusion. But then at the vote in the House of Commons there was a problem. For Conservative politicians had not long finished fighting a general election campaign in which their voters had left them in no doubt how they felt about the never-ending waves of mass immigration. In the House of Commons the Dubs amendment was defeated . Jewish campaigners could barely contain their anger. \\nThe nagging, scolding words of Dr. Edie Friedman , director of the Jewish Council for Racial Equality, were characteristic. \\nAs a result, children across Europe will remain cold, alone and at risk over the coming months. This was an opportunity to stand on the right side of history, to bring relief to just 3,000 of the 95,000 unaccompanied children who applied for asylum in Europe last year. \\nWe wake up this morning on the wrong side of history and on the wrong side of compassion.The Immigration Bill has shown the UK at its worst, uncaring about the suffering of children a mere 30 miles away in places like Calais, but it has also shown us (sic!) at our best. \\nRabbi Harry Jacobi too was beside himself with anger at MPs voting in accordance with their electorate’s wishes. For him loomed the shadow of 1938, when Britain decided to stop the flood of Jewish refugees. \\nToo many MPs with hardened hearts, just like the biblical story of Pharaoh. To close their eyes and hearts to unaccompanied children, to insist that it is alright to detain pregnant women, and that refugees can still be detained indefinitely simply on the say so of an immigration official. These are not the actions of a world-leading moral civilisation. REAL CHILD REFUGEES FROM SYRIA FAKE “CHILD REFUGEES” FROM THE THIRD WORLD— the type being let into Britain right now under Jewish pressure. \\nThen, in one of his last acts as Prime Minister, David Cameron did a U-turn and announced he would allow the amendment to go through unopposed. \\nNow Britain could admit the bogus 3,000 “refugee children” unilaterally. — § — \\nCitizens UK’s main task seems to be getting migrants or “refugees” into Britain and dispersed around the country. It describes itself as a “community organiser’s hub,” but is in fact an arm of the state with deep pockets and a nationwide network of affiliated organisations. It has fought many legal battles for refugees and succeeded in getting migrant “child asylum seekers” released from detention centres and housed in the wider community. \\nSo how Jewish is it? At letterhead level it seems to be drawn from a cross-section of the community, but at organiser level, the Citizens UK appears to be disproportionately Jewish. (This tactic of recruiting sympathetic non-Jews and giving them highly visible position in Jewish-dominated causes has a very long history, going back at least to immigration battles in the early twentieth century, as recounted in Chapter 6 of SAID [p. 192ff] and Chapter 7 of Culture of Critique [e.g., pp. 249-250].) They include the Citizens UK spokeswoman , Rabbi Janet Darley, who, of course, has a tear-jerking story to tell. She said it was when a 15-year-old migrant fell under the wheels of a truck he was trying to board that she felt that she had to get involved. \\nFor me, that was the deal breaker — I knew I couldn’t live with myself if I didn’t do everything I could to make sure there were no more dead children. … The Torah warns us against the wronging of a stranger. For us, this is core teaching and not an optional extra. \\nAnother Jewish Citizens UK activist is senior organiser Charlotte Fischer, who is lobbying for Britain to increase the total number of “Syrian” refugees it has agreed to take from 20,000 to 50,000. “We are doing shamefully compared to Canada” she chides. \\nBut the UK is doing awesomely compared to Israel. Doesn’t that count for anything? — § — \\nCitizens UK campaigner Rabbi Danny Rich is co-chair of yet another arm of the refugee industry, the National Refugee Welcome Board. He clearly has the magic touch when it comes to getting access on the BBC. Since the beginning of September he has graced at least half a dozen BBC outlets including the main BBC TV news and the BBC World Service and gets softball kidglove treatment from all of them. He blithely brushed aside the concerns of ordinary British people: “Look at the Kindertransport and the contribution made to Britain over the last 70 years by those who escaped the Nazis. Look at the contributions made today by doctors, nurses and care workers, many of who were not English born.” Anyone doubting the distinctly Jewish flavour of Citizens UK would be advised to look at this promotional video . \\nOf course, no British refugee campaign would be complete without the presence of Rabbi Laura Janner-Klausner who can be guaranteed to be at the forefront at any number of “multi faith” immigrant events including a Citizens UK vigil outside the House of Commons. \\nCitizens UK is an umbrella organisation overseeing local grass roots initiatives for refugees all over the country, many of which are Jewish-organised. One of the main ones is called Safe Passage UK . In an article for the Jewish Chronicle, the two Jewish organisers described their work as “fighting injustice.” Apparently a group of synagogues had raised £200,000 for them in just a few weeks. \\nRabbi Rebecca Birk was recently named by the Evening Standard as one of London’s most influential people for her fund raising for Safe Passage UK. Again, her entire rationale is bound up with her Jewish identity, framed, of course, as a moral imperative stemming from the inherently moral essence of Judaism. She says : \\nThe Jewish identity is predicated on being a foreigner, relying on the kindness of strangers, it runs through our own theology really: doing good, mending the world. We talk of three pillars the world stands on — the Torah, divine service, and kind acts. It’s an anathema to be a Jew and only be concerned with oneself. \\nLD : The idea that all Jews are full of sweetness and light, overflowing with the milk of human kindness toward their fellow human beings, can be dismissed at once as bordering on the absurd. Here are two prominent Jews who would like to see the White race genocided and White women and children cruelly raped and killed: 1. HARVARD PROFESSOR DR NOEL IGNATIEF 2. RABBI ISHMAEL LEVITTS — § — \\nA clear sense of Jewish identity also informed the efforts of the three fashionable north London women who decided to put their media careers on hold to set up the Help Refugees charity in the Calais “Jungle.” The women, two of whom are Jewish, have tapped into a lucrative market indeed, and their outfit was one of the biggest players in Calais. It has been a massive, trendy, profile-raising success. After setting up, they were inundated with corporate contributions, and now they run 26 projects from Israel and on the migrant trail all the way across Europe. Articles about them focus on “child refugees.” And because Hollywood is well-known for its high moralism, it is not surprising that actors such as Benedict Cumberbatch and Lena Dunham have lent their support. \\nHelp Refugees even has a mobile kitchen on to the shores of Greece where their volunteers are helping refugees from Turkey from their dinghies and then seeing them off on their long journey across Europe. One of these women, Dani Lawrence, insists her parents fled anti-Semitism in Morocco in the sixties. \\nThe Jewish community has an extremely high opinion of its charitable efforts. Their strong Jewish identities and loyalty to their tribe are obvious, and it is wonderful that all that philanthropy makes them feel so good about themselves. But it might be worthwhile for the White British to ask what exactly is in it for them, apart from Kosher certification? \\nIt is time to ask some searching questions about the real motives that lie behind all this Jewish selflessness. After all, a charitable disposition towards Muslims is not exactly a characteristic of Jewish life anywhere else and certainly not in the Palestinian territories. And no question is guaranteed to infuriate Jewish activists more than asking why Israel doesn’t admit any refugees from Syria which is, after all, next door? \\nSo what do they get out of this sudden influx of unassimilable immigrants who have neither the temperament nor inclination to fit into modern Britain? Sadly, as readers of TOO are all to familiar with (see, e.g., “ Is immigration a Jewish value? “), the motivation is not compassion but veiled ethnic vindictiveness aimed at undermining and dispossessing ordinary British people. The motivation is not compassion but veiled ethnic vindictiveness \\nOne of the questions that British people might also ask themselves is this: If those British people in the 1930s who had admitted waves of Jewish refugees could see the fruits of what they had done, what would they think? \\nIf those British people, who were to suffer so much in a war they were told was about “freedom”, if they were to see the streets of Peckham, Newham or any number of London boroughs or cities today overrun by Third-Worlders, what would they think? \\nAnd if they were then to be told, in detail, about the role of Jewish activism, power and “philanthropy” in bringing about this transformation, what would their thoughts be then?Perhaps they would agree with so many of us. That the Jewish invocation to “heal the world” seems to be code-words for eradicating White identity and eradicating the power of Whites to control their own destiny. \\nAnd perhaps, instead of admitting these “child refugees,” Britain would have been better off remembering the words of another Jewish sage, economist Milton Friedman, who said “You can have a welfare state or you can have open borders, but you cannot have both.”'"}, "time": 1742561836.4522986}