{"duration": 0.04924893379211426, "input_args": {"text": "'  Carol Adl in News // 0 Comments \\nHundreds of police in riot gear with heavy military equipment have evicted Dakota Access Pipeline protesters from their encampment on private land in the US state of North Dakota. Police have protesters more or less surrounded. #noDAPL pic.twitter.com/G4xGQuXpZM \\n— Jason Patinkin (@JasonPatinkin) October 27, 2016 \\nThe police reportedly arrested at least 141 Native Americans and other demonstrators who are seeking to halt construction of a controversial oil pipeline. \\nPress TV reports \\nAt least 141 protesters were arrested on Thursday evening and Friday morning as officers attempt to clear a camp on private property in the path of the proposed $3.8 billion Dakota Access Pipeline, the Morton County Sheriff’s Department said in a statement. \\nOfficers in riot helmets used pepper spray and shot beanbag rounds on some of the estimated 330 protesters as helicopters flew overhead. \\nDemonstrators also allegedly set a car and some tires on fire, giving the scene a war zone-like appearance. \\nThe protesters have been demonstrating for several months, and dozens have been arrested. Police expect additional protests, and possibly more arrests, in the coming days. \\nNative American protesters had occupied the property that crosses the pipeline’s path since Monday in an effort to stop Energy Transfer Partners’ construction of the Dakota Access Pipeline. \\nThe pipeline has infuriated the Standing Rock Sioux Tribe and environmental activists who say it threatens the region’s water supply and sacred tribal sites. The tribe’s reservation is close to the pipeline’s route. \\nNorth Dakota Governor Jack Dalrymple said police were successful in clearing the camp. “Private property is not the place to carry out a peaceful protest,” he said. \\nDemonstrators, however, say they aren’t trespassing on private property, citing an 1851 treaty with the US government that says the land belongs to Native American tribes. \\nThe Native American-led protest has grown into a larger movement in the United States, drawing in other tribes, environmentalists and advocates for Native Americans. \\nThe federal government has twice asked the pipeline operator to voluntarily pause construction near the tribe’s reservation while the authorities reconsider the project’s route. But courts have refused to compel a halt. \\nThe chairman of the Standing Rock Sioux Tribe criticized law enforcement’s “militarized” response to the activists. “Militarized law enforcement agencies moved in on water protectors with tanks and riot gear today. We continue to pray for peace,” Dave Archambault II said in a statement Thursday evening.'"}, "time": 1742628372.5227628}