{"duration": 0.09789347648620605, "input_args": {"text": "'The diplomatic travails of President Trump and his past Twitter fixation with Kristen Stewart provided plenty of fodder for “Saturday Night Live” this weekend. But a sketch lampooning Sean M. Spicer, the White House press secretary, in which he was impersonated by Melissa McCarthy, the comic actress and a surprise guest star, stole the show as “S. N. L. ” continued to take swings at a president who delights in hitting back. In the show’s cold open, Alec Baldwin returned for another outing as Mr. Trump, phoning up other world leaders under the guidance of chief strategist Stephen K. Bannon (actually an “S. N. L. ” cast member dressed as the Grim Reaper). As Mr. Trump, Mr. Baldwin first called Prime Minister Malcolm Turnbull of Australia (Beck Bennett) who reminded him that President Barack Obama promised to receive 1, 200 refugees held in detention in Australia. “No refugees,” Mr. Baldwin said hastily. “America first, Australia sucks. Your reef is failing. Prepare to go to war. ” He went on to call President Enrique Peña Nieto of Mexico (“Guy who’s going to pay for the wall says what? ”) Chancellor Angela Merkel of Germany (“I’m going to write a memoir about this struggle, and call it ‘My Struggle’  —   what would that be in German? ”) and President Robert Mugabe of Zimbabwe. Mr. Mugabe (Kenan Thompson) was not impressed or intimidated: “I will rip out your spine and drink from your skull,” he told Mr. Baldwin. In her opening monologue, Ms. Stewart, the show’s host, recalled a period in 2012 when Mr. Trump posted several tweets about the relationship she had with her “Twilight”   Robert Pattinson. (In one tweet Mr. Trump wrote that Ms. Stewart “cheated on him like a dog  will do it again,” and in another he invited Mr. Pattinson to attend the Miss Universe pageant.) “To be fair,” Ms. Stewart said, “I don’t think Donald Trump hated me. I think he’s in love with my boyfriend. ” She added, “The president is not a huge fan of me. But that is so O. K. And Donald, if you didn’t like me then, you’re really probably not going to like me now. Because I’m hosting S. N. L. and I’m, like, so gay, dude. ” Still, the night belonged to Ms. McCarthy, the star of “Bridesmaids” and “Ghostbusters,” who came out in thinning blond hair and an   suit to play an aggressive,   version of Mr. Spicer as he led a daily White House press briefing. “I know that myself and the press have gotten off to a rocky start,” she said, starting off the session. “When I say rocky start, I mean it in the sense of ‘Rocky,’ the movie, because I came out here to punch you in the face. And also I don’t talk so good. ” As Mr. Spicer, Ms. McCarthy then told the press corps she would be “apologizing, on behalf of you, to me, for how you have treated me these last two weeks. ” “And that apology is not accepted,” she added. Discussing Mr. Trump’s recent announcement that he would nominate Judge Neil M. Gorsuch to the Supreme Court, Ms. McCarthy said, “The crowd greeted him with a standing ovation, which lasted a full 15 minutes. And you can check the tape on that. Everyone was smiling. Everyone was happy. The men all had erections, and every single one of the women was ovulating left and right. And no one, no one was sad. Those are the facts forever. ” An addled Ms. McCarthy then read her own email password, and tangled with a New York Times reporter (played by Bobby Moynihan) who asked why Mr. Trump did or did not use the word “ban” when describing his executive order prohibiting travelers from seven predominantly Muslim countries from entering the United States. “You just said that,” she told the reporter. “He’s quoting you. It’s your words. He’s using your words, when you use the words and he uses them back, it’s circular using of the word and that’s from you. ” When a Wall Street Journal reporter simply asked, “Are you O. K.?” Ms. McCarthy charged at her with her podium and threatened, “I will put you in the corner with CNN. ” (The screen then showed a CNN reporter in a cage.) Mr. Trump has posted complaints and criticisms of “Saturday Night Live” on his Twitter account over the past several months, though he has not weighed in on the show in the weeks since his inauguration. (Nor, as of this writing, has Mr. Spicer.) Mr. Baldwin, whose impression of Mr. Trump has often been a target of the president’s ire, is scheduled to host “S. N. L. ” next Saturday, Feb. 11.'"}, "time": 1742563534.2089064}