{"duration": 0.14258146286010742, "input_args": {"text": "'Here’s something Oscar voters and regular folks probably don’t think they’ll want or need this year: a movie all but guaranteed to make them cry. Yet it’s coming, anyway: “Patriots Day,” a film about the 2013 Boston Marathon bombing, directed by Peter Berg and starring Mark Wahlberg, a Beantown son, as a police officer. The film nabbed the   slot at the American Film Institute festival in November, landed on the National Board of Review’s Top 10 list, and opens on Dec. 21, prime time for awards. For a picture that some feel is arriving too soon, or that risks being exploitative or worse, “Patriots Day” stands, on the one hand, to be unintentionally well timed. At a recent screening in Manhattan, as audience members gasped their way through tears, it became clear that the film got at something more elemental than tragedy: It captured the purity of the altruistic outpouring that came in the bombings’ wake. Sniffling away, the Bagger couldn’t help wondering, might this be a film that makes both blue hearts and red hearts crack open, and proves a unifier of sorts? Then again, we are living in times when the very definition of “patriot” is deeply contested and fraught, when the word alone often causes liberal neck hair to stand on end. “Patriots Day” is Mr. Berg and Mr. Wahlberg’s third film together, after this year’s “Deepwater Horizon,” about the deadly 2010 oil explosion and spill, and the 2013 “Lone Survivor,” about a disastrous war mission. All three neatly fit the definition of what Rolling Stone describes as the “  blockbuster”: movies whose heroes wear blue collars rather than cowboy hats or capes. “These are films that seek to whitewash America,” Corey Atad wrote in Esquire, “boosting the virtue of pure patriotism, fashioning an uncomplicated reality for an audience tired of feeling like their country is being lost to liberal pussyfooting and terrorist threats. ” Also in that category is Clint Eastwood’s     hit “American Sniper,” which became such a partisan flash point two years ago  —   lefties deemed it   propaganda righties saw it as a patriotic masterpiece  —   that some liberals who consider themselves open and tolerant refused to see it outright. Unsurprisingly, Mr. Berg and Mr. Wahlberg say that “Patriots Day” holds resonance, no matter what the viewers’ political bent, be they, in the director’s words, “the most liberal      in the world” or “neoconservatives that I know, good friends that are on the far other side. ” “We get asked this a lot, about our politics, and we’re just not going to get into it,” Mr. Berg said, sitting with Mr. Wahlberg this week to chat with the Bagger in a suite at the Carlyle Hotel. “Mark and I both wanted to make a film about love. A film about: ‘You know what? If you think you’re going to beat us through violence, you’re wrong. Because love will rise, love will defeat evil. ’” “I have friends on both sides who believe that love does win,” Mr. Berg continued. “And they’re very kind, loving people. So we feel there’s a little something for everyone in this. ” Mr. Berg and Mr. Wahlberg arrived separately, each wearing the resigned, blank look that movie people tend to get after doing three straight days of press. They had been through this gantlet just three months ago, with “Deepwater Horizon. ” Meanwhile, for some Bostonians, the marathon atrocity is still too fresh. It was only last year that the surviving Boston bomber, Dzhokhar Tsarnaev, was tried and convicted. And this year, the University of Massachusetts, Dartmouth, denied the filmmakers’ request to film on campus, as did the suburb of Watertown, where the police and the Tsarnaev brothers engaged in a firefight. (That filming was moved to nearby Malden and a former naval air base.) Given all that, didn’t it seem that “Patriots” was made and released in haste? Nay, Mr. Berg said. “Mark’s fond of saying it probably wasn’t soon enough, in many ways,” the director said. “We felt the real theme of this film wasn’t going to be about a manhunt of justice being served up, although those were elements of this story. At the end of the day, the story was about how a community responded to kind of what unfortunately is becoming the new reality of our lives. ” But there was competition. Mr. Wahlberg brought the idea of the film to Mr. Berg near the end of the production of “Deepwater Horizon” last year. Films about the marathon bombings were in the works: one from CBS Films another based on the book “Boston Strong” and a third, “Stronger,” starring Jake Gyllenhaal, which is to open next year. Mr. Wahlberg ultimately teamed up with CBS Films, and they bought the rights to “Boston Strong,” folding some of its elements into “Patriots Day. ” “I was really on the fence  —   do we make this?” Mr. Wahlberg recalled. “Then I quickly realized that there’s three movies, and they’re aggressively trying to get these movies made. ” He added later that he decided: “They’re going to do it anyway. I better do it so I can make sure we do it the right way. ” The youngest of nine, Mr. Wahlberg grew up in the Dorchester neighborhood of Boston, where he had a violent,   and   youth. He has maintained deep connections there, and the city and nearby region have been the site of a number of his films: “The Departed,” “The Fighter” and, of course, “Ted” and “Ted 2. ” To prepare for “Patriots Day,” Mr. Wahlberg, who knew people directly affected by the bombings, he and Mr. Berg sat down to hear residents’ concerns  —   about how loved ones would be portrayed, about the effect on grieving children, about being retraumatized. As the father of the youngest victim,    Martin Richard, requested, no one from that family was portrayed in the film, though there are scenes showing the blanketed body of a child. After poring over hours of grisly footage, Mr. Berg, who cites the work of Studs Terkel, fabled chronicler of the American Everyman, as a major influence, said he struggled mightily to make sense of the atrocity, and to understand how affected families found the energy to go on. He found his answer at this year’s marathon, where he and Mr. Wahlberg watched Patrick Downes become the first Boston bombing amputee to complete the race. He fell into the arms of his wife, who lost both legs in the bombings  —   footage of their embrace is in the film. At that moment, Mr. Wahlberg said, an    woman from the Boston Athletic Association approached them both and said: “You see that? That’s what this movie better be about. About love. You make sure you get that right. ” That has become Mr. Berg and Mr. Wahlberg’s main talking point, how the city came together afterward, how, moments after the bombing, paramedics, the police, firefighters, high school girls who had been handing out Gatorade all rushed toward victims to help. “You think about, did anyone stop and ask someone before they helped them what political party they were associated with?” Mr. Berg said. “What their sexual orientation was, you know, where they stood on gun control? Nobody cared. That was really an example of the angels within us, the very best versions of ourselves. ” Ergo the sobbing Mr. Berg was surprised to hear in early screenings of the film. “Crying can be a good thing,” he said, “a catharsis and a release. ” The Bagger can attest to that. And liberals, if you’re still hesitant, keep in mind that the film is set in deep blue Boston, where four out of five presidential votes went to the Democrats. They’re your people, too.'"}, "time": 1742563337.4418688}