{"duration": 0.1255495548248291, "input_args": {"text": "'MACAPÁ, Brazil  —   The pirates of the Amazon River relish striking after nightfall. Wearing balaclavas, 15 of the marauders stormed Merinaldo Paiva’s riverboat as dozens of his passengers dozed in their hammocks. Suddenly, they woke to find rifles pointed at their heads. The gunmen took cash, jewelry, smartphones, fuel and even food, forcing everyone to lie facedown on the deck. Then they disappeared on speedboats into the Amazon, a waterway so vast that some in Brazil’s frontier call it the  . “Every riverboat captain knows they’re at the mercy of these bastards,” said the captain, Mr. Paiva, 41, who has been plying the rivers of Brazil’s rain forests since he was a teenager. “We’re lucky it wasn’t worse,” he added of the robbery in April, listing other attacks in which passengers had been raped, tortured or killed. Piracy has long been a fact of life on the rivers of Brazil’s anarchic wilderness. But as the population in the Amazon surges and drug gangs expand their sway over the region, hijacking opportunities have flourished. And police forces are struggling to keep up with the crime, culminating in a series of recent attacks that have terrorized riverboat crews and their passengers. In October, four masked pirates with rifles took over a fuel ship on the Solimões River and stole more than 2, 600 gallons of diesel fuel, along with the cash, watches and clothing of the crew. In September, 10 masked men stormed a passenger ship near the city of Belém, robbing 260 passengers at once. The attackers used one woman aboard as a human shield during the ordeal. The month before, the police released a video of men from one crew  —   the   Pirates of the Solimões River  —   interrogating a rival gangster next to a dead body, putting riverbank dwellers on edge throughout the Amazon Basin. In a previous case near the city of Manaus, Huederson Paulino, a pirate who used the nom de guerre Mohican, confessed to killing and dismembering two men on a boat selling ice and salt. He led a gang that stole cash and fuel from the victims, and said his aim was to get spending money for Christmas. “I needed the money, so I did what was best for me,” Mr. Paulino, 24, told reporters. The growing alarm over piracy dovetails with rapid changes in the region. Far from an empty expanse of rain forest dotted by tiny outposts, the Brazilian Amazon has nearly 25 million people, with about two million in Manaus alone. The region’s population surged 22 percent from 2000 to 2010, according to census figures  —   nearly double the rate of the country as a whole. But the Amazon is also one of the poorest parts of Brazil, and organized crime has spread, feeding a sense of lawlessness in the vast river basin. In remote riverbank villages, residents complain that police boats rarely venture into the waterways where many of the pirate attacks take place. The authorities say they are trying. Here in Macapá, a city of 370, 000 in northern Brazil, an elite squad of   police officers from the Environmental Battalion regularly patrol the Amazon River for pirates, often called water rats in local parlance. “Just as highwaymen prey on road travelers elsewhere in Brazil, pirates are the scourge we face here in the Amazon,” said Lt. Col. Protásio Barriga Caldas, 47, the commander of Amapá State’s   Environmental Battalion. Robbers have stalked these waterways for years. In one notorious case, pirates fatally shot Sir Peter Blake, the world champion yachtsman from New Zealand, in 2001. The gunmen boarded his vessel, the Seamaster, and robbed and attacked the crew. Mr. Blake managed to shoot one of the assailants in the hand, but died after being shot in the lung and heart. These days, with more targets on the rivers and more criminal groups involved, riverboat operators warn that the pirates are growing even more ruthless and sophisticated. In one case this year, the police in Amazonas State captured José Conceição de Souza, a pirate who confessed to killing two Colombian drug traffickers and stealing 573 pounds of cocaine the traffickers were taking by boat to Manaus. Galdino Alencar, the president of the Union of River Navigation Companies of Amazonas State, said that pirates were increasingly targeting ships carrying large cargoes for the growing population of the Amazon, including cooking gas, electronic devices, cement and dried beef. But the most coveted cargo for pirates, he said, is fuel. “It’s a product they can steal and go on to sell to gold miners operating illegally in the forest,” Mr. Alencar said. He added that pirates were also stepping up attacks on ships docked in large cities like Manaus, spurring calls by his organization to create a federal river police force. Colonel Caldas said the pirates usually traveled on speedboats, giving them a quickness and agility that bulkier riverboats lack. He added that they often came from impoverished urban areas or   riverbank villages, and preyed on forest dwellers who rely on riverboats to purchase food, visit relatives or obtain medical care in Amazon cities. Patrolling the Amazon’s colossal rivers for pirates can resemble a futile game of   . On one river mission in October, police officers questioned residents of a settlement near the Port of Santana who described living in constant fear of pirates. “There’s no law on the Amazon River,” said Odete Souza França, 49, whose family makes its living by fishing and cultivating açaí, the coveted purple fruit that is a staple here. She described a recent attack in which pirates boarded the canoe of her    son, tied him up, and stole his GPS device and a cylinder of cooking gas. Catching such culprits involves immense challenges. To start with, the rivers of the Amazon Basin course through a region almost the size of the contiguous United States. Ships on the main waterways can go days without seeing the police or navy boats. Pirates often know the rivers and surrounding terrain better than security forces, and can drop out of sight into   villages. Police officers here in Amapá State also complain that pirates often carry out their attacks in one state, only to dart over the border into a neighboring one with a different jurisdiction. “Catching pirates is like waging war against guerrilla fighters,” said Capt. Lúcio Lima, the chief of a special operations unit of the Amapá police force that hunts down river bandits. “They are elusive foes who make the most of their knowledge of river currents, geography and topography. ” When two Polish explorers  —   Dawid Andres, 41, and Hubert Kisinski, 33  —   traveled the length of the Amazon River this year on pontoons outfitted with mountain bikes, they faced challenges from   waters to whirlpools. Still, they said their scariest moments came when pirates in Brazil approached them on three occasions. Each time, they said, they were able to talk their way out of daunting situations. “It’s the stuff of a nightmare when a crew in   holding huge guns approaches you on the river,” Mr. Kisinski said. Recalling one episode, he said that he and Mr. Andres had calmly explained that they were traveling without valuable items, and then asked the pirates if they had any beer to relieve the stress of the situation. “That calmed them down a bit they even started to laugh,” Mr. Kisinski said. “One needs to keep a clear head when facing pirates in the Amazon. ”'"}, "time": 1742562222.955455}