{"duration": 0.0894918441772461, "input_args": {"text": "\"November 21, 2016 -  By Eduard Popov for Fort Russ - translated by J. Arnoldski - \\n\\n\\nOn November 21st, Ukrainian President Poroshenko admitted that Ukrainians' quality of life has not improved over the three years since the events on the Maidan and is still far from European standards. However, he did find an excuse for his failed economic policies, explaining the failures of Ukraine’s economy by “objective factors” and the need to spend more than 5% of GDP on “the defense and security sector and the creation of a new army.”  \\nIn addition, Poroshenko tried to shift the blame onto his predecessors, saying that economic reforms necessary to ensure the necessary growth of the economy had not been pursued in the country for a long time. \\nThe Euromaidan, as we remember, stood under one main slogan: joining the EU, which the “criminal regime” of President Yanukovych hindered. After nearly 3 years since the victory of the Maidan and the overthrow of the “criminal” government, no one is waiting for Ukraine in the EU and Ukrainians’ living standards have declined dramatically. \\nPoroshenko, however, still found positive changes in the life of Ukraine. A bit earlier, on November 20th, he stated that for the first time in several years, namely after 14 quarters of decline, the country noted a growth in the economy. He called the International Monetary Fund’s aid to the Ukrainian state the defining moment behind this. Moreover, Poroshenko promised to significantly raise wages in the near future, particularly for doctors, teachers, and other public sector workers. Poroshenko compared the Ukrainian economy with a patient finally leaving the hospital and going on the mend.  \\nUkraine’s economy is, in my opinion, most likely not recovering, but is a stably critically ill patient. If any improvements happen, then they affect only certain industries that have very little growth. If we take longer periods and the entire economy as a whole, then the Ukrainian economy does not demonstrate any positive outlook. This was recognized by the ex-governor of the Odessa region, Mikhail Saakashvili, according to whom Ukraine needs at least 15 years to regain the level of development it had under President Yanukovych. Poroshenko’s promises that the money provided by the IMF will bring social benefits sound like pure populism, or more like demagoguery.  \\nThe IMF loan is too relatively small to have any significant impact on the macroeconomic situation in this country of 40 million (according to inflated official figures) with a depressed economy and enormous social burden (over 12 million Ukrainians are pensioners).  \\nUkrainian experts themselves have noted that the lion’s share of the loan will go, first of all, to service debt, and, secondly, to infrastructural reform. Ukraine will see no real spending money from the IMF, as such is largely means provided to service debt problems. Poroshenko, like an experienced businessman setting up a new business, is openly lying when he says otherwise. \\nA number of Ukrainian experts suggest that the IMF money is needed by Kiev for political concerns. When getting money, the government never forgets to remind everyone that as long as the loans are coming in, this means that the West has not ditched them.  \\nAs calculated by the executive director of Blazer International Fund, Oleg Ustenko, Kiev is already forced to allocate 5% of its entire GDP to covering debt. In order for the economy to show growth, it would have to grow at a rate above 5%, otherwise GDP will decline.  \\n\\nPoroshenko also compared the reforms supposedly underway in Ukraine to those carried out in Central and Eastern European countries. This analogy makes sense. The results of these reforms, which liberal experts consider successful, essentially transitioned the economies and financial systems of the socialist camp countries to the control of Western companies and transnational corporations. Therein, the countries of the former socialist camp lost their economic sovereignty.  \\nWhen Poroshenko compares supposedly successful reforms in Ukraine with the “successful” reforms in these European countries, he is right in only one  aspect: Ukrainians too will lose  their right to their own property and resources.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n\""}, "time": 1742562271.9134395}