{"duration": 0.04938912391662598, "input_args": {"text": "'Scott Adams Explains How You Know the New Emails Are DISQUALIFYING For Clinton Posted on Home » Headlines » World News » Scott Adams Explains How You Know the New Emails Are DISQUALIFYING For Clinton \\nHow do I know the new emails are THAT BAD? \\n\\nWhile everyone on the left from Harry Reid to Pelosi to former AG Eric Holder are foaming at the mouth over the audacity of James Comey to “side with Putin” and reopen Hillary’s email investigation days before the national election, Dilbert creator Scott Adams explains how he knows the new emails found on Anthony Weiner’s laptop are DISQUALIFYING for Hillary Clinton: \\nSome say Comey is a political pawn in a rigged system. By that movie script we can explain why he dropped the initial email case. But we can’t explain why he’s acting against Clinton’s interests now. What changed? \\n\\nWell, some say Comey had to reopen the case against Clinton after discovering the Weiner laptop emails. If he failed to act, there might be a revolt at the FBI and maybe a whistleblower would come forward . But that leaves unexplained why Comey detailed to Congress how Clinton appeared to be guilty of crimes at the same time he said the FBI was dropping the case. If Comey had been protecting Clinton on the first round, he would have softened his description of her misdeeds, wouldn’t he? But he didn’t seem to hold back anything. \\n\\nAnd none of those hypotheses explain why the people who know Comey have high regard for his integrity. Comey also has the security of a 10-year appointment as Director, so he has a low chance of getting fired or politically influenced. That’s exactly why the job has a 10-year term. Given what we know of Comey before any of the Clinton emails, any movie that casts Comey as an ass-covering weasel is probably making a casting mistake. \\n\\nSo allow me to offer an interpretation of events that casts Comey as more of a patriot and hero than an ass-covering weasel. Compare my interpretation with whatever movie you have in your head and see which one works best for explaining and predicting. \\n\\nMy movie says Comey had good evidence against Clinton during the initial investigation but made a judgement call to leave the decision to the American public . For reasons of conscience, and acting as a patriot, Comey explained in clear language to the public exactly what evidence the FBI found against Clinton. The evidence looked daming because it was. Under this interpretation, Comey took a bullet to his reputation for the sake of the Republic. He didn’t want the FBI to steal this important decision away from the people, but at the same time he couldn’t let the people decide blind. So he divulged the evidence and stepped away, like the action hero who doesn’t look back at the explosion. \\n\\nIn the second act of this movie, Comey learns that the Weiner laptop had emails that were so damning it would be a crime against the public to allow them to vote without first seeing a big red flag. And a flag was the best he could do because it was too early in the investigation to leak out bits and pieces of the evidence. That would violate Clinton’s rights. \\n\\nBut Comey couldn’t easily raise a red flag to warn the public because it was against FBI policy to announce a criminal investigation about a candidate so close to election day. So Comey had a choice of either taking another bullet for the Republic or screwing the very country that he has spent his career protecting. \\n\\nIn this movie, Comey did the hero thing. He alerted the public to the fact that the FBI found DISQUALIFYING information on the Weiner laptop. And he took a second bullet to his reputation. \\nHow do I know the new emails are that bad? \\nI start by assuming Comey is the same man now as the one who was carefully vetted before being hired to protect the integrity of one of our most important institutions. And even Comey’s critics concede he’s smart. \\nSo… \\n\\nThe way you know the new emails are disqualifying for Clinton is because otherwise our hero would have privately informed Congress and honored the tradition of not influencing elections. Comey is smart enough to know his options. And unless he suddenly turned rotten at his current age, he’s got the character to jump in front of a second bullet for the Republic. \\nAccording to this movie, no matter who gets elected, we’ll eventually learn of something disqualifying in the Weiner emails. \\nAnd we can’t say we weren’t warned. Comey took two bullets to do it. \\n\\nSo compare this movie to your own movie and see which one does the best job of explaining the observed facts. And when we find out what is in the Weiner laptop emails, compare that news to my prediction that the information is disqualifying. \\nThe Persuasion Filter says there is no prefered reality. We all see our own movies. In my movie, Comey’s has a consistent personality from start to finish. He starts out his career as a smart, competent patriot and he later proves it by taking two bullets for the Republic. If your movie script has Comey suddenly changing his basic character for this election season, don’t expect an Oscar. \\nRead more here… It’s going to be fun watching this ship burn to the ground…'"}, "time": 1742628505.8235867}