{"duration": 0.17671799659729004, "input_args": {"text": "'DALORI, Nigeria  —   Zara and her little brother thought they were finally safe. After being held captive by Boko Haram for months, they made it to this government camp for thousands of civilians who have fled the militants’ cruelty. But instead of a welcome, residents gathered around, badgering them with questions and glares. They beat her    brother, convinced that anyone who has spent time among the militants, even a young kidnapping victim, could have become a sympathizer, possibly even a suicide bomber. Zara, in fact, was hiding a dangerous secret strapped to her back: her baby. The child’s father was a Boko Haram fighter who had raped her, but Zara knew the crowd would still doubt her loyalties. So she quickly spun a tale that the militants had killed her husband, leaving her a young, widowed mother. “If they knew my baby was from an insurgent, they wouldn’t allow us to stay,” said Zara, whose full name was not used, to protect her safety. “They’ll never forget who her father is, just like a leopard never forgets its spots. ” In northeastern Nigeria, the years of suffering under Boko Haram have upended the lives of hundreds of thousands of people, stealing something  —   or everything  —   from countless families. Now, a deep suspicion is raging against anyone who has lived alongside the group  —   even girls who were held hostage, repeatedly raped and left to raise infants fathered by their tormentors. Much of the anger stems from fear. Boko Haram has used dozens of women and girls  —   many not even in their teens  —   as suicide bombers in recent months, killing hundreds of people in attacks on places like markets and schools. Girls have even been sent to blow themselves up in a camp like this one. Nigeria’s military has made major progress against the militants. Soldiers have been taking back areas that were under Boko Haram control, and the military’s victories have lifted the spirits of Nigerians who are daring to talk about a   Haram life. Hopes were raised further this week when one of the more than 200 girls kidnapped from their boarding school in the town of Chibok two years ago was found alive, wandering the forest. But the discovery also reinforced the lingering trauma facing former hostages: She was carrying an infant, accompanied by a man who claimed to be her husband and an escaped captive himself. The military said the man was actually a suspected Boko Haram fighter. As thousands of freed captives pour into the camps, a rift has developed between two classes of victims: the people who managed to evade the group’s clutches, and those who did not. “I will never trust them,” said Adamu Isa, a market vendor, referring to anyone who had been held by Boko Haram. “The government should detain them for the rest of their lives. ” Even the missing schoolgirls, whose abduction helped rally the country against Boko Haram and focus international attention on the plight of Nigeria’s victims, are not immune to the suspicion. At a recent meeting with camp dwellers, aid workers said that one man even insisted that the parents of the missing schoolgirls  reject their own daughters if they turn up. “We’ve discovered some extreme views,” said Mohammed Ngubdo Hassan, executive director of the Herwa Community Development Initiative in Maiduguri. Millions of people across West Africa have been uprooted by Boko Haram and the sometimes ruthless military campaign against the group through the years. But most of the displaced managed to flee their homes before militants swarmed and subjected them to Boko Haram’s harsh interpretation of Islamic rule. Typically, when Boko Haram fighters overtake a village, they kill many of the young men and boys who refuse to join their ranks. Women are often forced to cook for the fighters or are even trained to become suicide bombers. Some women and girls, like Zara, are forced into what the group calls “marriages. ” As in many conflicts in which rape becomes a weapon of war, the hostages sometimes bear the children of the fighters. These victims now face intense stigma, and in some cases brutal beatings, when they return to their communities, according to humanitarian groups. A recent Unicef report documented the distrust, quoting a community leader who called the babies fathered by fighters “hyenas among dogs. ” “Some people will not accept a child of their enemy,” said Abba Aji Kalli, a state coordinator for the Civilian Joint Task Force, a volunteer group that fights Boko Haram. At one of the camps, Hazida Ali seethed at the mention of anyone who had become a Boko Haram “wife,” as the women forced into marriages are often called. “All those women who lived with Boko Haram are also Boko Haram soldiers,” Ms. Ali said. “The military should not make the mistake of releasing them. If they can’t execute them, they should figure out what to do with them. ” “They should not be allowed to live alongside those who suffered,” Ms. Ali added. The targets of such loathing include Rukkaiya, 13, whose round belly bulged through her dress in a camp here. She had been kidnapped while visiting her sister in a neighboring village. A fighter took her for his wife. “I was so scared, but there was nothing I could do,” Rukkaiya said. “I kept praying to God to rescue me. ” She said she had no idea why she had stopped menstruating until after the military freed the village and she was able to ask a friend what might be wrong. Rukkaiya was devastated when she learned that she was pregnant with a fighter’s baby. Her first thought was abortion. But after some reflection, she decided to keep the child. “God gave me this baby right now,” she said. “We’re facing this war. What good would it do to take another life?” Hafsat Ibrahim was happily married with a    daughter when Boko Haram invaded her village. Militants killed her husband, taking her and her daughter, Amira, into the forest. Ms. Ibrahim was forced to marry a fighter. He was strong, she said, and raped her often. Yet he was good to Amira, she said, playing with her toes until she giggled. “I didn’t like him,” she said. “He told me to have his baby, then I’ll forget about my other husband. ” After Ms. Ibrahim gave birth to the child, it became clear that the military was on its way. The fighter begged her to flee with him, but she wanted a chance at freedom and insisted on staying with the infant girl. Before Ms. Ibrahim could protest, he grabbed Amira and ran away. The lineage of Ms. Ibrahim’s baby, a      girl with pierced ears, is an open secret in the camp. Some people whisper about Ms. Ibrahim and are uncomfortable when she is nearby. “Sometimes they look at me in that way, but it’s not the baby’s fault,” she said, describing the girl as a blessing from God. “If I didn’t have her, I’d have no children at all. ” When Boko Haram took over Zara’s village, she was 17. A fighter demanded that her parents turn her over to be married. Zara’s mother objected, but her father relented, fearing that they would all be killed. The fighter took Zara to a home he had claimed in the village, a small shed where she became pregnant. “His dream was for me to have a baby boy,” she said. “I didn’t want to have an insurgent’s baby. ” Before she gave birth, he died in a battle with the Nigerian military, she said. Another fighter decided to marry her, moving her to a home with two other girls he had taken. He rotated among them, raping one each night. Zara’s new husband did not want children, she said he wanted martyrdom for himself and his wives. “He wanted us to become suicide bombers,” Zara said. “He told us it wouldn’t be painful  —   just like if an ant bites you. It wouldn’t be a big deal, because we’d have a better life in heaven. ” Zara resisted. To buy herself time, she told him to wait until the baby was a couple of months older. Before long, the military arrived, freeing the hostages. Zara said she loved her daughter. Even so, the girl resembles her father. It’s an image Zara can’t shake.'"}, "time": 1742563422.947236}