{"duration": 0.03870820999145508, "input_args": {"text": "'Former FBI director James Comey began his testimony before the Senate Intelligence Committee on Thursday by suggesting that the question of whether President Donald Trump had committed obstruction of justice was one for Special Counsel Robert Mueller to investigate. [But under questioning by Sen. James Risch ( ) Comey all but destroyed any hope Democrats had for bringing a case of obstruction of justice against President Donald Trump.  Their exchange was as follows: Risch: I want to drill right down, as my time is limited, to the most recent   regarding, allegations that the President of the United States obstructed justice. And, boy, you nailed this down on page page five, paragraph three, you put this in quotes. Words matter, you wrote down the words so we can all have the words in front of us now. There’s 28 words that are in quotes, and it says, quote: “I hope”  —   this is the president speaking  —   “I hope you can see your way clear to letting this go, to letting Flynn go. He is a good guy. I hope you can let this go. ” Now, those are his exact words is that correct? Comey: Correct. Risch: And you wrote them here and you put them in quotes. Comey: Correct. Risch: Thank you for that. He did not direct you to let it go. Comey: Not in his words, no. Risch: He did not order you to let it go. Comey: Again, those words are not in order. Risch: No. He said, “I hope. ” Now, like me, you probably did hundreds of cases, maybe thousands of cases, charging people with criminal offenses. And of course you have knowledge of the thousands of cases out there where people have been charged. Do you know of any case where a person has been charged for obstruction of justice or for that matter any other criminal offense where they said or thought they hoped for an outcome? Comey: I don’t know well enough to answer. And the reason I keep saying his words is, I took it as a direction. Risch: Right. Comey: I mean, it’s the President of the United States with me alone, saying, “I hope this. ” I took it as this is what he wants me to do. I didn’t obey that, but that’s the way I took it. Risch: You may have taken it as a direction, but that’s not what he said. Comey: Correct. Risch: He said, “I hope. ” Comey: Those are exact words, correct. Risch: You don’t know of anyone that’s been charged for hoping something? Comey: I don’t, as I sit here. Risch: Thank you, Mr. Chairman. Democrats have hinged their hopes for impeachment  —   and reversing the 2016 elections  —   on the idea that Trump committed obstruction of justice. That case has now been smashed beyond repair. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742564577.2827904}