{"duration": 0.04755520820617676, "input_args": {"text": "'On Friday’s “Hugh Hewitt Show,” CBS’s “Face the Nation” moderator John Dickerson stated that the public doesn’t believe the media anymore “and it’s not because of anything obviously Donald Trump did. The press did all that good work ruining its reputation on its own, and we can have a long conversation about what created that. Part of it, though, is  …    a lot of hysterical coverage about every little last thing that doesn’t warrant it. ”  After Hewitt said that the “media handwringing” has gotten to be too much, Dickerson said, “I agree with you, to a point. You’re absolutely right. Focus on the big things. ” He added, “I think that the problem is, the Flynn matter, and, you know, when you have a press conference like yesterday, you would have liked to have heard somebody and somewhere in the Flynn saga say, you know, he had to resign because we don’t lie to the American people, and just make it  —   and that’s never been said. It’s never been said in this whole thing about, you know, this is about giving misinformation to the American people about a not unimportant thing. And the culture of truth telling that should be a part of a White House is not  —   you don’t get that. You know, the President was loose about the Electoral College thing. He said that for months. Nobody stepped in to say, Mr. President, that’s not right. Or they did, and it’s just no big deal. So that’s  —   and why does that matter? You know why it matters, because little shadings end up to be a big shading at the end. ” Dickerson further stated, “My point is, if you’re going to make a case on honesty grounds and truthfulness grounds, if that’s the turf on which you’re going to hold your press conference and open your press conference, so we’re talking about veracity here, and the importance and necessity of that, then when it comes to veracity in your own backyard, to elide it completely, seems inconsistent with the argument that you’re making in the 77 minute press conference. ” Hewitt then stated that people don’t believe the media anymore, to which Dickerson responded, “Well, yes. I mean, yes, it’s true, and it’s not because of anything obviously Donald Trump did. The press did all that good work ruining its reputation on its own, and we can have a long conversation about what created that. Part of it, though, is what you mentioned about the local weather report, which is to say a lot of hysterical coverage about every little last thing that doesn’t warrant it. Having said that, it doesn’t mean, and in fact, it most explicitly does not mean, that the press just throws out the standards. And one of the roles of the press is to make sure that the President, in the voice of the people, is telling the truth. ” (  Mediaite) Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742563011.8473961}