{"duration": 0.00713038444519043, "input_args": {"text": "'President Donald J. Trump signed three new executive actions on Saturday afternoon, including a five year lobbying ban, reorganization of the National Security Council, and a plan to defeat the Islamic State. [From the Oval Office, President Trump signed the documents while surrounded by reporters, advisers, and his Chief of Staff Reince Priebus.  Regarding the lobbying ban, Trump said: So this is a five year lobbying ban, and this is all of the people  —   most of the people standing behind me will not be able to go to work. It’s a two year ban now and it’s got full of loopholes and this is a five year ban. So you have one last chance to get out. Good, I had a feeling you were going to say that. This was something, the five year ban, that I have been taking a lot about on the campaign trail. Ahead of the signing, a senior administration official indicated that the lobbying ban included not only a five year ban on administration officials, but a lifetime ban on administration officials lobbying for a foreign country. After signing the document to reorganize the National Security Council, the President said, “This is the organization of the National Security Council and the Homeland Security Council, you know pretty much what it represents, it represents a lot, and also a lot of efficiency and I think a lot of additional safety. People have been talking about this for a long time, like many years. ” President Trump signed the ISIS plan, after which he said, “This is the plan to defeat the Islamic State of Iraq and Syria, in other words ISIS. I think it’s going to be very successful. That’s big stuff. ” The White House senior administration official also said ahead of the signing that the executive action regarding ISIS would give military leaders 30 days to compile and present a report to the President on a strategy to defeat ISIS. The President responded to questions about Friday’s executive order on immigration after signing each of the three executive actions, stating, “It’s not a Muslim ban, but we were totally prepared. It’s working out very nicely. You see it at the airports, you see it all over. ” Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742628507.2877765}