{"duration": 0.05614900588989258, "input_args": {"text": "'Leave a reply Charles Hugh Smith – Sometimes who lost is more important than who won. Let’s review who lost the election: 1. Let’s start with the Corporatocracy, which expected to once again wield unlimited influence by funding political campaigns with millions of dollars in contributions and speaking fees. 2. A biased mainstream media. My mom-in-law was watching CBS all night, so that’s what we watched. All the pundits/anchors spoke in the hushed tones of a funeral. For two hours, the only images of campaign workers shown were the sad faces of Clinton supporters; not one image of jubilant Trump supporters was broadcast until Trump gave his acceptance speech. When one of the talking heads noted that Hillary never generated the enthusiasm of the Sanders or Trump campaigns, his comment was followed by a stony silence. That he had given voice to a self-evident truth was not welcome. 3. Mainstream punditry: they got it wrong from the start and remained close-minded and arrogant in their postured superiority. The punditry applied a double standard to Trump and Hillary. Trump’s speeches and ethically questionable history were judged by moral standards, and he was declared unfit. Hillary’s actions, on the other hand, were judged by strictly legalistic standards: well, you can’t indict her, so she’s fit for office. Dear punditry: you can’t use double standards to promote your biases and retain any shred of credibility. 4. Pollsters. Having rigged the polls via over-sampling and under-sampling, they were laughably wrong. Here is a typical headline from election night, from the New York Times: Trump Takes Florida, Closing In on a Stunning Upset. Only the pollsters and the MSM were stunned. 5. Political parties. As my friend G.F.B. observed, both parties ran 20th century campaigns in the 21st century. Both parties lost for this reason; both are hopelessly out of touch with a rapidly changing America. Democrats upset with losing should look at their party’s system of Super-Delegates that squelched Bernie Sander’s bid. 6. Warmongers. Many Americans are sick and tired of interventionist, globalist warmongering. The only possible way they could register their opposition to warmongering was to vote for Trump. 7. Pay-to-Play Grifters. Let the investigations, indictments, prosecutions and convictions begin as soon as Trump is sworn in. 8. Neoliberals. Globalization boils down to freeing mobile capital to rove the globe for opportunities to strip-mine cheap resources, assets and labor and then move on, leaving ruined communities behind. 9. Bonus loser: Fake Progressives. Fake Progressives are perfectly fine with soaring inequality and corrupt governance, as long as everyone’s public utterances are politically correct. So the oppressor class is acceptable as long as they speak respectfully while stepping on your neck. Real Progressives see jobs and community as solutions, not welfare and central planning. Real Progressives see the eradication of warmongering Imperial pretensions and corrupt pay-to-play grifting as the essential projects of liberty and democracy. Charles Smith is a Contributing Writer for Shift Frequency SF Source Of Two Minds Nov. 2016 Share this:'"}, "time": 1742563203.9454052}