{"duration": 0.21208786964416504, "input_args": {"text": "'by Jerri-Lynn Scofield \\nBy Jerri-Lynn Scofield, who has worked as a securities lawyer and a derivatives trader. She now spends most of her time in India and other parts of Asia researching a book about textile artisans. She also writes regularly about legal, political economy, and regulatory topics for various consulting clients and publications, as well as writes occasional travel pieces for The National . \\nJust in time to pander for progressive votes in the home stretch leading into the election, the Obamamometer suggested earlier this week that the U.S. Army Corps of Engineers may be open to rerouting the Dakota Access Pipeline (DAPL), currently the subject of protests organized in support of the Standing Rock Sioux Tribe and other pipeline opponents. \\nThe DAPL is designed to transport light sweet crude oil from the Bakken Shield in North Dakota — an area not served by existing pipelines — through South Dakota, Iowa, and Illinois. DAPL would supersede the previous distribution arrangements, under which oil from this source was shipped by train. \\nWhat’s now occurring follows the playbook I suggested would be used in my September post, Dakota Pipeline Will Proceed As Feds Undertake Smoke and Mirrors Policy Reconsideration . And the administration is still promising to pay us on Tuesday. \\nSoft, Sibilant, Sweet Nothings \\nAs reported DeSmogBlog’s Steven Horn, in As President Obama Hints At Dakota Access Possible Reroute, Tensions Swirl at Standing Rock — which is worth a read for the additional details and context it provides, the Obamamometer said the Corps would consider rerouting following a continued consultation process. His key weasel words: \\nright now the Army Corps is examining whether there are ways we can reroute this pipeline, so we’re going to let it play out for several more weeks and determine whether or not this can be resolved in a way that is properly attentive to the tradition of First Americans. \\nTo be fair, he did genuflect in the direction of the First Amendment and call for both authorities and protestors to show restraint (as reported by the BBC ): \\nThere is an obligation for protesters to be peaceful, and there’s an obligation for authorities to show restraint… I want to make sure that as everybody is exercising their constitutional rights to be heard, that both sides are refraining from situations that might result in people being hurt. \\nStanding Rock Sioux Ask for DOJ Investigation \\nThe Standing Rock Sioux Tribe has asked the Department of Justice to intervene and investigate alleged civil rights abuses in pipeline policing, which has been conducted by state and local police and private security companies. North Dakota earlier this month approved an additional $4 million for policing the DAPL protest, raising total expenditures to 10 million . \\nHorn’s article features an embedded video showing a policing crackdown. Video: North Dakota police/military forces attack water protectors in Cannonball river with chemical weapons. #NoDAPL pic.twitter.com/gXTZ9umwLq \\n— Unicorn Riot (@UR_Ninja) 2 November 2016 \\nThe Wall Street Journal also posted video footage filmed yesterday. \\nFaith in Vague Promises \\nThe Standing Rock Sioux Tribe issued a press release in which they chose to take the Obamamometer at his word: \\nWe applaud President Obama’s commitment to protect our sacred lands, our water, and the water of 17 million others. \\nWhile the Army Corps of Engineers is examining this issue we call on the administration and the Corps to issue an immediate “stop work order” on the Dakota Access Pipeline. And given the flawed process that has put our drinking water in jeopardy, we also urge the Administration to call for a full environmental impact study. \\nThe nation and the world are watching. The injustices done to Native people in North Dakota and throughout the country must be addressed. \\nWe believe President Obama and his Administration will do the right thing. \\nYet as Horn reported, Greenpeace is made of stronger stuff: \\nThe administration seems to be buying time to maintain the status quo and profits for fossil fuel investors,” Greenpeace USA spokeswoman Lilian Molina said in a press release. “There is only one option that is truly attentive to the Native lives and lands at stake: respect the rights and sovereignty of Indigenous communities by revoking the permits immediately.” \\nGreenpeace USA, meanwhile, called for Obama to reverse the Army Corps permit granted for the pipeline. It opined that Obama was engaging in a stalling tactic. \\n“The administration seems to be buying time to maintain the status quo and profits for fossil fuel investors,” Greenpeace USA spokeswoman Lilian Molina said in a press release. “There is only one option that is truly attentive to the Native lives and lands at stake: respect the rights and sovereignty of Indigenous communities by revoking the permits immediately.” \\nWill Wider Audience Be Gulled? \\nThe intended audience for the Obamamometer’s remarks is much wider than those immediately involved in the protests. The BBC report notes, “The protest has gathered widespread attention and social media support, prompting 1.4 million people to ‘check in’ to the location on Facebook in solidarity. The Democrats are clearly trying to maximize turnout among younger progressives, many of whom have shown little inclination to support Hillary Clinton’s candidacy. \\nDespite the need to attract these votes, Clinton hewed to her game plan of offering few positive reasons to support her candidacy and missed the chance to make this issue one on which she’d stake out a progressive position. Instead, as Horn noted, she “offered a wishy-washy statement on the project, using many words to say very little”, and which said in part: \\nFrom the beginning of this campaign, Secretary Clinton has been clear that she thinks all voices should be heard and all views considered in federal infrastructure projects… \\nNow, all of the parties involved—including the federal government, the pipeline company and contractors, the state of North Dakota, and the tribes—need to find a path forward that serves the broadest public interest. As that happens, it’s important that on the ground in North Dakota, everyone respects demonstrators’ rights to protest peacefully, and workers’ rights to do their jobs safely. \\nOngoing Formal, Government-To-Government Consultations \\nAs I wrote in September, \\nThe Department of Justice, the Department of the Army, and the Department of the Interior waded into the controversy over construction of the Dakota Access oil pipeline (DAPL) [yesterday], shortly after U.S. federal court judge James E. Boasberg denied a request for a preliminary injunction to halt its construction in his Standing Rock Sioux Tribe v U.S. Army Corps of Engineers ruling. \\nThe three agencies recognized: \\n…[T}his case has highlighted the need for a serious discussion on whether there should be nationwide reform with respect to considering tribes’ views on these types of infrastructure projects. Therefore, this fall, we will invite tribes to formal, government-to-government consultations on two questions: (1) within the existing statutory framework, what should the federal government do to better ensure meaningful tribal input into infrastructure-related reviews and decisions and the protection of tribal lands, resources, and treaty rights; and (2) should new legislation be proposed to Congress to alter that statutory framework and promote those goals. \\nThe three agencies continue to conduct these consultations on federal infrastructure decisions, with a key meeting scheduled for November 17 in Rapid City, South Dakota and the final session due to be completed via teleconference on November 21. Conveniently, these discussions will conclude after election day. \\nPipeline Proponents Didn’t Get the Memo \\nUnsurprisingly, pipeline proponents opposed even the weak commitment seemingly made in the interview. Some of the parties to the pipeline have entered into long-term binding contracts with shippers in anticipation of the DAPL and its related facilities coming on stream later this year. Despite the announcement in the three agency statement that the Corps of Engineers would not authorize constructing DAPL on Corps land bordering or under Lake Oahe until it conducted a further policy review– and asking that”the pipeline company voluntarily pause all construction activity within 20 miles east or west of Lake Oahu”, construction on the rest of the pipeline has proceeded, so that now it is estimated that the DAPL is now more than three-quarters completed. \\nThe Wall Street Journal quoted a spokeswoman for Energy Transfer Partners LP, which is constructing DAPL, as saying: \\nthe company isn’t aware of any consideration being given to rerouting the project. She said the company also expects to receive the final federal approval for a disputed portion of the pipeline in a timely fashion. \\nIn an internal company memo on Sept. 13, Energy Transfer CEO Kelcy Warren said the pipeline was nearly 60% complete and that the company had spent more than $1.6 billion on the project. \\nLikely Outcome? \\nDespite the hopes and dreams of progressives, the administration will face heavy pressure to conclude its review process in time for those involved in the project to honour existing supply contracts. Alternatively issue may be dumped onto the incoming administration. The WSJ reported that neither the Trump nor Clinton campaign has taken a position on DAPL construction. \\nDespite the Obamamometer’s remarks, I’d be very surprised indeed if the Corps were to present a viable plan to reroute the pipeline at this late date. And if it does, further lawsuits would inevitably follow. 0 0 0 0 0 1'"}, "time": 1742563570.7254348}