{"duration": 0.07494354248046875, "input_args": {"text": "'Actor Jim Caviezel portraying Jesus in “The Passion of the Christ.” \\nJesus Christ of Nazareth is not the Republican nominee for president in this election cycle. \\nBut if He were, Democrats would try to “destroy” Him in the same manner they’re attacking the 2016 GOP candidate, Donald Trump. \\nThat’s according to radio host Rush Limbaugh, who hypothesized what this year’s race would look like if the Son of God were at the top of the Republican ticket. \\nShould President Trump try to prosecute Hillary? Sign the hottest petition in America now to show your support! \\n“It doesn’t matter who the Republicans would have nominated, they were gonna get the treatment Trump’s getting. It wouldn’t have mattered,” Limbaugh said Wednesday. \\n“They would go out of their way to find ways to destroy Jesus Christ if he could be nominated as a Republican. The Democrats would do everything they could, include calling Him a liar, the Bible a fake book, whatever it took.” Rush Limbaugh \\nAnd despite the fact the Bible never indicates Jesus was married or had sex out of wedlock, Limbaugh suggested Democrats would do their best effort in trying to find any of His offspring: \\n“They would scour the historical record looking for children He had fathered, anything they could do to disapprove the gospel to discredit Jesus. That’s who they are. That’s what they would do.” \\nLimbaugh said the point he was stressing was that Republicans would never escape “this kind of media assault based on who we nominate.” Donald Trump’s RNC acceptance speech (Photo: Screenshot from RNC live feed) \\n“I say this because a lot of you Never Trumpers are out there claiming that this is exactly what you get when you nominate a guy like Trump. No, it’s exactly what you get when you nominate a Republican. Whenever there is any opposition to the Democrats, this is what they do. It doesn’t matter. They’re gonna do it. They did it to Romney … \\n“I’ve made this point ’til I blue in the face. They turned Romney, who is mild-mannered Mr. Gosh, Can’t Even Get Noticed into the biggest walking Satan, El Diablo politics had ever seen at that time, and they made it stick So this is why I think Trump has so many people supporting him. He’s fighting back against it when most Republicans haven’t and don’t.” \\nAs an example of how media treatment of Republicans has not changed, Limbaugh played an excerpt of 1980 election-night coverage from CBS. Commentator Bill Moyers characterized the race before it was known that Republican Ronald Reagan would easily defeat Democrat Jimmy Carter. Moyers stated: \\n“Those of you who might speak Spanish, who might be black, who might be women, remember,” said Carter, “who’s been your friend.” And there under the California sun in San Diego at a shopping center, Ronald Reagan was delivering himself of one of those patriotic soliloquies at which he’s been a master since his days at Eureka College. Suddenly hecklers in the crowd started shouting and waving their ERA signs. Reagan took his cue and snapped back, “Aw, shut up!” \\nAnd thousands of supporters roared their approval. Those are the people for whom Ronald Reagan is the apostle of the rollback, the knight who promises finally to slay the dragon of liberal government. Jimmy Carter won four years ago as an outsider, and, if he wins at all tonight, it must be as an insider defending the status quo. Reagan has cast himself as a sheriff who comes riding into town at just in the nick of time shouting, “Enough’s enough.” \\n“Does it sound like anything has changed in the way these people see the world?” Limbaugh asked. “Not an iota!” \\nFollow Joe Kovacs on Twitter @JoeKovacsNews'"}, "time": 1742562117.3796482}