{"duration": 2.397214889526367, "input_args": {"text": "'Hillary Clinton sat in the hideaway study off her ceremonial office in the State Department, sipping tea and taking stock of her first year on the job. The study was more like a den  —   cozy and   lined with bookshelves that displayed mementos from Clinton’s three decades in the public eye: a statue of her heroine, Eleanor Roosevelt a baseball signed by the Chicago Cubs star Ernie Banks a carved wooden figure of a pregnant African woman. The intimate setting lent itself to a   interview than the usual locale, her imposing outer office, with its marble fireplace, heavy drapes, crystal chandelier and ornate wall sconces. On the morning of Feb. 26, 2010, however, Clinton was talking about something more sensitive than mere foreign affairs: her relationship with Barack Obama. To say she chose her words carefully doesn’t do justice to the delicacy of the exercise. She was like a   technician, deciding which color wire to snip without blowing up her relationship with the White House. “We’ve developed, I think, a very good rapport, really positive    about everything you can imagine,” Clinton said about the man she described during the 2008 campaign as naïve, irresponsible and hopelessly unprepared to be president. “And we’ve had some interesting and even unusual experiences along the way. ” She leaned forward as she spoke, gesturing with her hands and laughing easily. In talking with reporters, Clinton displays more warmth than Obama does, though there’s less of an expectation that she might say something revealing. Clinton singled out, as she often would, the United Nations   meeting in Copenhagen the previous December, where she and Obama worked together to save the meeting from collapse. She brought up the Middle East peace proc ess, a signature project of the president’s, which she had been tasked with reviving. But she was understandably wary of talking about areas in which she and Obama split  —   namely, on bedrock issues of war and peace, where Clinton’s more activist philosophy had already collided in unpredictable ways with her boss’s instincts toward restraint. She had backed Gen. Stanley McChrystal’s recommendation to send 40, 000 more troops to Afghanistan, before endorsing a fallback proposal of 30, 000 (Obama went along with that, though he stipulated that the soldiers would begin to pull out again in July 2011, which she viewed as problematic). She supported the Pentagon’s plan to leave behind a residual force of 10, 000 to 20, 000 American troops in Iraq (Obama balked at this, largely because of his inability to win legal protections from the Iraqis, a failure that was to haunt him when the Islamic State overran much of the country). And she pressed for the United States to funnel arms to the rebels in Syria’s civil war (an idea Obama initially rebuffed before later, halfheartedly, coming around to it). That fundamental tension between Clinton and the president would continue to be a defining feature of her   tenure as secretary of state. In the administration’s first   meeting on Russia in February 2009, aides to Obama proposed that the United States make some symbolic concessions to Russia as a gesture of its good will in resetting the relationship. Clinton, the last to speak, brusquely rejected the idea, saying, “I’m not giving up anything for nothing. ” Her hardheadedness made an impression on Robert Gates, the defense secretary and George W. Bush holdover who was wary of a changed Russia. He decided there and then that she was someone he could do business with. “I thought, This is a tough lady,” he told me. A few months after my interview in her office, another split emerged when Obama picked up a secure phone for a weekend conference call with Clinton, Gates and a handful of other advisers. It was July 2010, four months after the North Korean military torpedoed a South Korean Navy corvette, sinking it and killing 46 sailors. Now, after weeks of fierce debate between the Pentagon and the State Department, the United States was gearing up to respond to this brazen provocation. The tentative plan  —   developed by Clinton’s deputy at State, James Steinberg  —   was to dispatch the aircraft carrier George Washington into coastal waters to the east of North Korea as an unusual show of force. But Adm. Robert Willard, then the Pacific commander, wanted to send the carrier on a more aggressive course, into the Yellow Sea, between North Korea and China. The Chinese foreign ministry had warned the United States against the move, which for Willard was all the more reason to press forward. He pushed the chairman of the Joint Chiefs of Staff, Mike Mullen, who in turn pushed his boss, the defense secretary, to reroute the George Washington. Gates agreed, but he needed the commander in chief to sign off on a decision that could have political as well as military repercussions. Gates laid out the case for diverting the George Washington to the Yellow Sea: that the United States should not look as if it was yielding to China. Clinton strongly seconded it. “We’ve got to run it up the gut!” she had said to her aides a few days earlier. (The Vince Lombardi imitation drew giggles from her staff, who, even 18 months into her tenure, still marveled at her pugnacity.) Obama, though, was not persuaded. The George Washington was already underway changing its course was not a decision to make on the fly. “I don’t call audibles with aircraft carriers,” he said  —   unwittingly   Clinton on her football metaphor. It wasn’t the last debate in which she would side with Gates. The two quickly discovered that they shared a Midwestern upbringing, a taste for a stiff drink after a long day of work and a   skepticism about the intentions of America’s foes. Bruce Riedel, a former intelligence analyst who conducted Obama’s initial review on the Afghanistan war, says: “I think one of the surprises for Gates and the military was, here they come in expecting a very    administration, and they discover that they have a secretary of state who’s a little bit right of them on these issues  —   a little more eager than they are, to a certain extent. Particularly on Afghanistan, where I think Gates knew more had to be done, knew more troops needed to be sent in, but had a lot of doubts about whether it would work. ” As Hillary Clinton makes another run for president, it can be tempting to view her   rhetoric about the world less as deeply felt core principle than as calculated political maneuver. But Clinton’s   instincts are bred in the bone  —   grounded in cold realism about human nature and what one aide calls “a textbook view of American exceptionalism. ” It set her apart from her    Barack Obama, who avoided military entanglements and tried to reconcile Americans to a world in which the United States was no longer the undisputed hegemon. And it will likely set her apart from the Republican candidate she meets in the general election. For all their bluster about bombing the Islamic State into oblivion, neither Donald J. Trump nor Senator Ted Cruz of Texas has demonstrated anywhere near the appetite for military engagement abroad that Clinton has. “Hillary is very much a member of the traditional American   establishment,” says Vali Nasr, a   strategist who advised her on Pakistan and Afghanistan at the State Department. “She believes, like presidents going back to the Reagan or Kennedy years, in the importance of the military  —   in solving terrorism, in asserting American influence. The shift with Obama is that he went from reliance on the military to the intelligence agencies. Their position was, ‘All you need to deal with terrorism is N. S. A. and C. I. A. drones and special ops.’ So the C. I. A. gave Obama an angle, if you will, to be simultaneously hawkish and shun using the military. ” Unlike other recent presidents  —   Obama, George W. Bush or her husband, Bill Clinton  —   Hillary Clinton would assume the office with a long record on national security. There are many ways to examine that record, but one of the most revealing is to explore her   cultivation of the military  —   not just civilian leaders like Gates, but also its   commanders, the men with the medals. Her affinity for the armed forces is rooted in a lifelong belief that the calculated use of military power is vital to defending national interests, that American intervention does more good than harm and that the writ of the United States properly reaches, as Bush once put it, into “any dark corner of the world. ” Unexpectedly, in the bombastic,   presidential election of 2016, Hillary Clinton is the last true hawk left in the race. For those who know Clinton’s biography, her embrace of the military should come as no surprise. She grew up in the buoyant aftermath of World War II, the daughter of a Navy petty officer who trained young sailors before they shipped out to the Pacific. Her father, Hugh Rodham, was a staunch Republican and an anticommunist, and she channeled his views. She talks often about her girlhood dream of becoming an astronaut, citing the rejection letter she got from NASA as the first time she encountered gender discrimination. Her real motive for volunteering, she has written, may have been because her father fretted that “America was lagging behind Russia. ” Political conversion came later, after Vietnam and the ’60s swept over Wellesley College, where she spoke out against the establishment at her graduation. But even in the tumultuous year of 1968, she was still making her transition from Republican to Democrat, managing to go to the conventions of both parties. As a Republican intern in Washington that summer, she questioned a Wisconsin congressman, Melvin Laird, about the wisdom of Lyndon B. Johnson’s escalating involvement in Southeast Asia. It was after law school that she had her most curious encounter with the military. In 1975, the year she married Bill Clinton, she stopped in at a Marine recruiting office in Arkansas to inquire about joining the active forces or reserves. She was a lawyer, she explained maybe there was some way she could serve. The recruiter, she recalled two decades later, was a young man of about 21, in prime physical condition. Clinton was then 27, freshly transplanted from Washington, teaching law at the University of Arkansas in Fayetteville and wearing   eyeglasses. “You’re too old, you can’t see and you’re a woman,” he told her. “Maybe the dogs will take you,” he added, in what she said was a pejorative reference to the Army. “It was not a very encouraging conversation,” Clinton said at a lunch for military women on Capitol Hill in 1994. “I decided, Maybe I’ll look for another way to serve my country. ” Some reporters have cast doubt on the veracity of this story, which she repeated in the fall of 2015 over breakfast with voters in New Hampshire: certainly, there’s no concrete evidence that it happened, and Bill gave a different account of it in 2008, substituting the Army for the Marines. Why would a professionally minded Yale Law graduate, on the cusp of marriage, suddenly want to put on a uniform? It’s impossible to decipher her possible motives, but Ann Henry, an old friend who taught at the university after Clinton moved to Little Rock, offers a theory: During those days, she recalls, female faculty members, as an exercise, would test the boundaries of careers that appeared closed to women. “I don’t think it’s made up,” she says. “It was consistent with something she would have done. ” Clinton’s next sustained exposure to the military did not come until she was first lady, almost two decades later. Living in the White House is, in many ways, like living in a military compound. A Marine stands guard in front of the West Wing when the president is in the Oval Office. The Mili tary Office operates the medical center and the telecommunications system. The Navy runs the cafeteria, the Marines transport the president by helicopter, the Air Force by plane. Camp David is a naval facility. The daily contact with men and women in uniform, Clinton’s friends say, deepened her feelings for them. In March 1996, the first lady visited American troops stationed in Bosnia. The trip became notorious years later when she claimed, during the 2008 campaign, to have dodged sniper fire after her   military plane landed at an American base in Tuzla. (Chris Hill, a diplomat who was onboard that day and later served as ambassador to Iraq under Clinton, didn’t remember snipers at all, and indeed recalled children handing her bouquets of spring flowers.) But there was no faking the good vibes during her tour of the mess and rec halls. With her teenage daughter at her side, she bantered and joked with the young servicemen and women  —   an experience, she wrote, that “left lasting impressions on Chelsea and me. ” When Clinton was elected to the Senate, she had strong political reasons to care about the mili tary. The Pentagon was in the midst of a long, politically charged process of closing military bases New York State had already been a victim, when Plattsburgh Air Force Base was closed in 1995, a loss of 352 civilian jobs for that   North Country town. New York’s delegation was determined to protect its remaining bases, especially Fort Drum, home of the Army’s 10th Mountain Division, which sprawls over a hundred thousand acres in rural Jefferson County. In October 2001, a month after the   terrorist attacks, Clinton traveled to Fort Drum at the invitation of Gen. Buster Hagenbeck, who had just been named the division’s commander and would be deployed to Afghanistan a month later. Like many of the officers I spoke with, he had preconceptions of Clinton from her years as first lady the woman who showed up at his office around happy hour that afternoon did not fulfill them. “She sat down,” he recalls, “took her shoes off, put her feet up on the coffee table and said, ‘General, do you know where a gal can get a cold beer around here? ’’u2009” It was the start of a dialogue that stretched over two wars. In the spring of 2002, Hagenbeck led Operation Anaconda, a   assault on Taliban and Al Qaeda fighters in the    Valley that was the largest combat engagement of the war to date. When the general came back to Washington to brief the Joint Chiefs of Staff, Clinton took him out to dinner on Capitol Hill for her own briefing. They also spoke about the Bush administration’s preparations for war in Iraq, something which Hagenbeck was following anxiously. The general, it turned out, was more of a dove than the senator. He warned her about the risks of an invasion, which was then being   inside the Pentagon. It would be like “kicking over a bee’s nest,” he said. Hagenbeck excused Clinton’s vote in 2002 to authorize military action in Iraq. “She made a considered call,” he says. And “she was chagrined, much after the fact. ” For him, what mattered more than Clinton’s voting record was her unstinting public support of the military, whether in protecting Fort Drum or backing him during a difficult first year in Afghanistan. Clinton’s education in military affairs began in earnest in 2002, after the Democratic Party’s crushing defeat in midterm elections moved her up several rungs in Senate seniority. The party’s congressional leaders offered her a seat on either the Senate Foreign Relations Committee or the Senate Armed Services Committee. She chose Armed Services, spurning a long tradition of New York senators, like Daniel Patrick Moynihan and Jacob Javits, who coveted the prestige of Foreign Relations. Armed Services deals with more earthbound issues, like benefits for veterans, and it had long been the preserve of Republican hawks like John McCain. But after   Clinton saw Armed Services as better preparation for her future. For a politician looking to hone   credentials  —   a woman who aspired to be commander in chief  —   it was the perfect training ground. She dug in like a grunt at boot camp. Andrew Shapiro, then Senator Clinton’s   adviser, called upon 10 experts  —   including Bill Perry, who was defense secretary under her husband, and Ashton Carter, who would eventually become President Obama’s fourth defense secretary  —   to tutor her on everything from grand strategy to defense procurement. She met quietly with Andrew Marshall, an octogenarian strategist at the Pentagon who labored for decades in the blandly named Office of Net Assessment, earning the nickname Yoda for his Delphic insights. She went to every committee meeting, no matter how mundane. Aides recall her on   sitting alone in the chamber, patiently questioning a lieutenant colonel. She visited the troops in Afghanistan on Thanksgiving Day in 2003 and spoke at every significant military installation in New York State. By then  —   30 years after she recalled being rejected by a Marine recruiter in Arkansas  —   Hillary Clinton had become a military wonk. Jack Keane is one of the intellectual architects of the Iraq surge he is also perhaps the greatest single influence on the way Hillary Clinton thinks about military issues. A bear of a man with a jowly, careworn face and   hair, Keane exudes the supreme   you would expect of a retired   general. He speaks with a trace of a New York accent that gives his pronouncements a    urgency. He is also a   member of the   complex, sitting on the board of General Dynamics and serving as a strategic adviser to Academi, the   contractor once known as Blackwater. And he is the chairman of an aptly named think tank, the Institute for the Study of War. Though he is one of a parade of   generals, Keane is the resident hawk on Fox News, where he appears regularly to call for the United States to use greater military force in Iraq, Syria and Afghanistan. He doesn’t shrink from putting boots on the ground and has little use for civilian leaders, like Obama, who do. Keane first got to know Clinton in the fall of 2001, when she was a freshman senator and he was the Army’s second in command, with a distinguished combat and command record in Vietnam, Somalia, Haiti, Bosnia and Kosovo. He had expected her to be intelligent,   and politically astute, but he was not prepared for the respect she showed for the Army as an institution, or her sympathy for the sacrifices made by soldiers and their families. Keane was confident he could smell a phony politician a mile away, and he didn’t get that whiff from her. “I read people that’s one of my strengths,” he told me. “It’s not that I can’t be fooled, but I’m not fooled often. ” Clinton took an instant liking to Keane, too. “She loves that Irish gruff thing,” says one of her Senate aides, Kris Balderston, who was in the room that day. When Keane got up after 45 minutes to leave for a meeting back at the Pentagon with a Polish general, she protested that she wasn’t finished yet and asked for another appointment. “I said, ‘O. K. but it took me three months to get this one,’’u2009” Keane told her dryly. Clinton exploded into a raucous laugh. “I’ll take care of that problem,” she promised. She was true to her word: The two would meet many times over the next decade, discussing the wars in Afghanistan and Iraq, the Iranian nu clear threat and other flash points in the Middle East. Sometimes he dropped by her Senate office other times they met for dinner or drinks. He escorted her on her first visit to Fort Drum and set up her first trip to Iraq. They generally agreed to forgo talk of politics, but at a meeting in Clinton’s Senate office in January 2007, Keane tried to sell her on the logic of a troop surge in Iraq. The previous month, he had met with President Bush in the Oval Office to recommend that the United States deploy five to eight Army and Marine brigades to wage an urban counterinsurgency campaign only that, he argued, would stabilize a country being ripped apart by sectarian strife. His presentation angered some of Keane’s fellow generals, who feared that such a strategy would deepen Iraq’s dependency and prolong America’s involvement. But it had a big impact on the commander in chief, who soon ordered more than 20, 000 additional troops to Iraq. Clinton was another story. “I’m convinced it’s not going to work, Jack,” she told him. She predicted that the American soldiers patrolling in Iraqi cities and towns would be “blown up” by Sunni militias or Al Qaeda fighters. “She thought we would fail,” Keane recalls, “and it was going to cause increased casualties. ” Politics, of course, was also on her mind. Barack Obama was laying the groundwork for his candidacy in   with a campaign that would emphasize his opposition to the Iraq War and her vote in favor of it  —   a vote that still shadows her in this year’s Democratic primaries. Obama was setting off on a   drive that would net $25 million in three months, sending tremors through Clinton’s political camp and establishing him as a formidable rival. Although she disagreed with Keane about Iraq, Clinton asked him to become a formal adviser. “As much as I respect you,” he replied, “I can’t do that. ” Keane’s wife had health problems that had moved up his retirement from the Army, and he did not, as a policy, endorse candidates. Sometime during 2008  —   he doesn’t remember exactly when  —   Clinton told him she had erred in doubting the wisdom of the surge. “She said, ‘You were right, this really did work,’’u2009” Keane recalls. “On issues of national security,” he says, “I thought she was always intellectually honest with me. ” He and Clinton continued to talk, even after Obama was elected and she became secretary of state. More often than not, they found themselves in sync. Keane, like Clinton, favored more robust intervention in Syria than Obama did. In April 2015, the week before she announced her candidacy, Clinton asked him for a briefing on military options for dealing with the fighters of the Islamic State. Bringing along three young female analysts from the Institute for the Study of War, Keane gave her a     presentation. Among other steps, he advocated imposing a   zone over parts of Syria that would neutralize the air power of the Syrian president, Bashar   with a goal of forcing him into a political settlement with opposition groups. Six months later, Clinton publicly adopted this position, further distancing herself from Obama. “I’m convinced this president, no matter what the circumstances, will never put any boots on the ground to do anything, even when it’s compelling,” Keane told me. He was sitting in the library at his home in McLean, Va. which is lined with books on military history and strategy. His critique of Obama was hardly new or original, but much of it mirrors the thinking of Clinton and her policy advisers. “One of the problems the president has, which weakens his diplomatic efforts, is that leaders don’t believe he would use military power. That’s an issue that would separate the president from Hillary Clinton rather dramatically. She would look at military force as another realistic option, but only where there is no other option. ” Befriending Keane wasn’t just about cultivating a single adviser. It gave Clinton instant entree to his informal network of   and retired generals. The most interesting by far was David Petraeus, a cerebral commander who shared Clinton’s   ambition and whose life stories would mix heady success with humbling setbacks. Both would be accused of mishandling classified information  —   Clinton because of her use of a private server and email address to conduct sensitive government business, a decision that erupted into a political scandal Petraeus because he had given a diary containing classified information to his biographer and mistress (he was eventually charged with a misdemeanor for mishandling classified information). On Clinton’s first trip to Iraq in November 2003, Petraeus, then a   general commanding the 101st Airborne Division, flew from his field headquarters in Mosul to the relative safety of Kirkuk to brief her congressional delegation. “She was full of questions,” he recalls. “It was the kind of gesture that means a lot to a battlefield commander. ” On subsequent trips, as he rose in rank, Petraeus walked her through his plans to train and equip Iraqi Army troops, a forerunner of the counterinsurgency strategy in Afghanistan. It worked to their mutual benefit: Petraeus was building ties to a prominent Democratic voice in the Senate Clinton was burnishing her image as a friend of the troops. “She did it the   way,” he says. “She did it by pursuing relationships. ” When Petraeus was sent back to Iraq as the top commander in early 2007, he gave every member of the Senate Armed Services Committee a copy of the U. S.   Corps Counterinsurgency Field Manual, which he edited during a tour at Fort Leavenworth. Clinton read hers from cover to cover. Although Clinton’s reservations about the surge were valid  —   the stability that the additional troops brought to Iraq didn’t last  —   her opposition to it, like her vote for the war, came back to haunt her. This time, it was her ally Bob Gates who summoned the ghost. In his memoirs, Gates wrote that she confessed to him and the president that her position had been politically motivated, because she was then facing Obama in the Iowa caucuses. (Obama, he wrote, “vaguely” conceded that he, too, had opposed it for political reasons.) Clinton pushed back, telling Diane Sawyer of ABC News that Gates “perhaps either missed the context or the meaning, because I did oppose the surge. ” Her opposition, she told Sawyer, was driven by the fact that at that time, people were not going to accept any escalation of the war. “This is not politics in electoral, political terms,” Clinton said. “This is politics in the sense of the American public has to support commitments like this. ” The next time she found herself in a debate over sending troops into harm’s way, she voiced no such reservations. “We need maps,” Hillary Clinton told her aides. It was early October 2009, and she had just returned from a meeting in the Situation Room. Obama’s war cabinet was debating how many additional troops to send to Afghanistan, where the United States, preoccupied by Iraq, had allowed the Taliban to regroup. The Pentagon, she reported, had used impressive,   maps to show its plans to deploy troops around the country. The attention to detail made Gates and his commanders look crisp and well prepared the State Department, which was pushing a “civilian surge” to accompany the troops, looked wan by comparison. At the next meeting, on Oct. 14, the team from State unfurled its own maps to show the deployment of an army of aid workers, diplomats, legal experts and crop specialists who were supposed to follow the soldiers into Afghanistan. Clinton’s fixation with maps was typical of her   in the first great    debate of the Obama presidency. She wanted to be taken seriously, even if her department was less central than the Pentagon. One way to do that was by promoting the civilian surge, the pet project of her friend and special envoy to the region, Richard Holbrooke. “She was determined that her briefing books would be just as thick and just as meticulous as those of the Pentagon,” a senior adviser recalls. She also didn’t hesitate to get into the Pentagon’s business, asking detailed questions about the training of Afghan troops and wading into the weeds of military planning. She resolved not to miss out on anything  —   a determination that may have been rooted in a deeper insecurity about her role in what was to become the most White   administration of the modern era. On the morning of June 8, 2009, she emailed two aides to say: “I heard on the radio that there is a Cabinet mtg this am. Is there? Can I go? If not, who are we sending?” On Feb. 10, 2010, she dialed the White House from her home, but couldn’t get past the switchboard operator, who didn’t believe she was really Hillary Clinton. Asked to provide her office number to prove her identity, she said she didn’t know it. Finally, Clinton hung up in frustration and placed the call again through the State Department Operations Center  —   “like a proper and properly dependent secretary of state,” as she later wrote to one aide in a   tone. “No independent dialing allowed. ” The Afghan troop debate, a   drama of dueling egos, leaked documents and endless deliberations, is typically framed as a test of wills between the Pentagon’s wily military commanders and an inexperienced young president, with Joe Biden playing the role of devil’s advocate for Obama. While that portrait is accurate, it neglects the role of Clinton. By siding with Gates and the generals, she gave political ballast to their proposals and provided a bullish counterpoint to Biden’s skepticism. Her role should not be overstated: She did not turn the debate, nor did she bring to it any distinctive point of view. But her unstinting support of General McChrystal’s maximalist recommendation made it harder for Obama to choose a lesser option. (McChrystal was later fired by Obama after his aides made derogatory remarks about almost every member of his war cabinet to Rolling Stone magazine she was the exception. “Hillary had Stan’s back,” one of his aides told the reporter, Michael Hastings.) “Hillary was adamant in her support for what Stan asked for,” Gates says. “She made clear that she was ready to support his request for the full 40, 000 troops. She then made clear that she was only willing to go with the 30, 000 number because I proposed it. She was, in a way, tougher on the numbers in the surge than I was. ” Gates believed that if he could align Clinton the chairman of the Joint Chiefs of Staff, Mike Mullen the commander of Central Command, David Petraeus and himself behind a common position, it would be hard for Obama to say no. “How could you ignore these Four Horsemen of national security?” says Geoff Morrell, who served as the Pentagon press secretary at the time. Just as Clinton benefited from her alliance with the military commanders, she gave them political cover. “Here’s the dirty little secret,” says Tom Nides, her former deputy secretary of state for management and resources. “They all knew they wanted her on their side. They knew that if they walked into the Situation Room and they had her, it made a huge difference in the dynamics. When she opened her mouth, she could change the momentum in the room. ” David Axelrod recalls one meeting where Clinton “kicked the thing off and pretty much articulated their opinion I’m sure that’s one that they remember. There’s no doubt that she wanted to give them every troop that McChrystal was asking for. ” Still, Clinton didn’t prevail on every argument. After agreeing to send the troops, Obama added a condition of his own: that the soldiers be deployed as quickly as possible and pulled out again, starting in the summer of 2011  —   a deadline that proved more fateful in the long run than a difference of 10, 000 troops. Clinton opposed setting a public deadline for withdrawal, arguing that it would tip America’s hand to the Taliban and encourage them to wait out the United States  —   which, in fact, was exactly what happened. In the final days of the debate, Clinton also found herself at odds with her own ambassador in Kabul, Karl Eikenberry. He, too, held different views than she did on the wisdom of a surge, which he put into writing. On Nov. 6, 2009, in a long cable addressed to Clinton  —   and later leaked to The New York Times  —   he made a trenchant, convincing case for why the McChrystal proposal, which she endorsed two weeks earlier in a meeting with Obama, would saddle the United States with “vastly increased costs and an indefinite,   military role in Afghanistan. ” Much of Eikenberry’s analysis proved prescient, particularly his warnings about the threadbare American partnership with the Afghan president, Hamid Karzai. It carried an extra sting because he was a retired   Army general who was the commander in Afghanistan from 2005 to 2007. Clinton, who had not asked for the cable, was furious, fearing it could upset a debate in which she and the Pentagon were about to prevail. What the cable made clear was the degree to which the Afghanistan debate was dominated by military considerations. While Clinton did raise the need to deal with Afghanistan’s neighbor, Pakistan, her reflexive support of Gates, Petraeus and McChrystal meant she was not a powerful voice for diplomatic alternatives. “She contributed to the overmilitarizing of the analysis of the problem,” says Sarah Chayes, who was an adviser to McChrystal and later to the chairman of the Joint Chiefs of Staff, Mike Mullen. In October 2015, the persistent violence in Afghanistan and the legacy of Karzai’s misrule forced Obama to reverse his plan to withdraw the last American soldiers by the end of his presi dency. A few thousand troops will stay there indefinitely. And for all of Clinton’s talk about a civilian surge, it never really materialized. For Clinton, the Afghanistan episode laid bare a vexed relationship between her and Eikenberry, one of the few generals with whom she didn’t hit it off. A   with graduate degrees from Harvard and Stanford, Eikenberry was brilliant but had a reputation among his colleagues for being imperious. Clinton had a similarly chilly relationship with Douglas Lute, another Army lieutenant general with a graduate degree from Harvard, who also fought with Holbrooke. “She likes the    —   McChrystal, Petraeus, Keane,” one of her aides observes. “Real military guys, not these retired   who go into civilian jobs. ” “There’s no doubt that Hillary Clinton’s more muscular brand of American foreign policy is better matched to 2016 than it was to 2008,” said Jake Sullivan, her top policy adviser at the State Department, who plays the same role in her campaign. It was De cem ber 2015, 53 days before the Iowa caucuses, and Sullivan was sitting down with me in Clinton’s sprawling Brooklyn headquarters to explain how she was shaping her message for a campaign suddenly dominated by concerns about national security. Clinton’s strategy, he said, was twofold: Explain to voters that she had a clear plan for confronting the threat posed by Islamic terrorism, and expose her Republican opponents as utterly lacking in experience or credibility on national security. There were good reasons for Clinton to let her inner hawk fly. After the attacks in Paris and San Bernardino, Calif. Americans’ concern about a major attack on the nation spiked. A   poll taken after Paris showed that a majority, 53 percent, favored sending ground troops to Iraq or Syria, a remarkable shift from the   sentiment that prevailed during most of Obama’s presidency. The Republican candidates were reaching for apocalyptic metaphors to demonstrate their resolve. Ted Cruz threatened to   the Islamic State to test whether desert sand can glow Donald Trump called for the United States to ban all Muslims from entering the country “until we are able to determine and understand this problem and the dangerous threat it poses. ” Yet such spikes in the public appetite for mili tary action tend to be transitory. Three weeks later, the same poll showed an even split, at 49 percent, on whether to deploy troops. Neither Trump nor Cruz favors major new deployments of American soldiers to Iraq and Syria (nor, for that matter, does Clinton). If anything, both are more skeptical than Clinton about intervention and more circumspect than she about maintaining the nation’s   War II military commitments. Trump loudly proclaims his opposition to the Iraq War. He wants the United States to spend less to underwrite NATO and has talked about withdrawing the American security umbrella from Asia, even if that means Japan and South Korea would acquire nuclear weapons to defend themselves. Cruz, unlike Clinton, opposed aiding the Syrian rebels in 2014. He once supported Pentagon budget constraints advocated by his isolationist colleague, Senator Rand Paul of Kentucky. Thus might the gen eral election present voters with an unfamiliar choice: a Democratic hawk versus a Republican reluctant warrior. To thwart the progressive insurgency of Senator Bernie Sanders of Vermont, Clinton carefully calibrated her message during the Democratic primaries to align herself closely with Barack Obama and his racially diverse coalition. But as she pivots to the general election, that balancing act with Obama will become trickier. “There’s going to be a huge amount of interest in the press to ” Sullivan says. “It just so easily can become a sport that distracts from her ability to make an affirmative case. ” In showing her stripes as a prospective commander in chief, Clinton will no doubt draw heavily upon her State Department experience  —   filtering the lessons she learned in Libya, Syria and Iraq into the sinewy worldview she has held since childhood. Last fall, in a series of policy speeches, Clinton began limning distinctions with the president on national security. She said the United States should consider sending more   troops to Iraq than Obama had committed, to help the Iraqis and Kurds fight the Islamic State. She came out in favor of a partial   zone over Syria. And she described the threat posed by ISIS to Americans in starker terms than he did. As is often the case with Clinton and Obama, the differences were less about direction than degree. She wasn’t calling for ground troops in the Middle East, any more than he was. Clinton insisted her plan was not a break with his, merely an “intensification and acceleration” of it. It’s an open question how well Clinton’s hawkish instincts match the country’s mood. Americans are weary of war and remain suspicious of foreign entanglements. And yet, after the retrenchment of the Obama years, there is polling evidence that they are equally dissatisfied with a portrait of their country as a spent force, managing its decline amid a world of rising powers like China, resurgent empires like Vladimir Putin’s Russia and lethal new forces like the Islamic State. If Obama’s minimalist approach was a necessary reaction to the maximalist style of his predecessor, then perhaps what Americans yearn for is something in between  —   the kind of   pragmatism that Clinton has spent a lifetime honing. “The president has made some tough decisions,” says Leon Panetta, who served as Obama’s defense secretary after Bob Gates, and as director of the C. I. A. before David Petraeus. “But it’s been a mixed record, and the concern is, the president defining what America’s role in the world is in the 21st century hasn’t happened. “Hopefully, he’ll do it,” he added, acknowledging the time Obama has left. “Certainly, she would. ”'"}, "time": 1742561623.5589921}