{"duration": 0.10538816452026367, "input_args": {"text": "'Cranberries are a beautiful addition to any dinner plate. Their rich color dresses everything up and adds a touch of complex sweetness. Cranberries are also extremely healthy—they are chockfull of antioxidants and proanthocyanidins (or PACs) that help to prevent the adhesion of certain of bacteria (these anti-adhesion properties inhibit the bacteria associated with E. coli, and potentially those associated with gum disease and stomach ulcers as well). Cranberries are also rich in phytonutrients, giving you an upper hand at combatting various illnesses. Women have long-been using cranberry juices and extract to treat and avoid urinary tract infections.\\nWith Thanksgiving around the corner, you might find yourself with an abundance of cranberries on hand. Resist the urge to make typical cranberry sauce and call it a day–the following recipes show a few exciting ways to change things up. And don’t limit yourself to the holidays! These dishes taste great year round.\\nCranberry Red Wine Relish This recipe is a kind of adult version of the classic cranberry sauce. Tasty and colorful, if you make big batches you can put them in mason jars for beautiful holiday gifts for your friends and neighbors. \\nIngredients:\\n1 1/2 cups white sugar 1 1/4 cups dry red wine ( this is a fancy one I use during the holidays) 12 ounces fresh cranberries, rinsed and sorted 1 cinnamon stick 2 tablespoons orange zest, cut into slivers Directions:\\nCombine sugar and red wine in a medium saucepan. Bring to a boil over medium heat. Add the cranberries, cinnamon stick and orange peel. Reduce heat and simmer, stirring often until most of the cranberries have burst (about 15 minutes). Remove from heat and chill before serving. Cranberry Chutney Again, this is a bit of a more festive take on classic cranberry sauce. Perfect with turkey and other holiday dinners . \\nIngredients:\\n12 ounces (or 1 package) fresh cranberries 1 orange, peeled, tough membrane removed, chopped or 1 small can pineapple tidbits, drained 1/4 cup orange juice 2 tablespoons agave nectar 1 large apple, peeled, cored, chopped 1/4 cup chopped pecans or walnuts 1/2 teaspoon ground ginger 1/2 teaspoon ground cinnamon 1/4 teaspoon cumin Directions:\\nCombine all ingredients in a large saucepan; bring to a boil. Reduce heat; simmer, stirring occasionally, for 5 to 8 minutes, or until cranberries are bursting. Chill until serving time; freeze surplus in small containers. Sweet Wheat Berry Cranberry Salad Wheat berries are a versatile whole grain. Learn more about how to use them here . \\nIngredients:\\nMakes 8 servings\\n2 cups wheat berries 1/2 cup walnuts or pecans, chopped 1/4 cup apples, diced 1/2 cup carrots, shredded 1/2 cup dried cranberries For Dressing:\\n1 tablespoons lemon juice 1 tablespoon orange juice 1 teaspoon honey 2 teaspoons cinnamon salt to taste Directions:\\nFor salad: In a large bowl, mix together all ingredients. For dressing: In a small bowl, whisk together ingredients for dressing. Pour the dressing over the salad and gently toss. Refrigerate the dressed salad to allow the flavors to meld before serving. Serve it cold or heat it up for a breakfast cereal. Cranberry Quinoa with Cilantro The stronger cranberry flavor plus cilantro in this dish is a real compliment to the quinoa, which can be a bit bland. Note that the cranberries used in this recipe are dried. \\nIngredients:\\n1 1/2 cups water 1 cup uncooked quinoa, rinsed 1/2 cup dried cranberries 1/4 cup red bell pepper, chopped 1/4 cup yellow bell pepper, chopped 1 small red onion, finely chopped 1 1/2 teaspoons curry powder 1/4 cup chopped fresh cilantro 1 lime, juiced 1/4 cup toasted sliced almonds 1/2 cup minced carrots Salt and pepper to taste Directions:\\nPour the water into a saucepan and bring to a boil over high heat. Pour in the quinoa, cover with a lid, and continue to simmer over low heat until the water has been absorbed (about 20 minutes). Scrape into a mixing bowl and chill in the refrigerator until cold. Once cold, stir in the red bell pepper, yellow bell pepper, red onion, curry powder, cilantro, lime juice, sliced almonds, carrots, and cranberries. Season to taste with salt and pepper. Chill before serving. Crockpot Cranberry Chicken This is a delicious and easy way to prepare chicken breasts. The cranberries add a welcome change to our regular chicken dinner, and I love using the crockpot to prepare meals during the week. \\nIngredients:\\n4 skinless, boneless chicken breast halves 1 (16 ounce) bottle Catalina salad dressing 12 ounces fresh cranberries 1 envelope onion soup mix Directions:\\nPlace the chicken breasts in the bottom of a slow cooker. Pour the salad dressing, cranberries, and onion soup mix over the chicken. Cook on Low 4 to 6 hours. Pamela Bofferding is a native Texan who now lives with her husband and sons in New York City. She enjoys hiking, traveling, and playing with her dogs.\\nThis information has been made available by Ready Nutrition \\nOriginally published November 19th, 2016 Jalapeno Infused Cranberry Pomegranate Sauce Sweet Wheat Berry Cranberry Salad Warm Drinks for the Chilly Season 8 Fantastic Fresh Fruit Salads 10 Dehydrator Meals for Your Prepper Pantry '"}, "time": 1742564332.301882}