{"duration": 0.0841209888458252, "input_args": {"text": "'NORTH POLE, N. Y.  —   On a snowy shoulder of Whiteface Mountain in the Adirondacks, beyond   signs advertising “North Pole, N. Y. ” and “Rides, Shops, Shows,” several parking attendants pushed a sedan, its tires spinning, into a packed lot. The car’s occupants spilled out, joining other families who   through snowdrifts  —   just about everyone smiling, some tossing snowballs  —   toward the entrance to Santa’s Workshop, a theme park from another era. Inside, a line to Santa’s house snaked toward a   North Pole, where families posed for selfies and a boy in a puffy snowsuit touched his tongue. Some families roasted marshmallows around a fire pit or wandered into the reindeer stable, where the animals were bedded down and out of reach of little hands. A boy raced from stall to stall, stopping in front of an empty one and shouting, “Where’s Donder? Where’s Donder?” (Donder and Dasher, an attendant elf later explained, had been feeling ill so they were recovering in a nearby pasture.) While it appeared to be a   scene, Doug Waterbury, the owner of Santa’s Workshop, said, “It’s a challenge to keep the door open, frankly. ” “We lose money or break even every year,” Mr. Waterbury added. “Attendance is down. It’s hard to get up in the morning to push snow, feed reindeer and then look at all that red ink at the end of the year  —   and it’s not red because of Christmas. ’’ Santa’s Workshop in North Pole, in Wilmington, N. Y. is among the last of the theme parks in the region, outlasting the Land of Makebelieve, Frontier Town, Time Town, Gaslight Village and other Adirondack roadside attractions. Since 1949, Santa’s Workshop, an alpine village scaled for children, has welcomed families along the Whiteface Mountain Veterans Memorial Highway, a scenic road that meanders toward the peak’s   summit. Today, the park’s Technicolor   buildings and   rides are a kitschy throwback that draws dedicated fans fueled by nostalgia, who return with their children or grandchildren to share their childhood experience of seeing Santa and his reindeer. Near the Candy Cane Express train, Carrie McDonald, 41, who lives in Harveys Lake, Pa. and her sister, Erin Richburg, 37, who lives in Philadelphia, watched their children flap arms and legs into snow angels. “We came up in 1984 with our grandparents and have really vivid memories,” Ms. McDonald said. “We’ve made it a tradition to come back. Right now we’re choosing this over Disney. ” Ms. Richburg added, “It’s   and simple. It’s all about Santa. ” Standing by the park’s outdoor amphitheater, where Mary and Joseph trudge to the manger, Corinne Curtis, her husband, Dave, and their children, Jack, Deacon, Kainen and Londyn, who range in age from 8 years old to 16 months, were back for a second year, visiting from their home in Binghamton, N. Y. “The   feeling is what appeals to us,” Ms. Curtis said. And Santa, of course. “He’s a sweet Santa,’’ she said. “He takes the time with them. It’s not like other commercial places. ” But in the 21st century, a nice St. Nick might not be enough to sustain a theme park in a remote part of the state. Santa’s Workshop’s inaccessibility  —   far from metropolitan areas, including five hours from New York City along twisty mountain roads  —   is “part of the mystique of the place,” Mr. Waterbury said. But it has also contributed to its decline. In 1967, the final stretch of Interstate 87  —   through the eastern Adirondacks  —   was completed, punching a direct route from New York City to Montreal. It bypassed communities with    motels and cabin colonies as well as diners and attractions that had flourished in the years after World War II. In the 1940s, when three businessmen, Julian Reiss, Harold Fortune and Arto Monaco, came up with idea of a destination where it was always Christmas, they hadn’t anticipated     roller coasters or parks built around Walt Disney’s characters. (In fact, before Disneyland opened in Anaheim, Calif. in 1955, Walt Disney visited Santa’s Workshop for inspiration and to consult with Mr. Monaco, according to Mr. Waterbury.) The recession of 2008 pummeled the Adirondack travel industry. The unpredictability of the weather has also presented challenges, including Tropical Storm Irene in 2011, which damaged the park. Attendance has dropped steadily since the 1970s, and now the park attracts no more than about 1, 000 people on most days  —   a far cry from the over 14, 000 customers who would show up in the 1950s. But the biggest hurdle for the theme park, Mr. Waterbury said, is the weakening hold that the story of Santa has on children today. In the 1950s “a    might still believe in Santa Claus,” Mr. Waterbury said. “It’s unusual today that a kid over 7 or 8 still believes. There’s an urgency to get families to bring their kids here before they grow away. ” In the lobby of the Jack Jingle puppet theater, where juice glasses, coasters and other memorabilia are displayed, Danielle and Paul Raimondi, from Center Moriches, N. Y. showed their daughters, Isabel, 13, and Sophia, 10, sacks spilling over with 60 years’ worth of letters addressed to Santa Claus. After the girls wandered away, Ms. Raimondi whispered, “A lot of people in our   ’s school were talking about not believing, and we wanted to show her that he still does exist. ” Mr. Waterbury, whose company, Empire Attractions, buys troubled assets, joined Bob Reiss, a son of Julian Reiss, as a   in 2004. A decade later he bought out Mr. Reiss after earning his trust that he was committed to keeping the park’s spirit alive. Mr. Waterbury said he felt an obligation to loyal Santa fans, the community and the park’s history. Mr. Waterbury recently hired a new general manager, John Collins, who has many years of experience in the theme park industry. They’re trying to figure out ways to bolster summertime attendance, the workshop’s most dismal season. “I’m not going to let it go,” said Mr. Waterbury. “There are enough bad things. This place is about what’s good in life. ”'"}, "time": 1742561828.4238005}