{"duration": 0.03405165672302246, "input_args": {"text": "'Home › POLITICS › DON’T LET DEBBIE WASSERMAN SCHULTZ GET AWAY WITH HER ASSAULT ON AMERICAN DEMOCRACY… DON’T LET DEBBIE WASSERMAN SCHULTZ GET AWAY WITH HER ASSAULT ON AMERICAN DEMOCRACY… 0 SHARES \\n[11/1/16] While everyone’s talking about acting DNC chairwoman Donna Brazile’s current scandals, let’s not lose sight of the fact that her predecessor, Debbie Wasserman Schultz, has seemingly gotten away with spearheading and successfully executing a years-long plot to rig the Democratic primaries for her friend, ally, and former employer Hillary Rodham Clinton. \\nAs we’ve discussed before , we know for a fact thanks to a leaked email that Tim Kaine had been promised the vice presidential slot long before it was anywhere close to necessary for Clinton to select a running mate. If you know anything at all about politics, you know people don’t get promised a favor that big unless they’ve given something equally massive in return. It would be hard to think of a political favor greater than being installed into one of the most esteemed positions in American government; it is the most significant thing that a presidential candidate can bestow upon someone from that position. \\nWe also know for a fact that Obama was already a “friend and political ally” of Kaine back in 2011 according to this Washington Post article from that year, which was the year President Barack encouraged his friend Tim to step down from his position as DNC chair and make a run for retiring Democratic muppet Jim Webb’s Senate seat. And according to this Politico article from the very same day, Obama then immediately installed former Clinton campaign co-chair and Hillary attack poodle Debbie Wasserman Schultz to the conveniently-vacated DNC chair, who then went on to orchestrate the rigging of the Democratic primaries for her girlfriend in violation of the Impartiality Clause of the DNC charter. \\nIn doing this, Obama was able to effectively hand-pick a successor to his throne who happens to be married to his Democratic presidential predecessor Bill Clinton. You’re not supposed to be able to do that in a democracy. \\nWe’ve talked about all that before. What I have personally failed to address adequately is the fact that Wasserman Schultz got away with it. She did every single thing she was placed in the DNC chair to do, she got caught, and then all she had to do was say “Oopsie! Looks like I’ll have to resign now!” and just stroll away, grinning like the cat that already ate the canary. Post navigation'"}, "time": 1742562929.340047}