{"duration": 0.2997863292694092, "input_args": {"text": "\"[Photo: Corporate dairy Credit: Gunnar Richter Namenlos.net.] W itnesses to H istory CALEB T. MAUPIN Editor's Note Food, and the related agricultural, policies are complex and tied to both foreign and domestic policies. This is because the United States has been “the breadbasket of the world.” Unlike many nations, the US has remarkable amount of land (and until recently) climate suitable for production of a wide array of both crops and “livestock” (cruel humor to call it that). As Mr. Maupin discusses some of those complexities, it is important to remember that “large” agriculture is primarily corporate, and that is a different world than that of the small farmer. Since the advent of corporate agriculture, the small farmer has been fair game. The organic and clean food revolution saved many small farmers, but corporations are taking that over as well. Further, when we look at farm subsidies, those are also primarily geared towards (and benefit) agri-business.\\nAnother side of this dreadful slide in food production is the closing of food outlets be those (continuously disappearing) small grocers and minute-marts, or the mega-stores of Wal-Mart, Safeway, etc. This creates a growing number of food deserts. These are essentially areas where wholesome, affordable food is available. Most ignored are the rural food deserts. The USDA has an interactive map of U.S. food deserts. Also problematic on the consumer side of the equation are the food subsidy programs. Most in kind (actual food) subsidies are destroyed, fed to livestock, or shipped out of the country EVEN THOUGH WE HAVE A SURFEIT OF HUNGRY PEOPLE TO EAT THEY. The argument being that these surpluses would compete with the third part vendors making a profit. Therefore, we had food stamps, then SNAP (see sidebar). The later being a true insult – particularly if you are in the middle of a food desert. U S Foods Holding Corporation and Sysco, the two top American food distribution giants, are laying off thousands of workers. Wal-Mart is closing stores and terminating employees. As the price of eggs, beef, cheese, and almost all agricultural products have dropped, farmers across the United States are facing financial ruin.\\nThe ongoing glut in agricultural products is not merely the natural cycle of the market at work. Policies of the US federal government are directly linked to the low food prices. While it is clear that the ongoing agricultural surplus is very bad for the US public, the government seems to have other priorities. Broken Promises From Politicians \\nThe agricultural prowess of the United States is known across the planet. The current president of China first visited the United States in 1985. He didn’t come to see the Statue of Liberty, or the Washington Monument. Rather, Xi Jinping visited Iowa in order to study the technology and farming techniques employed by some of the most advanced and efficient farmers in the world . The Holt family dairy. \\nLove for the small farmers is voiced by almost all sectors of US political establishment, and almost always has been. The writings of Thomas Jefferson spoke at length about the “yeoman” and his role in an ideal republic. The left-wing folk singer Pete Seeger sang about how “the farmer is man who feeds them all .” Right-wing Radio host Paul Harvey plucked the heart strings of the American public with his “So God Made a Farmer” speech in 1978 . \\nEach election year, American politicians devote special attention to the Iowa caucuses, the first vote in determining who will be the major parties’ respective nominees. As they travel across the Midwestern agricultural state, the presidential hopefuls routinely make all kinds of speeches championing “the hard working farmers.” \\nWhile politicians are known to make promises to the farmers, and seem to recognize that agriculture is essential to the US economy, the policies of recent years, most of them having bipartisan support, have been anything but beneficial to those who work the land. In the current presidential race, Iowa is hotly contested, with Trump and Clinton very close in the polls. The farm glut, spawned by federal policies, is undoubtedly a big factor . \\nIn the first 8 months of 2016, 43 million gallons of milk were poured out due to the glut. According to the Wall Street Journal: “Farmers across the US are pouring out tens of millions of gallons of milk amid massive over glut that has reduced prices and filled warehouses with cheese .” \\nMeanwhile, another WSJ article reports: “Cattle and hog prices hover near the lowest levels in years as U.S. meat packers produce the largest volume of meat in history .” Between July of 2016 and July of 2017, the price of milk has decreased by 11%. The price of eggs has decreased by 40% . SNAP was not implemented by Obama. It replaced food stamps in 2008 and the acronym was not accidental. It redefined food assistance to both “supplemental” and short term . The fact that for many the supplement is the mainstay of their family’s diet is apparently lost on the conservative(ly) compassionate republicons. The overproduction and under-consumption of agricultural products can be directly linked to federal policies. Throughout his administration, Barack Obama has repeatedly cut the Supplemental Nutrition Assistance Program (SNAP) and reduced the amount of food that low income families are able to purchase. The cutting of this federal program directly takes food from the mouths of low-income Americans. Despite the fact that according to the US Department of Agriculture, 13% of American households are now food insecure, the cuts have continued, and hunger is rising among America’s poor .\\nIn addition to the obvious impact on low-income Americans, the cuts in food stamps have also cut into food sales. Food producing corporations and small farmers have seen a decrease in their sales. Wal-Mart has laid off thousands of workers and closed thousands of stores. These losses and layoffs can be linked directly to the SNAP cuts . \\nCongress has recently discussed a plan that would eventually take $150 billion out of the federal food assistance program, a move that would undoubtedly push a lot of food producers, retail employees, and meat packers over the edge, along with many others . \\nThe reductions in food assistance are not the only factor. The economic sanctions against Russia have played a dramatic role in creating the current food glut. The collapse and breaking up of the Soviet Union’s collective farm system during the Yeltsin era of the 1990s dramatically reduced Russia’s domestic food production. This opened up new markets for American farmers, who greatly increased their exports to the former USSR. \\nHowever, the new sanctions imposed in 2014, which restrict US and EU agricultural sales to Russia, have dramatically changed the landscape of the global food market. American farmers have been deprived of 143.5 million potential customers due to the ban on selling to those living in the Russian Federation. Austerity & Fascism Leave Farmers Behind And why is it that “austerity” is always aimed at those who have the least first and most harshly? Why is food assistance to low income families being cut? The claim is that the US federal budget is too large, and that hard economic times mandate austerity. However, the United States still has the largest military budget on the planet. When it comes time to reduce spending, rather than cutting the amount of money spent on tanks, bombs, and drones, the politicians have opted to cut into the nutrition of low-income Americans, along with the livelihoods of farmers and agricultural workers. The thousands of military bases around the world, along with the billions given in foreign military aid to countries like Israel, all seem be far more important to US leaders.\\nAnd why has the US drastically restricted the exporting agricultural products to Russia? The sanctions were enacted in 2014, in response to the Ukraine crisis. The elected President of Ukraine, Victor Yanukovich, was toppled in orgy of street violence. The new government, with a base of support only in the western regions of the country, has within its ranks many open admirers of Adolf Hitler, and is very hostile to Russia. \\nSince 2014, the people of Eastern Ukraine have taken up arms to resist the new regime. The people in the region of Crimea voted to become apart of the Russian Federation, whose military they had been hosting since the collapse of the USSR. Sanctions were imposed on Russia and continue, based on allegations that Russia is supporting the resistance of people in the Eastern regions against the new, pro-Western regime. US leaders tell us the sanctions are intended to punish Russia for “meddling” in Ukraine. \\nSince the passing of the sanctions, Russia has revived its own domestic agricultural programs. Small farmers across Russia are producing beef, wheat, and other products no longer sold to them by the US and the EU. Russian agriculture has experienced a boom since 2014, and Russian President Vladimir Putin is even more popular than prior to the crisis . \\nThe decision of US leaders to wage economic warfare against Russia in support of a Ukrainian government that contains many with fascist sympathies, while at the same time cutting assistance to low-income American families, is contrary to values often displayed throughout American history. Both Lincoln and Roosevelt saw prosperity for the agricultural heartland of the United States and the millions who lived in it as vitally important for the entire country. These two most beloved Presidents in US history both worked closely in alliance with small farmers, often in opposition to Wall Street bankers with different interests. \\nThe rallying cry of the Republican Party in its early years, was “Free Land, Free Labor, Free Men!” The “Free Soilers,” farmers who wanted to halt the expansion of slavery in new US territories were an essential part of it. While slavery found support in the financial districts of London and New York, the small farmers had a material interest in ending the barbaric practice, and anti-slavery militias appeared in Iowa and Kansas years before the Civil War broke out. \\nIt was a broad coalition of small farmers, religious abolitionists, and organized labor that eventually put Abraham Lincoln into the White House where he was forced to battle the slaveholders. The process that unfolded recreated the country, in what is widely called “The Second American Revolution.” “An American Government Cannot Allow Americans To Starve” \\nThe programs that preceded the currently existing Supplemental Nutritional Assistance Program (SNAP) were the brainchild of Secretary of Agriculture Henry Wallace, who eventually became the Vice President. When the first “food stamps” were issued in 1939, the director of the program, Milo Perkins described it this way: “We got a picture of a gorge, with farm surpluses on one cliff and under-nourished city folks with outstretched hands on the other. We set out to find a practical way to build a bridge across that chasm .” \\nWhile Roosevelt was universally hated by Wall Street bankers, he was very popular with organized labor, artists and musicians, as well as small farmers. As the unemployment councils and labor unions fought for a better life across the country, Roosevelt aligned himself with the mass movement in the streets. Essential in Roosevelt’s progressive coalition was the US Communist Party, an organization that sought to build a “Workers and Farmer’s Government.” When big business objected to Roosevelt’s dramatic economic reforms, he defended them by saying “an American government cannot allow Americans to s tarve .” \\nRoosevelt later aligned with the Russian people in order to defeat Adolf Hitler. FDR’s opposition to fascism and his policies of feeding of hungry Americans while subsidizing farmers were not isolated from each other. They corresponded with his overall view of the world, expressed in 1944: “We cannot be content, no matter how high that general standard of living may be, if some fraction of our people—whether it be one-third or one-fifth or one-tenth- is ill-fed, ill-clothed, ill housed, and insecure…. We have come to a clear realization of the fact that true individual freedom cannot exist without economic security and independence…. People who are hungry and out of a job are the stuff of which dictatorships are made .” \\nIn 2016, things are very different. While banks were bailed out without hesitation during the 2008 financial crisis, financial assistance to low income Americans continues to be cut. Wall Street and London see the Eurasian Bloc of Russia and China as a rising competitor to their financial hegemony. The wealthy financial elite largely support sanctions and further isolation of both countries despite whatever disastrous impact on American farmers, agricultural workers, and food distributors. \\nChildren across the United States are hungry, as 13% of households are food insecure, according to the US Department of Agriculture. Farm workers and those who work for food distributors and supermarkets are losing their jobs. Gallons of milk are at this moment being dumped out in hopes of raising the prices, while food warehouses sit filled with rotting, unsold cheese. \\nMeanwhile, US and NATO forces are increasing their presence in Eastern Europe, threatening Russia. As agricultural sanctions on Russia continue, weapons and training are being provided to a Ukrainian military that is known to contain a number fascist sympathizers, including the infamous Azov Battalion. \\nAs discontent rises in the United States, it is largely centered in the agricultural and de-industrialized mid-western heartland. It is clear that many Americans desperately want something to change. A government that prioritizes fascistic elements in Ukraine over farmers in Iowa, Wisconsin, and Ohio, is clearly out of touch. Caleb Maupin Is an American journalist and political analyst. Tasnim News Agency described him as “a native of Ohio who has campaigned against war and the U.S. financial system.” His political activism began while attending Baldwin-Wallace College in Ohio. In 2010, he video recorded a confrontation between Collinwood High School students who walked out to protest teacher layoffs and the police. His video footage resulted in one of the students being acquitted in juvenile court. He was a figure within the Occupy Wall Street protests in New York City. Maupin writes on American foreign policy and other social issues. Maupin is featured as a Distinguished Collaborator with The Greanville Post. READ MORE ABOUT CALEB MAUPIN HERE. Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?\""}, "time": 1742564373.9631956}