{"duration": 0.05103182792663574, "input_args": {"text": "'Jerry Seinfeld has lent his support to Kathy Griffin after the comedian came under fire last week for a photo in which she posed with a fake, bloodied head meant to resemble President Donald Trump, saying in an interview he believes Griffin simply made a “bad joke. ”[“Yes, it was a bad joke. Every comedian tells bad jokes,” the    Seinfeld star told People magazine Tuesday.  “We all do it. That’s how we find the good jokes. So someone told a bad joke  —   so what, I don’t understand the big deal,” he added. Griffin sparked a firestorm last week when a photo taken during a shoot with L. A.  photographer Tyler Shields was published by TMZ. The photo showed the    My Life on the   star holding a decapitated prosthetic head meant to resemble that of the president in her outstretched arm. Griffin quickly apologized after the viral photo drew strong condemnation from both sides of the political aisle, writing in a Twitter message that she had gone “too far. ” In his own response, Trump called the photo “sick,” while First Lady Melania Trump described it as “very disturbing” and “simply wrong. ” In a press conference Friday, Griffin fought back tears as she accused the Trump family of bullying her and attempting to ruin her career. The comedian was fired from her role on CNN’s New Year’s Eve Live coverage in the wake of the controversy, while at least five venues on her   comedy tour scrapped her scheduled performances. The Secret Service also opened an investigation into the circumstances surrounding the photo shoot. Seinfeld wasn’t the only celebrity to come to Griffin’s defense in a speech at the premiere of his new Showtime series last week, actor Jim Carrey advised Griffin to double down on the photo by holding up Trump’s “severed leg,” adding that comics represent the “last line of defense” in a a   environment. Actor and Saturday Night Live Trump impersonator Alec Baldwin also reached out to Griffin on social media following the backlash, and advised her to ignore her critics.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563766.1502593}