{"duration": 0.07038497924804688, "input_args": {"text": "'  Posted at 11:03   \\nMichael Moore was super excited to learn that Republicans were driving traffic to his film , “Trumpland,” by passing around on social media a four-minute clip, even though he claims it was doctored. That’s not cool — if anyone’s going to doctor the footage in a Michael Moore movie, its going to be Michael Moore. \\nObviously Moore’s not a Donald Trump fan, and like many other liberals this weekend, he’s not an Anthony Weiner fan. Setting aside Judicial Watch’s lawsuit against the State Department, Hillary Clinton almost looked to be in the clear a few months back, but now her email shenanigans have returned to the front pages, all because of Weiner’s compulsion to send vulgar selfies online. Unbelievable that once again Hillary has to suffer the abuse of men & their dickish behavior. Bubba, Weiner, Trump, Newt, Comey. Sick of it. \\n— Michael Moore (@MMFlint) October 29, 2016 \\nWhat did Bill Clinton do that was so wrong? Hillary long ago established that he was the victim of a vast right-wing conspiracy. And Weiner? Sure, be angry at him for the way he’s treated his wife and the women he’s sexted, but there would be no sensitive emails on his laptop if Hillary and company had simply used the secure government email accounts provided to them. \\nMoore was just getting started on his misandrist rant, and when he’s on a roll, it’s best to step away until he’s finished it. The day can\\'t come soon enough when women will take charge. Public policy will not be decided by dick pix, Tic Tacs, grab-assers or the GOP. \\n— Michael Moore (@MMFlint) October 29, 2016 No women ever invented an atomic bomb, built a smoke stack, initiated a Holocaust, melted the polar ice caps or organized a school shooting. \\n— Michael Moore (@MMFlint) October 29, 2016 @MMFlint wowwww? Women can\\'t do ANYTHING…… \\n— Nitro Rad (@NitroRad) October 29, 2016 \\nWhat about all those soccer moms tooling around in minivans and SUVs? The ones manufactured in Michigan, by union workers, in factories with smokestacks? And don’t be so quick to count out women   atomic bomb, either. @MMFlint You might to do a little reading on that atom bomb thingie. You could not be more wrong. \\n— Terry O\\' (@IrishTea1) October 29, 2016 @MMFlint lots of women were on the Manhattan Project. You just demeaned them and belittled their efforts to support a warmonger… \\n— Charlie Reed (@CharlieReed2004) October 29, 2016 RT @MMFlint \" No women ever invented an atomic bomb\" \\nLeona Woods among others worked on the Manhattan Project. https://t.co/fay4GNLAzy'"}, "time": 1742628323.0936186}