{"duration": 0.04400777816772461, "input_args": {"text": "'Now Hillary Makes Conspiracy Theory Credible: 50% Believe   28, 2016 \\nHalf Of Americans Believe 9/11 Conspiracy Theories … “The United States is a strongly conspiratorial society.” … A majority of Americans believe that the government is concealing information about the 9/11 attacks, one new survey suggests. And that’s not the only conspiracy theory believed by a wide swath of Americans: Around 40 percent believe the government is hiding information about aliens, the John F. Kennedy assassination and global warming. – The Huffington Post \\nBefore, those who believed in 9/11 conspiracy theories hovered around 20-30 percent according to the mainstream media. Now it’s up to 50 percent, according to this article. \\nHell, it’s probably more like 60-70 percent anyway. There is perhaps a hard core of 30 percent of people living in the US who will likely never acknowledge anything wrong with the system or people in power. \\nBut for most citizens, we’ve long suggested the current election is destroying the credibility of the ruling classes and their facilities. \\nWhatever in government that was supposed to be credible, from the IRS, to the FBI, to the Justice Dept., Congress and the presidency itself, has been visibly damaged by Hillary’s election campaign. \\nYou’d have to be virtually blind – or a staunch partisan of a mythical “USA”– not to notice that the Democratic front-runner has committed actions for which anyone else would have been significantly punished. \\nAnd not just Hillary of course but those surrounding her including Bill Clinton and the Foundation that allows them to trade political favors for cash. \\nThen there’s the mainstream media. The media has investigated little or none of the malfeasance and worse (murders?) surrounding the Clintons, and thus newspapers, magazines and TV, already deprived of viewers and ad revenue, have been further damaged by an obvious, ongoing lack of credibility. \\nMore: \\nConspiracy theories about the JFK assassination abound, and scientists say these ideas have become embedded in the very culture surrounding his death, with heaps of TV shows, books and movies on them. \\n“We found clear evidence that the United States is a strongly conspiratorial society,” study lead author Christopher Bader, a sociologist at Chapman University in California, said in a statement. \\nIn order to denigrate suspicion of the government, the study suggests that people’s views regarding conspiracies have to do with their own emotional makeup. In other words, “paranoid” people believe in “conspiracies.” \\nThis canard worked better when the number of those voicing conspiracy theories was in the single digits, according to surveys. When half or more than half of the public begins to believe in them, something else is going on. \\nNeither the article nor the study (presumably) acknowledges that the CIA came up with the idea of calling people “conspiracy theorists” if they advance theories that the US government is corrupt and secretly tyrannical. \\nThe conduct of this past campaign and the Clinton’s evident criminality has reinforced all that is wrong with the US in the views of many and, additionally, has made it clear that even the deepest suspicions of how the US operates are justified. \\nWe can come away with two realizations from this. \\nThe first is that despite Hillary’s possible election, the US as a valid and valuable entity is shattered in the eyes of many. This is actually a good development in our view given that the US (and its British controllers) has not been positive for freedom or peace in the world at least since the end of the Civil War. \\nThe second conclusion, which is not a popular one but which we have voiced before, is that the disaffection of the American public was SUPPOSED to be heightened by the Hillary campaign. \\nThe idea here is that chaos and paranoia is supposed to be endlessly increased until the US, like other nation-states, virtually shatters and more aggressive globalism can be introduced in the wake of the disintegration. \\nWestern nation-states currently have strong cultures. These cultures need to be torn down if true globalization is to be introduced. \\nThe banking elites of this world, mostly located in the City of London, are determined to introduce this chaos, it seems. In Europe chaos is mounting thanks to the introduction of the artificial “immigration crisis.” \\nIn the US, Hillary has served in the place of immigration, cracking the US culture as thoroughly as millions of young Muslim males. Next on the agenda? Possible economic collapse and “world-war” style military activities. \\nConclusion: Yes, it sounds grim … and even conspiratorial. But there is much you can do to secure your safety and prosperity – and that of your family’s and even your community’s. You have to realize the civil society you believe in is vanishing (or never existed). And you have to act.'"}, "time": 1742628599.4000354}