{"duration": 0.12354779243469238, "input_args": {"text": "'It’s raining in California. Again. A storm system hitting north and central California on Monday and Tuesday will deliver two to three inches of rain to the Central Valley, and up to 10 inches of rain to the mountains, said Eric Kurth, a meteorologist with the National Weather Service in Sacramento. The service has issued a flood warning through Wednesday across most of the Sacramento River Valley and the surrounding areas. It is the latest in a string of storms this winter that have dropped an unusually high amount of water on the state, which had spent more than five years under dire drought conditions. “On its own, this system wouldn’t be much of a concern,” Mr. Kurth said. “But we have elevated stream levels, river levels. We are seeing some of the rivers up at flood levels. ” Last week, more than 180, 000 residents were ordered to evacuate from below the Oroville Dam when a damaged emergency spillway and a swollen reservoir raised concerns about a collapse. Crews rushed to fix the damaged embankment at the dam, 70 miles north of Sacramento, and to prepare it for more rain. On Saturday, a storm with winds near hurricane strength swept through Southern California, killing at least two people, flooding roads and triggering mudslides. A sinkhole in Studio City swallowed a car. Interstate 5 in the central Sacramento Valley was flooded briefly over the weekend. “That was an area that typically we don’t see much flooding,” Mr. Kurth said. “But things are so saturated. ” Across the northern part of the state, swollen rivers were lapping over their banks and reservoirs were close to flood stage. The National Weather Service reported nearly a dozen rivers were at their flood stage on Sunday. The San Joaquin River was at “danger stage” on Sunday and nearing the top of its levees at a measuring station near Vernalis, Tim Daly, a spokesman with San Joaquin County Office of Emergency Services, told The Associated Press. In Colusa County, about 60 miles north of Sacramento, Jim Saso, the assistant sheriff, told The A. P. that he was warning residents to be prepared for evacuation. “We’re telling those people to keep a bag close by and get ready to leave again,” he said. The Don Pedro Reservoir in Tuolumne County, southeast of Sacramento, was at 826 feet on Sunday  —   four feet below its flood level, CBS 13 reported. Authorities were preparing to release water through its spillway as early as Monday afternoon, the first time in 20 years that would have happened, CBS 13 said. The ultimate effect of the storm depends on how much of the moisture lands as rain in the valleys as opposed to snow higher up in the mountains, Mr. Kurth said. “That set of storms previously that brought a lot of trouble, the issues with the Oroville Dam, that system was very warm,” he said. This storm is not quite as warm, meaning that some of the higher amounts of moisture could be in the form of snow in the mountains and would not affect the rivers immediately. “If we get water locked up in the form of snowpack and that stays through the spring, we get a gradual water flow into the spring months and maybe into the summer,” he said. “If we get it all in the form of rain, maybe like those other storms, it’s all running down into the streams and maybe into the rivers causing some flooding. ” “We do need water. Water is good. But it’s better in the form of snow,” he said. This latest storm is what’s called an “atmospheric river”  —   a weather event more commonly known as the “pineapple express. ” It is moist tropical air from the central Pacific trapped in a band between different pressure systems, Mr. Kurth said. When it hits California, it unleashes a high amount of rain. “It’s like a fire hose of moisture when we get these atmospheric rivers,” he said. An atmospheric river is not especially unusual. “We usually get a couple every year,” he said. “On average we get maybe three to five or so. This year we’ve gotten quite a few more. ” How many more? “More than a dozen prior to this one,” he said. This storm also brings “pretty strong winds,” which could potentially top 60 miles an hour on Monday evening, Mr. Kurth said. The wind, when combined with the oversaturated ground, means that trees tend to topple more frequently  —   and when they do, they often take powers lines with them. Or they fall across highways, snarling traffic in regions that were spared flooding. ”I’ve seen more of that this year than I’ve ever seen by far,” Mr. Kurth said. The saturation also leaves areas vulnerable to mudslides. “Major arteries over the Sierras have been blocked for long periods of time, and I expect we’ll see much more of that today, too,” he said. California has been in a drought for more than five years, resulting in mandatory conservation. Reservoirs were parched, and the snowpack that helps feed the state’s rivers and streams with its spring thaw had been nearly nonexistent at times. But this year has brought a tremendous amount of rain and snow, and that has helped. “You would be   to say we have a surface water drought right now,” Jay Lund, a water expert at the University of California, Davis, told The New York Times last week. Aided by the recent storms, the snowpack for the central Sierra mountains was at 182 percent of its normal level on Sunday. And the United States Drought Monitor reported that nearly 44 percent of the state was free of a drought warning last week, compared to less than 1 percent at this time a year ago. But that still leaves more than 20 million people that it estimates are living in an area affected by drought, the monitor reported. The brunt of this storm will hit on Monday and Tuesday, Mr. Kurth said, with showers continuing on Wednesday. Thursday will be “relatively dry,” he said, but warned of another potential storm arriving on Friday or Saturday. “We’re not going to see a real   period. Maybe just a day or two,” he said.'"}, "time": 1742564383.468189}