{"duration": 0.08541655540466309, "input_args": {"text": "'At last count, over 50 Democrats have announced they will be skipping   Donald Trump’s inauguration on Friday, January 20. [The majority of them are from the deep blue state of California.  According to Roll Call, Democrats who are planning to skip Trump’s historic   ceremony include Reps. John Lewis ( ) Steve Cohen ( ) Jerrold Nadler ( ) Don Beyer ( ) Mark Takano ( ) Yvette Clarke ( ) Ted Liu ( ) Raul Grijalva ( ) John Conyers ( ) Mark Desaulnier ( ) Rep. Nydia Velazquez ( ) Kurt Schrader ( ) Pramila Jayapal ( ) William Lacy Clay ( ) Barbara Lee ( ) Jos Serrano ( ) Judy Chu ( ) Luis Gutierrez ( ) Jared Huffman ( ) Katherine Clark ( ) Earl Blumenauer ( ) Karen Bass ( ) Keith Ellison ( ) Adriano Espaillat ( ) Mark Pocan ( ) Maxine Waters ( ) Marcia Fudge ( ) Al Green ( ) Lucille   ( ) Bonnie Watson Coleman ( ) Anthony Brown ( ) Chellie Pingree ( ) John Yarmouth ( ) Dwight Evans ( ) Zoe Lofgren ( ) Grace Napolitano ( ) Raul Ruiz ( ) Adam Smith ( ) Darren Sotto ( ) Ruben Gallego ( ) G. K. Butterfield ( ) Joaquin Castro ( ) Tony Cardenas ( ) Mike Doyle ( ) Carol   ( ) Donald M. Payne ( ) Alma Adams ( . C.) Brendan F. Boyle ( ) Robert A. Brady ( ) Frederica Wilson ( ) Jerry McNerney ( ) and Peter A. DeFazio ( ). Although no Democratic senators have indicated they will be missing the inauguration, CNN has suggested that Senate Minority Leader Chuck Schumer ( ) has left the door open for those deciding to do so. Schumer said, “I think each person has to make the choice on their own, but I don’t begrudge those who have said they’re boycotting. Each person can make his or her own decision. ” Dozens of Democratic lawmakers announced they would not attend the inauguration after legendary civil rights activist Rep. John Lewis stated that he does not believe Trump is a “legitimate president,” that he is “wrong” for the nation, and that this is the first inauguration at which he will not be present. However, soon after he made his comment, a report surfaced that Lewis had skipped George W. Bush’s inauguration because he did not believe Bush was the true elected president, thus it would be hypocritical for him to attend. Trump tweeted, “John Lewis said about my inauguration, ‘It will be the first one that I’ve missed.’ WRONG (or lie)! He boycotted Bush 43 also because he thought it would be hypocritical to attend Bush’s    …    . he doesn’t believe Bush is the true elected president.’ Sound familiar!” John Lewis said about my inauguration, ”It will be the first one that I’ve missed.” WRONG (or lie)! He boycotted Bush 43 also because he  …      —   Donald J. Trump (@realDonaldTrump) January 17, 2017,  ”thought it would be hypocritical to attend Bush’s    …    . he doesn’t believe Bush is the true elected president.” Sound familiar! WP,  —   Donald J. Trump (@realDonaldTrump) January 17, 2017,  New Hampshire Democrat Rep. Carol   noted that instead of attending the inauguration she’ll go to religious services to “pray for all of our leaders and people. ”   represents a congressional district that Trump won. In fact, Trump won more votes than   did.   received 162, 080 votes in her district,  . Trump received 179, 259 in the same district. Jeanie Forrester, who is running for chair of the New Hampshire Republican Party, sent out a tweet pointing this out: . @realDonaldTrump won   district in Nov. Received more votes than @TeamSheaPorter https:  .  #nhpolitics,  —   Jeanie Forrester (@JeanieForrester) January 17, 2017,  Forrester, who is running uncontested and has received the backing of Gov. Chris Sununu ( ) will face elections on Jan. 28. In response to the Democrats skipping the inauguration, Rep. Sean Duffy ( ) said, “Put your big boy pants on. ” He added, “and let’s start working together. ” ”Put your big boy pants on”  —   @RepSeanDuffy believes lawmakers should be attending Trump’s inauguration https:  .   —   New Day (@NewDay) January 17, 2017,  Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz'"}, "time": 1742564602.6120195}