{"duration": 0.09514617919921875, "input_args": {"text": "'Reprinted from Spectator.org . \\nTom Hayden, the Vietnam War protester and SDS founder, died this past weekend at age 76. \\nHayden’s journey was in many ways tragic. Born December 1939 in the Detroit suburbs, he was not, unlike many radical leaders, a red-diaper baby. His parents were Irish Catholics who named him after St. Thomas Aquinas and sent him to Catholic school. His father was a Marine who worked for Chrysler, and an abusive drunk. Hayden’s parents had a rocky marriage and divorced when he was a boy, which affected him terribly. Hayden’s friend and ex-radical, David Horowitz, observed that Hayden harbored what Irving Howe once described as an “obscure personal rage,” possibly from his estrangement from his father. “Tom was indeed an angry man,” wrote Horowitz, “who seemed in perpetual search of enemies.” \\nHayden channeled that anger into a group that did much damage to America, and was the antithesis of anything that Thomas Aquinas would have ever imagined: SDS, Students for a Democratic Society. \\nHayden will be forever young and forever a hippie in the memories of many Americans, the snarling activist who married “Hanoi Jane” Fonda and literally wrote the script for SDS. Hayden wrote SDS’s manifesto, its founding Port Huron Statement, which Hayden’s cream-puff obituary in the Washington Post generously referred to as “an expansive utopian manifesto that extolled ‘participatory democracy’ as an antidote to the complacency and conformity of the Eisenhower decade.” \\nRight. \\nHayden’s odd expressions of “participatory democracy” included another writing he scribbled: an infamous June 4, 1968 letter wishing “Good fortune!” and “Victory!” to the North Vietnamese colonels who were killing American boys in Southeast Asia — using the same kind of artillery that Hayden’s sweetheart Jane posed beside in her stint as a Viet Cong cover-girl. That was just one of countless disturbing actions by Tom Hayden at the time, all of which today’s leftists merrily sweep under the rug as they uphold him as a crusader for civil rights and (of course) “social justice.” \\nBut not etched in our memory was what might have been Tom Hayden’s swan song long after his and his wife’s cheerleading for the Viet Cong: namely, the document that he wrote for our President of Fundamental Transformation. Few know this, but Hayden was a founder of another group of destructive forces, a group called Progressives for Obama. \\nThe group’s members came together in 2008, coalescing around the only Democratic presidential nominee in their lifetimes who was far-left enough for them to support. They constituted a Who’s Who of the ’60s SDS crowd. Among the nearly 100 formal “signers” to Progressives for Obama were Mark Rudd, Carl Davidson, Jane Fonda, Thorne Dreyer, Daniel Ellsberg, Richard Flacks, John McAuliff, Jay Schaffner, and more. Columbia University was naturally well-represented, if not through the likes of Rudd, who shut down the campus in 1968, then through current faculty such as Todd Gitlin, a former SDS president who today is professor of journalism, sociology, and chair of Columbia’s doctoral program in communications. \\nWhereas the likes of Obama friends Bill Ayers and Bernardine Dohrn were thrust into the national spotlight in 2008 by conservatives like Glenn Beck and Sean Hannity, Progressives for Obama flew under the radar, largely unnoticed even by the right. \\nAppropriately, spearheading Progressives for Obama was the man who had spearheaded SDS. Tom Hayden was one of the four “initiators” of Progressives for Obama, along with Barbara Ehrenreich, Bill Fletcher, Jr., and Danny Glover. \\nIt is no exaggeration to say that the signers list of Progressives for Obama resembled the roster of SDS-ers called to testify before Congress in December 1969 for their subversive activities. Aside from the likes of Hayden, Rudd, and Davidson, other SDS-ers among Progressives for Obama were Bob Pardun, who was SDS education secretary from 1966-67, and Paul Buhle, a professor who has recently sought to revive SDS. \\nAmong these names from the insane ’60s, all were fired up in 2008 over the unique opportunity that a fellow far-left radical, one Barack Obama, offered. They saw Obama as a golden chance, a once-in-a-lifetime moment, and they got it on November 4, 2008. Obama won the day, and they at last won the day, too. \\nAnd therein, among the Progressives for Obama, the testimony of leader Tom Hayden was especially revealing. \\nUnderstand that after his early life establishing SDS, meeting with and expressing “Good fortune!” and “Victory!” to the Viet Cong, and vigorously protesting the American system, Hayden went into politics, professional activism, and education. Like his erstwhile SDS brethren, Hayden grasped the power of higher education (which they have pervaded), and served as a professor at Pitzer College and also at Obama’s alma mater, Occidental College. \\nLike Mark Rudd, like Bill Ayers, like Bernardine Dohrn (all of them now in higher education), Hayden had come to view a quick “revolution” of the system as too daunting, if not impossible. He had become much more patient, instead advocating a “progressive” evolution of slower, measured change . By 2008, he was seeking to advance the “progressive” cause within the established, mainstream Democratic Party. \\nOf course, Hayden once helped blow up the Democratic Party’s national convention in 1968. No matter: the party of 2008 was different and warmly accepted him. \\nHayden was ecstatic over Barack Obama’s presidential campaign. He jumped in with both feet, looking to assist wherever he could, with a rush of enthusiasm not seen since his days undermining America in Vietnam. Not one to tinker around, Hayden got to work on a formal organization and unifying statement, as he had done for SDS — once again there at the creation. The man who drafted SDS’s pivotal Port Huron statement got to work drafting mission statements for Progressives for Obama. \\nDuring the 2008 campaign, a touched Hayden was moved to verse over the emergence of Obama. In one article, titled, “Obama and the Open and Unexpected Future,” written for CommonDreams.org, self-described as a website for “Breaking News & Views for the Progressive Community,” Hayden mused: \\nI didn’t see him coming. When I read of the young state senator with a background in community organizing who wanted to be president, I was at least sentient enough to be interested. When I read Dreams of My Father [sic], I was taken aback by its depth. This young man apparently gave his first public speech, against South African apartheid, at an Occidental College rally organized by Students for Economic Democracy, the student branch of the Campaign for Economic Democracy which I chaired in 1979-82. The buds of curiosity quickened. \\nHayden saw in Obama a long-awaited vehicle for “economic democracy,” an instrument to channel an equal distribution of wealth — “economic justice,” or “redistributive change,” as Obama himself had once put it. Hayden wished that, “Win or lose, the Obama movement will shape progressive politics… for a generation to come.” He also hoped that that progressive movement likewise “might transform” Obama as well. Both could reinforce and shape one another. \\nHayden wrote that in June 2008. When Obama was elected later the following November, Hayden was beside himself with joy, surely shocked that the American electorate had finally voted for a president that Tom Hayden saw as his kind of president. Once upon a time, traditional Democrats like Hayden’s parents had shaken their heads in disgust at what Tom and his pals did to their party’s convention in Chicago in 1968, at what they did during the Days of Rage the next year, at what they did at Columbia during the student strike, and on and on. But now, by 2008, the Democratic Party was theirs. It belonged to the ’60s kiddies. \\nThe former SDS founder became particularly vocal in his praise for Obama once the election was over. During the election, the goal was to organize, raise money, but not speak too loudly, out of fear of driving away the moderates and remaining traditional Democrat moms and pops who had worked in the mines and the mills, who joined unions, who “clinged” to their God and guns, who prayed rosaries and filled churches, who were pro-life and anti-gay marriage. With the presidency now secured, Hayden could open up. Joined by his former comrades at the take-no-prisoners website of Progressives for Obama, he began regularly sounding off against Obama’s critics — those opposing “single payer” or the “public option” in “healthcare reform,” or government “management” of General Motors — with the subtlety of a howitzer. \\nWith the presidency won, Hayden and his allies were free to express themselves, to demonize health-insurance companies, the financial-services industry, AIG, the Big Three automakers, or whatever other capitalist “reptile” (Lenin’s phrase) stood in the way of President Obama’s desire for “reform” and mandate for “change.” \\nIn the two-term presidency of fundamental transformation under Obama, Hayden and friends achieved many of their common dreams. \\nBy this election cycle, in 2016, Tom Hayden must have been mesmerized by the revolution he and his fellow radicals had pulled off in the Democratic Party. \\nAlas, it was fitting that Tom Hayden became seriously ill (his final stand) during a turn for the worse at the Democratic National Convention in Philadelphia this past summer, where he was striving to ensure that the Democratic Party continue along the radical path of fundamental transformation that he and his allies had been unable to achieve via SDS and the Weather Underground. That path, in the hands of Hillary Clinton, is assured. \\nToday, at long last, for Tom Hayden and friends, the new Democratic Party and the new America is theirs. He can rest in peace, assured that his mission is finally being accomplished.'"}, "time": 1742628485.296272}