{"duration": 0.20726418495178223, "input_args": {"text": "'CHARLOTTE, N. C.  —   The fatal police shooting of Keith Lamont Scott here on Tuesday afternoon has sparked outrage and concern, and set off, once again, a national conversation about the treatment of minorities by the police. The details of the case have also been a source of intense debate. Here are some questions that readers have asked reporters at The New York Times since Mr. Scott’s death. Why did police officers confront Mr. Scott? Two officers with the   Police Department determined that Mr. Scott, 43, was a potential threat to public safety because they saw him with two items: what they believed was a marijuana cigarette and a gun, according to a statement released on Saturday by the department. The plainclothes officers, who had been near Mr. Scott’s home to serve a warrant on another person, first noticed Mr. Scott when he parked his S. U. V. next to their unmarked police vehicle, which was in his apartment complex in Charlotte’s University City neighborhood. The department said in a statement that its officers initially saw Mr. Scott “rolling what they believed to be a marijuana ‘blunt,’” but ignored the behavior and went about their business. Later, one of the officers, Brentley Vinson, 26, said he saw Mr. Scott “hold a gun up,” the statement said. (A separate statement issued by the city on Tuesday said that Mr. Scott “exited the vehicle armed with a firearm,” and that officers approached him after he got back inside his white S. U. V.) After seeing the gun, the authorities said on Saturday, the officers decided to approach Mr. Scott, but they first left the area to don safety vests that identified them as the police. They returned to the vicinity of his S. U. V. and “again” saw Mr. Scott with a gun. What do the police say about why Officer Vinson fired upon Mr. Scott? Body and dashboard camera footage released on Saturday provided no clear evidence that Mr. Scott had a gun. In the video, Mr. Scott’s arms were at his sides and he was backing away from his vehicle when he was shot. In its statement on Saturday, the department said the officers gave “clear, loud and repeated verbal commands” to Mr. Scott that he should drop his handgun. When Mr. Scott did not, the department said, Officer Vinson “perceived Mr. Scott’s actions and movements as an imminent physical threat to himself and the other officers” and opened fire. The State Bureau of Investigation is leading an inquiry into the shooting. Although the Charlotte police chief, Kerr Putney, said on Saturday that Officer Vinson was “absolutely not being charged by me at this point,” the decision about whether the officer will face prosecution will ultimately fall to others. “If there was a weapon in his hand, then the case for using lethal force becomes stronger,” said Kami Chavis, a law professor who is the director of the criminal justice program at Wake Forest University in   N. C. But she also noted that there have been cases in which a person was unarmed “but it was determined that a reasonable officer could have viewed whatever it was in their hands as a weapon. ” In many of those cases, officers were cleared of criminal conduct. “Even if the officer was mistaken about what he had in his hand, and yet it was reasonable, it could be deemed a justified shooting,” Professor Chavis said. Some critics argue that the police overreacted. “It seems there were multiple opportunities to do this in a   way, and it seems like everything they did in response was escalating,” said Mark Dorosin, the managing lawyer at the University of North Carolina Center for Civil Rights. “I think there’s an argument to be made that they exceeded their authority. ” What evidence do the police say shows that Mr. Scott had a gun? Chief Putney has flatly and repeatedly said that Mr. Scott had a gun, but he also acknowledged that no recording exists to definitively prove the department’s account. The police statement on Saturday said that crime scene investigators recovered a loaded gun at the scene and that a forensic analysis revealed Mr. Scott’s DNA and fingerprints on the weapon. The police also released a photograph of the gun, as well as one of an ankle holster they said Mr. Scott was wearing. The police have not said where they recovered the weapon, but the photograph of the gun shows it resting on asphalt, next to an evidence marker. In the short video that Scott family lawyers made public on Friday, Mr. Scott’s wife, Rakeyia, can be heard telling the officers: “Don’t shoot him. He has no weapon. ” In an interview on Friday, the family’s lawyers said Ms. Scott was unaware that Mr. Scott owned a firearm. And one of his children said numerous times in a cellphone video she recorded in the aftermath of the shooting that he did not have a gun. Critics have accused officers of planting the gun. If Mr. Scott had a gun, was that allowed under federal and North Carolina laws? No. Although the North Carolina Supreme Court has recognized a general right to carry a firearm openly for nearly 100 years, there are exceptions, including ones related to criminal history, drug use or immigration status, under federal and state laws. Mr. Scott effectively forfeited his right to carry a gun in 2005, when he was convicted in the shooting of a man in San Antonio and sentenced to prison. Police officers on the scene last week in Charlotte almost certainly did not know about Mr. Scott’s legal history before they confronted him. A number of critics have wondered why officers would confront a man with a gun in an   state. But experts said it was not unreasonable for officers to investigate Mr. Scott’s possession of a firearm, even in a state that allows open carry, if they also believed he had marijuana. “If you see a person with drugs in one hand and a firearm in the other, I think that gives you a basis for thinking that a violation of federal law has occurred, and there might also be state crimes,” said Jeffrey B. Welty, an associate professor of public law and government at the University of North Carolina at Chapel Hill. “If it is the case, as the police have represented, that they confronted a person who had drugs and a weapon at the same time, then no, I don’t think there’s any question that that set of facts would support an investigative stop or an effort to speak further with that person,” he said. Does North Carolina permit marijuana? North Carolina law forbids possession of marijuana, but the police said on Saturday that the officers did not “consider Mr. Scott’s drug activity to be a priority” and approached him only after seeing the firearm. If Mr. Scott had been arrested for drug possession, the severity of the charge would have depended on the quantity of marijuana seized by the police. If he had enough for only one cigarette, the charge would have been a misdemeanor. The police have not explained why or how they assumed, from inside their unmarked vehicle, that Mr. Scott was rolling marijuana while sitting in the driver’s seat of his own vehicle. Did Mr. Scott have a book? Although the police say Mr. Scott was holding a gun before he was shot, friends and family members have said that he actually had a book with him. At least one sign at the protests that swept through Charlotte last week declared, “IT WAS A BOOK. ” Chief Putney said no book was recovered from the scene. What do we know about Officer Vinson? Three facts seem particularly noteworthy about Officer Vinson: He is relatively new to the police force, he has a clean disciplinary history and he is, like Mr. Scott,  . Officer Vinson, a member of a   unit in the department’s metro division, was placed on administrative leave after the shooting, a standard procedure here and across the country. The police said he joined the department in 2014, and has never been disciplined. Officer Vinson grew up in Charlotte, where, according to a profile published in 2012 in The Charlotte News and Advance, his father was the first black homicide detective on the police force here. As a high school student, Officer Vinson talked of a career in law enforcement and said he wanted to become a federal marshal. Over six feet tall, Officer Vinson’s formidable size served him as a college football player. After playing at Fork Union Military Academy, he enrolled at Liberty University, the Christian college founded by the evangelist Jerry Falwell. Officer Vinson graduated in 2013 with a bachelor’s degree in criminal justice and a master’s degree in executive leadership. What did Mr. Scott’s wife mean when she yelled, just before the shooting, “Keith, don’t do it”? This phrase, a variation of which Ms. Scott yells out numerous times in the cellphone video she made of the episode, has been the subject of intense speculation. Because Ms. Scott’s video is jerky and flits around the scene of the confrontation, it is hard to say what action Ms. Scott is asking her husband not to engage in. In the video, Ms. Scott can be heard telling her husband to get out of the S. U. V. so that the police will not break its windows. “Keith, don’t do it,” she says, while her husband is still inside the S. U. V. “Keith, get out the car! Keith, Keith, don’t you do it! Don’t you do it!” At that point, Mr. Scott can be seen getting out of the car. “Keith, Keith, Keith! Don’t you do it!” she says. Just as she finishes the sentence, the four shots ring out. Justin Bamberg, one of the lawyers for the family, said the statement was an effort to get Mr. Scott to stand still after he got out of the car. The dashboard camera video shows Mr. Scott walking backward before he is shot. What was Mr. Scott’s mental and physical state when the police confronted him? This is difficult to say conclusively, but some facts suggest that Mr. Scott may have been impaired in numerous ways. He suffered a traumatic brain injury last fall when he was involved in a motorcycle accident, neighbors and lawyers for his family said. His wife told officers during the confrontation that he had a “T. B. I. ,” or traumatic brain injury, and that he “just took his medicine. ” The family’s lawyers said they did not know what kind of medication he had taken. A photo of the marijuana cigarette released by the police on Saturday suggested that it had been smoked. Did the police offer medical assistance after the shooting? The Police Department said that officers performed CPR, but the footage that the authorities released on Saturday did not confirm or refute that assertion. The body camera recording showed that immediately after Mr. Scott was handcuffed, an officer asked for a bag and “some equipment. ” He soon added, as he gestured with a bloodied hand, “Get some gloves. We need to hold the wound. ” Mr. Scott was pronounced dead at a hospital later on Tuesday.'"}, "time": 1742562284.676046}