{"duration": 0.1483783721923828, "input_args": {"text": "'WASHINGTON  —   In his first, rocky week as President Trump’s press secretary, Sean M. Spicer was scolded by his boss, pilloried as a liar, hammered by journalists, mocked by Stephen Colbert, taunted by the   ice cream brand Dippin’ Dots and held up as the poster child for an administration that can play fast and loose with the facts. No wonder he was looking for his flak jacket. “Is this bulletproof?” Mr. Spicer asked one afternoon last week, peering into a closet in his sparse West Wing office as he hunted for the combat vest that, by cheeky tradition, is passed down from one presidential spokesman to the next. Until recently, Mr. Spicer was the public voice and chief strategist of the Republican National Committee, the epitome of establishment Washington. Now he is the face of an administration bent on upending the status quo and waging war on the news media, surprising colleagues here with how comfortably he has embraced Mr. Trump’s ire toward the press. The day after the inauguration, he marched into the White House briefing room on Mr. Trump’s orders and lambasted stunned reporters as “dishonest” while claiming, against available evidence, that the inauguration had been the most attended in history. (He later said his count included viewers watching online.) The ironic hashtag #spicerfacts was soon trending online. Days later, Mr. Spicer defended Mr. Trump’s false claims about rampant voter fraud, referring to studies that do not back up the assertion and saying the president “believes what he believes. ” On Thursday, he had to walk back his suggestion that Mr. Trump would impose a major tax on Mexican imports, jolting global markets. The reaction has been harsh. “There’s no learning curve on a moral compass,” said John Weaver, a Republican strategist who has advised Senator John McCain of Arizona and Gov. John R. Kasich of Ohio. “You don’t need a learning curve to tell the truth from fiction. ” If he’s bothered by the blowback, Mr. Spicer, 45, who had long dreamed of standing behind the White House lectern, is not showing it. “We have a free press  —   I get it,” Mr. Spicer said last week during an interview in his office, where a giant television broadcasts four   stations at once. “But the press doesn’t like it when you call out their errors the same way they call out everyone else’s. ” Statements from the White House, Mr. Spicer argued, should be given the same leeway afforded a news organization. “I don’t know how many corrections are in The New York Times any given day,” Mr. Spicer said. “But I don’t wake up every day and go, ‘O. K. you’re all liars. ’” Over a   conversation, Mr. Spicer  —   who ate   ice cream from a cup branded with the presidential seal  —   was by turns defensive and relaxed, and still excited by the novelty of working in the West Wing. Grabbing a history book, he flipped to a page with a list of previous press aides. “Diane Sawyer had that office!” he said, proudly. A framed photograph of himself at the White House lectern, taken days earlier, was displayed on a mantel. A note from Barack Obama’s press secretary, Josh Earnest, was nearby. “It was very, ‘What an amazing honor it is,’” Mr. Spicer said of the letter. Asked if he was bothered by Mr. Trump’s unpredictable Twitter posts, Mr. Spicer shrugged. “You get the ability to wake up and have an issue or an idea become front and center in a second,” he said. “That’s a huge thing. ” The president “drives the news,” Mr. Spicer said. “I help provide updates. ” A stocky Navy reservist who grew up in   Rhode Island, Mr. Spicer prides himself on persistence. He attended a prestigious Catholic high school on a scholarship, sending away for brochures for the school without his parents’ knowledge. After graduating from Connecticut College, he bounced around working on campaigns, briefly living in an R. V. without heat or hot water. Years ago, a line drive at a softball game smacked into Mr. Spicer’s jaw, leaving his mouth wired shut for weeks. “Be careful,” his teammate told doctors on the way to the hospital. “He talks for a living. ” He climbed his way up the Washington ladder, representing Republicans in Congress before landing in the office of the United States trade representative in the George W. Bush administration. His jaw has since recovered: The Washington Post reported that Mr. Spicer chews, and swallows whole, more than 20 pieces of Orbitz cinnamon gum a day. He is still finding his place in Mr. Trump’s   inner circle. A Washington insider among political outsiders, Mr. Spicer joined the Trump campaign in August, against the advice of friends who warned against tying himself to an unpredictable candidate. On the eve of the election, Mr. Spicer privately told several journalists that Mr. Trump’s odds of victory were slim. Expressing those misgivings may have been a move to soften the blow to the party in case of a Trump defeat, but was the sort of disloyalty that is anathema in Trump World. “Sometimes he was a little less enthusiastic about our direction than other times,” said Stephen K. Bannon, Mr. Trump’s chief strategist. “But he hung in there. ” Mr. Bannon, the former chairman of Breitbart News, rarely speaks to reporters on the record. But he reached out to a reporter unprompted to praise Mr. Spicer after learning of this profile, a sign of the Trump White House’s support for Mr. Spicer after a tumultuous first week. Mr. Trump criticized Mr. Spicer’s initial fiery appearance in the White House briefing room, urging him to wear a sharper suit and appear more confident, according to a person with knowledge of the conversations. (“He was disappointed with how the overall news cycle was going,” Mr. Spicer said in the interview, declining to elaborate.) But Mr. Trump was pleased with Mr. Spicer’s   briefing on Monday, calling Mr. Spicer a “superstar. ” “He’s a fighter,” Mr. Bannon said in a telephone interview, during which he also urged the news media to “keep its mouth shut and just listen for a while. ” “Sean Spicer is much too polite to the media,” Mr. Bannon added. “I’m the guy who wanted them out of the building. ” (He was referring to a proposal, scrapped for now, to move the White House briefing room from its current West Wing home.) Mr. Spicer has also heard from supporters who say his   of the news media was long overdue. “Accountability goes both ways,” said former Representative Mike Pappas, a New Jersey Republican who hired Mr. Spicer in the 1990s, adding that Mr. Spicer’s complaints were  . “There’s a clear bias against people like me, and people like him, and people like the man he works for,” Mr. Pappas said. “You have a right to your bias, but don’t report it as factual. ” Clifford Hobbins, Mr. Spicer’s high school history teacher, dismissed questions about his former student’s integrity. “He is as honest as the day is long,” said Mr. Hobbins, who said he had voted for Mr. Trump. “I’ve been very proud of the way he handled himself. ” Mr. Spicer, who was barely known outside Washington, is still adjusting to national fame. More than five million people tuned in for his first formal press briefing last week, with cable news channels and some broadcast networks taking the proceedings live. The discovery that he had posted on Twitter multiple times about his disdain for Dippin’ Dots, and its slogan, “The Ice Cream of the Future,” prompted the company to send him an open letter that went viral. Mr. Spicer sounded exasperated when the subject came up. ”It’s a joke,” he said. “How long can they be ‘the ice cream of the future’? You can’t actually be the future forever. ” Finishing his ice cream  —   which was not    —   Mr. Spicer shrugged. “You’re not here to be someone’s buddy. You’re here to enact the president’s agenda,” he said of his job. “And if you think it’s going to be anything bad, then this isn’t the job for you. ” Still, when asked about his first weekend, when he blasted the news media on instructions from an aggrieved boss, Mr. Spicer allowed himself a grimace. “That wasn’t the Saturday I thought I was waking up to,” he said.'"}, "time": 1742561823.4968035}