{"duration": 0.06376504898071289, "input_args": {"text": "'LONDON  —   Britain’s prime minister and Scotland’s leader met on Monday to discuss the most consequential of questions: Will Britain’s departure from the European Union cause Scotland  —   joined with England since 1707  —   to leave the United Kingdom? But for The Daily Mail, one of Britain’s most popular newspapers, the question that mattered was: Which leader had better legs? “Never mind Brexit, who won  !” its cover on Tuesday blared. Many readers were appalled that the encounter between Theresa May, the prime minister, and Nicola Sturgeon, the first minister of Scotland, had been reduced to a comparison of their bodies. By Tuesday afternoon, at least one complaint had been filed with Britain’s press regulator. “This is 2017,” Chuka Umunna, a Labour lawmaker, wrote on Twitter. “Sexist does not begin to describe this front page. ” Others, perhaps more jaded, were unsurprised, given how The Daily Mail has represented women in its pages in the past. “The Daily Mail do this regularly,” said Roy Greenslade, a professor of journalism at City University in London and a columnist for the liberal newspaper The Guardian. “And this is a particularly venal example, but if you look at it day on day, there are plenty of similar examples. ” Professor Greenslade said the blatant sexism was done unapologetically, “with a sense of confidence on the understanding that they can’t see what the fuss is all about. ” Mrs. May and Ms. Sturgeon met at a hotel in Glasgow on Monday, two days before the British government was set to invoke Article 50, formally notifying the European Union of Britain’s intention to leave the bloc. The leaders stopped for a photograph, sitting next to each other in armchairs. “But what stands out here are the legs  —   and the vast expanse on show,” Sarah Vine, the author of the Daily Mail article, wrote. Ms. Vine is married to Michael Gove, the British politician who helped lead the campaign to leave the European Union. The article went on to describe each woman’s stance. “Knees tightly together,” Mrs. May opted for “a studied pose that reminds us that for all her confidence, she is ever the vicar’s daughter,” the article said. Ms. Sturgeon’s legs, described as “undeniably more shapely shanks,” were “more flirty, tantalizingly crossed. ” The writer then called the Scottish leader’s posture “a direct attempt at seduction: Her stiletto is not quite dangling off her foot, but it could be. ” The Daily Mail has a readership of about 3. 4 million. It has often portrayed what it calls “career women” through the lens of their appearance, rather than through their accomplishments. “Even though they are great champions of Theresa May  —   and were champions of Mrs. Thatcher  —   they still basically see women in a 1950s role, as an adornment,” Professor Greenslade said, referring to former Prime Minister Margaret Thatcher. “That’s why so much of their editorial is about how women look. ” In 2014, for example, The Daily Mail compiled photographs of female lawmakers entering or leaving 10 Downing Street, the prime minister’s office and residence, during meetings about a cabinet reshuffle by David Cameron, Mrs. May’s predecessor. The article, with the headline “Esther, the Queen of the Downing Street Catwalk,” referring to one of the lawmakers, Esther McVey, also caused an uproar. To the latest criticism, The Daily Mail issued the response “For goodness sake, get a life!” Its statement called the article “a sidebar alongside a serious political story” that appeared “in an   paper packed with important news and analysis. ” The statement added that the newspaper had backed Mrs. May when she ran to succeed Mr. Cameron as leader of the governing Conservative Party. The newspaper added that it had often commented on the appearance of politicians, including “Mr. Cameron’s waistline” the hair of the former chancellor of the Exchequer, George Osborne and the attire of Jeremy Corbyn, leader of the opposition Labour Party. If the statement reflected a certain sensitivity to the negative coverage, so did later versions of the front page. Observers noted that it was tweaked in print, for a later edition, to add the words: “Sarah Vine’s lighthearted verdict on the big showdown. ” Some critics said that the adjustment was itself sexist, as it appeared to shift attention to the writer. “I think people maybe have had a slight sense of humor failure,” said Ms. Vine, speaking on the BBC radio show “World at One. ” “What we’re doing is creating a more approachable version of the story,” she added. Ms. Vine also defended the cover change, saying she stood by what she had written. Professor Greenslade saw the late change in the cover language as a belated attempt to   a controversy. “It is a pretty pathetic excuse,” he said. “When you see that front page, it’s quite clear what they meant: Don’t worry about the politics, just look at the legs. ”'"}, "time": 1742564577.2352571}