{"duration": 0.06117391586303711, "input_args": {"text": "'Singers Katy Perry and Cher will be among the thousands of women expected to travel to the nation’s capital for the Women’s March on Washington to protest   Donald Trump’s inauguration this month. [Ugly Betty actress America Ferrera, chair of the organization’s “artist table,” said the march is about standing up to the incoming administration.  “Since the election, so many fear that their voices will go unheard,” Ferrera said in a statement. “As artists, women, and most importantly dedicated Americans, it is critical that we stand together in solidarity for the protection, dignity, and rights of our communities. Immigrant rights, worker rights, reproductive rights, LGBTQIA rights, racial justice and environmental rights are not special interests, they affect us all and should be every American’s concern. ” Actresses Scarlett Johansson, Zendaya, Debra Messing, and Julianne Moore and talk show host Chelsea Handler are also expected to participate in the January 21 event. Comedian Amy Schumer  —   who initially vowed to move to Spain if Trump won, and later said the statement was a joke  —   took to Instagram last month to encourage her five million followers to join her at the march. “January 21 I’ll be there,” the Trainwreck star wrote. “Who’s coming with me? The group wants the event to “send a bold message to our new administration on their first day in office, and to the world that women’s rights are human rights. ” “The rhetoric of the past election cycle has insulted, demonized, and threatened many of us  —   immigrants of all statuses, Muslims and those of diverse religious faiths, people who identify as LGBTQIA, Native people, Black and Brown people, people with disabilities, survivors of sexual assault  —   and our communities are hurting and scared,” the organization says. Handler, who wrote a   essay shaming “white female” Trump supporters, is expected to host a separate march in Park City, Utah during the Sundance Film Festival. “I’m honored to join the Women’s March on Washington Artist Table,” Handler said. “By hosting a sister march in Park City, our Women’s March on Main will help send a message to the incoming administration that attacks on Planned Parenthood and our fundamental human rights are unacceptable and if we have to   for rights we have already fought for and won, we will do it louder and stronger, with men by our side. ” Actress Scarlett Johansson said: “The new administration may be very vague about specifics, but one thing has been made very clear their intentions of reducing the availability of Women’s Healthcare and attacking her reproductive rights. I am marching on Washington to let our next president know that we, men and women alike, will not stand down or be silenced and will fight to protect our bodies and our choices. ” The   Women’s March on Washington has not been without controversy. As the New York Times reports, some organizers of sister protests across the country and volunteers for the Washington D. C. march believe that the “march for all women” has, in manny cases, turned “into a march for black women. ” Between committed supporters and online RSVPs, the event organizers are expecting over a million marchers in the nation’s capital and across the country to support their   efforts.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562795.647487}