{"duration": 0.13883686065673828, "input_args": {"text": "'Sharon Olds feels bad about her neck. In her new book there is a poem called “Ode to Wattles,” and it is about what you suspect it’s about: the poet’s “face hanging down from the bottom of my face,” the “slackness of the drapery. ” In the mirror, Ms. Olds is shocked yet thrilled at her visage. Old age  —   “my crone beauty, in its first youth”  —   has given her fresh subject matter, which she does not intend to waste. She writes: No one who has kept up with Ms. Olds’s work needs to be told that she loves to be a little disgusting. As a writer, she’s always gotten an illicit thrill from pushing boundaries, whether scrutinizing sex or motherhood or parents or illness (but sex especially). The critic Helen Vendler, not a fan, has called her work pornographic. The nimbleness and electricity of Ms. Olds’s best sex poems, however, will not be denied. These poems declare, as vividly as did Janis Joplin: Honey, get it while you can. Ms. Olds, 73, has been on a fierce   run. Her last book, “Stag’s Leap,” about her divorce from her husband of many years, deservedly won the Pulitzer Prize in 2013. At around the same time, Ms. Olds took a small detour. She composed for Oprah magazine an article titled “Heartbroken? 6 Ways to Pull Yourself Back Up. ” (Poets and listicles: no more of these, please.) Item No. 2: “Carry a Power Hankie. ” This I hated to see, if only because one of the great things about Ms. Olds’s verse is that she never seems to be carrying a hankie at all, much less a fancy hankie. She avoids sentimentality the way a runner on the beach zigs to avoid the foamy lips of waves. Her new book, “Odes,” picks up where “Stag’s Leap” left off, which is to say that it contains some of the best and most ingenious poems of her career. Some are about aging. There is “Ode of Withered Cleavage,” for example, and “Hip Replacement Ode. ” There is also “Merkin Ode,” a merkin being a wig worn in the pubic region. These are on Ms. Olds’s mind because, she writes, Her poems have long found their center of gravity at crotch level. They contain an awareness, too, that as Philip Roth contended in “American Pastoral,” the body’s surface is “about as serious a thing as there is in life. ” Sex, for Ms. Olds, remains at the center of life and art. We have no finer laureate of the clitoris, which she likens in one poem here, in 10 of the more miraculous words that 2016 has produced, to the “  biceps of a teeny goddess who is buff. ” She describes the hymen as Her poem “  Ode” performs a service by containing a history lesson for millennials. It begins: She does, of course, go on, and suggests: “let’s take some   the creepiness of how women were   the 1950s. ” Ms. Olds has sometimes being criticized for being   for narcissism run amok. I see no logic to this sort of censure, agreeing with Philip Larkin, who said in an interview, “A very crude difference between novels and poetry is that novels are about other people and poetry is about yourself. ” Ms. Olds renders the personal universal. There is a good deal of lesser work in “Odes. ” When Ms. Olds’s poems miss, they really miss, more so than most poets at her level. Her “Ode to the Penis,” for example, contains these lines: “I   you’re lovely and brave, and so interesting, you   like a creature, with your head, and trunk, as if you have a life of your own. ” Or perhaps male poets have condescended for so long to the clitoris that this is her revenge. There are other topics besides sex and death in “Odes. ” There are odes to buttermilk and composting toilets and other poets (Stanley Kunitz, Galway Kinnell) and pine trees and sick couches and Sloan Kettering. The book’s warmth comes from the intensities of its language and the intensities that emerge from a life that seems well lived. In a poem about her living friends, she writes: “You were exactly who I’d   looking for, without daring to imagine. ” At their best, you can say the same thing of this writer’s poems. No power hankie required.'"}, "time": 1742561675.2279165}