{"duration": 0.05826520919799805, "input_args": {"text": "'\\nTrump has signaled that he will not be prosecuting Hillary Clinton, despite the fact that it was one of his main promises on the campaign trail.\\nBut the move isn’t exactly a surprise, as Trump’s cabinet picks have come into view and many of his statements have shifted to ‘unify the country.’\\nThis stinks of a deal, or if you prefer, of an opponent that never was. Perhaps wrestling choreographers turned to political choreography for better salaries and higher stakes.\\nTrump campaign manager Kellyann Conway made the announcement.\\nvia Breitbart :\\n“I think when the President-elect, who’s also the head of your party, tells you before he’s even inaugurated that he doesn’t wish to pursue these charges, it sends a very strong message, tone, and content to the members,” Conway said. “And I think Hillary Clinton still has to face the fact that the majority of Americans don’t find her to be honest and trustworthy. But if Donald Trump can help her heal, then perhaps that is a good thing. \\nHenry Kissinger emerged yesterday, issuing a bizarre statement that excused President-elect Trump from resembling anything like candidate Trump.\\nAfter Kissinger claimed that Trump didn’t need to keep his campaign promises, campaign manager/spokeswoman Kellyann Conway carried the chorus. As Kurt Nimmo wrote :\\n“One should not insist on nailing [Trump] into positions that he had taken in the campaign,” Kissinger told Zakaria . \\nKissinger argued that it is counterproductive to demand absolute consistency from presidential administrations … “The art now would be to develop a strategy that is sustainable, that meets the concerns that have appeared during the campaign but that can be linked to some of the main themes of American foreign policy.”\\nTrump’s Conway mirrored Kissinger’s exact words.\\n“Look, I think, he’s thinking of many different things as he prepares to become the president of the United States, and things that sound like the campaign aren’t among them,” Conway said. \\nSHTF made the call shortly after Trump’s victory speech during which he described Hillary Clinton as a tough fighter, and said the nation owed her a debt of gratitude, etc.\\nHe changed tones immediately as the election results signaled a sudden end to the rhetoric.\\nBREAKING: Trump Won’t Pursue Charges Against Hillary, Will “Help Her Heal” \\n\\nDid Kissinger hypnotize the Trump people or what?\\nRead more: \\nDid Trump Make a “Secret Deal NOT To Prosecute Hillary” In Exchange for Her Concession? \\nTrump Will Be President – How Alt-Market Predicted The Outcome Five Months In Advance '"}, "time": 1742563286.3630733}