{"duration": 0.07664203643798828, "input_args": {"text": "'White House Press Secretary Sean Spicer ripped into the media on Friday for continuing to ask questions about a connection between the Trump campaign and Russia, noting that there’s been no evidence of that. [“Everyone who’s been briefed on this subject, from Republican to Democrat to CIA  —   former Obama administration’s [Director of National Intelligence James] Clapper, [CIA Director John] Brennan, you name it  —   all of the people come back with the same conclusion  …    that there’s been no evidence,” he said at the White House press briefing.  Spicer said if anyone was trying to engage with Russia, it was Hillary Clinton. “It was Hillary Clinton, who was the architect of the last administration’s failed reset policy  —   she told Russian state TV that it was designed to strengthen Russia. That was their goal: to strengthen Russia,” he said. “She used her office to make concession after concession, selling off   of our country’s uranium, paid speeches, paid deals, getting personal calls from Vladimir Putin. I think if there’s  —   really want to talk about a Russian connection and the substance, that’s where we should be looking,” he added. Spicer was referring to how in 2010,   of State Clinton was one of nine to sign off on Russia’s purchase of a controlling stake in Uranium One, an international mining company headquartered in Canada. Around the same time, a Russian investment bank paid Bill Clinton $500, 000 to give a speech. “When you talk about connections to Russia, the only connection that anyone’s made with President Trump is multiple years ago he hosted a pageant there and he’s  —   some of the  —   you know, he owns condos around the world and some of them were sold to some Russians and I think he sold a house to one several years back. That’s his connection,” he said. “So when you compare the two sides in terms of who’s actually engaging with Russia, trying to strengthen them, trying to act with them, trying to interact with them, it is night and day between our actions and her actions,” he said. “And yet no one questioned what she was doing or how she was handling it. ” Critics of President Trump have argued that his campaign aides colluded with Russia to help him get elected. While intelligence officials have assessed that Russia tried to interfere in the U. S. elections in favor of Trump by hacking into the Democratic National Committee and Clinton aide John Podesta and leaking embarrassing emails, there has been no evidence that Russia affected the outcome of the election or that there was collusion with Trump campaign officials. The FBI is investigating the matter, and the House and Senate intelligence committees are also investigating it. But Clapper told NBC News on March 5 that no evidence existed that showed any collusion between the Trump campaign and Russia. “Not to my knowledge,” he said, when asked if any evidence existed. Clapper said there could have been information found since he left the government on January 20, but as of then, “We had no evidence of such collusion. ”'"}, "time": 1742564320.0366735}