{"duration": 0.5208923816680908, "input_args": {"text": "'The solution to our debt crisis is for “We the People” to take our Republic back from the special interests by educating voters to enforce the Constitution, not by adding a Balanced Budget Amendment via an Article V convention. \\n“Our country is run by a close network of special interests, public officials, and the media.” — Eighty-one percent of Americans agreed with this statement in a 1996 survey. \\nBack in 1996, the Institute for Advanced Studies in Culture at the University of Virginia published the results of their survey of the American public based on 2,000 face-to-face, in-depth interviews. They titled their survey “The State of Disunion — 1996.” \\nTheir finding that 81 percent of Americans believe “Our country is run by a close network of special interests, public officials, and the media” was recently reaffirmed by a January 2016 Gallup poll that revealed that 84 percent of Americans agree with the statement, “powerful special interests [have] too much control over what the government does.” According to the Gallup poll, 51 percent believe that this is a “major problem,” while 33 percent believe that this is a “crisis” situation. \\nThis widespread belief that “Our country is run by a close network of special interests, public officials, and the media” has also been validated by the presidential election campaign of 2016. Rarely have we seen so clearly the political power plays of this “close network,” which includes of course the establishment elites of both parties, as during the 2016 election cycle. \\nYou might wonder what all this talk of special interests’ control over our government has to do with our debt crisis. The connection is that for the last four decades there has been an organized movement to get Congress to call an Article V convention for the purpose of proposing a Balanced Budget Amendment (BBA), ostensibly to avert a national debt crisis, such as national bankruptcy or some other type of “economic meltdown.” The proponents of this BBA constitutional convention tell us that the government is out of control, as shown by our steady diet of $500 billion or higher federal deficits and the resulting skyrocketing national debt, currently around $20 trillion. According to these proponents, the solution is to add a Balanced Budget Amendment to the Constitution via an Article V convention. \\nHowever, the federal government is not out of control. It is under the control of a “close network” of powerful special interests, aka establishment elites, whose carefully nurtured voting blocs benefit from ever-larger, unconstitutional federal programs. The problem is not just the huge annual federal deficits and the towering national debt they contribute to, it is the bloated and tyrannical federal government that has been created and powered by congressional approval of myriad special interest-sponsored unconstitutional programs. \\nEstablishment Elites Plot to Rewrite the Constitution \\nThroughout its 30-year history, this magazine has led the way in exposing the powerful establishment elites who run this country. These elites are found in such leading special-interest groupings as Big Business, Big Labor, Big News Media, the education establishment, foundations, internationalist foreign policy organizations, big political donors, and the major political parties. An excellent example of this magazine’s exposés is “Council on Foreign Relations,” an article that was originally published in the August 3, 2009 issue. That article described the amazing degree of influence over our government exercised by the Council on Foreign Relations (CFR), the preeminent internationalist foreign policy special-interest group, as follows: Chief among these groups is the Council on Foreign Relations (CFR), the most visible manifestation of what some have called the American establishment. Members of the council have dominated the administrations of every president since Franklin D. Roosevelt, at the cabinet and sub-cabinet level. It does not matter whether the president is a Democrat or Republican. \\nAlthough the CFR has only about 5,000 members, a very large number of them are leaders of other leading special-interest groups, serve as public officials, and hold leading management and editorial positions in the media. This is true to such an extent that the CFR membership alone could be thought of as “a close network of special interests, public officials, and the media” that run our country. \\nAn earlier article in this magazine, “ Bicentennial Plot ” (February 10, 1986 issue), exposed the plans of a powerful establishment special-interest group, the Committee on the Constitutional System (CCS), which was leading the charge to “formalize radical changes that have already been taking place by rewriting the Constitution.” As you would expect, two out of the three CCS co-chairs were members of the CFR, and 15 of the 41 members of the CCS board of directors were also CFR members. \\nSince that special-interest establishment’s attempt to rewrite the Constitution in the 1980s fizzled out, there hasn’t been another such transparent attempt by the establishment to replace the Constitution. However, we shouldn’t neglect to point out that since the 1970s the leading organization promoting the calling of an Article V convention for the purpose of proposing a Balanced Budget Amendment has been the American Legislative Exchange Council (ALEC), an establishment special-interest group that boasts of having nearly one-fourth of our nation’s state legislators, as well as nearly 300 corporations (including many multinational corporations) and private foundations, as members. ALEC is on record on its website as officially supporting congressional approval of the Trans-Pacific Partnership (TPP) and the Transatlantic Trade and Investment Partnership (TTIP), two signature causes of the establishment elites. For more information on this, see our 2014 article “ The Not-so-smart ALEC .” \\nAlthough the establishment’s fingerprints are otherwise hard to find on today’s leading initiatives to bring about an Article V convention, there is a somewhat stealthy bipartisan movement to bring about such a convention, as revealed in “Working Together to Rewrite the Constitution” in our June 9, 2014 issue. \\nRepublics and Democracies \\nTo better understand the connection between increasing numbers of unconstitutional programs and an increasingly tyrannical federal government, consider the distinction between republics and democracies. \\nOn September 17, 1961, Constitution Day, Robert Welch (who had founded The John Birch Society less than three years earlier) gave a speech entitled “ Republics and Democracies ” to a patriotic Chicago-based organization, “We the People.” This speech went on to influence millions of Americans to understand that our nation is a republic, not a democracy. It is still available at TheNewAmerican.com. \\nIn his speech, Robert Welch demonstrated that the United States is a constitutional republic characterized by the “rule of law,” not a democracy characterized by the “rule of men.” And he quoted approvingly from James Madison in The Federalist , No. 10, regarding the nature of a democracy: Democracies have ever been spectacles of turbulence and contention; have ever been found incompatible with personal security, or the rights of property; and have in general been as short in their lives as they have been violent in their deaths. \\nOne’s first reaction to Madison’s assertion that democracies are “short in their lives” might be to say, “Madison is wrong because our nation is a democracy and it has lasted for over 200 years.” However, our nation is a republic, not a democracy. That’s why it has lasted so long. The problem is that the more our nation is transformed into a democracy, the shorter its life will be. \\nAnd our nation is being transformed into a democracy by the ongoing passage of unconstitutional programs by Congress. After a century or more of congressional seizures of powers not granted to it by the Constitution (as discussed below), we’ve long since reached the point where almost the only consideration taken into account by congressmen voting for a bill is whether a majority of their constituents will approve. Very few congressmen vote for a bill based on whether it is constitutional. As Representative “Pete” Stark (D-Calif.) famously opined at a town hall meeting in 2010, “The federal government … can do most anything in this country.” \\nWe live in an era of “the tyranny of the majority,” which is the basic critique of democracies. In a pure democracy, everything is decided by a simple majority vote of the people or their representatives. There are no constitutional restraints, such as the enumerated powers of Article I, Section 8 of our Constitution or a Bill of Rights. \\nIf Congress and the rest of the federal government continue on the path of bowing primarily to majority opinion, usually artfully crafted by the special-interest elites, and not obeying any constitutional limitations on their power, then we will lose all remaining constitutional bulwarks against tyranny, and finally, lose all security for our God-given rights. \\nRobert Welch ended his “Republics and Democracies” speech by stating, “This is a Republic, not a Democracy. Let’s keep it that way!” We need to take this slogan to heart and reject the ongoing transformation of our constitutional Republic into a democracy. \\nTherefore, the solution to our nation’s twin problems of too much national debt and too powerful a federal government is to defeat the special interests’ control over our government by educating voters sufficiently to get a majority of constitutionalists elected to Congress. This constitutionalist majority would eliminate or gradually phase out all unconstitutional programs, thereby balancing the budget, reducing taxes, securing our rights, and restoring our constitutional Republic and the rule of law, not of men. \\nSo in terms of the above overview of the national debt/tyrannical government crisis and solution, our main objection to bringing about a Balanced Budget Amendment Article V convention at this time in our nation’s history is that the “close network of special interests, public officials, and the media” that runs our country would dominate such a convention process and would most likely end up revising the Constitution in their favor. \\nHistory of the National Debt/Tyrannical Government Crisis \\nNow let’s take a look at the history of our national debt/tyrannical government crisis to see how long we’ve had it, how big it is, and what caused it. \\nFirst of all, take a look at the chart in Figure 1a (right), which shows our national debt from 1792-2020 as measured in dollars, uncorrected for inflation and the size of our economy. This chart gives the false impression that we never had a significant national debt in our nation’s history until somewhere around 1940, and that sometime in the 1980s the national debt began to increase exponentially and shows no signs of slowing down. This false impression is due to not correcting the chart for inflation and the size of our economy. This is not to say that we don’t have a public debt problem. We emphatically do. It’s just that the history of our national debt has been more nuanced than what is displayed in Fig. 1a. \\nMeanwhile, the Balanced Budget Amendment Article V convention movement got rolling in the 1970s. Proponents of such a convention made the argument to state legislators in the 1970s, as they have ever since, that large annual federal deficits and the rapidly growing national debt were leading to economic and fiscal disaster. They argued that the solution was to add a BBA to the Constitution. But since Article V of the Constitution provides only two ways to propose amendments, either by a vote of two-thirds of both houses of Congress or by a state-initiated constitutional convention, and since Congress had still not approved a proposed BBA, then we just had to get 34 states to apply to Congress to call an Article V convention in order to get a BBA proposed and ratified. \\nIt turns out that the dire predictions of economic and fiscal crisis have not come true — yet. However, the catastrophic situation depicted in Fig. 1a does reflect a truly dangerous fiscal situation as revealed in a more accurate way in Fig. 1b. In this chart the level of national debt is measured in terms of percent of real GDP, which provides an automatic correction for inflation and the size of our economy. Just as in Figure 1a, the graph in Fig. 1b shows a dangerous buildup in national debt. In contrast to Fig. 1a though, Fig. 1b provides some valuable information about the history of our nation’s national debt. Figure 1b shows that we’ve had a buildup in national debt many times since 1792. Until the 1980s, these increases in national debt have always been associated with wars, such as the War for Independence, the War of 1812, the Civil War, WWI, and WWII. After each of these wars, we’ve paid most of the debt off. \\nBut since 1980, we’ve had a rapid increase in the national debt without being involved in a full-scale war. Since the increases in our national debt are basically due to our annual federal budget deficits, let’s examine what’s been going on with federal spending and deficits as revealed in Figures 1c and 1d. In these two figures, spending and deficits are measured as a percent of real GDP, again to correct for inflation and the size of our economy. We see a familiar pattern in both 1c and 1d. There are the peaks of spending and deficits corresponding to the major wars we’ve fought. \\nHowever, there’s also something very interesting that is revealed in the pattern of federal spending. We see a rapid increase in federal spending beginning in the 1930s and continuing into the 1980s. We know from American political history that Franklin Delano Roosevelt was elected in 1932 and that he inaugurated many new government programs, not authorized by the Constitution and known collectively as the “New Deal.” Once FDR and Congress had opened the floodgates for large-scale unconstitutional spending, there was no turning back. \\nUnconstitutional programs begat more and more unconstitutional agencies, departments, and programs, and this process has continued right up to today. We’ll verify the unconstitutionality of the vast majority of federal spending below when we look at the specific spending categories for fiscal year 2015. \\nOne very striking statistic from Fig. 1c is that during President Obama’s first term, annual federal spending set a new, post-WWII record of nearly 25 percent of GDP. \\nNow look at Fig. 1d. In the 1930s, the increased federal spending led to immediate increases in federal deficits. Next, the massive deficits of the WWII years masked any deficits that were caused by increases in non-war spending. But within a few years after WWII, a pattern of seemingly modest deficits developed. Then, in the 1970s, these deficits began to increase toward five percent of GDP and remained at or near the five-percent level until the late 1990s when federal deficits were eliminated for a few years in the wake of the Republican Revolution of 1994. Under George W. Bush the deficits returned, but it was during the Obama years that some of the deficits set a new post-WWII record of nearly 10 percent of GDP. \\nSo, what’s the point of all of this analysis of spending, deficits, and debt? It is that Congress was authorized with specific enumerated powers in Article I, Section 8 of the Constitution; however, in the 1930s Congress began a lavish spree of unconstitutional spending that increased rapidly for many decades and continues to increase to this day. \\nThe Unconstitutionality of Most Federal Spending \\nNow take a look at Figure 2 (below). This pie chart shows all federal spending for fiscal year 2015, which amounted to $3.8 trillion (about 20 percent of GDP). Let’s see if our characterization of the rapid increase in federal spending since the 1930s as unconstitutional holds up. \\nIf you’ll compare the 12 spending categories listed for the various pie pieces in Fig. 2 with the powers granted to Congress in Article I, Section 8, you’ll find that over 70 percent of current federal spending is unconstitutional. About the only categories of spending that appear to be constitutional are “Military,” “Veterans’ Benefits,” and “Interest on Debt.” Sure there are some constitutional programs buried within the various categories, but the vast majority of spending within the unconstitutional categories is still unconstitutional. \\nEven a very brief review of some of the various categories of federal spending in Fig. 2 reveals the seeds of the destruction of our freedoms by a tyrannical federal government present in these categories. \\nFor example, the “International Affairs” category includes our unconstitutional foreign aid program and the dues for our unconstitutional United Nations membership. These expenditures are being used to help build a global government, which would destroy our nation’s independence and our personal rights and freedoms. \\nThe “Education” spending is used by the federal government to exert its unconstitutional control over all levels of education with the goal of producing compliant citizens who will vote to support the “close network of special interests, public officials, and the media” that runs our country. Think Common Core. \\nThe “Food & Agriculture” spending hides the surprisingly large unconstitutional “food stamp” program, which in 2014 cost $74.1 billion and was used by 46.5 million Americans. This program develops and maintains the loyalty of millions of voters to the special-interest elites on a daily basis. \\nThen there’s the huge “mandatory spending” categories of “Social Security, Unemployment & Labor,” and “Medicare & Health,” which constituted fully 60 percent of federal spending in 2015. Here is where we find the spending for the big three entitlement programs — Social Security, Medicare, and Medicaid. Various economists have estimated that the Social Security, Medicare, and Medicaid programs have unfunded liabilities of between $100 and $200 trillion. This is equal to between five and 10 times the size of our annual GDP. In short, the promises to pay specific levels of future benefits for these unconstitutional entitlement programs are simply promises that our government can’t keep. \\nAlso hidden inside the spending shown in the Fig. 2 pie chart is about $500 billion in unconstitutional federal aid to states each year for health, education, etc., which amounts to about 30 percent on average of each state’s annual budget. This unconstitutional federal aid is passed through by the states to its citizens and thereby makes the states complicit in the special interests’ rampant unconstitutional federal spending. This level of federal subsidization of state budgets severely compromises state sovereignty. \\nFurthermore, consider that the 10th Amendment states, “The powers not delegated to the United States by the Constitution … are reserved to the States respectively, or to the people.” When Congress illegally seizes the power to “do most anything in this country,” then that leaves virtually no powers reserved to the states to exercise. \\nThe point of this brief review of the unconstitutionality of over 70 percent of federal spending in 2015 is to confirm that the rapid increase in federal spending that occurred between the mid-1930s and 1980, and that has continued, albeit at a slower pace, right up to today, can be characterized as mostly unconstitutional spending. \\nBBA Article V Convention Movement \\nIn 1957, Indiana became the first state to apply to Congress to call an Article V convention for the purpose of proposing a Balanced Budget Amendment. Although a sprinkling of states applied to Congress for such a BBA “constitutional convention” in the 1960s and early 1970s, the movement didn’t really take off until sometime in the mid-1970s, when the American Legislative Exchange Council began promoting a “Balanced Federal Budget Petition,” which later became known as a “Balanced Budget Amendment” petition. (See our 2015 article “ The New BBA Con-Con Threat ” for more BBA Article V convention history.) \\nNowadays most proponents of such a convention deny that it can be properly called a “constitutional convention” — because such a reference warns Americans of the potential danger of such a gathering. However, The John Birch Society and many other organizations and activists continue to correctly refer to an Article V convention as a constitutional convention (often abbreviated as Con-Con). The 1979 fifth edition of the widely used Black’s Law Dictionary even explicitly refers to an Article V Convention as an example of a constitutional convention. \\nBy 1983, 32 of the required 34 states had applied to Congress to call a BBA Article V convention. This was the high-water mark of the BBA constitutional convention movement; it has not been surpassed up to the present day. The next state to apply for such a convention was Florida in 2010. \\nBy the mid-1980s members of The John Birch Society and other organizations, such as Eagle Forum, were working with state legislators to oppose the approval of any new Article V convention applications and to rescind (cancel) existing applications. From 1988 to 2010, 17 states, including Florida, rescinded their previous BBA Article V convention applications. \\nCurrent Status of the BBA Article V Convention Movement \\nAlthough the numerous Article V convention application rescissions during the years 1988 to 2010 reduced the number of states that still had “live” (unrescinded) applications for a BBA Article V convention down to 17, the momentum shifted again in 2010. From 2010 to 2015, eight states that had formerly rescinded their applications reapplied for a BBA Article V convention. Then, Ohio and Michigan made their initial BBA convention applications in 2013 and 2014 respectively, yielding a new total of 27 states with “live” applications as of September 2015, just seven short of the required 34 states. \\nThen, in 2016 two more states, Oklahoma and West Virginia, applied for a BBA Article V convention to be called; however, Delaware rescinded its existing “live” application for a BBA Article V convention. So, the BBA convention proponents gained a net of one state this year for a total of 28. That leaves them six short of the required 34 states for forcing Congress to call a convention. \\nNow look at the “BBA Article V Convention Status November 2016” map (right) and see what your state’s status is. The John Birch Society is recommending that those readers living in a green state (no “live” BBA Article V convention application) work with others and your state legislators to stop the approval of any BBA Article V convention application in your legislature. \\nIf your state is orange, your state already has an existing “live” BBA Article V convention application. The John Birch Society is recommending that you work with others and your state legislators to get a resolution introduced and approved to rescind all existing Article V convention calls, especially of the BBA variety. Remember that for every additional state that rescinds its BBA convention call, the BBA convention movement is one state further away from its goal of 34. For further information about how to rescind Article V convention applications, see our article “ Save the Constitution by Rescinding Article V Convention Applications .” \\nSee the sidebar “Why a BBA Article V Convention Is Not a Wise Idea” at the end of this article for a summary of the reasons for opposing a BBA Article V convention. \\nThis Is a Republic, Not a Democracy! \\nThe point is that our problem with the federal government is not just due to deficit spending, and the federal government is not simply out of control. Our problem with the federal government is that Congress has seized (usurped) powers not granted to it by the Constitution, and special interests have taken control of the federal government by taking advantage of these usurped powers to reward their carefully cultivated constituencies. \\nOur Republic is being converted into a democracy by the establishment’s deliberate flouting of the Constitution, along with its cultivation of voting blocs that are electing congressmen who are moving our nation toward a “tyranny of the majority.” Even though our nation was founded on the principle in the Declaration of Independence that “governments are instituted among men” to “secure” our God-given rights, a “tyranny of the majority” would eventually strip our nation of all our rights. \\nTherefore, the solution to our twin problems of too high a national debt and too powerful a federal government is not to add a BBA to the Constitution, but rather to support grassroots efforts by independent, private organizations to create a constitutionally informed electorate that would nominate and elect a majority of constitutionalists to Congress and state legislatures. We the People are the last resort for enforcing the Constitution and thereby securing our rights. We must not enable the powerful special-interest establishment to revise our Constitution in their favor via an Article V convention process at this time in our history. \\nThe Constitution must be preserved as a rallying point for freedom-loving Americans. This is a republic, not a democracy. Let’s keep it that way! * * * \\nSidebar: Why a BBA Article V Convention Is Not a Wise Idea \\n• The national debt is not the real problem. The real problem is how “a close network of special interests, public officials, and the media” control the federal government based on their ability to build voting blocs that benefit from the unconstitutional federal programs that they initiate. The fiscally dangerous size of the national debt is a measure of just how effective the special interests are in getting their deficit-spending programs funded. The solution to the debt crisis is to create a constitutionally informed electorate and pay the national debt off by phasing out unconstitutional spending. \\n• A runaway convention could rewrite the Constitution. An Article V convention has the inherent power to extensively revise or completely rewrite the Constitution based on the precedent of the Constitutional Convention of 1787 and on the right of the people to alter or abolish their form of government (including the ratification procedure) as stated in the Declaration of Independence. \\n• An Article V Convention would play into the hands of the special interests. The “close network of special interests, public officials, and the media” that control our nation would lead an Article V convention process to revise the Constitution to favor the special interests, and would also massively influence the ratification process to favor the special interests. \\n• Virtually all BBA proposals include loopholes, such as national emergency exceptions and supermajority exceptions, that would enable Congress to continue approving deficit spending, even if a BBA were to be added to the Constitution. \\n• A BBA would legitimize unconstitutional spending by shifting the focus away from whether a certain bill is unconstitutional and toward whether the bill would fit within a balanced budget. The BBA Article V convention movement has never been about restoring the spending limitations contained in Article I, Section 8 of the Constitution. \\n• A BBA would further transform our Republic into a democracy by making the main criterion for approving a proposed bill the degree of popular support that bill has for including it in a balanced budget, as opposed to its constitutionality. A constitutional republic is characterized by the rule of law, while a democracy is characterized by the rule of men and leads to a tyranny of the majority. \\nPlease review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562915.3276849}