{"duration": 0.03150439262390137, "input_args": {"text": "'Posted 10/31/2016 3:41 pm by PatriotRising with 0 comments Officials stockpile a million provisional ballots in swing state governed by a close Clinton ally \\n\\nVirginia has printed 1 million provisional ballots, an unprecedented number that could allow a large number of previously disqualified felons to cast ballots for president in the potentially crucial swing state. \\n\\nSo says Reagan George, the president of the Virginia Voters Alliance. \\n\\nGeorge, a conservative election watchdog, charged on Monday that the Virginia Department of Elections is overpreparing for worst-case scenarios and increasing the likelihood of illegal votes being cast. In reply to Republican complaints earlier this month, Virginia Department of Elections Commissioner Edgardo Cortés acknowledged officials are preparing for all contingencies, according to the Richmond Times-Dispatch. \\n\\nBut George said the provisional ballot printing doesn’t make sense even for contingencies. And it doesn’t compare to demand in 2012. \\n\\n“The claim that it is for contingency planning is bogus,” George said in an email. “In 2012, Stafford County used less than 500 provisional ballots — in 2016 they received 30,000. In 2012, Loudoun County used 700 provisional ballots. In 2016, they received 84,000. In 2012, Fairfax used 2,500 provisional ballots; in 2016, they received over 265,000. This is ridiculous.” \\nBut spokeswoman Dena Potter of the Virginia Department of Elections said the state is trying to accommodate a court order. \\n\\n“As part of its emergency preparedness efforts and in response to the [December] 2015 consent decree related to mitigating long lines at the polls, the Department issued guidance to local registrars on August 29, 2016, that included having enough provisional ballot envelopes to equal at least 20 percent of the number of active voters as of September 1,” Potter said in an email. “As of September 30, there were 5.5 million voters registered in Virginia. As with any contingency planning, we hope that we don’t have to use these but they will be available in case we do.” \\n\\nThe decision to print so many provisional ballots comes after an April announcement by Gov. Terry McAuliffe, a Democrat and a key ally of Democratic presidential candidate Hillary Clinton. McAuliffe said he would allow more than 200,000 released felons to vote on Nov. 8. \\n\\nThe decision immediately brought a legal challenge from the Republicans, who won their suit in July. Virginia law says the governor must individually clear such cases, and cannot widely add so many released felons back to the voter rolls. \\n\\nGeorge believes the court loss is part of the thinking behind the surge in provisional ballots. The thousands of felons who signed up to vote after McAuliffe’s order were initially welcomed to the voter rolls. George said left-wing voter groups were ready for the order, and signed up thousands of felons within hours. \\n\\nIf those felons now walk into a polling place and demand a ballot, they will be accommodated, George charged. George also said he is concerned other ineligible voters will be handed such provisional ballots simply if they demand them. \\nProvisional ballots are only counted by city and county election boards after Nov. 8, and Republicans should be prepared for things to go against them, George said. Each board has a Republican and a Democrat, and an McAuliffe appointee. \\n\\n“Guess which way the vote is going to go,” said George. \\n\\nVirginia leaders have been dealing with election headaches for months. On Oct. 13, Virginia legislators questioned Cortes at a hearing. One Republican leader, citing election problems, called for Cortés to resign, according to the Times-Dispatch. \\n\\n“I think it’s incumbent upon the governor to replace you quickly with competent and nonpartisan leadership,” said Delegate Timothy Hugo, R-Fairfax.'"}, "time": 1742628476.515932}