{"duration": 0.051035404205322266, "input_args": {"text": "'Former GOP Representative Calls For Armed Insurrection (VIDEO) By Carrie MacDonald on October 27, 2016 \\nFormer Representative Joe Walsh (R-Ill.) has called for armed insurrection if Democratic presidential candidate Hillary Clinton wins the election. Walsh: ‘I’m Grabbing My Musket’ \\nJoe Walsh is a stain on the history of my little part of the country. He served for a blessedly short time before being demolished by Representative Tammy Duckworth (D-Ill.) in the 2012 election, but he still has ardent supporters around here. He’s relatively well-known for his outrageous tweets, but this one, posted on October 26, made some real waves: On November 8th, I\\'m voting for Trump. \\nOn November 9th, if Trump loses, I\\'m grabbing my musket. \\nYou in? \\n— Joe Walsh (@WalshFreedom) October 26, 2016 \\nWow. \\nI will grant that a musket is not going to do you much good these days. So perhaps, PERHAPS, it was a metaphor. \\nBut what does this say to the droves of Trump supporters, armed with much more than a musket, who believe the election will be stolen from their anointed one? \\nWalsh, facing both harsh criticism and hilarious jabs on Twitter for his comment, did not back down: I\\'m serious. I don\\'t think a musket would do much good these days, but it\\'s time for civil disobedience on the right. https://t.co/ThJPEbALWZ \\n— Joe Walsh (@WalshFreedom) October 26, 2016 \\nYahoo! News interviewed Walsh about the comment, and he said : “I’m not talking about inciting violence. I’m saying, ‘If Trump loses, man, game on, grab your musket. We’re going to protest. We’re going to boycott. We’re going to picket. We’re going to march on Washington. We’re going to stop paying taxes. We’re going to practice civil disobedience.’ Whatever it takes.” \\nThis has become the standard operating procedure of Republicans, particularly Trump-supporting Republicans. Make veiled threats and then walk them back (“Aww, c’mon, I was kidding! Can’t you guys take a joke?”), but make sure the knuckle-draggers who support them get wind of it. It’s disgusting. \\nThis morning, Walsh tweeted: I told Thomas Jefferson gov forced a baker out of biz for defending her religious beliefs. \\n\"Can\\'t happen here\" he said. \"Grab your musket!\" \\n— Joe Walsh (@WalshFreedom) October 27, 2016 \\nWhile this tweet is asinine on so many levels, it also suggests that he wasn’t speaking metaphorically in his initial tweet. After all, in Jefferson’s time, muskets were one of the weapons of choice. Walsh Is A Disgrace \\nLanguage like this has no place in political discourse. If Walsh were nothing more than the radio host he currently is, it would be disgusting. Given that he used to be a representative in the United States Congress, it is downright abhorrent. \\nIt’s also not the first time Walsh has suggested violence. \\nAfter the shooting of several police officers in Dallas this summer, Walsh tweeted — and later deleted — the following: Screenshot via Chicago Tribune \\nSo it’s really not out of the question to think he’s actually looking to incite violence with his “grabbing my musket” comment. \\nI’m just happy his Congressional office is no longer sullying the quaint town square. \\nWatch Don Lemon take Walsh to task for his Dallas tweet here: \\nFeatured image via screenshot from YouTube video About Carrie MacDonald \\nCarrie is a progressive mom and wife living in the upper Midwest. Connect'"}, "time": 1742628298.7377062}