{"duration": 0.04924154281616211, "input_args": {"text": "'‘You’re tweeting about me a lot.’ James O’Keefe BLASTS Joy Reid for saying he’s not a real journalist Posted at 12:41 pm on October 28, 2016 by Sam J. \\nIs Joy being racist and implying that illegal voters are black? \\nShameful. James O\\'Keefe fundraising via right wing email newsletters to keep sending his goons to \"watch\" black voters. 1/2 pic.twitter.com/z5Eb9zdcBN \\n— Joy Reid (@JoyAnnReid) October 28, 2016 \\nLooking through this original newsletter, not seeing anything about watching black voters. \\nThere’s a piece about illegal voters but nothing about the color of their skin. \\nAnd she seems awfully fixated on James O’Keefe, who apparently she said isn’t a real journalist. . @JoyAnnReid remember when you said I wasn\\'t a real journalist @ #DNC ? Funny, because for not being \"real\" you\\'re tweeting about me a lot. https://t.co/nlE6o1CB4B \\n— James O\\'Keefe (@JamesOKeefeIII) October 28, 2016 \\nFelt the burn over here. Trending OOPS-a-daisy! Watch Team Hillary FREAK over NYT piece on her \\'gay marriage flip-flop\\', from #PodestaEmails21 \\nAll the newsletter really says is that they will not back down, nothing specific about race or skin … and clearly plenty of people feel that James is a real journalist. Or as real as any journalist can be in this current atmosphere. @JamesOKeefeIII @organic2016 @JoyAnnReid If you don\\'t tow their line, you\\'re not real to them. \\n— Gun Talk News (@GunTalkNews) October 28, 2016 \\nAwww, is there some special club? @JamesOKeefeIII of course @JoyAnnReid can\\'t kill the message, nor wants to face the truth, in this case, she attacks the messenger. \\n— (((Val Washington))) (@ValeriaPugliesi) October 28, 2016 \\nOr she tried to, yes. @JamesOKeefeIII @JoyAnnReid Joy Reid doesn\\'t care about the truth, only cares about getting Hillary elected \\n— Les_Deplorabes (@Chicago_Land_) October 28, 2016 \\nFrom the WikiLeaks and various O’Keefe footage that would be MOST of the media, not just Joy, but point taken. @JamesOKeefeIII They are Scared of you! American People hate MSM now and they will pay for their corruption far past this election! \\n— Anne (@AnneFisher84) October 28, 2016 \\nIt would seem they are more afraid of the truth than any one journalist … honestly it’s hard to tell up from down in this crazy election but to Anne’s point, the traditional media does seem to be a bit discombobulated. @JamesOKeefeIII We know for sure that @JoyAnnReid isn\\'t a journalist, nor objective. \\n— Nick Carroll (@NickFromHouston) October 28, 2016 \\nAnd ironically she is trying to call out James for being what she appears to be. \\nDemocrats DO like to project.'"}, "time": 1742563600.3483703}