{"duration": 0.07932329177856445, "input_args": {"text": "'Rep. Jim Jordan ( ) talked with Breitbart News Daily SiriusXM host Alex Marlow Thursday about healthcare reform and Obamacare repeal moving forward. [When asked about the White House working with Democrats on healthcare reform, Jordan said, “I think that would be a big mistake”  Added Jordan, “I think that would be the wrong approach. The elections in 2010, 2014, and on November 8, 2016, weren’t about working with Democrats to keep in place Obamacare. They were about repealing Obamacare. ” Jordan insisted this was simply a postponement in the passing of a piece of legislation and argued that Republicans should regroup and work together to pass an acceptable bill. Having pointed out that only seventeen percent of the country backed the recently failed legislation, Jordan said he believes if they had followed standard procedure, including hearings, they could have come up with a bill supported by far more than seventeen percent of America. “We were willing to accept so much that we weren’t really doing cartwheels over in the legislation,” said Freedom Caucus member Jordan. “If we could simply point to the fact premiums are going to come down and without getting into the weeds, there are a few key regulations that have to get repealed in Obamacare in order for premiums to come down. ” “One is this mandated coverages that every policy has to offer, ” he added. “If every policy has to cover everything, it just drives up the cost. You don’t really have families being able to select the kind of insurance plan that fits their needs. So that’s one regulation that has to go. ” Jordan had previously pointed out that rates were going to continue to rise for years under the recently failed GOP plan. He also cited “community rating” as a problem because it prevents flexibility in pricing and the need for a “safety net” provision for     individuals. “That’s the way you design a system that actually is   brings down costs for most middle class families. In the end, that’s all we were trying to get to. And we couldn’t even get those regulations included in the repeal part of the legislation,” Jordan said. He insisted that with some simple tweaking, Republicans can still come together to pass healthcare reform more popular with America than the recent plan. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742561979.2741952}