{"duration": 0.052840232849121094, "input_args": {"text": "'  \\nDonald Trump’s shocking presidential win last night has left most of the world in mortified awe, but one leader seems especially pleased by the upset, perhaps because he had something to do with it. \\nJust hours after Trump took the stage to deliver his acceptance speech, Russian President Vladimir Putin congratulated the president-elect on his win. It was only three weeks ago, at the third presidential debate that Hillary Clinton said Trump would be Putin’s “puppet” and it looks like Putin is eager to take on the master’s role. \\nSpeaking from the Kremlin, Putin specifically praised Trump on his vow to restore relations with Russia: \\n“We understand the way to that will be difficult, taking into account the current state of degradation of relations between the US and Russia. As I have repeatedly said, that is not our fault that Russia-US relations are in that state. Russia is ready and wants to restore the fully-fledged relations with the US. I repeat we understand this will be difficult, but we are ready to play our part in it.” \\nAnd what part will Trump play? Ask Sergei Markov. The pro-Kremlin political analyst, who was equally thrilled by the election outcome, is confident Trump will have America do a 180 on the Syrian debacle and join Russia in its backing of Syrian president, Bashar al-Assad. \\nThere is every reason to believe the analyst, too. At the annual Alfred E. Smith Memorial Foundation Dinner, Hillary Clinton joked that Trump was ‘ healthy as a horse – you know the one Vladimir Putin rides on’. It looks like she might be right. Trump has always seemed a bit cozy with the Russian president , but now he may actually owe him a debt of gratitude for the Kremlin’s part in his win. \\nIn relation to Russian interference in the election, Markov said, “Maybe we helped a bit with WikiLeaks.” \\nUp until now the Kremlin has denied any involvement; Putin calling The Obama administration’s accusations they hacked Democratic Party emails, then leaking them to WikiLeaks, as “nonsense” claims. \\nMarkov did admit it might not be all smooth riding, adding, “Putin is a macho, Trump is also a macho. Maybe it could be a problem.” \\nAlexei Venediktov, the editor-in-chief of Russia’s liberal Echo of Moscow radio, agrees: “Putin doesn’t like unpredictability and Trump is the definition of unpredictability.” \\nI guess we will just have to see who will be riding whom. \\n\\nFeatured image via CNN screengrab Share this Article!'"}, "time": 1742561707.7810612}