{"duration": 0.02151179313659668, "input_args": {"text": "'Former presidential candidate Sen. Bernie Sanders had a message for California’s Democrats on Saturday: “Please lead the country and pass the   bill. ”[Sanders was speaking in Beverly Hills, according to the Sacramento Bee, where he was accepting an award from Consumer Watchdog, a   organization devoted to consumer advocacy.  Democrats, who hold a   majority in the state legislature that allows them to pass bills virtually at will, are currently considering a “ ” health care system, also called “socialized medicine,” in which the state would cover the cost of health insurance and health care for everybody in California. The “Healthy California Act,” SB 562, promises: “to guarantee that every resident of California will receive comprehensive healthcare services. It’s like Medicare for All. ” The legislation took a step towards passage late last month with a hearing in the State Senate. The Senate Health Committee voted   to approve the bill, which will now continue its circuitous pass through the State Senate before proceeding to a final vote. Town halls and rallies have been staged across the state to support the legislation, which has the backing of the powerful California nursing unions. However, Governor Jerry Brown is opposed to the idea, which he said in March was too costly. “Where do you get the extra money? This is the whole question,” he told the Los Angeles Times. Sanders’s home state of Vermont recently tried to implement a   system  —   and failed. Sanders was evidently undeterred by the experience. “The great state of California can send a message that will be heard all over this country, and all over the world if you pass   here,” he said on Saturday. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak. This post has been updated to note Vermont’s   experience.'"}, "time": 1742628467.8494265}