{"duration": 0.07947278022766113, "input_args": {"text": "'SANTA BARBARA, Calif.  —   On one of their earliest dates, the comedians Natasha Leggero and Moshe Kasher knew they were meant for each other. During that fateful assignation, Ms. Leggero was searching Mr. Kasher’s car for a lost cigarette when she instead found a pair of women’s underwear  —   not hers. Mr. Kasher, who acknowledged that they belonged to a previous paramour, said that he could still remember his panicked reaction. “All of my focus was on going, like: ‘What? I don’t know what those are,’” he said over a recent dinner with Ms. Leggero here. “‘I don’t know what objects are. I don’t know what fabric is. ’” Ms. Leggero, who was not especially angry then or now, laughed at Mr. Kasher’s recollection. “That’s a good joke  —   you should do that in your act,” she said. Now married, Ms. Leggero, a saucy standup, actress and   of the Comedy Central historical satire “Another Period,” and Mr. Kasher, a hyperverbal performer, podcaster and creative contributor to films like “Zoolander 2,” have found further ways to strengthen their union. Though they had a proper honeymoon after their Oct. 11 nuptials, they have spent the past weeks on what they are calling their “Honeymoon Tour. ” At these comedy shows in comfortable destinations, they perform their individual routines, then appear together. (The tour started on May 22 in Honolulu and continues through Monday in Los Angeles.) Yes, this tour, which offers the sufficiently rare sight of      on the same bill, allows them to earn money while vacationing at luxury resorts (like the San Ysidro Ranch, where they were now dining). It is also an opportunity for them to bond as a couple, and to stave off feelings of isolation that many comedians experience. “It is the ideal way to tour,” Mr. Kasher said. “Except for having to split the money, this couldn’t be better. ” Later that night, they performed at Velvet Jones, a Santa Barbara nightclub where Ms. Leggero joked about having never wanted to marry and having no desire to become pregnant. (“You have to stop drinking in public,” she explained.) Mr. Kasher needled her for claiming that he had performed on HBO. (“I’ve never been on HBO,” he said. “That’s my wife. ”) Over dinner, the two spoke with more tenderness for each other. Before they began dating, Ms. Leggero said, she was “a serial monogamist” Mr. Kasher said he was “busy, romantically” (by which, he added, he meant “very promiscuous”). But, from afar, they appreciated each other’s work, and Mr. Kasher said he considered Ms. Leggero the type of friend “that you’ll text every six months to remind them that you’re around, if they’re ever single. ” Chelsea Peretti, the “Brooklyn  ” star and a longtime friend of the couple, said that they were compatible because they were both “blunt hippies. ” “They have this weird common ground,” Ms. Peretti said in a telephone interview. “They both have this spiritual side and this side that likes to be indulgent. Moshe does Burning Man, and Natasha will do spa baths that I don’t venture into. But then they both can be cutting and outspoken. ” Despite the misgivings about marriage she joked about, Ms. Leggero said that when they were dating, she felt they were “on the marriage track. ” But Mr. Kasher, who has written in his memoir, “Kasher in the Rye,” about growing up in Oakland, Calif. and Brooklyn as a child of divorced parents, said he had felt uncertain about the relationship models he’d seen in his life. Ms. Leggero, who grew up in Rockford, Ill. was more guarded about her upbringing but agreed with Mr. Kasher’s assessment that her parents were also volatile. (“Next question,” she said softly.) Mr. Kasher compared his hesitation to his fear, earlier in his career, of moving from the Bay Area to Los Angeles, where they now live. “Somebody said to me, ‘You know, you can just move back,’” he explained. “I was like: ‘Huh. Yeah.’ The same thing with marriage. Why not give it a whirl? And if you fail, you can just get a divorce. ” The wedding was a traditional Jewish ceremony  —   Ms. Leggero converted from Roman Catholicism  —   and took place at the couple’s house in the Silver Lake neighborhood of Los Angeles. “Because we’re comedians, we agreed: No bits at the wedding,” Mr. Kasher said. But, Ms. Leggero added, “He let me have just one. ” After their vows, the couple momentarily disappeared, then reappeared to mock a   rite by holding up a sheet that said, “She’s a virgin!” Ms. Peretti, who married the comedian Jordan Peele (“Key  Peele”) this year, said Ms. Leggero and Mr. Kasher’s ceremony was so enjoyable that it made her question her decision to elope with Mr. Peele. “It was bittersweet, going to a fun wedding,” Ms. Peretti said. “You go, ‘Ugh, are we missing out on family and friends?’ And then ultimately, we decided, ‘Nah. ’” As professional partners, Ms. Leggero and Mr. Kasher said they did not compete over material or industry stature, though Mr. Kasher, who also works on “Another Period,” said wryly that he can sometimes feel “a power imbalance” there. “I make her scream ‘executive producer’ when we’re making love,” he said. “I need a constant reassurance that I’m valued and it wasn’t nepotism. ” Though they could point to only a few examples of other comic spouses who have traveled and performed together  —   vintage duos like Gracie Allen and George Burns or Lucille Ball and Desi Arnaz, or contemporaries like Bonnie McFarlane and Rich Vos  —   they said their tour let them lean on each other in lonely moments on the road. Looking back on a New Year’s Eve when he was performing solo in Grand Rapids, Mich. Mr. Kasher said: “At 12:05, I was in the lobby of a Courtyard Marriott with some Doritos and a Diet Coke, headed to my room to watch Netflix. It’s nice to be on the road and do these shows. ” “That’s so sad,” Ms. Leggero said. If there is any downside to marital bliss, they say, it is the fear that happiness will take away the tension and the skepticism that shape their comedic perspectives. “When you become happy, and your life is becoming more solid and stable, it is a little harder,” Ms. Leggero said. “I felt like I was much funnier when I had, like, $30 in my account. ” Of course, if they need to make their lives complicated again, they can have a baby. “There’s definitely people in comedy that have had children for material,” Mr. Kasher said. Her routine notwithstanding, Ms. Leggero said she was ready to embrace having a child, but added, “I’m not having it for material. ” Mr. Kasher replied, “We’re naming it Material. ”'"}, "time": 1742628374.2892914}