{"duration": 0.04692554473876953, "input_args": {"text": "'Former Breitbart Senior Editor MILO has announced the founding of his new $12 million dollar media company, MILO, Inc. [In a Facebook post, MILO outlined his new business plan and the $12 million investment funding that it has received from undisclosed investors. He has reportedly hired a seasoned media executive to lead the new   team that will be based out of Miami, Florida. The new company will manage MILO‘s books, tours, merchandise and radio and TV opportunities.  In a statement, MILO said, “This isn’t some vanity nameplate on a personal blog. This is a fully   talent factory and management company dedicated to the destruction of political correctness and the progressive left. I will spend every waking moment of the rest of my life making the lives of journalists, professors, politicians, feminists, Black Lives Matter activists and other professional victims a living hell. Free speech is back  —   and it is fabulous. ” The statement also outlined MILO’s plans for free speech week at Berkeley, “MILO will release more details about Free Speech Week, his book, DANGEROUS, his new tour and the media company at a   “Cinco de Milo” party in Florida on May 5, with occasional updates between now and then on how fans and enemies can see, hear, and read his work. ” MILO also clarified the current status of the Privilege Grant, “MILO‘s charity, the Yiannopoulos Privilege Grant, recently announced the 10 recipients of its pilot grant program. Each recipient will receive $2, 500 towards his higher education. A second grant will occur in the second half of 2017. Please visit privilegegrant.  for more information. ” MILO said, “MILO, Inc. will bring laughter and war to every corner of America in dozens of different formats. I will fight harder and look hotter than anyone else on the political right. And I will do more damage to the political left than anyone else in American culture. ” Read the full Facebook post here. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742564399.6424327}