{"duration": 0.059157609939575195, "input_args": {"text": "'Sheldon Silver, who rose from the Lower East Side of Manhattan to become one of the state’s most powerful and feared politicians as speaker of the New York Assembly, was sentenced on Tuesday to 12 years in prison in a case that came to symbolize Albany’s culture of graft. The conviction of Mr. Silver, 72, served as a capstone to a campaign against public corruption by Preet Bharara, the United States attorney for the Southern District of New York, which has led to more than a dozen state lawmakers’ being convicted or pleading guilty. But none had the power, cachet or longevity that Mr. Silver, a Democrat, had enjoyed, and prosecutors sought to make an example of him. They asked that he receive a sentence greater than the terms that had been “imposed on other New York State legislators convicted of public corruption offenses. ” The longest such sentence cited by the government was 14 years, the term imposed last year in the case of another former Democratic assemblyman, William F. Boyland Jr. who was tried and convicted in federal court in Brooklyn. Judge Valerie E. Caproni of Federal District Court in Manhattan noted that even before Mr. Silver’s arrest, when some of his fellow legislators had been arrested on corruption charges, he remained undeterred. “One would think that the image of Mr. Silver’s colleagues being arrested and led off to jail would have caused someone who was basically honest to reappraise what was going on,” Judge Caproni said. Instead, she said, Mr. Silver “stopped nothing,” continuing to lie to his staff and to the press while holding himself out as “a paragon of virtue. ” Judge Caproni said that there had been an “incalculable, intangible harm” to the people of New York, and that the cumulative effect of public corruption “makes the public very cynical. ” She then listed some of Mr. Silver’s misdeeds and addressed him directly: “Mr. Silver, those are not the actions of a basically honest person. ” In court, Carrie H. Cohen, an assistant United States attorney, had asked that Mr. Silver’s sentence “reflect the massive damage caused to the public by his crimes. ” The sentence, Ms. Cohen continued, should send a message that this is not the way “business is done in Albany, or at least that it shouldn’t be, and that no one, including Sheldon Silver, is above the law. ” Mr. Silver briefly addressed the court before his sentence was delivered, saying he had let down his constituents, family and colleagues. “I’m truly, truly sorry for that,” he said. Mr. Silver was convicted on Nov. 30 of charges that included honest services fraud, money laundering and extortion. Upon his conviction, he forfeited his Assembly seat. Two weeks later, Dean G. Skelos, who as majority leader had been Mr. Silver’s Republican counterpart in the State Senate, was also convicted of corruption. Mr. Skelos is to be sentenced on May 12 a week later, John L. Sampson, a former leader of the Senate Democrats, will face his own sentencing. Prosecutors’ scrutiny of New York lawmakers continues: Several inquiries are now focused on possible wrongdoing connected to the administrations of Gov. Andrew M. Cuomo and Mayor Bill de Blasio, both Democrats. To date, however, Mr. Silver’s precipitous fall has no recent rival in the world of New York politics. In a statement issued moments after the sentencing, Mr. Bharara said that the “stiff sentence is a just and fitting end to Sheldon Silver’s long career of corruption. ” Mr. Silver had served for more than two decades as the Assembly speaker, imposing his will on matters large and small he had a reputation as a staunch defender of New York City, a shrewd negotiator in budget talks and, at times, a recalcitrant opponent of anything he disliked. But during a   trial last fall, a different side of Mr. Silver emerged. Evidence showed that he had obtained nearly $4 million in illicit fees in return for taking official actions that benefited a prominent cancer researcher, Dr. Robert N. Taub, at Columbia University, and two real estate developers, Glenwood Management and the Witkoff Group. Mr. Silver had expressed regret that his actions made the State Capitol the object of ridicule. In a letter sent last month to Judge Caproni, he offered an emotional apology, saying that he had “failed the people of New York. ” His lawyers had argued that the former speaker should be allowed to use his “unique talents” to benefit others, and that a sentence that incorporates “extensive community service and little  —   if any  —   incarceration could do that. ” Mr. Silver’s lawyers had suggested that he could work with the Fortune Society to help current and former inmates find jobs. One of Mr. Silver’s lawyers, Joel Cohen, told the judge that his client had been “devastated” and “crushed” by everything that had happened. Notwithstanding everything he has done, Mr. Cohen said, “his obituary has already been written. ” Another prosecutor, Howard S. Master, on Tuesday questioned the authenticity of Mr. Silver’s contrition, noting he had insisted that he would be exonerated “until the very moment of the jury’s verdict. ” Judge Caproni, citing Mr. Silver’s age, said she would not adhere to sentencing guidelines that recommended a term of roughly 22 to 27 years, calling such a sentence “draconian and unjust. ” The court’s probation office had recommended a   sentence. The judge ordered that Mr. Silver forfeit more than $5 million in proceeds from his crimes and pay a $1. 75 million fine. She rejected a defense assertion that Mr. Silver’s actions had not caused “discernible harm. ” She said the specter of corruption made it impossible to know whether government officials were making decisions for the right reasons or for personal financial gain. His crimes “cast a shadow over everything he has done and has thrown into doubt every difficult decision any legislator has ever made,” the judge said. Mr. Silver must surrender himself by noon on July 1 his lawyers have requested that he serve at the Federal Correctional Institution in Otisville, N. Y. a prison known for its familiarity with the housing of prisoners who, like Mr. Silver, are Orthodox Jews. Governor Cuomo said on Tuesday: “Today’s decision sent a simple message that officials who abuse the public’s trust will be held accountable. Justice was served. ” Last month, prosecutors, in a written submission to the judge, offered what they said was additional evidence of the ways Mr. Silver had abused his office “for personal benefit,” by helping two women with whom he had conducted extramarital affairs. One of the women had regularly lobbied Mr. Silver on behalf of clients with business before the state he had “used his official position,” prosecutors said, to help the other woman get a state job. Mr. Silver’s lawyers said after the hearing that his case would be appealed. Mr. Silver, addressing a crowd of reporters, said, “I believe in the justice system in this nation, and we’ll pursue whatever remedies the system makes available. ”'"}, "time": 1742628596.3171928}