{"duration": 0.07953119277954102, "input_args": {"text": "'In a ruling issued on Wednesday afternoon, a federal judge, and Obama appointee, prevented the President of the United States from enforcing his own executive order to protect the nation from migrants from   countries. [The judge then prevented every other judge and every other state from following the President’s order, the judge making himself a   Supreme Court and substitute President.  The judge then held that American universities and immigrants living here can prohibit America from ever limiting immigration from   countries, claiming the First Amendment gives   nations a right of immigration to America. Such arrogance and abuse of authority sound familiar? Such First Amendment favoritism toward Islam sound familiar? Well, Obama did appoint this judge, and a rule of thumb with federal judges is they tend to mirror the psychologies of the man who appointed them. The judge’s ruling is completely lawless, mirroring Obama’s deep state allies in his shadow government’s attempt to sabotage the Trump presidency. There is no precedent for the court’s order. In fact, every precedent is against the court’s order just read the detailed logic and scholastic citation of proper governing legal authorities from the decision of a moderately liberal Boston judge who upheld every part of Trump’s prior order. To give you an idea of how lawless the decision is, just try to find the analogous case the Hawaii judge cites for his ruling there is none, not one single prior example of another judge ever doing what this Judge did to the extent he did it. To give you another example of how baseless the court’s ruling is, even liberal law professors and scribes criticized the more limited Ninth Circuit decision that this Hawaii judge goes far beyond. Liberal law professor Turley noted Trump should win a challenge against that ruling. Liberal democrat professor Alan Dershowitz noted the same. Liberal law scribe Jeffrey Toobin conceded the same. Here are a few reasons why: First, nationwide injunctions for   plaintiffs are not supposed to happen. A district judge presides over his district, not the nation. He should not overrule other judges, nor dictate his opinions on the whole nation. The law does not make him a single judge Supreme Court. The Supreme Court itself warned against issuing any relief not individually and specifically necessary to the plaintiffs before the court. Noting that “neither declaratory nor injunctive relief can directly interfere with enforcement of contested statutes or ordinances except with respect to the particular federal plaintiffs,” the Supreme Court warned against extending its reach beyond “the particular federal plaintiffs” in the case. The Ninth Circuit itself even admits this. The “principles of comity” compel that a court should not grant national relief when doing so would “create tensions” with courts in other circuits and “would encourage forum shopping. ” The Ninth Circuit further reinforced that: “A federal court  …    may not attempt to determine the rights of parties not before the court. ” What kind of case was that the Ninth Circuit saying not to extend your ruling beyond the plaintiffs in front of you? An immigration case (Nat’l Cir. for Immigration Rights v. INS, 743 F. 2d 1365 (9th Cir. 1984). The Ninth Circuit repeated this principle again and again. That is why the Supreme Court reversed a California judge’s order just like this Hawaii judge’s order  —   imposing a national ban beyond his limited district jurisdiction of the parties before him. Second, there is no constitutional right to a visa or a right of immigration or emigration. A quick recap of key Supreme Court decisions explains why. Aliens “outside the country receive no constitutional protection. ” The Supreme Court repeatedly held an alien seeking initial admission to the United States “requests a privilege, and has no constitutional rights regarding his application, for the power to admit or exclude aliens is a sovereign prerogative. ” Thus, the President “may shut out aliens” whenever the President determine such “entry would be prejudicial to the interests of the United States. ” Congress expressly authorized this Presidential action in the one statute the Ninth Circuit tried to hid in its prior decision, cited above at 8 U. S. C. 1182. The actions of the President in respect of enforcing this law “are largely immune from judicial inquiry or interference. ” This is because the Constitution entrusts “the power regulate immigration” exclusively “to the political branches of the Federal Government. ” As the Supreme Court recently reiterated during Clinton’s presidency: judicial “deference to the Executive Branch is especially appropriate in the immigration context” given the “sensitive political functions that implicate questions of foreign relations. ” Admission into America is a privilege, not a right. Congress gave the President broad statutory authority to exclude any aliens he saw fit to. A full recitation of that law is useful, because it is the one law the Hawaii judge, like the Ninth Circuit, hid from: (f) Suspension of entry or imposition of restrictions by President, Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Whenever the Attorney General finds that a commercial airline has failed to comply with regulations of the Attorney General relating to requirements of airlines for the detection of fraudulent documents used by passengers traveling to the United States (including the training of personnel in such detection) the Attorney General may suspend the entry of some or all aliens transported to the United States by such airline. The law is clear in the power it gives the President, in the statute cited above  —   8 U. S. C. 1182( f). Like the Ninth Circuit decision before, the Hawaii judge goes out of his way to pretend this statute does not exist. Indeed, it is never addressed in any real way in the court’s entire opinion (much of which appeared   prior to the oral argument). Just as we have a right to decide which strangers enter our home and who sleeps next to our daughters’ bedroom or eats our family’s food, we as a country enjoy the democratic right to decide who enters our country, who lives next to us as a neighbor, and who enjoys the fruits of our ancestral inheritance. The Hawaii Obama judge went much further in the opposite direction: he claimed an immigrant here has a right to bring in whatever other immigrants he wants, even citizens from      failed, corrupted states that cannot vet or screen   aliens entering America. Ask San Bernardino how that worked out. Third, the First Amendment does not apply to foreign aliens. That is how we kept   anarchists out of the nation and   communists out of the nation. That is how every President for more than a century limited migrants based on ideology or statehood. That is why we were much more successful than Europe in limiting the   violence (that led Europe into World War I) and in limiting communist internal sabotage (that led much of eastern Europe into communist totalitarianism). Every federal court followed that process in limiting immigration from   nations after  . This Hawaii court’s decision directly conflicts with those Circuits but, per usual, it never even mentions any of those authorities. As the Second Circuit noted: “one major threat of terrorist attacks comes from radical Islamic groups. The September 11 attacks were facilitated by violations of immigration laws by aliens from predominantly Muslim nations. The Program was clearly tailored to those facts. ” This court’s ruling would overturn all of that, and basically claims every president since Teddy Roosevelt violated the First Amendment in our immigration policies. Put simply, the Hawaii federal judge ruled that because the imam was Muslim and his   migrant visas   came from   nations, the First Amendment gave him a special right to bring whomever he wanted into the country, even from   countries in security compromised states the President recognized as a direct threat to the peace of the people. The First Amendment has never applied to a right of immigration of foreign aliens, nor does it compel religious favoritism toward Muslims. This is the new left’s interpretation of the Constitution, and it is as perilous to our politics as the deep state within and radical Islam abroad. The Hawaii Obama judge didn’t interpret the Constitution he rewrote it, usurping to himself the sole power to control borders, then delegated the exercise of that power to a Muslim imam and his free visa wish list. The judge dishonored the rule of law in his order and disrespected our legal traditions and governing legal authorities in his reasoning for it. He effectively declared himself king and executioner. Meet the new left’s America: foreigners first, Muslims preferred, law last, elections irrelevant. Robert Barnes is a trial lawyer with high profile wins in constitutional, criminal, and civil law. You can follow him @Barnes_Law.'"}, "time": 1742628447.1306167}