{"duration": 0.0848381519317627, "input_args": {"text": "'A mural painted on state property near San Diego —  depicting an ICE Agent strangling a Mexican worker as he sends money home —  is stirring up a new controversy, according to a San Diego Union Tribune news story. [The new mural is located on the south support pillar under Coronado Bridge at the Interstate 5 underpass in what is now called, “Chicano Park. ”  The location of the park was scheduled to become a new CHP substation in the early 1970’s, but protestors from the “Barrio Logan” community staved off the plan, facing off against the state —  seizing the land for “chicanos” and demanding that a park be constructed to showcase chicano art. The mural —  painted by Salvador “Sal” Barajas —  one of the artists who painted the first “Historical Mural” in the park in 1973 that highlights key figures and history of the Chicano movement, was commissioned by a border activist group known as Border Angels. Border Angel’s founder, Enrigue Morones has been trying to raise the $10, 000 for nearly a decade —  but credits Trumps election with the new enthusiasm. Morones spoke to NBC 7 —  a local NBC affiliate out of San Diego: “Since November 8 things have changed  …    People are outraged, more volunteers, more funds. ” He added, “We’re totally opposed to the wall   …     We know that the wall kills people. ” Not everyone is happy about the new mural.  Some San Diego county residents are outraged —  calling the mural ‘incendiary’ and ‘ .’ Suellen Shea of Vista, who took issue with some of the imagery Barajas used, told the  :  “The artist has talent, but, in my opinion, much of it is offensive and   especially the ICE agent choking the migrant worker,” Shea reportedly said via email. “American Citizens want safety  sovereignty (enforced borders) for our country. Nothing strange or racist about that  —   Mexico does too. ” Mural painter Barajas thinks the graphic violence depicted is justified, according to the the Los Angeles Times:  “One hand represents U. S. Immigration and Customs Enforcement, which is responsible for deporting people from the U. S. [and t]he other hand represents Mexican government officials, whose corruption makes it necessary for Mexicans to migrate for work. ” Barajas admits that the “text ‘No Border Wall’ was one of the last things added to the piece,” and is likely what inspired   donors to put up the money to denounce the looming border wall. San Diego has become the locus of the fight over President Trump’s wall over the past few months —  as prototypes will soon be constructed nearby in order to meet DHS’s June 1st target date.  Organized protests and violent resistance is expected by the agency —  and contractors are required to provide adequate security as part of their bids. A number of Californians have taken to social media to make their opposition known reports the LA Times.   “San Diego has many parks,” wrote Carol Hamilton, of Imperial Beach. “Only one is splattered with garish posters and   slurs  —   Chicano Park. A national shrine? I don’t think so. It’s time to whitewash it and use it as a park and not for politics. ” Chicano Park is not under the control of the city or county of San Diego —  the land on which it stands is part of a state easement controlled by CalTrans, who reportedly could revoke the right for any mural to be on California state property. Tim Donnelly is a former California State Assemblyman and author who is doing a book tour for his new book: Patriot Not Politician: Win or Go Homeless. He ran for governor in 2014. FaceBook: https:  . facebook. . donnelly.  Twitter:  @PatriotNotPol'"}, "time": 1742562510.1835558}