{"duration": 0.1298072338104248, "input_args": {"text": "'Trump rape accuser skips press conference, citing threats ‹ › GPD is our General Posting Department whereby we share posts from other sources along with general information with our readers. It is managed by our Editorial Board NATO and Turkey: Time to admit reality By GPD on November 4, 2016 By DAVID ROMANO \\nThe North Atlantic Treaty Organization (NATO) was created after World War Two to unite democratic states or Western Europe and North America against Soviet expansionism. The alliance admitted Turkey in 1952, two years after the country transitioned into a democratic electoral system of government. \\nToday, in contrast, neither the Soviet Union nor a democratic Turkey exist. Going on with the charade of NATO may, under the circumstances, do more harm than good. Russia today remains much smaller and less powerful than the Soviet empire was, and bilateral arrangements with countries looking for protection against their eastern neighbor should suffice. From the Russian point of view, a large alliance apparently arrayed against it, working hard to encircle Russia, provokes understandable concerns. The West should consider asking Russia what it would concede in return for the dissolution of the alliance. \\nIn the case of Turkey, the country’s NATO membership also increasingly makes a mockery of the alliance’s charter and places significant liabilities on the shoulders of other members. Perusing the NATO charter, one finds statements such as: \\nThe Parties to this…are determined to safeguard the freedom, common heritage and civilisation of their peoples, founded on the principles of democracy, individual liberty and the rule of law…..The Parties will contribute toward the further development of peaceful and friendly international relations by strengthening their free institutions, by bringing about a better understanding of the principles upon which these institutions are founded, and by promoting conditions of stability and well-being. \\nAlthough Turkey’s military coups in 1960, 1971 and 1980 briefly interrupted democracy there, the military made good on its promises to quickly return power to elected civilian control. Today, in contrast, it seems increasingly clear that President Erdogan will never relinquish power. His purges and complete subversion of democratic institutions and individual liberties may take decades to repair, if ever. \\nThis process began well before the failed July 15 coup in Turkey, but that event provided a pretext for taking the purges in Turkey to new heights. Under new “emergency rule” legislation, some 200,000 civil servants have been dismissed with scant evidence of wrongdoing. Around 2000 academics lost their posts, including just about every university dean – replacements for which will all be appointed directly by Mr. Erdogan. Many of the academics dismissed were only guilty of signing a petition for peace between the government and the Kurdistan Workers’ Party (PKK). \\nMr. Erdogan’s government also shut down some 170 media outlets, including a Kurdish children’s broadcaster. Remaining media, including Turkey most venerable newspaper ( Cumhuriyet ) have seen their editors and journalists arrested and imprisoned. People now face arrest and imprisonment without charge for up to 30 days, and the state can now record conversations between those arrested and their lawyers (when they finally get so see one), with the recordings then provided to prosecutors. According to Human Rights Watch, torture has also now returned to Turkish prisons, where 27 elected mayors from mostly Kurdish cities like Diyarbakir now reside. Judges and prosecutors doing anything even mildly displeasing to the ruling party have been summarily dismissed or arrested themselves, only to be replaced with more pliant sycophants (laws were also changed to allow the ruling party to appoint even High Court judges). Hundreds of generals and officers are behind bars, to the point that the Turkish air force can only operate a portion of its fighter planes. \\nYour columnist could go on, of course, but the point seems clear enough – “freedom, democracy, individual liberty and the rule of law” have withered in Turkey. What’s more, Ankara’s actions and foreign policy threaten NATO. This became abundantly clear when Turkey shot down a Russian fighter plane last year, threatening to drag the alliance into a war it did not want. Although Turkey has since reconciled with Russia, Ankara threatens or even appears poised to go to war with a number actors helping other NATO countries – Iraq, the Democratic Union Party of Syria (PYD), and even Greece, a NATO member itself (Mr. Erdogan recently fumed that the 1923 Treaty of Lausanne made a mistake in giving Greece islands off Turkey’s Aegean coast). During the July 15 attempted coup, Ankara cut off electricity to U.S. forces at Incirlik air base (where they guard nuclear weapons, among other things). Mr. Erdogan and his government suggested that the United States either condoned the coup or even had a role in it. \\nCombined with Ankara’s support for a number of Islamist groups in the region, including some fairly hard-core Jihadi outfits in Syria, these developments ring a lot of alarm bells in Brussels and Washington. Rep. Dana Rohrabacher, the Republican chair of a House subcommittee on emerging threats, expressed such concerns a few weeks ago when he stated that “Ten years ago Turkey was a solid NATO ally and a staunch opponent of radical Islam and a friend of the United States, and today that’s all in question… Erdogan is purging pro-Western people throughout his country who are in positions of influence. He himself has become more aggressive in his Islamic beliefs, and there’s reason for us to be seriously concerned.” \\nThe NATO charter lacks any provisions for expelling members, however, and such a public break is probably not in any member’s interest. The better approach would be to disband NATO and put something new together. American policy makers will protest that Washington can’t afford to lose Turkey. This ignores the fact that they have already lost the Turks to Mr. Erdogan and his ilk – they just haven’t officially left yet. \\n\\nDavid Romano has been a Rudaw columnist since 2010. He holds the Thomas G. Strong Professor of Middle East Politics at Missouri State University and is the author of numerous publications on the Kurds and the Middle East. \\nThe views expressed in this article are those of the author and do not necessarily reflect the position of Rudaw. \\nRelated Posts: No Related Posts The   GPD   50 Reads Filed under Politics  '"}, "time": 1742562167.87217}