{"duration": 0.07914233207702637, "input_args": {"text": "\"Headlines and news reports have been flooded with accounts of so-called grassroots protests taking place in major cities across the US. These protests are in opposition to the November 8th national election where the citizens of the United States selected Donald Trump to be the 45th president.\\n\\n\\nGrassroots movement or orchestrated globalist takeover? \\nProtesters believe that the election of Trump is unfathomable and are refusing to accept the electoral college system put in place by the country's founding fathers to prevent tyrannical rule by high concentrations of the population. As they refuse to accept many of the rights given in the Constitution for their make-believe rights, it is no surprise that they would have no respect for the foreknowledge of our founders and their development of the electoral college.\\n\\nWhile meaning to protest what they see as tyrannical rule under President-Elect Donald Trump, many of the misinformed marchers are playing into the hand of the globalist billionaire George Soros anad his plan to single-handedly control all the world's major governments.\\n\\n\\nWhat is seen happening across America is reminiscent of the protests around the world that Soros has orchestrated in his quest to gain control of all world economies and politics. Similar protests have been carried out in Ukraine as well as the Arab spring that put Soros' puppets in control of those countries and played directly into his plans of world domination.\\n\\nMost news organizations are trying to paint the American protests as being young people, LGBT supporters, minorities, and women that are concerned about their freedoms and protection under a Trump administration. These reports try to give the impression that these people have come together organically and coincidentally formed large groups to gain the media's attention. Many patriots in these cities, however, are reporting that the protesters they are seeing are not even from those towns but rather bused in to inflate numbers and incite the meager crowds that would form on their own . \\n\\nWATCH THE VIDEO: Orchestrating large demonstrations in multiple cities throughout the country would need major planning and massive funding. Soros' experience with leading such movements has been well documented in the past, and these protests fit perfectly into the modus operandi of the would-be leader of a one-world government.\\n\\nThe website MoveOn. Org is a common tool of the globalist to enlist those who are in on the farce as well as capture the minds of a well-meaning idealist who need only a small shove in the direction of anarchy and one world rule. The site has been proven to be funded by Soros, and many of the protests which disrupt traffic and businesses in major cities can be attributed to the site's involvement.\\n\\nNot only does Soros use the common citizens to play into his game, but he also has many of the world's leaders in his arsenal of political puppets he uses to change world markets as he chooses. Hillary Clinton was confirmed to be one of these puppets with the Wikileaks release of private email communications between her and Soros. One of these emails plainly details how Soros was behind Clinton's choosing of Miroslav Lajcak to mediate throughout his orchestrated unrest in Albania.\\n\\nAmericans must remain vigilant and fight against the globalists' attempted coup to take over the United States republic as it was formed by the founding fathers and their inspired foresight into our future. \\nDisclose TV SOURCE \""}, "time": 1742561863.352699}