{"duration": 0.04965615272521973, "input_args": {"text": "'First case of demonetisation-related HIV after man has unprotected sex with an ATM machine Posted on Tweet \\n10th day into demonetisation and things are going from bad to worse. There is mayhem everywhere. We have already had reports of suicides, murders, robberies, cyclones, earthquakes, and Rohit Sharma’s ouster from Indian squad because of demonetisation, and now we have the first case of HIV that this dreadful ban has caused. \\nThe incident happened when a man contracted the disease from an already infected ATM machine in Mumbai. Despite numerous warnings issued by India Today and other media houses about ATM keypads transmitting the virus, he went to an ATM and touched the dangerous keypad. He was later diagnosed with HIV positive. \\n“So did he actually have sex with the machine?” we asked an insider from India Today. \\n“No, but withdrawing cash is as good as having sex with the machine. You have more or less the same feeling when you get the cash in your hand,” he affirmed. \\n“Ok that’s interesting. So the engineering students are not virgins anymore and they can proudly brag about their sex lives.” \\n“Well, technically speaking, yes, they can.” \\n“So, who is at risk of catching the virus? Someone with a poor immune system?” \\n“No, anyone who is withdrawing cash from an ATM.” \\n“You mean, balance inquiries and other transactions are safe, right?” \\n“Who stands in the queue for 3 hours to check balance?” \\n“Oh ok, you are talking about the current scenario.” \\n“Yes, people should avoid an ATM machine at any cost because it may cause STD as our researcher suggested, and once you are infected with an STD, you become more susceptible to HIV infection.” \\n“And who is the researcher at India Today you are referring to? Is it Rajdeep Sardesai?” \\n“No, he is in Goa. The person who published the report is Jane Carlton.” \\n“Ok but the report was published in 2014. Why are you linking it to currency ban?” \\n“Because it’s always relevant.” \\n“But what made you search the report two years after it was published and exactly at a time when people are desperately trying to use ATMs? We are just curious, what was going through your mind when you decided to look it up and what were the keywords you entered into Google that returned this report?” \\n“Listen, I think I am done with the interview. If you have more questions then ask Rajdeep Sardesai. I am going to call him. Here are your boxing gloves.” \\n“But you said he is in Goa,” we hurriedly wrapped-up the interview.'"}, "time": 1742561687.111668}