{"duration": 0.04754781723022461, "input_args": {"text": "'Thu, 27 Oct 2016 03:29 UTC © Chinchilla News A young pygmy elephant walking near her dead mother in Gunung Rara Forest Reserve in Malaysia\\'s sabah state on Borneo Island. The world is hurtling towards the first mass extinction of animal life since the dinosaurs were wiped out 65 million years ago, according to the most comprehensive survey of wildlife ever carried out. By 2020, the populations of mammals, birds, fish, reptiles and other vertebrate species are on course to have fallen by more than two-thirds over a period of just 50 years, the Living Planet report found. The current rate of extinction is about 100 times faster than is considered normal - greater than during some of the previous five mass extinctions in the Earth\\'s history. While the dinosaurs probably died out because a giant meteor hit the planet, just one species is the cause of the current problems: humans. This is one of the reasons why geologists are close to declaring a new epoch, called the Anthropocene after the Greek for human, because the fossils of so many extinct animals will one day form a noticeable, global band in the rocks of the future. The Living Planet report , produced by conservation charity WWF and the Zoological Society of London (ZSL), analysed data for 3,706 species in what was described as the most comprehensive study of the state of wildlife globally. They found that between 1970 and 2012, the average decline in population was 58 per cent. And at the current rate this figure will hit 67 per cent by 2020, the year by which the world has pledged to halt the loss of wildlife. Dr Mike Barrett, director of science and policy at WWF-UK, said: \"For the first time since the demise of the dinosaurs 65 million years ago, we face a global mass extinction of wildlife. \"We ignore the decline of other species at our peril - for they are the barometer that reveals our impact on the world that sustains us. \"Humanity\\'s misuse of natural resources is threatening habitats, pushing irreplaceable species to the brink and threatening the stability of our climate.\" Some of the most iconic animals are under severe pressure for multiple different reasons with one common factor. For example, poachers have slaughtered vast numbers of African elephants with the population falling by 111,000 to 415,000 in only a decade. The giant anteater and maned wolf are under threat because the grasslands where they live in Brazil are being converted into soy fields and pasture for cattle. Chemical pollution is affecting marine life from orcas to polar bears. PCBs used in paints, pesticides and flame retardants have been linked to cancer and weakening the polar bears\\' penis bone to the point they can snap. And numbers of Himalayan griffons have plummeted because of a drug given to cattle which gives the majestic birds kidney failure after they eat the meat of dead animals. But Dr Barrett stressed the situation was far from hopeless. \"We know how to stop this. It requires governments, businesses and citizens to rethink how we produce, consume, measure success and value the natural environment,\" Dr Barrett said. The UK, he added, needed a \"serious plan\" to increase protection for species and habitats. But it should also take steps to reduce its \"global footprint\" on wildlife around the world. Professor Ken Norris, ZSL\\'s science director, said the report should spur people into action. \"Human behaviour continues to drive the decline of wildlife populations globally, with particular impact on freshwater habitats,\" he said. \"Importantly, however, these are declines - they are not yet extinctions - and this should be a wake-up call to marshal efforts to promote the recovery of these populations.\" Environment Secretary Andrea Leadsom has repeatedly said the Government wants this generation to be the first to leave the environment in a better state than it found it. And she said: \"The Living Planet Report is a stark reminder of the scale of the challenge we face, but it also makes clear that the solutions are there if we all play our part. \"The UK has a strong track record in wildlife conservation and I am committed to protecting and restoring our natural environment for future generations.\" Ms Leadsom added the Government planned to create a \"Blue Belt of protection\" around British Overseas Territories which were \"home to unique marine species and habitats, which, without protection, could be lost forever\".'"}, "time": 1742628521.2842932}