{"duration": 0.0275726318359375, "input_args": {"text": "'The National Transportation Safety Board said Wednesday that the school bus that crashed on Monday in Chattanooga, Tenn. killing six students, was not traveling along its regular route when it wrecked. “In the course of looking at the history of Talley Road, we just ascertained that Talley Road was not on the designated route for that school bus,” Christopher A. Hart, the board’s chairman, said, referring to the crash site. Mr. Hart, addressing reporters in Chattanooga, said investigators had not determined whether the driver had previously strayed from his assigned route. The Police Department also said on Wednesday that the death toll in the crash had risen to six children. The Police Department’s announcement on Twitter came hours after the chief executive of Durham School Services, the busing contractor for the school district in Hamilton County, Tenn. offered an emotional apology for the crash, which has prompted rigorous scrutiny of a company that transports more than a million schoolchildren in the United States each day. “I can’t fathom the anguish of the parents whose children were involved in this horrific accident and that involved one of my company’s buses,” the executive, David A. Duke, said in a video that Durham published on YouTube. “Nothing that I can say can take away the pain and the grief for these families. What I can say is I’m deeply sorry for the children that were taken from their families with so much life before them. ” Until Wednesday, Durham had issued only a terse written statement, and the video did not answer the mounting questions about the company’s safety record or hiring practices. Federal statistics, which were published last month, showed that Durham’s drivers had been involved in 142 injury crashes in 24 months, but the government’s figures did not say whether the company’s employees had been at fault in the wrecks. Mr. Duke, whose company is headquartered near Chicago, said Durham would “cooperate fully” with the National Transportation Safety Board’s inquiry into the accident in Chattanooga, a city of about 177, 000 people. The Chattanooga police are conducting a separate criminal investigation, and the bus driver, Johnthony K. Walker, has already been charged with five counts of vehicular homicide, as well as reckless driving and reckless endangerment. The police said Wednesday evening that they intended to file an additional count of vehicular homicide. Mr. Walker, whom some parents said they had complained about in the months before the wreck, had “no trace” of alcohol or drugs in his system at the time of the crash, Sgt. Austin Garrett of the Chattanooga police said at a news conference on Wednesday. Sergeant Garrett, whose department did not identify the child who died on Wednesday, said that local investigators had begun reviewing video footage from the bus’s cameras. But he said that officials had not interviewed any of the children who were aboard Bus No. 366 when it crashed along Talley Road not long after leaving Woodmore Elementary School carrying 37 students. In an arrest affidavit that was released on Tuesday, a police officer said that Mr. Walker, 24, had been driving “at a high rate of speed, well above the posted speed limit of 30 m. p. h. ”'"}, "time": 1742628546.5334973}