{"duration": 0.1036689281463623, "input_args": {"text": "'Home / Be The Change / Antiwar / Former CIA Officer: “Every Single Terrorist Attack In US Was A False Flag Attack” Former CIA Officer: “Every Single Terrorist Attack In US Was A False Flag Attack” Jay Syrmopoulos October 1, 2016 34 Comments \\nWashington, D.C. — While it is a commonly know fact that the CIA utilizes foreign terror groups to destabilize governments targeted by the United States, a much lesser known fact is that numerous whistleblowers have come forward to claim that U.S. intelligence services not only use terrorism to achieve foreign policy goals, but to actually create domestic terror incidents to “blind the masses.” \\nThe most recent intelligence whistleblower is David Steele, a 20-year Marine Corps intelligence officer, and the second-highest-ranking civilian in the U.S. Marine Corps Intelligence. \\nSteele, a former CIA clandestine services case officer, had this to say: \\n“Most terrorists are false flag terrorists, or are created by our own security services. In the United States, every single terrorist incident we have had has been a false flag, or has been an informant pushed on by the FBI. In fact, we now have citizens taking out restraining orders against FBI informants that are trying to incite terrorism. We’ve become a lunatic asylum.” \\nMany people are confused as to what a false flag attack entails. A commonly held misperception is that there is no actual incident/event and it was all staged, but this definition is critically flawed, as a false flag attack actually describes a covert operation that is designed to deceive in such a way that the operations appear as though they are being carried out by entities, groups, or nations other than those who actually planned and executed them. \\nAn example of a false flag attack is Operation Northwoods, which was a proposed operation against the Cuban government that originated within the Department of Defense (DoD) and the Joint Chiefs of Staff (JCS) of the United States government in 1962. The proposals called for the Central Intelligence Agency (CIA) or other U.S. government operatives to commit acts of terrorism against American civilians and military targets, blaming it on the Cuban government, and using it to justify a war against Cuba. The proposals made it all the way to the president’s desk, where they were rejected by John F. Kennedy. \\nMany people believe the attacks of 9/11 to be a false flag event, perhaps orchestrated by U.S. intelligence services or an entity that operates above the level of government entities (commonly referred to as the deep state/military industrial complex.) \\nThe alleged purpose of this false flag attack was to justify the invasion of other countries, and usher in a heightened state of “national security,” precipitating the curtailing of civil liberties in the name of “safety.” \\nIn turn, the citizens of a state falsely believe that engaging in murderous wars are wholly justified and gladly accept new and intrusive security measures to protect the society. This often results in a false sense of patriotism that people have been indoctrinated into believing due to their skewed perception of reality. Subsequently, men and women join the military machine with good hearts, believing that they are serving in the name of freedom and fighting terrorism — when what they are actually doing is the complete opposite. \\n“The truth is, there is no Islamic army or terrorist group called Al-Qaeda, and any informed intelligence officer knows this. But, there is a propaganda campaign to make the public believe in the presence of an intensified entity representing the ‘devil’ only in order to drive TV watchers to accept a unified international leadership for a war against terrorism. The country behind this propaganda is the United States.” – Former British Foreign Secretary, Robin Cook. \\nThe reality is that people are participating in fabricated wars based on lies and misinformation sold to the public as truth. Share ♓Ξ▲ѴƳ Ƙ∆RM∆~Ð∈ßϯ ＳᏝ▲V∈ \\n“Surprise, surprise, surprise”! ~ Gomer Pyle Jamie Hall \\nNice touch. Karel Bellic \\nwell if the thuglivesmatter brigade actually stopped, and dropped their guns when told to do so, then they wouldnt get shot dead. Its not rocket science. (Although, to some sections of the ‘public’ it may seem like a really intelligent thing to do, so for that reason alone, they dont do it…. ) JennaTrull \\nYou’re not even trolling the right article, you racist fuckwit! Hugh Culliton \\nJenna, you just made me actually laugh milk out my nose! Thank you for making my night! LOTFL! Beasy \\nNaive, you’re exactly the type of person he’s talking about that’ll believe anything the government says ,even though people are protesting the unarmed killings SAVAGE MoBetta Jenkum \\nBill Clinton had a 12 year affair with his Oval Office secretary Whitney Gilmore. They have a daughter together Alyssa Gilmore. Jay \\nYou really are the quintessential example of the type of people who caused the rise of Hitler in ’33 and kept him in power when murdering millions of innocent people. You should be ashamed of yourself, that you even call yourself an “American” is absolutely resentfully disgusting. gininitaly \\n2016 to date 70 cops supposedly killed in the line of ‘duty’ while 863 of all races were killed by the thugs in blue. Do you know what racism is, other than the bad habit of the ignorant? The great distraction for bigots, while your government and their corporate/bankster buddies extract the wealth of America into their pockets. Anonymous \\nWhat does BLM have to do with false flag attacks??? m96 \\nFunded by Soros? 🙂 Anonymous \\nSoros funds all the false flag attacks??? We aren’t a fan of Soros, but would you have any proof of that? Karel Bellic \\nwell, my tablet is lagging again, but… who cares. ,;-) Paschn \\nDoubtless a covert action by that conglomerate Obama “gifted” our internet to. My desk top has been “jitter-bugging” for months. Nite_Owl \\nWell if Soviet Government TV says so it MUST be true! Really FTP? With all the disgusting truth out there you can print you resort to these crap dealers as sources? When did you start swallowing Putin’s ejaculate? That’s just lazy BS tabloid journalism on par with the National Enquirer. Carolyn Pearl \\nHad you thought to do any research, even Wikipedia, you’d find that Operation Northwoods was a genuine psy-ops plan that involved, amongst other things, creating terrorist incidents within the USA which would give us an excuse to invade Cuba. Several other Operations were aligned with it, including plans to blow up a jet, use terrorism in Florida and on our own naval bases. If you’re going to be naive that’s your choice, but I’d personally rather face the possibility of a different truth than what we’re spoon fed. https://en.m.wikipedia.org/wiki/Operation_Northwoods Nite_Owl \\nThe US government and military have plans for everything. They have plans for the stupidest things you could possibly think of from repelling Martian invasion fleets to attacking and occupying every country on earth including their closest friends. See The Men Who Stare at Goats for an amusing look at one of their better plans.Staring at goats to try and kill them and yes you funded that. The truth is they’re mostly all clinically insane and shouldn’t even be allowed near matches let alone a whole fucking country’s people and resources but here we are. Would a sane country let a man like Trump ANYWHERE near the Oval Office? lcj240 \\nWould a sane country where people actually look at the candidates records and policies ever let a warmonger like Hillary be in control? junktex'"}, "time": 1742563570.8316705}