{"duration": 0.17459797859191895, "input_args": {"text": "'Cuckservatism is a topic that has previously been discussed in detail on Return Of Kings , in articles and comments sections alike. The underlying reason that this topic is the focus of a great deal of discussion is because its roots are deeply steeped in both cowardice and betrayal.\\nWhile our readership is well acquainted with the political and social implications of cuckservatism, there is also a need to also discuss its behavioral roots. To accomplish this task, I used my social media accounts to examine connections of mine who displayed all of the classic red flags associated with cuckservatism. I then searched for common traits that they possessed based on the nature of their rants or posts.\\nThe three characteristics listed below represent key factors which, in my opinion, are necessary for any individual to transform from an otherwise normal person into a cuck. If we can understand these factors, this will enable us to develop a more comprehensive strategy for rendering them irrelevant, apart from merely ignoring them.\\nPolitical Naiveté Nothing screams political naivety more than voting for a last minute candidate who considers himself a “conservative” alternative to Trump.\\nThis factor represents the first step that one must take to become a cuckservative, because it entails believing in a series of premises that are patently false. Political naiveté can include simpler forms, such as believing in the wage gap or that illegal immigrants are natural republicans. Conversely, political naiveté can also be more complex, in that an individual afflicted with it might believe in equality as a virtue or that a democratic two party system is the best form of government. \\nA perfect example of this can be seen in my friends and associates who blindly believe in the Constitution. These individuals refuse to vote for anyone other than a “constitutionalist,” and their sole metric for judging candidates is the implications of an obscure constitutional issue that only they care about. This perspective is indicative of political naiveé because the globalists who run our political system jettisoned any belief in the Constitution and rule of law decades ago. For them, the Constitution is merely a convenient rubber stamp used to justify unpopular political decisions. \\nAccordingly, anyone who votes ONLY for candidates with such narrow viewpoints is naively playing into the hands of globalists because they fail to understand that the Constitution will only function in a nation that’s virtuous and willing to abide by its principles. \\nIf the United States continues on its current demographic track, we will eventually import a new population that not only despises original American values, but would also actively vote to eliminate them. The Constitution will provide no protections if this occurs, because these people will simply ignore it, invoking arguably the most important phrase in all of American legal history . \\nTo fail to understand these stakes when considering one’s voting patterns, instead opting to emulate the local revolutionary war re-enactors, is a hallmark trait of a cuckservative. \\nLack Of Self Confidence A Cuckservative would never get this far.\\nLack of self-confidence, and the feelings of doubt that serve as its foundation, represents a second symptom of cuckservatism, which is why Return Of Kings has countless articles on how to acquire and maintain self-confidence as a form of preventative medicine. \\nDoubts as to one’s chances of success, coupled with fear and the innate need for self-preservation, can easily shatter most people. In such moments of weakness, it’s very easy for a person to do a 180 and to do something that they would normally find revolting. Conversely, if one steadfastly believes in their convictions and themselves, their self-confidence will become stronger. This is true even in situations when seemingly the entire world is against them. \\nThe following clip is from an interview that Jeb Bush did with Lester Holt during the Republican Primary, and is an excellent illustration of how a lack of self-confidence can lead to powerlessness and a lack of control over one’s surroundings. \\n\\nFrom the very beginning of this clip, Jeb’s lack of self confidence is readily apparent. Whether it was the fact that he was too far hunched over in his seat, his attempts to curb his nervousness by forcing himself to smile or laugh, or the fact that he rarely made eye contact with Lester Holt, any ability that he has to project himself was undermined by his body language.\\nAn even deeper sign of his lack of self-confidence begins at 0:45 in the video, when Holt proceeds to ask him why he didn’t frame the Charleston shooting as an act of “racism.” In this situation, if asked such a question in any setting, an individual has one of two choices. If he is self-confident, he would turn the question back on Lester Holt by saying that racism is a social construct and the only people who care about it are limp-wristed losers.\\nHowever, if one is like Jeb and lacks self-confidence, their response to this situation will be to immediately try to “compromise” by acknowledging the premise raised by someone like Lester Holt and then spend the rest of the interview trying to show that they’re not a bad person. This was the approach that Jeb used, and it demonstrated to Lester Holt that he was weak, which then led to Lester forcing Jeb to backtrack and question his own decision to support Stand Your Ground laws during his tenure as Florida’s governor.\\nA lack of self-confidence, as evidenced by Jeb’s failure to retain control over his surroundings during his interview with Lester Holt, highlights a classic character trait shared by cuckservatives. The only answer that I can come up with, as to why this trait is so prevalent, is that it might be a product of their childhood that they haven’t been able to get over.\\nIn a way, the archetypal cuck was likely bullied or mistreated as a child, but has never learned how to fight back or to love being hated by others. Because of this, they never developed the necessary level of self-confidence to succeed in life, which eventually translates over to their politics.\\nThey Want To Be Friends With Everyone How to destroy a political movement established by one’s father in one fell swoop.\\nHaving grown up in the leftist Northeast, and considering that I still live and work there, I’m used to being in the political minority. My coping mechanisms for this situation consisted of (unknowingly) embracing key tenets of the Alternative Right, and knowing how to pick my political fights. Additionally, I also resolved to never be friendly with or ever trust anyone from the political left, a decision that has been vindicated over the last several years. \\nUnfortunately, my approach is not a popular one amongst political dissidents in my region. This is because many of them, having grown up with leftists, simply view their political disagreements as a series of gentlemanly differences that they can put aside over a few beers. They refuse to believe that leftists and SJWs hate anyone who even slightly disagrees with them and, like women, view weak men as easy targets. \\nAccordingly, when faced with the choice of staying true to their beliefs or “moderating” them in order to ensure that they get invited to the next sushi night, art showing or paint nite; the cuckservatives that I know will roll over every time. Specifically, they’ll profess support for third party “libertarian” or “constitutional” candidates, while supporting a slightly less-liberal version of their leftist friends’ politics. \\nThis tendency demonstrates a key principle that most cuckservatives subconsciously hold: they want to be liked by everyone, and will therefore do anything they can to make this happen, even if it means betraying themselves and their own beliefs in the process. When does adopting this attitude ever lead to success in life? \\nIf a child keeps getting beat up by a schoolyard bully, should they cower in the bully’s presence and act as his lackey in order to avoid getting hurt? We all know that such an approach is worthless and that the only way to respond is to fight back, yet these people adopt the same approach when dealing with the political equivalent of a schoolyard bully. Perhaps their reason for trying to be friends with globalists and trying to appease them by being moderate stems from the way in which they handled problems in childhood, however that issue itself is another topic that deserves discussion by itself. \\nIs There A Remedy For These Character Flaws? Even if we understand these characteristics, and can think of active ways to subvert cuckservatism, we will not be entirely successful. Most people who fall under this category have been psychologically conditioned to act this way, meaning that much of our attempts to open their eyes will fall on deaf ears. I have no sympathy for these people because they’ve never had the internal drive or fortitude necessary to overcome adversity, and would rather wallow in misery while also pulling others into the abyss with them. \\nHowever, there are always a couple that might show potential. These individuals might only be seen by us as cuckservatives because they imitated others around them, while lacking a positive role model that could show them the truth. The greatest service we can do for these select few is to identify them and prove that there is a viable alternative .\\nIf 25 cents a day can supposedly help a starving African family have rice for six months, then us acting as positive role models to our weaker brethren will help them immeasurably while also advancing our own cause.\\nRead More: David French’s Candidacy For President Shows That Cuckservatives Can’t Stop Donald Trump \\n'"}, "time": 1742563316.206216}