{"duration": 0.2179241180419922, "input_args": {"text": "'Probably in the pockets of the corrupt? Guy \\nIt starts with you and me ! Paschn \\nChecking their deposit history, making certain their Israeli accounts are getting their scheduled 30 pieces of silver on time. Think about it; If a father/mother treated their children the way Sewer Nation’s government treats us, they’d be tried for abuse and jailed, the Judas Class in D.C. wins Nobel (payoffs) prizes. Tina Marie Deraco \\nBernie Sanders has been very vocal. What have you done to support his efforts? Paschn \\nThey’re ALL very vocal, until the electronic ballet machines ensconce them in the whor, oops white house. You might ask dual citizen “Bernie” why he gutted the “Audit the Fed” bill, it sure as hell wasn’t for his Christian/Muslim constituency. \\nhttp://youtu.be/_Sqoq-lAGO8 Tina Marie Deraco \\nI agree. Once a president takes the Oval Office, we witness them doing 180’s on some of their most passionate and popular platform promises. It’s so bizarre, I find it hard to believe it’s always deliberate on their part. Frankly, it’s scary to wonder what happens behind those closed doors. In Bernie’s case, he’s not taking any big money, so he’d go in without owing any favors to anyone but the American people. If the man who has been saying the same things for decades got in there and suddenly changed, I’d be concerned he’d been “replaced”. As for Bernie, he is not a dual citizen. He’s been asked and he answered. No one has produced any proof to the contrary; so your allegation is falling on deaf ears. Unless you have some means of proving this honest man is lying; I suggest you drop that argument. He’s the ONLY candidate who stood up for the Palestinian people during a Democratic debate (it’s being called “historic”) and some Israeli officials reacted with nasty verbal assaults. I’m familiar with the ATF bill and Paul eventually appreciated what Bernie did. If you listen to the entire statement by Paul, you’ll hear him explain the tremendous pressure being exerted against it’s passing. What Bernie did was compromise to save it from dying completely. He injected an amendment that even the president went along with and it was voted on and passed. Paul calmed down and realized that Bernie gave them something out of nothing, Sanders wasn’t dubbed the “amendment king” for no reason. When Rand Paul presented another ATF bill just a few months ago, Bernie voted with him, against the Democrats and the president’s wishes. Unfortunately it did not pass. http://www.huffingtonpost.com/2010/05/10/ron-paul-backs-fed-audit_n_570487.html Paschn \\nBernie Sanders is, by virtue of his Jewish heritage, a dual citizen. The “right of Return” automatically extended to all Jews allows him to move about between the U.S. and Israel. As for “compromise”? Being one who will never accept the 2 party system when it comes to what is or is not good for ALL citizens, perhaps I judge his “compromise” too harshly. Even as a teenager I wasn’t able to grasp this idiocy of voting along the “party” lines. It’s either good or not. A person’ voting should have nothing to do with a party affiliation. It cripples the democratic process and benefits those holding title to “our” statesmen. Consider this, what type of honorable legislative branch would argue amongst themselves ending with the private FED RES being, yet again, shielded from transparency? Those foul dogs should be rising up as ONE demanding the FED RES charter be instantly rescinded and they, along with their PRIVATE collection agency, the IRS should be bodily thrown out of our nation right behind the Central Bank owned U.N. It wasn’t a “lucky break” which allowed Jackson to be the first and only president to pay the Nat’l debt to zero, it was because he rid us of those stinking Rothschild parasites. How things have changed, no? While we naively think it’s only oil/gas/markets that keep 800 military bases in +/- 130 nations to make things “cozy” for the corporations but no, the Judas Class’s primary reason, (which they’ve accomplished for their masters), is forcing the goddamn City of London Central Banks down the throats of smaller, weaker nations. There are literally only around five nations who are not being sucked dry by those swine. I apologize for the rant but those Central Bank blood-suckers get my ire up… quickly. Keysbum \\nquit the pussyfooting around… these criminals control the creation and destruction of money. that means they own, and control the world. Robby Johnson Fox \\nWhich, in turn, means we – the average people of this world – are slaves to them that make and destroy money. Paschn \\nEven more frightening than a government so corrupted this succubus continues “whoring -as-usual”, knowing full well “the synagogue” has no intention of letting a simple thing like treason allow this year’s favorite member of the Judas Class answer for her crimes, there are literally millions of dead-from-the-neck-up members of this “mutt” culture supporting that demoness Sewer Nation – Idiot Culture. \\nShe’s owned by global Jewry. peter \\nYou know, Judas has been taking an undeserved rap over these past couple of millenia. According to the church, God offered up Jesus for martyrdom and Judas was a key part of that plan. Jesus even asked God if there was no other way and God said “Nope, this is the way it’s gotta be. \\nJudas was just doing what he was supposed to do. Peaver Bogart \\nIt would be very funny if nobody showed up. Janet Jenkins \\nClinton’s accomplishments: 1 – James McDougal – Clinton’s convicted Whitewater partner died of an apparent heart attack, while in solitary confinement. He was a key witness in Ken Starr’s investigation. 2 – Mary Mahoney – A former WH intern was murdered July 1997 at a Starbucks Coffee Shop in Georgetown. The murder happened just after she was to go public with her story of sexual harassment in the WH. 3 – Vince Foster – Former WH councilor, and colleague of Hillary at Little Rock’s Rose Law firm. Died of a gunshot wound to the head, ruled a suicide. He was going to testify against the Clintons. 4 – Ron Brown – Secretary of Commerce and former DNC Chairman who had a serious disagreement with Clinton. Reported to have died by impact in a plane crash. A pathologist close to the investigation reported that there was a hole in the top of Brown’s skull resembling a gunshot wound. At the time of his death Brown was being investigated, and spoke publicly of his willingness to cut a deal with prosecutors. 5 – C. Victor Raiser II and Montgomery Raiser – Major players in the Clinton fund raising organization died in a private plane crash in July 1992. 6 – Paul Tulley – DNC Political Director found dead in a hotel room in Little Rock, September 1992 after a serious disagreement with Clinton. Described by Clinton as a “Dear friend and trusted advisor.” 7- Ed Willey – Clinton fund raiser, found dead November 1993 deep in the woods in VA of a gunshot wound to the head. Ruled a suicide. Ed Willey died on the same day after his wife Kathleen Willey claimed Bill Clinton groped her in the oval office in the White House. Ed Willey was involved in several Clinton fund raising events. 8 – Jerry Parks – Head of Clinton’s gubernatorial security team in Little Rock. Gunned down in his car at a deserted intersection outside Little Rock. Park’s son said his father was building a dossier on Clinton. He allegedly threatened to reveal this information. After he died the files were mysteriously removed from his house. 9 – James Bunch – Died from a gunshot suicide. It was reported that he had a “Black Book” of people which contained names of influential people who visited prostitutes in Tx & Ark. Although the book was seen by several persons, it disappeared. 10 – James Wilson – Was found dead in May 1993 from an apparent hanging suicide. He had ties to Whitewater. 11- Kathy Ferguson – Ex-wife of Ark Trooper Danny Ferguson, was found dead in May 1994, in her living room with a gunshot to her head. It was ruled a suicide even though there were several packed suitcases, as if she were going somewhere. Danny Ferguson was a co-defendant along with Bill Clinton in the Paula Jones lawsuit. Kathy Ferguson was a corroborating witness for Paula Jones. 12 – Bill Shelton – Ark State Trooper & fiancee of Kathy Ferguson. Critical of the suicide ruling of his fiancee, he was found dead in June, 1994 of a gunshot wound also ruled a suicide at the grave site of his fiancee. There were no powder burns. 13 – Gandy Baugh – Attorney for Clinton’s friend Dan Lassater, died by jumping out a window of a tall building January, 1994. His client was a convicted drug distributor. 14 – Florence Martin – Accountant & sub-contractor for the CIA, was related to the Barry Seal Mena Airport drug smuggling case. He died of three gunshot wounds. 15 – Suzanne Coleman – Reportedly had an affair with Clinton when he was Ark AG. Died of a gunshot wound to the back of the head, ruled a suicide. Was pregnant at the time of her death. 16 – Paula Grober – Clinton’s speech interpreter for the deaf from 1978 until her death December 9, 1992. She died in a one car accident. She told a friend that Clinton made advances. 17 – Danny Casolaro – Investigative reporter. Investigating Mena Airport and Ark Development Finance Authority. He slit his wrists, apparently, in the middle of his investigation. Before his death, he claimed to have found a shattering story involving Clinton. 18 – Paul Wilcher – Attorney investigating corruption at Mena Airport with Casolaro and the 1980 “October Surprise” was found dead on a toilet June 22, 1993 in his Wash DC apartment. Had delivered a shocking report to Janet Reno three weeks before his death. 19 – Jon Parnell Walker – Whitewater investigator for Resolution Trust Corp. Jumped to his death from his Arlington, Va apartment balcony August 15, 1993. He was investigating the Morgan Guarantee scandal. 20 – Barbara Wise – Commerce Department staffer. Worked closely with Ron Brown and John Huang. Cause of death unknown. Died November 29, 1996. Her bruised, nude body was found locked in her office at the Dept of Commerce. 21- Charles Meissner – Asst Secretary of Commerce who gave John Huang special security clearance, died shortly thereafter in a small plane crash. The plane had been tampered with. 22 – Dr. Stanley Heard – Chairman of the National Chiropractic Health Care Advisory Committee, died with his attorney Steve Dickson in a small plane crash. Again, tampering with the plane. Dr. Heard, in addition to serving on Clinton’s advisory council personally treated Clinton’s mother, stepfather and brother. 23 – Barry Seal – Drug running pilot out of Mena Arkansas, death was no accident. 24 – Johnny Lawhorn Jr. – Mechanic, found a check made out to Bill Clinton in the trunk of a car left at his repair shop. He was found dead after his car had hit a utility pole. Apparently he was dead before the car hit the pole. 25 – Stanley Huggins – Investigated Madison Guarantee. His death was a purported suicide and his report was never released. 26 – Hershell Friday – Attorney & Clinton fund raiser died March 1, 1994 when his plane exploded. This happen two days after an argument with Clinton. 27 – Kevin Ives & Don Henry – Known as “The boys on the track” case. Reports say the boys may have stumbled upon the Mena Ark airport drug operation. A controversial case, the initial report of death said, due to falling asleep on railroad tracks. Later reports claim the two boys had been slain before being placed on the tracks. Many linked to the case died before their testimony could come before a Grand Jury. \\nThe following persons had infoon the Ives/Henry Case: 28 – Keith Coney – Died when his motorcycle apparently slammed into the back of a truck, July 1988. No one saw the accident & the bike was not damaged. 29 – Keith McMaskle – Died stabbed 113 times, Nov, 1988 30 – Gregory Collins – Died from a gunshot wound January 1989. 31 – Jeff Rhodes – He was shot, mutilated and found burned in a trash dump in April 1989. 33 – James Milan – Found decapitated. However, the Coroner ruled his death was due to “natural causes.” 34 – Jordan Kettleson – Was found shot to death in the front seat of his pickup truck in June 1990. 35 – Richard Winters – A suspect in the Ives / Henry deaths. He was killed in a set-up robbery July 1989. \\nThe following Clinton body guards are dead: 36 – Major William S. Barkley Jr. 37 – Captain Scott J. Reynolds 38 – Sgt. Brian Hanley 40 – Major General William Robertson 41 – Col. William Densberger'"}, "time": 1742564148.1463401}