{"duration": 0.025511741638183594, "input_args": {"text": "'Monday 31 October 2016 by Jack Marshall UK becomes world’s leading exporter of arseholes \\nThe economy received an unexpected boost today after the Government announced that the UK had become the world’s leading exporter of arseholes. \\n“Brexit reminded everyone that Britain is jam-packed with arseholes,” said Simon Williams, a Government spokesman. \\n“In the months since the UK decided to leave the EU, our biggest arseholes – titans like Morgan, Hopkins and Milo – have been spouting their ill-informed and profoundly stupid opinions right across the globe. They’ve done wonders for our brand on the international stage.” \\nMr Williams added, “Statistically, when someone in the world asks ‘what kind of arsehole would say that?’, there’s now a 68% probability that the arsehole they’re referring to will be British. \\n“We can’t rest on our laurels, though; it’s a very competitive market,” warned Williams. \\n“Trump. Putin. Bieber. The world’s chock full of arseholes at the moment.” \\nTo help keep the UK on top, Mr Williams announced that Nigel Farage will become the UK’s ‘Arsehole Tsar’. \\nThis will involve Mr Farage travelling around the globe on a lavishly refurbished Royal Yacht Britannia, visiting dozens of different countries and reminding them why Britain is an international laughing stock. \\nLooking to the future, Mr Williams was optimistic. \\n“Twitter, Facebook and The Mail Online’s comments section are busy producing the UK’s next generation of opinionated morons. \\n“With a little luck, we’ll continue to create the kind of exceptional arsehole that can confidently retweet a racist meme or ‘like’ a Britain First article.” Have you checked the standings in the Arsehole Premier League ? Get the best NewsThump stories in your mailbox every Friday, for FREE! There are currently '"}, "time": 1742563461.826656}