{"duration": 0.09924435615539551, "input_args": {"text": "'The Conservative Party manifesto, ‘Forward, Together’ unveiled Thursday represents a clear pitch to the   of British politics, with its emphasis on a strong government shepherding the country forward. [Peppered with sentences such as: “We know that our responsibility to one another is greater than the rights we hold as individuals,” (page 9) the manifesto is sure to raise eyebrows amongst ardent Thatcherites.  But as well as being a clear and decisive departure from Lady Thatcher’s legacy, the manifesto is also a barometer of how the Tories intend to manage Brexit. Here, we run through the pledges most likely to worry Brexiteers. 1. That ECHR pledge, As home secretary, Theresa May made much of her opposition to the European Court of Human Rights (ECHR) having seen how it hampered her ability to extradite extremists. In April 2016, just months before the Brexit referendum, she even went so far as to say: “The ECHR can bind the hands of parliament, adds nothing to our prosperity, makes us less secure by preventing the deportation of dangerous foreign nationals  —   and does nothing to change the attitudes of governments like Russia’s when it comes to human rights. “So regardless of the EU referendum, my view is this: if we want to reform human rights laws in this country, it isn’t the EU we should leave but the ECHR and the jurisdiction of its court. ” That position has been entirely reversed in the manifesto, which promises not to bring the European Union’s Charter of Fundamental Rights into UK law, but adds: “We will not repeal or replace the Human Rights Act while the process of Brexit is underway. ” And, of course, it adds: “We will remain signatories to the European Convention on Human Rights for the duration of the next parliament. ” (Page 37) 2. Immigration, The manifesto states the current annual net migration rate of 273, 000 “is still too high” and pledges to reduce immigration both from without the EU and within  —   “while still allowing us to attract the skilled workers our economy needs”. (page 55). In February, Brexit minister David Davis admitted, however, there was little Government appetite to reduce   immigration. “In the hospitality sector, hotels and restaurants, in the social care sector, working in agriculture, it will take time [to set limits]  —   it will be years and years before we get British citizens to do those jobs,” he said. 3. Picking winners, One of the major objections to the EU’s interference in the commerce is its tendency to pick winners, propping up fashionable yet unsustainable industries such as green energy. If British voters thought that would come to an end outside the EU, they will be sorely disappointed. “Our modern industrial strategy [  …    ] is not about picking winners, propping up failing industries, or bringing back old companies from the dead. It is about identifying the industries that are of strategic value to our economy and supporting and promoting them through policies on trade, tax, infrastructure, skills, training, and research and development,” the manifesto states. (page 19) In other words, it’s not about picking winners, it’s about  …     picking winners. “So we have launched a new £23 billion National Productivity Investment Fund. The government will target this spending at areas that are critical for productivity. ” (page 20) 4. Government funded research and development. One of the key cries from Remainers during the referendum was “what will we do without EU spending on research and development?” Well don’t worry  —   the Conservatives plan to step in and fill the breach. “We will spend more on research and development, to turn brilliant discoveries into practical products and transform the world’s industries  —   such as the batteries that will power a new generation of clean, efficient, electric vehicles. ” (page 19) “Our ambition is for Britain to lead the world in electric vehicle technology and use. We want almost every car and van to be   by 2050  —   and will invest £600 million by 2020 to help achieve it. We will invest in more   buses, as well as supporting   displays for bus passengers and community minibuses for rural areas poorly served by public transport. ” (page 24) 5.   Speaking of electric vehicles, a central plank of EU ideology is environmentalism, particularly the sort that likes to tackle climate change through high taxes. Good news for Remainers  —   the Conservatives are fully signed up on that front too: “The United Kingdom will lead the world in environmental protection. As Conservatives, we are committed to leaving the environment in better condition than we inherited it. That is why we will continue to take a lead in global action against climate change, as the government demonstrated by ratifying the Paris Agreement. We were the first country to introduce a Climate Change Act, which Conservatives helped to frame, and we are halfway towards meeting our 2050 goal of reducing emissions by eighty per cent from 1990 levels. “We will champion greater conservation   within international bodies, protecting rare species, the polar regions and international waters. We will work with our Overseas Territory governments to create a Blue Belt of marine protection in their precious waters, establishing the largest marine sanctuaries anywhere in the world. ” (page 40) 6. Progressive politics in the workplace  …     In 2015, the Conservative Government under David Cameron fought off a Commission proposal to force FTSE companies to make 40 per cent of their boards female. But the Conservatives propose to carry forward the EU tradition of meddling in the workplace, adopting EU workers’ rights legislation wholesale, and setting quotas on pay. “We believe people should be rewarded for their talents and efforts but the public is rightly affronted by the remuneration of some corporate leaders. “The next Conservative government will legislate to make executive pay packages subject to strict annual votes by shareholders and listed companies will have to publish the ratio of executive pay to broader UK workforce pay. Companies will have to explain their pay policies, particularly complex incentive schemes, better. ” (page 18) 7.   …    and beyond. “We will push forward with our plan for tackling hate crime committed on the basis of religion, disability, sexual orientation or transgender identity. ” (page 40)'"}, "time": 1742563332.0757265}