{"duration": 0.015053272247314453, "input_args": {"text": "\"Exclusive: Abortion by prescription now rivals surgery for U.S. women Reuters \\nNo Kegs, No Liquor: College Crackdown Targets Drinking and Sexual Assault NYT. If the number one priority of the university nomenklatura had in fact been the prevention of sexual assault, they wouldn’t have been running courses on microaggression . They’d have been cracking down on today’s drinking culture, the venues where that culture is enacted (often fraternities), and they’d be empowering women with self-defense courses (which would give them a life-long skill). But that would have involved cracking down on powerful on-campus actors (fraternity alumni and legacies, ka-ching), powerful off-campus local actors (liquor stores and bars, ka-ching), might have led to difficulties with admissions numbers (ka-ching, ka-ching, ka-ching) since by now students expect to “party”— not a verb when I was a mere sprat — and, most importantly of all, would have prevented the formation of Deans of Microaggression, Departments of Microaggression, and an entire academic circuit devoted to microaggression studies, including journals, conferences, and books. I mean, (cishet) guys, if she’s not drunk and/or she’s ready, willing, and able to kick you in the nuts, then the whole “No means ‘no'” semantic foofraw gets a whole lot simpler, does it not? So if the headline indicates a trend, I’m happy, not least because this approach promises to reduce sexual assault. \\nStanding Rock Water-Protectors Waterboarded While the Cleveland Indians Romped Counterpunch (WS). \\nThe Myth Behind the First Cleveland Indian: Louis Sockalexis Daily Beast. Sockalexis was from Indian Island, in the Penobscot Nation near Old Town, Maine. There really ought to be a way to honor Sockalexis without tarting up the Cleveland Indians logo. Maybe if it were less cartoonish? Heck, why not just ask the Penoscots? \\nAntidote du jour ( via ): See yesterday’s Links and Antidote du Jour here . 0 0 0 0 0 0\""}, "time": 1742628587.0808306}