{"duration": 0.07389688491821289, "input_args": {"text": "\"By Sarah Jones on Sat, Oct 29th, 2016 at 1:56 pm On Saturday, the press began to figure out that they had been conned by Republicans again, but not before the Clinton email news lead in swing state newspapers. Share on Twitter Print This Post \\nOn Saturday, the press began to figure out that they had been conned by Republicans again, but not before the Clinton email news lead in swing state newspapers. \\nThe “Clinton email” news leads in “almost every single one of the big swing state papers this morning,” observes Politico reporter Gabriel Debenedetti. The Clinton email news leads almost every single one of the big swing state papers this morning … pic.twitter.com/t3rEOwHNmM \\n— Gabriel Debenedetti (@gdebenedetti) October 29, 2016 \\nThe “FBI investigation!!!!” spread like wildfire last night. This is the result of the press, once again, taking Republican smoke and claiming there’s fire. \\nThis observation isn’t mine along. The Washington Post’s Greg Sargent pointed out that there is only an upside and no penalty for doing this — for both Republicans and the press: This is how GOP hype-ahead-of-the-facts gets rewarded by media's willful perpetuation of smoke/fire effect. Zero penalty. Only upside. https://t.co/vm0ZLTrACL \\n— Greg Sargent (@ThePlumLineGS) October 29, 2016 \\nEven though early polling shows there hasn’t been an impact in swing states , and even though the majority of Americans have already made up their minds, each time her emails are brought up Hillary Clinton falls in the polls. \\nA Gallup poll showed that “emails” are the most Americans have heard about Clinton. Not that she is the most qualified candidate in modern history or how her policy on paid family leave might impact them — but the emails that she was already cleared on. \\nEven though one result of the Comey letter has been to energize Clinton supporters , at a time when she was facing a likely win that can create complacency, this still isn’t an acceptable practice. \\nRepublican FBI Director James Comey finds himself in the hot seat today after sending a letter that has no precedent, obviously would impact an election that was then just 11 days out and is now 10 days out, and actually bore no information– well, that’s inaccurate. The letter bore inaccurate smoke and innuendo that has already been cleared, but the damage has already been done. \\nWhile Ron Fournier and others suggested that Democratic objections to this unprecedented violation of the rules by Comey was just more partisan folly, the truth is even more disturbing. \\nBy even suggesting that objecting to violating a longstanding rule is partisan, we are allowing the press to enable Republicans to continue pretending there is no reality. \\nIn reality, no matter which side of the aisle you are on, it’s a rule not to comment on ongoing investigations that could impact an election. The reasons for this are obvious and the potential ramifications for abuse are terrifying for both parties — for instance, it’s obvious that the FBI is investigating the Trump campaign for coordination with Russia, but we don’t headline that because the FBI hasn’t commented on that, because… \\nTo do so would violate the rule not to interfere with elections. \\nSo it’s really quite frightening to hear people claim objecting to violating this rule is partisan, even as the Trump campaign is benefiting from the adherence to said rule. If the rule applies to Donald Trump, it should apply to Hillary Clinton. \\nAsking that this value be applied to both sides is not partisan. \\nWe must stick to reality. We must not allow our need to appear objective cause us to fall so far down the rabbit hole that we enable Republicans to keep drinking the no-fact Kool-Aid. \\nThe press did the Republican smoke is a real fire thing all through President Obama’s terms, at one point claiming he was implicated in Benghazi emails because a reporter allowed a Republican aide to read him said emails — and of course, it turned out that the emails didn’t say what the aide told the reporter. But that was learned much later and as everyone knows, a lie travels faster than the truth. \\nAnd now American voters in swing states who read papers will think the FBI is investigating Clinton. \\nSo Comey’s letter did damage Hillary Clinton. Even if she wins the election, the letter damaged her and down ballot Democrats. \\nThe media never learns. They take Republican smoke and innuendo and treat it as fact, every time. They look like fools to those who know there was no there in the Comey letter, but the average voter doesn’t live for political updates. \\nThe irresponsible damage is done. \\nThe Media Got Suckered Into Buying The GOP’s Bogus Clinton FBI Email Tale added by Sarah Jones on Sat, Oct 29th, 2016\""}, "time": 1742562758.2655315}