{"duration": 0.036992549896240234, "input_args": {"text": "'Trump Supporter Screams At Press, Uses Anti-Semitic Slurs, Brands Them ‘The Enemy’ (VIDEO)   \\nEven though the Trump campaign tries desperately to deny that many of their supporters are racist jackasses, the actions of some acolytes who support the GOP nominee continue to prove otherwise. \\nTake for example a man at a Trump campaign rally held in Phoenix on Saturday. This enraged man began taunting members of the media with chants of “Jew S. A.” in place of USA. This same rabid moron also accused members of the press who were simply doing their jobs of being “the enemy” and “working for the devil.” So this just happened near the press pen at Trump\\'s Phoenix rally. Man chanting \"Jew.S.A.!\" pic.twitter.com/DpG9G6BtqO \\n— Ashley Killough (@KilloughCNN) October 29, 2016 Guy chants \"Jew-S-A\" in front of press pen pic.twitter.com/2yqgA6dD4k \\n— Nick Corasaniti (@NYTnickc) October 29, 2016 \\nFor his part, Trump riled up his rally filled with deplorables by telling them : “When the outcome is fixed, when the system is rigged, people lose hope. They stop dreaming. They stop trying. Hillary Clinton’s corruption is corrosive to the soul of our nation and it must be stopped.” \\nWhat is both maddening and simultaneously pathetic is that many of these enraged Trump voters are losers who need someone to blame their own inadequacies on. They are often poorly educated and have low-paying jobs. But then again, if you fail to educate yourself or prepare for the job market by learning a trade or getting a degree, that is at least in part your own fault. But to try and direct your anger at others–be they African-Americans, Hispanics, or women–only proves your own impotence. Rather than facing their failures and trying to better themselves, these narcissistic simpletons choose to hate those who set goals and accomplish them. \\nThe type of Trump supporter who shouted at members of the media in Phoenix cannot face one simple fact: He or she has a made a mess of their life and the pain is too much to take. Therefore they lash out at others with hatred and bile. They cannot face one simple fact: Their time has passed and the future has caught up with them, just as it will catch up with Donald Trump on November 8. \\nFeatured Image Via NBC News Screengrab  '"}, "time": 1742561784.7983303}