{"duration": 0.0907599925994873, "input_args": {"text": "'Posted on October 31, 2016 by Frank Scott \\n“The greatest objective of mankind in this century should be to eradicate imperialism and capitalism as models for society.”—Evo Morales \\nAs we approach the end of our most recent contamination of the ideal of national democracy with possibly its worst example we would do well to consider the words of a democratically elected leader of a nation that could teach us about the word’s meaning. \\nA representative of the real majority of his people, a former farm worker who rose to the presidency on the shoulders of ordinary Bolivians and not the bank books of his nation’s rich, Evo Morales and his supporters understand more about the state of the world than many of us understand about the state of our nation. Whichever of the ruling parties’ unpopular wretches is elected on November 8, they will contradict Morales’s words, possibly with more savagery than ever before, and the need for a political economic transformation of America and the world will become greater than ever before. \\nOur ruling oligarchs have reacted with a vengeance in suppressing two dangerously democratic threats to their dominance. First, Bernie Sanders leading a popular movement motivated by social desire, and second a more ego centered individualist struggle led by an economic billionaire and intellectual pauper, usually a winning combination in the empire of capital but not this time. In fact, the populace has received daily bulletins about Donald Trump’s outrageous practice of capitalism and its profitable by-products of division by dollar, race and sex. Who knew? \\nIf we are to believe polls which measure how much we absorb the message of our consciousness controllers, the assault on our collective mentality has never been as blatant, corrupt, single minded and seemingly successful; we will soon coronate a historic first for the empire as the glass ceiling above the CEO presiding over the slaughters perpetrated by our warfare state will be broken and a woman will lead the foreign policy that creates many people of color: blood red. \\nThe further destruction of the Muslim world and the creation of more terrorists who murder us because we murder them will continue. Heart breaking photos of a Palestinian, Yemeni, Iraqi or Syrian parent carrying what used to be a son or daughter, reduced to a bloody pulp form of unidentifiable gender fluidity by an Israeli, French, British or German aimed, American created bomb, will not go viral. Only those dramatic and sometimes staged photos of alleged victims of America’s adversaries are assured such coverage, while we beseech one and all to take in refugees created by our destruction of their nations. \\nFrighteningly worse for all of us than terrorist attacks would be a nuclear war that could happen if Russia reacts with as much arrogance and stupidity as the USA and responds to menacing provocation on its borders to enter such a confrontation that could spell the end of everything. \\nHopefully, there will be enough Americans who identify with humanity’s wholeness and refuse forced acceptance of membership in a fictitious minority with warped identity sense that makes it somehow less or more politically correct by having different genitals, skin tones or belief systems and remaining oblivious to being members of the one and only race: human. \\nHistoric problems dating back to the nation’s origins in being brutally stolen from the original inhabitants, built on slave and indentured servant labor abused in order to create wealth enough to trickle down on what many of the descendants found a middle class status in a dream society that offered material hope to many but depended on continued exploitation of many more to maintain a lie. We are a nation built at the expense of the semi-voluntary poor thrown out of Europe, Asia and Africa to become supporters of a national dream nearing a nightmare for too many and needing a wakeup call from the world, in the words of Morales. \\nGovernment of the people, by the people, for the people, our supposed ideal, obviously has nothing to do with the present owned and operated by great wealth entity that can be defined as democracy the way that rape can be defined as love. But as long as great wealth maintains dominance and keeps democratic power from the rest of us in part by controlling what we think we know, genuine concern about government can be played as a skirmish between the supporters of a market without any control and supporters of a market with minimal control, both assuring that wealth will be defended, only differing in how much of it will accrue to the minority rulers, how quickly it will occur and how acceptable that will be found by the poorly informed. \\nNeither government nor banking nor finance will work for the majority of the people until the people create democracy in deed as opposed to the sham we have. As long as minorities, growing smaller in number as their private wealth grows larger, are allowed to dominate there is no difference between modern capitalism and ancient feudalism. We now tolerate billionaires whose material wealth and power would stagger some phony royal/god/pharaoh of the ancient past and our innumeracy in failing to understand that—how the hell does anyone have a billion dollars while more than a billion humans survive (?) on not much more than a couple of dollars a day?—while we are fed a steady diet of consumerist garbage by these rulers can only change when we grow angry enough at what is happening to the planet we live on and most of its people by having it and us treated as products in a free market where nothing is free, all to benefit them while we carry the ever more staggering cost. For openers, we ought not to vote for the lesser evil deadly duo but the greater good of Jill Stein and the Greens and then join any group opting for change that is systemic and not simply individual. \\nThe Trump and San \\nFrank Scott‘s political commentary and satire is online at legalienate.blogspot.com'"}, "time": 1742561843.1597767}