{"duration": 0.10739850997924805, "input_args": {"text": "'PALM BEACH, Fla.  —   The news broke just as the fireworks began crackling over the grand estate’s manicured lawn, a festive backdrop for the guests sipping champagne around an ornamental pool: The White House had moved to appeal a court ruling that blocked President Trump’s sweeping immigration order. At airports around the world, the legal tug of war played out in starkly human terms, with travelers from seven predominantly Muslim countries having to decide whether to board flights to the United States, unsure of whether they would be turned back once they landed. Yet here, in the cosseted confines of    those concerns seemed a million miles away. The guests had gathered for the 60th annual Red Cross ball, a staple of the Palm Beach social calendar, which this year carried the theme “From Vienna to Versailles. ” In keeping with the Hapsburg and Bourbon motif, the male staff members wore powdered wigs and breeches the women were costumed in flouncy gowns and   beehive wigs in the style of Marie Antoinette, the queen guillotined in the French Revolution. The disconnect between high society and huddled masses would have been complete if not for the fact that   ’s proprietor  —   the guest of honor that evening, though he had to stand in line with his wife to get into his own ballroom  —   was the very person who had signed the immigration order and had gone to court to preserve it: Mr. Trump. “We’ll win,” the president said to a reporter on   duty, who asked him whether he was confident of the government’s legal appeal. “For the safety of the country, we’ll win. ” When another reporter asked whether he would abide by the federal court’s ruling, Mr. Trump smiled thinly but did not answer, shifting from foot to foot, as the first lady, Melania Trump, resplendent in a pink evening gown and diamond and emerald earrings, stared serenely ahead. This is    in the first month of the Trump presidency, still making the transition from a   club for the tanned and surgically enhanced snowbirds of Florida’s Gold Coast to the “winter White House” that the cereal heiress Marjorie Merriweather Post always dreamed it would be after she built the   castle in the 1920s. Like his residence, Mr. Trump is also still in transition, caught between the demands of being president (a 5 p. m. phone call with President Petro O. Poroshenko of Ukraine) and the reassuring rituals of his old life (a round of golf at his club in nearby West Palm Beach). On his first weekend here since being inaugurated, the Red Cross ball fell into the   category. He had hosted the benefit several times over the past 20 years, said Dick Robinson, a friend and Palm Beach philanthropist, who stopped by to chat with the White House press corps, which now shows up alongside reporters from the local papers to chronicle events like this. The sight of Mr. Trump lining up with his guests was remarkable, given that presidents normally enter a room only after everyone else is seated, and then often to the strains of “Hail to the Chief. ” With his tuxedo jacket unbuttoned, clutching his wife’s hand, he looked more like the   who spent years greeting the guests at his club. And yet there were myriad other signs of how Mr. Trump’s life has changed, from the security checkpoint set up in an adjacent parking lot and the police boat that bobs in the Intracoastal Waterway to the Secret Service agents who peered into the crowd as he and Mrs. Trump shimmied to a band playing Bob Seger’s “Old Time Rock ’n’ Roll. ” Mr. Trump’s weekend also had that    vibe that most presidential getaways have. In addition to the call with Mr. Poroshenko, he spoke to Prime Minister Paolo Gentiloni of Italy, Prime Minister Bill English of New Zealand and the secretary general of NATO, Jens Stoltenberg  —   a conversation that could not have been relaxing, given Mr. Trump’s earlier assertions that the alliance is a Cold War relic. In its   summary of the Ukraine call, the White House described the exchange with Mr. Poroshenko as “very good” and quoted Mr. Trump as saying, “We will work with Ukraine, Russia and other parties to help them restore peace along the border”  —   a statement that did not take account of the fact that Russia unlawfully annexed Crimea. Mr. Trump brought along his chief of staff, Reince Priebus, and his chief strategist, Stephen K. Bannon, which suggested that he was briefed regularly on the legal battle over his immigration order. Mr. Priebus and Mr. Bannon both stayed at    which has guest rooms. Even when Mr. Trump was off the clock, he appeared preoccupied by the world outside. On Saturday morning, he began a Twitter tirade against the Seattle judge who had blocked the immigration order. Though he went quiet during the four and a half hours he was at the Trump International Golf Club  —   the White House declined to confirm that he actually played golf or say who his partners were  —   the Twitter posts resumed when he got back to the house. Even as his guests were mingling during cocktails, Mr. Trump wrote on Twitter, “The judge opens up our country to potential terrorists and others that do not have our best interest at heart. Bad people are very happy!” When Mr. Trump bought    at a   price in 1985, he was viewed by many in this uppity enclave as a parvenu who would cheapen the legacy of the estate. Those days are gone  —   especially now that he has the power to make his friends ambassadors to European capitals. But Mr. Trump still draws his share of catcalls  —   some subtle, others not. Across the street from his golf club, the Palm Beach County Library had a sign in the front door advertising an evening with Amy Sherman, a reporter from The Miami Herald and PolitiFact Florida, to discuss how to expose disingenuous political figures. “Pants on Fire: How to   Politicians,” it said. On Saturday, about 3, 000 demonstrators marched along Flagler Drive, carrying signs and chanting, “    Donald Trump has got to go. ” About 300 managed to walk across the bridge to Palm Beach, according to The Palm Beach Post, where they got within 25 yards of    before encountering an armored security vehicle. At 8 p. m. when the fireworks exploded above the estate, they cast a glow on the crowd, witnesses said, giving them a better view of the show than the one enjoyed by the guests inside Mr. Trump’s winter White House.'"}, "time": 1742563366.9691765}