{"duration": 0.1382126808166504, "input_args": {"text": "'\\nPosted by Damon Morgan | Nov 10, 2016 | National Security Former Iranian President Mahmoud Ahmadinejad Got the Better of Obama in Nuclear Talks \\nOn September 28, 2015, Argentinean President Cristina Fernandez de Kirchner dropped a bombshell on the floor of the UN General Assembly 70th session. Until now, her story has been swept under the rug by a news media which has always been deferential to President Obama. \\nMs. Kirchner told the story of how Argentina was visited by the White House in November 2010, with a secretive and unusual request. A full English translation of her speech is available here. \\nDuring the time the event took place, Obama had just faced a stinging rebuke in midterm elections which saw a Republican takeover of the House, led by the insurgent Tea Party. The results of that election were a direct threat to Obama’s mandate. Wikipedia describes the incredible upset this way: \\nRepublicans regained control of the chamber they had lost in the 2006 midterm elections, picking up a net total of 63 seats and erasing the gains Democrats made in 2006 and 2008. Although the sitting U.S. President’s party usually loses seats in a midterm election, the 2010 election resulted in the highest loss of a party in a House midterm election since 1938, and the largest House swing since 1948. This also happened to be the Republicans’ largest gain in House seats since 1938. \\nUnder the shadow of this election, Obama became concerned about the possibility of being a one-term president and leaving a damaged legacy. He had not been able to accomplish any notable achievements as president, and the economy was still reeling from the aftershocks of the 2008 real estate and stock market crashes. Obama Was Desperate for a Deal with Iran \\nObama had been negotiating with Iran regarding their nuclear ambitions, and the world was watching. But negotiations had bogged down, with then Iranian President Mahmoud Ahmadinejad insisting on the need for nuclear fuel as part of the deal. \\nAccording to Kirchner, the Obama White House intended to sidestep congressional approval and media scrutiny by quietly hatching a scheme where third party nations would supply the fuel. \\nShe told the UN Assembly that Argentina was approached by a representative of Obama’s White House, Gary Samore, who at the time served as the top adviser on nuclear issues. \\n“Gary Samore had explained to our Minister of Foreign Affairs, Héctor Timerman, that negotiations were underway for the Islamic Republic of Iran to cease with its uranium enrichment activities or to do it to a lesser extent but Iran claimed that it needed to enrich this Tehran nuclear reactor and this was hindering negotiations. They came to ask us, Argentines, to provide the Islamic Republic of Iran with nuclear fuel.” said Kirchner. \\nShe went on to explain that Mr. Samore presented the following options: \\nThe simplest and quickest one was for Argentina to provide the new nuclear fuel, as the original fuel had been designed by Argentina, who owned the intellectual property rights. \\nAnother alternative was for Argentina to authorize Russia to supply the uranium, following the Argentine design. \\nThe last alternative was for the United States or some other country with nuclear capacity to replace the operating core of the nuclear reactor with a new one using other non-Argentine fuel. \\nPresident Kirchner was willing to help, but the issue was politically tricky. Argentina had been the original producer of the nuclear fuel used in the Tehran reactor, and held intellectual property claims to the material. However, there was ongoing tension between Iran and Argentina due to a terrorist bombing in 1994. \\nThe AMIA bombing was an attack on the Asociación Mutual Israelita Argentina (AMIA; Argentine Israelite Mutual Association) building. It occurred in Buenos Aires on 18 July 1994, killing 85 people and injuring hundreds. It was Argentina’s deadliest bombing ever. The Bombing of the AMIA Building was the Deadliest in Argentina’s History \\nAfter a long series of incompetent and corrupt investigations into the incident, in 2005 Argentine prosecutors Alberto Nisman and Marcelo Martínez Burgos formally accused the government of Iran of directing the bombing, and the Hezbollah militia of carrying it out. According to the prosecution’s claims in 2006, Argentina had been targeted by Iran after Buenos Aires’ decision to suspend a nuclear technology transfer contract to Tehran \\nArgentina’s justice, Israel, and the United States suspected in 2005 that Hezbollah was behind the attack, with backing from Iran. Hezbollah has denied responsibility. The Iranian government maintains its innocence, condemning the terrorist attack and calling for urgent punishment of those responsible. \\nAfter many years spent on the case, Special Prosecutor Alberto Nisman was found dead in his home, on January 18, 2015. His body was discovered just six hours before he was due to explain his findings to congress. The official cause of death was a single self-inflicted gunshot wound to the head, but there is a haze of suspicion surrounding the case. Argentinians March in Protest of the Lack of Justice for the AMIA Bombing \\nTo this day the bombing case remains unresolved, and Iran has refused to extradite any of the suspects involved. \\nPresident Kirchner continued with her address to the UN, explaining that she attempted to follow standard protocol and receive the White House request in writing: \\nYou know that Argentina is a member of the select club of nuclear energy producing countries but that we occupy, nonetheless, a leading position in the field of non-proliferation. This means that non-nuclear proliferation is also a matter of governmental interest to us as well. \\nI said as much to my Minister of Foreign Affairs who in turn relayed this to the White House’s envoy, Gary Samore that we would accept to provide the fuel because it was in the hands of Argentina since 1987 and we also had the technique to produce it in exchange, obviously, for such request to be submitted in writing and signed. This message was conveyed and I believe that was the last time, after that communication, that our Minister of Foreign Affairs saw Gary Samore. \\nSo, after her demand that the request for nuclear fuel be provided on the official record, the U.S. representative vanished and the issue was never mentioned to Kirchner again. This shows that it was intended to be a clandestine deal from the beginning, hidden from the American people. Former Iranian President Ahmadinejad Tours Nuclear Processing Facility \\nWas Obama hoping to emerge as a hero after successfully negotiating a deal with Iran? If so, that effort fell flat. Recent investigations have revealed that he attempted another scheme in 2016 which involved making a cash down payment to Iran of more than a billion dollars, in order to secure the release of American hostages and to advance nuclear talks. \\nWhen it comes to an issue as important as nuclear proliferation in radical Islamist nations, we need a president who will engage the issue with transparency, and in the interest of the American people and world community. President Trump will likely succeed where Obama has failed. '"}, "time": 1742561875.0987885}