{"duration": 0.04052281379699707, "input_args": {"text": "'Thu, 27 Oct 2016 16:19 UTC © Khaled Abdullah / Reuters UK Foreign Secretary Boris Johnson claims if Britain did not sell arms to Saudi Arabia, other countries \"would happily\" take over the market. Johnson insisted the government is closely monitoring the situation in Yemen, where Saudi forces have been accused of war crimes over the course of their 19-month military intervention. He said boycotting the sale of arms to Riyadh would harm British interests in the region and diminish its diplomatic and political influence. Labour\\'s Shadow Foreign Secretary Emily Thornberry has called for an independent UN-led investigation into allegations of war crimes in Yemen, and the suspension of arms sales to Saudi Arabia while the inquiry takes place. Speaking in Parliament, Johnson said the Saudi government should conduct its own investigation first. \"The Saudi government has approached this matter with great seriousness, and the seriousness it deserves,\" he said. \"But the House should be in no doubt that we in this country are monitoring the situation minutely and meticulously, and will continue to apply our established criteria for granting licences with fairness and rigour, and in full accordance with UK law.\" Comment: And the UN must also be confident of Saudi Arabia\\'s good intention by allowing a seat on the UNHRC board: What\\'s wrong with the planet? Saudi Arabia to be reelected to UN Human Rights Council The Foreign Secretary added that other countries would \"happily supply\" weapons to the Gulf kingdom if the UK boycotted exports. \"To those who say, as apparently they now do in this motion, that we should simply disregard those legal procedures, be in no doubt that we would be vacating a space that would rapidly be filled by other Western countries who would happily supply arms with nothing like the same compunctions or criteria or respect for humanitarian law. \"And more importantly, we would at a stroke eliminate this country\\'s positive ability to exercise our moderating, diplomatic and political influence on a crisis where there are massive UK interests at stake. \" Comment: Boris means military industrial interests. A parliamentary motion calling for a boycott of arms to Saudi Arabia and an independent UN investigation was defeated in the House of Commons after more than 100 Labour MPs on the party\\'s right wing failed to support it. MP John Woodcock defended Britain\\'s role in arming and training the Saudi military as it carries out airstrikes in Yemen. \"The coalition is precisely focused on training Saudis to be better able to be in compliance with international humanitarian law so that our interventions, if effective, will create fewer civilian casualties,\" he said. MP Toby Perkins said he could not back the motion because Britain has \"significant economic interest in continuing to have positive relations with the Saudis.\" Comment: This is like saying it is better to be a war criminal and make money than forgo the money and not be a participant of war crimes. The damage has already been committed so why stop now?'"}, "time": 1742563645.238525}