{"duration": 0.1498110294342041, "input_args": {"text": "'Thu, 27 Oct 2016 13:01 UTC Arsen Pavlov, or Motorola, was the leader of the Sparta battalion in the war for Donbass. The people of Novorossiya (aka the Donbass) have suffered a terrible loss. Arsen Pavlov, better known to the world as Motorola, was assassinated in a brutal terrorist bombing on October 16, 2016. He was a beloved commander and a hero to the people of the Donbass, to Russia, and to people all over the world who oppose the fascist junta in Ukraine and US imperialism. The murder was no doubt ordered by the empire in revenge for Russia\\'s intervention in Syria which one year later appears to have decisively shifted the war. On every front the SAA are making advances and winning new victories especially in the battle to fully liberate Aleppo from NATO\\'s terrorist death squads. Thankfully after the treacherous bombing at Deir Ezzor Russia was in no mood to give in to the empty threats of full-scale nuclear war the empire claimed it was prepared to launch in order to halt the liberation of eastern Aleppo. Slowly the SAA are making gains on multiple fronts in Eastern Ghouta, in Homs, in Aleppo. Arsen Pavlov was born in the Komi Republic. At 15 he became an orphan and moved in with a grandmother. He joined the Russian Naval Infantry where he gained the callsign Motorola. He joined as a conscript but volunteered to reenlist and served in the 2nd Chechen War where he gained valuable experience, and they say became addicted to war. He was a bit of an adrenaline junky which added to his charisma since he was paradoxically cheerful in the most dangerous situations. He had a great sense of humor which came through even to non-Russian speakers like myself but he was even more beloved in Russia and Ukraine for his hilarious narrations of the war in Ukraine. He was involved in the war in Ukraine from the start. He visited Maidan where he overheard some Ukrainian fascists saying that they would kill ten Russians for every Ukrainian they lost. He decided to join the anti-Maidan movement participating in counter-protests in eastern Ukraine in Kharkov and other cities before heading to Crimea to aid the people in fulfilling their long-held dream of reuniting with Russia. It was in Crimea that he met Igor Strelkov, who was impressed with his military experience and cheerful daring. Thus Motorola was one of the small group of men he brought with him to Slavyansk where a handful of veterans worked with the brave locals managing to keep the Ukrainian Military tied down for months, allowing vital time for Donetsk and Lugansk to solidify their defenses . In Slavyansk Strelkov and Motorola would become legends. Motorola became well known early on because not only was he a brave fighter he was also a master of information war. It was Motorola who filmed many of the early battles of the war and also helped sympathetic journalists cover the war from the front lines. He well understood that the wars of today are fought not just on the battlefields but on the internet, on youtube, on social media. He helped mobilize global support for Novorossia\\'s war to remain independent of fascist Ukraine, inspiring volunteers from around the world. He was also able wage psychological warfare on the Ukrainians using his instincts as a prankster. He managed to convince the Ukrainians that there were 300 Chechen special forces aiding the Novorossians in the area by playing a recording of the Muslim call to prayer every day. The paranoid Ukrainians fell for it and did not dare to invade the area. Motorola would go on to fight in many of the major battles of the war. He was not one of those commanders who lead from behind. Instead Motorola often fought on the front lines with his men. How could he ask his fighters to risk their lives when he would not do the same?, he would explain when questioned. Thus, like the legendary Mozgovoi, Motorola was reported dead many times in the course of the war by the Ukrainian media, always reappearing to make a mockery of such claims. To do justice to his heroic actions in the war in Ukraine would require writing a history of much of the war since he was at so many famous battles - Nikolayevka Semyonuka, Ilovaisk, Debaltsevo, Donetsk. He became the commander of the Spartak Battalion and was instrumental in liberating Donetsk airport from the fascist self-styled \"cyborgs.\" He had a beautiful and courageous wife and three children. He was officially declared a Hero of Novorossia and honored in last year\\'s victory parade celebrating both the victory over fascism in \"The Great Patriotic War\", as World War 2 is known in Russia, but also the victories in the 2014-2015 wars of independence that saw the NATO-backed fascist Ukrainian army and its death squad allies thoroughly smashed. Arsen Pavlov with his wife Yelena Kolenkina Tragically after facing danger so many times on the battlefield Motorola was killed by a bomb in the elevator in his apartment building as he was returning to his family. The news was met with grief and rage the world over. In Donetsk huge crowds filled the streets to bury their fallen Hero. Ultimately whoever set the bomb was serving not merely the fascist puppet regime in Kiev but the CIA. Thats how the CIA operate in these dirty wars - they take control of their \"allies\" intelligence service through payoffs and sending in their advisers. Ukraine is little more than a NATO colony at this point . Thus we can be sure that someone in Washington green-lit the assassination. Like the bombing at Deir Ezzor this assassination is meant to bring the war in Ukraine to a suitable boil by the time Hillary takes over in a couple months. 2017 will probably see Ukraine erupt into full-blown war again. Of course the war never truly stopped with the Ukrainian army constantly shelling Novorossian civilians from a distance. There have been constant skirmishes. However, clearly things are escalating and the assassination of Motorola is part of a pattern that included a failed assassination attempt on Motorola this summer, plots to kill the Prime Ministers of Donetsk and Lugansk, Zhakarchenko, and Plotinsky, and the foiled terror plots in Crimea. Events in Ukraine are closely tied in with events in Syria. As I realized back in 2014, the whole Maidan coup in Ukraine was revenge for Russia preventing Obama from attacking Syria in the fall of 2013 after the \"rebels\" launched a chemical weapons attack and blamed the Syrian government. Russia sent its fleet to face down the potential attack, Putin authorizing his commanders to unleash a nuclear war if necessary and supposedly even shooting down two cruise missiles launched by the US navy towards Syria. It was at this moment that cold war 2.0 went into high gear . This despite the face-saving deal in which Syria agreed to give up its chemical weapons despite being innocent of the attack. The neocons launched the Maidan coup in revenge, as has since been confirmed by Robert Parry. Since then whenever the empire met defeat in one of these countries it redoubled its efforts in the other. Motorola\\'s death was revenge for the impending victory in Aleppo. This victory seems to be driving the empire of chaos absolutely mad with rage and in truth the survival of the world may depend on the people mobilizing to stop Hillary from starting a nuclear war with Russia over Syria or Ukraine. One hopes they are bluffing but the crazy rhetoric coming out of Washington these days suggests that the ruling class have completely lost their minds and seem to think nuclear war is just another \"cakewalk\" like the disastrous invasion of Iraq. Thankfully the Russians refused to give in to nuclear blackmail and other than a lacklustre \"pause\" in Aleppo to attempt to allow civilians to flee and the terrorists to escape, things have been looking ever bleaker for the NATO death squads. I\\'ll briefly describe the situation based on a recent analysis by Canthama at Syrian Perspective. The SAA have been making slow but steady progress across the country. In Northern Hama they are reversing the gains made by the terrorist counteroffensive launched there in a failed attempt to distract the SAA from the battle of Aleppo. The terrorists have suffered heavy losses while being pushed back. In Western Ghouta recent SAA gains in Khan al Shaykh threaten to cut the terrorists off from a nearby town. In East Ghouta the terrorists are suffering heavy losses in their doomed attempt to defend Al Rayham vital for keeping their supply routes open. In Southwestern Aleppo the liberation of the air defense battalion by the SAA and their advance into the Tal Balazul and Tal Mahaba hills threaten to cut off the supply routes to the 1070 Apartments. In eastern Aleppo a 3-pronged offensive continues to liberate the area bit by bit. In other words for the moment the war is going well. We will have to see what schemes the empire concocts in order to try to reverse these steady gains. One major danger is the ever-expanding Turkish invasion in northern Syria and unfortunately Russia and Syria will probably come to regret not moving to stop the Turks from the start. This Turkish-controlled area could well be used in the long-running scheme to establish a no-fly zone in the north of Syria. Rumor also has it that the terrorists in Aleppo are hoping to be rescued by a Turkish offensive. In addition the US is using its Mosul campaign to herd ISIS into eastern Syria where they hope to use them to attack Deir Ezzor, and Palmyra and eventually attempt to turn eastern Syria into a Wahhabi terrorist state. The war in Syria will continue. We can only hope that one day the country will be fully liberated and at peace but unfortunately with Hillary heading for the White House the war will probably continue to intensify. As for Motorola we mourn with the people of Donbass over their fallen hero. Zakharchenko has sworn to take his revenge on Ukraine\\'s SBU and even promised to take back Slavyansk one day in Motorola\\'s honor. Donetsk has lost a brave and charismatic commander but his death will serve as a warning to prepare for renewed war. Like Mozgovoi before him we will never forget Arsen Pavlov: Motorola. Sources A special thanks to @NovaShpakova for advice and inspiration I recently read Queen of Chaos: The Misadventures of Hillary Clinton by Diana Johnstone. The book is a must read. It catalogs Clinton\\'s disastrous foreign policy record and her dangerous advisers. It also provides a brilliant analysis of the past 25 years of Imperial history. With the war in Ukraine heating up let me recommend Slavyangrad to my newer readers as a great English language site on Ukraine. A great tribute to Motorola from a journalist who knew him Igor Strelkov on Motorola'"}, "time": 1742564119.4932594}