{"duration": 0.2693181037902832, "input_args": {"text": "'By Robert Fisk on November 2, 2016 Robert Fisk — The Independent Nov 1, 2016 \\nThey’re keeping open the eight passages to western Aleppo , just in case. There have been no more air strikes on the surrounded east of the city by either Syrian or Russian jets – despite the anti-government bombardment by Jabhat al-Nusra and its largely Islamist allies. The Syrian army has pushed its enemies nine miles further north of the city, in which more than 80 civilians have been killed over the past six days and the militia offensive has predictably failed. \\nNot that the United Nations could be left out. “Shocked and appalled” it was, of course, and Staffan de Mistura, the UN envoy, has churned out the old “war crimes” threat, this time directed at the West’s friendly ‘moderates’ in eastern Aleppo – whom he was keen to talk to a couple of weeks ago – rather than the Bashar al-Assad regime. But the UN’s bleatings will make no difference. Nor will the John Kerry’s oddly Gaelic fears of Aleppo smashed to “smithereens” – originally an Irish word – have the slightest effect. \\nYet the Syrian government still hopes more civilians – militiamen, too – will leave the besieged east and allow it to reabsorb the enclave without another war. Everything depends right now on three people: the commander of the Syrian Aleppo garrison, the head of the Baath party in the city, and the boss – whoever he is – of the Jabhat al-Nusra militia and their Ahrar al-Sham allies and other outfits who are defending or imprisoning (delete as appropriate, as usual) the 200,000 to 300,000 civilians in eastern Aleppo. \\nSo we’ll start with the bespectacled general in charge of the evacuation whose office I found adorned with vast operational maps of Aleppo – in which the east of the city appears as a grey, bent sausage with a circle to the left (the ancient citadel, still held by Syrian troops) pierced by eight large red arrows. Whether the arrows represent planned attacks or the crossing points which the government opened on 20 October from 8am to 4pm each day – with only 48 takers so far – was unclear. But the four large banners hanging from flagstaffs behind the general’s desk told their own story: Hezbollah’s green and yellow, the red, white and blue of Russia, the black, white and red of Syria and the green white and red of Iran. \\nA multicoloured coalition, then, with a lot of firepower – and an intriguing set of military video clips of the crossings as they opened on 20 October. Each shows a Syrian armoured vehicle with a loudspeaker calling on “the people of Aleppo” to “take out the wounded and civilians from the east of Aleppo along the routes that have been planned by the government”, adding revealingly that “the Syrian government, in cooperation with the Russian forces, will guarantee safety for you and your family”. Russian officers were indeed at the crossing points on the three first days. Two of them were wounded by snipers. One of the video clips shows a shell, apparently fired from eastern Aleppo, exploding in the background as two men run from the east to the Syrian army lines. \\nThe general thought there were only 75,000 civilians left in eastern Aleppo, an intriguing figure since the number of trapped families in the enclave have moved between 70,000 and 300,000 according to various “experts”. The UN believes the higher figure, a Syrian army officer on the front line suggested 200,000, another far more senior Syrian intelligence officer thought 250,000, the Ba’ath party guessed between 112,000 to 115,000. All of which proves that no one – neither the UN, the Syrians or journalists – has the slightest idea of just how many souls are waiting to be saved or to die. \\n“We promised to take care of the injured,” the general announced. “We did. The people who came across were free to go and live with their relatives in the west of the city or to apartments which we had reserved for them. They chose their relatives.” Then he added, almost without hesitation: “Now the decision is that we must enter the battle and put an end to the Nusra and other terrorist groups to help the people themselves to get rid of them.” \\nDid this mean that the halt in Russian and Syrian bombing of eastern Aleppo would resume? A telephone rang on the general’s desk and a flurry of staff officers ran into his office with aerial photographs – presumably the work of a drone – and his attention suddenly turned to more pressing matters. “There are armed men crossing from Turkey through the Bab al-Howa border point to the north of Lattakia” – which showed just how far the general’s remit ran in northern Syria – “and they are driving a lot of vehicles with explosives and ammunition. Look! We search for a political solution and they are ready to attack and fight.” \\nBut would the Syrians and Russians bomb east Aleppo again? “There are orders that the planes cannot bomb within 10km of eastern Aleppo,” the general replied. An interesting remark, since the general is the man who orders the air strikes – along with his Russian colleagues, of course – and he followed up with a slightly ambiguous remark when I asked for his feelings when he saw the wounded children of east Aleppo on television. “I see them as like my kids,” he replied. “I have a very high sense of humanity with civilians. But with terrorists, I have to do my national duty – to defend the civilians and protect them. The terrorists” – and the general thought there were 15 separate armed groups in eastern Aleppo – “are the same wherever they exist – in Syria, Iran, Britain, Russia, Lebanon…” \\nPerhaps. But the general also made a remark about “medical facilities for terrorists” which suggested that hospitals who treated militiamen in east Aleppo were targets for the Syrian-Russian coalition, whomever else the hospitals treated. Which also tells its own grim tale. So now to the Baath headquarters in Aleppo, bathed in generator light and sudden power cuts, where the local party head, Ahmed Ibrahim Saleh, described how he talked to east Aleppo civilians by phone, claiming that – through these interlocutors – he has contact with 12,000 civilians in the enclave. \\nAnd negotiations were continuing, he said. The Ahrar al-Sham group had indirectly received a message from the government via text and they replied by recorded phone calls: the government’s message was that they could send over a group of their men if they wanted to cross to the west of the city as a test – just two if they wanted – and these two could telephone when they arrived through the government lines and reached a safe place. \\n“They said: ‘We trust you, but we don’t trust the [Syrian] government or the [state] security apparatus’. I said, ‘just find four or five armed men to cross’. They said they would discuss this. The problem is that the leaders of these armed groups, the foreigners, make them afraid and tell them that the security apparatus will execute them. But all the armed men who have come to this building have been well-treated.” This appears to be perfectly true. But the constant reference to the ‘security apparatus’ was telling; everyone in Syria fears the mukhabarat security police. \\nWhen I asked Mr Saleh about hospitals in the east of the city, I heard a familiar story. “This is war. Maybe there are some mistakes. Maybe the plane cannot see women and children. One hospital shelled by a plane was a base for the leaders of the terrorists and was full of arms and weapons.” This was quite an admission. When Nato found soldiers hiding in a hospital during the 1999 war on Serbia, its bombs killed all the civilians in the building but none of the soldiers. No one spoke of war criminals. A different morality is in play in Syria, of course, where the bombing of hospitals is immediately – and legally correctly – referred to as a war crime. \\nAs for the conflict, “war ends when foreign support stops”, Mr Saleh said. “If America says ‘Stop the war’, the war will stop.” So now to a young Syrian army captain on the front line who guards one of the crossing points. During the truce, he received two armed men who had contacted him earlier to arrange the crossing. “They came right here to my office,” he said. “One of them was from Ahrar al-Sham, we let them come with their guns. We had vehicles ready for them with covered windows so that no one could shoot at them. I told them which road to use to come out. They were checked by our people in case they carried booby traps. We could see them but the two men could not see our soldiers. \\n“They told me that their life stopped when the war began and did not advance any more in the following years. One of the men said his dream was ‘just one more night of sleep and one more day of life for me and my family’. The two men knew each other and they complained that the armed groups were uneducated and illiterate. Yes, when we shell east Aleppo, we are defending ourselves – just as they will defend their side of the city when we rocket them. How many people are there? I myself think the UN’s figures might be exaggerated. When the passages were opened, eight wounded men from Ahrar al-Sham came out and we offered them health care and they refused and said they wanted to join the other terrorists in Idlib province. Because they were wounded, they were friendly to the army. I met the eight of them. We allowed them freely to go to Idlib.” \\nAnd this is also true. The armed men who surrendered in Homs were allowed to go to Idlib. So were the armed opposition in the Damascus suburbs, including those of Mouadamiya. Idlib seems to be the favourite dumping ground for all varieties of Islamist fighters. For the Syrian government, the armed men of Aleppo should either agree to go home or head for Idlib themselves, along with their families. But will they? The captain had heard of 40 executions by Ahrar al-Sham of armed men who wished to leave eastern Aleppo. Propaganda? Maybe. But the commanders of the Islamist groups there give no interviews to visiting western reporters – because western journalists have wisely decided not to turn up in east Aleppo and have their heads cut off. \\nSo was the recent offensive against western Aleppo the answer to the Syrians’ “passageways” to freedom, to the “corridors” of safety which were opened for the civilians? Perhaps. But given the amount of weaponry the militias deployed in recent days, they may have decided that they still have no need to negotiate another truce or take the bus to Idlib. Then we are left with the general’s remark about how “the decision is to enter the battle”. In other words, Aleppo’s agony is far from over.'"}, "time": 1742561868.4465683}