{"duration": 1.1184747219085693, "input_args": {"text": "'Before Trump’s glorious victory over the forces of progressive darkness, I promised that I would provide a roadmap on what traditional men could do next to usher in a return of the patriarchy. If Hillary had prevailed, the roadmap would have been a grim one, as all of our work would have had to take place underground. Happily, we will be able to work in the open. Here are three ways that we can leverage Trump’s victory to bring back the patriarchy.\\nRule yourself Bruce Wayne is a good role model for traditional men: Urbane, fit, financially independent—and dangerous.\\nThis may seem obvious, but if we are going to bring back the patriarchy, we have to be men who are worthy of it. A patriarch who relies solely on the fact that he is a man will quickly be overthrown. However, a man who has authority because he has earned it by the way he lives will naturally retain it. Thus, the first step in making progress under a Trump administration is the same as it would have been if Hillary had been elected—self-improvement.\\nSelf-improvement involves the obvious things: getting in shape, training martial arts, getting rid of addictions, and exercising self-discipline. The process of self-improvement needs to be under-girded with a philosophy of life. For most men, this will involve adopting, and faithfully living, one of the faith-traditions. For others, it may mean adopting stoic philosophy. Whatever it is, it will have to be more substantial than the degenerate, “pleasure, wealth, and power at any cost” morality of our Spirit Cooking elites—lack of morality got us into this problem in the first place.\\nSelf-improvement also involves moving in the direction of financial independence. Under a Trump administration, this last goal will become easier to achieve. Trump’s tax plan cuts tax rates across the board. This will especially benefit men who are in the middle class who are trying to generate more income. They will be able to keep their savings so that they can move ahead rather than paying a penalty that keeps them from becoming wealthy.\\nTrump’s emphasis on fair trade will also result in more American jobs and unleash unprecedented creativity. The age of Trump will be a great time to start a new business. One word of warning is in order though: Under Trump the US is likely to flourish in a way that hasn’t happened since the the 1920s. Enjoy the prosperity but don’t get caught back in the materialism merry-go-round. Our goal is a lifetime of financial independence, not conspicuous consumption.\\nFinancial independence is an important practical consideration because you will need a firm financial foundation for the second step, which is ruling your family.\\nRule your family Be the patriarch.\\nStarting with the boomers, our society rejected the traditional way of life and adopted progressivism. Families got smaller, divorce became more common, promiscuity increased, feminism became the default philosophy for girls, and the remaining vestiges of the patriarchy vanished. Progressivism promised freedom but delivered enslavement to political correctness and globalism.\\nA Trump administration will do little to reverse the deleterious effects that progressivism has had on the family. At best, the only thing government can do for the family is encourage it financially and provide a safe environment for it. But real change has to come from the bottom up—from men and women who return to tradition. For us, that means finding a traditional woman, or more likely one who can be converted to tradition, getting married, and having lots of children. A Twitter shitlord ( @johnrandom1234 ) drove home this point in a humorous way by suggesting with a four-step “Trump Bump” starter kit:\\n\\n\\n\\n\\nGetting married, having children, and raising them to hold to the patriarchy is the long game, but it is the only way we will have long term victory. Without a next generation of traditional men, any ground that we gain under Trump will soon be lost.\\nRule society—bring back the patriarchy Benjamin Franklin is a great example of a man who was serious about his civic duty.\\nThe next thing that we must do is start reclaiming our institutions. Trump has captured the presidency and Republicans control Congress, but many of those Republicans are cucks who will oppose the Trumpian agenda. And our other institutions are still dominated by leftists. Hollywood, the news media, education, and corporations all proclaim the progressive, anti-patriarchy message. If we don’t take advantage of the current moment, any gains that Trump makes will be quickly rolled-back after he leaves office.\\nTherefore, we need to start re-engaging with these institutions to shift them towards Patriarchal Nationalism . You can share any ideas you have to do this in the comments. Here, I’d like to suggest that one institution that needs our participation: the Republican Party. Trump has created many allies within the GOP but the majority of the Party still holds to the cucked ideology of open borders and bad trade deals like NAFTA. The GOP desperately needs like-minded men within its ranks who will help Trump achieve his vision.\\nGetting involved in your local GOP is easy. You merely have to get in touch with your local party leadership in your district. You don’t have to run for elected office. Simply volunteer your time in getting local officials elected, voting for delegates, or attending GOP events. Go in with a respectful attitude. A lot of the local GOP leaders are good people who still don’t understand that the real battle is against globalists. Work for incremental change. And, if you have the disposition required for it, consider running for local office yourself.\\nOne piece of advice: If you do choose to get involved in politics, don’t get caught up in it. One way we ended up with an ossified and out-of-touch GOP is that people started to hold the globalist neoconservatism with an almost religious fervor. The other trap is to use politics as a way of enriching oneself in the manner of Hillary Clinton. If you do choose to enter the political realm, resolve at the outset to not use it for your own financial gain. Don’t make politics your life. Think of it strictly as civic duty.\\nOf course, politics is not everybody’s cup of tea. The key is to use your gifts, whether that is in movie-making or in running a company, to help create an environment where the patriarchy can flourish.\\nConclusion The one thing we must not do in wake of the Trump victory is rest on our laurels. If Hillary had won, we’d all have a great sense of urgency to protect what little remained of our way of life. Now that Trump is coming into power, the temptation is to relax—to just let Trump do it all. This temptation must be avoided. We must capitalize on the Trump victory with the same high level of urgency that we would have regarded a Hillary victory. If we don’t, we run the risk of losing all the ground we have gained.\\nRead More: How Donald Trump Vanquished His Enemies And Conquered The Republican Party \\n'"}, "time": 1742562780.739805}