{"duration": 0.12481474876403809, "input_args": {"text": "'Now we know: Donald J. Trump racked up losses so huge in the early 1990s that he wouldn’t have had to pay federal or New York State income tax on nearly a billion dollars in income. None of this seems to have made the slightest dent in Mr. Trump’s opulent lifestyle over the years. At the nadir of his personal financial crisis in the early 1990s, his lenders put him on a monthly  “budget” of $450, 000 in personal expenses  —   more than enough to sustain his lifestyle of lavish homes, private jets, country clubs and golf courses  —   even as he was using the tax code to avoid paying any federal income tax. It’s hard to imagine a starker contrast with the vast number of Americans who struggle to both pay taxes and make ends meet, or a more damning indictment of a tax code that makes that possible. “If it wasn’t clear before, it is now: The tax code is tilted toward the rich in its statutory framework, its exceptions, and in how it is enforced and administered,” said Steven M. Rosenthal, a real estate tax specialist and senior fellow at the   Tax Policy Center. “The American public,” he said, “needs to wake up and send a message that the tax code should be written to generate revenue and enforced to collect it, not to favor wealthy real estate developers and other special interests and their lobbyists. ” If Mr. Trump’s pattern of generating losses and using them to offset other income has continued, as seems likely, it’s obvious why he has not released his tax returns: not because he is being audited, or because the returns are too complicated, but because he hasn’t paid any taxes. The latest revelations, in an article published by The New York Times, make a “compelling” case for more disclosure, said Michael Knoll, professor of law and real estate at the University of Pennsylvania Law School. “If his loss was so massive that he didn’t pay federal income tax for 15 to 20 years, that’s surprising. It’s even more surprising that someone in that situation would run for president. ” Even if Mr. Trump was correct when he asserted that he only took advantage of what the law allows, such a huge loss undermines one of his central campaign themes, which is that he is an astute and successful businessman. Given the size of the loss that Mr. Trump reported, “it’s clear he was a spectacularly disastrous businessman,” Mr. Rosenthal said. Douglas   an economist who served as director of the Congressional Budget Office and is now president of the American Action Forum, a conservative   advocacy group, agreed: “It’s either a unique combination of bad luck or he’s a terrible businessman or both. I don’t understand how you can lose a billion dollars and stay in business. ” All of this makes it even more imperative that Mr. Trump disclose more tax information, including more current returns as well as earlier returns that would explain how, by 1995, he had a huge operating loss carried forward from earlier years that approached a billion dollars. “This absolutely strengthens the case for disclosure,” Mr. Rosenthal said. “A loss of that magnitude raises all kinds of red flags. ” Mr. Trump’s records indicate that there was an attached statement that explained the net operating loss being carried forward. “That’s so tantalizing,” Mr.   said. “I’d love to see that statement. ” Mr. Trump, of course, is free to release it. It would probably answer many questions about the source of the losses. It would also help explain whether these were legitimate business losses or “accounting gimmicks and abusive tax shelters,” as Mr. Rosenthal put it. There are a number of accounting tactics that Mr. Trump might have used to generate such a huge loss, some of them considered highly aggressive and of dubious legitimacy, accounting experts said. Given the dire state of Mr. Trump’s businesses at the time, he might have been able to record   of assets under a doctrine known as “abandonment,” an aggressive accounting tactic used when an investor walks away from a worthless or nearly worthless asset and writes off the entire capital investment in the property. There is also the question of Mr. Trump’s debt. Mr. Trump personally guaranteed $832 million of debt related to his casinos and other assets. Under tax code provisions available to real estate developers, he could take the full amount as a deduction even if he didn’t invest a dime of his own money. Ordinarily, that deduction would be recaptured when the debt was forgiven or the underlying assets sold. If the debt were forgiven, Mr. Trump would have to report that as income. But there are various exceptions. If Mr. Trump was insolvent at the time  —   if his debts exceeded his assets  —   he might have avoided having to report the forgiveness of debt as income. Of course, if that was the case, it further undermines his claims to being an astute businessman. There are other provisions, too, that might have allowed Mr. Trump to deduct the loans but never have to report them as income. Real estate developers are also uniquely able to realize losses as soon as they occur, but defer gains, often indefinitely, through such tactics as   exchanges. “It’s heads Trump wins, and tails the government loses,” Mr. Knoll said. Large as the loss was, Mr. Trump didn’t even need to use any of his loss   in 1995. As I previously suggested, he was also able to use the tax breaks available to active real estate developers to report a loss of nearly $16 million from “rental real estate, royalties, partnerships, S corporations, trusts, etc. ,” which are the forms in which Mr. Trump holds most of his assets. Mr. Trump’s records show that he used that loss to offset his ordinary income. Mr. Trump reported $3. 4 million in business income, $7. 4 million in interest and a paltry $6, 000 in wages and salaries, all of it sheltered from tax by his loss. The rest of us can’t do that, unless we fit the narrow criteria for active real estate developers. “There’s probably no special interest that’s more favored by the tax code than real estate,” Mr. Rosenthal said. In examining the   tax reforms of 1986, he found “all these   for real estate interests. ” “It’s a monument to lobbying and the influence of real estate” interests, he said. Mr.   added: “It’s unbelievable. It’s due to the unique weirdness of the American love affair with homeownership,” which was used to justify these tax breaks. As Mr. Trump has said, he should be uniquely positioned to reform the system. “Mr. Trump knows the tax code far better than anyone who has ever run for president and he is the only one that knows how to fix it,” his campaign said in a statement to The Times. Hope Hicks, a Trump spokeswoman, declined to comment beyond the campaign’s earlier response to The Times. Mr. Trump hasn’t hesitated to castigate corporate executives and Wall Street money managers for taking advantage of tax loopholes, and has proposed eliminating the favorable treatment of their income, a tax benefit that pales in significance to the magnitude of his. Yet Mr. Trump chose not to release his returns, and his tax proposals would not close a single loophole that benefits him. On the contrary, he would make the tax code even more favorable to real estate developers like himself. He would lower the tax rate to 15 percent for limited liability companies and partnerships, the very entities in which Mr. Trump holds most of his assets. “He hasn’t proposed anything to address these loopholes,” Mr.   said. At the broadest level, Mr. Trump’s tax avoidance undermines the entire tax system, which rests on the foundation that every citizen pays a fair share. “Our whole system is based on voluntary compliance,” Mr. Rosenthal said. “How will people react when they see a   billionaire like Trump pays no tax? Why should they pay?” Mr. Rosenthal said it reminded him of the famous quote attributed to the hotel owner Leona Helmsley: “Only the little people pay taxes. ”'"}, "time": 1742561962.7256734}