{"duration": 0.06461715698242188, "input_args": {"text": "'Scientists Say Signals From Space are Probably Aliens \\nAndrew Anglin Daily Stormer October 29, 2016 Some of these aliens live to serve and don’t act like the Blacks at all. \\nAliens! \\nNew York Post : \\nA team of astronomers believes that strange signals emanating from a cluster of stars are actually aliens trying to tell the universe they exist. \\nThe study, which appeared in the Publications of the Astronomical Society of the Pacific , analyzed the odd beams of light from 234 stars â\\x80\\x94 a fraction of the 2.5 million that were observed. \\nThe bizarre beaconsÂ led the paperâ\\x80\\x99s authors, Ermanno F. Borra and Eric Trottier from Laval University in Quebec, to conclude that itâ\\x80\\x99s â\\x80\\x9cprobablyâ\\x80\\x9d aliens. \\nâ\\x80\\x9cWe find that the detected signals have exactly the shape of an [extraterrestrial intelligence] signal predicted in the previous publication and are therefore in agreement with this hypothesis,â\\x80\\x9d wrote Borra and Trottier. \\nThey also note that their findings align with the Extraterrestrial Intelligence (ETI) hypothesis, since the mysterious activity only occurred in a tiny fraction of stars. The hypothesis also suggests that an intelligent life force would use a more sophisticated optical beacon than, say, radio waves to reveal its existence. \\nResearchers sifted through data collected by the Sloan Digital Sky Survey â\\x80\\x94 an 8-foot-diameter telescope in Sunspot, New Mexico â\\x80\\x94 to separate natural signals from ones that appeared generated. \\nBut there are more skeptics than not , including the authors themselves, who acknowledgeÂ the hypothesis still needs work. For starters, the data need to be verified by at least two other telescopes and all natural causes need to be ruled out. \\nâ\\x80\\x9cAlthough unlikely,â\\x80\\x9d the study notes â\\x80\\x9cthere is also a possibility that the signals are due to highly peculiar chemical compositions in a small fraction of galactic halo stars.â\\x80\\x9d \\nThe chief of NASA, Charles Bolden, has released a statement on the potential aliens, saying: “If dey aliems wanga pop-off, we ready to pop-off. Dem muffugguhs ain’t no shit. We her in da earf, we strait muffuggen rawl-oot. Da fug dem aliems fink dey is? Muffugguh all fugg u ass up, nigga, shit bitch. We killen erebuddy out here, we dont giv a fuq.” NASA head Charles Bolden responded to the potentiality of aliens with what appear to be violent threats. \\nBarack Obama backed-up Bolden’s statements, saying “He be a stone-cone nigga, dat Bolden. Ah aint fux wif dat nigga. Ifn dem aliems gon fux wif dat nigga, it be like w . Nigga bitch out this muffuggeh, shii t.”'"}, "time": 1742562800.5465982}