{"duration": 0.23309779167175293, "input_args": {"text": "'BLANCHESTER, Ohio  —   A life of farming taught Roger Winemiller plenty about harsh twists of fate: hailstorms and drought, ragweed infestations and jittery crop prices. He hadn’t bargained on heroin. Then, in March 2016, Mr. Winemiller’s daughter, Heather Himes, 31, died of an opioid overdose at the family farmhouse, inside a   bathroom overlooking fields of corn and soybeans. Mr. Winemiller was the one who unlocked the bathroom door and found her slumped over, a syringe by her side. Nine months later, Mr. Winemiller’s older son, Eugene, 37, who once drove trucks and tractors on the family’s   farm, overdosed at his mother’s home. Family members and medics had been able to revive him after earlier overdoses. Not this one. Overdoses are churning through agricultural pockets of America like a plow through soil, tearing at rural communities and posing a new threat to the generational ties of families like the Winemillers. Farm bureaus’ attention to seed, fertilizer and subsidies has been diverted to discussions of overdoses.   heroin support groups are popping up in rural towns where clinics and drug treatment centers are an hour’s drive away, and broaching public conversations about addiction and death that   neighbors and even some families of the dead would prefer to keep out of view. And at the end of a long gravel driveway, Mr. Winemiller, 60, has been thinking about the uncertain seasons ahead. His last surviving son, Roger T. Winemiller, 35, spent years using prescription pain pills, heroin and methamphetamines, and was jailed for a year on drug charges. He is now in treatment and living with his father. The son dreams of taking over the farm someday. The father is wary. “Would I like to have one of my kids working the farm, side by side, carrying my load when I can’t?” Mr. Winemiller said. “Yes. But I’m a realist. ” Mr. Winemiller and a cousin inherited the farm in 1993 when an uncle died, and they own and run the business together. His surviving son has not used drugs for two months and says he is committed to recovery. But Mr. Winemiller says his first priority is “to keep the land intact. ” He worries about what could happen to the business if he turned over his share of the farm and his son relapsed  —   or worse  —   a year or a decade down the line. He also keeps a pouch of   nasal spray in the living room now, just in case. The Winemillers live on the eastern edge of Clermont County, about an hour east of Cincinnati, where a suburban quilt of bedroom towns, office parks and small industry thins into woods and farmland, mostly for corn and soybeans. Apple orchards and pumpkin farms  —   now closed for the season  —   are tucked among clusters of small churches, small businesses and even smaller   brick houses. Every so often, the roads wind past the gates of a big new mansion or   subdivision being built in the woods. Jobs have returned to the area since the recession, and manufacturing businesses are popping up along the freeway that circles Cincinnati. The county’s unemployment rate is only 4. 1 percent, and every morning, the   lanes of skinny country roads are packed with people heading to work. But the economic resilience has done little to insulate the area from a cascade of cheap heroin and synthetic opiates like fentanyl and carfentanil, an elephant tranquilizer, which have sent overdose rates soaring across much of the country, but especially in rural areas like this one. Drug overdoses here have nearly tripled since 1999, and the state as a whole has been ravaged. In Ohio, 2, 106 people died of opioid overdoses in 2014, more than in any other state, according to an analysis of the most recent federal data by the Kaiser Family Foundation. In rural Wayne Township, where the Winemillers and about 4, 900 other people live, the local fire department answered 18 overdose calls last year. Firefighters answered three in one week this winter, and said the spikes and lulls in their overdose calls gave them a feel for when particularly noxious batches of drugs were brought out to the countryside from Cincinnati or Dayton. They get overdose calls for people living inside the Edenton Rural School, a shuttered brick schoolhouse where officers have cleared away signs of meth production and found the flotsam of drug use on the floors. “I don’t think we’re winning the battle,” said David Moulden, the fire chief. “It gives you a hopelessness. ” Mr. Moulden is a good friend of Mr. Winemiller’s and responded to the 911 calls last March, then again last December, when Heather and Eugene died of overdoses. He was also on the call 10 days before Eugene’s death, when medics revived him using a dose of naloxone, which blocks the brain’s opiate receptors. “Sooner or later, you know they’re going to be found too late,” Mr. Moulden said. It was a rainy Wednesday, 9 a. m. Time for the   drive to take the younger Roger to the probation office, then a   more to take him to his drug treatment clinic. The men sank into the leather seats of Mr. Winemiller’s Chevy Tahoe and skimmed along the wet roads. The younger Roger’s driver’s license had been revoked, so this was now the routine. And, experts say, it is part of what makes addiction treatment so complicated in rural areas: Counseling centers and doctors who can prescribe   medications are often an hour’s drive away, in communities with little public transportation. “Even if you realize you’ve got a problem and are interested in seeking treatment, the treatment centers have not been there, the professionals have not been there,” said Tom Vilsack, the Agriculture Department secretary under President Barack Obama. Last year, he led an administration effort to grapple with rural opioid use. “You don’t have access to A. A. meetings seven days a week,” he said. “You’re lucky if you’ve got one a week, or you’ve got to drive 25 miles to get to one. ” Spring was coming, and Mr. Winemiller would soon be receiving the seeds for the year’s soybean crop. His days were looser now, but soon he would be leaving the house at 5 or 6 a. m. and returning at 11 p. m. “Once I get busy in the field, I ain’t going to have time for this stuff,” he said. “Hopefully I get my license back,” the younger Mr. Winemiller said. “If not, I’ll have to find a way up there. ” He added, a bit ruefully, “Set you up for failure. ” The younger Mr. Winemiller said that being back in the farmhouse had helped save his life by yanking him away from old patterns and temptations. He started working on the farm when he was 12, driving tractors even though his father had to attach pieces of wood to the pedals so his legs would reach. “I want to get back to it. That’s the whole idea,” he said. “It’s in my blood. It’s the family name. I’ve done enough to disgrace our name. I want to do everything I can to mend it. ” Death has pulled the men closer, but at home, arguments erupt over whether each understands what the other is going through. The son says he is grieving just as much as his father. The father says he is in recovery just as much as his son. Quietly, apart from his son, Mr. Winemiller worries about leaving him alone in the farmhouse when his   days in the fields resume. “I hate to say this, but because of his past, I don’t trust him,” he said. They pulled into the Clinton County Adult Probation offices for the son’s   drug test, then set out again for the drive to a new treatment center where he gets counseling and doses of buprenorphine, which can help addicts stay off opioids by keeping them from experiencing cravings and withdrawal. The son was starting to feel anxious and queasy. He cracked open the car window. “I’m going to get carsick,” he said. “I’ve got to take my medicine soon. ” He slipped one of the tiny strips into his mouth. Better. Their conversation curled like a river as they drove. Mr. Winemiller was concerned about the low prices of crops like soybeans and corn. His son talked about an intervention the two of them had staged just down the road a few nights earlier  —   talking about their own losses and the younger Roger’s treatment  —   after a    neighbor overdosed at his family’s home. The younger man pointed at the red sign of a budget motel: “I used to buy drugs there. ” He said he had bought from dealers who drove out to the countryside for a day and set up “trap houses” in trailers or apartments where they would sell to all comers. He and his father talked about motorbikes, weather and politics. The elder Mr. Winemiller, who was among the 68 percent of voters in the county who supported Donald J. Trump for president, was rankled by scenes of political protest on the news. He saw only disorder and lawlessness. “There are too many people who are too wrapped up in their lives. All they want to do is go out, bitch and complain,” he said. “My view on Donald Trump, he’s what this country needed years ago: someone that’s  . ” He likes the toughness. After his son and daughter died, he began meeting with sheriffs and politicians at forums dedicated to the opioid crisis, urging harsher penalties, such as manslaughter charges for people who sell fatal hits of opioids. As they drove, from the probation office to McDonald’s for breakfast, from Blanchester to Wilmington to Xenia, the men talked less about the past and the grief that shadows their days. The three siblings grew up in the countryside and went straight to work after high school. Each had yearslong drug problems, cycling through stretches of using and sobriety. The younger Mr. Winemiller said he and Eugene had been best friends who shared everything, drug habits included. They drank and smoked pot in high school and used methamphetamines, painkillers after operations and injuries, and ultimately heroin. “We all partied together,” he said. The older Mr. Winemiller said his daughter’s drug use was rooted in anxieties, stresses and an academic and social tailspin that began in high school. She had been in recovery for about three years when she began to use again early last year, he said. She came to stay at the farmhouse on March 26, a day after three acquaintances of hers were arrested on heroin charges at a motel in the nearby town of Hillsboro. He said he went to the garage to get her a Coke, she excused herself to the bathroom, and he was overcome by a terrible dread when he sat back down in the living room. “I knocked on the door, and there was no answer,” he said. At her funeral, the younger Mr. Winemiller said, the two brothers stood by the coffin, “telling each other how we had to make it for our parents. ” Paul Casteel, the senior minister at the Blanchester Church of Christ, conducted the services at Eugene Winemiller’s funeral. The next day, he led another funeral for another man who had died of an overdose. People live here because they like knowing their neighbors and raising their children close to extended families, Mr. Casteel said. But heroin has turned that   closeness on its head. “When somebody ends up into drugs, you’re going to know them,” he said. “You know everybody. To be honest, I wanted to stay out of it, just concentrate on the church. But we just kept getting hit. ” By early afternoon, the father and son, done with their appointments, climbed into the Tahoe and headed home down State Route 380. They smoked and listened to contemporary country play softly on the radio, and made plans for their next trip to the probation office in two days’ time.'"}, "time": 1742564198.315058}