{"duration": 0.08225440979003906, "input_args": {"text": "'“Morris From America,” Chad Hartigan’s charming new film, begins with a   discussion of   an argument about beats, flows and hooks. It’s partly an affectionate intergenerational dispute    Morris (Markees Christmas) is skeptical of his father’s   dogma, while his dad, Curtis (Craig Robinson) dismisses his son’s taste as too pop. The conversation also provides a clue about the movie’s own strategies. It’s a pop confection with a rough, honest texture, real but not raw and suffused with an infectious sweetness that lingers after the final shot. As Curtis puts it, he and Morris are “the only brothers in Heidelberg,” an   family in the perplexing and sometimes unfriendly environment of a picturesque German town. Curtis, a former soccer player in the United States, is on the coaching staff of the local team, and the rest of his back story is conveniently blurry. Like almost every other single dad you see in a movie, he is a widower, a shortcut to audience sympathy that Mr. Hartigan might have had the wit to avoid. But the novelty of the setting and the familiarity of the premise  —   an adolescent boy navigating a bumpy stretch on the road from boyhood to maturity  —   combine to give “Morris From America” buoyancy and heart. Mr. Christmas is an unusually subtle actor for someone his age. (He was 15 when the film was made.) He resists the temptation to make Morris precocious or cute, or to win over the viewer’s sympathy, and instead takes us inside the young man’s confusion. Like other teenagers, Morris is both smart and clueless, equally capable of sharp insights and colossal errors of judgment. Adding to his befuddlement is Katrin (Lina Keller) a slightly older girl (with a significantly older boyfriend) whom Morris meets at the youth center. He’s been encouraged to go there by his German tutor, Inka (Carla Juri) who serves, somewhat awkwardly, as his   and surrogate big sister. Katrin, a cynical and capricious queen bee, is beautiful and more than a little cruel. She genuinely likes Morris, which means that she likes to humiliate and torment him. She encourages him to rap at the center’s talent show, with disastrous results. “Morris From America” is blunt about German racism, which has a different texture from its American variety, partly because young,   Germans consider themselves entirely free of ancestral bigotry. A counselor at the youth center suspects that Morris is a drug dealer. The other kids blithely give voice to obnoxious assumptions about his basketball skills and his sexual prowess. He’s either a mascot or a scapegoat. Without minimizing the pain and injustice of Morris’s situation, Mr. Hartigan, whose previous features as a director are “This Is Martin Bonner” and “Erin and Brie Are on a First Date,” handles the film’s racial dimensions with a gentle touch. The movie’s most satisfying achievement is its sense of proportion. There is plenty of drama in a teenager’s everyday life  —   no need to sensationalize  —   and “Morris From America” feels true to both the pleasures and the frustrations of its title character. And let’s not forget about Curtis. Mr. Robinson, who has long been a stalwart supporting player in   and   comedies, has my vote for father of the year. If there is anything harder than being a    boy, it’s living with one, and Mr. Robinson and Mr. Hartigan nail the particular challenges of that condition as well as anyone I can think of. Curtis, who has his own emotional and professional needs, must juggle an expanding number of conflicting duties. He’s supposed to be a role model and a pal, to set limits and set his son free, to leave the boy alone and to be there when he’s required. Morris and Curtis live in a state of mutual bewilderment, but the love between them is the beat that drives the movie’s flow. The authenticity of some of the rapping means that “Morris From America” has an R rating, but if you know someone Morris’s age and swearing is not a   for you, this is a perfect movie to see together as the new school year approaches. “Morris From America” is rated R (under 17 requires accompanying parent or adult guardian). Explicit lyrics. Running time: 1 hour 31 minutes.'"}, "time": 1742628416.6073086}