{"duration": 0.14375853538513184, "input_args": {"text": "'In rhetoric, there’s an ancient concept called “argument from authority. ” In Latin, it’s called argumentum ad verecundiam.  The idea is that the person making an argument invokes a big name, saying, in effect, “   agrees with me, so I must be right!” [Of course, an argument from authority can be false.  One of the many possible fallacies is, most obviously, that the cited authority might not be an authority on the subject at all.  So the fallacy could be the mixing of apples and oranges the authority might simply not be relevant.  As with any tool, it can be used, or misused.   And as we shall see, argument from authority is a particularly favored rhetorical tactic of the Mainstream Media: The MSM introduces an authority figure, builds him or her up, and then, having created a giant, uses that giant to smack down its foes, usually, a Republican.  And what if the exemplars of authority are fallacious?  In the minds of the MSM, of course, the duty to oppose Donald Trump and the GOP is the prime imperative.  So to that end, in pursuit of this higher truth, any rhetorical    is not only allowed, but admired.  We can cite three recent examples:   First, in the January 6 Washington Post, we were presented with a headline, “I knew Gov. Schwarzenegger. Mr. Trump, you’re no Gov. Schwarzenegger. ”  We can immediately note that this wording, of course, is a play on the famous jibe of Sen. Lloyd Bentsen ( ) —  “I knew Jack Kennedy . . . ” —  aimed at Dan Quayle during the 1988 presidential campaign.  So that’s an example of argument from authority, right there. In the piece itself, writer Abby Lunardini, a former aide to Arnold Schwarzenegger when he was governor of California, seeks to contrast her former boss with Donald Trump.  In Lunardini’s telling, Schwarzenegger, now back in the news for his new role on NBC’s Celebrity Apprentice, becomes the authority on executive leadership by which Trump should be judged.  And, of course, this being the MSM, Trump is deemed to come up short.  Indeed, in making her argument, Lunardini describes virtues in Schwarzenegger that many observers had failed to notice.  In office in Sacramento, he was, she assures us, “a dedicated student of policy and government,” adding, “Schwarzenegger prided himself on being the   person in the room. ”  Having built up Schwarzenegger to Solomonic status, Lunardini now uses the august authority she has conferred on the onetime   star to dump on Trump.  In contrast to her   she writes, Trump has a “legendarily short attention span,” and a habit of “  of debate prep and intelligence briefings. ” Having thus dismissed Trump, Lunardini recalls that Schwarzenegger himself had troubles early on in his governorship, and yet he solved them by changing course he brought in a Democratic chief of staff who proceeded to “work with” (read: cave in to) the Democrats in the state legislature.  The implication is clear: In her mind, President Trump could save himself by similarly caving in to the Democrats in Washington.   As the author puts it: Perhaps Trump, like Schwarzenegger, will turn out to be a pragmatic social moderate who uses his charm and business negotiation skills to forge consensus.  And yet, Lunardini sighs, that’s not likely to happen.  As she puts it,  “That’s more than we can reasonably expect from Trump. ” Okay, so there we have one argument from authority,  : Judged by the standards of the Great Governor Schwarzenegger, President Trump is likely to be a failure.  Perhaps William J. Perry is not a household name, although some time back, from 1994 to 1997, he was an important figure, serving as secretary of defense under President Clinton.  And yet even then, he cut a relatively low profile he hasn’t really been heard from in decades.  Yet now, if Politico has anything to say about it, that will change —  his stature will rise.  According to this MSM outlet, Perry, now in his ninth decade, has reluctantly taken on the new role as “America’s nuclear conscience,” because he is worried.  And what is he worried about?  Why, Donald Trump, of course!   In the explanation of writers John Harris and Bryan Bender, Perry, supposedly a quiet sage all these years, has now been inspired to action by the  ’s supposedly careless talk about nuclear weapons and the nuclear arms race.  Perry had supported Hillary Clinton, and had assumed that she would win.  And yet, in the Politico account: By now, the reader is not surprised that the MSM has once again found an elder figure to elevate, thereby lowering the stature of Trump.  The wise man in this case is former Sen. Fred R. Harris ( ) here to tell us who is, and who isn’t, a proper populist.  And so already we can figure it out: Trump will flunk the Harris test.  Harris was once a figure of some renown.  Born in 1930 in Cotton County, OK, he became prominent when appointed to the US Senate in 1964.  He was   two years later and then, in the late 60s, became a media darling: While retaining his twangy country  western persona, he became a safe vote for every   cause of that era, even as he persisted in calling himself a “populist. ”  And for their part, East Coast leftists were happy to go along with Harris’   if he could be a reliable liberal vote in conservative Oklahoma, he was welcome to call himself whatever he wanted, if that’s what it took to give himself some political cover.  Yet Harris’ rhetorical ploys didn’t work out so well.  He avoided seeking  a third term in 1972, choosing instead to run for president his national campaign fizzled.  And in fact, at the time, it was thought that Harris  couldn’t win   in Oklahoma, as he was too liberal for the state he was, for example,   on abortion.  Harris sought the presidency again in 1976, and, once more, his campaign went nowhere.   And for the last four decades, Harris has been a professor at the University of New Mexico, although he has continued to be a liberal Democrat in good standing.  Now 86, he has been a delegate to every Democratic convention, a campaign   for Barack Obama in 2008, and a strong supporter of Hillary Clinton last year. In other words, while it certainly can be said that Harris’ progressive  credential are in good order, it’s harder to say the same of his populist credentials.   After all, populism is all about the rule of the people —  their voice, their vision.  And the people in Harris’ home state aren’t so liberal and they no longer vote for Democrats: In 2016, for example, Trump won 65 percent of the vote in the Sooner State, while Clinton won less than 29 percent   So again, it would seem that Harris is more of a leftist than a populist.  And yet in this instance, it behooves Politico writer Richard Linnett to extoll Harris’ populist credentials —  he’s the “Godfather of Populism,” after all —  because populism is the standard by which he seeks to judge, and convict, Trump.   As Politico puts it: '"}, "time": 1742563959.7259572}