{"duration": 0.27691149711608887, "input_args": {"text": "'Print This Post Dr. Squier Wins Appeal but Banned from Telling the Truth in Court about Shaken Baby Syndrome “…any professional who is prepared to speak the truth and go against the medical establishment in a shaken baby case should also be prepared to lose their career as a consequence.” Image via The Telegraph . \\nby Christina England Health Impact News Dr. Waney Squier Wins Her Appeal but Banned from Telling the Truth in Court \\nIn March 2016, after being publicly humiliated and having her career torn to shreds by the General Medical Council (GMC), pediatric neuropathologist and expert defense witness Dr. Waney Squier was found guilty of “misleading her peers, being irresponsible, dishonest and bringing the reputation of the medical profession into disrepute.” \\nHowever, if the GMC thought that that was the end of the matter, then they were mistaken, because less than eight months later, Dr. Squier was back to appeal their decision, and this time, she was not alone. Over Three Hundred Doctors, Scientists and Lawyers Write Letter of Protest \\nAfter she had been discredited months earlier, 350 doctors, scientists and lawyers rallied together in her support, and in an unprecedented move had written a letter of protest to the British Medical Journal (BMJ) , questioning the GMC’s decision. \\nThe BBC , reporting on the story, wrote: \\nHer supporters believe it is unprecedented to have so many distinguished scientists writing to the BMJ in support of a struck-off doctor. \\nSignatories include Prof Peter Fleming, the doctor who cut cot deaths; Sir Iain Chalmers, the pioneer of evidence-based medicine; and Prof Liliane Boccon-Gibod, an internationally renowned paediatric pathologist. \\nProfessionals were not the only ones demanding answers, because since their decision, the GMC have been bombarded with petitions and letters from parents and supporters from all over the world. \\nOne extremely powerful letter, written by Protecting Innocent Families , opened: \\nWe are writing in the defense of Dr. Waney Squier, a pediatric neuropathologist who was struck off the medical register this week for practicing outside her area of expertise, ignoring the opinions of her peers, and bringing the reputation of the medical profession into disrepute with her testimony and written opinions in a series of shaken baby cases she helped defend between 2007 and 2010. \\nWe know from personal experience that the prevailing model of shaken baby syndrome is flawed, a fact that is also supported by peer-reviewed literature. Although shaking an infant can cause serious injury and death, the presence of the intracranial and retinal findings now associated with shaken baby syndrome does not prove abuse, which is the vital message Dr. Squier brings to the debate. We are dismayed that the Council is sanctioning her for having the courage and intellectual honesty to express her own views, which are not popular but which are founded on solid scientific thinking and the best available evidence. Many of these diagnoses are based on the presence of non-specific findings (thin subdural hematoma, retinal hemorrhages, and encephalopathy) that can be associated with a number of medical conditions and accidental trauma as well as inflicted injury. It is a logical error to conclude that because abuse can cause the findings, the presence of the findings proves abuse. \\nAfter writing several more equally powerful paragraphs, the authors continued by adding that: \\nThe declaration also scolds Dr. Squier unfairly for her citations of the medical research. In one example, she cited the early biomechanical research of Dr. Anne-Christine Duhaime and colleagues (‘The shaken baby syndrome: A clinical, pathological, and biomechanical study,’ Journal of Neurosurgery 1987 66:409–415) to support her observation that shaking without impact has not been shown to generate sufficient forces to cause brain injury. The panel wrote that Dr. Squier had ‘completely misinterpreted what Duhaime had actually said,’ a conclusion that baffles us. The Duhaime paper was a landmark in the field, because it was the first attempt to test shaking theory scientifically, and the results surprised even the authors, who wrote: \\n‘It was concluded that severe head injuries commonly diagnosed as shaking injuries require impact to occur and that shaking alone in an otherwise normal baby is unlikely to cause the shaken baby syndrome.’ \\nThe letter, signed by a total of 24 outraged parents and professionals, ended with this final paragraph: \\nDr. Squier is a brilliant physician whose work is internationally known and respected by the scientific community, with the exception of child abuse experts. Her professional writing is founded in science and the scientific method. Her acumen, professionalism, and probity are beyond reproach. \\nIt appears that the overwhelming support for this professional has had the desired effect, because in October 2016, Dr. Waney Squier won her appeal. Dr. Squiers’ Win Tinged with Sadness \\nHowever, despite winning her appeal, as expected, there was a catch, and although Dr. Squier’s name was returned to the medical register, she has been prevented from giving evidence as an expert witness for another three years, which many believe was her punishment for standing up to the establishment. \\nIn a statement to the Daily Mail , Dr. Squier stated: \\nI have been through hell for nearly seven years and I am so grateful to my colleagues, fellow professionals, friends and family for their understanding and forbearance during this long and difficult period. \\nI am relieved that my honesty is no longer questioned and that I can put my name back on the medical register, but I feel very resentful about what has happened. \\nI have been targeted and singled out by the Metropolitan Police because I have challenged the accuracy of shaken baby syndrome. \\nCivil rights lawyer Clifford Stafford-Smith described Dr. Squier’s case as “a witch hunt” and told the Daily Mail that: \\nShe is still not being allowed to contest the underlying lack of evidence for shaken baby syndrome. This eliminates true science from the courtroom. \\nHis words are spot on; however, it is a shame that he did not mention the fact that when Dr. Squier had previously given evidence for the prosecution , years earlier, her evidence had always been readily accepted, without question. It was only when she decided to examine the SBS theory in more detail that her problems began. Never Question Authority \\nIn an article written in 2005, the website Justice Denied stated that in the early part of her career, Dr. Waney Squire had accepted the validity of the SBS theory. \\nThey wrote: \\nDr. Squier accepted the validity of SBS and testified during a number of trials as a prosecution witness that the existence of the triad of signs supported that the baby had been injured or died as a result of abusive treatment. Lorraine Harris’ trial in 2000 for manslaughter in the death of her four-month-old baby son Patrick was one of the trials during which Dr. Squier testified the triad of SBS signs were present. Harris was convicted and sentenced to three years in prison. \\nAfter Harris’ conviction Dr. Squier learned that the research of British neuropathologist Dr. Jennian Geddes resulted in the discovery that injuries associated with the SBS triad can occur naturally, including that bleeding is triggered in some babies from a lack of oxygen. Dr. Geddes suggested that there should be physical evidence that a baby suffered physical trauma before determining that abuse (SBS) occurred. \\nIn fact, it was only after studying Dr. Geddes evidence and reading his papers in full that Dr. Squier began to question the validity of the SBS theory. She told Justice Denied: \\nA light went on in my head. I became concerned that the whole basis for shaking was poor. \\nDr. Squier decided to re-examine the evidence that she had presented to the court in reference to Lorraine Harris and began to question her decisions. In an unprecedented move, she decided to prepare a report for Harris, explaining how she now believed that her trial testimony was incorrect because her baby had no physical injury and it was possible that the baby had died from natural causes. \\nJustice Denied stated: \\nBased on the new evidence in Dr. Squier’s report that the jury had not had available, England’s Court of Appeals quashed Harris’ conviction on July 21, 2005. \\nUntil this point, no one had questioned Dr. Squier and she was thought to be a leading professional in the field of SBS. However, the moment that she began to question the theory and speak out on behalf of parents, things began to change. Three Leading Pathologists Accuse Police of Smear Campaign \\nFor many years, Dr. Squier has been one of the many professionals who believed that the Metropolitan Police are deliberately discrediting any expert witness who dares to speak out on behalf of the parent in SBS cases. \\nIn 2011, BBC Today wrote: \\nThree leading pathologists have accused the Metropolitan Police of attempting to discredit them as expert witnesses in so-called Shaken Baby court cases. \\nAbout 250 Non-Accidental Head Injury (NAHI) cases go to court every year, with the outcome often relying on a expert testimony from pathologists. \\nThe Royal College of Pathologists has called for an inquiry into the claims. \\nThe three professionals, Dr. Waney Squier, Dr. Irene Scheimberg and Dr. Marta Cohen, stated that their evidence was based on a speech given in 2010, by a lead investigator with the Met’s Child Abuse Investigation Command, Detective Inspector Colin Welsh. \\nBBC Today stated that: \\nThe BBC has obtained a version of the speech made at the 11th International Shaken Baby conference in Atlanta, September 2010. \\nIn this speech, DI Welsh referred to a meeting in 2008 attended by representatives of the police, medical experts and CPS officials at which the ‘impact and effect of contradictory expert evidence’ was discussed. The Met has confirmed the meeting took place but said it was standard procedure following an acquittal in a court case. \\nAnd continued: \\nAccording to a note by a Seattle-based lawyer called Heather Kirkwood, DI Welsh talked about the failure of a number of high profile Shaken Baby prosecutions and stated the number one problem as ‘ defence expert testimony.’ \\nHe suggested as tactics to question everything about them qualifications, employment history, testimony research papers presented by these experts, and even going to their expert bodies ‘to see if we turn up anything.’ \\nTo listen to the report in full go to BBC Radio 4, File on Four . \\nIt certainly appears that Dr. Squier was right to be concerned because ever since that meeting took place, she and her colleagues have faced a barrage of complaints to their governing bodies. \\nSadly, Dr. Irene Scheimberg and Dr. Marta Cohen, have decided to no longer give evidence in SBS cases and in an interview with BBC’s John Sweeney , Dr. Scheimberg explained why. She told the BBC news team that the reason why she no longer gives evidence in the criminal and family court is because she is afraid of the possible consequences. \\nThis proves only one thing, that any professional who is prepared to speak the truth and go against the medical establishment in a shaken baby case should also be prepared to lose their career as a consequence. \\nComment on this article at MedicalKidnap.com. \\nAlso read: World Renowned Neuropathologist has Career Destroyed for Disproving Shaken Baby Syndrome Leaving a lucrative career as a nephrologist (kidney doctor), Dr. Suzanne Humphries is now free to actually help cure people. In this autobiography she explains why good doctors are constrained within the current corrupt medical system from practicing real, ethical medicine. FREE Shipping Available! Order here . Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? eBook – Available for immediate download. \\nOne of the biggest myths being propagated in the compliant mainstream media today is that doctors are either pro-vaccine or anti-vaccine, and that the anti-vaccine doctors are all “quacks.” \\nHowever, nothing could be further from the truth in the vaccine debate. Doctors are not unified at all on their positions regarding “the science” of vaccines, nor are they unified in the position of removing informed consent to a medical procedure like vaccines. \\nThe two most extreme positions are those doctors who are 100% against vaccines and do not administer them at all, and those doctors that believe that ALL vaccines are safe and effective for ALL people, ALL the time, by force if necessary. \\nVery few doctors fall into either of these two extremist positions, and yet it is the extreme pro-vaccine position that is presented by the U.S. Government and mainstream media as being the dominant position of the medical field. \\nIn between these two extreme views, however, is where the vast majority of doctors practicing today would probably categorize their position. Many doctors who consider themselves “pro-vaccine,” for example, do not believe that every single vaccine is appropriate for every single individual. \\nMany doctors recommend a “delayed” vaccine schedule for some patients, and not always the recommended one-size-fits-all CDC childhood schedule. Other doctors choose to recommend vaccines based on the actual science and merit of each vaccine, recommending some, while determining that others are not worth the risk for children, such as the suspect seasonal flu shot. \\nThese doctors who do not hold extreme positions would be opposed to government-mandated vaccinations and the removal of all parental exemptions. \\nIn this eBook, I am going to summarize the many doctors today who do not take the most extremist pro-vaccine position, which is probably not held by very many doctors at all, in spite of what the pharmaceutical industry, the federal government, and the mainstream media would like the public to believe. Read : Medical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced? on your mobile device! Dr. Andrew Moulden: Every Vaccine Produces Harm eBook – Available for immediate download. Canadian physician Dr. Andrew Moulden provided clear scientific evidence to prove that every dose of vaccine given to a child or an adult produces harm. The truth that he uncovered was rejected by the conventional medical system and the pharmaceutical industry. Nevertheless, his warning and his message to America remains as a solid legacy of the man who stood up against big pharma and their program to vaccinate every person on the Earth. Dr. Moulden died unexpectedly in November of 2013 at age 49. Because of the strong opposition from big pharma concerning Dr. Moulden’s research, we became concerned that the name of this brilliant researcher and his life’s work had nearly been deleted from the internet. His reputation was being disparaged, and his message of warning and hope was being distorted and buried without a tombstone. This book summarizes his teaching and is a must-read for everyone who wants to learn the “other-side” of the vaccine debate that the mainstream media routinely censors. Read: Read Dr. Andrew Moulden: Every Vaccine Produces Harm on your mobile device! on your mobile device! \\nSupport the cause of Medical Kidnapping by purchasing our new book! If you know people who are skeptical and cannot believe that medical kidnapping happens in the U.S. today, this is the book for them! Backed with solid references and real life examples, they will not be able to deny the plain evidence before them, and will become better educated on this topic that is destroying the American family. 1 Book – 228 pages'"}, "time": 1742562179.5208688}