{"duration": 0.13095951080322266, "input_args": {"text": "'David Shepard, a film preservationist who restored hundreds of discarded, hidden or forgotten films by masters like Charlie Chaplin, Buster Keaton and F. W. Murnau and packaged rarities for the consumer market, died on Jan. 31 in Medford, Ore. He was 76. The cause was cancer, said his brother, Donald. The era of Valentino and Fairbanks had been over for decades when Mr. Shepard, barely in his teens, began buying old films, reel by reel, with money earned from his paper route. He had been bitten by the bug when his uncle Myron, a photographer in the Signal Corps, brought home a projector and a boxful of films from France after World War II  —   abridged versions of Fritz Lang’s “Metropolis” and Georges Méliès’s experimental “A Trip to the Moon,” among others. They kindled an enthusiasm that only grew with time. Working for the American Film Institute and later for Blackhawk Films, which reproduced old films for the collectors’ market, Mr. Shepard began searching out movies that had been languishing in studio vaults or private collections and bringing them in for restoration. By trial and error, he developed techniques now used widely in commercial preservation laboratories. In 1989, after acquiring Blackhawk’s library, he created his own company, Film Preservation Associates. Over the years, he restored or made available many of the silent films now found in DVD and video libraries, including the 12 shorts that Charlie Chaplin made for the Mutual Film Corporation in 1916 and 1917, Murnau’s 1927 masterpiece “Sunrise,” all of Buster Keaton’s independent films of the 1920s, and Soviet silent films from the same decade. For many films, he commissioned new musical scores. One of his most stunning efforts was the restoration of the French filmmaker Abel Gance’s “La Roue” (“The Wheel”). Originally shown in 1923 over three days, it was cut down to two and half hours for commercial distribution, and the original was subsequently lost. Mr. Shepard, with the archivist Eric Lange, reassembled a      version from five different prints, released in 2008 by Flicker Alley. “If you’ve seen a superior print of a film by Chaplin or Keaton, Griffith or Murnau, chances are David had a hand in restoring it,” the film critic Leonard Maltin recently wrote on his blog. Just as important, Mr. Shepard brought films out of the archives and to the general public, building on the work of the pioneer revivalist Kevin Brownlow. “He was able to build an audience for silent film and keep it going,” Jeffrey Vance, a film historian who has written books on Chaplin, Keaton and Harold Lloyd, said in an interview. “He made silent films available to everyone. ” David Haspel Shepard was born on Oct. 22, 1940, in Manhattan and grew up, from the age of 11, in Tenafly, N. J. His father, Bertram, was an executive with the Grand Union grocery chain his mother, the former Marjorie Markley, was a homemaker.’ ”He was film crazy from his earliest years, with a connoisseur’s bent that his father indulged by taking him to the film programs at the Museum of Modern Art. After buying a   projector at 12, he discovered that film rental companies, hard hit by television, were selling off their stocks, and he began acquiring films for $1 a reel.” ’In junior high and high school, he filmed football games for the coaches to study. In the   he used the camera to make his own films with student actors. Mr. Shepard earned a bachelor’s degree in philosophy and religion from Hamilton College in Clinton, N. Y. in 1962 and a master’s in American studies from the University of Pennsylvania a year later. He was teaching theater and film at Pennsylvania State University in 1968 when the fledgling American Film Institute hired him to seek out historically significant films from studios and collectors, with the aim of having them donated to the institute for preservation and archiving. In an early coup, he persuaded Paramount Pictures to turn over the 200 silent features it had in storage in Fort Lee, N. J. After five years, he went to work for Blackhawk, in Davenport, Iowa, as head of product development. It was there that he led the project to acquire and restore Chaplin’s Mutual shorts, in which Chaplin’s Little Tramp character evolved from a purely slapstick figure to a rich, comedic personality. Mr. Shepard was hired by the Directors Guild of America in 1976 to oversee special projects, notably a series of oral histories with directors like King Vidor and Henry King. In the 1980s, he began teaching film history at the University of California, Los Angeles, and the School of Cinema and Television at the University of Southern California. In 1977, he married Kimberly Fetter, who had worked with him at Blackhawk. The marriage ended in divorce. In addition to his brother, he is survived by a son, Ben Baker. Pinched by competition from the video market, Blackhawk Films closed in 1987 and offered Mr. Shepard its equipment for scrap value. He bought an industrial building to house it, and to pay off the building he began doing commercial preservation and restoration work. Soon after, he acquired Blackhawk’s film library, which became the basis for Film Preservation Associates. The company worked with distributors like Kino International and Flicker Alley. Many of the titles were released in box sets, including “Masterworks of D. W. Griffith,” “The Art of Buster Keaton,” “The Golden Age of German Cinema,” “Cecil B. De Mille: The Visionary Years,” “Douglas Fairbanks: King of Hollywood” and “Georges Méliès: First Wizard of the Cinema. ” In 2006, the National Society of Film Critics gave its Film Heritage Award to Mr. Shepard and his collaborators  —   Anthology Film Archives and the film restorer Bruce Posner  —   for the   collection “Unseen Cinema: American   Films. ” Mr. Shepard, who lived in Hat Creek, Calif. had his fair share of serendipity along the way. Raoul Walsh’s first film, “Regeneration” (1915) sometimes credited as the first gangster feature, simply fell into his lap when a meter reader from Missoula, Mont. contacted him about some films he had stumbled across in a building scheduled for demolition. “When he went to read the meters for the last time, the tenants were gone but the films were still there, so he took them,” Mr. Shepard told The Los Angeles Times in 1995. “He called me looking for someone to preserve them. ” Better yet, he told the newspaper in 1999, while he was visiting a colleague in France in the early 1970s, a boy rode up on a bicycle balancing a box of films on the handlebars. He had recently retrieved them from the family farm in Normandy. Among the films was an original print of “The Tramp,” which Chaplin had made at Essanay Studios in 1915. “You couldn’t stage this in a bad play,” Mr. Shepard said.'"}, "time": 1742561784.75025}