{"duration": 0.03689455986022949, "input_args": {"text": "'Twitter has officially announced three new changes to the platform in their latest effort to combat “abuse and harassment. ”[The changes include extra measures to stop suspended users from creating new accounts, “safer search results,” and the collapsing of “potentially abusive or   Tweets. ”  “Making Twitter a safer place is our primary focus,” claimed the company in a blog post update on Tuesday. “We stand for freedom of expression and people being able to see all sides of any topic. That’s put in jeopardy when abuse and harassment stifle and silence those voices. We won’t tolerate it and we’re launching new efforts to stop it. ” “Building on the work we began in November, we’re continuing to work on ways to give people more control over what they see on Twitter,” they continued. “Last week, we introduced an improvement to reporting abusive Tweets that gives people experiencing targeted harassment more ways to report it. Today, we’re announcing three changes: stopping the creation of new abusive accounts, bringing forward safer search results, and collapsing potentially abusive or   Tweets. ” “Safer search results” will work by removing “sensitive” tweets and tweets from blocked and muted users from your searches on the platform, while their new collapsing system will hide a large quantity of replies on your tweets. Twitter does not explain what qualifies a tweet for being deemed “sensitive,” and while it says “this type of content will be discoverable if you want to find it,” it doesn’t say how since “it won’t clutter search results any longer. ” Twitter has also not yet explained how they will combat the creation of new accounts from suspended users. “In the days and weeks ahead, we will continue to roll out product changes  —   some changes will be visible and some less so  —   and will update you on progress every step of the way,” concluded Twitter in their post. “With every change, we’ll learn, iterate, and continue to move at this speed until we’ve made a significant impact that people can feel. ” The platform has introduced numerous other attempts to combat “harassment” and “hate speech” over the past few years, including a word filtering tool inspired by the   Twitter alternative Gab. Twitter, who recently donated $1. 6 million to the ACLU, has repeatedly been accused of censoring conservative and libertarian accounts over the past few years, with numerous   users having been permanently suspended from the platform. Breitbart Senior Editor MILO, Pharmaceutical Entrepreneur Martin Shkreli, and rapper Azealia Banks have all been permanently suspended from the platform, while others have been temporarily suspended following political remarks. Despite the sanctioning of   accounts, numerous abusive users have been allowed to stay on Twitter. In July, Twitter refused to sanction an account that sexually harassed and sent violent threats to a female Breitbart News contributor, while rapper Talib Kweli was able to repeatedly call numerous black conservatives “coons,” including Breitbart’s Jerome Hudson, Sheriff David Clarke, and   activist Maajid Nawaz, without suspension. Threats against the president have also been repeatedly allowed on Twitter, with over 12, 000 tweets calling for the assassination of President Trump having been made since he took office on January 20. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562955.717045}