{"duration": 0.15508651733398438, "input_args": {"text": "'WASHINGTON  —   After years of relentless growth, the number of opioid prescriptions in the United States is finally falling, the first sustained drop since OxyContin hit the market in 1996. For much of the past two decades, doctors were writing so many prescriptions for the powerful opioid painkillers that, in recent years, there have been enough for every American adult to have a bottle. But for each of the past three years  —   2013, 2014 and 2015  —   prescriptions have declined, a review of several sources of data shows. Experts say the drop is an important early signal that the   prescription opioid epidemic may be peaking, that doctors have begun heeding a drumbeat of warnings about the highly addictive nature of the drugs and that federal and state efforts to curb them are having an effect. “The culture is changing,” said Dr. Bruce Psaty, a researcher at the University of Washington in Seattle who studies drug safety. “We are on the downside of a curve with opioid prescribing now. ” IMS Health, an information firm whose data on prescribing is used throughout the health care industry, found a 12 percent decline in opioid prescriptions nationally since a peak in 2012. Another data company, Symphony Health Solutions, reported a drop of about 18 percent during those years. Opioid prescriptions have fallen in 49 states since 2013, according to IMS, with some of the sharpest decreases coming in West Virginia, the state considered the center of the opioid epidemic, and in Texas and Oklahoma. (Only South Dakota showed an increase.) So far, fewer prescriptions have not led to fewer deaths: fatal overdoses from opioids have continued to rise, taking more than 28, 000 lives in 2014, according to the most recent federal health data. That number includes deaths from both prescription painkillers, like Percocet, Vicodin and OxyContin, and heroin, an illegal opioid whose use has been rising as access to prescription drugs has tightened. While experts agree that the decline is real, they differ on what it means for patients. Some say opioid prescribing has been too loose for too long, and that it must be tightened, even if that means extra hurdles for patients in pain. “The urgency of the epidemic, its devastating consequences, demands interventions that in some instances may make it harder for some patients to get their medication,” said Dr. Nora Volkow, the director of the National Institute on Drug Abuse. “We need to set up a system to make sure they are covered. But we cannot continue the prescription practice of opioids the way we have been. We just can’t. ” Others argue that efforts to rein in prescribing have gone too far and are penalizing patients who take the medicines responsibly and need them for relief. “The climate has definitely shifted,” said Dr. Daniel B. Carr, the director of Tufts Medical School’s program on pain research education and policy. “It is now one of reluctance, fear of consequences and encumbrance with administrative hurdles. A lot of patients who are appropriate candidates for opioids have been caught up in that response. ” Opioid painkillers present a uniquely difficult public policy puzzle, in part because they became so essential to so many Americans and health officials remained deadlocked for years over how to handle them. In the past, prescribing of opioids was limited, often aimed at the pain that comes after surgery or with terminal illnesses like cancer. But it took off in the 1990s, as drug companies and medical experts argued that opioids could be used to treat chronic conditions like back pain without addicting patients. Medical residents began learning that pain was the “fifth vital sign”  —   a body function to be assessed after temperature, heart rate, respiration rate and blood pressure  —   and that opioids could help mitigate it safely. Sales of the drugs exploded, rising to nearly $10 billion in 2015, from $1 billion in 1992, according to IMS. But recently, some doctors say they have detected a shift in the attitudes of some patients toward opioids. “It used to be that people would come in and sometimes be quite insistent” about receiving opioids, said Dr. Wanda Filer, the president of the American Academy of Family Physicians. But in the past year or two, she said, “I think we’ve seen some dampening of that effect. It’s all anecdotal, but I’m hearing it state by state, all around. ” Nationally, some of the biggest declines have been in the prescribing of hydrocodone, according to IMS and Symphony Health. These drugs, which include brands like Vicodin and Lortab, remain the most broadly prescribed opioids, often given after routine dental work or other minor procedures. Prescriptions for OxyContin declined, but those for generic oxycodone went up, IMS data showed. The data measures numbers of prescriptions, not pills, but is a rough proxy for Americans’ use of opioids. One important development that may have helped propel the decline came in 2014, when the federal government tightened prescribing rules for one of the most common painkillers: hydrocodone combined with a second analgesic, like acetaminophen. In the first year after the measure took effect, dispensed prescriptions declined by 22 percent, and pills by 16 percent, according to an analysis in JAMA Internal Medicine. Refills  —   which the change made much more difficult  —   accounted for 73 percent of the decline. Over the past few years, medical schools have stepped up efforts to impress upon students the dangers of opioid prescribing. Dr. Jeanmarie Perrone, a professor of emergency medicine at the University of Pennsylvania’s Perelman School of Medicine, predicted the next generation of doctors would be appropriately “much more sparing” in their use of opioids. “When I was a resident, treating patients’ pain as a vital sign was assumed,” said Dr. Branson Page, an emergency medicine doctor in Raleigh, N. C. who finished his residency in 2008. “Now, more of us are aware that even prescribing a small number of opioids to a patient who’s never taken them before is rolling the dice on whether that patient will become addicted. ” Still, Dr. Perrone, who helped review new federal guidelines on prescribing opioids for chronic pain, said there was some risk in making young doctors “too cautious. ” “Sometimes now I will see a patient with a resident who says, ‘I don’t want to give them opioids,’” she said. “But of course they need opioids  —   they have lung cancer and worsening pain. ” The   public debate is changing minds in other medical practices, too. Dr. Mitchell Stark, an oral surgeon in Rockville, Md. said he cut his opioid prescribing this year after reading an article about teenagers getting addicted after having their wisdom teeth removed. Now he tells even patients recovering from multiple extractions to try   ibuprofen first. “I don’t want to be the person who gets a call from someone saying, ‘My kid had an overdose with the Vicodin he had left from getting his wisdom teeth out,’” Dr. Stark said. State prescription drug monitoring programs, online databases that let doctors check whether a patient is getting prescriptions from other doctors, have also helped drive declines. Tennessee tried hard to get doctors to consult the database it set up in 2006, to no avail  —   the number of doses prescribed rose by 12 percent from 2010 to 2012, state officials said. So in 2013, the state made checking the database mandatory, and the number of doses declined by 14 percent from 2012 to 2015. Many experts say that the drop in prescribing is at best a half victory, in light of the rise of deaths from heroin and illicit fentanyl, a powerful synthetic painkiller. Some addicts who started with prescription painkillers are merely turning to such street drugs or getting their hands on prescription drugs by other means. “We are seeing, in our area, many more pharmacies being robbed,” said Dr. Richard Vaglienti, the director of outpatient pain services at WVU Medicine, a health system in West Virginia. Dr. Thomas R. Frieden, the director of the Centers for Disease Control and Prevention, urged caution. “It’s a tide turning, but you have to put it into perspective,” he said. The current level of prescribing, he added, “still leaves us in very dangerous waters. ”'"}, "time": 1742561758.4466162}