{"duration": 0.10611939430236816, "input_args": {"text": "'The Trump Election Will Spark More Individual & Collective Healing Nov 9, 2016 1 0 \\nThis article will not be a pro-Trump or a pro-Hillary piece. It will have little to do with politics and more to do with a much bigger picture. As everyone knows, many people are celebrating the Trump victory and many people are mourning it. What is needed right now is a wider perspective at what is occurring. Donald Trump will become the next U.S. President. \\nWith Donald Trump set to take over the Oval Office in late January of 2017, there are many unknowns, just as it would be if Hillary would have won. \\nWhat is going to happen with health insurance? What is going to happen with immigration laws? What is going to happen with foreign policy in relation to other nations? More importantly, what is going to happen to us as individuals and humanity as a whole? \\nIndividual Healing \\nWhile these questions need to be asked and will in time be answered, we must remember that we cannot give up our personal power to shape our individual lives. Right now, many people are worried and many people are thrilled. Regardless of our feelings on this election, we must remember that we alone are responsible for our individual lives as we make countless choices each day. How will I choose to treat others today? How will I choose to treat myself today? Am I taking care of my physical body well by eating well and exercising enough? Am I ensuring to get enough sleep throughout the week? What is it I can do today to become a better person? By either believing that one person is going to save or change your entire life or by believing that one person is going to ruin your entire life gives away your own personal power. The great philosopher Epictetus once said , “It is not what happens to you, it is how you respond.” We always have a choice in our response to any situation. \\nBy either being saddened or thrilled at the perception that one man is going to either ruin or save your life is extremely dis-empowering. Though each person has every right to feel how they want, it must be remembered where true power comes from: within . Every person has the choice how they wish to respond to this election. Are you going to wither away in frustration, anger and despair or are you going to make choices that help you to become the best person you can be? On the opposite side, are you going to sit back and believe your personal challenges are going to be fixed with a new president or are you also going to take action to become the best person you can be? Regardless of who you did or didn’t support, we all need to reclaim our personal power and continue the trek towards bettering and healing ourselves, even if it is in the smallest of ways. \\nCollective Healing \\nOn a wider scale, this election will give us the collective choice to where we wish to travel. Do we wish to seek peace with other people and other countries? Do we wish to have dialogue with nations previous administrations demonized? Do we wish to communicate with and try to understand other people’s viewpoints or are we going to remain closed off to such opportunities for personal and collective healing and growth? \\nAdditionally, are we going to continue to allow group-think to dominate our society by letting the media tell us what to believe, or are we going to begin gathering information from several sources to arrive at our own conclusions? Are we going to question our leaders more and demand answers that are truthful and unbiased towards any specific agenda? Will we do this both on a local and mass level? Are we going to work towards cooperation or continue to live in a dying paradigm of competition? \\nAs physicist and author Gregg Braden says , “A growing body of scientific evidence, gathered from more than 400 peer-reviewed studies, is leading to an undeniable truth: violent competition and war directly contradict our deepest instincts of cooperation and nurturing. Scientific studies show conclusively that nature is based upon a model of cooperation and mutual aid, not violent competition and war. We live in a world where everything is connected. We can no longer think in terms of us and them when it comes to the consequences of the way we live. Today it’s all about WE .” Science has disproved Darwin’s theory and shows us we must act in unison to transcend our collective challenges. \\nI see this election as many other do: a massive turning point in our world’s evolution. I personally have full trust that we will look back at this time and see this as a positive, yet challenging event in that it empowered more people to begin taking action to create the kind of world they wish to live in. This turning point is allowing us all to shift our perception of the world and to initiate action towards creating a more peaceful, happy and abundant world for all. \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles.'"}, "time": 1742561628.486975}