{"duration": 0.12691926956176758, "input_args": {"text": "\"Posted on November 2, 2016 by DavidSwanson \\nThirty-seven years ago, the United States Congress commissioned and published a work of fiction, an account of what life in Charlottesville, Virginia, might be like during a nuclear war. It’s contained in a longer report called The Effects of Nuclear War which came out in May of 1979. It’s widely available online . \\nI take an interest for 15 pretty solid reasons: I live in Charlottesville. The world still has enough nuclear weapons with which to destroy itself many times over. We pay a lot less attention to preventing such a disaster now than we did 37 years ago. More nations have nukes now and many more are close to having them. We know more now about the numerous nuclear accidents and misunderstandings that have nearly killed us all over the decades. India and Pakistan are actually at war. The United States and Russia are as close to war as they’ve been in 98 years. The United States is investing in newer and smaller, “more usable” nukes. This Congressional best case scenario for a U.S. city during a nuclear war is deeply disturbing. We now know that even a limited nuclear war would produce a nuclear winter , preventing the production of crops depicted in this tale. It’s not so clear to me that Charlottesville would still rank last on a list of targets for nuclear missiles. It is, after all, home to the Army JAG school, the National Ground Intelligence Center, various weapon makers, a heavily militarized university, and the CIA’s underground hideout . The United Nations has just set up negotiations for the coming year of a global treaty to ban nuclear weapons, and it’s worth trying to understand why. If we survive our possession of nuclear knowledge, we still have climate catastrophe to quickly and miraculously evade or prepare for. The Republican candidate for U.S. president. The Democratic candidate for U.S. president. \\nSo, here are a few excerpts that I encourage you to consider: \\n“[This account] presents one among many possibilities, and in particular it does not consider the situation if martial law were imposed or if the social fabric disintegrated into anarchy. . . . \\n“Refugees came from Washington, 130 miles to the north, and they came from Richmond, 70 miles to the east. A few of the hardier types continued on into the mountains and caverns near Skyline Drive; the majority sought the reassurances of civilization that the small city could provide. . . . \\n“At the sound of the sirens and the emergency radio alerts, most of Charlottesville and Albemarle County hurried to shelter. Fortunately, Charlottesville had a surplus of shelter space for its own population, though the refugees easily took up the slack. Many headed for the University grounds and the basements of the old neoclassical buildings designed by Thomas Jefferson; others headed downtown for the office building parking garages. . . . \\n“Most did not see the attacks on Richmond and on Washington as they huddled in their shelters. But the sky to the east and north of Charlottesville glowed brilliant in the noonday sun. At first no one knew how extensive the damage was. . . . \\n“The total dose [of radiation] in the first 4 days was 2,000 reins, which killed those who refused to believe shelter was necessary, and increased the risk of eventually dying of cancer for those who were properly sheltered. . . . \\n“Three days after the attacks, the next large influx of refugees poured into Charlottesville, many of them suffering with the early symptoms of radiation sickness. . . . \\n“After being turned away, the sick had no specific destination. Many still clustered around the middle of town near the two major hospitals, taking up residence in the houses abandoned by local residents several days before. With minimal protection from fallout and no medical treatment for other trauma, many died, their bodies left unburied for several weeks. . . . \\n“Unprotected farm animals were dead, while those which had been confined to fairly solid barns with uncontaminated feed had a fair chance of surviving. Many of these farm animals, however, were missing, apparently eaten by hungry refugees and residents. . . . \\n“During the third week after the attacks, the new rationing system come into force. Individual identification cards were issued to every man, woman and child. Food was distributed at centralized points. . . . \\n“By now, the emergency government recognized that the need for food was going to be acute. Without power for refrigeration, much food had spoiled; stocks of nonperishable foods were mostly exhausted. As the shortages became clear, the price of food skyrocketed. . . . \\n“In addition to those with terminal radiation sickness, there were those with nonfatal cases and those who showed some symptoms. Often it was impossible for doctors to quickly identify those with flu or psychosomatic radiation symptoms. The number of patients crowding the emergency rooms did not slacken off. . . . \\n“The supply of drugs on hand at the hospitals was dwindling fast. Although penicillin could be manufactured fairly easily in the laboratories at the university, many other drugs were not so simple, even with talent and ingenuity. . . . \\n“Food riots broke out 4 1/2 weeks after the attacks — precipitated by the first large shipment of grain. . . . \\n“One day, quite without warning, the city manager was informed that one-half of his fuel stores were to be confiscated by the Federal Government, for the military and for the reconstruction effort. . . . \\n“In Charlottesville alone, several thousand people died in the first winter after the nuclear attack. . . . \\n“It was clear that if the economy did not get moving again soon, it might never. Already there were indications that manufacturing was not reestablishing itself with anywhere near the speed the planners had hoped. . . . \\n“‘We will have survived biologically, but our way of life is going to be unrecognizable. In several generations, the United States is going to resemble a late medieval society.'” This entry was posted in General . Bookmark the permalink . US Insiders – Not Russia – Leaked Clinton Emails → WillDippel \\nHere is an article that looks at the Obama Administration’s addition to America’s nuclear weapon inventory: \\nThis weapon is an obvious breach of Barack Obama’s promise in 2009 to deescalate the global nuclear weapons threat. ClubToTheHead \\nWith minimal protection … and no medical treatment for other trauma, many died, their bodies left unburied for several weeks. . . . \\nShades of Katrina.\""}, "time": 1742563310.9249825}