{"duration": 0.016121864318847656, "input_args": {"text": "'Ancient Origin \\nThough it may seem as if Halloween is a modern con trick designed to get us spending our hard-earned cash on an American celebration, this is not the case. In fact, dressing up, knocking on neighbors’ doors and asking for food at this time of year is a very old tradition. Communities on the British Isles were taking part in similar rituals as far back as the 16th century . \\nFor centuries, people have believed this was the time when the boundary between our world and the spirit world became permeable. Terrifying outfits and specific rituals were designed and used to ward off or appease evil spirits roaming the earth around All Hallow’s Eve. But evidence has also been found of ordinary people, as early as the times of the ancient Greeks and Romans, using magical incantations throughout the year to call on those departed to help the living. Lead tablets, found bound together, with magical inscriptions. Dated to 300–500 AD. Marie-Lan Nguyen ( Public Domain ) \\nThough the Romans certainly invoked spirits for aid, they also felt the need to placate the dead. According to the Roman poet Ovid , at the Lemuria festival in May, the pater familias – that is the head of the household – walked around the house at midnight, throwing black beans on the floor to pacify any ancestral spirits who might be vengeful because they had not been buried. \\nThe Romans thus had similar concerns regarding angry spirits, but, like the Greeks, they also saw the uses of those vengeful dead in their daily quest for happiness. Ancient Incantations \\nThe Greeks and Romans were as anxious about their health and happiness as we are today. So other, more private – sometimes questionable – approaches were tried, and such practices became labelled as “magic” as early as the fifth century BC. \\nMagic was big business for the ancients – and though its professionals were often accused of being charlatans who were only after customers’ money, it thrived throughout antiquity. Spells were used for various purposes. Erotic spells, for example, cast to attract someone or control your love interest, were very popular. But they were also used to confound an opponent’s speech in court, make the horses you bet on win in the races, or curse a thief who stole your money.'"}, "time": 1742628575.2203}