{"duration": 0.1283257007598877, "input_args": {"text": "' Trump is The Lesser Evil Because He\\x92s Such a Narcissist By Prof. Michael Hudson\\nShe a vindictive dictator, punishing her enemies, appointing neocons\\nWell, both Hillary and Donald Trump say the election is about the lesser evil. So, if that\\x92s true, who\\x92s the greater evil? Posted November 08, 2016\\nRoss Ashcroft: You\\x92ve got two candidates in the U.S. and one is very pro-Wall Street, specifically Goldman Sachs. She might as well be on the payroll. In fact, she is on the payroll. And the other is a rent-seeker -in-chief, and he\\x92s built real estate and used the banks. So you\\x92ve got Trump and you\\x92ve got Clinton. Both of them are in bed with Wall Street, fundamentally. But the people get it now.\\nMichael Hudson: Well, I think Hillary Clinton has a 79 percent disapproval rating, and Trump has an 81 percent disapproval rating. So you have the two most unpopular politicians in the United States as the choice. So basically, the voters in the United States are given a choice: \\x93Yes,\\x94\\x97\\x93Yes, please,\\x94 and \\x93Yes, thank you.\\x94 I think Trump missed his big chance to make a populist push. Instead of saying he\\x92s going to cut taxes on Wall Street, he can say, \\x93Look, I stiffed the banks. I went bankrupt four or six times. I screwed the banks and they didn\\x92t get paid and I can screw the banks for you people. Vote for me. I know how to do it.\\x94\\nAshcroft: Yes, he\\x92s missed that.\\nHudson: I think that would have been his winning ploy.\\nAshcroft: You should be his campaign strategist.\\nHudson: Well, except I don\\x92t think I\\x92d have many friends if I worked for Donald Trump. And we don\\x92t know that if he agreed with me today what he\\x92d do tomorrow. That\\x92s part of the problem. He doesn\\x92t play well with colleagues.\\nAshcroft: You sort of prefer him though\\x97would that be right? Because he doesn\\x92t play well with colleagues, because he\\x92s awkward, because he\\x92s a loner, because\\x97because you\\x92re saying you don\\x92t want a resourceful, intelligent and influential type in the job because the job\\x92s so powerful.\\nHudson: Well, both Hillary and Donald Trump say the election is about the lesser evil. So, if that\\x92s true, who\\x92s the greater evil? Hillary has a whole crowd behind her\\x97the neocons, who basically want to be very confrontational toward Russia and continue what she was doing in Libya to Syria\\x97militarily confrontational. Or you have Donald Trump, who doesn\\x92t really know who he can appoint and whether he can get enough people to work with him. So if the direction of America is to try to hold on to a unipolar world\\x97militarily confrontational\\x97you want a president who is least able to do evil. And there\\x92s no question, Trump is the lesser evil because he\\x92s such a narcissist, and really sort of a blank slate. And I\\x92d rather take a \\x93pig in a poke\\x94 than someone who\\x97you already know what Hillary will do. She\\x92ll do what the husband does. And it\\x92s\\x97the Clintons have corrupted the Democratic Party. That\\x92s what Bernie Sanders ran on against her\\x97\\nAshcroft: And did very well.\\nHudson: And did very well. But then he didn\\x92t realize that there really cannot be any progress by the labor unions, or consumers, or the 99 percent as long as the Democratic Party is controlled totally by Wall Street and by the Robert Rubin gang that they brought in. And they\\x92re really like a mafia gang. If you think the financial sector and the banking sector as crime\\x97and after all, remember, they\\x92ve paid billions and billions of dollars in civil fines without a single banker being sent to jail\\x97that\\x92s what a criminal wants to do. When the criminals take control of the justice system and take over the police force and bribe the judges\\x97all the Hollywood movies in the 1930s were that\\x97then you\\x92ve got the criminals in control. And you\\x92ve got the financial sector criminalized. That\\x92s what my colleague Bill Black at the University of Missouri at Kansas City has been emphasizing, and he\\x92s convinced all of us that the business plan of the big banks\\x97Citibank, Bank of America, we\\x92ve just got, and Wells Fargo, with all of the huge frauds that are coming out\\x97that was their business plan: fraud. And people are afraid to say that fraud is banking. They\\x92re afraid to say just exactly what the evidence is because it\\x92s considered impolite to talk about reality.\\nAshcroft: What sort of president then will Hillary Clinton be?\\nHudson: A dictator. She a vindictive dictator, punishing her enemies, appointing neocons in the secretary of state, in the defense department, appointing Wall Street people in the Treasury and the Federal Reserve, and the class war will really break out very explicitly. And she\\x92ll\\x97as Warren Buffet said, there is a class war and we\\x92re winning it.\\nAshcroft: As in the one percent are winning it.\\nHudson: The one percent are winning it. And she will try to use the rhetoric to tell people: \\x93Nothing to see here folks. Keep on moving,\\x94 while the economy goes down and down and she cashes in as she\\x92s been doing all along, richer and richer, and if she\\x92s president, there will not be an investigator of the criminal conflict of interest of the Bill Clinton Foundation, of pay-to-play. You\\x92ll have a presidency in which corporations who pay the Clintons will be able to set policy. Whoever has the money to buy the politicians will buy control of policy because elections have been privatized and made part of the market economy in the United States. That\\x92s what the Citizens United Supreme Court case was all about.\\nAshcroft: So that\\x92s another example of rent-seeking.\\nHudson: Yes, political payoffs. And that\\x92s the largest rent-seeking of all. Basically, for paying one penny, you get a whole dollar\\x92s worth of special privileges. And rent is really payment for a privilege. It\\x92s for a privilege that\\x92s created from the private sector. And basically as Balzac said, every great fortune originates in a great theft that isn\\x92t considered a great theft anymore because it\\x92s all viewed as part of the market. It\\x92s viewed as if that\\x92s how the world works. So you\\x92ll have a theft taking place and the Clintons will say, \\x93That\\x92s just how the world operates and GDP is going up because we\\x92re getting richer, enough to offset the degree by which you 99 percent are getting poor.\\x94'"}, "time": 1742564534.822999}