{"duration": 0.06317996978759766, "input_args": {"text": "'Hurricane Matthew was downgraded to a   cyclone early Sunday morning as it hit North Carolina and Virginia with a weakened but still powerful punch. Dispatches from our reporters on the ground a live storm tracker map and answers to reader questions will be updated below. ■ The storm’s death toll in the United States has climbed to at least 17. Gov. Pat McCrory of North Carolina said on Sunday morning that his state’s toll had risen to eight. Officials in Georgia confirmed three deaths on Saturday. At least six fatalities in Florida have been attributed to the storm. Nearly 900 people have died in Haiti, according to a Reuters report based on information from civil protection and local officials. ■ Bands of heavy rain are leading to   flooding in parts of eastern North Carolina, according to the National Hurricane Center, which may result in   flooding and flash flooding elsewhere in the region. Forecasters warned that areas along the Neuse River in Goldsboro, N. C. could experience flooding worse than the devastating inundation that followed Hurricane Floyd in 1999. The river was projected to hit 30. 9 feet around 2 a. m. on Monday, surpassing the record of 28. 9 feet caused by Floyd. ■ In Georgia, the storm created a record surge at Tybee Island, near the state’s border with South Carolina. The surge reached 12. 5 feet, according to the Chatham County Emergency Management Agency, which exceeded the previous high of 12. 2 feet, set during Hurricane David in 1979. ■ To cover the storm and its aftermath, The New York Times has journalists deployed along the its path. Follow our correspondents on Twitter. The storm’s assault on North Carolina extended into Sunday, and the governor said at least seven people had been killed in the state. “I wouldn’t assume that there aren’t people clinging for life right now in houses that are underwater that we have yet to reach, especially in   areas,” Gov. Pat McCrory told reporters in Raleigh, the state capital. “That’s what my major concern is. ” Heavy rain was still pounding parts of the state as the governor spoke, and Mr. McCrory said floodwaters could rush through North Carolina for days. The fallout, he said, “is going to be a prolonged event. ” “This is still an extremely dangerous situation,” Mr. McCrory said. “And I cannot stress it more especially in the areas of Rocky Mount, Kinston, Greenville, Goldsboro and other eastern towns, cities. We’re going to have major issues with rivers and flooding. ” Mr. McCrory said 58 boat crews had rescued nearly 900 people by Sunday morning. More than 4, 000 people were in shelters on Sunday, Mr. McCrory said, and about 760, 000 homes and businesses were without electricity. Parts of Interstate 40 and Interstate 95 were shut down.  —   ALAN BLINDER  The storm lashed South Carolina’s Lowcountry with rain and sent the sea surging upward. It turned roads into rivers and ripped trees from the inundated ground before making landfall north of Charleston. More than 430, 000 people around the state had been left without power as of late Saturday. Gov. Nikki Haley of South Carolina said on Sunday that she had lifted evacuation orders for four counties, including Charleston. But residents in four other counties  —   Beaufort, Georgetown, Horry and Jasper  —   were still urged to stay away. “We had a lot of rain, for many hours,” said Capt. Bob Bromage, the public information officer for the Sheriff’s Department in Beaufort County, southwest of Charleston. “We had flooding, we may have had some surge that we’re not aware of yet, we have downed trees, we have reports of downed trees on houses already. ”  —   JESS BIDGOOD, in Charleston The American Red Cross has published a list of safety tips for homeowners returning to property damaged in hurricanes. Once cleanup begins, taking photographs of damaged or destroyed property before it is discarded provides a record for use in making insurance claims, says Ann Carrns, who writes the Your Money Adviser consumer finance column for The Times. Gov. Rick Scott of Florida said on Saturday that the state had suffered “unbelievable amounts of beach erosion,” as well as damaged roads, flooding and felled trees. But Mr. Scott, who flew along the coastline to survey storm damage, said the storm’s consequences could have been far worse. “The first thing we can say is we are all blessed that Matthew stayed off our coast,” he said. “I worried the whole time that even though the track was off our coast, that it would turn in and have a direct hit at some point. ” State and local officials said they were trying to expedite recovery. “We’re going to ride each other hard,” said Lenny Curry, the mayor of Jacksonville. “We’re going to ride our utilities, we’re going to ride all of our workers to get this community back together as quickly and as safely as possible. Still, Mayor Charlie Latham of Jacksonville Beach asked for patience. “We’re working diligently, and to be honest with you, we’re doing our very best just to get people home and provide safe access,” Mr. Latham said.  —   ALAN BLINDER, in Orlando In Haiti, the Bahamas and Florida, the storm left behind stories of disaster and of disaster narrowly averted. Here are some of them » John Schwartz, a New York Times reporter who covers climate change and the environment, is answering reader questions about the storm. He rode out his first hurricane, Carla, in his hometown, Galveston, Tex. at age 4. He has covered the aftermath of Hurricane Katrina, as well as other storms for The Times.  Ask your hurricane questions here. Why do weather agencies and the news media keep getting the forecasts so wrong and overstate the severity of hurricanes? Is this some kind of insurance liability issue, where they are afraid of getting sued if they don’t paint a ‘doomsday’ picture?  —   Jim The conservative approach isn’t about liability, Jim, it’s about saving lives. The storm track that Matthew has followed has been well within the range of possibilities that the National Hurricane Center has been talking about all along. This is still a dangerous storm, and just because some stretches of the Florida coast have not been hit as catastrophically as was possible, that does not mean the rest of Florida or Georgia or South Carolina are in the clear. Marshall Shepherd, the director of Atmospheric Sciences Program, University of Georgia, has been fiercely defending the warnings on Twitter, and I’ll let him do the talking here: Chris W. Landsea, science and operations officer for the National Hurricane Center, said that while the storm has weakened somewhat, it is now spread over a larger area, and “a larger hurricane can cause more storm surge,” and a larger wind field the wind damage, in other words, can be felt over a larger area. So a slightly weaker but larger storm is “kind of a wash, as far as impacts,” he said.'"}, "time": 1742628443.7625399}