{"duration": 0.04735755920410156, "input_args": {"text": "'US abstains from UN vote calling for end to Cuban embargo US abstains from UN vote calling for end to Cuban embargo By 0 94 \\nThe US government abstained from the UN vote on a resolution calling for an end to the US economic embargo against Cuba, for the first time in 24 years. \\nThe 193-member General Assembly adopted the resolution with 191 votes in favor on Wednesday. The only other abstention, besides the US, was Israel. The vote is non-binding but it can have political weight. \\nCuba’s Foreign Minister Bruno Rodriguez described the abstention as a “positive step for the future of improving relations between the United States and Cuba,” according to Reuters. \\nRodriguez said in September that the embargo cost Cuba $4.6 billion last year, and the full damage over the length of the 50-year embargo was estimated at $125.9 billion. \\nWhen it was first announced that the US government would abstain from the vote, the entire General Assembly applauded. \\n“Abstaining on this resolution does not mean that the United States agrees with all of the policies and practices of the Cuban government. We do not,” Samantha Power the US Ambassador to the United Nations told the General Assembly on Tuesday. \\n“We are profoundly concerned by the serious human rights violations that the Cuban government continues to commit with impunity against its own people,” she said, according to AP. \\nThe Obama administration began normalizing relations with the Communist-run country in at the end of 2014, easing trade and travel restrictions. On July 20, 2015, diplomatic relations were restored, and embassies in the two countries were reopened. \\nLifting the full embargo will take the support of the Republican-run Congress, which remains critical of the administration’s efforts, arguing it offered too many concessions to Cuba and accepted little in return, especially on human rights and the restoration of expropriated property. \\nObama made the first visit to Havana by a US president in 88 years in March. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742563473.250806}