{"duration": 0.046922922134399414, "input_args": {"text": "'0 comments She arrived almost two hours late but still had time to act like this? Is she melting down before our eyes? Hillary Clinton was late to yet another rally. This time, in Arizona, she showed up one hour and forty five minutes late and eventually took the stage almost two hours late. Aside from her tardiness, a number of other bizarre observations are causing people to ask questions: She is finally on stage. Voice raspy. 8:15. That alone suggests serious issues with her campaign. 1 hour 45 minutes late. #HillaryInAZ \\nâ\\x80\\x94 Audit The Media đ\\x9f\\x8c\\x90đ\\x9f\\x90¸ (@AuditTheMedia) November 3, 2016 \\nRaspy voice? Are there more health concerns or is the stress getting to her? Perhaps lack of sleep… \\nAgain, people are asking questions about the mystery man who follows Hillary around: Hillary’s Handler? Brain washer? pic.twitter.com/5lsCTc8Vdk \\nâ\\x80\\x94 Mike Cernovich đ\\x9f\\x87şđ\\x9f\\x87¸ (@Cernovich) August 7, 2016 \\nOther reports says that she was yelling in a bizarre manner, but we are used to that. \\nPerhaps most telling is her pre-speech behavior. \\nShe is clearly pacing and viewers are noticing a nervous smile, as if she cannot sit still and is trying to convince herself that everything is ok. If you watch closely, you will see her speaking, presumably to the people around her, then swatting one hand in the air in a strange way. \\nIt looks as if she is using all of her self-control just to keep it together. \\nWatch and decide for yourself. Make sure to study her facial expressions and the swatting of her arm. \\nIt is easy to understand why she is stressed. The long, controversial Presidential Campaign of 2016 is winding down, the FBI is mounting multiple investigations of her and her family, and her best friend and top assistant, Huma Abedin, is likely spilling the beans on everything she knows. It is likely that Abedin and her estranged husband, Anthony Weiner, are cutting some sort of deal with authorities. \\nAll the while, the FBI is digging through 650,000 emails. \\nStressful indeed.'"}, "time": 1742564153.5197563}