{"duration": 0.0656590461730957, "input_args": {"text": "'By Hrafnkell Haraldsson on Tue, Nov 1st, 2016 at 8:00 am \"Last spring...New York had to take legal action to collect $8,578 in unpaid taxes on the Trump-owned company that owns the trademark Boeing 757\"   \\nWe looked yesterday at Kurt Eichenwald’s revelation that Donald Trump put off investigators for six months while busily destroying emails. That is hardly Trump’s only misdeed, but how many people realize that Donald Trump, at this moment, has 75 – SEVENTY-FIVE – legal issues hanging over his head. \\nHe’s lying 20 to 35 times a day and has his followers – and with much less excuse, the mainstream media – thoroughly distracted by the Clinton email nonstory so he can divert their attention away from his own legally questionable activities. \\nUSA TODAY reported at the end of October that “Just two weeks before Election Day, at least 75 of the 4,000-plus lawsuits involving Trump and his businesses remain open, according to an ongoing, nationwide analysis of state and federal court records by USA TODAY.” \\nIt will surprise no one, because Trump is already deadbeating on his own pollster , that “One Trump case, over non-payment of tips to caterers at Trump SoHo Hotel in New York City, is scheduled to go to trial a week before Election Day.” \\nIf one thing has become clear throughout this election it is that Trump does not pay his bills. Earlier, we had covered an incident where he had declined to finish paying a Florida contractor for work it did on one of his resorts, having decided that the contractor had been “paid enough,” even though it wasn’t the agreed-upon amount. Trump got nailed by the court for $300K in attorney’s fees in that case. \\nJust a few examples from USA TODAY’s investigation: \\nTrump faces significant open litigation tied to his businesses: angry members at his Jupiter, Fla. golf course say they were cheated out of refunds on their dues and a former employee at the same club claims she was fired after reporting sexual harassment. There’s a fraud case brought by Trump University students who say the mogul’s company ripped them off for tens of thousands in tuition for a sham real estate course. Trump is also defending lawsuits tied to his campaign. A disgruntled GOP political consultant sued for $4 million saying Trump defamed her. Another suit, a class action, says the campaign violated consumer protection laws by sending unsolicited text messages. \\nAs pointed out by USA TODAY’s Nick Penzenstadler and John Kelly, these lawsuits will dog Trump into the White House, should he win. He will have no immunity because he is president. And America – and the world – will be treated to the spectacle of the President of the United States having to make trip after trip to the court to settle his highly questionable personal and business affairs. \\nThere are harassment cases, sex discrimination lawsuits, fraud, unpaid bills, racist comments, defamation, cases involving Trump University. As USA TODAY notes, “as recently as last spring…New York had to take legal action to collect $8,578 in unpaid taxes on the Trump-owned company that owns the trademark Boeing 757 that jetted the mogul to campaign rallies across the country.” \\nAnd those 75 cases will likely grow. \\nTrump has promised, after all, to sue The New York Times and each of the women – NYMag maintains an exhaustive list – who have accused him of sexual assault. \\nUSA Today says it spent six months researching court records. “The exclusive analysis,” they say, “found an unprecedented mountain of legal battles for a presidential candidate, ranging from skirmishes with pageant contestants to multimillion dollar real estate lawsuits. The cases offer clues to the leadership style the billionaire would bring to the White House.” \\nDonald Trump claims Clinton is tainted. He claims Clinton’s emails are bigger than Watergate. The other day tweeted , “We must not let #CrookedHillary take her CRIMINAL SCHEME into the Oval Office. #DrainTheSwamp.” \\nThis comes from the man who would turn the 1600 Pennsylvania Avenue into a morality No-Go Zone. \\nAll the facts – including the new disclosures about Trump’s ties to a Russian server and his potentially illegal ploy to avoid paying taxes – make it clear that if Trump the deadbeat liar drains the swamp, he will be the first one down the drain.'"}, "time": 1742564136.7200997}