{"duration": 0.20136165618896484, "input_args": {"text": "\"Share on Facebook George Soros is running out of friends. With the election of Donald Trump as President of the United States and the BREXIT vote in Great Britain, a pattern is beginning to emerge. This pattern is indicating that a major take-down of George Soros and his Open Society Foundation, among other organizations, both sub and individual, is in process. The evidence to support such a claim is difficult to collect and present because of the very nature of such an operation. Outside of conspiracy sites which promote similar stories, like Putin issuing an arrest warrant for Soros, something which has not yet been proven, real information and evidence is all but impossible to find. But much ancillary and suggestive evidence is abound. This evidence is best considered and processed through understanding the mandates and strategies which Soros has been involved in, and has been attempting to influence. This will be contrasted after against the rising opposition which is represented by the election of Trump and the BREXIT vote. I won't waste word space by going into too much detail on these connections, as the internet is full of reliable and validated sources which can be easily googled and found. We will focus on the broad strokes and obvious connections which make up the larger pattern. The most obvious is open borders. George Soros and his hoard of foundations and organizations have been involved in the funding of ISIS and the subsequent migrant crisis which has spread around the world. It has even been suggested that Soros has been involved in the funding of ISIS recruits within America. The Open Society Foundation, and a host of subsidiary organizations, are now being openly exposed for their anti-Israeli operations. This could be an attempt to sever Israel's connections with the United States and isolate the nation internationally. Why Soros would do this is not immediately obvious, but will be as we explain more. The western led coup which overthrew the democratically elected government of Ukraine was also influenced by George Soros. The distain which Soros has for Russia and Putin are well known, but preventing Putin from having control the natural gas flow into Europe through Ukraine was the overriding factor. Interestingly enough, after the coup the son of VP Joe Biden invested in and sat on the board of a natural gas company in Eastern Ukraine. The Biden's are representative of the American establishment and serve the interests of George Soros. This is how it works. The establishment use their own to infiltrate and take over business and industry of nations from the inside. Biden's other son subsequently died of brain cancer. In addition, Ukraine was getting further absorbed into the Eurasian Union through trade deals with Russia and China. Removing the support in Kiev was instrumental in preventing all of Europe from being aligned with the larger Eurasian Union mandates. The BREXIT vote itself represents the interests within Great Britain hedging a geopolitical strategy in case they needed to separate from Europe and remain aligned with North America. Soros has also been directly involved in the attempted overthrow of Assad in Syria. There are many reasons for this. Syria is aligned with Russia, the enemy of Soros. But Assad also represents a problem for business interest of both Soros and the Clintons, along with others in the American establishment. The natural gas line which was meant to connect Qatar with Europe, traveling through Saudi Arabia, Syria and Turkey, is the major problem. This gas pipeline has been invested in by the Clintons and others. Assad, a friend of Russia and Putin, has refused to have it run through Syria. Soros and the American establishment require to have this gas line in place to keep Europe from being drawn into the larger Eurasian Union. The Eurasian Union is an important piece of the developing global governance framework, as is becoming more obvious. It is also important to understand that Soros has business relations with the House of Saud. These ties will be further revealed as a deeper investigation into the terror attacks of Sept 11, 2001 commences and the truth is revealed regarding the full nature of the American establishment and its control over both the republican and democrat parties. It is still my conclusion that 9/11 was an attempt to stop a transformation of the international monetary system in its early stages by using the manufactured event to hijack the global governance process. This hijacking has now failed. George Soros has also been instrumental in manipulating western policy towards Russia and China in general. The NATO buildup on Russia's borders is taking place at the same time as the attempted coup in Turkey and Ukraine, along the war in Syria. Evidence is now beginning to emerge that both Clinton and Soros had been involved in the coup attempt in Turkey. Erdogan was beginning to realign the country with Russia, which would have severely affected the interests of Soros, including threatening the route of migrants being forced into Europe. As for China, the interests of Rothschild, and to a larger extent, the broader international banking interests, have been well represented with the rise of the Asian superpower and its integration into the international monetary system. China is playing an important role in the removal and replacement of the USD as the international reserve currency. The SDR of the International Monetary Fund is being groomed for this role with the support of China. The American delays in implementing the IMF 2010 Quota and Governance Reforms are better understood as the workings of George Soros to hijack the process and prevent the shift away from the USD based unipolar system. Alternatively, they could be attempting to control the SDR development in order to ensure that the dollar remains as the dominate asset within the subgroup. Another interesting aspect of what we are reviewing here is the Panama Papers leaks . The case has been made that George Soros was behind this and the goal was to expose the Rothschild connections throughout the global banking network with the intent of taking control of the global governance process. This attempted coup against the Rothschild's and the more hidden international banking powers which they represent, is now collapsing and the backlash could very well be violent. As stated above, the BREXIT vote was the first obvious counter move against George Soros and his American establishment. This was followed by the election of Donald Trump. I have covered the connections between Trump and the Rothschild's in previous articles . The Trump platform represents a direct attack on the organizations and strategies of George Soros. Along with BREXIT, Donald Trump will be enacting policies to reduce and stop immigration from terrorist supporting nations. This can be assumed to be nations that are in alliance with George Soros. Trump has also openly stated that he will be willing to work with Russia and destroying ISIS and returning stability to the Middle East. It is my estimate that this will include the removal of the House of Saud and the establishment of a stronger Israel. The anti-Israel actions of Soros are in direct conflict with the support which Trump states he will be giving to Israel. The American embassy will even move from Tel Aviv to Jerusalem. What this means for the Greater Israel Project is not yet determined. It can be assumed that any renegotiation between Iran and Trump's America on the nuclear deal well involve discussions about Israel. Trump could very well be the first US President, along with Putin, who brings peace to the Middle East. Such a thing would be a major loss for George Soros. Trump will also be moving forward with alternatives to NATO. Russia has now called on Trump to remove NATO troops from its borders. This will likely happen and correspond with the joint-military action in Syria and throughout the Middle East. The representatives of the Anglo-American establishment within the European nations are now beginning to understand that a major shift is taking place in the geopolitical world. Repairing relations with Russia should be at the top of their lists as the Eurasian Union continues to grow in size and scope. This constitutes another major blow to the interest of George Soros and his companions in the American establishment. It is becoming increasingly clear that George Soros and those who have used both American political parties are running out of places to hide. The mainstream media is one of those. The alternative media, aligned with the larger mandates of global governance will be one of the winners. I know such a thing may be hard to believe by some readers, but in time you will see. Empire is always replaced from within. The seeds of the alternative to the existing empire are planted years and decades in advance. The placement of Donald Trump and the internet based alternative media are reflective of that. Soros attempts to reverse the election decision in the US will fail just like his efforts to rig and manipulate things in the lead up to the election. It should be obvious that this resistance to Soros and the establishment is not just an organic uprising of the people. There is a power behind this opposition and new sense of nationalism which is guiding the masses. Soros is attempting to guide his masses. Two masses resisting each other could mean civil war. But I don't think that will happen. Forces are at work to remove Soros and his web of foundations and organizations both from within and without. Whether George Soros understood that he was being used as a pawn in a larger game is hard to determine. The international banking interests, of which the Rothschild's are only the outer face, have immense power and influence over this world. George may have been presented with a cleverly crafted opening which his corrupt human nature couldn't resist. The development of his mandates and strategies, open border, terrorism, liberal-left socialism, have directly led to the rise of a new form of nationalism. This new modern nationalism is now being used to herald in the broader framework of the global governance system. The trend and pattern is clear and from where I sit it is hard to deny. Keep watching for events in the world that prove what has been written here. Major war between the world players has been averted but the risk of small regional wars remains. The chess game is not over and there could still be some causalities on both sides. The game may have been rigged against Soros and the American establishment from inception. – JC Interesting side note. Some within the American political and media establishment are now switching sides. Could have been plants all along. Related:\""}, "time": 1742561844.6565478}