{"duration": 0.08139777183532715, "input_args": {"text": "'Among choreographers, Tricia Miranda was one of pop music’s top movers and shakers. She had a hand in choreographing Missy Elliott’s surprise appearance at the 2015 Super Bowl halftime show. She created several of Beyoncé’s    dance moves from her “Diva” video from 2008. She even appeared in front of the camera, in a promotional dance video for Iggy Azalea’s single “Team. ” But that wasn’t enough. In an era when dance has exploded thanks to social media, Ms. Miranda wanted to share her dance moves, unfiltered, with the rest of the world. So in 2014, she hired a videographer to tape her dance studio in the North Hollywood neighborhood of Los Angeles, with students performing her signature moves, blending   swagger with a gymnastic breakneck pace. The first video, with a series of   dancers strutting their stuff to Nicki Minaj’s “Anaconda,” was uploaded to YouTube and has gotten more than 27 million views. Another video, set to Rihanna’s “Bitch Better Have My Money,” has been viewed 41 million times. Since then, Ms. Miranda’s YouTube channel, which shows a diverse set of dancers (some as young as 6) performing new routines to the latest hits by Tinashe, Pitbull and others, has racked up more than one million subscribers. Such attention has turned Ms. Miranda into a budding celebrity, with strangers coming up to her at hotels, grocery stores, restaurants and on the street. “I had a waiter recently cry when he met me,” she said. “He politely asked me for a picture and got emotional because I have inspired him so much. ” Her fame is about to get bigger. Ms. Miranda is starring in a new MTV series, tentatively titled “Going Off,” in which a new young dancer will be crowned at her master class studio in each episode. “I’ve been a dance instructor for 15 years,” she said. “But it wasn’t until I got big on YouTube that I started getting this much attention. ” Not since Paula Abdul, a dancer who went on to become a pop and TV personality, has the role of the choreographer been so appreciated in popular culture. “Dancing is language agnostic,” said Kevin Allocca, YouTube’s head of culture and trends. “People around the world can watch, learn and upload their own moves. ”   platforms like YouTube, Vine and Snapchat have not only expanded the reach of seasoned choreographers like Ms. Miranda, they have also turned choreographers of all kinds, who traditionally toil behind the scenes, into stars in their own right. The new celebrity choreographers include Ryan Heffington, a    dance instructor from Los Angeles with a distinctive handlebar mustache and long curly hair, who masterminded Sia’s “Chandelier” video (which features the young performer Maddie Ziegler dancing by herself in an apartment). Parris Goebel, 24, is the New Zealander behind Justin Bieber’s “Sorry” video (which features an   dance crew dressed in ’90s neon). Elle magazine recently called Ms. Goebel the world’s most     choreographer. At 36, Ms. Miranda acts as a den mother of sorts for the clutch of young dancers who flock to the Basement of NoHo, her studio in North Hollywood, a grittier neighborhood in the San Fernando Valley that has become an unofficial dance hub. “These kids are becoming YouTube stars, too,” she said, referring to    such as Jade Chynoweth, a    dancer and aspiring actress with model looks and 358, 000 Instagram followers, or Kaycee Rice, a    from Simi Valley, Calif. who performed at Missy Elliott’s halftime show. Another, Aidan Xiong, an adorable    break dancer, appeared on Ellen DeGeneres’s show in 2014. On a recent Saturday morning, Ms. Miranda was being filmed in her studio for a TV commercial for Mania Jeans, an Israeli streetwear brand. (“I have a huge following in Israel,” she said.) Clad in baggy sweatpants, oversize gold hoop earrings, chocolate brown lipstick and two Willie Nelson braids, she fired off a series of   commands to her pack of millennial dancers. “Six, seven   …     and one and four,” she called out, followed by a succession of     punctuated by foot stomps. After a feverish routine, she summoned her posse, many in midriff shirts emblazoned with slogans like “Keep It Real,” for a group selfie, which she posted on Instagram. Born in Arizona, Ms. Miranda started ballet and tap at age 4. By 19, she was teaching   classes. She moved to Los Angeles in 2001 to be closer to the action, and she made ends meet as a waitress and as a dance instructor at Gold’s Gym. Her big break came in 2004, when her agent tipped her off that Beyoncé was looking for a backup dancer for her Ladies First Tour. “I was a hostess at the time when they called me to tell me I got the gig,” she said. “I immediately took off my apron, turned to my manager and said: ‘I’m going on tour with Beyoncé. I’ve got to go. ’” Ms. Miranda has never looked back. Her résumé includes dance credits with Gwen Stefani and Taylor Swift, who are drawn to her   style, and Prince. “I liked how aggressive her choreography was,” Ms. Azalea said. “Even the smallest movement dripped with confidence. I wanted dancers that could be unapologetic, and that’s what Tricia delivers. ” Her influence is such that some artists now want their songs used on her YouTube channel. “Tricia is recognizing the songs of the moment and making them even bigger songs of the moment,” said Amanda Taylor, the chief executive of DanceOn, an entertainment network centered on dance that counts Madonna as a founder. Speaking in a hallway outside her rehearsal studio, Ms. Miranda said she was still getting used to her fame. She laughed at first when she received messages on Instagram and Facebook, with pictures of fans parroting her   look. “It’s a little strange for me,” she said. With that, she got up and returned to rehearsal. “All right, back to work everyone,” she said with the clap of her hands.'"}, "time": 1742628416.9249904}