{"duration": 0.0781559944152832, "input_args": {"text": "'A Catholic apple grower in Michigan has been barred from a city farmers’ market over his views on   marriage, after he refused to host a lesbian couple’s wedding at his orchard. [Stephen Tennes, the owner of Country Mill Farms, has sold his fruit and vegetables at the East Lansing Farmer’s Market for the past seven years. After city officials learned of his Christian belief that marriage is the union between one man and one woman, they invoked a   policy to exclude him from being able to sell at the farmers’ market.   Tennes says he was barred from selling his produce after his business, Country Mill Farms, refused to host a lesbian couple’s wedding at its orchard in Charlotte, 22 miles outside East Lansing. Explaining his position on Facebook, Tennes cited his “Catholic belief that marriage is a sacramental union between one man and one woman. ” In a statement, the city of East Lansing said the farmer’s decision not to host a   wedding violated a “  ordinance that protects sexual orientation as well as the Supreme Court’s ruling that grants the right for   couples to be married. ” In point of fact, the city introduced a modification to the city’s farmers market vendor agreement just this year requiring sellers to comply with East Lansing’s Human Relations Ordinance. Among other things, the ordinance prohibits discrimination on the basis of sexual orientation, gender identity and expression. The city’s punitive action targets the farmer’s use of his own private property, 22 miles outside the city and well outside its jurisdiction. Mr. Tennes has declared that he does not discriminate against LGBT customers at the farmer’s market, and gladly sells his produce to all comers. “It’s our faith that informs us how to treat all who come to our farm and the farmers market with dignity and decency   …     serving customers of many races, religions, cultures and those who identify with the LBGT community,” he said. When it came to actually hosting a   marriage that contradicts his biblical understanding of the nature of marriage, Tennes felt obliged to decline. “Our faith and beliefs on marriage and hosting weddings at our home and in our backyard of our farm have nothing to do with the city of East Lansing,” Tennes said at a press conference. According to Gay Star News, the biblical view of marriage is “homophobic” and the City of East Lansing barred Tennes for his “homophobic religious views. ” On Wednesday, May 31, Tennes filed a federal lawsuit against the city of East Lansing seeking his reinstatement at the market.  According to the lawsuit, Country Mill is the only business to have been prohibited under the market’s   policy. The Alliance Defending Freedom, a nonprofit legal organization specializing in religious liberty cases, is representing Tennes. They have asserted that his religious views on marriage have no bearing on his involvement at the market and said the city’s actions amounted to a First Amendment violation. “Steve and his farm have been singled out and excluded from full participation in the life of the community for only one reason,” said ADF counsel Kate Anderson. “Steve expressed a viewpoint the city did not like. ” “If the government can shut down a family farmer just because of the religious views he expresses on Facebook   …     then no American is free,” Anderson said. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742563894.370042}