{"duration": 0.13645100593566895, "input_args": {"text": "'Tweet Home » Gold » Gold News » Regret Ever Buying Gold and Silver? AGXIIK Has A Few Words To Share With You… \\nIf you bought silver at $35 and now regret buying silver because the dollar-based price dropped 50%, I have a few words to share with you… \\n\\nSubmitted By AGXIIK: \\nSome people on these boards debate the wisdom of buying precious metals and PM stocks and tend to blame the messenger if the prices change or sentiment goes against that purchase. \\nI can understand that entirely because on the surface, when Doc or others, including myself as the #2 precious metals pimp on these boards, along with the 20 other sites offering the same advice and products, urged and continue to urge in strongest terms the wisdom of buying gold and silver, plus stocking up on preps such as are offered here as well (I don’t hear anyone busting Doc’s balls for selling ammo, survival food, medicines and water filters) there will be a number of people who question that wisdom. \\nIf you bought silver at $35 and now regret buying silver because the dollar-based price dropped 50% I have a few words to share with you. \\nIf you made that choice for the right reason and see the price drop by 50%, you will be rewarded in other ways. Time is on our side, even for the older of us who don’t have the luxury of decades to wait. Some certainty that you have real money in your safe comes to mind. The price might not be on your side right now but 6,000 years of history is. \\nYou might be rewarded by silver going to $50 an ounce although that might be the low end of the price spectrum when silver reached its apogee. \\nIf you made that choice in the hopes that the $35 silver goes to $100 or even $200, as I did in the early stages of my purchases, then hopes for riches were far from realized. Now we can see why that was not the best decision by a very wide margin. Precious metal prices can make the strongest of us question our thinking and maybe shed a tear or two over our decision. \\nIf you didn’t stay the course because you thought you were lied to the precious metals dealers, couldn’t stand the financial pressure of going ‘all in’ or no longer can fight the evil bastards, that cast of characters ( you know who they are) who’ve taken over the majority of the markets and rig the prices on an hourly basis, I can completely understand that capitulation. The stock market has kicked the living crap out of me more than a few times. \\nI’ve had more moments of doubt that I made the right decision that I can count as I watch others making fortunes investing in this and that, harvesting paper profits in investments that are destined for the dust bin. But I’ve never regretted or repudiated my decision to buy precious metals. \\nMy strategies have changed a bit now given that I know more about these markets. That’s been a very slow process, partly because it’s been very difficult to shed 55 years of living in a far different paradigm than this one and partly because I am very hard headed SOB and hate to admit I jumped on the band wagon early on and at much higher prices. Fortunately I’ve received good counsel from some really smart people, those who have a much broader perspective than me. EdB, Eric, Sovereign Economist, Pat Fields (RIP) to mention a few. And if I forgot your name I didnt forget your wisdom. \\nMy wife and I have lived in the miasmic stink of the Obama paradigm for 8 years. This latest chapter of a decades-old scheisse show seems like it’s lasted a lifetime but it is coming to an end. The last 8 years and decisions made by us are still sound in light of the latest news. Today, with the horror show we watch on a minute by minute basis, these decisions are becoming even more sound. We live in a world beset by uncertainty. The ability to move quickly and wisely instead of reactively is vital to our well being. Having a strong financial base is critical to buffer ourselves against uncertainty. Precious metals form part of that base. \\nFor thousands of years we peasants have lived by a credo of self reliance. We know, on an instinctive basis, that the powers that be are always willing and able to take what we have by hook or crook. That psychopathic 1% has always been with us. This time is no different. The forces arrayed against us rely on the same time-tested means to harm us. We used to counter them with revolutions, migrations and holding real money in a hole in the dirt floor of out hut. \\nUnbacked paper currency, debt, central banks out of control, total corruption in the political and banking worlds, moral depravity, intentionally spread of fear and despair, pitting us against them, divisive politics and an overarching world girdling power that controls everything from afar are nothing new. What is new is the world wide awakening of the masses. We peasants, serfs, Ordinary Joes and Janes who see we are being serious screwed with by the powers that be are mad as hell and we’re not going to take it any more. Good News. We finally know their names today. To know their names is to give names AND faces to our enemies, the enemies of the people; names and faces of those who would oppress us. \\nThis time around the situation is even more grave because the people who would have us are legion, with fangs bared and hands reaching out to take what for we have worked our entire lives. The tipping point of us vs them is coming to a head. But they are still human and vulnerable. The bleed like the rest of us. They can be killed, just the rest of us. More good news. There are 10,000 of us to 1 of them. \\nAs Ballinger notes, the real crises in several dozens of countries worldwide is pressing against the people. We see it in real time, see the terror of the people as their lives are being systematically destroyed by forces so dark and evil that I have trouble even imagining there are people like this living the world, united to take We, the People down to hell with them. They have faces and we see them in real time. \\nI’ve studied, thought, wrote, proselytized and yes, pimped precious metals and preps, awareness and means to counter the threats we see arrayed against us, even to the point that it makes me look like some loon on a Hyde Park soap box. Soap box or note, I’m still fully convinced of the wisdom of those choices, putting my money and time where my mouth is. It’s taken thousands of hours out of my life to do this; time that I could have easily spent elsewhere. I made a decision years ago to be a voice that would not be idle or quiet. If I can turn a bit of the tide and change even a mere 100 minds then it’s been worth every minute of time spent. \\nLike Doc, Tyler, Eric Dubin and hundreds of others, I believe we are facing an existential threat, partly of our own making because we allowed some really bad actors to move on us, and partly due to things we are barely aware of. I’m not Biblical in that respect, leaving those avenues to others more schooled in religious matters. \\nThe fact that we now see the fangs and claws of those who would have us, it’s impossible to put that cork of unawareness and lack of knowing back in the bottle and just hope for the best. The best we can do is be self aware, prepared and knowledgeable that these are uncertain times filled with financial mistakes, monetary hurricanes and political earthquakes. Some are of our own making because we elect fools and psychos to high office. Some are made by those who don’t care who they harm they do so long as we are forced to pick up the tab. Picking up the tax used to be voluntary. Now it’s written into law. We get to make good on everything that’s been done wrong by the 1% and their political allies. They f*** up and we get to pay. \\nAyn Rand spoke of this and many things in her book Atlas Shrugged but more than that, we have dozens of tomes and hundreds of authors telling us that things are not what they seem. The old paradigms no longer hold. Knowing this it’s best to have some assets that comprises a good fallback position if the worst should befall us. \\nThis entry was posted in Finance News , Gold News , Silver News and tagged AGXIIK , Dollar collapse , economic collapse , Gold , hyperinflation , inflation , silver . Bookmark the permalink . Post navigation'"}, "time": 1742562056.7816658}