{"duration": 0.059060096740722656, "input_args": {"text": "'Professor Joseph Palermo of California State University argued that Donald Trump should have his Twitter access revoked because of his beliefs on climate change. [In an editorial piece for The Huffington Post, Palermo addressed his concerns over climate change denial on the political right. Palermo argued that Trump shouldn’t be allowed to use internet technology like Twitter because of his attitudes towards climate change science.  “I’ve always believed that people who dismiss science in one area shouldn’t be able to benefit from science in others,” he wrote. “If Trump and his cohort believe the science of global warming is bogus then they shouldn’t be allowed to use the science of the Internet for their Twitter accounts, the science of global positioning for their drones, or the science of nuclear power for their weaponry. ” Palermo claimed that Trump wasn’t the only influential republican that he was concerned about with regards to attitudes towards climate change science. It’s not just the people around Trump who reject the science of climate change. The leadership of the Republican Party  —   from House Speaker Paul Ryan to Senate Majority Leader Mitch McConnell, to the chairs of the key science and technology committees in Congress, to the Republicans’ favorite think tanks  —   all share the fossil fuel industry’s preference that the U. S. government does nothing to address the most serious planetary crisis humanity has ever faced. The Republicans’ cravenness on climate change is clear. After claiming for years that the science was “inconclusive” (or a “hoax”) they held the public position that they opposed any concerted action to reduce greenhouse gases because China and India would never go along. Then, in 2015, when China and India signed on to the Paris Climate accords, Mitch McConnell and the Republican leaders began telling foreign governments that the Republicans would fight against any international deal on climate change in any case. Palermo has a history of radical statements. Writing in the LA Progressive, Palermo claimed that the 2016 Presidential election “felt at times like the prolonged public lynching of the nation’s first black president. ”'"}, "time": 1742562018.6408956}