{"duration": 0.030057430267333984, "input_args": {"text": "'Conservative Tribune \\nVoters don’t typically think much about the voting machines they’re using, but this election season, what kind of voting machine used might end up being critical in how the election turns out. \\nThat’s because Smartmatic, a U.K.-based technology company that provides voting machines to countries around the world, has deep connections to leftist billionaire George Soros . \\nLord Mark Malloch-Brown, the chairman of Smartmatic, is on the board of Soros’ Open Society Foundations . He was the former vice chairman of Soros’ Investment Funds and the deputy secretary general of the United Nations when he worked as Kofi Annan’s chief of staff. \\nMalloch-Brown has also worked with consulting firms that have ties to Democrat presidential nominee Hillary Clinton and husband, Bill. He was an international partner with the Sawyer-Miller consulting firm, and he was also a senior adviser to FTI Consulting, which handled communications under contract for Bill Clinton’s 1992 run for the presidency. \\nTop Clinton adviser Mandy Grunwald is a Sawyer-Miller alum. Grunwald was in charge of the firm’s communication contract for former President Bill Clinton’s 1992 presidential run. She also headed up communications for Hillary Clinton’s 2008 presidential bid. \\nJackson Dunn, senior managing director with FTI Consulting, worked as an aide to both Bill Clinton and Hilllary Clinton. \\nThose are troubling connections. \\nSmartmatic claimed it had provided 15 states and the District of Columbia with voting machines: Arizona, California, Colorado, District of Columbia, Florida, Illinois, Louisiana, Michigan, Missouri, Nevada, New Jersey, Oregon, Pennsylvania and Virginia, Washington and Wisconsin. So be on the lookout for signs that your precinct is using Smartmatic products. \\nSmartmatic’s website included a graphic describing how the company has contributed to U.S. elections from 2006 to 2015 with “57,000 voting and counting machines deployed” and “35 million voters \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742563557.2399416}