{"duration": 0.10468292236328125, "input_args": {"text": "'WASHINGTON  —   Defense Secretary Ashton B. Carter on Thursday removed one of the final barriers to military service by lifting the Pentagon’s ban on transgender people serving openly in the armed forces. “Effective immediately, transgender Americans may serve openly,” Mr. Carter said. “They can no longer be discharged or otherwise separated from the military just for being transgender. ” The decision pushes forward a transformation of the military that Mr. Carter has accelerated in the last year with the opening of all combat roles to women and the appointment of the first openly gay Army secretary. He made his feelings on ending the transgender ban clear last year, when he called it outdated and ordered officials across the military to begin examining what would need to be done to lift it. When Mr. Carter ordered that assessment, there were already thousands of transgender people in the military. But until Thursday, most had been forced into an existence shrouded in secrecy to avoid being discharged, a situation much like that faced by gay men, lesbians and bisexuals before the lifting of the “don’t ask, don’t tell” policy in 2011. Transgender people have “deployed all over the world, serving on aircraft, submarines, forward operating bases and right here in the Pentagon,” Mr. Carter told reporters. “The lack of clear guidelines for how to handle this issue puts the commanders and the service members in a difficult and unfair position. ” For many transgender people, the lack of clarity described by Mr. Carter has resulted in them being forced out of uniform. Army Capt. Sage Fox, 43, was in the reserves when she told her unit that she was transgender in November 2013. A month later, she was placed on inactive status and has not done any reserve duty since. She called the end of the ban “thrilling news,” and said she expected to be reactivated as a reservist in the coming weeks. She was confident that the military would adapt. “We’re military officers. We are trained to be adaptable, and I get so frustrated when people think we’re not going to be able to deal with this,” she said in an interview. “You’re on the battlefield, the situation changes in the blink of an eye, we adapt and overcome. That’s what we do. ” Mr. Carter said the Pentagon would cover the medical costs of those in uniform who are seeking to undergo gender transition, though it would expect new recruits who are transgender to spend at least 18 months in their transitioned gender identity before joining the military. The Pentagon also plans to begin a broad, yearlong training program about the changes for service members up and down the ranks. The military’s top leaders, including Gen. Joseph F. Dunford Jr. the chairman of the Joint Chiefs of Staff, were on board with ending the prohibition, Mr. Carter said, although none of the military’s top brass appeared with him for the announcement. Lifting the ban on transgender people has faced resistance from some at the highest ranks of the military, who have expressed concerns over what they consider to be a social experiment that could potentially harm the military’s readiness and effectiveness in combat. When Mr. Carter in July 2015 first ordered the military to begin examining how to lift the ban, he indicated the work would be completed earlier this year. But as winter turned to spring and the ban remained in place, “I think everyone was raising questions about what was going to happen,” said Aaron Belkin, the director of the Palm Center, a research institute that has studied the effects of having gays, lesbians and transgender people in the military. Still, the announcement on Thursday came faster than Mr. Belkin would have predicted when he began to press for lifting the transgender ban three years ago, after the end of “don’t ask, don’t tell. ” “I thought it would take 10 or 15 years” he said. Mr. Belkin said that the end of “don’t ask, don’t tell,” the opening of combat roles to women and the lifting of the ban on transgender people were “all about the same idea  —   that job assignments should be based on merit, not about gender identity or sexuality. ” Those within the military who did not feel similarly were unsurprisingly silent on Thursday. Republicans in Congress were not. Senator Jim Inhofe of Oklahoma, a Republican member of the Senate Armed Services Committee, called for the new policy to not be carried out until Congress could convene hearings. And Representative Mac Thornberry of Texas, the chairman of the House Armed Services Committee, released a statement saying he would examine “legislative options to address the readiness issues associated with this new policy. ” “Our military readiness  —   and hence our national security  —   is dependent on our troops’ being medically ready and deployable,” Mr. Thornberry said. “The administration seems unwilling or unable to assure the Congress and the American people that transgender individuals will meet these individual readiness requirements at a time when our armed forces are deployed around the world. ” But several studies on the issue have concluded that lifting the ban is unlikely to have any appreciable effect on the readiness of the armed forces. Estimates of the number of transgender service members have varied, but the number most often cited comes from a study by the RAND Corporation and commissioned by Mr. Carter. It found that out of the approximately 1. 3 million   service members, an estimated 2, 450 were transgender, and that every year, about 65 service members would seek to make a gender transition. Providing medical care to those seeking to transition would cost $2. 9 million to $4. 2 million a year for the Pentagon, which spends about $6 billion of its $610 billion annual budget on medical costs for   service members, according to the report, which was completed in March. The report also said that if the Pentagon did not cover medical procedures like hormone therapy and surgery, transgender service members would probably not seek medical care and could have higher rates of substance abuse and suicide. Making the announcement on Thursday, Mr. Carter said the Pentagon had studied the experience of allied countries that already allow transgender people to serve in their militaries, such as Britain, Australia and Israel. He also cited the experience of companies such as Boeing and Ford, which offer health insurance policies that cover the costs of gender transitions. “That’s up from zero companies in 2002,” Mr. Carter said. “Among doctors, employers and insurance companies, providing medical care for transgender individuals is becoming common and normalized in both public and private sectors alike. ” But as much as any practical concern played into the decision, Mr. Carter said it was also “a matter of principle. ” “Americans who want to serve and can meet our standards should be afforded the opportunity to compete to do so,” he said. “After all, our   force is built upon having the most qualified Americans. And the profession of arms is based on honor and trust. ”'"}, "time": 1742562204.6458879}