{"duration": 0.04651594161987305, "input_args": {"text": "'We Use Cookies: Our policy [X] Trailer For Trainspotting 2 Sparks 1000% Increase In Sales Of Drugs Nationwide November 3, 2016 - BREAKING NEWS , ENTERTAINMENT Share 0 Add Comment \\nTWENTY years on from the first Trainspotting movie, a trailer for its sequel has come roaring onto the internet, sparking an immediate uptick in business for local drugs dealers. \\n“Fucking class,” remarked countless session heads as they poured over the adrenaline rush of a trailer which clocked in at under 3 minutes and welcomed back Renton, Spud, Sickboy and Begbie into their lives. \\nWatching the trailer prompted many now emotional drug users to reach out to their local dealers and place overambitious orders for this coming weekend, with their eyes firmly placed on a massive, consequence free session, much like those depicted in the original movie adaptation of the Irvine Welsh novel. \\n“Ah, ya forget how class the first one was, what a movie. Can’t fucking wait for the weekend now boi, casual hassle free Trainspotting weekend ahead for me,” remarked a Waterford local, whose memory hasn’t been the same thanks to years on the session. \\nLocal drug dealers are said to be overjoyed at the increase in business. \\n“If there’s one thing you can say about Ireland’s towns and cities, it’s that they’re not fond of drugs at all so we’re happy with any business we can get,” explained one drug dealer, who can’t believe he didn’t think about playing Trainspotting on a big outdoor screen in order to boost business sooner. \\n“I’ve hired about 200 screens now, everyone will be ringing me shortly,” he added, before showing off the additional eight mobile phones he had bought to cope with the incoming demand. \\nWith the reported 1000% increase in drug sales a ‘babies crawling on the ceiling’ warning has been issued nationwide.'"}, "time": 1742562152.6416044}