{"duration": 0.032547950744628906, "input_args": {"text": "'Trump no quiere que EEUU toma parte de Acuerdo de París 2016/11/13 13:22 Twitter El mandatario electo de los Estados Unidos, Donald Trump, ya está buscando formas rápidas para que Washington salga del acuerdo mundial de París contra el cambio climático. \\nUSviewer, EEUU_ Así informó Reuters, citando a una fuente de su equipo de transición, quien reprochó al saliente presidente Barack Obama que firmara la adhesión del país mediante una orden ejecutiva, sin contar con el apoyo del Senado. \\n\"Fue insensato que el Acuerdo de París entrara en vigencia antes de la elección\" del martes, dijo la fuente, que habló bajo condición de anonimato. El Acuerdo de París obtuvo el 4 de noviembre el apoyo necesario para ser puesto en marcha. \\nPues, según la fuente, la alternativa es enviar una carta de retiro de la Convención de 1992 que está asociada al Acuerdo de París, lo que restaría la participación de Estados Unidos en ambos en un año, o emitir una orden presidencial que borre la firma de Washington del acuerdo sellado en la capital francesa. \\nMuchos países se han mostrado optimistas para que EE.UU. se mantenga adherido al pacto, aunque Marruecos, sede de las actuales conversaciones, dijo que el acuerdo que busca reducir las emisiones de gases de efecto invernadero en la segunda mitad del siglo es lo suficientemente fuerte como para sobrevivir al éxodo estadounidense. \\nEl triunfo del candidato republicano a la Casa Blanca, Donald Trump, en los comicios del pasado martes, ha generado diversas reacciones tanto dentro del territorio estadounidense como en otras partes del mundo, una victoria que ha sido acogida con la satisfacción de algunos, el temor o la prudencia de otros. \\nEn diciembre de 2015, tras 13 días de intensa negociación en un suburbio de París (capital de Francia), representantes de 195 países consiguieron el acuerdo histórico para reducir drásticamente las emisiones de gases de efecto invernadero en un intento por detener el calentamiento global. \\nHasta este sábado había sido ratificado por 109 países que suponen el 76 por ciento de los emisores de gases con efecto invernadero. Estados Unidos supone el 18 por ciento de las emisiones. No hay comentarios para esta noticia Nombre : '"}, "time": 1742562282.384125}