{"duration": 0.2207801342010498, "input_args": {"text": "'AB-Çin ilişkilerinde ABD ve NATO’nun etkisi yazan Manlio Dinucci Uluslararası bir forumda konuşan İtalyan coğrafyacı Manlio Dinucci, ABD’nin tüm dünyaya egemen olabilmek için sahip olduğu silahların analizini bireşimleştirdi. Suriye, Rusya ve Çin’in bugün elde silah, herkesin açıkça kabul ettiği bu üstünlüğü, dünyanın bu tek kutuplu örgütlenişi tartışılır hale getirmesinden dolayı bu makale daha da önem kazanmaktadır.\\nVoltaire İletişim Ağı | Roma (İtalya) | 5 Kasım 2016 français Español English Deutsch Doğrudan sorunun düğüm noktasına yöneliyorum. Avrupa Birliği ve Çin arasındaki ilişkilerden, ABD’nin doğrudan ve NATO aracılığıyla Avrupa Birliği üzerinde uyguladığı nüfuzdan bağımsız olarak söz etmem mümkün değil.\\nBugün, 28 AB ülkesinin 22’si (Birleşik Krallığın AB’den çıkışından sonra 27 ülkesinden 21’i), Birlik halkının % 90’nından fazlası, AB tarafından « ortak savunmanın temeli » olarak tanınan NATO’nun üyesidir. Ve NATO, ABD komutası altındadır: Avrupa’daki yüksek müttefik Komutan hala Amerika Birleşik Devletleri Başkanı tarafından atanmaktadır ve diğer tüm kilit komutanlıklar ABD’nin elindedir. Avrupa Birliği’nin askeri ve dış politikası böylece, Avrupalı büyük güçlerin üzerinde amaç birliği yaptığı, asli olarak ABD stratejisine tabi durumdadır.\\nResmi belgelerde açıkça dile getirilen bu strateji, SSCB’nin dağılması sonucunda küresel durumun değiştiği tarihsel anda çizilmiştir. Beyaz Saray 1991 yılında, National Security Strategy of the United States ’te şu beyanda bulunur: « Amerika Birleşik Devletleri, her boyutuyla –siyasi, ekonomik ve askeri- gerçekten de küresel olan bir güce, menzile ve etkiye sahip tek Devlettir. Amerikan liderliğinin yerini alabilecek hiçbir güç yoktur ». 1992’de, Defense Planning Guidance ’ta Pentagon şu görüşlerin altını çiziyor: « Birinci hedefimiz, herhangi bir gücün, bir küresel gücün ortaya çıkması için yeterli kaynaklara sahip bir bölgeye egemen olmasını engellemektir. Bu bölgeler, Batı Avrupa, eski Sovyetler Birliği toprakları ve Güney-Batı Asya’dır ». 2001’de, Quadrennial Defense Review ’ün ABD/NATO’nun, Rusya ve Çin’e karşı bir numaralı jeostratejik öneme sahip bir alan olan Afganistan savaşından bir hafta önce yayınlanan bir raporunda, Pentagon şunları söylüyor: « Bölgede mükemmel bir kaynak temeline sahip askeri bir rakibin ortaya çıkması muhtemeldir. Silahlı kuvvetlerimizin, ABD’nin, Devlet ve devlet dışı oluşumlar da dahil olmak üzere, rakip bir Devletin rejimini değiştirmek ya da ABD’nin hedefleri gerçekleşinceye kadar yabancı ülke topraklarını işgal etmek üzere, herhangi bir rakibe iradesini dayatma yeteneğini koruması gerekmektedir ».\\nBu strateji temelinde, ABD komutası altındaki NATO doğu cephesinde taarruzunu başlattı: Yugoslav Federasyonunu savaş yoluyla yıktıktan sonra, 1999’dan günümüze kadar, eski Yugoslavya’dan üç ve üç de eski SSCB’den olmak üzere, her seferinde Rusya’nın daha da yakınına, nükleer olanlar da dahil askeri üs ve güçlerini kaydırarak, eski Varşova Paktının tüm Devletlerini ilhak etmiş ve pek yakında daha da başkalarını ilhak edecektir (Gürcistan ve daha şimdiden somut olarak NATO içerisinde olan Ukrayna’dan başlayarak). Aynı zamanda, doğu cephesiyle sıkı sıkıya bağlı güney cephesinde ABD komutası altındaki NATO, savaş yoluyla Libya Devletini ortadan kaldırdı ve aynı şeyi de Suriye’de yapmayı denedi.\\nABD ve NATO, Ukrayna krizini patlattılar ve Rusya’yı « Avrupa’nın güvenliğini istikrarsızlaştırmakla » suçlayarak, Avrupa’yı, ABD çıkarlarına zarar veren Rusya-AB arasındaki ekonomik ve siyasi ilişkileri bozmak için, özellikle Washington’un arzuladığı (yaptırım ve karşı yaptırımların darbe vurduğu Avrupa ekonomilerinin zararına) yeni bir Soğuk Savaşa sürüklediler. ABD silahlı kuvvetlerinin, Çin karşıtı bir işlev içerisinde Asya-Pasifik bölgesinde artarak yerleşmesi de yine aynı strateji kapsamında gerçekleşiyor. U.S. Navy 2020 yılında, deniz ve hava güçlerinin %60’ını bu bölgede yoğunlaştıracağını duyurdu.\\nABD stratejisi, ABD Pasifik Komutanlığının başı Amiral Harris’in önemini altını çizdiği Güney Çin Denizine yoğunlaşmış durumdadır: Burası dünya petrol ihracatının %25’i ve doğal gaz ihracatının %50’si, yıllık 5 000 milyar dolardan daha fazla bir değere sahip yıllık değere sahip deniz ticaretinin geçiş yaptığı yerdir. ABD bu denizyolunu, Amiral Harris’in « burada, ABD’deki yaşam sistemimiz için temel olan seyrüsefer özgürlüğü » adına, Çin’i « Güney Çin Denizi’nde, Rusya’nın Kırım’da yaptıklarıyla benzer saldırgan eylemlerde bulunmakla suçlayarak » denetimi altına almak istiyor. Bu amaçla U.S. Navy, Güney Çin Denizinde « devriye » görevi yapmaktadır. ABD’nin dümen suyundan en büyük Avrupa güçleri de geliyor: Fransa geçtiğimiz Temmuz ayında Avrupa Birliğinden « Çin’in gayrimeşru olarak talepte bulunduğu bu sularda düzenli ve görünür bir varlığı sağlamak için, Güney Çin Denizi’ndeki deniz devriyelerinin eşgüdümünü » yapmasını talep etti. Ve Amerika Birleşik Devletleri Güney Kore’ye « füze savunma » ama Rusya’ya karşı Romanya’da yerleştirilen ve yakında Polonya’ya da da konuşlandırılacak olan, aynı zamanda nükleer füzeler fırlatma yeteneğine sahip sistemleri yerleştirirken, NATO Genel Sekreteri Jens Stoltenberg, 6 Ekim’de Brüksel’de, « Seul ile NATO içerisindeki işbirliğini güçlendirmek » üzere Güney Kore Dışişleri Bakanı Yun Byung-se’yi kabul etti.\\nBu olgular ve diğerleri de, Avrupa ve Asya’da aynı stratejinin uygulandığını ortaya koymaktadır. Bu, Amerika Birleşik Devletleri ve diğer Batılı güçlerin, yeni devletsel ve toplumsal öznelerin ortaya çıktığı güçlü değişim içerisindeki bir dünyada, ekonomik, siyasi ve askeri üstünlüklerini koruma girişimidir. Çin-Rusya stratejik mutabakatının meyvesi olan Şanghay İşbirliği Örgütü, dünyanın en büyük bütünleşik ekonomik alanı olabilecek kaynak ve istihdam kapasitesine sahiptir. Şanghay İşbirliği Örgütü ve BRİCS ülkeleri, mali kurumlarıyla, 70 yıldır ABD’ye ve Batının en büyük güçlerine borçlu ülkelere verilen tefeci borçları ve diğer finansal enstrümanlar aracılığıyla dünya ekonomisine hükmetme imkanı veren Dünya Bankası ve Uluslararası Para Fonunun büyük bölümüyle yerini alabilecek durumdadır. Yeni kurumlar aynı zamanda, hakim uluslararası döviz olarak kullanılan parayı basarak kendi borçlarını başka ülkelerin sırtına yükleme imkanını ABD’den alarak, ticari alışverişlerde dolardan çıkış sürecini de gerçekleştirebilir.\\nGün geçtikçe daha da sallantıda olan üstünlüklerini muhafaza edebilmek için ABD sadece silah gücünü kullanmakla yetinmiyor, ama çoğu zaman kelimenin asıl anlamındakilerden daha da etkili silahlardan da yararlanıyor.\\nBirinci silah: AB ile olan « Transatlantik Ticaret ve Yatırım Ortaklığı » (TTIP) ve sadece ekonomik değil ama jeopolitik ve jeostratejik amaca sahip « Trans-Pasifik Ortaklığı » (TPP) gibi sözüm ona « serbest ticaret anlaşmaları »dır. Hillary Clinton bu yüzden, siyasi ve askeri konuları entegre eden bir « ekonomik NATO » önerisinde bulunarak, ABD-AB ortaklığını « Transatlantik ittifakımızın en büyük stratejik hedefi » olarak niteliyor. Proje açıktır: yine ABD komutası altında olmak üzere, Çin ve Rusya arasındaki işbirliğini temel alan ve yükselmekte olan Avrasya alanına, İran’a ve kendini Batının egemenliği altında görmek istemeyen diğer tüm ülkelere karşı siyasi, ekonomik ve askeri bir ABD-AB bloğu oluşturmak. Çıkar farklılıkları ve Avrupa’daki geniş kapsamlı muhalefet yüzünden TTIP müzakereleri zorlukla ilerlediği için, şimdilik, Kanada ile Amerika asındaki NAFTA’ya dahil olduğu için bir kamufle TTIP olan Kanada ve AB arasındaki « Kapsamlı Ekonomik ve Ticaret Anlaşması » (CETA) ile engelin çevresinden dolaşılmaktadır. CETA muhtemelen önümüzdeki 27 Ekim’de, Kanada Başbakanı Trudeau’nun Brüksel ziyareti sırasında AB tarafından imzalanacak.\\nİkinci silah: Her ülkenin çeşitli ölçülerde sahip olduğu zayıf noktalara dayanarak, içeriden huzursuzluk çıkarmak amacıyla hedef ülkelere sızılmasıdır: rüşvet, para hırsı, siyasi ikbal avcılığı, yerel iktidar grupları tarafından kışkırtılan ayrılıkçılık, dinsel fanatizm, geniş kitlelerin siyasi demagoji karşısında savunmasızlığı. Aynı zamanda, bazı durumlarda, kendi hükümetlerinin icraatına yönelik halkın memnuniyetsizliğine de dayanarak. Sızmada kullanılan enstrümanlar: gerçekte ABD Dışişleri Bakanlığı ve CİA’nin uzantıları olan sözde « sivil toplum kuruluşları »dır. Doğu Avrupa’da « renkli devrimleri » örgütleyen ve Çin’de ulusal azınlıkların yaşadığı diğer bölgeleri de kışkırtmaya yönelik olan, Hong-Kong’taki sözüm ona « Umbrella Revolution » ile aynı operasyonu gerçekleştirme girişiminde bulunan, devasa ekonomik imkanlara sahip kuruluşlardır bunlar. Aynı örgütler Latin Amerika’da, Brezilya’nın demokratik kurumlarını alaşağı etme ilk hedefiyle Brics ülkelerini içeriden mayınlamaktadır. Aynı stratejinin enstrümanları, aynı zamanda dışarıdan da saldırıya uğrayan Devletlerin topyekun ortadan kaldırılmasına hizmet eden, Libya ve Suriye’ye sızdırılanlar gibi kaos ortamı yaratmak üzere silahlı terörist gruplardır.\\nÜçüncü silah: küresel medyatik kanallar aracılığıyla yürütülen ve Pentagon tarafından « önceden belirlenen hedeflere hizmet edecek davranışlara sürüklemek ya da bunları pekiştirmek için, yabancı kamuoyu, örgüt ve hükümetlerinin duyarlılık ve motivasyonlarını belirlenen haberler aracılığıyla etkilemeye yönelik planlı harekatlar » olarak tanımlanan « PsyOp »’lar (Psikolojik Operasyonlar). Kamuoyunu savaşın tırmanışına hazırlayan bu operasyonlar aracılığıyla, aynı zamanda onları « insan haklarını ihlal etmekle » suçlayarak, Rusya’yı Avrupa’daki ve Çin’i ise Asya’daki gerilimlerin sorumlusu olarak gösterdiler.\\nManlio Dinucci ve eşi Carla, 1965 yılında Mao Tse Tung’un doğduğu evin önünde. Son bir tespit: Altmışlı yıllarda Pekin’de eşiyle birlikte Çin’in bir numaralı dergisinin İtalyanca olarak yayınlanmasına katkıda bulunan biri olarak, Çin’in –sömürgeci, yarı-sömürgeci ve yarı-feodal durum koalisyonundan henüz on beş yıl önce özgürleştirilen- Batı tarafından tamamen tecrit edildiği ve ne Batı, ne de Birleşmiş Milletler tarafından egemen Devlet olarak tanınmadığı bir dönemde, derinden eğitici bir deneyim yaşadım. Bu dönemden geriye bende iz bırakan, Komünist Partinin önderliği altında tamamen yeni ekonomik ve kültürel temeller üzerinde bir toplum inşa etme inancında olan, o dönemlerde 600 milyon nüfuslu bu halkın direniş ve bilinç kapasitesi oldu. Bu kapasitenin bugün de, devasa gücüllüklerini daha da geliştirmekte olan çağdaş Çin’in, insanlığın geleceği için verilen nihai mücadeleye katkıda bulunarak, yeni emperyalist hakimiyet planlarına direnebilmesi için de aynı şekilde gerekli olduğunu düşünüyorum. Bu kavga, artık daha fazla savaşların olmadığı, toplumsal adalete ayrılmaz bir şekilde bağlı olan barışın zafer kazandığı bir dünya uğruna verilmektedir.\\nManlio Dinucci Çeviri\\nOsman Soysal'"}, "time": 1742561875.354392}