{"duration": 0.047171592712402344, "input_args": {"text": "'Written by Eric Margolis Saturday November 19, 2016 Russia’s dispatch of a ten-ship flotilla to the Syrian Coast has raised some outrage and sneers aplenty in the West. Particularly when one of its embarked MiG-29K fighters crashed on takeoff from Russia’s sole carrier, the obsolescent Admiral Kuznetsov which lacks catapults. Joining Kuznetsov are believed to be two \"Akula\" class nuclear-powered attack submarines that are much feared by Western navies. On the surface will be the powerful, missile-armed battle-cruiser, \"Peter the Great.\" Unlike Western warships, which are essentially fragile tin cans packed with electronics, \"Peter the Great\" is armored and built to withstand punishment. Other Russian missile frigates and supply ships are also off Syria. Washington just hates it when the Russians dare do what the US has been doing since World War II: conduct gunboat diplomacy, however limited. As a student of Russian naval affairs, I’m watching the current deployment of warships from the Red Banner Northern Fleet with much interest. Russia has wanted to be a major naval power since the days of Peter the Great in the early 1700’s, but it has always faced the curse of Russian geography. In spite of limited access to the world’s seas, Russia is largely a landlocked nation spread over vast distances. Russia faces geographic barriers every way that it turns. Most important, Russia’s major fleets – Northern, Baltic, Black Sea, and Pacific – are unable to concentrate on supporting one another due to geographical constraints. Compare this to the mighty US Navy that can move all but the largest warships from the Pacific to Atlantic or vice versa. All major US naval bases give easy access to the high seas. The only Russian ports that do are remote Vladivostok and even remoter Petropavlovsk on Kamchatka – that has no land link to the rest of Russia. No Russian can forget the calamity of the 1903-1904 Russo-Japanese War. Russia’s Pacific Squadron was largely bottled up in the naval fortress at Port Arthur by a surprise Japanese attack, 38 years before the Pearl Harbor attack. As a result, Russia has to send its Baltic Fleet more than halfway around the globe to the North Pacific on a 33,000km (18,000 miles) journey of the damned that took nearly half a year.] An accidental encounter in the fog with the British herring fleet nearly provoked a war with Great Britain – which reacted with similar alarm as Vladimir Putin’s fleet sailed by Britain on the way to Syria. On 27 May 1905, the combined Russian fleet was ambushed off Korea at Tsushima by Japan’s brilliant admiral, Hideki Togo. After a fierce battle (I’ve sailed over the exact spot) the Russian fleet was sunk or captured, the first time a Western power had been defeated. Tsushima lit the fuse of the 1917 Russian revolution. Russia’s inability to unite its fleets threatened their defeat in detail in a major war. World War II saw the Russian fleets more engaged in naval infantry land battles than maritime operations. During the Cold War, the US and its allies were able to bottle up Russia’s fleets by sealing off the Greenland-Iceland-UK gap, then Baltic exits at the Skaggerak Strait, and the Black Sea exit at the Turkish Straits. The US Navy planned to directly attack Russia’s Pacific Ports and cut the Tran Siberian railroad that supplied them. As a final impediment, the US SOSUS underwater hydrophone system was able to spot Soviet submarines from the time they left their home ports. After the fall of the Soviet Union, Russia’s neglected navy atrophied and rusted. The current mission to Syrian waters is an important sign that the Kremlin intends to restore some of its former naval power and assert Russian interests in Syria, where its had maintained a modest supply and repair depot at Tartus since 1971. Moscow’s use of naval forces to fire missiles and launch air strikes at jihadist rebels in Syria is its biggest naval venture since 1990. Interestingly, Moscow used its almost forgotten Caspian Sea squadron to launch missiles at the same jihadists. Such strikes could have been done solely from land. The Kremlin was signaling that its strategic reach had lengthened. America’s legions of pro-war neocons are now screaming that the Red Navy’s deployment to Syrian waters is somehow a grave threat to the West. It is not. The US Navy and land-based NATO airpower could easily deal with the Russians. What really worries the neocons is that the Russian flotilla might deter or impede an Israeli attack on Syria and Lebanon. And besides, is Russia not allowed to have a navy? Syria’s coast is as close to Russia as Mazatlan, Mexico is to Texas. Reprinted with permission from LewRockwell.com . Related'"}, "time": 1742628470.3957691}