{"duration": 0.053087711334228516, "input_args": {"text": "'Norway’s Labour party will look at introducing a third gender category if they are voted to power in the general election due to take place later this year. [And it’s only a matter of time before the other parties get behind the idea now that Labour’s draft programme for   says Norway “should consider introducing a third gender category” according to a member of the programme committee.  “People who define themselves as neither male nor female would have the opportunity of being legally recorded as a third gender” Mani Hussaini, who also leads the   Workers Youth League, told NRK. “For example in a person’s passport it would say they were not male or female but instead belong in a third gender category. “I believe all people should have the opportunity to live out their identity and then have to adapt the laws to reality and not vice versa,” he explained. Asserting that there’s a “broad mood” in favour of the proposal, Hussaini told the public broadcaster he’s confident that other parties will back the option for Norwegians to legally ‘become’ a third gender. “I feel that [people who claim to be neither male nor female are] a movement. When the country’s largest party backs [creating a third gender option] I expect we’ll see all the other parties following suit. ” Health spokesman for Centre, part of the   coalition which governed Norway until 2013, said her party isn’t ready to support the creation of another gender category. Kjersti Toppe told NRK: “It is an issue, but to amend the law to introduce a third gender would affect us all. It’s a proposal that Centre are nowhere near ready to consider. ” Left party politician Kjetil Kjenseth said it’s “only a matter of time” before a third gender is written into law, asserting that “support is high among younger representatives of several parties”. Proposed by the Left party, but supported by just the Greens and the Socialist Left Party, Norway’s parliament overwhelmingly voted against the introduction of a third gender category last April. Explaining his support for the policy, Kjenseth told NRK: “[The introduction of a third gender] doesn’t mean much for the rest of us, but would greatly benefit those who don’t find their gender expressed in the categories of male and female. “This applies not only to transgender people but also a great number of heterosexuals who have alternating gender expression. ”'"}, "time": 1742562025.8840473}