{"duration": 0.03162717819213867, "input_args": {"text": "'License DMCA \\nLeading protests and stirring up trouble in the Senate might be all that\\'s left for Bernie Sanders to do in contesting Hillary Clinton\\'s administration if, as many expect, it deviates from her public embrace of some Sanders positions if and when she becomes President. \\n\"I won\\'t stay silent if Clinton nominates the same old, same old Wall Street guys,\" Sanders said this week. \"The leverage that I think I take into the Senate is taking on the entire Democratic Party establishment, and, you know, taking on a very powerful political organization with the Clinton people. We won 22 states and 46 percent of the pledged delegates, 13.4 million votes ... and a majority of the younger people, the future of the country. ... That gives me a lot of leverage, leverage that I intend to use.\" \\nLooking forward to Clinton\\'s expected election on Nov. 8, the 75-year-old Vermont senator said he\\'s begun to draft some of his planks that were accepted into the Democratic platform into legislation: on climate change, minimum wage and breaking up big banks. But given what we now know about what the Clinton machine thinks of him, it\\'s debatable how much leverage he\\'ll have. \\nIt\\'s not hard to imagine Sanders contemplating what could have been as he sees the two most unpopular candidates in modern history beset by ever deepening scandals: Clinton from Wikileaks revelations and Trump from exposure of alleged sexual misconduct. \\nSanders now knows for certain how the Democratic National Committee undermined his candidacy when it was supposed to remain neutral. And he knows from Wikileaks\\' disclosure of Clinton\\'s Wall Street speeches, which he repeatedly demanded that she make public, how cozy she is with plutocrats. - Advertisement - \\nA Third-Party Run \\nIn the context of these revelations, is it not reasonable to assume that if Sanders had taken Jill Stein\\'s offer to head the Green Party ticket that such a team would have gotten 15 percent in the polls and a place at the debates? Wouldn\\'t Sanders\\'s presence at the debates have given an alternative to voters who detest both Trump and Clinton and at least a chance to build a viable third-party movement? Hillary Clinton and Bernie Sanders in New Hampshire on July 12, 2016. License DMCA \\nSanders said he supports Clinton because an independent or a third-party run could have handed the election to Trump. \"I don\\'t want to end up like Ralph Nader,\" Sanders told journalist Chris Hedges. Nader is blamed for handing the 2000 election to George W. Bush over Al Gore with his Green Party run, which kept the vote in Florida close enough for Bush, with the help of five Republicans on the U.S. Supreme Court, to claim its electoral votes and thus the presidency. [For how a full Florida recount would have given Gore the White House, see Consortiumnews.com\\'s \" Gore\\'s Victory \" and \" So Bush Did Steal the White House. \"] - Advertisement - \\nBut it is questionable whether Sanders would have divided the Clinton vote to make Trump president. Millions of angry voters from an eroding middle class could have supported Sanders instead of Trump. In other words, Sanders could have taken away just as many and perhaps more votes from Trump, as both were insurgency candidates against the Establishment\\'s choice. \\nSanders who hasn\\'t even a whiff of corruption about him might well be soaring above both of them in the polls by now. \\nIt also appears that Sanders made his decision to support Clinton almost wholly based on domestic issues, which he focused nearly exclusively on during his primary campaign. On immigration, climate change, gun control and a number of other issues, Sanders aligns with Clinton rather than Trump. \\nAnd, Sanders rightly feared Trump\\'s xenophobia, Islamophobia, misogyny, racism and demagoguery. But Sanders overlooked Trump\\'s conciliatory approach toward Russia and Clinton\\'s warmongering on Syria and her open hostility toward Russia. Given Sanders\\'s accurate critique of Clinton\\'s fondness for \"regime change\" wars, a Sanders\\'s victory would have likely offered a greater hope for peace. \\nIn other words, Sanders had an historic opportunity and, arguably, an obligation in the face of the ruin of the American middle class and the danger of looming global conflict, but he failed to seize it. He either did not take seriously or failed to understand the urgency of the situation. He talked about a \"revolution\" to upend the status quo but ended up supporting a status quo candidate for President.'"}, "time": 1742628513.2713747}