{"duration": 0.16402196884155273, "input_args": {"text": "'October 27, 2016 \\nBy Dr. Mercola \\nA dense bush bearing tiny red berries, hawthorn bushes are common in wooded areas and fence rows across the U.S. and throughout the world. Many parts of the hawthorn (with the botanical name Crataegus), including its berries and flowers, have been used by traditional healers for centuries. \\nResembling tiny sweet cherries, hawthorn berry “haws” have been used to make wine, jelly and flavored brandy for years, but not many people are aware of the impressive ways it remedies heart problems and many other physical ailments as well. \\nIncreasingly, modern studies are pointing to the hawthorn plant as a valuable therapy for cardiovascular disease (CVD), which the U.S. Centers for Disease Control and Prevention (CDC) states is the most prevalent cause of death in the U.S. In fact, more than 2.6 million people died of it in 2015. 1 Pharmacognosy Review reported: \\n”Results recorded from clinical trials, experiences of professionally qualified medical herbalists and the low/negligible incidence of side effects experienced by patients would indicate that Crataegus preparations hold significant potential as a useful remedy in the treatment of CVD.” 2 \\nMore About the Hawthorn Plant \\nThe hawthorn berry bush belongs to the same family of plants as apples and roses, so it’s fitting that the fruit is usually brilliant red. Like roses on steroids, the berries are accompanied by long, woody thorns that can do a lot of damage if you’re not cautious. \\nOne reason hawthorns are so common is because they send up suckers, so they get larger and denser as they age. Varieties crossbreed easily. They often grow into hedges as high as 25 feet, bearing small white, pink or red flowers with rose-like petals. \\nAs a food, it was at one time known as the “bread and cheese tree” because the flowers, berries, and leaves are all safe to eat, so it was a lifesaver during famines. 3 \\nAlso known as mayblossom, hedge thorn, maybush, mayflower and whitethorn, there are hundreds of hawthorn species, and each has its own set of valuable healing compounds. Every part of the hawthorn bush was used to make medicines in ancient Greece and Asia: the flowers, berries, leaves, stems and even the bark. \\nCommission E, a branch of the German government that studies and approves herbal treatments, has endorsed the use of hawthorn as an herbal treatment. 4 \\nHawthorn Berries: A Long History of Heart Healing \\nOne of the oldest known medicinal plants, hawthorn was first recorded as good for heart health in the first century by Greek herbalist Dioscorides. Later, Swiss physician Paracelsus (1493–1541) recorded similar observations. 5 French physician Henri Leclerc used it to treat heart conditions in the 17th century. In 1901, The British Homeopathic Review revealed that a Dr. Green, from Ennis, Ireland: \\n” … For many years had a reputation for the cure of heart disease that caused patients to flock to him from all parts of the United Kingdom. He cured the most of them and amassed considerable wealth by means of his secret. \\nFor, contrary to the code, he, though a physician in good standing, refused to reveal the remedy to his professional brethren. After his death … (in 1894), his daughter, a Mrs. Graham, revealed the name of the remedy her father had used so successfully. It is Crataegus oxycanthus …” 6 \\nSubsequently, homeopathic and alternative medical practitioners all over Europe used hawthorn very successfully for heart ailments in the late 19th and 20th centuries. Its use reached the U.S. by 1896, but it reportedly diminished in popularity in the 1930s. \\nModern Uses of Hawthorn \\nToday, botanist, research scientist, and author Christopher Hobbs says hawthorn is an official herbal pharmaceutical in Brazil, China, France, Germany, Russia and Switzerland. It’s even an ingredient in 213 commercial European herbal formulas, mostly for the treatment of cardiovascular problems. 7 \\nHerbalists in England, Eastern Europe, Poland and the U.S., as well, use the leaves and flowers from the common hawthorn (Crataegus monogyna) and English hawthorn (Crataegus laevigata), but the entire plant is loaded with valuable phytonutrients. Herbal Supplement Resource notes several active ingredients and how they’re used: \\n“Hawthorn contains around 1 [to] 2 [percent] flavonoids, oligomeric proanthocyanidins (1-3%), saponins, phenolic acids (chlorogenic acid, caffeic acid), 2-(2-Phenylethyl) chromone derivatives (in the flowers, leaves and buds), amine (phenethylamine, metoksyfenetylamin, dopamine, acetylcholine and tyramine) and triterpenes based on ursolic acid and oleanolic acid. \\nHawthorn is also believed to improve circulation in the arms and legs by reducing resistance in the arteries. This is partly due its ability to inhibit a substance in the body known as angiotensin-converting enzyme (ACE). \\nACE is related to the formation of angiotensin II, a substance that has strong astringent effect on the blood vessels.” 8 \\nStudies and Tests on Hawthorn Constituents \\nA study in 2009 reported that when volunteers took 900 milligrams (mg) per day of hawthorn extract for two months, it was as effective as low doses of captropril, a popular heart medication, particularly in improving symptoms of congestive heart failure. 9 \\nIn tests on hawthorn preparations, Pharmacognosy Review identified bioflavonoids and proanthocyanidins as two of their most important compounds due to their powerful antioxidant activity; some had more than others: \\n“Of 28 fruit pulps tested, the hawthorn pulp (Chinese hawthorn) produced the highest measure of antioxidant activity. A similarly high antioxidant activity in Crataegus aronia, a hawthorn indigenous to Israel, Jordan and the Palestine, has been found.” 10 \\nFurther, epicatechin and hyperoside in hawthorn extracts were found to be significantly more effective than those of established drugs. Herbal Supplement Resource noted: \\n“Several double blind tests have shown that patients with early stages of cardiovascular disorders have increased physical endurance and improved cardiac function (as measured by ECG) after using standardized hawthorn extracts for few weeks.” 11 \\nIn addition, hawthorn may be useful for angina, or chest pain caused by decreased oxygen to your heart muscle. A review in 1983 indicated that hawthorn extract could successfully treat patients suffering from angina. \\nSixty patients were given either 180 mg extract or a placebo every day for three weeks. Those who took hawthorn showed better blood flow and oxygen supply to the heart in their ECGs and could train for longer periods without attacks than those taking the placebo. 12 \\nHawthorn Benefits More Than Just Your Heart \\nYour heart isn’t the only part of your body to profit from taking hawthorn berry. It’s used as a diuretic, which is commonly needed for symptoms of heart failure. It’s reported to be effective in other areas of your body and for other health complaints as well, including: \\nThe phytonutrients of the hawthorn plant are the key to the way it helps your heart. It’s particularly valuable in the early stages of heart disease, from improving blood flow to the blood vessels around your heart and brain, to increasing tolerance to the heart muscle due to a lack of oxygen. \\nRelated physical problems may also be alleviated, such as high blood pressure, atherosclerosis (hardening of the arteries) and arrhythmia (irregular heartbeat). In fact, taking hawthorn may offset more serious heart disease and postpone prescriptions for stronger heart medications. \\nThe Epoch Times suggested that when looking for a hawthorn supplement, you’ll likely get something similar to what researchers found effective in clinical studies with a combination of at least 1.8 percent vitexin and 10 percent procyanidins. Combining Hawthorn With Supplements for Greater Effect \\nHawthorn is sometimes combined with other herbs for heightened effectiveness, according to Herbal Supplement Resource: Using hawthorn supplements with Coenzyme Q10 may curb early stages of heart disease. Hawthorn can be combined with ginkgo (Ginkgo biloba) to improve blood circulation so more oxygen is transported to your brain. Used with garlic (Allium sativum) and arnica (Arnica montana) Hawthorn may remedy angina and low blood circulation. An herbal tea of hawthorn is said to calm your nerves and induce sleep, especially when used with lemon balm (Melissa officinalis) and St. Johns wort. \\nRecommended dosages of hawthorn are typically 160 to 900 milligrams two or three times a day. You can also use it as an herbal tea from 4 to 5 grams of the dried berries or 1 to 2 grams of the dried leaves and flowers. Liquid extracts are also available, with recommended dosages of 20 to 30 drops in a small glass of water. \\nAs a side note, the effectiveness of hawthorn supplements may be lowered by asthma medications, Viagra, Clonidine (a blood-pressure-lowering drug) and other herbs for your heart. \\nThe People’s Pharmacy reports that pregnant women should not take hawthorn. 19 Additionally, hawthorn may increase the effects of heart medications such as digitoxin, so it should not be used with herbs containing cardiac glycosides like foxglove and lily of the valley. 20 \\nSources and References'"}, "time": 1742562261.2179718}