{"duration": 0.06328749656677246, "input_args": {"text": "'British ex-soldier cuts off own toes with pliers to avoid hospital delays British ex-soldier cuts off own toes with pliers to avoid hospital delays By 0 61 \\nA former soldier cut off two of his gangrene-ridden toes with a pair of tin metal pliers without anesthetic in his living room after becoming frustrated at a six-week delay to being operated on by the National Health Service (NHS). \\nPaul Dibbins, 57, from Buckfastleigh, Devon, had been told he needed to have his right leg amputated at the knee due to complications from diabetes, combined with suffering serious frostbite in his feet while repairing a car in freezing conditions. \\nDibbins says his foot turned “soot black” and he was rushed to hospital. However, his operation was cancelled at the last minute because of problems with the previous patient. \\nHe says he then discharged himself from hospital and thought surgeons would call him in a few days to re-book an appointment, but claims they never did. \\n“I’d been told my leg would be cut off and I was taken into surgery. But it was cancelled. I just wanted to go home and see my wife and kids.” \\nDibbins says he resorted to treating his own wounds over nine months using a Swiss army knife, sterile scissors and homemade dressing. He says he saw doctors every six weeks afterwards and they told him he could keep treating his frostbite until “things turned nasty.” \\nRead more \\nHe says he eventually developed gangrene and his doctor said his infected toes would have to be removed. Rather than wait six weeks for the operation, Dibbins took matters into his own hands. \\nHe says the operation, performed without pain killers and in his living room while biting on a rolled up towel, took about an hour. His wife of 40 years was in the house but says she did not want to look. \\n“Knowing that it would take at least another six weeks to get me in front of a surgeon again, that’s when I bit the bullet and cut off the toes,” Dibbins told the North Devon Journal. \\n“I did it because it’s what had to be done. My doctor told me my toes were going to kill me. \\n“I’ve had one surgeon say to me it was more luck than judgment, but then I had another surgeon saying I was mad but it was textbook.” \\nA spokesperson for Torbay and South Devon NHS Foundation Trust told the Times: “The safety of all our patients is our top priority and occasionally it does become necessary for operations to be postponed, if there is another patient with a more critical medical need.” \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742562275.7781904}