{"duration": 0.17671513557434082, "input_args": {"text": "'The joy must have been palpable in 2013 when three New York art traders arranged through Sotheby’s to sell a newly discovered painting by Leonardo da Vinci, the Renaissance master, for $80 million. One of them had purchased it at an estate sale for less than $10, 000 eight years earlier, when most experts viewed it as only the work of Leonardo’s school. But the traders’ joy later soured, according to court papers, when they learned that the man who bought it, an important Swiss art dealer, had turned around and sold the painting within days to a Russian billionaire for $47. 5 million more. The traders asked Sotheby’s, according to court papers, whether it had been aware that there was a much higher price to be had for the painting. Hadn’t Sotheby’s taken the painting, presale, to an apartment where the Russian billionaire had viewed it? Were the traders misled to favor the Swiss dealer, a valued Sotheby’s client named Yves Bouvier? Disturbed by those questions, the traders have told Sotheby’s they plan to sue, claiming fraud, to recover the millions they say they missed out on, according to the court papers. The papers were filed in federal court in Manhattan last week by Sotheby’s in a   move to block such a suit. Sotheby’s says in the filing that it never knew Mr. Bouvier had the Russian billionaire waiting in the wings to pay much more for the work, a depiction of Christ known as “Salvator Mundi. ” The price it helped achieve, Sotheby’s said, was “likely a world record price for an old master painting” at the time. The traders, Sotheby’s lawyer wrote, “apparently experiencing seller’s remorse, are trying to gain the benefit of a subsequent sale price that Sotheby’s had nothing to do with. ” The dispute, with its skyrocketing prices and accusations of intrigue, offers a compelling view of the messy side of the international art market. But it is only part of a much larger, and far messier, battle between Mr. Bouvier and the Russian billionaire, Dmitry Rybolovlev, a battle in which Sotheby’s is now entangled. Mr. Rybolovlev, among the world’s most prolific art collectors, has accused Mr. Bouvier of defrauding him in the purchase of 38 paintings for which companies controlled by Mr. Rybolovlev’s family trust paid nearly $2 billion. The Russian has said he thought Mr. Bouvier was acting as his agent, on commission, in such sales, but instead he said he later found that Mr. Bouvier had skimmed as much as $1 billion in profits by quietly buying the paintings himself first, then reselling them to his Russian client at escalated prices, according to court papers filed by lawyers for Mr. Rybolovlev. Mr. Rybolovlev leveled criminal charges against Mr. Bouvier in Monaco, where he was arrested last year, and has also pursued him in courtrooms in Singapore and France. Twelve of the 38 paintings were originally bought by Mr. Bouvier in sales arranged by Sotheby’s, only to be flipped to Mr. Rybolovlev. Sotheby’s says it has done nothing wrong, that it was completely in the dark about Mr. Bouvier’s intentions. In a statement, Sotheby’s said that it had hired an outside law firm to investigate its behavior and that it found no wrongdoing. Questions have been raised about another of the 12 sales to Mr. Bouvier, who has denied all accusations. In that 2012 sale, the heirs of Jenny Steiner, a Jewish woman from Vienna whose painting, “Water Serpents II” by Gustav Klimt, was looted by the Nazis during World War II, and the widow of a former Nazi official who ended up with the Klimt, sold it to Mr. Bouvier for $112 million, according to court papers. Later that year, Mr. Bouvier resold it to Mr. Rybolovlev for $183. 8 million, according to court papers filed this year by Mr. Rybolovlev, also in federal court in Manhattan. The estate of one of the Steiner heirs said in a statement that the transaction “deserves very close scrutiny considering the seriousness of the allegations and the suspiciously opaque business style of the agents involved,” but declined further comment. Sotheby’s declined to comment on any questions raised about the Klimt sale. Mr. Rybolovlev has also questioned Sotheby’s role in the sales to Mr. Bouvier. In particular, his advisers have expressed concern about a set of valuations that Sotheby’s prepared for Mr. Bouvier that, the advisers said in court papers, appeared to buttress the much higher prices he had charged Mr. Rybolovlev. One of the valuations, for example, was prepared for Mr. Bouvier last year after Mr. Rybolovlev learned he had paid $47. 5 million more for his Leonardo than the prior purchaser. At that point, Sotheby’s, which 20 months before had brokered the sale of the painting for $80 million, provided Mr. Bouvier with an insurance appraisal that valued the painting at about $113 million, closer to the $127. 5 million that Mr. Rybolovlev had paid. In the court papers filed this year in federal court in Manhattan, a lawyer for Mr. Rybolovlev took issue with the Sotheby’s valuation. “In its valuation,” the lawyer, Daniel J. Kornstein, wrote, “Sotheby’s did not discuss Bouvier’s purchase of the painting for $75 to $80 million in May 2013 in a transaction it had brokered. ” Mr. Kornstein also questioned why the Sotheby’s valuation was so much higher than the price Mr. Bouvier had paid. Mr. Kornstein has asked a judge to order Sotheby’s and the Leonardo sellers to produce a series of documents that outline the sale of the “Salvator Mundi” and other artworks, and interactions with Mr. Bouvier. In a statement last week, a spokesman for Mr. Rybolovlev, Sergey Chernitsyn, said, “Unfortunately, tracing back Mr. Bouvier’s steps has thrown up some questions about the private sale process conducted by Sotheby’s, and the subsequent role that the organization may have played. ” The spokesman declined further comment. Sotheby’s has said it stands behind the integrity of how it appraised the works. In the court papers filed last week to block a lawsuit over the Leonardo, it explained the discrepancy in values as being a distinction between fair market values and retail replacement values for insurance purposes, which are typically higher. Its appraisals were for insurance purposes, in which the values are often greater because they reflect the cost of having to go out and swiftly replace an item, compared with buying it under lesser time constraints. Appraisal experts said that insurance valuations don’t require discussion of a prior sale, though they said best practices certainly encourage it, especially when such large dollar amounts are involved. Some experts said that a big increase in the valuation in just two years or so might be justified by the volatility of prices in today’s art market. But others questioned whether a gap of more than $30 million was realistic, partly because private sales for trophy artworks are already, in effect, insurance level valuations because of their rarity. Mr. Bouvier, who is free on a   euro bond in the Monaco case, says he had a right to charge whatever price a buyer would pay. He also operates art storage warehouses around the globe, including a major one at the   haven in Switzerland known as the Geneva Freeport. A spokesman for Mr. Bouvier, who is one of the auction house’s better clients, said that Sotheby’s knew nothing about his relationship with Mr. Rybolovlev, and that he never misled Sotheby’s. “Mr. Bouvier had no obligation to disclose to Sotheby’s that he intended to sell the Leonardo once he purchased it, and no obligation to provide further details about the painting once it had been sold by Sotheby’s,” said the spokesman, Jeremy Fielding, in a statement. It is unclear how much Sotheby’s earned on commissions from brokering the 12 sales of art to Mr. Bouvier because it does not disclose such information about private sales. But it revealed in the court filings that it had earned $3 million for arranging the sale of the Leonardo. Much of the speculation about Sotheby’s role in the sale of the Leonardo revolves around what its representative knew, or didn’t know, in 2013 when he took the “Salvator Mundi” to a Central Park apartment, where Mr. Bouvier and Mr. Rybolovlev inspected it. The meeting occurred six weeks before the sale to Mr. Bouvier and the flip to Mr. Rybolovlev. The meeting took place in a grand apartment, one of the most expensive in Manhattan, that is owned by a Rybolovlev family trust. In its court papers, Sotheby’s argues that its representative, Samuel Valette, its vice chairman for private sales worldwide, did not realize it was Mr. Rybolovlev’s family apartment or that he was inspecting the painting as a potential buyer. The meeting had been requested by Mr. Bouvier, the auction house said, and though Mr. Valette said that he recognized a third man in the room as having been associated with a previous sale to Mr. Bouvier, he said that he had not known his name. “It was not, however, until much later that Valette and Sotheby’s learned that this third man was Rybolovlev,” the papers state. A month and a half after the meeting, Mr. Bouvier bought the “Mundi” for $80 million, putting down $68 million in cash, and a Picasso valued at $12 million. Shortly afterward, Mr. Bouvier sold the “Mundi” to Mr. Rybolovlev for $127. 5 million, according to court papers. Sotheby’s declined to say whether, as part of the security arrangements associated with transporting such a valuable work, it would typically identify who owned the apartment to which it was bringing a painting. In response to a series of additional questions, Sotheby’s referred to the lawsuit it had filed last week, in which it depicted Mr. Bouvier as someone who had misinformed them. “Bouvier,” it says in the filing, “not only never disclosed to Sotheby’s his resale to Rybolovlev at a huge markup from what he had paid the defendants, but he also misled Sotheby’s into believing that he in fact remained the owner of the ‘Salvator Mundi’ long after he acquired the piece in May 2013. ” A lawyer for the original sellers of the Leonardo, though, said they remain unpersuaded. “The picture painted by Sotheby’s in its complaint is incomplete, and brushes aside many of the events surrounding the sale of the da Vinci,” said the lawyer, Thomas C. Danziger. “We look forward to presenting our case in court. ”'"}, "time": 1742563126.8402479}