{"duration": 0.20322370529174805, "input_args": {"text": "'LOS ANGELES  —   It’s got to be one of the best jobs in Hollywood: Sit around all day dreaming up fantasy political scenarios that are either so    crazy or wishfully idealistic  —   plotlines that could never play out in real life  —   that they provide the sort of escapist television viewers crave. Then came Campaign 2016, the Nov. 8 results and, finally, President Donald J. Trump. Suddenly, the writers who work on political television shows were competing less with one another and more with real life, because of a president who transformed their seemingly escapist scripts into something resembling nonfiction  —   and scrambled the traditional notions of political cause and effect that they tended to base their drama upon. (A leaked tape with lewd comments from a male candidate about grabbing a woman’s genitals? No problem!) The New York Times gathered some of the nation’s leading political dramatists for a cathartic group therapy session on the CBS Studio Center lot here last month. Gathered were Shonda Rhimes, creator of the ABC hit “Scandal,” whose stories seem to be the stuff of a political fever dream Frank Pugliese and Melissa James Gibson, the showrunners of “House of Cards,” whose   and bald aggression present a    view of political machinations that would never take place out in the open Barbara Hall, the creator of “Madam Secretary,” the more optimistic CBS drama, which was able to stay a step ahead of real life and David Mandel, of “Veep,” which came up with such truly absurd scenarios that you couldn’t imagine them happening. These professionals had never met one another before. But as soon as they convened in a stark conference room here, right near where “Gilligan’s Island” was filmed, they immediately bonded over their shared situations. There were the scripts that had to be ripped up at the last minute the amazement at how politics, entertainment and journalism have blended together and the challenges of making their fiction outstrip reality. And when all the gabbing was done there was an even more daunting prospect: Next season. (The following are edited excerpts from the conversation.) “House of Cards” sometimes seems to have a good sense of where national politics are heading, and I know you have very   political strategists advising your team. Did you get   intel on where the election would wind up? FRANK PUGLIESE (‘HOUSE OF CARDS’) No, not on Trump winning. But even starting Season 3, we were talking a little bit about a notion of some tyrannical force and some populism and what that would mean. We had this idea of America Works [the major jobs program of President Frank Underwood, the conniving politician played by Kevin Spacey] and it was in the air already. It seemed like an impossible possibility, but it wasn’t like we weren’t flirting with it ourselves. For “Veep,” do you have to worry what happens in the real world as much?  DAVID MANDEL (‘VEEP’) You do and you don’t. For us, we spend a tremendous amount of time thinking up the worst things a politician can say or do. We have a story line where [Selina Meyer, the show’s protagonist, played by Julia  ] is now an   and trying to build her library. And nobody particularly wants a Selina Meyer Library. She ends up in the Republic of Georgia, doing some election monitoring, and two guys offer her money for her library if she’ll see the election in a certain way. And that just seemed like that’s about the worst thing you could think of to do, that makes her look horrible, hopefully in a funny way. But now we just look like geniuses or something.  When did you script that? MANDEL May or June last year. Even before this, all your shows had little elements that presaged some of what we are seeing, right? SHONDA RHIMES (‘SCANDAL’): We had the Hollis Doyle character [a Machiavellian oil tycoon turned presidential candidate] who we made up as the craziest person to ever run for president. He was very  . We had the Russian problem, too. Our mystery woman was supposed to start speaking Russian, and you were supposed to understand that the Russians were trying to undermine the United States government through the election. And all of the sudden I realized we have to rebreak the entire back half of our season and turn it into something else. MELISSA JAMES GIBSON (‘HOUSE OF CARDS’) Wow. RHIMES No matter what we do, the audience is going think we wrote the news. And you don’t want to look like you’re ripping from the headlines? RHIMES No! In “Madam Secretary,” which plays off current events a bit more, are you trying to write closer to the news? For instance, you seemed to predict the United   nuclear agreement that came to pass. BARBARA HALL (‘MADAM SECRETARY’) A little bit. But we are set a little bit in the future. That’s how the Iranian peace deal came about, because we were just starting to talk with Iran, and we thought, let’s go to the most dramatic possible conclusion. We’ll have a   peace agreement and the Iranian president will come here. That’s not exactly what happened, but it was close enough that we sort of ran up against the headlines. And now the challenge for any show that’s trying not to write the news, or to stay ahead of the news, is how do you do that? Everything is happening so fast that by the time you break it and write it, you do find yourself having to change it if you’re trying to stay ahead. Before last year, had you ever seen a political environment that was this unpredictable, so much so that you had to worry? PUGLIESE What we’re competing with to a certain extent are the   news channels. To me, it’s the nature of writing a TV show, that you’re satisfying and dissatisfying the audience. You’re frustrating them and creating a certain amount of anxiety and trying to keep things unresolved to keep the story going. And what’s tough is suddenly we have   news channels doing that with their own political figures. But more with Trump than anything else, right? PUGLIESE Trump is as frustrating and confusing and irreconcilable as any TV character. In a way he is probably the ultimate bad dad. You think about “The Sopranos,” Don Draper [on “Mad Men”]. And now he’s in the White House, not just the house down the street. GIBSON When I look at him I see I see this    white man in a bit of a panic about the world changing around him, and he’s just fighting so hard to hang on to borders and really all these outmoded notions.  That’s the opposite of Frank, right? Because Frank is trying to control the world in a very methodical way. PUGLIESE Right. GIBSON Frank comes from within the system, whereas Trump has arrived from without, and they both have an interesting relationship with the system. PUGLIESE And Frank interestingly tries to manage chaos. And maybe Trump does, too. We’ll see.  Shonda, your show is the most outrageous of the ones represented at the table. Do you feel like now you need up the ante to get crazier than reality? RHIMES Our show is basically a horror story. [Laughter] Really. We say the people in Washington are monsters and if anybody ever knew what was really going on under the covers they would freak out. So they can do anything, they can murder people, they kill people and they get away with everything all the time. But that was based on a world in which Obama was president and our audience was happy about what was going on in Washington and they felt optimistic. You can always tell any horror story you want to when the light is on. But now the lights are off, and now I think people don’t want to watch horror stories, they want you to light a candle somewhere.  How many Trump supporters do you have in your audience, do you think? RHIMES The Shondaland audience that watches all the shows [which include “Grey’s Anatomy” and “How to Get Away With Murder”]? I don’t think any of them are, because I’m a black, Planned   liberal feminist. I really don’t think there’s a ton of Trump supporters standing behind that. The shows are their own entities? RHIMES Yeah. But I think that “Scandal” is different, because it was political and it felt very unlike the other shows in that sense. I made it a Republican White House on purpose. I’m always sick of watching TV and only one side gets a voice, and I thought it would be interesting to try to humanize this completely other side of the fence. Barbara, you were coming from a similar place, I would assume? HALL No, not really. I wanted to create a show where people could talk about politics in a way that wasn’t so polarized and polarizing. Because even three years ago I felt the discussions were so polarized. We were doing foreign policy, which is not as   partisan as domestic policy is. Most people form opinions about foreign policy after the fact. So when an international event occurs, it becomes problem solving  —   let’s get the loose nukes back and then we’ll talk about how we stand on this issue. So we delayed identifying political parties in our show, and then we found that we never did have to. People can sort of begin to understand what the State Department does and what the inner workings of the government really look like without choosing a side. Because you guys are on CBS, a broadcast network, do you feel like you have to nod a little bit more at the Trump supporter in your writing? HALL We don’t really nod. Again, the show is about pulling the curtain back on the State Department and foreign policy. Dave, on “Veep,” you’re untethered. MANDEL I’m the new guy, I joined last year, and when Armando Iannucci created it, he very much avoided identifying any party. If you actually tried to track Selina’s positions, it’s all over the place. She grabs from both sides. In D. C. both sides assume that Selina and all the people that are working for her  —   especially the more incompetent people  —   are the other side. RHIMES You’ve never identified her party? MANDEL Never. RHIMES I always thought, oh, it’s clearly Republican. I thought it was identified. That’s fascinating. MANDEL That being said, the decision to take her out of the White House and have her be a former president of the United States occurred basically two years ago, when I first was sitting down to talk with Julia about taking the job,     pre any of this stuff. But I have never been more happy to not be in the White House right now. From the moment Sean Spicer appeared, it’s just been sort of like, ‘That’s Mike McLintock [Selina’s bumbling press secretary] from ‘Veep’!” In some ways he makes McLintock look pretty good at his job. I am quite happy that we’re avoiding some of the   similarities. As comedy writers, aren’t you guys itching to jump on whatever is the event du jour? MANDEL No, because we’re not a du jour show. If I’m “Saturday Night Live,” that’s the beauty of it. It happens on Wednesday, you see it Saturday. If it happens on Wednesday and you see it eight months later, you’re like spoiled cheese. [Laughter] The show has never been about current politics it’s about politics in general. It’s about power. I think I heard the phrase it’s pulling back the curtain of what Washington is really like, what these people are really like. They are not the noble West Wingers, they’re down and dirty and speak quite horrendously and crave this power. We take it from the comedy perspective. I think you guys approach power from the drama perspective in really good ways. GIBSON What’s interesting about Trump, though, is that he has made subtext text. So with a show like ours, where Frank turns to the camera and he’s in this very complicit way, letting us in on something, Trump just  —   He does it. HALL There are plenty of people in Washington who want to do the right thing, and I’ve met them. So our characters are the ones who are the true believers. It has an aspirational quality in that way. We want to keep them real and make them flawed and have them make mistakes and things. But what’s driving them is something that we wish was driving all politicians. PUGLIESE There is something weird about when politics and entertainment and journalism all start to bleed into the same thing. It starts to feel a little funky.  Was “House of Cards” really born of this idea that ooh, it’s really ugly and people know it’s not the “The West Wing,” so let’s cut the idealism and embrace the cynicism? PUGLIESE My mom’s always like, “I always knew it was like that. ” [Laughter] RHIMES The one thing that “Scandal”’s based on that’s optimistic or aspirational is that despite every horrible thing everyone is doing, the office of the presidency itself is a sacred thing. And so whenever anybody is messing with that, that is the biggest violation. How much do you feel like you’re competing with the show that is now American politics? Are you having to do things in ways you wouldn’t have had Hillary Clinton won? MANDEL I’m sure you guys have all thought about this, but are people just so sick of it, regardless of their side, that they would much rather just watch a show set in a junkyard as opposed to anything that has anything to do with D. C.? Shonda and Barbara, have you seen anything in the ratings that shows you that interest in the Trump show, especially in cable news, is carrying over to your shows? Or the opposite  —   burnout? HALL The only time we got into a little bit of fatigue is when we did do an election story that went for a long time. And it was aired around the time of the election, and I did start to hear people say I want this election resolved. [Laughter] RHIMES It’s interesting, because right after the election there was this barrage of tweets to Kerry [Washington] that said “Why isn’t Olivia Pope [the show’s central character, who runs a crisis management firm] fixing this?” [Laughter] Was there anything that you scripted to be horrible for a character  —   like a huge, supposedly   political bungle  —   that now wouldn’t be much of a problem?  MANDEL “Veep” was based on five years of   that constantly, for lack of a better word, whacked her back down. She had ambition, obviously, to be president, ultimately got there in a very backward way, but was constantly striving, and then whether it was a leak or a bad tweet or a microphone left on, was sort of whacked down by these things. And now we have entered a world where these things happen and have no effect. And in some cases pushed him further along. Barbara, did you have to make any hard changes in your arc on “Madam Secretary”? HALL No, not really. But one of the things we realized was, we have an opportunity to have an election on our show that will time out well. But the problem was that we let it go on, and how we resolved who was going to be president  —   that’s where we ran into fatigue. And I couldn’t change it, we’d already shot it. It didn’t hurt the ratings, it’s just that I heard people talking about it on Twitter and things that it was a little exhausting. And then I would just say we really are taking it week to week now as we break   stories, because the hardest thing for us is trying to stay ahead of what our foreign relations are with other countries, because they are changing very quickly. RHIMES On election night we were working on Episode 7, and we had to change course on a lot of things, and we did a few reshoots on some of the first episodes. Can you give an example? RHIMES Our whole back story had the Russian thing happening, and we had to rework all of that stuff. And as we got towards the back half [of the season] I said we need to end in a more optimistic place than we had planned. But do any of you feel as if there is some new responsibility to try to communicate with Trump supporters or get them in your scripts? Is there something to the idea that Hollywood is failing to speak to the wants and needs of the average Trump loyalist?  RHIMES I get really offended at the concept that what came out of the election was that  —   how do I say this?  —   impoverished people who are not of color needed more attention. I thought that was kind of crazy, that they might need more television. They have television. [Laughter] It just felt very strange to me. And I thought really, the people who really need to be spoken to are the 50 percent of the population that did not vote at all. Those are the people who need to be more engaged. If you were scripting the Trump presidency, where would you have it go from here? What is the most dramatic thing that could happen? PUGLIESE What I’m curious about is the education of Donald Trump  —   who is showing up to try to educate him, and how they educate him, and taking advantage of that aspect of who he is as a character. RHIMES The most dramatic thing that could happen to him is transformation. If he actually became a hero and actually became a good president, that is the most dramatic, most crazy, most bizarre thing that I could imagine happening to Donald Trump. HALL I’m going with education and transformation, but in my show it would be the female secretary of state who got him there. [Laughter] So everyone agrees that the most dramatic thing that can happen, in classic television writing is something that would be the unexpected? That’s what makes the show? GIBSON Subverting expectations. So, for the sake of tension, would you have scripted, for instance, stronger intraparty opposition? RHIMES For me,   I would have definitely allowed [other Republicans] to see it as a chance to grab power. I don’t understand everyone just quietly falling into line. If I was those guys, I would have said: “This is our chance, we can take him down, we can impeach him, we can get rid of him. Like we can appear very righteous and heroic, as opposed to being afraid of everything. ”'"}, "time": 1742628412.0932674}