{"duration": 0.11461043357849121, "input_args": {"text": "'SHARES Hillary Clinton’s silence on the Dakota Access Pipeline has not gone unnoticed. On Thursday morning, young water protectors from Oceti Sakowin, the Seven Council Fires, and the Standing Rock Sioux Nation traveled to the Democratic presidential nominee’s campaign headquarters in Brooklyn, New York, demanding that she speak out against the Dakota Access Pipeline (DAPL). The Hillary Clinton campaign has thus far remained silent about the 1,172-mile pipeline , which would cross both the Missouri River and the Ogallala Aquifer, threatening sacred indigenous land and water supplies. The group also called for solidarity actions at Clinton campaign offices across the country. “We are coming directly to Hillary at her headquarters because as the future president, she is going to have to work for us, and we want her to uphold the treaties and her promise to protect unci maka (Mother Earth),” said 19-year-old Gracey Claymore. Garret Hairychin, 23, echoed Claymore’s concerns. “As a young person I want to know what the next four years are going to entail. Is Hillary going to be focused on protecting our land? I want to know if my younger family is going to be safe. Our present situation is in dire need of a leader that still remembers that our kids are here,” Hairychin said. “We want to protect the future for the young ones that come after us. I’m here to support my family.” The youth delegation took over the lobby of the campaign HQ with a full-size tipi to deliver their message to Clinton. Despite the size and energy of the demonstration, Clinton campaign staffers refused to even accept the letter indigenous protesters had for the former Secretary of State. \\nWATCH: Anti-Dakota Access pipeline protesters marching to Clinton campaign headquarters in Brooklyn to demand that she… \\nPosted by NBC Nightly News with Lester Holt on Thursday, October 27, 2016 The delegation included four of the Oceti Sakowin youth runners, a group of young people who ran over 1,600 miles from North Dakota to Washington, DC earlier this year to pray for the water, raise awareness, and deliver 140,000 petition signatures to the U.S. Army Corps of Engineers. One of the runners, 18-year-old Adam Palaniuk Killsalive, said those thousands of miles should mean something. “We are here to tell Hillary how badly we need to protect the water. We didn’t come all the way to New York for nothing. We didn’t run all the way to Omaha or DC for nothing,” Killsalive said. “We want to ask Hillary if she wants to see her great-grandkids line up for water rations.” A large and growing community led by indigenous groups has come together in rejecting the DAPL, with thousands gathering at a series of encampments on the lands of the Standing Rock Sioux to resist the pipeline’s construction. Hundreds of peaceful protectors, including children, have been pepper sprayed, attacked by dogs, and arrested by private security forces and state law enforcement. American Indians from over 300 tribes have joined in solidarity, as have 21 city and county governments. Clinton’s silence grows increasingly conspicuous as more and more of her peers speak out against the project. Senator Bernie Sanders (I-Vermont), former Vice President Al Gore , and U.S. Representative Raul Grijalva (D-Arizona) have all condemned the DAPL and called for an end to its construction. Lilian Molina, a spokesperson for Greenpeace, agreed that the total silence from both Hillary Clinton and GOP nominee Donald Trump is a major cause for concern. “Silence is not acceptable. Waiting is not acceptable,” Molina said. “We are grateful for the young people who have traveled so far to say enough is enough. If you claim to be a climate champion, that means respecting Indigenous sovereignty, rejecting new pipelines, and keeping dangerous fossil fuels in the ground.” 16-year-old William Brownotter, another member of the youth delegation, pointed out that the DAPL isn’t just a new threat, but a continuation of centuries of disenfranchisement and theft from Native Americans. “We made treaties and agreements. A violation of a native treaty is a violation of federal law,” said Brownotter. “By refusing to stand against DAPL, Hillary is putting our environment, wildlife, culture, and land at risk.” The DAPL, which would cross unceded Indigenous territory, is a direct violation of the sovereign rights and culture of the Standing Rock Sioux. The fast-track process of approval disregarded key U.S. legislation, including the Clean Water Act, the National Environmental Policy Act, and the National Historic Preservation Act. No proper environmental impact study was performed , and no consultation was sought from the indigenous community. In a letter presented to Clinton , water protectors wrote that as the possible next president, it’s on the former Secretary of State to stop the pipeline and protect valuable natural resources. “As we look into the coming days and months, we are prepared to continue to stand for the rights of our people and Mother Earth. As President Obama rejected the Keystone XL Pipeline, we urge the new President to be a leader and continue standing up for what is right by rejecting the Dakota Access Pipeline,” The letter states. “The First 100 Days is a significant time for you to set the stage – are you with us? “ \\nWhile water protectors protested at the Clinton campaign headquarters, militarized police moved in on the Standing Rock camp, deploying sonic weapons, destroying prayer tents, and arresting observers in an effort to force water protectors off the land. As of this writing, Hillary Clinton has not made any statements against the Dakota Access Pipeline. \\n\\nZach Cartwright is an activist and author from Richmond, Virginia. He enjoys writing about politics, government, and the media. Send him an email at [email protected] , and follow his work on the Public Banking Institute blog . 3463 '"}, "time": 1742561800.059447}