{"duration": 0.19839048385620117, "input_args": {"text": "'Reunión del Consejo de Seguridad de 28 de octubre de 2016\\nNota conceptual para la presidencia de Rusia Red Voltaire | Nueva York (EE.UU.) | 27 de octubre de 2016 français English русский عربي 中文 Cooperación entre las Naciones Unidas y las organizaciones regionales y subregionales en el mantenimiento de la paz y la seguridad internacionales: Organización del Tratado de Seguridad Colectiva, Organización de Cooperación de Shanghái y Comunidad de Estados Independientes Como actividad central durante su Presidencia en el Consejo de Seguridad, la Federación de Rusia tiene previsto celebrar un debate el 28 de octubre de 2016 sobre el tema “Cooperación entre las Naciones Unidas y las organizaciones regionales y subregionales en el mantenimiento de la paz y la seguridad internacionales: Organización del Tratado de Seguridad Colectiva, Organización de Cooperación de Shanghái y Comunidad de Estados Independientes”.\\nEl carácter mundial de los desafíos y amenazas actuales y la elaboración de los enfoques colectivos necesarios para abordarlos eficazmente hacen necesario mejorar la cooperación entre las Naciones Unidas y las organizaciones regionales y subregionales en la esfera del mantenimiento de la paz y la seguridad.\\nLas Naciones Unidas pueden aportar, en primer lugar, su carácter universal, tanto en lo que respecta a su composición como a sus actividades, así como su legitimidad mundialmente reconocida. Por su parte, las organizaciones regionales suelen tener una comprensión más profunda de la situación en su ámbito de responsabilidad. Además, en muchos casos, estas cuentan con mecanismos de prevención y de mantenimiento de la paz adaptados a las realidades locales. Al mismo tiempo, es importante garantizar que las actividades de las organizaciones regionales estén dirigidas a hallar una solución política por medios pacíficos a los nuevos conflictos.\\nEn este contexto se hace muy pertinente una “comparación de notas” sistemática con los principales asociados regionales de las Naciones Unidas sobre cuestiones relativas al mantenimiento de la paz y la seguridad internacionales. Por ejemplo, el Consejo de Seguridad celebra periódicamente reuniones sobre la cooperación con la Unión Africana, la Organización para la Seguridad y la Cooperación en Europa y la Unión Europea. En los últimos años se han realizado exámenes sobre las relaciones con la Liga de los Estados Árabes, la Asociación de Naciones de Asia Sudoriental, la Unión de Naciones Suramericanas y otras entidades regionales.\\nComo se sabe, la cooperación entre las Naciones Unidas y sus asociados regionales abarca un abanico cada vez más amplio de cuestiones. A las tareas de mantenimiento de la paz y consolidación de la paz, ahora se han sumado las de la lucha contra la proliferación de armas de destrucción en masa, las corrientes ilícitas de armas pequeñas y armas ligeras, el ciberterrorismo y la migración ilegal, ámbitos en los que la cooperación entre las Naciones Unidas y las mencionadas organizaciones está cobrando impulso. Esta cooperación reviste una importancia fundamental para el mantenimiento de la paz y la seguridad en todo el territorio de Eurasia y especialmente en la región de Asia Central.\\nEs precisamente en este ámbito en que trabajan tres organizaciones relativamente nuevas que operan en la vasta región que va desde Europa Oriental hasta el Lejano Oriente: la Organización del Tratado de Seguridad Colectiva (OTSC), la Organización de Cooperación de Shanghai (OCS) y la Comunidad de Estados Independientes (CEI). Estas organizaciones están consolidando su influencia política en el mundo y contribuyendo significativamente al fortalecimiento de la seguridad regional e internacional.\\nEn las deliberaciones, se centrará la atención en la contribución de la OTSC, la OCS y la CEI a la lucha contra las amenazas a la paz y la seguridad en la región, en particular a la lucha contra el terrorismo, el tráfico de drogas y la delincuencia organizada. Este evento también ofrecerá una oportunidad a estas tres organizaciones para reafirmar su compromiso con el objetivo de establecer una colaboración práctica con las Naciones Unidas, en particular con su Centro Regional de las Naciones Unidas para la Diplomacia Preventiva en Asia Central.\\nLa Organización del Tratado de Seguridad Colectiva (OTSC) es una estructura de vectores múltiples, capaz de responder resueltamente a la amplia gama de desafíos y amenazas que afrontan actualmente sus Estados miembros. En este sentido, la cooperación que se está desarrollando entre las Naciones Unidas y la OTSC en la esfera del mantenimiento de la paz tiene muy buenas perspectivas. La OTSC está trabajando intensamente para crear capacidades propias para el mantenimiento de la paz, que, entre otras cosas, se utilizarían en las operaciones de mantenimiento de la paz de las Naciones Unidas. Además, la OTSC contribuye activamente a las iniciativas internacionales encaminadas a la reconstrucción del Afganistán. La OTSC contribuye activamente a los esfuerzos internacionales para la reconstrucción del Afganistán y a la lucha contra la amenaza de las drogas provenientes del territorio de ese país.\\nLas relaciones entre la OTSC y las Naciones Unidas se han desarrollado con éxito en varios ámbitos, como la lucha contra el terrorismo y el tráfico de drogas, el mantenimiento de la paz y la lucha contra la delincuencia organizada. La OTSC mantiene y desarrolla contactos productivos con las estructuras especializadas de las Naciones Unidas, en particular el Comité contra el Terrorismo del Consejo de Seguridad de las Naciones Unidas y la Oficina de las Naciones Unidas contra la Droga y el Delito.\\nLa Asamblea General aprueba cada dos años la resolución sobre la cooperación entre las Naciones Unidas y la Organización del Tratado de Seguridad Colectiva. Se ha previsto que en su septuagésimo primer período de sesiones, la Asamblea General aprobará una resolución sobre ese tema en el marco del debate sobre el tema del programa titulado “Cooperación entre las Naciones Unidas y las organizaciones regionales y de otro tipo”.\\nEl marco jurídico para la cooperación entre las Naciones Unidas y la Organización de Cooperación de Shanghai (OCS) sobre las cuestiones relativas a la paz y la seguridad internacionales fue establecido, de conformidad con el artículo VIII de la Carta de las Naciones Unidas, tras la firma en 2010 de una declaración conjunta sobre la cooperación entre las secretarías de las dos organizaciones. En la actualidad, la OCS y las Naciones Unidas están cooperando activamente en ámbitos como la prevención y la resolución de conflictos, la lucha contra el terrorismo (la Estructura Regional contra el Terrorismo se ha establecido en el marco de la OCS con esa finalidad), la no proliferación de las armas de destrucción en masa, la lucha contra la delincuencia transnacional y el tráfico ilícito de drogas, y la protección de la seguridad de la información internacional.\\nEn este contexto, la OCS apoya activamente las iniciativas de la comunidad internacional y las entidades de las Naciones Unidas para restablecer la paz en el Afganistán, y siempre ha estado a favor de que las Naciones Unidas mantengan su función de coordinación central en el proceso de solución afgana.\\nLa cooperación para garantizar la seguridad y hacer frente a los desafíos y amenazas actuales ha sido siempre y seguirá siendo una de las esferas prioritarias de la cooperación integradora entre los Estados miembros de la Comunidad de Estados Independientes.\\nLa cooperación constructiva de la CEI con las organizaciones internacionales es también un factor fundamental en la lucha contra las nuevas amenazas. Los Estados de la CEI son partes en todos los principales instrumentos internacionales que rigen la cooperación en las esferas de la seguridad, el desarme, y la lucha contra los desafíos y amenazas actuales, y contribuyen de manera efectiva a su aplicación.\\nEn la aplicación de medidas conjuntas se tienen en cuenta la función rectora de las Naciones Unidas y la necesidad de establecer una asociación constructiva con otros organismos internacionales y sus estructuras especializadas, como el Comité contra el Terrorismo del Consejo de Seguridad, la Oficina de las Naciones Unidas contra la Droga y el Delito, la Interpol, la Organización Internacional para las Migraciones, la Oficina del Alto Comisionado de las Naciones Unidas para los Refugiados, y el Grupo de Acción Financiera sobre el Blanqueo de Capitales.\\nSeguir fortaleciendo y estrechando la cooperación entre las Naciones Unidas y la OTSC, la OCS y la CEI, sobre la base del artículo VIII de la Carta de las Naciones Unidas, contribuirá de forma constructiva al logro de los objetivos de las Naciones Unidas y, en particular, a la lucha contra los desafíos y amenazas actuales. En este contexto, estas organizaciones regionales, por una parte, deben posicionarse activamente de modo que pueda aprovecharse su potencial en interés de las Naciones Unidas. Por otra parte, las Naciones Unidas deben seguir prestando la atención necesaria al fortalecimiento de la coordinación y la cooperación con esas organizaciones, con estricta observancia de las prerrogativas de las Naciones Unidas y su Consejo de Seguridad.\\nEn este sentido, quisiéramos proponer a los Estados Miembros de las Naciones Unidas que presenten su propia visión de los medios de fortalecer la seguridad en la región de Eurasia sobre la base de los mecanismos regionales existentes. Es evidente que la estabilidad en esta macrorregión sentará las bases para el crecimiento económico y la consolidación del Estado de los países euroasiáticos. Por esa razón, agradeceríamos que las delegaciones transmitieran sus consideraciones al respecto, en particular sobre la relación entre la seguridad y el desarrollo. Estamos convencidos de que aquí, en el marco de las Naciones Unidas, organización que goza de una legitimidad universal, podremos proponer de manera colectiva enfoques innovadores sobre las cuestiones relativas a la estabilización de las regiones vulnerables, que posteriormente podrán aplicarse en otras partes del mundo que sean objeto de la atención del Consejo de Seguridad.\\nEn el debate formularán declaraciones el Secretario General de las Naciones Unidas, Excmo. Sr. Ban Ki-moon, el Secretario General de la Organización del Tratado de Seguridad Colectiva, Excmo. Sr. Nikolai Bordyuzha, el Secretario General de la Organización de Cooperación de Shanghai, Excmo. Sr. Rashid Alimov, y el Vicepresidente del Comité Ejecutivo de la CEI, Excmo. Sr. Sergey Ivanov. También están invitados a participar en la reunión los Estados miembros de las organizaciones regionales mencionadas y los representantes de otros Estados interesados.'"}, "time": 1742561673.6472487}