{"duration": 0.0832512378692627, "input_args": {"text": "'WIMBLEDON, England  —   “Wimbledon,” a movie released 12 years ago, was a romantic comedy about a British tennis player on the verge of retirement who finds love, and then unlikely success at the tournament. Over the past four months, Marcus Willis, a    from Slough, England, has starred in a   version of the film, all but   its implausible plot points on the way to his unlikely spot in the Wimbledon main draw, scheduled to begin Monday. Willis, ranked 775th before the qualifying tournament, had nearly given up on his dreams of reaching Wimbledon and was planning to move to Philadelphia, where offers of coaching jobs were waiting. “I was adamant I was going to go to America to coach,” Willis said. “I had called up someone about the visa  —   and then I met a girl. She basically told me I was an idiot and that I should keep going, and I’m very grateful for that. ” Shortly before he had planned to leave in February, Willis met Jennifer Bate, a dentist and a mother of two. Bate said she was out on the town with a cousin as each tried to shake off “wrong relationships” that had just ended. “We just met, and honestly, it was a blur after that,” Bate said. “We went on a little walk to get some fresh air before we’d get a cab. He said, ‘I’m meant to be going to America soon,’ and I was like: ‘What? You can’t go to America.’ The night we met, I said, ‘You’ve just met me you can’t just move to America.’ I said it jokingly, and then he told me he was a tennis player. I thought, ‘Yeah, right, whatever.’ ” After experiencing what she called “love at first sight,” Bate rushed home to tell her mother she had met “the one,” and Willis postponed his plans to leave England. With Bate’s encouragement, Willis rededicated himself to tennis, despite having endured injuries and financial hardships in recent years. In 2014, struggling with touring expenses, Willis had started a crowdfunding campaign seeking support in getting to his “childhood dream” tournament. In 2016, he had played only one event, a January tournament in Tunisia at the lowest rung of sanctioned professional tennis, earning just $356. But his falling ATP ranking was just high enough to get him the last direct entry into a Wimbledon qualifying   playoffs for British players. Once there, he won three matches to reach the tournament’s main qualifying event. Though British wild cards often prove to be overmatched cannon fodder in the qualifying tournament, Willis played with confidence. In his first match, against the   Yuichi Sugita, Willis came back from losing the first set,   to notch his first career victory over a   opponent. With his unorthodox   barrage of chunked slices and    Willis continued his winning ways in the next two matches, beating the Russians Andrey Rublev and Daniil Medvedev and becoming the first British player to reach the Wimbledon singles main draw through qualifying since 2008. By doing so, he guaranteed himself prize money of at least 30, 000 British pounds. Andy Murray, who ended 77 years without a British men’s singles champion at Wimbledon when he won here in 2013, had practiced with Willis at the Davis Cup years earlier and called Willis’s qualifying a “really cool story. ” “He’s an awkward player, has got quite a different sort of game style,” Murray said. “   a little bit. He’s got really good touch, good volleys, puts a lot of slice on his slice backhand, quite a spinny forehand. He’s quite an unusual player. ” Those unnerving, unconventional weapons were on display when Willis made his previous best career run, to the quarterfinals of a   tournament in Knoxville, Tenn. in 2014. There, Willis also gained notice for his tubby physique, which inspired one Facebook heckler to call him Cartman, after Eric Cartman, the corpulent cartoon    from “South Park. ” Willis embraced the nickname, and while he is still bulkier than many in the sport, he has dropped 55 pounds. He still readily pokes fun at himself. “It’s good banter I enjoy it,” he said. If he wins his   match Monday against the   Ricardas Berankis on Court 17, a possible   encounter with the   champion Roger Federer looms. His weekend at Wimbledon playing among the game’s best  —   “I saw Djokovic earlier, and my jaw dropped I’m going to act cool and pretend it’s all normal now,” he said  —   has proved equally invigorating. “I’m delighted, but it makes me realize I want it week in, week out now,” he said. “I’ve got to keep working, keep my head down, and get on with it. ” Bate, who was unable to cancel her Monday dental patients’ appointments, will follow his   match from afar. She said she believed she would have many more opportunities to watch Willis continue toward a Hollywood ending. “Something in his mind has just clicked, and he’s ready now,” she said. “He’s taking it all in, and he’s got plenty more in him. ”'"}, "time": 1742563264.3537261}