{"duration": 0.0663595199584961, "input_args": {"text": "\"The Daily Sheeple – by Melissa Dykes \\nSure, Hillary Clinton is a banshee nightmare from Hell, but that really doesn’t mean Donald Trump is automatically amazing just because literally anything is better than Hillary. That’s a pretty low bar. \\nTrump has assured us he’ll give a lot more power to Big Brother as if we aren’t already living in an Orwellian nightmare as it is. He has said that he will grow the police state, boost the Patriot Act, and extend the neverending wars (he keeps mentioning Iran specifically, because no matter who becomes president, they all know they have to sing that same old “Which Path to Persia?” tune). Once I even heard the man say he expects the NSA to be listening in to all our phone calls… guess that makes it okay??? \\nಠ_ಠ \\nTrump has also called Edward Snowden a traitor and implied that he should be executed. \\nHe also banned Snowden from Miss Universe… which I’m sure must’ve really broken poor Edward’s heart. Message to Edward Snowden, you’re banned from @MissUniverse . Unless you want me to take you back home to face justice! \\n— Donald J. Trump (@realDonaldTrump) October 21, 2013 \\nWhile Snowden may be a limited hangout, that’s beside the point here. Without Snowden, we wouldn’t have so much hard physical evidence of just how much our Constitution has been trampled, our 4th Amendment has been run over, and our privacy has been rendered nonexistent in the cybernetic technological control grid we now find ourselves living in. \\nHow is exposing the tyrannical government’s crimes against the people a traitorous act worthy of death? \\nAnd this talk of “justice”? \\nReal justice would be someone standing up for the Constitution and Bill of Rights and challenging Big Brother and the NSA surveillance state, something neither Trump nor Hillary ever planned to do. \\nThen again, Trump is the same guy who said he would “take out” the family members of terrorists. Do you have a criminal in the family? How would you like to be killed because your family member is a criminal? Same logic fail. \\nLike this government is honest about who the real terrorists even are anyway. Come on. If we’re to believe Trump is that naive, he shouldn’t go anywhere near the oval office. \\nThen again, how does the saying go? Everyone that would make a truly good president is smart enough to realize they’d never want to be president? Not that presidents are really running anything in this country anyway… \\nSigh. . @realDonaldTrump yes, I'm sure Edward Snowden would take it all back if he'd known he'd eventually be banned from @MissUniverse .\""}, "time": 1742563930.7733662}