{"duration": 0.1071009635925293, "input_args": {"text": "'The temporary alliance between Senator Ted Cruz and Gov. John Kasich of Ohio, formed to deny Donald J. Trump the Republican presidential nomination, was already fraying almost to the point of irrelevance on Monday, only hours after it was announced to great fanfare. With the pact, the two candidates agreed to cede forthcoming primary contests to each other. Mr. Kasich would, most crucially, stand down in Indiana’s primary on May 3 to give Mr. Cruz a better chance to defeat Mr. Trump there, while Mr. Cruz would leave Oregon and New Mexico to Mr. Kasich. It appeared to be a measure of last resort, but initially it seemed like a breakthrough. Mr. Cruz trumpeted what he called the “big news” in Indiana, a state that appears pivotal to stopping Mr. Trump from winning a majority of delegates. “John Kasich has decided to pull out of Indiana to give us a    contest with Donald Trump,” he said. But at his own campaign stop in Philadelphia on Monday, Mr. Kasich tamped down Mr. Cruz’s triumphalism. Voters in Indiana, Mr. Kasich said, “ought to vote for me,” even if he would not be campaigning publicly there. He added, “I don’t see this as any big deal. ” Under the best of circumstances, the arrangement between Mr. Cruz and Mr. Kasich would seem to be a long shot  —   more of an expedient to stop Mr. Trump from taking a big step toward winning the nomination next week in Indiana than a permanent joining of forces. Far from forming any kind of unity ticket, Mr. Trump’s surviving challengers have both vowed to triumph in an open convention in Cleveland, and they remain irreconcilable on key matters of policy. Their agreement dealt only with three states, leaving an open question as to how directly they might compete with each other everywhere else. Even in Indiana, emerging as the most important state, the   pact appeared something less than decisive. While Mr. Kasich’s campaign canceled his public appearances in the state, the governor was still slated to visit Indianapolis on Tuesday for a   event at the Columbia Club. And he still had meetings scheduled with a series of Indiana Republicans, including Gov. Mike Pence, according to a leading Republican in the state. Mr. Cruz’s campaign privately advised supporters on Sunday not to endorse tactical voting, whereby his supporters might switch their allegiance to Mr. Kasich in states where the Ohio governor is running stronger against Mr. Trump. “We never tell voters who to vote for,” read the suggested Cruz talking point. “We’re simply letting folks know where we will be focusing our time and resources. ” Mr. Trump, who has taunted his opponents throughout the race for their Keystone Kops approach to undermining his campaign, seemed to relish the continuing strain between his remaining rivals. On Twitter, he mocked “Lyin’ Ted Cruz” and “1 for 38 Kasich,” referring to the latter’s dismal winning record in the Republican race, for being unable to beat him on their own. “So they have to team up (collusion) in a two on one,” Mr. Trump wrote. “Shows weakness!” At a campaign rally in Rhode Island, Mr. Trump boasted that his opponents were united against him, and said he welcomed their “collusion. ” “Actually I was happy,” he said, “because it shows how weak they are. ” Allies of both Mr. Cruz and Mr. Kasich did not exactly disagree with that assessment, and acknowledged that the prospect of imminent disaster in Indiana had been the impetus to reach their deal, such as it is. Still, aides to Mr. Cruz and Mr. Kasich seem acutely aware that they risk turning off voters who find the arrangement unseemly. Even before his rivals’ agreement, Mr. Trump had complained repeatedly that the nominating process was “rigged” against him. With Mr. Trump expected to win all five of the East Coast states that vote on Tuesday, the next opportunity to slow his campaign will come a week later in Indiana. Republicans believe he must be stopped there if they are to deny him the nomination. “Indiana is a   for Ted Cruz, and it’s a   for anybody who doesn’t think Donald Trump should be the nominee,” said David McIntosh, the president of the Club for Growth, a conservative group opposed to Mr. Trump and supportive of Mr. Cruz. The group is airing an ad in Indiana urging voters to vote for Mr. Cruz, not Mr. Kasich, to stop Mr. Trump, and officials said they intended to keep it on the air despite the agreement. On Monday, Trusted Leadership PAC, a group supporting Mr. Cruz, said it also planned to keep a previously announced attack ad against Mr. Kasich on the air in Indiana. The group added, though, that it had shelved advertising plans in New Mexico and Oregon. Charles R. Black Jr. an adviser to Mr. Kasich, said it would be helpful to his candidate  —   and “a big blow to Trump”  —   for Mr. Cruz to win Indiana. The point of announcing the deal, Mr. Black said, was to indicate to outside “super PACs” where the campaigns and candidates were marshaling their resources. Mr. Black played down the degree to which voters would cast their ballots strategically, switching allegiance between candidates to thwart Mr. Trump. “Either the guy gets to 1, 237 or he doesn’t,” he said. “Voters don’t focus on this tactical, inside baseball stuff. ” For months, rivals of the Republican   have claimed that he has succeeded only because the   vote has been spread among so many alternative candidates. That argument appeared to falter in New York last week, when Mr. Trump won 60 percent of the vote and captured nearly all of the state’s delegates. Now that each of them has been granted a cleaner shot against Mr. Trump  —   in different states, and at different moments over the next few weeks  —   Mr. Cruz and Mr. Kasich will have no easy excuse if Mr. Trump continues to prevail. While Mr. Cruz faces the more immediate test in Indiana, Mr. Kasich will have to make swift use of his free hand in Oregon. Though the state’s primary date is May 17, the election there is conducted by mail, and voters will begin to receive their ballots this week. Ron Saxton, a prominent Kasich supporter in Oregon, said the deal “puts more pressure” on Mr. Kasich and Mr. Cruz to perform strongly against Mr. Trump. But Mr. Saxton, a former Republican candidate for governor, said there was catching up to do in his state. “None of the three G. O. P. campaigns have any real Oregon visibility yet, just the national press,” Mr. Saxton wrote in an email. “Since Cruz’s name remains on the ballot, my guess is that he’ll get close to the same votes he’d get if he hadn’t ‘withdrawn.’ Is he going to actively encourage his supporters to vote for Kasich?” On Monday, both candidates swatted away questions about whether the deal was something of an underhanded ploy. Mr. Cruz said the agreement was aimed at empowering   voters against the   denying that the effort to stop Mr. Trump was subverting the will of the people. “This is entirely about the will of the people,” he said. “This is about winning the votes of the Hoosier State. ” Mr. Kasich, in Pennsylvania, grew quickly agitated at the suggestion that his deal with Mr. Cruz reflected desperation. “Me? No, I’m not desperate  —   are you?” he asked a reporter. “Are you desperate?”'"}, "time": 1742564331.564689}