{"duration": 0.1363687515258789, "input_args": {"text": "'TUNIS  —   Since their revolution in 2011, Tunisians have tussled among themselves to define their new identity after successive dictatorships. Belatedly, they have started reclaiming their history as well. Dictatorships have a way of manipulating historical narratives. So alongside any of the most pressing issues of the day, the past, too, is in play. The struggle to shape the past, and give it new authenticity, can be witnessed all around the Tunisian capital. Last summer, the Tunisian government restored a statue of Habib Bourguiba, the founder and first president of the republic, to its original place on the capital’s main avenue. The famous symbol of Mr. Bourguiba  —   astride his horse, arm aloft rallying Tunisians to independence  —   had been banished to a seaside neighborhood in 1987, after he was ousted by his prime minister, Zine   Ben Ali. (Mr. Ben Ali was himself overthrown decades later during the Arab Spring uprising.) The current president, Beji Caid Essebsi, who served in Mr. Bourguiba’s cabinet, was the main driver behind reinstating the statue, which he said was intended to reinforce his call for national unity and a strong state. Mr. Bourguiba’s statue had replaced a humiliating symbol of colonialism: an image of the colonialist politician Jules Ferry with a Tunisian woman at his feet proffering an olive branch, he reminded Tunisians. “That used to be the symbol of colonialism, and Bourguiba is the symbol of freedom, of independence and of the modern state,” he said at the unveiling. Many Tunisians do indeed respect Mr. Bourguiba as the father of the independent nation, yet he was also a dictator who imprisoned his opponents and clung to power for over 30 years. The young revolutionaries who spearheaded the Arab Spring uprising greeted the return of the statue with a flurry of jokes on social media about the waste of money. Far from cementing his reputation, moving the statue opened a new debate around Mr. Bourguiba’s legacy. “People talk of a ‘new Bourguibism,’ but it does not exist,” Med Dhia Hammami, a journalist and activist, said. “There are no ideas coming out of that. ” With the new freedom gained since their revolution, some of Mr. Bourguiba’s victims are being given a chance to set the record straight at public hearings of the Truth and Dignity Commission. One of them, Hamadi Ghars, 85, a journalist in the independence movement, gave a damning portrayal of Mr. Bourguiba at the commission’s first public hearing. Mr. Ghars described how Mr. Bourguiba had betrayed thousands of his fellow   fighters when he accepted an interim deal with the French government that allowed the colonizers’ security forces to continue controlling the country. “We were happy with independence and were waiting for reconciliation,” Mr. Ghars said. Yet Mr. Bourguiba then ordered them to surrender to the French, who bombed the fighters in the mountains. “They killed hundreds of young Tunisian men,” he recalled. “I don’t doubt that their bodies are still in the mountains and rivers today. ” Mr. Ghars was captured and sentenced by the French to 20 years imprisonment and 10 years hard labor, which he served under Mr. Bourguiba. “They destroyed a dream of unity,” he said. “Usually history is written by the victors, but this is the opposite,” said Adel Maizi, the president for preservation of memory at the commission. “These testimonies will reveal the truth. ” “Dictatorship always tries to keep things secret,” he explained. “These kinds of testimonies are against forgetting. They will preserve memory for the country and serve as a way to guard such things happening in the future. ” Tunisians are discovering other forgotten chapters of their past that the two dictators tried to obscure. Crowds have flocked in recent weeks to an exhibition on the opulent, and at times profligate,   reign of tribal princes when Tunisia was part of the Ottoman Empire. The exhibit is housed in the   Ksar   palace. Once a royal residence, it was used as a barracks and a hospital and has been shuttered since the 1980s, its collection of French paintings and Ottoman magnificence hidden from view. For a year, the Rambourg Foundation has been restoring a part of the palace and its collections to unveil the history of Tunisia between 1830 and 1881, the period when princely rulers known as beys ruled the country before it was colonized by France. Ridha Moumni, a curator of the exhibit, insists it is not political, but a matter of history. Yet he is displaying events that Tunisia’s dictators sought to suppress. “We have a very rich heritage that no one knew about,” Mr. Moumni said. “Our goal was to show that Tunisian modernity did not start with independence or colonization. ” The exhibition offers many Tunisians their first glimpse of the   court through royal portraits and rich costumery. More important, it provides a history lesson on the significant reforms of the era  —   the founding of the army, the drafting of a constitution and development of diplomatic relations  —   that helped forge a nation. Among the original documents on display, one abolished slavery in 1846  —   before the United States did so, Mr. Moumni pointed out. Others include a constitution drafted in 1860 that recognizes the rights of all citizens, including Christian and Jewish minorities, and census registers, in Hebrew and Arabic, belonging to Tunisia’s ancient Jewish community. Students and a university teacher touring the exhibition said it was the first time they had seen images of Tunisian royalty. Another discovery is the diversity of Tunisia’s leaders  —   from the Christian foreign minister, Giuseppe Raffo, to a Circassian general, Kheireddine Pasha, and the former slave Mustapha Khaznadar, who married into the royal family and rose to become the bey himself. One of the most popular displays  —   in the throne room, and beside the very table upon which it was signed  —   is the Treaty of Bardo, under which the beys, facing a crumbling dynasty and mounting debts, surrendered to become a French protectorate. The beys were subsequently blamed for clearing the way for seven decades of French rule and were condemned to obscurity by Mr. Bourguiba after Tunisia’s independence. “He wanted to erase this from the national memory,” Mr. Moumni said.'"}, "time": 1742563195.084554}