{"duration": 0.07807397842407227, "input_args": {"text": "'In 1957, Walt Disney laid out what was then an astonishing plan for an entertainment ecosystem: Animated movies would fuel theme park attractions, which in turn would power merchandise sales, which would create interest in more movies. Today, with “Frozen,” the plan has evolved further. When the movie became a blockbuster in 2013, taking in $1. 3 billion globally, Disney got busy: It rushed out merchandise, sent Princesses Anna and Elsa on an   tour and started work on an Arendelle boat ride at Epcot and three stage musicals. Robert A. Iger, Disney’s chief executive, told a Wall Street conference last month that he had recently seen a “Frozen” show bound for Disney California Adventure. He noted that “Frozen” would be part of the parade at the new Shanghai Disneyland. And, he said, “I sat on Friday here in New York in a   of the ‘Frozen’ musical that we’re starting to develop for Broadway. ” It’s an increasingly familiar approach: Both “Beauty and the Beast” and “Aladdin” had theme park shows before New York productions. (Broadway veterans helped create them all.) Keeping all the efforts untangled can be challenging. Is the theme park show a miniversion of the Broadway one? What about the Disney Cruise Line production? Here’s what we know about the   versions of “Frozen” underway: DIRECTOR Liesl Tommy. Raised in South Africa, she tends to pursue   projects about civil and political rights. Ms. Tommy is a Tony nominee for her direction of “Eclipsed,” a searing play, starring Lupita Nyong’o, about captive women in Liberia. Her musical credits include “Party People,” a regional show about the Black Panther movement. OTHER TEAM MEMBERS “Frozen  —   Live at the Hyperion,” as the   theater here is named, uses the film’s score, but some songs initially written as solos (“In Summer”) were rearranged by Jason Michael Webb (“The Color Purple”) to become ensemble numbers. Chad Beguelin, the   author of the book for Disney’s “Aladdin” on Broadway, adapted the “Frozen” book from the film’s screenplay. Video elements, and there are a ton of them, were handled by Aaron Rhyne (“A Gentleman’s Guide to Love  Murder”). STATUS It began an   run on May 27 and has up to five performances daily. The Hyperion was home to “Aladdin  —   A Musical Spectacular,” which ran for 13 years. CAST More than 100 actors, dancers and puppeteers are involved (about 3, 500 auditioned) but Disney declined to identify any by name. With so many daily performances, a spokesman explained, numerous performers share the lead roles. (Disney also, ahem, takes the suspension of disbelief to an extreme at its theme parks: As an usher told a child before a recent performance, Anna and Elsa are real and played by themselves.) RUNNING TIME 55 minutes AUDIENCE The    masses. Everyone from babies to older adults took in a recent performance, with a handful of people in prime seats holding up their phones to videotape the opening number. “There’s going to be a lot of people who have never seen theater before,” Ms. Tommy said in an interview. COST TO ATTEND Ostensibly free. But the Hyperion is inside Disney California Adventure, one of two theme parks that make up the Disneyland Resort. Admission to California Adventure is $95 to $119, depending on the day. HOW IT DIFFERS FROM THE FILM “It’s 10 times better than the movie,” a Disney usher named Yvonne (from Lakewood, Calif. according to her name badge) told guests as they waited in line for nearly an hour for a recent performance. Some film fans may disagree. Some songs are abbreviated and ancillary scenes and characters are cut. There is no Marshmallow (the ice monster) for instance, and Anna does not wander into Wandering Oaken’s Trading Post and Sauna. How it differs from other ‘Frozen’ adaptations A lot more bells and whistles. “People are coming in here full of adrenaline, they’ve been on rides,” Ms. Tommy said. “How do I top that?” There’s a lavish    video wall, a sequence in which Sven the reindeer literally flies, and lots of fake fog. ‘Let It Go’ Moment Hold on tight: Elsa belts it out while standing atop a towering set of crystal stairs that rotates out over the audience. DIRECTOR Alex Timbers. An unconventionally witty theater director known for his steampunk aesthetic, he has twice been nominated for Tony Awards, for directing Disney’s “Peter and the Starcatcher” and for writing the book for “Bloody Bloody Andrew Jackson. ” OTHER TEAM MEMBERS Music and lyrics by Kristen   and Robert Lopez, who wrote the film’s score, and a book by Jennifer Lee, who wrote the screenplay and directed the film. The set design is by Bob Crowley, who has won multiple Tony Awards, including for Disney’s “Aida” and “Mary Poppins. ” STATUS A developmental lab (two weeks in which actors, accompanied by keyboards and drums, read and sang, using scripts on music stands, before an invited audience that at one point included Mr. Iger) was held in New York last month. A   run is planned at the Denver Center for the Performing Arts in August 2017, and Disney said that it planned to move the show to Broadway in the spring of 2018. CAST At the developmental lab, Betsy Wolfe (“Bullets Over Broadway”) played Elsa, Patti Murin (“Lysistrata Jones”) was Anna, Okieriete Onaodowan (“Hamilton”) was Kristoff and Greg Hildreth (“Cinderella”) was Olaf. Although actors often remain with productions from the developmental process through full productions, Disney has not committed to casting for the Denver production that cast would likely continue on to Broadway. RUNNING TIME Two full acts, presumably running two to two and a half hours. AUDIENCE The Broadway audience is older than that at the theme parks most ticketbuyers are women. Disney’s shows attract more families with children than do some more   Broadway shows, but the company says its shows also draw many adults without children. COST TO ATTEND Prices have not been set, but   tickets to “The Lion King” on Broadway are $99 to $199, with premium seats for up to $225. HOW IT DIFFERS FROM FILM Live actors, obviously. An expanded story and an expanded song list  —   there are eight (and a reprise) in the film, and this production will probably have at least twice that. Among the new songs is “True Love,” an Act II ballad sung by Anna after Hans, a scheming prince, betrays her and locks her in a palace room. HOW IT DIFFERS FROM OTHER ‘FROZEN’ ADAPTATIONS The Broadway version is the only one with new songs and new book material. It will be the most fully realized and ambitious theatrical production. ‘LET IT GO’ MOMENT The song, thanks to its soaring sound and stratospheric popularity, is now the first act’s closing number. DIRECTOR Sheryl Kaller, whose Broadway credits include “Mothers and Sons,” in 2014, and “Next Fall,” which earned her a Tony nomination in 2010. OTHER TEAM MEMBERS Disney has not publicly confirmed this production, but casting notices this year said that Josh Prince, whose Broadway dance résumé includes “Beautiful: The Carole King Musical” and the   “Shrek the Musical,” would be the choreographer. STATUS Still in the early stages. There has been at least one   but this musical is planned for the   cruise ship Wonder, which is headed to dry dock this year for refurbishment. CAST With limited living quarters for performers, Disney’s ships often look for people who can simultaneously play a range of characters. But the casting notice for this effort included some specific requirements. For the role of Kristoff, for instance, Disney advertised for a baritone who stands six feet tall or more and can play a “rugged   type, a little rough around the edges, yet endearingly awkward. ” RUNNING TIME The show that will likely be replaced, “Toy Story  —   The Musical,” runs about an hour in the Wonder’s   theater. (Or “glitzy   theater palace at sea,” if you’re going by the Disney Cruise Line website.) AUDIENCE Disneyphiles. While intended to appeal to a wide range of travelers, guests tend to be well acquainted with Disney’s singular style of entertainment, and that means any efforts to cut corners are noticed. COST TO ATTEND Included with the price of passage, which starts at $507 a person (plus port fees and taxes) for a     Bahamian cruise. HOW IT DIFFERS FROM FILM Like the theme park version, this will be about presenting what’s in the movie  —   in   fashion  —   for already captive crowds. HOW IT DIFFERS FROM OTHER ‘FROZEN’ ADAPTATIONS Disney Cruise Line, which mounts its stage productions without much interaction with its corporate siblings, bills its musicals as “ . ” Marketing pitches aside, this show will almost certainly be the least extravagant. ‘LET IT GO’ MOMENT You can bet that the climactic scene will include fake snow. Choose your seat wisely.'"}, "time": 1742628589.9277785}