{"duration": 0.16510319709777832, "input_args": {"text": "'Home / #Solutions / BOMBSHELL: AAA Safety Foundation Finds No Scientific Basis that THC in Blood Impairs Driving BOMBSHELL: AAA Safety Foundation Finds No Scientific Basis that THC in Blood Impairs Driving Claire Bernish May 10, 2016 19 Comments \\nNo scientific basis exists to legitimize current THC testing in place in five states who base their impaired driving standards on THC levels in blood. According to a study from auto club giant AAA’s safety foundation, a blood test threshold for THC — the chemical component of cannabis that makes people ‘high’ — is simply not scientifically possible. \\nYet, in five of six states where cannabis is legal, the tests are used to determine whether or not drivers should be considered impaired. Those tests employ a blood level-based judgment similar to that used for determining alcohol impairment. But AAA found such tests for THC are wholly unreliable — sending potentially unimpaired drivers to jail and putting impaired drivers back behind the wheel. \\n“There is understandably a strong desire by both lawmakers and the public to create legal limits for marijuana impairment in the same manner we do alcohol,” said AAA president and CEO, Marshall Doney, as reported by the Associated Press . “In the case of marijuana this approach is flawed and not supported by scientific research.” \\nAfter discovering the tests had no value, the safety foundation recommended Colorado, Montana, Nevada, Ohio, Pennsylvania, and Washington simply ditch their THC impairment testing laws — and that other states considering similar laws abandon the proposed legislation. \\nAs the study notes, determining actual impairment from THC consumption is quite different than for alcohol. Tolerance for the chemical would mean though a regular cannabis user might have high blood levels of THC, they are perfectly safe behind the wheel — while a relatively low THC blood level could be found in someone unfit to drive. \\nInstead of what amounts to arbitrary blood testing, AAA recommends specialized law enforcement officers who would better observe behavior as a determination of impairment, which would then be backed up by THC blood testing. \\nAs the AP noted, nine states — even some with legalized medicinal cannabis — currently have zero-tolerance policies in place for THC-impaired driving. Those states’ laws include not only blood testing for THC, but also for its metabolites which can persist in blood long after the last use of cannabis. \\nObviously, explained New York University professor and specialist in drug issues and criminal policy, Mark A. R. Kleiman, such laws make no sense. \\n“A law against driving with THC in your bloodstream is not a law you can know you are obeying except by never smoking marijuana or never driving,” he explained. Kleiman, however, disagrees with AAA’s recommendation to adjust current laws, and instead feels such offenses should by traffic violations. \\nAccording to Kleiman, compared to other potentially dangerous impairments, cannabis is likely the least offensive on the list. While some studies showed roughly double the risk of accidents caused by cannabis impairment, nationally-legal hands-free cellphone usage quadruples the crash risk — and blood alcohol content of .12 increases accident risk 15-fold. \\nA “noisy child in the back of the car” presents the same increased dangers as driving under the influence of cannabis, Kleiman said — noting an exception would be use of both cannabis and alcohol together, which would greatly increase impairment. \\nClearly, ineffectual and illegitimate laws that senselessly send people to jail need to be abandoned with a quickness — and the AAA safety foundation’s findings on THC blood impairment testing would be a fantastic place to start. Share \\nThis is really OLD news. They should have read this: http://www.bisdro.uni-bremen.de/boellinger/cannabis/09-robbe.pdf zimbo \\ngood link, but older than this. the fact that interested people from along the whole world expect news in studies and decisions based on founded experiences to cannabis and society makes this “kind of new” : “now we know that we knew it before, but we didnt believe…”. all the studies in europe are hard work because of “illegalitity”. as only holland has a moderate view on that and a few countries like portugal or poland have anti criminal laws for owning a few gram, there is almost no way for good representative studies, except for medical science. thats why this 1994 study from holland is so important, and is translated in a big interpretation range along europe. The federal comission (same that was asked for 1ng level in 2002) tried to uplift the level to 3ng this january, due to later sciences, but was not succesful. relevant science of countries with “legalisation” is important for other countries, and such statements from the aaa too, as it comes from big brother u.s., thats always a door opener, holland science isn t so much for lobby germoney marianne \\nIt’s not about making sure people aren’t impaired, it was never about that. It’s just yet another means of trying to screw over anyone who breaks stupid prohibitionist drug laws. From that perspective, the law makes perfect sense. Michael \\nThis is only a surprise for the people who have never experienced or used marijuana. 2 hours after you smoke it, you’re as good as new most of the time. Sometimes it last a little longer but not very often especially if its mexican ditch weed. It has to be really good strain to last any longer than 2 hours. However, if you ingest it there is a longer buzz. It takes an hour or so after you ingest it to begin the buzz. \\nAgain, marijuana is far far far more safe to use and understand how to use, than alcohol. If you wanna make your life better stop drinking alcohol which will definitely kill you and smoke a doobie, relax and enjoy the music knowing that what you just put in your body will NOT kill you.. marianne \\nTo be fair, alcohol isn’t all that deadly if used in moderation. Moderate consumption even has some health benefits. I mean it’s certainly a drug with the potential to be very dangerous if misused, more so than most illegal drugs, but drinking alcohol won’t definitely kill you (though it very well might if you overuse it). William Carmichael \\n“To be fair, alcohol ISN’T ALL THAT DEADLY if used in moderation.” LOL! What a statement. marianne \\nTrue enough, I did phrase that in a somewhat amusing way! Elizabeth Pallett \\nOr you could try eating it to ensure good health, mental and physical, smoking has a very short term effect even for pain, ingesting has far more benefits and is better for you too. JD Salinger \\nThe point of the article is getting tested for impairment. If you eat it you still have thc in your system. You can still get popped. The article says the tests are unreliable are unscientific. But thanks for your view on edibles anyway. mantirig41 \\nI know I am a much kinder diver when stoned. Sober I drive like a bat out of hell Chris Sky \\nLaws aren’t about “The Greater Good” they are about MONEY and CONTROL for the people in power. AlPennG \\nWE NEED ACCESS TO THE WHOLE PLANT SO WE CAN LIVE A WHOLE LIFE!! PERIOD!! THERE IS NOT ENOUGH PROFIT IN IT SO THAT HAS TO BE BAD!! THAT IS THEIR THINK ON EVERYTHING AND ANYTHING ALL BULLSHIT THEY KEEP SHOVELING!! WE CRY, WE DIE AND THE POLITICIANS LIE!! zimbo \\ninteresting. to drive drunk and stoned is no option for me, and i appreciate possibilities to keep people away from driving a car as long as they are not able to. the question about how to find out, the level and penalty in other countries brought me here.I heard about colorados level of 10ng thc/ml serum. for german administration law you are “unable impaired” for car and bike with 1ng thc/ml serum, thats up to 24h after a 34mg joint. or 75 ng thc metabolites /ml serum; or a official witness for using car or bike within 12h after smoking joint (telling this in wrong environment can be enough) you loose your license and begin a half or one year psychological and medical odyssey for a 50/50 chance to get it back. (for blood alcohol the level is 1,1). psychologists earn a lot of money with that. in switzerland, you may drive trolley car with up to 3ng/ml serum- as operator. both laws based on the 1994 limburg university study by h.w.j. robbe, also posted below. As there is no succesful way to criminalize people with a joint or a bit cannabis by criminal law in germany due to high “costs for nothing”, the admin.law is misused, and you can loose your license even by smoking in a park or carrying 3 joints in a taxi. Finally i like the link to the noisy backseat kids. interesting: this year several people lost their lives getting involved in accidents by spontaneous street races. as the license is older than 2 years, the drivers get it back automatically after 1 -3 months. there is no significant statistic on marihuana caused accidents. in combination with alcohol there are. every known european study say that marihuana leads to defensive and careful appearances, while alcohol leads to aggresive and overestimational behaviour. beer is an huge economical factor here, followed by pharmaceutics, which are not further considered in such discussions. \\non a tv documentation of german truckers they talk in every way about all kind of pharmaceutics taken before while and after their hard job… Misty Trenshaw \\nhttp://sprout.news/cops-confess-people-drive-better-when-they-are-high/#wysija \\nSo, what’s the problem? You stop at a stop sign and wait for it to turn green? You’re overly cautious? A good driver? It’s all about government control. \\nI divorced my parents because of control when I was 17. I divorced my ex husband because of control when I was 32. I think it’s high time we divorced our government. BarleySinger \\nunfortunately, all over the world people are in abusive relationships with their governments Kokopelli \\nWeed causes people to drive more slowly & more cautiously. Alcohol makes people drive faster & more recklessly. BarleySinger \\nThe inability to account for “Tolerance” isn’t specific to cannabis. Is is true for nearly every intoxicant. It *very* true about alcohol. The cytochrome p450 system is different for every person. There is no simple roadside testing method in existence that can prove impairment. JackmeOFF \\nPot is for losers complete fucking drones JD Salinger \\nI bet you are a hoot at parties. Social'"}, "time": 1742562243.7894585}