{"duration": 0.10248374938964844, "input_args": {"text": "'By Sami Jamil Jadallah on November 3, 2016 \\nIn a few days, the ugliest and most distasteful presidential election in US history will be over, and we will see which candidate won to preside over the US as president. This is an election that is all about groping and emails, making us the laughing stock of the world. \\nAs we all saw in this campaign, there was little of anything about the priorities that really matter to the American people. Both candidates talk about bringing back jobs, industrial and manufacturing jobs. \\nWe know well that both are liars and will never bring back the kind of industrial and manufacturing jobs that gave middle-class Americans a sense of dignity and security. \\nThe two candidates did their best to cater to the rich and powerful, the people with the money and the billionaires who always shaped our nation agenda and politics. \\nBillions have poured into this year national elections, no different from previous national/presidential elections where close to $5 billion were injected in and invested in the elections. The returns are for the donors never for the voters. \\nAmerica’s poor, not only Black and Hispanic but White as well have been neglected for a long time. They are getting the “ shaft” everywhere and from everyone, especially from Congress, that empower corporate America to screw the poor at every turn and in every way. And Congress does that through legislation that gives incentives to corporations to locate their manufacturing jobs overseas, that allows banks and financial institutions especially the credit card companies to give the shaft to the poor. What does the future hold for our next generation? \\nIt should not be surprising that this great country of ours has such a staggering number of poor — over 45 million or 14.5% of the population — with the prospect that most Americans will be part of this category at least one year, if they are between the age of 24-75 years. \\nNot all poor are unemployed living off the system, but there are millions of these poor who are working hard, very hard one or two jobs to make ends meet, with Hispanics and Blacks most likely to be among this category than Asians and Whites; with women more likely than men to fall into this category of working poor; and with White males with less than a high school education spending at least one year in this category. \\nIt is hard to think, in this country of plentiful that 46.5 million people earn less than $19,090 a year, and 20.4 million are in deep poverty, earning less than $11,510 a year. \\nWhile our presidential candidates cater to the rich and powerful seeking their support, no candidates are talking about the poor-paying jobs that Americans have; with 50% of available jobs paying less than $34,000 annually. Talk about the banks and financial institutions that looted tens of millions from Americans’ pension funds during the financial crisis of 2007-8, or the fact that Congress allowed corporations to restructure, benefiting Wall Street and the investors, while cheating workers out of their pensions and health care. Of course, Republicans talk about eliminating “entitlements” for the poor, while forgetting or neglecting the kind of entitlements the US Military gets, or the kind of entitlements corporations and rich executives get as part of the deal worked out with members of Congress — entitlements that are triple what the hard-working and poor American gets. \\nIt is true that 27 families out of 100 get cash assistance, but not all of them are Black or Hispanic, as we are lead to believe, thus causing an outcry to end the Welfare system. I should note here that 90% of the entitlements goes to the elderly and the poor and retired workers on social security and Medicare, amounting to $500 billion. \\nBut then let us look at how the system, which is sponsored and nurtured by Congress screws American every day. \\nLet us take, for example, the interest rates charged on credit cards. In most cases, the poor are the ones who gets behind on credit card payments and as such, the interest rates charged is almost twice as much as the average rate and moreover if one gets behind on one payment on one credit cards, all the other credit card companies hike the rate. Thus the poor pay a higher price and costs. \\nWith high-interest rates charged and the likelihood of default on one payment, then the credit ratings are changed, forcing the poor to pay higher interests on car loans and on mortgage loans. \\nWhat is truly a rip off is the fact that companies like “payday loans” and “car title companies” while considered as banks receiving funds at less than 1% can charge borrowers 30 even 50%? Unconscionable. \\nThe poor also get the shafts from health care companies especially supplemental insurance. Because of the fact that the poor are most likely to suffer from certain chronic diseases such as obesity, high blood pressure, and diabetes, their rates are much higher than the average. \\nAdd to that the way our schools are funded. Since we do not have a national tax plan that funds education, all the funding comes from property tax. \\nAs such if you are in a poor neighborhood, the income to support the schools system, the police, and the fire department is much less than in affluent communities and, as such, children get less quality education, and most likely they will be among the poor who will live on government subsidies; and most likely these neighborhoods will have higher crime rates and a higher percentage of incarceration. What the government saves in support of education, it pays double that in the cost of crime and incarceration. This simply makes no sense, as a society. \\nI leave you with two incidents that I personally experienced. \\n– Supplemental Health Insurance : We, I mean those of us over the age of 65, have and must purchase supplemental health insurance to complement our Medicare. I purchased a policy from UnitedHealth through AARP paying $258 a month. After almost a year, I discovered that the CEO of UnitedHealth earned $60,500,000/year in salary. I made a simple calculation; and it was shocking to realize that I have to pay 19,500 years of monthly premium just to pay his salary for one year. Of course, I dropped UnitedHealth because of this. \\n– Exploitation of Disadvantaged Communities : The other when I had my private company, which offered auto dealers a smart loyalty card, where dealers can add to the card special packages, such as oil change, discount on maintenance, and extended warranty, while consumers benefited from being able to keep track of their vehicle service and maintenence records on the smart chip in the card (Patented), thus saving car owners from getting ripped off by duplicate or unwarranted repairs. Many dealers especially those in the poor neighborhoods where charging the poor interest rates exceeding 20% on car loans, and forcing these poor guys to buy additional warranties, and charging them thousands of dollars of services the dealers knew the customers would never need. I had to drop these dealers from my network. \\nWho knows, maybe one day, we will have a Congress and presidential candidates who will represent, not only the very rich but the very poor and the middle class, and offer solutions that get the people to work and out of welfare and subsidies. The American people are not lazy, but they need an opportunity; and Trump and Clinton will not bring that opportunity. America’s problem is not the presidency, but Congress, and that is where the changes must take place.'"}, "time": 1742564292.2937727}