{"duration": 0.04766106605529785, "input_args": {"text": "'\\nBy The Indigenous People \\nProtests escalated in North Dakota as police moved in with armed vehicles and rubber bullets. Standing Rock youth also tried to deliver a letter to Hillary Clinton’s headquarters. Actor and activist Mark Ruffalo, who just returned from North Dakota, where he and Native Renewables founder Wahleah Johns presented Standing Rock Sioux tribal elders with mobile solar panels on trailers, bringing clean power to the protest encampment where the largest gathering of Native Americans in modern history is taking a stand against the Dakota Access Pipeline . \\n“This pipeline is a black snake that traverses four states and 200 waterways with fracked Bakken oil ,” said Ruffalo, co-founder of The Solutions Project , which works to accelerate the transition to 100 percent clean and renewable energy. \\n“We know from experience that pipelines leak , explode, pollute and poison land and water. But it doesn’t have to be that way.” \\nThe solar trailers will provide clean energy to power medical tents and other critical facilities for Native American protesters and their allies at the encampment. The trailers symbolize a healthy, equitable, prosperous energy future made possible by clean renewable energy. \\n“Water is life,” said Johns, a Navajo leader. “By leading a transition to energy that is powered by the sun, the wind and water, we ensure a better future for all of our people and for future generations.” \\nJohns’ company, Native Renewables, promotes low-cost clean energy solutions for Native American families throughout the U.S., with an emphasis on job creation and on benefiting the community as a whole. The trailers were built by members of the Navajo nation and were financed by Empowered by Light and Give Power. \\nResearch led by Stanford Prof. Mark Jacobson, another Solutions Project co-founder, shows that it would be technically possible and economically beneficial to transition to 100 percent clean renewable energy in each and every state across the country. In North Dakota , for example, wind and solar energy would be the primary sources of clean power and transitioning to 100 percent renewables would create 30,000 jobs. '"}, "time": 1742564196.4671729}