{"duration": 0.05134844779968262, "input_args": {"text": "'posted by Eddie Toys “R” Us stores in the UK are offering a “quiet hour” for shoppers with autism this holiday, and we’d love if U.S. retailers did the same! Remember that part in The Grinch Who Stole Christmas when the kids of Whoville play with dozens of toys and the Grinch grimaces and moans about all the “Noise, noise, noise, noise?” Yep. I think of that moment every time I try to take my two kids shopping during the holidays. Yes, they both love toys and, yes, they both adore toy stores—but they both have sensory issues and my oldest is non-speaking and autistic. This means that going to big toy stores like Toys “R” Us just isn’t an option for us during the holiday season (or even most days). Crowds, fluorescent lights, loud music, and many other sensory triggers overwhelm both my kids (and me, if I’m being honest) and we usually leave within minutes of stepping into the store. Toys “R” Us locations throughout the U.K. will be hosting a quiet hour on Sunday, November 6, for those with autism and their families. Stores will be opening an hour earlier with special accommodations meant to make holiday shopping easier for individuals on the spectrum. As part of the shopping experience, lights will be dimmed and fluorescent lighting will be limited. In-store music will also be muted, and no announcements will be made. Stores will be offering quiet-zones for shoppers. These adjustments are all an effort to make sure children on the autism spectrum and their family members can have a comfortable and enjoyable shopping experience, regardless of their disabilities, Toys R Us representatives told the Telegraph . “For many autistic people and their families a simple trip to the shops, which should be an enjoyable experience, can be fraught with difficulty,” Cadey says. We’re hoping Toys R Us locations in the United States will adopt this idea too. Parents have petitioned for sensory-friendly aisles in Target and ShopRite with local success, but children on the autism spectrum and their parents deserve a place to shop comfortably year-round, no matter where they live. After all, Toys R Us is a place where a kid can be a kid, right? Source:'"}, "time": 1742561889.4252737}