{"duration": 0.0840604305267334, "input_args": {"text": "'1 Reply \\nAccording to numerous reports and stories that have been published through the years, among the many alleged secrets the Vatican has, there is a device called the Chronovisor. The device enables its user to observe future as well as past events. Many believe this device is one of the greatest guarded secrets humanity has ever had. \\nSome even believe it is a crucial ‘tool’ which has allowed the Vatican to preserve its influence and power through the years. \\nEver since H. G. Wells composed his novel ‘The Time Machine’ many people have been left fascinated by the idea of time travel. Even Theoretical Physics dreams of the possibility of making it work one day. Everything related to time travel today is related to science fiction, or so it seems at least. Interestingly, on May 2, 1972, an Italian newspaper shocked the world when they published an article with a provoking headline: A machine that photographs the past has finally been invented . \\nThe news article indicated that dozens of scientists created an artifact that allowed them to photograph the past, and even witness important historical accounts directly connected with Jesus Christ. \\nThe alleged device –which according to many is nothing more than science fiction— was built in the 1950’s by a team of scientists led by Father Pellegrino Maria Ernetti, an Italian physicist who eventually became a priest. \\nIt is believed that the team received important help from Nobel laureate Enrico Fermi and famous rocket scientist Wernher von Braun. \\nThe Chronovisor is a relatively small object that is equipped with a number of antennas and is composed entirely of precious alloys, cathode tubes, some dials, and levers. Reports by Father Ernetti suggest that whoever uses the device is able to capture and record specific locations, important events and follow in history, noteworthy individuals. According to Father Ernetti, he had observed, among other historical events, Christ’s crucifixion and photographed it as well. View image The image to the left is the one obtained using the Chronovisor. On the right is a similar image located in a Church in Perugia. \\nIt is even said that under the perfect conditions, the device offers its user the ability to foresee what was going to happen in the near future. \\nHowever, Father Ernetti remained secretive and stated he was not at liberty to reveal further details about the Chronovisor. \\nFather Ernetti did however reveal that the Chronovisor worked by ‘…processing residual electromagnetic radiation left over by numerous processes…’ \\nAccording to numerous reports, Father Ernetti used the Chronovisor to witness important historical events, with the most notable being the crucifixion of Christ. \\nHowever, Father Ernetti revealed that thanks to this invention had managed to witness the destruction of Sodom and Gomorrah, and other major historical events such as the founding of Rome in 753 B.C. Also, thanks to the Chronovisor, Father Ernetti was able to recompose the missing work “Thyestes” , written by Ennio Quinto and represented in Rome in 169 A.C. in its original version, and the original text of the the two stone tablets written by God (Exodus 24:12) which were given to Moses on Mount Sinai, apart from witnessing the likes of Napoleon, Roman philosopher Cicero and other great and momentous historical and biblical episodes. \\nFrench priest François Charles Antoine Brune was one of the first to hear about the Chronovisor. According to Father François, he met Father Ernetti in the 1960’s when the two were traveling across the Grand Canal of Venice. As the two were experts in ancient languages, they began to talk about the Bible and its interpretation through the years. Supposedly, these are the blueprints of the Chronoviso r [image] \\nFather Brune that was very intrigued when the Father Ernetti revealed that there was a machine that could answer all questions related to the Bible. \\nWhen Father François asked about the Machine, Father Ernetti described the Chronovisor, saying that it was device that functioned just like a T.V., but instead of receiving transmissions from local stations, the chronovisor was able to tune into the past and allow the viewer to “see and hear” events that had occurred centuries before. \\nErnetti told Brune that the machine worked by detecting images and sounds that humanity had ‘created’ which were “floating” in space. \\nIt is said that this intriguing device and the project behind it were canceled by the Vatican but not destroyed. Some believe the Chronovisor is located somewhere in the Vatican, hidden in one of the many chambers, hidden away from society. \\nHowever, there are other versions that suggest that father Ernetti and his team decided to voluntarily dismantle the device because, since it could tune anywhere and anytime in the past, if it were to fall into the wrong hands it could create the “scariest dictatorship the world has ever seen.” \\nInterestingly, before Father Ernetti died in April 1994, he wrote a letter in which he INSISTED that the device was real and was not a hoax as many believed. \\nFather Ernetti claimed that the alleged photograph the chronovisor had captured of Jesus Christ on the cross, showing the sorrowful face of a bearded man gazing towards the heavens was real, even though some critics argue that the image was a reproduction of a statue of Jesus located in a church in Perugia. \\nCritics also claim that the alleged text the device managed to observe of “Thyestes” included Latin words that did not exist at the time it was made. \\nIn 1994, Father Ernetti also said that “Pope Pius XII forbade us to do disclose any details about this device because the machine was very dangerous. It can restrain the freedom of man…” \\nHowever, in 1988, the Vatican issued a decree in which it warned that “anyone using, an instrument of such characteristics would be excommunicated.” According to many, this was an unnecessary warning since according to them the Chronovisor never existed. So why issue a warning if it was just another hoax? \\nWhat do you think about the story behind the Chronovisor? Do you think it is another top secret ‘object’ kept away from society by the Vatican? SF Source Rise Earth  '"}, "time": 1742562286.561408}