{"duration": 0.15958356857299805, "input_args": {"text": "'Les BRICS doivent faire face à la guerre financière des États-Unis par Ariel Noyola Rodríguez Pour faire face à la guerre financière provoquée par les États-Unis, il est urgent que les BRICS renforcent leurs liens de coopération dans les domaines de l’économie et de la finance. La nouvelle banque de développement des BRICS devrait augmenter son volume de prêts, de même que leur fond de réserves. En outre, les BRICS devraient mettre en œuvre dès que possible leur propre agence de notation. Pour intensifier la cohésion économique, la mise en œuvre d’une zone de libre-échange devrait faire tomber les barrières tarifaires et ainsi augmenter sensiblement les échanges entre eux. En bref, si des mesures appropriées ne sont pas prises dans les meilleurs délais, les BRICS courent le risque de sombrer au cours du prochain ouragan financier.\\nRéseau Voltaire | Mexico (Mexique) | 27 octobre 2016 Les 15 et 16 octobre a eu lieu dans l’État de Goa (Inde) le huitième sommet du BRICS – Brésil, Russie, Inde, Chine et Afrique du Sud. Nous devons reconnaître que la réunion a eu lieu dans le contexte d’une situation profondément critique pour l’économie mondiale. Cependant, les BRICS ont montré, une fois de plus, leur capacité extraordinaire à transformer un mauvais moment en une occasion d’approfondir leurs liens à partir d’un point de vue stratégique.\\nAprès que les économies des BRICS ont bénéficié d’un âge d’or, au cours des dernières années, les taux de croissance ont subi un ralentissement drastique. Face à cette situation difficile, les BRICS ont maintenant, plus que jamais, besoin de tirer avantage des institutions financières qu’ils ont présentées au monde il y a quelques années à Fortaleza (Brésil), lors de leur sixième sommet [ 1 ].\\nEn avril dernier, la Nouvelle Banque de développement a fait son premier prêt [ 2 ] pour plus de 800 millions de dollars et on estime qu’en 2017, les prêts pourraient atteindre 2 500 millions de dollars [ 3 ]. En outre, en juillet de cette année, l’institution financière a mené à bien une réalisation historique avec l’émission des ‘green bonds’ – obligations vertes – en yuans, pour un montant équivalent à 450 millions de dollars [ 4 ]. Ces instruments financiers, tout en augmentant l’influence de la monnaie chinoise à l’échelle mondiale, servent à financer de grands projets d’investissement.\\nPendant ce temps, le fond de réserve (CRA, pour son sigle en anglais), d’une valeur de 100 milliards de dollars, est prêt à ouvrir ses premières lignes de crédit afin de stabiliser la balance des paiements des BRICS, comme l’a annoncé le ministre des Finances indien, Arun Jaitley [ 5 ]. Chaque fois que la Réserve fédérale des États-Unis (FED) évoque, comme à l’habitude, la menace d’une augmentation des taux d’intérêt fédéraux, déclenchant ainsi une nouvelle crise financière mondiale, il est urgent que les BRICS augmentent le plus rapidement possible les ressources monétaires de leur fond de stabilisation, sinon ils courent le risque de dommages graves suite aux paris spéculatifs des grandes banques d’investissement.\\nEn même temps, les BRICS ont besoin d’ouvrir de nouveaux fronts pour défier ouvertement l’hégémonie des États-Unis et du dollar dans le système financier international [ 6 ], non seulement en commerçant avec les monnaies locales, mais aussi, par exemple, par le biais de l’accumulation de réserves en yuan dans leurs banques centrales, d’autant plus que la monnaie du peuple – le renminbi en chinois – a officiellement été admise, le 1er octobre dernier, dans le panier des monnaies d’élite soutenant les droits de tirage spéciaux créés par le Fonds monétaire international (FMI) à la fin des années 1960 [ 7 ].\\nEn outre, les BRICS ont la capacité d’articuler une alliance financière grâce aux puissants liens géopolitiques entre l’Amérique latine, l’Asie, l’Afrique et le Moyen-Orient. Les banques régionales de développement, qui sont façonnées principalement par des pays périphériques, peuvent bien servir cet objectif, qu’il s’agisse de la Banque asiatique pour les investissements dans l’infrastructure (AIIB, pour son sigle en anglais), de la Banque de l’ALBA (Alliance bolivarienne pour les peuples de Notre Amérique) et même de la Banque du Sud, qui va enfin démarrer avant la fin de cette année.\\nLa mise en œuvre d’une agence de notation propre est également devenue un besoin urgent pour les BRICS, afin de se libérer de l’écrasante domination maintenue par les États-Unis à travers Fitch, Moody’s et Standard & Poor’s [ 8 ]. Ces trois agences de notation, plutôt que de conduire des évaluations à partir de critères techniques, agissent principalement par des impulsions [téléguidées, NdT] de nature politique. Ce mode de fonctionnement en fait une authentique machine de guerre : dégradant les notes des obligations souveraines et augmentant ainsi les coûts d’emprunt dans des pays tels que la Grèce, la Russie ou le Venezuela, de façon spectaculaire.\\nLa cohésion économique est un autre défi majeur, bien qu’il n’y ait aucun doute qu’elle se soit substantiellement développée au cours des dernières années, entre 2001 et 2015, le commerce entre les BRICS en proportion de leur commerce total a doublé, passant 6 à 12% [ 9 ]. La Chine est de loin l’économie la plus intégrée avec les autres BRICS. En revanche, les liens entre des pays comme l’Inde et l’Afrique du Sud sont marginaux. La même chose est vraie entre le Brésil et la Russie. Ceci dénote la grande pertinence de la prochaine mise en œuvre d’une zone de libre-échange entre les BRICS [ 10 ]. Cependant, en plus d’abattre les barrières commerciales entre eux, les BRICS doivent promouvoir ensemble la construction de chaînes de valeur, par l’intégration de leurs systèmes de production, afin d’encourager l’industrialisation des pays les moins favorisés.\\nEn conclusion, il y a de nombreux défis à l’horizon pour ces cinq puissances émergentes. Je suis convaincu que, pour la suite, le succès des BRICS dépendra de la capacité qu’ils auront à se réinventer, de leur créativité dans l’expression de nouvelles dimensions de la coopération pour atteindre leurs objectifs à plus long terme. Face à la nouvelle guerre financière que prépare l’Amérique, il est à nouveau temps pour les BRICS de revenir à la charge…\\nAriel Noyola Rodríguez Traduction\\nJJ\\nsite : Le Saker Francophone\\nSource\\nRussia Today (Russie)'"}, "time": 1742562075.0177712}