{"duration": 0.021819353103637695, "input_args": {"text": "'\\n\\nBillionaire venture capitalist and PayPal founder, Peter Thiel spoke at the National Press Club today on his support for Donald Trump.\\nMost of the media ignored the groundbreaking presser today.\\nThey don’t want Americans to know about this pro-Trump gay conservative from Silicon Valley.\\nFOX Business Network carried much of the speech live.\\nSilicon Valley billionaire Peter Thiel took his pro-Trump message to the heart of the media establishment in a major speech at the National Press Club this morning.\\n“We’re voting for Trump because we judge the leadership of this country to have failed,” Thiel said to an audience of about 150 members of the press.\\n“The insiders have been getting it wrong for a long time,” he added. Establishment politicians “are just rearranging the deck chairs on the Titanic.”\\nDuring the Q&A session, the moderator inquired about “social blowback” Thiel has received for supporting Trump and dwelled heavily on Thiel’s funding of the Hulk Hogan case that brought down Gawker.\\nThiel justified funding the lawsuit against a Gawker that he described as a “singular, sociopathic bully.” Defending illegal revenge porn under the guise of the First Amendment “is an insult to journalists,” he noted.\\nThat comment aroused a scowl in the reporter sitting next to me, who walked out shortly after.\\nThe room was full of about 150 journalists, mostly from mainstream publications. There was a row of cameras filming the event, but only two reporters appeared to be streaming it live through Periscope and Facebook Live. National Press Club Executive Director William C. McCarren treated several members of the press brusquely as they tried to enter the event.\\nThe event highlighted the growing gulf between the establishment and the rest of the country, the mainstream press versus the independent press, and the truth of what’s seen from direct sources and how mainstream reporters often spin it.\\nAt one point during the speech, Thiel directly pointed out the hoaxing and bias within the media. “The Advocate, a magazine which once praised me as a ‘gay innovator,’ published an article saying that as of now I am, and I quote, ‘not a gay man,’ because I don’t agree with their politics.”\\nWhen a high-profile, highly intelligent figure like Thiel supports Trump, who cares about the truth?\\n\\nSource \\n'"}, "time": 1742628488.0682316}