{"duration": 0.16109371185302734, "input_args": {"text": "'WASHINGTON  —   President Obama said Thursday that he was terminating the    policy that has allowed Cubans who arrived on United States soil without visas to remain in the country and gain legal residency, an unexpected move long sought by the Cuban government. “Effective immediately, Cuban nationals who attempt to enter the United States illegally and do not qualify for humanitarian relief will be subject to removal, consistent with U. S. law and enforcement priorities,” Mr. Obama said in a statement. “By taking this step, we are treating Cuban migrants the same way we treat migrants from other countries. ” The move places a finishing touch on Mr. Obama’s efforts as president to end a   of hostility between the United States and Cuba and to establish normalized relations and diplomatic ties with a government American presidents have long sought to isolate and punish. The action came through a new Department of Homeland Security regulation and a deal with the Cuban government, which Mr. Obama said had agreed to accept the return of its citizens. “What we’ve agreed to is that the past is past, and the future will be different,” said Jeh Johnson, the Homeland Security secretary. “This is us repealing a policy unique to Cuba given the nature of the relationship 20 years ago, which is very different right now. ” The   “wet foot, dry foot” policy, which dates to 1995, owes its name to its unusual rules, which require Cubans caught trying to reach the United States by sea to return home, yet allow those who make it onto American soil to stay and eventually apply for legal, permanent residency. It was one way in which the United States tried to weaken Fidel Castro’s government, by welcoming tens of thousands of Cubans fleeing repression. In recent years, however, it has become a magnet for economic refugees, enticing many Cubans to make a perilous journey to the United States, where they enjoy a status unlike migrants from any other country. “The exceptionalism of the ‘wet foot, dry foot’ policy toward Cuba is a relic of the Cold War, and this decision by the administration is really its final effort to normalize an area of interaction between Cuba and the United States, migration, that is clearly in need of normalization,” said Peter Kornbluh, a   of “Back Channel to Cuba,” which recounts the secret negotiations between the United States and Cuban governments that forged the policy. But the change drew sharp criticism from opponents of Mr. Obama’s move to thaw United States relations with Cuba, who argued it would reward dictators in Cuba, ignoring their human rights abuses. “Today’s announcement will only serve to tighten the noose the Castro regime continues to have around the neck of its own people,” Senator Robert Menendez, Democrat of New Jersey, said in a statement. He said Congress had not been consulted on the move, and he added, “The Obama administration seeks to pursue engagement with the Castro regime at the cost of ignoring the present state of torture and oppression, and its systematic curtailment of freedom. ” Benjamin J. Rhodes, the deputy national security adviser, who led clandestine negotiations that produced the 2014 opening, said most Cubans who came to the United States in the past “absolutely had to leave” Cuba “for political purposes. ” Now, he said, the flow is largely of people seeking greater economic opportunity. Ending the policy, he added, is a reflection of Mr. Obama’s view that, ultimately, the rise of a new generation of Cubans pressing for change in their own country is vital to bringing about change there. “It’s important that Cuba continue to have a young, dynamic population that are agents of change,” Mr. Rhodes said. Jorge Mas, the chairman of the Cuban American National Foundation, said the changes would force Cuba’s leaders to be more responsive to their citizens. “People may be initially upset at not being able to have this way of getting out of Cuba, but ultimately, the solution for Cuba is people fighting for change in Cuba,” Mr. Mas said. The change in policy essentially guts the Cuban Adjustment Act of 1966, which assumed that Cubans were political refugees who needed protection and allowed those who remained in the United States for more than a year to become legal residents. Obama administration officials urged Congress on Thursday to repeal the measure, but in the interim, by eliminating the policy that automatically afforded parole to Cubans arriving in the United States, they have essentially denied Cuban migrants the opportunity to take advantage of its benefits. Cuba, likewise, still has a law in place that denies   to migrants once they have been gone for four years or more Mr. Rhodes said officials in Havana have pledged to repeal it once the United States Congress scraps the Cuban Adjustment Act. Cubans who believe they will be persecuted if they return home will still be permitted to apply for political asylum when they reach the United States. According to the agreement, which was signed on Thursday in Havana, the Cuban government said it would accept 2, 746 people who fled in the Mariel boatlift of 1980 back into the country, and consider accepting back others on a    basis. The Obama administration also eliminated the Cuban Medical Parole program, in which Cuban medical professionals stationed in international missions could defect and get   visas to the United States. Obama administration officials had initially said they were not planning to change the policy after efforts to normalize relations with Cuba. But the thaw prompted speculation that once diplomatic relations resumed  —   as they did in 2015  —   the arrangement would end. On Thursday, the officials said they had deliberately played down talk of revising the policy for fear of setting off an even larger exodus from the island nation. The number of Cubans trying to arrive by sea surged after the United States and Cuba announced the decision to restore diplomatic relations in 2014. In the 2014 fiscal year, almost 4, 000 Cubans either landed or were caught. Two years later, the number shot up to 7, 411, according to the Coast Guard. The number of Cubans who have since begun to arrive in the United States by land has also soared in recent years. The number of Cubans who arrived at the Southwest border has increased more than fivefold since 2009. Last year, almost 55, 000 Cubans arrived nationwide, the Department of Homeland Security said. Kevin Appleby of the Center for Migration Studies of New York praised the specific change, while questioning the broader rules covering asylum. “The good news is that it ensures equal treatment between Cubans and   from other nations,” he said. “The bad news is that our asylum system is broken and does not afford adequate due process and protection to those who need it. ” Phil Peters, president of the Cuba Research Center, said that the number of Cubans entering the United States is actually much higher because tens of thousands more overstay their visitor visas and still others migrate legally. “This is a favor to Trump because it’s a tough measure to take, but it’s the right measure to take,” Mr. Peters said. “These are economic migrants coming here that, unlike any other nationality, get a big package of government benefits without any justification. ” There was a mixed reaction among Cubans in Havana to news of the sudden change in policy. Some said they felt its repeal was long overdue. Others thought the impact would be widely felt among Cubans still hoping to leave their island. Michel, 33, who declined to give his last name for fear of running afoul of the government, said he tried to escape on a makeshift boat in the early 2000s, but the vessel broke down halfway to the Florida Keys. Since then, he has given up on his desire to move to the United States. But he knows many Cubans who still hope to leave and who would be devastated by the change in policy. “This is going to make a lot of people’s lives very hard,” he said. Alberto Herrero, 58, a high school biology teacher, applauded the move by the Obama administration, saying the previous regulation was “an unfair law. It’s unfair to the rest of the world’s people, especially those in Latin America. ” “It’s exclusive to us, and that’s not fair to the world,” he said, adding that he hoped the removal of the policy was a signal of a   of other outdated measures taken by the Americans against Cuba. “Maybe other restrictions will be lifted, like the embargo,” he added.'"}, "time": 1742561846.0157447}