{"duration": 0.11779594421386719, "input_args": {"text": "'A member of the   Oakland Raiders Super Bowl winning team told Breitbart News at the Conservative Political Action Conference that it is time for   to reclaim their traditional conservatism. [“Today’s generation has been trained to think differently from my generation. We would stand for the flag in a heartbeat —  because we realized the opportunities we had,” said Burgess Owens on Thursday.  Owens was an   safety at the University of Miami, who was drafted by the New York Jets in 1973 and played for the Jets until joining the Raiders for their run at Super Bowl XV. Owens was at CPAC to discuss with people his new book “Liberalism or How to Turn Good Men into Whiners, Weenies and Wimps” and attend a book signing. “Today’s generation came from BET group —  the BET has been talking down our country for the longest time. ” Black Entertainment Television is the top cable channel focused on the   community. Today’s young   have been twisted up by BET, he said. “They tend to be more racist. They tend to be more ” he said. “I was the third black American to be recruited by the University of Miami and I remember going down there —  my goal was not to fail,” he said. “That was really what allowed our community to think,” he said. “We didn’t want to leave our families down. We didn’t want to let our race down. We would work as hard as we could, so we would not fail. ” Owens said that when he was coming of age in the late 1960s, there was always a racial consciousness that was trying to break through and disrupt the traditional ways of life. In those times in his hometown of Tallahassee, Florida, the black community was stronger than most other communities, black or white, he said. “The community as that time was totally committed to the family,” he said. “We had the highest percentage of men committed to marriage. We had the fastest growing   in the country. ” Conservatism, with its emphasis on work, entrepreneurship, and faith traditions, is a natural fit for   but somehow the narrative got switched up. Owens said he wrote his book because   politics and policies have destroyed thriving black communities, but no one else seemed to want to talk about it. “Back in 1910, the NAACP, started by 21 white Marxist, socialist, atheist Democrats, began to intertwine the thought of liberalism into my community,” he said. The National Association for the Advancement of Colored People is the most prominent of the civil rights organizations. “We started to pull away from the pillars that always made our country great and towards being and feeling like victims,” he said. “They taught our race that the real value was in being with the white race, instead of what we were doing at the time,” the father of six said. “I would say to a young   man: Recognize who you are, let’s  . Take the rolls you are supposed to take. Take care of your family. Respect women —  big time —  and we will be a great country again,” he said. His message to white Americans: “Don’t apologize anymore for who they are. We have a great society with great ancestors, who did their best. ”'"}, "time": 1742562293.7393696}