{"duration": 0.09290719032287598, "input_args": {"text": "'(actualizada a las 20:39 26.10.2016) URL corto 0 29 1 0 CIUDAD DE MÉXICO (Sputnik) — El Senado de México analiza la propuesta enviada por el presidente Enrique Peña Nieto para reemplazar al fiscal general de la República, Arely Gómez, por Raúl Cervantes, expresidente de la cámara alta. \\nEn un enroque en dos altos cargos del Estado, la iniciativa contempla que la procuradora saliente, quien también es senadora con licencia para desempeñar el cargo de fiscal, ha sido designada a la Secretaría de la Función Pública, cargo que también debe analizar el Senado. Renuncia secretario federal de la Función Pública de México La titular saliente de la Procuradora General de la República (PGR Fiscalía federal), asumió el cargo a principios de 2005, en remplazo de Jesús Murillo, que fracasó cuando se derrumbó la llamada \"verdad histórica\" sobre la llamada Masacre de Iguala , perpetrada por policías y sicarios confabulados contra estudiantes de la escuela rural de Atoyotzinapa, que sigue sin esclarecerse.\\nEn aquella ocasión, Gómez expresó que la PGR heredada era \"un desastre\" como institución federal contra el crimen. \\nEse cargo federal se encarga de auditar el desempeño de los funcionarios públicos con criterios de transparencia, vacante desde julio pasado cuando un amigo del presidente, Virgilio Andrade dejó el cargo anticorrupción. \\nMás: Presidente Peña pide perdón a México por la \"Casa Blanca\" de su esposa \\nAndrade dejó ese despacho cuando se aprobó el nuevo Sistema Nacional Anticorrupción , entre críticas de la oposición por haber exonerado al presidente mexicano en una investigación interna, por la llamada Casa Blanca de la primera dama, Angélica Rivera, una mansión de casi 4 millones de dólares construida y financiada por un amigo contratista del gobierno. \\nEl enroque Se forma una \"tormenta perfecta\" al final del mandato de Peña Nieto en México Gómez ha encarado otros casos paradigmáticos, como la fuga del jefe de Cartel de Sinaloa, Joaquín Guzmán , alias El Chapo, que se fugó por un túnel cavado hasta la celda del mafioso, cuando la procuradora fue fotografiada desconcertada, examinando la boca del pasadizo subterráneo del escape.\\nUna de las tareas inconclusas que deja Gómez es un paquete de juicios por corrupción que involucran a media docena de exgobernadores del gobernante Partido Revolucionario Institucional (PRI), pero también uno de la oposición, que están prófugos por millonarias malversaciones al erario y sin rastro de ellos. \\nSi es aprobado, el legislador Cervantes, de 53 años y con dos décadas de militancia en el PRI tendrá en su despacho los expedientes de líderes políticos caídos en desgracia de la clase política, cuyos hilos llegan a las alturas del poder. \\nLa aprobación del enroque en los cargos es inminente: por ejemplo, el líder del Partido Acción Nacional (PAN, centroderecha) en el Senado, Fernando Herrera, ya le deseó al designado \"éxito en su nueva encomienda\". \\nA su turno, el coordinador de la bancada del Partido de la Revolución Democrática (PRD, centroizquierda), Miguel Barbosa, dijo que como senador se desempeñó con \"profesionalismo y capacidad\", cuando fue presidente de la Cámara alta. \\nEl líder del PRI en el senado Emilio Gamboa, dijo que Cervantes \"representó siempre a todas y a todos los legisladores\", para desenredar \"temas tan complicados como los que se discutieron\", durante la aprobación de las reformas estructurales al inicio del mandato de Peña Nieto en 2013. \"Cervantes es un gran constitucionalista y respetuoso de las leyes\", que contribuyó a establecer el nuevo Sistema Nacional Anticorrupción, dijo el líder del PRI. \\nSenadores calculan que la corrupción cuesta el 10% del gasto público, es decir de 20.000 a 25.000 millones de dólares, otros organismos lo calculan como porcentaje del Producto Interno Bruto, y oscilan desde el 2 al 10% del PIB. \\nEn cuanto al crimen, Gómez deja la Fiscalía cuando las estadísticas oficiales sobre homicidio dolosos en ocho meses de 2016, registran un amento anual de 20%. ...'"}, "time": 1742562122.850557}