{"duration": 0.05271768569946289, "input_args": {"text": "\"Failed weapons systems cost Pentagon $58 billion over two decades Published time: 26 Oct, 2016 19:47 Get short URL The Pentagon building in Washington, DC. © AFP The Pentagon loves to throw good money after bad ‒ to the tune of nearly $60 billion on failed big-ticket weapons systems over the last two decades, according to a new internal Department of Defense review. \\nFrom the Army’s Future Combat Systems (FCS) that focused on fighting the last war to its RAH-66 Comanche stealth helicopters that never quite got off the ground, between 1997 and October 2016, the Pentagon invested $58 billion on weapons technology it never received. That doesn’t include the boondoggle that is the F-35 jet , which was finally declared “ready for combat” at the beginning of August. \\nThe FCS ($20 billion) and the Comanche ($9.8 billion) are just two of 23 major weapons programs that were canceled before they were finished, and together the two Army projects made up more than 50 percent of the “sunk costs” outlined in the Pentagon’s annual internal acquisitions performance review. The 224-page report by Undersecretary of Defense for Acquisition, Technology and Logistics Frank Kendall was published earlier this week. Read more 5 costly Pentagon projects of dubious merit \\nThe report noted how much money was spent on each canceled program, how far along in the process they were before they were killed, and if any of the technology was rolled up into new programs. For example, although the FCS was canceled, parts of it ‒ including many of the manned ground vehicles and the Intelligent Munitions System ‒ were swept up into a current program called the Army Brigade Combat Team Modernization Program. \\nMost of the programs were killed before they blew through their budgets, but eight of them spent all the money allotted to them before the Pentagon canceled them, the report found. \\nThe Government Accountability Office, a Congressional watchdog, conducted an audit of Pentagon spending in 2011 and found $70 billion in waste, the New York Times reported at the time . Much of the overspending happened because the DOD started building weapons systems before the designs were fully tested, the auditors said. \\nWith acquisitions overruns long being a thorn in the side of the Pentagon’s budget, in March the Air Force enlisted IBM’s Jeopardy! -winning cognitive computer , Watson. Two contractors are currently working to create programs that would enable Watson to navigate the 1,897-page Federal Acquisition Regulation, helping potential government vendors actually bid for military contracts. The project is expected to become operational by 2018. \\nAnother way the Pentagon has sought to cut down wasted spending is through the latest update to its acquisitions program, called ‘Better Buying Power 3.0’, which was announced in April 2015 . The program was designed to have “a stronger emphasis on innovation, technical excellence, and the quality of our products,” Kendall wrote in a memo ordering the program's implementation. It calls on the military-industrial complex to make projects more affordable in terms of funding, schedule and manpower throughout the entire lifespan of their products. It will also reward contractors for successful expense management, and ask them to eliminate unproductive processes and unnecessary bureaucracy. \\nOf course, holding contractors accountable for their failures when it comes to major cost overruns or weapons systems that don’t work is easier said than done. And it doesn’t help when someone at the Pentagon thinks it’s a good idea to spend money on bomb-sniffing elephants .\""}, "time": 1742628316.0785298}