{"duration": 0.04127073287963867, "input_args": {"text": "'Live at Truthdig: What Do the Dakota Access Pipeline Arrests Mean for First Amendment Rights?   Protesters square off against law enforcement during a demonstration against the Dakota Access Pipeline. (Screen shot via The Intercept ) \\nThis past weekend, 127 people were arrested at the construction site of the proposed Dakota Access Pipeline. Since the demonstrations began this summer, over 260 people have been arrested. \\nAmong those facing legal retribution for demonstrating alongside members of the Standing Rock Sioux tribe is Democracy Now! journalist Amy Goodman, who was initially brought up on “riot” charges, although these charges were later dropped . Actress Shailene Woodley made mainstream media headlines when she was arrested earlier this month during a peaceful protest—a process she streamed live onto her Facebook page. And award-winning documentary filmmaker Deia Schlosberg faces decades in prison for documenting the protests. \\nThere’s a common thread linking Goodman, Woodley and Schlosberg: each incurred criminal charges after documenting the protests in some form. Woodley, during her Facebook live stream, states that she is being singled out by law enforcement “because I have 40,000 people watching.” Goodman, speaking after her own charges were dismissed, declared that “the state’s attorney was attempting to stop journalism.” \\nAdvertisement Square, Site wide \\nSchlosberg, however, faces the highest consequences for filming protesters earlier this month: up to 45 days of jail time. The Guardian reports : \\nSchlosberg, a New York-based film-maker, is facing three felony conspiracy charges for filming protesters on 11 October at a TransCanada Keystone Pipeline site in Pembina County in North Dakota, with prosecutors alleging that she was “recruited to record the criminal activity”. \\nSchlosberg recently spoke with Goodman on Democracy Now! and explained the charges against her . “Conspiracy—they were all conspiracy charges: conspiracy to theft of public—theft of property, conspiracy to theft of service and conspiracy of interfering with a public—a critical public infrastructure.” She outlines the situation that led to her arrest: \\nI was filming the action. I was on public land. I was on a public road and at no point trespassed, at no point, you know, broke in or destroyed any property. I had nothing to do with the planning of the event. I was there to document it. I think it’s essential for journalists to—journalists and filmmakers to go where the mainstream media is not. And there’s a major hole in the coverage of climate change and people that are already dealing with the consequences of climate change and people that are fighting climate change. So, I take that responsibility very seriously. \\nFilmmaker Josh Fox, whose documentary “ How to Let Go of the World and Love All the Things Climate Can’t Change ” was produced by Schlosberg, has been extremely vocal about her arrest and what it means for a free press. \\n“Never did I ever think that the biggest threat to her life, of her livelihood, would be the United States government and our police force,” Fox told Goodman on Democracy Now!. He labels the charges against Schlosberg, Goodman and Woodley as a “brutal repression of the media,” and explains how police are infringing on constitutional rights. “These people are not accessories to the crime, they are the media,” he says. “This is a First Amendment, constitutionally protected activity.” \\nFox continues: \\nIt makes me terrified for the future of our profession. We need to be able to operate as documentarians. We need to be able to operate as independent media that are allowed to bring these stories to the public. And it’s constitutionally protected. And we won’t rest. \\nMany have rallied behind Schlosberg by signing an open letter that Fox wrote to President Obama. “Journalism, especially documentary filmmaking, is not a crime, it’s a responsibility,” Fox wrote. Celebrities like Neil Young, Mark Ruffalo and Daryl Hannah are among those who have signed their names to the open letter. \\nOn Thursday, Oct. 27 at 1 p.m. PDT / 4 p.m. EDT, the Truthdig team will sit down with Schlosberg and Fox to discuss the impact of these arrests on journalistic freedom. How can journalists protect their First Amendment rights? What do the hundreds of arrests say about the current state of American democracy? \\nGroundbreaking technology has also been used to cover the protests. New media like Facebook Live and Twitter give an on-the-ground, direct look into the demonstrations. Last weekend, law enforcement shot down a drone used by the protesters to document their interactions with police. How does new technology play a role in journalism and freedom of the press? \\nJoin us on Thursday by tuning into our Facebook page for the live video stream. Please leave any questions for Schlosberg and Fox in the comments section below. You can watch past editions of “Live at Truthdig” on our YouTube page .'"}, "time": 1742628569.730651}