{"duration": 1.308591604232788, "input_args": {"text": "'CHARLESTON, S. C.  —   The federal trial to determine whether Dylann S. Roof will receive the death penalty for his murderous rampage at an   church has become a delicate balancing act, pitting the desire of prosecutors to convey the fullness of grief for the nine devout victims against the due process rights of an unrepentant white supremacist who largely declines to defend himself. In three days of   testimony last week, prosecutors questioned 20 spouses, children, grandchildren and friends of the victims to draw painfully poignant portraits of men and women who were pillars of their church, families and community. Jurors heard not only the tributes of the bereaved but in some cases the voices of the dead  —   recordings of the Rev. Clementa C. Pinckney lecturing proudly about the   history of Emanuel A. M. E. Church, the Rev. DePayne Middleton Doctor booming a soulful a cappella solo, the Rev. Sharonda   praying in a crescendo at the funeral of a friend. The government’s lawyers called two or three witnesses to render a portrait of each victim testimony about one of the deceased  —   the youngest,    Tywanza Sanders  —   remains for Monday. The prosecution plans to rest its case that day, and Mr. Roof, who is representing himself, has said he will not call any witnesses. Closing arguments are expected on Tuesday. Mr. Roof, 22, stared straight ahead or down at the defense table, avoiding eye contact with witnesses who lost composure on the stand and jurors who sometimes dabbed away tears. When a prosecutor would conclude his gentle questioning, which could draw on for more than an hour, Judge Richard M. Gergel of Federal District Court would call for  . Mr. Roof, dressed in a   sweater and slacks, would rise slightly from his seat and announce: “No questions. ” That dynamic has prompted a series of challenges by Mr. Roof, and pointed exchanges between Judge Gergel and David I. Bruck, the veteran,   capital defender whom Mr. Roof has sidelined, about how much is too much. “It is not fair to allow that much testimony to be heard by the jury when I am not presenting any evidence  —   from my family or anyone else  —   in mitigation,” Mr. Roof argued on Wednesday in a motion that Judge Gergel denied. “If I don’t present any mitigation evidence, the   evidence will take over the whole sentencing trial and guarantee that I get the death penalty. ” Found guilty in December on 33 counts, including 18 that carry a potential death sentence, Mr. Roof has rejected Mr. Bruck’s strategy of presenting evidence about his background and mental health that might mitigate against his execution. The lawyer has been relegated to the role of standby counsel, allowed to sit beside Mr. Roof and offer guidance but not to question witnesses or to object to the government’s evidence. The usually   Mr. Bruck has not been able to contain his frustration. At several points last week, with the jury out of the courtroom, he pleaded with Judge Gergel to rein in the prosecution and to empower him to object to testimony. “This is sentencing it is not a memorial service,” said Mr. Bruck, who has often expressed his admiration for the victims and his sorrow for their families. “It has become a runaway freight train. ” Mr. Bruck told Judge Gergel that Mr. Roof did not have the capacity or courage to offer objections and consistently ignored the suggestions he passed along in notes. He said he had advised Mr. Roof to move for a mistrial. Judge Gergel has had none of it. He lectured Mr. Bruck that he had twice held competency hearings and determined that Mr. Roof met the legal thresholds to stand trial and represent himself, a constitutional right. “I have not noticed the bashfulness to make an objection any time he feels it appropriate,” the judge told Mr. Bruck on Friday. He asked Mr. Roof if he felt uncomfortable doing so. “No,” Mr. Roof replied, saying no more. The judge has, however, cautioned Julius N. Richardson, an assistant United States attorney, to restrict the number of victim impact witnesses and the length of their testimony. “At some point it’s too much,” Judge Gergel said. “I’m worried about the cumulative effect. ” Yet, he also acknowledged the emotion of the memories offered from the stand. “There is no antiseptic way to do this,” he said. Although they gradually acceded to Judge Gergel’s suggestion to “streamline” their case, prosecutors have argued that the scale of the massacre justified a large number of witnesses. “He is the one who chose to kill nine people,” Mr. Richardson said of Mr. Roof, who, according to testimony, wore shoes to a closed hearing last week bearing a   symbol of white supremacy. “He is the one who chose to go into a church to do it, and he’s the one who chose to do it to particularly good people. ” Impact statements at capital trials  —   and the legal questions surrounding them  —   rose to prominence in the 1980s as victims’ rights advocates won public support, including the passage of a law that altered the Federal Rules of Criminal Procedure. But in 1987, the United States Supreme Court ruled that such evidence in capital cases was a “constitutionally unacceptable risk. ” Four years later, it reversed that position when it ruled in Payne v. Tennessee. “Victim impact evidence is simply another form or method of informing the sentencing authority about the specific harm caused by the crime in question,” Chief Justice William H. Rehnquist wrote for the    majority. Such evidence has become a staple of capital proceedings. Before Timothy McVeigh was sentenced to death for the 1995 Oklahoma City bombing, which killed 168 people, prosecutors called 38 victim impact witnesses, Mr. Roof noted in a motion. More than a dozen testified at the 2015 trial of Dzhokhar Tsarnaev, who received the death penalty for the Boston Marathon attack that left three people dead and more than 250 wounded. Researchers have repeatedly found that such evidence has substantial effects on jurors who are weighing capital punishment. Mr. Roof’s choice to not call witnesses means that jurors will “not hear that evidence which tends to dampen the emotional effect” of grieving relatives, said Scott E. Sundby, a law professor at the University of Miami who has studied juror behavior in capital cases. Victim impact witnesses cannot, by law, opine about the penalty they prefer. But the jurors in Charleston have heard stories of intense suffering and loss, one after another. Prosecutors began by eliciting heartfelt reminiscences of family gatherings and final conversations, then pivoted to the excruciating moments of discovery after the killings of June 17, 2015. “I dropped the phone and just started jumping and fell on the floor and stayed there for two hours,” recalled Bethane Middleton Brown, Ms. Doctor’s sister. “I couldn’t move. ” Jurors saw an affecting video of Chris Singleton, the son of Ms.   rapping a tribute to his charismatic mother: “Took your life in the middle of the church, and I just pray, Mama, that you weren’t hurt. ” They heard Malcolm R. Graham, a former North Carolina state senator, describe the deep void left by the death of his sister, Cynthia Hurd, a longtime county librarian who served as his mentor and political guide. “I’m alive, I’m fit, but something is missing,” he said. “I can’t go to the store and replace it. I can’t reinvent it. ” Walter Jackson Jr. seemed to find cruel irony in his grandmother Susie Jackson’s being taken in a hate crime. “She was 87 when she passed, and that’s someone who’s gone through racism, discrimination, segregation,” he said. “Yet she was still that kind of person who still had that unconditional love for everyone. ” Daniel L. Simmons Jr. told of his initial bewilderment that his father, the Rev. Daniel Simmons Sr. a    Vietnam veteran with a license to carry a concealed weapon, had not done more to protect the churchgoers as he always had his family. He got his answer after receiving the keys to his father’s car from the coroner and finding the gun inside. “When I opened the car, it was sitting on the front seat,” Mr. Simmons said. “He took it off before he went to church. ” Death penalty critics complain that the testimony here has traded on the inherent nobility of the victims to advance what they consider the most ignoble of punishments, one that many members of the families say they oppose. They note the paradox that a death sentence for Mr. Roof may bolster support for maintaining a penalty that has been inflicted disproportionately on  . Some said the impact evidence may produce grounds for an appeal. Henderson Hill, a lawyer who founded the Center for Death Penalty Litigation and who attended the proceedings last week, said the tenor amounted to “a whistle for a life for a life. ” “This is so far past the pale of what is acceptable practice that I find it just unrecognizable as a capital sentencing proceeding,” he said. “I’ve never seen this kind of celebration of life, even in black churches where the traditions are that services go on forever. ”'"}, "time": 1742563676.1142814}