{"duration": 0.14725303649902344, "input_args": {"text": "'THE dress  —   a      petal print with little round buttons up the bodice and a tight collar  —   is tiny, tailored for a woman 4 feet 9 inches tall. The wearer was Charlotte Brontë, and her demure day dress, just about big enough for a    girl, was the plain wrapping that encased an enormous talent, a bubbling blend of ambition, passion and literary genius. Like a disembodied spirit, the dress stands at the entrance to “Charlotte Brontë: An Independent Will,” which opens at the Morgan Library  Museum on Friday and runs through Jan. 2. Timed to the 200th anniversary of Brontë’s birth, the exhibition offers a compact, sensitively arranged and surprisingly comprehensive tour of the life and work of one of the Victorian era’s most beloved writers, an object of fascination from the moment that “Jane Eyre” was published under the pen name Currer Bell in 1847. The exhibition’s subtitle comes from the pivotal chapter in “Jane Eyre” in which the heroine, although deeply in love with Mr. Rochester, the master of the house where she is a governess, spurns his proposal that she live with him, in effect, as his mistress. He entreats her to stop struggling like a “wild frantic bird. ” She replies: “I am no bird and no net ensnares me. I am a free human being with an independent will, which I now exert to leave you. ” The passage  —   one of the sizzlers that made “Jane Eyre” an   in its time  —   may be read in the novel’s bound manuscript, on view for the first time in the United States, and opened to the relevant page. Christine Nelson, a Morgan curator, secured the loan from the British Library and, to complement the Morgan’s deep holdings of Brontë manuscripts, books and drawings, arranged to borrow other items from the National Portrait Gallery in London and the Brontë Parsonage Museum in Haworth, Yorkshire. The exhibition, tracing a fluid, chronological circle, begins by establishing the location. For nearly all her life, Charlotte lived in a modest parsonage in Haworth, northwest of the urban and industrial Bradford and Leeds, perched on the edge of a wild moor. In the hands of the novelist Elizabeth Gaskell, whose enormously popular biography “The Life of Charlotte Brontë” appeared in 1857, two years after its subject’s death at the age of 38, the village, the house and its inhabitants took on a gothic character that haunted the public imagination. High on a windswept hill, wrapped in darkness and incessant rain, lived a family of creative geniuses, with three little Wednesday Addamses  —   Charlotte, Emily and Anne  —   afloat in a literary fantasy world. Two souvenir postcards in the exhibition ratify the general impression: a stern photograph of the parsonage, with gravestones in the foreground, and a truly frightening ambrotype showing the house as a blackened, solitary form with eerily glowing windows. It cries out for an exorcism. Haworth was actually a busy village with 11 grocery stores and six pubs, one of them a few steps from the parsonage. And the three sisters, along with their brother, Branwell, made this humble dwelling a factory of fun, despite the death of their mother and two older sisters. From an early age, the precocious siblings churned out fantasy fiction set in Glass Town, Angria and Gondal, magical imaginary lands populated by aristocrats, poets and lovers aflame. The current of romance ran strong in Haworth Parsonage, where Byron and Scott were gods. Along the walls devoted to “Imagination,” Chapter 2 in the exhibition’s story, the Brontë juvenilia unfolds, remarkable in both form and content. Charlotte mastered a nearly microscopic handwriting, with the appearance of printed fonts, to give her   publications the look of a finished book or magazine. The Young Men’s Magazine, a pretend journal in the style of Blackwood’s, measures an inch and a half by just over two inches, yet it contains a table of contents, articles and fake advertisements. Magnifying glasses have been provided, and they are needed. The print was small, but the ambition was titanic. Charlotte, bowing to the prejudices of the day, often presented herself as a kind of country mouse, nothing more than the daughter of a humble clergyman. It was, in large part, a pose. Ms. Nelson has come up with telling bits of counterevidence. Charlotte’s 1830 pencil portrait of Zenobia Marchioness Ellrington, one of her Glass Town characters, is accompanied by a pungent quote, reproduced on a wall of the exhibition. When Zenobia, a formidable intellect with similarities to her creator and to Jane Eyre, attracts the sniping criticism of a circle of males, the beguiling Marquess of Douro rises to her defense. “You are certainly jealous because a member of the feminine gender has displayed such wonderful abilities,” he begins, and goes on to praise a genius “likely to pale the ineffectual fires of her male contemporaries. ” The childhood world of fantasy takes a somber turn at the exhibition’s wailing wall. As the sisters entered their late teens, they faced painfully limited prospects as daughters of a humble clergyman. The world of work beckoned, and for single women of their class, that meant one of two professions, teacher or governess, neither of which they were suited to by talent or temperament. The saddest document in the exhibition is a prospectus that the sisters drew up advertising a school that they hoped to run: “the Misses Brontë’s establishment for the Board and Education of a limited number of young ladies. ” The number was very limited: zero. Just a few years before this low point, Branwell, an aspiring artist, painted a group portrait of the four siblings, one of the focal points of the exhibition. It is a strange visual document. At some point, Branwell painted over his likeness, leaving a whitish pillar between himself and his sisters, almost as though he had beamed himself out of the family, “Star Trek” style. In a sense, he did. His life ended, at 31, in a suicidal spiral of alcohol and opium addiction. Tuberculosis would claim Emily at 30, soon after “Wuthering Heights” appeared, and Anne at 29. For more than a   the portrait sat, folded in four and deeply creased, on top of a wardrobe in the home of Arthur Bell Nicholls, the curate at Haworth whom Charlotte married nine months before her death. It was discovered in 1916 by his second wife. It now hangs in the National Portrait Gallery and, like the British Library’s “Jane Eyre” manuscript, rarely leaves. “It was quite extraordinary to secure these,” Ms. Nelson said in an interview this week. “These are pilgrimage pieces. People come to the National Portrait Gallery seeking out that portrait in particular. ” Branwell lacked talent, sad to say, and his depiction of Charlotte gives little or no sense of what she looked like. The only other known portrait of her, by George Richmond, also on loan from the National Portrait Gallery, is a polite, decorous effort. Richmond was commissioned by Charlotte’s editor, George Smith, to produce a flattering image of his subject, and he obliged. Posterity has been left with a hopeless quest for an image to match the vividness of the literary personality. After the misery of servitude, the exhibition follows the path to glory, the years when Charlotte leapt immediately to the front rank of Victorian fiction with “Jane Eyre. ” She managed two more novels in her short lifetime, “Villette” and “Shirley,” which stand guard, along with her posthumously published early effort, “The Professor,” behind the “Jane Eyre” manuscript. The rest is history, of a peculiar sort. Admiration turned to worship within a few years after Charlotte died, three weeks before her 39th birthday and pregnant with her first child, her votive flame fanned into a blaze by Gaskell’s book. Readers of the life and the novels began making their way to Haworth, eager to see the famous moors and behold the parsonage. The exhibition includes an 1858 letter from Patrick Brontë, Charlotte’s father, with a   snippet cut from one of Charlotte’s letters, in response to an American admirer seeking a sample of Charlotte’s handwriting. The trickle of pilgrims  —   perhaps 200 a year in the 1860s  —   became a flood after the opening of the Brontë museum in a few rooms over the Yorkshire Penny Bank in 1895. Today, little Haworth attracts a million or so visitors a year, at least some of them headed for the Brontë Parsonage Museum, which opened in 1928, replacing the first museum. The fever still rages. At the parsonage museum, the exhibition “Charlotte Great and Small” runs through Jan. 1, and an exhibition in London at the National Portrait Gallery, “Celebrating Charlotte Brontë: ” ended its run last month. “To Walk Invisible,” a period drama about the Brontës written and directed by Sally Wainwright (“Happy Valley” and “Last Tango in Halifax”) is scheduled for broadcast on the BBC later this year. “Jane Eyre,” one if its early reviewers wrote, was a novel “to make the pulses gallop and heart beat. ” The same could be said for its author. And here is the evidence, undeniable and irresistible.'"}, "time": 1742562054.7889702}