{"duration": 0.11557936668395996, "input_args": {"text": "'Wall Street pension management companies are protesting a decision by agency officials to preserve a 2016 regulation which supporters say will protect retirees’ savings from   sales managers. [On February 3, President Donald Trump directed officials at the Department of Labor to review the regulation “to determine whether it may adversely affect the ability of Americans to gain access to retirement information and financial advice. ”  But officials postponed the review until late in the year and set June 9 as the start date for implementation of the regulation, which is dubbed the “diduciary duty” rule because it requires individuals who sell retirement plans to put their customers’ security above their employers’ interest in profits. In other words, salesmen and saleswomen have a “fiduciary duty” to their customers, just as a company’s CEO has a fiduciary duty to the shareholders. The pushback by agency officials to protect the regulation shows “the ‘Swamp’ is working behind the scenes to scuttle President [Donald] Trump’s agenda,” said Patrick Hynes, president of a D. C. advocacy group, Hynes Communications, which opposes the new regulation. Hynes declined to name the business groups who fund his advocacy. But the department’s postponement is good because it gives Trump and his populist aides another opportunity to support the rule amid opposition from greedy Wall Street investment companies, said Knut Rostad, president of the Institute for the Fiduciary Standard. The   rule can be preserved “if somebody at the highest level gets the president’s ear and gives him the populist view that 95 percent of what he hears from Wall Street is total B. S.,” said Rostad.  The agency’s delay “is the only way to change the [current] dynamic, otherwise it is a done deal” that the rule will be killed in late 2017 by Wall Street’s political pressure, he added. As required by the Administrative Procedure Act, federal officials must follow a complicated process when they are writing or replacing regulations. The new timeline set by the labor department means that the fiduciary rule regulation will operate from June until at least late in the year when the incoming Trump appointees at the department will have an opportunity to review and replace the regulation, said Rostad. The Department of Labor oversees retirement savings plans because the savings plans are often picked by employers. The rule has been criticized by major firms  —   such as Morgan Stanley, Wells Fargo, and Bank of America  —    but its most vigorous critics are small financial advice firms which are less able to shoulder the burden of increased regulatory costs.  Some critics of the rule say it may force smaller firms to back away from providing advice on covered retirement plans. Some of the biggest Wall Street firms, such as Goldman Sachs, would hardly be touched by the role because they do not do a lot of business with the type of retirement plans covered by the new rule.  The rule is opposed by the GOP. For example, no GOP legislators supported the fiduciary rule during an April 2016 House vote. “As someone who has spent decades in the financial services industry, I know the importance of providing all consumers —  regardless of income —  the opportunity to seek sound financial advice,” GOP Rep. French Hill said when the delay was announced this month. “The DOL’s Fiduciary Rule would greatly diminish access to professional retirement planning and guidance for those who need it the most. This is why a broad, bipartisan majority in Congress has called for the rule to be scrapped as written,” he said. The fiduciary regulation is strongly supported by Democrats, partly because it was developed and pushed by President Barack Obama’s top aides and other progressives.    consumer groups are trying to keep the rule alive, according to an article in Politico Pro.  Consumer advocacy groups on Wednesday launched a publicity campaign aimed at preserving the rule, including an event on Capitol Hill. It featured Warren, a Massachusetts Democrat, and Stephen Wingate, a retired Vietnam veteran who is trying to recover damages through arbitration from a broker who he alleges steered him into   illiquid investments.  “Had I known my broker was held to the same standard as a car salesman, I wouldn’t have trusted him so much,” Wingate said.  The AARP, which claims more than 37 million members, is also defending the fiduciary rule. “We look forward to continuing to advocate for the successful implementation of this rule so that advisers can no longer legally trick retirement savers into risky or   investment vehicles,” said Nancy LeaMond, the organization’s executive vice president.  But the rule also has support from some populists who want to help   Americans grow their retirement  . Brendan Maher, a plaintiff’s lawyer in L. A. for example, argued that the rule helps   retirees, according to the BNA news service. “The future of this rule is interesting, because whatever we believe about Trump, he ran on a platform of economic populism,” Maher said. “This is actually a fairly easy place for him to score some points. ” Because the fiduciary rule is aimed at helping “little guy consumers” in the face of controversial financial industry practices, it presents Trump with an opportunity to curry favor with those who support his more populist tendencies, Maher said. He was quick to add that he’s “not that optimistic” this scenario will play out. “I think the future of the rule depends on the political will of the Trump administration, which is less predictable than we might expect,” Maher said. Rostad says the rule is doomed because Wall Street has huge sway in Washington and with the GOP. Even the June date set by the agency officials won’t save the rule if the White Hosue wants it dead, he said. “The Department of Labor have set the stage for being able to come back in December and repeal the whole damn thing,” he said, adding that the Wall Street companies are being greedy in demanding the rule’s demise even before it comes into force. Because of Wall Street’s influence, including with Trump’s economic policy director, Gary Cohn, Rostad said. “The outcome of the process is 95 percent forgone conclusion  —   [and] the 5 percent variable is whether somebody in the White House gets a different type of [ ] command down to the Department of Labor. ”'"}, "time": 1742564298.91079}