{"duration": 0.033386945724487305, "input_args": {"text": "'Rep. Brad Sherman ( ) joined a fledgling effort to impeach President Donald Trump on Wednesday  —   even before former FBI director James Comey was set to testify on Capitol Hill on Thursday. [“The standard for ‘high crimes and misdemeanors’ has been met,” Sherman declared to reporters, according to The Hill. He did not explain, apparently, what crimes Trump had actually committed.  In fact, Sherman seemed to admit that the evidence against Trump was flimsy: “If articles of impeachment based on obstruction of justice were on the floor of the House today, they would not succeed,” he told The Hill. Nevertheless, he said, he planned to draft one article of impeachment to   a process that he said would accelerate over time. Sherman is working with Rep. Al Green ( ) who is also submitting articles of impeachment to the House. Another California Democrat who has led calls for Trump’s impeachment is Rep. Maxine Waters ( ). Waters was spotted in the business class section of a flight from Los Angeles to Dulles International Airport on Tuesday evening, but declined to be interviewed by Breitbart News. Last year, Sherman found himself in trouble after he appeared to endorse a coup attempt against Turkey’s President Recep Tayyip Erdogan. “Military takeover in Turkey will hopefully lead to real democracy  —   not Erdogan Authoritarianism,” he tweeted at the time. As the coup effort faltered, Sherman had to scramble to explain himself. Evidently, Sherman hopes his prospects for removing a president from power will be brighter this time. However, Comey is not expected to offer any evidence that Trump tried to obstruct justice. In fact, a written version of his prepared remarks indicates that Comey will corroborate Trump’s claim that he told the president he was not under FBI investigation. Comey is also expected to describe his discomfort with being asked for his “loyalty” by the president. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742564244.0453207}