{"duration": 0.11372494697570801, "input_args": {"text": "'Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nThe list of women sexually assaulted by Donald J. Trump just keeps growing — and a new cringe-inducing video from a 2011 corporate speech adds yet another . In the video, Trump not only sexually assaults, but humiliates, the 2004 Miss Universe winner on stage, in front of thousands. “She’s not very bright” \\nBoth candidates have had cringe-inducing moments this election cycle, but by-the-by, Clinton’s have been significantly less than Trump’s have and Trump’s have come in rapid succession of horrible moments; a parade of everything wrong with the masculine idea in the United States. A new video posted by the Huffington Post on Saturday added yet another horrible moment to the raft of them — a raft that, in any decent society, would have already sunk. \\nA few weeks ago, a tape of Donald Trump emerged into the popular conscious. The tape contained two things: Trump admitting that he sexually assaulted women and Trump using the word “pussy.” No points for guessing which one pissed off more of his evangelical supporters. Since then, a huge number of women have come forward and leveled accusations of sexual assault at Donald Trump. \\nMake no mistake, Trump is having his Bill Cosby moment right now. \\nAmong the list of accusations against Trump include claims that Trump told a group of 10-year-olds that he’d date them in 10 years, a telling a group of 14-year-olds he’d date them in a few years, groping women, sexually assaulting women, and we can’t forget that he’s been accused of raping a 13-year-old at a party hosted by infamous American financier and level three sex offender Jeffery Epstein (who served three months of an 18 month prison sentence for soliciting sex from an underage prostitute, because we don’t have a two-tier justice system at all in the United States). \\nThus, this new footage that shows Trump forcing 2004 Miss Universe winner Jennifer Hawkins into a nonconsensual kiss and then humiliating her on stage isn’t an aberration. It’s a continuation of the skeevy behavior that a huge number of men are not only okay with, not only think is normal, but believe is something that’s worth preserving and perpetuating instead of stamping out like an intellectual scabies infection. \\nThe video shows Trump calling Hawkins on stage to join him after telling the audience his philosophy of using revenge to succeed in business: “Get even with people,” he said. “If they screw you, screw them back 10 times as hard. I really believe that.” \\nThere are a few quotes from the Bible that are relevant here, but I’m pretty sure that Biblical literalists and right-wing evangelicals don’t know what those quotes are. They’re too busy agreeing with Trump. \\nTrump was apparently mad at Hawkins the day before because he thought she’d slighted him by declining to introduce him at an event in Sydney — Hawkins, it should be noted, is Australian. Once she was onstage with Trump, Hawkings laughed apologetically and said it was a “miscommunication with my management,” which left her, “[feeling] really bad.” \\nTrump seemed to accept this, saying: “When she found out, she got in her car and she got her ass over here, and I love her.” \\nSpray-tan Hitler has a well-known vindictive streak. He at least entertained the possibility of forming a PAC to sink the political careers of Ted Cruz — voted second most punchable face in the world after Trump superfan and Breitbart personality Milo Yiannopoulos — and John Kasich after the two of them refused to show up at the Republican national convention and kiss his ring. He’s threatened to use his power as president to arrest people he disagrees with. To say he’s vindictive may well be a British-level understatement (and if he’s elected, it’ll definitely be a British-level mistake). \\nThat vindictive streak is probably what led to the sequence of bizarre events that followed, culminating ultimately with Trump forcing a nonconsensual kiss on Hawkins. \\nFirst, he described how he would have embarrassed Hawkin if she’d really slighted him: “I was actually going to get up and tell you that Jennifer is a beautiful girl on the outside, but she’s not very bright. That wouldn’t have been true, but I would have said it anyway.” \\nTrump then made a sexual pun, and of course lingered on it until the audience got it or laughed out of awkwardness, I can’t be sure which: “And you know what? She came tonight, she came — came, she came, she came.” Once the audience laughed, Trump added: “See, so they have the same filthy minds in Australia.” \\nThen he grabbed her around the waist and forced a kiss on her. This is pretty much on par with what others have accused Trump of doing — according to Cathy Heller, who claims that Trump assaulted her at a Mother’s Day brunch at Mar-a-Lago : “He took my hand, and grabbed me, and went for the lips,” she claimed. Alarmed, she said she leaned backwards to avoid him and almost lost her balance. “And he said, ‘Oh, come on.’ He was strong. And he grabbed me and went for my mouth and went for my lips.” She turned her head, she claims, and Trump planted a kiss on the side of her mouth. “He kept me there for a little too long,” Heller said. “And then he just walked away.” \\nIf you feel like you need a shower after this, just remember: you probably have a relative who thinks voting for this man is a good idea. \\nPhoto by Ethan Miller/Getty Images Share this Article!'"}, "time": 1742562769.5731657}