{"duration": 0.17306017875671387, "input_args": {"text": "'Email \\nMore than half of the regimes sitting on the United Nations Human Rights Council after last week\\'s election have been categorized as unfree, sparking criticism and further ridicule of the global body ostensibly tasked with upholding the UN\\'s vision of human rights. Among the latest selections to serve on the discredited global council are some of the most oppressive and murderous communist and Islamist dictatorships on the planet. That is despite the UN outfit\\'s mandate saying that only member governments that “uphold the highest standards in the promotion and protection of human rights” are eligible to join. Adding to the controversy, the Obama administration and Western powers remained silent as UN member governments chose some of the most barbaric regimes on Earth to police “human rights” around the world. \\nOf course, the selection of ruthless totalitarians to the UN\\'s “human rights” bureaucracy is nothing new . It got so bad more than a decade ago that the brutal regime of late Libyan dictator Moammar Gadhafi was selected to lead the UN “Human Rights Commission.” After becoming a global laughingstock and discrediting the broader UN, the “commission” was formally disbanded, being replaced by the new and supposedly improved “council.” Like its predecessor, though, the UN Human Rights Council is now officially controlled by repressive, unelected governments. The UN\\'s pseudo-“human rights” apparatus is also led by an extremist Muslim prince who constantly attacks the United States, free speech, gun rights, and other fundamental freedoms , while meddling in Western elections and covering up real atrocities perpetrated by child-raping UN “peace” troops or dictatorial UN member governments. \\nThe latest list of selections for the UN body, chosen by UN member governments and tyrants, reads like a who\\'s who of totalitarian regimes. Among the communist dictatorships that cruised to victory at the UN council, for example, was the regime enslaving mainland China, which has murdered more people than any government in human history. Conservative estimates suggest that the Communist Party state in Beijing is responsible for killing between 60 million and 100 million victims, not including those slaughtered in forced abortions. Despite ongoing atrocities that include harvesting organs from political and religious prisoners, forced abortions to enforce population control, ruthless persecution of Christians, massive censorship, a lack of elections, and more, 180 UN member states decided the autocracy in Beijing was well suited for the important human-rights post. \\nAnother savage communist regime to secure a seat on the UN body is the Castro-led Stalinist dictatorship enslaving Cuba, which received support from 160 out of 193 UN member states. In addition to its history of mass-murder and savage persecution of dissidents, the military autocracy continues to export communist terrorism and tyranny around the world . Indeed, Obama actually launched his political career in the home of Castro-backed communist terrorist Bill Ayers , whose treasonous terror group bombed U.S. targets, murdered police officers, and, according to the FBI, plotted to intern and execute millions of counter-revolutionary Americans with help from foreign dictatorships. \\nHavana and Beijing both secured re-election, and will be sitting on the UN “human rights” body with a good number of their ideological allies in Asia, Latin America, and beyond. Among the communist and socialist regimes on the council are those ruling Bolivia, Vietnam, South Africa, Ecuador, El Salvador, what remains of imploding Venezuela, and many more. Ironically, around the time of the “elections” to the UN council, the brutal Nicolas Maduro regime in oil-rich Venezuela was sending its minions disguised as “Non-Governmental Organizations” (NGOs) to praise the socialist tyrant\\'s “human rights” record. At home, Maduro is busy jailing political opponents, massacring protesters, and trying to prevent food riots as starved Venezuelans wait hours in line to get the bare essentials of life. \\nAlso taking a spot on the Human Rights Council was the Islamist regime in Saudi Arabia, which beheads apostates, bans Christianity, flogs and executes dissidents, and supports radical Islamism around the world. Over 175 people, including children and disabled people, literally lost their heads in 2014 to the Saudi regime\\'s executioners, who typically use swords to behead those convicted of “apostasy” from Islam and other supposed crimes. Sometimes, following a public beheading, the severed head is tied to the decapitated corpse and displayed in public, tied to a post, as a “deterrent,” ISIS style. Others on the wrong side of the regime\\'s “justice” system can face public floggings, firing squads, the severing of hands, and other cruel and unusual punishments typically considered barbaric in civilized countries. The regime is also widely reported to use torture to extract confessions. \\nThe election of the Islamist Saudi Arabian regime, which has been criticized around the world, followed a successful but deeply controversial effort to have itself removed from a UN list of child killers for its ongoing killing and maiming of children in schools and hospitals in Yemen. It also drew outrage from watchdog groups, human-rights campaigners, and even pro-UN apparatchiks concerned that the UN was further discrediting itself on the world stage. “The UN\\'s election of Saudi Arabia as a world judge on human rights is like a town picking a pyromaniac to be the fire chief,” said Hillel Neuer, executive director of the non-profit watchdog group UN Watch. More than a few other Islamist regimes already sit on the UN body. \\nAccording to a statement by UN Watch, a full 53 percent of the governments now sitting on the UN “Human Rights Council” are what the organization referred to as “non-democracies.” And indeed, many of the worst serial human-rights abusers are among them. “The re-election of China, Cuba and Saudi Arabia — regimes which systematically violate the human rights of their citizens — casts a shadow upon the reputation of the United Nations,” continued Neuer, whose organization advocates reforming the system rather than shutting it down. Indeed, as the group has pointed out, the increasingly discredited UN body has instead focused its efforts on demonizing the State of Israel, which has been the target of more than half of all resolutions from the council aimed at a specific country. That is likely to continue. \\nUN Watch also expressed “disappointment” at what it described as the “deafening silence” from the Obama administration and the European powers that “deferred to dictators by refusing to speak out and campaign against them.” Neuer added that by remaining silent and turning a blind eye as dictators and human rights violators join and subvert the UN council, those governments “are complicit in the world body\\'s moral decline.” “When the UN helps gross abusers act as champions and global judges of human rights, it\\'s an insult to their political prisoners and their many other victims — and a defeat for the global cause of human rights,” he concluded. “When the UN\\'s highest human rights body becomes a case of the foxes guarding the henhouse, the world\\'s victims suffer.” \\nOther governments and dictatorships with troubling records selected in the latest process included those ruling Egypt, Rwanda, South Africa, Tunisia, Iraq, Brazil, and Guatemala. Many of those governments have come under fire for abuses. The increasingly extremist regime in South Africa, for example, is led by Jacob Zuma, who has been caught singing songs advocating genocide against vulnerable minorities on national television . They will be joining the oppressive regimes ruling Algeria, Burundi, Congo, Ivory Coast, Ethiopia, Kyrgyzstan, Maldives, Namibia, Morocco, Qatar, Viet Nam, and more. Vladimir Putin\\'s controversial Russian government was defeated by a razor thin margin, with the governments of Croatia and Hungary selected from the Eastern European grouping instead. \\nEven the neoconservative internationalist George W. Bush boycotted the dictator-dominated UN outfit that legitimizes gross human rights abusers and tyranny. The Obama administration, though, decided to re-join, and has now been selected as a member of the council, perhaps imagining that it can tie the hands of a potential President Trump. “U.S. engagement has helped transform the Council into a more balanced and credible organization and has helped focus the global spotlight on grave violations and abuses of human rights around the world,” claimed Obama\\'s controversial Secretary of State John Kerry. Among the alleged “achievements” celebrated by Kerry was the UN body\\'s unleashing of a radical homosexuality and gender-confusion czar to bully governments and dictators worldwide into submission to the so-called “LGBT” agenda . \\nMany critics who have ridiculed and blasted the UN Human Rights Council have argued that it can be “reformed.” But despite all of the recommendations for “reforming” the UN body, the problems with it and the broader UN are in reality systemic. To begin with, consider the UN\\'s own “Universal Declaration of Human Rights ,” which outlines what the UN misleadingly characterizes as the “rights” of human beings. While the document offers lip service to various liberties, it is based on several premises that make it fundamentally incompatible with unalienable, God-given rights as understood in the United States — individual rights that the American Declaration of Independence says government is actually instituted to protect. \\nConsider Article 29 of the UN declaration, for starters, which claims that “rights” can be limited “by law” under the guise of everything from “public order” to “the general welfare.” Separately, the same article claims that everyone has “duties to the community” and that “rights and freedoms” may “in no case be exercised contrary to the purposes and principles of the United Nations.” For perspective, that would be like the First Amendment saying Congress shall make no law abridging the freedom of speech, unless Congress dislikes the speech. The UN declaration also assumes “rights” are bestowed by governments and treaties, whereas American traditions and jurisprudence are based on the idea that rights come from the Creator alone, and that governments exist merely to protect them. \\nSeen in that light, suddenly the UN\\'s bizarre and increasingly frequent rants citing \"human rights\" to argue against free speech, due process , educational freedom , parental rights , gun rights , the right to life , and so on make much more sense. Indeed, the UN\\'s vision of “human rights” is entirely contradictory to real God-given rights . The two visions are incompatible. The only solution for Americans who value real rights and freedoms, then, is to ditch the UN and its extremist agenda in favor of the U.S. Constitution and the pre-existing rights it enshrines. Legislation to secure an American exit (or Amexit) from the UN , the American Sovereignty Restoration Act , is already in Congress. All that is required now is more public pressure. And as the UN becomes increasingly extreme — even electing the world\\'s most brutal dictatorships to its “human rights” outfit — the pressure will almost certainly continue to build. Photo: UN Human Rights Council in Geneva \\nAlex Newman, a foreign correspondent for The New American , is normally based in Europe. Follow him on Twitter @ALEXNEWMAN_JOU . He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. \\nRelated articles:'"}, "time": 1742562265.2562978}