{"duration": 0.10410523414611816, "input_args": {"text": "'The Hill – by Don Rosenburg \\nI always cared about the immigration issue, even before my son was killed. As a 30-year resident of southern California, I’d been noticing for years the extent to which concrete and sprawl was swallowing up the natural environs of my corner of the state. Of all states, I always thought, why is it the one that’s most beautiful and with the most arable and productive land that’s being torn up and paved over. And just how much traffic and gridlock are people willing to take, I would think to myself. Then my son, in his second year of law school, was run over three times and killed by an illegal-alien driver. That’s when I became an immigration-control activist and that’s why I can’t support Hillary Clinton , the open-borders candidate for president. \\nAnd that’s why I’ve just filed two lawsuits; one against the Department of Homeland Security and one against the Justice Department. With the help of the Immigration Reform Law Institute (IRLI), I’m pursuing a complaint against DHS for refusing to consider the environmental impacts of its mass immigration policies, a gross violation of environmental law we argue. Under the National Environmental Policy Act (NEPA), all federal agencies must take a “hard look” at every “major action” they commit to and produce for the public an environmental assessment which a) explores all potential impacts of the action, and b) considers all possible alternatives. Since the law was enacted in 1970, California’s population has doubled from 20 to 40 million and DHS (including its predecessor, Immigration and Naturalization Services), has never published a single report exploring the possible impacts associated with its immigration policies. As we argue in our brief, if the public knew the effects of runaway population growth maybe they would have rallied that much harder for tougher enforcement and lower immigration-levels. Having ignored their obligations under the statute for so long, this could be one the biggest environmental law violations ever committed in the nation’s history. \\nDHS, I must add, does write some NEPA reports. For instance, it calculates the impacts caused by its illegal-alien detainment facilities, just not for the people detained inside them then released to the public. This has to be done, we argue. America’s environmental footprint is gargantuan, the biggest in the world only next to dictatorial China. The American public’s constantly harangued that so-called “Dreamers”, that insufferably inane term, simply want an American standard of living and a piece of the American pie. But as I used to tell my son as a child, ‘wanting’ is different than ‘needing.’ America is a mere 5 percent of the world’s population, yet it consumes 20 percent of its petroleum. So every time a legal or illegal alien comes into the country and settles, the level of greenhouse gases in the world goes up just a little bit more. As for urban sprawl, between 1980 and 2000 America paved over a piece of land (much of it arable) that was around the size of Illinois . But does the correlation between population growth and environmental impact, a simple logical connection your average 3rd -grader could grasp, ever get even a moment’s discussion in the major media? For the future of our kids, it must. \\nSame goes for illegal alien-crime. Routinely, we’re told there’s a “ scholarly consensus ” that illegal aliens commit fewer criminal offenses than citizens. As if this could be supportable. Most illegal aliens are absolutely skill-less and skill-less people commit far more crime on average—Never mind for now the labor markets-argument that the last thing our increasingly knowledge-based and roboticized economy needs is more skill-less workers. And nothing, of course, is stopping criminals on the run in Mexico from simply relocating here, out of the policia ’s reach. \\nIn any case, we know anyway that illegal alien-crime is a Rumsfeldian “known unknown”, as DOJ apparently doesn’t even bother to tally this information–My son’s death was counted as having been killed by a citizen with a driver’s license. At least for the public, that is. And that’s why IRLI and I are suing them as well. The agency has refused to comply with our requests for records on this issue. Why they can’t divulge to the American public these sorts of facts is telling in itself. After all, the Justice Department can tell me how many pick-pocketing crimes there were last year but not how many people were killed by illegal aliens. Not that this should matter in the debate over illegal immigration. Since they shouldn’t have been here in the first place, any crime an illegal alien commits against our own, like the killing of my boy, is a special tragedy. A nightmare that will occur again and again if Hillary Clinton takes the White House. \\nDon Rosenberg is the founder of advocacy group Unlicensed to Kill and lives in Los Angeles County.'"}, "time": 1742562040.0379121}