{"duration": 0.08527135848999023, "input_args": {"text": "'Former CIA operative and 2016   presidential candidate Evan McMullin took to Twitter and CNN on Wednesday to defend rogue intelligence agents who break the law to leak classified information, saying President Donald Trump “presents a threat to the country. ”[In response to President Trump’s tweets earlier Wednesday, in which he alleged that elements of the Federal Bureau of Investigation and National Security Agency were engaged in “Russia”  political operations, McMullin tweeted:  By oath, intelligence officials’ first duty is to “defend the Constitution of the United States against all enemies, foreign and domestic.. ” https:  .   —   Evan McMullin (@Evan_McMullin) February 15, 2017,  So, the real scandal isn’t that the President of the United States of America appears to have been   by America’s greatest adversary? https:  .   —   Evan McMullin (@Evan_McMullin) February 15, 2017,  The obvious implication was that McMullin believes that intelligence and law enforcement agents are entitled to break the law based on their own views that the President of the United States is a threat to the Constitution and in cahoots with Russia. Mcmullen reiterated his views on CNN, where he purported to speak for the concern of the agents doing the leaking: “I’ll tell you what their concerns are. There concerns are that Donald Trump presents a threat to the country because of his  —   what they see as his relationship with Vladimir Putin and the relationship of his team to other Russian intelligence officers. ” McMullin cited a New York Times report indicating that Trump campaign aides had contact with Russian intelligence  —   without also noting that the same report indicated there was “no evidence” that the “Trump campaign was colluding with the Russians on the hacking or other efforts to influence the election. ” He went on to make the very claim denied by the Times article, telling Baldwin Trump “ran a campaign that was assisted by a foreign adversary  —   our greatest foreign adversary. ” Pressed by host Brooke Baldwin as to whether there were “too many leaks,” McMullin said that intelligence officers were bound by an oath to defend the country and the Constitution against “domestic and foreign enemies. ” That included “a security threat coming from the White House. ” An obviously sympathetic Baldwin then asked McMullin: “Are any of these people you’re talking to just even worried about him even getting intel briefings, period?” McMullin said that they are  —   and seemed to admit, in the process, that he is speaking with intelligence officials who may be leaking information. During the presidential campaign, McMullin was a leader in the “NeverTrump” movement, consisting of conservatives who rejected Trump as the Republican Party nominee. Though he hoped to flip Utah, among a few other states, to Hillary Clinton by relegating Trump to third place, Trump won in that state and elsewhere. On Tuesday, Weekly Standard    Bill Kristol expressed similar sentiments, and appeared, in theory, to endorse a coup by the “deep state” against the “Trump state. ” Obviously strongly prefer normal democratic and constitutional politics. But if it comes to it, prefer the deep state to the Trump state.  —   Bill Kristol (@BillKristol) February 14, 2017,  Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742561982.629961}