{"duration": 0.03173685073852539, "input_args": {"text": "'Speaking at the Valdai International Discussion Club in Sochi on Thursday, Putin said Russian patience has limits. “We(‘ve) show(n) restraint so far and (haven’t) respond(ed) to our partners (sic) in the same gauche manner, but everything has its limits. We can do it,” he explained. So what is he waiting for, given endless US provocations, refusing mutual cooperation on vital issues, rejecting normal relations, heading inevitably for war unless challenged and stopped. He’s not stupid or uninformed. Russia’s intelligence capability likely matches America’s, so he knows what it’s up to in Eastern Europe, Syria, elsewhere in the Middle East, along with virtually everywhere else. Pretending both countries are “partners” defies logic. Thinking mutual cooperation with Washington is possible one day is like waiting for Godot. And things may get exponentially worse once Hillary succeeds Obama, a virtual certainty at this point by fair or foul means – likely the latter, election theft a longstanding US tradition, showing democracy in America is pure fantasy. On Thursday, screaming deceptive Western headlines outrageously blamed Russia and Syria for bombing a Syrian school in Idlib province. It was a hoax. No bombing occurred. US-supported terrorists attacked the school, killing at least six children, injuring many others. An exclusive RT International investigation determined that “a gas canister and a mine landed in a classroom in Hadaiq al-Andalus” – projectiles launched from terrorist-controlled eastern Aleppo. Yet media scoundrels irresponsibly blamed Russia and Syria – while ignoring daily eastern Aleppo shelling, US supported terrorists killing and injuring civilians in government controlled parts of the city. Long before Internet access to important information from reliable independent sources, famed humorist/social commentator Will Rogers once said: “All I know is just what I read in the papers, and that’s an alibi for my ignorance.” Reporting then was deplorable. Today it’s beyond the pale. It’s hard imagining why anyone wastes time and money on pure rubbish – or believes television news is credible. Media misinformation proliferates. Readers, viewers and listeners are systematically lied to. Daily fare isn’t fit to print or broadcast. Mainstream editors, reporters and commentators are a virtual Noah’s Ark of scam artists. On Thursday, Russian Defense Ministry spokesman General Igor Konashenkov called video footage of the Idlib incident shown on Western television fake – “more than ten edited fragments assembled together,” he explained. No Russian or Syrian warplanes were in the area when the attack occurred. No bomb craters existed. Damage to the school was inconsistent to a bombing. Only one wall was damaged, not the ceiling, desks or chairs. Had a bombing occurred, the blast would have destroyed or severely damaged the building. Furniture inside would have been “swept away.” “As one can see on a photo from the Russian drone, the roof of the school is not damaged and there are no bomb craters in the area adjacent to the school,” Konashenkov explained. A US drone in the area at the time of the attack has the same footage. Yet Washington concealed what should have been revealed straightaway to set the record straight. “UNICEF leadership fell…victim to a new deception of swindlers and (Al Qaeda-affiliated) White Helmets,” said Konashenkov. Washington perhaps orchestrated what happened, part of its sinister anti-Russia/anti-Syria agenda. Submit your review'"}, "time": 1742628466.4523728}