{"duration": 0.07904243469238281, "input_args": {"text": "'Foreign Policy Scotland\\'s Secretary of State David Mundell (Photo by AFP) \\nScottish Secretary of State David Mundell has warned about the consequences of the UK’s withdrawal from the European Union (EU), saying Brexit would cut access to the single market. \\nMundell told members of the Scottish Parliament on Thursday that neither Scotland nor any other part of the UK was going to get a “special deal” during the negotiations with the EU. \\n\"So there are very specific issues to specific industries, but there won\\'t be special deals and it\\'s absolutely wrong to characterize a suggestion that certain areas of the country will get a special deal and Scotland will not,” he said. \\n“I accept on one level, if we are leaving the EU then essentially we are leaving the single market but access to the single market can, I think, continue in a way that doesn\\'t involve tariffs or barriers,” the secretary continued. \\nBritish and Scottish officials have long been engaged in a war of words over the Brexit process, with Scotland asking for an “equal” role in the negotiations. \\nDuring an EU referendum on June 23, Scotland voted 62 percent to 38 percent to remain in the 28-member bloc, but Britons voted to leave, 52 percent to 48 percent. \\nBritish Prime Minister Theresa May has made it clear that she will complete the Brexit process by 2019 and that Scotland holds no veto over it. \\nScotland, in response, has threatened to secede from the UK in order to preserve its EU membership, which in turn guarantees the nation’s access to the EU single market. \\nLast year, Scotland’s first attempt for independence from the UK was blocked by voters in a referendum. \\nMundell told MSPs that the possibility of a second referendum was already harming Scottish businesses, even more than Brexit. \\n“It is already evident, because I understand that the surveyors organization have said there is a drop off in the take up of commercial property in Scotland,” he said. \\nExperts warn that in case of a hard Brexit, the UK may lose its preferential access to the EU\\'s single market and suffer from soured relations with other EU members. Loading ... '"}, "time": 1742628318.7072387}