{"duration": 0.1598215103149414, "input_args": {"text": "'LOS ANGELES  —   To understand how Andrew Garfield successfully made the leap from   to holy man, it’s helpful to know that when he was 8, his hero was Mahatma Gandhi. And that one of his life goals at the time was to seek out the schoolyard bully and envelop him in a warm embrace. “He was a brilliant terror, kind of like a ” Mr. Garfield recalled during an interview one warm night in the fall. “My first impulse was to give him a hug and a kiss and tell him he was all right, and that he didn’t have to behave that way. ” He paused, a few moments later adding, “Of course, I became his main target, because I saw him so deeply. ” After a few hours of conversation with Mr. Garfield about, among other things, celebrity toxicity, spiritual steadfastness, authentic living and God, it was evident that Mr. Garfield sees many things deeply. This attribute was integral to his landing starring roles in two meaty movies that are receiving awards attention this season. The first is Mel Gibson’s “Hacksaw Ridge,” about Desmond T. Doss, a   World War II hero, a   Adventist and conscientious objector who refused to carry weaponry the part has landed Mr. Garfield his second Golden Globe nomination. The other is Martin Scorsese’s   “Silence,” in which Mr. Garfield plays a   Jesuit priest, Sebastien Rodrigues, on a mission in hostile Japan. Both directors said Mr. Garfield possessed a moral conviction necessary for playing their protagonists, each of whom happen to be devout and forced to face down Japanese antagonists. Mr. Garfield, who is 33, said he could not have done “Hacksaw” were it not for the intensive preparation he underwent for “Silence. ” For the Scorsese film, which was produced first but released second, he spent a year under the tutelage of the Jesuit priest and author Father James Martin, praying, fasting, using a small rented West Village apartment as a   retreat and undergoing rigorous spiritual exercises. “I got not only a theological education, but a deep spiritually transformative experience,” Mr. Garfield said, his brown eyes blazing with the intensity of a tractor beam. Lithe and nimble  —   not for nothing was he    —   and as finely tuned as a whippet, Mr. Garfield came across as a friendly, engaged presence, with a crackling intelligence that Mr. Gibson described as “through the roof. ” “There’s something about fasting, about being empty enough to allow the spirit in, to hear and to listen and to be guided,” Mr. Garfield said. “To be with that silent void, that chaos in ourselves, that’s what the character goes through. He gets the most profound bliss and joy because he hangs in there with the void, with the seeming darkness. ” Mr. Garfield met to chat at the Sunset Marquis in West Hollywood, a spot arranged by his publicist even though Mr. Garfield was staying on the city’s east side he was in production for the coming noir thriller “Under the Silver Lake. ” The Marquis is deluxe  —   “through the breezeway and over the koi bridge” were a clerk’s directions to the restaurant  —   and couldn’t have been farther from the spartan surroundings Mr. Garfield put himself in to prepare for “Silence. ” That spiritual work, in turn, seems to have left Mr. Garfield ever more at odds with the Hollywood culture he has resisted even as his star has steadily risen. The night before, he’d attended the Governors Awards, the Academy of Motion Picture Arts and Sciences’ annual   gala. While Mr. Garfield said he marveled at the screened montages of the night’s honorary award winners, he was painfully aware of the constant inflation and deflation of egos, including his own. “It’s a really sick old Hollywood kind of patriarchal value system, based on commerce and money and who’s the hottest and who’s going to bring in the big bucks,” he said. “I’m not saying that an organization like the academy doesn’t acknowledge and honor talent it’s evident they do. But it coexists with the commerce aspect. Sometimes I feel the tail is wagging the dog. And I struggle with that. ” Of course, the reason Mr. Garfield is getting such plum parts is because he is ascending that hierarchy, despite himself. Born in Los Angeles to an English mum and an American father, Mr. Garfield was raised from toddlerhood in Surrey, England. His family was a loving one, he said, and his father was Jewish and resisted the notion that any one people were chosen. Mr. Garfield began acting as a child, working his way up from the theater to British television and then feature films. He came to international attention in 2010 for his lauded performances in “Never Let Me Go” and “The Social Network. ” But it was his casting as   for “The Amazing  ” (2012) and subsequent romance with his   Emma Stone, that catapulted him to a wider fame, which he knew was coming and dreaded when he took the Peter Parker role.   had always been Mr. Garfield’s favorite superhero, and he said he adored the character and couldn’t say no, even though being in such a spotlight made him cringe. “If I could have kept the mask on the whole time, it would have been better, because I don’t have interest in being known for a character,” Mr. Garfield said of his time as Spidey (he also starred in the 2014 sequel). “I have no interest in being known as a celebrity celebrity is a pretty disgusting word. It’s part of the brainwashing of the culture, part of the false idolatry of those that are only human, and I don’t want to participate in that. ” The paparazzi had other ideas, which Mr. Garfield pushed back against. When photographers caught him strolling New York’s streets with Ms. Stone, the pair hid their faces behind handwritten signs directing readers to charity websites. In 2015, when it was announced that another actor would be playing   Mr. Garfield found himself relieved: He wanted to continue working on himself as an actor, which isn’t easy in a franchise. “It’s a moneymaking exercise, and I don’t know if I’m criticizing that,” he said. “I’m trying not to judge that, all I knew is that I found it very painful to be a part of in that regard. ” But he had already been spreading his wings. In 2012, Mr. Garfield earned a Tony nomination for his performance as Biff in Broadway’s “Death of a Salesman,” starring Philip Seymour Hoffman and directed by Mike Nichols. Mr. Nichols became one of Mr. Garfield’s dearest mentors, and his death, along with Mr. Hoffman’s in 2014  —   “I’m so lucky I got to brush my soul against him every night,” Mr. Garfield said  —   left him lastingly bereft. The performance was recommended to Mr. Scorsese, who was finally getting a passion project three decades in the making off the ground. In 2013, while Mr. Garfield was in the middle of “The Amazing   2,” he found himself in Mr. Scorsese’s Upper West Side offices for an audition that would last three hours, and leave the director thrilled. “I felt the film come alive at that point,” Mr. Scorsese wrote in an email. “Andrew let me know right away that he had to go deep into the role and that it had to take time  —   he had to live it. ” This would involve intensive work with Father Martin, who, despite his initial wariness, ended up guiding Mr. Garfield through St. Ignatius Loyola’s Spiritual Exercises, which often mark the summit of a spiritual journey. “God drew him into the exercises immediately,” Father Martin said. “At one point, Marty said: ‘I’m sorry you won’t be with me in Taiwan. We won’t have an expert in Jesuit spirituality with us.’ And I said, ‘Yes, you will, you’ll have Andrew. ’” The production was in 2015, and shortly after Mr. Garfield returned, he read the script for “Hacksaw Ridge. ” It was positioned as a comeback for Mr. Gibson, who had been disgraced a decade earlier for drunkenly spewing   epithets. Mr. Garfield said he read the script, wept  —   Mr. Doss had   rescued 75 men from a brutal battleground in Japan  —   and that any hesitation he might have had vanished after he asked Mr. Gibson about the controversy  . “We talked about everything, all about that period in his life, and the years since, and his sobriety, and the work he’s done and the healing he’s done within himself, and those others that he consulted and hurt,” Mr. Garfield said. “He’s a very loving man, a crazy loyal man, sensitive and caretaking, and he’s not drinking, and it’s a really beautiful, beautiful thing. ” As for Mr. Gibson, he said Mr. Garfield filled every hope he had. “The pump was primed,” Mr. Gibson said over the phone. “This character needed to be profound down to the bootstraps of his soul. ” After a few months’ breather once filming wrapped, Mr. Garfield quickly went back to work and he’s also starring this year in a revival of “Angels in America” in the West End. But his very immediate future is being dictated by awards  —   his work in “Hacksaw” also landed a Screen Actors Guild award, and the Golden Globes are Sunday, Jan. 8  —   meaning he’ll be back on red carpets, schmoozing again, a reluctant cog in the Hollywood machine.'"}, "time": 1742562265.7622008}