{"duration": 1.6912882328033447, "input_args": {"text": "'Leave a reply Tom Kenyon \\nThe Hathors – Although it may seem paradoxical to some, your timeline—your life—is only one of many simultaneous possibilities. And it is quite possible, indeed it is your birthright, to alter your timeline and the potentials of your life. \\nYour culture, for various reasons, has hypnotized you into believing that you are limited to one timeline. In this message we shall endeavor to discuss our understanding of timelines and how you can change them. \\nWhenever there is an increase of chaotic events, there is a convergence of multiple timelines. Due to the fact that your planet has entered a Chaotic Node and is experiencing ever-increasing levels of chaos, there is also an increase in what we call time nodes . \\nTime nodes occur when two or more timelines converge. As a result of their close proximity oscillation effects sometimes occur when the realities of one timeline bleed through , or are psychically perceived by those on a neighboring timeline. Strong timelines can also literally affect the possibilities and/or probabilities of other timelines within a time node. In other words, creative and novel effects often occur within timelines when they enter a time node (proximity to other timelines). \\nThese are evolutionary jumpstarts that hold tremendous possibility for accelerated evolution if you understand how to utilize them. As a result of the volatile nature of events on your planet, there are multiple time nodes emerging. This is a very complicated and complex affair, and we shall endeavor to break it down into its smallest segments, for we believe that this information has vital significance for those of you engaged in the ascension process, and for its sheer survival value. Let us turn our attention to the larger picture first and then to the individual strategies we suggest. Background \\nYour planet is poised on the brink of utter transformation. The form of this transformation has multiple expressions, and it is you—the collective—that will affect these outcomes to a greater or lesser degree. \\nSome of these outcomes, these possibilities, fulfill the prophecies of planetary destruction and purification. Other timelines, other expressions, reveal a different outcome. A sudden unexpected shift in human consciousness could bring the Controllers , who have so negatively affected your destiny, to their knees. And there are hundreds of other possible timelines between these two polarities. There are vested interests in your society who wish you to remain hypnotized, which wish for you to continue in the delusion that you are limited to one timeline, one experience of life as they so deem it. \\nBut you have, within your nature, the ability to change timelines and probabilities at the last moment of any event—whether it be personal or collective. We do not say this to be “positive.” We say this as a matter of fact concerning your evolutionary potential. Whether you will collectively reach this potential or not remains to be seen, but the path of an Initiate is to reach upward for the highest potential, regardless of what may or may not be happening around him or her. Thus, in this message we shall discuss what you can do, and how you do it. \\nFrom our perspective, your collective destiny is the summation of individual choices that you, as persons, make. This is combined with evolutionary and terrestrial forces that are far beyond your and your fellow humans’ abilities to control. This collection of forces also involves cosmic patterns of energy and intentionality from areas of the cosmos beyond your local solar system, for you are a part of a complex cosmic matrix that is your universe. \\nIf we were to use a metaphor, we would say that you, as humanity, are on a great ocean vessel. But many of you are asleep, and there is someone at the helm directing this vessel that should not be there. For many historical and trans-historical reasons, which we won’t go into here, various beings have commandeered your ship. \\nBut, ah, how the tides are turning. More and more of you are waking up, though some, still half-asleep, stagger across the deck as they watch the tempestuous storm of their world changing before them. The Controllers know that many of you are waking up—too many for their comfort. \\nIt is, indeed, an interesting time to be alive! \\nThe current ecological situation in the Gulf is one example of multiple timelines. In spite of your media’s grand attempt to dismiss the situation, many are sensing how dire the situation is, and indeed, there are complications in the Gulf region that are beneath the surface, both literally and figuratively. \\nIn our previous message we addressed several possible timelines for this event. Which of these possible timelines will unfold into your three-dimensional reality is not written in mud or concrete, but is a changeable event or outcome. In this message we wish to discuss how you, the individual, can jump a timeline into a different destiny at a moment’s notice. This can be extrapolated to your civilization also jumping timelines, but that is a topic for another time. \\nFor the moment we wish to turn our attention to you, the individual human and how you can jump from a disastrous timeline—from an outcome you do not wish—to something more benevolent, life-friendly, and full of evolutionary potential. \\nFor the record, there are technological means to jump timelines, but our information here deals with human consciousness, and how you, through the power of your own awareness and intention, can jump timelines. For this endeavor, you already possess two of the greatest treasures in your very own nature— your sovereign will (to make choices) and your capacity to feel . These two, when combined properly will allow you to jump timelines as you so desire, as co-creators of your reality rather than being mere pawns on a chessboard. The Fundamental Principle \\nThe fundamental principle, for jumping timelines, involves the coordination of a few significant fields of intentionality. 1) You identify the timeline you wish to move into. 2) You shift your vibrational state to match the timeline. 3) You lock in the vibrational state so it does not waver. 4) You take an action that is an expression of the new timeline. 5) Persevere. \\nIn this fifth stage, you must hold the vibrational state of the new timeline you have chosen, making choices coherent with the new timeline and persevering with this despite sensory information to the contrary. \\nThis last phase of perseverance is important, because your current timeline is an accumulation of your beliefs and intentions. Depending upon the strength of these beliefs and intentions, you may have to accumulate a vast amount of energy in order to overcome the set pattern of your life. \\nThe information we are sharing can be used to address any timeline or expression in your life, down to the most mundane situation. In this message however, we will be addressing this methodology for jumping timelines in regards to the ascension process and how you can move into timelines different than the timeline of the culture you are currently residing in. \\nThis is, for some, a revolutionary idea; but for us it is simply a truth about your nature. You are creator gods and goddesses, and this information we are sharing is simply your birthright. We offer it to you at this time with the anticipation and hope that many of you will jump timelines and tilt the keel of the ship you are upon and take the vessel into safe and prosperous waters. \\nEnough of the metaphors now, let us get to the nuts and bolts of how you jump timelines. Ascension \\nThe ascension process, from our perspective, involves the energizing of your second body, your KA, and its elevation in vibration so that it emits more light, eventually becoming the SAHU, the Immortal Energy Body. There are many ways to raise the vibration of one’s KA. Most of your spiritual traditions have their own methods for raising your vibration, unfortunately, many of them are also riddled with dogma, taboos, and quite honestly, interference patterns from thought-forms placed by those who did not and do not desire your freedom, but who profit by your imprisonment. \\nAnd, yes, it is sad to say that some of your spiritual traditions—and especially your religions—are insidious traps, and if you are to rise upward in the ascension of your own being, you must separate truth from falsehood. Only you can undertake this task, for it is one of the necessities of mastery. This is a line in the sand of consciousness itself for those who have chosen the ascension of their own being. They become masters of truth and do not step aside from ferreting out falsehood from reality. They are not slaves to dogma. They bow to no one but their own divinity. \\nFrom an energetic standpoint, the ascension process begins when your life force, called Sekhem by the ancient Egyptians, begins its ascent up the Djed, or sacred pathway of the chakras. This is ascension in its simplest form. It is the expansion of consciousness and awareness. As your life force enters your higher brain centers and as your KA body becomes energized, you enter another phase of ascension. At this phase, you begin to metabolize light itself. By light we refer to spiritual light, a light that exists in the spiritual realms. This light feeds the KA body and increases its vibration. When the KA body reaches a certain amplitude, or strength of vibration, without wavering, it ignites with a type of etheric fire, turning it into the SAHU, or Immortal Energy Body. This could be viewed as one of the final stages of this particular form of ascension. But what we wish to make very clear is that any movement upward in consciousness and movement of life force up the djed, regardless of the method used, is part of the ascension process. \\nWe wish now to discuss some basic concepts and training strategies that will impart a basic method for jumping timelines. We will then turn our attention to how you can create a new probability for yourself, even in the midst of what appears to be great difficulty. And most importantly, we will explore a significant evolutionary opportunity that exists within your current time node. \\nOne of the first tasks facing you if you are to jump into a different timeline is the transcendence of fear. Most humans fear the unknown, but there is a much more insidious element involved here. The Controllers, those who wish to control your destiny and profit by it, are masters of the projection of fear and they are using vast resources of mind control and hypnosis through the media to convince the masses that there is much to fear. And while there is, quite frankly, some truth to there being reasons for fear, the higher truth is not being revealed. \\nThe higher truth, as we view it, is your capacity to change your reality, your innate ability to use the two treasures of your sovereign will and your capacity to feel as a means to navigate into new timelines. Let us be specific here. \\nAs we mentioned earlier, the type of ascension we are speaking about begins with the simple movement of your life force up the djed, or spine, into your higher brain centers. As this takes place, the energy wheels within your KA body, called chakras , become activated in new ways. This opens windows of new possibilities, and new insights, new forms of inspiration and creativity blossom. But if consciousness is locked into fear, it becomes imprisoned by the lower centers, the impulses for survival, sex, and power. \\nFor various historical and trans-historical reasons, as we alluded to earlier, there has been and continues to be, a collusion to keep humanity locked into the lower centers, to perpetuate fear as a means to control destiny. Thus for any master who chooses the upward path, one of the first hurdles to pass through is the Valley of Fear —the projected thought forms of one’s culture. You must then pass through the portals of limitation that would confine you, to recognize the lies that have been perpetuated, even by some of your most sacred religions. \\nBut let us say that you have the courage and fortitude to undertake such a passage, and let us say, for the sake of example, that the timeline you wish to live in is one of benevolence: loving kindness. Here is how you would do this, remembering that the same principal applies to any timeline you wish to create for yourself. Preparation and Training \\nThe first step is to identify the timeline you wish to create, that you wish to live in. In this case it is a timeline of loving kindness. The second step is to move into the vibrational state that matches the timeline. In this case, it is the feeling state of loving kindness , so you would, yourself, reside in this state as much as you are capable of. By this we mean you would exhibit loving kindness to others and to yourself. \\nThe third step is locking in the vibrational field, so it does not waver. This is an important aspect of jumping timelines because the old vibrational state has a life of its own. Just because you have chosen to create a new timeline and have stepped into a vibrational state that matches the timeline, is not a guarantee that the timeline will manifest or continue. You must lock the vibrational field in place, for this is what sustains your access to the new timeline. \\nThe first two steps involve your sovereign will. You choose a timeline you want to experience. You choose a vibrational state that matches the timeline. And in the third step—locking in the vibrational state—you use the second treasure of your nature: your capacity to feel. \\nBy feeling the vibrational state you wish to be in, you amplify it; you strengthen it. And if you also include a coherent emotional state such as appreciation or gratitude for the vibrational reality, you will hasten its birth. \\nThis simple act of appreciating, or feeling gratitude, for the new timeline catalyzes its reality in ways that boggle the mind. So it is that the two treasures of your nature are joined together in these three steps. The next step requires your sovereign will again. You must persevere, to hold the vision of the new timeline and the vibrational state, regardless of what your senses are telling you. This is the passage where many fail. \\nThe manifesting of a new timeline into your three-dimensional reality requires accumulated energy. If you persist in holding the vision of the new timeline, with the vibrational field (or feeling of it), along with gratitude for it already existing, you will accumulate energy. \\nThe task here is to be true to your vision while paying attention to what the current reality is showing you. It is not about pretending. It is about facing reality as it presents itself to you while simultaneously holding a higher vision . In other words, you deal with the reality of your life while simultaneously holding the vision of a different life. This is the art. \\nUsing our example, if you desire to create a life with more loving kindness, you would move into that vibrational state by exhibiting loving kindness to others. If you were able to also feel gratitude for this vibrational state, it would accelerate the creation of the new timeline. \\nIn reality, there will be a period when you will recognize that not everyone is capable of loving kindness, nor of receiving it for that matter. Your vision will then be refined by the realities of life, and this maturation of your consciousness will take place naturally, as you deal with the realities of your current timeline along with the emergence of your new timeline. \\nOne result from this way of proceeding is that you will become a master of loving kindness and a master in dealing with those who cannot express such vibrational states. Eventually you will experience a life of more loving kindness, where more people express that quality to you and you to them. And when you encounter someone unable to express this quality, you will be more able to deal with him or her without losing this quality in yourself. \\nThus would you seed the new timeline and new reality for yourself. \\nLet us now return to the collective timeline. \\nAs we said earlier time nodes are juncture points where multiple timelines converge, and you can jump from one to the other if you understand how it is done. We just explained the basic principal as it applies to individual timelines. Now let’s discuss how you can jump to a different timeline than that of any given collective. \\nAs paradoxical as it may seem it is quite possible to live a separate timeline, having a different experience of life than those around you. \\nLet us say that again another way. It is possible to live in heaven while others are living in torment. At the deepest levels of consciousness it is simply a matter of choice. \\nWe do recognize that you have been, and are continuing to be, manipulated by forces that desire to keep you imprisoned. But our choice in this communication is to give you keys to jump out of that imprisonment, not dwelling on the history of it, or the identities of those involved. For, in truth, the true Controllers are unseen by you. They are the Puppet Masters . \\nAs chaotic events escalate you will have many opportunities to jump timelines. Our suggestion is to remember the steps we discussed earlier. You might experiment with this method by choosing to conduct an experiment. Choose something that you would like to unfold as a reality in your life and using the steps we discussed, see what you can create. Physical and Spiritual Survival \\nOur essential reason for imparting this message involves something of greater consequence than creating personal desires. This “something” literally has to do with your survival, both physically and spiritually. \\nAs chaotic events escalate, your powers of intuition will be more important to you than ever before. \\nSome people call them “hunches.” Without knowing how you know, you suddenly know what to do in a situation. \\nThis is how intuition works. In these moments of intuition you are at a juncture point—a time node—where you can jump into a different timeline and a different outcome. \\nThis increase of intuitive receptivity is one of the hallmarks of personal ascension, or the movement upward in consciousness. A more developed intuition has obvious physical survival benefits. \\nA moment ago we said something that may be paradoxical to some individuals. We said that the ability to jump timelines had both physical and spiritual survival benefits. \\nWhat we meant here is that the ability to jump a timeline into a different outcome can result in physical survival in certain situations. By spiritual survival, we mean that there are threats to your spiritual awakening. If you lose track of your own truth, if you lose the two treasures that you possess in your nature—your sovereign will and your capacity to feel—then you are spiritually in danger. Do not lose sight of these treasures in yourself. As chaotic events increase, and they shall—for this is the birthing of a new world—the Controllers will increase their efforts. Be leery of mind-control and of any thought form that limits your sovereign will and your ability to feel, regardless of its origins—even if it comes from one of your “sacred” religions. \\nAny thought form, no matter how dressed up in sacred garb or political correctness that would limit your sovereign will to choose or your capacity to feel should be avoided. This is a vital necessity for those of you who wish to survive this passage spiritually intact. The Convergence of Timelines and the Alteration of Probabilities \\nLet us now turn our attention to the primary reason for this communication. Everything we have said up to this point is background and suggestions for the training of your own consciousness to jump timelines. \\nBut now we turn our attention to two highly significant timelines that exist independently of your creation. They are of a different order of existence. They are not created out of your personal choice. And they exist in diametric opposition to each other. \\nYou exist, as we have said on numerous occasions, in multiple timelines and probabilities simultaneously. One of the timelines you and humanity are living in at this moment is a fulfilling of the prophecies of doom and planetary destruction. This is a very real timeline. But, this is only one possible timeline. You are at a convergence point, a time node, where it is possible to jump from the doomsday probabilities into a new type of Earth and a new order of existence. \\nThis timeline, which we call the New Earth , is a very different dimension of experience than your current reality. In this timeline, Earth is deeply honored and held in gratitude by the bulk of humanity, which understands and appreciates the truth that all life is interconnected. \\nHere, Earth is not ravaged and exploited for the sake of profit—at the detriment of her very ecosystem. Technologies have been transformed through the elevation of human consciousness. Gone are the life-threatening technologies and life damaging mindsets of your current era. Wars are a thing of the past. The Controllers who exerted negative forces upon your destiny through their manipulation of religion, economics and international affairs have relinquished their power. Life itself is held as sacred, and a new understanding of the sacredness of matter is embraced by humanity. There is no war between Heaven and Earth in this new world. \\nThere are more things that we could say about this timeline, but you have a sense, we hope, of the difference between this timeline and the other that ultimately leads to doom and destruction. \\nThere is one more thing we wish to say about this timeline of the New Earth. It is an attribute that we particularly appreciate. In this new timeline, the veils between the worlds are thin, and there is greater interaction between humans and intergalactic beings—such as ourselves—and with what you might call the devic and spirit worlds. \\nIt is here that we must say it is not our intention to sway you, for we believe in non-intervention. We will not interfere with your free will. However, we are free to point out to you what we see. \\nIn ancient Egypt there was a goddess called Maat, who held a set of scales, and upon death the heart of an Initiate would be placed upon the scales, and a feather would be placed on the other side. If the heart was as light as a feather the Initiate would be given entrance to the heavenly worlds—meaning higher states of consciousness. But if the heart was laden with negativity, regret, and sorrow, the Initiate would have to return to the lower worlds. \\nIn a very real way humanity is at its meeting point with Maat. Every person who believes in the timeline of doom, destruction and horror will add to its reality. Everyone who holds as real the timeline of the New Earth will add to its reality. \\nYou are not powerless in this situation. You hold in your very nature the power of radical change for yourself and the planet—especially for humanity. If you feel a resonance with this timeline of the New Earth, and if you choose to live in this new order of being, you will be adding your weight, so to speak, and helping to tip the scales. \\nWe wish to say something we said earlier, for it is of vital importance. It is possible to live in heaven while those around you live in torment. This has little to do with your location in time and space, but more to do with your vibrational state. \\nIf you feel the truth of what we are saying and choose to align with this New Earth, we welcome you to a new timeline and a new destiny. \\nOur suggestion is to go over the steps of how to jump timelines we gave earlier, and to begin the grand experiment. Enter the timeline of the New Earth and prepare yourself for the miraculous. \\nFinally—let the Earth speak to you. Let her caress you and transfer to you her deepest knowledge and wisdom. She shall be a great ally in the coming changes. \\nWe shall give further information about jumping timelines and the New Earth in future communications. But for now, we hope you have a basic understanding of how to proceed. \\nAs always, even in the midst of such great difficulties as you now face, we hold a higher vision for you, the human family. We see your hidden greatness, even though you may not see it yourself. We hold a light in this hour of darkness. It is just a reminder of the great light you hold within yourself. It is time to free this light within you. Future generations will be blessed by your ascent. May it be so. – Tom Kenyon'"}, "time": 1742563083.0661478}