{"duration": 0.08089256286621094, "input_args": {"text": "\"Share on Facebook Not many people can walk freely with wolves and the rare few who are able to share such a close and special bond with the majestic animals are incredibly fortunate. Danielle, a wildlife worker at the Colorado Wolf and Wildlife Center, is one of those lucky souls. She has earned the trust and respect of several timber wolves at the center and as you can see in this awesome video, they truly seem to love and appreciate her like one of their own! The large grey wolf seen walking alongside Danielle in the beginning is named Kekoa, which in Hawaiian means “brave one.” He's a nine year old Timber wolf who was transferred in from the Seacrest Wolf Preserve in Florida along with his sister Sakara who is also featured in the clip. According to the Wildlife Center, Kekoa enjoys giving visitors sweet kisses and he's exceptionally gentle around them! It's clear to see that the handsome boy definitely loves the ladies and watching him interact with Danielle says it all. He walks with her happily wagging his tail and when she sits down in the snow he nuzzles her affectionately and bows his head in submission. Then he starts licking her face enthusiastically, which make seem kind of gross, but it's actually a further sign of his affection and subordination towards her. As brave and noble as he looks, he's also a big baby and I mean real big! He weighs in at 115 pounds and when he places his front paws up on a persons shoulders he comes in at about 7 feet tall! Check out the size comparison between Danielle, who happens to be an average sized adult, and his sister Sakara, who is slightly smaller than her brother and weighs 85 pounds. Kekoa is huge, yet so sweet and soft! The best part is when he rolls over on his back and fully exposes his tummy to Danielle. Not only does this signal that he wants her to give him belly rubs, it also shows just how much he truly trusts her. While he's willing to be completely vulnerable around Danielle, he's also not a fully wild wolf. In an interview with The Dodo wildlife center staffer Michelle Smith explained that “Since he was raised by people and bottle fed from the time he was born, he is very well socialized, meaning he enjoys the company of people. This is not the same as domesticated or tame. He is still a ‘wild’ animal, and he does tend to show it when he is around his sister. A wolf in the wild would not act this way.” To drive home her point, a healthy and normal wild wolf would never allow a person to pet them, let alone approach them in the first place. Wolves actively avoid human contact and prefer to stay well away from us. This clip just shows how well people and wolves can get along if given the chance to. They are highly personable and are a far cry from the wicked, evil animals that they have been portrayed as in fairy tales and stories over the centuries. In fact, wolves are easily among the most intelligent, socially complex, and misunderstood animals on Earth. They have been given a wholly undeserved reputation by people, hunted and persecuted to near extinction, and yet through it all they've managed to survive and endure. Please be sure to check out the Colorado Wolf and Wildlife Center's beautiful video and see for yourself how sweet natured and loving they can be! Related:\""}, "time": 1742561853.0309727}