{"duration": 0.6348483562469482, "input_args": {"text": "'On Oct. 20, 1981, a band of militant zealots armed with automatic weapons tried to rob a Brink’s truck in a shopping mall in Nanuet in Rockland County, N. Y. Before it was over, two   guards were shot and two police officers  —   one black and one white  —   were gunned down at a roadblock. The crime was one of the last spasms of ’    violence. To the militants, it was an “expropriation” for something they called the Republic of New Afrika, a place that existed mainly in their fevered dreams. Judith Clark was one of four people arrested that day for armed robbery and murder. She was 31, a veteran of the white left who traveled the radical arc from student protest to the Weathermen to the fringes beyond. A new single mother, she kissed her infant daughter goodbye that morning, promising to be home soon. No one ever accused Clark of holding or firing a gun that deadly afternoon. But she was there, a willing participant, at the wheel of a tan Honda getaway car. Over the next two years while she awaited trial in jail, Clark became a fiercer warrior than she was on the day of the robbery. During court hearings, she told the judge she was a “freedom fighter” who didn’t recognize the right of imperialist courts to try her. She called court officers “fascist dogs!” when they clashed with her supporters. Her     Kathy Boudin, arrested at the scene of the shootings after having been a fugitive since a 1970 bomb blast in a Greenwich Village town house killed three of her Weather Underground comrades, sat mutely beside her. At trial, Clark and two other defendants  —   David Gilbert, a Weather Underground member, and Kuwasi Balagoon, a former Black Panther  —   boycotted the courtroom, listening to the   testimony from their basement cells. The defendants insisted on representing themselves no one   witnesses on their behalf. When Clark appeared in court to make a closing argument, she merely confirmed her guilt. “Revolutionary violence is necessary, and it is a liberating force,” she told the jury. Judge David Ritter of the Orange County Court sentenced Clark to a minimum of 75 years in prison. He saw no chance for future rehabilitation. “They hold society in contempt and have no respect for human life,” he said. Clark wore a mocking grin that day, the same one she wore when photographers snapped her picture the night of the crime. “One thing about Judith Clark I will never forget,” says John Hanchar, whose uncle, a Nyack Police sergeant named Edward O’Grady, was killed, “was her smiling face as she was led out of the police station in Nyack into the back of that car. ” On Oct. 6, 1983, clenching a fist of solidarity, Clark was sent to the   prison for women at Bedford Hills in Westchester County to begin the rest of her life. Like many who knew Judy Clark before that terrible October day, I wanted nothing to do with her after the crime. I shuddered at the same photos that chilled the victims’ families. Clark was the former   sweetheart of a good friend. She went to Brooklyn’s Midwood High School my friend Allan to Erasmus Hall. They met as student civil rights activists walking picket lines outside Woolworth’s in Flatbush. But after being expelled from the University of Chicago for student protests, Clark moved steadily to the left’s outer reaches. She was part of the wild tribe of radicals who smashed windows in the streets of Chicago in a 1969 antiwar demonstration called Days of Rage. Charged with riot, she went underground only to be captured by the F. B. I. while sitting in a Manhattan movie theater. She served nine months in prison. By the time I met her in the  ’70s, she was a stalwart of something called the May 19th Communist Organization. A dogmatic offshoot of the Weathermen, May 19th’s members believed that a   revolution in America was in the offing. The correct role for white radicals, they held, was to follow that lead, wherever it took them. Even those of us who cared about the issues the May 19th crowd trumpeted  —   racism, poor housing, deaths in police custody  —   were often suspect for not showing proper fervor. The Judy Clark I knew had two distinct sides. She was capable of warmth and joy. But her smile could vanish in a moment, replaced by an accusing finger. “How many people did you kill in Vietnam?” was her sudden jab across a Park Slope kitchen table at a friend roiled by nightmares after his return from the war. Stunned, he shook his head. “Judy, it was a war,” he said. “Yes, and you were the invading army,” she insisted. “How many did you kill?” The bright, laughing woman was someone you wanted to like. The rigid radical made it tough. Then the Brink’s robbery occurred, and there was no point in trying anymore. In the years after she disappeared behind prison gates, occasional word came from friends who visited her that Clark was different than she was during her days of rage. I had my doubts: could anyone so stubborn and unrepentant really change? Eventually I drove up to Bedford Hills to see for myself. On my first trip, in 2006, Clark strode into the sunny visitors’ room wearing a wide grin, one quickly returned by the   guard overseeing the area and by inmates seated at nearby tables. Her dark hair had gone mostly gray, but otherwise she looked much the way I remembered her: she is small with brown eyes, an olive complexion, a tiny pock mark on her forehead left over from childhood chicken pox. She had been in prison for 25 years. Her voice still carried the accent of her Brooklyn youth. It was softer now, though, without the righteousness that I remembered from even the simplest exchanges. I returned several more times over the years, sitting at the same table near a playroom where inmates spent time with their children. On a recent visit in June, Clark arrived with a black Labrador on a leash trotting beside her. The Lab was the eighth dog Clark trained under a program in which the pups stay with inmates for about a year before becoming service dogs, mostly for disabled war veterans and for   agencies. The dog this former terrorist trained would soon be sniffing out bombs like those her old Weathermen pals once planted. As we spoke, a pair of young girls came over to look at the dog. Clark had him raise his paw in greeting. The girls tittered. Their mothers joined them. “I told them to introduce themselves to you,” one inmate said. Clark leaned close and grasped each girl by a shoulder. “Your mothers talk about you all the time,” she said. “They talk about how much they love you and have such great stories. ” The girls smiled. Most of the women at Bedford Hills are parents. Clark knows a lot about the heartache of leaving a child behind. Her daughter, Harriet, was 11 months old at the time of her arrest. On the day of the Brink’s heist, Clark told me, she was hesitant on several counts, starting with her baby at home. A gay, single woman, Clark had decided that she wanted to have a child, and a fellow militant served as surrogate father. When Harriet was born in November 1980, Clark was “deliriously happy. ” It was, she said, an utterly personal experience, a break from the   demands of her dogmabound sect. The commune welcomed children, as long as they were brought up in proper collective fashion. But the doting motherhood Clark displayed was considered a bourgeois indulgence. “I was accused of losing sight of my responsibilities,” she said. Her parents were also eager to be involved with their new granddaughter, and Clark often brought the baby to visit them  —   another warning sign to her associates. Clark’s parents were once revolutionaries themselves. Joe and Ruth Clark were Communists but broke with the party in the 1950s. Much of their disenchantment stemmed from three harsh years they spent in the Soviet Union when Judy and her brother, Andy, were small children and their father was foreign editor of The Daily Worker. Ruth Clark went on to become an expert in   research and is one of the people credited with inventing political  . Joe Clark, to Judy’s dismay, became vehemently   raging at former friends. Neither had any patience for their daughter’s rabid politics. In Judy’s view, she was the keeper of the flame that flickered out in her parents’ lives. Anything less than total commitment to the cause was betrayal. “Armed struggle was happening all over the world, and we thought we had to bring it to the motherland,” she said. But Harriet’s birth rocked her convictions. “I felt myself shifting,” Clark said. “I worried that if I was going to sustain a relationship to my child, I was going to have to change my loyalties and my lifestyle. ” She was petrified of being separated from her child but even more terrified of appearing timid before her comrades, whose approval she craved. Agreeing to participate in the Brink’s robbery, she hoped, would quiet her critics enough to let her spend more time with her daughter. She had one hesitation that she was too embarrassed to admit and about which her partners never bothered to ask: Clark, who was supposed to follow the gang members in a backup car, wasn’t much of a driver. She convinced herself that it didn’t matter, that the heist would be called off, as had several earlier attempts. But she was under no illusions about what she signed on for. “I knew what I was driving a car for,” she told me. “I knew the whole situation. ” In Clark’s version of the events of that day, she donned a wig and then followed a small caravan north from New York City to Nanuet. She parked, as ordered, in a corner of a large mall. She was too far away to see the attack on the armored car and the blasts that killed one guard and left another in a pool of blood as the shooters grabbed $1. 6 million from the back of the truck. When the gang’s van tore out of the mall, she raced after it to a nearby parking lot. Six gunmen abandoned the van and climbed into the back of a   piloted by Gilbert and Boudin. Someone dumped a moneybag into the trunk of Clark’s car. As she followed the   her biggest fear was getting lost. When the caravan came to a crossroad leading to an entrance ramp to the New York State Thruway, she saw the police blocking traffic. An officer carrying a shotgun waved the   over. Clark drove past the ramp and stopped. “I was in this terrified, frozen state,” she said. She considered just driving away. “I can’t do that,” she told herself. “I am not supposed to leave people. ” She heard gunfire behind her. Suddenly “two people jump into my car and scream at me to drive. ” She quickly drove ahead, up a curving mountain road, no idea where she was headed. When a police car pursued them, she drove faster. “I am so out of my league,” she remembers thinking. Near Nyack, she turned down a street that plunged steeply toward the Hudson. The road ended abruptly at North Broadway, where Victorian homes overlook the river. Clark tried to make a turn but crashed into a concrete wall. “I spun out of control,” she said. Clark’s shoulder popped out of its socket  —   a chronic ailment since childhood. She was squirming in pain, trying to bang it back into place, when she heard a policeman barking orders to come out. The shouts came from the South Nyack police chief, Alan Colsey, who had chased Clark’s car over the mountain. After Clark and her passengers were taken into custody, a pistol was found behind the front seat and a clip of bullets in Clark’s purse. Colsey thought she was reaching for the gun as she twisted in her seat. Clark said she never knew it was there. “I sort of rolled out,” she said. “I didn’t want to be shot. I was scared but also relieved it was over. ” In jail, all she could think was that she had let down her friends and had to make up for it. “I was not a good freedom fighter,” she told herself, “but I can be a good captive freedom fighter. ” Her role models were Puerto Rican radicals, linked to a group responsible for a string of deadly bombings, who declared themselves prisoners of war after being arrested. She didn’t think about the enormous sentences they had received. She also tried not to think about having left her baby. “I would just shatter,” she said, “so I turned it off. ” Clark’s father went to the Rockland County jail, where he screamed at her: “You want to talk about a black revolutionary? I’ll tell you who a black revolutionary is. It’s A. Philip Randolph, not these thugs. Not killing a black man. ” She tried to tune him out. Two weeks later, her parents brought Harriet to visit. Physical contact was forbidden, and she wasn’t allowed to touch the baby, who was just learning to walk. “Every time she started toddling toward me, the person watching would say, ‘If she touches you, this visit is terminated.’ ” Harriet cried in confusion. To Clark, the cruelty only reinforced her ideas about the oppressive system. “I avoided thinking about how I had put my daughter in this horrible situation. ” Under tight security, Clark and Boudin, who had her own baby with Gilbert, passed the time talking about their children, making small books for them and, when allowed, crocheting clothes and dolls. Eventually, Clark said, Boudin told her that she wanted to “cut her losses,” a move supported by Boudin’s father, the civil liberties lawyer Leonard Boudin. But Clark couldn’t be swayed. Her parents dispatched the prominent radical lawyer Arthur Kinoy to urge her to participate in her defense. She refused. When her trial began in the summer of 1983, Joe and Ruth Clark couldn’t bear to attend. A family friend observed, reporting back on the hopeless fiasco playing out in court. Clark’s biggest fear was that others in the group would see how fearful she was. “I was terrified of my own terror,” she said. Sitting in her basement cell, Clark harbored secret doubts about her strategy. A childlike notion kept crossing her mind: This can’t be happening. After the judge sentenced Clark along with Gilbert and Balagoon to spend their lives in prison, Boudin pleaded guilty and received 20 years to life she was paroled in 2003 and reunited with her    son, who was 14 months old at the time of the crime. Clark missed that chance. Short of the death penalty, which the district attorney lamented was not available, her sentence was the harshest one possible. After Clark arrived at Bedford Hills in a   convoy, she was put in solitary confinement for a month. She emerged the same stubborn,   rebel she was in court. Sister Elaine Roulet, a nun who founded the prison’s children’s center and worked there for 35 years, noted how the new prisoner walked with her hands clenched in tight fists. “When Judy came, she was a very angry person,” Roulet says. Inmate 83G0313, as Clark was known, was considered a major security risk, her every step carefully tracked. There was good cause for concern. Clark’s radical crew was known for plots like the 1979 prison breakout of Assata Shakur, a Black Liberation Army leader. At one point, the prison superintendent, Elaine Lord, was assigned a guard. Twice, Lord had to leave prison grounds as a precaution. Clark’s fury seemed to ebb when she was with her daughter. On weekends, her comrades from the West Side commune where Harriet was still living would drive her the 38 miles to Bedford. During those visits, Clark played and read to her in the children’s center. She tried to convince herself that Harriet was safe and secure being brought up by her former comrades with a mix of love and proper politics. But the communal home was under siege: one by one, members were being jailed for refusing to cooperate with grand juries. Day to day, it was unclear who was caring for Harriet. During the summer of 1985, her parents sued for custody of the nearly    Harriet. At one point, they picked her up at the West Side commune and went into hiding for several days. Joe Clark called the prison superintendent to tell her what they had done. “You are going to have hell on your hands,” he warned Lord. Judy was irate. Roulet urged Clark to focus on her daughter. She also understood the grandparents’ concern. “They didn’t want Harriet to grow up to be a Judy,” Roulet said. That same year, letters from Clark describing the prison’s layout and operations were discovered when a pair of fugitives were captured. For plotting escape, Clark was placed in solitary for two years, one of the longest stretches any Bedford Hills prisoner had ever received. At first, this was just another notch in the radical belt, an endurance test for a committed militant. Judy was still allowed to see Harriet during weekly visits. Clark worried that if her parents won custody, a judge might bar her from seeing her child. “I felt bereft,” she said. But her concerns turned out to be unwarranted: after they gained custody, Clark’s retired father brought his granddaughter on weekly visits to the prison. Clark wouldn’t speak to him. While she and Harriet played, the grandfather, with other reading material banned, sat in a corner rocking chair poring over the children’s books. In the summer of 1986, while Clark was in solitary, someone said something to her that finally broke through to her. Gilda Zwerman, a sociologist who was studying   activists, didn’t mince words. “I understand how you did this to yourself,” she told Clark. “What I don’t understand is how you did this to your daughter. ” Clark tried to look defiant, but her lip twitched, and she began to quietly weep. Zwerman nudged her further. “You can’t cry for yourself and Harriet,” she said, “and not see that the children of the men who were killed cried the same way for their fathers. ” It was the first time Clark had broken down in front of another person since her arrest. She returned to her cell shaken but oddly relieved. “I felt like I had taken off a layer of armor,” she said. “I no longer felt like I had all the answers. ” Clark says that solitary  —   known as SHU for Special Housing Unit  —   was filled with mentally ill women. “They were howling at the moon, eating their mattresses and setting fires. ” She found herself speaking with the guards. “I would talk about my life and my daughter and the situation. ” The exchanges with people in uniform, Clark said, “made me have to get out of the fog of the rhetoric and think about those affected by this crime. ” She began keeping a journal. She had used her radicalism, she realized, much the way prisoners around her used drugs, as a means to avoid confronting her own doubts. She walled herself off in the safety of doctrine. “I was beginning to say these politics are crazy. I’ve experienced so much loss, and created so much loss, for the sake of an illusion. ” She consumed books on psychology and wrote poetry. Solitary was grueling, she said. “But as horrible as it felt, I felt more alive than I had been. It was like coming out of this cave and being able to see again and feel. ” Helping to pull her into the world was her daughter. “Harriet was the first person I fully engaged with on her terms,” Clark said, “not on what I thought was right or my agenda. ” They communicated mostly through play, especially hide and seek. The little girl enlisted everyone in the children’s center as she hid from the mother who herself had gone missing from her daily life. “I would say: ‘Where’s Harriet? I thought Harriet was coming to see me. I’m so sad.’ It was this whole drama, and then she’d burst out laughing. ” When Harriet was 6, she made an announcement during a visit: “Mommy,” she said, “Grandpa taught me about the Ten Commandments. You committed a sin. ” Clark felt her breath catch as she waited to hear her child tell of the robbery and the deaths that went with it. Instead, the girl continued, “You stole something. ” Clark exhaled. “Yes,” she answered. “I committed a terrible, terrible sin. And I feel really bad, because I sinned and I am away from you. ” The full story emerged in bits and pieces. “Why are you in jail?” Harriet would ask. “Were you scared?” And the hardest one: “Were you thinking about me?” They devised ways to overcome their separation. Mother and daughter kept copies of the same book on birds. Clark would describe those she saw from her cell window Harriet would find them in the pages. Clark spun tales of gremlins who lived in the prison walls, able to come and go as they pleased. She had them make mischief in prison locations her daughter heard about but couldn’t visit  —   the mess hall and living area. The children’s center also became the neutral ground where Clark began rebuilding her relationship with her father. As they ate lunch in the playroom, Clark was polite, for her daughter’s sake. But guarded conversations gradually became warm exchanges. They talked about Harriet, their health, Judy’s prison conditions. Clark’s mother rarely visited at that time. “She couldn’t handle the jail,” Clark’s brother, Andy, says. But Andy marveled at the changes in his sister. “It was like crystal shattering,” he says. “The whole facade that had been built around her just started to come apart. ” In September 1987, Clark was released from solitary. Enjoying her relative freedom, she plunged into prison activities, attending Jewish services for the first time. Then one day, without warning or explanation, she was transferred to a federal prison in Arizona. Her parents made half a dozen visits with Harriet while also lobbying for her return. After a year, she was transferred back to Bedford Hills. On her return, Judy wrote to her parents, thanking them for their help and for taking care of Harriet. A few weeks later, on Christmas Day 1988, her father died of a heart attack. “My arrest kind of broke my father’s heart,” Clark told me. When the Jewish High Holy days arrived the following year, she lighted candles and said Kaddish for him. “I was thinking of the meaning of the Day of Atonement. I spent the whole 10 days of the holidays alone, walking and thinking about the crime and about my father, about that time when he came and he yelled. ” Alone in the prison chapel, she said aloud the names of the men who died in the robbery: Peter Paige, the Brink’s guard, and the policemen Waverly Brown and Edward O’Grady. She was 39 years old, grieving for her own father. “And yet,” she said, “there were nine children who were a lot younger than me grieving for their fathers. And I was responsible for that. There was the human toll. It was a terrible truth, but it was my truth. ” Slowly she began building a life behind bars. Through programs for inmates, she earned a bachelor’s degree in behavioral science followed by a master’s in psychology. When the government ended tuition aid for inmates, she helped persuade local colleges to offer affordable courses. As AIDS arrived in the prison, terrifying inmates and correction officers alike, she calmed things down by educating everyone. In 1994, a   newsletter published one of her poems and referred to her as a political prisoner. Clark wrote to the editor disagreeing, saying that she felt no pride in what she’d done. “I feel only enormous regret, sorrow and remorse. ” Harriet Clark turned 31 in November, the same age her mother was when she was arrested. She’s a short, slim woman with dark hair, bangs and a sunny smile. Her   schoolgirl’s voice belies a rush of reflections that sound wise beyond her years. For someone who has never known her parent outside of prison, she is remarkably buoyant. She grew up in New York City, attending P. S. 87 on West 78th Street and Stuyvesant High School. When she went West to Stanford University, she and her mother kept in touch via weekly phone calls and long letters. Friends marveled at the number she received. She got an M. F. A. from the Iowa Writers’ Workshop and has won several writing fellowships, including a Stegner. She now teaches at Stanford. She’s working on a novel, part of which takes place in prison. But she’s tried to steer clear of caricatures about ’60s radicals. “The one character that will never appear in anything I write,” she told me, “is a stubborn, passionate, rebellious brunet woman in an army jacket and a bandanna. ” On a walk along the Brooklyn waterfront this summer when she was in town to visit her mother, she talked about her childhood and how prison was part of the natural order of things. She was 9 when a British film crew doing a documentary on Bedford Hills asked Harriet if she missed her mother. Not really, she answered. “This is how I know my mother. ” The prison’s visiting center was her second living room. “When they got a new vending machine, it felt like new furniture in my house,” Harriet said. The other children she met visiting their inmate moms fell into two groups: those who lost them to prison “within memory or before memory. ” She was puzzled when some were anguished that their mothers weren’t home for holidays and family events. Harriet had never had that experience to miss. “My mother lived in prison,” she explained. “That was always the reality going backward and going forward. ” Harriet and her mother spent hours making creations with pipe cleaners and popsicle sticks. “I have no memories of not having my mother’s undivided attention,” she said. Later they moved on to Battleship and Monopoly. Her mother was such an enthusiastic playmate that other children asked to join. “I spent half my time shooing away other kids,” Harriet said. Prison also offered unique ways for a little girl to spite her mother. “I knew if I was making more noise than I should that the officers would yell at us and I’d put my mother at risk,” she said. Sometimes Harriet would dart past the line on the floor in front of the vending machines beyond which prisoners are not allowed to step. “If you get me, you’ll be in trouble,” she’d say. Once, when Judy refused Harriet candy from the machines, the daughter fired back that when she grew up she’d let her own kids eat all they wanted. “What else will you do?” her mother asked. “I’m sure as heck not going to leave them,” Harriet answered. As she grew older, Harriet became protective of her mother. She cringed at the ways inmates were the ones treated like children, denied money, keys, silverware. When her mother phoned her at home, she would always wrap up the conversation before the automated message that the call would end in 60 seconds. “I wanted to deny their control,” she said. She also walked a delicate line with her   grandmother, who reared her after her grandfather died. Fiercely proud, Ruth Clark, who died in 1997, instructed Harriet not to tell people that her mother was in prison. “I wouldn’t talk about it, even to close friends,” Harriet said. She kept her two lives strictly separate, treasuring her weekly visits to Bedford as private time. In her grandmother’s apartment on West End Avenue she surrounded herself with her mother’s homemade gifts. “I slept under a blanket my mother made me, drank orange juice out of a cup she made, decorated my walls with her clay figurines, objects that made me think of her. ” Her mother’s wrenching guilt over her crime had been such a large part of her childhood, Harriet told me, that it took her a long time to recognize that the sentence Clark is serving stems less from her actual role in the deaths than her reckless conduct in court. She has often pictured her mother sitting in the basement cell during the trial: “I wonder, Were you thinking about the fact that you would never come home to me if you did this?” Yet over the years, she has realized that her relationship to her mother is closer than that of many people she knows. “The advice my mother has given me in life is the advice I live by,” she said. “The values she has instilled in me is how I move through this world. ” It’s what got her started writing fiction. “When I had frustrations with people,” she said, “my mother would ask me to imagine my way into their lives, so I would have an openness and compassion for them. ” In July 2010, one of Clark’s lawyers, Sara Bennett, delivered hundreds of letters to Gov. David A. Paterson asking for clemency. Bennett told me Clark’s name kept coming up when she talked to other clients at Bedford Hills. “They’d say, ‘There’s this woman here, Judy Clark, and she has gotten me to see how I have to live my life and take responsibility.’ ” Bennett, a former Legal Aid lawyer, was shocked that Clark was serving 75 years. “I’ve had so many clients who committed really brutal crimes  —   actually killed people  —   and got 25 to life, or 50 to life. Hers is so out of proportion. ” Among those supporting Clark’s release was Elaine Lord, who retired as Bedford Hills superintendent after 22 years at the prison. “I watched her change into one of the most perceptive, thoughtful, helpful and profound human beings that I have ever known, either inside or outside of a prison,” Lord wrote the governor. Robert Dennison, a veteran parole officer and member of the Conservative Party who served as state parole board chairman under Gov. George E. Pataki, also wrote in support. Dennison met Clark during a tense 2005 meeting with Bedford Hills inmates angry over repeated parole denials. The meeting got loud. “Judy Clark was the one person who was sort of the voice of reason,” he recalled. In his letter to Paterson, he called her “the most worthy candidate for clemency that I’ve ever seen. ” To me, he added, “if you look at what she did and all the deals the government made with other people involved, she sort of got left holding the bag. ” The rest of the Brink’s suspects were rounded up months and years after the robbery and tried in federal court. Cecil Ferguson, known as Chui, and Edward Joseph, known as Jamal, who were accused of being among the robbers, were convicted only as accessories for hiding a Brink’s fugitive and served 7½ and 5½ years, respectively. Joseph is now a successful playwright and a professor at Columbia University. Silvia Baraldini, a fellow May 19th member who went to trial with other Brink’s defendants, got 43 years for related crimes with the gang, including the Assata Shakur jailbreak. A federal inmate, she was released in 1999 under President Clinton to her native Italy, which freed her in 2006. Another May 19th leader, Susan Rosenberg, was indicted but never tried for the Brink’s shootout. She was serving a   federal sentence  —   after being caught with a carload of explosives and weapons  —   when Clinton released her in 2001 as one of his last presidential acts. David Gilbert is still in prison Kuwasi Balagoon died while serving his sentence. Mutulu Shakur was described as the Brink’s mastermind. “He picked it, he planned it, he orchestrated it and he executed it,” prosecutors told his jury. Shakur got 60 years. Under federal rules, his projected release date is February 2016. He’ll be 65. Shakur’s attorneys claim that he’s likely to remain in prison much longer. He’ll still be out well before Clark. Under her state sentence of 75 years, her earliest parole date is 2056. She would be 107. For most relatives and supporters of the victims, this is as it should be. When I spoke with John Hanchar, who was in eighth grade when his uncle, Edward O’Grady, was killed, he told me that the Web site maintained by Clark’s friends is misleading. “She goes to great lengths to minimize her role in the crime,” he said. Hanchar recalled his aunt trying to keep up a brave front that night. “I remember her going down to the laundry room, and then we just heard this wail. She’d opened the dryer and pulled out his police uniforms. ” Hanchar is now a Rockland County police officer. “Where Eddie was killed is right in my patrol sector,” he said. “I see that memorial every day. ” The spot by the Thruway entrance has plaques and flags memorializing the deaths. A ceremony is held there annually. On the 30th anniversary last October, several hundred people attended. The deaths, Edwin Day, a Rockland County legislator and an   told me, were “like a permanent knife in the heart of the community this never went away. ” Waverly Brown, then the only black officer on Nyack’s force, was the other policeman killed. Frank Olivier, raised in a Nyack housing project and now a corrections officer at the Rockland County jail, recalled growing up under Brown’s watch. “We were his kids,” Olivier said. “He would make sure we were doing our homework, he would come to our track meets. With Officer Brown, you knew you had a chance. ” When he and his friends heard Brown was killed, “everybody was in a rage,” he said. But Olivier now feels differently about Judith Clark. He wrote one of the letters that Bennett delivered to the governor. “I know that people change after a while. Communities heal after a while. This lady has been in there 30 years. When has she paid her debt?” In December 2010, a few days before Governor Paterson’s term ended, he met with a small delegation of Clark’s supporters led by Bennett and Dennison. He told them that his staff advised against her release and that he was in agreement. Paterson wouldn’t talk to me about it, but he recently told Jim Dwyer, a Times columnist, that he feared being “tarred and feathered” if he released Clark. Last June, I went to meet some of the people whose wrath the governor feared at a   breakfast in Nyack for a scholarship fund in memory of officers Brown and O’Grady. Most were still bitter over Boudin’s release and felt that Clark deserved to remain in prison. Did they believe such criminals could be rehabilitated? “I know, they’re all wonderful,” Bill Ryan, a former New York City Police lieutenant who lives nearby, responded sarcastically. “They’re teaching little children and working with the handicapped and unwed mothers. ” His remarks brought knowing smiles around the table. It’s a skepticism shared by many. When I first started visiting Clark, I also wondered whether her transformation was a calculated effort to get out of prison. Over time I’ve come to see her differently. A dozen former inmates told me stories of how Clark helped them sort out their own troubles while they served time with her. Sheila Ryan, a former N. Y. P. D. investigator who spent 10 years at Bedford for killing the man she claimed raped her, told me that when she first met Clark in prison in the 1980s, she wanted nothing to do with her. “I thought, My God, you’re responsible for killing cops, and here you are laughing?” But she has changed her mind. “She is truly remorseful and sorry for what happened,” she said. As Elaine Lord, the former Bedford Hills superintendent told me, prisons should rehabilitate, not just warehouse. And Clark is a model for what’s possible in prison. “She is not the person who was involved in that crime,” Lord said. “She’s a different person. We have a right to be angry at them, but it doesn’t change anything. There has to be an end. ” Not long ago, Clark spoke at a Bedford Hills event. Her theme was the Book of Jonah. Like Jonah, she told the audience, she had spent years in   behavior and had been cast overboard into a   sea for her actions. Like Jonah, she found rescue in the belly of the whale, in her case behind bars. “In prison,” she said, “I learned who I was. ”'"}, "time": 1742563618.067252}