{"duration": 0.08604788780212402, "input_args": {"text": "'Vice President Mike Pence challenged the 2017 graduates of Grove City College to lead with courage in the face of criticism and seeming setbacks and congratulated them for earning degrees at an institution which refuses federal funding. [Founded in 1876, Grove City College had to take its fight to refuse all federal funding to the U. S. Supreme Court in the 1980s. Pence recounted this history, telling the graduates, “The diploma that you will receive today was minted in an institution of principle and independence and you can be proud of it for the rest of your lives. ”  “People follow people they respect so first and foremost you must aspire to be men and women of character,” said Pence. TUNE IN! I’m at @GroveCtyCollege delivering the 2017 Commencement address. Congrats, grads! #GCCGrad2017 https:  .  pic. twitter.   —   Vice President Pence (@VP) May 20, 2017,  He called the crowd to servant leadership: leadership grounded in faith and freedom, not selfish ambition, that “must the the animating force of the career that lies before you. ” “If you aspire to lead, you’ll need courage,” he added after referring to a quote from C. S. Lewis, “Courage was not one of the virtues it was actually a form of every virtue at the testing point. ” “Leadership brings both honor and opposition,” he continued. “Anyone who dreams big will encounter those who think small, anyone who dares to step forward will find those who’d rather stay put. And anyone who thinks they can will always hear from those who are sure they can’t. ” Pence told the graduates that for an example of courage they should look no further than his friend, the 45th President of the United States of America, Donald Trump. The vice president quoted the commencement message President Trump gave last Saturday at Liberty University. “Nothing worth doing ever came easy,” he said, quoting Trump. “Following your convictions means you must be willing to face criticism from those who lack the courage to do what’s right. ” Adding his own advice, Pence urged, “Don’t fear criticism. Have the humility to listen to it, learn from it and most importantly, push through it. Persistence is the key. Never quit on your dreams. Dreams may be deferred by they must never be abandoned. ” Pence recounted some of his life story and setbacks, particularly that he actually ran twice for the U. S. Congress and was not successful in those first attempts. He encouraged the graduates to trust the dream in their hearts and “never let it go. ” “That dream came back around,” said Pence, and he was eventually successful and able to serve in Congress, then serve as governor of Indiana and now has the privilege as serving as vice president of the United States. “Hold on to your calling. Never let it go,” he encouraged. Pence quoted former President Calvin Coolidge: Nothing in this world can take the place of persistence. talent will not. Nothing is more common than unsuccessful people with talent. Genius will not. Unrewarded genius is almost a proverb. Education will not. Well the world is full of educated derelicts. Persistence and determination alone are omnipotent. He then added his own words, “And so persistence men and women. Hold on to your dreams and drive forward. ” Vice President Pence declared that the graduates have been “called to lead, fearlessly. Be men and women of integrity with a servant’s heart. Expect opposition and persevere. And lastly, have faith. ” He quoted Jeremiah 29:11 from the Bible, as he often does, that God has a plan for them, to give them “hope and a future. ” “Have faith that He that brought you this far will never leave you and never forsake you because He never will,” said Pence. The Vice President said if the graduates “if you hold fast to Him, to the faith that deepened in this special place and to all that you learned from this extraordinary faculty, I know in my heart of hearts, you will not only persevere, but you will prevail. ” . @GroveCtyCollege Class of 2017  —   this is your day  —   the future is yours. Congratulations. #GCCGrad2017 pic. twitter.   —   Vice President Pence (@VP) May 20, 2017,  He concluded with, “The future is yours, go get it” and “God bless you and may God bless the United States of America. ” Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742564129.7242782}