{"duration": 0.05397367477416992, "input_args": {"text": "'WASHINGTON  —   In a vivid illustration of the tensions between the United States and Iran, an American Navy warship fired warning shots at Iranian boats that were racing toward it near the Strait of Hormuz, Defense Department officials said on Monday. The episode occurred Sunday when four Iranian fast boats came within 900 yards of the U. S. S. Mahan, a guided missile destroyer that was escorting an amphibious warship with 1, 000 Marines on board and a Navy oiler. When the Iranian boats did not respond to a radio call and flares signaling them to stop, the American destroyer fired three warning shots with a .  machine gun. A Navy helicopter also dropped smoke grenades. There was no damage to the Iranian vessels, and they did not return fire. It was the first time the Navy had fired warning shots at an Iranian boat since Aug. 24. Though the boats’ approaches are essentially a form of harassment, they point to the risk of military confrontation in a region that is bristling with Western, Arab and Iranian forces.   Donald J. Trump vowed during the presidential campaign to take military action against Iranian ships that approached American vessels in a threatening manner. “With Iran, when they circle our beautiful destroyers with their little boats and they make gestures at our people that they shouldn’t be allowed to make, they will be shot out of the water,” Mr. Trump said at a rally in September. There were 35 close encounters between American and Iranian vessels in 2016, most of which occurred during the first half of the year, and 23 encounters in 2015. “We had a significant number of these before,” Capt. Jeff Davis, a Pentagon spokesman, told reporters. “They had largely stopped. ” The most serious episode took place in January 2016, when Iran detained and ultimately freed 10 sailors who had unintentionally entered its territorial waters while cruising from Kuwait to Bahrain. On Sunday, Iranian boats approached the American ships six times before they got so close that the Mahan fired warning shots. “This was an unsafe and unprofessional interaction, and that is due to the fact that they were approaching at a high level of speed, with weapons manned, and disregarding repeated warnings,” Captain Davis said. There was no immediate comment from the Iranian authorities. But the Iranian military has signaled its intention to be active in the area and is planning a war game in the region this month. “The navy will practice    tactics during the drill, including modern warfare tactics, for the first time,” Habibollah Sayyari, the Iranian Navy commander, said, according to Iranian news organizations.'"}, "time": 1742564058.4340243}