{"duration": 0.0710752010345459, "input_args": {"text": "'Russia will almost certainly be barred from this summer’s track and field world championships, global officials for the sport said Monday, citing the nation’s response to its doping scandal, which they called inadequate. The officials met in Monaco on Monday and voted unanimously to maintain the ban on Russian athletes, outlining a timetable under which the nation would not be cleared to compete until November. Until then, individual Russian athletes with robust histories of drug testing may petition to compete as neutral athletes, unassociated with any country, in the world championships, which will take place in August in London, as well as other global events. Officials agreed to exempt Russia’s youngest athletes from the blanket ban, allowing for those under 15 to compete as neutral individuals without filing a special application. Citing a number of issues  —   including ”unhelpful comments” by Russia’s deputy prime minister, Vitaly Mutko limited and problematic drug testing within the country and evidence that an implicated coach had continued to train athletes in spite of having been suspended  —   Rune Andersen, the chairman of a global task force overseeing Russia’s reform, said the nation had not yet met the conditions for reinstatement. Among those conditions is that Russia’s national antidoping agency be fully recertified by the World   Agency, the global regulator of drugs in sports. That agency has suggested it may grant Russia partial certification in May, track officials said Monday, and full certification in November. Only after that point, Mr. Andersen said, would track and field authorities consider restoring Russia to good standing. “The criteria were very clear,” said Sebastian Coe, president of the International Association of Athletics Federations, track and field’s global governing body. “They were unambiguous. They were not suffused in politics. ” Mr. Coe and Mr. Andersen said there had been some progress in Russia in recent months, including the election of a new president of Russian track and field, Dmitry Shlyakhtin. They said they had been reassured that Russia would cooperate with France’s continuing criminal investigation, which focuses on bribery and corruption in global track and field, and that the Russian government would provide financial support to national antidoping operations without interfering in them. Mr. Mutko, Russia’s deputy prime minister and former sports minister, has acknowledged broad problems with doping but denied a   system of cheating. Since his promotion by President Vladimir V. Putin last fall, Mr. Mutko has grown increasingly defiant in responding to the mountain of evidence that Russia has systematically doped with government assistance, most notably at the 2014 Sochi Olympics  —   where Russia’s longtime national antidoping lab chief, Grigory Rodchenkov, said he substituted   urine with clean urine. In December, after WADA laid bare the results of a   investigation, Mr. Mutko went so far as to say that female Russian hockey players who competed at the Sochi Games had been found to have male D. N. A. in their urine samples because they had had sex. Scientific experts dismissed that explanation as impossible, calling it clear evidence of sample tampering. Another condition of Russia’s reinstatement highlighted on Monday in Monaco was that the nation’s leadership accept, or credibly rebut, the extensive evidence of   cheating, including the involvement of the sports ministry and Russia’s federal security service, or F. S. B. “The question of apologies is one that we have raised every time we have been to Moscow,” Mr. Andersen said Monday. “In general, I wouldn’t pinpoint any specific person that needs to say apologies,” he said. “But we expect that the Russian community is acknowledging that they have a problem, because only when you acknowledge you have a problem can you do something about it. ” In December, several Russian sports officials told The New York Times they were no longer disputing the cheating schemes that had been uncovered, though they insisted top government officials had no part in them. “Of course it was an institutional conspiracy, but not ” said Anna Antseliovich, the acting director general of Russia’s national antidoping agency. While Russia remains barred, 35 Russian athletes have so far petitioned to participate in global competitions in 2017, track officials said Monday. They include Yuliya Stepanova, a   runner and   who helped ignite the Russian doping scandal and who is living in hiding in the United States. Ms. Stepanova ran as a neutral athlete in a global indoor competition in Boston late last month. “There have been some subtle shifts, and I think there is a recognition that this clearly has been a very disfiguring episode in Russian sport,” Mr. Coe said. “I’m encouraged, but I’m not cavalier about the amount of work that there still remains to be done. ” Also on Monday, Mr. Coe announced a freeze on nationality transfers, seeking to protect athletes  —   especially those from Africa, he said  —   from changes in allegiance before a new set of rules was in place. “What we have is a wholesale market for African talent open to the highest bidder,” Hamad Kalkaba Malboum, a track and field official representing Africa, said Monday. “Our present rules are being manipulated to the detriment of athletics’ credibility. ”'"}, "time": 1742564030.559646}