{"duration": 0.03809499740600586, "input_args": {"text": "'The veteran television personality Jane Pauley will replace Charles Osgood as the anchor of the highly rated CBS show “Sunday Morning. ” Mr. Osgood, who is retiring, announced the news on his last show on Sunday. Ms. Pauley’s first day in the role will be Oct. 9, and she will become only the third anchor of the show, which started in 1979. For Ms. Pauley, 65, a return to the anchor role for a morning television show represents an unexpected   comeback. And by selecting her instead of a younger    CBS is clearly trying to ease the transition from Mr. Osgood, 83, whose folksy delivery has been a mainstay on the show for more than two decades. In a statement, the president of CBS News, David Rhodes, said, “Charles Osgood is a television news legend  —   and so is Jane Pauley. ” Ms. Pauley first catapulted to fame at age 25 when she replaced Barbara Walters as an anchor of the “Today” show 40 years ago. She remained with “Today” through the late 1980s until the notoriously messy handoff in 1989, when Ms. Pauley left the show and was replaced by Deborah Norville. Ms. Pauley later was a host of NBC’s newsmagazine “Dateline” from 1992 to 2003. But for much of the next decade,   television opportunities dwindled for Ms. Pauley, though she had a daytime talk show that lasted a season and she made appearances on “Today. ” She became a CBS contributor two years ago and has filled in for Mr. Osgood on “Sunday Morning” and for Scott Pelley on the “CBS Evening News. ” She has reported stories for the Sunday morning show, including the only television interview with David Letterman in the   to his retirement last year. The transition is an important one for the network. “Sunday Morning” is a powerful ratings machine: It attracts nearly six million viewers and is by far the   Sunday morning news show. Its big viewership has helped the show that follows it, “Face the Nation,” remain the   Sunday morning public affairs show. (“Meet the Press” on NBC attracts the most viewers in the   to    bracket coveted by advertisers.) And this is the second consecutive year that CBS has had a peaceful Sunday morning handoff, something that can be rare for morning shows. (Recall the departures of Ms. Pauley or Ann Curry from “Today,” or David Gregory’s firing from “Meet the Press. ”) Last year, Bob Schieffer introduced John Dickerson on the air as the new anchor of “Face the Nation,” just as Mr. Osgood did with Ms. Pauley on Sunday. “Charles Osgood set the standard for ‘CBS Sunday Morning,’” Ms. Pauley said in a statement. “And it’s a great honor to be given the chance to further our show’s legacy of excellence. I look forward to bringing loyal viewers the kind of engaging, original reporting that has made the broadcast so irresistible for so long. ”'"}, "time": 1742562676.8324277}