{"duration": 0.12064290046691895, "input_args": {"text": "'The Department of Veterans Affairs (VA) had been aware of, but did nothing about, the mental problems afflicting Esteban Santiago Ruiz before he attacked Florida’s Ft. Lauderdale international airport. [Ruiz is a veteran of both the Alaska and Puerto Rico National Guard and had sought treatment for mental illness at the VA, according to the shooter’s former girlfriend.  “We had let Veterans [Affairs] know that he was having some mental problems, that he wasn’t feeling all right, and they did nothing,” Esteban’s former girlfriend Michelle Quiñones told ABC News. “They didn’t do anything. ” The Sun Sentinel reports that the VA in Puerto Rico said it had provided Santiago, who killed five people at the airport and wounded six others, with some medical treatment, but added that his family did not have any details. According to the news outlet, the VA headquarters in Washington, D. C. issued a statement that indicated the agency was not providing any benefits to Esteban, without elaborating further. “The FBI failed there,” Bryan Santiago, the killer’s brother told the Associated Press (AP). “We’re not talking about someone who emerged from anonymity to do something like this. ” “The federal government already knew about this for months, they had been evaluating him for a while, but they didn’t do anything,” he added in Spanish, speaking outside his family’s house in Peñuelas, Puerto Rico and echoing the killer’s former girlfriend. Nearly a month prior to the deadly incident in Florida, Estaban confessed to the FBI in Alaska, where he was residing at the time, that he was suffering from government mind control linked to Islamic State ( ) videos. The FBI reportedly contacted the Anchorage police department and told the police the veteran had been having “terroristic thoughts” and believed he was being influenced by ISIS. As a result the authorities took him to a mental facility, revealed Anchorage Police Chief Chris Tolley. AP quotes Tolley as saying the shooter “left a gun and his newborn child in his vehicle when he went to the FBI office. Police held the gun until Santiago was released and contacted him about picking up the weapon, which he did on Dec. 8. ” Authorities in Alaska have reportedly defended the actions they took in regards to Esteban. The shooter broke no laws when he walked into the Anchorage FBI office “making disjointed comments about mind control,” Special Agent in Charge Marlin Ritzman told reporters on Saturday. Ritzman identified Esteban as a “  complaint,” which he said FBI offices across the country receive daily. Meanwhile, some of the Iraq War combat veteran’s family members thought Esteban had “lost his mind in Iraq,” before the shooting. “He started talking to me, you know, that he’s seeing things weird things, that he’s hearing voices, that the government is using him  …     that the CIA is sending him secret codes to his laptop. And that he don’t want to do that. So I told to him go and ask for help,” said the shooter’s brother Bryan. “Go to the church or to psychologist or something. ” Two members of Esteban’s unit were killed during his yearlong deployment to Iraq, the New York Times learned from Lt. Col. Candis Olmstead, a spokeswoman for the Alaska National Guard. Although it remains unclear whether the shooter suffered from   Stress Disorder (PTSD) as many as one in five veterans who served in Iraq or Afghanistan are diagnosed with the affliction each year, according to the VA, notes AP. “A 2014 Veterans Affairs study found that almost 30 percent of veterans returning from Iraq and Afghanistan who sought treatment at VA hospitals were diagnosed with PTSD symptoms,” it adds. The VA has received criticism in recent years for providing inadequate health services to veterans or no care at all. Last year, a    Navy veteran Peter A. Kaisen committed suicide in the parking lot of the of a VA hospital after reportedly being turned away for emergency care. In July 2016, the VA itself acknowledged the existence of a mental health epidemic among veterans, noting that 20 veterans committed suicide per day in 2014. Christian Santiago, identified by the Miami Herald as someone who served with Esteban in Iraq, wrote on Facebook about the toll the war took on the shooter and others in their company. “The [Veterans Administration] makes life impossible and often denies us rights acquired  …     the government, the Army  …     will not take PTSD seriously,’’ he wrote. DisabledVeterans. org, a website founded by veterans advocate and lawyer Benjamin Krause, suggests Esteban may be one of the many veterans who suffer from severe mental health issues and are not receiving treatment at the VA or the U. S. Department of Defense (DOD). The deadly incident “certainly highlights failures between DOD and VA where veterans fall through the cracks who obviously suffer from mental health problems,” reports the organization. According to the Alaska Army National Guard spokeswoman Olmstead, Esteban had received a general discharge from the Alaska Army National Guard in August 16, 2016, for unsatisfactory performance. AP, citing the Pentagon, also reports that the shooter had gone AWOL several times and was demoted and discharged.'"}, "time": 1742561869.2013361}