{"duration": 0.08015203475952148, "input_args": {"text": "'“I heard someone once say that we’re only as sick as our secrets,” Carrie Fisher wrote in her 2008 memoir “Wishful Drinking. ” Ms. Fisher didn’t, it seems, harbor many secrets. A prolific writer and chronic oversharer, she published several heavily autobiographical novels, including the best seller “Postcards From the Edge,” which drew on her struggles with drug abuse and mental illness, and three memoirs that recounted her experiences growing up in the shadow of Hollywood royalty, her affair with Harrison Ford while shooting the “Star Wars” films, and her   battle with bipolar disorder. One of her final creative acts was publishing her memoir “The Princess Diarist,” which came out last month. Ms. Fisher’s literary legacy seemed to offer some solace to fans mourning her death this week, at age 60. “The Princess Diarist,” which drew on the diaries Ms. Fisher wrote when she was a    actress on the cusp of fame for playing Princess Leia, rose to the top of Amazon’s   list, and was listed as temporarily out of stock on Thursday. Blue Rider Press, which published the book, plans to reprint 65, 000 copies, in addition to the 173, 000 copies already in circulation. “Postcards From the Edge” and “Wishful Drinking” also rose to the top 10 on Amazon and were out of stock. Simon  Schuster, which published those books, is reprinting another 20, 000 copies of “Wishful Drinking” and 17, 500 copies of “Postcards From the Edge. ” Over all, Simon  Schuster has sold some 500, 000 copies of Ms. Fisher’s books. Readers also turned to “Unsinkable,” a 2013 memoir published by Ms. Fisher’s mother, the actress Debbie Reynolds, who died at age 84 on Wednesday, one day after her daughter. (“Unsinkable” rose to No. 395 on Amazon on Thursday, from 24, 172.) Following Ms. Fisher’s death on Tuesday, some novelists praised her prose as being as blunt, funny and honest  —   much like Ms. Fisher. “Fisher’s legacy includes her written words  —   cutting, clever, observant,   and unbowed,” the science fiction writer John Scalzi wrote in The Los Angeles Times.'"}, "time": 1742562171.457783}