{"duration": 0.239607572555542, "input_args": {"text": "\"\\nAnother day, another scandal…but this one might turn out to be the most damaging so far.\\nOn October 28, FBI director James Comey informed the Senate Judiciary Committee via letter that the agency would be re-opening its investigation into Hillary Clinton’s use of a private email server.\\nComey wrote:\\nIn connection with an unrelated case, the FBI has learned of the existence of emails that appear to be pertinent to the investigation … I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.\\nLater that day, The New York Times provided an intriguing update:\\nEmails from Hillary Clinton’s private server were found after the F.B.I. seized electronic devices once shared by Anthony D. Weiner and his estranged wife, Huma Abedin, a top aide to Mrs. Clinton, federal law enforcement officials said Friday.\\nThe F.B.I. is investigating illicit text messages that Mr. Weiner, a former Democratic congressman from New York, sent to a 15-year-old girl in North Carolina. The bureau told Congress on Friday that it had uncovered new emails related to the Clinton case — one federal official said they numbered in the thousands — potentially reigniting an issue that has weighed on the presidential campaign and offering a lifeline to Donald J. Trump less than two weeks before the election.\\nNow, Weiner is reportedly cooperating with the FBI…and gave them a laptop that he shared with his estranged wife…which means no warrant is necessary to search that particular device.\\nIs it possible that he will get some sort of deal based on an agreement to testify?\\nOne can’t help but wonder what the FBI is going to find on that laptop. There are a reported 650,000 emails to scour through. It will take weeks – possibly longer – to sort through them, and the election is just days away.\\nThere’s a particularly disturbing rumor circulating about the emails…\\nRumors stirring in the NYPD that Huma's emails point to a pedophila ring and @HillaryClinton is at the center. #GoHillary #PodestaEmails23 pic.twitter.com/gkEH5oL269 \\n— David Goldberg (@DavidGoldbergNY) October 30, 2016 \\n\\nI would not report this unless I was 100% sure – known this source 15+ years\\n— Greg Hilliard (@UnityActivist) October 31, 2016 \\n\\nNow, to clarify again – this IS just a rumor – unsubstantiated as of now. \\nAnd it sounds preposterous…until you consider that child sex rings among the powerful elite have been reported for years. Bill Clinton has been linked with a convicted billionaire pedophile named Jeffrey Epstein , who pimped out underage girls to powerful men. Flight logs show that Clinton was a frequent flyer on the registered sex offender’s infamous jet.\\nIn May, Fox News reported :\\n…flight logs showing the former president taking at least 26 trips aboard the “Lolita Express” — even apparently ditching his Secret Service detail for at least five of the flights, according to records obtained by FoxNews.com.\\n…trips between 2001 and 2003 included extended junkets around the world with Epstein and fellow passengers identified on manifests by their initials or first names, including “Tatiana.” The tricked-out jet earned its Nabakov-inspired nickname because it was reportedly outfitted with a bed where passengers had group sex with young girls.\\nConchita Sarnoff of the Washington, D.C. based non-profit Alliance to Rescue Victims of Trafficking and author of a book on the Epstein case told Fox:\\nBill Clinton … associated with a man like Jeffrey Epstein, who everyone in New York, certainly within his inner circles, knew was a pedophile. Why would a former president associate with a man like that?\\nAlso from Fox:\\nEpstein, who counts among his pals royal figures, heads of state, celebrities and fellow billionaires, spent 13 months in prison and home detention for solicitation and procurement of minors for prostitution. He allegedly had a team of traffickers who procured girls as young as 12 to service his friends on “Orgy Island,” an estate on Epstein’s 72-acre island, called Little St. James, in the U.S. Virgin Islands.\\nWhy didn’t Epstein face harsher punishment?\\nRemember, he’s a billionaire with friends in high places.\\nMore shocking details from Fox:\\nThe U.S. Attorney for the Southern District of Florida prepared charging documents that accused Epstein of child sex abuse, witness tampering and money laundering, but Epstein took a plea deal before an indictment could be handed up.\\nOn Sept. 24, 2007, in a deal shrouded in secrecy that left alleged victims shocked at its leniency, Epstein agreed to a 30-month sentence, including 18 months of jail time and 12 months of house arrest and the agreement to pay dozens of young girls under a federal statute providing for compensation to victims of child sexual abuse.\\nIn exchange, the U.S. Attorney’s Office promised not to pursue any federal charges against Epstein or his co-conspirators.\\nFlorida attorney Brad Edwards, who represented some of Epstein’s alleged victims, is suing the federal government over the secret non-prosecution agreement in hopes of having it overturned. Edwards claimed in court records that the government and Epstein concealed the deal from the victims “to prevent them from voicing any objection, and to avoid the firestorm of controversy that would have arisen if it had become known that the Government was immunizing a politically-connected billionaire and all of his co-conspirators from prosecution of hundreds of federal sex crimes against minor girls.”\\nOh, but there’s more . According to the pilots’ logbooks, which surfaced in civil litigation surrounding Epstein’s crimes, this happened in 2002…\\n…Clinton, his aide Doug Band, and Clinton’s Secret Service detail are listed on a flight from Japan to Hong Kong with Epstein, Maxwell, Kellen, and two women described only as “Janice” and “Jessica.” One month later, records show, Clinton hopped a ride from Miami to Westchester on a flight that also included Epstein, Maxwell, Kellen, and a woman described only as “one female.”\\nWhy hasn’t Donald Trump added Bill’s Epstein ties to his arsenal against Hillary? He’s brought up the women who have accused Bill of sexual assault and rape.\\nWhy would he leave out Epstein?\\nProbably because Trump also knows Epstein – very well, actually – as reported in a 2002 New York magazine profile titled Jeffrey Epstein: International Moneyman of Mystery :\\nEpstein likes to tell people that he’s a loner, a man who’s never touched alcohol or drugs, and one whose nightlife is far from energetic. And yet if you talk to Donald Trump, a different Epstein emerges. “I’ve known Jeff for fifteen years. Terrific guy,” Trump booms from a speakerphone. “He’s a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side. No doubt about it — Jeffrey enjoys his social life.”\\nTrump’s name and contact information is in Epstein’s black book – but so are the names and contact information for MANY other prominent and influential people, including Prince Bandar of Saudi Arabia, Tony Blair, former Utah governor and Republican presidential candidate Jon Huntsman, Senator Edward Kennedy, Henry Kissinger, David Koch and Pepe Fanjul, according to a report by Vice .\\nIn 2010 , Epstein pled the Fifth when asked by a lawyer representing one of Epstein’s victims about his relationship with Trump:\\nQ: Have you ever had a personal relationship with Donald Trump?\\nA. What do you mean by “personal relationship,” sir?\\nQ. Have you socialized with him?\\nA. Yes, sir.\\nQ. Yes?\\nA. Yes, sir.\\nQ. Have you ever socialized with Donald Trump in the presence of females under the age of 18?\\nA: Though I’d like to answer that question, at least today I’m going to have to assert my Fifth, Sixth, and 14th Amendment rights, sir.\\nBoth Trump and Epstein are named in a lawsuit for the rape of a 13-year old girl who is using the name Katie Johnson that allegedly occurred at a “sex party” way back in 1994, but the veracity of the case has yet to be determined. Judge Ronnie Abrams has scheduled an initial status conference in the civil lawsuit for December 16 in a New York district court.\\nTrump has vociferously denied the accusations. Epstein, an associate of the UK’s Prince Andrew who was convicted of underage sex crimes in Florida in 2008, has also denied the allegations. A lawyer for the Trump Organization told the Guardian in July: “This is basically a sham lawsuit brought by someone who desires to impact the presidential election.”\\nEdwards, who has represented Epstein victims, spoke with Johnson and declined to take her case, as The Daily Beast reported:\\nConcerning Trump’s involvement in Epstein’s illicit affairs, Edwards said he hadn’t seen any evidence that would implicate the GOP nominee and described Trump as “extremely helpful and honest,” during questioning.\\nIn 2014 , another young woman filed a lawsuit claiming that Epstein used her as a sex slave for his powerful friends—and that she’d been at parties on his private island with Bill Clinton.\\nEpstein also reportedly donated money to the Clinton Foundation – even after he was convicted.\\n****\\nBack in July, a 4chan user by the name of FBI Anon shared some inside information, which was then posted on Reddit .\\nWhen asked if Hillary sold weapons and favors from the State Department for cash to our enemies, FBI Anon replied : “Weapons, favors, intelligence, and people.” \\nWhen asked what the Clinton Foundation does, FBI Anon replied: “Sold intel, favors, and people to anyone willing to pay.” \\nRegarding a possible Hillary indictment, FBI Anon said , “There is enough for her and the entire government to be brought down. People do not realize how enormous this whole situation actually is. Whether she will be or not depends on how much info about others involved gets out, and there are a lot of people involved.” \\nMore quotes from FBI Anon:\\n“The real point of interest is the Clinton Foundation, not the email server. We received the server from Benghazi, then from the server we found data on the CF. Then we realized the situation is much worse than previously thought.” \\n“The DOJ is most likely looking to save itself. Find everyone involved in the Clinton Foundation, from its donors to its Board of Directors, and imagine they are all implicated.” \\n(Could this be why the DOJ tried to stop the investigation into the Clinton Foundation?)\\n“My message to you and everyone on this board is do not get distracted by Clinton’s emails. Focus on the Foundation. All the nightmarish truth is there. The emails will pale in comparison.” \\nMore, from page 2 :\\nWhen asked if the people leading the investigation are blackmailed pedophiles: “No. The people under the magnifying glass do have an affinity for children.” \\nWhen asked what would happen if all of the information regarding the Clinton Foundation was released to the public: “Total chaos. The government would be exposed at every layer, who pays who, who buys what, and no one has yet asked about the human trafficking bits I have been laying out.” \\nWhen asked if members of Congress own strip clubs and have their own sex slaves?: “Epstein.” \\n“Pedophiles and sex traffickers everywhere. Many politicians trade girls like cattle.” \\n“BC (Bill Clinton) is a confirmed pedo.” \\n“Sex rings are popular in all governments, but pedophilia is primarily in British parliament & Saudi Arabia, and that’s why HRC and BC love foreign donors so much. They get paid in children as well as money. Dig deep and you can find it. It will sicken you.” \\nOf course, all of this could be fabricated by a person pretending to have inside information. We may never know the truth. But if these claims are true, they are deeply disturbing. \\n****\\nIn August 2015, Trump made an interesting prediction…\\nIt came out that Huma Abedin knows all about Hillary’s private illegal emails. Huma’s PR husband, Anthony Weiner, will tell the world.\\n— Donald J. Trump (@realDonaldTrump) August 3, 2015 \\n\\nWhat will the emails (and perhaps other information) on Weiner’s devices reveal?\\nWill it be more revelations regarding play-for pay schemes, election rigging, or email-scrubbing?\\nOr will something more sinister be uncovered?\\nHillary has called for the FBI to release details about the latest probe to the public “Immediately.”\\nCould that be because she knows they WON’T publicize the information if it would bring down MANY of her government colleagues and cause mass chaos and disruption?\\nTime will tell.\\nIt would be something, though – wouldn’t it – if both Clintons were brought down by misbehaving weiners?\\nOh, and speaking of perverted folks…\\nTwo days ago, during an interview with Michael Smerconish of CNN, Creepy Uncle Joe Biden learned, on live TV, that the new emails being reviewed by the FBI are related to the investigation of Anthony Weiner. Watch his response.\\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Lily Dane of The Daily Sheeple . \\nLily Dane is a staff writer for The Daily Sheeple. Her goal is to help people to “Wake the Flock Up!” \""}, "time": 1742561717.3622222}