{"duration": 0.11450886726379395, "input_args": {"text": "'Thousands of women in Nigeria took the streets of the northern capital Maiduguri this weekend to protest the government’s inability to eradicate the Islamic State affiliate Boko Haram, which has not ceased in committing mass abductions, rapes, and murders since the government claimed victory over them in 2015. [Recent reports indicate that Boko Haram terrorists, mostly sheltered in the dense Sambisa Forest of the nation’s northeast, have continued to force poor underage girls to engage in suicide bombings, paying them as little as 50 cents for their lives.  The women who organized in Maiduguri, the capital of northeastern Borno state, did so to attract the attention of representatives of the United Nations Security Council, who were visiting the city to evaluate the condition of the refugee and   person (IDP) camp for Boko Haram victims in the area. The protests targeted not only Boko Haram terrorists but the government of President Muhammadu Buhari in Abuja, who won the nation’s presidency on a campaign promise to ride the nation of Boko Haram entirely. Protesters complained that the government was not doing enough to ensure the safety of IDPs at the camp in question. “We told the (UN) delegation about our   grievances. There’s no food, there is nothing good here for us,” one protester told the Agence  . “We were expelled from our homes by Boko Haram and we came to Maiduguri to seek refuge, but unfortunately we haven’t been well treated. ”   Reports of abuse of Boko Haram victims at the Maiduguri camp have continued to surface for years. In September, an NGO report revealed that Nigerian officials had done such an inadequate job feeding the refugees that many of the women and girls stranded there were forced to have sex with Nigerian soldiers in exchange for food to survive. Many Boko Haram victims are either pregnant or have given birth to children after being repeatedly raped by Boko Haram jihadists, making their need for a stable food source even more desperate.     A report published a month later accused Nigerian soldiers of raping Boko Haram victims, sometimes impregnating them or coercing sex out of them by promising them marriage and a stable home. 43 women told Human Rights Watch that they had experienced “sexual abuse, including rape, and exploitation” at the hand of Nigerian soldiers. Buhari vowed to investigate the charges upon the release of the report. The abuse and neglect in Nigeria’s northern refugee camp have led some women to choose to join Boko Haram. The terrorist group, some women have told NGOs, offered “financial empowerment” by ensuring the women are fed and teaching them to read and write in Arabic  —   in order to study the Quran  —   so long as they succumb to extreme sexual abuse. In addition to abusing its residents, the Nigerian military conducted an airstrike on the Maiduguri camp in January, killing over 100 displaced Nigerians. The military called the bombing a “regrettable operational mistake. ”   protests have not solely occurred against Buhari in Nigeria. On Saturday, thousands of protesters took over Niamey, the capital of Niger, demanding President Idriss Deby improve the quality of life in Niger. The protesters demanded an improved economy and the release of political prisoners, holding signs reading “Life is too hard. ” The nation’s economy has been hit by, among other factors, a wave of mass abductions and suicide bombings by Boko Haram. Borno state lies on the Niger border, allowing Boko Haram terrorists access to that country as well as neighboring Cameroon. Despite claims from both governments that the Boko Haram threat has been significantly limited, reports this week indicate that Borno residents continue to face the near constant threat of suicide bombings, abductions, and other jihadist activity. Boko Haram terrorists often seek young women and girls to conduct their terrorist attacks, as they can hide bombs under their Islamic clothing. A Sky News report published this week reveals one such exchange, in which a Boko Haram terrorist pays a    girl 50 cents to wear a suicide bomb and explode it in a Maiduguri market. The girl surrendered to police before detonating her explosives. In one attempt to disguise a suicide bombing, as police have learned to suspect of young girls, Boko Haram sent two women holding an infant into a village to detonate a bomb in May 2016. The Foundation for the Defence of Democracies (FDD) estimates that women and girls tied to Boko Haram have committed at least 123 suicide bombings in the past three years. These women are among the estimated thousands Boko Haram has abducted and forced into slave marriages and terrorist activity. While Boko Haram jihadists turn their young girls into suicide bombers, the boys are taught at an early age how to properly rape women while limiting the chances of her escape. “They tell us to remember to hold the girl tight on both hands, pinned to the floor,” a    boy identified as “Ahmed” explained to reporters last year. “They said we shouldn’t let a woman overpower us. ” President Buhari declared that Nigeria had “won the war” against Boko Haram in December 2015 and has not yet retracted that claim.'"}, "time": 1742563371.191733}