{"duration": 0.10507631301879883, "input_args": {"text": "'WASHINGTON  —   With tensions escalating between   Donald J. Trump and prominent black leaders, Mr. Trump met privately on Monday with the eldest son of the Rev. Dr. Martin Luther King Jr. on the holiday devoted to the civil rights hero. The hastily arranged meeting at Trump Tower occurred as Mr. Trump feuded publicly with  Representative John Lewis, Democrat of Georgia, who fought for civil rights alongside Dr. King. It has highlighted the challenges Mr. Trump faces as he prepares to take office on Friday deeply distrusted by minorities across the country, many of whom have been offended by his false allegations that President Obama was born outside the United States, appalled that his candidacy drew backing from white supremacist organizations, and dismayed at policy proposals they consider antithetical to their interests. Mr. Trump on Monday did not address those issues, appearing in the lobby to allow news cameras to capture pictures of him shaking hands with Martin Luther King III, but ignoring questions shouted by reporters about their conversation or his statements about Mr. Lewis. Tentative plans for Mr. Trump to visit the Smithsonian Museum of   History and Culture in Washington, as the nation paused to remember Dr. King, had been shelved in favor of the   session, which lasted just under one hour. But Mr. Trump made sure that journalists had an opportunity to see him with Mr. King, a visual manifestation of his stated aspiration to unite a divided nation. Mr. King said the session, which included a discussion about voting rights, had been “constructive,” and described Mr. Trump as eager to present himself as inclusive. “He said that he is going to represent Americans  —   he’s said that over and over again,” Mr. King, the president of the Drum Major Institute, a progressive New   public policy organization, told reporters. “We will continue to evaluate that. ” On Monday, Mr. King sought to defuse the furor surrounding Mr. Trump’s remarks about Mr. Lewis, saying, “In the heat of emotion, a lot of things get said on both sides. ” Mr. King has pressed for the creation of a free photographic government identification card to make it easier for Americans who do not have driver’s licenses, including many black voters, to cast ballots, and he indicated on Monday that Mr. Trump had taken an interest in the plan. “It is very clear that the system is not working at its maximum,” Mr. King told reporters. “We believe we provided a solution. ” But other leaders said Mr. Trump’s relationship with    —   tense bordering on toxic after a strident campaign that instilled fear, and a transition that has done little to allay their concerns  —   would not improve unless the   altered both his tone and his policy positions. “There’s a lot of anxiety, there’s a lot of distrust, there are people who have expressed to me that they’re scared of what his policies might entail,” said Marc Morial, the president of the National Urban League. Mr. Trump won election with 8 percent of the   vote, according to exit polls. A Pew Research Center poll in November found roughly   of African Americans believed race relations would worsen during his presidency. The Rev. Al Sharpton said nothing underscored Mr. Trump’s challenge more vividly than his outburst in a pair of Twitter postings on Saturday that called Mr. Lewis, who was brutally beaten in the “Bloody Sunday” march in 1965 in Selma, Ala. “all talk,” and said that instead of “falsely complaining” about the election results, he should focus on fixing his “falling apart” and “crime infested” Georgia district. Mr. Lewis actually represents a district that includes part of the wealthy enclave of Buckhead the world’s busiest airport,   the Centers for Disease Control and Prevention and the Georgia Institute of Technology. Mr. Trump’s remarks were a reaction to an interview on Friday in which Mr. Lewis said he would not attend the inauguration and did not see Mr. Trump as a legitimate president because of questions about whether Russian hacking had affected the American election. “If you can disrespect John Lewis on Martin Luther King Day, then what are you saying about the rest of us?” Mr. Sharpton said, adding that no single meeting Mr. Trump could hold would alleviate the concerns felt in the   community. “He seems to have a   very negative view of what black America looks like, and that is frightening to many black Americans. ” Mr. Sharpton said he was concerned that Mr. Trump was more interested in public appearances than substantive meetings with   activists and lawmakers to address issues of voting rights, criminal justice and policing reform, health care and economic inequality. “He still thinks that we’re playing television red carpet here, rather than dealing with the presidency of the United States, with something of real substance. This is not a ” Rev. Sharpton said. Sean Spicer, Mr. Trump’s press secretary and communications director, announced the meeting in New York between Mr. Trump and Mr. King in a morning posting on Twitter. In a series of television interviews on Monday, Mr. Spicer said Mr. Lewis had started the fight with his “disappointing” assertion that Mr. Trump was not a legitimate president, and he defended the  ’s decision to respond, telling CBS that the   is “not going to sit back and just take attacks without responding. ” Still, Mr. Trump himself had seemed to temper his attack on Mr. Lewis subtly by Saturday night he said that the congressman should help him focus on “burning and crime infested  ” throughout the United States and added, “I can use all the help I can get!” Outside the   history museum in Washington on Monday, some visitors argued that the episode said more about the  ’s thin skin than his views on race. “Somebody said something bad and he’s got to say something back,” said Nancy Alston of Columbia, Md. “He said bad stuff about Meryl Streep, too. ” Ginelle Johnson, 35, of San Diego, said that she believed Mr. Trump’s comments were motivated by how he views minorities. But she also said that they appeared to show his proclivity to hit back at whoever criticizes him. “Politics has become entertainment and I think Trump is just a bully,” Ms. Johnson said. Mr. Trump’s brief sighting on Monday afternoon at Trump Tower was a striking contrast to President Obama, who spent part of Monday  —   his final observance of Martin Luther King’s Birthday in office  —   making a stop at a homeless shelter in Washington. Earlier, his wife, Michelle Obama, had spoken out subtly in her own Twitter post, saying she was, “Thinking of Dr. King and great leaders like @repjohnlewis who carry on his legacy. ” “May their example be our call to action,” she wrote.'"}, "time": 1742563012.0795321}