{"duration": 0.06359028816223145, "input_args": {"text": "'If you want to support the show and receive access to tons of bonus content, subscribe on our Patreon page for as little as $5 a month. Also, don’t forget to subscribe, rate, and review the show on iTunes . We can’t do this show without your support!!! \\nOn this episode, we keep the focus on the massive, nationwide #PrisonStrike that began on September 9th and which we covered in our last episode. \\nFirst, we play a clip from On The Media with Azzurra Crispino, our guest from last week. Azzurra is media co-chair for the Incarcerated Workers Organizing Committee (IWOC), a branch of the Industrial Workers of the World (IWW) and an Associate Professor of Philosophy at Austin Community College and Co-Founder of Prison Abolition Prisoner Solidarity , an organization dedicated to supporting prisoners and prison abolition efforts. In the clip, she asks whether mainstream media is complicit in violence within prisons because they only cover prison resistance when it turns violent, ignoring non-violent resistance like the current strike. Kumars and Roqayah discuss this point and brainstorm ways to get around this sad reality.\\nNext, Kumars interviews “D”, the incarcerated strike leader from South Carolina who we spoke to in our last episode. Kumars gets an update from D about conditions on the ground where he is, and the repression he and others have faced as they keep their strike alive. Importantly, D discusses the lasting changes in terms of prisoner consciousness and solidarity he already sees, and discusses next steps for this movement which will not end until prisons as we currently know them cease to exist.\\n\\nIf you want to learn more or get involved:\\nDonate to IWOC to support striking prisoners\\nWrite letters to incarcerated strike leaders facing repression \\nBoycott products made with prison slave labor \\nCall prisons to tell them to meet prisoner demands and halt repression \\nBail out arrested prison strike supporters \\nFree Alabama Movement \\nIWOC Facebook page \\nPrison strike timeline and other useful information \\nStrike tracking state-by-state \\nAlso, email iwoc@riseup.net to get involved with an IWOC chapter near you!\\nFollow Azzurra Crispino on twitter at @LibertyHerbert and IWOC at @IWW_IWOC .\\nThe post Delete Your Account – Episode 18: Prison Strike Update appeared first on Shadowproof .\\n'"}, "time": 1742561772.0047927}