{"duration": 0.04768681526184082, "input_args": {"text": "'0 comments Reporters filled the room for the alleged victim’s Press Conference, then it went down like this… An anonymous woman, known as Jane Doe, scheduled a Press Conference today to speak publicly, for the first time, about her story of rape. She says that, in 1994, she was offered modeling work and money in exchange for her attendance to a series of parties. These parties were to be held at the home of Jeffrey Epstein, who is now a convicted, registered sex offender. Epstein served thirteen months of an eighteen month sentence for running a prostitution process that involved minors. It should be noted that former President William Jefferson Clinton, husband of Democrat Presidential Nominee Hillary Clinton, has been tied to Jeffrey Epstein. Allegedly, Bill Clinton flew on Epstein’s jet multiple times, and even ditched his Security Detail more than once to do so. Epstein is reported to run a vacation island where wealthy individuals can go to have sex with strangers. According to Jane Doe, she attended four parties at Epstein’s venue, and Donald Trump approached her in a sexual way at every party. Allegedly, Trump raped her at the fourth and final party that she attended. Now, one week before the Presidential Election of 2016, Jane Doe scheduled a Press Conference to speak of her experience, publicly, for the first time. Doe is represented by Lisa Bloom, daughter of celebrity ambulance-chasing lawyer Gloria Allred. She is asking for $75,000 in damages. Trump’s response to the allegation is clear. “The allegations are not only categorically false, but disgusting at the highest level and clearly framed to solicit media attention or, perhaps, are simply politically motivated. There is absolutely no merit to these allegations. Period.” The Press Conference was to happen today, but, unfortunately for Jane Doe’s lawyer, was cancelled. Lisa Bloom cancels press conference said Jane Doe against Trump accuser has received threats and is too scared pic.twitter.com/et5HnhfOJk \\n— Claudia Rosenbaum (@CJRosenbaum) November 2, 2016 According to the attorney: “Jane Doe has received numerous threats today, as have all the Trump accusers that I have represented,” Bloom told reporters. “She is living in fear. She has decided that she is too afraid to show her face. She has been here all day, ready to do it, but unfortunately, she’s in terrible fear.” So, too bad for Hillary, as well, the photo op did not happen. In the event that this event is new to you, here are “5 Fast Facts” about the case: 1. She Says Trump Raped Her When She Was 13 Years Old 2. Donald Trump Knew Jeffrey Epstein at the Time 3. The Statute of Limitations for Rape in New York Has Expired 4. Trump Calls the Allegation ‘Categorically False’ and ‘Disgusting’ 5. Her Attorney is Lisa Bloom, the Daughter of Gloria Allred Will this case amount to a hill of beans in the 2016 Election? Probably not, but who knows at this time. One thing is certain: more craziness is to come!'"}, "time": 1742561965.8945239}