{"duration": 0.020328044891357422, "input_args": {"text": "'Friday, 4 November 2016 Fecal Storm Alert Levels hovering at 7.5 \\nPhotographs released today from outer space show a monstrous cloud of dung hovering over the United States. \\nPundits theorize the nitty-gritty of this fecal storm comes down to problems between FBI Director James Comey and the Hillary Clinton campaign. \\nMr. Comey broke protocol on October 28 by announcing Clinton\\'s email investigation was back on. \\nResponses with the sound of a pack of dogs baying on a moonlit night ranged from Harry Reid to Michael Moore and The Washington Post. \\nMs. Clinton\\'s poll numbers dropped. \\nBack in July Mr. Comey found no evidence sufficient to indict, only \"extreme carelessness.\" \\nFor many, this verdict was \"too soft.\" \\nBut on October 28 a new batch of emails connected to Mr. Anthony Weiner\\'s computer indicated more to investigate. \\nThe US public should stand forewarned, according to Mr. Comey. \\nIf kept under wraps but something emerged, he would be up against a new charge of covering up in October. \\nThe fecal cloud over the US swirled and darkened. \\nInvolved: \\n*Mr. Comey is abandoning The Hatch Act which states nothing foul or incendiary should be acted on within 60 days of the election. \\n*Mr. Comey is doing his duty and to hell with The Hatch Act if something foul and incendiary lies there reeking. \\n*The FBI is awash with rogue agents who have it in for Clinton and are supporters of Trump and Giuliani. \\n*The FBI agents are upholding the law because they are not satisfied with the state of the investigation. \\n*There is nothing new in the Clinton emails. \\n*There is a whole hell of a lot new in them. \\n*FBI agents are in the streets with arrest warrants for persons at high political levels. \\n*Or this last is a tabloid dream, as with the election will be called off. \\nMeanwhile, the National Atmospheric and Oceanic Administration is warning of Fecal Storm Alert Levels hovering at 7.5 \\nJQ Public advised to remove to storm cellars and relax. Make joseph k winter\\'s  '"}, "time": 1742563262.865457}