{"duration": 0.14517784118652344, "input_args": {"text": "'LONDON  —   The controversy over genetically modified crops has long focused on largely unsubstantiated fears that they are unsafe to eat. But an extensive examination by The New York Times indicates that the debate has missed a more basic problem  —   genetic modification in the United States and Canada has not accelerated increases in crop yields or led to an overall reduction in the use of chemical pesticides. The promise of genetic modification was twofold: By making crops immune to the effects of weedkillers and inherently resistant to many pests, they would grow so robustly that they would become indispensable to feeding the world’s growing population, while also requiring fewer applications of sprayed pesticides. Twenty years ago, Europe largely rejected genetic modification at the same time the United States and Canada were embracing it. Comparing results on the two continents, using independent data as well as academic and industry research, shows how the technology has fallen short of the promise. An analysis by The Times using United Nations data showed that the United States and Canada have gained no discernible advantage in yields  —   food per acre  —   when measured against Western Europe, a region with comparably modernized agricultural producers like France and Germany. Also, a recent National Academy of Sciences report found that “there was little evidence” that the introduction of genetically modified crops in the United States had led to yield gains beyond those seen in conventional crops. At the same time, herbicide use has increased in the United States, even as major crops like corn, soybeans and cotton have been converted to modified varieties. And the United States has fallen behind Europe’s biggest producer, France, in reducing the overall use of pesticides, which includes both herbicides and insecticides. One measure, contained in data from the United States Geological Survey, shows the stark difference in the use of pesticides. Since genetically modified crops were introduced in the United States two decades ago for crops like corn, cotton and soybeans, the use of toxins that kill insects and fungi has fallen by a third, but the spraying of herbicides, which are used in much higher volumes, has risen by 21 percent. By contrast, in France, use of insecticides and fungicides has fallen by a far greater percentage  —   65 percent  —   and herbicide use has decreased as well, by 36 percent. Profound differences over genetic engineering have split Americans and Europeans for decades. Although American protesters as far back as 1987 pulled up prototype potato plants, European anger at the idea of fooling with nature has been far more sustained. In the last few years, the March Against Monsanto has drawn thousands of protesters in cities like Paris and Basel, Switzerland, and opposition to G. M. foods is a foundation of the Green political movement. Still, Europeans eat those foods when they buy imports from the United States and elsewhere. Fears about the harmful effects of eating G. M. foods have proved to be largely without scientific basis. The potential harm from pesticides, however, has drawn researchers’ attention. Pesticides are toxic by design  —   weaponized versions, like sarin, were developed in Nazi Germany  —   and have been linked to developmental delays and cancer. “These chemicals are largely unknown,” said David Bellinger, a professor at the Harvard University School of Public Health, whose research has attributed the loss of nearly 17 million I. Q. points among American children 5 years old and under to one class of insecticides. “We do natural experiments on a population,” he said, referring to exposure to chemicals in agriculture, “and wait until it shows up as bad. ” The industry is winning on both ends  —   because the same companies make and sell both the genetically modified plants and the poisons. Driven by these sales, the combined market capitalizations of Monsanto, the largest seed company, and Syngenta, the Swiss pesticide giant, have grown more than sixfold in the last decade and a half. The two companies are separately involved in merger agreements that would lift their new combined values to more than $100 billion each. When presented with the findings, Robert T. Fraley, the chief technology officer at Monsanto, said The Times had   its data to reflect poorly on the industry. “Every farmer is a smart businessperson, and a farmer is not going to pay for a technology if they don’t think it provides a major benefit,” he said. “Biotech tools have clearly driven yield increases enormously. ” Regarding the use of herbicides, in a statement, Monsanto said, “While overall herbicide use may be increasing in some areas where farmers are following best practices to manage emerging weed issues, farmers in other areas with different circumstances may have decreased or maintained their herbicide usage. ” Genetically modified crops can sometimes be effective. Monsanto and others often cite the work of Matin Qaim, a researcher at    of Göttingen, Germany, including a   of studies that he helped write finding significant yield gains from genetically modified crops. But in an interview and emails, Dr. Qaim said he saw significant effects mostly from   varieties in the developing world, particularly in India. “Currently available G. M. crops would not lead to major yield gains in Europe,” he said. And regarding   crops in general: “I don’t consider this to be the miracle type of technology that we couldn’t live without. ” First came the Flavr Savr tomato in 1994, which was supposed to stay fresh longer. The next year it was a small number of   russet potatoes. And by 1996, major genetically modified crops were being planted in the United States. Monsanto, the most prominent champion of these new genetic traits, pitched them as a way to curb the use of its pesticides. “We’re certainly not encouraging farmers to use more chemicals,” a company executive told The Los Angeles Times in 1994. The next year, in a news release, the company said that its new gene for seeds, named Roundup Ready, “can reduce overall herbicide use. ” Originally, the two main types of genetically modified crops were either resistant to herbicides, allowing crops to be sprayed with weedkillers, or resistant to some insects. Figures from the United States Department of Agriculture show herbicide use skyrocketing in soybeans, a leading G. M. crop, growing by two and a half times in the last two decades, at a time when planted acreage of the crop grew by less than a third. Use in corn was trending downward even before the introduction of G. M. crops, but then nearly doubled from 2002 to 2010, before leveling off. Weed resistance problems in such crops have pushed overall usage up. To some, this outcome was predictable. The whole point of engineering   plants “was to reduce insecticide use, and it did,” said Joseph Kovach, a retired Ohio State University researcher who studied the environmental risks of pesticides. But the goal of   seeds was to “sell more product,” he said  —   more herbicide. Farmers with crops overcome by weeds, or a particular pest or disease, can understandably be G. M. evangelists. “It’s silly bordering on ridiculous to turn our backs on a technology that has so much to offer,” said Duane Grant, the chairman of the Amalgamated Sugar Company, a cooperative of more than 750 sugar beet farmers in the Northwest. He says crops resistant to Roundup, Monsanto’s most popular weedkiller, saved his cooperative. But weeds are becoming resistant to Roundup around the world  —   creating an opening for the industry to sell more seeds and more pesticides. The latest seeds have been engineered for resistance to two weedkillers, with resistance to as many as five planned. That will also make it easier for farmers battling resistant weeds to spray a widening array of poisons sold by the same companies. Growing resistance to Roundup is also reviving old, and contentious, chemicals. One is   an ingredient in Agent Orange, the infamous Vietnam War defoliant. Its potential risks have long divided scientists and have alarmed advocacy groups. Another is dicamba. In Louisiana, Monsanto is spending nearly $1 billion to begin production of the chemical there. And even though Monsanto’s version is not yet approved for use, the company is already selling seeds that are resistant to it  —   leading to reports that some farmers are damaging neighbors’ crops by illegally spraying older versions of the toxin. Two farmers, 4, 000 miles apart, recently showed a visitor their corn seeds. The farmers, Bo Stone and Arnaud Rousseau, are   tillers of the land. Both use seeds made by DuPont, the giant chemical company that is merging with Dow Chemical. To the naked eye, the seeds looked identical. Inside, the differences are profound. In Rowland, N. C. near the South Carolina border, Mr. Stone’s seeds brim with genetically modified traits. They contain Roundup Ready, a   trait resistant to Roundup, as well as a gene made by Bayer that makes crops impervious to a second herbicide. A trait called Herculex I was developed by Dow and Pioneer, now part of DuPont, and attacks the guts of insect larvae. So does YieldGard, made by Monsanto. Another big difference: the price tag. Mr. Rousseau’s seeds cost about $85 for a   bag. Mr. Stone spends roughly $153 for the same amount of biotech seeds. For farmers, doing without genetically modified crops is not a simple choice. Genetic traits are not sold à la carte. Mr. Stone, 45, has a master’s degree in agriculture and listens to Prime Country radio in his Ford pickup. He has a test field where he tries out new seeds, looking for characteristics that he particularly values  —   like plants that stand well, without support. “I’m choosing on yield capabilities and plant characteristics more than I am on G. M. O. traits” like bug and poison resistance, he said, underscoring a crucial point: Yield is still driven by breeding plants to bring out desirable traits, as it has been for thousands of years. That said, Mr. Stone values genetic modifications to reduce his insecticide use (though he would welcome help with stink bugs, a troublesome pest for many farmers). And Roundup resistance in pigweed has emerged as a problem. “No G. M. trait for us is a silver bullet,” he said. By contrast, at Mr. Rousseau’s farm in    a village outside Paris, his corn has none of this engineering because the European Union bans most crops like these. “The door is closed,” says Mr. Rousseau, 42, who is vice president of one of France’s many agricultural unions. His   farm was a site of World War I carnage in the Battle of the Marne. As with Mr. Stone, Mr. Rousseau’s yields have been increasing, though they go up and down depending on the year. Farm technology has also been transformative. “My grandfather had horses and cattle for cropping,” Mr. Rousseau said. “I’ve got tractors with motors. ” He wants access to the same technologies as his competitors across the Atlantic, and thinks G. M. crops could save time and money. “Seen from Europe, when you speak with American farmers or Canadian farmers, we’ve got the feeling that it’s easier,” Mr. Rousseau said. “Maybe it’s not right. I don’t know, but it’s our feeling. ” With the world’s population expected to reach nearly 10 billion by 2050, Monsanto has long held out its products as a way “to help meet the food demands of these added billions,” as it said in a 1995 statement. That remains an industry mantra. “It’s absolutely key that we keep innovating,” said Kurt Boudonck, who manages Bayer’s sprawling North Carolina greenhouses. “With the current production practices, we are not going to be able to feed that amount of people. ” But a broad yield advantage has not emerged. The Times looked at regional data from the United Nations Food and Agriculture Organization, comparing main genetically modified crops in the United States and Canada with varieties grown in Western Europe, a grouping used by the agency that comprises seven nations, including the two largest agricultural producers, France and Germany. For rapeseed, a variant of which is used to produce canola oil, The Times compared Western Europe with Canada, the largest producer, over three decades, including a period well before the introduction of genetically modified crops. Despite rejecting genetically modified crops, Western Europe maintained a lead over Canada in yields. While that is partly because different varieties are grown in the two regions, the trend lines in the relative yields have not shifted in Canada’s favor since the introduction of G. M. crops, the data shows. For corn, The Times compared the United States with Western Europe. Over three decades, the trend lines between the two barely deviate. And sugar beets, a major source of sugar, have shown stronger yield growth recently in Western Europe than the United States, despite the dominance of genetically modified varieties over the last decade. Jack Heinemann, a professor at the University of Canterbury in New Zealand, did a pioneering 2013 study comparing   yield trends, using United Nations data. Western Europe, he said, “hasn’t been penalized in any way for not making genetic engineering one of its biotechnology choices. ” Biotech executives suggested making narrower comparisons. Dr. Fraley of Monsanto highlighted data comparing yield growth in Nebraska and France, while an official at Bayer suggested Ohio and France. These comparisons can be favorable to the industry, while comparing other individual American states can be unfavorable. Michael Owen, a weed scientist at Iowa State University, said that while the industry had long said G. M. O.s would “save the world,” they still “haven’t found the mythical yield gene. ” Battered by falling crop prices and consumer resistance that has made it hard to win over new markets, the agrochemical industry has been swept by buyouts. Bayer recently announced a deal to acquire Monsanto. And the   China National Chemical Corporation has received American regulatory approval to acquire Syngenta, though Syngenta later warned the takeover could be delayed by scrutiny from European authorities. The deals are aimed at creating giants even more adept at selling both seeds and chemicals. Already, a new generation of seeds is coming to market or in development. And they have grand titles. There is the Bayer Balance GT Soybean Performance System. Monsanto’s Genuity SmartStax RIB Complete corn. Dow’s PhytoGen with Enlist and WideStrike 3 Insect Protection. In industry jargon, they are “stacked” with many different genetically modified traits. And there are more to come. Monsanto has said that the corn seed of 2025 will have 14 traits and allow farmers to spray five different kinds of herbicide. Newer genetically modified crops claim to do many things, such as protecting against crop diseases and making food more nutritious. Some may be effective, some not. To the industry, shifting crucial crops like corn, soybeans, cotton and rapeseed almost entirely to genetically modified varieties in many parts of the world fulfills a genuine need. To critics, it is a marketing opportunity. “G. M. O. acceptance is exceptionally low in Europe,” said Liam Condon, the head of Bayer’s crop science division, in an interview the day the Monsanto deal was announced. He added: “But there are many geographies around the world where the need is much higher and where G. M. O. is accepted. We will go where the market and the customers demand our technology. ”'"}, "time": 1742628513.0124607}