{"duration": 0.06086134910583496, "input_args": {"text": "'Sunday on NBC’s “Meet the Press” during a panel discussion about the alleged Russian hacking efforts intended to influence November’s presidential election, CNBC contributor Rick Santelli took on a panel led by show moderator Chuck Todd and consisting of New York Times columnist David Brooks, MSNBC anchor Andrea Mitchell and former Rep. Donna Edwards ( ).  During the discussion, Santelli accused Todd of “picking sides” and dismissed Mitchell’s defense of the attention given to the Russian hacking controversy by the media. Partial transcript as follows: DAVID BROOKS: Putin is a guy who murders journalists, who has destroyed the democratic process in his own country and now suddenly he feels the freedom to try to do that in our country. It’s not normal statecraft. (CROSSTALK) RICK SANTELLI: To see Russians happy because Trump won  —   on election night, I never saw you so unhappy. You pick sides. Everybody picks sides. ANDREA MITCHELL: That’s not true, Rick. CHUCK TODD: Who picks sides? MITCHSLL: That’s just not true. Let’s get back to the facts here. SANTELLI: What are the facts? We were hacking [Angela] Merkel’s phone. Everybody does it. MITCHELL: Rick, here’s the difference. We do it, they do it. What made this different is that the Russians weaponized it by transferring it through intermediaries to WikiLeaks. They dumped it out. We do it and hold it. They do it and hold it. (CROSSTALK) MITCHELL: Let me finish my sentence  —   WikiLeaks was out from the end of the summer and it was being investigated. SANTELLI: So where were these headlines then? (CROSSTALK) MITCHELL: There was plenty of headlines. There was no proof of who did it. SANTELLI: People in charge of intelligence are political as well. DONNA EDWARDS: What happened here is the intelligence gathering that normally takes place was operationalized by the Russians to interfere with our elections. If you look at the report  —   MITCHELL: They did it in Ukraine. They’re doing it in Germany. EDWARDS: They’re doing it in Germany right now and this is really serious. We’re not going to get over by just saying everybody does it. SANTELLI: Right, we should be solving the problem instead of making it a political hot potato. Let me see the Cuban missiles on the island picture. Trump needs to see it before networks need to see it. MITCHELL: I went to the hearing  —   SANTELLI: Oh the hearing. There’s hearings on everything. They’re kabuki theater. MITCHELL: Well Rick, if you had been there you would have seen something very different. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742562667.104061}