{"duration": 0.10452818870544434, "input_args": {"text": "'By M. JAGGERS LD: We discussed yesterday the various reasons why Trump won the election. Mr Jaggers thinks Trump won because he promoted the interests of the vast underclass of disenfranchised Whites who were sick to death of the (((neoconservative liberal elites))), as typified by the loathsome Hillary Clinton. It is in Trump’s own interests, Jaggers believes, not to betray the Whites who voted for him by reneging on his promises. There must be no U-turns, no cuddling up to the Zionist enemy, no wishy-washy compromises or backslidings. Trump is now expected to “make America great again” — or else. A tall order? We’ll see. [LD] \\n: In certain times, there is a surreal feeling of “being a part of history,” which is perhaps to say, we are living in a time period of dynamic change. However unthinkable for the left it may be, Trump has been elected. We can add this to Brexit and other “unthinkable” events to come. To contemplate the details of what this may entail, such as the selection of cabinet members and policy priorities , which do indeed include “building that wall,” has something of a Christmas morning feeling—everyday. \\nTo paraphrase an from Die Welt , in Western Democracies, the status quo seems stable, and it is not generally considered possible for “extremes” to transpire. But that is what we have seen, however we may want to quibble about what exactly is “extreme.” Can Donald Trump, or the Alt-Right for that matter, be considered “extreme” after that electoral show of consent? Regardless, when there is an endless back and forth between stultifying, uncourageous Republicans and the frankly anti-White agenda of the Democrats, “extreme” does not carry such a negative connotation, but instead implies a kind of deliverance. \\nWe have been locked in a middle-class complaisance, and that is precisely why societies such as ours “are often surprised by the foreseeable and obvious.” And alas, though it may be “unspeakable” to liberals, and though he was the object of such ridicule in our media, Trump is now “the most powerful man in the world,” as Die Welt puts it, perhaps with some apprehension. Just let that sink in. Explanatory Factors \\nTrump’s appeal may have been equally a reaction to Black Lives Matter protests as to immigration. According to exit polls, 74 percent of Trump voters feel that Blacks are treated fairly by the criminal justice system, which by definition means that these voters are not sympathetic to Black Lives Matter. Overall, half of White voters (Democrats and Republicans) opined that Blacks are treated fairly by police. Likely most of us will have anecdotal evidence that our non-Alt-Right family members and acquaintances were not amused by Black Lives Matter. Trump voters were especially unamused. \\nOf Trump supporters, 86 percent favor building the wall on the southern border, compared to less than half of all voters (54 percent oppose, 41 percent favor). So antipathy towards both Black Lives Matter and immigration can be said to have catapulted Trump to the presidency , in part by turning off mainstream middle-class White people, who are normally content with the status-quo. Moderates may not want a wall per se , but they also may not complain too loudly when it’s being built. And again, Trump’s actual voters want it built—unequivocally. \\nWhile losing some steam amongst college-educated Whites, Trump won the White working class by 39 points , an increase from Romney’s 26 point spread. Ultimately, there is no simple narrative that emerges; Trump increased White support in different key swing states from different rural and suburban demographics in order to dominate the electoral college. I won’t pretend to be Nate Silver, so let’s just say he won because of White people. \\n“Among his supporters,” opines Thomas Friedman on Real Time with Bill Maher , “this was 80 percent about race, and the other 20 percent was about race.” \\nGood then, let’s accept the premise of liberals and draw the necessary conclusions. If Trump triumphed on the basis of race issues, he now has a mandate on immigration, law and order, the wall, etc. \\nFor the NYTimes David Brooks holding forth on Public Broadcasting Service (PBS), Trump voters are “just going with their gene pool ,” a rather bald statement that Trump voters are voting their ethnic interests. After the election, Brooks predicted that the country would be split into two factions, with one faction advocating ethnic separatism, what many on the Alt Right are already advocating. Would that it were so. \\nNixon became known to history as the “law and order” candidate, which accurately characterized his proclivities vis-à-vis crime. Trump, on the other hand, to leave no doubt, self-identified as the “law and order” candidate. As liberals will complain, and as the alt-right will readily admit, “law and order” is understood to mean that we will not tolerate Black violence and civil unrest. Trump’s support, therefore, was premised on his intolerance for the very violence which his election has provoked (once again) from Blacks and other malcontent minorities, in the protests following his victory, which continue as I write this. \\nIt is ironic that Blacks report feeling “scared” at the prospect of the Trump presidency, while they are in fact the progenitors of violence, and so far as I know, Trump never made any negative statements explicitly about Blacks. Their violence and disorder has indeed “scared” the rest of civil society, contributing to Trump’s election. Perhaps Blacks are expressing their fear by attacking innocent Whites, in this inverted reality. How can we assuage these sensitive Blacks’ sense of fear? Shall we become human punching bags? You Can’t Always Get What You Want \\nIf there is one thing that minorities have learned over the last eight years, it is that they get what they want, and Whites (perhaps as a natural corollary) do not. Hence the indignation following this surprise victory. \\nSome journalists noted with amusement that Trump often played the Rolling Stones’ “You Can’t Always Get What You Want” at his campaign rallies. I hypothesized that Trump liked the song for its beautiful choral section, which has a celestial quality that built anticipation for his arrival on stage. Surely he paid little heed to the message of the lyrics, which discordantly seemed to suggest he was voters’ second choice. But now it all makes sense. I suggest that for our “underprivileged” people of color, it’s time you learned: you can’t always get what you want. \\nNot only is the People of Color (POC) attitude of entitlement and aggrievement ridiculous, it is also presumptuous. \\nWhile the MSM claims that the onus is now on Trump to reach out to those who didn’t vote for him; i.e., Blacks and Hispanics, it would seem that he was given a mandate to serve the interests of those who did vote for him . It follows logically that he would now carry that project through and enact the policies which mobilized his base and put him in the Oval Office. Sourced from the Occidental Observer Like this? Share it now. 2 thoughts on “ Trump won because of White people ” György says: November 18, 2016 at 11:48 am \\nYou Can’t Always Get What You Want \\nIf there is one thing that minorities have learned over the last eight years, it is that they get what they want, and Whites (perhaps as a natural corollary) do not. Hence the indignation following this surprise victory. \\nProblem has been favouring certain ethnic groups beyond reasonability. People are people. For example, employment should go to the best qualified candidate regardless of race or ethnic creed. An assumption is made on the government’s part, that an employer will unfairly select Anglo Saxon over other races, which is wrong. Therefore, the employer must use race based quota agendas to effect equality. \\nThis is a form of dictating morality by an amoral government. This is one area that Mr. Trump ought to behove.'"}, "time": 1742628388.5391948}