{"duration": 0.14210104942321777, "input_args": {"text": "'When the model Grace Hartzel opened Tom Ford’s spring 2017 show in a striking shag haircut, the inspiration was unmistakable  —   at least to those over 40 who watched Mr. Ford’s extravaganza. The hairdo paid homage to the one Jane Fonda made supercool as the Times Square hooker Bree Daniels in the 1971 movie “Klute. ” Alexander McQueen also cited Ms. Fonda as a motivating force of “Deliverance,” his spring 2004 collection, which has gone down in fashion history for its dance presentation inspired by Ms. Fonda’s performance in the 1969 drama “They Shoot Horses, Don’t They?” In her late ’60s heyday, Ms. Fonda played her fair share of     roles. Off screen, she was the ultrachic Paris wife of the director Roger Vadim, and was a   fixture at shows staged by his friends Coco Chanel, Hubert de Givenchy and Yves Saint Laurent. Recently, speaking by phone from a film location in Colorado, Ms. Fonda, 78, firmly denied her style pedigree. “I am not a fashionista,” she said. Ms. Fonda’s political activism often overshadowed her status as a sartorial influencer. Highlighting it, however, is her collection of couture, Italian    and lavish screen costumes that will be auctioned on Friday at Julien’s Auctions in Los Angeles. About five of the items are  . But when asked if she had considered donating an Atelier Versace gown, a Valentino something, even her stripy workout leotard to, perhaps, the Met Costume Institute, she offered an unyielding “No. ” Ms. Fonda is auctioning her possessions (698 items in all, mostly clothing) in a housecleaning exercise. “I had to do jobs to pay for my storage,” she said of the units she had maintained since her 2001 divorce from the media mogul Ted Turner. “Because Ted did not like to carry a lot of luggage on his jet  —   it was too burdensome  —   I would have to buy things in bulk” for their travels to his many properties. Parting with mementos was tough yet ultimately worthwhile. “Lighter,” she said of her sense of relief on clearing the space. Here, Ms. Fonda tells the stories behind some pieces going under the gavel. Ms. Fonda wore the Yves Saint Laurent pantsuit below when she claimed the Oscar as best actress in 1972. The somber black ensemble, with its sharp   jacket, reflected the Communist sympathies she had developed before buying the suit in 1968. Ms. Fonda had just given birth to her daughter Vanessa Vadim, and during her pregnancy said she had grown horrified watching French television broadcasts of the attacks on North Vietnam. By the time of the Oscars Ms. Fonda was divorcing Mr. Vadim, and though she had hung on to her haute couture, she had exchanged her New Wave lifestyle for a     antiwar lecture tour across the United States. The Hollywood establishment feared she would use the Oscars as another stop on it. “I wanted to make a speech about Vietnam,” Ms. Fonda admitted of the ceremony. Instead, she listened to her father, Henry Fonda, who advised her to refrain from politicking at the podium. “He said to me: ‘Just say: ‘There is a lot to be said. But tonight is not the time.’ So I did. And I wore something that made a statement. It was not a time for showy dresses. It was a time for seriousness. ” Before Yeezy, there was Fonda. Ms. Fonda introduced her own line of luxe exercise apparel in 1984, after her workout book and its video adaptation, both fronted by an image of her in this black and red leotard, had dominated   lists for years. Though films like “Flashdance” and “Perfect” made aerobics gear au courant, Ms. Fonda’s namesake aerobics label proved too   and quickly folded. The 40 pieces from Atelier Versace that Ms. Fonda is auctioning are the standouts of the sale. The garments run the gamut from her flamboyant Oscar gowns to embellished couture that Lesage, the venerable Paris embroidery house, produced by channeling Gianni Versace’s inimitable   take on Picasso’s Rose Period and Robert Delaunay’s abstract paintings. Many of the pieces were selected for Ms. Fonda by Mr. Versace after they met in 1989. In the midst of divorcing her second husband, Tom Hayden, at the time, she had controversially acquired breast implants and was dating a    Italian soccer goalkeeper, Lorenzo Caccialanza. “I was in Italy with him, and I met Gianni then,” Ms. Fonda recalled. “Gianni kind of took me under his wing. And whenever I would do a red carpet, he would supply my clothes. He gave me dresses, belts, gloves and shoes. He was very generous. ” Ms. Fonda sees no conflict between her political stances and her flaunting of Versace, a label that was often criticized for dressing supermodels in bondage numbers. “I used to think, ‘I have to be very serious,’” she admitted. “But being a feminist is not about the antithesis of being sexy or looking good. ” As the daughter of a Golden Era Hollywood actor, Ms. Fonda likely noticed as his contemporaries, like Lauren Bacall and Audrey Hepburn, often walked off film sets with their wardrobes. The garments were made by skilled costume designers whose work was often on par with couturiers. Ms. Fonda continued the practice, and three dresses by the   costume designer Ann Roth, which she wore in the 1981 film “Rollover,” are up for grabs. “Rollover,” a financial thriller, predated “Wall Street” and “The Big Short. ” But it flopped. “We couldn’t get the script right,” Ms. Fonda said. Although her life eventually reflected the part she had played  —   a film star who “gave it all up” to become the wife of an industrialist  —   she made good use of her glam wardrobe. A decade after making the movie, Ms. Fonda quit acting and donned the   lace “Rollover” gown to marry Mr. Turner. A sumptuous sequined velvet gown from the film went to the White House when Ms. Fonda accompanied him to a 1994 dinner for the Emperor and Empress of Japan. “I am very much in favor of wearing things more than once,” Ms. Fonda said. Two months went into the making of this Schiaparelli couture gown, which Ms. Fonda wore at the 2015 Cannes Film Festival premiere of “Youth. ” Paolo Sorrentino’s drama, in which Ms. Fonda portrayed an aging starlet, was competing for the Palme d’Or prize. “Jane was very proud of the movie, and she wanted to make a special moment of the premiere,” said a Schiaparelli spokeswoman who worked on the dress with Ms. Fonda and her stylist, Tanya Gill. So in a departure from the   Versace dresses Ms. Fonda has made her signature at Cannes, working the red carpet as a L’Oréal Paris spokeswoman (the cosmetics company sponsors the festival) she opted for a regal full skirt and   gown, which was adapted from a 1952 Elsa Schiaparelli design. “It was a lot of fun to wear,” Ms. Fonda said. “It felt really good. ”'"}, "time": 1742562606.9299784}