{"duration": 1.3983850479125977, "input_args": {"text": "'Vandalism, offensive jokes, even criminal assault  —   reports of   harassment have spiked since Donald J. Trump’s victory in the presidential race. Few of the perpetrators have been caught, but here is a look at five cases in which people have been directly accused. Some apologized. One denied being responsible. Another said his actions had been misconstrued. When Isabel Manu started sending her classmate María Sanchez internet memes that mocked Mr. Trump’s plans to crack down on immigration, Ms. Sanchez, whose parents had come to the United States illegally from Mexico, tried to shake it off: “It was just a little funny, like ha, O. K. awkward funny. ” Ms. Manu tried to turn up the humor after Mr. Trump was elected president. She failed. Using clothing and shoes, she built a wall in Ms. Sanchez’s dorm room at Lindenwood University in St. Charles, Mo. and left a note saying, “Trump won so here is a little preview of what’s to come. ” Tearful and disturbed, Ms. Sanchez posted a photograph on Twitter that was shared more than 50, 000 times. “I was angry,” she said. “I threw the stuff, and I tore the paper. ” Ms. Sanchez, along with campus security officers, confronted Ms. Manu, who appeared shocked that the gag had backfired. Ms. Manu declined to be interviewed. Ms. Sanchez speculated that online humor around presidential politics had led her friend to think of the election, and what was at stake, as a joke. Ms. Sanchez said that Ms. Manu had apologized, and the two are working on reconciling. “A friendship is not all love,” Ms. Sanchez said. “There are going to be horrible things that are going to happen. We have to move on and grow from this. ” Officer Michael Peters was off duty when he flew a Confederate battle flag from the back of his pickup truck at a “Love Trumps Hate” demonstration in Traverse City, Mich. Officer Peters, an   Police Department veteran, was captured in photographs getting out of his vehicle, opening a Bud Light and arguing with protesters. He could not be reached for comment, but the Traverse City police chief said he had previously displayed the divisive symbol at work. After the most recent episode was shared widely on the internet and in news reports, he resigned, which Marty Colburn, the city manager of the popular tourist destination in northern Michigan, called “necessary. ” Mr. Colburn said Mr. Peters had also offered an apology for what the former officer described as the “stain” he put on the city. He added that Mr. Peters had cut short a   trip to sign the paperwork to complete his resignation. On Tuesday, Mr. Peters delivered a letter to the local newspaper, saying that he attended the rally to protest what he viewed as political correctness. He added that he believes the Confederate symbol “has nothing to do with racism, and everything to do with embracing and celebrating the simple lifestyle that is the country  . ” John Sousa, a high school teacher and golf coach in Wesley Chapel, Fla. was suspended from work after students accused him of telling a group of black classmates, “Don’t make me call Donald Trump to get you sent back to Africa. ” The school district is investigating the episode. Mr. Sousa did not respond to requests for an interview. In a Facebook post, Donnie Jones Jr. a Wesley Chapel High School parent, said he had spoken with the teacher on the phone. “He actually admitted saying it,” Mr. Jones wrote online. “He said it was just an    comment and wasn’t meant to be racist. He said it was a bunch of male and female students in the hallway and he was talking to everyone. ” Edward Tomasso and Parker   students at Babson College in Wellesley, Mass. drove onto the nearby campus of Wellesley College flying a Trump flag from their vehicle and chanted Mr. Trump’s campaign slogans outside a building where minority students can seek support. They bragged about the episode in an online video that has since been taken down. But after facing a backlash that included death threats on social media and a harsh response from officials at both schools, each posted an apology on Facebook and denied targeting minority students. “Publicly celebrating the election at a time and in a place when so many were deeply disappointed about its outcome and, indeed, genuinely grieving about it, was just not smart,” Mr.   wrote. “We had no idea that our actions would be interpreted as racist, or sexist, or harassment. ” Mr. Tomasso wrote: “As a white male, I do not feel threatened by the new president. I have not had to work for that privilege. It was something I was born with. ” He included a phone number and email address where he said those he had offended could reach him directly. Quickly, though, angry comments  —   along with a few written in support  —   inundated the post, and Mr. Tomasso stopped responding. Neither Mr. Tomasso nor Mr.   responded to requests for comment. Shacara McLaurin, a singer and   activist in New York, said that she was walking home after a performance last week when she passed a political protest, and an elderly man who supported Mr. Trump began to heckle her. After a physical altercation in which the man fell to the ground, Ms. McLaurin, 23, was charged with assault and harassment. She said that the man had thrown himself onto the ground and appeared to be drunk, and that she had lost her day job as a home health aide because of the episode. She also said that since the incident, she has been attacked on social media. “Why should it have to come to the point where we are threatening each other and threatening each other’s lives over a presidential election?” she asked.'"}, "time": 1742564335.3264828}