{"duration": 0.08575940132141113, "input_args": {"text": "'The Hostility and Hypocrisy of Left-Wing Israeli NGOs Where are the condemnations of the PA’s efforts to prevent “normalization” with Israel? November 2, 2016 \\nOriginally written for the Investigative Project on Terrorism. \\nIsraeli human rights group B’Tselem recently appeared before a special session of the United Nations Security Council, excoriating Israel and pleading with the body to act against Israel’s settlements. \\nIn 1975, the UN famously declared that “Zionism is racism” and, four decades later, the organization continues to hound Israel. In each of the last four years, as the Syrian bloodbath claimed hundreds of thousands of lives, there were at least five times as many resolutions condemning Israel as those rebuking the rest of the world. \\nThe UN’s cultural body, UNESCO, recently passed a motion ignoring any Jewish (or Christian) historical ties to East Jerusalem holy sites, referring to the Temple Mount and Western Wall only by their Muslim names and condemning Israel as “the occupying power.” It turns out that some of Israel’s left-wing NGOs worked to help produce the UNESCO motion. \\nGiven the UN’s chronic hostility, efforts by Israeli NGOs to persuade the UN to act against Israel are arguably treasonous. Indeed, one attorney and activist for Israel’s left-leaning Labor party filed a police complaint alleging treason against B’Tselem, arguing that the NGO has harmed state sovereignty, tried to give land away to a foreign entity, and taken steps that could cause a war. \\nIsraeli democracy is extremely tolerant, to the point of allowing its members of parliament to openly support terrorism and terrorist groups. Last March, several Israeli Arab Knesset members condemned Arab states for labeling Hizballah a terrorist organization, even though it has been at war with Israel for decades and regularly threatens new hostilities. \\nLast February, members from the Joint (Arab) List paid a solidarity visit to relatives of Palestinian terrorists whom Israeli security forces had killed to stop them from murdering Israelis. In 2014, MK Hanin Zoabi (Balad) drew praise from Hamas after she asserted that the kidnappers of three missing Israeli youths were “not terrorists.” Hamas’s connection to the young men’s abduction and murder helped to spark the third war between Israel and Hamas in Gaza. \\nThus, Israel already has plenty of dissenting voices and activists without foreign intervention. Nevertheless, foreign interests have identified Israeli NGOs as the soft underbelly of Israeli democracy and have leveraged them to promote their own agendas. The problem became so acute that a watchdog, NGO Monitor, was formed in 2002 to track the self-hostility being funded largely by European and other foreign sources. As the organization notes: “NGOs lack a system of checks and balances, and…provide accountability to their funders and activist members, and not to the citizens or societies whose lives are directly impacted by their activities.” \\nNGO Monitor also notes that, even though most of the foreign government funding for these Israeli NGOs is “formally designated for ‘educating the Israeli public’ and ‘changing public opinion’ (both in violation of the norms on non-interference in other democracies), these Israeli NGOs are very active externally, in the delegitmization and political warfare against Israel.” \\nThese left-wing Israeli NGO’s receive money from about two dozen foreign governments , and some private organizations . That includes millions of dollars from billionaire George Soros. \\nIn Catch the Jew , author Tuvia Tenenbom exposed how foreign-funded “human rights” and “cultural” organizations in Israel tend to serve as vehicles for attacking Israel. By presenting himself to interview subjects as “Tobi the German,” Tenenbom elicits some surprising confessions. For example, the New Fund for Cinema and TV, a foreign-funded Israeli cultural NGO, told him that that about 80 percent of political documentaries made in Israel are co-produced by Europeans. That includes a documentary called “10%—What Makes a Hero,” which equates Israel’s military with the Nazis. Such films would be too scandalous to be produced in Germany, but German-sponsored NGOs can safely pay left-wing Israelis to make such movies. \\nSome foreign funders of Israeli NGOs have even unwittingly enriched Hamas. Last August, Hamas allegedly siphoned off “tens of millions of dollars” from World Vision, a U.S.-based charity, and used the funds for weapons purchases, tunnel construction, and other military activities. \\nThe Knesset passed a law in July requiring disclosure of foreign funding sources for NGOs that get more than half of their money from overseas. The law is “clearly aligned with the American Foreign Agents Registration Act (FARA),” wrote legal scholar Eugene Kontorovich, who defended the legislation in response to critics. \\n“Israel is unique in the sheer scale of the foreign government sponsorship of domestic political groups,” he wrote. “For example, the European Union alone has in recent years given roughly 1.2 million Euro a year for political NGOs in the US and roughly an order of magnitude more in Israel—a vastly larger per capita amount.” \\nThe Obama administration opposes foreign influence only when that influence promotes a dissenting view. Obama opposed Netanyahu’s speech to the U.S. Congress against the Iranian nuclear deal, but was happy to give a speech to the UK parliament against Brexit. The Obama administration critiqued Israel’s NGO-funding-disclosure law , perhaps because it had sent U.S. taxpayer money to an Israeli NGO working to oust Israel’s prime minister. \\nThe same hypocrisy seems to prevail among Israel’s foreign-funded NGOs. They ostensibly exist to promote democracy and peaceful co-existence, but are conspicuously silent when Palestinian institutions violate those ideals. Such silence enables abuse by Palestinians and promotes a distorted and incomplete picture of the complex reality in which Israelis operate. Foreign-funded Israeli NGOs remained silent after the Palestinian Authority arrested Palestinians who visited a Sukkah in a symbolic peace event promoting coexistence. \\n“These organizations are silent when the Palestinian leadership pays salaries to the families of terrorists, glorifies murderers and calls streets and city centers after them,” Netanyahu said. “These organizations prove again and again that they are not actually interested in human rights, but only in shaming Israel and libeling it around the world.” \\nIf Israel’s left-wing NGOs truly are committed to democracy and peace, why haven’t they condemned the PA’s efforts to prevent “normalization” with Israel? In 2014, Jibril Rajoub, the deputy secretary of the Fatah Central Committee and the head of the Palestinian Supreme Council for Sport and Youth Affairs, condemned a coexistence-promoting soccer match between Israeli and Palestinian youths on a southern kibbutz, as “a crime against humanity.” \\nLast week, a Palestinian newspaper came under intense criticism for publishing an interview with Israeli Defense Minister Avigdor Liberman. The Jerusalem-based newspaper Al-Quds was denounced by Hamas , the Palestinian Journalists’ Syndicate, and the supposedly “moderate” PA. The “chilling effects” and anti-peace message implicit in the harsh reactions to the interview have yet to catch the attention of any left-wing NGOs supposedly working for peace and democracy.'"}, "time": 1742628393.4182746}