{"duration": 0.13474583625793457, "input_args": {"text": "'LOS ANGELES  —   Four million dollars. That’s what a Los Angeles gallery is hoping to get for Kanye West’s “Famous” sculpture, a   silicone homage to 12 of the biggest names in pop culture. Four million for George W. Bush curled in the fetal position, a     Donald J. Trump, coquettish Amber Rose and Rihanna, a cherubic Anna Wintour and Pollyannaish Taylor Swift  —   a rogues’ gallery including Bill Cosby, Chris Brown and Ray J, and arguably three of the most famous   in modern times: Caitlyn, Kim, and Kanye. So lifelike, they even breathe, chests rising and falling as if deep in REM sleep. Seven figures for all that  —   plus the bedspread and the batteries to animate the doppelgängers  —   a number that was floated among attendees at Blum  Poe, the gallery that hosted the private exhibition last weekend. A source close to Mr. West claimed “Famous” would go on tour. Others vacillated between skepticism and quiet acquiescence at the estimate. But the gallery’s   Tim Blum, called it “a good ballpark. ” “I did the math in my head, and it took $500, 000 to a million just to make it,” said Aaron Axelrod, a Los Angeles artist who last month startled audiences by   mapping Frank Lloyd Wright’s Hollyhock House. “ This caught me off guard. It’s one of the coolest pieces I’ve ever seen, which is kind of annoying because it’s Kanye West. ” Solipsism aside, the biggest wow, Mr. Axelrod says, is breathing life into the sculptures, since “this was made for the music video, no one would have been able to tell [how] those sculptures were moving. Which means he’s going above and beyond. ” On Saturday, upon early arrival at the exhibition, technicians were still setting up a    straight out of the   classic “ . ” They toyed with audio, and plugged in   batteries to make the creations come alive. And when they did, the automatons were eerily real. Slumbering as if in a   suspended animation. Yet the most interesting part of the story is the one that didn’t make the final cut. “I think Monday of last week, I got a call from Scooter Braun,” said Mr. Blum of Blum  Poe, referring to the man who discovered Justin Bieber and who is now part of Mr. West’s management team. “Kanye suddenly felt the urge to show the work,” Mr. Blum continued. “Long story short, we made it happen. We pushed some things around and five days later, we had a show. Monday hey, Friday open. ” But why open a day before Mr. West’s “Saint Pablo” tour, two days before the V. M. A. s? It seemed sheer whim, Mr. Blum indicated. Mr. West wanted an art world unveiling, a piece that members of his creative collective, DONDA, said had taken four months of animation modeling,   scanning, stylist consulting, Instagram searches. The result was startlingly accurate. Each animatronic body was   down to the freckles and hair (human!) all applied by hand,    and none more ghoulish than Mr. Cosby’s freckles or Mr. Trump’s fleshy behind. Since Mr. West’s “Graduation” album cover was crafted by Takashi Murakami, a client of Blum  Poe, the gallery was a natural fit. When asked about the multimillion price point, Mr. Blum laughed. It is on sale  —   “for the right buyer,” he said. When you tally the materials needed, labor and Mr. West’s name, the $4 million price tag doesn’t seem so outlandish. “I would project a figure about that,” Mr. Blum said. “To be honest, we did it for the sake of doing it,” Mr. Blum continued. “The show and project were not done with price or sale in mind. But I would act upon it as every other piece of art I handle. ” The show lasted one weekend. Like the man himself, flighty and busy, Mr. West showed up for a few minutes via an onscreen avatar on Friday night. That’s it. “Kanye is Kanye,” said his trainer of three years, Joe Bouraima, a French national whom Mr. West had helped to secure a visa after a fortuitous 2013 meeting in Paris. Ever since, the hulking Mr. Bouraima has been on and off tour with the artist for months, training daily while working on “Famous. ” Not once did Mr. West mention the project. And then, just like that, the mercurial Mr. West decided to stage the   show in Los Angeles  —   and then it was gone. Poof. But to where? A member of Mr. West’s team said that the piece was “on its way to its next location. ” She wouldn’t share where, but Mr. Blum said he could picture “Famous” in a large museum. “I have friends who are directors of museums,” he said. “This is a thing you could see at Lacma [Los Angeles County Museum of Art] MOCA or the Hammer very easily. ” Representatives from the Hammer Museum said they had no such plans, but Mr. Blum mentioned that he and Mr. Braun were actively shopping the piece’s next home. The cliché rings true that all art is imitation, and “Famous” was heavily inspired by Vincent Desiderio’s “Sleep,” which was based on Jackson Pollock’s “Mural” painting. And though “Famous” wasn’t built by Mr. West’s own hand, the concept and direction were his own. Ask others who borrow liberally  —   such as Werner Herzog or Mr. Desiderio  —   all are steadfast that this work is art. Michelangelo, Quentin Tarantino and Chuck Close, have each had assistance to make their ideas come to life. Why should this be any different? “Art is really just an idea,” Mr. Axelrod said. “It’s follow through and direction. What makes a great artist nowadays is being able to put together a team. And he was willing to give up money to put his ideas to life. ” Maybe the greatest quality an artist can possess today isn’t skill or talent  —   it’s commitment to making a vision real. That means money and time. To create something to make the masses remember your name. What else is fame for?'"}, "time": 1742564491.844966}