{"duration": 0.09538531303405762, "input_args": {"text": "'Craig Sager, an exuberant sideline reporter for National Basketball Association television broadcasts who was as well known for his outlandishly garish outfits as for the questions he asked coaches and players, died on Thursday in Atlanta. He was 65. The cause was leukemia, according to a spokesman for Turner Sports. After receiving the diagnosis in 2014, Mr. Sager continued to work occasionally during what became a highly public illness. He received blood transfusions to be strong enough to travel to some games, and returned to a hospital after others. He last appeared in a game broadcast in June and canceled plans to work for NBC at the Summer Olympics in Brazil in August to continue treatment. Mr. Sager brought deep knowledge of basketball and a   spirit to his work. He was known for working behind the scenes to find news that he could use in his   reports or give to announcing colleagues like Marv Albert and Reggie Miller. “He was always hovering around the benches,” Mr. Albert said in a recent telephone interview. “And players told him things. ” But his journalism competed for attention with his psychedelic wardrobe. He strode the sideline of N. B. A. arenas in lilac, orange, banana yellow, black and lime green outfits  —   some in medleys of colors arrayed in stripes, plaids, swirls and other patterns that resembled Rorschach tests. He abhorred repeating any combinations. “My clothes reflect who I am,” he wrote in “Living Out Loud: Sports, Cancer and the Things Worth Fighting For,” his autobiography, which was published in November. “I believe that life should be fun and so should your clothes. ” His ensembles set him apart from other sideline reporters, who are usually bit players on sports broadcasts, typically given no more than one or two minutes to question sweaty athletes and cranky coaches between quarters, at halftime or after games. But Mr. Sager, with questions as well planned as his ensembles, became a favorite of players and coaches, not to mention the fans in the seats, as he walked into an arena in his sartorial splendor. “He had a very good relationship with players, but that didn’t mean he wouldn’t ask tough questions,” Mr. Albert said. “I also thought that the outfits he wore made him underrated. ” As his illness progressed, Mr. Sager had three bone marrow transplants, two from his older son, Craig II. On Mr. Sager’s return from a long hospital stay, his condition prompted Gregg Popovich, the San Antonio Spurs coach who is notoriously terse when responding to sideline reporters, to show rare warmth to Mr. Sager. “This is the first time I’ve enjoyed doing this ridiculous interview we’re required to do,” Mr. Popovich said, “and that’s because you’re here and you’re back with us. ” Then he added, “Now ask me a couple of inane questions. ” In June, Mr. Sager, who worked for TNT, was asked to be a sideline reporter at Game 6 of the N. B. A. finals on ABC, a rare invitation from a rival network. He scheduled the assignment  —   his first during a finals  —   between an   course of chemotherapy at the M. D. Anderson Cancer Center in Houston and a Father’s Day outing in Florida. Not surprisingly, he purchased a new outfit for the game. “I can’t bring out something I’ve already worn,” he said in an interview with The New York Times. “I want to make sure I don’t look down. I want people to say, ‘Man, he looks good. ’” After the Cleveland Cavaliers defeated the Golden State Warriors in Game 6, Mr. Sager interviewed the Cavaliers star LeBron James. After answering several questions, Mr. James reversed roles with Mr. Sager and asked: “How in the hell did you go   years without getting a finals game? That don’t make no sense. ” Mr. Sager smiled and said, “Thanks a lot for entertaining me. ” Craig Graham Sager was born on June 29, 1951, in Batavia, Ill. His father, Al, was an advertising and   executive his mother, Coral, was an avid golfer who held a pilot’s license. Mr. Sager attended Northwestern University, where, after trying out for the football team and playing for the freshman basketball team, he stepped into one of his earliest outrageous guises: Willie the Wildcat, the university’s mascot. After Northwestern’s football team upset Ohio State, Mr. Sager taunted the losing players while still in costume. In response, he wrote, members of the Ohio State marching band “began to push me and poke me with their flagpoles. ” After graduation he became a reporter for a radio station in Sarasota, Fla. On one assignment he leapt onto the field at   County Stadium after Hank Aaron hit his 715th home run to surpass Babe Ruth as baseball’s home run king. Wearing a trench coat, Mr. Sager, then 23, caught up to Mr. Aaron at home plate, amid a scrum of fans, reporters and relatives, to briefly interview him. Three years later, while covering the Belmont Stakes, Mr. Sager slept in Seattle Slew’s stable the night before the thoroughbred won the Triple Crown. Before leaving to take the horse for a morning walk, Mr. Sager wrote, he scooped up a piece of Seattle Slew’s excrement and preserved it for the next 39 years as a fragment of history. Mr. Sager also worked at TV stations in Florida and Kansas City, Mo. before joining CNN in 1981. In 1990 he moved to Turner Sports, where, besides the N. B. A. he covered golf, the National Football League, college football and basketball, and Major League Baseball. Mr. Sager is survived by his son Craig as well as another son, Ryan his daughters, Kacy, Krista and Riley Sager his second wife, Stacy and a sister, Candy Menzemer. Mr. Sager’s positive attitude and consuming desire to return to the sideline won him the Jimmy V Perseverance Award  —   named for Jim Valvano, the former North Carolina State basketball coach and ESPN commentator who died of bone cancer in 1993  —   at the ESPY Awards show in July. Wearing a floral print jacket, he said in his acceptance speech: “Whatever I might have imagined a terminal diagnosis would do to my spirit, it summoned quite the opposite  —   the greatest appreciation for life itself. So I will never give up, and I will never give in. ”'"}, "time": 1742561797.8071227}