{"duration": 0.11064863204956055, "input_args": {"text": "'This week, we roam France, sampling three regional cuisines: the richness of Gascony, the earthy pleasures of Médoc, and the new vibrancy of Bordeaux (below). Also check out the Food section’s guide to French cooking and our survey of five classic specialties, from bouillabaisse to galettes.  On a Sunday afternoon, people streamed across the Place de la Comédie, a grand Haussmannian square in central Bordeaux. The crowd was diverse in age, social class and ethnicity, but, this being France, the majority wore artfully draped scarves. They rode by on public share bikes and sipped espresso at the terrace cafes on the square’s southern edge, in the shadow of an elongated sculpture of a head by the contemporary Catalan artist Jaume Plensa. They clustered in pools of sunlight on the limestone steps of the Grand Théâtre and trickled contentedly out of Gordon Ramsay’s Le Pressoir d’Argent and Philippe Etchebest’s Le Quatrième Mur, part of a recent wave of   restaurant openings in this comely port city in southwestern France. As I took in the scene, it was hard to believe that not so long ago Bordeaux was considered somewhat of a backwater. Despite being one of the world’s major wine industry capitals, the city was known for years as La Belle Endormie, or Sleeping Beauty, as much for the   walls of its center as for its sleepy, overlooked reputation. But in the last two decades, Bordeaux has come awake. An ambitious revitalization campaign begun in the   by Alain Juppé, the longstanding   mayor and a former prime minister, cleaned up the city center, making it more welcoming to pedestrians. The project also established a   tram system and transformed over 7, 500, 000 square feet of former docklands into an agreeable terrain of walkways, bike paths, landscaped gardens and public waterside attractions. In 2007, half of the restored   city received Unesco recognition, making it the largest urban World Heritage site. In 2013, Bordeaux was ranked as France’s   city, after Paris. Last June, the city added to its offerings La Cité du Vin, an ambitious new museum on the banks of the river Garonne dedicated to the history of French viticulture, and as of December, a new   train line, set to begin service this summer, will run from Gare Montparnasse in Paris to Bordeaux in just over two hours. Yet it’s the food scene that has taken center stage, and today, the   heart of Bordeaux’s left bank is cluttered with interesting new offerings like experimental modern bistros, elaborate sanctums of haute cuisine and cozy   gastrobars. “It’s a totally new city,” said   Le Bras, a chef who moved to Bordeaux last year to reopen the restaurant La Grande Maison, in a   luxury hotel, with the    French chef Pierre Gagnaire. Mr. Le Bras last spent time in the city 25 years ago, back when it was “dark and dodgy,” he said. Now, he added, “It’s very dynamic   …     there’s so much to do. ” Owned by the French multimillionaire wine magnate Bernard Magrez, La Grande Maison opened in late 2014 in a stately   white stone mansion set back from the street by tall   gates that enclose a   circle drive and a    Andalusian olive tree. The Napoleon   interiors feature   chandeliers, opulent stone and embroidered silk. Mr. Magrez initially worked with Joël Robuchon, among the world’s most decorated chefs, but replaced him over the summer with Mr. Gagnaire, who has redone the menu with dishes like creamed hen pheasant consommé with   brut Champagne, served with crispy white cabbage, prune and aloe vera, all part of a   (about $63) “hunting” trio off the à la carte menu. A   and   degustation costs €135 and €185. Then there’s the wine list, as elaborate as one might expect from Mr. Magrez, with more than 160 chateaus and every cru classé (a term denoting recognized,   vineyards) from the Bordeaux region. But the city’s abundant food scene includes more casual offerings as well. My first stop was Garopapilles, a   restaurant and wine cellar that opened two and a half years ago on a quiet leafy street in Bordeaux’s center. The chef, Tanguy Laviale, 35, presides over a small open kitchen at the end of the   dining room, which looks on a glassed inner courtyard planted with aromatic herbs. Mr. Laviale was designated a Great Chef of Tomorrow in the 2016 Gault Millau guide for his rotating, seasonally driven prix fixe “market menu,’’ available Tuesday to Friday for lunch and Thursday and Friday for dinner. Lunch, including starter, main and dessert, costs €32, with optional wine pairing by the house sommelier (the   tasting dinner menu is €59). Ours began with a selection of  : bell pepper cream with feta cheese over a bed of black caviar, a clam served in the shell topped with a smoked lard emulsion foam. Then came a marbled, luscious foie gras terrine served with a bright quince purée, pickled porcinis and a mushroom shizu sauce, followed by veal in mushroom sauce served with tomato, oyster and wakame seaweed, a swirl of earthy complexity, finished with a dessert of delicate white cheese ice cream with mango crème and pumpkin espumante purée. Around us,   men in unbuttoned blazers and   glasses swirled glass after glass selected from the carefully curated,   wine list, knowledgeable waiters expounded on the ingredients and several young couples seemed to be Instagramming the better part of their meal. The vibe was urbane but convivial everyone appeared to be having a good time. Garopapilles is one of several modern French restaurants recently opened in Bordeaux by impressive young chefs, including locavore Belle Campagne, inside a townhouse in the city center Le Chien de Pavlov, a bistrot that has earned raves for dishes like crab and Kaffir lime ravioli and Côté Rue, which, since opening in July 2015 near the Musée d’Aquitaine, has become one of the hottest seats in town. Côté Rue’s   dining room, featuring   crown molding and bold abstract oil paintings, is regularly booked by stylish locals who come for the innovative dishes like beechwood smoked beef with cinnamon leaf and foie gras with citron and Jerusalem artichoke. “So many young chefs are here in Bordeaux right now,” said Rudy Ballin, 25, Côté Rue’s head chef. “The same thing happened in Lyon 15 years ago,” he added. “Everyone wants to move to Bordeaux because so much is happening, so there’s all this young energy, and people move here, start their own businesses, try new things. ” A sizable segment of Bordeaux’s new wave has turned east, bringing Asian influences to play on native culinary styles at relaxed neo bistros like the   restaurant Dan as well as Miles, which has attracted a cult following since opening three years ago in the center near the Place de la Bourse. Miles’s experimental melding of geographical influences is inspired by the provenance of its three   from France and French Polynesia, Israel and Japan. At Miles, as at so many of Bordeaux’s neo bistros, a rotating multicourse tasting menu is served from a small open kitchen: pleasingly   concoctions like hazelnut oil confit egg yolk with smoked chestnut purée and raw mushrooms, or sous vide monkfish with   eggplant, mussel foam and a gremolata of coconut, coriander and lime. A year ago, the team behind Miles opened a more informal restaurant nearby: Mampuku (Japanese for “full belly”). Shared plates focus on the street food of the chefs’ places of origin, like steamed Vietnamese bao buns stuffed with braised beef cheek and cilantro grilled and smoked eggplant with honey,   labane sauce, pomegranate and fresh herbs and “Saba Tastutaage,” crispy mackerel and broccoli tempura served with umeboshi, daikon radishes and a   dip. On a recent Saturday afternoon, lunch guests filled the cavernous dining room, sampling the diverse offerings over what seemed like a great many bottles of wine. You have to go farther upriver, though, to visit the city’s most newsworthy gastronomical attraction: La Cité du Vin, a museum of wine and viticulture that opened in June. Designed by XTU Architects to mimic wine swirling in a glass, the shimmering      facade towers over the partially redeveloped docklands of the Bassins à Flot district. Some seven years and $90 million in the making, La Cité du Vin at times seems more like a theme park than a museum. There are copious   projections, holograms, interactive elements and even a ship simulator that reimagines the maritime journeys of wine merchants throughout history. Thanks to video mapping technologies, an Armenian feast magically appears on a white table, then transforms into a traditional Jewish festive spread, as a virtual guide explains various culinary and viticultural traditions. In the “gallery of civilizations,” light boxes feature 3D animations tracing wine culture from ancient Greece and Egypt up to the present and a “buffet of the five senses,” where visitors can test different smells by releasing them from glass cloches. There are video installations devoted to wine’s role in religion, mythology, eroticism and the arts, with special attention paid to the history of viticulture in Bordeaux and the surrounding region of Aquitaine, where some of the world’s best wine has been harvested for two millenniums. La Cité du Vin also features a wine shop with more than 800 varieties, a   auditorium and Le 7, a    fine dining restaurant. Yet Bordeaux’s most enticing gastronomic attraction still may be one of its oldest: the Marché des Capucins, a huge covered food market in the heart of the multicultural St.  district that dates to the  . Known colloquially as the “belly of Bordeaux,” the Marché des Capucins is a pandemonium of scents, flavors and ungentrified French charm. Under the domed roofs of adjoining market halls, locals visit the seafood stands to consume oysters and sauvignon blanc, and to inspect crates of   heirloom tomatoes and cabbages that evoke Émile Zola’s account of “exquisite flowery masses the color of wine, crimson and deep purple. ” Cheese sellers offer brusque expertise while slicing off luxurious chunks of Chaubier and Roquefort, and men drink espresso and roll cigarettes at   counters, as they have for centuries. There’s nothing innovative or trendy about it, and yet here, perhaps more than anywhere in the city, you can feel that behind Bordeaux’s recent culinary success is a   and enduring passion for food deep in the heart (and belly) of its inhabitants.'"}, "time": 1742628603.4801786}