{"duration": 0.17352032661437988, "input_args": {"text": "'WEST PALM BEACH, Fla.  —   The youngest of the billionaire Koch brothers had a dream: to found a private high school where academically gifted students of all socioeconomic backgrounds would do   projects and learn by solving problems. He poured more than $75 million into building the school, the Oxbridge Academy of the Palm Beaches. But on Friday, he fired the head of school and declined to renew the contracts of the athletic director and the football coach. The moves came after a sexual harassment complaint and an internal investigation into accusations of kickbacks,   excessive spending and violations of the rules governing high school sports. It turned out, William I. Koch said in an interview, that a “power elites group” in the school ran “the asylum. ” Mr. Koch, 76, is the chief executive of Oxbow Carbon L. L. C. an energy development holding company based in West Palm Beach, and is the younger brother of Charles G. and David H. Koch, who are known for supporting conservative Republican causes. Referred to by some journalists as “the other Koch brother,” he established Oxbridge Academy to much fanfare in 2011. The school, which has 580 students, has many perks, including a physical therapist on staff,   lunches, an equestrian club and a flight simulator. The debate team spent hundreds of thousands of dollars traveling to competitions nationwide, Mr. Koch said. “We are finding alarming things of how money was misspent,” Mr. Koch said at his company’s offices. “If people think they’ve got a honey pot, there’s going to be a lot of bears around it, trying to get it. ” A few years ago, students requested that the school establish a football team, an idea the administration embraced. But that was when the troubles took off. An athlete who read at a   level was given a full scholarship, the football team had its own locker room and the coach earned more than $200, 000 a year, according to tax records and interviews with former employees. The former head of school, Robert C. Parsons, whose official title was president and chief executive, is a former chief financial officer at the United States Naval Academy. Mr. Parsons started at Oxbridge in 2011 with a compensation package worth $1 million, tax records show, seven times his academy salary. Eventually, he made about $600, 000 a year at the school. But in interviews, former employees questioned Mr. Koch’s decision to hire Mr. Parsons in the first place, because he was suspended for five days after a 2009 Naval inspector general report accused him and his former boss of operating a “slush fund” to pay for tailgate parties. Mr. Koch said he did not think Mr. Parsons’ record at the Naval Academy was a red flag because the government is “all screwed up. ” Other billionaires  —   such as Bill Gates of Microsoft Mark Zuckerberg of Facebook the music mogul Sean Combs the filmmaker James Cameron the philanthropist Eli Broad and Elon Musk, the chief executive of Tesla  —   have poured parts of their fortunes into education. Some, like Mr. Zuckerberg and Mr. Broad, said they wanted to help solve problems in public education. Their experiences underscore the pitfalls that confront business leaders whose professional success does not always translate into the education field. Mr. Koch has discovered similar challenges, though he had a personal motivation for starting Oxbridge. He said he founded the school to give his own children a better academic experience than he had. By his account, he went from being an awkward ugly duckling who was flunking out of middle school in Kansas, to a military academy cadet who embraced a love of study. He longed for a place where students, not teachers’ unions or principals, ruled. He completed a Ph. D. at M. I. T. but acknowledges that he still cannot spell very well. And he chokes up just talking about the troubled students who have made a turnaround at Oxbridge, which his children attend and from which his son has just graduated. In the past, Mr. Koch has famously sued his siblings in disputes over the family business, usually losing. Several years ago, he spent more than $25 million investigating counterfeit wine after being duped by a wine salesman. In 2012, a former company executive who had faced a fraud investigation accused Mr. Koch and his staff members of kidnapping him. In court papers, Mr. Koch’s lawyers said the former employee had made the claim in a lawsuit because he was angry and embarrassed that his fraud had been exposed. A judge later dismissed the case. “My biggest failing is I’m too trusting of people,” Mr. Koch said. Oxbridge was created in less than a year on a   campus that once held a Jewish community center. “I don’t know if people appreciate how much happened here in five years,” said Bob Kaufmann, the chairman of the school’s executive committee, who has been given the task of reducing spending. “This is a happy place for children. ” Oxbridge graduates have been accepted this fall to nearly all of the Ivy League universities. One senior won a $100, 000 Siemens scholarship for inventing a   method. “The intention was really good,” Mark Bodnar, the school’s former vice president for technology and security, said about Oxbridge. “It sort of went off the rails a couple of years in. ” Mr. Bodnar, who had been on the admissions committee, said the committee’s recommendations were often overruled by the football coaches. He said that there were so many academically struggling athletes that tutors were overwhelmed, and that the players had to be put in classes separate from the rest of the student body. John Klemme, the academic dean who will take over as head of school, said that some of the struggling students “would have been written off” at other schools, but had found their way to a superior education because of their football prowess. “This is not to be a rich kids’ school,” Mr. Klemme said. Mr. Koch said that about 40 percent of students  —   including those who do not play football  —   received some kind of scholarship. Phillip Taylor, 17, a junior, said he loved the school and the opportunities he had been given, such as spring break study at Cambridge University in Britain. Still, he said he resented the double standard on admissions afforded to football players. “My experience was positive,” he said. “I learned so much. But it does bother me. ” His mother, Cheryl Taylor, also had a daughter in the school’s freshman class in the school’s inaugural year. She said parents like her who are impressed by the education the school offered were startled by its cultural shift. “At first, you had to be academically qualified, but that changed dramatically about two years in,” Ms. Taylor said. “Football began to outshine everything else. ” The football team, the Thunderwolves, made it to the regional finals this past season. The problems at Oxbridge, where tuition is $31, 500 a year, went beyond sports. In interviews, several former employees said Mr. Parsons had created a “toxic” work environment. Employee turnover was high and tens of thousands of dollars were spent on severance packages, tax records show. “If he likes somebody and she’s a pretty girl, they got a signing bonus or a higher salary or a bonus,” Ulle Sinisalu Boshko, the school’s former controller, said of Mr. Parsons. Ms. Boshko, who said she was given a large pay increase to leave one of Mr. Koch’s companies to join Oxbridge, said she had been demoted after fending off Mr. Parsons’ advances for months. She filed a complaint with the Equal Employment Opportunity Commission, which is pending, and then she went public. Her accusations led to an investigation of the entire school by The Palm Beach Post. Reached by a New York Times reporter on the phone for comment last week, Mr. Parsons hung up. Reached on Sunday, he said, “I’m not interested,” and hung up again. After inquiries from The Post, Mr. Koch hired a team of accountants, lawyers and a retired F. B. I. agent to look into the conduct of school officials, including whether employees were rigging bids with vendors and whether they had broken rules by housing students in their homes. Mr. Koch said he had not been able to verify any “super sexual harassment” beyond what he called “ ” comments like “God, that girl’s hot” or “She’s got a great behind. ” But the investigation, he said, turned up information that led to the firing of Mr. Parsons and the forcing out of the athletic director and the coach. Mr. Koch said the investigators did not find any evidence of kickbacks to employees from vendors. He said that if any evidence of   emerged, the employees responsible would be fired. He said budget watchdogs would be hired to cut costs and pay closer attention to spending. “The attitude that was there at the school was that they had a rich guy backing it and they could do whatever they wanted,” he said. He also wants to figure out how to get others to donate to the school, he said. That was one reason he did not name the school after himself.'"}, "time": 1742562270.1230657}