{"duration": 0.015718936920166016, "input_args": {"text": "'When Daniel Rom Kristiansen, a    student in northern Denmark, was given a homework assignment on World War II, his father had a jokey suggestion. Family legend had it that a plane crashed not far from their farm in 1944. “Go out and find the plane,” the father, Klaus Kristiansen, suggested. Much to his surprise, Daniel did. What began as a   attempt by a man to make history come alive for his son turned into   news this week when Daniel, aided by Mr. Kristiansen, discovered the wreckage of a German warplane, along with the remains of a man who might have been its pilot. After the discovery Monday, forensics police officers arrived to secure the site, along with bomb disposal experts and a representative from the German Embassy. Soon, the Danish news media descended on the farm, in the remote town of Birkelse in the north of the Jutland peninsula. Mr. Kristiansen told the Danish newspaper Politiken that his grandfather, who had lived on the farm, had told him years ago about the crash. But in 40 years of plowing the fields, Mr. Kristiansen had seen no sign of the plane. “My granddad was good at telling tall tales,” Mr. Kristiansen said. “But I doubted that this was anything more than just a story. ” After Daniel reacted enthusiastically to his fanciful challenge, Mr. Kristiansen said, he joined the boy in the field, armed with a metal detector  —   and more than a little skepticism. When the detector suddenly sounded, they started digging and found metal fragments, Mr. Kristiansen told Politiken. As their excitement mounted, they borrowed a mechanical excavator from a neighbor and dug about 16 feet into the ground. He said they were amazed to find buried a machine gun part, the remnants of an engine, a fighter pilot’s uniform, bones, a crew member’s ID and a wallet holding coins and a condom. “The plane had crashed into thousands of pieces,” Mr. Kristiansen told Politiken. “Everything was so well preserved that you could hardly see it had been laying there for nearly 75 years. ” The Kristiansens learned that they had found the wreckage of a Messerschmitt Bf 109, a warplane widely used by the Luftwaffe during World War II. An amateur historian from the nearby city of Aalborg told the local news media that a German warplane had taken off on Nov. 27, 1944, from the city, crashed into a swamp and had never been recovered. He speculated that the remains of the pilot who disappeared, Bruno Krüger, could be in Mr. Kristiansen’s field. While there are still many unanswered questions, Mr. Kristiansen told the Danish radio station DR P4 Nordjylland that Daniel had gotten a day off school to watch the teams examining the wreckage. “Luckily,” he said, “my son has something to write about in his assignment now. ”'"}, "time": 1742628539.4220467}