{"duration": 0.12807226181030273, "input_args": {"text": "'\\nWhat will happen on election day? Will there be riots, violence or attacks if the results appear to be dubious, or any number of divisive groups take to the streets? What if the election triggers an economic collapse?\\nThere are any number of scenarios that could come to life, but it seems clear enough that America in 2016 is a nation on edge.\\nCivil unrest may now be only days away.\\nAnd militia groups are getting ready for the worst case scenarios – a fact that the mainstream media is happy to use to fuel the hysteria.\\nvia Reuters :\\nAs the most divisive presidential election in recent memory nears its conclusion, some armed militia groups are preparing for the possibility of a stolen election on Nov. 8 and civil unrest in the days following a victory by Democrat Hillary Clinton. \\nThey say they won’t fire the first shot, but they’re not planning to leave their guns at home, either.\\n[…] Trump has repeatedly warned that the election may be “rigged,” and has said he may not respect the results if he does not win. At least one paramilitary group, the Oath Keepers, has called on members to monitor voting sites for signs of fraud \\n“This is the last chance to save America from ruin,” Hill [ of the Three Percent Security Force ] said.\\nThe implication that militia members would incite violence or start a civil war is false and misleading, but the level of tension surrounding this hugely controversial election hold the perfect recipe for chaos. And if there is some event, the causes and provocations won’t be settled until well after the fact.\\nAmerica is facing its darkest days, and the people are fed up with the criminality and corruption that controls the corporate and political sphere. Now, it appears that the bankers and powers that be are poised to use this divisive atmosphere to fuel a new era of instability. While things come unglued, those in power cross the line and take up even more power.\\nWe are facing a level beyond just martial law, and may live to see the complete takeover of the seats of authority across the country.\\nThe Oath Keepers, as one leading group of militia patriots, have been holding “scenarios and preparation” seminars to prepare the general public and the members of their organization to watch for suspicious election activity – and more importantly – the potential chaos that could result from a disputed election and an angry electorate. Founder Stewart Rhodes wrote :\\nLots of talk of unrest on election day, cyber attacks and even possible terror attacks/false flags. In the face of all of this fear porn we here at Oath Keepers thought one of the best things we can do is take a little time, with some of our most experienced and well-trained leadership and talk with fellow Americans about how to prepare if any of these scenarios manifest. One of the motto’s that I try and live by and I hear echoed in the membership ranks of the Oath Keepers is “It is better to have it and not need it, than to need it and not have it” and that goes for skills as well as for gear. Get trained up, fast. Get geared up, fast, and stock up on food, water, fuel, medical, and spare batteries for all your electronics but especially your radios. Get your gear sorted out, organized, and ready to go. And then pray for the best even as you prepare for the worst.\\nMy advice for election day is to vote early (days ahead if you can) and then get home and stay home (if home is safe!). Stay away from big cities and big crowds, and away from public places that may be targeted for terrorism. If you live in a big city that has the potential for civil unrest, violence, looting and arson, get away from it for a few days and don’t be there when it goes bad. As John Karriman put it, he’d rather sleep under a bridge for a week than be stuck in a riot. Go camping! Your stuff is not worth your life, and your stuff will not save your life, if your home is burned to the ground by arsonists. Get out. But if you stay, then prepare to repel boarders. Keep your family and friends close, and get ready. Go meet your neighbors and talk it over with them and prepare your own Neighborhood Protection Plan. Do it now. Got team Who’s on your buddy team? Who’s on your fire-team? Who’s on your squad?\\n[…]\\nBelow is the video recording of the webinar we held on Thursday night, November 3, 2016 on the urgent topic of potential civil unrest surrounding the election and some critical steps you must take to prepare for it.\\nCivil Unrest Post Election Scenarios & Preparation\\n\\nThere is good cause to be prepared. The population is about to be tested. The rigging of elections is now out in the open, and for better or worse, Donald Trump has rallied people around that sad fact.\\nWhile the mainstream media keeps pretending that the soon-to-be-coronated presumed president-elect is infallible, it is clear to those who understand the deep state government that this has been a coup on the part of the Clinton faction to take over the government and suspend constitutional rights and the rule of law.\\nDictators and autocrats are not the American way, after all, and this “election” has been anything but legitimate. The process, which has long been corrupt and broken, is now being completely manipulated by Team Hillary.\\nFormer intelligence operative Steve Pieczenik claims, however, that patriots within the intelligence and military community are attempting to block her path via a counter-coup of some kind, which he claims is entirely non-violent.\\nAccording to Pieczenik in a video recording released last week, members within the FBI, NYPD and intelligence agency community are fighting back inside the system. What that really means, and whether or not it will come to fruition remains to be seen:\\nYou are now witnessing a new type of American Revolution. The Clintons and Podesta initiated a silent coup to undermine the USG through corruption and co-optation of the elite political leaders. In turn, they were met by the silent counter-coup of our civilian/military Intelligence community.\\nAs a way of counter-acting the Clinton’s silent coup of corruption, these brave men and women of the [intelligence Community ] have released a series of emails through Julian Assange and Wiki-Leaks which underscore the Clintons’ massive corruption attempts to take over our USG through the rigged electoral system.\\n\\nHowever, email exposes and digital evidence of wrongdoing have proven to be insufficient for derailing this campaign.\\nPerhaps this is all the more reason that some are readying for defensive measure and last ditch efforts to save the country from outright tyranny.\\nIs this America’s last stand?\\nRead more: \\nDivided America Poised For Riots: “95% Chance of Widespread Post-Election Violence” \\nSecond Night of Charlotte Police Riots Devolve Into “Chaos, Looting and Violence” \\nHomeland Trains Police for Riots, Civil Unrest: “This Training Has Never Been in Texas Before” \\nStrapped Americans Headed for “Civil Unrest and Riots,” With Poor Spending 60% on Bare Essentials \\n'"}, "time": 1742562521.7661057}