{"duration": 0.03141975402832031, "input_args": {"text": "'EXCLUSIVE – Jackie Mason: Hillary Clinton Too Untrustworthy To Serve As Bathroom Attendant – She’d Steal The Toilet Paper AP via GETTY by Aaron Klein 26 Oct 2016 0 \\n26 Oct, 2016 26  \\nDuring a radio interview, comic legend and political pundit Jackie Mason joked that the only time Hillary Clinton is not lying “is when her mouth is not moving.” “And even then, she is probably lying because she’s probably sitting there thinking of the next lie she is going to tell,” he added.\\n \\nMason claimed that Clinton is so untrustworthy that she likely couldn’t land a job as an “attendant in the ladies’ room because they would be afraid that she would steal the towels or the napkins. Even the toilet paper wouldn’t be safe from her.”\\nMason was speaking during his regular segment on this reporter’s talk radio program, “Aaron Klein Investigative Radio,” broadcast on New York’s AM 970 The Answer and NewsTalk 990 AM in Philadelphia.\\nListen to the interview here: \\n\\nHe continued:\\nDo you think that if she went for any other job besides the presidency that anyone would hire her anywhere? If you saw her resume which is a resume of accomplishing nothing and running from the police three-quarters of her life. She is always either indicted or almost indicted or about to be indicted. Her whole life spent fleeing from the Justice Departments of different countries. Now, this yenta, do you think she would be able to get any other job? …\\nWould you think they would hire her as a chambermaid? Do you know what all those sheets and pillowcases are worth? Do you think they would trust her with it? After they found out the history of her life. Let’s be honest about it, if you went on a vacation would you let her watch your house while you went on vacation? Would you expect to come back and find anything still there?\\nAaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “ Aaron Klein Investigative Radio .” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. \\n  Big Hollywood , Breitbart Jerusalem   2016 presidential campaigns , Aaron Klein Investigative Radio , Hillary Clinton 2016 , Jackie Mason'"}, "time": 1742628558.9130173}