{"duration": 0.11378192901611328, "input_args": {"text": "'WASHINGTON, D. C.  —   Turkish Foreign Minister Mevlüt Çavuşoğlu says Turkey has been “very clear” in explaining its presence in Syria: to defeat the Islamic State. [While expressing support for a political mechanism to remove dictator Bashar   Çavuşoğlu did not affirm Erdoğan’s statement expressly stating that Turkey’s army had entered Syria “to end the rule of the tyrant Assad, who terrorizes with state terror. ”   “From the beginning, our target has been very clear. We have been in Syria to defeat Daesh and to clear many cities in Manbij from Daesh and make those areas   or   zones. ” He added, “our position regarding Assad has also been very clear. Assad has killed more than 600, 000 innocent people,” he said, noting that the Syrian dictator has used chemical weapons “including chlorine gas to carry out these atrocities. ” Turkey has been accused of playing a “double game” on the Islamic State in Syria. President Erdoğan has been accused of helping the terrorist organization in their fight against Kurdish rebels and Syria’s President Bashar  . An   State militant told Newsweek in 2014 that the Islamic State saw Turkey as its ally: “ISIS commanders told us to fear nothing at all because there was full cooperation with the Turks. ” The man, who was named “Sherko Omer” for his safety, said, “ISIS and Turkey cooperate together on the ground on the basis that they have a common enemy to destroy, the Kurds. ” Last year,   reported, “The Cumhuriyet daily’s    Can Dundar and Ankara representative Erdem Gul landed behind bars Nov. 27 for reporting that Turkish intelligence shipped weapons to radical Islamists in Syria. Though they were released three months later, they eventually received jail terms for revealing state secrets. ” In October 2015, nearly 130 people were killed in Turkey after two suspected Islamic State bombers attacked a rally put on by a group of   leftists, the first of a string of bombings and mass shooting the Islamic State has taken credit for within Turkey. In November, Erdoğan announced that Turkey was in Syria “to end the rule of the tyrant   who terrorizes with state terror. ” He insisted that his forces were not in Syria for “any other reason. ” Several days later, Erdoğan reportedly clarified his statement in what was seen as backpedaling of his admission to seeing that Assad’s regime is toppled, saying instead that his troops are only in Syria to target “terror organizations. ” In the month of March 2016 alone, the   Syrian Observatory for Human Rights has documented the deaths of 2, 658 people, including 588 civilians. There were 125 children killed in the conflict. They died in bombings, by mortars, IEDs or random gunfire. Çavuşoğlu asked, “Are we going to legitimize such a regime?” Asked whether removal of Assad is currently possible without leaving a power vacuum ripe for exploitation by Iran and Hezbollah, Çavuşoğlu said, “there will be no vacuum if the political process works. ” He added, “while we are defeating Daesh on the ground, we need to focus on political solutions,” which include talks in both Astana and Geneva. Pressed further and asked if he still felt this way considering Iran’s role in the region, which has been instrumental in causing instability, he added, “Iran’s role there is very clear. It’s dominating not only in Syria but also dominating the politics in Iraq. Therefore, if we only target Daesh, we will be serving the interests of Iran and Hezbollah and other groups on the ground. I don’t think we prefer this. ” Breitbart News reported that the Pentagon, which has been working with the Syrian Kurdish YPG and the Iraqi Kurdish Peshmerga to take Daesh down, has cast some doubt on Turkey’s role in taking Daesh out in the northern reaches of Syria. “We have made clear  …     that we are open to a Turkish role in the continued operations to defeat ISIS in northern Syria,” We haven’t come to an agreement about what that role will be or if there will be one,” Pentagon spokesman Col. John Dorrian said. “But we talk to Turkey through military channels and I believe at diplomatic levels every day. ” He added, “I think I’d like to leave it at we would expect Kurds to be involved. And that’s probably about where we’re at. ” Follow Adelle Nazarian on Twitter and Periscope @AdelleNaz. This article has been edited since publication.'"}, "time": 1742562191.917202}