{"duration": 0.040732622146606445, "input_args": {"text": "'Dakota Access Pipeline CEO Kelcy Warren Should Face the Music Posted on Nov 2, 2016 \\nBy Amy Goodman and Denis Moynihan A Dakota pipeline protester recovers after being pepper sprayed by police near Cannon Ball, N.D. ( John L. Mone / AP ) \\nPresident Barack Obama foreshadowed more complications for the Dakota Access pipeline this week, as he told an interviewer that “right now the Army Corps is examining whether there are ways to reroute this pipeline.” With hundreds arrested in recent weeks at the Standoff at Standing Rock, North Dakota, the movement to halt construction of this 1,200-mile, $3.8 billion oil pipeline only builds. Musicians are increasingly joining the fray, striking an unexpected chord: pressuring oil billionaire Kelcy Warren, CEO of Energy Transfer Partners, which owns the pipeline. Warren also owns a small music label and recording company , and is the founder and driving force behind the Cherokee Creek Music Festival in Texas. Many musicians, including folk/rock legend Jackson Browne, are banding together to confront Warren and help stop the pipeline. In a statement published in September by Indian Country Today Media Network, Jackson Browne wrote: “I met Kelcy Warren on one occasion, when I played at the Cherokee Creek Music Festival, held at his ranch. Later his company, Music Road Records, produced an album of my songs. Though I was honored by the ‘tribute’ and think highly of the versions—which were done by some of my favorite singers and songwriters, I had nothing to do with producing the recordings or deciding who would be on it.” Jackson continued: “I do not support the Dakota Access pipeline. I will be donating all of the money I have received from this album to date, and any money received in the future, to the tribes who are opposing the pipeline.” The album Browne referenced is titled, “Looking Into You: A Tribute to Jackson Browne.” Emily Saliers and Amy Ray, better known as the folk duo the Indigo Girls, have been to the Standing Rock resistance camps, where thousands have been facing off against an increasingly violent, militarized police force that is facing down the Native American water protectors with attack dogs, armored personnel carriers, pepper spray, concussion grenades and deafening acoustic cannons. In addition to raising awareness and funds for the land and water protectors at Standing Rock, the Indigo Girls are organizing musicians to challenge Kelcy Warren directly. “Kelcy Warren also happens to be a passionate music lover and owns a festival, Cherokee Creek music festival,” they wrote in a recent Facebook post. “Indigo Girls have played the festival and had a song on the [Jackson Browne] tribute record. When we participated in those events, we had no idea about Kelcy Warren’s connection to big oil and its imminent threat to the Standing Rock Sioux. Now we know.” They wrote a letter to Warren, which was co-signed by Jackson Browne, Shawn Colvin, Joan Osborne, Keb’ Mo’ and others. It read, in part, “We realize the bucolic setting of your festival and the image it projects is in direct conflict with the Dakota Access pipeline ... this pipeline violates the Standing Rock Sioux Nations’ treaty rights, endangers the vital Missouri River, and continues the trajectory of genocide against Native Peoples.” The letter concluded, “We will no longer play your festival or participate in Music Road Records recordings. We implore you to stop construction of the Dakota Access pipeline.” Kelcy Warren is a Texas oil billionaire several times over, and might not be easily deterred by a threatened boycott. In fact, when global oil prices began dropping, “Nobody was happier about the crash than Energy Transfer Chairman and CEO Kelcy Warren,” Bloomberg Markets reported. All his competition, Warren gloated, “vaporized.” He, like many analysts, anticipates that oil prices will rise, fracking in the Bakken shale region will boom again, and his Dakota Access Pipeline will be the only conduit to carry the crude oil to the Texas Gulf Coast for refining and export. “You must grow until you die,” Warren told Bloomberg. Jackson Browne also wrote in his statement: “I intend to support public resistance to the Dakota Access pipeline as much as I can. To quote a song of mine: ‘Which side? “—the corporations attacking the natural world, drilling and fracking, who do it with the backing of the craven and corrupt? “—Or the ones who fight for the earth with all their might, and in the name of all that’s right, “Confront and disrupt?’” In the press release about the Jackson Browne tribute album from Music Road Records, Kelcy Warren wrote, “I don’t know of anybody that admires Jackson more than me.” As Browne and other musicians rally with the land and water protectors at Standing Rock, and as President Obama signals post-election action on the pipeline, it’s time for Kelcy Warren to face the music. \\nAdvertisement'"}, "time": 1742628389.5510898}