{"duration": 0.03330683708190918, "input_args": {"text": "'A group of mostly white students at the University of   is demanding that the school offer a wholly free education to black students, even if they are convicted criminals. [The group, the Associated Students of Madison, demanded that the school offer free tuition, free living expenses, and cancel all fees for all African American students as a form of “reparations” for the practice of slavery that ended 150 years ago, Fox News reported.  “The university’s rhetoric suggests that it is committed to diversity and inclusion, so this legislation compels the university to move towards action  —   which is imperative,” said the resolution’s author, ASM Student Council Rep. Tyriek Mack. “If no one challenges the university’s empty promises, then the racial composition will remain stagnant. ” Calling it the “Cognitive Dissonance Resolution,” the ASM policy proposal demands free tuition for all black people, including formerly incarcerated criminals. Free tuition, free housing, and no fees would save a black student up to $20, 000 a year. The resolution also demands that universities spend ten percent of their donations on financial aid. Another provision called on the school to weigh admittance by geographical regions, instead of grades. While black students make up only two percent of the student body, University spokeswoman Meredith McGlone insisted that the proportion of students of color has grown from 11 to 15 percent under current administration policies, according to the Milwaukee Journal Sentinel. On the other hand, the State of Wisconsin itself is only six percent black, while the U. S. population is 12 percent black. In the end, McGlone said that some of the things the student group wants are not even legal. “It’s unclear that the methods that they’re suggesting are either legal or the best approach to accomplishing those goals,” McGlone said. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628317.8085456}