{"duration": 0.14745783805847168, "input_args": {"text": "'NICE, France  —   At times it was hard to know who was on trial, the smuggler or the state. The defendant, Cédric Herrou, 37, a slightly built olive farmer, did not deny that for months he had illegally spirited dozens of migrants through the remote mountain valley where he lives. He would do it again, he suggested. Instead, when asked by a judge, “Why do you do all this?” Mr. Herrou turned the tables and questioned the humanity of France’s practice of rounding up and turning back Africans entering illegally from Italy in search of work and a better life. It was “ignoble,” he said. “There are people dying on the side of the road,” Mr. Herrou replied. “It’s not right. There are children who are not safe. It is enraging to see children, at 2 in the morning, completely dehydrated. “I am a Frenchman,” Mr. Herrou declared. The trial, which began on Wednesday, is no ordinary one. It has been substantially covered by the French news media for its rich symbolism and for the way it neatly sums up the ambiguity of France’s policy toward the unceasing flow of migrants into Europe and the quandary they present. France, foremost among European nations, prides itself on enlightened humanitarianism, fraternity and solidarity. And yet, perhaps first among them, too, it is struggling to reconcile those values with the pressing realities of a smaller, more globalized world, including fear of terrorism. The contradictions are being played out in courtrooms, in politics and in farmers’ fields, on the sidewalks of Paris and in train stations from the Côte d’Azur to the northern port of Calais, where the government demolished a giant migrant camp in the fall. On the one hand, politicians in this year’s presidential election are competing to see who can take the toughest line on securing France’s borders. Most are promising a crackdown on migrants, with admission reserved for   cases of political persecution. Terrorist attacks, including the one last summer in Nice that killed 85 people, have exacerbated   sentiment. But in these remote mountain valleys, where Jews fleeing the Nazis and the Vichy collaborators found refuge during World War II, Mr. Herrou has become something of a folk hero by leading a kind of loosely knit underground railroad to smuggle migrants north, many destined for Britain or Germany. His work has won him admiration for his resistance to the state and his stand that it is simply right to help one’s fellow man, woman or child. Others in this region seem to agree. In the square outside the   courthouse, hundreds of sympathizers gathered and shouted, “We are all children of immigrants!” Mr. Herrou got a hero’s welcome as he descended the steep steps late in the evening, trailed by television cameras. Inside, not even the prosecutor,   Prêtre, seemed to want him there and praised his cause as “noble. ” He asked for an   sentence, but quickly reassured the court that it should be suspended, “of course. ” Still, the law is the law. “He’s demonstrated a manifest intention to violate the law,” Mr. Prêtre told the court. “One can criticize it, but it’s got to be applied. ” The verdict, which will be made by the panel of three judges who heard the case this week  —   there was no jury of peers  —   is scheduled to be announced on Feb. 10. The appeal for leniency was both an acknowledgment of widespread discomfort with the law, as a well as recognition of Mr. Herrou’s growing status in the region around Nice and its mountainous backcountry, the Roya Valley. Mr. Herrou was voted “Azuréen of the Year” last month by the readers of the leading local newspaper,   to the fury of regional officials. “I am Cédric,” read one of the placards in the crowd. “Long live the righteous of the Roya,” read another. The courtroom on Wednesday was filled with people from the mountain  —   the men bearded and ponytailed, the women in duffel coats  —   who had come to support Mr. Herrou and who were convinced right was on their side. The notion that Mr. Herrou is trying to uphold what he sees as basic French values, rather than violating the law, is much of the reason he appears to enjoy a considerable measure of popular support. The argument formed the essence of his lawyer’s defense strategy. Remember the last word in the French Republic’s motto, “Liberté, Egalité, Fraternité,” his lawyer, Zia Oloumi, told the court. “They are saying M. Herrou is endangering the Republic,” Mr. Oloumi told the three judges. “On the contrary, I think he is defending its values. “You see, you have got this value, fraternity, and the dictionary is quite clear,” Mr. Oloumi said. “Think about the impact of your decision on the practical application of the idea of fraternity. ” Mr. Herrou was not making any political points, Mr. Oloumi insisted. He was merely responding to a humanitarian crisis in his own backyard the Roya Valley had become a way station for migrants. The judges did not respond. But the lightness of the sentence called for by Mr. Prêtre suggested that the concepts invoked by Mr. Oloumi had resonance. Mr. Herrou’s accusers seemed most taken aback by his stubbornness. Not every migrant Mr. Herrou picks up is by the side of the road. He finds many outside the migrant camp across the Italian border at Ventimiglia, looking especially for women and children. The presiding judge, Laurie Duca, reminded him he had first been arrested in August, near his mountainside home at    with a van full of migrants. At that time, the prosecutor released him, suggesting that Mr. Herrou’s humanitarian motivations absolved him. That first arrest was evidently merely a warning. “After August, you said you knew it was illegal,” Judge Duca remarked in court. No matter. Mr. Herrou persisted, describing his   work to journalists last fall and even occupying a disused summer camp owned by the state railroad when his own modest homestead became overwhelmed. At that point, in   the authorities decided they had had enough of him. “You were there, and you were extremely active,” the judge said. “Why so much press?” Mr. Herrou replied, “It is right that society should know about all this. ” The judge and the prosecutor suggested that this time Mr. Herrou would not get the humanitarian pass he had benefited from previously. The local political establishment is furious with him. “At the very moment when we need strict controls, Mr. Herrou’s ideological, premeditated actions are a major risk,” Eric Ciotti, the president of the departmental council and a leading   member of Parliament, wrote in  . Mr. Prêtre, the prosecutor, suggested that Mr. Herrou’s persistence and openness had been his undoing. “Mr. Herrou acknowledges everything,” Mr. Prêtre said, with astonishment. “This trial springs from a communications strategy for a cause that I totally respect. ” And yet, “this is what he told the police. He said, ‘I am violating the law.’ But I am the prosecutor. I must defend the law. ”'"}, "time": 1742562104.9878898}