{"duration": 0.12696027755737305, "input_args": {"text": "'In one letter, Donald J. Trump ranted about the crisis of unsightly hot dog vendors on his beloved Fifth Avenue. “Having ketchup and mustard splattered all over the sidewalk,” he wrote, “is disgraceful. ” In another note, he paid flowery tribute to his young wife, whom he referred to as “my little darling. ” “You’re everything I hoped for,” he wrote. In a different missive, he offered a rare admission of weakness, declaring, “I am nothing more than a frustrated writer of little talent. ” Mr. Trump, the presumptive Republican presidential nominee, is a master of modern media, exploiting Twitter and television to punish his enemies, energize his allies and promote himself. But perhaps his most powerful and memorable form of communication is the   ritual of a personal letter, written on embossed paper or scrawled across a newspaper clipping, signed by hand and sent from the 26th floor of Trump Tower. Churned out prolifically from a   desk, they are letters of gratitude, hate, flattery and revenge, dispatched to teenage admirers and   mayors, professional athletes and magazine editors. The tone can range from florid to juvenile, pleading to poisonous. Tightly clutched and prominently displayed even by those who despise him, the epistles have become keepsakes and mementos for hundreds of people across the country. Viewed as a collection from the 1970s to now, they offer an unusual archive of his emotional ups and downs. The 2009 letter that Mr. Trump sent to Mike Tollin, a movie director, makes for painful reading: It denounced a film by Mr. Tollin that explored Mr. Trump’s role in the collapse of a football league as “third rate” and “extremely dishonest. ” In a fulminating flourish, Mr. Trump wrote: “P. S. You are a loser. ” Nevertheless, Mr. Tollin had the letter framed and he keeps it on a shelf in his office, next to photographs of his family. “People come by and immediately want to see it, touch it and hold it,” Mr. Tollin said with pride. Today, as Mr. Trump tries to make peace with hostile figures in his party, the candidate renowned for his rhetorical flame throwing is deploying a conciliatory style of letter writing as his chief weapon. His handwritten overtures have started to arrive in the mailboxes of seemingly implacable foes, like Charlie Sykes, a conservative radio host in Milwaukee, who has described Mr. Trump as a “whiny,   bully. ” “Charlie,” began Mr. Trump’s note, scribbled with a thick black pen on the front page of The New York Times, next to an article about skeptical Republicans warming to Mr. Trump, “I hope you can change your mind. ” Ever attuned to incentives, the real estate mogul dangled an offer: “Look forward to doing your show,” he wrote, adding, “I will win!” It did not change Mr. Sykes’s dim view of Mr. Trump. But he was, he conceded, impressed by the gesture. “Give him credit that he’s doing this,” Mr. Sykes said. “He’s willing to do some things that might be somewhat at odds with his public image. ” The letters  —   culled from personal and public archives  —   reveal Mr. Trump’s insecurities, but also his perceptiveness about power, ego and what motivates people. From early on, he seemed to intuitively grasp the potency of his praise when lavished on   men. In the 1990s, Mr. Trump occasionally fawned over New York’s brash mayor, Rudolph W. Giuliani. In one letter, Mr. Trump tore out a page from a magazine interview in which he had called Mr. Giuliani “the greatest mayor that the city’s ever had. ” In case Mr. Giuliani missed the homage, Mr. Trump drew two bold arrows, each pointing at the glowing passage, and reiterated the message in a handwritten note: “Rudy, you are the greatest!” he wrote, adding, “see you soon. ” There is never any question about authorship: Mr. Trump’s style of writing sounds virtually identical to his hyperbolic manner of speech, with a healthy sprinkling of the words “great” and “tremendous,” abundant displays of   and    claims of success or doom. In a 1985 letter to Mayor Edward I. Koch, Mr. Trump predicted New York City’s imminent downfall if a fellow real estate developer, Arthur E. Imperatore Sr. were allowed to start a ferry service between New Jersey and Manhattan. “Real estate values and taxes in New York would plummet,” Mr. Trump prognosticated darkly. “Why would anyone want to live or shop in New York?” (Mr. Imperatore started the ferry service without destroying New York’s economy.) As a writer, Mr. Trump sometimes reached, awkwardly but earnestly, for eloquence. In a 1983 letter to A. M. Rosenthal, then the executive editor of The Times and a lunch companion, Mr. Trump turned poetic as he tried to capture his reaction to an article that Mr. Rosenthal had written about returning to  Poland for the first time in decades. “It is moving it is sad it is hopeful (?) it is devastating,” Mr. Trump wrote, saying that his wife at the time, Ivana, who grew up in Eastern Europe, agreed. “It truly captured the strength, the will and the soul of the Polish people,” Mr. Trump wrote. He could write with striking tenderness to Ivana, according to notes reviewed by The Times. “I adore and love my little darling,” he wrote to her in one. “I truly believe that you are the greatest,” he wrote in another. On the page, anyway, Mr. Trump was even capable of humility, describing himself as a scribe of “little talent” in a 1985 note to Arthur Ochs Sulzberger, then the publisher of The Times. (Mr. Trump had an agenda: to complain about a reporter he disliked.) Mr. Trump traces his epistolary habits to his attempt to win over Franklin M. Jarman, who controlled a Manhattan department store that Mr. Trump wanted to buy in the 1970s to make way for Trump Tower. Mr. Jarman rarely replied to Mr. Trump’s letters, but he had, in fact, read them, Mr. Trump wrote in his book “The Art of the Deal,” laying the groundwork for an agreement. “The letters I wrote eventually did have an impact,” Mr. Trump said. For years, Mr. Trump sent his letters the   way, by mail. But over time, members of his staff dragged him into the internet era  —   sort of. He still writes by hand, brandishing the favored tool of teachers’ corrections and athletes’ autographs, a black Sharpie. Now his aides often turn the letters into digital files, scanning them and sending them by email. But he refuses to let anyone else do the writing. “If I had a secretary to do them,” he said in an interview, “they wouldn’t be nearly as effective, they wouldn’t be nearly as sharp. ” Each letter concludes with his extravagant signature, which resembles a city skyline or “a seismograph,” as Graydon Carter, the editor of Vanity Fair and a repeat recipient of Mr. Trump’s screeds, described it. Many of his letters targeted the famous and credentialed, but from time to time they reached the little known and uninfluential. Mr. Trump penned a letter of encouragement in 2014 to an    student in Texas, John Russell Niederer, who had expressed a desire to meet him. “Work hard and be smart,” Mr. Trump told him. The letter now hangs on Mr. Niederer’s bedroom wall. “For him to take the time to send a message to somebody like me,” he said, “was really, really cool. ” A vindictive side is never far from view in Mr. Trump’s correspondence. After the basketball legend Kareem   wrote a critical essay in The Washington Post about Mr. Trump’s candidacy, Mr. Trump sent him a copy of the essay with a biting message sprawled across it. “Now I know why the press always treated you so badly  —   they couldn’t stand you,” Mr. Trump wrote. “The fact is that you don’t have a clue about life and what has to be done to make America great again!” Mr.   said he was flabbergasted. “It was such a petty and childish reaction, like a teenage boy responding to being turned down for a date by whining, ‘Well, nobody likes you!’ ” he said. He likened Mr. Trump’s decision to write his reply on the original article to “a dog urinating on a tree to mark its territory. ” Mr.   had to get rid of the letter. “I crumpled it up real nice and tight and skyhooked it into my wastepaper basket,” he recalled, invoking his trademark shot. Others cannot let go. “I’m definitely going to keep it,” Mr. Sykes, the radio host, said of his letter. “Probably in a desk drawer. ”'"}, "time": 1742561980.8898003}