{"duration": 0.1044158935546875, "input_args": {"text": "'ST. CLOUD, Minn.  —   The man who the police say stabbed 10 people at a mall here on Saturday seemed like a model of assimilation, not a violent jihadist, people who knew him and his family said. The son of Somali refugees, he lived in the United States most of his life, did well in school, played sports, worked as a security guard and took classes at a local college. But a new description has been applied to him: terrorist. As he stalked through the Crossroads Center mall, wearing a security guard uniform and wielding a knife, the attacker, identified by officials on Monday as Dahir Adan, 20, mentioned Allah and asked at least one victim if he was Muslim, the police said. A report by a news agency linked to the Islamic State claimed on Sunday that a “soldier of the Islamic State” was behind the stabbing. The F. B. I. is investigating the attack as a possible terrorist act. But law enforcement officials were unsure whether Mr. Adan had made contact with any terror organization, or had “” heeding the online calls to radical jihad that terrorist groups have used to goad Westerners into mounting attacks at home. The St. Cloud police chief, William Blair Anderson, stressed that the investigation had barely started, adding, “I want to know everything about this individual since the day he was born until last Saturday. ” “He was a normal American kid,” said Jama Alimad, a leader among St. Cloud’s ethnic Somalis and a friend of the Adan family, who had seen Mr. Adan as recently as this summer. “I can’t see anyone more assimilated than that guy. ” As customers in the mall fled the attacker and rushed for the exits, the rampage ended when Mr. Adan was shot and killed inside Macy’s by an   police officer. On Monday, the St. Cloud police raised the number of wounded from nine to 10, explaining that they had learned of a victim who had not immediately sought medical treatment. None of the eight men and two women who were stabbed suffered   injuries, and none remained hospitalized, officials said. The mall reopened on Monday morning. Since the attack, people who had encountered Mr. Adan have tried to reconcile the quiet,   youth they saw with the bloody accounts of his actions. People who have spoken with his family said that he had shown no signs of radicalization, and that on Saturday, he seemed to be in good spirits and said he was going to the mall to buy a new iPhone. “That’s something he was hiding very well if indeed he did that,” said Haji Yussuf, director of UniteCloud, a group that tries to resolve tensions between cultures in the city. Until the police release video recordings of the attack, “we cannot believe the speculation we hear,” said Mohamoud Ismail Mohamed, executive director of the Saint Cloud Area Somali Salvation Organization, who said he helped the Adan family settle in St. Cloud about seven or eight years ago. “What happened that night between leaving home and the shooting is the million dollar question. ” A few of Mr. Adan’s friends and schoolmates took to social media to express their disbelief and confusion. One called Chammy said on Twitter, “He was such a sweet humble guy, and that’s still how I see him. ” Abdulwahid Osman, a lawyer for the Adan family, released a statement Monday night saying that Mr. Adan’s relatives wanted to express their “deepest sympathy and condolences” to the injured and their prayers for recovery. “As a family, we are committed to fully cooperating, within the limits of the law, with all relevant law enforcement agencies as they conduct their investigation,” the statement said. The statement also urged people “not to rush to judgment or conclusions” and said “our family loves St. Cloud and this state. ” President Obama said that he was being briefed on the Minnesota investigation, and that there was no sign of a link to explosions in and around New York City on Saturday. “At this point, we see no connection between that incident and what happened in New York and New Jersey,” the president said at a news conference in New York, where he was attending the annual session of the United Nations General Assembly. Mr. Alimad said Mr. Adan had immigrated to the United States as a toddler and grew up in St. Cloud. He said Mr. Adan excelled in school, and was not especially religious, though also not an atheist. “We need to get to the bottom of this,” he added. “We need to know what triggered this kid. ” The Star Tribune in Minneapolis reported that Mr. Adan lived with his father in an apartment in St. Cloud. The father said his son was born in Kenya, where many Somalis have fled to escape the   civil war in their country. He graduated in 2014 from Apollo High School in St. Cloud, then enrolled at St. Cloud State University, intending to major in information systems, the university said, but he was not enrolled for the fall term. Mr. Adan worked part time for a global security firm, Securitas, which assigned him to weekend guard duty at an Electrolux facility in St. Cloud, according to both companies. Securitas released a brief statement saying that Mr. Adan had quit in June, offering little else about his history with the company, except that he “was hired in accordance with Minnesota state law and company policy. ” Family friends said he had a security guard job at the time of the attack, but it was not clear where. The attacker was stopped by Jason Falconer, an     police officer in Avon, a nearby town. “He’s a firearms instructor for the City of Avon,” said Corey Nellis, Avon’s police chief. “He’s a competitive shooter. If I was going to ask anybody to fire live rounds in a crowded mall, I would trust his abilities next to anybody’s. ” Chief Nellis said that Mr. Falconer, a former police chief in another nearby town, Albany, worked only an occasional shift for his department in fact, he was not scheduled to work over the next two months. Minnesota is home to about 25, 000 Somalis, the largest concentration in the United States. Some have flocked in recent years to St. Cloud, a small city northwest of the Twin Cities, in search of safety and jobs, where Somali leaders say they have mostly been made to feel welcome. “Knowing your neighbor makes you less fearful of your neighbor,” said Mayor Dave Kleis, who said the city has worked hard to welcome and integrate the newcomers. Gov. Mark Dayton, a Democrat who has long been an outspoken advocate for immigrants, said at a news conference on Monday, “I implore citizens of St. Cloud, and really citizens throughout Minnesota, to rise above this tragic incident and to remember our common humanity, our shared citizenship, and our shared desires to live together peacefully. ” But Somalis said there was a widespread fear of a backlash after the attack. “We are really fearful,” Mr. Alimad said. “Kids are afraid. Women are afraid to go to shop. And this is happening in the land of the free. ”'"}, "time": 1742562070.0141754}