{"duration": 0.06325221061706543, "input_args": {"text": "'Comments \\nThe AP has uncovered concrete evidence that Melania Trump worked illegally in the United States, before obtaining an H-1B Visa as a fashion model: \\nMelania Trump was paid for 10 modeling jobs in the United States worth $20,056 that occurred in the seven weeks before she had legal permission to work in the country, according to detailed accounting ledgers, contracts and related documents from 20 years ago provided to The Associated Press. \\nMelania Trump’s immigration status was first questioned in early August after the New York Post released nude photos of the prospective First Lady. \\nThat led the Washington Post to fact check the story and concluded that the photos were taken the year before she claimed to have arrived in America. The facts are that she definitely worked in the United States before getting her first visa in 1996 : \\nMrs. Trump, who received a green card in March 2001 and became a U.S. citizen in 2006, has always maintained that she arrived in the country legally and never violated the terms of her immigration status. During the presidential campaign, she has cited her story to defend her husband’s hard line on immigration. \\nThe wife of the GOP presidential nominee, who sometimes worked as a model under just her first name, has said through an attorney that she first came to the U.S. from Slovenia on Aug. 27, 1996, on a B1/B2 visitor visa and then obtained an H-1B work visa on Oct. 18, 1996. \\nThe documents obtained by the AP show she was paid for 10 modeling assignments between Sept. 10 and Oct. 15, during a time when her visa allowed her generally to be in the U.S. and look for work but not perform paid work in the country. The documents examined by the AP indicate that the modeling assignments would have been outside the bounds of her visa. \\nLater reports from the Trump organization about her immigration status appeared to show that under the Republican nominee’s own policies , Melania Trump probably would not be allowed in the country. \\nImmigration violations can be re-litigated at any later date, if they are fraud or misrepresentation on any of the documents used to gain entry or US citizenship, although this almost never happens. \\nThe AP reports that the United States government only seeks to revoke citizenship in the “most egregious cases, such as instances involving terrorism or war crimes.” \\nHowever, it’s likely that Melania Trump’s immigration status and her Republican nominee husband’s hypocritical stances towards immigration may be thrust into the maelstrom of the waning days of this year’s presidential campaign. \\nThe big question is: Using the Trump standard for deportation – which would send his wife home to Slovenia – will the Republican candidate petition to send his wife out of the United States?'"}, "time": 1742563540.1077485}