{"duration": 0.09690093994140625, "input_args": {"text": "'Youth blood thrives through the alternative rock band Tumbler, who recently released their second studio album, Come to the Edge . Recorded in Epsom, England, this acoustic passion project sounds like a mix between The Kinks and The Beatles, along with a few elements from pop thrown in for modern taste.\\nJust as interesting as the genre composition, is the band composition. Richard Grace, has led a family of music for ages. Both him and son, Harry Grace, play guitar and sing on Come to the Edge . This project comes after the positive acceptance of their debut album You Said , in 2015. The album proved to be a powerful experience that would spur Tumbler to finish an entire second album with ideas they created along the way. The work payed off, Come to the Edge sounds pristine and polished, it sounds passionate and somber, it sounds like lessons and living life.\\n\\nHarry Grace is the young star of the band. Following in his father’s footsteps from a young age, Harry wrote his first guitar song when he was only eight years old. Music has stuck with him over the years, in his teen years in played in multiple bands on bass, drums, vocals and most things in between. Tumbler actually came about when Harry suggested they put some professional work into their family kitchen gatherings. With such a strong musician to follow it is no wonder Harry is improving so rapidly.\\nThe final participant of the project, David Needham, along with playing the keyboard, also produced the album, adding his technical expertise to hot-pot that was the Grace family’s passion and experience. The album has so much work behind it, Come to the Edge has a lot to going for it, this is apparent from even a short listen from songs like “Don’t Take Much” or “Falling.”\\n“Looking back there were cracks, but not so clearly at the time.”\\nCome to the Edge really sounds like passion for the sake of passion, not music for the sake of money. This becomes really apparent when band members talk about the project. Emerging from family get togethers were old songs they would sing decades ago, the song “Joanne” is one such example, but with the help of producer David Needham bringing strings and other instruments into the song, it has changed greatly.\\n“I won’t run from this house we built from stone”\\nThe vocal work sounds like a mixture of new and traditional, some lines lead right into the next, while others repeat and loop as expected. Both Harry and Richard have their own singing style, they accompany each other with grace, but write in different ways. With multiple talented singers, there is usually a voice guiding the way.\\nThe music fans that will take the most out of Come to the Edge are likely also musicians, or at the very least hold an appreciation for harmonious vocals and acoustic guitar. That being said, the album has different atmospheres across different tracks, songs such as “Winter Cold Heart” sound somber while others such as “Sweetest Thing” sound carefree, as for the vocal spotlight “Week” would be a strong contender.\\n\\nFrom the looks of it Tumbler is growing steadily. They have the potential and the drive to continue giving life to music and only time will tell how they choose to do that. Come to the Edge dropped July 26, 2016 and can be found in the links below.\\nUnderground Examinations is a series of Independent Music Reviews with the intention of giving new music a fair and appropriate opportunity to be enjoyed. \\nOpinion by Garrett Jutte\\nSources\\nTumbler Music \\nTumbler Band \\nYoutube \\nFor more Reviews click here .    Acoustic , Alternative Rock , Come to the Edge , Folk Rock , Tumbler , Underground Examinations'"}, "time": 1742564452.1694846}