{"duration": 0.06385421752929688, "input_args": {"text": "'Silver Price Discovery – It’s Still a Fix Posted on Home » Silver » Silver News » Silver Price Discovery – It’s Still a Fix \\nYou could not really get more corrupt than this. They’ve gone from a few banks setting the price to a few banks setting the price. From Dr. Jeffrey Lewis : \\nAbsurdities continue in the world of derivative or electronic or paper silver. In what will someday be viewed as the monumental public relations miracle that it is, the silver fix has been transplanted into just another body riddled with cancer. \\nBelow I’ve collected and commented on one of the most prevalent stories characterizing the announcement. \\nThe essence of this is moderately transparent. The banks need to avoid more public relations disasters. They are certainly in for enough as it is. \\nThe CME Group (Chicago Mercantile Exchange) is the perfect replacement. The COMEX A for-profit facilitator of the very mechanism used to control and exploit to begin with. \\nExchanges are like currencies is some way. Most people view exchanges as harmless independent facilitators; in the way that many people still believe at some level that the dollar or any fiat currency used today is “backed by gold”. \\nOf course, not much could be further from the truth. The CME is a for-profit enabler, a behemoth and primary culprit in the price manipulation mechanism. \\n“CME Group and Thomson Reuters will operate an electronic silver benchmark when the 117-year-old “fix” is disbanded in August, in a move widely seen preceding sweeping reforms of precious metals price-setting.” \\nThe underlying assumption is that it’s okay to set prices to begin with. \\n“ The London Bullion Market Association (LBMA) said in a statement on Friday that CME Group will provide a price platform and methodology for the daily process, while Thomson Reuters is responsible for administration and governance.” \\nYou could not really get more corrupt than this. They’ve gone from a few banks setting the price to a few banks setting the price. \\nOf course, most people – especially traders who specialize in reading artificially induced tea leaves – like assuming your screen saver display is a clear indication of reality. \\n“CME/Thomson Reuters will start testing the new process in early August after the closely contested competition to produce a solution.” Since, there was a competition – a very heated one – it must be necessary. Everyone loves a circus. Here you have a classic example of one. \\n“The silver fix – used by producers, consumers and investors – is set every day at noon by three banks via a conference call, working out a price at which their customers are willing to buy and sell the metal.” \\nAnother assumption is that these banks are there looking out for their customers. Perhaps occasionally. \\nNow, instead of a conference call, it’s been handed over to an exchange that is notorious for HFT and enabling the decades long manipulation – essentially taking pesky users and producers completely out of the equation and handing it over fully to speculators. \\n“The LBMA consulted market participants with the aim of producing a transparent electronic alternative that complies with toughened regulatory benchmarking standards.” \\nElectronic alternative to physical reality. But toughened benchmarking standards will make the whole charade perfectly fail safe in its mission to profit by enabling real clients to front run the market, delaying and “fragilizing” an already precarious imbalance. \\nThe new price mechanism is electronic, auction-based and auditable, the LBMA said. It is also tradable with an increased number of direct participants. \\nYes, now more disinterested speculative participation can come in and continue the attempts at distorting reality with ones and zeros. In other words, more sheep for the slaughter. \\n“The winner of the silver fixings is of course the first who would have his hat in the ring when it comes to conducting the other fixings,” said one market participant who took part in the LBMA consultation. \\n“Financial details of the service to be provided by CME Group and Thomson Reuters were not disclosed.” \\nYou can practically guarantee that it will be a bonanza for all parties concerned and that the big banks are laughing, as it were, all the way to the bank. \\n“ The banks involved in the current silver fixing are Deutsche Bank, HSBC and Bank of Nova Scotia–ScotiaMocatta. \\nDeutsche Bank’s decision earlier this year to leave the gold and silver fix process raised questions about the future of the precious metals benchmarking system.” \\nYes, basically they were put on the hot seat. In realizing the potential public relations fiasco, they pulled out of the whole thing all together. Again, that the issue is framed the way it is (a benchmark with a serious tone) is laughable, if not absurd. \\nJust a little while. It will all be forgotten. History is re-written in a mechanism even Orwell would never have imagined. The massive multinational hedge funds disguised as banks have managed to deflect a public relations nightmare – another potential nine inch nail in the coffin of confidence. The fix may have a new home, but the paper market is evermore broken. \\nWe spent the last 30+ years educating an entire generation on how to extract wealth from our economy through the application of ever more complex financial arrangements. \\nBut all this added complexity didn’t produce any real tangible value. It’s a fiscal Jenga pile, and now we need the wood. We don’t have the luxury of time to unbuild this in an orderly way – to re-establish the relationship between human productivity and the value of money. \\nAnd so the Fed will act astonished when the greed-fueled architects of this mess grab the easy-to-reach wood from the bottom of the financial heap. 2017 Gold Pandas and 2017 Silver Pandas Are Now Available! Secure Your 2017 Panda Coins Today at SD Bullion! This entry was posted in Silver News and tagged Jeffrey Lewis , silver fix , silver manipulation . Bookmark the permalink . Post navigation'"}, "time": 1742628575.8791952}