{"duration": 0.07829022407531738, "input_args": {"text": "'Melissa   the speaker of the New York City Council, revealed this week that she was the victim of sexual abuse as a child, saying at an emotional news conference that she was compelled to go public in reaction to the video in which Donald J. Trump is heard boasting about foisting himself on women. “This is the first time I ever publicly talked about this,” Ms.   said on Thursday, speaking to reporters at City Hall and appearing at times to hold back tears. “Twenty percent of young girls unfortunately experience some form of sex abuse and molestation. ” “And,” she added, pausing as her words caught in her throat, “I fall in that category. “Between the ages of 5 and 8, I was molested by two different individuals at two different points in time, and it’s a reality that you live with every day. ” Ms.   47, a Democrat, said she decided to speak out about her experience after watching the video of Mr. Trump that emerged last Friday, in which he is heard bragging of being able to kiss and grope women and get away with it because he was famous. Mr. Trump, now the Republican nominee for president, was speaking on the tape, recorded in 2005, with Billy Bush, a host of the NBC program “Access Hollywood,” who was heard laughing and egging him on. “When you have an individual who is boasting about violating, and taking from, a woman something without her consent, I just couldn’t anymore,” Ms.   said, adding that her public role gave her a responsibility to speak out. “And to have someone laughing and goading it and enabling it is just, it was very painful for me and it triggered things that I hadn’t felt in a long time. ” Ms.   first revealed her personal trauma on Wednesday evening on Twitter, writing that one in five girls are “victims of child sex abuse. ” She added, “I’m that   5. Trump’s misogyny  sexual violence has reopened wounds I’ve tried to heal. ” She followed it with “#Basta,” which is Spanish for “enough. ” Many people, including other elected officials, responded on Twitter by calling her courageous and offered their support. A few minutes later, Ms.   posted on Twitter again: “#NoMoreSilence I am empowered. And Strong. #FearMe. ” While she did not provide further details at the news conference of the abuse, she spoke in anguished terms of her ordeal and the difficulty of discussing it publicly. “It’s a struggle that you go through and it never ends,” she said. “It’s not something you forget or you move on in life. It’s part of your life. ” She added: “I didn’t start dealing with my abuse until I was in my 20s. I mean that’s what trauma does to you. In some ways you create, there’s spots that are a little sketchy, right, and you try to block it out and it was, it takes time. Some people never are able to process it. ” Laura Palumbo, a spokeswoman for the National Sexual Violence Resource Center, an independent organization partly funded by the federal Centers for Disease Control and Prevention, said research had found that one in four girls experienced sexual assault before age 18 over all, one in five women experience sexual assault at some point in their lifetime. Ms.   called on Mr. Trump’s supporters to repudiate him and said that by continuing to support him, “in essence you are condoning that type of behavior where you think it’s O. K. to violate a woman. ” At one point, a reporter for Telemundo, the Spanish language network, asked Ms.   who is Puerto Rican, to discuss her experience in Spanish. Appearing close to tears, she replied in Spanish, “I prefer not to. I’m a little emotional right now. ” She later gave a Spanish language interview following the news conference.'"}, "time": 1742564120.902716}