{"duration": 0.1352837085723877, "input_args": {"text": "'By Les Visible on October 27, 2016 Visible Origami — Oct 26, 2016 Dog Poet Transmitting……. I would like, within the limitations of my ability, to talk a little about Bhakti Yoga today; which for me is the only legitimate fast track to the divine that exists for the present and the least dangerous of all the options out there. My life keeps going by and I step in and out of it. These days I spend a great deal of my time in reflection, as well as preparation for my ongoing journey. It might be awhile yet and it may be right around the corner, either is fine with me. I have come to understand that loving the divine is so very, very much easier, once all the distractions that the greatest majority of us live with; are in pursuit of, or which predominates over all of the esoteric alternatives are… gone. Without my even being aware of it, at first, nearly all of the usual human attractions and compulsions just slipped out the door and haven’t returned. I find myself watching life behind some kind of glass. It’s a movie that is being screened in the mind but once the film in the projector has been changed, ordinary life becomes irrelevant and one can immerse themselves in more important considerations. One still goes to the supermarket. One still eats and excretes. One sleeps and awakens in the dream. One drives and walks and watches and listens to all of the sounds of the world around them but the effect of all of it has changed. Last night (as happens a couple of times a month) I laid in my bed and did not sleep most of the night. So I did as I usually do and repeated, “I love you.” over and over and over On this night there was an atmosphere of static and confusion and I could not seem to break through it. Images of the past spiraled through to haunt me over mistakes made and opportunities missed. The Voice entered and said, “Do not occupy your mind with thoughts of what is past. These have all been paid for through your suffering. They are not relevant anymore.” Try telling that to the monkey mind. However, the point is that regardless of the static and confusion and the seeming distance between myself and the divine, I did not allow any of these distractions to deter me from the continuous repetition of, “I love you.” I felt the obstacles that hung in the air. I felt all the barriers that occasionally come and go and are sometimes not there at all and I just kept at it. I studiously ignored whatever it was that was interfering with my efforts and I told myself that I would not allow anything to intrude, no matter how much it did intrude; no matter what the difficulty might be I would persevere and I did. I fell asleep at some point. I awoke this AM and said, “Good morning Lord.” It is another day and I do not want to forget that every day given to me is an opportunity to celebrate the almighty, no matter how far away the almighty might ‘seem’ to be and no matter how difficult the effort might become. The path of Love is not an easy cruise to some literal or metaphorical Caribbean island. Though we paint it as the only sure and certain route here, this does not mean it is also an easy route. There is bound to be opposition. In times of material darkness there are agents of that darkness who seek to hinder and hamper our efforts and often- these days- no real efforts are even made. The world seems to be swept away in a tidal waves of garbage and noxious dreams that spin themselves out of perverted daylight. Humanity is there to be found in the midst at all times but it takes a concerted determination to rise and greet it at every turn where it seeks to appear. To me, this is the real work… to move through the murk of this gray-scale existence and reach out to every hungry and troubled heart with some portion of the sunlight we are all given for the purpose of sharing. If we are cheap with our sunlight, the amount of sunlight given will decrease and further decrease until we find ourselves in darkness. I refer you to the parable from Jesus the Christ where he gave the example of the three men to whom a certain amount of talent were given . So it is when you are kept awake in the night and you strive and reach for unity with the ineffable and you get nowhere… you continue and continue as if, at any moment, you will achieve that unity and you will not cease until you do; even if it is a thousand times a thousand nights, even if you are in prison or confined in even greater distress in the houses of the rich. You do not deter. You do not immerse yourself in comforting distractions. One day the sun will rise in your heart and there will be no further static or confusions. The love of God is a consuming fire and fortunate is the one so consumed. It is important to understand that such a Love will demand everything of you and such a Love will try and test you to discover the level of your dedication and sincerity; “Many are called but few are chosen.” I am reminded of that short but powerful poem by Stephen Crane, “The Wayfarer . ” The reality of this great and singular quest is precisely as the poem describes and there have been many souls who have discovered the truth of it as they went surging forward in all their temporary and unchallenged zeal, right up until they saw that every blade of grass was not a blade of grass. Imagine in your own life and in your own mind, how often you forget about the ineffable and how often petty and incidental concerns arise in your thoughts to take you away. Later you can often not remember what these concerns were but you can certainly remember that they were of small importance, since you often cannot even remember what they were. When we look back on our lives we can’t recall how we got where we got at all. Life is filled with things of small importance. For me, it is critical to remember that there are forces that are actively engaged in steering us wrong and placing obstacles in our way and it is even more critical to recall certain clues such as this one from “The Lord’s Prayer.” “Lead us not into temptation.” Every agency that places obstacles and lures upon our path are not entities of the dark side. Lord Ganesha is portrayed with two items. One of them ensnares us and one of them frees us. Regardless of whatever religious schematic you may consider the nature and ruling power of the universe through, the similarities are glaring for the objectively minded. Unfortunately for many we live in a time of punishing subjectivity. It tends to influence the way we think and feel and behave. It takes a strong and inspired heart to break free and a steadfast intention to continue to that point. The rate and intensity of contention between and among us seems to increase by the day, according to the divide and conquer philosophy that guides the game plans of those who serve the Prince of Darkness. In this time of the harvesting of souls, it is of critical importance to both sides of the equation in this truly important time… in what direction we are swayed. I can truthfully say that recent years, until the beginning of this one, have been extremely difficult for me. Strangely enough, during some of the most difficult and inexplicable events, I just moved through it as if it were of no consequence at all, even though they were life and circumstance changing and might have caused me no end of grief …but it all seemed like a passing dream to me. I didn’t get angry. I was filled with wonder that it happened and uninformed as to the meaning of any of it. It passed and I moved on from one situation to another, to the one I find myself in and it’s all behind me there and of no present relevance. I could have gotten angry, or fearful, or despairing or depressed but none of this occurred and I do not chalk this up to any great strength or fortitude on my part. It is as if the ineffable has been slowly but surely slipping ever deeper into my life and every challenge and trauma was just one more act on the part of the ineffable to distract me from the reality of the almighty taking up residence in my life. I realize now that it is not what happens to you that is most meaningful but it is how you react to it. Once you have stilled the reactive mind you are closer to your real home than you might imagine. Loving God will draw the divine to you because the almighty is helpless before the sincere love of any soul. It has been said in many Eastern texts that the ineffable is the slave of Love. We must consider that this implies being a willing slave because the almighty is not subject to anything that the almighty does not choose to be subject to. Love the divine with all your heart and soul and mind and the Lord will return it in kind. This is what I believe and this is what I am inspired to speak of. Let this Love permeate your existence and see every event in your life as a blessing and it will surely prove to be so. Remember that every incident in your life, no matter how insignificant it may seem, is a particular dealing of the ineffable with your soul. End Transmission…….'"}, "time": 1742563220.3605504}