{"duration": 0.1381535530090332, "input_args": {"text": "'Email \\nHillary Clinton and her close cohorts are not the only ones whose corruption and lies have been revealed by the Podesta e-mails published by WikiLeaks. The e-mails also document that — his protestations to the contrary notwithstanding — President Obama lied to the American people when he claimed that he had been unaware of Hillary Clinton’s use of a private, unsecured e-mail server which she used to conduct official State business, including both sending and receiving classified information. \\nIn a pre-recorded interview aired on CBS on March 8, 2015, the president said he had learned of Clinton’s server “through news reports” and that he learned of it “the same time everybody else” did. Of course, that was not true, since he had exchanged e-mails with Clinton while she was secretary of state and the e-mail address would clearly have been her private address instead of the state.gov address she should have been using. \\nThe day after the interview aired on CBS, the White House tried to walk back the president’s remarks. White House Press Secretary Josh Earnest was asked in a press briefing , “We heard from the President in his interview with CBS about this and he said that he first became aware of it in the reports last week. So I’m wondering if, implicit in that, is that the President and Secretary Clinton never emailed one another when Secretary Clinton was serving at the State Department.” He answered by saying: That may be one conclusion to draw from the President’s remarks, but it would not be an accurate one. The President, as I think many people expected, did over the course of his first several years in office trade emails with his Secretary of State. I would not describe the number of emails as large, but they did have the occasion to email one another. And the point that the President was making is not that he didn’t know Secretary Clinton’s email address — he did — but he was not aware of the details of how that email address and that server had been set up or how Secretary Clinton and her team were planning to comply with the Federal Records Act. \\nEarnest was then asked a follow-up question about the specific e-mail address Clinton was using when she and the president exchanged messages. The question, as recorded in the transcript of that briefing, was, “Just to drill down on that a little bit, does that mean that he didn’t know that he was emailing whatever it was, like, This email address is being protected from spambots. You need JavaScript enabled to view it. , or that...” Earnest cut off the question to say: Well, again, I’m not going to get into a lot of detail here, but I’m not going to — the point is the President did email with Secretary Clinton. I assume that he recognized the email address that he was emailing back to. But, again, the question here is about compliance with the Federal Records Act. And understandably, the kinds of things that a President and his Secretary of State talk about are pretty weighty, national issues. I’m not sure that they drilled all the way down to the Federal Records Act. But what is clear is that, as the President said in his interview, the emails that he sends are properly maintained, consistent with the Presidential Records Act — and that, by the way, would be true of any emails that he received from his Secretary of State. And the reason I raise that is because Secretary Clinton’s team has pointed out, rightfully so, that a large number of the emails that they provided to the State Department in response to a request from her personal email system were already maintained on the State Department agency system. And the reason for that is she was emailing people with — State Department employees with state.gov email addresses, which meant that those email communications had been properly preserved and maintained. The last thing I’ll say about this is that what we know also is that the whole purpose of maintaining these records is to ensure that they can be properly used in responding to legitimate questions and inquiries from Congress and from the public. And I understand that hundreds of documents have already been provided to Congress consistent with their specific request out of these records. \\nIt’s interesting that within hours of the president’s remarks being broadcast, the White House was already prepared to spin what he had said and try to make it sound like he did not claim that he had first learned of Clinton’s use of a private e-mail server and account “the same time everybody else learned it, through news reports.” \\nRemember that the CBS interview was pre-recorded. What is now known — because of the Podesta e-mails published by WikiLeaks — is that in the day between that recording and the press briefing at the White House (even before the interview aired), Team Clinton was already working on how to “clean this up.” \\nAt 6:33 p.m. on March 7, the day before the CBS interview was seen by the American people, Josh Schwerin, a spokesperson for the Clinton campaign, sent an e-mail to Jennifer Palmieri, director of communications for the campaign, and Kristina Schake, deputy communications director for the campaign, and others. He drew Palmieri’s attention to the problem of the president’s remarks: *From:* Josh Schwerin < This email address is being protected from spambots. You need JavaScript enabled to view it. > *Date:* March 7, 2015 at 6:33:44 PM EST *To:* Jennifer Palmieri < This email address is being protected from spambots. You need JavaScript enabled to view it. >, Kristina Schake < This email address is being protected from spambots. You need JavaScript enabled to view it. >, Nick Merrill < This email address is being protected from spambots. You need JavaScript enabled to view it. >, Jesse Ferguson < This email address is being protected from spambots. You need JavaScript enabled to view it. > *Subject:* *POTUS on HRC emails* https://twitter.com/katherinemiller/status/574350749280432129/photo/1 Jen you probably have more on this but it looks like POTUS just said he found out HRC was using her personal email when he saw it in the news. -- Josh Schwerin \\nThe e-mail resulted in a reply from Cheryl Mills, who received a forward of the e-mail at 6:39 p.m. She replied at 9:41 p.m. in a forward to John Podesta: From: This email address is being protected from spambots. You need JavaScript enabled to view it. To: This email address is being protected from spambots. You need JavaScript enabled to view it. Date: 2015-03-07 21:41 Subject: Fwd: POTUS on HRC emails we need to clean this up — he has emails from her — they do not say state.gov \\nSo, in just over three hours, Team Clinton had verified that Hillary Clinton had e-mailed the president from her private, unsecured server and Cheryl Mills had set into motion an effort to “clean this up.” The interview aired the next day, and by the following day Josh Earnest held the press briefing in which he was already prepared to eat the president’s words and regurgitate something else. That is efficiency. \\nIf nothing else, the WikiLeaks disclosure of the Podesta e-mails is revealing the collusion and corruption that are part and parcel of the way things are done in Washington. The president attempted to distance himself from the Clinton e-mail scandal by telling the American people a lie. That lie was that he did not know about her private server before the media reported on it. Team Clinton went to work to “clean this up” and made a point of the fact that “he has e-mails from her” which “do not say state.gov” and the next thing you know, the White House is ready to admit that the president knew all along about the server, and — Gosh! We hope the president’s words weren’t taken the wrong way — all the president meant to say was that he is careful to obey the law where e-mail and record-keeping are concerned, and he assumed the same of Secretary Clinton. Photo: AP Images Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562746.0324502}