{"duration": 0.06346392631530762, "input_args": {"text": "'Return of Kings has a great variety of information about many subjects: improving your social life , health and fitness , tourism , among several others. Still, our political perspectives might be off-putting to some readers on the left. Although you could tune out whatever you don’t agree with. you might do well to take a closer look. Not all of us agree on everything, but we do have a rough consensus on some items.\\nOur views on the political establishment The left blames corporations while the right blames the government, when in reality the two interests work together to subvert the will of the people\\nIt’s pretty easy to see that this site has a mainly conservative perspective, especially on social matters. Not all of us started out that way. Many of us began our journey away from the political orthodoxy after realizing what a mess feminism has made of society. Others have been turned off by political correctness. Once upon a time, I used to be liberal, and I know I’m not the only one. Be that as it may, some of us are actually friendly to liberalism .\\nBy the way, we don’t give a free pass to the mainstream conservative establishment either. Unfortunately, the government in countless ways seeks to amass power for itself while producing fear and dependency in the populace. Really, it’s not a Democrat problem or Republican problem; they’re basically two sides of the same coin. Heads, they win; tails, you lose.\\nSurely you’re in favor of progress. One good question, though, is what exactly this constitutes . Also, who gets to define what is progress? All that might seem rhetorical, but these are important matters. Likely you see change as a good thing. But who’s setting the agenda, deciding which direction that change goes? Actually, we have answers for all that.\\nIn fact, we might have some more in common with you than you expect. Don’t care for agribusiness? Neither do we . Are you troubled by the influence of the ultra-wealthy in the political process? We are too . Do you suspect that the powerful have set up a system of managed democracy, where they’re pulling the purse strings of both the Republicans and the Democrats? (If you supported Bernie Sanders, you’ve probably figured that one out already!) We understand you.\\nToday’s political and social scene \\nYou might be disenchanted by some of the things going on with the Democratic Party today. Perhaps you’ve heard of their hypocrisy and contempt for the public . Are you troubled by some of the Clinton scandals, maybe even wondered if there was more to it than you expected ?\\nPerhaps your questioning goes deeper; you might wonder who hijacked liberalism . It once stood for helping the working man, but some time in the 1960s it turned into so much squabbling divisiveness. Actually, there’s a reason for that ; the culture war began long before the 1990s! That wasn’t about liberation, but rather a deliberate attempt to spread divisiveness and weaken the fabric of society.\\nAlso, taxpayers have spent untold money on social programs, but why don’t they solve problems? Instead, they create intergenerational poverty. You might be shocked to learn that encouraging dependency, along with taxing and spending to oblivion, was actually a stratagem meant to crash the system . That’s not about helping the disadvantaged; it’s about using them! Schemes like these—causing societal upheaval so a Socialist paradise will magically fall into place—are pretty reckless.\\nYou might shake your head in bewilderment at online mobs of misguided youths spewing bile about things that don’t really matter. Sure, you’re against police brutality (as am I), but deep down you also fear what will come of all this open contempt for the law and violence against police . The authorities take a pretty dim view of cop killers; kind of sounds like someone behind the scenes wants to start a lot of trouble, doesn’t it?\\nFinally, you might wonder if the people on top of the liberal establishment really give a damn about the common people. We think it’s rotten that they’re using so many well-meaning people for the cynical ends of amassing money and power.\\nLikely you have some nagging concerns about what’s going on in society today. Why are women both liberated and spoiled , and sometimes even hostile? Can’t the feminists see that things aren’t really so bad ? Sure, you’re all about tolerance and have lots of gay friends, but you privately wonder if there should be sensible limits . You might be uncomfortable with all the evangelizing of “alternative lifestyles”, especially if you have children in school.\\nYou consider the press to be the bedrock of a free society, but you have doubts about journalistic integrity . Hey, we understand. The propaganda is everywhere, even in shows for young children . The media has been feeding you bullshit all your life, and we think their lying is rotten. You deserve better than that.\\nStarting to reconsider? \\nA die-hard Social Justice Warrior will seethe with rage for me bringing up these uncomfortable facts. Even if you’re a moderate, you might be reluctant to consider any of this. We understand; rethinking deeply held beliefs is a painful process. For so many things, you’ll see that what you’ve been told is right is actually wrong, and what is “wrong” is really right.\\nMany on the left have been there before and found their way out. For me, someone explained that I’m not responsible for the world’s problems. “It’s not your fault.” The endless attempts in college to ram opinions down my throat hardened my resolve. Others who’ve made the journey have different stories. Some got religion. Others realized that their past fanaticism has hurt others . Some wondered why decades of costly social programs haven’t accomplished anything. Some came to see that preferential treatment in hiring decisions is anything but “fairness”.\\nIt’s in your best interests to purge the misconceptions and guilt trips from your mind. Still, you don’t have to abandon everything and embrace the polar opposite. Some have reached a synthesis position .\\nWelcome to the other side \\nIf you’ve read this far with an open mind—and checked out some of the referenced articles—then you might be confused. Perhaps you’re tempted to reject our message. On the other hand, you might be shocked and even angry about what’s been going on in politics and society.\\nWe understand; enlightenment is a painful process. We’re here for you. The truth hurts, but we’ll do the best we can to tell it like it is, which is much more than can be said for what you’ll see on television. I’ve merely scratched the surface here; stick with us and you’ll see how deep the rabbit hole goes.\\nRead More: The 12 Step Social Justice Warrior Recovery Program \\n'"}, "time": 1742628509.1249301}