{"duration": 0.05239081382751465, "input_args": {"text": "'Email Print A top member of Hillary Clinton’s presidential campaign told Clinton’s top supporters Thursday her defeat was “the most devastating loss in the history of American politics,” while campaign chairman John Podesta said the defeat was due to a pro-Donald Trump bias in the media. The remarks were made during a conference call between Clinton’s shell-shocked campaign team and several backers of Clinton’s campaign, such as donor J.B. Pritzker, Ready PAC co-founder Allida Black, and political strategist Maria Cardona. The contents of the private call were reported by The Hill , which spoke to one of the Clinton backers on the call. Clinton campaign spokesman Jennifer Palmieri didn’t mince words in describing how brutal Clinton’s upset defeat was, according to The Hill. “Thirty-six hours after the most devastating loss in the history of American politics, we’re looking at a white board right now with lots of ideas,” said Palmieri said. “We’re sort of figuring out what we need to do this week, and what we need Democrats to do in the next two months ahead of the inaugural.” Other aides, meanwhile, tried to shift blame for the shocking defeat away from the campaign and onto the media. “The media always covered her as the person who would be president and therefore tried to eviscerate her before the election, but covered Trump who was someone who was entertaining and sort of gave him a pass,” said Podesta. “We need to reflect and analyze that and put our voices forward.” Podesta also pointed a finger at FBI Director James Comey, who resurrected the matter of Clinton’s private email server in the final weekend. Podesta said the “dominance of the way [the media] covered the emails” caused them to drown out issues like Trump’s income taxes or his alleged links to Russia. The campaign’s explanations apparently didn’t do much to remedy the agony of defeat. Black began crying during the call, according to The Hill. \\nIf you haven’t checked out and liked our Facebook page, please go here and do so. Leave a comment... '"}, "time": 1742564270.40249}