{"duration": 0.2860426902770996, "input_args": {"text": "'Written by Philip Giraldi Tuesday November 8, 2016 The American people don’t know very much about war even if Washington has been fighting on multiple fronts since 9/11. The continental United States has not experienced the presence a hostile military force for more than 100 years and war for the current generation of Americans consists largely of the insights provided by video games and movies. The Pentagon’s invention of embedded journalists, which limits any independent media insight into what is going on overseas, has contributed to the rendering of war as some kind of abstraction. Gone forever is anything like the press coverage of Vietnam, with nightly news and other media presentations showing prisoners being executed and young girls screaming while racing down the street in flames. Given all of that, it is perhaps no surprise that both Hillary Clinton and Donald Trump, neither of whom has served in uniform, should regard violence inflicted on people overseas with a considerable level of detachment. Hillary is notorious for her assessment of the brutal killing of Libya’s Moammar Gaddafi, saying “We came, we saw, he died.” They both share to an extent the dominant New York-Washington policy consensus view that dealing with foreigners can sometimes get a bit bloody, but that is a price that someone in power has to be prepared to pay. One of Hillary’s top advisers, former Secretary of State Madeleine Albright, famously declared that the deaths of 500,000 Iraqi children due to US led sanctions were “worth it.” In the election campaign there has, in fact, been little discussion of the issue of war and peace or even of America’s place in the world, though Trump did at one point note correctly that implementation of Hillary’s suggested foreign policy could escalate into World War III. It has been my contention that the issue of war should be more front and center in the minds of Americans when they cast their ballots as the prospect of an armed conflict in which little is actually at stake escalating and going nuclear could conceivably end life on this planet as we know it. With that in mind, it is useful to consider what the two candidates have been promising. First, Hillary, who might reasonably be designated the Establishment’s war candidate though she carefully wraps it in humanitarian “liberal interventionism.” As Senator and Secretary of State, Hillary Clinton has always viewed a foreign crisis as an opportunity to use aggressive measures to seek a resolution. She can always be relied upon to “do something,” a reflection of the neocon driven Washington foreign policy consensus. Hillary Clinton and her advisors, who believe strongly in Washington’s leadership role globally and embrace their own definition of American exceptionalism, have been explicit in terms of what they would do to employ our military power. She would be an extremely proactive president in foreign policy, with a particular animus directed against Russia. And, unfortunately, there would be little or no pushback against the exercise of her admittedly poor instincts regarding what to do, as was demonstrated regarding Libya and also with Benghazi. She would find little opposition in Congress and the media for an extremely risky foreign policy, and would benefit from the Washington groupthink that prevails over the alleged threats emanating from Russia, Iran, and China. Hillary has received support from foreign policy hawks, including a large number of formerly Republican neocons, to include Robert Kagan, Michael Chertoff, Michael Hayden, Eliot Cohen and Eric Edelman. James Stavridis, a retired admiral who was once vetted by Clinton as a possible vice president, recently warned of “the need to use deadly force against the Iranians. I think it’s coming. It’s going to be maritime confrontation and if it doesn’t happen immediately, I’ll bet you a dollar it’s going to be happening after the presidential election, whoever is elected.” Hillary believes that Syria’s president Bashar al-Assad is the root cause of the turmoil in that country and must be removed as the first priority. It is a foolish policy as al-Assad in no way threatens the United States while his enemy ISIS does and regime change would create a power vacuum that will benefit the latter. She has also called for a no-fly zone in Syria to protect the local population as well as the insurgent groups that the US supports, some of which had been labeled as terrorists before they were renamed by current Secretary of State John Kerry. Such a zone would dramatically raise the prospect of armed conflict with Russia and it puts Washington in an odd position vis-à-vis what is occurring in Syria. The US is not at war with the Syrian government, which, like it or not, is under international law sovereign within its own recognized borders. Damascus has invited the Russians in to help against the rebels and objects to any other foreign presence on Syrian territory. In spite of all that, Washington is asserting some kind of authority to intervene and to confront the Russians as both a humanitarian mission and as an “inherent right of self-defense.” Hillary has not recommended doing anything about Saudi Arabia, Qatar and Turkey, all of which have at one time or another for various reasons supported ISIS, but she is clearly no friend of Iran, which has been fighting ISIS. As a Senator, she threatened to “totally obliterate” Iran but she has more recently reluctantly supported the recent nuclear agreement with that country negotiated by President Barack Obama. But she has nevertheless warned that she will monitor the situation closely for possible violations and will otherwise pushback against activity by the Islamic Republic. As one of her key financial supporters is Israeli Haim Saban, who has said he is a one issue guy and that issue is Israel, she is likely to pursue aggressive policies in the Persian Gulf. She has also promised to move America’s relationship with Prime Minister Benjamin Netanyahu to a “new level” and has repeatedly declared that her support for Israel is unconditional. One of Hillary’s advisors, former CIA acting Director Michael Morell, has called for new sanctions on Tehran and has also recently recommended that the US begin intercepting Iranian ships presumed to be carrying arms to the Houthis in Yemen. Washington is not at war with either Iran or Yemen and the Houthis are not on the State Department terrorist list but our good friends the Saudis have been assiduously bombing them for reasons that seem obscure. Stopping ships in international waters without any legal pretext would be considered by many an act of piracy. Morell has also called for covertly assassinating Iranians and Russians to express our displeasure with the foreign policies of their respective governments. Hillary’s dislike for Russia’s Vladimir Putin is notorious. Syria aside, she has advocated arming Ukraine with game changing offensive weapons and also bringing Ukraine and Georgia into NATO, which would force a sharp Russian reaction. One suspects that she might be sympathetic to the views expressed recently by Carl Gershman in a Washington Post op-ed that received curiously little additional coverage in the media. Gershman is the head of the taxpayer funded National Endowment for Democracy (NED), which means that he is a powerful figure in Washington’s foreign-policy establishment. NED has plausibly been described as doing the sorts of things that the CIA used to do. After making a number of bumper-sticker claims about Russia and Putin that are either partially true, unproven or even ridiculous, Gershman concluded that “the United States has the power to contain and defeat this danger. The issue is whether we can summon the will to do so.” It is basically a call for the next administration to remove Putin from power—as foolish a suggestion as has ever been seen in a leading newspaper, as it implies that the risk of nuclear war is completely acceptable to bring about regime change in a country whose very popular, democratically elected leadership we disapprove of. But it is nevertheless symptomatic of the kind of thinking that goes on inside the beltway and is quite possibly a position that Hillary Clinton will embrace. She also benefits from having the perfect implementer of such a policy in Robert Kagan’s wife Victoria Nuland, her extremely dangerous protégé who is currently Assistant Secretary of State for European and Eurasian Affairs and who might wind up as Secretary of State in a Clinton Administration. Shifting to East Asia, Hillary sees the admittedly genuine threat from North Korea but her response is focused more on China. She would increase US military presence in the South China Sea to deter any further attempts by Beijing to develop disputed islands and would also “ring China with defensive missiles,” ostensibly as “protection” against Pyongyang but also to convince China to pressure North Korea over its nuclear and ballistic missile programs. One wonders what Beijing might think about being surrounded by made-in-America missiles. Trump’s foreign policy is admittedly quite sketchy and he has not always been consistent. He has been appropriately enough slammed for being simple minded in saying that he would “bomb the crap out of ISIS,” but he has also taken on the Republican establishment by specifically condemning the George W. Bush invasion of Iraq and has more than once indicated that he is not interested in either being the world’s policeman or in new wars in the Middle East. He has repeatedly stated that he supports NATO but it should not be construed as hostile to Russia. He would work with Putin to address concerns over Syria and Eastern Europe. He would demand that NATO countries spend more for their own defense and also help pay for the maintenance of US bases. Trump’s controversial call to stop all Muslim immigration has been rightly condemned but it contains a kernel of truth in that the current process for vetting new arrivals in this country is far from transparent and apparently not very effective. The Obama Administration has not been very forthcoming on what might be done to fix the entire immigration process but Trump is promising to shake things up, which is overdue, though what exactly a Trump Administration would try to accomplish is far from clear. Continuing on the negative side, Trump, who is largely ignorant of the world and its leaders, has relied on a mixed bag of advisors. Former head of the Defense Intelligence Agency General Michael Flynn appears to be the most prominent. Flynn is associated with arch neocon Michael Ledeen and both are rabid about Iran, with Flynn suggesting that nearly all the unrest in the Middle East should be laid at Tehran’s door. Ledeen is, of course, a prominent Israel-firster who has long had Iran in his sights. The advice of Ledeen and Flynn may have been instrumental in Trump’s vehement denunciation of the Iran nuclear agreement, which he has called a “disgrace,” which he has said he would “tear up.” It is vintage dumb-think. The agreement cannot be canceled because there are five other signatories to it and the denial of a nuclear weapons program to Tehran benefits everyone in the region, including Israel. It is far better to have the agreement than to scrap it, if that were even possible. Trump has said that he would be an even-handed negotiator between Israel and the Palestinians but he has also declared that he is strongly pro-Israel and would move the US Embassy to Jerusalem, which is a bad idea, not in America’s interest, even if Netanyahu would like it. It would produce serious blowback from the Arab world and would inspire a new wave of terrorism directed against the US Regarding the rest of the Middle East, Trump would prefer strong leaders, i.e. autocrats, who are friendly rather than chaotic reformers. He rejects arming rebels as in Syria because we know little about whom we are dealing with and find that we cannot control what develops. He is against foreign aid in principle, particularly to countries like Pakistan where the US is strongly disliked. In East Asia, Trump would encourage Japan and South Korea to develop their own nuclear arsenals to deter North Korea. It is a very bad idea, a proliferation nightmare. Like Hillary, he would prefer that China intervene in North Korea and make Kim Jong Un “step down.” He would put pressure on China to devalue its currency because it is “bilking us of billions of dollars” and would also increase US military presence in the region to limit Beijing’s expansion in the South China Sea. So there you have it as you enter the voting booth. President Obama is going around warning that “the fate of the world is teetering” over the electoral verdict, which he intends to be a ringing endorsement of Hillary even though the choice is not nearly that clear cut. Part of the problem with Trump is that he has some very bad ideas mixed in with a few good ones and no one knows what he would actually do if he were president. Unfortunately, it is all too clear what Hillary would do. Reprinted with permission from the Unz Review . Related'"}, "time": 1742563172.26921}