{"duration": 0.7257378101348877, "input_args": {"text": "'Prescription Painkiller Crisis: Why Do Americans Consume 80 Percent Of All Prescription Painkillers?   March 14th, 2016 \\nIf Americans are so happy, then why do we consume 80 percent of the entire global supply of prescription painkillers? Less than 5 percent of the world’s population lives in this country, and yet we buy four-fifths of these highly addictive drugs. In the United States today, approximately 4.7 million Americans are addicted to prescription pain relievers, and that represents about a 300 percent increase since 1999. If you personally know someone that is suffering from this addiction, then you probably already know how immensely destructive these drugs can be. Someone that was formally living a very healthy and normal life can be reduced to a total basket case within a matter of weeks. \\nAnd of course many don’t make it back at all. According to the CDC, more than 28,000 Americans died from opioid overdoses in 2014. Incredibly, those deaths represented 60 percent of all drug overdose deaths in the United States for that year … \\nA report released by the US Centers for Disesase Control and Prevention (CDC) in January revealed that drug-overdose deaths reached a new high in 2014, totaling 47,055 people. Opioids, a type of powerful painkiller that requires a prescription, were involved in 60% of those deaths . \\nMany Americans that start out on legal opioids quickly find themselves moving over to heroin because it is often cheaper and easier to obtain, and the U.S. is now facing a tremendous epidemic of heroin abuse as well. In fact, the number of Americans that die of a heroin overdose nearly quadrupled between 2000 to 2013. \\nFinally, the federal government has started to take notice of this crisis. A bill was recently passed to spend more than a billion dollars over the next two year fighting this problem. \\nBut as long as doctors are writing thousands upon thousands of new prescriptions for these painkillers each year, this crisis is not going to go away any time soon. \\nIn the Appalachians, these prescription painkillers are commonly known as “ hillbilly heroin “, and all of the attention that the New Hampshire primaries received focused a lot of attention on how this crisis is destroying countless numbers of lives up in the Northeast. But one survey found that the states with the biggest problems with painkiller addiction are actually in the West … \\nThe National Survey on Drug Use and Health, a survey of approximately 67,500 people across the United States, found that the states with the highest rates of narcotic painkiller abuse were in the West – Arizona, Colorado, Idaho, Nevada, New Mexico, Oregon and Washington. \\nUnless you are about to die, I would very strongly recommend that you resist any attempt by your doctor to put you on these “medications”. Just consider what happened to one stay-at-home mother named Norah Mangan … \\nI am an educated, suburban wife and stay-at-home mother of four. Life had been good to me until a fateful visit with an orthopedic physician, my chief complaint being mild arthritic pain in my toes. My physician handed me the first of many monthly prescriptions for Oxycodone and what followed that appointment was a rapid descent into hell. Within six months, I had become a raving drug addict . \\nBefore too long, Norah had to turn to means that were less than legal in order to keep fueling her addiction. Her life was turned into a complete and utter disaster by drugs that were legally prescribed to her… \\nIt wasn’t long before my legal monthly prescription fell woefully short in terms of keeping my life altering pain at bay. In the interest of not incriminating myself, I’ll simply share that when procured through other means, Oxycodone generally sells for one dollar per milligram. I was draining our savings and was out of my mind. I was so tortured that I didn’t care about the deterioration of my moral values, in fact, I didn’t even notice. It’s hard to imagine that in such a short period of time I had morphed from a Mrs. Cleaver, baking hot cinnamon buns in anticipation of my children’s arrival home from school, to Scarface crushing pills on the glass top of the executive desk in our home office while thinking to myself as I heard them arrive from school…why oh why are they home already? \\nYou can read the rest of her amazing story right here … \\nThe truth is that we are the most drugged people on the face of the planet. It has been estimated that 52 million Americans over the age of 12 have used prescription drugs in non-medical ways, and this problem gets worse with each passing year. \\nAccording to research that was published in the Journal of the American Medical Association, 59 percent of all U.S. adults are currently on at least one prescription drug , and 15 percent of all U.S. adults are on at least five prescription drugs . And the numbers are far worse for older Americans. The following statistics come from one of my previous articles … \\n– According to the CDC, approximately 9 out of every 10 Americans that are at least 60 years old say that they have taken at least one prescription drug within the last month. \\n– There is an unintentional drug overdose death in the United States every 19 minutes . \\n– In the United States today, prescription painkillers kill more Americans than heroin and cocaine combined . \\n– According to the CDC, approximately three quarters of a million people a year are rushed to emergency rooms in the United States because of adverse reactions to pharmaceutical drugs. \\n– The percentage of women taking antidepressants in America is higher than in any other country in the world. \\n– Children in the United States are three times more likely to be prescribed antidepressants as children in Europe are. \\n– A shocking Government Accountability Office report discovered that approximately one-third of all foster children in the United States are on at least one psychiatric drug. \\n– A survey conducted for the National Institute on Drug Abuse found that more than 15 percent of all U.S. high school seniors abuse prescription drugs. \\nWe are a deeply unhappy nation that has been trained to turn to pills as a “quick fix” for our hurt and our pain. \\nYes, there are medical situations that call for prescription pain relievers. But what we are seeing in America today goes far, far beyond that. We are a nation of addicts that is always in search of a way to fill the gaping holes that we feel deep in our hearts. This prescription pain killer crisis is just another symptom of a much deeper problem. \\nSo what is the solution? \\nPlease feel free to tell us what you think by posting a comment below… HeyAHuman \\nIt’s a combination of insane profits, population control, and keeping people zombified and distracted by addiction. SunnyFlaSnotress \\nI admit that I don’t understand the reasoning of painkiller addiction well, but I will guess that the pills provide some elation other than just pain killing. That sense of elation, coupled w/a local drug culture, likely creates community, albeit a pathetic one, and excuses not to participate in the real world. Of course there are also likely those who would rather be doped rather than to endure minor forms of pain. sistersoldier \\nIt is extremely and immensely profitable for the drug companies. There will forever be more money in the treatment than in the cure. Holistic medicine is shunned by those who prefer to poison us with chemicals and some of the leading doctors in this field just keep coming up DEAD. \\nThough some are for relief of major illnesses or surgeries its the abuse factor that is being discussed here. Drugs are great for two tings, altering reality and creating a temporary sense of euphoria. A population is much easier to control when they have nearly all of the population under control with controlled meds. Michael stated that 80% of all prescription medication is consumed by Americans. Pharmaceutical companies are also one of – if not the biggest lobbyists on the Hill. \\nImagine what would happen if they pulled the plug? Make no mistake about it – drug use increase is no accident nor warp in a lost generation. It is a dark habit with deadly consequences and many have danced to its “thorn bird” song. \\nThe dealers have their orders and they know exactly when to stop the supply. MK Ultra on steroids for an entire nation. \\nCare for a little civil unrest anyone? Rick \\nThere are many more people around the world who are being softly killed by governments, or the elite eugenicists such as Bill Gates and George Soros who control and manipulate governments. Check out GMO foods, flouride and poison additives in water, heavy metal jet emissions (chem trails) in our air, virus laden vaccines, electronic toxic radiation ( even from the iPad I’m using to write this). The list goes on and on, and our cancer and chronic illness rates go up and up, regardless of what the PhRMA companies throw at us. I do agree with you, naturopathic medicine, proper nutrition, and other preventative measures are clinically significantly greater than the conventional money draining ways we’ve been educated on. Thanks for your post. sistersoldier \\nThank you and I agree with you. May the Lord use you to open even more eyes. God bless. Rick \\nSunny, that’s right on. We are all different, regardless of how the socialists, communists and depraved creepo politicians tell us we are the same. Not that I’m a tough guy, but I recently had 2 wisdom teeth pulled, had Novocain and a few doses of ibuprofen, and was given a prescription for hydrocodone as well, but never needed it. It didn’t pain me much to go thru this whole process. However, there are many others who have a very low pain threshold, and who do need and take the stronger drugs for the same procedure. There’s nothing wrong with that, it’s just life’s differences, and I actually appreciate them. James \\nFYI: Novocain is not a painkiller, it is a regional anthestic. Just look at it’s generic name (Procaine). \\nIt ends in caine Rick \\nDr. James, I appreciate the commentary. You seem to be inferring that I listed it as a pain reliever? Don’t think I did, but again, for readers who might have taken it that way, thanks for the input. Think First \\nBecause we’re much easier to control when we’re fat, sick, addicted, drug addled and complacent. Kent Harris \\nYou know what would seriously put a huge dent in the amount of pill popping would be to attend church regularly. Unlike going to a bar or some other watering hole there is something about being around fellow believers that gives joy to the heart. To be in the presence of Almighty God along with your brothers and sister is truly a work of the Holy Spirit. \\nTherefore if there is any consolation in Christ, if any comfort of love, if any fellowship of the Spirit, if any affection and mercy, fulfill my joy by being like-minded, having the same love, being of one accord, of one mind. Let nothing be done through selfish ambition or conceit, but in lowliness of mind let each esteem others better than himself. Let each of you look out not only for his own interests, but also for the interests of others. Philippians 2:1-4 \\nlol.. it was very long ago, but i still remember the pain of the boredom On a scale of 1-10, the chances of your idea catching on is -1 ALWAYSTOMORROW \\nI too have bad memories from long ago of the boredom. sistersoldier \\nFor any endeavor that we pursue it requires a call to maturity. I am not saying that you are not mature in life but rather it requires maturity in God to accept His beauty as he is all together lovely for those who seek His love. Everybody needs love I don’t care who you are. But no one can come to Jesus unless the Father which is in heaven draws them. This is where you will either soften your heart or you will harden it for the day of judgement. \\n“For in the case of those who have once been enlightened and have tasted of the heavenly gift and have been made partakers of the Holy Spirit, and have tasted the good word of God and the powers of the age to come, and then have fallen away, it is impossible to renew them again to repentance, since they again crucify to themselves the Son of God and put Him to open shame.…” This is for those who accepted Christ but then went backwards again to be partakers of worldly desires. \\nI won’t to live forever Sunny, don’t you? By that I mean I want to discover new worlds that I never knew. When God spoke the universe into existence it is still expanding today. I highly doubt that he would waste that much space. Age old mysteries that are locked because humanity cannot appreciate their intrinsic and holy value. I want to know the life I could of had if I had asked God for all the blessings I forfeited because of my disobedience. Blessings in the store room of heaven with my name on them. God is still good even if He does not do another thing for me. \\nI want to live forever with God and the family of God. I want to see the angels that covered me while on earth and meet Michael the Arch Angel, the warrior of the saints and the Most High God. I just cannot understand how someone would pass that up because of arrogance or unbelief. If you don’t stand for something (Godly) you will fall for anything. \\nI want to spend eternity with those that I loved and they died in the Lord because even if you lose someone to hell you will not meet them there. It is an eternally dark place, because God is light. It is filled with pain of unimaginable proportions. I doubt that you will want to carry on a conversation. Even if it were possible for you to find them you will only know them by their suffering in the flames. \\nI am praying for you everyday. SunnyFlaSnotress \\nyou don’t really think i read your stuff do u? sistersoldier \\nYes, and even if you didn’t God has a way of still holding you accountable as this is one of those moments where you used the free will He gave you to reject once again the gospel of His love. GSOB \\n“We have the freedom to believe, but not the ability.” SunnyFlaSnotress \\nGod won’t hold me responsible to read your windy unappreciated spiels. sistersoldier \\nthat’s your egotism talking sistersoldier \\nBecause you don’t believe God speaks? Or because of my confidence and boldness in His words? I just want what is best for you and that is for the angels in heaven to sign your name in the Lamb’s book of life. I just don’t want to see anyone throw away such a precious gift because it was paid for in blood. Who better to die for or die to than the One who has already died for you? Not only you but for the sins of the whole world. There is no greater love. nevergiveup \\nI love how you continue to speak the truth in love. It is a less intense version of David Wilkerson sharing love and faith with Nicky Cruz. Keep up the good work Sister. sistersoldier \\nHello Nevergiveup: Thank you and God bless you. My soul rejoices in knowing that you are well and still striving in the eternal knowledge of God. lincolnlincolnlincoln \\nit sinks in, ever so slowly Jodie Lynn Gaeta \\nI felt that way too, when I was a kid. But now that I am an adult who chooses to go to a house of worship to pray with others, I find that it is a source of strength and inner peace. Malcolm Reynolds \\nI’m sure sure the board members here will appreciate your pious clap-trap. Said the buffoon that’s here to spread her pious claptrap about the boredom of socialism. sistersoldier \\nI believe she said the boredom of church. Malcolm Reynolds \\nYes, she said that about what you said. I’m talking about her. She’s a Hillary sycophant. sistersoldier \\nYeah…….ok, well I don’t have a dog in this fight. Carry on. Malcolm Reynolds \\nYea, she isn’t what you could describe as self aware. sistersoldier \\nI respectfully recuse myself from your conversation such as in like manner a challenge (a judge, prosecutor, or juror) as unqualified to perform judgmental duties because of a possible conflict of interest or lack of impartiality. My job is to disseminate the gospel to a dying world not assess one’s political correctness. SunnyFlaSnotress \\nMalcolm you search for crumbs to pick on like a maggot. Malcolm Reynolds \\n“I’m sure sure the board members here will appreciate your pious clap-trap.” \\nwhat do you call this? \\n“you don’t really think i read your stuff do u?” \\nAnd this? \\nSo then crumbs. You are indeed blissfully ignorant of yourself. Preacher62 \\nI spent many years staring out the window and writhing in the boredom as well. Then one day God showed me that my life was not about me but about him. I find now that I am never bored because boredom can only come from an inward focus. For those who focus outwardly there is little time for boredom. SunnyFlaSnotress \\nI just finally accepted the fact that there ain’t no ruling guy sitting in the sky sistersoldier \\nYes there is if He wasn’t there then you would not be here SunnyFlaSnotress \\nNo, no.. there isn’t sistersoldier \\nYou sound like you are convincing yourself? Having a little trouble with the God seed I planted? I plant, then one will come after me who waters and then God gives the increase! So even if you tune me out the seed is already there. SunnyFlaSnotress \\ncause you’re here and keep communicating sistersoldier \\nSo you do or you don’t want me to communicate with you? You do realize that this is a Christian based blog don’t you? I’m confused as to why you are here unless it is to look for answers. Please enlighten me. SunnyFlaSnotress \\nI don’t want you to communicate with me.. I don’t hate you, but your words are unwelcome and the attention is gnat-like. This blog is under the category of an economic blog. Anything else is an unwritten supposition. sistersoldier \\nYou cannot separate God from this blog. The author(s) are Christians. They even have a Christian Youtube Channel. Michael’s assessment of the economy comes from his relationship with God. There are plenty of blogs that are not Christian based. But maybe God had you and those who agree with you to stop by here for a reason so you will be without excuse. \\nAtheism is a lie. It is one of those lies where if we tell it often enough it becomes the truth to the non-believer. I am the voice of one crying in the wilderness calling, “Clear the way for the LORD in the wilderness; Make smooth in the desert a highway for our God” dadelaw \\nDon’t even begin to try to reason with these people. They’re all crazy. I just come to the blog to rip off information, that’s all. The rest is just loony-toons… Preacher62 \\nHe created everything that is, including you and I. To deny him would be to deny our own existence. sistersoldier \\nThat makes perfect sense! flautistmaniac \\nMaybe there isn’t an imaginary ruler sitting over the sky. If there is a God in control of nature, it certainly isn’t me. Would that I could tell a tree to move for me or my house to clean itself. I could will it all day and get no response. Nature follows it’s own laws and if we have little control over those laws, then whose laws do they follow? sistersoldier \\nI really appreciate you! Your reflections of who God is and what He means to you is pure poetry of the soul. May God bless you richly and even more so than He has blessed me. Simply humble and wonderful are your thoughts toward God. Preacher62 \\nMy blessings are far beyond my ability to count. However you are one of them. sistersoldier \\nand we love to pray for your salvation. thanks for the opportunity antonio \\nThank you. Must read this often. sistersoldier \\nYou have written the prescription to life though many refuse to receive it. Kent you are correct that worshiping God would circumvent allowing ourselves to be enticed by the wicked trappings of this present world. Yes, to be in the presence of God is all one needs to be whole. \\nThe performer/actor behind drugs is Satan. Drug use opens you up to spiritual attacks because it is a stronghold and a vice. There are specific demonic spirits associated with drugs and alcohol abuse which leave you wide open for demonic possession and why it is so hard to “kick the habit”. \\nDrug abuse was foretold to increase as another sign that we are approaching the end of days. In order to be used by God we must be sober minded and avoid intoxicating substances. But the deception is growing that drugs can make us feel better when in fact they are numbing a generation to the will of God. \\nNo man can serve to masters for either he will hate the one and love the other or he will hold to the one and despise the other. The laws that apply to human nature subjugate and necessitate that our supreme and our utmost affections can only be fixed to one object. It is the way we are wired which is why I seek first the kingdom of God and His righteousness and I allow Him to fill me with His Holy Spirit and whatever the Holy Spirit accepts I accept and whatever He rejects I reject. \\nJesus is the Great Physician because He is the Son of the Great I AM. El Shaddai – The God that is more than enough! Rick \\nJehovah-Rapha. Amen! sistersoldier \\nKeep calling on His name and may He manifest Himself in your life as Your Healer. Preacher62 \\nTruth for life right there. Rdawg \\nNonsense. Europeans are far more secular than Americans and do not have the same magnitude of problems with addiction. You will find that the religious are every bit as likely to become ensnared in drug addiction as non-religious persons. The problem is that Americans have become used to a culture of quick-fixes for everything; nobody wants to deal with their problems head-on. lincolnlincolnlincoln \\nEuro’s will be doing more drugs soon enough when they face their countries destroyed by the muslim hordes ProclaimingGodsTruth \\nLet’s make sure that the church you reference is a Bible-believing, Bible-teaching, Christ following church. Not all churches are true Acts 2 churches today. GSOB \\nSome say I am of the faith, therefore I am of the elect. Others say I am of the elect, therefore I have faith. \\nWhich came first, election or faith? ProclaimingGodsTruth \\nOh I get it …“riddle-time”? sistersoldier \\nIt is not a trap question just a soul searching question. ProclaimingGodsTruth \\nOK, see my reply then. sistersoldier \\nI have read and it appears that you agree that election comes first. As faith comes by hearing so then by hearing the word of God. We would of necessity need to exist to hear the word of God. By selection we were chosen as those who would have hearts to receive the word of God by faith. All be it that everyone is given a measure of faith but not all will exercise the gift for good. \\nNow this is holy a conversation! ProclaimingGodsTruth \\nOne stark reminder is what Jesus said in Matt 22:14 –“Many are called but few are chosen.” These are tremendously stunning words that should awaken all Christians everywhere. Shalom sistersoldier \\nYes, but too many are distracted with the “elections” of politicians to care what God thinks. ProclaimingGodsTruth \\nVery correct!!! They are distracting Americans away from the real issues..the Lord’s return and the signs leading up to it. There is also a super abundance of deception in the rhetoric spewed from the lips of these candidates. \\nJust a verse on the candidates, the election and America – Hos 8:4 sistersoldier \\nYes Lord! That scripture is so good and so right it is of necessity that those who do not open the Bible read it and may they understand it for their own deliverance! Praise God indeed. May you keep proclaiming God’s truth. \\n“They have set up kings, but not by Me; They have appointed princes, but I did not know it. With their silver and gold they have made idols for themselves, That they might be cut off.” Mary Janis \\nfaith sistersoldier \\nElection came first as it is His spiritual blessing towards those who would inherit salvation. “Blessed be the God and Father of our Lord Jesus Christ, who has blessed us with every spiritual blessing in the heavenly places in Christ, just as He chose us in Him before the foundation of the world, that we would be holy and blameless before Him. In love He predestined us to adoption as sons through Jesus Christ to Himself, according to the kind intention of His will,…” God bless. ProclaimingGodsTruth \\nFirst of all what is this “faith” in that you ask here? Christ or …? If Christ, let’s use Heb 12:1-2 as the source text for our discussion. \\nBut to clarify, are you talking The Elect? Or just the elect? \\nSince the elect denotes one that has been chosen, our faith in Christ results in one being in the fellowship of the elect, meaning all those called and chosen and faithful. Matt 22:14; Rev 17:14 \\nOk, what say you? You after a predestination type discussion? Maybe… \\n*** Remember now that Christ was with the Father from the beginning. Rick \\nKent, totally agree with your opinion here, in fact I was going to post something similar. Being a pharmacy doctor, I see it all too often, people suffering, and in pain. However, my wife and I recently joined the Catholic Church, and follow our theology, and teachings, and vows we took to join. We are regular weekly attenders at mass, and are deeply in love with Jesus Christ, yet I could easily be included in the group of 60 million abusers of alcohol that Michael talks about. So while I know I sin against God, and I know what I do is wrong, I still do it. And I struggle against it, I will never give up the battle as long as I am afflicted with this thorn in my side. We each have our “thorn”. I think the larger problem may be that many people are just waking up to the culture of death we live in, right here in the USA, and they don’t want to face it. They do give up the struggle against sin. We kill over 3000 babies a day in this country, and yet we want Hillary Clinton as our next president?? The Queen of the Culture of Death?? And the very same people who will vote for her are the ones on the anti-psych, anti-depressants, and pain killers. They can’t cope with what they are doing, how they are living day to day. They no longer have the ability, or desire to connect the dots, yet deep down they know it’s wrong, and there will be that day! That day will be the moment they accept the door of Mercy, and totally confess and repent, and convert, or that day will be the day of judgement. I need not describe what that will be like. In my estimation there is no “program”, no education, no amount of dollars, gold or silver, no smart talk from slick politicians that can save us now, it will only be by the great mercy of God. flautistmaniac \\nI think the key we are missing is to acknowledge our fallibility. We want to believe we are good, yet we would crucify Jesus for one pill or one drink. Until we accept our evil and love ourselves anyways, there is no way out. Of course, once you do this, you can no longer hate any sinner, knowing that you are just as fallible. Rick \\nI believe you are right. We fail to acknowledge our fallibility, our humanness. We’ve lost our sense of humility, of reverence toward God. We live in an era of entitlement think instead of greatfulness think. We buy into the programing of the media that it’s all about us, someone owes us something. Government becomes god, and is the king of the culture of death. Liberty First \\nGreat post, thank you Kent. MichaelfromTheEconomicCollapse \\nAfter a tremendous amount of work, my wife and I have finally completed the first episode of our new television program. It will be airing on Christian television, but you can also watch it on YouTube for free. If you would like to check it out, you can find the first episode right here… \\nMichael, smile a little please. SunnyFlaSnotress \\nHe looks a lil like Father Sarducci w/o the garb. sistersoldier \\nAwesome! Thank you and God bless. Illegal \\nFfThe richest country in the world has a population that won’t educate itself about living a healthy life. Peopl antonio \\nNicely put. SunnyFlaSnotress \\nSome may also be using the pills to fight boredom, depression, etc and the answer may be reverse.. to give the addict new challenges and means of achieving. goldminer \\nSo what is the solution? Beer. Hops are a natural pain reliever. Works for me. Haven’t seen a pill pusher for many many years. Don’t need no bible thumpin either. Ricardo \\nthat wine was grapejuice. The English for wine doesn’t make any difference between fermented and unfermented but the original language tells you what was unfermented and what was fermented. Jesus turned water into unfermented wine. GSOB \\nI will venture to guess that alcohol addiction far outstrips pain killer addiction. GSOB \\n“Our bodies have been redeemed from deserved condemnation and hopeless slavery by the atoning sacrifice of Christ. We are to be clean, as vessels fitted for our Master’s use. Being united to Christ as one spirit, and bought with a price of unspeakable value, the believer should consider himself as wholly the Lord’s, by the strongest ties. May we make it our business, to the latest day and hour of our lives, to glorify God with our bodies, and with our spirits which are his.”– Romans 15:13 Priszilla \\nGuns are good painkillers. No more pain after you shoot yourself. Chicken? How about suicide by cop? But not recommended. Buy a gun yourself. And have lots of training at the shooting range. The profit doesn’t only come from gun sales but also ammo. billtheguy \\nWhen people go to the doctor or the emergency room, the question is asked of them: “On a scale 1-10 how much pain do you have?” This is where it hypothetically starts. Doctors use visuals too, but I believe people can endure some pain. Doctors only have one or two ways to deal with pain, and drugs are one. Do doctors get kickbacks from drug companies? Steeve Girard \\nA lot of pains are dietary of origin. Like lactose intolerance, 1,3,7 methyl-xanthine intolerance, allergic reactions etc… Rather than telling the truth and put us on a path to modify our diet to fit the intolerances, they give you a prescription for pills to neutralize the problem. And they are rarely non-permanent, you are most likely to use them for the rest of your life. . Modifying a diet is not hard… you just have to accept sacrifices. I used to like milky cheese, yogurt, ice cream, dark chocolate, quik mix, chocolate syrup, etc… and now those products are either drastically reduced to my tolerance levels, substitued with a similar product without the intolerant substance or radically eliminated. sistersoldier \\nYes, drug reps (representatives) visit doctor’s offices regularly. I worked for a medical facility many years ago as an account representative. Every Wednesday and Friday we could expect very expensive “free” lunches. The drug companies would spare no costs and would make sure everyone who worked in the office received a meal on the days they would visit the good doctors. They also provided plenty of free samples. This is where you get your samples when offered by your doctor. They come from the drug companies delivered by the reps to promote their product. Not because the doctor found them to be good but because the pharmaceutical company has been good to them. \\nAnd yes again as the human body can tolerate pain and for good reason. Pain is nature’s indicator to send signals to the area of the body that needs healing. This is why after major surgeries your doctor should advise you to get up and walk, almost immediately for some, so that you will kick start your own healing process. James \\nPain is nature’s indicator to send signals to the area of the body that needs healing \\nNo it’s not. Pain is an indication that you should stop whatever you are doing that is causing the pain. Ex, stop putting your hand in a boiling pot of water. sistersoldier \\nPain starts at the source of an injury or inflammation, whether it’s your toe or your lower back. When you injure yourself, the body’s automatic response is to stimulate pain receptors, which in turn release chemicals, says Dr. Tongprasert. Sanjaykumar Jobalia \\nI just went through the comments appearing before I sat down to write my own. Some of them are with a tinge of humour, sarcasm or comment on the current American way of living. \\nThe solution lies in the biggest and most dreaded mafia of all times. “the pharma companies” . They will put ISIS to shame. I used to say such things about INDIA which is my origin. But I think applies to whole world. 1) Big Companies including Pharma 2) Politicians 3) Senior Government Officers 4) Print & Electronic Media & lastly 5) Top Judiciary . There is nexus of these 5 almost anywhere in the world & the nexus is simply invincible. Unless we make a move in a direction to break this nexus, things are not going to change. \\nAs far as drugs go, this nexus simply manages to suppress ill effects of such drugs, cheaper & far better alternate forms to cure available to mankind. \\nIT IS ALL COMMERCE SunnyFlaSnotress \\nI think that’s ridiculous. I think it’s all about addicts and addict culture. When my boyfriend had legitimate need for pain pills, he has always been given a very difficult time. antonio \\nGood post. Steeve Girard \\nThe main reason why the pill commerce exist, is the requirement of performance that exists today. Even when you are old and retired, you will be needed to be in shape to deal with the BS the system throws at them. And one way to do so, is by taking pills to numb pain, pills to boost metabolism, pills to control aging. Pills for this, pill for that. . People starting with the Baby Boomer generation have been indoctrinated in a mentality of the “forever young”. They want to be Superman forever (without falling from their horse and become cripple). However, the Mother of Us All, Nature makes sure we get old, weak and painfully disfunctional. Whence the need to consume fixes in the form of pills. . As long people will not accept their own mortality and leave the system knowing they can’t cope with it. They will take those fixes. . The companies knows that, and all their publicity stunts are based on the benefits of taking their drugs. Giving them the money, and causing an addiction to the general public. Because the public is addicted, they can slowly increase the price of the fixes. And you know the rest of the story. sere \\nStocks rebound. Change subject and talk about painkillers. Lol SunnyFlaSnotress \\nYes, digressions are all too rampant on this board. Ted \\nAgree with the folks who believe tptb have this all under control. Go live your life. Malcolm Reynolds \\nAnd when they take a dump again in the next week? Should we come back and Lol at you? jox \\nI don’t remember your comments last year. And I can’t access your history of comments. As Malcom asks you, ¿will you come back in the next crash? VigilanteCaregiver \\nWe get pain killers for the Wife’s conditions. And neurotransmitter meds, dementia meds, seizure meds, diabetes meds, anti-spasm meds, etc. \\nNot worried about addiction. Try the #$%&ing cost! Just the neurotransmitter meds, even with two insurances, still gouges us $200 a month! Same thing for the seizure meds. The diabetic meds are a little cheaper, but the test strips and syringes are ridiculous!! \\nFeds force us to BUY insurance at gunpoint (still unconstitutional which makes it illegal for them to do); they didn’t bother including language that says insurance will pay out! Just like paying for another useless, worthless, irredeemable bureaucracy (high-paid welfare recipients). Steeve Girard \\nYes it is ridiculous to fight old age and death. It will eventually happen. Why pay for it? Orange Jean \\nSteeve, my understanding is that his wife is quite young (I think he said in her 30s) but had a bad accident of some sort and has traumatic brain injury. Nothing to do with old age… from previous posts…he sounds like a loving husband who tries very hard to take care of his wife, their young kids, and himself. You could have been a little more sensitive. \\nBesides… you don’t think you’re ever going to get old?? Rick \\nWell who do you think wrote obamacare? VigilanteCaregiver \\nTruthfully: based on results, dire enemies did this. Rick \\nThat certainly could be said. It was big insurance company lobbyist and lawyers who crafted the majority of the bill. Guess they insulated themselves with mandated profits forever? Or at least until some President with common sense comes to office, takes out HIS pen and phone, and abolishes this criminal piece of legislation that is slowly killing us all, and more rapidly killing our economy. VigilanteCaregiver \\nThat bill was obviously crafted a long time ago. There were far more groups and usurpers involved than just lawyers and insurance folks. \\nMy problem is this: what actually compels the next president and Congress to do what you’re wisely stating above? \\nI said to local candidate recently that if he’d put up his personal fortune as security or take out a bond in their name, then I’d be more inclined to believe what he’s saying. He asked why he should; I said to cover my losses from his inevitable corruption and mistakes, and to punish him for not doing his job. He didn’t like that; neither did the other candidates within earshot. These skunks won’t ever do such a thing, obviously. It had to be said, though. c_chandler \\nhave you sought another doctor to try to limit some of these? VigilanteCaregiver \\nWe are seeing several doctors. They don’t prescribe unless they have to. This isn’t a normal situation; herbal medicines can’t handle it anymore and pharmaceuticals are becoming less reliable with supply. Malcolm Reynolds \\nI’m “addicted” to prescrip painkillers. It’s not hard and it doesn’t happen because they’re happy fun times. \\nI have chronic and extreme pain in my back (2 blown and degenerative discs L1 and L5, and arthritis from L1 to L5) and hips (bursitis). \\nDoing any activity where you’re hunched over (like doing the dishes), sends my back into a tizzy. \\nI throw out my back almost routinely. I threw it out last week and spent 3 days working from bed, and the other two moving realllly slow. I’m extremely lucky I can actually do that. \\nLast year was the first time I threw out my back and literally could not walk. It was so damn painful. \\nI breeze thru 90 -10/325 Hydrocodone a month and have had to withdraw from them at least 3 times because the Doc wont write another script. Creepy Pedro \\nBeen through opiate w/d….not really bad but still sucks…Benzo w/d is from the devil. Wouldnt wish that on anyone. Malcolm Reynolds \\n“opiate w/d….not really bad but still sucks” Yep. That’s about how I’d describe it too. Creepy Pedro \\nGet your liver tested if you plan to be on them along time. As long as you don’t O.D, which is pretty hard to do (unless you are just plain crazy), you will be ok. Benzos w/d and alcohol w/d are the only two that can kill you. Benzo w/d feels like opiate times 100. GSOB \\nNow… that’s what I like to see… helping each other out and building each other up. Your experience lends itself in empathy to Malcolm R. Romans 8:28 \\nIt’s like a Narcotics Anonymous meeting.. at least I imagine.. SunnyFlaSnotress \\nThere we go.. you are on SSDI and have walking issues.. Admit it.. I was sorta right. Malcolm Reynolds \\nyou are on SSDI and have walking issues.. Mmmm, nope. Bet I can still outwalk your stupid a$$. But then you spend a great deal of time on your back so…. SunnyFlaSnotress \\nI make you angry because I am close to your sad truth. I just pretty much totally moved myself. Endurance is a strong point of mine. I doubt you could outwalk me. You just told us how frail you are. Malcolm Reynolds \\nI make you angry because I am close to your vulnerabilities. \\nYou’ve never made me angry. I think you’re a simpleton and I make fun of you because of it. But I’m interested in hearing the whole ‘close to my vulnerabilities’ theory. \\nused to be \\nColor me impressed. I used to run at least 8 miles a day at lunch when I was in the Corps and lifted plenty of weights. But yea, that is definitely “used to”. \\nThese days, DESPITE my pain, I do karate 3 times a week, do monthly campouts in Scouts with my sons, and did the 10 mile hike around Little Wild Horse Canyon/Bell Canyon loop in Goblin Valley, Utah this past fall with ease. WONDERFUL slot canyons, BTW. I highly recommend. DESPITE my pain, I maintain a very active life. \\nThe pain is worse when I’m sedentary. \\nbut if you are going to criticize, I will point out the reality. \\nThe reality is you don’t know a damned thing about me, you just seem to think you do. Orange Jean \\nI’m sorry to hear you are struggling with both pain and addition. I also have degenerative disc disease, plus severe arthritis in my spine, knees, neck and hands. I can barely walk now (have to use a walker at all times). \\nI do have a prescription for hydroconone but do not use it daily; I’ve been able to keep the pain down to a tolerable level by alternating days when I use just Tylenol (cannot use asperin or Ibuprophen any more due to bleeding) and try to use the Vicodin only on weekends (because many more things I do with chores are painful) or when there are bad storms. I get that awful arthritis pain when storms come through, sometimes to the point I can barely walk from my bed to the bathroom. But so far that seems to work for me, you might want to consider giving that kind of regime a try. \\nGood luck with trying to deal with it; people who don’t have chronic pain really don’t seem to understand at all. But it can happen to anyone, only a car crash away (and you don’t have to be the one causing the crash… a lot of this started for me when I was tailgated hard by someone trying to run a red light… through me!). Malcolm Reynolds \\nYikes! You’re doing much better with the meds than I do. Good for you! Orange Jean \\nAs someone said… it is individual. Probably in my case I am doing better with the meds than some because I have seen the bad effects of prescription drug addition in my mother, so I am seriously paranoid about taking drugs… \\nOn the other hand you seem to be doing a lot better than I am with mobility. \\nLest I go into pity party mode though.. there always seems to be someone worse off. I work in a MTF; the minute I seem to be feeling sorry for myself along comes some wounded warrior guy in his 20s, missing both legs. Puts things in perspective. REALIST \\nRead 2 Books: “WHEAT BELLY, by Dr. Davis” and “GRAIN BRAIN” by Dr. Perlmutter. \\nThe consumption of “modern food” is at the heart of this. Add the fact we work too much, consume too much (creating stress with that cycle), and lack of exercise leads to this problem. \\nWe have completely warped and deformed out biology. \\nTo change you life you have to change your life. If you WON’T then you will turn to alcohol, drugs or escapism like gambling to cope. c_chandler \\nim reading wheat belly that often creates the muffin top fat around the belly. gm wheat in our processed bread Cal \\nOne sign of judgment is sorceries. Two meanings the occult and derived from the Greek language…pharmakeia, translated to English, pharmacy (drugs). High Times Magazine called it in the late 70’s…decriminalization followed by the legalization of drugs starting with pot. Four events of the 60’s…removal of school prayer, JFK’s death, the Vietnam War and the start of the drug culture has lead us to the brink of extinction. My response…Call on the name of the Lord to save you and repent then let’s get the h*** out of here. Jesus saves. \\nDrugs and spiritism (occult) have always gone hand in hand. sistersoldier \\nSometimes those pain killers are needed. They’ve always been around. But the 90s -00s unnecessary prescriptions for them exploded. Now we have a herion problem. GSOB \\nExplicably exploded exploitation. ramrodd \\nThere are over 370 “mental disorders” listed in the latest version of the DSM (Diagnostic and Statistical Manual of Mental Disorders.) The list includes “Tobacco Addiction Disorder” among other equally mundane and ridiculous so-called “mental illnesses.” \\nIf the DSM is the standard by which Obama wishes to remove our rights to own guns, then I’d guess 90% of the American people could probably be classified with a mental disorder of one kind or another. \\nBEWARE, BEWARE.. guest \\ni was addicted to muscle relaxers and pain killers. Jesus set me free almost nine years ago. he didn’t just set me free from pills, he set me free from all lies of the devil. for anyone who is still in their addiction don’t believe that lie that you will always want a drug. that is a lie. i have absolutely no desire for pills, or the nasty ciggarettes that i chain smoked every day. i live in complete joy and freedom now. i feel like the most grateful person on earth and all i want to do is kiss the feet of Jesus day and night for setting me free. sistersoldier \\nWhat a mighty praise report. God bless you for sharing. Preacher62 \\nFor whom the son sets free shall be free indeed. Worship is the only adequate response. God Bless as he has already. Rick \\nAmen! Rick \\nOn the bright side, according to the numbers you present here as compared to the numbers you presented in 2014, we are moving in the right direction. From 70% of adults on at least one Rx, to currently only 59% on at least one Rx. Things are looking up… Scoopie \\nI have a prescription for hydrocodone for degenerative disc disease. I’m trying to avoid getting operated on. But why people take them to get high or whatever, I don’t know. They don’t get me high. Malcolm Reynolds \\nExactly. At most it’s … how to describe it … maybe a giddy feeling. Scoopie \\nBeen taking them for 5 years and never hit the ‘giddy’ zone either :/ REALIST \\nI used the stuff for 3 days after Rotator Cuff Surgery and never felt any “high” or anything. I had no pain, but there was nothing else. To me, it was “over-rated” and ended up with a Rx of 36 pills I never used. Why they issued me 40 is a mystery. \\nI sold them on the street for $1 each. Did I get a good deal? Scoopie \\n*l* There are probably (sadly) addicts out on the street saying, “where’s that sweet baby Realist guy? Running into him was like going to the dollar store for stuff to take the edge off of not having heroin”. But, would never give one away let alone sell. ProclaimingGodsTruth \\nExcellent article Michael and very truthful. It is this vain that American’s are seeing last days signs with rapidity: \\n“Neither repented they of their murders, nor of their sorceries, nor of their fornication, nor of their thefts.”– Rev 9:21 (KJV) \\n[Sorceries = Strong’s 5331 = pharmakeía (a drug-related sorceries of various drugs) GSOB Phil \\nso socialist according to you everyone’s a M Jackson I bet you love Obama too and His totalitarian socialism you like him want more Big Gov. control because of the few addicts you have an Md after your name or just a Gov. controller ? see you lump every one into one category just like this guy by the way M Jackson pedophile was an addict he was not in chronic Pain! GSOB \\nI do love Mr. Obama. You are right about that. I think he has a bright future after he steps down. \\nAddiction is not a respecter of persons. \\nThere is a market and what happened to this former musician, great entertainer – is what happens everyday in the ‘Md’ office. It’s ‘The Pusher’ that says ‘everything will be alright, take this everyday for two weeks’. \\nFish got a hook in his throat, fish he has problems. \\nNo, I’m lumping as you insinuate. You are. I suggest you investigate how MJ got started… his hair caught on fire. \\nHave a great day. Phil \\nsome people do have a lagit reason that are suffering with chronic pain you lump everyone into one category so your over stating it as if 99% are drugies and addicts you sound like your in with Obama who wants to control “all Peoples lives you would take them away and make it even harder for people who do need them I get treated like that now at the pharmacies and the addicts get them any way from Canada without prescriptions so see your just another socialist freak who would love bigger Government control by the way I didn’t see a Md after your name ? who knows all you should have a Big Brother after yours my POV Mr. Cipher \\nIt’s part of the pussification of America. Everyone wants a cushy desk job. There are few real Men left willing to get dirt under their fingernails. Any discomfort requires a pain pill. Once they started selling Harley Davidsons in the mall I knew we were thru. Phil \\nwho made you King Obama ! you have His aditude more Big Gov and the people of the US cant think for themselves they need big Gov. Biker! OK socialist Uncle Sam would be a better name for you as a title or Chief woose to Obama ministration ! Goldenpuff2 \\nBeing a person with a pain condition requiring me to use pain meds in order to function on a daily basis, pain meds and their users get a bad rap. It is the PEOPLE who take these meds when they do not need them. It is the PEOPLE who steal from others who actually do need them. Most docs are compassionate people. By design, their job is to BELIEVE people when they tell docs they hurt. Of course, there are bad docs but most are not so again it is the PEOPLE who choose to beg, borrow, lie and steal to get these pills who are the problem. I also take an old anti-seizure med that works for pain by calming the nerve endings. It takes me a month or better to be able to increase this med yet I’m snooping one day looking up dosing or something and run across a forum where people are talking openly about taking this med – and a heck of a lot more than I would EVER take in one dose – and then going to the freaking Mall!!!! to ‘see what happens.’ Now is that stupid or what? The guy’s lucky he didn’t end up in the hospital. So it isn’t the people who are in actual pain overusing their meds, it is the IDIOT PEOPLE with no reason whatsoever to even be near these drugs that are screwing everything up. You can’t protect from Stupid. \\nAgreed! Mary Janis \\nBecause thegov is killing us with poisonous vaccines, chemtrails, herbicides, pesticides, food additives and our bodies are breaking down. They are keeping good things away from us like natural remedies, raw milk, organic foods, etc…… James \\nThat is why life expectancy is going up r Preacher62 \\nPills, alcohol, perverted sex, money, politics; You name it. These are the things that a human race who has rejected God and cast him aside has hold of in order to fill the hole within their lives that only God can fill. Repent and believe the gospel and you will have no more need for earthly things that cannot satisfy but only leave one wanting more. sistersoldier \\nHey…..there is no such thing as perverted sex……..just sayin’…….. Preacher62 \\nAnything that is not of God’s design of one man and one woman for life is perverted. Gay Veteran \\nwhoa, whoa, whoa, what about all that polygamy (NOT polyandry) in the bible Preacher62 \\nA perversion of what God intended which Jesus made very clear. Gay Veteran \\nROFLOL, so “god” puts up with it ALL through the OT and then changes in the NT? Preacher62 \\nHe put up with a lot of things prior to Jesus Christ coming and clarifying the law. He still puts up with a lot of things in his patience and grace with the desire that all men should repent before it is too late. Forced slavery was condemned, voluntary slavery was not. Read the book. Gay Veteran \\nAmerican slave owners used your bible to justify slavery. read some history Preacher62 \\nA lot of people have used the Bible to justify a lot of things. That is the nature of man. Fallen man seeks only their own desires, the resulting guilt causes them to seek justification for it. Most people want to go to heaven, they just do not want God to be there when they get there. Gay Veteran \\namazing how easy it is for them to use the bible for evil Preacher62 \\nMost true statement you have ever made. Gay Veteran \\nbecause it is easy to abuse a book written by men Preacher62 \\nThe only way to be truly comfortable in the darkness is to deny the existence of light. Gay Veteran \\nSo now you just believe that the darkness is really light. Nice switch-up. Gay Veteran \\nwhat’s your point, oh that’s right, you don’t have one awb22 \\nwhat is it to you, he got the sodomy part right, stupid. Gay Veteran \\nyou really need to get a hobby, Sodomite Obsessed Polly the Stalker awb22 \\nstill OT, idiot. Traci \\nLet us not forget that physical pain is real. Pain becomes chronic due to inflammation that does not resolve. Inflammation can be caused by injury, toxins, tumors, poor circulation and even eating the wrong food that sets off a cytokine storm in the body. Bad oils and grains can cause leaky gut that can lead to pain. People who live with pain are not bad people but they are miserable and suffering and they need relief from pain to have quality of life. Many things can be done to help pain to include herbs such as turmeric and boswellia and innovations such as tens units or earthing. But the Doctors do not advise of alternative and safer pain relief modalities, they only push narcotics or anti-inflammatories that mess up the adrenal glands or kidneys. Insurance will not pay for anything alternative, insurance only pays for prescription pain pills. After awhile pain pills cause tolerance, which means the body requires larger does to achieve the same amount of pain relief. People that need higher does “are not addicted” but have developed “normal tolerance”. Our health care system needs changed so that pain is treated at the root cause and not just a cover up of the pain symptom. Do not forget 1) the worst thing a doctor can do is to kill you. 2) The second worse thing a doctor can do is to cure you. SunnyFlaSnotress \\nIf the people really need the meds, I don’t consider them addicts.. just patients. Orange Jean \\nI go to an ortopaedic clinic and they prescribe physical therapy a lot of the time, including many of the things you suggest as alternatives and my health insurance will pay up to 72 physical therapy visits a year. Most years lately I’ve had to use that much and more, and much of what they do helps to a point… but are not permanent cures. \\nIn addition to cortisone shots and various pain meds, I’ve been given compression stockings (for lymphodema),. back traction, neck traction, a lot of excercises, heat and message, tens unit, cold laser therapy etc. Could have chosen chiropractor adjustments as well, but personally those made me feel worse. I’ve also tried a number of herbs which you’ve suggested, which also did nothing. \\nJust sayin’!! I do have both “good” days and “bad days”… and I try to be thankful for the good ones. Traci \\nreal. Acute pain caused by an injury can become chronic pain if the injury does not resolve. (think spinal pain). Often pain has no specific known cause but develops from generalized inflammation. Inflammation can be triggered by autoimmune disorders such as fibromyalgia, multiple sclerosis and food allergies. Grains and bad oils can lead to leaky gut which allows non digested proteins to leak out of the gut and into the body which will then cause a cytokine storm and abnormal immune complexes, that leads to generalized pain. Sometimes pain is caused by nerve pain due to diabetes or lack of B12. Pain is multi-faceted and has numerous etiologies. But PAIN is REAL and people suffering from chronic pain need compassion and help not blame. Pain is helped by narcotics, steroids and herbs such as turmeric and boswellia. Alternative products such as tens units, earthing and DMSO can also provide amazing relief. When people go to doctors, (whom they trust to have their best interest), they are only provided with narcotics and steroids, not alternative products. The insurance company will only pay for prescription meds. The AMA and the prescription industry have a partnership. If a doctor dare suggests alternative pain relief they can be in legal trouble. A truth about opioids is that they causes “dependence” which means as the body adjusts to the pain med, a larger does is required to provide the same amount of pain relief. Many people confuse “dependence” with “addiction”. People need relief from pain and doctors whom they trust, let them down. I do not have pain now, but I have I have had it the past. I had to become my own doctor and heal myself. Praise God for the internet! I am also a registered nurse. Orange Jean \\nThank you for your kind post… it is so strange to hear how many people blame someone for being in physical pain and have NO idea what that is about. Mark A. Kuntz \\nPeople just don’t get it. The true problem is “sin”. Sin is killing us and we are trying to solve a spiritual problem through natural means, and it will not nor never can work. We will not solve any problems with money or programs. It never has worked and it never will work. Only one way to solve our problems. Be humble before God and repent for our sins. God said in 2nd Chronicles 7:14 that if we would humble ourselves and seek His face that He would “heal our land”. Its that simple. All of the worlds problems are rooted in our failure to trust in and obey God. We turn our backs on a loving Father who knows what is best for us and then wonder what went wrong and why things are always getting worse, in spite of the billions of dollars spent and the promises of politicians and every four years we really believe if we just can get “our person” elected, the country will all magically turn around. What a joke! Turn to God, that’s our only hope. And just to be clear, I could care less what any of the haters of God think. Orange Jean \\nSo you’re telling me I have severe arthritis and chronic pain due to “sin”? Somehow, I think you’re wrong about that! CharlesH \\nFor a very long time now, one of my biggest concerns has been what will happen in the U.S. should suddenly and without any warning there be a supply disruption of medications from the manufacturers to the doctors, hospitals and pharmacies? I have read – on many legitimate websites – that there is a maximum of a 30 day supply on hand at any given time. I’ve seen first hand what a severe addiction can do to someone – it’s horrible enough if they have their drugs (I don’t sugar coat it by calling them ‘meds’) – but imagine suddenly they’re not there. All hell literally breaks loose. John E \\nBlame the pills, blame the doctors, blame the religions, blame pharma companies, blame everything…..but don’t ever look in the mirror and say I let these pills rob me of my soul for a little bit of relief from real life….because after all that could be a bit painful too and require some changes. \\nLong gone are the days when people went to the dentist and had a tooth pulled with a little local anesthetic or shot of whiskey. Sure end of life or serious injuries can go a little smoother with pain killers but I have trouble believing that millions of Americans need that kind of pain relief from hard drugs everyday. \\nThis is the new America, a nation of spoiled sissies and cry babies. boo.hoo…hoo. Please don’t ask for my sympathy, you did this to yourself. Dave of OK \\nwhat is going to happen to this country once the pharmaceuticals are not there to fill the need? We are going to have a lot of near zombies roaming the land. This depression is going to be a lot worse than the last depression. Not as many people were on antidepressants in the 1930’s. grumpyhillbilly \\nI hope they become zombies. Unfortunately it will likely be mass psychotic episodes. HENK-2 \\nIf Americans (I suppose you mean USA citizens) are so happy. \\nI have trouble with that. \\nHow can 100 million unemployed people be happy? \\nOr the 45 million on food stamps? \\nI think they are very unhappy and the circumstances they live in would account for taking drugs that lessen the mental pain. \\nHow many drugs are prescribed for people in nursing homes or for prisoners to keep them in a mental fog to keep them quiet. \\nNever trust the pharmaceutical industry. \\nI am 81 years of age and am convinced that there are parts of drugs that MAKE you dependent on them e.g I am on 2 prescription drugs which I don’t want or need but if I do not take them I lie awake for hours; this is not healthy as it is easy to think about things which are better left alone. Deal with problems but do not dwell on them. \\nPainkillers: \\nThe opium poppy is the king of painkillers even when synthesized. \\nBecause of chronic pain I was on opoids from 1991 till last year. \\nI was on codeine and progressed to methadone (no, I was never a junkie, this was for pain) and suboxone. \\nThe latter is so restricted that the head of the alcohol and drug administration in the entire shire (county) treated me personally. \\nI received 7 pills per week, pick up on Sunday but do not bother to come on Saturday because you are not due yet. \\nI do not know if suboxone was responsible for what happened but a year ago I did a cold turkey on all painkillers and do not miss them, even when I suffer I can look at them and the memories of chronic constipation come back as horror stories and indignities. I am looking at them now. \\nI should say that I have a history of doing cold turkeys with alcohol and smoking. \\nIt is important to understand that you cannot give those things up to please other people, you should only do it because YOU want to. \\nIn my case my first grandchild was due and I promised myself that no grandchild would ever see me drunk. This was in 1980. And none have. \\nMany people have heard the expression: to hit rock bottom. But it is rarely defined. \\nIn my case it means: I have reached the point beyond which I do not want to go. \\nI hope I have been of some help and wish everybody all the best; not willpower because that is soluble in alcohol. James \\nconvinced that there are parts of drugs that MAKE you dependent Yes, they activate dopamine reception and production. It is what happens if you try to inhibit opiate receptors. James \\nsuboxone. \\nUm, soboxone is the brand name for naloxone, and Buprenorphine. Two drugs that are used to treat opiod addiction. Deanna Clark \\nWhy am I not surprised that this article about the suffering of millions gets only a bunch of religious arguments and cold judgement? This monster hurts families, friendships, whole towns. It drains money from businesses, savings, family, and brings sweet girls into prostitution…boys too. Yet there’s not a word here of sympathy or mercy. Shame… grumpyhillbilly \\nI don’t know. Seems like your average drug user feels sorry enough for themselves without my pity. Sorry, my user cousin is the master of exploiting empathy. Makes me the opposite any more. Deanna Clark \\nBut they have families that can ruin themselves trying to help. Then there’s the children and spouses of the addict…the toll is horrible. All over the US are grandparents raising grandchildren, spending their savings, taking no vacations…always worried their grown child will overdose. The current crisis in STDs is due to the drugs for sex habits. They say future addicts can be predicted as children…they see every attempt to guide or advise them as an encroachment on their freedom. They have no docility…pig headed and stubborn….and they quit only when they are good and ready. Why so many now? Like junk food, booze, hook-ups and all…the answer is always, “But it makes me feel soooo good.” So maybe it does trace back to the whole world view pushed in our culture. freethedacks \\nthe solution is to legalize cannabis. Cannabis is a non-narcotic mood elevator and pain reliever without the inherent addiction problem of drugs. Problem is the control freaks have lumped cannabis in with very strong drugs, and have even labeled it as a gateway to things like cocaine and heroin. This has been proven to be completely false. Cannabis is not even technically a rug, but an herb in it’s natural state. It is the totem herb of humanity – it has been a companion plant that has served mankind in many ways for centuries. It’s prohibition has people seeking alternatives, which end up being all the bad stuff that is easier to get. Legalize cannabis and watch the heroin epidemic go away grumpyhillbilly \\nC’mon pot is easy to purchase. Nor is it the answer to a miserably unhappy populace. My cure would be to end the big old pity party. James \\nA drug is anything that alters bodily function. Drugs can be herbs/plants. Examples include asprin. \\nCannabis is not even technically a drug, but an herb in it’s natural state. Cannabis inhibits cannabis receptors, therefore it is a drug. James \\n. Cannabis is a non-narcotic mood elevator and pain reliever without the inherent addiction problem of drugs. \\nCannabis is addicting. Well proven Orange Jean \\nBack when I was young I bought into that notion… tried smoking dope when I got the flu. I have NEVER been so miserable in my life! So I am not buying the “safe pain killer” idea. Might work for some people I don’t know… but I will never try that again. grumpyhillbilly \\nThe allopaths aren’t all that they are made to be. Need stitching up in the insides – they’re your doctor of choice. Virus…don’t waste your time. They have done greatest with bacterial infections til they over prescribed antibiotics. Allopathic cancer treatment can be described as hoping to kill the cancer before they kill the patient. \\nStop worshipping doctors of state sanctioned record. These days to get into med school, all you need to be is a legacy or a “minority.” Best and brightest is a wish. It shows. Say no to your doctor some day, then sit back to avoid the subsequent head explosion. Chances are your insurance won’t pay for no. Which all leads to a mind numbed populace. Now why do I think that is what our ruling oligarchs want? Orange Jean \\nI’m sorry to hear how many of you seem to mix up people who are drug addicts who got that way to have “fun” with people who may have become addicts through having serious chronic pain and bad advice on how to manage it. There are also plenty of people there who have nothing but chronic physical pain due to injuries or disease who are prescribed these drugs to control the pain. I’m one of them. \\nMy body is deteriorating and I have chronic pain… sometimes severe to the point where I can barely walk. I do use drugs when I need to, but try to keep it to a minimum. I do not believe I am addicted because I can still choose what to use when, but I do understand there are risks involved. The problem is for some of us, the pain levels can be so bad you cannot function at all in life. I have a job and I live alone, so I need to continue to function as there is no one out there going to do things for me I need all the time. \\nAnd no, sorry… but I do not think going to church is going to fix it. True for some people if their problem is an addiction due to weak morals or something… but not if it’s due to severe pain. It is unfortunate that there are NO totally safe drugs to use to control severe chronic pain. \\nEver hear of Job? I don’t think God promises us we will all be happy and healthy all of the time. Sometimes people luck out and sometimes they do not. And despite some people’s assumption that you can stay in good health just by eating “right” and excercising… you never know if something will come upon you and ruin your health. It may be a disease you never saw coming, something you inherited, or something as unavoidable as someone crashing into you when you are driving or riding in a vehicle (or biking or walking for that matter). lincolnlincolnlincoln \\nwhy? maybe because of the previous article…. Willard Ferch \\nUnder communism there is little to hope for. Russia became over-run with alcoholism and the abortion rate was through the roof. As our nation declines, hope will diminish. Placing our hope in the correct place is the answer, and that place is in the Lord. Fiddlin \\nJesus Christ is the solution Buffet \\nIf these weaklings just quit crying every time they have a hangnail, then the sissies would never have any problems. I’ve had four orthopaedic surgeries and never taken so much as ONE pill of that rubbish!! It’s not that they can’t stop – they don’t WANT to stop, because they’re a bunch of strung out losers. DMCasey \\nIn spite of so many abusing these drugs, please keep in mind that there are many who actually NEED them for serious pain relief–for example, those who have terminal illnesses, incapacitating nerve pain, chronic severe pain that keeps them from any kind of normal life. \\nWhat will happen to those who really need it if the government takes it off the market, for example? Because people abuse something why should those who are in desperate need suffer for their choices by perhaps having to come off the meds they need? Charlie Payne \\nLet me think? We are an aging, success conscience society that in order to be successful, most of the time people have to work wy more on average than 40 hours a week, more like 10 – 12 and sometimes 6 days or 7 days a week for periods of time, At very often back breaking work. For 20 or 30 or 40 years and now is living longer because we are what, the most successful Country on Earth… Now you wonder why so many people who are living longer have more diseases and injuries, but this weird man who is Surgeon General who thinks it is better for them/us to feel more pain, not less is healthier for all of us! I question his motives or intelligence!'"}, "time": 1742628509.850668}