{"duration": 0.051367759704589844, "input_args": {"text": "'It’s Over For Hillary After People See What She Snuck In Her Online Post Posted on November 1, 2016 by Amanda Shea in Politics Share This Hillary Clinton \\nSocial media seems to be a tricky tool for Hillary Clinton, as she made a major mistake in what she shared online when she was either inebriated or hopped up on medication to treat what’s been plaguing her throughout this election. Shocked viewers couldn’t believe what was seen in her post, which she didn’t catch until it was way too late. \\nAlthough we’ve seen how good Hillary is at hitting the “delete” button, she didn’t get to it quick enough after what she mindlessly posted that proved what Americans have suspected. Evidently, she didn’t realize she was making a point against herself when she made the comment with the post that said, “A guide to help you make your choice for president,” which mad the mistake all the worse for her. \\nEither Hillary takes full responsibility for being corrupt by apparently admitting to it, or the person that does her social media is paying a big price today. Without reading what she was sharing, Hillary blindly posted an article from the super liberal news site, Slate, assuming that if it was from them, it was pro-Hillary, when the title of the piece called her out for being one of the “most corrupt, least popular candidates of all time.” A guide to help you make your choice for president. https://t.co/QzK7XZYmJW \\n— Hillary Clinton (@HillaryClinton) October 31, 2016 \\nUrging her followers in the comment with the post to use it as a guide for making the best presidential pick, it was the best and most honest advice she’s ever given. It’s for this reason that the post was likely an accident since we all know that Hillary is incapable of being truthful, but karma, in this case, ensured she was. The irony of the situation isn’t lost on conservatives but apparently was on Slate, whose piece was actually meant to promote the Democratic candidate but came across as just the opposite. \\nThe truth has a sneaky way of coming out as it did in this headline, which calls attention to this woman’s lack of character and qualifications for the presidency. For once, there’s finally some common ground conservatives have found within this liberal publication’s pages, and that’s that Hillary Clinton is corrupt and incapable of being a leader.'"}, "time": 1742561913.051748}