{"duration": 0.07566595077514648, "input_args": {"text": "'TAMPA, Fla.  —   Kyle Higashioka grew up surfing off the bluffs in Huntington Beach, Calif. which proclaims itself as Surf City. He can lay down some fierce heavy metal licks on his electric guitar, a skill that might be given away by the Iron Maiden socks he wears for workouts. His Spanish isn’t bad, either. In many ways, Higashioka grew up a quintessential Californian. But recently he has begun to explore his family’s roots  —   by learning to speak Japanese. “My dad has always been pressing me to learn,” said Higashioka, a     on his father’s side. “This spring, finally, I thought maybe I should try. ” There was also some pragmatic motivation for Higashioka, a catcher who was elevated to the Yankees’   roster for the first time after a standout 2016 season in the minor leagues: He thought learning Japanese might help him communicate with Masahiro Tanaka, the ace of the Yankees’ pitching staff. And if the Yankees, who have a lengthy history with Japanese players, were to land the   Japan League star Shohei Otani next year? “I thought it could be beneficial for the Yankees to have a catcher who speaks Japanese,” Higashioka said. Higashioka, who picked up some words from his father and has relied on   software, will bounce words off Tanaka and his interpreter, Shingo Horie, who has helped him improve his baseball vocabulary. He also occasionally tosses phrases toward the cadre of Japanese reporters who cover Tanaka. “I mess around with them in Japanese,” Higashioka said. “I say the few things I know to them even if it’s out of context. I’ll tell them I ate eggs this morning because it’s the only stuff I know how to say. ” He added: “The rule of thumb is they don’t really consider you Japanese unless you speak Japanese. I would be a lot more proud of being able to speak because I am part Japanese. ” As a beginner in Japanese, Higashioka has modest expectations, but his baseball career might provide a good model for persistence and patience. The Yankees chose Higashioka in the seventh round of the 2008 draft and lured him away from a scholarship to the University of California with a $500, 000 signing bonus. While valued for his catching skills  —   he is regarded as the best pitch framer in an organization that has long prized that skill  —   Higashioka missed almost the entire 2014 season after Tommy John surgery and had never hit much. Until last year. Higashioka, 26, belted 21 home runs last year between Class AA Trenton and Class AAA    trailing only Gary Sanchez, Carlos Beltran, Aaron Judge and Tyler Austin in the organization. He also drove in 81 runs and posted an . 847   plus slugging percentage, about 150 points above his career average. As if to serve as a reminder of last season, Higashioka homered in his first game of spring training. “He put himself on the map, definitely, with what he did last year,” said Manager Joe Girardi, adding that he believed that Higashioka, who has altered his swing, can continue to hit for power. “We talked about it when we left spring training last year that he was impacting the ball better than we had ever seen it. We thought he’d hit some home runs, and it turned out that he did. ” With Sanchez marked as the Yankees’ catcher of the future and Austin Romine having performed capably as the backup last season, Higashioka will most likely begin the season with   . Spring training, though, is often a valuable time for pitchers and catchers to get to know one another, as catchers seek to learn not only a pitcher’s repertoire but also his personality. Tanaka said he had developed a good working relationship with Sanchez and Romine last season, adding that he hoped to become more familiar with Higashioka this spring. “It’s about getting on the same page,” Tanaka said through his interpreter. “During the game what is important is that we both know what we want to do. If we’re on the same page, when he gives out that sign, that’s exactly what I want. That’s the type of relationship that ultimately you want to get to. We’re working toward that. ” While Tanaka uses his interpreter to communicate with his catchers, Higashioka rattled off Tanaka’s pitches in Japanese: sutoreeto (fastball) suraidaa (slider) supuritta (splitter) and kattaa (cutter). He can also ask Tanaka where he wants to throw the pitch: takamei (high) or hikamei (low) nikakoo (inside) or gikakoo (outside). Asked which was better  —   his English or Higashioka’s Japanese  —   Tanaka smiled. “Same,” he said in English. Tanaka was probably being charitable. Still, Anri Uechi, a reporter for The Kyodo News who has covered Tanaka for two years, said any effort to speak Japanese was generally viewed as a sign of respect. “It’s always nice to have someone speak your language,” Uechi said. “I know I feel that way maybe Tanaka does, too. ” Though Japanese immigrants have settled in Southern California for generations, there are few where Higashioka grew up, so there was little to spark his interest in his family’s heritage. Unlike his father, Ted, a   American, Higashioka did not have any   friends growing up. “We’re in Huntington Beach,” Ted Higashioka said. “It’s not like it’s a Japanese cultural center here. It was a little more difficult. ” Ted Higashioka spent several years as a child in Japan, where his father worked as an oil company executive. But when the family returned to the United States, there was little reason for him to speak Japanese. He wishes he had. He can understand the language but does not feel comfortable speaking it. “My parents never deterred me from speaking Japanese, but you just feel it,” Ted Higashioka said. “You want to assimilate a little better. You try to put those things in the background and try to be a little more  . It’s really important for people to hold onto their heritage and language growing up and not be forced to hide something like that. ” The family history, like that of many   during World War II, is complicated. While Shigeru Higashioka  —   Ted’s father and Kyle’s grandfather  —   earned a Bronze Star in the Army’s 442nd Infantry Regiment, a mostly   unit that fought in Europe, Shigeru’s parents and other family members were sent to internment camps. “The feeling I got from my parents was it was no ill feelings,” said Ted Higashioka, who added that his father was extremely proud of his military service. “It was just a sign of the times. He was just being a good American, but I never heard him be bitter about what happened. I guess, in a way, that was kind of the Japanese way. They just endured it. ” Kyle Higashioka said the topic rarely came up. “My grandparents were quite a bit older than me, so I never really got their perspective on it,” said Higashioka, whose grandfather died 13 years ago. “By the time I was old enough to understand that stuff, it was too late. ” This more recent embrace of his heritage is taking on other forms. If his Japanese is still nascent, Higashioka did a very Japanese thing over the winter: He married in Hawaii. His father also noticed that his older son would leave the last morsel of his dinner on the plate, a form of Japanese etiquette. When this observation was relayed to Higashioka, he smiled, acknowledging that his father was right. “Everything how that culture works is quite different than American,” he said. “It’s cool to see the difference between Tanaka and the rest of the American guys. It’s real interesting and something I’m curious about. ”'"}, "time": 1742628539.6544883}