{"duration": 0.06771063804626465, "input_args": {"text": "'Thursday on his nationally syndicated radio show, conservative talker Rush Limbaugh called Bill O’Reilly’s departure from the Fox News Channel a “campaign,” and not a “natural” event.  Limbaugh pointed to the origin of the story, which was first published in The New York Times and how it may have something to do with an internal struggle of “corporate intrigue” within Fox News. Partial transcript as follows: Why do The New York Times break the story? Out of the blue, they want to do a story on O’Reilly and Fox with whatever number of payouts to women. Where’d this come from? Nothing just comes out of the ether folks. They are not sitting there over at the New York Times waiting for ideas to pop into their head and then one second some reporter,  ‘You know what I think I’m going to do a story on what a sexual harasser Bill O’Reilly is.’ That is not how it happens. The reason that it starts in The New York Times is important is because the second aspect is the corporate intrigue that I mentioned that is also behind this.  It is  —   I don’t work there so there is no quicksand  —  but there is a battle for power going on there between sons of Rupert Murdoch and Rupert. And they are not conservatives my friends. In fact, they are  —   what is the generation before millennials? X? Their friends are all liberal, their wives. One of their wives works for the Clinton Global Initiative. One of the wives when this New York Times story, ‘You can’t keep the man on the air you just can’t this is embarrassing. It’s embarrassing to us, it’s embarrassing to dad company. You can’t do this.’ And the fact that the story ran on The New York Times was such a profound shock, sadness, and embarrassment that they felt that had to do something. That is why the fact that is started on The New York Times is crucial. There is two reason it is important. The Times is not just appearing out of nothing out of the ether. Here’s the timeline, story New York Times. How long did it take before you started hearing about massive advertiser defections,  just a day, right? You think that was natural? No, this was a campaign, folks. That’s why this is so frustrating to me, even after all this time, these campaigns are not immediately spotted for what they are. Therefore, people are not able to deal with them. And this one should have been expected given what’s been going on the last two years there. Tey should have been ready for this. But see the bottom line is they were. Fox is not going to be the way it is for long. There is a massive  —  shakeup coming, and it is generational. It is generational and political. It is like anything else, nothing ever is constantly the same, there is change everywhere. But it has been amazingly easy to sit from a distance and watch this, it’s amazing how easy it appears, at least to me, that this massive and rapid transformation is occurring. (  RCP Video) Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742561722.9070475}