{"duration": 0.036551713943481445, "input_args": {"text": "\"Stephen Lendman Sums Up The NYT \\nNYT Scare Tactics for Hillary \\nby Stephen Lendman \\nThe Times shamelessly serves as Hillary’s press agent, masquerading as a legitimate source of news and information. \\nOn November 5, its editors hyped a nonexistent “catastrophe that looms if we wake up Wednesday morning to President-elect Trump…Averting the worst starts with electing Hillary Clinton,” they blustered. http://www.nytimes.com/2016/11/06/opinion/sunday/imagining-america-on-nov-9.html?_r=1 \\nAppealing to voters unwilling or dubious about supporting her, they ignored her high crimes and unfitness for any public office, calling Trump “an ignorant and reckless tyrant,” then asking: “(W)hat did you do to stop him” if he emerges triumphant? \\nClaiming “Republican efforts to jam the electoral machinery through lies, legal obstructions and the threat of violence,” they ignored DNC rigged primaries for Hillary, urging voters to “hold out, however intimidating the process and long the lines.” \\nThe Times never served its readers responsibly, an exclusive voice for wealth, power and privilege. Its press agent journalism for Hillary turned itself into a laughing stock – disgracefully supporting a war criminal/racketeer/perjurer, the most recklessly dangerous presidential aspirant in US history, her elevation to the nation’s highest office risking nuclear war. \\nCalling the Republican party “sick” ignores America’s deplorable political process too debauched to fix – money controlled fantasy democracy, voters having no say over who governs. \\n“If Mr. Trump is rejected on Tuesday, the nation will have a momentary breather,” Times editors blustered, adding “(a)nd some good news to build on…(a)nd the electorate will have demonstrated its decency.” \\nIt’s hard imagining anyone swallowing this rubbish. Whoever emerges triumphant on November 8, ordinary people lose – with an important difference between Trump and Hillary. \\nHer empowerment as commander-in-chief of America’s military risks unthinkable nuclear war. At least with Trump, we’re likely to avoid a potential catastrophe able to end life on earth – what Times editors won’t ever explain, shamelessly supporting a war goddess lunatic endangering everyone. \\nStephen Lendman lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net. Dr. Paul Craig Roberts was Assistant Secretary of the Treasury for Economic Policy and associate editor of the Wall Street Journal. He was columnist for Business Week, Scripps Howard News Service, and Creators Syndicate. He has had many university appointments. His internet columns have attracted a worldwide following. Roberts' latest books are The Failure of Laissez Faire Capitalism and Economic Dissolution of the West , How America Was Lost , and The Neoconservative Threat to World Order . Newsletter Notifications Signup Form\""}, "time": 1742564417.4454029}