{"duration": 0.03986215591430664, "input_args": {"text": "\"Share on Twitter \\nYou've all heard by now that Donald Trump thinks Hillary Clinton is trying to rig the campaign, including the idea that she's trying to suppress his voters. \\nNow Bloomberg Businessweek has a major new story out on his campaign, including a few fascinating revelations: \\n“Nate Silver’s results have been similar to ours....except they lag by a week or two because he’s relying on public polls.” \\nThe campaign holds rallies in non-traditional states like New Hampshire and Maine because data shows that's where the most persuadable voters can be found. \\nYou meet Brad Parscale, Trump's main digital guy, who has quite a background. Join me on @thedonaldreddit Reddit AMA right now! https://t.co/tpyfSB0M75 — Brad Parscale (@parscale) October 25, 2016 \\nMost importantly, the story also presents another side of the Trump campaign, an active effort to persuade Democrats not to vote. It concentrates on three key groups. 1) White Liberals \\nTrump’s invocation at the debate of Clinton’s WikiLeaks e-mails and support for the Trans-Pacific Partnership was designed to turn off Sanders supporters. 2) Young Women \\nThe parade of women who say they were sexually assaulted by Bill Clinton and harassed or threatened by Hillary is meant to undermine her appeal to young women. 3) African-Americans \\nHer 1996 suggestion that some African American males are “super predators” is the basis of a below-the-radar effort to discourage infrequent black voters from showing up at the polls—particularly in Florida. \\nThat strategy in action: \\nOn Oct. 24, Trump’s team began placing spots on select African American radio stations. In San Antonio, a young staffer showed off a South Park-style animation he’d created of Clinton delivering the “super predator” line (using audio from her original 1996 sound bite), as cartoon text popped up around her: “Hillary Thinks African Americans are Super Predators.” \\nThe animation will be delivered to certain African American voters through Facebook “dark posts”—nonpublic posts whose viewership the campaign controls so that, as Parscale puts it, “only the people we want to see it, see it.” The aim is to depress Clinton’s vote total. “We know because we’ve modeled this,” says the official. “It will dramatically affect her ability to turn these people out.” \\nEarly voting shows that the efforts to decrease turnout may not be working according to the Trump campaign's plan, but it's rare for a campaign to so openly boast of an effort to get people not to vote. \""}, "time": 1742563959.3233805}