{"duration": 0.13286900520324707, "input_args": {"text": "'You are here: Home / *Articles of the Bound* / #TrumpProtest: Communists Mobilize To Disrupt President-Elect Trump’s Inauguration #TrumpProtest: Communists Mobilize To Disrupt President-Elect Trump’s Inauguration November 11, 2016, 6:35 am by Guest Author Leave a Comment 0 0 0 0 0 0 0 Party for Socialism and Liberation, a “revolutionary Marxist organization” burns President-Elect Trump in effigy on November 9, 2016 outside L.A. City Hall. “Progressive people from all over the country will be descending on Washington, D.C. on January 20, 2017 to stage a massive demonstration along Pennsylvania Avenue on Inauguration Day.” – ANSWER Coalition The Party for Socialism and Liberation , along with many other Marxist groups, is aggressively organizing to disrupt President-Elect Donald Trump’s inauguration through mass mailings and social media. The ANSWER Coalition is a front group for the Party for Socialism and Liberation, a revolutionary Marxist organization in the United States that was formed in 2006 after splitting with the Workers World Party . The Party for Socialism and Liberation favors the revolutionary beliefs of Mao and Trotsky. They are Pro North Korea, pro-Cuba and pro-Iran. This author is old enough to remember a rodeo clown who wore an Obama mask getting nation-wide attention for being “racist” and being banned for life from the Missouri State Fair in 2012. Ponder that while considering the complete lack of mainstream media attention for this: “There will be casualties on both sides. People have to die to make a change in this world.” \\nThe poor girl has no idea that she is a pawn to be used by communist thugs. \\nOr this: \\n— Marcus Yam (@yamphoto) November 10, 2016 Party of Socialism and Liberation via Yahoo \\nIn a mass mailing (also on their website ), the Marxist group divulges their support for Communist Bernie Sanders and explains in part: This country needs a real political revolution. Millions of people feel entirely disenfranchised by a political system that delivered the least favorable and trusted candidates in U.S. history. Many hoped that the Bernie Sanders campaign would represent a new direction and opportunity to take on entrenched power and extreme inequality, for a higher minimum wage, to defend Social Security, rebuild the labor movement, provide universal health care and free tuition. That campaign was largely suppressed, but its end does not change the desires and aspirations of tens of millions of people, workers and youth in particular, who are demanding real change. On Inauguration Day, thousands will be in the streets to give voice to the millions of people in this country who are demanding systemic change. \\nTheir presidential candidate was Gloria Estela La Riva , wants to “build a movement against capitalism !” #voteSocialist2016 ! Protest on Inauguration Day Jan 20th Against War, Racism & Inequality @GloriaLaRiva @pslweb https://t.co/Mkq7oddlvK \\n— La Riva 4 President (@VotePSL) November 8, 2016 \\nMany other socialist organizations have been out protesting, such as the Socialist Alternative , a Trotskyist group that claims Seattle council woman Kshama Sawant as a member. Socialist #Seattle councilmember calls for massive protest, nationwide shutdown on Inauguration Day \\n— Ashli Blow (@AshliKIRO7) November 9, 2016 Paper on the ground at the #TrumpProtest in D.C. mentions another protest on Inauguration Day. pic.twitter.com/CISDo7bvXt \\n— Natalie DiBlasio (@ndiblasio) November 10, 2016 Already 10K people joining the #NotMyPresident protest on Inauguration day at the Capitol. Set up for a crazy scene'"}, "time": 1742564520.4531407}