{"duration": 0.06480264663696289, "input_args": {"text": "'RIO DE JANEIRO  —   Drawn to fencing as a teenager because the athletes compete while fully covered, Ibtihaj Muhammad on Monday became the first United States Olympian in any sport to compete at a Games while wearing a hijab. Muhammad, a   Olympian at age 30, came from behind to edge a Ukranian fencer, Olena Kravatska,   in the round of 32 of the women’s saber competition, but she lost later Monday, to Cécilia Berder of France,   in the round of 16. Saber is the quickest and most aggressive of the fencing disciplines. Fencers score quickly, slashing for points, without a lot of the fancy parrying of foil fencing. Milliseconds can separate a winning touch from one that is too slow. Wearing a mask emblazoned with the American flag, Muhammad punctuated her scores with roars of delight and showed visible frustration when calls did not go her way. “I always say that in a sport like fencing, you’re your own biggest opponent,” she said afterward. “If you can control yourself and your nerves and your emotions, and execute the actions that you want, you’ll always be successful, and I failed to do that today. “This has been a beautiful experience for me. I know that this was written for me, the chips fell where they did, and I feel proud to represent Team U. S. A. even in defeat. ” Muhammad, of Maplewood, N. J. first tried fencing at age 13. When she competed in softball, tennis, track and volleyball, her mother, Denise, adjusted her uniforms in accordance with the family’s Muslim faith, adding stretch pants for track and sweatpants for volleyball. “My parents were on a mission to find a sport without alteration,” Muhammad said in an interview in February. Muhammad said of her hijab: “People ask Muslim women about it  —   not just athletes  —   all the time. Like, aren’t you hot? On a hot day, you’d still wear a shirt and pants. I would not leave the house without it. ” Muhammad’s accomplishments led to an invitation to join President Obama when he made his first visit as president to an American mosque in Baltimore in February. Muhammad was among the prominent American Muslims invited to a   discussion with Mr. Obama before his speech. After losing on Monday, she said that many people in America, both Muslims and   did not believe Muslim women participated in sports. “I want to break cultural norms and show girls that it’s important to be active it’s important to be involved in sport,” she said. The other American in the saber competition, Mariel Zagunis, the gold medalist in 2004 and 2008, also lost in the round of 16. The third American, Dagmara Wozniak, was eliminated in the round of 32.'"}, "time": 1742628382.870291}