{"duration": 1.4593842029571533, "input_args": {"text": "'Ernie Els, known as the Big Easy, created a little strife on social media this month by playing golf with President Trump and Japan’s prime minister, Shinzo Abe, at Trump National Golf Club in Jupiter, Fla. As the PGA Tour moves this week to PGA National Resort and Spa, a   drive from Trump National, it was natural to wonder: How many of Els’s peers on the tour, if extended the same invitation, would say yes? At Riviera Country Club in Los Angeles last week, I asked more than   of the Genesis Open field that question, granting the respondents anonymity so they wouldn’t risk the wrath of their Twitter followers or, in the case of at least one pro, the fury of his wife. The players range in age from the early 20s to late 40s. They represent nine countries and make their homes in 14 American states, including four that voted overwhelmingly Democratic in last year’s presidential election. Of the 56 players polled, 50  —   or 89. 3 percent  —   said they would play golf with Trump if asked. Only three said they would not. The remaining three declined to answer. The results were hardly surprising. The clubhouses at PGA Tour stops have long trended Republican, and the sport’s target demographic  —   rich, mostly white men  —   is far different from the women, minorities, immigrants and Muslims who have at times been the most offended by the president’s statements and positions. Long before he was elected the country’s 45th president, Trump participated in tournament   on the men’s and women’s tours and made the game an integral part of his lifestyle and his businesses. His presidency, at least so far, has been no different. But the current political climate is forcing many   people who sometimes enter the White House’s orbit  —   celebrities, N. F. L. players, even college basketball stars  —   to seriously consider the personal and public repercussions of accepting an invitation to engage with the president. “I’m not silly to what’s going on,” said Els, who was born in South Africa. “I know this is probably the most polarizing president of my time. ” He added, “Whether you agree or not, I felt it was a duty to play with the president when you get the call. ” Els, 47, is married with two teenage children, and lives in West Palm Beach, Fla. He is also a member of Trump’s golf club in Jupiter, which might have made him a logical recipient for an invitation: Els said he received his in a phone call from David Trout, the head professional at Trump National, asking if he would be interested in rounding out a foursome the next day that included the president. Els, who was home because he had pulled out of that week’s PGA Tour event in Pebble Beach, Calif. with a stiff neck, said he was not going to pass up three hours of exclusive access to the leader of the free world. “He is the president at the moment,” Els said. “If it was Barack Obama, I would have played. If it was Hillary Clinton, I would have played. ” Since the November election, Trump has played with at least one L. P. G. A. player, Lexi Thompson, and three former men’s world No. 1s: Tiger Woods Els and Rory McIlroy of Northern Ireland, who has a home in Palm Beach Gardens and is recovering from a rib injury. McIlroy played 18 holes with the president on Sunday at Trump International Golf Club in West Palm Beach, in a foursome that also included the former Yankees outfielder Paul O’Neill. Woods, who has played with former Presidents George Bush, Bill Clinton and Obama, described his December round with Trump as “fun” in a blog post on his website, and added, “Our discussion topics were  . ” Other players said they would welcome a similar opportunity. Pat Perez, an   golfer of Mexican ancestry, is an unabashed supporter of Trump, whom he described as “an incredible businessman who knows what he’s doing. ” Perez said he would play with Trump “in a heartbeat,” but would have turned down an invitation from Mrs. Clinton if she had won. (It should be noted that she is not known to golf.) Trump is perhaps the most ardent golfer to occupy the Oval Office since the 34th president, Dwight D. Eisenhower, who had a putting green installed at the White House and carried a club like a walking stick as he made his way through its maze of hallways. Eisenhower, who was a member at Augusta National, occasionally played with Arnold Palmer. Trump enjoys the company of Jim Herman. In 2006, Herman was hired as an assistant pro at Trump’s course in Bedminster, N. J. He played a few rounds with Trump, who was impressed with his game. Trump encouraged Herman to redouble his efforts to earn a place on the PGA Tour and helped bankroll his career at the start. Last year, Herman won his first tour title. Since 2008, his combined earnings on the PGA Tour and Web. com Tour are more than $6 million. Herman, 39, has played hundreds of rounds with Trump over the last decade. During one of their games after the election, Trump invited him to the inauguration. “It’s still very hard for me to separate ‘President Donald Trump’ from the guy I’ve played with for the last 10 years,” Herman said, adding, “I think of how generous Mr. Trump and all of those people were in helping me make it to the PGA Tour. So on that day in Washington, the inauguration was almost surreal in seeing him and his children and some members of his clubs I hadn’t seen in many years, all of us back together to share in that unique moment in American history. ” The PGA Tour once held a World Golf Championships event, a rung below the four majors in prestige, at Trump National Doral outside Miami, but last year it moved the tournament, starting this year, to Mexico City after the title sponsor, Cadillac, declined to renew its contract. As Cadillac discovered, any brand can end up as collateral damage when it comes in contact with a   missile like Trump. When the tournament’s move was announced last summer, the perception  —   denied by tour officials  —   was that the organization was using the sponsorship vacuum to distance itself from Trump, who had made incendiary comments about Mexicans and women during the presidential campaign. After Mexico City was announced as the event’s new home, McIlroy, alluding to Trump’s campaign pledge to build a wall along the border, joked, “We’ll just jump over the wall. ” That McIlroy chose to play golf with Trump despite having said before last year’s event at Doral that if he were a United States citizen, “I’m not sure I would want to vote for any of the candidates,” did not surprise the former player Justin Leonard. Leonard, a reporter for Golf Channel and NBC, said, “I think seeing the president take time out of what we can only imagine being such a busy schedule and placing importance on golf from a business and social level, and for guys like Rory to take the time  —   obviously he’s been battling an injury, but that’s a call that you don’t turn down. ”'"}, "time": 1742562528.9354553}