{"duration": 0.41510963439941406, "input_args": {"text": "'THE ALBINO MINE, Venezuela  —   The 12th time Reinaldo Balocha got malaria, he hardly rested at all. With the fever still rattling his body, he threw a pick ax over his shoulder and got back to work  —   smashing stones in an illegal gold mine. As a computer technician from a big city, Mr. Balocha was   for the mines, his soft hands used to working keyboards, not the earth. But Venezuela’s economy collapsed on so many levels that inflation had obliterated his salary, along with his hopes of preserving a   life. So, like tens of thousands of other people from across the country, Mr. Balocha came to these open, swampy mines scattered across the jungle, looking for a future. Here, waiters, office workers, taxi drivers, college graduates and even civil servants on vacation from their government jobs are out panning for   gold, all under the watchful eyes of an armed group that taxes them and threatens to tie them to posts if they disobey. It is a society turned upside down, a place where educated people abandon   jobs in the city for dangerous, backbreaking work in muddy pits, desperate to make ends meet. And it comes with a steep price: Malaria, long driven to the fringes of the country, is festering in the mines and back with a vengeance. Venezuela was the first nation in the world to be certified by the World Health Organization for eradicating malaria in its most populated areas, beating the United States and other developed countries to that milestone in 1961. It was a huge accomplishment for a small nation, one that helped pave Venezuela’s development as an oil power and fueled hopes that a model to stamp out malaria across the globe was at hand. Since then, the world has dedicated enormous amounts of time and money to beating back the disease, with deaths plummeting by 60 percent in places with malaria in recent years, according to the W. H. O. But in Venezuela, the clock is running backward. The country’s economic turmoil has brought malaria back, sweeping the disease out of the remote jungle areas where it quietly persisted and spreading it around the nation at levels not seen in Venezuela for 75 years, medical experts say. It all starts with the mines. With the economy in tatters, at least 70, 000 people from all walks of life have been streaming into this mining region over the past year, said Jorge Moreno, a leading mosquito expert in Venezuela. As they hunt for gold in watery pits, the perfect breeding ground for the mosquitoes that spread the disease, they are catching malaria by the tens of thousands. Then, with the disease in their blood, they return home to Venezuela’s cities. But because of the economic collapse, there is often no medicine and little fumigation to prevent mosquitoes there from biting them and passing malaria to others, sickening tens of thousands more people and leaving entire towns desperate for help. The economic breakdown has “triggered a great migration in Venezuela, and right behind it is the spread of malaria,” said Dr. Moreno, a researcher at a   laboratory in the mining region. “With this breakdown comes a disease that is cooked in the same pot. ” Once out of the mines, malaria spreads quickly. Five hours away in Ciudad Guayana, a rusting former industrial boomtown where many are now jobless and have taken to wildcatting in the mines, a crowd of 300 people packed the waiting room of a clinic in May. All had symptoms of the disease: fevers, icy chills and uncontrollable tremors. There were no lights because the government had cut power to save electricity. There were no medicines because the Health Ministry had not delivered any. Health workers administered blood tests with their bare hands because they were out of gloves. Maribel Supero clutched her    son as he trembled, unable to speak. José Castro held his    daughter as she screamed. Griselda Bello, who works at the clinic, waved her hands helplessly and told yet another patient to hold on a bit longer. The pills had run out. There was nothing she could do. “Come back tomorrow at 10 a. m.,” she said. “My God,” the patient said. “Someone might die by then. ” “Indeed, they might,” she said. In the nearby town of Pozo Verde, residents said malaria had swept in after miners began returning home sick, the government fumigators having vanished two years ago. Now, the public high school has become an incubating ground of its own: A quarter of its 400 students have contracted malaria since November. “You would think we would do something  —   a cordon, a quarantine,” said Arebalo Enríquez, the principal of the school, who contracted malaria, as did his wife, mother and seven other members of his family. Officially, the spread of malaria in Venezuela has become a state secret. The government has not published epidemiological reports on the disease in the past year, and it says there is no crisis. But the most recent internal figures, obtained by The New York Times from Venezuelan doctors involved in compiling it, confirms a surge is underway. In the first six months of the year, malaria cases rose 72 percent, to a total of 125, 000, according to the figures. The disease cut a wide path through the country, with cases present in more than half of its 23 states. And among the malaria strains present here is Plasmodium falciparum, the parasite that causes the most fatal form of the disease. “It is a situation of national shame,” said Dr. José Oletta, a former Venezuelan health minister who lives in the capital, Caracas, where malaria cases are now appearing, too. “I was seeing this kind of thing when I was a medical student a   ago. It hurts me. The disease had disappeared. ” In El Dique, a rural town where malaria was largely unknown until two years ago, Juana García, 66, sat outside her home, newly widowed since her husband fell ill with the disease and died. She hardly spoke or moved from her chair. “She will keep fighting,” said her daughter Ana María Padrón. Inside Ms. Padrón’s adobe home, her two sons were fighting malaria, too. Almost like clockwork, their fevers began in the morning: at 8 a. m. for Omar, who is 8 at 11 for Aristides, who is 7. The family has found no medicine. The boys have only painkillers. “We pray,” their mother said. The illegal mines spill out over dozens of miles, leaving a pockmarked stretch of earth where the jungle gives way to countless craters and scars. Some are no more than tiny pools where two men sift the mud with pans, like a scene from the California goldfields more than a century ago. Others drain wide marshes with tangled networks of tubes and pumps. In another spot, hundreds of wildcatters had dug out a gaping maw of red and white soil. It sinks 15 stories deep and runs the length of a football field. They call it Cuatro Muertos, or Four Dead Men. It was not supposed to be this way. The gold reserves were once controlled by a Canadian company before President Hugo Chávez expropriated them and pledged to use their profits to fund his   revolution. But the expropriation followed the pattern of mismanagement and neglect that many others did during the Chávez era. The state eventually abandoned the territory around the mine, and the potentially lucrative profits. Wildcatters have moved in, and so have the armed groups that now call themselves the law here. But at least there is food. As the country convulses from food shortages and riots, as hungry mobs ransack grocery stores, restaurants and bakeries, the mining town of Las Claritas, only a short drive from the mines, lives in a state of relative plenty. Restaurants offer full menus. Street markets are packed with fruit. Pickups drive by loaded with pumpkins. In a country where soap is in short supply, a dozen brands are on sale in a   grocery store, where seven models of   televisions are also available. Miners dish out fat wads of their gold earnings in cash, which run through a   machine. The promise of a different Venezuela  —   one where there is ample food and work that pays enough  —   led Yudani González to abandon a program to become a preschool teacher in Ciudad Bolívar, the provincial capital, where unemployment is rampant. Instead, she headed to a ramshackle jungle camp, where she cooks for miners with one hand and cares for her two young children with the other. “Here, you can get ahead,” Ms. González said, washing her    daughter in a plastic bucket on the counter as she cooked. Danneris Flores, a government employee moonlighting as a mining camp cook, sat nearby. She is an administrative assistant in a   health clinic, but Venezuela’s currency has tumbled so far that her salary amounts to only about $1 a day at the current street value. So she asked for a vacation  —   and used it to work for a couple of weeks at the mines. Her    who works for the state oil company, Pdvsa, does the same thing. In a short stint at the mines, Ms. Flores said she could earn twice her monthly wages. She counted the days until she would be home to see her three children, whom she had left after “closing my eyes and making my heart small. ” “I never imagined that I would work in a mine,” she said to Ms. González as they served a meal. “Before, people thought of going to school. ” A miner walked in to greet the women and said he had recently watched someone collapse and die of malaria on her way to a market. Ms. González said she had come down with it four times herself. Her    she said, has had it three times. “They charge you two grams of gold for medicine,” she said. “You pay what they ask. ” Not everyone can find medication, even with gold earnings. José Yoel Castillo stumbled to the doorstep of the malaria clinic in Las Claritas, carried on the shoulders of two relatives as he convulsed and was unable to speak. He had been making a living in the town of Caicara del Orinoco, driving passengers on the back of a motorcycle. But an armed gang took the vehicle, and Mr. Castillo could not afford a new one. So he came to the mines. He quickly found work and money  —   even malaria medication the first time he became ill. But when the symptoms came a second time, he could not find treatment anywhere. “Some people can just keep working through it,” said his    Alejandro López. “But others can’t. ” Even with money in their pockets, the miners know the dangers of going back home. Josué Guevara, 20, gave up last November on his university studies in industrial engineering in a city about 10 hours away. He once pictured himself as a manager at the   aluminum company, Alcasa. But his family members who worked there could barely afford food, he said. “Now I have other goals,” he said, standing at the edge of the Cuatro Muertos mines, where he lives and works today. Using gasoline and other chemicals to extract the gold, Mr. Guevara earned 500, 000 bolívars  —   around $500 at   exchange rates, about 33 times the country’s minimum wage  —   during a lucky   stretch. But when he got malaria this spring, he did what many miners do: He returned to his hometown to recover, bringing the disease with him. “Everything has its risks,” he said. On the other side of the vast pit, Pedro Pérez, 38, sat in a structure made of tree poles and tarp where he sleeps with 10 other miners. He tested positive for malaria twice in March. The third time he fell ill, he did not bother to get tested. “I was lying here and I felt the same symptoms,” he said. He, too, went back home  —   to the provincial capital, Ciudad Bolívar, where his mother eventually caught malaria, as well. “It’s coming from us,” Mr. Pérez said. Mr. Pérez remembered his life before he came to the mines last fall: He was a supervisor at a   metal refinery, he said. He owned a     house and a 2005 Ford Focus. He and his wife, a lawyer, once jetted off on   getaways to Isla Margarita, a tropical island off the north coast of Venezuela. Yet even before he lost his job last year and was unable to find another, Venezuela’s plummeting currency had whittled his salary down to about $26 a month. He eventually left home for the mine. “I am still not used to washing myself every day in a river of dirty water,” he said. “I thought I had a good life. ” A few weeks ago, his wife came to Las Claritas to buy the food and soap she could not find in Ciudad Bolívar. The couple spent three nights together in a miner’s hostel. After she left, Mr. Pérez felt the strains on their marriage. “‘I know it’s hard for you,’ I tell her, ‘but we have to accept this new reality,’” he said. Back in Las Claritas, at a table in a dark brothel that smelled of alcohol, sat Angélica, a young woman with long black hair whose parents do not know she has turned to prostitution to make her living. She left the eastern city of Maturín three months ago when riots erupted because food had gone scarce. “Before, you waited in line for hours, but you got something,” said Angélica, who did not give her last name, ashamed of her work. “But now there is nothing there. ” Today she earns the equivalent of $40 when a miner wants to spend the night with her. More often, the money comes in increments of $8, when a customer wants to have sex and leave a short time later. At times, she said, it may be a stranger who is trembling with fever, unable to perform because of malaria. Other times, it is the owner of one of the Chinese grocery stores. The men come from all corners of the country. “The most difficult part of this life is being with someone who you do not love,” she said. Venezuela rose only after malaria declined. It was the 1920s and another resource had set off a bonanza  —   the black gold of oil, discovered in massive supply. But a vast malaria hot zone, then   of Venezuela, stood between the country and its riches. The deadly scenes were later immortalized in “Dead Homes,” a 1955 Venezuelan novel about the rural epidemics of malaria and the waves of migration to the country’s oil fields. Freeing the country of malaria became pivotal to Venezuela’s development, said Dr. Oletta, the former health minister. “Only once malaria was gone, roads could come, industry,” he said. “This was a sick country, and when it got well, things changed. ” That transformative effort was led by Dr. Arnoldo Gabaldón, the former health minister who began one of the world’s first   efforts to eradicate malaria and who became a national hero during his age. Teams across the Venezuelan countryside built irrigation ditches to drain pools of standing water, distributed quinine and constructed cinder block homes in rural areas so that mosquitoes had fewer places to breed. Dr. Gabaldón founded a research center in the city of Maracay, outside of Caracas and itself a malaria zone at the time, to broaden the mission and train officials from Latin America and Africa. But it was his use of insecticides  —   initially DDT, then other substances  —   that began to turn the tide. The walls of nearly every rural home in the country were sprayed, a technique that killed mosquitoes when they landed to rest. Fumigators would leave an envelope showing the date they would return. By 1949, malaria deaths had fallen drastically: to nine per 100, 000 people from 300. By the time Mr. Chávez assumed the presidency 50 years later and began to carry out his   vision for Venezuela, the regimented system of Dr. Gabaldón had long faded, though malaria still appeared to be confined to a few rural areas. But the restructuring of the economy under Mr. Chávez and his followers, including a growing dependence on oil revenue and a system of currency controls restricting American dollars, would eventually change that. In 2014 and 2015, as oil prices collapsed and the government scrambled for money to pay for goods, services and imports, there were long shortages of chloroquine and primaquine, two drugs used for Plasmodium vivax, the most prevalent malaria parasite in the Americas. By 2016, doctors said there were shortages of nearly all   drugs, most notably a drug cocktail for the deadly falciparum strain that costs just several dollars for a full round of treatment. Though debilitating and even fatal, malaria is easily treatable with the proper medication. Dr. Leopoldo Villegas, an international malaria expert in Bangkok, said the government also relied on outdated methods like outdoor fogging with insecticides, which had unproven effects on adult mosquitoes that transmit malaria. And because it was not publishing epidemiological reports of new malaria cases or deaths, it was unclear how much medicine was needed each year. “This is an emergency, this is an outbreak, and it’s not being dealt with by the government this way,” Dr. Villegas said, adding that the Venezuelan government had repeatedly denied the extent of malaria’s resurgence to international organizations that could help prevent its spread. Gustavo Bretas, a Brazilian malaria expert, said that Venezuela once trained people throughout the region in malaria prevention. But Venezuela’s inability to contain its own outbreak means that it now plays the opposite role: It poses a threat to the countries around it, particularly Brazil, where there are also illegal gold mines. “It’s starting to spill over into neighboring countries,” he said, adding that the lack of government statistics made the extent of the problem hard to assess. Venezuela’s Health Ministry did not respond to requests for an interview, including a letter delivered to its offices. Oscar Noya now works in Dr. Gabaldón’s old laboratory in Caracas under a picture of his mentor in a suit and bow tie. On a recent day, malaria patients once again sat on the steps, most having arrived from the mines. Fifteen had come on a recent morning 12 of them tested positive for the disease. Dr. Noya tries to make do without many vital drugs, like artesunate, listed by the W. H. O. as an essential medicine for the treatment of severe cases of falciparum malaria. He has only three vials of it left. He needs six to treat a single patient with a serious case. One recent night, a gang entered one of his malaria laboratories and stole the computers, one of about 20 attacks this year against the Tropical Medical Institute where he works, Dr. Noya said. He wonders if the groups are aligned with the government. “We believe this is no more than intimidation because we’re not quiet and we won’t be quiet,” he said, referring to public advocacy about malaria and the spread of other diseases. Dr. Noya put away his vials of artesunate as more patients gathered outside. He looked up with an air of desperation. “Dr. Gabaldón would have died of a heart attack if he’d seen what is happening,” he said. Despite the constant churn of workers from across Venezuela, there is a clear order to the mines. It is enforced by an armed group known as the Union. One of the Union’s bosses came to the mines years ago to work as a dentist. He still does. But the squads of patrolmen on motorbikes who dominate this place are the real source of his wealth and power. He sports gold chains, two gold teeth  —   and brass knuckles made of gold. After the government abandoned them, the mines soon grew again, this time at an unruly pace as wildcatters plowed into the forest, creating pools of stagnant water and a population of easy prey for the mosquitoes that breed in them, paving the way for the explosion of malaria. Sitting on his patio, the boss, who declined to be named because he could be arrested by the government, took pride in what he said was the Union’s ability to fill in for the vacuum left by the state. Yes, he acknowledged, the punishments the group meted out could be gruesome, like shooting off a man’s hand when he stole, or tying others to posts at the entrance of town with a sign detailing the offense committed. But he argued that the discipline kept crime in the camps low and allowed miners to go about their business in peace  —   another aspect of life that has steadily eroded in Venezuela’s dangerous cities. “To get justice from the police is a joke,” he said. “You have to get your own justice. ” Eduardo Medina agreed. A former pharmacist, he said he had left the drugstore where he worked in the state of Zulia a year ago to start mining because he saw the economic crisis spread and law and order slip away. “At any time, you might go out and someone would put a pistol in your face for your phone, or knife your mother,” Mr. Medina said in his tent. “Crime is under control here. They charge us, but they solve the problems, too. ” But the appearance of calm is deceiving. Storms rage in other places where rivals vie for control of the mines. In March, at least 17 miners were killed in what the authorities believed was one such dispute. Mr. Medina, on a break, looked down into the pit where his fellow miners labored. “At any moment, you can be killed in Zulia,” he said. “But you can be killed here, too. ” For all the challenges of keeping order, the boss said, malaria was even harder. “On malaria, we are screwed,” he said. The task of monitoring the disease seems to have been delegated to people like a state health employee named Miguel Martínez, who sat at a lonely post a short walk from a brothel near the mines, examining blood samples from miners. Under his microscope, a dye had stained the malaria parasite a dark purple. The log beside him showed that half of the patients who had visited him that day had tested positive for malaria. Like many health workers in this country, Mr. Martínez was exasperated. “Just as there are no rice and beans in this country, there are no medicines,” he said. Evening approached at the mine, the time when the Anopheles mosquito begins to feed. Dusk settled over a clapboard Pentecostal church, where parishioners speak in tongues, and past a    circus tent promising alcohol and a strip tease. Under a tarp, five men hammered away at a vein of quartz, which they would grind down and sift for gold. Others waded up to their shoulders in pools laden with heavy metals like mercury, angling tubes to pump the mud. Tropical birds flew in the distance. “Is the malaria really coming from the miners?” asked Aníbal Flores, 28, a miner who sleeps in a hammock between two poles beside the mine. “But where else can we go to make money? The city? There is no food there. ” Lately, many Venezuelans have taken matters into their own hands. Five hours away in the newly infected town of El Dique, residents were collecting 100 bolívars from each household to hire a fumigator to come spray their homes. In the mine, where malaria tests are sometimes unavailable, miners said they had developed an exam of their own: Drink two bottles of beer. If a sharp pain is felt afterward in the liver, where the parasites reside, then the patient has malaria, the test goes. Health officials said the measure was futile. Still, Mr. Balocha, the former computer technician who works in the Albino Mine, lives by it. Miners call it an “artisanal test. ” He was sick once again, waiting for medicine at a   fence on the edge of a clinic. He recalled the words of his uncle, who phoned him a year ago when Mr. Balocha found his salary as a computer technician to be worthless in the city of Valencia. “There is money here,” said the uncle, who was mining then. “You have to know how to find it. ” Mr. Balocha started as a “palero,” a stone breaker, getting the smallest cut of the take. But it was still more than what his salary bought in the city after inflation had whittled it away, he said. He recalled the first time he got malaria, too, the “chills like you were lying down between two blocks of ice. ” “The first time you get malaria is the ugliest,” Mr. Balocha said. “You can’t control the tremors. You feel like you will die. You feel like you are a zombie. ” But he would become a millionaire here, he joked, and one day he would head to Europe  —   with a Latin American woman, he added  —   far from the mines, the malaria and the Union. He sighed, looking up at the sky. “In the mine, happiness is only temporary,” he said.'"}, "time": 1742561750.0565515}