{"duration": 0.07978081703186035, "input_args": {"text": "'EU NATO Secretary General Jens Stoltenberg speaks during a press conference at the organization’s headquarters in Brussels on October 26, 2016. (Photo by AFP) \\nNATO Secretary General Jens Stoltenberg has downplayed suggestions that EU military buildup might undermine the Western alliance as the bid to establish an independent European army appears to gain momentum. \\n\"I strongly believe it is absolutely possible to strengthen European defense without duplicating efforts by NATO,\" Stoltenberg said on Thursday, adding, “EU leaders have (also) conveyed that this is not about the EU doing collective defense, the EU building structures that would compete with NATO.\" \\nStoltenberg made the remarks following a meeting between European Union\\'s foreign policy chief, Federica Mogherini, and NATO defense ministers in Brussels. \\nMogherini, one of the strongest supporters of a joint European defense force, has drawn up a global strategy for the bloc, which says the 27-nation bloc should seek \"strategic autonomy\" to face multiple security threats, ranging from conventional to hybrid warfare, from the Ukraine crisis to Syria, from poverty in Africa to massive refugee flows. \\nThe proposal has sparked concerns that the bloc is seeking a more independent role. \\nMogherini on Thursday said the bloc does have civilian and military operations, such as in Africa or in the Mediterranean, and needs to improve command and control centers to run them. \\nShe, however, attempted to downplay concerns that the formation of an EU force could lead to the duplication of NATO functions, saying, \"But this can be done ... without any kind of overlapping or duplication with NATO.\" NATO Secretary General Jens Stoltenberg (R) chairs a NATO defense ministers\\' meeting, flanked by EU foreign policy chief, Federica Mogherini (2nd L), and NATO Deputy Secretary General Rose Gottemoeller (2nd R), at the NATO headquarters in Brussels on October 27, 2016. (Photo by AFP) \\nIn July, an EU strategy document said that the bloc should look to create greater military autonomy from NATO. It stated the EU could no longer rely on the alliance regarding various security issues and must instead develop an ability to “act autonomously if and when necessary.” \\nEuropean Commission President Jean-Claude Juncker was the first to call for the establishment of an EU army in March 2015. \\n\"A joint EU army would show the world that there would never again be a war between EU countries,” he said. \\nHis suggestion, however, received a cool response from NATO. Loading ...'"}, "time": 1742562924.3161733}