{"duration": 0.07068371772766113, "input_args": {"text": "'posted by Eddie The oddly shaped rubber shoes known as Crocs first hit the market in the early 2000’s, however they did not catch on in terms of popularity until almost 10 years later. Since then, they have become a popular alternative to flip-flops, sandals, indoor footwear, and in some cases, even shoes themselves. Although some people are attracted to their quirky appearance and even find them more comfortable than typical footwear, several studies are showing that purchasing Crocs and similar rubber clogs can have serious effects on your health. Crocs and Foot Health Since Crocs have become so vastly popular, especially among children and adolescents, many podiatrists have been consulted on the effect that they have on our foot health. Their answers were less than positive. According to one podiatrist, Dr. Meagan Leahy, Crocs are not a suitable replacement for proper footwear. \\n“Unfortunately, Crocs are not suitable for all-day use,” Leahy says. “These shoes do not adequately secure the heel. When the heel is unstable, toes tend to grip which can lead to tendinitis, worsening of toe deformities, nail problems, corns and calluses.” \\nOne of the most common forms of tendonitis that affects the foot is plantar fasciitis. This is when the plantar fascia, the tendon which connects your heel bone to your toes, becomes inflamed and weakened. This can cause excruciating pain and can also disable movement. For more info, watch this: \\nIn serious cases, plantar fasciitis can result in a bone spur. This is a build up of calcium on the heel which results in a protrusion of bone to develop on the spot where the tendon connects to the ankle. This can cause further pain and also requires incredibly invasive surgery to correct. Fake Crocs And Cancer According to a lab analysis conducted in Germany, rubber cogs similar to Crocs as well as knock-offs of Crocs contain highly cancerous substances that can actually be absorbed through contact with skin. German broadcasting institution Westdeutscher Rundfunk (WDR) sent in 10 different types of plastic cogs to a lab in Germany for analysis. According to the test, six out of the 10 shoes provided contained cancerous chemicals called polycyclic aromatic hydrocarbons (PAH). According to the 13th Report on Carcinogens (RoC), a public health document published by the National Toxicology Program, exposure to polycyclic aromatic hydrocarbons has been linked to an increased risk of developing lung, liver and skin cancers. Although the American brand Crocs did not contain any polycyclic aromatic hydrocarbons, the analysis found that it still contained substances that can cause skin irritation and allergic reactions. If you still insist on wearing Crocs, wear socks to reduce the amount of contact that the material has with your skin. Also make sure that you are actually buying Crocs, and not any of the cheap knock-offs that contain cancer-causing chemicals. It is also advised to smell the shoes before purchasing them. If they have a strong or sweet smell being emitted from them, this could mean that the shoes are releasing possibly harmful solvents. Sources:'"}, "time": 1742564358.0444236}