{"duration": 0.09883713722229004, "input_args": {"text": "'  Multiple NY Police Departments Under Investigation for Hosting Gay Sex Parties With Underage Boys Multiple NY Police Departments Under Investigation for Hosting Gay Sex Parties With Underage Boys Matt Agorist November 3, 2016 1 Comment \\nSchenectady, NY — A police officer’s suspension over an investigation into writing fraudulent checks has prompted a multi-agency investigation into alleged gay sex parties for police officers. While sex parties alone are not criminal, a source close to the investigation said the parties were attended by young boys who were not of legal age to drink or consent to having sex with adults. \\nSgt. Jonathan E. Moore, 35, of the Schenectady police department, has been suspended after he and his boyfriend, Anthony Aubin, 27, were caught at trying to use a fraudulent check to purchase a $92,000 Jaguar. Aubin was arrested on felony charges for attempting to use the check. \\nHowever, according to a report in the Times Union, the arrest of Aubin, who has a lengthy criminal record and was recently on parole, has triggered a much broader, multi-agency police investigation into allegations that gay officers may have hosted or taken part in sex parties — called “breeding parties” — that allegedly were attended by teenagers who were not of legal age to drink alcohol or consent to having sex with adults. \\nAside from the Schenectady police department investigation, the probe has spread to the Albany police department as well. As the Times reports, other departments may also become involved in the broader investigation, according to a person briefed on the matter but not authorized to comment publicly. \\n“I’m not really in a position to say anything about it at this point,” Albany police Chief Brendan Cox said Tuesday. “There is a case we are looking into but we are not in a position to even gauge whether or not there is any truth to what has been alleged.” \\nMoore also admitted to using the state-run criminal database for personal reasons to check the background of his boyfriend. \\nAccording to the report, Moore told police that he knew Aubin had a lengthy criminal record but had no idea the checks were fakes. The $92,000 check was purported to be from a Miami law office and the $15,000 check was from a fictitious company on Washington Avenue in Albany, reported the Times. \\nMoore told investigators that Aubin moved in with him several months ago and the couple was planning to make a lot of money because they had signed contracts with a Connecticut company called Bear Films to make gay porn movies. \\nIn a statement on Wednesday, Schenectady police Chief Eric Clifford said Moore’s involvement in the pornography industry may have violated departmental policies, but he did not mention whether or not the officer will face charges. \\nClifford said it’s “not appropriate to have him out on the street working for us.” \\nAfter Aubin was locked up, he apparently began rolling over on all his other connections in police departments. His allegations have sparked investigations into other officers who may have had unlawful sex with teenage boys. \\nPolice officers having sex with underage victims is, unfortunately, a fairly common practice. Police sexual misconduct is so common that more than 1,000 officers have had their licenses revoked in just the last six years for it — nearly half of them involve underage victims. \\nAccording to the report , around 1,000 policemen across the US had their licenses revoked and lost their jobs over the last six years on account of numerous sexual offenses that included rape and possession of child pornography. \\nThe probe involved examining records from 41 states to see how many police officers’ licenses were revoked in 2009-2014 and for which offenses. Police desertification data was not provided by nine states and the District of Columbia. The investigation included examining the records of state and local police, sheriff’s deputies, prison guards and school resource officers. However, no federal officers were included in the investigation, meaning that number is likely higher. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Follow @MattAgorist on Twitter and now on Steemit Share'"}, "time": 1742562163.7097836}