{"duration": 0.12038540840148926, "input_args": {"text": "'As a   bathroom break girl at the advertising agency BBDO in 1985, Susan Credle took over for receptionists when they left their desks. When she learned how to type quickly and accurately, she was promoted to secretary. In the decades since, she has become one of the most accomplished women in the industry, holding top executive positions at some of the most esteemed creative agencies. She has been behind numerous memorable campaigns, including the humanlike MM’s characters and Allstate’s Mayhem ads. But even today, there are male leaders in the industry who do not acknowledge her. At industry parties, people assume they should be talking to her husband, who is an architect. She tries not to show her emotions at work because when she does, she said, “I immediately am looked at as the crazy woman. ” “I still to this day, when I feel the blood boiling in me and I just want to let it all out, I cut it by 90 percent because I’m a woman,” she said. Women now make up almost 50 percent of those working in the advertising industry, including a relatively small number, like Ms. Credle, in top executive positions. Yet when a female employee of the J. Walter Thompson agency filed a lawsuit in March accusing the company’s chief executive of racist and sexist behavior, the accusations brought to the surface what women in the industry had talked about for years: that more than half a century after the “Mad Men” era, gender bias, while often unspoken or acknowledged, continues to affect how they are treated at work, whom they interact with and what positions they hold. Advertising is far from the only industry that has struggled with issues of sexist behavior and gender bias through the years. But in interviews with more than a dozen women, mostly executives, who work in advertising, many said they found it hard to believe how much their particular business still remained a white man’s world. Although some women said they had never personally experienced gender discrimination and referred to it as a thing of the past, many said they repeatedly felt ignored or dismissed by male colleagues and left out socially. They recalled times when they were the only woman in meetings with both   and clients. Some pointed to the ads themselves as examples of how the industry’s sexism manifested itself beyond office walls. “Yes, there is the rapey talk and the grabby hands, but it’s that subtle stuff that’s chronic and can be more damaging,” said Jean Batthany, the executive creative director at DDB Chicago. Nancy Hill, a longtime advertising executive who is now president and chief executive of the 4A’s, an industry trade group, said that men called her “young girl” all the time, though she has been working in the business for decades. “They don’t recognize that’s demeaning,” she said. Megan Pagliuca, the global chief executive of Omnicom’s Accuen agency, said sexism revealed itself in the prevalence of social events like golf outings and drinking events being used for business purposes, a sentiment echoed by several other women interviewed. Women, she said, feel pressure to learn to play golf or to generally act more like their male counterparts or risk missing out on establishing important relationships. “Do you try to conform and be like them rather than being yourself, or do you stay strong as who you are and know you are the best operator?” Ms. Pagliuca said. “A challenge for women is making that choice. ” Ms. Credle, who has been an executive at the agencies BBDO and Leo Burnett and is now the global chief creative officer for the agency FCB, said that the business meetings masquerading as social outings, like when male colleagues go out for steak dinners or watch a sports game together from a box suite, have at times made her feel like an outsider, even as she has become one of the industry’s most powerful creative executives. But even more damaging, Ms. Credle said, is when men ignore her. She recalled standing with two men while waiting to go onstage at an annual advertising conference in March when another man came off the stage. That man, who had just spoken about diversity in the industry, acknowledged the two men with her, but “didn’t bother to look at me,” she said. “I felt invisible. ” “There are times when I experienced things that I don’t think I would have experienced if I weren’t a woman,” she said. At the same time, however, she emphasized that many men in the industry had helped her succeed and that for her the bad experiences had been rare. Some women also said gender discrimination showed up when looking at the ads that agencies produce. Many ads portray stereotypical gender roles, they said, with mothers in the kitchen, for instance, and men driving cars. Several women noted that only 11 percent of creative directors are women, a statistic from the 3% Conference, which supports female creative leadership at agencies. “If all the advertising is being created through that dominant male lens and you look at what the result is, there’s a bias in that and there’s only one perspective,” Ms. Batthany of DDB said. There are also more blatant and aggressive expressions of sexism. Several women described frequent comments about their appearance.   percent of women in advertising said they had personally experienced gender discrimination, according to a survey by the 3% Conference.   percent said they had personally experienced or witnessed sexual harassment. In the lawsuit filed in March against Gustavo Martinez, the chief executive of J. Walter Thompson, the agency’s chief communications officer, Erin Johnson, accused him of subjecting employees “to an unending stream of racist and sexist comments as well as unwanted touching and other unlawful conduct. ” She also contended that Mr. Martinez, who has since resigned, made “numerous comments about rape” and, on multiple occasions, “grabbed Johnson by the throat and by the back of her neck. ” Mr. Martinez has denied the allegations against him. “There is a lot of sex and drugs and rock ’n’ roll in the business  —   there certainly was in those days,” said Rosemarie Ryan, a former   of J. Walter Thompson North America who now leads the agency Co:Collective, referring to her early career in the 1980s and 1990s. “I think there are still some remnants of that. ” For years, executives have talked about improving diversity and getting rid of gender bias in advertising, but many say progress has been too slow. “I think everybody thinks it’s everybody else’s problem,” said Bill Koenigsberg, founder and chief executive of Horizon Media. One reason, some executives said, is that there are currently other priorities in advertising, given the pressing challenges that stem from a broad shift in how people consume media. Others said women might be reluctant to call out sexist behavior. Several women said male executives became visibly uncomfortable and ended the conversation when the issue of gender and racial diversity was raised. At the annual advertising conference in March, Maurice Lévy chief executive of the ad giant Publicis said the accusations in the J. Walter Thompson lawsuit were “a   mistake” and not representative “of what is happening in our industry. ” The next day, however, Martin Sorrell, chief of WPP, which owns J. Walter Thompson, said “there is a problem” and “Maurice has a habit of ignoring the facts. ” Mr. Lévy tried to clarify his comments the following week in an internal memo, calling the allegations in the lawsuit “jaw dropping,” adding, “to such an extent that, in my opinion, they can only represent the unforgivable fault of one man, as opposed to an industrywide evil. ” Even some women acknowledged that it was difficult for them to address gender bias in the industry. Some of those interviewed declined to provide specifics about examples of gender bias they had seen or experienced because they wanted to protect relationships in the industry. Wendy Clark, the chief executive of DDB North America, said she had felt more subtle discrimination in her career, but acknowledged that, to rise through the ranks, she has blocked much of it out. “The truth is,” she said, “those of us who have made it through  —   you become impervious to it in some way. ”'"}, "time": 1742562156.0286343}