{"duration": 0.04858875274658203, "input_args": {"text": "'Pinterest \\nDemocrats have been caught stuffing absentee ballots with campaign material, in what must be a direct violation of federal law. \\nIt happened in Fairfax County, Virginia. When Jena Jones opened up her absentee ballot, she got more than she expected. Stuffed into the envelope was the actual ballot and several pieces of leftist campaign propaganda, WND reports : \\nJones, will be out of town on Election Day and requested an absentee ballot from the Virginia Department of Elections. She was surprised to what else came with her ballot. \\n“I found a letter from the governor of Virginia asking me to please vote Democrat and ‘help keep Virginia blue’ this year. Then I got a letter from the Fairfax County Democratic Committee, giving me a step-by-step, yes-and-no what I should vote for as far as the meal tax and all those other things on the ballot,” Jena explained to WND and Radio America. \\nThe step-by-step letter that Jones is described is called a “sample ballot” and it is handed out by campaign workers outside polling places (at a legal distance), telling people how to vote for one particular party or candidate. \\nThere was no material promoting any of the GOP candidates on the ballot or any information on the numerous proposals or propositions. Jones said she is not a registered Democrat and did not request the ballot from the party. \\nAlthough Jones is not a political junkie of any sort, the inclusion of fliers from Democrats but nothing from Republicans struck her as odd. \\n“I was a little confused as to why we didn’t get anything Republican at all, and I wasn’t sure why that was included in my ballot at all,” she said. \\nOn the back of the letter from McAuliffe were lengthy, glowing biographies of Hillary Clinton, Tim Kaine and her local congressman, Rep. Gerry Connolly. \\nHer husband, David, was serving as a witness to Jena’s vote. He was even more frustrated by all the pro-Democrat literature while no GOP materials were included. \\n“I also was a little befuddled because I figured that this would be a time that you wouldn’t want to encourage voters to go one way or the other,” David Jones said. “It’s just like when you walk into the precinct or the polls, they can’t be within a certain amount of feet from the voting booths, and I figure they shouldn’t be able to put a piece of paper in the envelope with your ballot.” \\nDavid was also surprised by the letter from the Governor (Democrat Terry McAuliffe) urging the to “keep Virginia blue” this year. \\n“If it was just a letter saying, ‘Hey we appreciate you voting. Every vote counts,’ that would make sense and I would totally back that. But when there’s a specific flier that says, ‘Hillary Clinton for President’ and ‘Tim Kaine for Vice President,’ laying out their platform, to me it was just biased. It was one side.” \\nHere are some images, courtesy WND, of the materials the the Jones’ received in their ballot. Isn’t this against federal law?'"}, "time": 1742563141.571198}