{"duration": 0.14035582542419434, "input_args": {"text": "'Bobby Hutcherson, one of the most admired and accomplished vibraphonists in jazz, died on Monday at his home in Montara, Calif. He was 75. Marshall Lamm, a spokesman for Mr. Hutcherson’s family, confirmed the death, saying Mr. Hutcherson had long been treated for emphysema. Mr. Hutcherson’s career took flight in the early 1960s, as jazz was slipping free of the complex harmonic and rhythmic designs of bebop. He was fluent in that language, but he was also one of the first to adapt his instrument to a freer postbop language, often playing chords with a pair of mallets in each hand. He released more than 40 albums and appeared on many more, including some regarded as classics, like “Out to Lunch,” by the alto saxophonist, flutist and bass clarinetist Eric Dolphy, and “Mode for Joe,” by the tenor saxophonist Joe Henderson. Both of those albums were a byproduct of Mr. Hutcherson’s close affiliation with Blue Note Records, from 1963 to 1977. He was part of a wave of young artists who defined the label’s forays into experimentalism, including the pianist Andrew Hill and the alto saxophonist Jackie McLean. But he also worked with   stalwarts like the tenor saxophonist Dexter Gordon, and he later delved into   and   grooves. Mr. Hutcherson had a clear, ringing sound, but his style was luminescent and coolly fluid. More than Milt Jackson or Lionel Hampton, his major predecessors on the vibraphone, he made an art out of resonating overtones and chiming decay. This coloristic range of sound, which he often used in the service of emotional expression, was one reason for the deep influence he left on stylistic inheritors like Joe Locke, Warren Wolf, Chris Dingman and Stefon Harris, who recently assessed him as “by far the most harmonically advanced person to ever play the vibraphone. ” Robert Hutcherson was born in Los Angeles on Jan. 17, 1941. His father, Eli, was a brick mason, and his mother, Esther, was a hairdresser. Growing up in a black community in Pasadena, Calif. Mr. Hutcherson was drawn to jazz partly by way of his older siblings: His brother, Teddy, had gone to high school with Mr. Gordon, and his sister, Peggy, was a singer who worked with the Gerald Wilson Orchestra. (She later toured and recorded with Ray Charles as a Raelette.) Mr. Hutcherson, who took piano lessons as a child, often described his transition to vibraphone as the result of an epiphany: Walking past a record store one day, he heard a recording of Milt Jackson and was hooked. A friend at school, the bassist Herbie Lewis, further encouraged his interest in the vibraphone, so Mr. Hutcherson saved up and bought one. He was promptly booked for a concert with Mr. Lewis’s band. “Well, I hit the first note,” he recalled of that performance in a 2014 interview with JazzTimes. But, he added, “from the second note on it was complete chaos. You never heard people boo and laugh like that. I was completely humiliated. But my mom was just smiling, and my father was saying, ‘See, I told you he should have been a bricklayer. ’” Mr. Hutcherson persevered, eventually working with musicians like Mr. Dolphy, whom he had first met when Mr. Dolphy was his sister’s boyfriend, and the tenor saxophonist and flutist Charles Lloyd. In 1962, he joined a band led by a pair of Count Basie sidemen, the tenor saxophonist Billy Mitchell and the trombonist Al Grey, and it brought him to New York City for a debut engagement at Birdland. The group broke up not long afterward, but Mr. Hutcherson stayed in New York, driving a taxicab for a living, his vibraphone stashed in the trunk. He was living in the Bronx and married to his high school sweetheart, the former Beth Buford, with whom he had a son, Barry  —   the inspiration for his   tune, the lilting modernist waltz “Little B’s Poem. ” Mr. Hutcherson caught a break when Mr. Lewis, his childhood friend, came to town and introduced him to the trombonist Grachan Moncur III, who in turn introduced him to Mr. McLean. “One Step Beyond,” an album by Mr. McLean released on Blue Note in 1963, featured Mr. Hutcherson’s vibraphone as the only chordal instrument. From that point on, he was busy. The first album he released as a leader was “Dialogue” (1965) featuring Mr. Hill, the trumpeter Freddie Hubbard and the saxophonist and flutist Sam Rivers. Among his notable subsequent albums was “ !” (1966) with Mr. Henderson and the pianist McCoy Tyner among his partners. He and Mr. Tyner would forge a close alliance. After being arrested for marijuana possession in Central Park in 1967, Mr. Hutcherson lost his cabaret card, required of any musician working in New York clubs. He returned to California and struck a rapport with the tenor saxophonist Harold Land. Among the recordings they made together was “Ummh,” a funk shuffle that became a crossover hit in 1970. (It was later sampled by the rapper Ice Cube.) In the early ’70s Mr. Hutcherson bought an acre of land along the coast in Montara, where he built a house. He lived there with his wife, the former Rosemary Zuniga, whom he married in 1972. She survives him, along with their son, Teddy, a marketing production manager for the organization SFJazz his son Barry, a jazz drummer and two grandchildren. After his tenure on Blue Note, Mr. Hutcherson released albums on Columbia, Landmark and other labels, working with Mr. Tyner, the tenor saxophonist Sonny Rollins and  —   onscreen, in the 1986 Bertrand Tavernier film “Round Midnight”  —   with Mr. Gordon and the pianist Herbie Hancock. From 2004 to 2007, Mr. Hutcherson toured with the first edition of the SFJazz Collective, an ensemble devoted equally to jazz repertory and the creation of new music. He was named a National Endowment for the Arts Jazz Master in 2010. After releasing a series of albums on the European label Kind of Blue, he returned to Blue Note in 2014 to release a   effort, “Enjoy the View,” with the alto saxophonist David Sanborn and other collaborators. Speaking in recent years, Mr. Hutcherson was fond of citing a bit of insight from an old friend. “Eric Dolphy said music is like the wind,” he told The San Francisco Chronicle in 2012. “You don’t know where it came from, and you don’t know where it went. You can’t control it. All you can do is get inside the sphere of it and be swept away. ”'"}, "time": 1742561678.3336868}