{"duration": 0.12701773643493652, "input_args": {"text": "'This post was originally published on this site \\nEvgeny Demin and Elena Demina moved from the Krasnodar Territory in southern Russia to Moscow with a small idea and big ambitions. In 2000, when they were not yet 25 years old, they founded SPLAT, a company that today supplies personal care and household chemical products to 45 countries around the world. \\n“In the beginning, the company specialized in the production of biologically active additives and cosmetics based on Spirulina platensis seaweed — thus the company name,” explains Evgeny Demin. \\nThey quickly decided to target their efforts in another direction: on the production of next-generation toothpaste. \\n“From the very start, we agreed to create the best toothpaste in the world, so that it would surpass all expectations,” he said. \\nEvgeny Demin and Elena Demina / Source: Press photo \\nThe couple first rented a factory for their operations near Moscow and in 2009 they opened their own plant 300 miles northwest of the Russian capital in the Novgorod Region. Today it employs more than 350 people. A total of 700 people work for the company, including in sales and marketing offices abroad. \\nThe company has opened a subsidiary and hired a local team in China and is now looking forward to working with its Chinese partners, according to SPLAT’s press service. The company’s premium products are particularly popular in Germany and SPLAT has also started to sell its products in France. The company currently owns more than 10 Russian and foreign patents. The right segment \\nFrom the very beginning SPLAT toothpaste was priced about twice that of its supermarket rivals. Entering the premium segment, where there were practically no competitors, was one of the factors of the brand’s success, says Alexander Yeremenko, managing director of the BrandLab marketing agency. \\nAccording to Yeremenko when SPLAT debuted, two major international players, Procter&Gamble and Colgate, had claimed the middle segment of the Russian market, while the lower end was dominated by Russian producers selling very cheap toothpaste. \\n“In the high-price segment, besides LACALUT, there were no important players,” Yeremenko said. \\nSource: Press photo \\nSome of SPLAT’s exclusive offerings include black toothpaste made from Karelian coal and golden toothpaste featuring extracts of diamond and colloidal gold. SPLAT’s scientific laboratory and R&D center in Moscow are in charge of developing the toothpaste’s unique components. \\nIn 2008 the company began exporting its products and by 2015 foreign sales made up 17 percent of its revenue. One of its most successful foreign markets is Turkey, where SPLAT was able to sign an exclusive contract with one of the country’s leading perfume and cosmetics chains. \\nThe company has opened a subsidiary and hired a local team in China and is now looking forward to working with its Chinese partners, according to SPLAT’s press service. The company’s premium products are particularly popular in Germany and SPLAT has also started to sell its products in France. The company currently owns more than 10 Russian and foreign patents. A personal approach to customer loyalty \\nThe company has not divulged any financial indicators, but in value terms SPLAT holds 9.7 percent of the Russian market and in terms of sales it has a 14.7-percent market share, says Timur Nigmatullin, an analyst at Finam Holding. \\nNigmatullin attributes SPLAT’s success in part to its unusual marketing strategy. The company does not employ TV advertising on principle and focuses its energies on repeat sales to loyal customers. \\nYeremenko believes that SPLAT’s marketing efforts were appropriate for a product in the high-end segment of the market where consumers value innovation and are ready to pay for it. \\n“SPLAT did not have money for promotion, which is why all efforts were directed at achieving a high-quality and innovative product,” Yeremenko said, adding that the firm’s unique offerings, such as being the first black toothpaste or having unusual taste and components are all elements of marketing, which requires constant research and experimentation. \\nThe company also takes a personal approach to encouraging brand loyalty. Each SPLAT toothpaste package contains a letter from Evgeny Demin himself, the firm’s general director. At the end of each letter, he provides his personal email address noting that he responds to all messages himself. \\n“The director’s letters in the packages create the impression of the producer’s responsibility to the customer; [they] guarantee a quality approach and the company’s excellent result on the market,” Yeremenko said. Not just toothpaste \\nToday SPLAT has diversified and it produces more than 200 different products from its 50,000 sq. ft. plant in the Novgorod Region. The company’s offerings include toothpastes, brushes, foams and mouthwashes, the BioMio ecological line of housekeeping products, the organic LALLUM Baby line of natural cosmetics for children and mothers and the HEYA series of natural shampoos and conditioners. \\nSource: Press photo \\nHEYA is one of SPLAT’s latest developments and is one of co-founder Elena Demina’s proudest accomplishments. \\n“The idea of creating products for health and hair beauty that would be just as unique and effective as all the other SPLAT products, came to us a long time ago,” she said. “Our team spent more than five years working on it.” \\nThe market for hair care products is highly competitive, but SPLAT’s offerings, made exclusively from natural ingredients without silicon or parabens, are unique. The company took its time developing the HEYA series components, but Demina says she is very happy with the result. \\n“We do not compete with other hair care producers because, all modesty aside, we believe that our products are unique and unrepeatable,” she said. \\nSource: Press photo \\nNigmatullin considers the Russian market robust and large enough to accommodate new products, despite the unfavorable economic situation and the difficult investment climate. \\n“The SPLAT phenomenon is not the only one,” Nigmatullin said. “There are many other examples: UAZ, Ural motorcycles, a long list of medicine produced in local plants, confectionery and so on.” \\nAccording to Yeremenko SPLAT’s success can be attributed to hard work and planning. \\n“Actually, SPLAT’s story is not as magical as it seems,” Yeremenko said. “It is proof of a solid marketing approach, which basically any producer can adopt.” \\nIn his view, SPLAT’s founders demonstrated sound judgment and perseverance in developing their idea. \\n“The problem with most Russian companies is not the lack of ideas, but that they don’t know where they’re going,” he said. “But SPLAT had a strategy and most importantly, it patiently implemented it.” Subscribe to get the hand picked best stories every week Related '"}, "time": 1742563525.5451386}