{"duration": 0.12649273872375488, "input_args": {"text": "'TOKYO  —   The Japanese have acknowledged that their emperor is not a god and he has been stripped of all political power, but the nation still views its monarch as so central to the sense of identity that he is not permitted to resign. Now, Emperor Akihito is suggesting that his people let him retire. He is 82 years old. He has had cancer. He has had surgery. So, in a uniquely Japanese moment on Monday, he went on television to hint at his desire for Parliament to change the law so he can give the job to his son. But it is freighted. The emperor represents a postwar Japan that is committed to pacifism. The current government wants to loosen the reins on the military, and the prime minister, Shinzo Abe, is politically powerful. If Emperor Akihito steps down, will Japan lose a check on the government’s drive to rewrite the past, to discard its lessons and taboos? Will his son, Crown Prince Naruhito, also a pacifist, have the standing of his father? Japan is a constitutional monarchy. It is a liberal democracy. It is, in many ways, a deeply conservative country that clings to tradition. Its monarchy  —   the Chrysanthemum Throne  —   is the oldest in the world, stretching back to antiquity. Emperor Akihito’s family has held it almost 2, 700 years, according to the customary, if   genealogy. If he resigns, it would be the biggest transformation of the monarchy since World War II. Change does not come easily in Japan, and now the government faces a conundrum: It will be criticized if it allows the transition, or blocks it. Crown Prince Naruhito, 56, shares his father’s quiet demeanor and, by all accounts, his commitment to keeping the monarchy apolitical. The prince has repeatedly commended the pacifist Constitution, written by the American occupiers in 1947. It is a delicate moment. If the government amends the law governing imperial succession in Parliament, concern may grow about its influence over the imperial household, analysts said. “People both on the right and left would be cautious about making sure this process doesn’t weaken the institution and therefore open up the succession to political influence,” said Sheila A. Smith, a Japan expert at the Council on Foreign Relations. But dragging its feet on the emperor’s wishes would anger many Japanese. “This is an aging country, and there are going to be a lot of people sympathetic to the emperor’s wanting a comfortable retirement,” said Tobias Harris of Teneo Intelligence, a political risk consulting firm. Opinion surveys conducted by the Japanese news media suggest that the public overwhelmingly supports Emperor Akihito’s wishes to step down. As many as 85 percent of respondents say they favor amending the Imperial Household Law to allow it. “We speak respectfully about the emperor, but arguably we use him like a slave,” said Daisuke Kodaka, 34, an employee at a cosmetics company in Tokyo. “He’s our symbol, but as a person he doesn’t have human rights. We should recognize his rights. ” Amending the law could also revive a contentious issue: the debate over allowing a woman to be the monarch. Only men can inherit the throne, a provision that is increasingly in dispute. A decade ago, during a debate about whether the law should be changed to open the way for female monarchs, conservatives in Mr. Abe’s   Liberal Democratic Party were firmly opposed. Prince Naruhito has a daughter, and his younger brother has two daughters and a son, Prince Hisahito, the only male in the youngest royal generation. Prince Hisahito’s birth, in 2006, quieted the debate about female monarchs, at least for the time being. But with so few males in the family, experts say the succession is far from secure for the future. Mr. Abe’s government has embraced the idea of female empowerment in other areas, notably the workplace, but few think it is ready to extend the concept to the monarchy. “This opens other cans of worms,” said Kenneth Ruoff, the director of the Center for Japanese Studies at Portland State University and the author of “The People’s Emperor,” a history of the postwar Japanese monarchy. Though his words were characteristically vague  —   he discussed his age, his rigorous daily schedule and what he called his increasing physical limitations  —   the message was unmistakable. “When I consider that my fitness level is gradually declining, I am worried that it may become difficult for me to carry out my duties as the symbol of the state with my whole being as I have done until now,” Emperor Akihito said in a prerecorded address that lasted about 10 minutes and was broadcast on Japanese television networks. Mr. Abe, in a short response, suggested that his government was open to changing the law, though he stopped short of making a specific commitment to do so. “Considering His Majesty’s age, the burden of his official duties and his anxieties, we must think carefully about what can be done,” Mr. Abe said. Japanese emperors define eras in the country. Its unique calendar is based on their reigns: 2016 is expressed as Emperor Akihito’s 28th year on the throne, and when his successor takes over, the date will reset to Year One. Emperor Akihito’s father, Hirohito, died in 1989  —   Year 64 of his reign  —   as both the Cold War and Japan’s economic boom years were drawing to a close, intensifying the sense of a historical shift. After World War II, Hirohito stunned his subjects by declaring that he was not a god, overturning decades of government propaganda and centuries of loosely held tradition. The new Constitution relegated the monarchy to a purely ceremonial role. “Historically, it was extremely common for emperors to abdicate,” said Takeshi Hara, an authority on the imperial family at the Open University of Japan. More than half of Japan’s monarchs have vacated the throne, often for quiet retirement at Buddhist monasteries. Only in the 19th century, when Japan’s leaders created the cult of emperor worship, did stepping down become impossible. Emperor Akihito maintains an often punishing schedule, despite treatment for prostate cancer in 2003 and heart surgery in 2012. He and his wife, Empress Michiko  —   the first commoner to marry into the imperial family  —   have become consolers in chief for victims of natural disasters, like the earthquake and tsunami that devastated parts of northern Japan in 2011. In his address, Emperor Akihito referred several times to the postwar Constitution and the symbolic nature of the modern monarchy. He said he wanted to secure that monarchy for the future “in the midst of a rapidly aging society” and “in a nation and in a world which are constantly changing. ” Though he did not use the word “abdication,” he made specific arguments for allowing it. Under existing law, the crown prince could serve as regent if his father became too ill, standing in for the emperor in all but name. But Emperor Akihito indicated he did not wish to be a monarch who “continues to be the emperor till the end of his life, even though he is unable to fully carry out his duties. ” He alluded to the last imperial transition nearly three decades ago. His father had intestinal cancer during the final years of his life, and his slow, painful decline was a focus of intense attention from the public and the news media. Emperor Akihito said he wanted to avoid a situation in which “society comes to a standstill” before his death, and the elaborate funeral rites distract from the enthronement of his heir. Prince Naruhito “represents continuity” with Emperor Akihito in terms of personality and priorities, Professor Ruoff said. As his father did, he has taken up social causes, notably access to clean water in poor countries. Professor Ruoff said Emperor Akihito’s biggest achievement had been to focus attention on social welfare causes. When Japan hosted the Summer Olympics in 1964, Emperor Akihito became the patron of the   Paralympics. At the time, people with disabilities were often shunned and stigmatized in Japan. “Akihito and Michiko have spent a tremendous amount of time leveraging their prestige on behalf of the least privileged members of Japanese society,” Professor Ruoff said. “I wouldn’t go so far as to say they are the conscience of the nation, but they do draw attention to these issues. ”'"}, "time": 1742562008.3707087}