{"duration": 0.06333088874816895, "input_args": {"text": "'Welcome to Our Picks, a guide to the best stuff to read, watch and listen to from around the internet. We know you don’t want to read only political news, so we’re collecting great   articles, podcasts, videos and other web treasures you might like when you need a break. And yes, we’re also tooting our own horn here. We’ll share can’  Times stories from the week and surface some gems you might have overlooked. We want to hear from you! Send us feedback about our selections to ourpicks@nytimes. com. • “If the girls play, this will be the end of your season. You won’t play in the playoffs. ” This was the ultimatum posed to a coed   basketball team on Friday night before the penultimate game of its season. The team members’ response was swift and unanimous: They would sacrifice their record to maintain team unity. Squad goals, indeed. [NJ. com] ______ • The heart shape may have been inspired by the seed pods of an ancient,   plant known as Silphium. In addition to treating fevers, corns and stomach aches, the plant may also have been used as a contraceptive. Nothing more romantic than   birth control. [Atlas Obscura] ______ • Dreaming of taking a vacation to some place very far away? People have been thinking about how to make hotels in space a reality since the Lunar Hilton was proposed in 1967. But as this brief history points out, you may want to hold off on that reservation until astronomical pipe dreams are replaced with actual pipes. [The Outline] ______ • Rhonda McCoy is the most unlikely of heroes. Ms. McCoy, the food service director for the public schools of Cabell County, W. Va. is a local person who figured out how to do what the celebrity chef and     Jamie Oliver could not: feed tasty, nutritious food to the children of one of America’s unhealthiest cities. [Huffington Post Highline] ______ • Consider it a story of rehabilitation. Ken Lowson was the “most infamous ticket scalper of all time,” using bots to buy and sell concert tickets at marked up prices. After his arrest in 2010, however, Mr. Lowson devoted himself to fighting the industry he once pioneered to make sure that real, human fans got the first opportunity to buy tickets to their favorite bands’ shows. [Motherboard] ______ • Happy Valentine’s Day! We asked New York Today readers to share their experiences with subway romance, and we were tickled to hear about so many encounters  —   on enough train lines to cover the alphabet  —   that led to marriage. Here are a handful of those stories. ______ • “I had a permanent smile on my face. I felt like I belonged there. ” Those are the words of Joe Maldonado, 9, on his first meeting as a member of the Maplewood Cub Scouts in New Jersey. He became one of the first transgender children to join the organization after the Boy Scouts of America reversed its policy of more than a century on Jan. 30, accepting members based on the gender listed on their application. ______ • James Lowell Gibbs Jr. was a graduate student at Harvard and the school’s first   resident tutor. Jewelle Taylor Gibbs was a senior at Radcliffe and the only black student in her class. They were married in 1956 and became one of the earliest   couples to appear in The New York Times’s wedding announcements. We caught up with them in our continuing Committed series. ______ • Dog break: Marvel up close at the wrinkles of Glitter the Chinese   stare into the eyes of Duo the Australian shepherd, or see the Westminster Dog Show through the eyes of a pup in our 360 video. (Unfortunately  —   or fortunately  —   you’ll just have to imagine touching these dogs that “feel like ‘warm bologna’. ”) ______ • Let this    cyclist be an inspiration to us all. And this    too: ______ ______ • Beautiful and comforting in a “ ’  ” kind of way, these photographs of ice fishermen covered in single sheets of plastic are worth a scroll. [The Calvert Journal] ______ • In 2012, John Collins constructed a paper airplane that flew a   226 feet. Now, you can fold one of your own   airplanes and impress your friends and family. Just watch this   video released by Harvard, and, remember, it’s all in the wrist. [Harvard Gazette via Gizmodo] ______ • While you’re waiting for your date tonight or lounging at home alone, you should listen to this   episode of the “Mortified” podcast. In it, a man reads a humorously   love letter he wrote as a teen. It will make you blush with secondhand embarrassment and feel lucky that  —   whatever your relationship status is this Valentine’s Day  —   you didn’t write this note. [“Tom: My Funny Valentine” episode on SoundCloud, iTunes ] ______ Want Our Picks delivered to your inbox? Sign up  for the What We’re Reading newsletter, a   email featuring great stories from around the web selected by members of the New York Times staff.'"}, "time": 1742563239.8731983}