{"duration": 0.14625144004821777, "input_args": {"text": "'Breitbart News head copy editor Adrienne Ross published two books on April 17,  Push Your Way to Purpose: How to Get from Where You Are to Where You’re Meant to Be and #AuntAlma Unleashed: Old, Bold, and Out of Control. Below is an excerpt from Push Your Way to Purpose.  Purpose consumes me. It always has. Who are you? Why are you? What will you? I began contemplating those questions when I was a young girl sitting in my bedroom and staring at pictures of music and television icons taped to my wall. But it started long before that. I entered the world with a mandate on my life. It was spoken. It was so. But I didn’t know.   I always had a feeling that something larger was calling me, though, which made little sense, considering that I lived in rather ordinary surroundings. The projects of the Bronx don’t exactly conjure up images of greatness. Later, after I moved to Long Island, a bright future may have seemed more likely to the onlooker —  like I was getting closer to the possibility of greatness, but even as I daydreamed, there was a nagging longing for more. But how would I make it happen? Isn’t that the question everyone asks? If you think not, think again. By 11, children have already begun wondering what their purpose is. By 40, adults have begun wondering if they missed theirs. We’re all consumed with purpose. Your neighbors are. Your   are. You are. We may not recognize it, but it’s there —  in the words we speak, the decisions we make, even the friends we keep. Everything points back to purpose and our longing for it.  What are the odds that we will fulfill our purpose, though? The answer has everything to do with identity, being able to recognize who we truly are. Unfortunately, many never come to this revelation. As a result, they live beneath themselves. Even those seemingly on top of the world struggle with identity.   I am writing this book because I have a message to share, one that will help you understand that there’s more waiting —  for you. No matter how low you’ve fallen or how high you’ve climbed, you’re marked for more.  This isn’t one of those name it, claim it, blab it, grab it, sprinkle a little dust, and you can have it   books meant to pump you up with hot air. Those books do pump you up, right before dropping you —  on your head. This book doesn’t tell you that reaching the place you were meant to be is    easy. In fact, it tells you the opposite. Some of it is difficult, but all of it is doable. My experiences provide keys to unlock the doors to your destiny and introduce you to   principles. My book is called Push Your Way to Purpose for a reason. Let’s just say the title also has a purpose. “Push” is a verb. Verbs are action words. You have to become a verb to grasp what the book’s subtitle promises to teach you: How to Get from Where You Are to Where You’re Meant to Be.  Nobody wants to push anymore. We want everything to be easy. But easy doesn’t bring us to destiny. I don’t believe it was supposed to be as hard as we have made it, though. God created us with basic instructions: BE. But “but” got in the way. We “but”  our way out of “be,” making excuses for being everything other than our best, and we made messes along the way. Some messes look like successes, while other messes can’t hide. Some people are so far down they can’t even imagine up. But most of the people we encounter are just your ordinary,      people. They’re not at rock bottom, and they’re not soaring on the clouds. They’re average, working, normal people. They’re parents, teachers, students, friends. They’re community members you see in the supermarket. They run for elected office. They change diapers. They’re you. They’re me.   So we’re in this together. We each have a purpose, and we can discover it, then fulfill it. It will require effort, a willingness never to settle for less than who we are meant to be. It may also require swallowing our egos if we think we have it all together and embracing our potential if we think we have nothing together. Wherever we sit on that spectrum, let us get up, raise our expectations, believe for more, and push our way to purpose. It’s time. “Name her Adrienne because she’s going to be a schoolteacher. ” I’ve shared this story more times than I can count, and for good reason: by the time I’m done telling the story, it always garners the desired response. What is that story, and what is the response? That’s the purpose of this chapter. It’s a perfect place to start because it sets the stage for the focus of this book.  Everyone wants to be successful. Everyone wants to believe that she was, in fact, born to be successful, that the   adage is true for her life: “The sky is the limit. ” Some would bet the farm —  or the   —  on it. It sounds good, doesn’t it? But it’s not true, or at least it’s not necessarily true. Like most things, it must be made to be true. You have to grab it and make it true in your life. The sky very well may be the limit, but so may the floor. It all depends on the level of your reach, the things you’ve chosen to embrace, the relationships you have —  and have not —  fostered. All these and more figure into your limit. You may be one of those whose life seems to be without limits, or you may be one who seemingly cannot catch a break. It could go either way because while there are circumstances that are beyond our control and    sometimes just happens, very often, the thing that happens to us is us.  One thing influencing our level of success is what we hear. When I say “hear,” I mean “listen to. ” Many words bump into my ear in the course of a day, but I don’t feed off of them all. There’s a huge difference between what I hear well enough to repeat and what I listen to and choose to eat —  to digest. I decide. And it makes all the difference in the world. Adrienne Ross is an author, editor, columnist, speaker, and former teacher and coach. She owns Adrienne Ross Communications and speaks at schools, churches, political events, and national and international service organization conferences. Ross’s first book is #AuntAlma: Raisin’ a Little Hell Heaven on Earth.'"}, "time": 1742562186.9648075}