{"duration": 0.1201028823852539, "input_args": {"text": "'By his calculation, Jonathan Valena, a tattoo artist who goes by the name JonBoy, has given more than 20, 000 permanent souvenirs. The one that changed his life was inked on June 16, 2015. On that day, Mr. Valena placed a white dot on a woman’s middle finger. It took him about a second. “It was that little white dot that blew things up,” Mr. Valena, 36, said recently. “The phone started ringing off the hook. Talk about God’s grace. ” Mr. Valena once thought he had to choose between his love for tattoos and his love of God. But in this case, his good fortune may have more to do with another   force in the universe: the   family. The finger that Mr. Valena tattooed belonged to Kendall Jenner, a model and younger sister of Kim Kardashian. One Instagram post later, he found himself hailed as the latest cool tattooer, a Dr. Woo of the East Coast, a Sailor Jerry for the young Hollywood and fashion crowd. In the last year, he’s put a tiny cross near Justin Bieber’s left eye, the letters PR and AY on the hands of the model Hailey Baldwin and “Janette Duke” on the   flesh of Chloë Grace Moretz, an actress who wanted to honor her grandmother. His trademark style is     tattooing, what his fans simply call tiny tattoos: hearts and flowers and city skylines etched in black ink and shrunken to emoji size the names of loved ones and inspirational mantras rendered in his squiggly, miniature cursive. Many tattoo artists don’t like doing little tattoos because they are difficult to apply and can rub away. But Mr. Valena, sensing an attractive market, has made them his specialty. He is a favorite of models and actresses, who appreciate the delicacy and   of his work. “I don’t want anything big on me,” said Sofia Richie, a model. “I’m shooting a lot. It’s important that it’s something I can hide. ” She has five tattoos by JonBoy, including her brother’s initials, the word “clarity” on her neck and the numerals 13:4, a reference to her favorite Bible verse, in First Corinthians. Ms. Richie, who described herself as “not the kind of person to have tattoos,” said that Mr. Valena’s etchings are nevertheless feminine and artistic, and that he’s a gentleman. “The first time I got tattooed by him we hung out for hours,” she said. “He made it an easy process where I felt relaxed. ” Like all newly successful people in Manhattan, Mr. Valena is on everyone’s invitation list. There he was with Coco Rocha and the Misshapes at a party celebrating Jeremy Scott’s collaboration with Google for its Pixel smartphone. And brands like Schott NYC and Coach have hired him to tattoo at store events and for social media campaigns. In recent weeks, he’s taken his needles and ink on work trips to Los Angeles and South Korea. “I feel blessed,” Mr. Valena said. “There’s a lot of people out there that can do the same thing I do, even better. It just so happens that I got to tattoo some famous people. ” Still, for all his accomplishments, Mr. Valena said at times he has struggled with his professional and life choices. Tattoo artist to the stars was not his original calling. He planned to join the ministry. “There’s almost that guilt of, you were going to be a youth pastor,” Mr. Valena said. “I fell away from church, and I really just wrestled with it. Just feeling, like, ‘Man, where am I? ’” On a recent weekday afternoon, Mr. Valena was at his work station at West 4 Tattoo, the Greenwich Village shop that is his base. Loud club music thumped as customers waited in chairs by the front desk. The place resembled a thousand other tattoo parlors, except for the wall of photos of Mr. Valena posing with celebrity clients, a paper collage of his Instagram account. Mr. Valena, who described himself as “a little Filipino guy,” sat   on a chair. He wore black shorts and a black   that revealed heavily inked arms and legs, and a black trucker hat that made him a few inches taller. His tattooed hands were weighted by two fistfuls of chunky gold rings by Gucci and Versace. A fluffy Pomeranian he named Gucci and is raising with his girlfriend and manager, Lauren Ledford, yipped at his feet. “I’ve always loved fashion,” Mr. Valena said. “And now living in New York City and being part of it is just a dream. ” On a break between appointments, Mr. Valena reflected earnestly on his life’s journey so far. There was a      aspect to his storytelling, an emphasis on redemptive moments. The first came when Mr. Valena, who was raised outside Chicago in a divorced family, said he had a   drug overdose at 17. He embraced Christianity and enrolled at a Bible college in Rhode Island. Two years later, he found himself working as a youth pastor and church coffeehouse barista in Decorah, Iowa, population 8, 000. “It was a college town, there were a handful of things to do, but it got old,” Mr. Valena said. He had a few tattoos already, and was interested in the art form. He started hanging out at a local parlor, Valhalla Tattoo and Piercing, run by a   Irish biker and   who taught him the ropes. “Yes, I had to start by doing grapefruits,” Mr. Valena said. “But the feeling you get when you have that vibrating piece of machinery in your hand and you’re creating something permanent on someone’s body  —   it started there. ” Some church leaders thought he was doing the devil’s work. There was pressure put on him to quit tattooing, he said. Instead, Mr. Valena quit the church and honed his craft at biker rallies throughout the Midwest. In short order, he followed a girl to Wisconsin and then Minneapolis, married, fathered a son, became a successful local tattooer, grew restless, had an affair, got divorced and made an impulsive leap with his young mistress to New York City, where he had trouble acclimating and became “the insecure JonBoy who is rarely tattooing because I had no clientele out here. ” After an altercation in the subway with a romantic rival, he was arrested and jailed, Mr. Valena said, prompting a dark night of the soul. “I felt, man, I failed at everything,” he said. “I failed my marriage. I failed my family. I’m failing this relationship here. I’m failing in New York City. I failed becoming a youth pastor. I felt lost. ” After being released from jail, he remembered being told about Hillsong Church, a global megachurch popular with celebrities like Mr. Bieber. It was through Hillsong that his life turned around, Mr. Valena said. He began inking the church’s hipster leadership, who approved of tattoos. And he met Ms. Baldwin, the daughter of the actor Stephen Baldwin and a Hillsong congregant, who asked Mr. Valena to give her a tattoo and recommended him to Kendall Jenner. A few years ago, Mr. Valena was so desperate for work that he took a job tattooing at a nightclub in the meatpacking district while drunk people cavorted around him. Now he sets his own schedule, sees as many as eight clients a day and charges a minimum of $300 an hour. In the Kardashian kingdom, Mr. Valena is pretty much official court scribe, having tattooed Kendall Jenner again (“meow” on her inner lip) as well as her younger sister, Kylie Jenner, repeatedly (most recently a miniature red “M” on her pinkie) and a family friend, Jonathan Cheban (“Foodgod” on his forearm). He has cemented his relationships with celebrities by asking many of them to tattoo him, which he likened to “getting their autograph, but not in a crazy fan way. ” Mr. Valena held out the crowded canvas of his arms, showing the spot where Kylie Jenner inked a tiny K with a crown and Ireland Baldwin tattooed a   “L. A. ” “And Chloë Moretz  —   she’s, like, ‘I’m really good at doing stick figures with big penises,’” Mr. Valena added. He shrugged. “I give them liberty. When Hailey or Kylie come in here, I want to remember those times. ” Fridays are Mr. Valena’s day off, but an actress and model named Sabina Gadecki was in New York for a movie premiere and wanted a tattoo. So Mr. Valena, dressed in black and carrying Gucci the Pomeranian, rolled into the shop from his East Village apartment around 2 p. m. Soon Ms. Gadecki arrived with hugs, accompanied by her parents and her    boyfriend. She wanted a tiny “R,” her father’s first initial, behind her ear, which would be her third JonBoy tattoo (like Happy Meal trinkets, tiny tattoos encourage a collection). Ms. Gadecki, who also belongs to Hillsong, was referred to Mr. Valena by a friend after an unpleasant experience with another tattoo artist. “I felt like they didn’t care,” she said. “It was just, ‘Yeah, let’s do it.’ JonBoy listened. He realized it’s important to me. ” After the letter design was agreed to, Mr. Valena began placing the stencil onto Ms. Gadecki’s skin. He stopped abruptly because he wasn’t feeling the music. “I need a new song!” he yelled, then ran to the front desk, cued up a track by Mr. Bieber and returned to his work, singing. Ms. Gadecki sat on the tattoo chair while her entourage watched. The actual tattooing took Mr. Valena exactly six minutes. Posing Ms. Gadecki afterward for his Instagram account took longer. “I never thought it would be like this,” Mr. Valena said. “I never thought putting a little white dot on Kendall Jenner would come to this. I’m living the dream. ” And what of his planned career as a youth pastor? Is his soul still divided? He answered, sounding at peace, “You have a path and a journey, and your life is going to take you where it’s supposed to take you. ”'"}, "time": 1742628389.704604}