{"duration": 0.14688634872436523, "input_args": {"text": "'There is a new safe space for liberals in the age of President Trump: the television set.   MSNBC, after flailing at the end of the Obama years, has edged CNN in prime time. Stephen Colbert’s openly   “Late Show” is beating Jimmy Fallon’s “Tonight” for the first time. Bill Maher’s HBO flock has grown nearly 50 percent since last year’s presidential primaries, and “The Daily Show” has registered its best ratings since Jon Stewart left in 2015. Traditional television, a medium considered so last century, has watched audiences drift away for the better part of a decade. Now rattled liberals are surging back, seeking catharsis, solidarity and relief. “When Obama was in office, I felt like things were going O. K.,” Jerry Brumleve, 58, a retiree from Louisville, Ky. said last week as he stood in line for a “Daily Show” taping in Manhattan. These days, he is a newfound devotee of Rachel Maddow of MSNBC  —   “She’s always talking about the Russians!” his wife, Yvonne, chimed in  —   and believes Mr. Stewart’s successor, Trevor Noah, has finally “hit his stride. ” “With Trump in office, I really feel the need to stay more informed,” Mr. Brumleve added. “You just don’t know what the hell this guy is going to do. ” Many others feel the same. Last month, Ms. Maddow was watched by more viewers than at any time in the   run of her show. The turbocharged ratings are a surprise even to    television executives, who had been bracing for a plunge in viewership after the excitement of the presidential campaign. Before election night, networks were scrambling to generate new hits and digital offshoots that could stanch the bleeding. Instead, the old analog favorites are in, with   franchises like “Saturday Night Live” drawing its highest Nielsen numbers in 24 years. Despite a dizzying array of new media choices, viewers are opting for television’s mass gathering spots, seeking the kind of shared experience that can validate and reassure. “There’s definitely a sense of we’   ” Mr. Noah said in an interview, noting that Mr. Trump’s election had infused his show with a new sense of purpose. “People are finding a space here in saying, ‘Oh, I’m not crazy  —   somebody else is also outraged by this,’” Mr. Noah said. Uncertainty and tumult have long driven ratings, and the interest is bipartisan. Fox News, already cable’s   network, is having another big year: In February, its   viewership was up another 31 percent from a year ago.   of the 48 million people who watched Mr. Trump’s address to Congress two weeks ago did so on Fox. But MSNBC’s growth has outpaced its rivals  —   its   audience in February was up 55 percent from a year ago  —   a striking turnaround for a channel once considered the   of cable news. The network has beaten CNN in total weekday   viewers for six of the last seven months. (CNN still outranks MSNBC in prime time among the   audience of adults ages 25 to 54.) At MSNBC headquarters in New York on a recent weeknight, the mood was energized. Ms. Maddow sprinted down a   hallway minutes before her 9 o’clock airtime the anchor was late for makeup after   a   monologue on Russian meddling in the election. (Generous by cable news standards, the segment still spilled over its allotted time.) It was a day after a Maddow milestone: Her Wednesday show outranked that of her Fox News counterpart, Tucker Carlson, in total audience and the coveted    demographic. Later, after swapping her   blazer for a fleece   Ms. Maddow speculated that some viewers were gravitating to the show to feel part of a broader movement across the country. “There is this surge in civic interest and engagement,” Ms. Maddow said as she sprawled in a chair in her cluttered Rockefeller Plaza office, where the tip of an Emmy Award poked out of a metal beer pail. “It feels like a spontaneous, organic, pretty   heterogeneous, energized, constructive force, and it’s been interesting to me to see it happen everywhere. ” Still, Ms. Maddow smiled when told that some viewers say they turn to her as a source of sanity. “My standard response to that is, ‘That is a gossamer thread  —   you need to work on that in your life! ’” she said, laughing. “I’m a TV show, and you shouldn’t depend on me. Anything can happen. Build up other sources of sanity. ” In some ways, television is the last mass medium that Americans turn to en masse in uncertain times. “It is a place where we congregate,” said Martin Kaplan, director of the Norman Lear Center for media and society at the University of Southern California. “We all gather around that hearth to know what’s going on out there, and be comforted by the people who come on our screens to say, things will be all right. ” Last week, outside a taping of Samantha Bee’s TBS comedy show, “Full Frontal,” Stacie Bloom, 44, said she was finding television “cathartic. ” “Maddow, I love her,” said Ms. Bloom, a scientist who lives in New York. “It’s reinforcing to watch. It’s the same reason I marched in the women’s march: It’s because I believe in it, and I want to be surrounded by other people who believe in it, too. ” Ms. Bee, in an interview, said she was glad her show could provide an outlet for liberals’ frustrations. “I’m certainly requiring catharsis myself,” she said, laughing. “I wish I could be more helpful to them, actually. As much as they need the show, I need the show. I experience it in a different way than the audience experiences it, but I need it, too. ” For Mr. Noah, who struggled early on to replicate the success of his “Daily Show” predecessor, Mr. Stewart, the election became a clarifying moment. “We are in the same position as a lot of our audience is in,” he said. “We felt the change and we felt an immediate shift, and we responded accordingly. ” Viewing habits seem to reflect the increasingly polarized state of the nation. Cable news, with its sharp punditry, is seeing huge ratings, but viewership for the   network evening newscasts is falling, along with that of   morning shows. CNN, once the   straight man of cable news, has embraced its role as foil to Mr. Trump, with anchors like Jake Tapper delivering aggressive interviews and commentary on the administration. Gloria Steinem, the liberal activist and writer, wrote in an email that she had grown tired of “false equivalency or  ” from news organizations, which she blamed for aiding Mr. Trump’s rise. “I watch MSNBC for Joy Reid, Chris Hayes, Rachel Maddow and Lawrence O’Donnell because I trust them as journalists,” Ms. Steinem wrote, adding, “A journalist’s job is not to be balanced it’s to be accurate. ” At Rockefeller Plaza, Ms. Maddow was asked if it felt odd to be enjoying a major career moment thanks to the election of a president whose policies she loathes. “I don’t feel like a winner right now, if that’s what you’re getting at,” she said. “I don’t feel like, ‘Score! Let’s hope for even more senior diplomats to get fired! ’” “Like, God, no,” Ms. Maddow added, turning serious. “I am not hoping for it to get worse. ”'"}, "time": 1742563224.6034503}