{"duration": 1.6255357265472412, "input_args": {"text": "'Pinterest \\nOfficials with the State Department told Hillary’s campaign staffers that they planned to leak a story about the missing Benghazi emails to a “friendly” AP reporter before giving it to Congress. \\n“Just spoke to State a little more about this,” Clinton’s travelling press secretary Nick Merrill wrote to campaign staffers on June 24, 2015, regarding emails sent between the former Secretary of State and her longtime confidant Sidney Blumenthal, The Daily Caller is reporting . \\nState Department told officials they would tip off AP reporter that at least 15 emails between Clinton and Blumenthal were missing from the more than 55,000 pages of emails given to a House committee investigating the 9/11/2012 attack on the Benghazi compound in Libya. \\n“They do not plan to release anything publicly, so no posting online or anything public-facing, just to the committee,” Merrill said. “That said, they are considering placing a story with a friendly at the AP (Matt Lee or Bradley Klapper), that would lay this out before the majority on the committee has a chance to realize what they have and distort it.” \\n“On that last piece, we think it would make sense to work with State and the AP to deploy the below,” Merrill wrote, referring to press statements the campaign had crafted after they got tipped off State would hand over Blumenthal emails to Congress. \\nStaffers with the Clinton campaign put together a series of statements on the missing emails after being told it would have to disclose it to House investigators. \\n“So assuming everyone is in agreement we’ll proceed,” Merrill wrote. “It would be good to frame this a little, and frankly to have it break tomorrow when we’ll likely be close to or in the midst of a SCOTUS decision taking over the news hyenas.” \\nAP reporters Lee and Klapper did run with a story on July 25, 2015 — the day after Merrill’s email. Their story cited “officials who spoke on condition of anonymity because they weren’t authorized to speak publicly on the matter.” \\nLee and Klapper’s article also included the statement crafted by Clinton campaign staffers in the email chain — that chain was one of thousands released by WikiLeaks from Clinton campaign chair John Podesta’s hacked Gmail account. \\nPodesta’s emails suggest the Clinton campaign had a cozy relationship with many members of the media, including the AP. \\nIn one email chain, Center for American Progress President Neera Tanden told Podesta to get the New York Times to cover Clinton favorably. \\nTanden said former New York Mayor Michael Bloomberg met with Arthur Sulzberger, NYT’s publisher, to alter coverage of him. \\nTanden told Podesta that “when bloomberg was having problems w the times he called Arthur Schulzburger and asked for coffee.” \\n“He made the case that they were treating him like a billionaire dilettante instead of Third term mayor,” Tanden wrote. “It changed the coverage moderately but also aired the issues in the newsroom so people were more conscious of it.”'"}, "time": 1742563375.8057792}