{"duration": 0.10636258125305176, "input_args": {"text": "'Clinton Campaign Paid Beyonce and Jay Z $62 Million For Cleveland Concert to Secure Black Votes SHARE tweet \\nCleveland, Ohio – Beyonce and Jay Z performed for “free” at the Get out the Vote concert last night for Hillary Clinton. However, sources revealed that the power couple was paid $62 Million to perform. \\nAccording to sources closely connected with the power couple, Clinton and her campaign flew Beyonce and Jay Z out to a private meeting to discuss the election. With Hillary lacking the African-American voting numbers that Barack Obama had during his 2008 presidential, the Clinton campaign made a quick and desperate move in their final efforts to secure African-American votes. \\n“Jay and Beyonce got a call a few weeks ago from Clinton. She invited them for a weekend stay at a luxury hotel to meet regarding the election. Before Jay Z or Beyonce could voice any concerns or ask questions, Hillary pulled out a check. Beyonce saw the check first and her eye lit up like Christmas lights. On the last day of the meeting, Hillary told said to everyone, including Jay Z and Beyonce, “We definitely got the black vote now.” MUST READ: Nvidia moves into your living room with a device not just for gaming \\nOn the flight back to New York, Jay Z said, “You know what, Black Lives Matter, they matter because we got paid $62 Million to represent them.” \\nHillary Clinton can officially add Beyoncé and Jay Z to her list of devoted supporters. The musical power couple headlined a free get-out-the-vote concert in Cleveland on Friday night. MUST READ: Puppy Monkey Baby Ad Scares Little Girl Into Gouging Her Own Eyes Out \\nJ. Cole, Chance The Rapper, and Big Sean were also among the list of artists who performed, offering their support to the Democratic nominee for president. \\nAs the concert’s official main headliner, Jay-Z kicked off the event with “Dirt Off Your Shoulder,” “F—WithMeYouKnowIGotIt,” and a couple of his older hit records. Shawn “Jay Z” Carter also brought out Big Sean to perform “Clique”. SCROLL DOWN AND CLICK NEXT TO CONTINUE READING EmpireHerald Warren Stallings \\nI dont believe this one iota, yet why isnt the media covering the “ghetto music comments and the “why do they have to dress so negro” comments hillary spouted on a live lapel microphone? \\nIt seems you will believe anything. csh \\nYou know why…. They are nothing more than Soros puppets, just like Hillary. Deb Anker \\nIf she really said that, don’t you think the audio would be released, just as the audio of Trump bragging about committing sexual assault was? Warren Stallings \\nsuck the koolaid dear…….you think a jew owning the ny times is gonna report it. Darcy Lewis \\nIt’s ok, Hillary brought along her hot sauce! Weekdaygirl \\nJust more delusion republicans Beyonce is not that kind of star she would do it for free because she just would if they knew her before they wrote this article. She is rich filthy rich she don’t need no money not even Jay z he got his own millions. Barney \\nexcept that most rich people want even more money.. Jonathan Miller \\nYou would be like Madonna and give head for a vote, wouldn’t you? Beyonce would screw the Devil for 62 million dollars… SecedeTexas \\ntry and denounce this on Truth or Fiction. If it wasn’t true they would be all over it. Cjarmaine \\nIf you recall many many people left after everyone was done performing and Hillary started talking. So i guess the money doesn’t matter that’s why they did it, they knew the crowd would dwindle once they were done…. LMAO!!!! bubbaclinton \\nYou know she is crooked to the bone. Lawrence Hodge \\nYea totally. Because the key to Black Votes is Jay Z and Beyonce. That’s like saying Trump paid Bruce Springsteen $50 million to secure White votes. Ken Adams \\nExcept Springsteen is another liberal idiot, so your logic fails, you moron. TomAZUSA \\nTotal bullshit. I don’t believe this. Noli Timere \\nThink of the POVERTY and Student Loans they could wipe out with that JACK! Liam Kelly \\n62 million, sure, unnamed sources claims. Not one respectable news organization has verified that number. These guys are playing Gawker Roulette. pitriver \\nMight want see if the 62 million came from the foundation. Liam Kelly \\nMight want to see if that 62 million number is anything close to real. All stories use this as their source. This has no source. So in other words its a bunch of lies. \\nYes Empire Herald I am calling you out on your obvious and flagrant lie. SecedeTexas \\nthe fact that Truth or Fiction is not commenting tells me that this true. Liam Kelly \\nAny source to back up your 62 million dollar claim? I mean remember what happened to Gawker. I’m sure Jay Z and Beyonce could take you to the cleaners. Weather '"}, "time": 1742564319.3457983}