{"duration": 0.04802584648132324, "input_args": {"text": "'American Thinker November 1, 2016 \\nIs it a crisis yet? The fate of a criminal probe into the activities of a possible president has been fought behind closed doors. The nation’s premier investigative agency allegedly is riven by conflict over investigating Hillary Clinton’s email, the Clinton Foundation, and Anthony Weiner’s sexting. \\nDevlin Barrett of the Wall Street Journal has apparently mined many sources at the FBI and the DoJ, along with other “people familiar with the matter,” and put together a remarkable piece that is providing a lot of new information. Unfortunately, it is behind a paywall, though I understand that the WSJ is offering very low initial subscription rates, as low as $4, which might be worth it even on a tight budget, considering the history unfolding before our eyes. \\nBarrett identifies a timeline for the Weiner email trove that begins: \\n… in early October when New York-based FBI officials notified Andrew McCabe, the bureau’s second-in-command, that while investigating Mr. Weiner for possibly sending sexually charged messages to a teenage minor , they had recovered a laptop. Many of the 650,000 emails on the computer, they said, were from the accounts of Ms. Abedin, according to people familiar with the matter. The FBI lacked a warrant to read the emails, but they did examine the metadata, that showed “apparently … thousands” of them were from Hillary’s private email server. \\nThis led to a dramatic meeting: \\nAt a meeting early last week of senior Justice Department and FBI officials, a member of the department’s senior national-security staff asked for an update on the Weiner laptop, the people familiar with the matter said. At that point, officials realized that no one had acted to obtain a warrant, these people said. \\nMr. McCabe then instructed the email investigators to talk to the Weiner investigators and see whether the laptop’s contents could be relevant to the Clinton email probe, these people said. After the investigators spoke, the agents agreed it was potentially relevant. \\nMr. Comey was given an update, decided to go forward with the case and notified Congress on Friday, with explosive results. Senior Justice Department officials had warned the FBI that telling Congress would violate policies against overt actions that could affect an election, and some within the FBI have been unhappy at Mr. Comey’s repeated public statements on the probe, going back to his press conference on the subject in July. \\nBarrett does not venture into speculation, but I believe that Comey had no choice at that point, because the news would have leaked out. Too many people knew of the discovery at this point (including, possibly, the NYPD , which may have gotten the Weiner probe going in the first place – we still don’t know). Many journalists (including me) in touch with active and retired FBI agents have heard of the extreme disappointment of many within the FBI community with Comey’s damage to the Bureau’s reputation. \\nThe meatiest reporting, however, covers the investigation of the Clinton Foundation, which Barrett characterizes as one of “ several matters related, directly or indirectly, to Mrs. Clinton and her inner circle” (emphasis added). \\nNew details show that senior law-enforcement officials repeatedly voiced skepticism of the strength of the evidence in a bureau investigation of the Clinton Foundation, sought to condense what was at times a sprawling cross-country effort, and, according to some people familiar with the matter, told agents to limit their pursuit of the case. The probe of the foundation began more than a year ago to determine whether financial crimes or influence peddling occurred related to the charity. \\nUnnamed FBI agents are characterized as “viewing FBI leadership as uninterested in probing the charity[.]” My guess is that the “senior law enforcement officials” voicing skepticism might be from Loretta Lynch’s staff. But they may include FBI officials.'"}, "time": 1742561924.126239}