{"duration": 0.07666659355163574, "input_args": {"text": "'RIO DE JANEIRO  —   The highest court for world sports has upheld the decision to ban Russia from the Paralympic Games because of widespread doping, rejecting an appeal by the country and issuing what is considered the final word on the matter. The Court of Arbitration for Sport said in announcing its decision Tuesday that the punishment by the International Paralympic Committee “was proportionate. ” Russia, the court noted, “did not file any evidence contradicting the facts” on which officials had based their decision. The International Paralympic Committee had voted unanimously this month to ban Russia from the competition, which begins here on Sept. 7, after an investigation commissioned by antidoping regulators found that elaborate   violations in the country extended to its top disabled athletes. Russia has been a power in the Paralympics, winning 80 medals  —   nearly 40 percent of the total  —   at the 2014 Winter Paralympic Games in Sochi, Russia. The decision of the International Paralympic Committee went beyond the sanctions imposed by the International Olympic Committee, which had considered but rejected a blanket ban on Russian athletes. The official who ran the   programs at the 2014 Olympic and Paralympic Games said he had swapped the urine samples of the country’s top Olympians and Paralympians who were doping with clean ones. Forensic evidence confirmed a coordinated cheating effort by Russia, according to a report published by the World   Agency last month. The report concluded that the authorities, including the Sports Ministry, had covered up the use of   drugs by top athletes for years. When the International Paralympic Committee ban was announced on Aug. 7, Philip Craven, the committee’s president, denounced Russia’s “thirst for glory” and what he called its “medals over morals” mentality, adding that Russia’s antidoping system was “broken, corrupted and entirely compromised. ” On Tuesday, Mr. Craven struck a more conciliatory tone. “It is not a day for celebration, and we have enormous sympathy for the Russian athletes who will now miss out,” he said in a statement. “We hope this decision acts as a catalyst for change in Russia. ” The banned substances protocol for the Paralympics is different from that in the Olympics. Therapeutic exemptions are made for some Paralympians, but the use of anabolic steroids  —   which Russia’s antidoping lab director said was common among top medal contenders  —   is unequivocally prohibited. The Russian sports minister, Vitaly Mutko, expressed frustration with the International Paralympic Committee’s vote, calling the blanket ban “beyond belief” in an interview with the Russian news agency Interfax. Russian Paralympians had participated a series of videos in recent weeks, seeking to persuade sports officials to let them compete. The number of Russian athletes at the Olympic Games here, which concluded Sunday, was affected by the findings of the recent investigation. More than a hundred Russian athletes were barred from competition. The country won 56 medals at this year’s Summer Games, roughly a third fewer than at the 2012 Games in London. As the Rio Games approached, the I. O. C. considered a total ban of all Russian athletes. But it ultimately decided against what the organization’s president called a “nuclear option” that would have resulted in “death and devastation” and run counter to the inclusive spirit of the Games. Instead, Russian athletes were considered tainted, Olympic officials said, and only those who could demonstrate a rigorous history of   testing were allowed to compete. In voting to bar all Russian athletes, Paralympic officials, who typically act in accordance with Olympic officials, had taken a bolder decision, which Russia promptly challenged in court. “It’s an unprecedented decision,” Mr. Mutko told Interfax. “I don’t understand what it’s based on. ”'"}, "time": 1742563018.5945427}