{"duration": 1.636082410812378, "input_args": {"text": "\"Email \\nVladimir Lenin, the first dictator of the Soviet Union, said “the motion picture” was the most important art form for spreading communism to other countries. And his successor, the murderous dictator Joseph Stalin, is reported to have predicted he could convert the whole world to communism if he was given control of the American movie industry. \\nIn 1935, the cultural commissioner of the Communist Party USA (CPUSA), V.J. Jerome, planted a branch of the party in Hollywood, and went to work to use the industry to advance the cause. The Soviet-backed communists recruited actors, directors, and writers to the cause, and eventually did battle with the studio owners in labor strikes. \\nBut now, Chinese communists have surpassed their Russian comrades, and they aren’t bothering with recruiting “lowly” actors, directors, and writers to advance Chinese communism; they are looking to buy theater chains and movie studios. \\nIn fact, they purchased AMC Entertainment Holdings back in 2012, gaining control over hundreds of cinemas in 30 U.S. states, and at least five other nations. It is the world’s largest operator of I-MAX and 3D screens. \\nNow, Chinese company Wanda Group, which took over AMC, wants to obtain at least one American studio, and invest in several others. \\nMuch of the American media have referred to Wanda as a “private company,” run by multibillionaire Wang Jianlin (shown). But most media outlets neglect to mention Wang is a high-ranking member of the Chinese Communist Party, and the company is actually owned by the Chinese communist government. According to Bloomberg Businessweek, “Dalian Wanda Group Corporation Ltd. Operates as a subsidiary of China National United Oil Corporation, Ltd.” Known as “China Oil,” it is in turn owned and controlled directly by the communist regime through two other state-owned companies — the China National Petroleum Corporation (CNPC) and Sinochem Corporation. \\nWang is regarded as China’s wealthiest man. While rarely watching movies himself, he has strong interest in the American motion picture industry. He made a $3.5 billion deal for distribution with Legendary Entertainment, located in Burbank, California; is poised to obtain Dick Clark Productions in a $1 billion acquisition; and is presently building the world’s largest film studio in China at a price tag of $8.2 billion. \\nBut he wants an American movie studio, expressing special interest in obtaining a majority ownership of Paramount. Until he can wrest control of one studio, he has established an investment fund to buy shares in all six major Hollywood studios. \\n“I want to acquire one of the big six, but whether we can is a different story — it’s uncertain,” Wang admits. “We will continue to work on a potential acquisition. But it won’t hurt to start by doing what we can. Participating via investment seems like a wise choice for the time being.” \\nWang was recently honored at a Hollywood banquet at the Los Angeles County Museum of Art. Studio executives from Sony, Lionsgate, Universal, and Warner Brothers all attended, along with movie stars such as Harrison Ford. \\nThe move by Wang and the Chinese government to gain such clout in the industry has caused concern in Congress. Sixteen members of the U.S. House of Representatives wrote a letter to the U.S. Government Accountability Office in September, asking for them to scrutinize Chinese purchases of American entertainment companies as a national security concern. The letter mentioned Chinese efforts to “censor topics and exert propaganda controls on American media” \\nBecause of the sheer size of the Chinese movie market, among other reasons, the industry has already shown extreme caution not to offend the communist giant. For example, when the 1980s movie Red Dawn was re-made, the original script called for the invaders to be Chinese communists rather than Russian communists attempting to take over America. After the film had already been made, MGM became concerned enough to make the invaders North Koreans . \\nAnd that was a year before Wanda took over AMC. \\nStanley Rosen, a political science professor at USC, contends that Hollywood “is already altering their films to make them China-friendly — or at least China-neutral — to gain market access there.” He argues that Wanda doesn’t need to buy studios to change things all that much. \\nWang recently addressed some of the concerns about his company’s investments in the movie industry. He blames the criticism to the current presidential election campaign, and said he did not believe it represents the “mainstream” of America. “With the general election as the backdrop, voices against China, or Chinese enterprises, will certainly attract attention.” \\nWhen asked for his views on Donald Trump, Wang allowed that Trump had been somewhat successful as a businessman, but that he was just not in the same league with America’s “real mega-rich,” citing Bill Gates as an example. He is withholding judgment of Trump as a politician until after the election. \\nWang was born in 1954 to parents who were in the Red Army of Mao Tse-tung. His formal schooling came to an abrupt halt when Mao ended China’s education system in 1966. At that point, Mao gave the Chinese two choices, “We could go to the rural areas and participate in farming or become a soldier.” Because of his parents’ past service in the People’s Liberation Army, he chose a military life. \\nHe recalled a 745-mile march during a period of time when the temperatures were below zero. “I remember once when we had to march for three days and three nights nonstop. A lot of people just slept while marching.” The troops formed three rows so that a soldier could grab the backpack of the soldier in front of him. That way, only the leader kept his eyes open as the rest trudged along behind him. \\n“I saw one person in the next row fall off a cliff from walking with his eyes closed.” \\nAfter 16 years in the PLA, he was assigned a provincial government post. Then, in 1988, he became the manager of a government-owned real estate company that was deeply in debt. Wang turned the company around, and the company was re-named Wanda in the early '90s. Today, Wanda Group employees 130,000. \\nWang is a tough task-master. Employees who violate the company’s strict dress code are fined, and sometimes fired. All employees, even the top executives, are required to punch in and punch out. \\nOver the years, as the Chinese government-run industries have become wealthier by selling cheap goods made with what is essentially slave labor, they have bought up natural resources around the world, especially in Africa and Latin America. Now, the regime is moving to purchase Western businesses, including computers and technology, banks, agriculture, and automobiles. \\nBut the propaganda opportunities in the motion picture industry far surpass any such possibilities to be advanced by growing wheat or making cars. For many people, once they have seen something on the silver screen, or heard something in a movie theater, it becomes “reality” for them. Writing in the communist newspaper The Daily Worker in 1925, Will Muezenberg explained the importance of the movie industry to advancing the goal of the communist world. Muezenberg, an agent of the Comintern (created to spread communist ideology and promote Soviet interests worldwide), said, “One of the most pressing tasks confronting the Communist Party in the field of propaganda is the conquest of this extremely important propaganda unit [the movies], until now the monopoly of the ruling class. We must wrest it from them and turn it against them.” \\nAnd that is what is involved in the Chinese moving into Hollywood. Photo: AP Images Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.\""}, "time": 1742562918.921596}