{"duration": 0.032166242599487305, "input_args": {"text": "\"Share on Facebook Pressure has started to mount on the president-elect of the United States, Donald Trump, even before he takes the presidential oath to become the next leader of the country. Edward Snowden is an American computer professional who previously worked as a contractor for the National Security Agency (NSA). Snowden made headlines around the world in 2013, after he copied and leaked classified information from the NSA, belonging to the United States government. His disclosures revealed how the American government had covertly spied on its citizens – and the rest of the world – in the name of so-called national security. These damning revelations exposed the American government, even among its allies. The Department of Justice later unsealed charges against Snowden, forcing him to seek asylum in Russia. Currently, Snowden is living at an undisclosed location in the vast country and has, so far, spent three years in exile. Since the disclosures, privacy activists in the West have pushed for more anti-spying laws. In the United States, for example, Congress has ordered the NSA to end its bulk phone metadata collection program authorized by a particular portion—Section 215—of the Patriot Act. Under the new guidelines from Congress, the NSA may no longer directly collect and hold data about the domestic phone records of American citizens. In 2013, when Snowden made these revelations, the American public, and even people elsewhere in other countries, shared their opinion on the matter. Where some people, especially those in the Obama administration, believed Snowden should be crucified, privacy activists saw Snowden as a hero. At that time, Trump, of course, was preparing to run for the office of president of the United States. He also shared his opinion on the revelations made by Snowden, which had rocked the country to its core. The billionaire said then, that he would bring Snowden back to the United States with an apology, if only he was the president of the country. Below is Trump's Tweet on the matter on June 18, 2013. All I can say is that if I were President, Snowden would have already been returned to the U.S. (by their fastest jet) and with an apology! — Donald J. Trump (@realDonaldTrump) 18 Ιουνίου 2013 When Trump tweeted, many mocked him, saying that he would never become the president of the United States. However, now that he has just been elected, some people are holding him to his words, demanding that he immediately bring Snowden back, as he once said. In another tweet, published on April 19, 2016, Trump said Snowden deserves nothing but the death penalty for damaging the country's reputation with his revelations. Snowden also responded by saying he does not fear death, and that he has done nothing wrong, but only provided help to the people around the world. Before the elections, Trump was accused by Democrats – and even some Republicans – of having ties to the Russian government. Hillary Clinton alleged that the Kremlin, led by President Vladimir Putin, was trying to rig the election in favor of Trump. The concern here is that if it is true, that Trump indeed has links with the Russians, then he might possibly negotiate for the return of Snowden. Of course, Trump cannot order for the execution of Snowden, but he can certainly put him in jail. Snowden himself seems to have preferred Trump over Clinton, during the election. He tweeted before the election that the election was between Trump and Goldman Sachs, referring Goldman Sachs to Clinton. 2016: a choice between Donald Trump and Goldman Sachs. — Edward Snowden (@Snowden) 28 Φεβρουαρίου 2016 For activists, Trump can turn things around by pardoning Snowden . Apart from Snowden, there are also calls for Trump to intervene and free Chelsea Manning and Julian Assange. WikiLeaks has said President Obama has a politically pivitol moment to pardon Manning and Snowden, and if not, he hands Trump a presidency with the freedom to take his prize. Assange and his WikiLeaks organization have come under heavy scrutiny from the Democratic Party for helping Trump to win the election. WikiLeaks published many hacked emails of the party, revealing corruption and malpractices in favor of Clinton getting the nomination of the party. This unhinged the unity of the party, and may have contributed to the voters' choice of the presidential candidates. Related:\""}, "time": 1742628528.7673628}