{"duration": 0.2066631317138672, "input_args": {"text": "'WASHINGTON  —   A fierce chorus of critics denounced   Donald J. Trump on Monday for appointing Stephen K. Bannon, a nationalist media mogul, to a top White House position, even as President Obama described Mr. Trump as “pragmatic,” not ideological, and held out hope that he would rise to the challenge of the presidency. “It’s important for us to let him make his decisions,” Mr. Obama said. “The American people will judge over the course of the next couple of years whether they like what they see. ” Mr. Obama’s conciliatory remarks disappointed supporters who had hoped that he would add his voice to the criticism of the   for naming Mr. Bannon as his chief strategist. Civil rights groups, senior Democrats and some Republican strategists have assailed Mr. Trump, saying that Mr. Bannon, the former head of Breitbart News, will bring   nationalist and racist views to the West Wing. In the midst of the furor over Mr. Bannon’s appointment, Rudolph W. Giuliani, the former mayor of New York City, emerged as a leading candidate to be secretary of state, according to people familiar with the deliberations in the   office in Trump Tower where Mr. Trump was ensconced throughout the day. That would make Mr. Giuliani, a contentious former prosecutor, the president’s emissary to a turbulent world. There has been intense jockeying among several of Mr. Trump’s   campaign advisers, suggesting a competition to lead the new administration’s foreign policy, national security and   agencies. Mr. Trump is also considering naming Mr. Giuliani or Senator Jeff Sessions of Alabama as the next attorney general, according to the people familiar with the discussions. But Mr. Giuliani said Monday night at a Wall Street Journal election forum that he would not be going to the Justice Department. And if Mr. Sessions, a relentless critic of illegal immigration, is nominated for attorney general, he can expect opponents to bring up the fact that he was once rejected for a federal judgeship after officials testified that he had made racist comments. Mr. Giuliani seems more eager to be secretary of state, though John R. Bolton, a fierce foreign policy hawk who served as ambassador to the United Nations and under secretary of state under President George W. Bush, is also under consideration, the people familiar with the discussions said. Richard Grenell, who was Mr. Bolton’s spokesman at the United Nations, is being considered as ambassador there. People with knowledge of the process described a series of chaotic discussions and said Mr. Trump might also choose Mr. Giuliani or Mr. Sessions to lead the Department of Homeland Security, though neither has expressed interest in that job. In 1986, before Mr. Sessions became a senator himself, a   Senate rejected his nomination by President Ronald Reagan to a federal judgeship. Several United States attorneys testified that he had made racist comments, including calling an   lawyer “boy,” and that he had been hostile to civil rights cases. Mr. Sessions denied making most of the remarks, but apologized for once saying that he had thought the Ku Klux Klan was O. K. until he heard that some members smoked pot he called it a joke. As for Mr. Bolton, he was known in the Bush administration for his conservative and sometimes confrontational views. Before his nomination as United Nations ambassador, he once said of the   United Nations building in New York, “If it lost 10 stories, it wouldn’t make a bit of difference. ” If named to Mr. Trump’s cabinet, Mr. Bolton could clash with the president on Russia: He has accused the Obama administration of being weak in that area and recently wrote in favor of NATO membership for Ukraine, a move that would infuriate Moscow. Mr. Trump spoke by telephone on Monday with President Vladimir V. Putin of Russia, and according to a statement released by the Kremlin, the two men agreed “on the absolutely unsatisfactory state of bilateral relations” and vowed to improve them. Aides to Mr. Trump declined to comment on reports of the leading contenders for cabinet posts. But Kellyanne Conway, a top adviser, defended Mr. Bannon in brief remarks to reporters in New York, describing him as the “general of this campaign” and saying that “people should look at the full résumé. ” “He has got a Harvard business degree. He’s a naval officer. He has success in entertainment,” Ms. Conway said, calling him a “brilliant tactician. ” Ms. Conway denied that Mr. Bannon had a connection to   nationalists or that he would bring those views to the White House. “I’m personally offended that you think I would manage a campaign where that would be one of the going philosophies,” she said. Mr. Bannon has said that while there are fringe elements associated with the   nationalist movement, his critics are painting with too broad a brush. “These people are patriots,” he said. “They love their country. They just want their country taken care of. ” Even as Mr. Trump works to fill his administration, his team has yet to begin the real work of transitioning to the helm of the government because they have not completed the necessary paperwork. White House officials said Monday that Gov. Chris Christie of New Jersey, who was in charge of Mr. Trump’s transition team until Friday, had signed a memorandum of understanding that ensured confidentiality. But Mr. Christie was dismissed on Friday and replaced by Vice   Mike Pence, invalidating the agreement and leaving the transition process in a state of suspended animation. At a news conference before leaving on a weeklong trip to Greece, Germany and Peru, Mr. Obama appeared to be doing his best to give Mr. Trump space as he begins forming his administration. The president also continued his efforts to persuade Mr. Trump to preserve his legacy, pointedly reminding him that repealing the Affordable Care Act could be politically unpopular and that ripping up global agreements like the Iran nuclear deal or the Paris climate accord would be difficult. Mr. Obama refused to say whether he still considered Mr. Trump unfit to sit in the Oval Office and have access to the nuclear codes, and equated Mr. Trump’s shortcomings with his own troubles organizing paperwork on his desk. The closest he came to criticizing Mr. Trump was when he said the   would have to temper his impulses to make explosive comments and lie once he was sworn in. “There are going to be certain elements of his temperament that will not serve him well unless he recognizes them and corrects them,” Mr. Obama said. “I think he recognizes that this is different, and so do the American people. ” Congressional Republicans remained largely silent about the appointment of Mr. Bannon, choosing instead to praise Mr. Trump’s choice of Reince Priebus, the chairman of the Republican National Committee, as the new White House chief of staff. In remarks to reporters, Representative Kevin McCarthy of California, the Republican majority leader in the House, said he would “not prejudge” Mr. Trump’s choice. But critics of Mr. Bannon continued to raise questions about his background and his tenure as the chairman of Breitbart News. A 2011 radio interview surfaced in which Mr. Bannon praised Ann Coulter, Michele Bachmann and Sarah Palin by saying they were not “a bunch of dykes that came from the Seven Sisters schools up in New England. ” “That drives the left insane,” he added, “and that’s why they hate these women. ” The Council on   Relations said the selection of Mr. Bannon “sends the disturbing message that   conspiracy theories and white nationalist ideology will be welcome in the White House. ” That view was echoed by the Southern Poverty Law Center, which tracks hate groups and said Mr. Trump “should rescind this hire. ” “In his victory speech, Trump said he intended to be president for ‘all Americans,’” the center said. “Bannon should go. ” Republicans who had long opposed Mr. Trump’s candidacy also took to Twitter on Sunday night and Monday morning to warn that his choice to rely on the advice of Mr. Bannon was an indication of the way he would govern. “The racist, fascist extreme right is represented footsteps from the Oval Office,” said John Weaver, a Republican strategist who ran the presidential campaign of Gov. John Kasich of Ohio and previously advised Senator John McCain of Arizona. “Be very vigilant, America. ” But people close to Mr. Bannon came to his defense. Joel B. Pollak, an author and editor at Breitbart, called him an “American patriot who also defends Israel and has deep empathy for the Jewish people. ” Jewish leaders and supporters of Israel expressed alarm at Mr. Bannon’s appointment, pointing to   writings on the Breitbart website. “In his roles as editor of the Breitbart website and as a strategist in the Trump campaign, Mr. Bannon was responsible for the advancement of ideologies antithetical to our nation, including   misogyny, racism and Islamophobia,” said Rabbi Jonah Dov Pesner, the director of the Religious Action Center of Reform Judaism. “There should be no place for such views in the White House. ” Mike Huckabee, the former governor of Arkansas, accused Mr. Bannon’s critics of sour grapes. On Twitter, he wrote that Mr. Bannon should embrace the criticism from the Council on   Relations, or CAIR. “Critics of Steve Bannon know he’s smarter and tougher than they are,” Mr. Huckabee wrote. “When CAIR doesn’t like you, that is a good thing. ”'"}, "time": 1742564239.4038272}