{"duration": 0.10499787330627441, "input_args": {"text": "'in: Natural Medicine For those who cannot or simply wish not to take chemical drugs for menstrual pain (dysmenorrhea), a time-tested and now clinically confirmed natural alternative exists based on the flavorful herb fennel. In a recent double-blinded, cross-over study published in Iranian Journal of Nursery and Midwifery Research, involving 68 female university students (mean age 21.8 years), the participants were divided into two groups of 34 and randomly administered either a combination of fennel/vitamin E or ibuprofen for two months. [i] Up to 60.3% of the subjects in the trial had missed school or daily activities due to dysmenorrhea, 89.7% participants reported use of tranquilizers, and 22.1% had family history of dysmenorrhea. Additionally, a pre-study survey (2007) on a dysmenorrheic population in Tehran found that 95.7% of the participants reported using another drug for pain relief in the case group and about 95.5% used these drugs in the control group. [ii] The results of the intervention were reported as follows: “The mean of peak pain intensity in the first, second, third, sixth, and forty-eighth hours in the group that had used combination of fennel extract/vitamin E was lower than the group that had used ibuprofen, and statistical differences were observed between the two groups in the first and second hours; combination of fennel extract/vitamin E was more effective than ibuprofen in the first hour ( P < 0.03) and second hour ( P < 0.04). The mean of peak pain intensity in the first, second, third, sixth, and forty-eighth hours in the group that had used combination of fennel extract/vitamin E was lower than the group that had used ibuprofen, and statistical differences were observed between the two groups in the first and second hours; combination of fennel extract/vitamin E was more effective than ibuprofen in the first hour ( P < 0.03) and second hour ( P < 0.04).” The study concluded, “Combination of fennel extract/vitamin E is effective on decreasing the intensity of pain of primary dysmenorrhea, and it is advised to those who cannot use chemical drugs.” Beyond the obvious pain and quality of life issues of painful menstrual cycles, it has been estimated that in the United States alone, missed work due to dysmenorrhea leads to 600 million work hours per year, with economic loses are an estimated $2 billion per year. [iii] Unfortunately, there are severe side effects associated with conventional treatment for dysmenorrhea, which rely mostly on painkillers, and whose wide range of deleterious effects include liver damage ( Tylenol ), bleeding disorders ( aspirin / ibuprofen ), and severe addiction (opioids), to name but a few of over 100 known adverse health effects of this drug class. [iv] In a recent article, “ Ibuprofen Kills Thousands Each Year, So What is the Alternative? ” we discussed the fallout from a recent Lancet article indicating the risk of heart attack increases as much as a third and the risk of heart failure doubles among heavier users of NSAID drugs. Given how common the use is of chemical drugs for this common health complaint, the fennel/vitamin E’s comparable potency is quite encouraging. While the fennel/vitamin E trial did not disclose the exact formula and dosages of ingredients used, a previous trial found that fennel seed (technically a fruit) extract at 2% concentration (25 drops, orally every 4 waking hours) compared favorably to another NSAID drug known as mefenamic acid. [v] These are not the only two trials comparing fennel to a drug in the treatment of dysmenorrhea. Previous published studies include: Eastern Mediterranean Health Journal (2006): Two groups of high school girls with dysmenorrhea received either fennel extract or mefenamic acid for 2 months, resulting in comparable levels of pain relief and recovery of functional activity. [vi] Ayu (2012): 60 adolescent girls suffering from dysmenorrhea received either 30mg of fennel extract, four times a day for three days from start of their menstrual period or a placebo a capsule in the same dosage scheme. The fennel intervention was more effective than the placebo group in pain relief. [vii] Iranian Journal of Nursing and Midwifery Research (2013) : 60 college students with dysmenorrhea were randomly assigned to two groups, one with fennel drops (2% fennel extract, 25 drops every 6 hours) and the other with mefenamic acid (250 mg every 6 hours). The pain relief was comparable between groups. [viii] [Note: the researchers observed increased bleeding in the fennel group. Those prone to this should exercise additional caution]. Fennel is one of a wide range of traditional herbs used to address symptoms of dysmenorrhea. At GreenMedInfo.com we have indexed 20 substances that have been studied for this condition, as well as 8 Therapeutic Actions : Dysmenorrhea research . [i] Masoomeh Nasehi, Fahimeh Sehhatie, Vahid Zamanzadeh, Abbase Delazar, Yousef Javadzadeh, Bahman Mohammady Chongheralu. Comparison of the effectiveness of combination of fennel extract/vitamin E with ibuprofen on the pain intensity in students with primary dysmenorrhea. Iran J Nurs Midwifery Res. 2013 Sep ;18(5):355-9. PMID: 24403936 [ii] 30. Tark ZS, Akhavan AM, Mojab M, Alavi MH. Effect of Fennel extract on primary dysmenorrhea. Iran J Fertil Steril. 2007;8:45–51. [ Ref list ] [iii] Ahmed M, Minawi EL, Fred M. Howard. Pelvic Pain Diagnosis and management. Philadelphia: LWW; 2000. Dysmenorrhea; pp. 100–9.'"}, "time": 1742562243.9895167}