{"duration": 0.09486031532287598, "input_args": {"text": "'After Samsung Electronics halted production of its   smartphone, the Galaxy Note 7, it posted a statement on its website telling owners of the phone to power it down immediately and contact the outlet they bought it from to obtain a refund or an exchange. But for people to see those words, they had to click a link at the top of Samsung’s home page with the    label “Updated Consumer Guidance for the Galaxy Note 7. ” As of Tuesday afternoon, the instructions had not been posted to Samsung’s Facebook page or the company’s Twitter account. For some who work in crisis management, it was a baffling and overly passive way for the South Korean electronics giant to deal with a prominent problem that has worsened in the last month. “That ought to be more visible  —   this is pretty serious,” Andrew Gilman, the chief executive of the crisis communications firm CommCore Consulting Group, said of the warning on Samsung’s home page. The brand has “to show they care and are concerned” through consistent communication on their home page, Twitter, Facebook and other social channels, he said. On Tuesday afternoon, the pinned tweet on the Samsung Mobile US Twitter account, dated Sept. 15, was still telling consumers they could exchange the old Note 7 for a new version of the phone. On the company’s Facebook page, the most recent post was from Oct. 4, when it shared a photo of a YouTube star using its new virtual reality camera. That post was quickly filling up with comments about how production of the Galaxy Note 7 had been stopped. “This is a phone that can literally catch fire and burn your house down with you in it,” said Dean Crutchfield, an independent brand consultant in New York. “I don’t think that’s being highlighted enough. ” Samsung has repeatedly stumbled in the last month as it sought to address reports that its Galaxy Note 7 phone had been overheating and catching fire because of a manufacturing flaw. The company recalled 2. 5 million phones last month and was initially praised, until it was learned that it had acted without required coordination with the Consumer Product Safety Commission in the United States. Samsung also erred by telling Hong Kong consumers around that time that models there would be unaffected, only to reverse course a day later. The brand, which has been offering refunds or replacement Note 7 devices to consumers in the last few weeks, now faces the unpleasant task of pulling the newer smartphones as well. All of this has grown into an international crisis for Samsung, which is not accustomed to dealing with such public scrutiny. Samsung is South Korea’s most important company, accounting for about 17 percent of the country’s gross domestic product. As a result, government regulators there are not as quick to call it to task as regulators in other countries. In response to questions on its outreach efforts, a spokeswoman for Samsung pointed to the advisory on its website and a statement that it would stop exchanges and sales of the phone. Adding a layer of complexity is the fact that many consumers interact with the Samsung brand through carriers like Verizon and ATampT or retail outlets like Best Buy. “What these carriers are battling with is making sure their brand image is not sullied by this,” Mr. Crutchfield said. “They want total responsibility reflected on Samsung. ” ATampT, for example, sent a text to consumers on Sept. 20 notifying them that new Note 7 phones would be available on Sept. 21 for exchanges. The carrier said in an emailed statement on Tuesday that “another customer communication is in progress” based on the latest news. “Over all, as a company, they have an enormous amount of products and customer loyalty to those products, and they have to bank on that leverage and work on it in the near and distant future in order to continue that,” Andrew Frank, the founder and president of KARV Communications, who has worked on recalls involving companies like Continental Tire, said of Samsung. Thus far, communication out of Samsung has been overly “bureaucratic,” Mr. Crutchfield said. He said he would put the company’s executives in front of consumers, noting “people want to see people. ” The public’s frustration was starting to show. One consumer tweeted to Sprint this week, saying “Hey @sprint, what if I don’t trust @SamsungMobile devices anymore?” The carrier responded, “Greetings, you still can trust Apple, HTC, LG or Alcatel. ”'"}, "time": 1742561746.8084936}