{"duration": 0.0953528881072998, "input_args": {"text": "\"By Sarah Jones on Thu, Oct 27th, 2016 at 1:41 pm The 12th woman has come forward to accuse Donald Trump of doing what he bragged about doing on the Billy Bush bus tape. In a story that sounds very familiar, former Miss Finland Ninni Laaksonen told the tabloid Ilta-Sanomat that Trump grabbed her butt. Share on Twitter Print This Post \\nThe 12th woman has come forward to accuse Donald Trump of doing what he bragged about doing on the Billy Bush bus tape. \\nIn a story that sounds very familiar, former Miss Finland Ninni Laaksonen told the tabloid Ilta-Sanomat that the now Republican nominee grabbed her butt just before Trump and three other beauty pageant contests went on the air for the Late Show with David Letterman in 2006. \\n“Before the show we were photographed outside the building,” Laaksonen is quoted by Haaretz . “Trump stood next to me and suddenly he squeezed my butt. He really grabbed my butt. I don’t think anybody saw it but I flinched and thought, ‘What is happening?'” \\nAs to the veracity of these claims, it should be noted that Laaksonen didn’t seek the tabloid out. Ilta-Sanomat, the second largest paper in the country according to Wikipedia , reached out to Finnish women who had encountered Trump and that’s how they discovered her story. \\nIn case you’re not already grimacing, the former Miss Finland added, “Somebody told me there that Trump liked me because I looked like Melania when she was younger.” \\nTrump has been caught on tape saying women expire at the age of 35. Melania Trump is now 46, so she would have been “expired” when this alleged groping incident took place in 2006. \\nNew York Magazine has an exhaustive list of allegations made by women against Donald Trump. \\nDonald Trump is on tape bragging about grabbing women by their “p*ssy” against their will, so it’s not a stretch to hear that he did indeed do this to women who are also willing to come forward and face the wrath of the Trump machine. \\nWhat should be alarming is that Donald Trump is the best of the best on the Republican bench. I mean, that is supposed to be how this works, right? A group of top contenders are picked for possible nomination and the best gets it. \\nRepublicans try to say this is just locker room talk, but if then Senator Barack Obama had had a bus tape like Trump’s, let alone 12 women accusing him of doing what he bragged about doing, he not only wouldn’t be in office right now – he wouldn’t have been a contender. Rightfully so.\""}, "time": 1742563099.389125}