{"duration": 0.07901549339294434, "input_args": {"text": "'shorty Share This: T he Orwellian system of “news” distribution which passes for journalism in the United States has never been so hyperactive and audacious, its lies breaking all previous records for sheer cynicism and outright dishonesty. In this space we aim to offer samples, for the record, as it were, although just about ALL the reporting on the MSM on any topic of interest to the US-led plutocracy—from Syria to the Ukraine and Russia, China, Iran, etc, and reports touching on the nature of the US political system (which the plutocracy and its minions continue to hail as a “democracy”), history, the economy, etc., are to be regarded as extremely devious and toxic. .. The saddest part is that this enormous machinery of deception—which by design weaves crude and subtle lies in its tapestry— does have a real and dangerous impact on the way people think here and around the world, and certainly affects the minds and temperaments even of many people who still think of themselves as “progressive” and well educated. Given the multitude of instances, there is no way we can provide on this site a blow by blow analysis of these people’s treacherous statements and pseudo facts. The ONLY antidote we can think of is for you to educate your mind to detect falsehoods by reading regularly sites like The Greanville Post. Eventually you will spot the chicanery a mile away and take appropriate defensive measures. And, we hope, fight back. DISINFORMER OF THE DAY: CBS CORRESPONDENT ELIZABETH PALMER Things to note in this report: • Palmer is reinforcing the American establishment/Clinton propaganda trope that the Kremlin has actually interfered with the purity of US elections (sic). This is not just a Clinton-disseminated lie, but a lie pushed by the entire US establishment as it prepares the nation for war against Russia, China or any other nation that would dare deviate from or question US global hegemony. • Palmer, besides having an anti-Russia agenda, like all US “journalists’ is grossly ignorant of the culture it is reporting about, and obviously intellectually lazy. So she gravitates to what is easy, in this case dependable pro-US shills living in Moscow, like the editor of the Moscow Times, an outfit that is simply laughable on its face. This is what she uses to help her audience “interpret” the reality in Russia. The Moscow Times, with an equivocal agenda, is part of the extensive, underhanded network of US hybrid war assets, along with its notorious global web of NGOs supporting “color revolutions” in the name of “democracy,”“human rights” and other worthy, high-falutin’ concepts. RESOURCES The Greanville Post and its sister site, Cyrano’s Journal carry extensive repositories dedicated to the study of disinformation. Below, some links that may serve as a down payment on this important area of study. We suggest that you read and download these, for we are not sure how long we may stay afloat.'"}, "time": 1742564461.9845994}