{"duration": 0.0765082836151123, "input_args": {"text": "'5 best fictional news stories on demonetization woes to be selected for Sahitya Acedemy Award Posted on Tweet (Image via intoday.in) \\nSahitya Academy has decided to award 5 writers with a cash prize of 1 lakh rupees and a plaque each for their outstanding articles about the struggles of Indian citizens against the backdrop of a wicked demonetization. The cash prize will be transferred to their accounts to avoid any inconvenience. \\nSoon after the news of demonetization broke, thousands of people thronged ATMs in various cities to withdraw cash, and an equal number of articles, depicting their ordeal, were published on select media outlets. Talented writers across the nation gave wings to their imagination and produced heart-wrenching stories of middle and lower middle class families during an emergency-like situation inflicted on them by a fascist government. \\nExperts believe the decision of Sahitya Academy, to encourage budding writers in their creative pursuits, is a move in the right direction to revive literary fiction in India. \\nWe had a chance to interact with one of the writers whose story has been shortlisted by the committee, and we asked him about his story. \\n“It’s a murder mystery,” he replied nonchalantly, “The story is about a man who kills someone at the ATM for 2500 rupees.” \\n“Wow, that’s something different from what we have read so far. Can you reveal some of the details?” we asked. \\n“Ok, see this story is about a man who has to pay his rent on 14th…” \\n“But isn’t he already too late?” \\n“He pays his rent on 14th. Do you have any problem with that? Now don’t interrupt me when I am narrating the story. So, he has to pay a rent of 5000 rupees, and at the same time Modi bans all 500 and 1000 rupee notes…” \\n“But Modi announced this on 8th and he pays his rent on 14th. So he had 7 days to withdraw the cash.” \\n“He was out of station.” \\n“But there are ATMs in other…ok, please continue.” \\n“So, he logs into his account to transfer the fund to his landlord’s account, but he cannot remember his password because of the situation created by Modi. He clicks forgot password option but his mobile runs out of battery.” \\n“Wow, that’s interesting.” \\nWe grabbed a handful of popcorn as the story took an interesting twist. \\n“He rushes to the nearest ATM and withdraws 2500 rupees, but he needs another 2500,” he paused for dramatic effect and said, “He kills a man standing in the queue.” \\n“In front of so many people! Cannot they see him?” \\n“No, because he is wearing a mask. Now he enters the ATM again and withdraws another 2500 rupees.” \\n“But PIN…” \\n“Haha, the PIN is his year of birth.” \\n“You mean the murderer’s or the victim’s?” \\n“The victim’s of course because that’s his card.” \\n“Oh ok, but how did the murderer know his year of birth.” \\n“Because in the same year Sachin Tendulkar made his international debut. Got it?” \\n“Umm, ok. But don’t you think he could just kill the landlord instead of killing a random person?” \\n“No, because he is getting married to his landlord’s daughter.” \\n“Ok so, how is this murder solved?” \\n“Ok so, here’s how it goes. No one knows who did it. Police is clueless…but the ATM card is not.” \\n“Oh…my…God, we completely forgot about the ATM card.” \\n“Yes, now the card takes revenge on behalf of its owner.” \\n“Like how the dog did in Teri Meherbaniyan?” \\n“Kind of, but the dog in Teri Meherbaniyan addresses the issue in an aggressive manner but the ATM card in my story opts for a subtle approach. The card has a camera on it and it clicks photographs of the killer, which it later sends to the police.” \\n“How…I mean, ok. So, does he get caught in the end?” \\n“For that you have to read the entire story.” \\n“Is there anything left?” \\n“Yes the final paragraph. So what do you think?” \\n“Brilliant! No wonder they selected your story. I mean, we got to know about Sahitya Academy Award only last year when a few recipients returned…but I am sure, it’s a huge recognition.” \\n“Do you think I have a chance of winning it?” \\n“Absolutely. Keep up the good work. Bharat tere tukde honge ,” we concluded the interview on a happy note.'"}, "time": 1742562003.2481308}