{"duration": 0.12813615798950195, "input_args": {"text": "'Nov 6, 2016 Axel Tillmann Opinion \\nThere are plenty of talented Russians working in U.S. tech companies. Such partnerships are sure to create wealth and be beneficial for both countries. \\nRussians have a high chance of succeeding in Silicon Valley if they surround themselves with others whose talents complement their own. Photo: Theory and Practice \\nAlthough it may come as a surprise to many, Russians have long had a presence in the U.S., particularly in Silicon Valley . It’s a mistake, especially for businesspeople, to trust the picture politicians and the media paint of Russia. Many Russian IT companies view Silicon Valley as the promised land, and many Russians have much to contribute here. \\nMost Russians arrive in the U.S. with a strong education and a different way of looking at the world that enables them to “design” products. I speak from experience. In one of my startups, I partnered with a Russian named Vladimir who quietly worked away in his office. Occasionally he would get up from his chair and step to a white board to sketch out his design plans. Eventually there would be the sound of his keyboard clicking as he produced on his screen what he had designed in his mind. Eventually we created a great product. There are plenty of Vladimirs working away in U.S. tech companies. Recommended: \" Russians in America: How to find success in Silicon Valley \" \\nIn other cases, whole Russian companies have found success in the U.S. market. One company worth highlighting is Kaspersky Lab . The Moscow-based firm was a dark horse in the software security business, up against such competition as McAfee and Symantec. Yet today, Kaspersky’s market share is in the top eight of all vendors in the sector, and it is twice the size of McAfee’s. Kaspersky is an important case study in what it takes to be truly successful in the market. The company had a great product, but what made the firm successful was its brilliant go-to-market strategy, crafted in cooperation with North American market managers. \\nWisely, Kaspersky’s leadership chose to tap experts in the local market to craft the company’s strategy rather than trying to do it by themselves. I’m not ashamed to admit that as a German immigrant, I started down the path of launching a product with a limited sense of marketing skills, believing in The Field of Dreams theory, “if we build it, they will come.” Unfortunately, that’s just not so. After a long and painful journey of my own, I finally came around to seeing the benefits of hiring professionals who know how to play the game, but this required that I make a change in my way of thinking. \\nI have met many talented Russians during the last five years and they are hungry to succeed; but most need the same kind of awakening I had in order to create their own success stories. Not everyone will become Google co-founder Sergey Brin, or even Birger Steen, who created the extremely successful software platform Parallels, but the opportunity to be a success is available to all who can combine their love for technological achievements with excellence in marketing and sales. Here are few more examples of innovators with Russian who have found that success: Valentin Gapontsev (IPG Photonics), Yuri Milner (investor), Stepan Pachikov (Evernote), David Yan (ABBYY). \\nSilicon Valley is truly a magical place, and anyone who comes to work here learns quickly that the main advantage of the Valley is the network that exists. Russians have a high chance of succeeding in Silicon Valley if they surround themselves with others whose talents complement their own. One way to do this is to join a networking organization. Two of the larger networking organizations for Russian entrepreneurs and developers are AMBAR (American Business Association of Russian Speaking Processionals) and the Global Technology Symposium, led by the legendary Alexandra Johnson. \\nWhile current geopolitics is encouraging Russian entrepreneurs to take another look at China , culturally Russians are closer to the U.S. mentality . In the long-term, Russia and Russians have little to gain from China. What interests do the Chinese have in helping Russia develop a culture of innovation? Chinese companies have a clear track record of observing the ideas and the scientific research of others, and then reverse engineering it to create their own products. \\nI encourage investors to embrace Russian entrepreneurs and help them find a U.S. partner. Only if we encourage this free entrepreneurial spirit can we stop the long-standing intellectual brain drain that Russia has experienced for so many years. \\nLet’s work together to make some money. \\nThe opinion of the author may not necessarily reflect the position of Russia Direct or its staff. \\nThe article was initially published in Russia Direct’s special project “ U.S.-Russia Shared Frontiers .\" Tags: '"}, "time": 1742564243.9032893}