{"duration": 0.030851364135742188, "input_args": {"text": "'Videos Florida University Students Latest Victims Of On-Campus Racism Students at Florida Gulf Coast University were greeted by “kill n s” and a drawing of a man hanging from a tree on a classroom whiteboard. | October 27, 2016 Be Sociable, Share! The message on the whiteboard read, “Kill N—–s,” along with a drawing of a stick figure hanging from a tree with a rope around its neck. \\nAmid one of the most racist presidential campaigns in the United States, a hateful threat with the words “kill n s” and a drawing of a person hanging from a tree were painted on a whiteboard at Florida Gulf Coast University earlier this month, but police failed to launch an investigation. \\nOfficials believe the vandalism occurred on Oct. 12, soon after it was found by a professor at the university. President Wilson Bradshaw called the incident “deeply disturbing” In a statement released Wednesday, \\n“While occurrences such as this are very rare at FGCU, we strongly condemn this hateful expression which is contrary to the civil and mutually respectful culture of our campus community,” he said. \\nThe person who made the drawing is unknown and the university police department said it could not do anything other than increase patrols in the area. “This was on a whiteboard with the proper type of pens so easily erased, therefore, no vandalism. As there is no crime, there is no hate crime,” Chief of Police Steven Moore said. \\nStudents of color said such threats made them feel less safe in their own classrooms as it was directed at them. “The fact that it is in relation to the way I identify, yeah that’s harsh, that’s … kinda scary,” a student named Cassie told WBBH TV channel. \\nAttacks on Black and other people of color have skyrocketed over the past few years amid a heated national debate and unrest over police killings of unarmed Black people. \\nThe anti-police brutality Black Lives Matter movement was countered by pro-police groups rallying under slogans such as “White lives matter” and “All lives matter” and arguing that African-Americans do not suffer from systemic racism in the country. \\nEarlier this month, the historic Black Ashburn Colored School in Virginia was vandalized with racist graffiti , including swastikas and “white power” slogans, as it was being renovated by a group of local students who looked to turn it into an education museum. \\nAnti-Black sentiment in the U.S. seems to be on the rise. Just last week, a group of white students at Texas State University stormed out of an anthropology class after the professor explained all humans were descended from Africa. \\nThe walkout caused heated debate, with the remaining students chanting “Black lives matter,” and criticizing the racist attitudes of their classmates. \\nThe news comes amid a presidential electoral season that saw white supremacist and neo-Nazi activists using the campaign of Republican candidate Donald Trump to become more vocal and push their racist agendas. \\nNearly half of Trump’s supporters described African-Americans as more “violent” than whites, according to a Reuters poll in June. The same proportion described African-Americans as more “criminal” than whites, while 40 percent described them as more “lazy” than whites. \\nBut racist views crossed party boundaries in the country. The same poll found that one-third of Democratic candidate Hillary Clinton supporters described Black people as more “violent” and “criminal” than whites, and one-quarter described them as more “lazy” than whites. \\nWatch ‘Racial slur in FGCU classroom stirs student outrage’:'"}, "time": 1742628517.9658356}