{"duration": 1.6951613426208496, "input_args": {"text": "'Podesta emails reveal extent of Bill Clinton’s ‘for profit’ activities Podesta emails reveal extent of Bill Clinton’s ‘for profit’ activities By 0 32 \\nConflicts of interest between Bill Clinton and the Clinton Foundation, as well as the former president’s “for profit” activities and acceptance of “expensive gifts” have been revealed in WikiLeaks’ Podesta emails. \\nOne of the emails released by the whistleblowing site from the account of Hillary Clinton’s campaign chair, John Podesta, includes a November 2011 email chain between Podesta and Douglas Band, a former Foundation fundraiser and long time adviser to the Clintons. \\nBand attaches a 12 page document detailing the many ways Bill Clinton had conflicts of interest with the Foundation and his “for profit” activities. \\nBand is co-founder of global PR consulting firm Teneo and worked as Bill Clinton’s personal assistant during his presidency. Teneo had raised millions for the Foundation while also working for Bill Clinton’s personal interests when he was a paid adviser to the company. In 2012, Clinton’s position changed to “friend and unpaid adviser” to Teneo as well as being a client of the company. \\nPrevious Podesta emails have shown that at the time of the memo, Chelsea Clinton was concerned about Band’s conflicts of interests between his work at the Foundation and Teneo. She accused Brand and Teneo co-founder Declan Kelly of profiting off her father and the foundation. \\nShortly after, Band penned the memo to show how Bill Clinton had his own conflicts of interest. \\nThe memo, addressed to lawyers that were working on a review of the foundation, refers to “Bill Clinton Inc.” to describe “more than $50 million for-profit activity we have personally helped to secure for President Clinton to date or the $66 million in future contracts, should he choose to continue with those engagements.” This includes $3 million paid to Bill Clinton for speeches given to clients of the company. \\nBand said his role as “primary fundraiser for the Foundation for the past 11 years” and his work at Teneo allowed him and Kelly to encourage clients to contribute to the Foundation. “Through our efforts, we have brought new donors to the Foundation and garnered increased giving from existing donors,” he said. \\nHe says he also obtained “in-kind services for the President and his family – for personal travel, hospitality, vacation and the like.” \\nThe memo had been discussed in an earlier release by WikiLeaks but no file was attached. In these emails, Band refers to a conflict of interest policy he signed as a board member of the Clinton Global Initiative (CGI). \\nREAD MORE: #Podesta emails: Bill Clinton & Obama worked to influence EU’s Greece austerity deal \\n“Teneo represents 4 cgi sponsors, 3 of which teneo brought to cgi. Oddly, wjc [Bill Clinton] does not have to sign such a document even though he is personally paid by 3 cgi sponsors, gets many expensive gifts from them, some that are at home,” he says. \\nThe memo shows examples of companies paying Bill Clinton directly when they were also donors to the Foundation. \\nFor profit education firm Laureate’s relationship with the Foundation “evolved into a personal advisory services business relationship for President Clinton,” Band wrote. According to the memo, Laureate paid Bill Clinton $3.5 million a year to advise and be the honorary chairman. Clinton was honorary chancellor / chair from 2010 until 2015, and was paid over $16 million. \\nBrand says Dubai-headquartered GEMS Education approached Clinton in 2009 to seek his personal services as an adviser to the company and Band “convinced them to initiate a relationship to the Foundation, which they did.” Bill Clinton has made more than $5.6 million for his role with GEMS, AP reports . \\nCoca Cola gave $4.3 million to the Foundation and promised $2 million more over seven years, the memo reads. According to Band, Kelly introduced Bill Clinton to CEO Muhtar Kent in 2009 at a meeting at Clinton’s home. \\n“Over the course of 2009, Mr. Kelly cultivated Mr. Kent’s interest in the Foundation — first in CGI and the Foundation. Mr. Kelly asked Mr. Kent to give $5 million to the Foundation, which he pledged in early 2010.” \\nCoca Cola has donated between $5-10 million to the Foundation. A set of emails released by DCLeaks this month show the Clinton campaign backed away from her comments on a soda tax in April following angry emails from the company. \\n“Really??? After all we have done,” Coke’s Clyde Tuggle emailed on April 20 to Sarah Latham, Podesta’s current chief of staff and Capr icia Marshall, who has consulted for the Clinton campaign. “I hope this has been falsely reported. Pls give me some talking points for Muhtar [Muhtar Kent, Coke’s CEO] in the am.” \\nAccording to the memo, Dow Chemical has given $780,000 to the Foundation. Kelly invited CEO Andrew Liveris to play golf with Clinton in 2009 and then asked Dow to sponsor CGI. Dow donated $150,000 to the Foundation “for President Clinton to attend a Dow dinner in Davos,” Band said. \\nSwiss financial services company UBS was told to donate to the Foundation before booking Bill Clinton for speeches. “In addition to the $540,000 UBS contributed to the Foundation, Teneo partners have secured a commitment from UBS for President Clinton to deliver three additional paid speeches for them in 2012, should he choose to do so.” \\nUBS paid Bill Clinton $540,000 for speeches in 2011. \\nKelly also “urged and ensured” the American Ireland Fund would be a “significant donor to the Foundation,” and successfully secured “$350,000 to date,” the memo reads. \\nA section of the memo titled “For profit activity of President Clinton” details how the company helps Clinton “secure and engage in for-profit activities, including speeches, books, and advisory service engagements” \\nBand says he and Justin Cooper have “personally helped to secure” over $50 million for the former President and have brought business deals for advisory services to Clinton. \\nThe memo shows Teneo secured a number of speeches for Clinton including telecommunications company Ericsson paying Clinton $750,000 plus $400,000 for a private plane to speak in Hong Kong. \\nTeneo cultivated its client relationship with bank Barclays to help secure two paid speeches in 2010 and 2011 totaling more than $700,000. \\nThe conflict between Band and Chelsea resulted in the well documented “spoiled brat” comment Band made as revealed in earlier batches of the Podesta email leak. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742562602.9818337}