{"duration": 0.04057741165161133, "input_args": {"text": "'There has never been a presumptive nominee for a major party quite like Donald J. Trump. Not only is he a newcomer to the world of politics, but he would shatter the mold of party  . Mr. Trump, who now appears all but certain to clinch his party’s presidential nomination, would be the first in a range of colorful categories. Mr. Trump hosted 14 seasons of “The Apprentice” on NBC, drawing millions of viewers to the show and adding to his personal fortune. He claimed in a personal financial disclosure form that he earned more than $213 million over the course of the show, but NBC never confirmed that claim. Whatever the paycheck, the show gave Mr. Trump something money cannot buy: his signature catchphrase, “You’re fired. ” _____ The candidate has his own “superstar” bio on the World Wrestling Entertainment website, which refers to him as a “captivating billionaire,” a “pop culture icon” and “outspoken alpha male. ” He has clobbered Vince McMahon with a clothesline move and then forcefully shaved his opponent’s head in the ring. He has been on the receiving end of a   move from Stone Cold Steve Austin, and he has a relationship with the organization that goes back to Andre the Giant. In 2013, he was awarded  the highest honor in professional wrestling: an induction into the prestigious Hall of Fame. _____ In 1989, Mr. Trump played himself in “Ghosts Can’t Do It,” a widely panned movie summed up as an “American romantic crime fantasy comedy film. ” The plot involves the main character dying and becoming a ghost, his wife trying to drown a young man so that the deceased husband can inhabit an earthly body again and engage in carnal pleasures again, and so that they can complete a business deal with Mr. Trump (or something like that). The film was a success at the Razzie awards, winning worst picture, worst actress, worst director and worst supporting actor: Mr. Trump. _____ In a Republican Party whose evangelical voting base has grown to become a major, influential voice, in particular in the nominating process, Mr. Trump is the first nominee to have been divorced twice. He divorced his first wife, Ivana, a   model, in 1990, and his second wife, Marla, an actress, in 1999. He married his current wife, Melania, in 2005. _____ Presidential candidates tend to be from the upper crust of American society, and often come from the financial sector, law or a career in politics. Mr. Trump’s wealth came from numerous endeavors, but never before has a casino owner with towering properties in Las Vegas, and previously Atlantic City, held the cards of a major party’s nomination. _____ Mr. Trump has put his name in big gold letters on commercial goods as varied as   and chocolates, something he reminded voters of during a speech in March. He also served Trump wines and water. _____ Mr. Trump is perhaps better known for his involvement in the Miss USA and Miss Universe beauty pageants, but he also founded a modeling agency, Trump Model Management, in 1999. A Jamaican model filed a lawsuit against the company in 2014, but it was thrown out this year. _____ Before he left the race, Senator Ted Cruz shared a parting thought: “If anyone has seen the movie ‘Back to the Future, Part II,’ the screenwriter says that he based the character Biff Tannen on Donald Trump  —   a caricature of a braggadocious, arrogant buffoon who builds giant casinos with giant pictures of him wherever he looks. ” (It is, indeed, true that Mr. Trump served as inspiration for the character.) _____ A grouch with a flamboyant hairstyle and the catchphrase “I have more trash than all of you,” Donald Grump arrived on “Sesame Street” in 2005 looking for an apprentice, or as he put it in a thicker New York accent than Mr. Trump’s, a “helpah. ” He continually needles and belittles those seeking to be his “helpah,” showering them with “nyahs,” and he brags about his wealth. Nonetheless, the other characters are entranced with Mr. Grump. As Oscar the Grouch glows, “His name is on every piece of trash in town. ”'"}, "time": 1742628500.5639627}