{"duration": 1.4623820781707764, "input_args": {"text": "'You have probably heard it yourself: the impression that millennials are financial freewheelers. The theory goes that today’s   or   spend with little regard for savings and even less regard for retiring. Retirement planning experts say that this assumption isn’t entirely accurate  —   though it is perennially true that most young adults don’t make retirement savings a financial priority. But, as the experts point out, millennials are in an ideal position to get started, because whatever they set aside will grow and accrue interest greatly over time. “The value of compounding means you’ll have to contribute less later,” said Maria Bruno, a senior investment strategist at Vanguard, the investment management company. She recommends that people open retirement accounts as early as they can  —   that way, the savings have more time to build and be reinvested. Eventually, the interest an account accrues will begin to earn interest of its own. The New York Times spoke to five people in the   to    age group, a small sample of millennial savers. Two experts from the retirement division of Prudential Financial offered advice and feedback on each person’s profile. Though advice differed based on the individual situation, advisers across the spectrum were consistent on two broader points: ■ Young investors should take advantage of Roth retirement fund options. Roth funds, which include individual retirement accounts and 401( k)’s, differ from traditional retirement accounts in that contributions are made after tax once money is invested, earnings and withdrawals are  . ■ Younger workers should contribute at least as much as an employer is willing to match in a 401( k) or similar program. With this advice in mind, read a snapshot of millennials at various stages of retirement planning. Mr. LaCasse doesn’t see himself jetting off to exotic destinations at the end of his career, but he does hope to have some financial security and independence. He makes about $52, 000 a year and contributes 4 percent of every paycheck to a 403( b) account  —   a retirement account primarily for teachers. His school does not match his contributions, but he did receive an initial,   contribution of $1, 200. He currently has about $6, 000 in a savings account he doesn’t touch, and he puts away a little from every paycheck. Though he would like to save more, Mr. LaCasse worries that he is not in a secure enough position to do so. “There’s kind of a feeling of short term versus long term, and unfortunately the short term comes first  —   I need to cover my    expenses,” he said. “The long term takes a major back seat. ” For one thing, student loan repayments (of nearly $500 a month) represent about a fifth of his monthly expenses and hinder his ability to squirrel away more.  THE ADVICE Stephanie Sherman, a certified financial planner at Prudential, said that Mr. LaCasse might be able to restructure his student loans to give himself more breathing room. “If he has a great credit score, he can refinance them and make the same payment and pay them off quicker, or free up more money for savings,” she said. Mr. LaCasse said he had already considered refinancing and was thinking about it more seriously after hearing Ms. Sherman’s advice. “The process seems so daunting, and it keeps getting pushed aside,” he said. “Now I feel more motivated to do it. ” If she is able to break into theater or film, Ms. Craven would like to keep working for a lifetime. “As an actor, I’m going to want to tell stories and do that as long as I can,” she said. Even so, she hopes by her late 60s or early 70s to prioritize family time and traveling. Though she has never had a job with retirement benefits, she would be comfortable putting aside 5 to 10 percent of her $45, 000 income on her own. She already has $7, 500 in savings, but not in a formal retirement account. Her main concern is seasonal fluctuations in her salary that could derail a   savings plan. “I’m in a very busy season for work right now, so I’m making more money, but once the tourists go away, it’ll be back to scraping by,” Ms. Craven said. THE ADVICE Ms. Craven said she felt she wasn’t doing enough to save for retirement, but the experts saw things differently. “Mollie sounds like she has it all together,” Ms. Sherman said, noting how much she already has in savings. She didn’t deny that seasonal income fluctuations were a challenge, but said that there were many ways to plan around them. She suggested that Ms. Craven find a financial adviser to develop a personalized strategy and perhaps open an independent retirement account. Ms. Sherman also explained that many people in the entertainment field built retirement benefit credits through organizations that they worked for, but that these benefits were not always well advertised to contractors. Ms. Craven said that she was fairly certain she had not accrued retirement credits through her performances, but was interested in finding an adviser and considering a formal retirement account. “It does seem disheartening that the savings account that I have just sits there and doesn’t grow hardly at all, maybe a cent every month or so,” she said. “I’d love to put some of that away and not touch it. ” Although he has worked at his current company, Redwood Logistics, for more than three years, Mr. Ruger has been hesitant to invest in its 401( k). “It’s such a millennial thing, but I don’t want to have to commit to a job,” he said. His career goal is to wind up on Broadway. And while he does some singing gigs on the side, the older he gets, the less likely he figures he is to start a   acting career. He doesn’t have a definite vision for his retirement, either. “If I’m being totally honest, I never saw myself as having that option,” Mr. Ruger said. He has a few thousand dollars in a checking account, but no specific savings. He also has a lot of college debt. “We’re paying off these crazy student loans with these crazy interest rates,” Mr. Ruger said. “Stuff that requires money  —   like houses and cars and retirement  —   are not in the cards. We can just pay off the interest on our student loans and our rent, and work until we die. ” Further on the topic of his company’s 401( k) Mr. Ruger said he was unsure how the plan worked and worried about losing his investment if he ever left the job. THE ADVICE Crystal Vacura, a retirement counselor at Prudential, said that Mr. Ruger’s feelings were not uncommon: Many people are hesitant to invest in a 401( k) for reasons like procrastination or confusion. She pointed out to Mr. Ruger that 401( k) contributions could usually stay invested in the original fund or could roll over into new accounts if he switched employers or went freelance. She also suggested that Mr. Ruger put aside all of the earnings from his singing gigs into a dedicated savings account: If he is really not comfortable with a   401( k) he should consider opening an I. R. A. she said. Mr. Ruger particularly liked Mrs. Vacura’s suggestion of investing the money he earned from singing, and said that if he had to choose between a 401( k) and an I. R. A. “I’d go with getting my act together and opening a retirement account through my job, because they offer one, and it’s ridiculous that I haven’t done that yet. ” As a state employee, Ms. King is eligible to invest in the Ohio Public Employees Retirement System, and she anticipates staying with her employer for the duration. “I hope to retire at some point  —   my expectation is, after 30 years of service,” she said. “Because I am working for a public institution, 30 years is pretty much the standard. ” She has been in her current role for only three years, but was able to start contributing to Opers (the acronym for the Ohio retirement system) as a student employee and already has $15, 000 in her account. Though she has no other formal savings, Ms. King owns a house and contributes 10 percent of her $   salary to the account, with the university contributing an additional 14 percent. Ms. King is paying off student loans but expects to be   by the end of the winter, at which point she will be able to diversify her savings plan and increase her contributions by as much as 25 or 50 percent. THE ADVICE “Cherita certainly seems   on paying off her student loans,” Ms. Sherman said. “She also seems very focused on redirecting that to increasing her retirement savings. ” Ms. Sherman and Ms. Vacura agreed that Ms. King was in a good position for retirement, though they recommended that she open a separate “rainy day” savings account. Ms. King said the rainy day fund was her next priority after paying off her student loans. And she was happy her efforts had won good reviews. “It’s validating to hear that people who know about finance are saying I’m on the right track,” she said. Ms. Hamilton has been planning for her retirement since she was 17. “I took a class in high school, and they showed me the building of compounding interest,” she said. That prompted her to get a weekend job and put her earnings into an I. R. A. which has grown to about $30, 000. She also has a separate 401( k) through her employer, with a similar amount invested. “I want to work really hard now and save really hard so I can travel the world and not have to worry about finances” in retirement, Ms. Hamilton said. Her husband is a strong partner in her savings plan. When they married last year, they agreed to live on a single income and put the rest into savings: They already have more than $100, 000. Ms. Hamilton is very reluctant to touch her primary income for anything beyond basic necessities. When the time came to buy new furniture, she got a weekend job at Restoration Hardware to cover the expense. THE ADVICE Ms. Sherman of Prudential said that while Ms. Hamilton would seem to be a model of thrift, she could be even more proactive, perhaps by buying life insurance or opening a   retirement savings plan. “Really start to address the things that could derail your retirement, as you’re a fabulous saver,” she suggested. Ms. Hamilton said that her personal financial adviser gave similar feedback and that she was encouraged to be receiving such consistent advice about reaching her goals. “I may not make a million dollars a year, but I feel like I can one day hopefully have a retirement that’s comparable,” she said.'"}, "time": 1742564236.8220704}