{"duration": 0.06780552864074707, "input_args": {"text": "'Students at an Iowa high school have been criticized for wearing red, white, and blue clothing to a recent basketball game with some calling the patriotic colors “racist. ”[As they have done several times in the past, students at Valley High from Des Moines, Iowa, organized a U. S. A. colors day and wore red, white, and blue and U. S.   clothing to last week’s game against North High School.  But the effort was deemed “controversial” by members of North High because their school has a “diverse” student body. “A lot of people were very upset about it,” North sophomore DeNasja Spencer told CBS affiliate KCCI TV. “Even if that was their theme for the game, I feel like they should have switched that because everyone knows North is a more diverse school,” she added. On Facebook, a Valley High alum named Ty Leggett slammed the students. “This is an example of BLATANT racism,” he wrote. “ALL participating should have been pulled and banned from ALL VHS extracurricular events for the remainder of the year! As a parent, I’d be mortified that my son or daughter thought this way, acted in this fashion and refrained from taking a stand against this 21st century inexcusable behavior!” Des Moines North coach Chad Ryan claimed he didn’t want to “judge those young people not knowing their motive,” but went on to say, “It’s been good for us, as a school. They learn from each other about people with different cultures and backgrounds  —   and we try to use it as an educational piece. ” This isn’t the first time Valley has sponsored a patriotic day. Valley High fans reportedly wore patriotic colors during a football game against rival Dowling Catholic this year as well. “We had a USA theme, which we’ve done many times in the past,” Valley freshman Dayna Dunnwald told the media. “It’s really sad, and I hope everyone can resolve it in the end because no one at Valley meant it in that way. And it was just for fun. ” Another student, Melissa   was disgusted by the attacks on her school, “Now we can’t wear USA stuff without making someone upset? Oh please  …    . ” Despite the past patriotic events, Valley High School’s student leadership members apologized to North High’s principal. “It has been brought to our attention that the decision by the Valley High School student section to wear U. S. A. apparel at our game last night was offensive to members of your community and fan base,” the student letter read. “We are deeply sorry if we have offended anyone in any way. We have traditionally dressed in such a fashion for great games such as the one last night. Everyone here at Valley has immense respect not only for your team and players but for your community as a whole. Please know that our intent was in no way to offend or demean —  just to support our own team in a way we have done before. ” Valley High’s Tigers ended up defeating the Des Moines North Polar Bears  . Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742564559.6821475}