{"duration": 0.07941627502441406, "input_args": {"text": "'LONDON  —   As heartbroken friends and fans mourned George Michael online and at his homes across Britain on Monday, questions swirled about the health and final weeks of the electrifying pop singer before his death on Christmas Day at the age of 53. Once an indisputable sex symbol of the   era, Mr. Michael appeared overweight and nearly unrecognizable in photographs, reportedly from September, that the website TMZ published on Monday. News media attention also fell on a 2015 tabloid interview with a relative claiming that Mr. Michael was abusing drugs and putting his life at risk. And after years of arrests related to drug use, as well as confessional interviews and health scares, the singer had largely retreated from the public eye, while his creative output had all but ceased. [ Why George Michael mattered | Read the obituary ] Paul Gambaccini, a radio and television presenter who had known Mr. Michael since youth and represented him during a 2011 tour, said in an interview that he was not surprised by the singer’s death because Mr. Michael was “not completely well” and had a “close brush with death” five years ago when he nearly succumbed to a bout of pneumonia. Doctors had to perform a tracheotomy. Police officials, who had announced that Mr. Michael died in “unexplained but not suspicious” circumstances at his home in    England, could not be reached for further details on Monday because of Boxing Day. The singer’s manager, Michael Lippman, on Monday declined to elaborate on his statement that Mr. Michael had died of heart failure, “in bed, lying peacefully. ” Forensic experts said an autopsy report could be ready in a couple of days. While admirers sought to focus on Mr. Michael’s previously unreported donations and philanthropy, and neighbors remembered his charm as a   celebrity in their midst, a more complicated image of Mr. Michael’s life in recent years loomed, as well. Several friends and associates, while declining to discuss details of his health, noted that Mr. Michael had a long history of hard living. In 2007, he was sentenced to community service and barred from driving for two years after he had been found asleep at the wheel and under the influence of drugs. The next year, he was arrested in London on suspicion of possessing crack cocaine. “I’ve done different things at different times that I shouldn’t have done, once or twice, you know,” Mr. Michael said in a 2009 interview with The Guardian, in which he discussed his ups and downs with sex, sleeping pills, marijuana and crack. “People want to see me as tragic,” he said. “I don’t even see them as weaknesses anymore. It’s just who I am. ” In the summer of 2015, Mr. Michael and his publicists denied that he was facing serious drug addiction after a report published in a British tabloid, The Sun, quoted the wife of a family member saying, “I’m petrified he will die. ” Mr. Michael responded on Twitter, “To my lovelies, do not believe this rubbish in the papers today by someone I don’t know anymore and haven’t seen for nearly 18 years. ” He added, “I am perfectly fine. ” Rather than dwell on Mr. Michael’s difficulties, some close friends on Monday highlighted another dimension of the man they knew, describing him as a generous benefactor given to quiet and spontaneous acts of kindness. “He was a closet philanthropist,” Mr. Gambaccini said. Mr. Gambaccini recalled how in 1994 the British government cut aid to the Terrence Higgins Trust, an AIDS charity. To make up for the shortfall, Mr. Gambaccini, a patron of the trust, said he had sought to raise 300, 000 pounds. But in the end, he did not have to try too hard, he said. Mr. Michael donated most of the money. “He never wanted public recognition,” Mr. Gambaccini said. The television presenter Richard Osman wrote on Twitter on Monday that Mr. Michael had secretly contacted a woman who appeared on “Deal or No Deal,” a British game show, to give her £15, 000 needed for an in vitro fertilization treatment. Sali Hughes, an author, wrote on Twitter that Mr. Michael had once tipped a waitress £5, 000 “because she was a student nurse in debt. ” And Emilyne Mondo, a volunteer at a shelter for homeless people, posted that Mr. Michael had worked there anonymously. “I’ve never told anyone,” she said. “He asked we didn’t. That’s who he was. ” For some neighbors of Mr. Michael, his turn away from the spotlight and toward personal privacy made him just another member of the community. Amanda Holland, 56, a neighbor of Mr. Michael in    in Oxfordshire, and an amateur actor, once invited him to a play in which she was performing. “He’s an international superstar  —   I thought, ‘There’s no way he would come to a local thing,’” she recalled. “But he did, and he was fabulous, and he was kind and he was generous. ” Mr. Michael, whose legal name was Georgios Kyriacos Panayiotou, was born in 1963, the youngest of three children of Kyriacos Panayiotou, a Greek Cypriot immigrant, and the former Lesley Angold Harrison. He formed Wham! with a schoolmate, Andrew Ridgeley, who wrote on Twitter on Sunday that he was “cleft with grief. ” Mr. Michael was famous by age 20. “I’m not stupid enough to think that I can deal with another 10 or 15 years of major exposure,” Mr. Michael told The Los Angeles Times in a 1990 interview. “I think that is the ultimate tragedy of fame.   …     People who are simply out of control, who are lost. I’ve seen so many of them, and I don’t want to be another cliché. ” (The interview prompted a retort from Frank Sinatra, who wrote to him in an open letter: “Be grateful to carry the baggage we’ve all had to carry since those lean nights of sleeping on buses and helping the driver unload the instruments. ”) Mr. Michael  —   known for hits like “Wake Me Up Before You ” “Faith” and “Careless Whisper”  —   famously came out as gay in 1998, after the end of a protracted legal battle with Sony Music, and shortly after he had been arrested on charges of lewd conduct in a men’s room in Beverly Hills, Calif. In a 2004 interview with the British edition of GQ, Mr. Michael spoke frankly about losing his partner, Anselmo Feleppa, a Brazilian, to AIDS in 1993. At the time of Mr. Feleppa’s death, Mr. Michael was still in the closet, and the antiretroviral drugs that helped AIDS become a manageable disease, and not necessarily a fatal one, had yet to become widely available. “I’m still convinced that had he been in the U. S. A. or London, he would have survived, because just six months later everyone was on combination therapy,” Mr. Michael said in the interview. “I think he went to Brazil because he feared what my fame would do to him and his family if he got treatment elsewhere. I was devastated by that. ” Mr. Michael’s mother died a few years later, leading to depression, he said. “Losing your mother and your lover in the space of three years is a tough one. ” His final tour, “Symphonica,” ended in the fall of 2012, and a live album drawn from those performances, released in 2014, represented his most recent commercial output. (“Patience,” his previous album of original songs, was released in 2004.) There was some potential movement in his career of late. This year, Mr. Michael received a bump in   relevance when the film “Keanu,” a comedy from   Key and Jordan Peele, featured his music prominently in its plot  —   and not as the butt of a joke, as Mr. Michael had come to be treated by some, especially after his 1998 arrest in Beverly Hills. The filmmakers assured Mr. Michael’s manager, Mr. Lippman, that they would use his music respectfully. “A golden opportunity dropped in our laps,” Mr. Lippman told Billboard, and then went on to tease the rerelease of Mr. Michael’s 1990 solo album, “Listen Without Prejudice Vol. 1,” which had been expected this fall. “We were trying to find as much exposure as possible. ” (That reissue was subsequently pushed back to March 2017, to coincide with a documentary, “Freedom,” about Mr. Michael’s life.) The producer Naughty Boy, who has worked with Beyoncé and Sam Smith, told the BBC this month that new music from Mr. Michael was also a possibility. “He’s got an album coming out next year, and he’s going to be doing something for my album as well,” Naughty Boy said. “I don’t know what to expect. And, to be honest, he’s more mysterious than anyone else, so I’m actually excited. ”'"}, "time": 1742628510.8043594}