{"duration": 0.04378104209899902, "input_args": {"text": "'\\nThis article was written by Tyler Durden and originally published at Zero Hedge . \\nEditor’s Comment: She’s back! Just over a week after the election, Hillary made her first public appearance again, though she looked a bit worse for wear. Nonetheless, she stuck to the script and talked up the importance of supporting children, more than once quoting Martin Luther King, Jr.’s statement, “The arc of the moral universe is long, but it bends towards justice.” Apparently, it was a gig that had been planned to parallel the first event she made with Bill just after his election back in 1992. \\nHer admission at being disappointed by the election is surprise, but it is a sign that she doesn’t plan on going away, and may well be around, though in what capacity isn’t clear. \\nWar-Torn Hillary Emerges: “I Will Admit, Coming Here Tonight Wasn’t The Easiest Thing” \\nby Tyler Durden\\nHillary emerged from hiding today, for the first time since her concession speech on November 9th, to give a speech at the Children’s Defense Fund gala in Washington D.C. The weathered look on her face indicated that she’s had a pretty rough week and maybe a “medical episode” or two. That said, we suspect her typical $250,000 – $500,000 speaking fee was simply too much to pass up…crying in bed with the dogs can wait just one day.\\n“I will admit, coming here tonight wasn’t the easiest thing for me. There have been a few times this past week where all I wanted to do was curl up with a good book and our dogs and never leave the house again. ”\\nWhile the idea of the Clintons retiring from the public eye forever would certainly be welcome news for about half of the country, somehow we suspect that’s not likely to happen.\\nHillary’s comments , among other things, touched on the disappointment of the election results which she is clearly still trying to absorb herself.\\n“I know many of you are deeply disappointed by the results of the election. I am too, more than I can ever express.” \\n“But as I said last week, our campaign was never about one person or even one election. It was about the country we love, and building an America that is hopeful, inclusive and big hearted.”\\n“For the sake of our children, and our families and our country, I ask you to stay engaged, stay engaged on every level.” \\n“ The divisions laid bare by this election run deep , but please listen to me when I say this. America is worth it, our children are worth it.”\\n“ Believe in our country, fight for our values and never, ever give up .”\\nAs Bloomberg points out, Hillary’s appearance at the event was planned before election day and was supposed to be a post-election victory lap since it was also the first event the Clinton’s attended after Bill’s election.\\nClinton’s appearance was planned before Election Day and, had she won, would have been a clear signal that she was staying true to her roots. Instead, it was an opportunity for her to begin to chart a path ahead after a loss she didn’t expect and a wake of sorts for ardent supporters and staff. Marian Wright Edelman, the Children’s Defense Fund’s founder, described the event as “a love-in for our dear friend” and noted Clinton has a lead of more than 1 million in the popular vote. “She is the people’s president!”\\nClinton didn’t hint at her future plans except to suggest that she’ll keep doing what she’s done throughout her career. “America is still the greatest country in the world. this is still the place where anyone can beat the odds. It’s up to each and every one of us to keep working to make America better and stronger and fairer,” she said.\\nIronically, Hillary still said nothing to the 1,000’s of violent rioters in NYC, Oakland and Portland who have decided that destroying other people’s property is the appropriate way to deal with their grief. \\nWith that, here are Hillary’s full remarks:\\n\\nThis article was written by Tyler Durden and originally published at Zero Hedge . '"}, "time": 1742628481.1731963}