{"duration": 0.03167462348937988, "input_args": {"text": "'The       British newspaper the Guardian has published anonymous source claims that Brexit leader Nigel Farage is a “person of interest” in an FBI investigation into collusion between the Trump campaign and Russia. [Despite stating in their fourth paragraph that the former UKIP chief Nigel Farage “has not been accused of wrongdoing and is not a suspect or a target of the U. S. investigation” authors Stephanie Kirchgaessner, Nick Hopkins, and Luke Harding composed 2000 words claiming “sources” told them about the FBI’s interest in Mr. Farage.  Not naming sources, or even who or where they work, the Guardian reports the British MEP is a “person of interest” to the FBI  —   if only because he has met several members of the President’s administration and sought to interview Wikileaks founder Julian Assange in his capacity as an LBC radio presenter. The Guardian quotes anonymous informants  —   though it is not clear if there is more than one  —   as embellishing these links to present Farage as a   figure, describing how, “If you triangulate Russia, WikiLeaks, Assange and Trump associates the person who comes up with the most hits is Nigel Farage. “He’s right in the middle of these relationships. He turns up over and over again. There’s a lot of attention being paid to him. ” Responding in a statement seen by Breitbart London, the veteran Brexit campaigner said it took him “a long time to finish reading” the article because he was “laughing so much”. “This is fake news,” he said. “This hysterical attempt to associate me with the Putin regime is a result of the liberal elite being unable to accept Brexit and the election of President Trump. “For the record I have never been to Russia, I’ve had no business dealings with Russia in my previous life and I have appeared approximately three times on RT in the last 18 months. “I consider it extremely doubtful that I could be a person of interest to the FBI as I have no connections to Russia. ” Farage also reiterated that his “meeting with Julian Assange was organised for me by LBC Radio with a view to conducting an interview. ” In response to the Guardian article, it has taken me a long time to finish reading because I am laughing so much at this fake news.  —   Nigel Farage (@Nigel_Farage) June 1, 2017, '"}, "time": 1742628495.4517045}