{"duration": 0.1574268341064453, "input_args": {"text": "'Welcome to Breitbart News’s third day of inauguration coverage. President Donald Trump attended a   inaugural prayer service this morning and then delivered remarks at the CIA headquarters “to thank the men and women of the intelligence community. ” Meanwhile, women’s rights and   activists took to the streets in Washington, D. C. and in “sister marches” around the world to protest the election of President Trump the day after his inauguration. [All times eastern.  10:1o PM:  “And the reason you’re my first stop is that, as you know, I have a running war with the media. They are among the most dishonest human beings on earth,” Trump said. The approximately 400 CIA employees broke out into applause after Trump said this. In addition to making it seem, falsely, like he was in a feud with the intelligence community, Trump said the media “showed an empty field” during his inauguration. “We had a massive field of people. You saw that, packed,” Trump said. He then noted that when he woke up Saturday morning, he turned on the TV and noticed, “I get up this morning, I turn on one of the networks and they show an empty field. I said, wait a minute. I made a speech. I looked out. The field was, it looked like a million  —   a million and a half people. They showed a field where there were practically nobody standing there. And they said, ‘Donald Trump did not draw well. ’”  He added, “We have something that’s amazing because we had it looked  —   honestly, it looked like a million and a half people. Whatever it was, it was. But it went all the way back to the Washington Monument. And I turn on [the tv] and by mistake I get this network, and it showed an empty field. ” “So, we caught them,” he said. “And we caught them in a beauty, and I think they’re going to pay a big price. ”  Trump went on to note yet another lie perpetuated by the media. Specifically, Zeke Miller of Time magazine falsely reported that Trump removed the bust of Dr. Martin Luther King, Jr. from the Oval Office. The bust of the esteemed, late civil rights leader was never removed. (President Barack Obama had removed the bust of Winston Churchill from the Oval Office shortly after he moved in and replaced it with MLK Jr. ’s). “In the Oval Office, there’s a beautiful statue of Dr. Martin Luther King,” Trump said. “And, I also happen to like Churchill  …     He doesn’t come from our country, but had a lot do with it. He helped us, real ally. ” Trump had requested that Churchill’s bust be replaced in the Oval Office upon his move into the White House. “But there was a cameraman that was right in front of it. So Zeke, Zeke from Time Magazine” wrote a fake news story, Trump said. “I would never do that. I have great respect for Dr. Martin Luther King. And it was right there. But this is how dishonest the media is. ” Trump added, “I love honesty. I like honest reporting. ”  And finally, he told the CIA, “I love you. I respect you. There’s nobody I respect more. you’re going to do a fantastic job. And we are going to start winning again, and you are going to lead the charge. Thank you. I’ll be back. ” White House Press Secretary Sean Spicer also pointed out the lies perpetuated by the media during his emergency press conference Saturday. “Some members of the media were engaged in deliberately false reporting,” Spicer said. “Photographs of the Inauguration proceeding were intentionally framed in a way to minimize the enormous support it had gathered on the National Mall,” he said.  He noted earlier how Miller of Time magazine “falsely tweeted out that the bust of MLK, Jr. had been removed from the Oval Office. “This was just plain wrong. ” 7:20 PM:  “Some members of the media were engaged in deliberately false reporting,” Spicer said. He explained that one reporter “falsely tweeted out that the bust of Martin Luther King, Jr. had been removed form the Oval Office  …     This was just plain wrong. ”  The false report, which Spicer described as “irresponsible and reckless,” came from TIME magazine pool reporter Zeke Miller: Tweeting again: wh aide confirms the MLK bust is still there. I looked for it in the oval 2x  didn’t see it. My apologies to my colleagues,  —   Zeke Miller (@ZekeJMiller) January 21, 2017,  Apology accepted https:  .   —   Sean Spicer (@PressSec) January 21, 2017,  Thanks to White House Chief of Staff for this wonderful picture of the MLK bust in the oval pic. twitter.   —   Sean Spicer (@PressSec) January 21, 2017,  Spicer further noted that the media had attempted to paint Trump’s inauguration as appearing much smaller than President Barack Obama’s. “Photographs of the Inauguration proceeding were intentionally framed in a way to minimize the enormous support it had gathered on the National Mall,” Spicer said. He added, it was the first time in the nation’s history that white floor coverings had been used to protect the grass and that they amplified empty spaces, whereas the grass had minimized the appearance of spaces in the past.  “Inaccurate numbers regarding crowd size were also tweeted,” Spicer said. “No one had numbers, because the National Park Service, which controls the National Mall does not put any out. ” He said this also applies to any attempts to count the numbers of protesters during the “Women’s March” on Saturday.   “There’s been a lot of talk in the media about holding President Trump accountable. Well, I’m here to tell you that it goes two ways. We’re going to hold the press accountable as well. The American people deserve better,” Spicer said. “And as long as he serves as the messenger of this incredible movement, he will take this message directly to the American people where his focus will always be. ”  Spicer’s criticism of the media’s fake news reporting resulted in a media meltdown on social media. MSNBC correspondent   Reid called Spicer “the new Baghdad Bob. ” Sean Spicer is the new Baghdad Bob. That was positively Soviet. https:  .   —   Joy Reid (@JoyAnnReid) January 21, 2017,    Think Progress’s Judd Legum suggested Spicer had “torched his credibility” for confronting the media’s misreporting with the truth: Spicer torching his credibility on DAY ONE,  —   Judd Legum (@JuddLegum) January 21, 2017,  Naturally, other media figures from the New York Times, Washington Post, Huffington Post, and Salon also complained:  In that rendition of history Spicer gave, with no q’s taken and false info given, the reality of what’s happening w rallies doesn’t exist.  —   Maggie Haberman (@maggieNYT) January 21, 2017,  Spicer, before walking out without questions, says they will begin to hold the press ”accountable.” No idea what that means.  —   Maggie Haberman (@maggieNYT) January 21, 2017,  I’m relieved @PressSec Spicer hauled in press to whine about crowd estimates. I worried he was going to announce we nuked Denmark.  —   Dana Milbank (@Milbank) January 21, 2017,  1) 100% false 2) Spicer knows it 3) Trump trotted out Spicer to say this and watched 4) this is ridiculous. https:  .   —   Jennifer Bendery (@jbendery) January 21, 2017,  OMG: Spicer is accusing media of ”intentionally framing” photographs to minimize inauguration turnout!  —   Joan Walsh (@joanwalsh) January 21, 2017,  5:32 PM: “We won’t go away, welcome to your first day,” women marchers chanted near the White House.  It’s ironic that they’re threatening to never leave, since many of the protesters are actually leaving tomorrow or the next day after having been bussed in from around the country and even from Canada.  For them to actually stay and occupy Washington, D. C. would cost millions per day —  an unrealistic possibility. It’s much more likely these protesters are going to catch their bus or their flight home in the next day or so and depart the national political stage without gaining any real ground. Part of the reason for their looming irrelevancy was evident in the disorganized nature of the march —  which was actually more of a giant gathering downtown. Protesters did not have a clear message of what they were asking for —  other than venting anger at the fact Donald Trump is the duly elected and inaugurated president of the United States —  and did not even march in a coordinated way in any particular direction throughout DC other than to just wander around in groups of a few hundred chanting one thing or another like the aforementioned threat to never leave or another age old Democratic Party protester chant “This is what Democracy looks like. ” Sure, celebrities like Madonna and Ashley Judd and top Democrats like newly elected California Sen. Kamala Harris joined in with speeches but the largely incoherent message that asks for nothing reasonable —  the only thing they seem to be demanding is that President Trump go away, something that will not happen —  leaves the women marchers against Trump leaving Washington empty handed. 4:48 PM: “Yes, I’m angry. Yes, I’m outraged. Yes, I have thought an awful lot about blowing up the White House, but I know that this won’t change anything,” Madonna told the crowd to roaring applause.   Are you ready to shake up the world?” Madonna asked the crowd. “Welcome to the revolution of love, to the rebellion, to out refusal as women to accept this new age of tyranny, where not just women are in danger but all regionalized people. Where being uniquely different, right now, might truly be considered a crime. ” Moments later, Madonna dropped the   on live TV. According to The Hollywood Reporter, “The singer’s remarks aired uncensored on   CNN and MSNBC. ” “It took this horrific moment of darkness to wake us the fuck up. ” she said. The pop   performed two of her biggest songs “Express Yourself” and “Human Nature. ” During the latter, Madonna changed the song’s lyric to say “Donald Trump —  suck a dick. ” She also led the crowd of   revelers in a chant: “I’m not your bitch. ” Madonna also sent a vulgar message to her and protester’s “detractors. ” “And to our detractors that insist that this march will never add up to anything, fuck you! Fuck You!” she said. Madonna at #WomensMarch: “It took this horrific moment of darkness to wake the f —   up. ” pic. twitter.   —   Hollywood Reporter (@THR) January 21, 2017,  3:11 PM: Good to note that while this strange affair is happening  —   with Madonna dropping   and dancing around like the aging “fairground stripper” Elton John once accused her of being, Ashley Judd spewing vile accusations of incest, and Michael Moore bellowing about “Trump carnage”  —   the Trump and Pence families quietly and reverently attended church today and then the president met with the CIA. 3:02 PM: Breitbart’s Dr. Susan Berry reports: The tens of thousands of women marching in the   Women’s March on Washington demonstration in Washington, D. C. Saturday are “mostly white” and experiencing “therapy” for their anxiety over Hillary Clinton’s election loss to Donald Trump in November, the Washington Post reports. Read the rest here. 2:53 PM: The Fahrenheit   director offered the crowd of   Trump protesters some advice on how to stop the nomination of Betty DeVos, President Trump’s pick to head the Department of Education.  “On Monday, call (202)  . Call your representative and your two Senators, and number one we do not accept Betty DeVos as our secretary of education,” Moore told the crowd. “That’s day one. Make it part of your daily routine. ” “I want you to make this a part of your new daily routine: Call Congress every single day,” he added. “Brush your teeth, make the coffee, walk the dog and call Congress. ” Moore also declared war on the Democratic Party, saying, “the old guard of the Democratic Party has to go. ” “We have to take over the Democratic Party,” Moore said. “God bless the Democrats who fought with us. Who’ve done so many good things. It’s no knock on them” he explained before railing against the Electoral College. “Twice now, we won the White House, yet they walked through the door!” At one point during his   speech, Moore held up a copy of Saturday’s Washington Post and ripped it up. “I don’t think so!” Moore said while holding up the newspaper with a headline that read “Trump Takes Power. ” At Women’s March on Washington, Michael Moore rips up front page on Pres. Trump’s inauguration https:  .  pic. twitter.   —   ABC News (@ABC) January 21, 2017,  “Look at what we’ve already accomplish here today,” Moore told the crowd. “The majority of Americans didn’t want Donald J. Trump in the White House and we’re here today as their representatives. ” 2:28 PM: A number of news media outlets are reporting on the numbers at the   protest crowd, speculating that it might be bigger than the inauguration crowd the day before. No hard numbers are available yet. But it’s useful to remember what Breitbart’s Daniel Flynn noted yesterday when he wrote: MSNBC’s Rachel Maddow juxtaposed Barack Obama’s inauguration boasting people as far as the eye can see with Trump’s crowd failing to extend to the Washington Monument. She didn’t mention that Washington, D. C. favored Mrs. Clinton over Mr. Trump 91 percent to four percent on Election Day. Nor did she speak of the local welcome wagon, which on Inauguration Eve gored Trump supporters with flagpoles and read “Make America Great Again” on hats as “Please Throw a Battery at Me. ” Sometimes watching at home is the better part of valor. 2:10 PM: Actress Ashley Judd grotesquely accused President Trump of incest, claiming that he has “wet dreams” about his own daughter. Video of her remarks are here. So much for “When they go low  …    ” 2:05 PM: Photo from Breitbart’s Raheem Kassam below. These folks aren’t the “picking up after yourselves” types like the Tea Party members who famously left the Mall in DC cleaner than they found it in 2010 during the Restoring Honor Rally.  2:04 PM: “It’s been a heartrending time to be both a woman and an immigrant in this country,” the Ugly Betty star said. “Our dignity, our character, our rights have all been under attack, and a platform of hate and division assumed power yesterday. ”  Ferrera, who spoke at the Democratic National Convention last summer, said that the Trump administration and the   Congress don’t represent America. “But the president is not America. His cabinet is not America. Congress is not America,” she said. “We are America. And we are here to stay. ” Actress America Ferrera speaks at the #WomensMarch in Washington, DC: ”Our rights have all been under attack” https:  .   —   CNN Politics (@CNNPolitics) January 21, 2017,  “We march today for our families and our neighbors, for our future, for the causes we claim and for the causes that claim us,” the    actress added. Ferrera told the crowd of protesters that President Trump is not the “moral core” of America. “We march today for the moral core of this nation, against which our new president is waging a war. He would like us to forget the words, ‘Give me your tired, your poor, your huddled masses, yearning to breathe free,’ and instead, take up a credo of hatred,” she said. The Women’s March on Washington coincide Saturday with dozens of   protests around the world. Hillary Clinton took to Twitter Saturday to show support for the protesters marching and rallying against Trump. “Thanks for standing, speaking  marching for our values @womensmarch. Important as ever,” Clinton tweeted. “I truly believe we’re always Stronger Together. ” Thanks for standing, speaking  marching for our values @womensmarch. Important as ever. I truly believe we’re always Stronger Together.  —   Hillary Clinton (@HillaryClinton) January 21, 2017,  12:00 PM: Breitbart News’ Amanda House, Lee Stranahan, and Raheem Kassam report that turnout for the march in Washington, D. C. is massive, with a “sea of pink pussy hats” clogging the streets. Huge crowds at today’s #WomanMarch pic. twitter.   —   Lee Stranahan (@stranahan) January 21, 2017,  Thanks for standing, speaking  marching for our values @womensmarch. Important as ever. I truly believe we’re always Stronger Together.  —   Hillary Clinton (@HillaryClinton) January 21, 2017, '"}, "time": 1742628531.4868023}