{"duration": 0.07282376289367676, "input_args": {"text": "'As Donald Trump was inaugurated as the 45th President of the United States, leftists were freaking out on Twitter, causing topics such as “Donald the Unready” and “Mourning in America” to trend early in the day.[ Even conservative commentator and ardent   Bill Kristol got in on the act:  I’ll be unembarrassedly   here: It is profoundly depressing and vulgar to hear an American president proclaim ”America First.”  —   Bill Kristol (@BillKristol) January 20, 2017,  I’m sorry but where in this speech sounds like he wants to unify the country? #justsaying #notimpressed A divisive speech. #Inauguration pic. twitter.   —   gray denníse ruiz (@graydennise23) January 20, 2017,  All this talk about God and the Bible is ironic considering Satan is now the president. #Inauguration #TrumpInauguration #PresidentTrump,  —   John Wood (@woodywoods12345) January 20, 2017,  ”You will never be ignored again  …    unless you are black, brown, Asian, woman, Muslim, poor, immigrant, LGBT.” #Inauguration,  —   Wajahat Ali (@WajahatAli) January 20, 2017,  `When you open your heart to patriotism, there is no room for prejudice’ OK Don. If you say so. pic. twitter.   —   Michael Moran (@TheMichaelMoran) January 20, 2017,  Alright, this side show is over. Now to see some broken promises n Trump supporters deny it n push a race war. #DisruptJ20 #Inauguration,  —   jesse abundis (@jessenovels) January 20, 2017,  This morning, #Climate activists in DC opposed hate, misogyny, Islamophobia, and environmental destruction. #UnitedResistance #DisruptJ20 pic. twitter.   —   RAN (@RAN) January 20, 2017,  Rain is a perfect day for Inaguration, a day of mourning in America, now AmeriKKKa #TrumpInauguration AmeriKKKa,  —   Nichole Clay (@templeclay) January 20, 2017,  I mourn for what our country could of been. For the country I want my daughters to live in. Mourning in America pic. twitter.   —   Koeper (@KarenKoeper) January 20, 2017,  Good stuff trending already, ”Donald the unready” ”Mourning in America” We are definitely the majority#TheResistance #ImpeachmentSoon pic. twitter.   —   CaptainsLog2017  🖖🏽 (@CaptainsLog2017) January 20, 2017,  if ihear the word tr*mp one more time im gonna cr y,  —   m💙JIMIN (@mentiramv) January 20, 2017,  We say goodbye to the 44th President Of The United States Barack Obama and welcome the 1st Buffoon Of The United States Donald The Unready.  —   Ricky Davila (@TheRickyDavila) January 20, 2017,  Now that conservative PC patrol got their ”radical islamic terrorism” out of mouth of prez, they can be snug as ISIS uses video 2 recruit.  —   Kurt Eichenwald (@kurteichenwald) January 20, 2017,  Well, in a world with a terrifyingly uncertain future, there’s one thing that’s certain: that’s the stupidest inaugration speech ever given.  —   Caitlin Moran (@caitlinmoran) January 20, 2017,  tr*mp is president i truly want to kill myself,  —   michelle (@paulsmicheIle) January 20, 2017,  Jack Hadfield is a student at the University of Warwick and a regular contributor to Breitbart Tech. You can follow him on Twitter @ToryBastard_, on Gab @JH or email him at jack@yiannopoulos. net.'"}, "time": 1742563490.1860967}