{"duration": 0.02181839942932129, "input_args": {"text": "'The New York Police Department (NYPD) is being sued by a privacy group for failing to disclose information about a “secretive” facial recognition program. [The Center on Privacy and Technology at Georgetown Law filed the lawsuit after the NYPD allegedly refused to comply with a Freedom of Information Law request.  “As of 2016, the NYPD is reported to have conducted ‘8, 500 facial recognition investigations, yielding 3, 000 possible matches, and leading to almost 2, 000 arrests.’ In January 2016, the Center sent a FOIL request to the NYPD seeking records relating to the department’s acquisition and use of face recognition technology,” explained the group in a press release. “Despite extensive evidence of an advanced and frequently used face recognition system, the NYPD disclosed only a single document responsive to the request for procedures relating to facial recognition technology. The department refused to disclose contract and purchasing records, and claimed that no other records could be found. ” Despite the fact that there are currently no laws against the use of facial recognition by law enforcement in New York, the Center claims that it is illegal for the NYPD to keep the records surrounding it from the public. “Face recognition is too powerful, and its price on privacy and civil liberties too high, to not be controlled by robust policies and training guides,” said the Center’s Clare Garvie, who filed the original request. “If these records do in fact exist, it is against both New York law and the interests of the public to keep them secret. ” “The NYPD has been using face recognition for over five years. New Yorkers have a right to know how it’s using face recognition technology,” added David Vladeck, the Faculty Director of the Center. “The department’s claim that it cannot find any records about its use of the technology is deeply troubling. ” “If no records exist, that means that there are no controls on the use of face recognition technology and we ought to worry about that,” he continued. “If there are records, then why did the Police Department say that it couldn’t find them? The lawsuit we’ve filed aims to get to the bottom of those questions. ” The lawsuit can be viewed in full online. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628600.56561}