{"duration": 0.06781697273254395, "input_args": {"text": "'WHAAAA! The Left MELTS DOWN after FBI reopens Hillary ’email’ case (poor Paul Krugman, ha!) Posted at 2:00 pm on October 28, 2016 by Sam J. \\nAs Twitchy reported earlier , the FBI has decided to reopen Hillary’s email case because of recent developments, aka the WikiLeaks email dumps that Americans have been reading through on social media. \\nGuessing the FBI felt stupid that they weren’t the ones actually finding these things … maybe? \\nAnd as can be expected, just like the big babies they are, the Left “crapped” themselves immediately; take for example poor Paul Krugman: It\\'s bad enough having the media do the \"raises questions,\" substance-free innuendo thing. Worse when the FBI director does it. Disgraceful \\n— Paul Krugman (@paulkrugman) October 28, 2016 \\nDisgraceful! Actually what’s disgraceful is a woman like Hillary Clinton skating by with such blatant criminal acts, but we digress, right Paul. He needs a cat, anyone have a spare one they can loan him. \\nAnd then there’s other “Leftist” outlets: The FBI Director’s letter about the Clinton emails says a lot less than the media wants you to think https://t.co/tayXM9iyKj pic.twitter.com/TLRoW0Un00 \\n— ThinkProgress (@thinkprogress) October 28, 2016 \\nHA HA HA HA As we overreact to the FBI reopening Hillary email case, can someone please remind me, is James Comey in the tank or not? I can\\'t keep track \\n— John Ziegler (@Zigmanfreud) October 28, 2016 \\nNo one is overreacting but the media, John. Trending Now that FBI\\'s reopened Hillary investigation, can THIS be far behind? (Hint: Bill, fire up the jet!) \\nAnyone have some Xanax just lying around? FBI Dir also informed u that “the FBI cannot yet assess whether or not this material may be significant” but that won\\'t burn a witch, right? https://t.co/nOl0BWpxZt \\n— Jeffrey Wright (@jfreewright) October 28, 2016 Every news channel reporting that the FBI is \"reopening\" their investigation into Hillary\\'s emails. FBI, however, didn\\'t use that language. \\n— Judd Legum (@JuddLegum) October 28, 2016 \\nAnything to protect their queen, right? Fun fact: No Democrat has ever served as Director of the FBI. \\n— Matthew Yglesias (@mattyglesias) October 28, 2016 \\nGet the popcorn, these meltdowns are going to be entertaining at least throughout the weekend.'"}, "time": 1742563958.419258}