{"duration": 0.07914447784423828, "input_args": {"text": "'Two suicide bombers attacked a bus station in Jakarta on Wednesday, killing three police officers and wounding at least a dozen people. The Indonesian government believes the Islamic State was responsible. [The attack was carried out in the Kampung Melayu area of Indonesia’s capital by a pair of suicide bombers who detonated themselves about five minutes apart, according to Reuters.  The New York Times noted that the large police presence at the bus station was due to a parade, part of Jakarta’s festivities leading up to the beginning of the Muslim holiday of Ramadan on Saturday. Another possible factor in the timing of the attack was the formal resignation of Jakarta governor Basuki “Ahok” Tjahaja Purnama, a Christian of Chinese heritage who is currently serving a   jail sentence for blasphemy against Islam. Ahok’s trial and conviction inflamed both racial and religious tensions. He abandoned his appeal against the blasphemy sentence on Tuesday and resigned his office on Wednesday. In addition to the Ramadan parade, the New York Times noted that “thousands of   Muslims” celebrated the governor’s resignation on the streets in the hours leading up to the suicide bomb attack. Another theory, advanced on Indonesian television by National Police spokesman Awi Setyono, is that Indonesian extremists might have been “triggered” by the ongoing clash between ISIS forces and the government of the Philippines, and by the bombing of the Ariana Grande concert in Manchester, England. “These victims are known to us. They are police. They are bus drivers. They are motorcycle taxi drivers and grocers. I have ordered the police to hunt the terrorists and get to the root of this attack,” declared Indonesian President Joko Widodo. Widodo advised citizens to “keep calm and keep cool” because “we Muslims are preparing to enter the month of Ramadan for fasting. ” He ordered police to “thoroughly investigate the networks of the perpetrators and hunt them to the roots. ” Although no group has made a formal claim of responsibility, ISIS involvement is suspected by both Indonesian officials and analysts. “The Islamic State remains the main driver of attacks in Indonesia, and the threat posed by militants linked to the group is likely to escalate in the country,” Jane’s Terrorism and Insurgency Center analyst Otso Iho told CNN. Iho noted that “experienced militants” who fought for ISIS in Iraq and Syria are returning to their home countries, increasing the threat level dramatically. Only a few hundred Indonesians are believed to have traveled to the “caliphate” to fight for ISIS, but the terror state’s recruiting efforts in the world’s largest Muslim nation have been disturbingly effective with potential homegrown operatives. Indonesian police said the weapons appeared to be   bombs carried in backpacks. A police inspector said that “aluminum, nails, buckshot, and receipts for purchasing rice cookers” were found at the scene of the attack. The Associated Press reports that Indonesian   squads raided two houses believed to be owned by the bombers, identified as Ichwanul Nurul Salam, 40, and Ahmad Sukri, 32. Several of their relatives were also taken in for “questioning and DNA tests,” according to the chief of the   squad. Salam’s wife reportedly told investigators that the bombs were assembled by another militant known as “Agus,” who is now sought by police and considered “at large and dangerous. ” A similar bomb, also believed to have been designed by Agus, was detonated in February by a member of an Indonesian extremist network called Jemaah Anshorut Daulah that has pledged allegiance to ISIS.'"}, "time": 1742564623.4805925}