{"duration": 0.10300183296203613, "input_args": {"text": "'Stephen K. Bannon, former Breitbart News executive chairman, founding host of Breitbart News Daily, and now chief strategist for the incoming Trump White House, made a special appearance on the final live show of 2016. [“I’m only doing this because of the great audience we’ve got here and your producing team, led by Caroline Magyarits  —   and you, Matt, that you’re hosting the thing. So, glad to be on,” Bannon told SiriusXM host Matt Boyle.  “This was the most amazing year we’ve seen, both here in the United States and overseas,” Boyle said, describing those events as a “revolt of the working class. ” “It’s pretty amazing,” Bannon agreed. “As you know, with the website, with Breitbart and with the radio show, particularly the weekend show and then the daily show, we’ve been following this and reporting on it for years. ”  “It’s something we saw build up particularly in Europe, with the great team we’ve got over in London, led by Raheem and James Delingpole,” he said, referring to Breitbart London chief editor and frequent Breitbart News Daily host Raheem Kassam. “That led ultimately to Brexit, after all the different European Parliament votes they had and everything that UKIP kind of led. ” “And then here in the United States, where we saw it build up in the primaries, and then in the general election,” he continued. “I think we’ve lived through an historic time. I think we’ll talk about what happened in this year politically for many, many decades to come. It was exciting to live through it, and very exciting to be at SiriusXM, you know, the Patriot Channel with the show, and at Breitbart to actually see and report on it and comment on it. ” Bannon said, “The best thing we ever had was both the comments section at Breitbart and the callers, the great audience we’ve got here at SiriusXM, to call and share every day what their feelings were. ” “We used to tease, after John McCain made that speech that time, that called our audience ‘hobbits,’ it was always great to hear what the hobbits had to say because at the end of the day what they had to say was what mattered most,” he said. Bannon’s message to the hobbits and “deplorables”  —   to quote Hillary Clinton’s memorable slander of Trump voters  —   was to keep in mind that it’s only the “top of the first inning” for their movement. “You’ve got to stay engaged,” he advised, pleased to see high levels of engagement in “traffic at all the different sites, and the activity you see, the comments sections at the various sites you see, and how great the radio show is doing. ” “The Trump administration, I think it’s three weeks from the day exactly is when President Trump will take the oath of office. So let’s hold people accountable and stay engaged. There will be a lot of exciting activity over the next couple of years,” he promised. “Stay engaged. Stay on top of stuff. I think ’17 will be actually more exciting than ’16 was. ”  “So continue to go to various sites that are out there, where you get your news and information, and then obviously continue to listen to the various shows on the Patriot Channel. You’ve got so many great shows  —   you know, David Webb, Wilkow, Sean Hannity. You’ve got really a whole raft of great guys, Mark Levin, and of course the     Breitbart News Daily and Breitbart Weekend shows,” he recommended. Bannon anticipates that 2017 will be as much of an “exciting time” as 2016 was. “We don’t like to try to guess what’s going to happen in the future, but I’ve got to tell you, I think people were very engaged in this election, and I think will be very engaged as time goes forward. The key is to hold people accountable. The hobbits, or the deplorables, had a great run in ’16. Everybody mocked them and ridiculed them, and now they’ve spoken. I think ’17 is going to be a very exciting year,” he predicted. “I noticed on Breitbart over the last month or two, as either certain appointments were made or certain things were done that didn’t comport with behavior that the deplorables or the hobbits thought were correct, it was interesting to see some of the articles written on the site, and the intensity in the comments,” said Bannon.  “I think that’s great,” he said. “People are engaged. They feel like they have a voice. Just continue on. I know that on the show, you guys have been doing a great job every day with the production team and the great folks at SiriusXM. So it’s just going to be a great year. Let’s just stay engaged. ” He concluded by applauding Boyle for doing a great job and said to the Breitbart News audience and callers, “I really miss you guys. Have a great New Year, and look forward to talking with you guys early in 2017. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742562113.052424}