{"duration": 0.08033919334411621, "input_args": {"text": "'On Wednesday’s Breitbart News Daily, Dr. Sebastian Gorka, Deputy Assistant to President Trump, said the firing of FBI Director James Comey was an example of how “incredibly decisive” the president is. [“The recent testimony of the director added that last straw to the camel’s back and proved that he’s unfit to serve, and that he’s lost the confidence not only of the president but of the agents that serve under him,” Gorka said of Comey.  “Before I came into the White House, I spent many years training and educating FBI agents, so I have lots of connections with them,” he said.  “When they tell you from one of the field offices that when the director gave that infamous press conference, where for 13 minutes he built a watertight case for the prosecution of Hillary Clinton, and then in the last minute punted and said ‘no, I’ve decided not to recommend prosecution’  —   when half of the agents in that field office stood up, as I was told by a reliable source, put on their jackets and left the office for the next four days, then you know your situation is untenable. You’ve lost the institution, Raheem,” he told SiriusXM host Raheem Kassam. Kassam asked if it was wise for the Trump White House to get into a “war of words with somebody who will be testifying in front of committees, probably for the foreseeable future, who will become a face on the national media, who will write his memoirs now about his time there and his experiences with the new president. ” “As I’ve said before, I am a lowly deputy assistant. I’m not going to give Donald J. Trump advice on strategic communications,” Gorka responded. “Remember, on the day of the election the Huffington Post said Hillary Clinton has a 98 percent chance of victory. The New York Times said Hillary Clinton is going to win. I don’t think anybody has anything to teach the president about communications, what to tweet, what to say in a press conference. He’s broken the whole mold of strategic communications, and he’s done so despite the old ways of doing business. So I think he’s pretty secure in what he does, and he will weather any consequences admirably. ” Kassam asked for Gorka’s response to those who imply there is a “whiff of fascism,” as MSNBC’s Chris Matthews put it, around the Comey firing. “I think they should go and live in a real fascist state like Venezuela,” Gorka suggested. “Go live there for a few weeks and check that out. It’s an insult to people like my parents who lived under fascism, and then under communism. It’s just outrageous, absolutely outrageous. ” “This is a man who, in every speech he’s given since January the 20th, has made it patently obvious that he is a president for all Americans, whether or not you voted for him,” Gorka said of Trump. “What he’s doing with regards to national security, the economy, revitalizing our international relations  —   they’re not partisan political. They’re really about the bumper sticker that was the election campaign platform: MAGA, Make America Great Again. If you see any whiff of anything totalitarian or fascist in that, you need to look in the mirror yourself first, and look at how fascist your tendencies may be. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742563576.160078}