{"duration": 0.07140135765075684, "input_args": {"text": "'It began with blips on a radar screen, 12 miles off the Libyan coast. As the rescuers approached, they found overloaded wooden vessels and rafts that evoked scenes of the slave trade. Hundreds of African migrants were crammed into boats headed for Italy. More than two dozen people were dead in one boat alone, asphyxiated from the crush aboard. In other boats, bodies were splayed on the floorboards, forcing survivors to clamber over the corpses of their fellow voyagers. Aris Messinis, an Agence   photographer aboard the rescue boat Astral, said it was like nothing he had ever seen. The passengers  —   from Eritrea, Ethiopia, Somalia, Nigeria and other   countries  —   were found by the Astral on Tuesday, part of a wave of more than 11, 000 rescued in the Mediterranean by aid groups and the Italian Coast Guard this week. Migrants aboard a large wooden boat, which may have held 1, 000 people  —   roughly five times its capacity  —   waited frantically for help. Some jumped into the water. Even with life jackets tossed to them, migrants struggled to reach the Astral and other rescue vessels, which later transferred them to Italian Coast Guard ships bound for Italy. Pandemonium punctuated the rescue operation, despite efforts by the Astral crew to calm the migrants. “These people were in panic,” Mr. Messinis said. Migrants aboard the wooden vessel included infants, like the one below. In one of the boats, holding roughly 150 people, Mr. Messinis said that rescuers found 29 bodies  —   10 men and 19 women. “They told us these people were dead from the night,” he said. At one point, passengers held a child aloft to signal rescuers of their desperation. Migrants crammed below deck were packed so tightly they struggled to get out. “Many of them haven’t seen the sea in their whole lives,” said Laura Lanuza, a spokeswoman for Proactiva Open Arms, a Spanish aid group that operates the Astral. Despite a drop in sea crossings to Europe by migrants this year, more than 3, 000 have died in perilous crossings from Libya, where political chaos has made it the main departure point for smuggling operators who care little about whether their clients survive. Rescue officials attributed the spike in sea crossings in recent days to a stretch of good weather after days of storms and sea turbulence. The wooden vessel’s cargo hold contained   of the roughly 1, 000 people found aboard, Ms. Lanuza said, calling the conditions “just like a slavery boat  —   the same. ” After the living were rescued, Astral crew members put the dead in body bags and stored them in life rafts. Migration officials and rescue groups in Europe say the migrant route from North Africa remains the deadliest. Joel Millman, a spokesman for the International Organization for Migration, said at least 38 migrant bodies were recovered in Mediterranean rescues Monday and Tuesday, including those found by the Astral. Mr. Messinis, 39, who has covered the conflicts in Libya and Syria, has been photographing the European migration crisis since it began three years ago. He has often put aside his camera to help rescuers. What he witnessed on the Mediterranean, he said, was different. The analogy to slave ships that once plied the Atlantic, he said, was “exactly right  —   except that it’s not hundreds of years ago. ” ”I’ve seen a lot of death, but not this thing,” he said. “This is shocking and this is what makes you feel you are not living in a civilized world. ”'"}, "time": 1742563336.8417928}