{"duration": 0.2328193187713623, "input_args": {"text": "'Four years ago, after his journalism career imploded, Jonah Lehrer found himself waking up in the middle of the night in a panic. Unable to fall back to sleep, he would go to his computer and write. “At the time, it felt like a very sad discovery, that I still so wanted to write,” Mr. Lehrer said during a recent interview in an empty conference room at his publisher’s office in Midtown Manhattan. “After everything happened, I thought I was done as a writer. ” Many  —   including Mr. Lehrer  —   assumed that his career was over after it came to light that he had plagiarized material in his work for Wired, recycled his own writing in blog posts he wrote for The New Yorker and fabricated quotations from Bob Dylan in his book about creativity. He lost his position as a staff writer at The New Yorker. His publisher, Houghton Mifflin Harcourt, recalled two of his books, “Imagine” and “How We Decide. ” His banishment from the profession seemed permanent. Now, as he tries a comeback with “A Book About Love,” a new work of nonfiction that draws on social and psychological studies and examples from literature to explore the nature of love, Mr. Lehrer is facing fresh criticism, as well as support. Some are skeptical that he has changed. “He didn’t seem to get the ethos of journalism,” said Charles Seife, a professor of journalism at New York University who conducted an investigation into Mr. Lehrer’s work for Wired in 2012. “The deficits were so profound in the first round that I can’t imagine him starting afresh. ” But others  —   even some of his most ferocious former adversaries  —   say that Mr. Lehrer deserves a second chance. “I don’t believe in destroying a person’s life forever, and if Jonah wants to redeem himself, Godspeed to him,” said Michael Moynihan, a correspondent for Vice, who first discovered and wrote about Mr. Lehrer’s fabricated quotations from Mr. Dylan. “I wouldn’t deny the guy a chance to right a wrong like that. ” In an author’s note at the beginning of the book, Mr. Lehrer refers to his “mistakes and failures” and writes, “I am ashamed of what I’ve done. ” He describes the steps he took to ferret out errors and exaggerations in his new work. He hired an independent fact checker and sent sections of the book to his sources in advance of publication, allowing them to vet their quotations and his descriptions of their research. The book has 27 pages of footnotes. Those steps might not satisfy Mr. Lehrer’s critics. If early reviews are any indication, his new book, which comes out on Tuesday from Simon  Schuster, will be highly polarizing. Some have praised the work and defended Mr. Lehrer’s decision to write it. “He’s had his public humiliation, and from the evidence of this book, a chastened Jonah Lehrer has a lot to offer the world,” the New York Times   columnist David Brooks wrote in a forthcoming review for The Times Book Review. “The book is interesting on nearly every page. ” But others have argued that Mr. Lehrer, while more diligent about citing the work of others, still takes inexcusable intellectual shortcuts. In a recent review in The New York Times, Jennifer Senior slammed “A Book About Love” as “insolently unoriginal” and claimed that Mr. Lehrer had appropriated the arguments and insights of others, concluding that “it may be time, at long last, for him to find something else to do. ” Mr. Lehrer defended his approach. “It’s an act of synthesis, trying to bring together various studies, and translate it into a form that helps people understand this vast body of research,” he said. During an hourlong interview, Mr. Lehrer, 35, sat almost perfectly still and seemed at times uncomfortable talking about himself. When asked why there were no acknowledgments in the book, he said he chose to send private thank you letters to people who supported him, rather than name them publicly and expose them to scrutiny. He is not planning to go on a book tour, and he no longer gives   lectures. “A Book About Love” grew out of the wreckage he had made of his life, Mr. Lehrer said. “I regret the kind of writer I’d become,” said Mr. Lehrer, a California native who lives in Los Angeles with his wife and two young children. “I was invested in the superficial markers of success, and I wasn’t focused on making the work as good and true as possible. ” After he was exposed, Mr. Lehrer often woke up at 2 in the morning, consumed by regret and guilt, and would go to his laptop to write about what he had done, and the aftermath. “That writing became   in the literal sense, writing to understand myself,” he said. Around that time, he read about the Harvard psychiatrist George Vaillant’s research, which showed how crucial secure relationships are to   health, financial success and happiness. He decided that he wanted to write a book about the feeling that sustained him when he torpedoed his career and his reputation. “Writing has always been the means by which I explore the ideas I want to know more about,” he said. “It became this personal investigation. ” But those who approach “A Book About Love” hoping for a   memoir will be disappointed. Virtually none of what he wrote about himself and his experience ended up in the book. (Mr. Lehrer said he used his “raw personal experience” to frame the ideas in the book, but felt he wasn’t very good at writing memoir.) Instead, he focuses on studies of the bonds between parents and children and spouses, and explores the differences between infatuation and lifelong partnerships. Though the inspiration for the book was deeply personal, Mr. Lehrer doesn’t reflect much on his own life or relationships. He describes his struggle to become a better husband and parent, and writes about how he found solace in caring for his toddler daughter after his journalistic crimes were exposed, but doesn’t go into great detail. Mr. Lehrer said one motivation for writing the book was that he wanted to be able to show his children that he had learned from his mistakes, and changed. “I always wondered how I would tell them the story of what I lost and my failures, and how I hurt their mother,” he said. “I wanted to say, I did something terrible, I broke the most basic rules of my profession, but I learned a lot from it and I wrote one more book. ” Even so, Mr. Lehrer said it took a while to convince his wife, a   lawyer, that writing the book was a good idea. Not surprisingly, he faced a new wave of criticism in 2013 when news broke that he had sold a manuscript to Simon  Schuster. In an article for Slate, Daniel Engber combed through a leaked copy of Mr. Lehrer’s book proposal and pointed to evidence of improperly cited material. (Mr. Engber was unimpressed by Mr. Lehrer’s new work, and wrote, “Lehrer may have given up on outright fraud, but he’s still prone to spreading bunk. ”) Given Mr. Lehrer’s reduced profile, “A Book About Love” is unlikely to match his earlier blockbuster sales. Simon  Schuster is publishing 23, 500 copies of the book, a modest number for an author whose previous three books collectively sold more than 350, 000 print copies, according to Nielsen. Jonathan Karp, the president and publisher of Simon  Schuster, said that he felt confident that Mr. Lehrer had reformed and that he deserved a chance to publish his work again. “This is a talented writer, who I think has apologized profusely for what he did,” he said. “Is he just supposed to walk away from his calling?” Mr. Lehrer’s editor, Ben Loehnen, said he was reassured by the extra measures Mr. Lehrer took to   his work, and said he had seen some of Mr. Lehrer’s correspondence with his fact checker. “I’ve felt all along that talent of his sort is too rare to condemn him to lifelong banishment,” Mr. Loehnen said. Mr. Lehrer has not recovered everyone’s trust. David Remnick, the editor of The New Yorker, said he had no intention of publishing Mr. Lehrer’s work again. Representatives for Wired and Houghton Mifflin Harcourt declined to comment on whether they would consider publishing new work by Mr. Lehrer. Still, some prominent journalists have stood by him, applauding his return. Robert Krulwich, the   of Radiolab, on WNYC, who has known Mr. Lehrer for about 15 years, said he supported Mr. Lehrer’s decision to return to writing. “I said to him, you have things to say, and you have the talent to say them,” he said. “But if you want to do this for some more of your life, then you’re going to have to pay the price, and you can’t ever let this happen again, ever. ”'"}, "time": 1742562093.8274891}