{"duration": 0.058211565017700195, "input_args": {"text": "' Another U.S. Massacre in Afghanistan By Jacob G. Hornberger\\nNovember 08, 2016 \" Information Clearing House \" - \" fff \" - The latest massacre of many innocent people by U.S. forces in Afghanistan provides another demonstration as to why it is imperative that the American people stop deferring to the authority of the national security state and demand the immediate withdrawal of all U.S. forces from Afghanistan.\\nIn a war that has now gone on for 16 years, U.S. forces just killed at least 32 more civilians, many of whom were children. Another 25 people were wounded. Of course, this is on top of all the wedding parties, hospitals, and other victims of U.S. bombing attacks that have brought the death toll from U.S. interventionism in Afghanistan to more than 200,000, not to mention the wounded, maimed, homeless, and refugees. In the last seven days alone, 95 civilians have been killed in Afghanistan and 111 injured.\\nHow many of those 30 people, including the children, who are now being buried had anything to do with the 9/11 attacks? It is a virtual certainty that none of them did.\\nHow did this latest U.S. massacre occur? Afghan government forces, assisted by U.S. troops, decided to raid a home in a densely populated neighborhood in a village where a Taliban commander was supposedly having a meeting. The soldiers got trapped in a narrow dead-end street, where they began taking enemy fire from surrounding homes.\\nSo, what did they do? Naturally, to save their lives, they called in air strikes, which necessarily involved firing missiles into the neighborhood, which killed those 32 people, including children.\\nThe U.S. military\\x92s position is the standard one: The military regrets the loss of innocent life but, they say, they didn\\x92t really have a choice. If they didn\\x92t fire the missiles, the U.S. and Afghan troops would be killed. If they did fire the missiles, the innocent people living in the neighborhood would die. Not surprisingly, the military chose to protect the lives of the soldiers at the expense of those innocent people living in the neighborhood.\\nBut let\\x92s be mindful of an important fact: If U.S. troops had not still be intervening in Afghanistan, there never would have been a U.S. bombing raid on that neighborhood.\\nHow do the people who survived the massacre feel about what happened? Not surprisingly, they were chanting \\x93Death to America!\\x94 Americans should think about that the next time there is a terrorist attack in the United States.\\nDespite the bombing attack, two U.S. soldiers \\x97 Captain Andrew Byers and Sgt. First Class Ryan Gloyer \\x97 were killed in the battle.\\nWhat did they die for? No, they did not die protecting our freedom or keeping us safe. That\\x92s nothing but pabulum for the families of those two soldiers \\x97 to make them feel okay about losing their loved ones. fThey died for nothing, the same thing that those 58,000 plus U.S. soldiers died for in Vietnam.\\nFreedom and security of the American people have nothing to do with America\\x92s 16-year war in Afghanistan. The Taliban are not coming to get us, any more than the North Vietnamese were coming to get us. The conflict in Afghanistan is nothing more than a civil war, one in which one side is battling to oust a regime that has been installed into power by the U.S. government.\\nOnce the U.S. presidential race is over \\x97 a race in which the 16-year-old war in Afghanistan has barely been mentioned \\x97 the American people need to demand an immediate end to the U.S. occupation of Afghanistan. Continued U.S. interventionism is accomplishing nothing positive and is only pouring fuel on the fire, making matters worse for everyone, including innocent women, children, and others in Afghanistan.\\nJacob G. Hornberger is founder and president of The Future of Freedom Foundation. He was born and raised in Laredo, Texas, and received his B.A. in economics from Virginia Military Institute and his law degree from the University of Texas. He was a trial attorney for twelve years in Texas. He also was an adjunct professor at the University of Dallas, where he taught law and economics.'"}, "time": 1742562976.20954}