{"duration": 0.18888187408447266, "input_args": {"text": "'Full UFO Disclosure Is Inevitable Nov 18, 2016 7 0 \\nWhat is coming can’t be stopped. The truth is out there and we know it. While some believe that a partial disclosure of the truth on the UFO/E.T. phenomena will be pulled off, the reality is that any attempts to subvert or spin the truth of this monumental truth will ultimately backfire. “The truth is out there.” \\nAccording to whistle-blower Corey Goode , the banking and political cabal (some call it the NWO) is bent on releasing the truth about the UFO and extraterrestrial existence, but have that truth spun in a way where this cabal continues to maintain it’s power. In the end, the would not serve the greater interests of humanity, as this cabal would still try to keep several of it’s methods of enslavement over humanity going. \\nHowever, this scenario is extremely unlikely due to the amount of people who know the truth. It is also unlikely due to the kind of information that is continuing to come out regarding the existence of other beings in our universe. Credible Insiders \\nGoing back to late 2013, former Canadian Prime Minister and Defense Minister Paul Hellyer said in a TV interview with RT , that he knows for a fact that UFOs are real and that they’ve been visiting our planet for thousands of years. He also said that there are at least 4 different species that he knows of and that they want to help us create a peaceful world. He also said they have the technology to completely transform our world for the better. If there would be one interview to send to someone skeptical of this subject, this would be it. Paul Hellyer gave an eye-opening interview. \\nIn another interview that opened even more eyes was in early 2013 when former NASA Astronaut and Princeton Physics Professor Dr. Brian O’ Leary told the world: \\n“There is abundant evidence that we are being contacted and that civilizations have been visiting us for a very long time…” \\nIn the interview he also discusses free energy technology that these beings use. Another famous quote from Dr. O’Leary regarding free energy technology is: \\n“These concepts have been proven in hundreds of laboratories all over the world, yet never see the light of day. If the new energy technologies were set free world wide the change would be profound. It would affect everybody, it would be applicable everywhere. These technologies are absolutely the most important thing that have happened in the history of the world.” \\nAnother prominent figure who has openly spoken about the UFO and free energy reality is former NASA Astronaut Edgar Mitchell. Mitchell was brought back into focus a little over a month ago when Wikileaks revealed emails that Mitchell sent to John Podesta , chairman of the Clinton campaign. \\nIt is urgent that we agree on a date and time to meet to discuss Disclosure and Zero Point Energy, at your earliest available after your departure. My Catholic colleague Terri Mansfield will be there too, to bring us up to date on the Vatican’s awareness of ETI (Extraterrestrial Intelligence). \\nRemember, our nonviolent ETI from the contiguous universe are helping us bring zero point energy to Earth. They will not tolerate any forms of military violence on Earth or in space. \\nThough these are just three cases of well-known, credible insiders revealing the truth, there are literally thousands more that have come forward over the years. For further insider testimony, take a look at The Disclosure Project video where in 2001, over twenty military, intelligence, government, corporate and scientific insiders came forward and testified what they know about the UFO and E.T. subject. It Won’t Stop There \\nAs truths like this continue to come out, much of what we’ve been taught on this planet will need to be addressed and revised. Almost every area of our world has been compromised by this secret cabal. JFK put it best when he openly stated opposition to “secret societies, secret oaths and to secret proceedings.” As well as opposition to “a ruthless conspiracy…a highly efficient machine that combines military, diplomatic, intelligence, economic, scientific and political operations.” \\nIndeed, almost everything we see around us has been built on secrecy and lies. Full disclosure is more than just the truth about UFOs and other beings visiting our world. It is also more than the free energy technologies that have been intentionally suppressed. Full disclosure will also include learning about these “secret societies” that JFK talked about. It will include learning about how a group of “elites” controlled the media, the schools, the religions, the miltaries, the financial systems as well as controlling the weather (HAARP technology), controlling the food supply and attempting a mass eugenics project through genetically modified foods. \\nIt will also include learning about the subversion of the scientific method to push their destructive agenda into the health and medical fields. It will include revealing how pharmaceuticals have been used to numb and slowly degrade biological activity within the human body. \\nFull disclosure will include learning about the use of chemical weapons on it’s own people through what is known as chemtrails. Even the CIA Chief has admitted they are engaging in such geoengineering practices. We could also call this stratospheric aerosol injection. \\nFull disclosure will also reveal how the elite’s have stolen and have been abusing the global collateral accounts . These accounts were intentionally created to fund massive humanitarian projects and are the real reason JFK was murdered. Full disclosure will reveal the true history behind these accounts and all of the banks, governments (registered corporations) and other corporations (like the United Nations) that have been illegally using these accounts. We will also learn about how the 9/11 false flag is connected to these accounts. \\nWe will also learn about how our birth certificates have been turned into securities that are being traded on the New York Stock Exchange. We will also learn about how almost every “government” in this world is actually a registered corporation . We do not have governments running our country. We have masquerading corporations. \\nWe’ll also learn about mind control operations that have been used both on the public, as well as on certain politicians, bankers and celebrities. This is most commonly known as MK Ultra. \\nWe will also learn about the massive child-trafficking, pedophile ring that the elites have been involved in. \\nEven so, there will still be much more that will be revealed. Full Disclosure Now \\nWhile some want to create a partial disclosure, such a scenario is nearly impossible. The reason this is so is that there are many, many scientific, military, political and intelligence related people who know an incredible amount of information, but stay silent to either preserve their life or preserve their job. Once the door cracks open, we will see a few major figures come forth and reveal what they know. Once that happens, we will see the floodgates open. Dozens and then hundreds of people who know the truth on a wide range of topics, such as those listed above, will no longer have the threat of death held against them. They will be free to speak about what they know. \\nThe world is becoming more ready each day thanks to the internet and information like that contained in this article reaching even more people. The world is awakening to the truth and we know that we already have the technology to turn this planet into a paradise. We know that there are peaceful beings living on other planets and in other dimensions. This is reality. \\nYou can join the growing Facebook group who is pushing for full disclosure here . \\nLastly, take a look at the words from David Wilcock , NYT Best-Selling author, researcher, lecturer and UFO expert from just a couple days ago : \\n“I will say that the fight for Disclosure and the defeat of the Cabal is now at a “Red Hot” level, based on multiple insider testimonies. The scope, power and speed of changes we might see are anyone’s guess, but it definitely appears that things are going to get a lot more interesting.”'"}, "time": 1742562711.85508}