{"duration": 0.14221596717834473, "input_args": {"text": "'NEW BRUNSWICK, N. J.  —   Four years of increasing activism and growing political awareness recently brought Lacey Rzeszowski to Rutgers University here, to a packed room of nearly 280 women, each on the cusp of launching a bid for public office for the first time. Spurred by the 2012 shooting rampage in Newtown, Conn. she had pressured local and federal lawmakers on gun control legislation, first on the backs of postcards and then in live confrontations in town halls and congressional offices. Her advocacy led to calls for her to run for office, but Ms. Rzeszowsk had repeatedly declined. Now, seeking solace and inspiration following the 2016 presidential election and the Women’s March on Washington, Ms. Rzeszowski, 42, is squaring off in a tough race against a local Republican for a seat in the New Jersey Assembly. Political activism of all persuasions, ignited largely in response to President Trump, has swelled in the wake of the 2016 election. A monsoon of marchers swept through Washington following the inauguration, letters and phone calls flooded the White House and Congress, and protests erupted at congressional town hall meetings across the nation. But in the social media age, where protest movements often remain relegated to cable news screens and hashtags, some have wondered whether the fervor and energy would be reflected in local, state and federal ballots. The answer seems to be a resounding yes. A surge in demand for programs around the country like the one at Rutgers, along with a significant spike in   small dollar   for local races, suggests that the protest movement is producing a flood of   led predominantly by new female candidates, on local ballots, from school boards to town councils to state legislatures. Emily’s List, the national organization dedicated to advancing Democratic women in politics, has been contacted by more than 10, 000 women saying they were going to run for local and state office in the four months since Election Day. In the two years leading up to the 2016 election, when the presidential election cycle was at its apex, the group said it had received fewer than 1, 000 contacts. Emily’s List has tripled the resources devoted to state and local races to help meet the demand. “What we’re seeing is not just in New Jersey but it’s happening all around the country,” said Debbie Walsh, the director at the Center for American Women and Politics at Rutgers. “Women are looking for a way to have a voice. They’re feeling that in ways that we haven’t seen the general public experience, the real understanding that elections have consequences. ” This is especially true in states like New Jersey that hold major local and statewide elections this year the deadline to file for primary elections in New Jersey is April 3. “It was the ride down on the New Jersey Turnpike, on a bus, watching all the buses heading to D. C.,” Ms. Rzeszowski said, describing the moment she decided to run as a Democrat, and try to unseat her former party, which she felt had moved too far to the right. She recalled her joy at seeing not just the streets of Washington, but the highways of her home state, flooded with protesters that finally pushed her into a declaration for office. Here at the “Ready to Run” program at Rutgers University  —   an annual event that features classes, conferences and training for women who want to run for office but are unsure of the next steps  —   attendance has climbed by nearly 300 percent compared with past averages, according to the event organizers. Since Ready to Run, a national, nonpartisan training program, was founded 18 years ago, sister programs have popped up around the country, from The Ohio State University to Oklahoma University to Chatham University in Pittsburgh. And at each event this year, attendance is soaring past previous records, often selling out for the first time in its history. New programs have popped up this year in Delaware, Mississippi and Connecticut. “I’ve had a few women email me and invite me just to come into their living rooms and say, ‘Teach us how to do this,’” said Gayle Ann Alberda, a former Republican strategist now teaching politics at Fairfield University in Connecticut and anchoring the effort to bring “Ready to Run” to the school. “They say ‘Hey, I’ll pay you, just come teach us how to run.’ And I’ve never seen this before. ” ActBlue, the Democratic   software, has seen its users, who can be local or state or federal candidates and groups, raise $76 million in     since the election. In the same time frame in 2015, its users took in $16 million. The interest, and the intent to actually take the big step and run for office, is so overwhelming that new groups are popping up across the country with the sole purpose of getting   candidates ready. Run for Something, a national group started after the election to recruit and train Democratic candidates, initially expected 100 or so to show interest. More than 7, 500 have since put a hand up. The swell in interest certainly leans Democratic, and much of the protest and activism following the election of President Trump has come from those more aligned with liberal policies, but the surge is bipartisan in some states. In red Mississippi, a program similar to that at Rutgers is starting at the Stennis Center for Public Service Leadership, a federally funded center that promotes civic engagement. And in the small town of Starkville, Miss. more female candidates are running for municipal office than ever before, including six candidates for mayor. In Utah, another reliably Republican state, the Y. W. C. A.’s Real Women Run program saw more than 200 come out to one of the training sessions. “It’s only March, but it’s my interpretation that it’s more of a democratic surge in Utah because women don’t feel represented,” said Sheryl Allen, 73, a former   Republican legislator from Bountiful, Utah, who helps run the Real Women Run program. She pointed to candidates like Kathryn Allen, a physician who is planning on challenging Representative Jason E. Chaffetz in the state’s 3rd Congressional District in 2018, as one of many examples. A lot of the women here at the Rutgers event seemed to share the energy of Ms. Rzeszowski, and pointed to the Women’s March as the inspiration for their planned runs. Lindsay Brown, a    product manager who is lining up to challenge Representative Leonard Lance in New Jersey’s Seventh Congressional District, cited the march’s “big outpouring of anger, sadness and hope that really inspired me. ” Christine Chen, a    businesswoman from Bridgewater, first felt the push to run the day after the election, when she looked up local legislators to support in the face of her disappointment at the election, only to find her local representatives just as   to her as the new administration. “It was very visceral, like my way of life was under threat,” she recalled, describing the months since November. She has formed a ticket of    candidates in Legislative District 23, with Isaac Hadzovic and Laura Shaw running for State Assembly seats, and Ms. Chen for the State Senate. Some have found inspiration from the election of Mr. Trump himself, though not because they agreed with the president. While she often found his comments during the campaign caustic and controversial, Lucille Lo Sapio, 65, said his irreverence was the liberating force she needed to push her own name onto the ballot. “The fact that he could get up there and literally say anything, most of it untrue, but say it in such an inflammatory way, told me now I’m free to do that,” said Ms. Sapio, a      “irreverent to very irreverent” political blogger aiming to be the first Democratic freeholder elected in Monmouth County, N. J. since 2008. “That’s the way I am, I don’t pull punches,” she said, admitting that she might yet push the envelope further. “The hardest thing for me is going to be not using any profanity. ”'"}, "time": 1742564400.895703}