{"duration": 0.10235881805419922, "input_args": {"text": "'This post was originally published on this site \\nUpdate: RUSSIAN PM APPOINTS DEPUTY MINISTER YELIN AS ACTING RUSSIAN ECONOMY MINISTER – IFAX \\n* * * \\nIn an unexpected move, Russian Economy Minister Alexey Ulyukayev was detained Monday on suspicion of taking a $2 million bribe in return for his ministry’s support for a major oil company deal, Russia’s Investigative Committee said. The minister is in custody and awaiting charges. \\nAlexey Ulyukaev \\n“The circumstances of the crime are connected with Alexey Ulyukayev, who occupies a public post in the Russian Federation, receiving $2 million on November 14 for the positive assessment provided by the Economic Development Ministry that allowed Rosneft to complete the deal on purchasing the government’s 50 percent stake in Bashneft,” Svetlana Petrenko, deputy head of the Investigative Committee, said in an official statement. \\nPresident Vladimir Putin named Ulyukayev, at the time a first deputy governor of Bank of Russia, economy minister in June 2013; it is unclear what prompted his fall from grace. \\nThe case comes as Rosneft is preparing a mandatory offer to buy out minorities in Bashneft , where it purchased a 50.08 percent stake for 329.69 billion rubles ($5 billion). Rosneft’s Oct. 12 purchase from the government was made at a premium to the market, or 3,706.4 rubles for each common share it bought. Bashneft shares closed at 3,480 rubles in Moscow on Nov. 14, or 6.1 percent below the purchase price \\nThe Bashneft deal, around which the charges against Ulyukayev revolve, is not going to be revised during the probe, Petrenko told RIA Novosti. \\n“The necessary investigative actions concerning Ulyukayev are under way,” the Investigative Committee’s spokesperson said quoted by RT . Ulyukayev was detained in the act of taking a bribe amid an investigative experiment, Petrenko revealed, as cited by RIA Novosti. “Ulyukayev was caught red-handed when receiving a bribe,” she said. According to Petrenko, the minister resorted to threats, attempting to extort the money from Rosneft officials. \\nThe experiment was prompted by evidence law enforcement obtained by wiretapping Ulyukayev’s cell phone and those of his entourage, a source told RIA Novosti. Petrenko said that a criminal case has been opened under part 6 of Article 290 of the Russian Criminal Code, which covers “large-scale bribery.” \\nUlyukayev has been under investigation by Russia’s Federal Security Service (FSB) for over a year, a source told RIA Novosti. \\n“The minister has been monitored by FSB agents for more than a year. It is unclear if he was suspected from the beginning of what he is accused now, but he has definitely been observed for more than a year,” he said. \\nPetrenko told RIA Novosti that the Bashneft deal, around which the charges against Ulyukayev revolve, is not going to be revised during the probe. “The acquisition of Bashneft stock was made in accordance with the law and is not the subject of a criminal investigation,” she said. \\nMore details on the arrest from RT: \\nPursuant to Russian law, Ulyukayev faces a maximum penalty of a fine ranging from 80 to 100 times the sum of the bribe. In addition to this, if found guilty, he would be stripped of the right to serve in certain state positions or engage in certain activities for eight to 15 years. \\nAlternatively, the law says the suspect may face from eight to 15 years behind bars and a fine of 70 times the sum of the bribe, or would have to serve the prison term without paying monetary compensation. \\nKremlin spokesman Dmitry Peskov said the accusations brought against Ulyukayev were “very serious” and required “very serious proof.” \\n“In any case, only a court can decide,” Peskov said, adding that he did not know if President Vladimir Putin was aware of the minister’s arrest. \\nIn October, Russia’s largest oil company, Rosneft, purchased the state-owned stake in a major regional oil company, Bashneft, for about $5.3 billion. The deal was approved by Prime Minister Dmitry Medvedev, although back in September, President Vladimir Putin expressed his concerns over the potential takeover of one state-controlled company by another. \\n“Probably it’s not the best option when one company under state control acquires another purely state company,” Putin said in an interview with Bloomberg. He added however, that the biggest bid would win as Russia “cannot discriminate against market participants, not a single one of them.” As the deal was finalized, Ulyukayev said there was another competitor to acquire the stake, but Rosneft had outbid that offer. \\nIt is unclear who Ulyukayev’s replacement will be during the criminal proceeding. Related '"}, "time": 1742563666.239934}