{"duration": 0.026294469833374023, "input_args": {"text": "'Meryl Streep accepted the Cecil B. DeMille Lifetime Achievement Award at Sunday night’s Golden Globes  —   and used her acceptance speech to repeatedly attack   Donald Trump in what was one of the night’s most pointed political statements. [The     began her speech by noting that Hollywood is the most “vilified” segment of American society following Donald Trump’s victory.  “Hollywood is crawling with outsiders and foreigners. And if we kick them all out, you’ll have nothing to watch but football and Mixed Martial Arts, which are not the arts,” she said. At tonight’s #GoldenGlobes we honor Hollywood legend Meryl Streep with the prestigious Cecil B. Demille Award. pic. twitter.   —   Golden Globe Awards (@goldenglobes) January 9, 2017,  Streep said Trump’s mocking of disabled New York Times reporter Serge Kovaleski was the “performance” that most “stunned” her. “There was nothing good about it, but it did its job,” the actress said. “It kind of broke my heart when I saw it, and I still can’t get it out my head because it wasn’t in a movie, it was in real life. That instinct to humiliate when it’s modeled by someone in a public platform, it filters down into everyone’s life because it gives permission for others to do the same. ” “Disrespect invites disrespect, violence incites violence,” Streep said. Streep challenged a “principled press” to stand up to Trump “to hold power to hold power to account, to call to the carpet for every outrage. Streep called on Hollywood to support the Committee to Protect Journalists, “because we’re going to need them going forward  —   and they’ll need us to safeguard the truth. ” “Take your broken heart, make it into art,” Streep concluded, quoting the late actress Carrie Fisher. Watch Streep’s full speech above.'"}, "time": 1742562229.9472349}