{"duration": 0.12260842323303223, "input_args": {"text": "'Originally appeared at Nsnbc International \\nAcademy member Boris Chetverushkin, on Friday, stated that former U.S. Secretary of State and Nobel Peace Prize laureate Dr. Henry Kissinger has been elected to the Russian Academy of Sciences along with another six Nobel Prize laureates. \\nThe other Nobel Prize winners elected to the Russian Academy of Sciences include Serge Haroche and Martinus Veltman (physics); Roger D. Kornberg, Jean-Pierre Sauvage and Dan Shechtman (chemistry); Kenneth J. Arrow (economy). Kissinger was also elected to the Academy for his “global studies”. \\nThe now 93-year-old Dr. Henry Kissinger, 93, is one of the authors of the policy of ‘d·tente” in the US-Soviet relations. In 1993 he won the Nobel Peace Prize for his role in negotiating and reaching the Paris Accord aimed at ending the war against / in Vietnam. Kissinger also has many US State awards, including the Presidential Medal of Freedom, the highest US civilian decoration, awarded to individuals who have made an outstanding contribution to the security or national interests of the United States, world peace, cultural or other significant public or private endeavors. \\nIn latter years after withdrawing from “official” politics, Kissinger promoted the image that he now was focusing on “writing memoirs”, articles, books on foreign policy and diplomacy, including his works “Nuclear Weapons and Foreign Policy”; “The White House Years” and “Does America Need a Foreign Policy?” \\nDuring the onset of the crisis in Ukraine Kissinger also wrote a lengthy article suggesting the “Finlandization” of the Ukraine, but without mentioning a word about the systematic engineering of the “crisis” by U.S. power-brokers. Kissinger may or may not have stopped being a “swinger”, but as he once said, “power is the ultimate aphrodisiac”. He may have withdrawn from “official” politics but he never removed himself far from “power”. \\nWhen the administration of George W. Bush had to cave in to pressure to launch an investigation into the events on September 11, 2001, it suggested that Dr. Henry Kissinger lead the 9/11 Commission. Kissinger had to withdraw when some of the bereaved “Jersey Girls” asked Kissinger if his company, by any chance, had members of the Bin Laden family among its clients. An actual “criminal” investigation into 9/11 took never place and leading members of the 9/11 Commission have since written that it was “set up to fail” from the start. \\nIronically, Kissinger has also been one of the main architects of the U.S. policy that led to the bloody coup in Chile, on September 11, 1973. A coup that inspired many then young people (like this author) in Latin America and in the West to organize a militant resistance. The overthrow of Salvador Allende was followed by sixteen years of terror. \\nKissinger also played key roles in Argentina’s “dirty war”, marked by mass“disappearances” with bodies of “dissidents” dumped into the ocean from helicopters, dumped into mass graves, and many of those who lived to tell the tale were marked by the trauma of physical and psychological torture for the remainder of their lives. \\nThe U.S. “policy”, in Latin America, of which Kissinger was a main architect, would also spill over into, and spill blood in Colombia, Venezuela, Guatemala, Honduras, El Salvador and Nicaragua. \\nDr. Kissinger’s “rap sheet” is far too long to publish in one news article, but one may want to read the book of the late journalist Christopher Hitchens wrote about Kissinger in his book entitled “The Trial of Henry Kissinger”. \\nHitchens diligently documented Kissinger’s involvement in a number of alleged war crimes in Indochina (Vietnam – Laos – Cambodia), Bangladesh, Chile, Cyprus and East Timor. Hitchens made a compelling case for the need to prosecute Dr. Henry Kissinger. \\nThe Russian Academy of Sciences, for its part, has arguably made two brilliant points by electing Kissinger. It has provided additional evidence for the fact that Academies of Science, worldwide, are instruments of politicized science comparable to a Caliphate being a marriage of State and religion. It has also proven that utilitarianism at the Russian Academy of Sciences outweighs scientific, moral and ethical imperatives.'"}, "time": 1742562087.3564303}