{"duration": 0.13049888610839844, "input_args": {"text": "'Rufus Farmer, 33, was tired of all the ways he saw black men being mistreated by the nation’s law enforcement system  —   from the police officer who once berated him for crossing the street to the mandatory prison sentences that sent so many of his peers away. So when former President Bill Clinton appeared on April 7 in Philadelphia at a rally for his wife, Hillary, Mr. Farmer protested, carrying a sign denouncing Mr. Clinton’s 1994 crime bill, which set lengthy prison sentences and flooded the streets with police officers. A fiery exchange broke out between the activists and the former president as Mr. Clinton forcefully defended the legislation. But it was not just Mr. Clinton who criticized the young protesters. Afterward, some older   did, too. “I think it is crazy to protest the crime bill,” said Caryl Brock, 53, a social worker from the Bronx, who scolded the protesters on social media. “Should it be amended? Maybe. But a lot of people really wanted it. I really wanted it. ” Young and energized   this election cycle are aggressively challenging longstanding ideas and policies, especially those carried out during the Clinton administration in areas like crime and welfare. But the activism is also laying bare a striking generation gap between younger and older   whose experience, views of the former president and notions of how they should push for change diverge dramatically. The parents and grandparents of today’s young black protesters largely waged the battle for civil rights in courtrooms and churches. They carefully chose people who were viewed as upstanding citizens, like Rosa Parks, to be the face of their movement, and dressed in their Sunday best as they sought to gain broader acceptance. Mr. Clinton endeared himself to these generations by campaigning in black churches and appointing more blacks to the cabinet than any previous president had. But many of today’s activists  —   whose political consciousness has been shaped by the   killings of black people by the police  —   do not believe that acting respectfully will protect them from being harassed or shot. They aspire not to become a part of the political system, but to upend it. “You do have older generations of church folk who believe that marching and singing is the best way to bring about change,” Mr. Farmer said. “We’ll march, too, but we’ll do what we need to do to communicate our message, if it happens to be yelling, or blocking an intersection. And we don’t care if people  —   particularly white people  —   believe it is respectable. ” The gulf between young black people and their elders surfaced repeatedly in more than two dozen interviews conducted in the days after Mr. Clinton’s clash with the protesters. To young activists like Mr. Farmer, Mr. Clinton’s legacy on crime is paternalistic and damaging. But many older black voters who raised families during the crack epidemic  —   an era many young people do not remember  —   remain steadfastly loyal to the Clintons. Ms. Brock said she had been a social worker in charge of the removal of children from dangerous homes in the South Bronx and Spanish Harlem in the late 1980s and early 1990s, when crack tore a path of destruction through those neighborhoods. “I saw it all,” Ms. Brock said. “Moms would give birth and leave the hospital to get a hit. My car got broken into every week. People were scared to walk down to the bodega, afraid they’d be followed and robbed. ” She said she was relieved when the crime bill passed. In addition to providing more money for prisons and the police, the law banned assault weapons and offered funding for drug courts and rehabilitation. “Because of the crime bill,” she said, “anybody that wanted rehabilitation, we could process them and get them a detox bed in a hospital. ” Ms. Brock’s comments underscore a sometimes overlooked reality in today’s   of the crime bill: The legislation was broadly embraced by nonwhite voters, more enthusiastically even than by white voters. About 58 percent of nonwhites supported it in 1994, according to a Gallup poll, compared with 49 percent of white voters. Mr. Clinton has seemed rattled at times as he tries to defend the measure to younger   in an era in which concerns about mistreatment by the police and mass incarceration have eclipsed the fear of crime in many black communities. And among these younger voters, the Clintons lack the deep admiration that they enjoy from previous generations of  . In the Democratic primary contests so far, 92 percent of black voters 65 and older cast ballots for Mrs. Clinton, compared with 45 percent of black voters under age 25, according to exit polls conducted by Edison Research. Some   and older   found themselves siding with Mr. Clinton after his confrontation with the protesters in Philadelphia, which was widely broadcast on television and social media. During the exchange, Mr. Clinton said that the legislation targeted gang leaders “who got    children hopped up on crack and sent them out the street to murder other   children. ” He then lectured the activists, who support the Black Lives Matter movement: “You are defending the people who kill the lives you say matter. ” Roz Rodgers, 55, a community engagement worker from East St. Louis, Ill. said she understood what Mr. Clinton was trying to get across. “All black lives should always matter  —   that is what Bill Clinton was saying,” Ms. Rodgers said. “It bothered me, the reaction he got. ” About the activists, she said: “This younger generation is more vocal. They are not accepting the rules, regulations and expectations that exist. ” Today’s angry demonstrations over   policies make it easy to forget how the former president was hailed two decades ago for taking a stand against gun violence in black communities. An emotional, unscripted speech Mr. Clinton gave in 1993 about the toll of violence on black youth has been called one the best of his presidency. He delivered it from the pulpit of the church in Memphis where the Rev. Dr. Martin Luther King Jr. preached his last sermon. “The other day on the front page of The Washington Post was a story about an    child planning her funeral,” Mr. Clinton told the congregation that day, 10 months before he signed the crime bill. “The freedom to die before you’re a teenager is not what Martin Luther King lived and died for. ” Black churchgoers gave him sustained applause and named him an honorary member of their congregation. A columnist in The Washington Post said the speech “embodied what has always been the promise of Clintonism. ” “Only Clinton could say it, and only now,” read a column in The St. Louis  . Willie W. Herenton, the first   mayor of Memphis, was in the church that day. “It’s easy for people to lose the connection of where we were in 1994 and where we are today,” Mr. Herenton said. The national murder rate hit a high in the early 1990s, disproportionately affecting   neighborhoods in major cities. Today, violent crime is down and mistreatment by the police and excessive incarceration have taken center stage in the minds of many younger voters. In 2013, nearly   of black men 18 to 34 reported being treated unfairly by the police in the previous 30 days, according to a Gallup survey. That has stirred anger among some young black people, which has crystallized in resentment of the Clintons in this election cycle. Charli Cleland, 24, a   student at Brooklyn Law School, said he planned to vote for Senator Bernie Sanders, even though his family has always admired the Clintons. “Growing up, there was always this idea that Bill Clinton was a man for people of color,” he said. “Then this political year comes around, and there is so much being exposed as to what they have said in the past and what kind of bills they have approved in the past. I’m realizing that it’s actually against everything that I initially thought about the Clintons. ” When he watched the exchange in Philadelphia, Mr. Cleland said he viewed Mr. Clinton and his remarks as “paternalistic” and “implicitly racist. ” The interviews with the younger voters reveal a pattern: Not only are they distrustful of the Clintons, but they also appear disillusioned with politics and institutions in a way their parents are not. And they are less interested in gaining approval, especially from white people. “We do not believe that freedom for black Americans will come through politicians,” said Erica Mines, an activist in Philadelphia who demonstrated at Mr. Clinton’s speech alongside Mr. Farmer. “We can no longer rely on the ballot box for our freedom. ” Older generations fought for civil rights “to be accepted into mainstream society,” she said. “But younger folks are saying, ‘I’m not going to fit into that box anymore, or allow society to tell me what I need to be. ’” Mr. Farmer said his mother, who put her faith in the ballot box, the church pulpit and the Clintons, initially found it hard to understand his brand of activism. “She just thinks in a way that is popular of a generation. Go in peace. March. Sing a hymn or two. Don’t do any fighting. Don’t do too much yelling,” said Mr. Farmer, a former Marine. Mr. Farmer and Ms. Mines joined a group called the Philly Coalition for REAL Justice, which believes that only disruptive, direct action can bring about change. On Thursday, members of the group blocked an intersection to push for a $15 minimum wage and other measures. Both he and Ms. Mines were arrested. Mr. Farmer says his mother’s views are changing as she watches his experience. “I was locked up for about 27 hours,” he said. “She was at the precinct when I came out. She gave the police an earful. ” And, in perhaps a more surprising shift, after hearing what Mr. Clinton said in Philadelphia, his mother has decided not to vote for Mrs. Clinton for president, Mr. Farmer said. “She was a Clinton fan,” he said. “She would have voted Clinton automatically. ”'"}, "time": 1742563979.451252}