{"duration": 0.11326050758361816, "input_args": {"text": "'\\nThis article was written by Melissa Dykes and originally published at The Daily Sheeple . \\nEditor’s Comment: Time and again, we have seen those in power planning to use an EMP or massive solar flare as a pretext for total unrest, a collapse of the electric grid and the institution of martial law. \\nWith so much at stake in the election, and more uncertainty than ever, are we about to witness the grandest wild card factor ever to enter U.S. politics? Is is possible that election results could be suspended as a result of a total meltdown of the electric grid, and the likely destruction/unreliability of electronic voting machines in every state? \\nThere’s no way to predict what may actually occur, but there is no way to look away from this potentially deadly scenario either. Just why did Obama prepare for this exact scenario? Though this one is kind of “out there,” it doesn’t change the real possibility that the feds may just be poised to take more power than ever before in history. This is truly eerie… \\nJust Weeks After Obama’s Executive Order on Catastrophic Space Weather Events, a Coronal Mass Ejection Is Set to Hit on Election Day \\nby Melissa Dykes\\nThis has already been the craziest election in the history of the country, with the most overt corruption and fraud the American people have likely ever seen.\\nNow, on top of everything else that’s scheduled to go down tomorrow, it is being projected that a powerful coronal mass ejection (CME) is set to hit Earth tomorrow, and not just hit earth but a direct hit is in our forecast.\\nAccording to Space Weather Live , “A coronal mass ejection (or CME) is a giant cloud of solar plasma drenched with magnetic field lines that are blown away from the Sun during strong, long-duration solar flares and filament eruptions.” \\nWhat this means is the very real potential for strong geomagnetic storms here on Earth. Potential storms from CMEs like this have been known to cause everything from lost satellite control to radio and television interference to power grid disruption and failure.\\nFor example, in March 1989 , a powerful CME caused strong variations in the Earth’s magnetic field which tripped circuit breakers in Québec’s power grid, causing a massive blackout.\\nWhat makes this timing even more unsettling is the fact that just weeks ago, Obama signed a brand new executive order on October 13, 2016 specifically regarding Department of Energy, Department of Defense, and Homeland Security coordination in handling “space weather events” as reported by Mac Slavo over at SHTFplan.com :\\nVia WhiteHouse.Gov \\nExecutive Order — Coordinating Efforts to Prepare the Nation for Space Weather Events \\nBy the authority vested in me as President by the Constitution and the laws of the United States of America, and to prepare the Nation for space weather events , it is hereby ordered as follows:\\nSection 1. Policy. Space weather events, in the form of solar flares, solar energetic particles, and geomagnetic disturbances, occur regularly, some with measurable effects on critical infrastructure systems and technologies, such as the Global Positioning System (GPS), satellite operations and communication, aviation, and the electrical power grid. Extreme space weather events — those that could significantly degrade critical infrastructure — could disable large portions of the electrical power grid, resulting in cascading failures that would affect key services such as water supply, healthcare, and transportation . Space weather has the potential to simultaneously affect and disrupt health and safety across entire continents. Successfully preparing for space weather events is an all-of-nation endeavor that requires partnerships across governments, emergency managers, academia, the media, the insurance industry, non-profits, and the private sector.\\nWhat are the odds??? \\nIt’s not like CMEs and solar flares are anything new… so why all of a sudden are they saying we need to, “speed the creation of a space-weather-ready Nation” right before it comes out that just a geomagnetic disturbance might happen on election day?\\nAdd to that the fact that recently Homeland Security was also talking about taking over the elections as a matter of national security…\\nDo they know something we don’t here? Either way, considering that most of our data on these things comes from government agencies, the timing definitely makes you wonder what shenanigans are going to get pulled tomorrow with our easily hacked electronic voting machines …\\nCan’t you just see the “confusion” that could be caused by intermittent power outages on election day, all blamed on the sun?\\n\\nAnd no matter what, it’s always good to be prepared . \\nThis article was written by Melissa Dykes and originally published at The Daily Sheeple . \\nMelissa Dykes is a writer, researcher, and analyst for The Daily Sheeple and a co-creator of Truthstream Media with Aaron Dykes, a site that offers teleprompter-free, unscripted analysis of The Matrix we find ourselves living in. Melissa and Aaron also recently launched Revolution of the Method and Informed Dissent . Wake the flock up! \\n'"}, "time": 1742564528.3225353}