{"duration": 0.031805992126464844, "input_args": {"text": "'Actor, comedian, and Family Feud host Steve Harvey met with   Donald Trump on Friday at Trump Tower in Manhattan. [“I stepped from behind my microphone and I came and talked to the guy who is going to be the 45th president,” Harvey told reporters about his meeting with Trump, whom he said he found “both congenial and sincere. ”  ”I stepped from behind my microphone and I came and talked to the guy who is going to be the 45th president,” Steve Harvey said pic. twitter.   —   CBS News (@CBSNews) January 13, 2017,  Harvey said he plans to partner with Trump’s Department of Housing and Urban Development nominee Dr. Ben Carson on restoring America’s inner cities. “Trump wants to help with the situations in the inner cities so he immediately got Dr. Ben Carson on the phone to put us together to begin dialog in looking at programs and housing to help our inner cities and he’s very open to my mentoring efforts across the country,” Harvey said. “I walked away feeling like I had just talked with a man who genuinely wants to make a difference in this area,” he added. “I feel that something really great could come out of this  …     I would sit with him anytime. ” My meeting with @realDonaldTrump   …     pic. twitter.   —   Steve Harvey (@IAmSteveHarvey) January 13, 2017,  Harvey, who endorsed Hillary Clinton for president, came under fire after it was discovered that his staff provided prepared questions to Clinton’s campaign before a February interview on his radio show. “Another one they want to start with as a target is Detroit,” Harvey told reporters. “Ben Carson expressed that because quite naturally he is from Detroit. I want to do something with all of the major inner cities to see if we can bring about some change and help some of these young people out. And so that’s why I’m here, and it was a successful meeting. And he seemed really sincere. ” “It’s an honor to be invited to talk, and I think that’s the only way that we’re going to unify our country,” Harvey said. “We’ve got to talk. ”'"}, "time": 1742562041.0406783}