{"duration": 0.031221628189086914, "input_args": {"text": "'President Donald Trump’s new immigration policies will help grow Mexicans’ home economy, says a new report in the Washington Post. [“Economist Luis de la Calle   …     predicted that, in the short term, average wages [in Mexico] will drop as more qualified people enter the country to compete for scarce jobs [and] the overall economy is likely to expand in the long run when those people start to succeed,” said the March 3 Washington Post article, which noted that roughly 500 Mexicans are being sent home each day by Trump’s popular emphasis on enforcement of the immigration laws.  “We suffered a cost as a nation by sending those hard workers to the U. S. in the sense that we lost a lot of talent [so] when they come back to Mexico and they are properly trained, they will make more than a proportional contribution to Mexico,” La Calle told the Post. The labor stimulus from the United States back into Mexico will drive down labor costs, said the Post, mirroring Trump’s argument that the reduction of legal and illegal immigrant labor in the United States will drive up wages for Americans. “More returnees [to Mexico] means lower wages for everybody in   industries such as construction and automobile manufacturing, where competition for jobs is likely to increase, economists say. ” the Post said. But the Mexicans who are returning to Mexico’s   economy bring their skills, including a knowledge of what is possible in a     civic society, says experts cited by the Washington Post. “A lot of these people ran businesses in the U. S. and did well,” said Andrew Selee, director of the Mexico Institute at the Woodrow Wilson Center in Washington. “In the same way that in the United States we saw a wave of Mexicans who became part of the American culture and changed it, we’re now seeing a wave of Mexicans moving back who are integrating American culture into Mexico. ”   …     Jill Anderson, director of Otros Dreams en Acción (Other Dreams in Action) an advocacy group for former undocumented immigrants who grew up in the United States   …     [said] “It really interrupts the economic and social norms of Mexico   …     They speak English, and they’re asking for access to higher education and to employment in ways that their parents were not able to. ” Read the entire article here.   percent of Trump supporters have a positive view of Mexican immigrants in the United States  —   but 75 percent of his supporters also have a positive view of “Mexicans living in Mexico,” according to a survey of 2, 061 adult Americans, published Oct. 6 by the Chicago Council on Global Affairs. That positive view of    is shared by 80 percent of Republicans, 80 percent of all Americans, and 82 percent of Democrats, leaving Trump’s supporters with similar generous attitudes as other Americans towards foreigners living in their countries. In his Feb. 28 speech to the joint session of Congress, Trump declared: Nations around the world, like Canada, Australia and many others  —    have a   immigration system.  It is a basic principle that those seeking to enter a country ought to be able to support themselves financially.  Yet, in America, we do not enforce this rule, straining the very public resources that our poorest citizens rely upon.  According to the National Academy of Sciences, our current immigration system costs America’s taxpayers many billions of dollars a year. Switching away from this current system of   immigration, and instead adopting a   system, will have many benefits:  it will save countless dollars, raise workers’ wages, and help struggling families  —    including immigrant families  —    enter the middle class. I believe that real and positive immigration reform is possible, as long as we focus on the following goals: to improve jobs and wages for Americans, to strengthen our nation’s security, and to restore respect for our laws. Trump’s proposed shift to “a   immigration system” would reduce the inflow of unskilled migrants, but perhaps also raise the inflow of skilled migrants.  '"}, "time": 1742628518.870725}