{"duration": 0.10684871673583984, "input_args": {"text": "'It’s not often a mother tries to persuade her teenage son to attend a music festival with her. But Desert Trip is not your average festival. On Friday night, an   team of classic rock veterans  —   the Rolling Stones, Bob Dylan, Paul McCartney, Neil Young, the Who and Roger Waters of Pink Floyd  —   will begin its first of two weekends on the same storied bill at the Empire Polo Club in Indio, Calif. Among the crowd will be Julie Varon, a mother of three from Seattle, who grew up on the rock ’n’ roll that once soundtracked and spurred the counterculture. Also taking part, though not entirely of his own volition: Ms. Varon’s    son, Sam, who prefers modern country music and Coachella, the annual pop festival that shares an organizer and location with Desert Trip. “This is definitely a little bit of a twist,” Sam said a few days before the event. His mother chimed in: “A twist of the arm. ” She added: “It didn’t help that people started calling it Oldchella. But he gets it. ” Like many of the 150, 000 people expected at the festival, Ms. Varon, 59, saw Desert Trip as a historic event, a   last chance to commune with these titans of   rock. As a baby boomer, she also happens to be in the target demographic. By pairing such venerated acts with amenities of relative luxury (seating options, extra bathrooms, gourmet food) the promoters of Desert Trip have created a destination for an underserved festival audience with the time, means and inclination to go all out for what is seen as a singular occasion. Matthew Thirlwall, 60, a geology professor living outside London, spent $898 plus fees for a V. I. P. ticket that comes with the “culinary experience bundle,” on top of airfare and a camping pass. (  tickets topped out at $1, 599.) “I decided a year or two ago that life had much more to offer than working   days, and decided to take part in early partial retirement,” Mr. Thirlwall said. Emboldened by a trip to Burning Man this year, he had decided to make Desert Trip his first rock festival. “One of my daughter’s friends at university said, ‘Oh, your dad’s so cool,’” he recalled. Simone Harle, 47, a journalist in Perth, Australia, also decided to cross oceans for the event. She called the   trip to Indio  —   her first visit to the United States  —   “a pilgrimage” in honor of the music. “This is the soundtrack to my life,” she said, which made an overall cost of more than $5, 000 a  . “It was an automatic reaction for me. I’ve got goose bumps all over my body and on my eyeballs just thinking about it. ” Others took the idea of a musical pilgrimage even further. Jon Langille, 55, spent a month riding an electric bicycle more than 1, 800 miles to the festival from British Columbia. “My wife and I couldn’t agree on what kind of trip to make this,” he said. “Her idea was to fly in and fly out. That’s all fine and dandy, but I really wanted to make an experience of it. ” He continued, “I’ve been a busy guy for 20 years and the opportunity to take a month off and be by myself, to meditatively pedal my bicycle 2, 000 miles to a rock concert, really appealed to me  —   especially for a     thing like this. ” Ms. Varon was equally committed to attending, but went the crafty route instead: To ensure access to the   show and save money, she sought a job on the Desert Trip grounds and was hired as a supervisor for the V. I. P. ushers both weekends. Her son Sam will be on staff as well. “He was available,” Ms. Varon said. At home, “he’s golfing, job searching and sitting on the couch  —   he’s having a good old time  —   but I was like, ‘This is kind of mandatory. ’” While the Indio area is known for its   snowbirds, retirees and familial duos are not its typical festival audience. “I would never rent my house to the Coachella or Stagecoach people,” said Susan Andrews, who lives in nearby Indian Wells, of the annual   events also held at the Polo Grounds. “They tell you it’s a group of four and it’s really a group of 15. ” For Desert Trip, however, Ms. Andrews opted to rent six of her time share properties to concertgoers, along with the three spare bedrooms in her home. “I have a doctor coming to stay,” she said. “These are older people  —   some of them went to Woodstock. They’ll be calm. ” Another local, Cheryl Craig, said she, too, expects a more tranquil crowd for Desert Trip, which she plans to attend both weekends. “This is the kind of music that I grew up on,” Ms. Craig, 57, said. “Just having lost Prince and David Bowie this year, you wonder: When is the last time you’re going to get to see these people?” Such   reminiscence may prove inevitable for fans at a gathering with such weighty, last hurrah connotations. “These bands were a moment in my life a long time ago and they were very significant,” said Mr. Langille, the cyclist. “I, like probably them, have moved on past my heyday years, but it’s a great opportunity to revisit that time and those people. ” At the same time, being among peers “might be kind of refreshing,” not simply nostalgic, he said. At concerts geared toward younger audiences, “people in their 20s are   us like we’ve just discovered rock music,” Mr. Langille said. “It drives me nuts. ”'"}, "time": 1742563713.6707053}