{"duration": 0.06678009033203125, "input_args": {"text": "'Home › GUNS › HILLARY PROMISES END TO VIOLENCE THROUGH CIVILIAN DISARMAMENT HILLARY PROMISES END TO VIOLENCE THROUGH CIVILIAN DISARMAMENT 3 SHARES \\n[10/31/16] With just days left before Americans will go to the polls to elect a new president, voters committed to continuing to live under the protections of personal liberty in the Constitution must examine positions taken by the candidates on key issues. \\nIn this article, we’ll look at Hillary Clinton’s call for civilian disarmament and what Americans could do to prevent this policy from coming to pass, even if Clinton is sworn in as the 45th president of the United States. \\nOn her campaign website, Clinton makes several unconstitutional promises that would have the effect of disarming millions of Americans and threatening the enjoyment of the right to keep and bear arms of millions more. Here’s a sample from her list of presidential promises: \\nAs president, Hillary will: \\nExpand background checks to more gun sales — including by closing the gun show and internet sales loopholes — and strengthen the background check system by getting rid of the so-called “Charleston Loophole.” \\nTake on the gun lobby by removing the industry’s sweeping legal protection for illegal and irresponsible actions (which makes it almost impossible for people to hold them accountable), and revoking licenses from dealers who break the law. \\nKeep guns out of the hands of domestic abusers, other violent criminals, and the severely mentally ill by supporting laws that stop domestic abusers from buying and owning guns, making it a federal crime for someone to intentionally buy a gun for a person prohibited from owning one, and closing the loopholes that allow people suffering from severe mental illness to purchase and own guns. She will also support work to keep military-style weapons off our streets. \\nThere are so many constitutionally repugnant statements in these three paragraphs. \\nFirst, there is no such thing as a gun show loophole. Here’s the truth as explained by the libertarian-leaning Cato Institute: \\nIf the voters learn the facts about gun shows, they will discover that there is no gun show loophole, no gun show crime problem and no reason to adopt federal legislation whose main effect would be to infringe on First and Second Amendment rights. \\nDespite what some media commentators have claimed, existing gun laws apply just as much to gun shows as they do to any other place where guns are sold. Since 1938, persons selling firearms have been required to obtain a federal firearms license. If a dealer sells a gun from a storefront, from a room in his home or from a table at a gun show, the rules are exactly the same: he can get authorization from the FBI for the sale only after the FBI runs its “instant” background check (which often takes days to complete). As a result, firearms are the most severely regulated consumer product in the United States — the only product for which FBI permission is required for every single sale. \\nSurely Clinton and her advisors are aware of this fact and that they are misrepresenting the situation to uninformed voters, thus their insistence on “closing the gun show loophole” becomes nothing less than another attempt to demand the surrender of natural rights in exchange for a “safer world.” \\nNext, with regard to the creation of “universal background checks,” here’s more from Cato: \\nGun-control advocates often claim that 40 percent of annual firearms sales take place today without background checks. The Washington Post “fact-checker” has debunked that claim, giving it “Three Pinocchios.” The Post noted that the survey data used for the study on which the 40 percent claim is based are more than two decades old, which means they were collected prior to the National Instant Criminal Background Check System becoming operational in 1998. The survey only polled 251 people, and, upon asking whether their gun transfer involved a federally licensed dealer — that is, a federal firearms licensee (FFL) — gave respondents the choice of saying “probably” or “probably not” in addition to “yes” and “no.” Post navigation'"}, "time": 1742628398.0649421}