{"duration": 0.18468236923217773, "input_args": {"text": "\" Donald Trump's Victory Speech Video\\n'I will not let you down': Trump's victory speech\\nPresident-elect Donald Trump speaks to his supporters moments after being declared the winner in the 2016 presidential election.\\nWatch Hillary Clinton\\x92s Concession Speech Here\\nWatch Obama Full Speech on Donald Trump Win\\n TRUMP: Thank you. Thank you very much, everyone.\\n(APPLAUSE)\\nSorry to keep you waiting; complicated business; complicated.\\n(APPLAUSE)\\nThank you very much.\\n(APPLAUSE)\\nTRUMP: I\\x92ve just received a call from Secretary Clinton.\\n(APPLAUSE)\\nShe congratulated us \\x97 it\\x92s about us \\x97 on our victory, and I congratulated her and her family on a very, very hard-fought campaign. I mean, she \\x97 she fought very hard.\\nHillary has worked very long and very hard over a long period of time, and we owe her a major debt of gratitude for her service to our country.\\n(APPLAUSE)\\nI mean that very sincerely.\\n(APPLAUSE)\\nNow it\\x92s time for America to bind the wounds of division; have to get together. To all Republicans and Democrats and independents across this nation, I say it is time for us to come together as one united people.\\n(APPLAUSE)\\nIt\\x92s time. I pledge to every citizen of our land that I will be president for all Americans, and this is so important to me.\\n(APPLAUSE)\\nFor those who have chosen not to support me in the past, of which there were a few people. . .\\n(LAUGHTER)\\n. . . I\\x92m reaching out to you for your guidance and your help so that we can work together and unify our great country.\\n(APPLAUSE)\\nAs I\\x92ve said from the beginning, ours was not a campaign, but rather an incredible and great movement made up of millions of hard-working men and women who love their country and want a better, brighter future for themselves and for their families.\\n(APPLAUSE)\\nIt\\x92s a movement comprised of Americans from all races, religions, backgrounds and beliefs who want and expect our government to serve the people, and serve the people it will.\\n(APPLAUSE)\\nWorking together, we will begin the urgent task of rebuilding our nation and renewing the American dream. I\\x92ve spent my entire life and business looking at the untapped potential in projects and in people all over the world. That is now what I want to do for our country.\\n(APPLAUSE)\\nTremendous potential. I\\x92ve gotten to know our country so well \\x97 tremendous potential. It\\x92s going to be a beautiful thing. Every single American will have the opportunity to realize his or her fullest potential. The forgotten men and women of our country will be forgotten no longer.\\n(APPLAUSE)\\nWe are going to fix our inner cities and rebuild our highways, bridges, tunnels, airports, schools, hospitals. We\\x92re going to rebuild our infrastructure, which will become, by the way, second to none. And we will put millions of our people to work as we rebuild it.\\nWe will also finally take care of our great veterans.\\n(APPLAUSE)\\nThey\\x92ve been so loyal, and I\\x92ve gotten to know so many over this 18-month journey. The time I\\x92ve spent with them during this campaign has been among my greatest honors. Our veterans are incredible people. We will embark upon a project of national growth and renewal. I will harness the creative talents of our people and we will call upon the best and brightest to leverage their tremendous talent for the benefit of all. It\\x92s going to happen.\\n(APPLAUSE)\\nWe have a great economic plan. We will double our growth and have the strongest economy anywhere in the world. At the same time, we will get along with all other nations willing to get along with us. We will be.\\n(APPLAUSE)\\nWe\\x92ll have great relationships. We expect to have great, great relationships. No dream is too big, no challenge is too great.\\nTRUMP: Nothing we want for our future is beyond our reach.\\nAmerica will no longer settle for anything less than the best.\\n(APPLAUSE)\\nWe must reclaim our country\\x92s destiny and dream big and bold and daring. We have to do that. We\\x92re going to dream of things for our country and beautiful things and successful things once again.\\nI want to tell the world community that while we will always put America\\x92s interests first, we will deal fairly with everyone, with everyone \\x97 all people and all other nations. We will seek common ground, not hostility; partnership, not conflict.\\nAnd now I\\x92d like to take this moment to thank some of the people who really helped me with this, what they are calling tonight, very, very historic victory.\\nFirst, I want to thank my parents, who I know are looking down on me right now.\\n(APPLAUSE)\\nGreat people. I\\x92ve learned so much from them. They were wonderful in every regard. I had truly great parents.\\nI also want to thank my sisters, Maryanne and Elizabeth, who are here with us tonight. And, where are they? They\\x92re here someplace. They\\x92re very shy, actually. And my brother Robert \\x97 my great friend. Where is Robert? Where is Robert?\\n(APPLAUSE)\\nMy brother Robert. And they should all be on this stage, but that\\x92s OK. They\\x92re great. And also my late brother, Fred. Great guy. Fantastic guy.\\n(APPLAUSE)\\nFantastic family. I was very lucky. Great brothers, sisters; great, unbelievable parents.\\nTo Melania and Don. . .\\n(APPLAUSE) . . . and Ivanka. . .\\n(APPLAUSE)\\n. . . and Eric and Tiffany and Baron, I love you and I thank you, and especially for putting up with all of those hours. This was tough. (APPLAUSE)\\nThis was tough. This political stuff is nasty and it\\x92s tough. So I want to thank my family very much. Really fantastic. Thank you all. Thank you all.\\nAnd Lara, unbelievable job, unbelievable.\\nVanessa, thank you. Thank you very much.\\nWhat a great group. You\\x92ve all given me such incredible support, and I will tell you that we have a large group of people. You know, they kept saying we have a small staff. Not so small. Look at all the people that we have. Look at all of these people.\\nAnd Kellyanne and Chris and Rudy and Steve and David. We have got \\x97 we have got tremendously talented people up here. And I want to tell you, it\\x92s been \\x97 it\\x92s been very, very special. I want to give a very special thanks to our former mayor, Rudy Giuliani.\\n(APPLAUSE)\\nUnbelievable. Unbelievable. He traveled with us and he went through meetings. That Rudy never changes. Where\\x92s Rudy? Where is he? Rudy.\\nGovernor Chris Christie, folks, was unbelievable.\\n(APPLAUSE)\\nThank you, Chris.\\nThe first man, first senator, first major, major politician, and let me tell you, he is highly respected in Washington because he\\x92s as smart as you get: Senator Jeff Sessions. Where is Jeff?\\n(APPLAUSE)\\nGreat man.\\nAnother great man, very tough competitor. He was not easy. He was not easy. Who is that? Is that the mayor that showed up?\\n(LAUGHTER)\\nIs that Rudy? Oh, Rudy got up here.\\nAnother great man who has been really a friend to me. But I\\x92ll tell you, I got to know him as a competitor because he was one of the folks that was negotiating to go against those Democrats: Dr. Ben Carson. Where is Ben?\\n(APPLAUSE)\\nWhere is Ben?\\nTRUMP: And by the way, Mike Huckabee is here someplace, and he is fantastic. Mike and his family, Sarah \\x97 thank you very much.\\nGeneral Mike Flynn. Where is Mike?\\n(APPLAUSE)\\nAnd General Kellogg. We have over 200 generals and admirals that have endorsed our campaign. And they\\x92re special people and it\\x92s really an honor. We have 22 congressional Medal of Honor recipients. We have just tremendous people.\\nA very special person who believed me and, you know, I\\x92d read reports that I wasn\\x92t getting along with him. I never had a bad second with him. He\\x92s an unbelievable star. He is. . .\\n(CROSSTALK)\\nTRUMP: That\\x92s right. How did you possibly guess? So let me tell you about Reince, and I\\x92ve said this. I said, Reince \\x97 and I know it, I know. Look at all those people over there. I know it. Reince is a superstar. But I said, \\x93They can\\x92t call you a superstar, Reince, unless we win,\\x94 because you can\\x92t be called a superstar \\x97 like Secretariat \\x97 if Secretariat came in second, Secretariat would not have that big, beautiful bronze bust at the track at Belmont.\\nBut I\\x92ll tell you, Reince is really a star. And he is the hardest-working guy. And in a certain way, I did this \\x97 Reince, come up here. Where is Reince? Get over here, Reince.\\n(APPLAUSE)\\nBoy oh boy oh boy. It\\x92s about time you did this, Reince. My God.\\n(APPLAUSE)\\nSay a few words. No, come on, say something.\\nRNC CHAIRMAN REINCE PRIEBUS: Ladies and gentlemen, the next president of the United States, Donald Trump.\\n(APPLAUSE)\\nThank you. It\\x92s been an honor. God bless. Thank God.\\nTRUMP: Amazing guy.\\nOur partnership with the RNC was so important to the success and what we\\x92ve done.\\nSo I also have to say I\\x92ve gotten to know some incredible people \\x97 the Secret Service people.\\n(APPLAUSE)\\nThey\\x92re tough and they\\x92re smart and they\\x92re sharp, and I don\\x92t want to mess around with them, I can tell you. And when I want to go and wave to a big group of people and they rip me down and put me back down on the seat. But they are fantastic people, so I want to thank the Secret Service.\\n(APPLAUSE)\\nAnd law enforcement in New York City. They\\x92re here tonight.\\n(APPLAUSE)\\nThese are spectacular people, sometimes underappreciated unfortunately, but we appreciate them. We know what they go through.\\nSo, it\\x92s been what they call a historic event, but to be really historic, we have to do a great job. And I promise you that I will not let you down. We will do a great job. We will do a great job.\\n(APPLAUSE)\\nI look very much forward to being your president, and hopefully at the end of two years or three years or four years, or maybe even eight years. . .\\n(APPLAUSE)\\n. . . you will say, so many of you worked so hard for us, but you will say that \\x97 you will say that that was something that you really were very proud to do and I can. . .\\n(CROSSTALK)\\nTRUMP: Thank you very much.\\nAnd I can only say that while the campaign is over, our work on this movement is now really just beginning.\\n(APPLAUSE)\\nWe\\x92re going to get to work immediately for the American people. And we\\x92re going to be doing a job that hopefully you will be so proud of your president. You\\x92ll be so proud. Again, it\\x92s my honor. It was an amazing evening. It\\x92s been an amazing two-year period. And I love this country.\\n(APPLAUSE) Thank you. Thank you very much.\\n(APPLAUSE)\\nThank you to Mike Pence. Thank you.\\n(APPLAUSE)\""}, "time": 1742564415.8998349}