{"duration": 0.10333251953125, "input_args": {"text": "'Shopping for consumer electronics can get overwhelming. The staff of The Wirecutter and The Sweethome, product review websites owned by The New York Times, do the hard work of narrowing down the options. We spoke with Lauren Dragan, the headphone editor, about  —   what else?  —   headphones.  There are so many choices for earphones and earbuds. How do I decide what to buy? It’s tough! There really isn’t any one headphone that works for all situations, so sometimes the best option is having two less expensive headphones that are suited to your lifestyle and listening habits. If you know how you’ll use them, you can better figure out what features will be important. What do you use? Because of my job, I get to know the perfect headphone for every situation. I think I regularly rotate among seven pairs. I have a Plantronics Backbeat Fit for running  —   they’re unsealed so I can hear traffic and my surroundings  —   an Oppo   for longer listening sessions, a   Bose QC25 for flying (and vacuuming) a Plantronics Voyager Focus UC headset for business calls, a   JLab Epic 2 Bluetooth for the gym, my custom   UE 11 for when I’m trying to get work done at a coffee shop, and then I rotate in whatever I’m currently   testing. I always spend a week using any potential top pick before we post a review so I can troubleshoot. I’ve caught a few problems that way. And yes, I’ve even done that with the kids’ headphones. I have a surprisingly small hat size. Why aren’t the new Apple cordless earbuds on the list? Ah, the AirPods. The current working term for those kinds of headphones is “true wireless. ” Aside from not having a cord to tangle and being decent at taking phone calls, the AirPods didn’t improve much over the corded EarPods. The sound quality is the same (which is to say, meh, with no bass). Plus the battery life is less than a full day at work, so you had better remember to charge them at lunch time. And this for $130 more than a replacement pair of EarPods? I don’t think they’re fully cooked yet. Do headphones and earbuds really have to cost so much? Some technology, like a Bluetooth antenna or an active   circuit, is going to cost a manufacturer a certain amount for the components and licensing fees. A manufacturer can’t get them into a product for any less. That sets a base manufacturing cost. So a good pair of   sport Bluetooth headphones, a solid product that will last you a few years, costs about $99. Anything below that will likely suffer in some way. To some people, that’s O. K. But you can’t expect magic for $30. On the other end, when you’re paying over $300, you are getting a combination of innovation, product quality and sound quality. But a lot of times, anything much above that, it’s just plain old marketing and hype. Are you thinking of any particular headphones? In the audio quality category, there’s the planar magnetic Oppo, Audeze, Mr. Speakers, brands like that. They range from $400 and up. Bose has the best    technology available, and it’s because the company spent a ton of money on research and development. And of course, Beats has the market cornered on branding. They’ve been making a lot of improvements to their sound quality. But the difference between them and others priced that high is that you’re paying $150 to $200 for sound and adding on another $100 or so for the Beats label. What’s your dream product? There’s the elusive unicorn: headphones that do everything well and work in any situation. That could be possible with what’s available to purchase today, but nobody has made it just yet. But I’m also really fascinated with where companies like Bragi and Here One are going with “hearables. ” Those are devices that are computers worn in your ears  —   like what Google Glass was trying to do with vision, but in your ears instead.'"}, "time": 1742562092.596427}