{"duration": 0.08987641334533691, "input_args": {"text": "'  \\nIn what amounts to the first pang of just how profound America’s Election Day screw up truly was, Trump’s campaign is reportedly already working on a plan to scrub that last eight years of progress out of existence on Trump’s very first day in office . No Obama accomplishment will remain. They even have a name for the plan: The First Day Project. \\nOrganized by the Heritage Foundation, the goal is to deprive Obama of any lasting effect to his time in office. It’s a perverse sort of vengeance from a group of clowns who have spent the last decade smearing the president at every possible step of the way. \\nTrump aides are organizing what one Republican close to the campaign calls the First Day Project. “Trump spends several hours signing papers—and erases the Obama Presidency,” he said. Stephen Moore, an official campaign adviser who is a senior fellow at the Heritage Foundation, explained, “We want to identify maybe twenty-five executive orders that Trump could sign literally the first day in office.” \\nThinking back over Obama’s list of wins – from gay rights to healthcare to the economy – the idea that these achievements can be erased by a collective of spiteful, bitter men in a matter of hours is almost too much to bear. The suffering to the people whose rights will surely be rolled back will be immense. \\nAnd on a separate, but equally terrifying front, Trump’s campaign surrogate Omarosa told reporters that Trump has been compiling an “enemies list”– an assortment of people on the right and left who openly stood against him – and he plans on punishing those on the list when he gets to office. \\n“I would never judge anybody for exercising their right to and the freedom to choose who they want. But let me just tell you, Mr. Trump has a long memory and we’re keeping a list.” \\nErase his predecessor, punish his enemies. In this way, with pen and sword, Trump plans to dismantle a democracy. The oldest, greatest one in the world – up until the point when it wasn’t. \\nFeatured image via Chip Somodevilla/Getty Images Share this Article!'"}, "time": 1742563392.7958195}