{"duration": 0.26366734504699707, "input_args": {"text": "' 01 UTC Verraad op hoog niveau: Bernhard, de Bilderberger had contacten met de CIA en Gladio Heel Nederland mocht zien dat koningin Juliana onhandig was. Het paste bij een staatshoofd dat vooral gewoon wilde zijn, terwijl dat helemaal niet kon. Haar hofhouding werd getypeerd als ,een lieflijke chaos.\" Commentaar: Onlangs werd bekend dat de Oranjes al decennialang compensatie krijgen voor de belasting die zij moeten betalen. Het heeft lang geduurd, maar nu is dr. Jolande Withuis\\' biografie van koningin Juliana er dan toch. Na zes jaar noeste vlijt presenteren uitgeverij Bezige Bij en Withuis\\' vroegere werkgever, het Nederlands Instituut voor Oorlogsdocumentatie (NIOD), woensdag het resultaat, 863 pagina\\'s dik. Met veel nieuwe verhalen, die toch vooral het beeld bevestigen dat zich in de loop der jaren van Juliana heeft gevormd. Dat die 863 pagina\\'s geen ogenblik vervelen, is een compliment voor Withuis\\' schrijfstijl. Met vaart beschrijft ze Juliana\\'s levensgang, waar het predikaat \"chaos\" vaak beter bij paste dan de typering \"lieflijk\". Toegang tot het Koninklijk Huisarchief kreeg de onderzoekster niet , maar ook daarbuiten was er genoeg materiaal. Commentaar: Wat hebben ze te verbergen? Huwelijk Zoals Wilhelmina de koningin van de oorlog was, zo was haar enige dochter de koningin van de wederopbouw, de vernieuwing en de democratisering. De sociale Juliana, monarch van 1948 tot 1980, gedijde goed in de decennia van groeiende welvaart. Koningin tegen wil en dank? Het is een van de vele fabels die de ronde deden. De werkelijkheid was volgens Withuis anders. Juliana ,koesterde na haar aantreden geruime tijd de ambitie een der grootste vorstinnen op aarde te worden.\" Dat werd ze niet. Privé was het soms bijzonder weinig rozengeur en maneschijn. Veel details over haar ongelukkige huwelijk kwamen pas later naar buiten, toen \\'oorlogsheld\\' - dat was hij allerminst - Bernhard steeds meer werd ontmaskerd als schuinsmarcheerder. Zelfs minderjarige jongedames die in het paleis op bezoek kwamen, waren voor hem niet veilig . In plaats van Juliana\\'s steunpilaar werd hij haar achilleshiel, die haar soms diep vernederde , schrijft Withuis. Het was Juliana\\'s ,man van haar dromen\" vooral om een goede positie te doen . Dit boek verbloemt de misère niet, zoals dat vroeger wel gebeurde. Commentaar: Macht werkt als een magneet op psychopaten. Vliegende schotels Koningin Juliana had veel belangstelling voor religie. ,Dat is een van de weinige constanten in haar overigens tamelijk grillige leven\", stelt Withuis vast. ,Haar geloof behelsde geen traditioneel christendom, maar een diffuse religiositeit, waarin hel en verdoemenis ontbraken en \\'alternatieve\\' en oosterse invloeden alle ruimte kregen. Juliana hechtte eraan onconventioneel te zijn, ook in geloofszaken.\" Dat bleek toen ze zich aan gebedsgenezeres Greet Hofmans vastklampte en later toen ze - reeds dementerend - in de huwelijksdienst van prins Maurits ter communie ging. Van Hofmans moest ze afstand nemen, en dat ging allerminst van harte. ,Ze poogde, hoewel ze niet meer meedeed, toch contact te houden. Haar vroegere vrienden behandelden haar echter zoals elke sekte uittreders behandelt: als een minne deserteur, tevens verdoemde.\" Met Hofmans was de zweverigheid overigens niet weggejaagd. De koningin ging zich nu bezighouden met vliegende schotels en buitenaardse wezens, en hield decennialang aan die denkbeelden vast. Commentaar: Wat wist Juliana werkelijk? Moederlijk Nieuwe crises volgden rond de partnerkeuze van de prinsessen Irene en Beatrix. Juliana vond de ophef over Irenes overgang naar de Rooms-Katholieke Kerk maar moeilijk: ,Wij mogen ons toch allen Gods kinderen weten en dat is de onverbrekelijke band onder de mensen\", sprak ze voor de radio. Prinses Juliana werd na haar overlijden in 2004 vooral herdacht als een sociaal betrokken, moederlijke vrouw. Ze werd een geliefd vorstin, en daaraan deed het Lockheedschandaal - haar man had steekpenningen aangenomen van een vliegtuigfabrikant - geen afbreuk. Niet zonder reden koos dochter Beatrix voor een totaal andere regeerstijl. Commentaar: Ook was hij betrokken bij illegale wapenleveranties aan Indonesië . Citaten van biografe Withuis over koningin Juliana - Juliana riep veeleer mededogen op dan woede: die onbetrouwbare man, die dominante moeder, die zelfbewuste dochter en dan zelf zo verlegen... Dat aan dit beeld een flinke dosis theater te pas kwam, werd niet beseft. - Juliana was warrig en chaotisch. Er is overigens geen reden die verwardheid al toe te schrijven aan haar latere dementie. Het was veeleer haar manier van werken. Voor veel Haagse politici en ambtenaren was de komst van de nieuwe vorstin (Beatrix) een verademing. - Beatrix had uit het jarenlang aanzien van wat zij zag als het disfunctioneren van haar moeder de conclusie getrokken dat \\'gewoon\\' en \\'koningin\\' niet samengaan. - (Over de inhuldiging van koningin Beatrix in 1980:) Toen zijn hoofdcommissaris hem telefonisch toestemming vroeg om te schieten, omdat de horden dreigden de Dam te bereiken, antwoordde de Amsterdamse burgemeester W. Polak vanuit de Nieuwe Kerk met een vastberaden: Nee. - (Personeelsleden op Soestdijk:) Als je een foutje maakte, zag ze dat zogenaamd niet. Ze zou dan niet naar de intendant gaan om te klagen. Bernhard wel. Bij hem moest alles perfect tot in de puntjes zijn. Was het zwembad 30 graden in plaats van 31, dan belde hij de huismeester. - Haar steun ten tijde van de Lockheed-ontmaskering had de liefde van haar echtgenoot niet doen groeien. (...) Het is niet waar dat Juliana en Bernhard gescheiden van elkaar in een Baarnse en een Soestervleugel van het paleis leefden. Wel was het personeel verdeeld: men was óf op haar óf op zijn hand. (...) De verhouding met Bernhard was en bleef kil. Ze zat vaak tot diep in de nacht alleen tv te kijken in de bibliotheek. Samen eten deden ze zelden. (...) Bezoekers van Bernhard maakten regelmatig mee dat Juliana gesprekken van haar man trachtte te verstoren. (...) Toch bleef Bernhard Juliana\\'s grote liefde. Haar liefste wens was dat het tussen hen nog goed zou komen. Haar slaapkamer stond vol met zijn foto\\'s. Soms viel ze in slaap met zijn foto tegen haar borst gedrukt. - Geestelijk was en bleef Juliana een alleseter. Ze ging bijna wekelijks naar de kerk, maar wel steeds naar een andere. Vanaf ongeveer 1996 keek ze, in plaats van een kerk te bezoeken, naar Hour of Power met een populaire tv-dominee van de Amerikaanse megakerk Crystal Cathedral of naar Nederland Zingt van de EO. (...) Juliana bleef haar inspiratie opdoen bij hele en halve kwakzalvers, auteurs die zich vooral manifesteerden buiten de wetenschap en de gangbare theologie. - Tussen 1987 en 1997 ging Juliana\\'s geheugen achteruit. Bernhard kon daar niet tegen. Als ze hem iets voor een tweede keer vroeg, reageerde hij grof en ongeduldig, waarna zij tranen met tuiten huilde. Amnestie of slagroomtaart Sommigen geloven nog steeds in de sprookjes van het koningshuis, maar achter het masker ziet men de beerput Voor Van Agt was het die eerste vrijdag van het jaar ( 1980 ) een verrassing geweest dat de koningin wilde aftreden; het onderwerp was in hun gesprekken nooit eerder aan de orde geweest. Naar hij vermoedt had ze dit moment mede gekozen, omdat het kabinet net voor het kerstreces een debat in de Tweede Kamer had doorstaan over de heftigste controverse uit die jaren: de kruisraket, en dus ondanks de economische crisis en de onrustbarend stijgende werkloosheid , stevig in het zadel leek te zitten. Dat bleek niet helemaal het geval: drie weken na Juliana\\'s aankondiging van haar troonsafstand trad minister van Financiën mr. F. H. J. J. Andriessen (CDA) af, omdat er zijns inziens te weinig werd bezuinigd. Niettemin vond Van Agt het verstandig dat de koningin haar functie neerlegde. Haar laatste jaren waren, zoals hij het uitdrukt, ,niet haar meest glorieuze.\" Juliana was vaak ,verward.\" Zo ook de dag dat ze via de televisie haar abdicatie aankondigde. Op de ochtend van 31 januari gaf de minister-president persoonlijk de voorzitter van de NOS, mr. E. Jurgens, opdracht alles in gereedheid te brengen voor een opname die namiddag en een uitzending diezelfde avond. Toen hij in de vroege avond zelf op Soestdijk arriveerde, bleek het daar een chaos. De koningin had het, haar traditie getrouw, aan de stok met de televisiemensen. Zij wilde dat haar hondje Zara terwijl zij sprak bij haar op schoot zou liggen en dat haar papegaaienkooi op de achtergrond stond, zodat ze haar \\'landgenoten\\' vanuit een huiselijke sfeer zou toespreken. De geluids- en cameramensen daarentegen, die haar lastige gedrag toeschreven aan het feit dat er vanaf de ochtend sherry was geschonken, leek gekrijs en geblaf tijdens zo\\'n officieel gebeuren geen goed idee. Maar het was haar huis, dus zij ,deed nou eens waar ze zin in had\", verklaarde ze. Ze vond dat de technici te weinig opschoten en te veel rommel maakten. Het door haarzelf bepaalde tijdstip van haar proclamatie kwam bij nader inzien slecht uit. Personeel en apparatuur moesten voor achten weg zijn, liet ze NOS-directeur Enkelaar weten, want dan begon in diezelfde kamer het verjaardagsfeestje van haar dochter. Zara, waarvoor hij toch al weinig warme gevoelens koesterde, moest op gezag van de minister-president weg. Lorre bleef; de cameraman koos voor zijn opname een hoek vanwaaruit hij niet in beeld kwam. Mocht de vogel vreemde geluiden gaan voortbrengen, dan zou hij de lens alsnog op hem richten, opdat het publiek geen ongewenste conclusies zou trekken over de gezondheidstoestand van de vorstin. (...) In haar laatste maanden als vorstin probeerde Juliana nog haar zin te krijgen in een oude kwestie. Een van de categorieën \\'zielige mensen\\' voor wie zij zich graag inzette waren gedetineerden. Al was het vanuit verschillende motieven, inzake de Drie van Breda hadden Juliana en Van Agt, toen nog minister van Justitie, in 1972 op één lijn gezeten. Dat had haar hoop gegeven toen ze hem een jaar later had voorgesteld om ter gelegenheid van haar vijfentwintigjarig ambtsjubileum gratie te verlenen aan gedetineerden. Als archaïsch prerogatief uit de tijd dat vorsten als dragers van de absolute macht ook rechtspraken , staat amnestie haaks op de constitutionele monarchie. Van Agt had dan ook getracht Juliana van het idee af te brengen. Het concept \"jubileumgratie\", had hij haar uitgelegd, paste vanwege de willekeur niet in het moderne strafrecht; voorts zou haar voorstel waarschijnlijk leiden tot hernieuwde discussies over de Drie. Commentaar: Aangezien leden van deze familie met regelmaat Bilderbergconferenties bezoeken moeten we hun macht niet onderschatten. Zeven jaar na dato trachtte Juliana haar oude wens buiten Van Agt om alsnog te verwezenlijken. Een internationale verplichting van de minister-president kwam daarbij goed van pas. In overleg met de koningin besloot Van Agt een reis naar Indonesië en Japan, die al gepland stond voor hij wist van de aanstaande troonswisseling, goeddeels te handhaven. Juliana maakte van zijn afwezigheid prompt gebruik om de amnestie opnieuw aan te kaarten, maar ook zonder premier willigde het kabinet dit verlangen natuurlijk niet in. Vicepremier en minister van Binnenlandse Zaken Wiegel en raadadviseur Van der Voet moesten haar daarvan overtuigen, wat nog niet meeviel. Na veel heen-en-weergepraat stelde de koningin als compromis voor om dan maar alle gedetineerden op Koninginnedag op slagroomtaart te trakteren. Naar het verhaal wil (se non è vero...), antwoordde Wiegel: ,Een uitstekend idee, majesteit, en dan spuiten we op elk van die taarten: ,Nog vele jaren!\"\" Juliana had voldoende humor om mét beide heren in lachen uit te barsten. De amnestie was van de baan.\" Uit: \" Juliana, vorstin in een mannenwereld\", door Jolande Withuis. Uitg. De Bezige Bij, Amsterdam/Antwerpen 2016; ISBN 978 90 234 3523 5; 863 pag.; € 39,99. Lees ook in Digibron Juliana\\'s oorlog : Voorpublicatie van een nog te verschijnen biografie van Jolande Withuis (Protestants Nederland, 01-04-2015 ) Juliana als ambassadrice (Reformatorisch Dagblad, 03-03-2014 ) De eeuw van vorstin Juliana : Hervormd, maar vooral oecumenisch en spiritueel (Protestants Nederland, 01-04-2009 ) Juliana, vrouw met warm en sociaal hart : Koningschap staat vooral in het teken van de wederopbouw van Nederland (Reformatorisch Dagblad, 20-03-2004 ) Commentaar: Bernhard was ook betrokken bij de Gladio/Stay Behind Networks en waarschijnlijk zeer chantabel vanwege zijn misbruik van \\'minderjarige jongedames\\'.'"}, "time": 1742564016.0624247}