{"duration": 0.07881331443786621, "input_args": {"text": "'Posted on April 15, 2013 by Christian Zionist | 15 Comments \\nWhether this article is true or not, it is worth the read. I knew we were headed towards communism when the American electorate chose Clinton, not once, but twice. I knew because I’d gone to high school with Bill Clinton’s wife, Hillary Clinton, and I knew her politics. It frightened me, but I thought we could recover. With the election of Obama, not once, but twice, we are now truly a communist nation. There are barely any threads of the Republic left to grab onto and the nation still sleeps. If we don’t awaken the “sleeping giant” soon, the Gulags of Russia will become an American reality. KJLN \\nA Russian government official bragged that Barack Obama was a KGB operative and that his presidency had been planned since birth, an American physicist and government contractor reports. Tom Fife, an American computer networking specialist and international businessman, reported the alarming facts about the Kremlin’s connection to Barack Obama. The boast from a Communist Party official reportedly occurred during a business trip to Russia,16 years before Barack Obama was ushered into the presidency of the United States. “It was like an elastic band snapping all the way from 1992,” Fife shakily admitted, upon recall of the exact moment he realized the Communist official had been telling the truth. \\n“It was a very, very scary feeling.” \\nFife, a physicist and computer engineer, had been traveling to Russia for a joint venture with a state-owned company when the shocking revelation was revealed to him. After several business meetings, Fife and his partner were invited to the company owner’s home at the end of the journey for a farewell dinner. \\nThe owner’s wife was a Communist Party official and was “climbing two ladders”, as Fife puts it, one ladder being the KGB and the other being the traditional Russian society and business ladder. As the evening wore on, the female Communist official became increasingly agitated over a perceived slight and her emotions spilled over. \\n“You Americans like to think you’re so perfect!” she snarled. “Well, what if I told you that very, very soon you’re going to have a black president… and he’s going to be a Communist!” \\nThe KGB operative was not finished. As she had now dropped this bombshell on the entire gathering, she felt compelled to continue. \\n“His name is Barack,” she sneered. “His mother is white and his father is an African black. He has gone to the best schools, he is what you would call ‘Ivy League’.” \\nFife recalls being stunned and shocked at the words flowing from the Communist’s mouth as she continued to rattle off an incredibly precise set of details about this Communist operative who was to supposedly become president of the United States. \\nThe Communist official then stated that he was from Hawaii, but would very soon be elected to the Chicago state legislature. This has turned out to be an eerily prescient prediction, as Barack Obama was not elected State Senator until 1996, a full 4 years afterwards, as he took Alice Palmer’s seat. \\nIn 1992, Obama had recently graduated from Harvard Law School and accepted a position as a Fellow at the University of Chicago Law School. Perhaps the most shocking revelation is how deep the Soviet Communist network has embedded itself into American political and educational culture. A quick review of Obama’s political “career” shows a track that was inexplicably greased, from his tuition payments at Columbia and Harvard, to a position at UOC Law School, to his eventual electoral “victories” at the Illinois State Senate, United States Senate, and U.S. Presidency. \\nBarack Obama’s parents ostensibly met in a Russian language class. This could have been where his mother was recruited by Barack Obama Sr, who could have already been working undercover for the KGB. In order to brainwash the child from an early age, they surrounded him with diehard Communists and fellow KGB agents, such as Frank Marshall Davis, a known Communist Party USA official. The Soviet KGB directly funded the CPUSA. This would fit directly into what the Russian Communist said about ‘Barack’, boasting “He has been raised to be an atheist and a communist.” \\n“He will be a blessing for world communism,” Fife recalled her saying, after getting over the initial shock of hearing the current president was a KGB agent. The creepy prediction stayed with the physicist upon his return to the United States, although he paid it no mind until he began to hear of a swiftly rising political star named Barack Obama. When Fife learned that this same Barack was running in the2008 presidential election, everything snapped into place and he knew he had to tell someone. Today, Fife admits that it deeply disturbs him and that he has never been able to shake the ominous feeling of foreboding about what comes next, now that the KGB official’s prediction has come true. \\n“It never leaves you, having someone tell you that they’ve engineered the takeover of your country,” he admits. “It’s really quite scary.” \\nSee also Dr. Eowyn’s May 24, 2010’s post on this, “ Obama, A Sleeper Agent For World Communism .” Rate this:'"}, "time": 1742561989.0581427}