{"duration": 0.3037841320037842, "input_args": {"text": "\"Animal Protein, Pregnancy, and Childhood Obesity VN:F [1.9.22_1171] Close Transcript Transcript: Animal Protein, Pregnancy, and Childhood Obesity \\nBelow is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video. \\nIf you expose pregnant crickets to a predatory wolf spider, her babies will hatch exhibiting increased antipredator behavior—and, as a consequence, improved survival from wolf spider attack. The mother cricket appears to be able to forewarn her babies about the threat when they were still inside her, so they would be pre-adapted to their external environment. \\nThis even happens in plants. If you grow two genetically identical plants—one in the sun, one in the shade—the sun-grown plant will produce seeds that grow better in the sun, and the shaded plant will grow seeds growing better in the shade, even though they’re genetically identical. So, what we’re dealing with is epigenetics—external factors changing gene expression. \\nVole pups born in the winter come out growing thicker coats. Vole mothers are able to communicate the season to their babies in utero, and tell them to put a coat on, even before they’re born. And people are no different. You know how some people have different temperature tolerances, resulting in battles of the bedroom—do you turn the AC on or off; open the windows? It’s not just genetics. Whether you’re born in the tropics or in a cold environment determines how many active sweat glands you have in your skin. \\nBut what does this have to do with diet? Can what a pregnant woman eats permanently alter the biology of their children in terms of what genes are turned on or off throughout life? Or, what they don’t eat? \\nWhat happened to the children born during the 1945 Dutch famine imposed by the Nazis? Higher rates of obesity fifty years later. The baby’s DNA gene expression, reprogrammed before birth to expect to be born into a world of famine, to conserve calories at all cost. But, when the war ended, this propensity to store fat became a disadvantage.   and don’t eat doesn’t just help determine the birth weight of the child, but the future adult weight of the child. \\nFor example, maternal protein intake during pregnancy may play a role in the obesity epidemic—but not just protein in general. Protein from animal sources, primarily meat products, consumed during pregnancy may increase the risk of their children growing up overweight. Originally, they thought it might be the IGF-1—a growth hormone boosted by animal product consumption—that may increase the production of fatty tissue. But weight gain was tied more to meat than dairy. \\nEvery daily portion of meat intake during the third trimester resulted in about an extra percent of body fat mass in their children by their sixteenth birthday, potentially increasing their risk of becoming obese later in life, independent of how many calories they ate, or how much they exercised. But no such link was found with cow’s milk intake, which would presumably boost IGF-1 levels just as high. \\nSo, maybe, instead it’s the obesogens in meat—chemicals that stimulate the growth of fatty tissue. Emerging evidence demonstrates that environmental factors can predispose exposed individuals to gain weight, irrespective of diet and exercise. After all, even our infants are fatter—you can’t blame that on diet and exercise. Animals too. And not just our pampered pets, even rats in labs and subways. The likelihood of 24 different animal populations from eight different species all showing a positive trend in weight over the past few decades by chance is less than one in a million. And so, it appears there’s something else going on—like obesogenic chemicals. \\nOne such candidate is polycyclic aromatic hydrocarbons—found in cigarettes, spewing out of exhaust pipes, and in grilled meat. This nationwide study of thousands found that the more children are exposed, the fatter they tended to be. They could measure the level of these chemicals right out of their urine. And, it can start in the womb. Prenatal exposure to these chemicals may cause increased fat mass gain during childhood, and a higher risk of childhood obesity. \\nIf these pollutants sound familiar, I’ve covered them before, in relation to increasing breast cancer risk in the Long Island Breast Cancer Study Project. So, maybe they’re not just obesogens, but carcinogens as well—perhaps explaining the 47% increase in breast cancer risk among older women in relation to a lifetime average of grilled and smoked foods. \\nIf you look at one of the most common of these toxins, smokers get about half from food, and half from cigarettes. But for nonsmokers, 99% comes from diet. The highest levels are found in meat, with pork apparently worse than beef. But, as you can see, even dark green leafies, like kale, can get contaminated by pollutants in the air. So, don’t forage your dandelion greens next to the highway, and make sure to wash your greens under running water. \\nNow, these are fat-soluble pollutants, so need lots of fat to be absorbed. So, even heavily contaminated plant-based sources may be safer, unless you pour lots of oil on your food—in which case the toxins would presumably become as readily absorbed as the toxins in meat. \\nThe good news is that they don’t build up in your body. If you expose people to barbecued chicken at time zero here, you can see they get a big spike in these chemicals, like up to a hundred-fold increase, but your body can get rid of it within about twenty hours. \\nThe problem, of course, is that people who eat these kinds of foods every day may constantly be exposing themselves—which may not only affect their health, and their children’s health, but maybe even their grandchildren’s health. \\nBeing pregnant during the Dutch famine didn’t just lead to an increase in diseases among their kids, but even, apparently, their grandkids. So, what a pregnant woman eats now may affect future generations. \\nThe issue of generation-spanning effects of poor conditions during pregnancy may help shed some light on the explosive epidemics of diabetes, obesity, and cardiovascular disease associated with this transition towards Western lifestyles. \\nPlease consider volunteering to help out on the site. women's health Doctor's Note \\nEpigenetics is the science of altering the expression of your genes. No matter your family history, some genes can be effectively turned on and off by the lifestyle choices you make. See, for example: \\nI previously touched on PAHs in Meat Fumes: Dietary Secondhand Smoke . \\nIf you haven’t yet, you can subscribe to my videos for free by clicking here . To post comments or questions into our discussion board, first log into Disqus with your NutritionFacts.org account or with one of the accepted social media logins. Click on Login to choose a login method. Click here for help. \\nWow! I’m speechless for once! This falls under the category of mind-blowing for me. NFmoderatorRenae \\nIt’s fascinating right?! HaltheVegan \\nFascinating stuff for sure. I’ve heard of epigenetics, but this takes it one step further. I’ll have to watch this video a few more times for all this to sink in :-) First question that arises: can the gene expression be changed somewhat after the child is born by what the child eats? This video implies they’re stuck with the gene expressions that are inherited at birth, depending on what the mother was exposed to. Joanne B, RD \\nHi HaltheVegan – some food for thought …. have you heard of the expression, “genes load the gun, the environment pulls the trigger” ? plant_this_thought \\nStrictly speaking, epigenetics concerns itself only with traits that are not inherited. It has to do with gene expression as influenced by environmental factors. The fetal environment influences genetic expression in the unborn baby, and whatever environment the newborn and growing child encounters will continue to affect, for better or worse, its genetic expression. :) baggman744 \\nNot inherited? plant_this_thought \\nbaggman744: Correct. Two individuals with identical DNA can exhibit very different traits depending on their environment. These differences are then said to be attributable to epigenetic factors, and in many cases they are reversible. It becomes more complicated when epigenetic factors result in a genetic mutation, an actual change in the DNA. Genetic changes have roughly 100,000 times the permanence of epigenetic ones. NFmoderatorRenae \\nI just wrote the same thing haha I love it! Wade Patton \\nThe sooner we all move away from the idea that genetics are a “LOCK” on anything, the sooner well have a better understanding of the interplay amoungst all the factors affecting expression. I read a good book on it just a few years back, but cannot recall the title at this moment. Blair Rollin \\nT. Colin Campbell talks a lot about this in “The China Study” and “Whole”. Mutated genes aren’t a problem if they don’t express themselves. Cancer cells aren’t a problem if they don’t proliferate. This is obviously true. But, my understanding of, what Campbell says is that what causes expression of mutated genes and what causes cancer cell proliferation is animal protein. Particularly bad is casein, dairy protein (we have learned also on NF how dangerous dairy is in other ways). He says that a very small percentage of cancers are genetic. (Just a couple of percent as I remember?) NFmoderatorRenae \\nThe best explanation I have heard is from Dr Neal Barnard- ‘Genetics load the gun, but diet/environmental/lifestyle pull the trigger’. So genes may give you predispositions, but in most cases (particularly with chronic diseases) YOU still have the CHOICE as to what the outcome is :) HaltheVegan \\nThank you for the explanation. That is the understanding I had before I watched this video. I remember the Dean Ornish study where cancer genes were “turned off” with a plant based diet. So I still agree with the interpretation that genes can expressed or not expressed due to diet (ie. internal environment). But what threw me off in this video is the statement: ” even our infants are fatter—you can’t blame that on diet and exercise.” This statement seems to be saying that the infants were fatter regardless of what they ate or how much exercise they got. Similarly with the sweat gland example in the video. If one is born in a cold environment, then the person will have fewer active sweat glands. Do the inactive sweat glands become active when one moves to a warm climate? How long would it take? Or will the person always feel hotter because he/she has fewer active sweat glands. These are simply rhetorical questions. Seems to me this is a very fertile area for continued research! Alexandre \\nOk but werent they during the famine eating less of animal protein? Im confused Tom Goff \\nThey were eating fewer calories overall so yes they were consuming less animal protein. \\nIt is important to remember that most things don’t usually have just a single cause. Starvation in parents.may predispose offspring to obesity. Chronic exposure to polycyclic aromatic hydrocarbons by parents may also predispose offspring to obesity. Alexandre \\nI understand that.. but its still confusing.. so the best way to make sure your kids wont be obese is to be obese yourself so their body wont feel the need to store as much energy? confusing Tom Goff \\nNo. It does not follow that parents must be obese so that their children are not. \\nIn fact there is some evidence from animal studies that, if you do not want your children to be obese, you must not eat a high fat diet. \\nThe best thing that you can do is maintain a healthy weight, eat a healthy diet and follow a healthy lifestyle. And teach your kids to do the same. plant_this_thought Lori Tompkins \\nI’m 99% vegan and I’ve recently read about the woes of Lectins, which my vegan diet is high in. I don’t see Lectins discussed on this site and would really like Dr. Greger’s take on this subject. A low lectin diet seems to be more meat oriented. Thea \\nLori Tompkins: I found one blog post on NutritionFacts which talks about lectins. Here is a quote: \\n“Modern paleo advocates claim that these foods weren’t part of Paleolithic-era diets, but new research challenges that assumption.5 They also argue that lectins naturally present in these starchy foods are harmful to human health. Consuming too many lectins can cause significant gastrointestinal distress. However, because legumes and grains are almost always consumed in a cooked form—and lectins are destroyed during cooking—eating beans and grains doesn’t result in lectin overload. Sprouting also reduces lectin levels in plants, although not as effectively as cooking. Generally, pea sprouts, lentil sprouts, and mung bean sprouts are safe to consume, as are sprouted grains, which are naturally low in lectins. Most larger legumes contain higher amounts and should be cooked. ” from: http://nutritionfacts.org/2014/09/23/will-the-real-paleo-diet-please-stand-up/ \\nSince I eat my grains and legumes cooked, I consider the lectin brouhaha to be much ado about nothing. Todd \\n@disqus_EXJURIXKLQ:disqus I don’t think it’s quite true that lectins are destroyed during cooking, but they are significantly reduced, and the more thoroughly they are cooked the more the lectins are reduced. But many lectins are fairly heat resistant, so it’s not an all-or-nothing situation. I’ve noticed that occasionally when I cook black beans in the Instant Pot, I get some transient gastric distress, probably because they weren’t quite well done enough. \\nThere is one thing, however, that consistently causes me to have gastric distress: ground flax seed. I know it’s an important source of omega-3, but when I put it in food I invariably experience a stomach ache for ten or fifteen minutes. I’m pretty sure it’s the lectin content. \\nI think there’s still a lot we don’t understand about how lectins affect the body. We tend to assume that they are “bad,” since they are part of the plant’s self-defense against being eaten. But we used to say the same about phytates, which we now know to have positive aspects as well for health. Thea \\nTodd: I don’t have any references one way or another to say whether or how much cooking destroys lectins. Brenda Davis and Vesanto Melina are usually pretty careful with their words on these topics, but maybe they got lazy in that sentence and only some lectins are destroyed. Either way, I’m not aware of a body of evidence that says the general human population needs to worry about the lectin content of our cooked beans, intact grains, or raw nuts and seeds. \\nOf course, if you are getting a reaction from eating a certain food, say ground flaxseed, you need to consider that situation regardless of what is in the flaxseed that is causing it. I wonder if you ate your flaxseed in something cooked (like a muffin?) if that would help your tummy issue??? I have no idea if that’s a good suggestion or not. Just trying to be helpful. Vege-tater \\nMind blown here too, the poor grandkids! Pretty disconcerting also how many potent chemicals are now ubiquitous and the myriad of effects…and we are supposed to be the brainy species? NFmoderatorRenae \\nScary isn’t it?! Heidi \\nInteresting. However, this does not account for the fact that Americans have been eating animal protein going back to the 1800s. However, the obesity epidemic has only started in the 1980s. People were consuming a lot of animal protein in the 1950s and 60s, but very very few Americans were obese. You can tell by looking at the photos of that time as well. However, the difference came with the addition of sugars and high fructose corn syrup as well as a high intake of fatty carb rich foods like fries and chips. Fructose is leading contender. We can see the rise in obesity related to the rise in sugar consumption world wide. Hunter gatherer societies that consume animal protein but do not consume processed sugars do not gain weight and are no obese. However when those people are introduced to processed foods with sugars added they immediately gain weight and become obese. When looking at the overall picture, fatty meats, fried chicken and fish for sure would be a factor, but the sugars issue shows a much closer connection to the problem. linda \\nhello Heidi, I thought you might be interested in this usda brochure that tables the increase in meat since the 1950s as 57 lbs per person per annum to the year 2000. A huge rise in cheese consumption fro 7.7lbs to close to 30 lbs ! per year for the same time period. http://r.duckduckgo.com/l/?kh=-1&uddg=http%3A%2F%2Fwww.usda.gov%2Ffactbook%2Fchapter2.pdf Foroogh – NF Moderator \\nThis video by Dr. G. is very educational about Polycyclic Aromatic Hydrocarbons and childhood obesity. Also Heidi you make a good point about sugar and sugar industry in contribution towards obesity in the 1980’s era to which I also like to add salt, processed food, meat, dairy, egg industries have great part to play in confusing general public about nutrition. Big Salt – Getting to the Meat of the Matterhttp://nutritionfacts.org/video/big-salt-getting-to-the-meat-of-the-matter/ NFmoderatorRenae \\nIf you look at Agricultural data, the amount of animal products consumed has increased greatly since the 1800s. John \\nThe size of the animals is larger, they aren’t running around on pasture, they are creating an environmental mess, and it is cheaper to eat this kind of meat. John S Tom Goff \\nThis is just keto and paleo ideology. There is no solid science to support it apart from some spurious observational correlations, misrepresented studies and industrial-strength speculation. People may have been consuming a lot of animal protein in the 1950s and 1960s but cardiovascular disease death rates were very high then. There was less obesity simply because people consumed fewer total calories then than in later decades..\""}, "time": 1742564134.9098785}