{"duration": 0.0765533447265625, "input_args": {"text": "'Chamber music might not seem like an obvious candidate to be “chopped and screwed”: remixed and slowed down in the style pioneered by DJ Screw when he transformed Houston’s   scene a generation ago. But that unlikely inspiration helped give the film “Moonlight,” whose score is nominated for an Academy Award, its otherworldly sound. The unusual idea emerged when the film’s director, Barry Jenkins, was batting around musical possibilities with its composer, Nicholas Britell, and Mr. Jenkins mentioned his love of chopped and screwed tracks. (The style can give songs a woozy, psychedelic flavor.) “When you slow the music down, the pitch goes down,” Mr. Britell, 36, said in an interview in his Manhattan studio. “And you actually get this audio texture which is deepened and enriched and you hear more things in it. It sort of opens it up and stretches it out. ” Here is how Mr. Britell chopped and screwed instrumental music and wove it into a film whose three chapters take its hero, Chiron, from boyhood (when the character is nicknamed Little) to manhood (when he’s known as Black). When he first read the screenplay, Mr. Britell said, “it felt like a piece of poetry. ” Mr. Jenkins knew that he wanted an orchestral score. So Mr. Britell wrote a simple, somber, plangent piece that he initially called “Piano and Violin Poem,” which he recorded in D major. It became “Little’s Theme. ” For the teenage Chiron, Mr. Britell bent the pitch of “Little’s Theme” until it was in B major. Then, for a harrowing scene involving a schoolyard fight, he slowed the music drastically, until it was almost unrecognizable  —   more than two octaves lower than the original recording. “We were trying, in the music, to have there be a correspondence between the   nature of Chiron’s world at that point and what’s happening musically without being too overt about it,” Mr. Britell said. “In that scene you’re hearing this rumbling. You almost don’t know what it is. And then you hear something that almost sounds like a bell, and almost sounds like a bass  —   and in fact it’s the piano and the violins from the very beginning. ” For the theme music for Chiron’s adulthood, Mr. Britell reorchestrated “Little’s Theme” for an ensemble of cellos and had them record it in D major  —   but then bent the pitch until it was in A major. “I chopped and screwed the recording,” he said. “Cellos don’t play those notes. It sounds like a weird cross between basses and cellos. ” Many members of the audience may not notice that some of the more fantastic effects in the score are its main themes contorted beyond recognition. But the filmmakers do wink at the audience when they include a more traditional kind of chopped and screwed track: the   mix of Jidenna’s “Classic Man” that plays in the background in this scene. The popularity of the soundtrack led to a performance last month in Los Angeles, when the Wordless Music Orchestra performed the score live as the film was screened another outing is planned at the Barbican Center in London on March 18. But mimicking the effects of chopped and screwed with live orchestra took some serious reverse engineering. “If it’s a violin that sounds like a bass, I’ll have a bass play it,” Mr. Britell said.'"}, "time": 1742562233.017362}