{"duration": 0.11106467247009277, "input_args": {"text": "'SAN FRANCISCO  —   No matter which political party you belong to, one thing is clear: Donald J. Trump’s presidency has galvanized political activism to a level of passion not seen since the civil rights movement. Far less clear is what you can do in reaction to the Trump administration’s changes. And in an era that promises instant gratification  —   like cars, couriers and food summoned to your driveway with the tap of a smartphone app  —   you might think tech is a quick and easy solution to becoming a political activist. But it turns out software and web tools can go only so far. “Sitting behind your computer is not going to be as effective as showing up for people where they really need it,” said Joshua Tauberer, the creator of GovTrack, a popular web tool for tracking legislation. “Government is people. ” At best, tech is an excellent resource for staying on top of political activities. But at some point, you will have to go outside or pick up the phone and engage with people, like fellow citizens and members of Congress. That’s not to say tech is powerless. Opponents of Mr. Trump’s immigration ban, for example, used Twitter and Facebook to rally thousands of people for protests at the nation’s airports last month. Similarly, protesters used social media platforms to help coordinate the Jan. 21 women’s marches, which by one account constituted the largest day of demonstrations in American history. But what else can you do besides following news and events on Twitter and Facebook? What follows is a guide to some of the most useful resources and tools I uncovered after interviews with   activists. The first challenge to getting more politically active is filtering out the torrent of political news to understand what you should care about. One   approach is to read the executive orders posted on the White House website. Beyond that, following your members of Congress is an important way to get deeper information, says Indivisible, an activism guide published by former congressional staff members. These are the people who introduce legislation, so keeping up with them is crucial if you want to be more politically active. After identifying your members of Congress, visit their websites and sign up to receive their newsletters and invitations to local events. You can create Google News alerts on certain lawmakers to keep up with their actions. Another approach is following the legislation you care about. Mr. Tauberer’s tool, GovTrack. us, lets you share your location, select an issue and view the bills that have been introduced. For example, Senator Dianne Feinstein of California introduced a bill to nullify the effect of the executive order on immigration. The site says there is a 7 percent chance of the bill being enacted. You could then contact Ms. Feinstein’s office to say you support or oppose her bill. After becoming educated, the next step is to engage by contacting lawmakers and letting them know what you think. Political activism is surprisingly  : Phone calls carry more weight than an email or a tweet, partly because a phone ringing incessantly is harder to ignore than a flooded inbox. Less obvious is how to do all that. You have to find your local representative and then figure out what to say. Mr. Tauberer recently published a new web tool, phonecongress. com. The site detects your location to identify your local representatives, and then lists contact information and instructions on what to say about various issues to each lawmaker. For example, if you live in Dallas and disagree with President Trump’s nominations, the site instructs you to call Senator John Cornyn and say, “Hi, I’m a resident of Dallas and I would like Senator Cornyn to vote against President Trump’s nominations for his cabinet. ” You will only get so far working alone. At some point, joining a group will help you coordinate broader actions like protests or coordinated phone calls. Where to find one? That will depend on your political beliefs: You will have to ask around or search social networks like Meetup. com, a site to find local events and people who share your interests. For example, on Meetup. com, you can click “Join a movement. ” From there, the site uses your location to find nearby activism groups. For San Francisco, the site pulled up organizations like #TheResistance, a group of Trump protesters with about 1, 700 members, and Tech Workers Coalition, a group of 130 technology workers who are activists. Some unique forms of activism can emerge from working with a team. Lea Yu, an organizer for Tech Workers Coalition, said she met fellow activists at a contest in December in which people were asked to make tech tools for political activism. In reaction to concerns about hate speech and fake news, Ms. Yu’s team whipped up AdStrike, a web tool that scans for advertisements appearing on Breitbart News, the   opinion and news website. The tool identifies the companies hosting ads on the site, takes a screenshot of the ad and composes a tweet that users can automatically post on their accounts, encouraging the business to stop advertising on Breitbart. “A single, lonesome tweet doesn’t get a consumer very far if they want a company to take a stand,” Ms. Yu said. “But when hundreds of tweets are coordinated, you see companies like Visa and Uber becoming very responsive. ”'"}, "time": 1742562992.5328074}