{"duration": 0.10788798332214355, "input_args": {"text": "'A newly released video from Center for Medical Progress (CMP) shows the Planned Parenthood executive who became known for her comment, “I want a Lamborghini,” as payment for fetal tissue, haggling over the price of aborted baby body parts.[  The video depicts the first meeting between CMP journalists posing as biomedical company buyers of fetal tissue and Dr. Mary Gatter, the president of Planned Parenthood for America’s (PPFA) Medical Directors’ Council. Gatter is introduced to the buyers by Dr. Deborah Nucatola, PPFA’s Senior Director of Medical Services, who also appeared in a CMP undercover video eating lunch and drinking wine, as she allegedly discussed how to harvest fetal organs and body parts so as to maximize their transfer to biomedical researchers. In the current video, Gatter is introduced as the Medical Director of Planned Parenthood’s Pasadena, California, affiliate, and haggles with the undercover journalists over the price “per specimen” of fetal body parts. The undercover CMP journalist also discusses how the biomedical buyer will come into the Planned Parenthood clinic to handle the transfer of the fetal specimen. “We may have to make sure that your staff who are on site are credentialed, privileges, whatever, background checks and all that stuff,” Gatter says on the video, adding: “You know, you have to pay a little money for the use of the space. ” They then discuss the issue of “compensation,” with the undercover journalists suggesting “per specimen” payment and Gatter asking, “Per specimen? Like $75 a specimen?” When the journalist says, “What we’ve been quoting is $50 per specimen,” Gatter counters that “$50 is on the low end. $50 was like 12 years ago. ” The undercover journalist explains that they like to pay “per specimen” because “that way we’re not paying for material we can’t use. ” “But you would show up to do this?” Gatter asks. “You would send somebody?” The undercover journalist agrees, “Oh exactly, we would send a tech. Yeah, we would send a tech in. ” After mentioning a “lovely tech” named Heather from the biomedical firm Novogenix who worked at the Planned Parenthood Los Angeles clinic, Gatter eventually ends the conversation by saying, “Yeah, I’d be willing  —   give me a call. ” Earlier in the video, Gatter asks, “What kind of volume do you need, and what gestational ages?” The undercover journalist answers that “most of the requests are 16 weeks and above. ” Federal law permits reimbursement for specified costs in a fetal organ or tissue donation, but prohibits the purchase and sale of the organs and tissues themselves (42 U. S. C.  ). “The fact that [biomedical companies] Novogenix, StemExpress, and Advanced Bioscience Resources (ABR) stationed their own workers inside Planned Parenthood abortion clinics to perform the harvesting, packaging, and transport of aborted baby body parts demonstrates that Planned Parenthood had no reimbursable costs under the law,” says CMP project lead David Daleiden. “The   sums that Planned Parenthood charged these businesses for baby parts are criminal trafficking and profiteering in fetal body parts. ” Gatter was previously the medical director of Planned Parenthood Los Angeles, before taking the same position at the chain’s Pasadena affiliate. Later, she was elected president of PPFA’s Medical Directors’ Council. While still at her post in the Los Angeles affiliate, Gatter oversaw its partnership with Novogenix Laboratories, LLC, a local   fetal organ and tissue harvesting company. “I did it in LA, I’m committed to it, I think it’s a great idea,” says Gatter to the undercover journalists posing as the buyers. The final report of the House Select Panel on Infant Lives addresses the pricing of fetal tissue: On April 20, 2016, the Panel held a hearing on The Pricing of Fetal Tissue. During the hearing, the Panel examined documents revealing that abortion clinics and Tissue Procurement Businesses (TPBs) may have violated federal law by the payments they collected from the sale of fetal tissue. At the core of the Panel’s investigation is a federal statute, 42 U. S. C. §   which prohibits the transfer of any human fetal tissue for valuable consideration. The statute states that reasonable costs include transportation, implantation, processing, preservation, quality control, and storage —  none of which it appears the abortion clinics did. Documents also show that payments made by the customer to the procurement business appear to exceed the costs incurred on the procurement business by a factor of 300 to 400 percent. As CMP notes, contracts and invoices show that biomedical companies Novogenix, StemExpress, and ABR “all made monthly payments to Planned Parenthood based on the number of resalable fetal specimens the wholesalers’ workers could harvest inside the abortion clinics. ” “Planned Parenthood told Congressional investigators it kept no contemporaneous records of actual costs for reimbursement under the law,” adds CMP, continuing: The Novogenix contract promises Planned Parenthood Los Angeles $45 “per donated specimen. ” Planned Parenthood Los Angeles does over 15, 000 abortions every year, but has never publicly admitted how much money they received total under their contract with Novogenix. In December 2016, the Senate Judiciary Committee and the House Select Investigative Panel both referred Planned Parenthood Los Angeles and Novogenix to the FBI and U. S. Department of Justice for further investigation and criminal prosecution. “The U. S. Department of Justice should take heed of the congressional investigations’ criminal referrals and prosecute Planned Parenthood to the full extent of the law,” urges Daleiden, “and taxpayers must stop being forced to subsidize Planned Parenthood’s criminal abortion empire. ”'"}, "time": 1742562901.2606878}