{"duration": 0.056285858154296875, "input_args": {"text": "'CANBERRA, Australia (AP)  —   The Australian government said Thursday it had found no evidence that any of its donations to the Christian charity World Vision had been siphoned to Islamic militant group Hamas. [But Australia’s Department of Foreign Affairs and Trade said its World Vision funding in Gaza would remain suspended while Israeli charges against the global aid agency’s Gaza manager Mohammed   remain unresolved.  “DFAT has reviewed the management of its funding to World Vision in the Palestinian Territories. The review uncovered nothing to suggest any diversion of government funds. ” the department said in a statement. “Australia’s funding to World Vision in the Palestinian Territories remains suspended until we have considered the outcomes of the court case against Mr.   and reviews being undertaken by World Vision Australia and World Vision International into this issue,” it added. Australian is the biggest single donor to World Vision’s humanitarian work in Gaza, providing more than $2 million in the past three years. Australia and Germany suspended funding in August after Israeli authorities charged   with diverting around $50 million to Hamas to help build tunnels and purchase weapons. Israel’s internal security service Shin Bet alleged   created fictitious humanitarian projects to get the funds to Hamas. The Shin Bet alleged he underwent Hamas training in the early 2000s and was “planted” by the group at World Vision in 2005, where he climbed the ranks to become director of the Gaza branch.   has pleaded not guilty to all charges. Israel’s Justice Ministry declined to comment on  ’s case because his trial was ongoing. World Vision welcomed Australia’s findings, adding that its own ongoing audit had not yet raised concerns about how money was spent. World Vision’s work in Gaza has been suspended pending the outcome of that audit. “We remain deeply concerned with this situation, and are saddened by the impact on Gaza’s children and their families,” a World Vision statement said.'"}, "time": 1742561945.66276}