{"duration": 0.06269192695617676, "input_args": {"text": "'advertisement - learn more It’s been more than one hundred years since Max Planck, the theoretical physicist who originated quantum theory, which won him the Nobel Prize in Physics, said that he regards “consciousness as fundamental,” that he regards “matter as a derivative from consciousness,” and that “everything we talk about, everything that we regard as existing, postulates consciousness.” He is basically saying that the immaterial ‘substance’ of consciousness is directly intertwined with what we perceive to be our physical material world in some sort of way, shape or form, that consciousness is required for matter to be, that it becomes after consciousness….and he’s not the only physicist to believe that. “It was not possible to formulate the laws of quantum mechanics in a fully consistent way without reference to consciousness.”– Eugene Wigner, theoretical physicist and mathematician. He received a share of the Nobel Prize in Physics in 1963 Scientists have been urging the mainstream scientific community, which today is littered with scientific fraud and industry influence as well as invention secrecy , to open up to a broader view regarding the true nature of our reality. “The day science begins to study non-physical phenomena, it will make more progress in one decade that in all of the previous centuries of its existence.”– Nikola Tesla advertisement - learn more Not long ago, a group of internationally recognized scientists came together to stress this fact and how it’s overlooked by the mainstream scientific community. It’s ‘post-material” science, an area of study dealing with the ‘non-physical realm, and it’s challenging the modern scientific worldview of materialism that’s dominated mainstream science. The idea that matter is not the reality is finally starting to gain some merrit. The summary of this report presented at the International Summit On Post-Materialist Science can be found HERE . “The modern scientific worldview is predominantly predicated on assumptions that are closely associated with classical physics. Materialism—the idea that matter is the only reality—is one of these assumptions. A related assumption is reductionism, the notion that complex things can be understood by reducing them to the interactions of their parts, or to simpler or more fundamental things such as tiny material particles.”– Manifesto for a Post-Materialist Science MIT’s Max Tegmark,a theoretical physicist at the Massachusetts Institute of Technology in Cambridge, is one of the latest to attempt explaining why he believes consciousness is a state of matter. He believes that consciousness arises out of a certain set of mathematical conditions, and that there are varying degrees of consciousness – just as certain conditions are required to create varying states of vapor, water, and ice. As PBS emphasized, “understanding how consciousness functions as a separate state of matter could help us come to a more thorough understanding of why we perceive the world the way we do.” ( source ) Tegmark describes this as “perceptronium,” which he defines as the most general substance that feels subjectively self-aware and this substance should not only be able to store information, but do it in a way that form a unified, indivisible, whole. “The problem is why we perceive the universe as the semi-classical, three dimensional world that is so familiar. When we look at a glass of iced water, we perceive the liquid and the solid ice cubes as independent things even though they are intimately linked as part of the same system. How does this happen? Out of all possible outcomes, we do we perceive this solution?”– Tegmark ( source ) This new way of thinking about consciousness has been spreading throughout the physics community at an exponential rate within the past few years. Considering consciousness as an actual state of matter would be huge, considering the fact that modern day definitions of matter require a substance to have mass, which consciousness does not have. What it does have, however, is some sort of effect on our physical material world, and the extent of this effect and how far it goes is the next step for science. \\nThe quantum double slit experiment is a very popular experiment used to examine how consciousness and our physical material world are intertwined. It is a great example that documents how factors associated with consciousness and our physical material world are connected in some way. \\nOne potential revelation of this experience is that “the observer creates the reality.” A paper published in the peer-reviewed journal Physics Essays by Dean Radin, PhD, explains how this experiment has been used multiple times to explore the role of consciousness in shaping the nature of physical reality. \\nThe study found that factors associated with consciousness “ significantly” correlated in predicted ways with perturbations in the double slit interference pattern. ( source ) “Observation not only disturbs what has to be measured, they produce it. We compel the electron to assume a definite position. We ourselves produce the results of the measurement.” (source) For a physicist to brush off the fact that understanding consciousness is necessary for the advancement and understanding of the nature of our reality is not as common as it used to be but, despite the empirical success of quantum theory, even the suggesting that it could be true as a description of our reality is greeted with harsh cynicism, incomprehension and even anger. \\nR.C. Henry, Professor of Physics and Astronomy at Johns Hopkins University wrote in a 2005 publication for the journal Nature: \\nAccording to [pioneering physicist] Sir James Jeans: “the stream of knowledge is heading towards a non-mechanical reality; the Universe begins to look more like a great thought than like a great machine. Mind no longer appears to be an accidental intruder into the realm of matter… we ought rather hail it as the creator and governor of the realm of matter.” . . . The Universe is immaterial — mental and spiritual. Live, and enjoy. \\n(“The Mental Universe”; Nature 436:29,2005) (source) Thanks for reading.'"}, "time": 1742628431.3569143}