{"duration": 0.18753528594970703, "input_args": {"text": "'Email \\nAt the branch office of the Pentagon’s US-NATO military alliance in Brussels there is a never-ending whirl of activity and apart from provoking Russia by announcing an aggressive military surge around its borders, its latest achievement was to have Belgium issue “a commemorative stamp depicting the new NATO Headquarters and its distinctive architecture.” \\nOn October 22 a ceremony was held to mark the new stamp, but no details were given about the price of the vast palace which will “ enable all Allies to have the space they require and [in which] there is also space for expansion should the need arise.” There is never any mention by US-NATO of the staggering cost overrun that took place, but two years ago Germany’s Der Spiegel revealed that it was more than double the original construction budget, at over a billion euros. \\nTen days before the stamp ceremony, Secretary General Jens Stoltenberg left the Brussels Palace to visit a more modest one in Italy where he met Pope Francis. After his call, some observers were unkind enough to express surprise that Mr Stoltenberg could spare the time for such an appointment, but all was made clear when it was announced that the meeting took place in the sidelines of his visit to Rome to celebrate the establishment anniversary of the NATO Defense College, an institution that has contributed generously to the Italian economy. \\nHis Holiness the Pope did not of course make a public statement about the meeting, but the NATO publicity machine (the large and remarkably expensive organization that also arranges stamp issue ceremonies) made up for the omission by announcing that he and his illustrious visitor \\ndiscussed global issues of common concern, including the conflicts in Syria and the wider Middle East, the importance of protecting civilian populations from suffering, and the importance of dialogue in international affairs to reduce tensions. The Secretary General also stressed that climate change could pose a significant security risk. \\nIt is remarkable that His Holiness engaged in such deliberations with the titular head of an enormous nuclear-armed military alliance, and it would be interesting to know if the Pope mentioned that he did not always agree with the policies espoused by Mr Stoltenberg and his directors in Washington, as he averred earlier this year. \\nIt will be recollected that in February 2016 Patriarch Kirill of the Russian Orthodox Church met with Pope Francis in Havana and that Western media headlines included “Pope Francis Handed Putin a Diplomatic Victory” which was as absurd as it was trivial. But even The Economist headline was similarly slanted and amusingly asked “Did the Pope Just Kiss Putin’s Ring?” This set the tone for other comment, but one thrust of its reporting was especially revealing, as it pointed out in shocked — shocked — tones that the Pope had “made clear in his interview before the meeting that on certain issues he agrees with Mr Putin and disagrees with America and its allies.” \\nHow truly dreadful that the Pope dares to be impartial and ventures to disagree with America and its allies about international affairs. \\nThe Economist further noted that “On Libya, where Western powers helped to bring down former dictator Muammar Qaddafi, the pope was explicit: ‘The West ought to be self-critical.’ And he continued that ‘In part, there has been a convergence of analysis between the Holy See and Russia’.” The Economist did not mention the unpalatable fact that the ‘western powers’ — the US-NATO military alliance — bombed and rocketed Libya to a catastrophic shambles, resulting in anarchy and a base for Islamic terrorists. Perhaps the Pope had taken note of that merciless Blitz, and of the fact that under the dictator Gaddafi the Catholic community in Libya had lived peacefully while now it is suffering gravely. \\nAs recorded by Christian Freedom International , “The upsurge in attacks on Christians in Libya since the Obama/Clinton supported ouster of Gaddafi is of grave concern. CFI condemns these abductions, killings and attacks on Christian property in what is becoming an increasingly inhospitable region for Christians.” Perhaps Pope Francis raised this with the devout Mr Stoltenberg, a graduate of Oslo Cathedral School who was prime minister of Norway when its air force “ carried out about 10 percent of the NATO airstrikes in Libya” from March to July 2011. \\nThe news that the Pope has had the temerity and moral realism to “disagree with America and its allies” is not altogether surprising, but the report that “on certain issues he agrees with Mr Putin” must have shaken Mr Stoltenberg, whose fundamental stance is that “Russia is trying to kind of re-establish spheres of influence along its borders and for me this just underlines the importance of strong NATO, of strong partnership with other countries in Europe that are not members of NATO.” \\nMr Stoltenberg believes that because Russia wants to establish — or, more accurately, maintain — spheres of influence along its borders then it must be discouraged or even stopped from doing so. This is confrontational, and it is unsurprising that His Holiness has made it clear that the Vatican is not an unconditional supporter of Washington’s Pentagon and its palatial sub-office in Brussels. \\nMr Stoltenberg may not have read the address to the US Congress by His Holiness in 2015, when he said ‘We need to avoid a common temptation nowadays: to discard whatever proves troublesome. Let us remember the golden rule: ‘Do unto others as you would have them do unto you’.’ As reported , ‘The line drew instant, thunderous applause from Democrats, followed with some hesitation by Republicans, a pattern repeated throughout the address.’ \\nIn his talk to Congress Pope Francis eschewed the Stoltenberg line that Russia’s desire to maintain peaceful ‘spheres of influence’ around its borders must by definition be wrong and unacceptableand pointed out that ‘there is another temptation which we must especially guard against : the simplistic reductionism which sees only good or evil; or, if you will, the righteous and sinners.’ \\nAs President Putin observed in an interview with Italy’s Corriere della Sera “we are not expanding anywhere; it is NATO infrastructure, including military infrastructure, that is moving towards our borders. Is this a manifestation of our aggression?” No, it is not — except in the eyes of such as the Pentagon and Mr Stoltenberg. \\nStoltenberg makes many visits round the world, including head-of-state-style attendance at the UN General Assembly in New York, where he had discussions with, among others, Ukraine’s President Poroshenko ( “Dear Petro, it’s great to see you again” ) and Secretary General Ban Ki-moon; and another recent stopover was in the United Arab Emirates on October 19. There, while committing NATO to an Individual Partnership and Cooperation Program he “ praised the UAE for its role as a valuable NATO partner in projecting international security and stability: from Kosovo, to Afghanistan to Libya.” \\nPerhaps Mr Stoltenberg’s meeting with the Pope affected his short-term memory. He ignores the unpalatable facts that in Kosovo, as Freedom House reports , there has been “little progress in strengthening its statehood,” while Afghanistan verges on total anarchy and, as noted above, US-NATO’s war on Libya destroyed the country. These are far from being examples of “security and stability” as Mr Stoltenberg would have us believe them to be, but self-delusion knows no borders. \\nWhen Stoltenberg was made head of NATO, President Putin considered him to be a “serious, responsible person” but warned with prescience that “we’ll see how our relations develop with him in his new position.” Unfortunately that apprehension concerning future developments has been more than justified. During a trip to Washington in April, Stoltenberg told the Washington Post correspondent Karen de Young, that “NATO has to remain an expeditionary alliance, able to deploy forces outside our territory,” which is a plain unvarnished statement of expansionism. The Pope summed it up when he quoted the Bible’s advice to ‘do unto others as you would have them do unto you,’ but it is unlikely that Mr Stoltenberg could ever bring himself to abide by such wise advice. More confrontation lies ahead.'"}, "time": 1742564146.1051087}