{"duration": 0.09792351722717285, "input_args": {"text": "'Carrie Fisher was the child of a   family. “The daughter of famous parents,” she wrote in her memoir “Wishful Drinking,” which originated as a   show. “One an icon, the other a consort to icons. ” She entered popular culture as a princess in peril and endures as something much more complicated and interesting. Many things, really: a rebel commander a witty internal critic of the celebrity machine a teller of comic tales, true and embellished an inspiring and cautionary avatar of excess and resilience an emblem of the honesty we crave (and so rarely receive) from beloved purveyors of  . When I heard the news of Ms. Fisher’s death on Tuesday, what immediately popped into my mind was not “Star Wars” but “Rosemary’s Baby”  —   that unforgettable episode from Season 2 of “30 Rock,” in which she turns up as a legendary and colossally difficult television writer, Rosemary Howard. [ Read Carrie Fisher’’s obituary ] Liz Lemon, the   television writer played (and created) by Tina Fey, idolizes Rosemary, seeing her as a pioneer and a spiritual mother. But even symbolic   relationships have a way of turning dysfunctional, and Liz comes to see Rosemary less as a beacon than a warning  —   an image of the cynical, resentful,   dingbat Liz herself might well become. Emily Nussbaum, the New Yorker’s television critic, remarked on Twitter that the episode was “the     of female comedy,” which may actually be an understatement. The character of Rosemary Howard certainly embodies the glories and contradictions of   feminism, and Liz’s ambivalence about her is a barbed and brilliant illustration of the anxieties of female comic influence. But the casting of Ms. Fisher  —   whose performance on the show is somehow at once wildly winking and completely    —   adds about 12 dimensions of meta. Anyone watching that episode will already know that Liz Lemon is a rabid “Star Wars” fan. Her default Halloween costume is Princess Leia Organa. Later, when she wants to get out of jury duty, Liz will coil her hair over her ears and dress in a belted linen djellaba, confident that no judge would ever impanel such a cosplaying nerd. She’s wrong about that, and also wrong to sell out her Leia devotion, treating it as a source of embarrassment rather than power and pride. The princess allows Liz  —   and not only Liz  —   to be both geek and warrior, sex symbol and samurai, free spirit and prisoner of the corporate Death Star. Liz Lemon has two mothers, both played by Carrie Fisher. That statement can stand as a fictional index of Ms. Fisher’s extensive   influence. Princess Leia  —   now General Organa of the Rebel Alliance  —   will always define her as an actress, something she claimed, in a recent Rolling Stone interview, not to mind. “I like Princess Leia,” she said. “I like how she was feisty. I like how she killed Jabba the Hutt. ” That feistiness has been Leia’s principal legacy, the early sign of a shift in the understanding of female heroism  —   and the meanings of the word princess  —   that has rippled through popular culture in the past 40 years. Leia is a foremother of Hermione Granger and Katniss Everdeen and of countless   Disney princesses. She also foretold the recent, somewhat belated feminist turn in the “Star Wars” cycle itself. All of a sudden, and at long last, Leia is not the only   heroine in the galaxy, having been joined by Rey in “The Force Awakens” and Jyn in “Rogue One. ” Ms. Fisher’s legacy may rest at least as much on her literary voice, on the alter egos she created on the page, as on any character she played onscreen. She was hardly the first or the only Hollywood figure to spill the beans about sex, drugs and other   shenanigans. Nor was she unique among writers in the way she mined her own painful history of addiction and mental illness for harrowing and humorous copy. But “Postcards From the Edge,” her 1987 roman à clef about a movie star named Suzanne Vale with a cocaine problem and a difficult   mom, bristles with a bravery and candor that still feels groundbreaking. She went there, long before that was a catchphrase, and before that particular there was such a crowded piece of real estate. In her Rolling Stone interview and elsewhere, Ms. Fisher liked to cite Dorothy Parker as an inspiration. She carried that tradition forward, and the frank, funny, confessionally inclined and   women who now flourish on television and in print  —   the list is too long they know who they are  —   are in her debt. “You’re my kid!” Rosemary Howard cries out to Liz Lemon. An echo of the famous assertion of paternity in the “Star Wars” saga. And also an acknowledgment of Carrie Fisher’s own undeniable status as a matriarch.'"}, "time": 1742628293.841309}