{"duration": 0.03340315818786621, "input_args": {"text": "'Eight members of one family were found shot to death in rural Ohio on Friday, including a mother killed while sleeping in the same room as her newborn baby, and the killer or killers were thought to be at large, law enforcement officials said. The bodies of seven members of the Rhoden family were found before 8 a. m. in three houses near each other in southwestern Pike County, the county sheriff, Charles Reader, said. Three children  —   ages 4 days, 6 months and 3 years  —   were found in the houses unharmed, the sheriff said. A few hours later, another family member was found dead in another house a few miles away. Officials said at a   news conference that they could not rule out the possibility that other members of the family might be in danger, and that officers were checking on them throughout the region. “We are advising the family members to be very careful, and take particular precaution,” the Ohio attorney general, Mike DeWine, said. “The individual or individuals who committed this crime obviously are dangerous,” Mr. DeWine said. “We believe they are still at large. ” County officials said some members of the extended family had gathered and were receiving counseling and protection. The dead included seven adults and a    boy officials had said earlier that two of the victims were juveniles. “Each one of the victims appears to have been executed,” Mr. DeWine said. “Each one appears to be shot in the head. ” Asked if investigators had any indication of a motive, he said, “none. ” Officials said it was also unclear when the killings took place. “We have victims who were in bed” when shot, he said. “The one mom was killed in her bed with the    right there. ” At first, officials said they could not rule out the possibility that the gunman was among the dead. But later, Mr. DeWine said, “the preliminary determination has been made that none of the eight individuals committed suicide. ” Officials declined to give the first names of any of the victims. Phil Fulton, the pastor of the nearby Union Hill Church, told local television stations that he knew the victims, and they included a woman, her children and her grandchildren. The state Bureau of Criminal Investigation, part of the attorney general’s office, took over the investigation, and Mr. DeWine said the bureau had sent more than 30 investigators to Pike County. The killings took place in a hilly, sparsely populated area of southern Ohio, about 70 miles east of Cincinnati and a similar distance south of Columbus. Sheriff Reader said the initial call to his office came in at 7:53 a. m. reporting two people dead in a house. When deputies arrived, someone flagged them down and told them to check two other houses nearby. The sheriff declined to say who called his office, or how that person had discovered the killings.'"}, "time": 1742628423.2101328}