{"duration": 0.0334322452545166, "input_args": {"text": "'OCTOBER 27, 2016 \\nby Pamela Williams \\nThere is breaking news that a no-fly zone has been declared over the Dakota Access Pipeline area at Standing Rock, North Dakota. Protestors and Native American activists have set up a new camp called “Front-Line Camp” where they are making their last stand against the party Energy Transfer Partners, who are working on the Pipeline. The Sioux Tribe has declared eminent domain over the water rights and sacred land rights in the same area as the Pipeline is being built. They are asking for prayers as they make a great stand against the destruction of their sacred land. \\n\\nPipeline opponents attempting to protect their water supply from the Dakota Access oil pipeline (DAPL), as well as prevent the continued destruction of burial grounds and cultural sites, are anticipating a confrontation with police today. This news come after “water protectors” refused law enforcement requests to vacate reoccupied land in the pipeline’s path, owned by Dallas-based Energy Transfer Partners. \\nhttp://thesccop.com/breaking-no-fly-zone-declared-as-militarized-police-prep-for-assault-on-front-line-camp-at-standing-rock/ \\n\\nWhile Cheyenne River Sioux Tribal Chairman Harold Frazier sat down with President Barack Obama at a private roundtable in Los Angeles on Tuesday, October 25, Morton County, N.D. Sheriff Kyle Kirchmeier was calling in police reinforcements from six states to enforce Energy Transfer Partners’ demands that “trespassers” be removed from the path of the pipeline. \\nAuthorities implied they may forcibly remove the water protectors from the new camp, which is on land recently purchased by Dakota Access LLC, the subsidiary that is building the pipeline. \\n“We have the resources. We could go down there at any time,” Cass County Sheriff Paul Laney said, according to the Associated Press . “We’re trying not to.” \\n“We are here to enforce the law as needed,” Morton County Sheriff Kyle Kirchmeier said. “It’s private property.” Share: Rate:'"}, "time": 1742563333.9645376}