{"duration": 0.031748056411743164, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / What A Hillary Presidency Would Bring Essential Reading Untold Truths About the Planned War on Iran By wmw_admin on April 9, 2013 \\nDynamite documentary: Press TV talks to former White House insider Gwenyth Todd about the push for war with Iran. She has subsequently escaped to Australia to avoid FBI prosecution. Essential viewing Inside 9/11: Hijacking the Air Defense By wmw_admin on August 13, 2011 \\nWhy did U.S. air defense fail so spectacularly on 9/11? As this video explains, it was likely due to one man and he wasn’t sitting in a Afghan mountain cave Who Are The Illuminati? By wmw_admin on April 24, 2004 \\nConspiracy theory is now an accepted turn of phrase but sometimes one hears the expression, sometimes whispered rather than spoken. “The Illuminati”. 9/11 and Zion: What Was Israel’s Role? By Nick Kollerstrom on August 31, 2012 \\nWhen Netanyahu said the very next day, ‘This is very good for Israel”, he wasn’t just blurting out something indiscreet, he was publicly congratulating the various agents who had worked so hard The Essene Gospel of Peace I By wmw_admin on April 26, 2007 \\nBased on texts found in the Vatican library and the Royal Library of the Hapsburg’s and dated to the first century AD, the following is considered by some to be the real words of Christ The Anglo-Saxon Mission Part II By wmw_admin on March 1, 2010 \\nFormer City of London insider reveals that the depopulation program would begin with a planned war between Israel and Iran. More importantly, he goes onto to describe how we can derail their plans for global dominance London Beheading Hoax Confirmed? By wmw_admin on May 24, 2013 \\nWas the London beheading a hoax? After Sandy Hook anything is possible and the authors present a very convincing case that it was. Judge for yourself\""}, "time": 1742628510.8361075}