{"duration": 0.09827446937561035, "input_args": {"text": "'Chennai, Nov 16: \\nThe night of Nov 8 \\nOn the TV Prime Minister Narendra Modi is holding forth. Wife and I sit watching the whole thing with nary an emotion. We are speechless at what we hear. That is because we don’t understand Hindi. But the news scroll below, tells the story: Rs.500 and Rs.1000 demonetised. Wife looks at me quizzically. I look back at her quizzically. That is because we both don’t know what demonetisation means. \\nEventually the penny, if that is the word, drops. We understand the two denominations are declared invalid from that midnight. Jee whiz! What do I with all the Rs.500 and Rs.1000 with me? But quickly gathering my wits and immediately taking charge, I ask the wife and daughter to bring all the Rs.500 and Rs.1000 stashed in the house, as if it was the time of reckoning and we had to finally confront our hidden truths. After some merciless minutes, we look at the pile in front of us: A sum total of four Rs.500 notes, and one Rs.1000 note. Of course, a few harmless 100s, 50s and 10s were in too. \\nIs that what we have in hand? I ask the wife plaintively. “Usually it is a lot less. But we made it a point to look around behind the cot, bureau and sofa. The 10s were picked from there only,” the wife said matter of factly. “You do remember your salary, right? A journalist’s salary and a person who has drank cyanide is difficult to save,” the wife adds in the conversational parenthesis. \\nThe night ends in more unease: The fight against black money, it seems, will have some collateral damage. A journalist’s ego, for starters. \\nThe morning of Nov 13 \\nIt is a Sunday. In need of cash for the week. Go to the ATM in the locality Find that the authorities, manfully rising to the emergency of the occasion, have helpfully put an easy to spot ‘out of order’ notice on the door. \\nMentally thanking the banking guys for their thoughtful gesture, set out in search of another ATM and find one with only a few queued in front of it. Join the line only to quickly learn that 1) This ATM too is out of order 2) And the queue is actually for an ATM two streets away. \\nCursing fate, join the line. Soon enough realise that even if the Indian economy is eventually straightened, it is impossible to literally straighten any queue in India. I mean we Indians just don’t have the ability to fall in a simple straight line. It is a skill that requires military training for Indians to acquire. \\nThe line moves in every conceivable direction in every conceivable geometric formation. Improbable as it may sound, sometimes in the exact opposite direction to where the queue is actually headed towards. The line comprises an impressive motley: Some taciturn with thoughts. Some voluble with opinions. Some glued to their mobiles. Some staring into the distant nothingness. Some taking their troubles in stride. Some cursing their fate. But everyone feeling that they would be somewhere else than spending their time in a queue that seemed to move at the speed of larva turning into butterfly. \\nThose inclined to chat offer their views to no one in particular. “This is just the start. Modi will next ban gold and diamonds”, one man says with authoritative gusto. No one asks where he got that info from. He talks non-stop and seems to be the human/physical version of the WhatsApp fwds we are wont to receive on the many ‘groups’ we are part of. “Modi’s next target will be corrupt bureaucrats and politicos”. As a journalist, I realise that if I report from ‘Ground Zero’, these would be the ‘credible voices of the public’. \\n“It seems even the BJP is not happy with Modi,” says another in the silent gap that the previous man probably inadvertently left. “They have goofed up big time. All the new printed money are going to top politicos and industrialists. They all have been alerted before hand itself to exchange the notes,” he says with clinical finality. “An ATM is Ambattur is dispensing only old 500 rupees even today.” Where in Ambattur, I ask out of general curiosity, he replies, “my friend told me this”. I make a mental note that the guy is a very good journalist material. \\nBut amidst differing opinions and moods, there is an easy bonhomie, a chatty friendliness descends on the scene. Every one has some opinion on how to tackle the black money scourge and what the Finance Minister should do. Never knew economics was such a popular subject with the general public. \\nThe queue progresses at the speed of Indian economy, and I am kind of near the ATM, when someone, looking into his mobile, says “this week has to be the worst”. I wonder what is he having in his mind. Trump becoming the US President-elect. Currency crunch and other issues in India. What could get any worse than this? \\n“Alaistair Cook just scored a century,” I hear him say even as I enter the ATM room.'"}, "time": 1742562080.2434707}