{"duration": 0.18433475494384766, "input_args": {"text": "'Leave a reply \\nHilarion – As you endeavor to stay in equilibrium and balance during these days with all that is occurring within your sphere of resonance, you are finding that the intensified energies are having their effect, not only within your own system but in all those who are in your sphere of influence. The duality energies are rampant and it is important to remember your purpose for holding the Light during these times. \\nIt is very easy for you who are sensitive to the energies around you to understand that the feelings that you have been experiencing are mainly those that are being experienced at the collective consciousness level. There is much fear and doubt that is rampant at these times – remember this – and re-center and refocus on that which you are and that which you stand for. \\nStay true to yourself, so far you have not been led astray; you have maintained your position and stayed within your core center. As the energies ramp up to an even greater degree in the coming days, it is important to take time to experience that which brings you joy, laughter, peace, and inspiration personally. \\nIt is important to focus on these things; to take time away from your Earthly duties and concerns often and take a break by going out in nature and doing things that you usually put off until another day, those things that nurture you and replenish your own energy. This is what is needed for you to be focusing on. Feel the joy, laugh often, laugh loudly, there is so much beauty around you – it fills every place and space in your environment – look for it and enjoy it! \\nEmbody that energy within your being after this break, for it is then possible for you to make an informed and clear decision as to your next move. As this year draws to an end, it is the time for completion of all that you set out to do in previous years, the time of the completion of all goals, projects and intentions that you set out to accomplish. This is an alignment in preparation for the new cycle that begins in 2017 for it is a new nine year cycle. This is the time to finish up and complete all that needs completing so that you can start fresh. \\nIt is within the realm of possibility to completely recreate yourself in the new cycle; how you present yourself to the world, how you speak, think and feel. It does not require the approval of others, it is something that is in your own interest – not selfish interest, but an acknowledging that there is a new cycle that is looming on the horizon so that you can be in a position to take advantage of all the energies of those times and this is very appropriate. \\nThe energy of the world around you is changing moment by moment and it is hard to maintain your intentions and focus but it is possible to do it. You have all the tools and the knowledge that you need to stay true to yourself, to stay aligned with the higher aspects of yourself. No matter what occurs in the world around you, you know within yourself that all is well and always has been. The world goes round and round, much is the same as it was, that which has true meaning and value continues and opens up to you and this is the area where you should focus and concentrate. \\nReconnect to the love that resides within your heart and open your heart as wide as you can possibly do so in each moment. The world needs your love, the world needs your calming and soothing presence and this is an important aspect of your work upon this planet. We are with you and abide beside each one of you as you go about your daily activities. We prompt you to take those breaks when necessary and during these tumultuous times it is important to take more breaks, they do not have to be of long duration, just so that you feel renewed and restored within the center of your being. \\nSend healing Light, love and energy to those areas of the world that are experiencing Earth changes that are not happy ones at the moment. These changes bring a gathering together of those peoples so that they work in concert and in harmony with each other as they realize the important values in their lives, that of cooperation, communication, and unity – these are the important values that will be retained as different areas of the worlds peoples experience coming happenings. \\nAs all of humanity moves into the unknown, there is a gathering together of like minds and this brings harmonious and peaceful results throughout the world. Everyone gathers around those in need and gives of their help and assistance, their love and energies and this all is for the highest good of everyone upon the planet. \\nWe counsel you that all the answers that you are seeking, the truth that you are seeking about any given subject, is always contained and available within yourselves. Know this and align with your higher aspects, with the purity that lies within the core of your Divine essence. There you will always be in harmony with All That Is. Know this and stay strong and focused, know that all is well, the universe turns, the Earth turns and all is as it should be. \\nAll that needs to be changed is in the process of that change and therefore things can seem pretty intense. All these changes need to take place, we have known this for many, many decades and now, we are in the midst of that change. Have faith that all is as it should be and that you will come out at the end of all this change with joy, peace and happiness to a new way and a new beginning filled with all that is right and good and decent in your world and the world at large. You are loved, you have always been loved. It is now time to shine that love, to radiate it out to others who are so in need of it during these times. \\nUntil next week…'"}, "time": 1742561986.4783895}