{"duration": 0.05726361274719238, "input_args": {"text": "'\\n\\nWith Hillary’s future in jeopardy, people are on edge for a possible false flag event. I was just telling a friend that so far today, we have been lucky. Well, I might have jumped to conclusions. Here is an email from a listener/viewer that I am highly concerned about.\\nOur best exposure is the light of day. In that spirit, I present the following:\\n \\nHey Dave.\\nI was looking for some part time work yesterday when I came across an ad for role players in Orangeburg sc for a mass casualty drill.\\nI called and will be participating Saturday . We meet Friday for more info. At that time we will be told what disaster be it a train spill w chemicals or dirty bomb or nuclear blast.\\nADEC is the company holding it. Bob Jones is facilitating.\\nIf you want me to get more details to you Friday I can. Keep up the good work.\\n \\nNeed people for Role Players for National Guard Exercise. (Orangeburg) hide compensation: $100.00 per day \\nemployment type: contract \\nIndividuals acting as role players needed to participate in a training exercise with your local National Guard. Role players will be rescued, triaged and put through a decontamination process and other exciting tasks. With your help, we will make this exercise as realistic as possible. See what it feels like working next to your National Guard. Compensation will be $100 for the day. The date of the exercise will be November 5, 2016 in Orangeburg South Carolina. Requirements: Must be 18 years or older with a valid drivers license. We will be hiring 20 role players. Interested parties contact Bob Jones @ (770)841-8335 . Principals only. Recruiters, please don’t contact this job poster. do NOT contact us with unsolicited services or……  \\nP lease Donate to The Common Sense Show \\n \\nPLEASE SUBSCRIBE TO OUR YOUTUBE CHANNEL AND DON’T FORGET TO “LIKE” US \\n\\n \\n\\nThis is the absolute best in food storage. Dave Hodges is a satisfied customer. Don’t wait until it is too late. Click Here for more information.\\n \\n\\n\\nClick here for more information \\n \\nThe sane alternative to Facebook \\nSeen.Life-The Facebook alternative- no censorship, no spying– Sign up here \\n'"}, "time": 1742564110.7815585}