{"duration": 0.18292570114135742, "input_args": {"text": "'Here is a guide to understanding Britain’’s vote to leave the European Union, a decision known as “Brexit” that will have global consequences for years to come. Complete news coverage is here. More than 17. 4 million Britons voted June 23 to sever ties with the European Union, whose seat of power lies in Brussels, compared with 16. 1 million who voted to remain. The stunning vote, 52 percent to 48 percent, plunged world financial markets into turmoil, the political consequences for the prime minister of Britain were swift, and people around the globe reacted with shock and confusion. It would be the first time any country has left the bloc. Fear of being overrun by immigrants was a driving concern for “Leave” voters, who appeared to dominate the conversation on social media. Globalization concerns and a desire to wrest Britain from under Brussels’ thumb were also factors. The referendum came about as a result of a promise made in 2013 by Prime Minister David Cameron to appease an increasingly vocal   Union wing of his Conservative Party. ■ The prime minister said he would step down. Mr. Cameron, who led the “Remain” campaign, announced on Friday that he had no ”precise timetable” but that he believed his successor  —   who will manage the process of leaving the union  —   should be in place by October. Boris Johnson, the former mayor of London who backed leaving the E. U. was considered a   to succeed Mr. Cameron. But on June 30, Mr. Johnson announced he would not run for the position of party leader (and therefore prime minister). ■ Global markets plunged. The British pound plummeted to its lowest level since 1985. Investors fled to the American dollar and the yen.  ■ The U. S. market was down more than 3 percent at the close on June 24, with the Dow shedding over 600 points, after   overnight in Japan and Hong Kong. The financial damage was more severe on the Continent than in Britain and the United States.  ■ The United Kingdom lost its last remaining AAA credit rating on June 27, when the credit rating agency Standard  Poor’s downgraded the nation to AA, Reuters reported. ■ The referendum is not legally binding, though it is difficult to imagine that the British government would ignore the will of the voters. The process of leaving begins only after the British government invokes a provision of the European Union’s governing treaty known as Article 50  —   an action Mr. Cameron said he would leave to his successor. Once Article 50 is invoked, though, Britain could not change its mind and stay in the union unless the 27 other members all agreed. ■ Britain would leave the world’s largest common market, with 508 million residents, including 65 million Britons. That would free them from the bloc’s commitment to the free movement of labor, capital, goods and services. But it would also bring complications, with some businesses already planning to relocate. ■ Little will change for at least two years, but the vote sets off a series of negotiations as the country separates from the union’s remaining 27 members. Britain, which has the bloc’s   economy after Germany, would have to come up with new trading agreements. Almost half its exports are sold on Europe’s common market. ■ London’s role as a financial center could be imperiled, particularly if the trade in   securities moves to rival cities like Paris and Frankfurt. ■ The immediate effect on travel will be limited, especially as Britain was not a member of the   Schengen zone, which came under heavy pressure last year from the refugee crisis. Americans will find bargains in travel to Britain, because of more favorable exchange rates. ■  Britain’s security will be largely unaffected: It remains a nuclear power, a permanent member of the United Nations Security Council and a leader of NATO. ■ Scotland and Northern Ireland could go their own way. Both voted overwhelmingly to stay in the E. U. But prominent political leaders in Scotland and Northern Ireland called on Friday for new moves toward separating from Britain. Scotland, which voted in 2014 to remain in the United Kingdom, may revisit that referendum. Northern Ireland has an open border with the Republic of Ireland, a member of the bloc. Border crossings could now be tightened, and pressure could increase for unification, prompting instability in both places. ■ Calls for similar action have spread throughout Europe. “We must now have the same referendum,” French   National Front party leader Marine Le Pen tweeted. Politicians made similar appeals in Denmark and the Netherlands. In Italy, one politician called for a referendum on whether to keep the euro currency. ■ President Obama said in a statement: “The people of the United Kingdom have spoken, and we respect their decision. ” He pledged that the U. K. and the E. U. would remain “indispensable partners of the United States” and that Britain’s “special relationship” with the United States would endure. ■ Hillary Clinton: “We respect the choice the people of the United Kingdom have made. Our first task has to be to make sure that the economic uncertainty created by these events does not hurt working families here in America. ” ■ Donald J. Trump: “I said this was going to happen, and I think that it’s a great thing. ” The British people “have declared their independence from the European Union, and have voted to reassert control over their own politics, borders and economy,” Mr. Trump said. “A Trump administration pledges to strengthen our ties with a free and independent Britain. ” ■ Chancellor Angela Merkel of Germany expressed disappointment with the vote and called for European unity. “Our goal should be to create a future relationship between Great Britain and the European Union that is close and  . ” ■ Moscow maintained its stance that the British referendum was of little direct concern. President Vladimir V. Putin said, “This will certainly have consequences for Britain, for Europe and for us. The consequences will be global, they are inevitable they will be both positive and negative. ”'"}, "time": 1742561679.353311}