{"duration": 0.13517069816589355, "input_args": {"text": "'Let’s review just how small we are in comparison to the universe: for every grain of sand on every beach on Earth there are 10,000 stars, the Milky Way includes billions of Earth-like, potentially habitable planets. \\nVia CollectiveEvolution \\n\\nThe Milky Way itself is only one of billions of galaxies, and we may be living in an infinitely-increasing number of universes, otherwise known as the multiverse. Given all of this, it is reasonable to assume that other life forms exist outside of our planet. In addition, Earth is a part of a fairly young planetary system, so it’s possible there are extraterrestrials out there that are far more advanced than us. This begs the question: where are all of the extraterrestrials?\\nThis question was first addressed by Italian physicist Enrico Fermi in the 1950s when he asked, “If life is so abundant, why have we never heard from anyone?” More recently, Physics and Astronomy Professor at the University of Manchester, Brian Cox, attempted to answer this question, which is now commonly referred to as the Fermi Paradox. Unfortunately for us, Cox’s theory isn’t very optimistic for the human race.\\nWhat is the Fermi Paradox? There are at least 500-quintillion (or 500 billion billion) sun-like stars out there, and keep in mind that that’s a very conservative estimate. A study from the Proceedings of the National Academy of Science suggests that at least 1% of the total stars in the universe have Earth-like planets orbiting around them, meaning that 100 billion billion Earth-like planets may exist.\\nFor those of you who are sceptical about extraterrestrials, let’s make a conservative estimate that after 1 billion years of existence, only 1% of these Earth-like planets develop life. To help you visualize this, that would be the equivalent to every single grain of sand on Earth representing one planet with life on it. Even if only 1% of that number developed equal intelligence to humans, that would mean there are 10 million billion intelligent civilizations in the universe.\\nIf you scale these numbers down using the same estimates to predict how many intelligent civilizations exist in the Milky Way, you’d get 1 billion Earth-like planets and 100,000 intelligent civilizations in our galaxy alone.\\nSo, I ask you this: Do extraterrestrials exist and if so, why haven’t they contacted you? Welcome to the Fermi Paradox!\\nPotential Explanation 1: Physicist Brian Cox’s Theory Physicist and Astronomer Brian Cox was the latest to address the Fermi Paradox in a recent interview. Although his outlook is relatively pessimistic, it is still a very real possibility. Cox says, “One solution to the Fermi Paradox is that it is not possible to run a world that has the power to destroy itself and that needs global collaborative solutions to prevent that.” He continues, “It may be that the growth of science and engineering inevitably outstrips the development of political expertise, leading to disaster. We could be approaching that position.” (source)\\nIn other words, extraterrestrials may have destroyed their entire civilization by means of political turmoil and/or technological advancement, and we could repeat this same pattern of self-destruction. Cox’s theory reminds me of Stephen Hawking’s recent warning to the public about artificial intelligence and how it could threaten the entire human race and lead to our demise (read the full article here). Could the greatest threat to humanity be humanity? \\nPotential Explanation 2: The Great Filter Created by Associate Professor at George Mason University, Robin Hanson, the Great Filter (GF) theory suggests that an incredibly difficult step exists in the evolution of life, one that prevents civilizations from reaching interstellar travel. The question is: Where are we in relation to the GF?\\nOption 1 is that we’ve somehow managed to pass the GF, a task that very few or potentially no other civilization has accomplished. Option 2 is that life is very rare, so the GF is actually the fact that life began on Earth in the first place. Option 3, the worst possibility, is that the GF is in front of us and we are approaching some sort of event or circumstance that prevents us from reaching higher intelligence.\\nPotential Explanation 3: Extraterrestrials Have Visited Us Before There is substantial evidence that proves extraterrestrials exist and that UFOs have been visiting us for a long time. More than a dozen NASA astronauts have publicly stated that UFOs have been spotted including Dr. Edgar Mitchell and Princeton University Physics Professor Brian O’Leary (read some of their quotes here). Chairman of Hillary Clinton’s 2016 presidential campaign, John Podesta, has been quoted many times discussing the lack of UFO disclosure.\\n“There is a serious possibility that we are being visited and have been visited for many years by people from outer space, by other civilizations. Who they are, where they are from, and what they want should be the subject of rigorous scientific investigation and not be the subject of ‘rubbishing’ by tabloid newspapers.” (source) – Lord Admiral Hill-Norton, Former Chief of Defense Staff, 5 Star Admiral of the Royal Navy, Chairman of the NATO Military Committee\\nAnother example that may prove extraterrestrials (ETs) have been trying to contact us for years is the crop circle phenomena. For example, in 1974, a broadcast (known as the “Arecibo” message) created by Carl Sagan and his colleagues was sent into space via radio waves at a special ceremony celebrating the re-modelling of the Arecibo radio telescope in Puerto Rico. 27 years later, in 2001, we received a response to the 1974 broadcast when an intricate crop circle appeared next to Britain’s largest telescope and observatory, the Chilbolton, home to the world’s largest fully steerable meteorological radar. Although many people are skeptical, the Thrive documentary produced by Foster Gamble, the heir to Proctor & Gamble, provides a compelling argument in support of ETs creating many of these crop circles.\\nPotential Explanation 4: Extraterrestrials Are Constantly Visiting Us To understand this theory, let’s first examine the Kardashev scale, which attempts to define civilizations of different intelligence levels. Type 0 civilizations extract its energy from crude, organic-based resources (Carl Sagan estimated we are Type 0.7). Type 1 can utilize all available resources on their home planet, Type 2 has the capacity to harness all of the energy from its star, and Type 3 could use all of the energy from its galaxy.\\nWe currently live in a third dimensional world. We have not yet accessed, as a collective, a higher dimension. If you’re unfamiliar with the concept of higher dimensions, Carl Sagan provides an excellent explanation here. If a type 3 civilization was in fact visiting us, we may not even notice. If a civilization of higher intelligence is operating in the fourth dimension, we, as three dimensional beings, wouldn’t be able to see them let alone communicate with them.\\nAmerican Theoretical Physicist, Michio Kaku, explains:\\n“Let’s say we have an anthill in the middle of the forest. And right next to the anthill, they’re building a ten-lane super-highway. And the question is “Would the ants be able to understand what a ten-lane super-highway is? Would the ants be able to understand the technology and the intentions of the beings building the highway next to them?”\\nSo, Which Explanation Is Correct? I believe there is truth within each of these solutions. Ultimately, our egos are our greatest enemies and we could end up destroying ourselves; however, I believe we are experiencing a shift in consciousness, and as a result, the possibility of this happening is decreasing. I believe life in and of itself is a miracle, so we’ve probably passed the Great Filter, but I think other civilizations have as well due to the significant evidence in support of UFOs and the existence of ETs. It’s no secret that the U.S. government has tried to hide this from the public, but perhaps that’s a good thing. Maybe we aren’t ready to contact ETs regularly until we reach a higher state of consciousness, access higher dimensions and become a more intelligent civilization. No matter what you believe, the Fermi Paradox is clearly a subject that merits further research and discussion!\\nI’ll leave you with this video to let you think of the other possibility, that we have seen\\n'"}, "time": 1742563402.7425315}