{"duration": 0.1007680892944336, "input_args": {"text": "'ORANGE CITY, Iowa  —   A year ago, Evan Wielenga, 40, believed  —   as does his congressman, Steve King  —   that undocumented immigrants should all be deported. They broke the law to enter the country. They spoke little English. They strained schools and public services. But as talk of a border wall and a Muslim ban overtook the presidential campaign, Mr. Wielenga, the agronomy manager of a farmers’   here in northwestern Iowa, had a change of heart. He heard dairy farmers say they couldn’t get their cows milked without immigrants. “You can put an ad in the paper and you won’t get two white guys to apply,” said Mr. Wielenga, who grew up on a dairy farm himself. He heard of the ruinous damage an immigration raid had done to families. “Some of these kids were born in the U. S.,” he said. “These families had lived here 10 years, and all of a sudden, Dad’s gone, Mom’s gone. When you think of it from that perspective, what’s the lesser of two evils?” Mr. King, a Republican who has displayed a Confederate battle flag on his desk in Washington, shows no sign of budging in his views. His latest   tirade  —   “We can’t restore our civilization with somebody else’s babies,” he said  —   once again drew wide condemnation and critical attention to Iowa’s Fourth Congressional District, whose voters overwhelmingly   him to an eighth term in November. Sioux County, Mr. Wielenga’s home, provided the largest margin in the   district, Iowa’s most conservative. And there is no shortage of voters who echo Mr. King’s contention that “culture and demographics are our destiny,” as he said earlier this month to cheers from white supremacists. But in conversations over four days with residents who voted for Mr. King, a new chorus of earnest naysayers could also be heard in many corners of the district. Some said the congressman’s latest provocation  —   uttered in support of a   Dutch politician  —   was finally more than they could brook. Several said they were rethinking their support. “I’ve always voted for him, but I think this was way out of line,” said Bill Kooi, a retired farmer, sipping coffee at a Hardees in Orange City, as the friends who shared his table  —   to a man, older white conservatives  —   all nodded. Again and again, voters brought up how much Mr. King’s district has changed since his election 15 years ago. Though still overwhelmingly white, it has absorbed a sizable population of Hispanics who have taken    jobs and opened small businesses in the empty storefronts of struggling towns. As a generation of   white children leaves for college and seldom returns, immigrants are keeping many of those communities alive. Denison, in Crawford County, is one. Eric Skoog, a county commissioner and owner of Cronk’s restaurant in Denison, where Mr. King, 67, sometimes stops on his way home, said the community had been successfully assimilating a steady stream of Hispanics for years. “One of our claims to fame is we don’t have a Hispanic neighborhood,” Mr. Skoog said. Rather, immigrants and their families live throughout the community. Before the 2010 census, city officials worked hard to persuade immigrants to allow themselves to be counted so Denison could receive its share of federal dollars. Mr. Skoog said that Latino newcomers had flocked to Denison to take jobs in meatpacking plants that Iowa farmers had once filled  —   but that those native Iowans wanted better for their children. “The next generation, there was not a supply of male white farmers around here,” he said. “So all of a sudden you saw the influx of the Hispanic population. ” Mr. Skoog counts himself a friend of Mr. King’s, but offered no explanation for the lawmaker’s   and racially inflammatory statements, which go back years, including a 2013 description of undocumented teenagers with “calves the size of cantaloupes” from carrying drugs across the border. Selecting his words carefully, Mr. Skoog said of Mr. King: “There’s a personal relationship there. I don’t want to damage that by saying too much negative. ” Others describe an ethos that is changing day by day. Libbie Schillerberg has three children in the Denison schools, where more than half the students are Hispanic. Her oldest, Ethan, 15, plays guitar in a high school mariachi band. Her youngest, Addison, 6, is one of four   whites in her class. “I’m on our youth soccer board,” Ms. Schillerberg said. “We didn’t used to see as many Hispanic parents volunteering to coach. We’re seeing more and more. When your kids are such good friends at school, people are getting to know each other better. They’re trusting each other, wanting to be around each other. ” Mario Flores, a   loan officer at Bank Iowa in Denison, said Hispanics there were buying homes, investing in apartment buildings and otherwise injecting economic vitality into the community. “I believe both groups, the Anglo and   are learning from each other,” he said. Mr. King has survived past denunciations: Last year, he drew a rare primary challenger, who accused him of being so toxic that his name on a  bill rendered it “dead on arrival. ” But Mr. King won easily and went on to crush his Democratic opponent, Kim Weaver, an advocate for the elderly. Over the weekend, Ms. Weaver, who received a small gusher of donations after Mr. King’s latest remarks, announced she would challenge him again in 2018. It will not be easy. Last summer, Douglas Burns, an owner of The Times Herald in Carroll, Iowa, headlined a column: “King could use   daily, still get   here. ” Mr. Burns has branded Mr. King as a racist, but he recoiled from calling the district’s voters bigoted. Rather, he said in an interview, they embraced Mr. King for blackening the eyes of Washington and Des Moines elites. “I think people feel condescended to so much from urban forces that, while they may not like the racist tactics that King uses, if forced to choose sides, they’re going with King,” Mr. Burns said. But there are plenty who don’t seem to quibble much with Mr. King’s way of thinking. Sitting at the Hardees in Orange City last week, Don Engeltjes, 76, said he agreed with Mr. King on the need to clamp down on immigration. He said he believed new arrivals were a drain on taxpayers’ money, lumping immigrants from Mexico in with those from the Muslim world. “It’s just handout, handout, handout,” he said. “But Don, your dad is an immigrant too,” another man piped up, noting that Mr. Engeltjes’s father, like many forebears of the district’s voters, had come over from Holland at age 9. “You bet he was,” Mr. Engeltjes replied. “But the way it’s going nowadays, man, they’re outproducing us. We’re going to be the minority in a few years. ” Asked by a reporter who he meant by “we,” Mr. Engeltjes said: “The white people. The American people. ” Mr. Engeltjes said he did not oppose all immigrants. He described a successful prostate procedure he had not long ago in Sioux Falls, S. D. performed by a Korean doctor. But he complained that homes occupied by several Hispanic families living together were running down his neighborhood. On Sundays, he said, he picks up trash in the street from parties he believes are held by his Hispanic neighbors. Interviewed at his home later, where his wife, Alma, said her husband had occasionally made enemies by being outspoken, Mr. Engeltjes praised the same quality in Mr. King, for whom he said he would vote again. “Enough of this ” he said. “The man’s got a pair. ” Mr. Wielenga, the agronomist, suggested that northwestern Iowa, with its proud Dutch heritage, may have grown too insular, too complacent, during Mr. King’s tenure in Congress. He called it a safe community and a great place to raise children. He has four daughters and is the board president of Hull Christian School, where Mr. Wielenga said only one of the 100 families who send children to the private school is Hispanic. He said some of the area’s churches were entirely white. “We talk about this at school,” Mr. Wielenga said: “Are we living in a bubble? And is that what God is calling us to do  —   to live in a bubble?” “This has been going on now for 20 years,” he said of the Hispanic influx. “Now you want to fix it by kicking people out?” He gently shook his head.'"}, "time": 1742628370.0583158}