{"duration": 0.11574840545654297, "input_args": {"text": "'WASHINGTON  —   America, and the world, just found out what “America First” means. President Trump could have used his inaugural address to define one of the touchstone phrases of his campaign in the most inclusive way, arguing, as did many of his predecessors, that as the world’s greatest superpower rises, its partners will also prosper. Instead, he chose a dark,   alternative, one that appeared to herald the end of a   American experiment to shape a world that would be eager to follow its lead. In Mr. Trump’s vision, America’s new strategy is to win every transaction and confrontation. Gone are the days, he said, when America extended its defensive umbrella without compensation, or spent billions to try to lift the fortune of foreign nations, with no    strategic benefits for the United States. “From this day forward, it’s going to be only America first,” he said, in a line that resonated around the world as soon as he uttered it from the steps of the Capitol. “We must protect our borders from the ravages of other countries making our products, stealing our companies and destroying our jobs. ” The United States, he said, will no longer subsidize “the armies of other countries while allowing for the very sad depletion of our military. ” While all American presidents pledge to defend America’s interests first  —   that is the core of the presidential oath  —   presidents of both parties since the end of World War II have wrapped that effort in an expansion of the liberal democratic order. Until today, American policy has been a complete rejection of the America First rallying cry that the famed flier Charles Lindbergh championed when, in the late 1930s, he became one of the most prominent voices to keep the United States out of Europe’s wars, even if it meant abandoning the country’s closest allies. Mr. Trump has rejected comparisons with the earlier movement, with its taint of Nazism and  . After World War II, the United States buried the Lindbergh vision of America First. The United Nations was born in San Francisco and raised on the East River of Manhattan, an ambitious, if still unfulfilled, experiment in shaping a liberal order. Lifting the vanquished nations of World War II into democratic allies was the idea behind the Marshall Plan, the creation of the World Bank and institutions to spread American aid, technology and expertise around the world. And NATO was created to instill a commitment to common defense, though Mr. Trump has accurately observed that nearly seven decades later, many of its member nations do not pull their weight. Mr. Trump’s defiant address made abundantly clear that his threat to pull out of those institutions, if they continue to take advantage of the United States’ willingness to subsidize them, could soon be translated into policy. All those decades of generosity, he said, punching the air for emphasis, had turned America into a loser. “We’ve made other countries rich,” he said, “while the wealth, strength and confidence of our country has disappeared over the horizon. ” The American middle class has suffered the most, he said, finding its slice of the American dream “redistributed across the entire world. ” To those who helped build that global order, Mr. Trump’s vow was at best shortsighted. “Truman and Acheson, and everyone who followed, based our policy on a ‘’ not an ‘’ basis,” said Richard N. Haass, whose new book, “A World in Disarray,” argues that a more granular,   view of American interests will ultimately fail. “A narrow America First posture will prompt other countries to pursue an equally narrow, independent foreign policy,” he said after Mr. Trump’s speech, “which will diminish U. S. influence and detract from global prosperity. ” To Mr. Trump and his supporters, it is just that view that put America on the slippery slope to obsolescence. As a builder of buildings, Mr. Trump’s return on investment has been easily measurable. So it is unsurprising that he would grade America’s performance on a scorecard in which he totals up wins and losses. Curiously, among the skeptics are his own appointees. His nominee for defense secretary, Gen. James N. Mattis, strongly defended the importance of NATO during his confirmation hearing. Both Rex W. Tillerson, the nominee for secretary of state, and Nikki R. Haley, the choice for ambassador to the United Nations, offered up paeans to the need for robust American alliances, though Mr. Tillerson periodically tacked back to concepts echoing Mr. Trump’s. And there is a question about whether the exact meaning of America First will continue to evolve in Mr. Trump’s mind. He first talked about it in a March interview with The New York Times, when asked whether that phrase was a good summation of his   views. He thought for a moment. Then he agreed with this reporter’s summation of Mr. Trump’s message that the world had been “freeloading off of us for many years” and that he fundamentally mistrusted many foreigners, both adversaries and some allies. “Correct,” he responded. Then he added, in his staccato style: “Not isolationist. I’m not isolationist, but I am ‘America First.’ So I like the expression. ” He soon began using it at almost every rally. In another interview with The Times, on the eve of the Republican National Convention, he offered a refinement. He said he did not mean for the slogan to be taken the way Lindbergh meant it. “It was used as a   very modern term,” he said. “Meaning we are going to take care of this country first before we worry about everybody else in the world. ” As Walter Russell Mead, a professor at Bard College and a scholar at the conservative Hudson Institute, put it the other day, “The fact that he doesn’t have a grounding in the prior use of the term is liberating. ” “If you said to the average American voter, ‘Do you think it’s the job of the president to put America first,’ they say, ‘Yes, that’s the job. ’” But Mr. Mead said that formulation disregarded the reality that “sometimes to achieve American interests, you have to work cooperatively with other countries. ” And any such acknowledgment was missing from Mr. Trump’s speech on Friday. Mr. Trump cast America’s new role in the world as one of an aggrieved superpower, not a power intent on changing the globe. There was no condemnation of authoritarianism or fascism, no clarion call to defend human rights around the world  —   one of the commitments that John F. Kennedy made in his famed address, delivered 56 years ago to the day, to protect human rights “at home and around the world. ” That was, of course, the prelude to Kennedy’s most famous line: that America would “bear any burden, meet any hardship, support any friend, oppose any foe to assure the survival and the success of liberty. ” But the America that elected Mr. Trump had concluded that it was no longer willing to bear that burden  —   or even to make the spread of democracy the mission of the nation, as George W. Bush, who was sitting behind Mr. Trump, vowed 12 years ago. Mr. Trump views American democracy as a fine import for those who like it. “We do not seek to impose our way of life on anyone,” he said, “but rather to let it shine as an example for everyone to follow. ”'"}, "time": 1742563429.548402}