{"duration": 0.02453923225402832, "input_args": {"text": "'Print \\nHmm, how about that? Eleven days before the game-changing 2016 presidential election, FBI Director James Comey announces that his agency is reopening the criminal investigation of former Secretary of State Hillary Clinton . \\nAll of the expected angst and apoplexy from the Left come gushing out. An anti-Trump PAC issues a complaint against the FBI for interfering with the eletoral process . Better still, the Clinton campaign issues a statement via — of all people — its chairman, John Podesta. In it, Podesta accuses Comey of bending to presure brought by “Donald Trump and his Republican allies” regarding the director’s initial determination that no indictment against the former secretary of state should be brought. \\nPodesta’s prepared remarks also paraphrase Comey’s declaration in July that “no reasonable prosecutor would move forward with a case like this,” which at the time prompted much head-scratching since he also affirmed that Clinton had indeed sent and received classified information using her non-secured private email account . \\nCall me a conspiracy theorist if you like — my colleague Benny Huang probably would — but I have to wonder whether all this is too convenient. Could we be witnessing a calculated plan to divert attention from the WikiLeaks emails, which have been hurting the Democratic candidate’s standing in the polls? This development might even gain some sympathy for Hillary Clinton, who has long maintained the vast right-wing conspiracy — which, nota bene, includes James Comey — has it out for the Clintons. \\nOr better yet, suppose that the FBI does put a rush on its investigation, as Clinton herself has now demanded, and determines for a second time that there are no grounds for an indictment. \\nAll the while, the press and impressionable voters would be focused on this probe. Envelope, please !'"}, "time": 1742561779.1789277}