{"duration": 0.12222981452941895, "input_args": {"text": "'Troubled Credit Suisse Bank Posts Surprise Profit November 04, 2016 Troubled Credit Suisse Bank Posts Surprise Profit \\nCredit Suisse reported an unexpected net profit for a second quarter in a row on Thursday though the surprise was largely down to real estate sales and Chief Executive Tidjane Thiam cautioned the outlook remained challenging. Just last week, TRUNEWS reported that Deutsche Bank chief John Cryan shocked the financial sector by posting a quarterly profit after expectations sent economists running for the hills. For the three months to the end of September, the Swiss bank had net profit of 41 million Swiss francs ($42.2 million), well above the average estimate for a 120 million franc loss in a Reuters poll of five analysts. The bank said it had made gains of 346 million francs from the sale of real estate and cut costs during the quarter while setting aside another 357 million francs for legal bills in cases mainly relating to mortgage-backed securities. Thiam\\'s plan for more stable earnings by expanding wealth management and placing less reliance on investment banking had a rocky start in the face of tough markets but it has received support from major investors. \\n\"Looking ahead, we expect market activity to continue to be influenced by geopolitical and macro-economic uncertainty over the next several quarters and the outlook to remain challenging,\" Thiam said in a statement. \\nCredit Suisse shares dropped 4 percent when the market opened following the results and are down 40 percent in 2016, lagging the European banking sector index, which has fallen 20 percent. \\nREAD MORE: SWISS BANKS BET BIG ON NEGATIVE RATES \\nAnalysts said, while there had been healthy inflows into the wealth management side of the business, net margins have been declining since the start of the year. \\n\"Structurally, we remain cautious on the Wealth Management outlook driven by concerns over cost and fee pressures, as well as continued global regularization,\" Deutsche Bank analysts said in a note. \\nAHEAD ON COST CUTS \\nThiam joined Zurich-based Credit Suisse in July 2015 and outlined his blueprint in October that year. He warned in September that transaction levels were lower when asked about client activity in the third quarter, though he later said it was still a \"good quarter\" for the bank. \\nIn March, Credit Suisse took a bigger ax to its investment bank with a further 800 million francs in cost cuts and 2,000 more job cuts. \\nCredit Suisse said it expects to approach its cost base target in Global Markets of $5.4 billion by the end of 2016, two years ahead of schedule, and that it will give further updates on cost plans at an investor day on Dec. 7. \\nThe bank has cut headcount by 5,400 so far this year out of the 6,000 it is aiming for. \\nDespite those reductions, headcount across the bank rose quarter-on-quarter to 47,690 from 47,180 but was down 0.8 percent year-on-year. \\nFor example, 60 employees were added in its Global Markets division and 110 in its investmentbanking and capital markets division during the quarter. \\n\"The third quarter normally sees a pick up in hiring with the graduate and intern intake,\" CFO David Mathers said. \"It\\'s a seasonal pattern. We\\'re committed to reducing overall headcount, which also includes reducing contractors.\" \\nIts investment banking divisions, including trading and advisory and underwriting activity, reported net revenues of 2.4 billion Swiss francs, down 6.5 percent from a year earlier. \\nFixed income trading across Global Markets and its APAC (Asia-Pacific) divisions rose 3.7 percent to 902 million francs, failing to benefit as much from a surge in bond trading that saw U.S. banks boost their income by more than half in the quarter. \\nEquity sales and trading revenue fell 38 percent to 690 million francs from a year ago, mirroring a broad decline across the industry hit by uncertain and volatile markets that have left investors more averse to risk. \\nIn underwriting and advisory, the Swiss lender reported a 29 percent jump in revenue to 875 million francs as announced it was advising on a number of multi-billion M&A transactions. Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742563341.3351023}