{"duration": 0.05023312568664551, "input_args": {"text": "'From actor Chris Evans (Captain America) to director Joss Whedon, the Marvel Comics franchise is committing harikari in the most unbecoming of ways: through unapologetic, partisan bashing of a democratically elected president they can’t stand. [Evans has expressed deep contempt for what he considers to be in the ignorant masses of Americans that voted Donald Trump into the White House. These are, however, the very masses that make up the core viewership of Marvel’s superhero movies.  “People were just so desperate to hear someone say that someone is to blame,” Evans said in a recent interview with Esquire magazine. “They were just so happy to hear that someone was angry, hear someone say that Washington sucks. ” “I feel rage,” he said. “I feel fury. It’s unbelievable. ” “They just want something new without actually understanding,” he continued. “I mean, guys like Steve Bannon  —   Steve Bannon!  —   this man has no place in politics. ” Evans’ trolling of Trump on Twitter seems more an obsession than a pastime, and the actor seems to blame the President for all of the country’s woes. They did not die because of you. They died because of a hateful, ignorant, pathetic, EMBOLDENED piece of trash. https:  .   —   Chris Evans (@ChrisEvans) May 29, 2017,  Unacceptable. This man disgusts me. If you dont think Trump has played a role in this unapologetic wave of ignorance and hate, you are WRONG https:  .   —   Chris Evans (@ChrisEvans) May 15, 2017,  This administration LOVES to distract. This will only make it harder for women to stay healthy. Government $ can’t be spent on abortions! https:  .   —   Chris Evans (@ChrisEvans) April 14, 2017,  Of course, no one expects Hollywood actors to be intellectually sophisticated, but to have them try to infect Americans with their own ignorant bigotry is really a bridge too far. In large part, the bizarre rants the Marvel folks carry out on Twitter and elsewhere are abortion driven. Spitting in the face of their conservative fan base that is overwhelmingly   Whedon and Evans, along with other Marvel stars such as Scarlett Johansson (Black Widow) and Mark Ruffalo (Hulk) fawn over Planned Parenthood while painting abortion foes as backward and unenlightened. “As most of you know, Planned Parenthood has been under attack for many years now for another service they thankfully offer, providing a safe place for legal abortions,” Johansson said during a Variety luncheon last year. “A woman’s right to choose what to do with her body shouldn’t just be a woman’s rights issue. It’s the year 2016, and this is a human rights issue. ” Whedon recently went so far as to produce a short video panegyric to Planned Parenthood, calling America’s largest abortion provider a “beacon of hope” for the nation, while imagining how horrible life would be without Planned Parenthood to eliminate the unintended consequences of sexual libertinism. Why actors and filmmakers feel an irresistible urge to allow partisan politics to get in the way of their craft is a mystery, but whatever their motives such unrestraint often has consequences. It’s only a matter of time before Marvel’s fan base calls them out for their hypocrisy.     are not what patriots pay to see. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742628343.3834655}