{"duration": 0.06838202476501465, "input_args": {"text": "'License DMCA \\nCold War 2.0 has reached unprecedented hysterical levels. And yet a hot war is not about to break out -- before or after the November 8 US presidential election. From the Clinton (cash) machine -- supported by a neocon/neoliberalcon think tank/media complex -- to the British establishment and its corporate media mouthpieces, the Anglo-American, self-appointed \"leaders of the free world\" are racking up demonization of Russia and \"Putinism\" to pure incandescence. And yet a hot war is not about to break out -- before or after the November 8 US presidential election. So many layers of fear and loathing in fact veil no more than a bluff. Let\\'s start with the Russian naval task force in Syria, led by the officially designated \"heavy aircraft-carrying cruiser\" Admiral Kuznetsov, which will be stationed in the eastern Mediterranean at least until February 2017, supporting operations against all strands of Salafi-jihadism. \\nThe Admiral Kuznetsov is fully equipped with anti-ship, air defense, artillery and anti-submarine warfare systems -- and can defend itself against a vast array of threats, unlike NATO vessels. - Advertisement - \\nPredictably, NATO is spinning with alarm that \"all of the Northern Fleet,\" along with the Baltic Fleet, is on the way to the Mediterranean. Wrong; it\\'s only part of the Northern Fleet, and the Baltic Fleet ships are not going anywhere. The heart of the matter is that when the capabilities of this Russian naval task force are matched with the S-300/S-400 missile systems already deployed in Syria, Russia is now de facto rivaling the firepower of the US Sixth Fleet. \\nTo top it off, as this comprehensive military analysis makes clear, Russia has \"basically made their own no-fly zone over Syria\"; and a US no-fly zone, viscerally promoted by Hillary Clinton, \"is now impossible to achieve.\" That should be more than enough to put into perspective the impotence transmuted into outright anger exhibited by the Pentagon and its neocon/neoliberalcon vassals. \\nAdd to it the outright war between the Pentagon and the CIA in the Syrian war theater, where the Pentagon backs the YPG Kurds, who are not necessarily in favor of regime change in Damascus, while the CIA backs further weaponizing of \"moderate,\" as in al-Qaeda-linked and/or infiltrated, \"rebels.\" Compounding the trademark Obama administration Three Stooges school of foreign policy, American threats have flown more liberally than Negan\\'s skull-crushing bloody baton in the new season of The Walking Dead. \\nPentagon head Ash Carter, a certified neocon, has threatened \"consequences,\" as in \"potential\" strikes against Syrian Arab Army (SAA) forces to \"punish the regime\" after the Pentagon itself broke the Kerry-Lavrov ceasefire. - Advertisement - \\nPresident Obama took some time off weighing his options. And in the end, he backed off. So it will be up for the virtually elected -- by the whole US establishment -- Hillary Clinton to make the fateful decision. She won\\'t be able to go for a no-fly zone -- because Russia is already doing it. And if she decides to \"punish the regime,\" Moscow already telegraphed, via Russia\\'s Defense Ministry spokesman Major-General Igor Konashenkov, there will definitely be \"consequences\" for imposing a \"shadow\" hot war. \\nSun Tzu doesn\\'t do first-strike Washington, of course, reserves for itself a \"first-strike\" nuclear capability,   fully supports (Donald Trump does not, and for that he\\'s also demonized). \\nIf we allow the current hysteria to literally go nuclear, then we must consider the matter of the S-500 anti-missile system -- which effectively seals Russia\\'s air space; Moscow won\\'t admit it on the record because that would unleash a relentless arms race. A US intel source with close connections to the Masters of the Universe but at the same time opposed to Cold War 2.0 as \"counter-productive,\" adds the necessary nuance: \"The United States has lost the arms race, indulging in trillions of dollars of worthless and endless wars in Afghanistan, Iraq, Syria, Libya, and now is no longer a global power as it cannot defend itself with its obsolete missiles, THAAD, Patriot and Aegis Land Based Ballistic Defense System, against Russian ICBMs, even as the Russians have sealed their airspace. The Russians may be as much as four generations ahead of the US.\" \\nMoreover, in the deep recesses of shadow war planning, the Pentagon knows, and the Russian Defense Ministry also knows, that in the event some Dr. Strangelove launched a nuclear preemptive strike against Russia, the Russian population would be protected by their defensive missile systems -- as well as nuclear bomb shelters in major cities. Warnings on Russian television have not been idle; the population would know where to go in the -- terrifying -- event of nuclear war breaking out.'"}, "time": 1742628404.423851}