{"duration": 0.02352762222290039, "input_args": {"text": "'Thursday, 10 November 2016 President Elect Donald Trump This Morning at the White House \\nWASHINGTON DC - Taking questions from the media this morning before his meeting with President Barack Obama - President Elect Donald Trump was asked about the YesCalifornia Independence Campaign. YesCalifornia or #Calexit is a referendum for California Independence from the United States of America. In the Spring of 2019, Californians will go to the polls in a historic vote to decide by referendum if California should exit the Union. \\n\"I think it is a great idea\" President Elect Trump answered, \"I\\'ve met a lot of fantastic wonderful people in California and not all of them agree with me. The most incredible thing about this great and wonderful fantastic country we live in is we have the ability to choose our own path and vote on it as a wonderful collection of great and incredible people. \\n\"I honestly do not want to keep anyone in this country that does not want to be in this country. My primary job as president will to be fix the economy. If the incredible wonderful fantastic people of California want to operate as an independent sovereign nation, I would love to help these wonderful people. Getting rid of California will help the economy greatly. \\n\"I have talked with advisers and we are checking the constitution. I have a transition team talking with incredible clerks in the Supreme Court to see if I can fast track the process. As long as I am constitutionally able to do so, I will sign an executive order to remove the State of California from the United States. I know they are having trouble with their economy and water, but they obviously have plans on how to fix this as an independent nation. \\n\"I will also take request from any other wonderful beautiful states who want to follow the same course. My aim is to make America great again. Removing the chaff from the wheat will help us in obtaining this goal. \\nWhen President Elect Trump was asked about the future fifty-five electoral votes the state has he responded, \"oh I never thought about that. I guess that would [suck] for Democrats.\" \\nHe also was jokingly asked if Russian President Vladimir Putin was invited to the morning presidential briefings President Elect Trump is now part of, Trump replied, \"Of course not, but I\\'ll update him on Twitter.\" Make TreStBeefton\\'s day - give this story five thumbs-up (there\\'s no need to register , the thumbs are just down there!)'"}, "time": 1742628560.1909606}