{"duration": 1.5484566688537598, "input_args": {"text": "'A radical black student group known as The   Student Alliance ( ) which recently ended its occupation of a building on the UC Santa Cruz campus after university officials granted them every one of their demands, is threatening more civil disruption if its new demands are not met. [The College Fix, an online   news source, is reporting that in spite of meeting its original demands, “the group made three other demands to the university, and it has warned UC Santa Cruz that it has four months to comply with these demands or ‘more Reclamations will result. ”  The three additional demands   is making of UC Santa Cruz have been added to its initial “Reclamation Statement,”  and include: A reported by College Fix, this new list of demands contains a deadline and a threat at the end: “  …     that if by Fall Quarter 2017 the university does not provide ‘detailed plans’ on how to fulfill its new demands, ‘there will be more Reclamations. ’” How did this start? It all started the afternoon of Tuesday, May 2, when approximately   members of   blockaded themselves in Kerr Hall at the university’s Stevenson College. The occupation ended a few days later after UC Santa Cruz Chancellor George Blumenthal met with representatives of   and agreed to meet all the group’s demands, which included: The original occupation was only sparsely reported in the press, possibly because the   took issue with media “trespassing” in Kerr Hall to cover the student uprising. In spite of largely shunning the press, one   representative did shed some light on the group’s goals in a comment to Fox News: “Having that red, black and green house in the middle of Stevenson College, which is a predominantly   college, is a matter of symbolism and visibility,” Imari Reynolds of the   told Fox host Tucker Carlson. “Black students are on this campus. We do exist and we do pay to go here, just like our counterparts and we do deserve to be seen here on this campus. ” Why the term ‘Reclamation’ On the website of the Afrikan Black Coalition, a post titled, “Black Students at UC Santa Cruz Protest Hostile Campus,” contains a long list of grievances, “reparation” demands, and insight into what sparked the recent anger at UC Santa Cruz. The coalition states that studentsare simply taking back what they are owed (original emphasis): The term “occupation” is rejected in favor of “reclamation” to describe their actions, claiming: “We are pushing back against the language of ‘occupation’ in recognition of the largely   and fairly recent ‘Occupy Movement.’ We are pushing back against the language of ‘occupation’ in recognition of the very real settler occupations that are hxstorical [sic] and ongoing, such as the European colonization and occupation of ‘The Americas,’ as well as the current context of occupation in Palestine. As Black people, there are things that we are owed within the context of reparations and the historical [sic] traumas we have experienced and that we continue to experience today, and we plan to claim and reclaim those things. Under the heading, “Who We Are?” the answer offers additional insight (original emphasis): The   Student Alliance is an    (ABC)   and   organization on the campus of the University of California at Santa Cruz  …    We are the descendants of forcefully enslaved Afrikan people in “The Americas” as well as the first, second, third, fourth, fifth, and sixth generation immigrant and migrant children. We are capitalists,   and Anarchists. We are everything because Blackness is everything. University Response, A spokesman for the university, while declining to discuss whether “there will be any disciplinary action against the students who forcibly took over Kerr Hall,” did comment to College Fix reporter Matthew Stein “that ‘safety’ is the school’s top priority. ” There has been no official response to the new demands, which could be quite costly to a university system whose President, former Arizona Governor Janet Napolitano, is under scrutiny of late for allegedly hiding $175 million in a secret “slush fund” while simultaneously raising tuition on students.'"}, "time": 1742563631.7699456}