{"duration": 0.03699207305908203, "input_args": {"text": "'Fresh off the back of an electoral victory this past weekend, a bullish Angela Merkel has threatened Britain over the free movement of people  —   one of the most contentious parts of Brexit negotiations. [The German chancellor issued a warning over placing limits on migration into the United Kingdom, even though the issue was one of the primary motivating factors for those who voted for Britain to leave the European Union in June 2016.  According to Reuters, Mrs. Merkel implied Britain would have to pay a price if it put limits on the free movement of European Union citizens during a speech to trade unionists on Wednesday. “If the British government ends the free movement of people, that will have its price,” she said at a G20 trade union event in Berlin. “That’s not malice,” she said. “But I cannot have all the good sides and then say there will be an upper limit of 100, 000 or 200, 000 EU citizens, no more, or just researchers, but please nobody else. This will not work. ” In such a scenario, the remaining 27 EU members would then have to think about what additional obstacles to throw up in order to compensate, Merkel said. “We will, of course, always think in the future relationship of the 48 or 49 percent who didn’t back Brexit,” the German chancellor added, also commenting that the process of Britain leaving the EU will be “very, very complicated”. In recent weeks, EU officials have suggested Britain pay a 100 billion Euro bill to leave the European Union, a notion that today attracted ire from former UKIP leader Nigel Farage MEP in the Strasbourg European Parliament. “Either we get some grown up, reasonable demands from the European Union or the United Kingdom will be forced to walk away before the end of this year,” blasted Farage, adding: “We can’t spend two years with this farce”.'"}, "time": 1742562264.994182}