{"duration": 0.0631406307220459, "input_args": {"text": "'« L’art de la guerre »\\nPactes clairs, sujétion longue par Manlio Dinucci C’est avec raison que le président Barack Obama s’est félicité « des pactes clairs [et de l’] amitié longue » qui unissent son pays à l’Italie. En effet, cet État européen est pieds et poings liés par divers traités et une longue pratique à son suzerain états-unien.\\nRéseau Voltaire | Rome (Italie) | 27 octobre 2016 Après avoir appelé les Italiens à voter « Oui » au référendum, en s’ingérant dans notre politique nationale avec le silence complice de l’opposition parlementaire, le président Barack Obama a confirmé à son « bon ami Matteo [Renzi] » qu’avec l’Italie les USA ont « des pactes clairs, une amitié longue ».\\nIl ne fait aucun doute que les pactes soient clairs, et avant tout le Pacte atlantique qui soumet l’Italie aux USA. Le Commandant suprême allié en Europe est toujours nommé par le président des États-Unis d’Amérique et tous les autres commandements clé sont aux mains des USA.\\nAprès la fin de la Guerre froide, à la suite de la désagrégation de l’URSS, Washington affirmait l’« importance fondamentale de préserver l’Otan comme canal de l’influence et de la participation états-uniennes dans les affaires européennes, en empêchant la création de dispositifs uniquement européens qui mineraient la structure de commandement de l’Alliance », c’est-à-dire le commandement états-unien. Concept réaffirmé par le secrétaire de l’Otan, Jens Stoltenberg dans la récente table ronde sur la « grande idée d’Europe » : « Nous devons assurer que le renforcement de la défense européenne ne constitue pas un doublon de l’Otan, qu’il ne devienne pas une alternative à l’Otan ». Garantie de cela : le fait que 22 des 28 pays de l’UE (21 sur 27 après la sortie du Royaume-Uni) font partie de l’Otan sous commandement US, reconnue par l’Union européenne comme « fondement de la défense collective ».\\nLa politique extérieure et militaire de l’UE est ainsi fondamentalement subordonnée à la stratégie états-unienne, sur laquelle convergent les puissances européennes dont les conflits d’intérêt se re-compactent quand entre en jeu leur intérêt fondamental : conserver la domination de l’Occident, de plus en plus vacillant face à l’émergence de nouveaux sujets étatiques et sociaux. Il suffit de penser que l’Organisation de coopération de Shanghai, née de l’accord stratégique sino-russe, dispose de ressources capables d’en faire la plus grande aire économique intégrée du monde.\\nDans le cadre de la stratégie des USA et de l’Otan —documente la Maison-Blanche— l’Italie se distingue comme « allié solide et actif des États-Unis ». Le démontre le fait que « l’Italie abrite plus de 30 000 militaires et fonctionnaires civils du département US de la Défense dans des sites déployés dans tout le pays ».\\nEn même temps l’Italie est « partenaire des USA pour la sécurité mondiale », en fournissant des forces militaires et des financements pour une vaste gamme de « défis » : au Kosovo, en Afghanistan, en Irak, en Libye, en Syrie, dans la Baltique et ailleurs, partout où a été et se trouve engagée la machine de guerre USA/Otan.\\nUn ultime fait confirme ce qu’est le rapport USA-Italie : sont en train d’arriver à la base d’Amendola dans les Pouilles, probablement le 8 novembre, les deux premiers des 90 chasseurs F-35 de l’États-unienne Lockheed Martin, que l’Italie s’est engagée à acheter.\\nLe coût de la participation italienne au programme F-35, en tant que partenaire de second niveau, est officiellement quantifié dans la Loi de stabilité 2016 : 12 milliards 356 millions d’euros d’argent public, plus d’autres dépenses pour les modifications continues du chasseur qui n’est pas encore pleinement opérationnel et nécessitera des mises à jour continues. Malgré cela —confirme Analisi Difesa— l’Italie aura une « souveraineté limitée » sur les F-35 de sa propre aéronautique. Une loi états-unienne interdit que les « données de mission » (les software de gestion des systèmes de combat des chasseurs) soient communiqués à d’autres. Ce seront donc les USA qui contrôleront les F-35 italiens, prédisposés à l’utilisation des nouvelles bombes nucléaires B61-12 que le Pentagone basera contre la Russie, à la place des actuelles B-61, sur notre territoire « national ».\\nManlio Dinucci Traduction\\nMarie-Ange Patrizio\\nSource\\nIl Manifesto (Italie)'"}, "time": 1742628566.365142}