{"duration": 0.04709053039550781, "input_args": {"text": "'The Czech Republic is not prepared to accept any more than the 12 migrants it has already taken under the quota scheme set up by the European Union (EU) even if that means facing sanctions, the nation’s interior minister has said. [“Ongoing security checks show that the country can no longer accept anyone else” said Milan Chovanec, noting that the Czech Republic has so far received 12 of the 1, 600 migrants it has been ordered to take in under the terms of the EU quota deal.  Vetting   refugees is “complicated” the minister explained, adding that migrants “have not even been willing to remain in place [in Greek and Italian camps, while security checks take place”. “We check thoroughly and in detail during the process, which takes between several weeks and more than two months. “But these people [that the Czech Republic have been told to take in as refugees] were not prepared to remain in place while being vetted. Because of that, we haven’t given them security clearance. ” Confirming that the country “has no further plans to adopt more migrants” Mr Chovanec raised the issue of repeated threats from Brussels to punish states which are refusing to go along with the EU’s agenda to push migrants from the third world on unwilling countries. “The Czech Republic does not plan to adopt more migrants” he said, acknowledging that this stance is likely to result in Brussels imposing sanctions against the country, “perhaps in the range of several million Euros”. “It is then up to the government to assess if it’s worth paying the penalty or not. In my opinion  —   yes. You cannot let people here without running all the checks. ” The Czech minister’s position is likely to come as a blow to Brussels, as last week the EU told Hungary and Poland they face legal action if their populist governments continue to resist orders to take in migrants from the third world. Warsaw and Budapest have strongly opposed the scheme, which seeks to move 160, 000 people from Italy and Greece into other EU nations. Fewer than 20, 000 people have been resettled so far even though the programme is due to end in September this year. “If Member States do not increase their relocations soon, the Commission will not hesitate to make use of its powers   …     for those which have not complied,” the bloc’s executive arm said in a statement. Italy, along with Germany, Sweden, Austria, and France have been vocal in demanding the EU cut subsidies to Hungary and Poland for their refusal to welcome migrants. But Reuters reported that, worried about rising Euroskepticism, officials in Brussels are split on whether to open legal proceedings against Hungary and Poland.'"}, "time": 1742562879.39503}