{"duration": 0.08791446685791016, "input_args": {"text": "'UNITED NATIONS  —     hours after President Trump swatted away at a broad international consensus on how to achieve peace between Israelis and Palestinians, his United Nations envoy sought to assure the world on Thursday that his administration supports Palestinian statehood but wants a “thinking out of the box” approach. “We absolutely support a   solution,” the American ambassador, Nikki R. Haley, said in answer to a question after a United Nations Security Council meeting devoted to the   conflict. “But we are thinking out of the box as well, which is  —   what does it take to bring these two sides to the table, what do we need to have them agree on?” she said. She said nothing about what that approach would be, nor did she go any further in revealing a coherent picture of United States policy on the conflict, one of the most intractable in the world. The day before, Mr. Trump hinted at a new regional effort aimed at bringing the two sides together, but he said he would not insist on the creation of a Palestinian state. “I’m looking at   and ” he said. “I like the one that both parties like. ” Both Ms. Haley’s and Mr. Trump’s remarks were in sharp contrast with warnings from other diplomats, including the United Nations envoy entrusted to help the two sides find a path out of their long, bitter conflict. “The   solution remains the only way to achieve the legitimate national aspirations of both peoples,” the envoy, Nickolay E. Mladenov, told the Security Council earlier in the day. “Israel can take the necessary step to stop settlement expansion and construction in order to preserve this prospect, while the Palestinian leadership can demonstrate their commitment to tackling the challenges of violence and incitement on their side,” Mr. Mladenov said. Speaking in Egypt the day before, Mr. Mladenov’s boss, the United Nations secretary general, António Guterres, said, “There is no Plan B to the situation between Palestinians and Israelis but a   solution. ” The Swedish ambassador, Olof Skoog, told reporters on his way into the Security Council meeting on Thursday, “It’s very dangerous to move away from the   solution idea, especially before you have something viable as an alternative. ” France’s ambassador, François Delattre, said the risks were too high. “Should the prospect of a   solution disappear as a mirage in the desert, then that would be an open door to more extremism and more terrorism,” he said. Ms. Haley, who has been on the job for less than a month, used her remarks to the news media mostly to harshly criticize the United Nations as a whole for what she called its “  bias. ” Palestinians have accused the Trump administration of the opposite. The United States objected last Friday to the appointment of a former Palestinian prime minister, Salam Fayyad, as the secretary general’s envoy to Libya. The Palestinian ambassador, Riyad Mansour, said on Thursday that Mr. Fayyad had been rejected “simply because he was a Palestinian. ” Ms. Haley also suggested that it was unnecessary and counterproductive for the United Nations Security Council to hold monthly meetings on the   conflict  —   or in her words, “obsess over Israel. ” In fact, the Council has three meetings on Syria every month, one on Yemen as well as regular briefings on every United Nations mission, from Afghanistan to South Sudan, plus briefings on the impact of Security Council sanctions on countries such as North Korea and Iran.'"}, "time": 1742561732.856008}