{"duration": 0.08839273452758789, "input_args": {"text": "\"Politics Lessons of Syria: Russia to Form a 'Superlight' Brigade Equipped With 'Technicals' \\nRussian Ministry of Defense wants to take a UAZ pickup and strap on it a machine gun, a grenade launcher or anti-tank missiles and use them to conduct raids over open terrain Originally appeared at Russian Defense Policy \\nIzvestiya reports that Defense Minister Sergey Shoygu is organizing some “superlight” army brigades. It’s an interesting turn given that his widely discredited predecessor Anatoliy Serdyukov also looked at forming light motorized rifle brigades based on wheeled vehicles. Perhaps the latter’s mistake was that the vehicles weren’t necessarily Russian-made. \\nShoygu’s “superlight” brigades will use the UAZ Patriot — either the SUV or Pickup variant. The SUV is referred to as a jeep at times. An earlier model — the Hunter — actually resembles a jeep. uaz-hunter.jpg UAZ Hunter \\nThe intent, reportedly based on Syrian combat experience, is for these “superlight” motorized rifle brigades to slip around or through heavier enemy forces to conduct raids at distances of several hundred kilometers. \\nAccording to Izvestiya, the UAZ Patriot or Pickup is supposed to carry up to seven soldiers (a highly dubious proposition), their weapons and gear, as well as additional fuel, supplies, and ammo. It will be armed with either a 30-mm AGS-30 automatic grenade launcher or Kornet or Konkurs ATGMs, as well as a 12.7-mm Kord machine gun. The brigade’s mortar batteries are supposed to have 82-mm 2B14 Podnos mortars mounted on the UAZ vehicles. \\nAn MOD official familiar with the developments told Izvestiya the formation of the “superlight” brigades has begun, and they will appear “soon” in the Southern and Central MDs. They will have less personnel and equipment than traditional MRBs, but will be more mobile and maneuverable. The “superlight” brigades will also have one battalion in BTR-82s as well as artillery and MRL battalions. \\nIzvestiya got a comment from Vladislav Shurygin: \\n“These battalions are being developed from the experience of combat actions in Syria. In a day, the typical motorized rifle battalion equipped with armored personnel carriers or infantry fighting vehicles can complete a march of not more than100 km. But an MRB in the UAZ Patriot can go several hundred kilometers in a day. \\nMoreover, acting in small groups, motorized rifle platoons and companies in pickups can slip through enemy forces and deliver quick strikes. But these battalions are only effective in desert, steppe, and semidesert terrain. In forests and forest-steppe, automobile-mounted infantry loses out to infantry in BMPs and BTRs in combat capability.” \\nIzvestiya notes that, in 2009, Serdyukov put the 56th Independent Air-Assault Brigade in the UAZ Hunter, but the experiment was quickly abandoned. The MOD official says they were needed and worked well in the Volgograd steppe, but it was difficult to fit personnel and equipment in the Hunter. Soldiers, he said, sat cheek to cheek in very cramped conditions. That brigade returned to its venerable GAZ-66 trucks. \\nThe same problem is likely with the UAZ Patriot and Pickup. They look like four-seaters. \\nThis sounds like a sweet little deal for UAZ. It is part of the larger Sollers automobile manufacturing group, itself owned by Russian steel conglomerate Severstal. \\nIt’s odd there’s no photo of an UAZ Patriot or Pickup military prototype when the first “superlight” brigades are reportedly almost ready to appear. \\nAnd there is also potential competition. The Military-Industrial Company (VPK) has its Tigr light armored vehicle with a 30-mm gun or Kornet or Konkurs ATGM launchers mounted. The Tigr, however, is a larger, heavier, and much more expensive vehicle. \\nGAZ might make something comparable to the Patriot or Pickup. GAZ already makes the BTR-82. Like VPK, GAZ is owned ultimately by Oleg Deripaska. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire\""}, "time": 1742564464.5476086}