{"duration": 0.10929417610168457, "input_args": {"text": "\"Here is what eight years of President Obama’s “post-racial” reign have wrought.\\nThe weekend before Election Day, Hillary Clinton grinned from ear to ear at a Cleveland rally while reciting a verse from Jay-Z’s remix of Young Jeezy’s “My President is Black.” As the rapper and his Black Lives Matter-promoting wife, Beyonce, beamed on stage nearby, pandersuit-clad Clinton twanged with a stilted accent:\\n“Remember, Jay memorably said: ‘Rosa Parks sat so Martin Luther could walk, and Martin Luther walked so Barack Obama could run, and Barack Obama ran so all the children could fly.'”\\nThis would be comical if not for the noxious cynicism of it all. Clinton may not remember (if she was ever aware in the first place), but the original version of “My President is Black” is a brazen middle finger to nonblack America. Just a few lines after the verse Hillary quoted, the song taunts:\\nHello Miss America, hey pretty lady\\nRed, white, and blue flag, wave for me baby\\nNever thought I’d say this s—, baby I’m good\\nYou can keep your p—, I don’t want no more Bush\\nNo more war, no more Iraq\\nNo more white lies, the President is black\\nSo the poster granny for liberal white privilege, groveling for black votes, kissed the rings of celebrity Obama BFFs Jay-Z and Beyonce by parroting an inflammatory anthem laced with profanities and radical racialized gloating.\\nCould there have been a more perfect beclownment to cap Clinton’s phony-baloney “Stronger Together” campaign?\\nAfter denigrating millions of Trump supporters as “deplorable” and “irredeemable” earlier this year, Clinton then unctuously confessed on election eve: “I regret deeply how angry the tone of the campaign became.”\\nNote the classic textbook employment of the passive voice to evade personal responsibility.\\nThe good news is that after being blasted as haters by Clinton’s hate-filled minions, after being slapped down as racial “cowards” by Clintonite holdover Eric Holder, after being lambasted as “xenophobes” and “nativists” by immigration expansionists in both parties, after enduring a string of faked hate crimes blamed on conservatives, after ceaseless accusations of “Islamophobia” in the wake of jihad attacks on American soil, after baseless accusations of “homophobia” for protesting the government’s gay wedding cake coercion, and after mourning a growing list of police officers ambushed and targeted by violent thugs seeking racial vengeance, an undeniable movement of citizens in the 2016 election cycle decided to push back.\\nWhen all is said and done, one of the most important cultural accomplishments of Donald Trump’s bid will be the platform he created for Americans of all colors, ethnicities, political affiliations, and socioeconomic backgrounds to defy soul-draining identity politics.\\nBeltway chin-pullers expediently focused on Trump’s white and conservative supporters who are rightly sick and tired of social justice double standards. But they ignored the increasingly vocal constituency of hyphen-free, label-rejecting American People Against Political Correctness who don’t fit old narratives and boxes.\\nAnd the same “Never Trump” pundits and establishment political strategists who gabbed endlessly about the need for “minority outreach” after 2012 were flummoxed by the blacks, gays, Latinos, women and Democrats who rallied behind the GOP candidate.\\nThe most important speech of the 2016 election cycle wasn’t delivered by one of the presidential candidates. It came from iconoclastic Silicon Valley entrepreneur/investor and Trump supporter Peter Thiel who best explained the historically significant backlash against the intolerant tolerance mob and phony diversity-mongers.\\n“Louder voices have sent a message that they do not intend to tolerate the views of one half of the country,” he observed at the National Press Club last week. He recounted how the gay magazine The Advocate, which had once praised him as a “gay innovator,” declared he was “not a gay man” anymore because of his libertarian, limited-government politics.\\n“The lie behind the buzzword of diversity could not be made more clear,” Thiel noted. “If you don’t conform, then you don’t count as diverse, no matter what your personal background.”\\nTrump’s eclectic coalition was bound by that common thread: disaffected individuals tired of being told they don’t count and discounted because their views do not properly “match” their gender, chromosomes, skin color or ethnicity. That is exactly why the more they and their nominee were demonized, the stronger their support grew.\\n“No matter what happens in this election,” Thiel concluded last week, “what Trump represents isn’t crazy and it’s not going away.” \\nHe’s right. I too often take for granted my own personal awakening about the entrenched tribalism of identity politics at a crazy liberal arts college in the early 1990s. The liberation from collectivist ideology is profound and lasting. Witnessing so many outspoken newcomers arrive at this enlightenment, however circuitous the route, has been the most encouraging and underappreciated phenomenon of the 2016 campaign.\\nMichelle Malkin is a senior editor at Conservative Review. For more articles and videos from Michelle, visit ConservativeReview.com. Her email address is malkinblog@gmail.com.\\nCOPYRIGHT 2016 CREATORS.COM\\n\""}, "time": 1742562203.9736683}