{"duration": 0.06983137130737305, "input_args": {"text": "'  \\nLast week marked the fifteenth anniversary of the US invasion of Afghanistan, the longest war in US history. There weren’t any victory parades or photo-ops with Afghanistan’s post-liberation leaders. That is because the war is ongoing. In fact, 15 years after launching a war against Afghanistan’s Taliban government in retaliation for an attack by Saudi-backed al-Qaeda, the US-backed forces are steadily losing territory back to the Taliban. \\nWhat President Obama called “the good war” before took office in 2008, has become the “forgotten war” some eight years later. How many Americans know that we still have nearly 10,000 US troops in Afghanistan? Do any Americans know that the Taliban was never defeated, but now holds more ground in Afghanistan than at any point since 2001? Do they know the Taliban overran the provincial capital of Kunduz last week for a second time in a year and they threaten several other provincial capitals? \\nDo Americans know that we are still wasting billions on “reconstruction” and other projects in Afghanistan that are, at best, boondoggles? According to a recent audit by the independent US government body overseeing Afghan reconstruction, half a billion dollars was wasted on a contract for a US company to maintain Afghan military vehicles. The contractor “fail[ed] to meet program objectives,” the audit found. Of course they still got paid, like thousands of others getting rich off of this failed war. \\nDo Americans know that their government has spent at least $60 billion to train and equip Afghan security forces, yet these forces are still not capable of fighting on their own against the Taliban? We recently learned that an unknown but not insignificant number of those troops brought to the US for training have deserted and are living illegally somewhere in the US. In the recent Taliban attack on Kunduz, it was reported that thousands of Afghan security personnel fled without firing a shot. \\nAccording to a recent study by Brown University, the direct costs of the Iraq and Afghanistan wars thus far are nearly five trillion dollars. The indirect costs are virtually incalculable. \\nPerhaps Afghanistan is the “forgotten war” because to mention it would reveal how schizophrenic is US foreign policy. After all, we have been fighting for 15 years in Afghanistan in the name of defeating al-Qaeda, while we are directly and indirectly assisting a franchise of al-Qaeda to overthrow the Syrian government. How many Americans would applaud such a foreign policy? If they only knew, but thanks to a media only interested in promoting Washington’s propaganda, far too many Americans don’t know. \\nI have written several of these columns on the various anniversaries of the Afghan (and Iraq) wars, pointing out that the wars are ongoing and that the result of the wars has been less stable countries, a less stable region, a devastated local population, and an increasing probability of more blowback. I would be very happy to never have to write one of these again. We should just march home.'"}, "time": 1742563782.8787575}