{"duration": 0.13228154182434082, "input_args": {"text": "'The return of Phil Collins has been extraordinarily slow. That’s on purpose. After decades as the drummer and   Gabriel lead singer for Genesis, as well as a commercially dominant solo run as the poster boy for pillowy ’80s pop excess, Mr. Collins retired as a    rock elder in 2011. As with most musician goodbyes, the dormant period didn’t last. (Presciently, Mr. Collins had called his tour in support of the 2002 album “Testify,” his most recent release of original material, the “First Farewell Tour. ”) Since announcing his resurgence last year, Mr. Collins, 65, has performed at a handful of charity events, in addition to starting the process of reissuing eight of his solo albums. On Aug. 29, he will be the musical guest at the opening ceremony for the United States Open tennis tournament in Flushing, Queens  —   the biggest stage he’s graced in some time Leslie Odom Jr. the   “Hamilton” alum, is scheduled to join Mr. Collins in a duet. The gig serves as a   of sorts for a busy fall: In October, a   collection, “The Singles” (including seven American No. 1s) is due out alongside Mr. Collins’s memoir, “Not Dead Yet. ” “It’s like a cartoon character that’s being pulled along with his feet dug in,” Mr. Collins said of his comeback, though he’s often doing both the dragging and the digging in. Over the phone from his home in Miami, he discussed his hesitancy, fueled by both health issues and fatherhood, and how making himself scarce has improved his legacy. These are edited excerpts from the conversation. How is   treating you? Well, you know, whatever I am doing, I’m doing slowly. I’m just being a little tentative. It’s very dangerous, as my oldest daughter, Joely, told me, to stop doing what you’ve done all your life. I joined Genesis when I was 19. I was drumming from the age of 5. You’re taking away something that makes you tick. When she said that a few years ago, when I first retired, that stayed with me. Then you get out there [to perform] and people like what you do, and you think, “I can do more of this. ” What’s your daily routine like now? I do very little. To be honest, even this week, I’ve still been working on this memoir. Otherwise, it’s just really family stuff. When I first moved [to Miami] I couldn’t wait to be back with my kids. I was taking them to school, getting up at 6:30, picking them up later. The day revolved around that. But I had back surgery last year, which was necessary because my back was [expletive] after all the years playing drums. The surgery left me with a numb right foot  —   they call it drop foot. You have no motor down there. The nerves regenerate over a period of a year and a half or two years. It’s been nine months. I can’t go out and play football with my youngest, and I can’t drive. So that’s kind of limiting. How often are you playing music? Very little, actually. [My son] Nick, who’s 15 now, I listen to him play, I watch his band. I’ve got a grand piano here, and sometimes Nick will say, “How do you play this, Dad?” But without going into the war wounds, my left hand had some neural thing happen to it, which stopped me from playing the drums. That kind of has restricted [piano] as well. I’ve got a little studio here, and at some point, I will turn it on and start fooling around. That day is getting closer. I think about it a lot  —   I’ve got a lot of lyrical ideas  —   but I keep putting it off. What do you make of the critical   of your work in the last few years? I think it’s fantastic. I think, with some critics, I became synonymous with an era of music that they didn’t like, and they were suspicious of all success, which is understandable. You end up painted into a corner that it’s impossible to get out of. I don’t lie awake and think about this, but I withdrew in 2005, and I think I was quite honest about why: I wanted to write myself out of the script. When the reissued albums came out  —   which I was reluctant to do at first, until I found some way I could be proud of it  —   I thought, “This is exactly what I’d hoped for. ” Of course, records sell differently now than when I was making them, so it wasn’t a question of cashing in. It was giving people a chance to   this person that had become a whipping boy for the ’80s. I was so pleased that people were able to say, “I   at this, and it’s better than I thought. ” Is there a part of you that wants to get involved with this new generation, à la Paul McCartney with Kanye West, or Nile Rodgers with Daft Punk? It’s not that I haven’t had the offers. It’s just I’m trying my best not to get busy. Doing the book was an  . I have not really realized just how incessantly I was out there. From tour to tour to tour, one record, one collaboration after the other. It was an incredibly dense 25 years. What gets you out of the house for something like the United States Open? Is it the paycheck? I don’t even know if I’m getting paid for it. I don’t, seriously. If I am, I don’t know what it is. I think my manager put it to me that he’d been asked, assuming I’d say no, and I said, “Actually, why not?” It’s not a big ask. It’s just a couple of songs at the opening of something that I would probably be watching anyway. You’ve said your memoir will be embarrassingly honest. What were some of the harder things to include? With three marriages, you know, and what happened   …     I stress it’s not a   book. I’m not blaming anybody. I was just working so much, and stuff got in the way. There’s a chapter in it about the drinking, which escalated when my third marriage broke up, and I retired. I was left with this huge void. I didn’t want to work because I wanted to be with the kids, but the kids weren’t there anymore, because they moved to Miami, and I was still in Switzerland. You start drinking, and then you start drinking too much. Then it physically hurts you. I came very close to dying at that point. I’m being honest about that. The book is honest, it’s  . I’m not shirking my responsibilities. I apologize when I need to.'"}, "time": 1742563338.397632}