{"duration": 0.017932653427124023, "input_args": {"text": "'BREAKING : MASSIVE CORRUPTION AS OBAMA BLOCKS FBI FROM INVESTIGATING NEW EMAILS BREAKING : MASSIVE CORRUPTION AS OBAMA BLOCKS FBI FROM INVESTIGATING NEW EMAILS Breaking News By Amy Moreno October 30, 2016 \\nObama and his DOJ are actively BLOCKING the FBI’s attempts to investigate the thousands of new emails they discovered on Huma and Weiner’s desktop computer. \\nThey are SUPPRESSING information to help Hillary win the election. Obama’s DOJ is REFUSING to access a warrant that would allow FBI officials to read any of the newly discovered Abedin emails. They are still in the dark about whether they include any classified material that the bureau has not already seen. \\nFrom Liberty Writers : “WE DO NOT HAVE A WARRANT,” A SENIOR LAW ENFORCEMENT OFFICIAL SAID. “DISCUSSIONS ARE UNDER WAY [BETWEEN THE FBI AND THE JUSTICE DEPARTMENT] AS TO THE BEST WAY TO MOVE FORWARD.” Obama’s Justice Dept. is stonewalling Comey’s entire FBI investigation because they know the findings will put an end to Hilllary Clinton’s political career. Comey already upset Loretta Lynch and the DOJ by reopening the investigation in the first place. Top Justice Department officials “strongly discouraged” Comey from continuing the investigation because of the election. A U.S official familiar with the matter said “ He was acting independently of the guidance given to him.” Comey insisted in his message to agents that he felt he had an obligation to inform Congress about the new material and it would be “misleading to the American people were we not to supplement the record.” This new attempt to block the investigation seems like a way to punish Comey for putting the American people before politics. We the people have a RIGHT to see those emails! The American people are at WAR with their government right now. KEEP FIGHTING! This is a movement – we are the political OUTSIDERS fighting against the FAILED GLOBAL ESTABLISHMENT! Join the resistance and help us fight to put America First! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742628443.69936}