{"duration": 0.008681058883666992, "input_args": {"text": "'A new study finds that 88 percent of coverage of President Donald Trump and his administration is negative. [The study by the Media Research Center (MRC) found that the evening newscasts on the “Big Three” TV networks, ABC, CBS, and NBC, were overwhelmingly hostile to Trump.  In its study, the MRC found that over the president’s first 30 days in office, the networks dedicated 16 hours of coverage to President Trump, 54 percent of its total news coverage. MRC found up to 674 negative statements aimed at Trump while only a tiny 88 statements were deemed positive. “Our measure of media tone excludes soundbites from identified partisans, focusing instead on tallying the evaluative statements made by reporters and the   talking heads (experts and average citizens) included in their stories,” MRC noted. “In their coverage of Trump’s first month, the networks crowded their stories with quotes from citizens angry about many of his policies, while providing relatively little airtime to Trump supporters. The MRC also noted that “anchors and reporters often injected their own   editorial tone into the coverage. ” The study also noted that the president’s call for a temporary moratorium on travel from seven   nations drew the most negative coverage. Other negative coverage centered on Trump’s border policies, his economic plans, the battle over his cabinet picks, as well as Trump’s “complicated relationship” with Russia. “Further highlighting the hostile tone of these newscasts, nearly an hour of coverage (56 minutes) was given over to   protests on various topics, with nearly   (82 out of 442) of the Trump stories or briefs aired during these 30 days including at least some discussion of an   protest,” the MRC concluded. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628553.858326}