{"duration": 0.07781028747558594, "input_args": {"text": "'Print Email http://humansarefree.com/2016/11/actress-roseanne-barr-mk-ultra-rules-in.html For those of you that don’t know, Roseanne Barr is a well known actress, comedian, writer, television producer and director. She has won several awards which include Emmy awards, Golden Globe awards, People’s Choice awards and more. She has been in the industry for over twenty years and has gained much respect from many of her Hollywood colleagues who she is now speaking on behalf of. I just want to make it clear how long she has been inside the industry, and the connections she has to others within it. Industry insiders are feeling the need to share inspirational words and food for thought to the millions of people that pay attention to them as of late.We saw this recently with Ashton Kutcher . Celebrities have a voice that can reach a large sum of people, they can be a threat to corporate interests and the controlling elite and as Roseanne states, many celebrities bite their tongue and live in a culture of fear. Not long ago, Roseanne made some shocking statements, alluding that Hollywood and the entertainment industry is dominated by MK Ultra . MK Ultra was the name for a previously classified research program through the CIA’s scientific intelligence division. It was the CIA’s program of research in behavioral modification and perception manipulation of human beings (1) . It was previously known as Operation Paperclip (2) . Roseanne is suggesting that Hollywood is a tool used in the manipulation of human consciousness, used as a tool for behavior modification and perception control in human beings. \"Hollywood is the one that keeps all of this power structure. They perpetuate the culture of racism, sexism, classism, genderism and keep it all in place. \"They continue to feed it, and they make a lot of money doing it. They do it at the behest of their masters, who run everything. \"I speak on behalf of Hollywood. I go to parties, Oscar parties and things like that and big stars pull me aside, take my arm and whisper: “I just want to thank you for the things you say.” And it blows my mind, but that’s the culture, it’s a culture of fear. \"It’s a big culture of mind control, MK Ultra rules in Hollywood.\" The CIA and Hollywood It’s funny that ancient Druid ‘wizards’ and ‘magicians’ used to make their wands specific for casting spells from the Holly Wood tree. Maybe “Hollywood” is used to cast spells on the masses , because at the very least it can sure seem that way. Everything we do is so systematic, so robotic in nature. We go to school, get a job, have a family and chase materialistic gains only to find out that it is not what our soul truly desires. We are told what to wear, what’s popular, what to buy, what truth is and how life is through television. It keeps us occupied, ignorant and blind to what is really happening on our planet. Everything is Fake: Top 40 Pieces of Fakery in Our World Roseanne’s public remark that the CIA’s MK Ultra program rules in Hollywood is an educated statement, and not just an opinion. It comes from her own experiences within the industry as well as an awareness of known facts about the CIA and their involvement in Hollywood -all of which also happen to be available to the public. It’s not hard to see how television and mass advertising can be used as mind control, basically shaping the perception of the individual, as well as displaying what each individual should “be” like, what type of life to chase and what it means to be successful. Given Roseanne’s statement, as well as the information we already have in the public domain, it’s safe to say that something fishy is going on in Hollywood. Ask yourself, are your wants really yours? Or have they been programmed into you since birth? Not many people know this, but the CIA has an entire department dedicated to the entertainment industry . It’s run through the CIA’s Entertainment Industry Liaison Office (3) , which collaborates in a strictly advisory capacity with filmmakers. The CIA doesn’t just offer guidance to filmmakers, it even offers money. In 1950, the agency bought the rights to George Orwell’s Animal Farm , and then funded the 1954 British animated version of the film. Its involvement had long been rumored, but only in the past decade have those rumors been substantiated. The link between Hollywood and the CIA isn’t something new, and Roseanne isn’t just blurting out information that has no backing behind it. The CIA also had a project called Mockingbird , in which the CIA infiltrated mass media outlets in order to sway public opinion. After leaving The Washington Post in 1977, Carl Bernstein spent six months looking at the relationship of the CIA and the press during the Cold War years. His 25,000 word cover story that was published in Rolling Stone in the late 70’s can be read here . With this article I wanted to present a small amount of information to give you, the readers, some background on these programs within the department of defense. Making the connection between these programs and Hollywood isn’t hard. Using Hollywood as a mind control hub can easily be labelled as a conspiracy to many, but I believe that labeling can only come about when one fails to actually look into it. Hopefully this tidbit of information provides some backing for Roseanne’s claims, along with her experience within the industry. If you want to look more into the CIA’s influence in Hollywood, MK Ultra and Project Mockingbird are a good place to start. Brave souls like Roseanne speaking out is simply helping the masses shed light on these long-existent programs. Individuals within the entertainment industry are simply used as tools for mind control. We are programmed to worship them, praise them and be like them. These “stars” are used as puppets to serve a greater agenda . Let’s not forget that Hollywood (entertainment industry) is owned (shareholders) by the same corporations and financial institutions that own the energy, health and food industry. Institutions like Fidelity Investments, the Vanguard group and the State Street Corporation. They own Disney and the major corporations that govern Hollywood, they also own Big Oil , Big Food and Big Pharma ! (4) , (5) , (6) . The connections are endless, and if you do the research, it’s not hard to see. Nothing is really hidden, it’s not a conspiracy. It’s good to see the world waking up everyday. We are recognizing that peace between all is what really makes the most sense. Peace and love is the necessary core to re-creating our reality, awakening to the truth about our planet and who we give our power away to on a daily basis is a step for some people to arrive at a greater conclusion. The truth is, we are required to sustain the current system, therefore we can choose to change it at anytime. Reference: http://www.collective-evolution.com  '"}, "time": 1742628409.8246267}