{"duration": 0.13445281982421875, "input_args": {"text": "'“Maybe I should run for president,” Denzel Washington joked, sitting down to a late breakfast in Midtown Manhattan last week, before immediately issuing a retraction. He had arrived in the States a few hours earlier from London, where he had been promoting his   movie “Fences,” and also talking about what everyone was talking about: the politics of the day. Mr. Washington told the Bagger he understood the surge of anger that had fueled Brexit and President Trump’s ascendence, and now he wanted to talk solutions. But first, he wanted grapefruit juice and eggs. He had squeezed in a few hours of   and ambled into the Park Hyatt’s restaurant looking a little rumpled still. After settling in, he also discovered two holes in his big woolly gray sweater. As commanding a presence as his onscreen personas suggest, Mr. Washington, who is 62, also carries a hint of the   professor. This is the same fellow, after all, who showed up to accept a lifetime achievement award at last year’s Golden Globes having forgotten both his speech and his glasses. But Hollywood adores Mr. Washington, who, armed with charisma and that killer smile, effortlessly charmed the Globes crowd anyway. Promoting his movie, Mr. Washington has been pushing to elevate awareness of August Wilson, the Pulitzer   playwright who wrote “Fences” and adapted it for film. Mr. Washington also has strong opinions on the political turmoil that, invariably, has come to dominate the awards season. Mr. Trump’s presidency was a result of people’s frustrations, Mr. Washington said, but the focus now has to be on finding people work and bridging the bitter national divide. “We can’t just say, ‘We’re right, you’re wrong.’ You can be angry the next four years, and so what?” Mr. Washington said. “Don’t confuse movement with progress. It can lead to progress it’s a vital part of progress. But it still has to be, ‘What are we going to do about it? ’” Mr. Washington certainly has the platform to speak out. In January, he received his seventh Oscar nomination for acting, further cementing a Hollywood royalty status that needed no help. The latest nomination, for his lead turn in “Fences,” was roundly expected, as were the movie’s other nominations, for best film (Mr. Washington was a producer) best adapted screenplay and best supporting actress, for Viola Davis, who is considered a lock to win. But Mr. Washington’s peers delivered a whopping surprise last month at the Screen Actors Guild Awards, which usually foretell Oscar winners. Throughout the season, Casey Affleck has been scooping up best actor prizes for his performance in “Manchester by the Sea,” and he was predicted to collect the guild’s trophy, too. Instead, it went to Mr. Washington, who took the stage wagging his head in disbelief, before deploying a winning strategy  —   disarm them, then own them. “I’m a   man, I’m supposed to have faith but I didn’t have faith,” he noted onstage. “I said, ‘Well, you know that young boy’s going to win, Denzel, you ain’t gonna win.’ So I didn’t even prepare. ” Then, he listed America’s most famous playwrights, making clear who he believes merit inclusion in the pantheon. “Tennessee Williams, Arthur Miller, Eugene O’Neill, Edward Albee, August Wilson,” he said. Set in the 1950s, “Fences” centers on Troy Maxson (Mr. Washington) a     baseball great and garbage collector, and his homemaker wife, Rose, played by Ms. Davis. Onscreen, Mr. Washington and Ms. Davis share a rich, affectionate familiarity, for good reason: They starred in the play’s 2010 revival, a Broadway smash that landed each of them a Tony Award. “Fences” is the sixth of Mr. Wilson’s   “Pittsburgh Cycle,” which explores   lives in each decade of the 20th century. Mr. Washington is working on bringing the remaining nine plays to the screen, for HBO, a plan no doubt helped by the success of “Fences”: It has earned $54 million domestically so far. After meeting the Bagger, he was off to see Ruben   the actor, director and playwright, who had written a first pass at a script for one play in the cycle, “Ma Rainey’s Black Bottom. ” “As a custodian of August Wilson’s estate, in terms of his plays, it’s important for me to promote ‘Fences’ to the hilt,” Mr. Washington said. (He is producing the plays in collaboration with the  estate.) “Not for me to win an award, but for it to be as successful on every level so that we can make the rest of them, you know? No business, no show. ” Getting “Fences” to the screen was a   ordeal. It was optioned in the late ’80s but was delayed partly because Mr. Wilson insisted on having an   director. Mr. Wilson died of cancer in 2005, at 60, and four years later, the powerhouse producer Scott Rudin, who had by then acquired the film rights, sent the screenplay to Mr. Washington, wanting him to star in and direct it. Mr. Washington replied that he wanted to perform it onstage first, so Mr. Rudin made it happen. “I think Denzel is by a mile the greatest living American actor,” Mr. Rudin wrote in an email, and added, “There is no movie of ‘Fences’ without him  —   just as there was no way to present it onstage without him. ” Throughout the run, audiences routinely made clear their intense connection with Mr. Washington, hissing at him when his character’s infallibilities were made plain: “Denzel, how could you?” It would take nearly five more years for Mr. Washington to feel ready to tackle the film. Four of the five main actors had appeared onstage with him, too  —   “We’re a tight band, we know the music,” he said  —   including Ms. Davis, a given. “This is where the actor meets the role,” he said. “I hope she has other great roles. But this is the role. ” (The Bagger asked about Ms. Davis’s rawest scene, where, as she weeps, thick snot runs from her nose. Mr. Washington said he had thought about digitally removing it but concluded that Wilson showed ordinary people, warts and all. “Why clean it up?” he asked.) Did he share Mr. Wilson’s belief that the film could have had only a black director? “You have to be able to understand the culture,” he replied. “Scorsese could have directed ‘Schindler’s List,’ but there’s a cultural difference. This is rooted specifically in   culture. ” Had the film come out a year earlier, it would have possibly reshaped Oscars history. Last year, controversy erupted again after all of the nominated actors ended up being, for the second year in a row, white. Yet Mr. Washington said, fervently, that the success of “Fences,” “Hidden Figures” and “Moonlight,” which also have Oscar nominations and black stars, cannot be viewed as, or reduced to, correctives to #OscarsSoWhite. “They call Wilson the American Shakespeare,” he said. “He’s not fulfilling any quota. ” And as important as it is for people to speak up, Mr. Washington said, it’s just as important for black artists to keep striving for that breakthrough. “You’ve got to keep plugging you’ve got to keep working at it, you’ve got to keep writing,” he said. “There’s an old saying: ‘If it ain’t on the page, it ain’t on the stage. ’”'"}, "time": 1742562589.8978221}