{"duration": 0.027712106704711914, "input_args": {"text": "'This post was originally published on this site \\nA new museum dedicated to the writer Mikhail Bulgakov soon will open at 35a Bolshaya Pirogovskaya Street in Moscow, near the Sportivnaya and Frunzenskaya metro stations. The decision to use the apartment as a museum was made in December 2015, and a small exhibition was held in the space in May. \\n“Small and very intimate, [the exhibition] was only put on for 10 days. We brought a first edition of The Master and Margarita and a few important bits of paraphernalia. It was an announcement of the future of this space as a museum,” Peter Mansilla-Cruz, the director of the museum, told RBTH. \\nBulgakov lived in this apartment in the 1920s and 1930s and it is where he wrote his best-known work, The Master and Margarita . The novel recently was part of Google’s online reading project. \\n“The house where Bulgakov lived and worked is a memorial to our cultural heritage,” said Mansilla-Cruz, “behind its façade is a 19 th century mansion, which was rebuilt and reconstructed from top to bottom in the Soviet period. The apartment was occupied by yard and district services, and by lifters at the Housing Department, so it is suitably well-worn. It has been redesigned inside – the arch which led into his famous office has been re-laid with brick.” \\nBulgakov described the apartment in another of his works, Heart of a Dog . \\nFrom the exhibition “Manuscripts don’t burn” at Bolshaya Pirogovkaya St., 35A. Source: Moskva Agency \\nThe development of the museum’s concept and the restoration will continue into 2017, but Mansilla-Cruz says that the place will become a memorial space furnished with Bulgakov’s desk and other artifacts. “Luckily, many of his photos from that time have been preserved, so all the details can be restored.” \\nMoscow is already home to the State Bulgakov Museum. It is located near metro Mayakovskaya at 10 Bolshaya Sadovaya Street, the address at which Woland (Satan) and his entourage lived in The Master and Margarita . The museum organizes tours around Moscow featuring sites connected to Bulgakov. Related '"}, "time": 1742564100.4991355}