{"duration": 0.06309247016906738, "input_args": {"text": "'in: War Propaganda , World News (image credit: ALEXEY DRUZHININ / RIA NOVOSTI / Kremlin pool / AFP) In September 2015, at the behest of its legitimate government, Russia began aerial operations to combat ISIS and al-Nusra terrorists in Syria. Numerous other likeminded groups are involved, just as cutthroat, just as ruthless, just as extremist, masquerading as “moderate rebels” when none exist – supported by Washington, NATO , Saudi Arabia, Qatar, other Gulf States, Jordan, Israel and Turkey. They’re massacring civilians, killing government soldiers defending them, using chemical and other banned weapons, committing gruesome atrocities. Why does it pretend “moderate” fighters are involved when none exist? Why does it insist on separating nonexistent “moderates” from terrorist groups it’s combating when all anti-government forces are the same? Why isn’t it targeting all armed groups wanting Assad toppled and Syrian sovereign independence destroyed? It’s the only way to free the country from the scourge its facing – supported by Washington and its rogue allies, NATO and regional ones. Why did it halt its aerial operations to liberate eastern Aleppo, declaring a unilateral ceasefire, a so-called humanitarian pause – a major blunder, accomplishing nothing? Ongoing since October 18, it’s letting US-supported terrorists infesting the city replenish their ranks, regroup and mobilize for heavy attacks, largely harming civilians Moscow says it wants protected. Last Saturday evening, Russia ended its humanitarian pause because US-supported terrorists in eastern Aleppo prevent civilians from leaving, holding thousands hostage as human shields, including the sick and wounded. Yet it ceased aerial attacks, yielding the advantage to dark forces it’s sworn to eliminate. What kind of strategy gives them the upper hand? It gets worse. On October 26, Russian Defense Ministry spokesman General Igor Konashenkov issued the following statement: “The Russian Aerospace Forces and the Syrian Air Force have been sticking to a moratorium on air strikes for the past eight days. They are staying out of a 10-km (six-mile) zone around Aleppo.” “Six humanitarian corridors, field kitchens and first aid stations are open for civilians leaving eastern Aleppo 24 hours a day.” “Russia and the Syrian government are ready to resume ‘humanitarian pauses’ in Aleppo if they receive guarantees from international organizations confirming readiness to evacuate the sick and the wounded as well as civilian population from the rebel-held areas.” Fact: Maintaining an airstrike moratorium aids Washington, its rogue allies and terrorists in eastern Aleppo they support. Fact: What good are humanitarian corridors if eastern Aleppo residents are prevented from using them, risking death or serious injury if they try. Fact: International organizations have no control over terrorists in eastern Aleppo – or anywhere else in the country. So what good are their “guarantees” if made? Fact: As long as Russia continues making the same mistakes repeatedly, the struggle to liberate Syria will likely go on interminably without resolution – a forever war, while countless thousands more civilians will die, be seriously injured and endure hardships people in Western societies can’t imagine, victims of US imperial ruthlessness. A handful of eastern Aleppo civilians alone escaped via a humanitarian corridor. According to one now free, their relatives were seized, imprisoned and tortured. The only way to liberate thousands of others is by relentlessly smashing their terrorist captors, eliminating them – not giving them breathing room to mobilize for greater attacks. Washington is delighted with Moscow’s ceasefire and humanitarian pause, serving US imperial interests, State Department spokesman admiral John Kirby saying: “We welcome the stated intention to extend this pause, and we hope that this extension will be more successful…than it has been thus far” – meaning the longer it continues, the greater the benefit to US-led dark forces, the worse off trapped Syrians in eastern Aleppo will be, the longer the struggle to liberate Syria will go on. Submit your review'"}, "time": 1742562179.5886853}