{"duration": 0.15997862815856934, "input_args": {"text": "'De Kennedy a Obama, más de medio siglo de debates en EEUU (vídeos) Sin embargo, posteriormente se descubrió que 91.000 eran completamente inocentes. También la Secretaría de Florida informó posteriormente que entre los electores del Estado había 59.019 encarcelados, 17.000 fallecidos y 27.000 personas que habían votado más de una vez. Ya era tarde, pues George W. Bush superó al candidato demócrata Al Gore por 537 votos que dieron la victoria final al Partido Republicano. El fraude había sido consumado. Tampoco todo había sido limpio en las elecciones presidenciales de Barack Obama en 2008, según los observadores republicanos y la investigación realizada por la CNN. Resulta que el candidato Obama recibió el apoyo de la Community Organization for Reform Now (ACORN), que funciona en 100 ciudades en EEUU y tiene unos 500.000 miembros dedicados al apoyo a los más necesitados. Los investigadores llegaron a la conclusión que ACORN registró a miles de personas para que votasen por Obama, muchos de cuales estaban muertos, no existían o tenían una dirección falsa. ✒Opinión: La guerra sucia en las elecciones norteamericanas – lee más en: https://t.co/tpPtlp6V8O pic.twitter.com/pA834GOc1P — Sputnik Mundo (@SputnikMundo) 19 de octubre de 2016 \\n\\u200bEl \\'think tank\\' Pew Research Center, con sede en Washington, encontró también irregularidades en las elecciones en el 2012, en las cuales fue elegido Barack Obama. Resultó que cada octavo votante registrado no podía emitir su voto. En aquel entonces, más de 1,5 millones de votantes muertos \\'depositaron\\' su voto y unos 2,75 millones de habitantes participaron dos veces en la votación. Tomando en cuenta todos estos antecedentes históricos, no son nada extrañas o exageradas las sospechas del actual candidato republicano Donald Trump de que las elecciones del próximo 8 de noviembre puedan ser fraudulentas, especialmente en Chicago, Filadelfia o Saint Louis. También Trump está sospechando que los 51 millones de ciudadanos norteamericanos no registrados (24% de los potenciales votantes) podrían ser utilizados para el robo de votos. © REUTERS/ Dave Kaup El sistema quiere imponer a Hillary en la Presidencia Recientemente la organización Project Veritas Action, cuya misión es \"investigar y exponer la corrupción, deshonestidad, fraudes\", dirigida por el activista conservador James E. O\\'Keefe III, lanzó el tercer vídeo sobre el fraude electoral confirmando la participación de Hillary Clinton. En el primer vídeo, se muestra cómo los organizadores de la campaña de Clinton están usando la violencia para desacreditar los mítines y reuniones de los partidarios de Trump. En el segundo vídeo, se expone paso por paso la estrategia del Partido Demócrata para lograr el fraude electoral a favor de Hillary que en general habían usado los demócratas durante los últimos 50 años. Finalmente, en el tercer documento filmado se presentan las comunicaciones electrónicas entre Clinton, la Convención Nacional Demócrata y la ONG American Unites for Change para organizar eventos políticos desacreditando a Trump.\\nTambién la táctica de ensuciar al candidato rival no es nada nueva para los demócratas. La penúltima vez la usaron contra Mitt Romney en 2012, cuando los medios globalizados lo presentaron como un \\'racista diabólico\\', un \\'sexista brutal\\' que quiere que las mujeres retornen a la sumisión de los años 50, \\'viejo homofóbico\\' etc. Entonces los actuales insultos a Trump, como \\'estúpido\\', \\'ignorante\\', \\'racista\\', \\'sexista\\' o \\'delincuente sexual\\', \\'vicioso\\' es parte del juego electoral incorporado por los medios de comunicación globalizados y corporativos para la promoción del candidato seleccionado por el Sistema o el establishment y la destrucción de su contrincante, que no satisface en este momento las necesidades y las aspiraciones de aquel 1% de los dueños de América. © REUTERS/ Brian Snyder Donald Trump, el bufón útil del Sistema Norteamericano De allí surge el dilema. Ambos candidatos, tanto Hillary como Donald han sido lanzados al ruedo electoral por el sistema con el propósito inicial de utilizar a Trump para facilitar la victoria de Clinton. Sin embargo, los propósitos del sistema podrían variarse debido a la dinámica de la campaña electoral, surgimiento de cambios geopolíticos en el mundo o las condiciones económicas tanto internas como externas y la flexibilidad de adaptación de cada candidato a las nuevas necesidades políticas y las expectativas del momento. Lo que está absolutamente claro es que los dos candidatos trabajan para el mismo 1%, es decir, para el sistema.\\nLea más: WikiLeaks revela que un periodista sugirió al jefe de campaña de Clinton \"sacrificar\" a Trump \\nBasta revisar la actitud de los Rothschild hacia ambos candidatos. En mayo del 2016, Lynn Forester de Rothschild ofreció una cena de 100.000 dólares por persona para recolectar fondos para Hillary Clinton. A la vez, el hombre de confianza de la familia Rothschild, el multimillonario Wilbur Ross organizó un \\'lunch\\' que costaba 25,000 dólares el plato para apoyar al candidato Trump. La familia Rockefeller se considera la creadora de Hillary Clinton como una lideresa política. Judicial Watch publicó un memorándum de 1993 de John David Rockefeller IV a Hillary Clinton donde expone los detalles de la Reforma de Salud que posteriormente Hillary Clinton intentó poner en práctica infructuosamente. © REUTERS/ Joe Skipper Donald Trump el candidato Frankenstein de los republicanos A la vez, la familia Rockefeller ayudó a Donald Trump, según el periodista Baxter Dmitry (News, US), a comprar en 1987 el 93% de las acciones del casino Resorts International, creado a comienzos de 1950. El periodista Andrew St. George reveló en \\'The Spotlight\\' (30 de octubre 1978) que Resorts International fue controlado por los hombres de las familias Rockefeller y Rothschild y administrado por los agentes de la CIA y Mossad que, en los años 60, usaban el dinero lavado para financiar la lucha contra la Cuba de Fidel Castro.\\nTema: Normalización de las relaciones entre Cuba y EEUU \\nEn fin, todo esto demuestra que tanto Donald Trump como Hillary Clinton trabajan para el sistema o como se dice popularmente en EEUU, para los \\'bad guys\\'. El problema ahora consiste en seleccionar al líder más útil actualmente para el establishment norteamericano. El discurso internacional de Hillary, apodada \\'The Queen of War and Chaos\\' está aparentemente cargado de amenazas de guerra. Ella misma se da cuenta de que Estados Unidos no está preparado para una confrontación con Rusia y China. La carta de 88 generales en retiro apoyando a Trump está demostrando que los militares prefieren el tono más moderado, aunque no menos belicoso que el de Hillary. — Sputnik Mundo (@SputnikMundo) 5 de octubre de 2016 \\n\\u200bEl candidato republicano declaró recientemente: \"Bajo mi administración pondremos fin a la débil política exterior de los últimos ocho años, reconstruiremos nuestras Fuerzas Armadas, le daremos a nuestros soldados reglas de combate claras\". Y en una reunión en Phoenix, Trump aclaró, para que nadie se hiciera ilusiones de su aparente pacifismo: \"Yo soy más militarista que todos los que están reunidos en la esta sala\". Hillary Clinton está amenazando a Venezuela y Donald Trump ya anunció en un mitin en Miami, adoptando la postura de Benito Mussolini, que acabaría con la dictadura de Castro en Cuba y con la de Maduro en Venezuela. También prometió apoyar a \"todos los pueblos oprimidos en el hemisferio\", lo que sería una referencia a los ecuatorianos y bolivianos en la interpretación tanto de Hillary como de Donald. Capitana Clinton vs. Iron Trump: debate presidencial al estilo Marvel En resumidas cuentas, como dicen los árabes, los dos candidatos representan el mismo caballo con diferente montura. Las promesas de Trump de revisar los tratados de libre comercio y hacer regresar el trabajo manufacturero e industrial a Norteamérica representan una demagogia, pues todos los tratados están regidos por las leyes internacionales que no se pueden cambiar fácilmente. Para la construcción del muro adicional con México se necesitaría una fuerte inversión, de la cual no dispone la Reserva Federal y México, en su turno, no aportaría ni un centavo. Tampoco le conviene a Washington la salida de EEUU de la OTAN, pues la Unión Europea se acercaría inmediatamente a Rusia, que le aseguraría su seguridad energética.'"}, "time": 1742563567.0924592}