{"duration": 0.068023681640625, "input_args": {"text": "'A comedian has agreed to speak at this year’s White House Correspondents’ Association dinner. Finally. Hasan Minhaj, a senior correspondent at “The Daily Show,” will be the featured performer at the dinner on April 29, the association said on Tuesday. He will join the ranks of Stephen Colbert, Jimmy Kimmel, Conan O’Brien and other stars who have skewered Washington at the annual gathering. But Mr. Minhaj, an   and Muslim who regularly roasts President Trump in his day job, will ascend the dais at a dinner that is shaping up to be far more tense than in previous years. Mr. Trump is skipping the festivities, the first president to do so since the 1970s, and his staff will boycott them, too. Vanity Fair and Bloomberg canceled their famed,    . And the event is playing out against the backdrop of a historically strained period of relations between the administration and the news media. Comedians for the dinner are typically announced months in advance, and some   names, including the   host James Corden, reportedly declined invitations this year. Without Mr. Trump on hand to punch back, some journalists in Washington were concerned that a   monologue attacking the president would give an impression of bias. “I was not looking for somebody who is going to roast the president in absentia that’s not fair and that’s not the message we want to get across,” Jeff Mason, the president of the correspondents’ association, said Tuesday morning on MSNBC. “I was looking for somebody who is funny and who is entertaining, because I want the dinner to be entertaining, but who can also speak to the message that the whole dinner is going to speak to: the importance of the free press,” Mr. Mason added. Mr. Minhaj, 31, joined “The Daily Show” in 2014 and has become popular among viewers with his cheerfully acerbic takes on current events. A   immigrant, Mr. Minhaj wrote and performed “Hasan Minhaj: Homecoming King,” an Off Broadway show in 2015 recalling his youth in California and his struggles with ethnic identity. Some of his “Daily Show” commentary about the president has been scathing, and personal. The day after the election, Mr. Minhaj described his anxieties about Mr. Trump’s policies toward Muslims, saying that his mother had asked if she would be allowed back into the United States after a foreign trip to visit relatives. “The fact that I can’t tell her ‘yes’ with 100 percent certainty is heartbreaking,” Mr. Minhaj said. “That is my mom, and I need her back home. Because I love her  —   and she owes me $300. ” In a statement on Tuesday, Mr. Minhaj called it “a tremendous honor to be a part of such a historic event even though the president has chosen not to attend this year. SAD!” ”Now more than ever, it is vital that we honor the First Amendment and the freedom of the press,” Mr. Minhaj added. Officials at the correspondents’ group say the dinner will be focused on promoting journalism, with the famed writers Carl Bernstein and Bob Woodward to present awards for White House reporting. Scholarships funded by the association will also be at the forefront. Alec Baldwin, who caricatures Mr. Trump on “Saturday Night Live,” called Mr. Mason at one point to talk about the possibility of an appearance, according to two people familiar with the discussion. The actor would likely have appeared as himself, and not in his Trump guise, the people said, in part because “Saturday Night Live” would have to give permission for Mr. Baldwin to reprise the impression outside of the show. But some journalists in the Correspondents’ Association felt that awarding a featured spot to Mr. Baldwin could inject a blunt partisanship into the proceedings. Would network news anchors, for instance, feel comfortable laughing along with Mr. Baldwin  —   live on camera  —   if no one from the White House administration was there to reciprocate? A representative for Mr. Baldwin said that the actor planned to be in Los Angeles during the weekend of the dinner. Regardless of Mr. Trump’s participation, there has been little question that this year’s event would have a different feel. “It’s a new president, it’s a new administration, and we’ve faced new challenges,” Mr. Mason said in an interview on Tuesday, “and the dinner reflects those things. ”'"}, "time": 1742564270.0941753}