{"duration": 0.033342599868774414, "input_args": {"text": "'This post was originally published on this site \\nsouthfront.org Donate \\nThe Houthi-Saleh Alliance has taken control over several strategic villages in al-Khobeh region, killing tens of Saudi soldiers and destroying their military hardware. \\nThe Houthi-Saleh Alliance continued its advances in the province of Jizan , located in southern Saudi Arabia, taking full control over several strategic villages in al-Khobeh region, Arabic-language media reported on Saturday, citing a senior Ansarullah Commander, Nasreddin Ameri. \\nAccording to Ameri, tens of Saudi soldiers lost their lives and many more of them fled the battlefield after 12 hours of clashes with fighters of the alliance. He also added that “six armored Bradly tanks and two Abrams tanks of the Saudi Army were destroyed, while other Saudi military hardware was also set on fire by Yemeni troops.” \\nLast week, Saudi Arabia’s military bases, located in Assir, Jizan and Najran provinces of the kingdom, were pounded by artillery units of the Houthi-Saleh Alliance. As result, Saudi troops suffered heavy losses. \\nAccording to reports, Yemeni fighters and their allies struck gatherings of the Saudi forces, stationed in the northern part of Midi desert near the village of al-Mousem in Jizan province. The Saudi Mosan military base, located in the southern part of the kingdom, as well as the Manfaz border checkpoint in Assir province were also hit by the alliance. As a result of the attacks, a large number of Saudi soldiers were killed. Two armored vehicles of Saudi military were destroyed by the Houthi-Saleh Alliance near the al-Khazra border checkpoint. All members of the crews were killed. \\nEarlier in November, the al-Ahad information website reported that residents of more than 60% of Saudi Arabia’s villages, located along the border with Yemen , had been evacuated by the kingdom’s border guards. According to commander of the al-Arezeh Border Guards in the province of Jizan, Lieutenant Ali al-Amri, the evacuation was carried out on an order of senior Saudi officials. \\nDonate '"}, "time": 1742562315.959573}