{"duration": 0.1828596591949463, "input_args": {"text": "'With this week’s imprimatur from the legendary investor Warren Buffett, it should now be official: Apple, the world’s largest company by market capitalization and a symbol of American technological innovation, is a “value” stock. That may prove to be a decidedly mixed blessing. Mr. Buffett is the world’s most prominent and successful proponent of value investing  —   an approach that seeks stocks that are undervalued and sell for less than their “intrinsic value,” as Benjamin Graham put it his 1949 classic “The Intelligent Investor. ” Mr. Buffett credits Mr. Graham with shaping his own approach to investing. So value investors took notice when Mr. Buffett’s holding company, Berkshire Hathaway, disclosed it had invested $1 billion in Apple stock during the last quarter. “We’ve just looked at it again,” said Bill Smead, who manages the Smead Value Fund, one of the most successful   value mutual funds over the last five years, according to Morningstar. “Anybody that discounts the thinking at Berkshire Hathaway does so at their peril, in my opinion. ” Value stocks are typically unpopular among many investors, their shares often battered by disappointing   revenue and earnings results. They usually trade at very low    ratios, a common valuation measure. Nonetheless, some academic studies have suggested that over time, they outperform other stocks, in part because expectations are so low. Today there are numerous value investors, value mutual funds and value   funds that pursue variations of the strategy, many of them probably now considering adding Apple to their portfolios, if they haven’t already. Apple “is going to attract more value investors,” said Toni Sacconaghi, a senior analyst at Sanford C. Bernstein who covers Apple. “They’re looking for   stocks with negative sentiment. Apple has traded below a market multiple for years and sentiment has become increasingly pessimistic, especially over the past month. ” Mr. Sacconaghi has a buy recommendation on the stock, “not because we believe this will be a   company going forward, but because the current price is discounting a decline in cash flow forever, and we think that’s overly pessimistic. ” According to the market research firm Thomson Reuters Lipper, just 69 of 357 actively managed value funds in the United States  —   fewer than 20 percent  —   currently hold positions in Apple. That’s because Apple has long been considered a quintessential growth stock: one of the glamorous   cousins to dowdy value stocks. Growth investors think growth stocks are undervalued, too, because they expect their earnings to grow faster (often much faster) than other investors recognize. As a result, valuation measures for growth stocks can go  . In two prominent   examples, shares of Facebook trade at a   ratio of about 73, and Netflix at about 312. (The   average for stocks in the Standard  Poor’s   index is currently about 24.) This week Apple’s    ratio was just over 10. If Apple is now a value stock, though, plenty of growth investors haven’t gotten the message. Among actively managed growth funds, 249 of 619, or 40 percent, hold Apple shares, according to Thomson Reuters Lipper. That’s more than the 230 growth funds that owned Apple stock in 2014. Should growth funds suddenly decide that Apple no longer meets their criteria, there could be a mass exodus that would be only partly offset by new purchases from value investors. Some prominent value investors aren’t convinced Apple really is a value stock, despite Mr. Buffett’s blessing, or that its stock price is significantly below its intrinsic value. (Intrinsic value considers all aspects of a business, including both tangible and intangible factors.) That means Apple could fall into the neutral zone of stocks that are neither growth  —   because they aren’t growing fast enough  —   or value, because they’re still not cheap enough. “Apple is extraordinarily cheap, but it’s never been a value stock in the traditional sense,” said Bruce Greenwald, who runs the value investing program at Columbia Business School and is a   of “Value Investing: From Graham to Buffett and Beyond” (Wiley, 2001). “Value investing has always focused primarily on asset value,” Professor Greenwald told me. Apple’s book value, or asset value, of $130 billion isn’t even close to its market capitalization of about $515 billion. That means, in theory, that other companies could replicate Apple’s assets at relatively low cost, produce rival products and undermine Apple’s enviably high profit margins. Tech companies typically have low asset values relative to their share prices  —   one reason Mr. Buffett and other value investors long shunned the sector  —   but their patented technologies and intellectual property nonetheless often create formidable barriers to entry by competitors. For an extraordinarily    technology company like Apple, the question is whether there are such “moats,” as value investors like to put it, that will continue to protect it from these competitive threats. “That’s always been the issue with Apple,” Professor Greenwald said. “How sustainable are these profit levels and how big are the barriers? The fear with Apple is that it will get overwhelmed by new entry and new competitors. The moat doesn’t seem that big. It’s not just giant rivals like Samsung, but smaller companies that can survive with even a small share of the smartphone market. ” Mr. Smead told me this week he had not added Apple to his value fund’s holdings, even though the stock is so cheap that it meets many of his fund’s investing criteria. “Over the past five or six years, when Apple was doing so well, we joked that we were the     fund that didn’t own Apple,” Mr. Smead said. “Not that we didn’t wrestle with it many times. ” “Our difficulty has been that we don’t understand what kind of moat protects their technology over the next 10 years,” Mr. Smead continued. “That’s the main problem. The other is that, given Apple’s huge success and its sheer magnitude, it needs a monstrous new product or enhancement of an existing product to move the needle on growth. ” For their part, many growth investors were startled on April 26 when Apple reported its first quarterly revenue drop since 2003. Both revenue and earnings fell short of analyst estimates, and Apple shares plunged 8 percent in one day. They rallied some this week on news of the Berkshire Hathaway investment, but are still down sharply from where they were as recently as  . But Apple still has defenders among growth investors. At the end of the year, Apple was the   holding in the Upright Growth Fund, the     growth fund so far this year, according to Morningstar. “Apple’s best and fastest growing days may be behind us,” David Chiueh, Upright Growth’s president and fund manager, told me. “But even   funds like ours don’t just contain   stocks with   percent growth rates in our portfolio. ” He said such rapid growth was not sustainable, and added that he was happy with companies that showed “solid 8 percent to 12 percent earnings growth,” a category in which he included Apple. ”Give them some time and they will show outstanding performance,” he said. Mr. Chiueh said he was also encouraged that Apple had stepped up its spending on research and development, suggesting that new products with strong growth prospects might still be in the offing. At some fund families, Apple seems to be both a value and a growth stock, even though that seems contradictory. At the fund giant Vanguard, Apple is a major holding in the Vanguard Windsor and Windsor II funds (both value funds) and the Vanguard Morgan Growth Fund and US Growth Fund. A Vanguard spokeswoman declined to comment. All of which suggests that when it comes to Apple, “value” and “growth” may be in the eye of the beholder. Still, Mr. Buffett’s announcement this week underscores that Apple’s once sizzling growth has slowed, and suggests it may well be on the inexorable path from growth to value stock. That’s not an especially good portent for investors. Among technology companies that have already made the same transition, Professor Greenwald cited IBM, Intel, Cisco, Microsoft and Dell, companies whose share prices, after great rocket rides, have mostly languished in recent years. (Dell was taken private in 2013.) For those who failed to buy the stock early enough, “as investments, they all turned out pretty badly,” he noted. Berkshire Hathaway also disclosed this week that it had increased the stake in IBM it first acquired in 2011. IBM shares have declined over the period, but by Mr. Buffett’s   standards, the investment is still too new to judge. “If you believe the iPhone will be the global standard in 25 years, you’d buy” Apple stock, Professor Greenwald said. But many value investors have already seen where smartphones can go, “which is where PCs have already gone. ”'"}, "time": 1742561707.968391}