{"duration": 0.037000179290771484, "input_args": {"text": "'Facebook is appealing an order to impose Austria’s social media laws against hate speech on the platform worldwide. [“The court case involves comments posted to Facebook about the leader of Austria’s Green Party, which the party claims are illegal under the country’s hate speech laws,” reported Fortune. “An appeals court in Vienna agreed and ordered Facebook to take them down not just in Austria but everywhere else as well. ”  According to Reuters, the court also said that “merely blocking them in Austria without deleting them for users abroad was not sufficient. ” The order would mean that citizens of other countries where “hate speech” laws are   could have their free speech restricted under Austrian law to stop negative posts being made and shared. “Should Facebook comply globally with Russia’s   laws, or Thailand’s laws against insulting the king, or Saudi Arabia’s blasphemy laws?” asked Daphne Keller, a lawyer at the Center for Internet and Society at Stanford University. “Would Austria want those laws to dictate what speech its citizens can share online? This ruling sends a signal to courts around the world that they, too, can enforce their national laws to ban speech around the world. ” Keller also added that since the post was a political comment, the court order is particularly “troubling,” raising questions as to whether political censorship is being enforced. “There is no place for hate speech on Facebook and this post was removed from our platform last year as requested,” said a Facebook spokesman to Fortune. “However, we will appeal this particular case before the Austrian Supreme Court to have better legal clarity around this specific post and the categorization as ‘unlawful’ as the new decision substantially reversed the original court decision. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562012.1745958}