{"duration": 1.6700210571289062, "input_args": {"text": "'California Democrats have proposed a law to give refugees   tuition at   colleges and universities, and grant to others “priority enrollment status” over U. S. citizens. [According to the Orange County Register, State Assembly Democrats announced a package of bills Wednesday to grant refugees   tuition at public colleges and provide money to school districts with large child refugee populations.  Another bill in the package would also give refugees with Special Immigrant Visas (SIV) who served the U. S. Armed Forces or State Department in Iraq or Afghanistan priority enrollment in public colleges and help them apply foreign work experience toward a professional license. Assemblymembers Kevin McCarty ( ) Lorena Gonzalez Fletcher (  Diego) and Adrin Nazarian (  Oaks) held a press conference in Sacramento on Wednesday to announce their package of bills. “We’re not taking part in this fear mongering and this hatred, and in fact we’re going to do the opposite,” said Assemblywoman Lorena Gonzalez Fletcher (  Diego) the Register reported. “We’re going to open our arms. We’re going to continue to find ways to support them and say, ‘You are welcome. ’” Sacramento Assemblyman McCarty also likened individuals with SIVs  —   earned for their work with the State Department or U. S. Armed Forces in Iraq or Afghanistan  —   to U. S. combat veterans. However, when the California legislature first passed its   “Deam Act” to give   tuition to illegal aliens who attend California’s   public colleges and universities, that same privilege was not offered to   service members and their families, who might be transferred to California for duty. Although that discrimination against military service members has since been rectified, it still does not include spouses and   children, who often move into California to be close to their loved one. According to Kevin McCarty’s official Assembly website (emphasis added): The California Welcomes Refugees package pushes back on religious and racially charged hate rhetoric from the federal government that has sought to limit refugees and other legal immigrants from entering the United States. The legislative package will offer a number of ways to help refugees successfully integrate in California, including: Providing refugees with   tuition at public colleges and providing priority enrollment for refugees with a Special Immigrant Visa (SIV) (those who served the U. S. Armed Forces or the U. S. State Department in Iraq or Afghanistan). Allowing SIV refugees to apply foreign work experience toward a professional license. Making a   budget request of $5 million to provide grants to Local Education Agencies in counties with high child refugee populations to improve refugee student integration. Declaring June 20, 2017 as World Refugee Day and affirming California’s commitment to support and protect refugees from throughout the world. California is home now to almost 8, 000 refugees brought in under President Barack Obama’s program. The bill, Assembly Bill 343, is available here. Tim Donnelly is a former California State Assemblyman. Author, Patriot Not Politician: Win or Go Homeless, FaceBook: https:  . facebook. . donnelly.  Twitter:  @PatriotNotPol'"}, "time": 1742563449.261952}