{"duration": 0.09623432159423828, "input_args": {"text": "\"Our new country: Women and minorities hit hardest Ann Coulter: Dems import 'cultures where rape, incest and spousal murder are acceptable' Published: 24 mins ago × Receive Ann Coulter's alerts in your email \\nBONUS: By signing up for Ann Coulter’s alerts, you will also be signed up for news and special offers from WND via email. error Print \\nEvery ethnic group except whites bloc-votes for the Democrats. Coincidentally, the Democrats have brought in another 30 to 40 million nonwhite immigrants in the last few decades. \\nIt doesn’t help that white voters can’t agree on what constitutes an acceptable candidate. In 2012, working-class whites sat out the election, rather than vote for the out-of-touch rich guy they saw in Mitt Romney. This year, the out-of-touch rich guys say they’ll vote for Hillary because Trump is tacky and gross. \\nThe sad irony is that the only people who will be better off in our new country are mostly white plutocrats – the top .01 percent. The rest of us will be their servants. \\nThe people who will be worse off are everybody else – the working class, the middle class (who will soon be working class) and, most of all, women, minorities, children, the elderly, the weakest and most vulnerable members of society. \\nLook to Mexico for your future – or any Third World country. Or to Univision’s Jorge Ramos. The ruling class in Mexico is composed of European-looking, white descendants of Spanish conquistadors who raped the native population, giving them only their Spanish names in return. (British settlers in America brought women with them.) \\nExplaining Latino culture’s acceptance of incest and child rape, criminal justice researcher Shana Maier writes in a book about rape that “the male is the head of the household, and women are subordinate to men. … Hispanics and Latinos are more likely than other racial/ethnic groups to blame the victim. The victim, not the perpetrator, is blamed for bringing dishonor to the family.” \\nOne American detective said that, today, police are being taught to keep an “open mind” about child rape because “it’s a cultural thing.” \\nWhen it comes to multiculturalism, you can’t say, We love the empanadas – but we don’t want 40-year-old men raping their nieces . This isn’t an a la carte menu. We get ALL the attributes of the cultures we’re importing. \\nAs described in excruciating detail in “Adios, America: The Left’s Plan to Turn Our Country into a Third World Hellhole,” our media already have a totally “open mind” about incest and child rape – and murder! – when it’s committed by immigrants. \\nThus, for example, where I would have chosen the headline: “Illegal Alien Convicted of Incest, Child Rape,” the Chattanooga (Tenn.) Times Free Press went with the less catchy: “Man guilty in case of human smuggling.” \\nAnd where I would have used the headline, “Illegal Alien Repeatedly Raped 14-year-old Girl at Job Site,” the Commercial Dispatch in Columbus, Mississippi, went with the more subtle, “Columbus resident charged with molestation.” \\nImmigrant women arrive in America, thrilled to have escaped cultures where rape, incest and spousal murder are acceptable, only to discover that those crimes are perfectly acceptable in this country, too – provided the perpetrator is from the very culture they fled. \\nIn 1989, Brooklyn Judge Edward Pincus sentenced a Chinese immigrant to probation for a premeditated murder of his wife, on the grounds that the murder flowed from “traditional Chinese values about adultery and loss of manhood.” The female head of the Asian-American Legal Defense and Education Fund, Margaret Fung, applauded the ruling. \\nSomewhat amazingly, newspapers are more likely to report black crime than immigrant crime. (Anything to keep the Third World immigration flowing!) \\nIn 2013, a 13-year-old girl was gang-raped by about a dozen illegal aliens, who cheered and videoed the attack. \\nWhen the news first broke, Shaneequa Jupiter, who lived with her children in the apartment building where the gang rape occurred, complained that neither the police nor apartment security had warned residents about the danger. (That could reflect poorly on illegal immigrants!) \\nEven if Shaneequa had scoured the headlines, she would have been on the lookout for “Austin men.” Or “Two.” \\nCompare these headlines about the same brutal sexual attack: \\n– “Two held in attack on child” – Austin American-Statesman (Texas), July 19, 2013 \\n– “Two Mexicans placed on immigration detainers as third man is arrested over five-day gang rape hell of teenage runaway during which she smoked crack” – Daily Mail Online, July 24, 2013 \\nNeedless to say, the New York Times did not cover the Mexican illegal-alien gang rape at all. \\nThe ultimate primer on the “blue-collar billionaire”— order Ann Coulter’s book “In Trump We Trust: E Pluribus Awesome!” \\nBy contrast, the Times, and every major American news outlet, extensively covered another gang rape – of a girl about the same age, at about the same time, in about the same place. \\nThe second case only was “rape” because of the girl’s young age – she was 11. But she was an enthusiastic participant, sneaking out of her house at night to meet the men for sex. \\nThose rapes, just a few years earlier, got a full-court press. The defendants were African-American. The victim was Mexican. \\nThat time, there were articles in the Huffington Post, GQ, Slate, Salon and Mother Jones. It even made the New York Times, despite no connection to a college fraternity or lacrosse team. \\nSimilarly, within a few months of one another in 2013, two men were arrested in separate child rape cases in Decatur, Alabama, for assaults on 9-year-old girls. One suspect was African-American, the other was a Hispanic immigrant. Only one made the newspaper. Guess which one? \\nWhen excitable Muslims raped American reporter Lara Logan in Tahrir Square (another one of Hillary’s foreign policy successes!), journalists immediately set to work to find the shortest line from the Muslim rapists to white American men. \\nConclusion: The real problem was the female reporters’ American bosses and colleagues. (Definitely not Islam!) \\nSampling of New York Times commentary on Logan’s rape: \\n– “Why We Need Women in War Zones” (“I would never tell my bosses for fear that they might keep me at home the next time something major happened. … This attack also had nothing to do with Islam.”) \\n– “Reporting While Female” (“Women reporters face another set of challenges. We are often harassed in ways that male colleagues are not. … In my experience, Muslim countries were not the worst places for sexual harassment.”) \\nPerhaps American men could do better, but, as American women may soon discover: They never had it so good. \\nManifestly, the purpose of our immigration policies is not to help Americans – or the immigrants who wanted to live in a place like America. They are designed to funnel welfare-dependent voters to the Democrats and cheap labor to the rich. (The Chinese immigrant who got probation for murdering his wife, for example, came to America based on his specialized skill of being a dishwasher.) \\nOur country will be Zimbabwe, but – if all goes according to the Democrats’ plan – they’ll get to be Mugabe! \\nThat’s Hillary’s dream. If she wins, Joe Sobran’s parody of the typical New York Times headline (about anything) will come true: “Women and Minorities Hit Hardest.” Receive Ann Coulter's weekly commentaries in your email BONUS: By signing up for Ann Coulter’s alerts, you will also be signed up for news and special offers from WND via email. Name *\""}, "time": 1742562295.8684943}