{"duration": 0.051622629165649414, "input_args": {"text": "'Los Angeles Mayor Eric Garcetti’s campaign traded barbs with mayoral challenger (and fellow Democrat) Mitchell Schwartz last week over the city’s    rising violent crime rate. [During a Northridge East Neighborhood Council candidate forum, Schwartz accused Garcetti of concealing rising crime statistics by not holding an annual news conference on them at the end of the year, according to the Los Angeles Daily News. Garcetti spokesman Yusef Robb slammed Schwartz’s “conspiracy theory” as he tried to explain away the lack of news conference as a scheduling matter. He went on to claim that L. A. crime is at “historic lows” and blamed the state for failures associated with prison sentence reductions under 2014’s Proposition 47.  Violent crime in Los Angeles was up 10 percent in 2016 from 2015, according to the Daily News, which noted that the crime statistics were quietly rolled out on the police department’s website. In prior years the statistics were announced jointly and very publicly by the mayor and chief of police. Schwartz has been campaigning on his goal to add 2, 500 police officers to the city’s police department, according to the report. Another mayoral challenger, Paul Amori, piled on the criticism of Garcetti, saying that “crime is up massively” under Garcetti’s watch, though he didn’t blame Garcetti alone. This week, San Diego Mayor Kevin Faulconer highlighted San Diego’s    decrease in violent crime while noting in a statement that violent crime in Los Angeles, Phoenix, San Antonio and Dallas had higher rates. In January, Garcetti spent several days fundraising in Chicago, Washington D. C and New York for his   bid. Earlier the same month, former Vice President Joe Biden appeared at a fundraiser for Garcetti in Beverly Hills. In early February, Garcetti took time to appear on MSNBC, stating that if Los Angeles police were enforcing immigration law, they couldn’t be out solving crimes. Garcetti has repeatedly criticized President Donald Trump’s plans to enforce immigration law and warnings that sanctuary cities face losing federal dollars. Aides to Garcetti said that on March 3 Garcetti and Los Angeles Police Chief Charlie Beck will roll out a “public safety initiative. ” Garcetti has also been the target of protests by Black Lives Matter activists, who President Trump and other critics have blamed for making the tasks facing police in inner cities more difficult. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742561739.4946723}