{"duration": 0.08809232711791992, "input_args": {"text": "'The government of China has drafted a list of “overly religious” names banned in western Xinjiang province, home to the nation’s Uighur Muslim ethnic minority. The list includes names such as “Muhammad,” “Jihad,” and “Imam. ”[According to Radio Free Asia (RFA) the initiative is meant to diminish the public profile of religion, particularly Islam, in the region. The communist Chinese government has long considered religion a threat to its dominance and has, in recent years, imposed a series of initiatives to limit Islamic practices, in particular, in response to a series of terrorist attacks in Xinjiang and threats from outside jihadist groups like the Islamic State.  RFA lists “Islam, Quran, Mecca, Jihad, Imam, Saddam, Hajj, and Medina” among the names in the document, titled “Naming Rules for Ethnic Minorities. ” The New York Times, which reports that the list includes “more than two dozen names,” adds “Mujahid,” “Arafat,” and “Muhammad” to that list. Anyone with such names will be banned from officially registering with the government, which excludes them from, among other things, public education and denies them the legal documents necessary to find work and generally participate in society. Government officials confirmed the ban to both outlets. The official who spoke to RFA argued that it would not be difficult for Uighurs to keep from running afoul of the new regulations: “Just stick to the party line, and you’ll be fine,” the official told RFA. “You’re not allowed to give names with a strong religious flavor, such as Jihad or names like that. The most important thing here is the connotations of the name.   …     [It mustn’t have] connotations of holy war or of splittism [Xinjiang independence]. ” Voice of America adds that the name restrictions are part of a larger set of regulations handed down in the   region. The Chinese government will now also “prohibit   ‘abnormal’ beards, the wearing of veils in public places and the refusal to watch state television”  . Islamic head scarfs had already been banned in Urumqi, the capital of Xinjiang, and Islamic garb and Muslim beards already banned individuals from using public transportation. The World Uyghur Congress, an advocacy group from the ethnic minority operating outside of China, has condemned the new measures. “In setting limits on the naming of Uyghurs, the Chinese government is in fact engaging in political persecution under another guise,” Dilxat Raxit, a spokesman for the group, told RFA. “They are afraid that people with such names will become alienated from Chinese policies in the region. ” These restrictions are the latest handed down from Beijing to the nation’s westernmost province. In February, the government implemented mandatory GPS tracking on all cars and trucks registered in Bayingol, Xinjiang. “Cars are the major means of transportation for terrorists and also a frequently chosen tool to conduct terrorist attacks. So it’s necessary to use the Beidou system and electronic vehicle identification to enhance the management of vehicles,” the local government said in a statement. China has also implemented measures to universalize language in the country, promoting Mandarin  —   Beijing’s main language and that of the Han ethnic majority  —   in places where Cantonese, Uighur, and Tibetan are more common tongues. The government refers to Mandarin as the “common tongue” and has moved to eradicate other languages from local schools. In January, Xinjiang announced new border security measures, as well. Xinjiang borders Pakistan and Afghanistan, homes to a variety of Islamic terrorist groups to which Uighur terrorists may flee. The main terrorist group operating in Xinjiang is the East Turkestan Islamic Movement (ETIM) which aspires to establish an Islamic State in Xinjiang. Communist Party officials in Xinjiang have long been banned from publicly observing the Ramadan fast. The law requires shopkeepers in Xinjiang to sell multiple brands of alcohol and cigarettes, items banned by Islamic practice.'"}, "time": 1742561776.2077334}