{"duration": 0.06090855598449707, "input_args": {"text": "'Violent crime, including murder, continued its rise across the country during the first half of 2016, and the largest cities seeing a 21. 6 percent increase in murders, says a new FBI report. [Comparing the first six months of 2015 to the first six months of 2016, the FBI found murders rose 5. 2 percent, aggravated assaults rose 6. 5 percent, robbery rose 3. 2 percent, and rapes under both the “legacy” and “revised” definitions increased 4. 4 percent and 3. 5 percent, respectively.  The report was issued days after President Barack Obama publicly denied the rising tide of crime. “There is no growing crime wave,” Obama insisted in an essay for the Harvard law Review, published Jan. 5. Regardless of Obama’s statements, crime rates rose nationwide, the FBI report shows: Violent crime increased in all city groupings. Among cities, violent crime rose the most over the previous year (9. 7 percent) in those with populations of 1, 000, 000 and over. In cities with populations from 500, 000 to 999, 999, violent crime increased 5. 2 percent, and in cities with 250, 000 to 499, 999 inhabitants, violent crime was up 4. 3 percent. Violent crime increased 6. 3 percent in metropolitan counties and rose 1. 6 percent in nonmetropolitan counties. Violent crime increased in all four regions of the nation. These crimes were up 6. 4 percent in the West, 5. 9 percent in both the Midwest and in the South, and 1. 2 percent in the Northeast, U. S. cities with populations of one million or more people include New York City, Los Angeles, Chicago, Houston, Philadelphia, Phoenix, San Antonio, San Diego, and Dallas. The largest cities saw shocking increases in violent crime compared to the first half of 2015: Overall, violent crime increased 9. 7 percent. Murders spiked 21. 6 percent. Rapes under the revised definition —  defined as “penetration, no matter how slight, of the vagina or anus with any body part or object, or oral penetration by a sex organ of another person, without the consent of the victim” —  rose 11. 3 percent. Robbery increased 6. 3 percent. Aggravated assault rose 11. 4 percent. Burglary declined by 5. 4 percent, while motor vehicle thefts rose 5. 9 percent and larceny rose 3. 3 percent. Arson rose 5. 3 percent. While property crimes declined overall at 0. 6 percent, they rose in the largest U. S. cities by 2. 1 percent. As Breitbart News previously reported, the FBI’s 2015 crime report revealed a 10. 8 percent increase in murders from 2014 to 2015 —  the largest increase in a single year since 1971 —  and a 3. 9 percent increase in violent crime overall. Chicago’s gun crime death toll is so high it’s distorting national murder figures. TheWall Street Journal reports  “37 of the 65 largest police agencies” counted homicide increases in 2016. Obama claimed in his Harvard essay that “there is no growing crime wave. ” That claim ignores the dramatic murder wave that took place under his watch, and allows him to ignore the bodies of at least 1, 500 additional dead Americans to declare that crime remains “near historic lows. ” Under Obama, the nation is seeing the sudden reversal of a   decline in violent crime. The reversal began in 2014, after the Ferguson race riot and as he launched his “  ” campaign against state and local police. The FBI was quick to see the reversal. In October 2015, FBI Director James Comey said “part of the explanation” for rising crime “is a chill wind blowing through American law enforcement over the last year,” implicitly criticizing Obama’s strategy of using   activist groups and his Justice Department’s law enforcement regulations to reshape local policing. The reversal also comes as Obama releases more criminals from prison. Obama has also boasted of that he will be the “first president in decades to leave office with a federal prison population lower than when I took office. ” That’s true, according to a vocal critic of Obama’s    attitude towards incarceration rates: Arkansas Sen. Tom Cotton says the administration used revised sentencing guidelines to release 30, 000 felons from federal prison, bringing the total number of federal prisoners to fewer than 200, 000. And Obama has continued to commute the sentences of drug traffickers as drugs kill more Americans.  In 2014, more than 47, 000 people died from   deaths. Thanks to Obama’s commutations, former armed drug traffickers will be back in American communities as early as March.'"}, "time": 1742562993.7761695}