{"duration": 0.05996966361999512, "input_args": {"text": "'LOS ANGELES  —   The offscreen stakes were minimal: “Rogue One,” the first in a series of “Star Wars” spinoff films planned by Walt Disney Studios, was always going to be devoured by moviegoers worldwide. No test of galactic franchise sustainability here. But Disney did face a   enemy: Mother Nature, in the form of winter storms that blanketed the upper half of the United States and much of Canada. She turned out to be no match, either. “Rogue One: A Star Wars Story,” with a cast led by Felicity Jones and Diego Luna, collected an estimated $155 million at theaters in North America, on par with expectations and the   December opening on record, behind last year’s “Star Wars: The Force Awakens. ” In release in about 70 percent of the overseas market, “Rogue One” sold an additional $135. 5 million in tickets, according to Disney. “Rogue One,” about stealing blueprints to the planet vaporizer known as the Death Star, cost roughly $350 million to make and market worldwide. “We saw no real impact from the weather,” Greg Foster, chief executive of Imax Entertainment, said by phone on Sunday. “It boils down to the movie. Felicity plays an awesome character, and the movie feels very authentic to the ‘Star Wars’ universe. ” More than 700 Imax theaters played “Rogue One” worldwide, delivering the strongest opening results of the year for that   chain. While a few critics found fault with the film, which was directed by Gareth Edwards, “Rogue One” received reviews that were 84 percent positive in aggregate, according to RottenTomatoes. com, making it the   reviewed “Star Wars” entry in two decades, behind only “The Force Awakens. ” Ticket buyers gave “Rogue One” an A grade in CinemaScore exit polls, boding well for momentum in the weeks ahead. “Part of the hope here was to create a way for the uninitiated to have a way in and bring them along for future films,” said Dave Hollis, Disney’s executive vice president for theatrical distribution. About 40 percent of ticket buyers were under the age of 25. Terrible reviews most likely hurt the weekend’s other new   movie, “Collateral Beauty. ” That latest effort by Will Smith sputtered with about $7 million in ticket sales, a career low for Mr. Smith, according to comScore, which compiles box office data. “Collateral Beauty,” about a man who writes letters to Love, Time and Death, cost New Line Cinema, a division of Warner Bros. at least $60 million to make and market. On the bright side: The film could do better overseas, where Mr. Smith’s star power remains more intact. Domestic interest in “Rogue One,” on the other hand, was strong enough to prompt some fans to camp outside theaters in   temperatures one group in Ellensburg, Wash. set up an outdoor fireplace to keep warm. (Insert bad joke about the   Hoth here.) Wearing costumes to   screenings is a tradition for   “Star Wars” fans, and “Rogue One” proved to be no exception. Disney, as ever, leveraged every asset in its empire to market the film. Exclusive “Rogue One” footage was shown on   ABC. At one point, Disney used lighting effects to turn one of its theme park landmarks  —   the    golf   sphere at Epcot’s entrance in Orlando, Fla.  —   into the Death Star spaceship. An array of   merchandise stretched to a Death Star popcorn popper and clothing for dogs. Notably, Disney had to fight months of online hyperventilation over leaked news that “Rogue One” underwent extensive “reshoots,” shorthand for going back after the end of principal filming to rework certain scenes or add to them. Once upon a time, such efforts were rare  —   it’s expensive to reassemble cast and crew  —   and usually meant the movie as a whole was a train wreck. But that is no longer the case, at least not always. Movies on the scale of “Rogue One,”   productions with loads of visual effects, now schedule time for reshoots up front as a routine part of filmmaking.'"}, "time": 1742564463.605266}