{"duration": 0.2999444007873535, "input_args": {"text": "'Finally. The Second Avenue subway opened in New York City on Sunday, with thousands of riders flooding into its polished stations to witness a piece of history nearly a century in the making. They descended beneath the streets of the Upper East Side of Manhattan to board Q trains bound for Coney Island in Brooklyn. They cheered. Their eyes filled with tears. They snapped selfies in front of colorful mosaics lining the walls of the stations. It was the first day of 2017, and it felt like a new day for a city that for so long struggled to build this sorely needed subway line. In a rare display of unbridled optimism from hardened New Yorkers, they arrived with huge grins and wide eyes, taking in the bells and whistles at three new stations. “I was very choked up,” Betsy Morris, 70, said as she rode the first train to leave the 96th Street station, at noon. “How do you explain something that you never thought would happen? It’s going to change the way everybody lives as far as commuting goes. ” It was a major moment for New York’s sprawling transit system after decades of failed efforts to bring the line to one of the few corners of Manhattan the subway did not reach. The opening of the first segment of the line  —   an extension of the Q train to 96th Street  —   promises to lighten the crush of passengers on the Nos. 4, 5 and 6 trains along Lexington Avenue, the nation’s most overcrowded subway line, which had been the only line on the Upper East Side of Manhattan. When the stations opened shortly before noon, they were quickly filled with giddy riders both young and old, and strollers, suitcases and dogs  —   all familiar sights across the system. But for all the excitement, the line, with just three new stops, is much more modest than the ambitious route running the length of Manhattan that was once envisioned. It serves a relatively affluent and not very diverse part of the city, which has more than eight and a half million people and many   and minority residents who live far from a subway line. With the subway reaching its highest ridership levels since 1948, much of the aging system is plagued by crowding and delays, even as subway and bus fares are expected to rise again in March. Still, there was reason to cheer. The opening of a new subway line is a rare occasion in the United States and comes at a time of mounting concern about the deteriorating state of the nation’s infrastructure, from its roadways and bridges to its public transit systems. Few new subway stations have opened in recent years, even as expansive subway networks have sprouted in Asia, and most American cities never built any in the first place. The major subways in the Northeast  —   in New York, Washington and Boston  —   are grappling with old equipment and funding shortfalls, with Washington experiencing a near meltdown over safety problems. With mounting bills for basic maintenance, these subways have largely failed to grow. So the arrival of the   Second Avenue subway, which was first proposed in the 1920s, was a notable achievement for the   Metropolitan Transportation Authority, which runs the city’s vast network of subways, buses and commuter railroads. The first phase of the project took nearly a decade to build and cost about $4. 4 billion. With the opening, the map of the city’s loved and loathed subway adds three new stations, bringing the total to 472  —   the most of any subway in the world. A station that opened at Hudson Yards on Manhattan’s Far West Side in 2015 was the city’s first new station in a  . On Sunday, New Yorkers were mesmerized by the artwork adorning the walls. At the 72nd Street stop, Sumana Harihareswara stopped to gaze at a mosaic of a woman of South Asian descent dressed in a burgundy sari, looking at her cellphone. Ms. Harihareswara was overcome with emotion. “I don’t think I’ve ever come across subway art before that makes me feel so seen,” she said through tears. “This woman could be my aunt she could be my cousin. ” She and a stranger exchanged a knowing glance. “Representation matters,” they agreed. Ms. Harihareswara, a longtime transit enthusiast from Astoria, Queens, said she was struck by the diversity portrayed in the mosaics, including a mural of a gay couple holding hands. “There is no feeling quite like seeing yourself cemented into the infrastructure of New York,” Ms. Harihareswara said. After decades of aborted efforts to build the Second Avenue line, and at least three groundbreakings in the 1970s, construction on the current segment began in 2007. The line was originally projected to open in 2013, but subway officials pushed the deadline to the end of 2016 many years ago. Gov. Andrew M. Cuomo, a Democrat who effectively controls the authority, pressed officials to meet the December 2016 deadline even as concerns grew that the subway would not be ready in time. Still, the agency made the deadline  —   just barely  —   with a lavish inaugural ride on New Year’s Eve for a collection of dignitaries that culminated in a midnight toast. Although many New Yorkers believe the city runs the subways, it is actually the governor who appoints the authority’s chairman and holds considerable sway over the agency. Mr. Cuomo has capitalized on the Second Avenue opening to raise his national profile, overshadowing his frequent nemesis Mayor Bill de Blasio, a Democrat who attended the inaugural ride on Saturday but was not given a speaking slot. Despite general good will over the opening, some transit advocates expressed concerns over the high cost of the project and questioned whether officials would move aggressively to extend the line to 125th Street in East Harlem as planned. On Sunday morning, Mr. Cuomo arrived at the 96th Street station with the authority’s chairman, Thomas F. Prendergast, to join the first trip for regular riders, who cheered as the train pulled out of the station. Then Mr. Cuomo’s voice came over the loudspeaker. “Rest assured: I’m not driving the train,” he joked. The first day of service was smooth, although there were a few hiccups. Around 3 p. m. there were delays on the Q line because of a train with mechanical problems at the City Hall station. About an hour earlier, the elevator at the new 86th Street stop had begun to malfunction, stranding passengers above and below ground. Strollers were wheeled onto steep escalators. Parents became upset. Jill Tallmer, 62, and her mother, Margot Tallmer, 91, contemplated visiting another day. “We’ve been waiting for 10 years, or more, to ride,” the younger Ms. Tallmer said while standing with her mother, a lifelong New Yorker who is in a wheelchair. “Hopefully, it’s almost ready for us. ” It was not, and they left after a few minutes. At the 72nd Street station, George Braith, a jazz saxophonist, was being mobbed by an eager pack of veritable paparazzi. The reason for his newfound celebrity: His likeness is featured in a mosaic there. “Would you look at that guy?” Mr. Braith, 77, said. “Pretty handsome fellow if you ask me. ” He is one of several local celebrities portrayed in the artwork, including chef Daniel Boulud. In Mr. Braith’s mosaic, he is clad in a slick red blazer and carrying his signature Braithophone, alto and soprano saxophones melded into one. Taking the instrument from his suitcase, he obliged the crowd with a brief tune. “Are you famous?” a   asked, seeing the hubbub. “In the jazz world,” Mr. Braith replied. The man shook his head and said, “Well, you’re immortalized as far as I’m concerned. ” Another   celebrant, Ian Ma, 15, lives in Sheepshead Bay, a waterfront neighborhood in southern Brooklyn that is nowhere near the new subway line. But he has been enchanted by trains since he started rolling toy models on the floor as a child, he said, and he cajoled his parents into giving him a ride. “I feel like I’ve been waiting for this train my whole life,” he said, seemingly speaking for many others.'"}, "time": 1742561688.5083878}