{"duration": 0.047745704650878906, "input_args": {"text": "'Sonntag, 13. November 2016 Forscher entdecken abgelegenen Regenwaldstamm, der noch immer iPhone 4s verwendet São Paulo (Archiv) - Von der Außenwelt isoliert: Ein internationales Forscherteam hat in Brasilien einen Indio-Stamm entdeckt, dessen Mitglieder so rückständig sind, dass sie noch immer das iPhone 4s benutzen. Wo genau der Amazonas-Stamm siedelt, will die brasilianische Regierung nicht bekanntgeben, um die Indios vor den schädlichen Einflüssen der modernen Zivilisation zu schützen. Laut den Wissenschaftlern seien die Geräte der Ureinwohner zwar entfernte Verwandte unserer modernen Smartphones, die Anwendungen darauf \"laufen aber gefühlt bis zu einhundert Mal langsamer als in der Zivilisation\". Primitives Werkzeug der Ureinwohner Schon beim Überflug über die Siedlung waren die veralteten Telefone des Amazonas-Stamms, der aus mehreren hundert Mitgliedern besteht, klar zu erkennen. Viele der Indios benutzen außerdem \"auf uns befremdlich wirkenden Handy-Schmuck und eine Art Köcher für ihre Geräte\". \"Eine Kontaktaufnahme mit den Indianern war beinahe unmöglich, weil auf ihren Geräten zum Teil nicht einmal WhatsApp läuft\", erinnert sich Teamleiter Kenneth Wyne an die Begegnung am Riesenfluss. \"Sie zeigten uns Funktionen und Apps, die wir nur noch aus Erzählungen kannten. Auch das \\'Pinch-to-Zoom\\' lief längst nicht so flüssig wie das unserer Telefone.\" Laut eigener Aussage hatten die Ureinwohner noch nie Kontakt zu modernen Menschen, Gerüchte über einen Nachfolger des iPhone 4s kursieren allenfalls als Legende. Das erfolgsverwöhnte Forscherteam ist derzeit auf der Suche nach einem peruanischen, noch stärker von der Zivilisation abgeschotteten Indio-Stamm. Legenden zufolge benutzen die Stammesmitglieder dort neben Pfeil und Bogen noch immer die Nokia 3310 -Handys ihrer Vorväter. fed, ssi; Foto oben [M]: Valter Campanato/ABr. , CC BY 3.0 BR , Foto rechts: William Hook , CC BY-SA 2.0 ; Hinweis: Erstmals erschienen am 13.8.14, iPhone von 3GS auf 4s aktualisiert Artikel teilen:'"}, "time": 1742563314.3977213}