{"duration": 1.557715892791748, "input_args": {"text": "'INTERVIEW WITH THE SYRIAN PRESIDENT BASHAR AL-ASSAD\\n“Syria is paying the price of its independence” by Bashar al-Assad Interviewed by the Cuban journalist Roberto Garcia on behalf of the agency Prensa Latina, the President of the Syrian Arab Republic highlights the cohesion between the different groups within Syrian society and popular participation in defense of the Nation. After noting that preserving national independence was a fundamental factor in the struggle that today is liberating the Syrian state, Bashar al-Assad recognizes the historical similarity between this battle and the recent struggles between Latin American nations.\\nVoltaire Network | Damascus (Syria) | 2 November 2016 Español President Bashar al-Assad receives the special envoy from Latina Prensa, Roberto García, 21 July 2016. Prensa Latina : Mr President, thank you very much for granting Prensa Latina this historic opportunity to communicate to the world your perspective on the situation in Syria given that, as you know, much information has been manipulated on the foreign aggression your country faces.\\nHow do you assess the current military situation in Syria and what are the main challenges that the Syrian armed forces on the ground face in their struggle against the anti-governmental groups? If possible, we would like your opinion on the current situation on the combat fronts in Aleppo and Homs.\\nBashar al-Assad :Obviously, the terrorists have received massive support from different corners of the world. There are more than 100 nationalities participating in the aggression against Syria, relying on the support of countries such as Saudi Arabia and Qatar, that fund them and Turkey that undoubtedly offers them logistical support, as well as the approval and supervision of Western States led by the United States, France, the United Kingdon and other allies.\\nBut since the Russians decided to combat terrorism in Syria, essentially the Al-Nusra Front, the Islamic State (Daesh) and other groups associated to these two extremist entities, the balance of powers has now shifted in our favour and against these groups.\\nThe Syrian Arab Army has succeeded and continues to succeed in making advances in different parts of Syria and is determined to topple them.\\nThe situation in Homs, since the terrorists abandoned it more than a year ago, has improved and is far more stable now. There are some districts in the city infiltrated by extremists where a reconciliation process is now underway. On the basis of this reconciliation process, terrorists have the possibility of laying down their arms and then returning to their normal lives, benefitting from the governmental amnesty. Alternatively they leave Homs for another part of Syria, which is exactly what happened more than a year ago in the centre of this city.\\nBut the situation is different in Aleppo given than the Turks and their Saudi and Qatarian allies have lost many of their cards on the battle fields in Syria, so that Aleppo is its final card, especially for the Turkish President Recep Tayyip Erdogan, who has tried his best with the Saudis to send there the largest possible number of terrorists that now totals around 5,000. This they did in the last two months, from Turkey to Aleppo in the hope of occupying this city, but they failed.\\nIn actual fact, our army has succeeded in making advances in Aleppo and the surroundings areas, seeking to find terrorists, then to negotiate with them so as to return them to their normal life. Alternatively they will abandon this zone, or in some other way will be destroyed because they have no other option.\\nPrensa Latina : What are the priorities of the Syrian armies in their struggle against the terrorist groups? What role do the popular defense groups play in the theatre of operations?\\nBashar al-Assad : The priority of the Arab Syrian Army is fighting Daesh [the Islamic Emirate], the al-Nusra Front and groups such as the Ahrar Al-Sham and Yeish al-Islam (the Islamic Army).\\nThese four groups are directly linked to al-Qaeda, given that they share its ideology. They are Islamic extremists that want to eliminate everything that is contrary to their way of thinking and that is not aligned to them.\\nRegarding the groups of popular defense, at the beginning of the conflicts, the terrorists unleashed a non-conventional war against our army that is a conventional organization, such as any other army in the world.\\nAs a consequence, the support that these groups of popular defense offered was of utmost importance to destroying the terrorists with non-conventional tactics. This has been a great help for the Syrian Arab Army given that the combatants of the popular defense fight in their own zones, cities and towns - places that they are very familiar with. I mean, they really dominate the roads, paths and geography of these zones and for this reason are a great help to the Syrian Arab Army. This is their mission.\\nPrensa Latina : How does the resistance of the Syrian people materialize against foreign aggression on the economic front? Which sectors in this sphere continue to function despite the war, the international sanctions and acts of sabotage?\\nBashar al-Assad :In actual fact, the war against Syria is integral because it is not limited to the support offered to the terrorists but furthermore unleashed a containment policy against our country at the international level…\\nThe third factor is the economy. They give orders to extremists and mercenary agents to destroy the infrastructure that grew the Syrian economy and satisfied the daily needs of its citizens.\\nAt the same time, they began to impose a direct embargo on the borders of our nation, making use of these irregular armed elements from abroad, harnessing the banking systems in the whole world.\\nDespite this, the Syrian people is determined to pursue a normal life, within the realms of what is possible. This situation has led to many businessmen, essentially medium and small industrials, abandoning the most unstable conflict zones and making their way to other areas where there is greater stability. There they establish their businesses at much-reduced levels, as a way of continuing to exist, to maintain economic activity and to continue to satisfy our citizens’ needs.\\nIn this context, most sectors are still functioning. For example, the pharmaceutical industry is working at more than 60% of its manufacturing capacity and this is very important for our economy in the circumstances that we are going through.\\nI think that despite our current situation, we are not cutting back on the efforts to broaden once again our economic base, especially following the advances that the Syrian Arab Army is making in different zones of combat.\\nPrensa Latina : Mr President: let us speak a little about the international environment. What is your opinion on the role the UN is playing in the Syrian conflict and the attempts of Washington and its allies to impose their will on the Security Council and the Geneva Talks?\\nBashar al-Assad :Talking about the role of the UN and the Security Council could be ambiguous and confusing given that in actual fact, the United Nations is an instrument that the United States can use to suit its needs.\\nWashington is able to impose on the [UN] its norms of double standards thereby preventing the organization acting according to the provisions of the UN Charter. They can use it just as they do with any other institution under US administration.\\nWere it not for the positions taken by Russia and China on certain causes, the UN would be a wholly US institution. But Russia and China have achieved a certain equilibrium in these institutions over the last 5 years, especially on the Syrian cause.\\nBut if you wish to speak of the role of the UN through its mediators and its envoys, such as Mr Staffan De Mistura most recently and before him Koffi Anan, Lakdar Brahimi and others, we can say that these mediators are not independent.\\nThese officials reflect the pressures that Western countries exercise, or, in some cases, the dialogue existing between the main powers, principally Russia and the United States. They are not stable and due to this, you cannot speak of the UN playing a role.\\nIt is a reflection of this equilibrium. So, the UN is not playing a role in the Syrian Conflict. There is only US – Russian dialogue and we know that the Russians are not cutting back on their efforts and that they are working with all sincerity and honesty to topple the terrorists.\\nHowever, the US is manoeuvring to use the terrorists rather than to destroy them.\\nPrensa Latina : Mr President: How do you currently see the co-existence between Syrian ethnic and religious groups in relation to this foreign interference? How does this factor impact the current economic climate?\\nBashar al-Assad :The most important matter with respect to this harmony between the different components of the Syrian social fabric, is that it is true and authentic. This is because it has been constructed throughout History and throughout the centuries. This means in this sort of conflict it is impossible to destroy this social fabric.\\nIf you take a tour in the different zones under government control, you can see all the colours of the social fabric of Syrian society living together.\\nI can add that during the conflict, this harmony improved and was further strengthened. This is not just words - it is a reality that has different reasons. The conflict is a lesson and this diversity that characterizes a society can enrich the country or can be converted into a problem. There is no other outcome.\\nThe people have learnt that we have to work very hard to retain this harmony given that the first argument that the terrorists and their allies in the region and in the West used in relation to the conflict in Syria was of a sectarian character.\\nThey would like to divide the people so that they will fight among themselves with the aim of stoking the fire in Syria but they have failed. The Syrians learnt the lesson how to live in harmony and they were enjoying this harmony before the conflict exploded. Now we have to try to strengthen it.\\nAnd for this reason, without any exaggeration, I can say that where this issue is concerned, all is well.\\nWe can also say that the situation is different in the areas under terrorist control. As you know, those that belong fundamentally to the extremist factions associated with al-Qaeda have not decreased their efforts to introduce their oscurantist ideology into the minds of the new generation, an ideology that asserts death, decapitation and all these horrendous practices. And that had success in some areas.\\nWith the passage of time, it will be more difficult to deal with this new generation of youth, saturated with the doctrine and ideology of Wahabism and al-Qaeda. Here is based the only danger that our society will face in relation to the harmony and coexistence to which you have referred.\\nPrensa Latina : Mr President, let us return to the international scene. What is your opinion on the role that the US-led coalition plays in relation to the groups deployed in the North of Syria, especially the Kurds?\\nBashar al-Assad :As you know, when the US administrations build relations with any group or society in a country, it is not for the benefit of that nation or its people but because it serves the US agenda.\\nConsequently, we have to ask ourselves: why are the Americans supporting someone in Syria? Clearly they are not doing it for the benefit of Syria, but because they have their own agenda. And this US agenda in all countries always aims at dividing.\\nThey do not work to unite people, but to divide them. Sometimes they choose a sectarian group and at other times an ethnic group and lend its support against other ethnic groups or wedge a distance between it and other components of society. That is its agenda.\\nTherefore it is evident that all this US support has nothing to do with Daesh, nor with al-Nusra, nor even with the fight against terrorism as from the time the US intervened, Daesh has grown. It only started to shrink when Russia lent its support to the Syrian Army last September.\\nPrensa Latina : Mr President, what is your opinion of the attempted coup that recently took place in Turkey? How do you think it affects the current situation in this country, at the international level and also the conflict in Syria?\\nBashar al-Assad :We have to see this coup as reflecting instability and disturbances within Turkey, especially at the social level. It is possible that the effect is political or any other type, but, certainly, when a country is destabilized, the principal causes are rooted in its own society.\\nThis is independent of who governs Turkey and who is its president/ leader because this is an internal matter. We do not intervene nor will we commit the error of saying that Erdogan must step down from power or that he must stay. This is a Turkish issue and it is for the Turkish people to take a decision on this matter.\\nBut the most important matter in this coup is that we have to see the measures and steps that Erdogan and his group adopted in recent days, when they began to attack the judicial system. They expelled from office more than 2,700 judges, more than 1,500 university professors and more than 15,000 employees in the education sector. What do the universities, the judges and the civil society have to do with the coup?\\nThese measures reflect the evil intentions of Erdogan, his bad character and his real intentions with respect to what has happened. If the investigations are still underway, why take the decision to dismiss all these people?\\nThus he has used the coup to execute his extremist agenda, a blueprint of the Muslim Brotherhood’s, on Turkish soil. This is very dangerous for Turkey and for the neighboring countries, Syria included.\\nPrensa Latina : How do you assess your Government’s relations with the opposition based in the country? What is the difference between these oppositional groups and those based abroad?\\nBashar al-Assad :We have good relations with the opposition within Syria, based on national principles. Clearly they have their own political agendas and doctrines and we have our own agenda and doctrine. We can enter into dialogue with them directly or through the ballot boxes, which is another form of dialogue.\\nThis is the situation in all countries. But we cannot compare this opposition with the opposition based outside Syria. This is because the concept of opposition signifies using pacific means and not supporting terrorists. This opposition is not formed outside the country and has a popular base among the Syrians that live here.\\nThe popular bases cannot be directed from the chancelleries of the United Kingdom or France or through the Qatar, Saudi Arabia and the United States intelligence services. This is not an “opposition” as they call themselves; we call them traitors because the true opposition, the one working for the Syrian people, is based in Syria and adopts its agenda from this people and functions in the interests of the homeland.\\nPrensa Latina : How do you assess the insistence of the United States and its allies that you have to abandon power and the media campaign that they unleash to smear the reputation of its Government on the international scene?\\nBashar al-Assad :With respect to the proposition that I abandon power, they have been saying this for five years yet we have never given it any importance, nor even responded with any declaration whatsoever.\\nWe have never given it importance. This is a Syrian matter and the Syrian people are the only ones with the power to determine who must stay and who must resign, who must stay in office and who must abandon it. The West is abundantly aware of our position on this matter.\\nConsequently, we are not very bothered with this issue. We don’t even waste time thinking about what they say. I am here thanks to the support of the Syrian people. Were it not for this support, I would not be here. It is as simple as that.\\nWith respect to sullying reputations or attempts to demonize certain Presidents, this is the US’s modus operandi – at least it has been from the Second World War, since they replaced British colonialism in this region and possibly in the entire world.\\nFrom that time, the US administrations and the US politicians have never uttered a word of truth on any issue. They always lie. And with the passage of time, they have been converted into expert liars. This is part of their policy. Their attempt to demonize me is similar to their attempt to demonize President (Vladimir) Putin, in the last two years, and to demonize the Cuban leader Fidel Castro over the last five decades. That is how they operate.\\nSo we must know that this is how the US acts and therefore we must pay no heed to what they say. The important thing is to maintain a good reputation in the eyes of our people. This is what we have to concern ourselves with.\\nPrensa Latina : Mr President, what is your opinion on Syria’s relations with Latin America, especially its historical ties with Cuba?\\nBashar al-Assad :Despite the enormous distance that separates Syria and Latin America, the level of knowledge that the people, not simply the politicians, in that region have, on this part of the world, never ceases to amaze us.\\nI think a number of factors account for this, one of which lies in the historical similarity and commonalities between Syria and Latin America.\\nFor much time, Latin American countries suffered from direct occupation. Thereafter they suffered the action of US companies, coup d’etats and US interference. This is why, the people of this region know what it means for a country to be independent or not. They understand that the war in Syria hinges upon its independence.\\nBut the most important thing in this part of the world is the role of Cuba, which has always been the launching pad of Independent Movements in Latin America. In this context, Fidel Castro is an icon.\\nAs a result, at the political level and in terms of knowledge-base, we can say that there are strong similarities between Syria and Latin America, especially Cuba.\\nBut I do not think that we are doing enough to improve other aspects of our relationship so that they are at the same level, basically in the sectors of education and the economy. This was my ambition before the crisis. I was in Latin America – Cuba, Venezuela, Argentina and Brazil– to strengthen our relationship. Then the conflict broke out and and it mutated into a huge obstacle pre-empting any action on this matter.\\nEven so, I do not think that our relations have to be limited to their historical and political aspects. This is not sufficient. There are several sectors and the inhabitants of both regions have to get to know each other better. Distance could prove an obstacle but not necessarily so, since we have strong relationships with the rest of the world to the East as well as the West.\\nI mean, today, distance no longer presents an obstacle. I think that if we manage to overcome the crisis and this war, then we will have to work with greater force to revive different aspects of this relationship with Latin America, especially with Cuba.\\nPrensa Latina : Mr President what are your expectations, what do you think of the current electoral process in the United States, especially the presidential elections? How do you think the result may influence the war in Syria?\\nBashar al-Assad :We renewed relations with the United States in 1974, 42 years ago. From that time we got to know various US leaders in different cases.\\nThe lesson that we have learnt is that noone must put their money on a US president. This is the most important thing. Thus the problem is not the name. They have institutions and their own agenda and each president comes to execute this agenda in his own way. But, he must, absolutely, comply with this agenda.\\nEveryone has military agendas. The only difference lies in the method of execution. One deploys its army, as Bush did, and others send in their mercenaries and agencies as Obama did. But every president has to fulfil this agenda.\\nI do not think that in the United States, the head of the White House is allowed to fulfil his political convictions. He has to submit to institutions and to pressure groups. And these groups have not changed; nor have the plans of institutions changed. This means that the US will not have in the near future, a president that can bring about a serious and radicial change in US politics.\\nPrensa Latina : What message do you want to sent out through this interview with Prensa Latina to the governments and peoples of Latin America and the Carribean, as well as the people of the United States, especially on the importance of supporting Syria’s struggle against terrorism?\\nBashar al-Assad :Latin America is a good example and important for the whole world on how countries and governments have succeeded in recovering their independence. This region is the backyard of the United States, but Washington has used it to try out its maneouvres and to execute its own agenda.\\nThe Latin American people have sacrificed a great deal to reach their independence and after recovering it, they transformed into countries on the path to development or even developed countries.\\nThus independence is something very important and greatly cherished by all Latin Americans. We consider that they must preserve it, because the United States will not stop working to topple any independent government that represents the great majorities in each country in this region.\\nCuba is very well aware of this and knows, more than any other country in the world, what I am talking about. You have suffered US manoeuvres more than any other country in Latin America and have successfully dealt with all these attempts for more than 50 years, only because your government represents the Cuban people.\\nThis demonstrates that holding a tenacious grip on this independence is of vital importance, in my judgement, for Latin America’s future.\\nWith respect to Syria, we can say that Syria is paying the price for its independence, because at no point in time have we acted against the United States, France or the United Kingdom.\\nWe have always tried to develop good relations with the West. But the problem with these [countries] is that they do not accept that any country is independent, and I think that this is the position they took with Cuba as well.\\nYou have never tried to damage or harm the people of the United States yet they do not accept you as an independent country. The same happens with the other countries in Latin America. This is why there have always been coups in these countries especially during the years 1960-70.\\nAnd this is why I think that preserving self-determination in a country cannot be achieved in isolation. If I want to be independent, then I have to support independence across the whole world, because if one acted alone, then I will be weak.\\nThe support for Syria will principally be in international fora. There are many organizations, notably the United Nations, despite its incapacity. Clearly, the support of these entities can perform an active role in supporting Syria.\\nThe natural [locus for support] is the UN Security Council and its position depends on its non-permanent members. The support of any other organization for Syria will also be important.\\nPrensa Latina : Mr President, we know that you are a very busy person and for this reason Prensa Latina highly values the time that you have granted us for this interview when your time is invaluable. We would wish to have this type of interview in the future with you. Thank you kindly.\\nBashar al-Assad :You will be welcome at any time.\\nBashar al-Assad Translation\\nAnoosha Boralessa\\nSource\\nPrensa Latina (Cuba)'"}, "time": 1742563786.4006348}