{"duration": 0.24724340438842773, "input_args": {"text": "'President Trump’s old office on the 26th floor of Trump Tower in Manhattan sits unoccupied now, unofficial storage space for the gathering trove of memorabilia that his two oldest sons say they hope will eventually be turned over to their father’s presidential library. But just one flight down, in Eric and Donald Trump Jr. ’s cramped offices, their father is    —   in the seven copies of a recent issue of Golf Digest with his photo and the headline “  ” on the cover stacked on Eric’s desk in his visage looping endlessly on CNN (yes, they watch CNN) in the cardboard cutout of the president watching from behind a stash of blueprints in the corner. This is the conundrum facing the two brothers as they assume control of the empire their father built: How do they move forward, and navigate the ethical shoals, at a business predicated entirely on the brand of the man they have vowed to distance themselves from? “His DNA will always be in the company in a big way,” Eric said, during nearly five hours of interviews over two days last week at Trump Tower. “His DNA built the company. His DNA also built us. We’re extensions of him in so many ways. ” Both he and Don Jr. insist that they do not need their father’s input to run the company  —   the apprentices have become the boss. And even as questions remain about potential conflicts of interest, they say, unapologetically, that they plan to forge ahead with expanding the Trump Organization’s footprint, both in the United States and abroad. On Saturday, in fact, they will cut ribbon at their company’s newest branded property, billed as a “magnificent golf course” in the booming United Arab Emirates city of Dubai, before hundreds of Emirati power brokers. A week later they will head to Vancouver, British Columbia, for another opening celebration, of the latest Trump International Hotel and Tower, one of a dozen major international projects still underway, from the Dominican Republic to India. Back home in the United States, they are planning to open a new boutique hotel chain,  Scion, in perhaps 30 cities. With the aggressive push forward, though, comes the persistent thrum of ethical qualm. Just last week, news that Eric had traveled to the Dominican Republic to restart a stalled project there prompted controversy, given the Trump Organization’s pledge of no new overseas deals. The Washington Post reported that when Eric visited Uruguay on business in January, the trip cost taxpayers nearly $100, 000 in hotel bills for the required Secret Service agents and for embassy staff members. Also echoing through the office at Trump Tower was the   over the decision by Nordstrom and several other retailers to stop selling their sister Ivanka’s clothing line. Don Jr. called that “disgusting,” and both brothers said their father was right to take Nordstrom and other retailers to task publicly in Ivanka’s defense. “He’s Papa Bear,” Eric said. Despite pressure to do so, President Trump has not sold any of his assets, which include a stake in a   office buildings, more than a dozen golf courses and at least 15 hotels that the company owns or manages. Instead, he has signed over control of    operations of his privately held company to the two sons and Allen Weisselberg, a trusted lieutenant at the Trump Organization, with an agreement not to discuss company business. The arrangement and the president’s decision to not release his taxes have brought widespread criticism from liberal groups and even the federal government’s top ethics watchdog, Walter M. Shaub Jr. the director of the Office of Government Ethics. President Trump has continued to frequent his commercial properties, including over the weekend in Florida, bringing them global media attention and potential new customers. But the brothers say they are convinced that they and their father have taken sufficient steps to create a management structure that will allow them to avoid creating the kind of appearance of conflict of interest that plagued Hillary Clinton as secretary of state while her husband continued to operate the Clinton Foundation. The measures they have taken, they say, have included explicit instructions to their domestic and international business partners not to reach out to anyone in the United States government for help. The brothers’ expressions tightened and their voices rose when they were asked, in separate interviews, about suggestions that their father was using the presidency as a way to enhance the family’s profits. “Who in their right mind would try to enrich themselves by spending a fortune to run against 17 seasoned politicians on the Republican side, to then go up against the Clinton machine, Wall Street, Hollywood, P. C. culture?” Don Jr. asked. “To use that as the way to enrich yourself is laughable. ” The family, he added, would face heat whatever it did. If the Trump Organization sold its assets, there would be allegations of impropriety, as foreign investors would most likely be involved. If it liquidated and put the cash into the bank, he said, his father would be accused of artificially inflating interest rates for personal gain. For critics, though, particularly Democrats in Congress, the continuation of the global operations of the Trump Organization  —   even if President Trump is not directly involved  —   is fraught with problems, with even some Republican observers questioning whether the brothers can steer clear of trouble, regardless of their intentions. Even with no new foreign deals, the company is in a position to get tax breaks and other business inducements from state and local officials. While such incentives are hardly unusual for growing businesses, with this family business they will unavoidably raise questions of whether different players involved might be seeking special White House favors. “People are going to offer them sweetheart deals,” said Peter Schweizer, the conservative author whose book “Clinton Cash” argued, among other things, that Mrs. Clinton had used her position as secretary of state to favor donors to the foundation. “It is just the way it works, as it comes down to the fact that people want access to national leaders in the country, and unfortunately in the past, be it Billy Carter, Neil Bush or Roger Clinton, relatives become vehicles to accomplishing that,” Mr. Schweizer added, referring to relatives in past administrations who drew scrutiny because of their business activities. The two oldest brothers have worked in various roles at the Trump Organization for much of their adult lives, but without their father’s daily presence  —   and with the departure of Ivanka from the company offices  —   their responsibilities have grown. Eric Trump, 33, oversees construction and says he, not his father, is now the named officer on hundreds of Trump companies. Don Jr. 39, is in charge of commercial leasing, as well as many of the remaining companies. And while they share a certain      look, their personalities are distinct. Don Jr. the Trump child with the clearest memory of the divorce that split up his family, is the most publicly confident, and the most politically conservative. Eric appears more cautious, more worried about how what he says will be perceived. Yet neither is particularly shy. “There has never been a Trump that is introverted,” Eric said, laughing. What is it like  —   after a lifetime as the sons of Donald Trump, and now business executives in their own right, and even   in a reality television show  —   to be the sons of the president of the United States? “It’s bigger, it’s bigger,” Eric said, struggling for the right word, then turning to a superlative, a habit inherited from his father. “This is really the biggest thing in the world. ” For all the talk of its global reach, the Trump Organization still has a family feel to it. The small offices assigned to Eric, Ivanka and Don Jr. are lined up in a row, with Ivanka’s, like her father’s, sitting unused since she left the company and moved to Washington with her husband, Jared Kushner, who is serving as a senior White House adviser. During the recent snowstorm in New York  —   with schools closed for the day  —   Don Jr. who has five children, had his    daughter in the office, sharing breakfast sent up from a restaurant downstairs. Trump Tower, by and large, seems back to normal since the building’s most famous resident moved to Washington, though Secret Service agents are still stationed in the Trump Organization lobby and elsewhere. Just days before his inauguration in January, Mr. Trump announced plans to resign from hundreds of entities he controls and place his assets in a trust. The move drew sharp criticism from ethics lawyers, who said the move was window dressing because Mr. Trump, as sole beneficiary of the trust, still owns the assets, benefits financially from any money they might make and will quite likely get updates, Eric said, roughly every quarter on the financial health of the company. Still, President Trump assigned control of the trust to Don Jr. and Mr. Weisselberg, with Eric as the sole member of what he described as an advisory council. The three men have to vote unanimously, Eric said, to make decisions regarding new deals and other major business decisions. To Don Jr. everything the company does these days seems to breed controversy. Much of it he says is unwarranted. For instance, people have questioned why corporate records in Delaware do not show that the president has resigned from his companies registered there. Eric says that he has, but that it can take more than a year for records there to be updated. And the brothers expressed irritation that their presence at their father’s announcement of Judge Neil M. Gorsuch to fill the Supreme Court vacancy provoked media reports that they were not honoring the agreement to stay clear of White House matters. In fact, they said, they were in Washington to visit the new Trump hotel in the Old Post Office Building on Pennsylvania Avenue and stopped by to say hello to their father and share in the historic moment. Don Jr. said he knew his father was busy, and had called him only once since his inauguration. Eric said he talked to his father “a few” times a week. But he insisted he knew which lines not to cross. “In the next four years, do I ever expect him to say: ‘Hey, how’s Turnberry? How’s the new green? How’s the new 10th tee? ’” Eric said. In a case like this, he said, he would probably say, “Dad, it’s great” and “The property looks awesome. ” He continued: “Am I ever going to say: ‘Listen. Hey, we have a tax issue’? No, no, no. There’s a difference. ” Recently the brothers stripped most of the photographs of their father and even his signature from the Trump Organization’s marketing material. And the new Scion hotel chain, which the company will brand and manage, does not feature the Trump name. Eric said they were hoping to locate Scion, offering a   alternative to their Trump International Hotel brand, in large to midsize “trendy” cities like Austin, Tex. Charlotte, N. C. and Nashville. One of the first Scion locations, Eric said, could be Dallas, where the brothers and their executive team are evaluating possible sites. They are in talks with a possible partner, Mukemmel Sarimsakci, a developer based in Texas who had previously considered projects with the Trump Organization in Iraq and Turkey, where he was born. Though the company runs the risk of becoming entangled with foreign partners on projects in the United States, and might have to deal with the suspicion that it got tax breaks and other incentives from local governments because of its ties to the White House, company officials say they decided not to stop domestic expansion because it is creating jobs for Americans. The Trump Organization said it had dropped a host of proposed projects overseas, including Trump Office Buenos Aires in Argentina Trump Towers Rio and Trump Hotel Rio de Janeiro, both in Brazil Trump International Hotel  Tower Baku in Azerbaijan Trump Tower Batumi in Georgia and Trump Riverwalk in Pune, India. Other deals still in the conceptual stage  —   including a possible office building in Dubai and towers in Australia, China, Israel and Vietnam  —   have also been shelved. “I was the first person to raise my hand and say you should not do certain deals, as I understood the optics, as you can’t build the tallest building in Tel Aviv and try to negotiate peace in the Middle East,” Eric said. He estimated that the company had canceled a billion dollars’ worth of deals  —   although this estimate could not be confirmed independently. Still, the company will continue to see through the dozen projects that the brothers say were underway before Inauguration Day and so do not qualify as new. They include two resorts in Indonesia Trump Tower Mumbai and a Trump tower in Gurgaon, also in India Trump Tower Punta del Este in Uruguay and a second golf club in Dubai, as well as the Dominican Republic resort, which was started in 2007 but stalled during the financial crisis. “That doesn’t mean the deal doesn’t continue to exist,” Eric said, amid the criticism last week that the project was a “new deal. ” Another Trump property in the ethical spotlight lately is    the oceanside estate turned private club in Palm Beach, Fla. that the president is styling as his winter White House. Mr. Trump arrived there again on Friday for a golfing visit with Prime Minister Shinzo Abe of Japan. “There should be no intermingling of White House and business operations,” said Robert Weissman, president of Public Citizen, who is troubled whether the president hosts the Japanese prime minister for free  —   at a commercial operation  —   or charges him, which would mean a foreign government official is paying Mr. Trump’s family. “There should be no intermingling of his private moneys with public affairs. ” Eric dismissed the questions as meaningless, comparing    to the Crawford, Tex. ranch of former President George W. Bush. He said his father was without peer when it came to forging friendships on the golf course, and his eyes grew wide as he talked about the family resort’s potentially becoming a place where world alliances are struck. To the Trump family, that mixing of business and officialdom  —   at least when it comes to their father’s visits  —   is just fine. “If he could do that with Putin, if he could do that with some of these horrible actors around the world who only want to compromise us as a country, and he can make them friends and they can have trust in one another, he just did something that not many presidents have been able to do,” Eric said.'"}, "time": 1742561752.2116368}