{"duration": 0.1438593864440918, "input_args": {"text": "'Les e-mails d’Hillary Clinton et la Confrérie par Thierry Meyssan L’enquête du FBI sur les e-mails privés d’Hillary Clinton ne porte pas sur une négligence face aux règles de sécurité, mais sur un complot visant à distraire toute trace de ses correspondances qui auraient dû être archivées sur des serveurs de l’État fédéral. Il pourrait comprendre des échanges sur des financements illégaux ou de la corruption, d’autres sur les liens des époux Clinton avec les Frères musulmans et les jihadistes.\\nRéseau Voltaire | Damas (Syrie) | 1er novembre 2016 ελληνικά English Español Türkçe русский Deutsch Hillary Clinton et sa directrice de cabinet Huma Abedin. La relance de l’enquête du FBI sur les e-mails privés d’Hillary Clinton ne porte plus sur les questions de sécurité, mais sur des trafics qui pourraient aller jusqu’à la haute trahison.\\nTechniquement, au lieu d’utiliser un serveur sécurisé de l’État fédéral, la secrétaire d’État avait fait installer à son domicile un serveur privé, de manière à pouvoir utiliser Internet sans laisser de traces sur une machine de l’État fédéral. Le technicien privé de Mme Clinton avait nettoyé son serveur avant l’arrivée du FBI, de sorte qu’il n’était pas possible de savoir pourquoi elle avait mis en place ce dispositif.\\nDans un premier temps, le FBI a observé que le serveur privé n’avait pas la sécurisation du serveur du département d’État. Mme Clinton n’avait donc commis qu’une faute de sécurité. Dans un second temps, le FBI a saisi l’ordinateur de l’ancien membre du Congrès, Anthony Weiner. Celui-ci est l’ancien époux d’Huma Abedin, directrice de cabinet d’Hillary. Des e-mails provenant de la secrétaire d’État y ont été retrouvés.\\nAnthony Weiner est un homme politique juif, très proche des Clinton, qui ambitionnait de devenir maire de New York. Il dut démissionner à la suite d’un scandale très puritain : il avait envoyé des SMS érotiques à une jeune femme autre que son épouse. Huma Abedin se sépara officiellement de lui durant cette tourmente, mais en réalité ne le quitta pas.\\nHuma Abedin est une états-unienne ayant été élevée en Arabie saoudite. Son père dirige une revue académique —dont elle fut durant des années la secrétaire de rédaction— qui reproduit régulièrement l’avis des Frères musulmans. Sa mère préside l’association saoudienne des femmes membres de la Confrérie et travaillait avec l’épouse du président égyptien Mohamed Morsi. Son frère Hassan travaille pour le compte du cheikh Yusuf al-Qaradawi, le prêcheur des Frères et conseiller spirituel d’Al-Jazeera.\\nÀ l’occasion d’un déplacement officiel en Arabie saoudite, la secrétaire d’Etat visite le collège Dar al-Hekma en compagnie de Saleha Abedin (mère de sa directrice de cabinet), présidente de l’association des Sœurs membres de la Confrérie. Huma Abedin est aujourd’hui un personnage central de la campagne Clinton, à côté du directeur de campagne, John Podesta, ancien secrétaire général de la Maison-Blanche sous la présidence de Bill Clinton. Podesta est par ailleurs le lobbyiste attitré du Royaume d’Arabie saoudite au Congrès pour la modique somme de 200 000 dollars mensuels. Le 12 juin 2016, Petra, l’agence de presse officielle de Jordanie, avait publié une interview du prince héritier d’Arabie, Mohamed Ben Salmane, affirmant la modernité de sa famille qui avait illégalement financé à hauteur de 20 % la campagne présidentielle d’Hillary Clinton, quoique ce soit une femme. Le lendemain de cette publication, l’agence annulait cette dépêche et assurait que son site internet avait été piraté.\\nSelon l’agence officielle jordanienne Petra du 12 juin 2016, la famille royale saoudienne a illégalement financé 20 % de la campagne présidentielle d’Hillary Clinton. Madame Abedin n’est pas la seule membre de l’administration Obama liée à la Confrérie. Le demi-frère du président, Abon’go Malik Obama, est le trésorier de l’Œuvre missionnaire des Frères au Soudan et président de la Fondation Barack H. Obama. Il est directement placé sous les ordres du président soudanais, Omar el-Béchir. Un Frère musulman est membre du Conseil national de sécurité —la plus haute instance exécutive aux États-Unis—. De 2009 à 2012, c’était le cas de Mehdi K. Alhassani. On ignore qui lui a succédé, mais la Maison-Blanche niait qu’un Frère soit membre du Conseil jusqu’à ce qu’une preuve surgisse. C’est également un Frère qui est ambassadeur des États-Unis auprès de la Conférence islamique, Rashad Hussain. Les autres Frères identifiés occupent des fonctions moins importantes. Il faut cependant citer Louay M. Safi, actuel membre de la Coalition nationale syrienne et ancien conseiller du Pentagone.\\nLe président Obama et son demi-frère Abon’go Malik Obama dans le Bureau ovale. Abon’go Malik est le trésorier de l’Œuvre missionnaire des Frères musulmans au Soudan. En avril 2009, deux mois avant son discours du Caire, le président Obama avait secrètement reçu une délégation de la Confrérie dans le Bureau ovale. Il avait déjà invité, lors de son intronisation, Ingrid Mattson, la présidente de l’association des Frères et Sœurs musulmans aux États-Unis.\\nDe son côté, la Fondation Clinton a employé comme responsable de son projet « Climat » Gehad el-Haddad, un des dirigeants mondiaux de la Confrérie qui avait été jusque là responsable d’une émission de télévision coranique. Son père avait été l’un des co-fondateurs de la Confrérie, en 1951, lors de sa recréation par la CIA et le MI6. Gehad a quitté la fondation en 2012, date à laquelle il est devenu au Caire le porte-parole du candidat Mohammed Morsi, puis celui officiel des Frères musulmans, à l’échelle mondiale.\\nSachant que la totalité des leaders jihadistes dans le monde sont soit issu de la Confrérie, soit de l’Ordre soufi des Naqshbandîs —les deux composantes de la Ligue islamique mondiale, l’organisation saoudienne anti-nationaliste arabe— on aimerait en savoir plus sur les relations de Madame Clinton avec l’Arabie saoudite et les Frères.\\nIl se trouve que dans l’équipe de son challenger Donald Trump, on compte le général Michael T. Flynn qui tenta de s’opposer à la création du Califat par la Maison-Blanche et démissionna de la direction de la Defense Intelligence Agency (Agence de Renseignement militaire) pour marquer sa réprobation. Il y côtoie Frank Gaffney, un « guerrier froid » historique, désormais qualifié de « conspirationniste » pour avoir dénoncé la présence des Frères dans l’État fédéral.\\nIl va de soi que, du point de vue du FBI, tout soutien aux organisations jihadistes est un crime, quelle que soit la politique de la CIA. En 1991, les policiers —et le sénateur John Kerry— avaient provoqué la faillite de la banque pakistanaise (quoi qu’enregistrée aux îles Caïman) BCCI que la CIA utilisait pour toutes sortes d’opérations secrètes avec les Frères musulmans tout autant qu’avec les cartels latinos des drogues.\\nThierry Meyssan'"}, "time": 1742563910.3951747}