{"duration": 0.07512235641479492, "input_args": {"text": "'Hillary Makes SCANDALOUS Stop After Rachel Maddow Breaks Down On LIVE TV Posted on October 30, 2016 by Rebecca Diserio in Politics Share This Hillary Clinton drinking on plane (left), Hillary at Jennifer Lopez concert last night (middle), Hillary at Miami bar today (right) \\nHillary Clinton is getting desperate and so is her lapdog media now that FBI Director James Comey dropped the bomb, re-opening the email investigation. Crazy happenings have just transpired in the last 24 hours, and you’ll love Hillary’s scandalous stop that’s making it so much worse as Rachel Maddow gets caught having a breakdown on live TV. \\nHillary embarrassed herself last night at a free concert given in her name by Jennifer Lopez and her ex-husband Marc Anthony. Hillary came out on stage and pandered so badly to the Latino community that it came off as repulsive. Rachel Maddow cries on live TV over Hillary Clinton’s campaign imploding over new email scandal with Anthony Weiner. \\nAfter Rachel Maddow learned that Hillary sustained what she called “a brick being thrown right at the Clinton campaign,” referring to James Comey’s actions, she was caught fighting back tears as another liberal hack tried to convince her that the FBI’s decision to re-open the email scandal is a big deal. \\nMaddow was hoping he would tell her not to worry and that Hillary can still win, but when she didn’t get that news she wanted, she became enraged and then fought back tears. However, it all got worse with what Hillary did this morning. \\nThis morning, Hillary Clinton was caught making a stop at a Miami bar before noon. That’s right, calling it a campaign stop, Hillary strolled into the bar, which looked like a sleazy kind of place, and created even more controversy for the candidate since her drinking has been a sore subject since day one of this campaign. False alarm on missing hillary. She\\'s at a bar in Florida…… Mid day on a Sunday \"campaigning\" #GoHillary \\n— Known patriot (@NCSBM) October 30, 2016 \\nAs Mad World News previously reported, “WikiLeaks email from her campaign advisor Jen Palmeri to campaign chairman John Podesta seems to indicate that having to sober Hillary up was a routine occurrence. However, since everyone was scared of her, no one wanted to do it.” \\n“Should I call her and talk this through or better to leave with you? I’m worried she’ll get on with Cheryl and we’ll end up in a bad place. I’m in a session that lasts till 3:30 your time. Is that timely or should I walk out?” … \\n“I just sent. Was getting my hair cut and trying to write all this on an iPhone. I think you should call her and sober her up some .” [via Wikileaks ] \\nHillary’s drinking problems are well known by Washington insiders, so after the last 24 hours, seeing the fallout as her campaign was squashed, making a stop at a Miami bar before noon makes perfect sense. \\nHillary’s going to need a lot more than Jennifer Lopez gyrating while wearing a thong on stage and Rachel Maddow crying on live TV to breathe life into her dead campaign. We better be on high alert for some manufactured scandal coming at Donald Trump. Too bad for Hillary, it will be seen for what it is — Hillary and her henchmen trying to save her unsalvageable campaign.'"}, "time": 1742563040.323424}