{"duration": 0.06465005874633789, "input_args": {"text": "'Alabama’s last execution may have burned a man alive because the “consciousness assessment” it administers is about as scientific as someone jostling you when you nod off on the sofa.\\nThis is clear from the firsthand account of Ms. Terry Deep, a federal investigator who witnessed the execution of Christopher Brooks at Holman Prison in Atmore, Alabama on January 21, 2016.\\nMs. Deep signed a sworn affidavit attached as an exhibit to an April 15, 2016 court filing in the case of Ronald Bert Smith detailing these observations; Mr. Smith is scheduled for execution in Alabama on December 8, 2016, and his federal defenders also represented Christopher Brooks.\\nMs. Deep’s account goes like this:\\n“After the Warden called for order and read the execution warrant, Mr. Brooks made his final statement. Warden Davenport then left the execution chamber, leaving [a correctional officer, identified only as D.F.] and the prison chaplain in the execution chamber. The chaplain walked over to Mr. Brooks, held his hand, and stepped away. Mr. Brooks’ breathing became rapid and shallow. D.F. called out Mr. Brooks’ name, raised his eyelids and reached behind Mr. Brooks’ left arm momentarily. Mr. Brooks’ eyes were closed at the end of this activity. D.F. stepped away from Mr. Brooks. Mr. Brooks’ breathing further slowed. Before the curtains were closed, Mr. Brooks’ left eye opened, and was still open when the execution chamber curtains were closed.”\\nUsing these critical observations, federal defenders based in Montgomery, Alabama, cogently argue that:\\n[Alabama’s] execution protocol uses potassium chloride, a drug that unquestionably causes an unconstitutional level of pain [.] [Alabama does] not intend to anesthetize [Ronald Smith]; rather, they intend to use a sedative with no analgesic properties to create the illusion of adequate anesthesia. [Alabama’s] protocol further creates an illusion of adequate anesthesia by having an untrained corrections officer conduct a “consciousness assessment” to determine whether an inmate is anesthetized prior to injection of potassium chloride, a drug that, if injected without adequate anesthesia, indisputably causes an unconstitutional level of pain.\\nBecause of the way midazolam works in the human body, it could sedate an individual to the point where he was incapable of communicating that he was in pain while doing nothing to suppress the experience of pain. Because midazolam is a sedative and not an analgesic, there is a high likelihood that an inmate who receives a high dose of midazolam would be unable to respond to the noxious stimuli that constitute the ADOC’s consciousness check, but would still feel the excruciating effects of the second and third drugs.\\nIn layman’s terms, what the public defenders are saying is, as human beings, if we insist on pumping caustic, corrosive drugs into other human beings, our Constitution, and specifically the Eighth Amendment’s prohibition of cruel and unusual punishment, demands it not cause excruciating pain.\\nIn the case of lethal injection, I respectfully submit, this is an impossible burden to satisfy because (1) thankfully, exterminating human beings is hardly an exact science, and (2) corrections officers who execute in Alabama, and for that matter nationwide – whose government paychecks come with a duty to kill – are not, when it comes to administering lethal injections, the sharpest tools in the shed. See Stephanie Mencimer, “State Executioners: Untrained, Incompetent, and ‘Complete Idiots’” ( Mother Jones , May 7, 2014) (quoting Dr. Jay Chapman, the Oklahoma coroner who helped create the modern lethal injection protocol, who observed in The New York Times in 2007, “It never occurred to me when we set this up that we’d have complete idiots administering the drugs.”).\\nIn Alabama’s executions, including Mr. Brooks’, the critical “consciousness assessment” the federal public defenders say, “is performed by a corrections officer who has received no medical training, whereas anesthesiologists receive extensive training in order to assess a patient’s depth of anesthesia. Not only must they graduate from college and medical school, they must follow this with four years of training before they can be certified to practice anesthesiology without supervision.”\\nAnesthesiologists (the reputable ones in the U.S. at least), however, won’t help Alabama, or any other state, to whitewash – using a seemingly mundane and sterile-looking medical procedure – the violent torture that lethal injection is. As Dr. J. Jeffrey Andrews, Secretary of The American Board of Anesthesiology wrote in May of 2014:\\n“[We] should never confuse the death chamber with the operating room, lethal doses of execution drugs with anesthetic drugs, or the executioner with the anesthesiologist. Physicians should not be expected to act in ways that violate the ethics of medical practice, even if these acts are legal. Anesthesiologists are healers, not executioners.”\\nFurthermore, as the federal defenders in Alabama highlight, even if anesthesiologists did violate their professional code of ethics and participate in the ignominy of public executions (and specifically, the grim but oh so important “consciousness assessment”):\\n“[A]nesthesiologists do not take such action based solely on a manual assessment, they also rely on the use of devices that monitor vital signs. The events of Christopher Brooks’ execution indicate that Defendants’ crude assessment conducted by an individual with no medical training creates a substantial risk of pain in violation of the Eighth Amendment. Mr. Brooks’ left eye opened after the consciousness assessment and assuming they even noticed, no one from the ADOC took any action.”\\nThe late Dr. Jack Kevorkian, nicknamed “Dr. Death,” was once, according to his New York Times obituary, called “a reckless instrument of death” who “poses a great threat to the public.” But, compared to corrections officers on the execution squad in Alabama, at least when Kevorkian sent people to their deaths, he had some medical training and whatever their efficacy, he used machines.\\nIn a 1958 paper Kevorkian once authored called, “Capital Punishment or Capital Gain?,” Quote: :\\n“Most of us are well aware that the ultimate ‘laboratory’ for testing every medical fact, concept or device is man himself …. In this logical and proper sequence of trial, the human subject at the end, the ‘ guinea pig ,’ is and always will be, the most difficult link to procure …. Viewing the problem purely realistically, capital punishment as it exists today, offers an unrivaled opportunity [.]” (emphasis added)\\nIt would appear the State of Alabama agrees.\\n Stephen Cooper is a former D.C. public defender who worked as an assistant federal public defender in Alabama between 2012 and 2015. He has contributed to numerous magazines and newspapers in the United States and overseas. He writes full-time and lives in Woodland Hills, California.'"}, "time": 1742628538.4557185}