{"duration": 0.09472441673278809, "input_args": {"text": "'License DMCA \\n1. Why do some people object to water fluoridation? Doesn\\'t fluoride occur in the water naturally anyway? \\nThe fluoride products used in water fluoridation (sodium fluoride or fluorosilicic acid) are classified as hazardous waste products of the fertilizer, aluminum, and nuclear industries. They are even more toxic than naturally-occurring fluoride, since they contain other components, such as arsenic and lead. \\nHowever, even naturally-occurring fluoride, in areas with high concentrations (over 1 ppm) have been found to have extremely adverse health effects. Even before additional fluoride is added, the level of natural fluoride in the water in many areas in the U.S. is already equal to the amount of naturally-occurring fluoride that has been found to cause skeletal fluorosis in other countries. Studies done in India and China found skeletal fluorosis in areas containing naturally occurring fluoride as low as .07 ppm. (Gupta R, Kumar AN, Bandhu S, Gupta S. (2007) Skeletal fluorosis mimicking seronegative arthritis. Scandanavian Journal of Rheumatology 36(2):154-5.) That same amount, .07 pmm is the current amount recommended by the CDC to be added to community water supplies. \\nIn addition to the natural fluoride in groundwater, most people are exposed to multiple sources of fluoride (pesticides in wine and food, tea, some ceramics, anti-depressants, pollution from manufacturing, soft drinks, Teflon pans, toothpaste etc.). They presumably are being exposed to well over the equivalent of 1 ppm before any fluoride is added to the water, however no industry or government testing has ever been done to find out how much fluoride the public is absorbing from all sources. This massive exposure to fluoride did not exist in the 1950\\'s, when fluoride was first introduced. \\n2. Don\\'t all advanced countries fluoridate their water? And hasn\\'t it been proven that countries that do fluoridate their water have better dental health than countries that don\\'t? \\nNo. Fluoridation has been almost completely abolished in Europe. Recently other countries, such as Israel and many parts of Australia, have discontinued fluoridation. Statistics gathered by the World Health Organization do not show any difference in rates of dental caries in fluoridated vs. non fluoridated countries. (WHO Collaborating Center for Education, Training, and Research in Oral Health, Malmo Univ., Sweden, 2012.) Where fluoridation has been discontinued in communities like Canada, the former East Germany, Cuba and Finland, dental decay has not increased but rather has continued to decrease (Maupome\\' 2001; Kunzel & Fischer, 1997, 2000; Kunzel 2000; Seppa 2000). \\nIn the U.S., the state of Kentucky, which has been fluoridating the longest, and has achieved almost complete fluoridation of its water supply, has the worst dental health of any state in the country. From an article appearing in the Lexington Herald Leader (10/14/2009): \"Governor Beshear said Kentucky led the nation in 2004 in terms of the number of people age 65 or older who had lost teeth. About 27 percent of Kentuckians of all ages had lost six or more teeth to decay or gum disease, compared with 18 percent in the rest of the nation.\" And yet, in 2004, 99.6% of Kentucky\\'s public water systems were providing fluoridated water to their customers. This ranked Kentucky first among all states.\" (Kentucky Epidemiologic Notes and Reports, Vol. 40. No. 8, Dept. of Public Health.) - Advertisement - \\nSimilar results were reported in Texas: \"After 9 years and $3 million of adding fluoride, research shows tooth decay hasn\\'t dropped among the poorest of Bexar County\\'s children, it has only increased--up 13 percent this year.\" (Conger J., 2011, San Antonio: Added to our drinking water: a chemical \\'more toxic than lead? \\' KENS 5 News.) \\nFor the best article analyzing the research on fluoridation worldwide, see the article by John Colquhoun, DDS, Phd (former Chief Dental Officer of Auckland, NZ): Why I changed my mind about water fluoridation (Perspectives in Biology and Medicine 41 29-44 1997, University of Chicago Press). Colquhoun studied the effects of fluoridation around the world, with the intention of proving how beneficial it was, but discovered, to his astonishment, that people in countries using fluoridation had the worst teeth. He then began crusading to put an end to the practice. \\nSince 1990, 144 cities have rejected water fluoridation. \\n3. Where did the idea of fluoridating the water come from? \\nIndustrialists in the aluminum and nuclear industries were under fire because of the harmful effects of the fluoride waste products being emitted from their plants--animals and people were being sickened for miles around. They hired Edward Bernays, who was the inventor of mass public relations campaigns (Bernays also happened to be the nephew of Sigmund Freud) to convince the American people that putting toxic waste in our water supply was good for us. - Advertisement - \\nBernays had organized a successful campaign, on behalf of Lucky Strike cigarettes, to convince American women that smoking was both glamorous and liberating. He hired models to pose as debutantes in a march for women\\'s rights. When Bernays gave the signal, all the women lit up their cigarettes. Another successful propaganda campaign that he orchestrated was the overthrow of a democratically-elected government in Guatemala on behalf of the United Fruit Company. The Nazis studied and made use of Bernays\\' techniques for their propaganda programs. (A more in-depth discussion of Bernays\\' role in the campaign to convince the public to accept fluoridation can be found in the video \"The Fluoride Deception\" at youtube.com, and the book with the same name by Christopher Bryson, Seven Stories Press). \\n4. OK, so maybe fluoridation hasn\\'t been proven to be effective in improving dental health, but what harm can it do to add it to our water supply? \\nFirst there is the cost factor. At a time when there is no money for schools, dental treatment for kids, support for the homeless and basic community services, counties are spending millions of dollars to fluoridate the water. Even worse, fluoridation has been associated with increased rates of kidney disease, Alzheimer\\'s, bone cancer, damage to the thyroid, increased bone fractures, hyperactivity, and decreased IQ in children. (See http://www.robertgammal.com/PDFs/SciFactsFluoride.pdf .) \\nAlthough adding hazardous waste to our water is not beneficial to anyone, it is particularly harmful to people with kidney disease (who can\\'t excrete it properly), infants (when mixed with formula it far exceeds the safe amount of fluoride), farmworkers (already exposed to fluoride in pesticides), tea drinkers, people taking anti-depressants, people with low thyroid, and those who have chemical sensitivities. Also adversely affected would be people who drink lots of water such as diabetics, athletes, and manual laborers.'"}, "time": 1742562200.3299103}