{"duration": 0.10415124893188477, "input_args": {"text": "'Be Sociable, Share! (Image: Lance Page/Truthout; Adapted: th.omas, Javier Carcamo/flickr cc) \\nThis is what it must feel like to be on Death Row, to be waiting for the moment when the iron door clangs open for the last time and four burly guards escort you arm-in-arm to the room where your life will be extinguished. That same sense of dread hangs over the presidential election of 2016. \\nNo one is happy about the election and no one anticipates better days ahead. America’s ‘glory days” appear to be in the rearview mirror while the steady downward slide seems to be gaining pace. This year’s presidential campaign has brought all the anger, anxiety and frustration bubbling to the surface. Nerves are raw, people are on edge, and the trepidation is so thick you could cut it with a knife. All the recent surveys tell the same story: Americans are sick of the mudslinging, sick of the scandals, sick of the recriminations, sick of the two party duopoly, and sick of the two candidates, the two most distrusted and reviled candidates in the country’s 230 year history. This is from the New York Times: “An overwhelming majority of voters are disgusted by the state of American politics, and many harbor doubts that either major-party nominee can unite the country after a historically ugly presidential campaign, according to the final pre-election New York Times/CBS News Poll… With more than eight in 10 voters saying the campaign has left them repulsed rather than excited, the rising toxicity threatens the ultimate victor. Mrs. Clinton, the Democratic candidate, and Mr. Trump, the Republican nominee, are seen as dishonest and viewed unfavorably by a majority of voters… After weeks of Mr. Trump’s accusations that the election is “rigged,” a little more than six in 10 of his supporters say they will accept the results as legitimate if he loses. More than a quarter of Mr. Trump’s supporters say they will probably not accept the outcome if Mrs. Clinton is declared the winner, and nearly 40 percent of them say they have little or no confidence that Americans’ votes will be counted properly.” ( Voters Express Disgust Over U.S. Politics in New Times /CBS Poll, New York Times) \\nThe growing sense of desperation in America today is palpable and it goes far beyond this one, isolated election cycle. The steady erosion of confidence in the nation’s main institutions is evident in Congress’s public approval ratings which seem to be stuck in single-digit territory. The public probably feels equal contempt for the Loretta Lynch Justice Department which is loaded with Clinton toadies that have done their best to quash any investigation into the illicit pay-to-play machinations at the Clinton Foundation. And, let’s not forget the media which has lost whatever shred of credibility it managed to salvage after its myriad of war-promoting lies about WMD, mobile weapons labs, aluminum tubes and Assad’s imaginary chemical weapons attacks, attacks that were invented from whole cloth at one of Washington’s many neocon think tanks where these fake ideas are typically hatched. The Forth Estate’s latest gambit is an idiotic attempt to prove that Vladimir Putin is trying to hack our thoroughly-corrupted Third World voting system to achieve some nebulous political gain. What a joke. \\nNo, Hillary, Putin is not gaming the system like you did in the primaries with Bernie Sanders, nor did he put a gun to your head and force you to delete the 33,000 missing emails from your private server. That was your handiwork Ms. Clinton, although you have a done a masterful job in deflecting attention from yourself and passing the buck for your own sleazy, criminal activities onto Moscow. \\nBut, back to the media. This from Gallup: “Americans’ trust and confidence in the mass media “to report the news fully, accurately and fairly” has dropped to its lowest level in Gallup polling history, with 32% saying they have a great deal or fair amount of trust in the media. This is down eight percentage points from last year. Gallup began asking this question in 1972, and on a yearly basis since 1997. Over the history of the entire trend, Americans’ trust and confidence hit its highest point in 1976, at 72%, in the wake of widely lauded examples of investigative journalism regarding Vietnam and the Watergate scandal. After staying in the low to mid-50s through the late 1990s and into the early years of the new century, Americans’ trust in the media has fallen slowly and steadily. It has consistently been below a majority level since 2007… Bottom Line:…the slide in media trust has been happening for the past decade. Before 2004, it was common for a majority of Americans to profess at least some trust in the mass media, but since then, less than half of Americans feel that way. Now, only about a third of the U.S. has any trust in the Fourth Estate, a stunning development for an institution designed to inform the public.” ( Americans’ Trust in Mass Media Sinks to New Low , Gallup) \\n“Designed to inform the public”??? \\nYou gotta be kidding? Droopy confidence in the media is a triumph for ordinary working people who have begun to see through the charade of “unbiased coverage” and realize that the corporate owners of the press manipulate the news to shape perceptions and maintain their stranglehold on power. That’s what’s really going on, and that’s why a growing number of people have swarmed to Donald Trump’s campaign. They see Trump’s lack of political correctness as a sign that he is not owned by the Washington oligarchy of racketeers who invent teleprompter candidates like Obama and Clinton who are never certain what they actually believe until they see it printed in bold letters on the screen in front of them. \\nTo large extent, Trump owes his shocking rise to the top of the GOP ticket to the fact that he shoots from the hip and that the media hates him. What was once a liability, has become an asset as trust for the despised media has plunged to depths never seen before. \\nBut that doesn’t explain what’s really driving this election and why are the American people so overcome by desperation? \\nIt’s all about economic insecurity. It’s all about the fact that standards of living are slipping, that an entire generation is bogged down with student debt, that all the good-paying jobs have been shipped to other countries, that family incomes are shriveling, that a good portion of the population feel threatened by immigration, that health care costs have skyrocketed, that retirement plans have been postponed, and that the great bulk of the nation’s wealth has been transferred to the 1 percent plutocrats and Wall Street landsharks who dictate policy through their Congressional lackeys and their allies at the Federal Reserve. That’s what the election is really all about. \\nPeople are waking up to the fact that the American dream is dead, that the US is no longer the land of opportunity, and that the lives of their children are going to be worse than their own, far worse. This is why everyone is so upset, so frustrated, so hopeless. They are looking for a political ally who will address their needs, and instead they get bromides on transgender bathrooms or “glass ceilings” or any of the other soothing slogans the Democrats use to pacify the masses and to keep them in the flock. Only now it’s not working as well. Now a sizable portion of the blue collar vote has shifted into Trump’s camp mainly because they see through the phony Democrat rhetoric and all the job-eviscerating free trade deals they’ve pushed for years. Trump has skillfully tapped into the collective psyche of millions of working people who feel the Democratic Party tossed them under the track-hoe 30 years ago and never looked back. And, he’s right, too. The Dems have sold out their supporters, and it’s only going to get worse under Clinton, or should we say, Madame TPP. Here’s how Nile Bowie summed it up in a recent article at CounterPunch: \\n“Economic disempowerment and political disenfranchisement have accelerated under President Obama, to the detriment of the American middle class. White, blue-collar Americans have witnessed the offshoring of their jobs and the erosion of their status in society, and Trump has masterfully stroked their resentment and discontent by playing on their fears of Muslims, immigrants and minorities… Trump’s real problem with the Washington establishment is that he isn’t part of it. His campaign represents an insurgent faction of the oligarchical class that aims to displace and replace the standing political elites. Bipartisan opposition to Trump is grounded in the belief that he would be an unreliable proxy and a liability, someone too narrow and unpredictable to manage the common affairs of the ruling class and the US deep state. Moreover, the US establishment is not interested in being led by such a contentious figure, who would draw protest and public opposition in a way that more conventional establishment candidates largely do not. For example, Trump’s rhetoric on immigration seems to engender more public outrage than the immigration policy under Obama, who has deported more people than any other president in history.” ( Election 2016: A Political System In Crisis , Nile Bowie, CounterPunch) \\nThe big money guys don’t like Trump, and they make no bones about it. But Trump isn’t going away and neither are his followers, a vast number of whom will not respect the results of the election if Hillary wins. That’s a big problem for elites who like to manage the population through the popular election sham. Now all that’s at risk. \\nAnd it’s not like Trump hasn’t bent over backwards to ingratiate himself with the deep-state powerbrokers either. He has. His first olive branch to the elites was the selection of Mike Pence as his running mate. Pence is a died-in-the-wool establishment Republican neocon who can be trusted to pursue the same extremist agenda the GOP has followed since the Gingrich revolution. But there was another big move that Trump made that escaped the notice of the media and which really underscores his willingness to “play by to the rules.” Here’s the story from Zero Hedge: “Six months ago, Steven Mnuchin became finance chair for the Trump campaign. Having successfully helped to raise 10s of millions of dollars for the campaign, the former Goldman Sachs partner and Soros Fund management employee is now positioned for something much larger as Donald Trump reportedly told his aides today that he wants Mnuchin to serve as his Treasury Secretary. \\nIronically, Trump has often criticized Clinton (and his former competitor Ted Cruz) for their links to the big banks: \\n“I know the guys at Goldman Sachs. They have total, total control over him. Just like they have total control over Hillary Clinton,” Trump said in one debate. \\nBut as we noted previously, he had no qualms, however, in hiring one of the most prominent Goldman alums to raise money for him. \\n…for Trump, a self-professed “anti-establishment” candidate, who has repeatedly stated he is not “for sale to special interest groups”, his sudden call for the seemingly most “Wall Street” of Wall-Streeters to become Treasury Secretary may come as a big surprise to some and will leave many of his supporters demanding an explanation.” ( Trump Wants Former Goldman Partner And Soros Employee To Serve As Treasury Secretary , Zero Hedge) \\nAnother head of Treasury from G-Sax? \\nThat figures. \\nTrump is great with the rabble-rousing “take back your country” tirades and all the gibberish about the “rigged” system. But he also knows how to cave in when it suits his interests. He knows he’s not going to be president without Wall Street’s nod, so he’s enlisted a trusted insider to take care of business at Treasury. It’s a signal to the bigwigs that they don’t have to worry about the Donald going off the reservation. (wink, wink) So much for Trump’s independence, eh? \\nAnd what can we say about Hillary Clinton that hasn’t been said a million times before? \\nClinton, who still holds a slim lead in most of the polls, is clearly the establishment candidate in a year when hatred for the corrupt Washington oligarchy, has reached levels not seen in the last hundred years. The fact that Hillary can run for the nation’s highest office while being investigated by the FBI, while being savaged by the daily releases of new, incriminating emails (from WikiLeaks), and while promoting a hawkish, neocon-driven foreign policy that portends a direct military confrontation with Russia, speaks to the fact that traditional liberal Democrats are either still hoodwinked by the Democratic Party’s manipulation of identity politics or simply terrified of the alternative, Donald Trump. \\nAnd that’s why everyone is so utterly dejected and depressed about the election, because instead of voting for a candidate they really want or admire, most people are simply voting for the candidate that either disgusts or scares the hell out of them the least. What kind of choice is that? \\nIn less than 48 hours, the most agonizingly-wretched campaign of all times will be over, the ballots will be counted, and the new president will be named. The only thing that is certain is that, whoever wins, we lose.'"}, "time": 1742628504.979109}