{"duration": 0.1755204200744629, "input_args": {"text": "'There are those who refuse to believe what is right before their very eyes. When will America stand on its own two feet and put an end to the incessant corruption in Washington? By Ed Mattson\\nFollowing the public disclosure by FBI Director, James Comey, a mountain of evidence was presented in a press conference regarding Democrat Presidential Candidate, Hillary Clinton, addressing Clinton’s illegal and unauthorized use of a home server to communicate State Department business. Such a breach of security was shocking as well as eye-opening as to how far Clinton’s thirst for financial gain was willing to go. \\nIt was blatantly clear that Hillary’s attempt to hide her activity in communications with members of her staff, the President himself, foreigners trying to buy access and favoritism with U.S. government personnel, and those seeking federal contract bid preferential treatment, was something that would not be tolerated by law enforcement anywhere . With Comey however, whom the media continues to portray as a Republican , stated the U.S. Government would not seek an indictment. By the way, for the record, Comey claims he hasn’t voted Republican for years!\\n\\nWith the Department of Justice and pressure from the highest office in the land, we can clearly see that in America there is no longer equal justice for all, and that powerful politicians can do just damn-well anything they chose if their name is Clinton, or they are members of the Democrat Party. Comey even had the gall to proclaim that he saw no intent by Clinton to hide her activities, in defiance of logic, common sense, and all rational thinking.\\nNO INTENT? WHY ELSE would Hillary use a private, unsecured server, then purposely destroy tens of thousands of emails, smash cell phones, wipe computer server hard drives, and then lie about it? No . . . her intention was clear to all except those blind Democrat hacks, and many of our poorly educated automatron citizens being turned out by the government controlled school systems who simply don’t pay attention to anything but Dancing with the Stars .\\nHillary is as qualified to be president as John Gotti if he were still alive today. Yes . . . I said John Gotti, The Teflon Don , who headed the Gambino Crime Family in New York. \\nDefinition of the word “mafia”: noun Meaning a hierarchically structured secret organization allegedly engaged in smuggling , racketeering, trafficking in narcotics , and other criminal activities. \\nJohn Gotti took over the reins of the most powerful crime family in America when he organized the murder of Paul Castellano in December 1985. Crazy as it may seem, his outspoken personality and flamboyant style, gained favor with much of the general public, giving him near-celebrity status.\\nThe FBI was hot on the trail of Gotti and accumulated enough evidence to put him on trial three times in the 1980’s, but he was acquitted in each case. The media was there as one would expect, and insured each trial was given high-profit status. It was later revealed that the trials had been tainted by jury tampering and juror misconduct when George Pape , a jury foreman in the 1987 trial reached out to Gotti’s underlings, who agreed to pay him $75,000 in exchange for a not guilty vote. Pape was later convicted of jury tampering and sentenced to three years imprisonment.\\nThe tables turned in 1991 when “Sammy the Bull” Gravano turn state’s evidence and testified against Gotti. Gravano, after hearing Gotti making several disparaging remarks about him via an FBI wiretap, calculated his only route to survival was to help the FBI put Gotti away in prison. The wiretaps revealed Gotti had implicated Granvano in numerous murders. In 1992, Gotti was finally convicted of five murders, conspiracy to commit murder, racketeering, obstruction of justice, illegal gambling, extortion, tax evasion, and loansharking. Gotti was sentenced to life in prison without the possibility of parole, but died in 2002 of throat cancer.\\nNow . . . that brings us around to Mrs. Clinton, apparently the new Don of the Clinton Crime Family. We can go back some thirty years that we have had to put up with the Clintons: Clintonomics, inside trader deals on cattle futures, Travelgate, Filegate, and a very long list of people being killed, dying of mysterious causes, deaths said to be suicides but appear to be more like mob hits with gunshots to the back of the head or behind the ear.\\nWe all know people who have died. It is part of life, right? But how many people can you name who have been friends, business associates, acquaintances, or just people you have heard of that committed suicide, died of mysterious or questionable deaths, or from just plain freaky accidents? One, five, possibly ten?\\n\\nCheck out the Clinton scorecard . It is all over the Internet! Forty would be on the low side and many believe the tally runs closer to 100 or more. Pure coincidence the Clintons and the media want you to believe. Do the research and take a close look at the deaths ruled by suicide involving friendly medical examiners . Check out the ones who committed suicide with multiple gunshot wounds, or those who shot themselves behind the ear and in the back of the head – typical of a mob-hit. It would appear that knowing the Clintons is more dangerous to your health than either cancer, smoking, and a lot more dangerous than global warming!\\nWhile the Clinton haven’t been accused of loansharking or tax evasion (though getting a deduction for old used underwear might be an indication to call for an audit), there is a smell of The Mafia in the air anytime the name “Clinton” comes up. Going back to the scandals of the Mena, Arkansas drug running with Dan Lasater (Political researcher, Mark Gorton, calls him part of the Clinton/Dixie Mafia ), to the money laundering of the Clinton Foundation. Their history looks even more damaging than the many cases filed against the Gambino Crime Family, but most involve the security of our country.\\nThey say that Hillary didn’t respond to the pleas for security and then for help the night of the Beghazi attack, because there was no way for her to make money on any such decision. Hillary’s modus operandi has always been financial gain. To hell with ethics; to hell with honesty or integrity, and with complete disregard for the wellbeing of the country. . . that’s Hillary in a nutshell.\\nThe Clinton Crime Family’s list of self-serving espionage of our country can be easily seen in the transfer of U.S. technology to America’s adversaries. At Clinton’s urging, Russia was allowed to purchase control of Uranium One through their state atomic energy agency, Rosatom; In return, the Russian paid Bill a heavy $500,000 for a short speech PLUS a healthy donation from Uranium One’s Chairman of $2.35 million for the Clinton Foundation.\\nHillary bashed Donald Trump over legitimate business dealings with the Russians, yet the Clinton Crime Family is far more involved with Russian under-the-table dealings than the media will ever report. Clinton cut a deal with Yeltson to repay Clinton’s long-time political donor, Dan Tyson. Russia was sending nuclear technology to Iran, and to keep America from interfering with that arrangement, Clinton got Yeltson to lift the ban on shipments of poor quality chickens that had been levied on Tyson Brand Chicken by the Russians.\\nBut that was only the tip of the iceberg in the Russian-Iran sell-out according to infowars.com: \\n“Clinton allocated over $1 billion to “help” the Soviets “dismantle” their nuclear weapons. In 1995 the General Accounting Office (GAO) wrote that Moscow refuses to permit American audits of the $1.25 billion disarmament aid. “One and a half years after President Yeltsin told President Clinton that ballistic missile technology transfers to Iran would stop, it still continues… Now time is running out; the stakes are great… Unless this problem is solved we see a potential trainwreck in our relations.” Why was it up to Yeltsin to end the transfers? Why was Clinton allowing Russia to give defense secrets to Iran?”\\nThe Russians weren’t the only beneficiaries of the Clinton Crime family give-a-way of our military technology. In the 1990’s, Clinton was involved in granting favorable treatment for General Motors in China. Clinton engineered a deal to give-a-way our technology for guidance systems for ICBMs under the lie it was to aid the Chinese space program. Because of the transfer of such delicate technology, China is now able to aim its ICBMs with accuracy at American targets; up to that time this technology had not yet been figured out by Chinese engineers. General Motors’ Hughes division provided the missing pieces.\\nOne has to learn that when the Democrats and in particular, the Clintons, accuse anyone of wrong doing, you have to look deeper in that you will undoubtedly find they are more deeply involved in even worse dealings.\\nA good start for someone searching for the truth about the Clintons, you might want to review a movie the media and the left absolutely trashed (and endorsement which makes it worth seeing) Dinesh D’Souza’s latest movie, Hillary’s America: Secret History of the Democrat Party . Funny thing is, I don’t hear any of those on the left being able to dispel Souza’s documentation. Or review the claims made in The Clinton Chronicles – another hate-fest by the Left that should be seen.\\nThere will probably be many who reply to the information I have thus presented with name calling and hate mail. I expect it, but please respond with counter-evidence, or facts that debunk what I have written about. Those who have communicated with me about articles I have written, were surprised to learn that I wrote them back and told them, I actually learned from their input.\\nSource: Veterans Today \\n'"}, "time": 1742563310.207649}