{"duration": 0.2828226089477539, "input_args": {"text": "'Posted on November 4, 2016 by DavidSwanson \\nFor the past eight years millions of people have expended billions of words speculating about exactly how the United States kills people with missiles from drones (and missiles from other sources, such as manned aircraft, targeting people identified with drones). There is good reason to believe that for each such attack there exists a video and audio record of what the drone pilots saw and what they and their colleagues said to each other as they decided to launch a missile and as they observed its results. \\nThis is a level of documentation we rarely have with killings by domestic police officers, who are typically filmed by observers with phones, a method of documentation that excludes the leadup and the aftermath. \\nIt’s also a level of documentation that is almost entirely denied to the public, meaning that it doesn’t actually do us much good. As far as I know we have not seen a single video or heard a single audio recording of a drone murder. The “Collateral Murder” video is a powerful record of a non-drone attack. \\nWith drones, however, we do have one (incomplete) transcript of what was said during the hours leading up and the minutes following one particular attack. This was an attack in Afghanistan in February 2010 that killed zero fighters but numerous innocent civilians. According to survivors, 23 men, women, and children were killed. According to the U.S. military 15 or 16 were killed and 12 wounded. The U.S. military apologized and paid some $4000 to the family of each acknowledged victim. \\nThe ACLU obtained the transcript in 2011, and it was published by the Los Angeles Times , which wrote an account of the incident, but I didn’t pay much attention until the new film, National Bird , dramatized part of it. I think it deserves a bit longer excerpt than either the Times or National Bird provided. So, here is my selection plus commentary. Feel free to read the whole thing at the links above and make of it what you may. \\n00:38 (JAG25): We are going to hold on containment fires and try to attempt PID, we would really like to take out those trucks. \\nPID means positive identification. This individual is eager to send missiles into trucks on the ground in Afghanistan but is aware of the need to identify somebody in one or more of them as an armed fighter. In fictional fantasies like Eye in the Sky or presidential speeches, targets must exclude any possibility of killing civilians and the targeted people must be known, specifically identified, be beyond any possibility of arrest, and be “immediate and continuing” threats to the United States of America. None of those criteria or anything like them are even discussed in this actual drone attack. Instead, the question of whether to launch hellfire missiles at automobiles is whether the targeted people are males over 10 years old and whether at least one of them has a gun. As we’ll see, even those standards are not met, but they are discussed. \\n00:38 (Slasher03): Copy that. Break, break, Slasher, we passed you coords for the vehicle on the west side of the river again you have multiple dismounts in the open break. On the east side of the river there’s an additional vehicle majority of the dismounts are inside a compound located just to the north of that vehicle if you get eyes on that compound. Compound has multiple movers as well as one pickup truck hot. \\n00:38 (Slasher03): Kirk97, Slasher in addition if you’re able to pick up illumination it appears the two vehicles are flashing lights signaling between. \\nBefore anyone was murdered on this day, everyone was discussed for hours with words like “vehicle,”“compound,”“dismounts,” and “movers”— which simply has to have a different impact than “cars,”“houses,”“pedestrians,” and “people walking around.” \\n… \\n00:41 (Pilot): Does he have a weapon? \\n00:41 (Sensor): Can’t tell yet \\n00:41 (MC): Can’t tell \\nCLASSIFIED \\n… \\n00:42 (Kirk97): Jag25/Slasher03/Kirk97 we are eyes on a vehicle, personnel in the open, definite tactical movement, cannot PID weapons at this time, how copy? \\n… \\nStill, they are hoping to positively identify a weapon. But, in the absence of that justification, they have spotted “definite tactical movement.” How, one wonders, given that these were a bunch of civilian commuters, does such movement differ from a handful of families and students walking about and arranging themselves into a couple of SUVs and a pickup truck? \\n00:43 (Sensor): possible mortars (reference to what the JTAC is trying to PID) \\n00:43 (Pilot): Kirk97, good copy on that, be advised personnel in the open, by the vehicles moving tactically definitely carrying objects at this time we cannot PID what they are however we’ve got eyes on and we are working our best \\n… \\nSo now there are automobiles with objects and human beings in them, and those automobiles are moving (as they are principally designed to do). \\n00:44 (Jag25): Jag25, roger, ground force commander’s intent is to destroy the vehicles and the personnel, right now Kirk97 is showing that the individuals egressed the trucks holding cylindrical objects in their hands *radio static* \\n… \\nPersonnel egressed some trucks, meaning that some people got out. And they had objects with them. As you read on, see if you notice eagerness or wariness to interpret such a phenomenon as a threat. \\n00:44 (Pilot): Be ready for a lot of (exploitive deleted) squirters dude \\n00:44 (Pilot): These guys look to be lookouts, man \\n… \\nPeople who get out and walk away from a group are “squirters” though not yet “bugsplat” (what drone pilots have sometimes called those they’ve killed). They are also “lookouts.” This identification of them as “lookouts” is made on the basis of the fuzzy little green linear shapes these people appear as in the video being observed, not on the basis of a high resolution color image in which something like binoculars or facial expressions could be identified. \\n00:45 (MC): See if you can zoom in on that guy, ‘cause he’s kind of like \\n00:45 (Pilot): what did he just leave there \\n00:45 (Pilot): Is that a *expletive* rifle? \\n00:45 (Sensor): Maybe just a warm spot from where he was sitting; can’t really tell right now, but it does look like an object \\nWell an object could be a rifle. There’s at least a 1% chance, as Dick Cheney would say. \\n00:45 (Pilot): I was hoping we could make a rifle out, never mind \\nWhy was this man or woman hoping that? Why not fearing it? After all, it could mean being ordered to do something horrific: to kill. Even believing that killing to be somehow justified and possibly even somehow legal, the drone pilot of our imagination faces it regretfully and somberly. Not these guys. \\n00:45 (Sensor): The only way I’ve ever been able to see a rifle is if they move them around, when their holding them, with muzzle flashes out or slinging them across their shoulders \\n… \\nAnd yet no such identification happens on this day. Nonetheless, 23 people lose their lives while others lose their limbs. You can see the survivors and hear them tell their stories in National Bird. \\n00:48 (Slasher03): jaguar25, slasher03 again, on the west side you have 10 pax that are dismounts that appear to be huddled down, hunkered down, holding position they are all static on the east side, you have the original vehicle with 2 dismounts waiting outside, believe you had up to two to three to four that are still inside the vehicle, then just north of that position you have the compound where our 1 individual exited the vehicle and rendezvous, you have multiple movers within that compound as well as a hot pickup truck \\n… \\nPax does not of course mean peace. It means passengers. “Hot” I believe actually means hot, as pilots are able to observe heat recorded by heat sensors. They sometimes observe the cooling of a body on the ground as the blood leaves it. \\nEND OF 0023z VIDEO SEGMENT BEGINNING OF 0054z VIDEO SEGMENT \\n… \\nThe line above suggests that there is a video we could be shown. Exactly whose embarrassment — er, I mean, national security — overrides our right to see it? \\n00:54 (Jag25): … we believe we may have a high level Taliban commander … \\n… \\nDon’t they always? If you want to prove they don’t always, make the videos public. \\n00:55 (Pilot): wouldn’t surprise me if this was one of their important guys, just watching from a distance, you know what I mean? \\n00:55 (Sensor): yea he’s got his security detail \\n… \\nA group of people, by virtue of containing multiple people, is now wishfully seen as a Taliban bigshot with a “security detail.” \\n00:55 (Pilot): … Be advised on the west side of the river we still have one vehicle with ten pax, two lookouts, could be definite tactical movement with a commander over watching, definitely suspicious how copy? \\n… \\nThese bees are acting suspicious, said Winnie the Pooh. \\n00:56 (JAG): roger good copy, due to distance from friendlies we are trying to work on justification, we’re gonna need PID \\n00:56 (Pilot): Good copy on that, no PID on weapons at this time only tactical movements on the west side, can you pass coords for the east please? \\n… \\n00:59 (Sensor): not sure what compound they came from or what we are apparently dealing with. \\n… \\nThese guys have no idea who they are looking at, but they are working on coming up with a “justification” to murder them. \\n00:59 (Pilot): what about the guy under the north arrow, does it look like he is hold’n something across his chest \\n00:59 (Sensor): yea it’s kind of weird how they all have a cold spot on their chest \\n00:59 (Pilot): It’s what they’ve been doing here lately, they wrap their *expletive* up in their man dresses so you can’t PID it \\n… \\nThe conversation oozes with respect for the people whose country is being “liberated.” \\n1:00(Sensor): maybe five in the back of the bed 1:00 *broken radio chatter* \\n1:00 (Jag25): Jag25 have you loud and clear \\n… \\n1:01 (Pilot): Jag25, Slasher03, Kirk97 it looks like the dismounted pax on the hilux pickup on the east side is carrying something, but we cannot PID what it is at this time but he is carrying something \\n1:02 (Sensor): He slung it on his shoulder whatever it was, just switched arms with it or something, and is getting in the truck \\n… \\n01:03 (Sensor): the screener is reviewing, they think something is up with that dude as well. I’ll take a quick look at the SUV guys, sorry \\n1:03 (JAG25): Slasher03 JAG25 1:03 (Sensor): what do these dudes got, yeah I think that dude had a rifle \\n1:03 (Pilot): I do too \\n… \\nThere’s a wishful guess that a group of two dozen people traveling through an extremely dangerous country might have a gun. Wait and see what that is taken to justify. \\n1:04 (Pilot): All players, all Players from KIRK97, from our DGS the MAM that just mounted the back of the hilux had a possible weapon, read back possible rifle \\n… \\n1:04 (JAG25): Kirk we notice that, but you know how it is with ROEs, so we have to be careful with those, ROE’s *broken radio chatter* \\n… \\n1:04 (Sensor): sounds like they need more than possible \\n… \\nA MAM is a military aged male and an ROE a rule of engagement. These guys are figuring out that they should come up with more than the possibility of a gun before blowing up this convoy. \\n1:05 (JAG25): copy, slasher03 1:05 (Sensor): that truck would make a beautiful target, ok that’s a Chevy suburban \\n1:05 (Pilot): yeah, \\n… \\nBeautiful. \\n1:07 (MC): screener said at least one child near SUV 1:07 (Sensor): bull (expletive deleted)…where!? \\n1:07 (Sensor): send me a (expletive deleted) still, I don’t think they have kids out at this hour, I know they’re shady but come on \\n1:07 (Pilot): at least one child… Really? Listing the MAM, uh, that means he’s guilty \\n1:07 (Sensor): well maybe a teenager but I haven’t seen anything that looked that short, granted they’re all grouped up here, but. \\n… \\nThe eagerness to spot a gun is just not matched by eagerness to spot a child. And having a child on the road with his or her family early in the morning is taken as a sign of evil deeds. Or if the child is a military aged male (later defined as having an age in the “double digits”) that is taken as “guilt.” Guilt is the language of a court. Drone piloting has often been discussed as law enforcement, although it violates numerous laws and does not enforce any. \\n1:07 (Pilot): Yeah review that (expletive deleted)…why didn’t he say possible child, why are they so quick to call (expletive deleted) kids but not to call (expletive deleted) a rifle \\n1:08 (MC): two children were at the rear of the SUV… I haven’t seen two children \\n… \\n1:09 (Sensor): little bit of movement by the SUV. I really doubt that children call, man I really (expletive deleted) hate that. \\n… \\n1:10 (MC): is this the child entering the rear of the SUV? \\n1:10 (Sensor): they’re moving, I’ll stay with the pickup truck \\n… \\n1:11 (Pilot): they just threw someone into the back of that truck, and were like, wrestling with somebody did you see that? \\n1:11 (Senor):Yeah I saw those two dudes wrestling. \\n1:11 (Pilot): they probably are really using (expletive deleted) human shields here, that’s probably what that is. \\n… \\nHere is an incredible case of believing ones own propaganda. People are here imagined to be forcing victims into their trucks in order to use them as “human shields,” a phenomenon as ill conceived in U.S. culture as “voter fraud.” \\n1:21 (Pilot):yeah, exactly man. So what’s the, we passed him potential children and potential shields, and I think those are both pretty accurate now, what’s the ROE on that? \\n1:21 (Sensor): Ground commander assessing proportionality, distinction \\n… \\nAnd here we are back to eye-of-the-murderer medieval “just war” theory in which someone pretends to determine that killing a certain number of children would be “proportionally” acceptable, although no empirical test of such a thing has ever been devised, and President Obama claims that no shots are fired by his drone warriors without “near certainty” that no civilians will be harmed. You can’t calculate how many civilians are acceptable to kill AND claim that you’re certain of not killing any. \\n01:32 (Sensor): Wonder what these other dudes at this compound are doing. Picked‐up at third vehicle on their train. \\n01:33 (MC): Guilty by association. \\n… \\nI suppose they know that’s not a legal term. \\n01:48 (Pilot): JAG25 just want to confirm that you copied we have about 20 pax dismounted, they are outside the trucks praying at this time and we’re 3 1⁄2 miles from the friendly location. \\n… \\n01:48 (Sensor): … Praying? I mean seriously, that’s what they do. \\n01:48 (MC): They’re gonna do something nefarious. \\n… \\nWhen I was very briefly in Afghanistan I didn’t meet anyone who didn’t pray. I also didn’t meet anyone who did anything nefarious. I have also never heard a presidential speech in which President Obama explains that he targets people who pray. \\n01:50 (MC): Adolescent near the rear of the SUV. \\n01:50 (Sensor): Well, teenagers can fight. \\n01:50 (MC): Pick up a weapon and you’re a combatant, it’s how that works. \\n… \\nGot that? \\n01:52 (Sensor): Oh sweet target. I’d try to go through the bed, put it right dead center of the bed. \\n01:53 (MC): Oh that’d be perfect. \\n01:52 (Sensor): Like more of them from the other vehicles are around this one right now. \\n… \\nSuch cool, level headed reluctance to use excessive force is no doubt what we would hear in police videos as well. \\n01:54 (Sensor): MAM near SUV appear to be holding a weapon. \\n01:54 (Jag25): Roger, still awaiting confirmation. \\n01:54 (Pilot): JAG25 be advised, our screener just called 1 MAM near the SUV in the line of 3, appears to be holding a weapon. \\n… \\n01:56 (MC) :one weapon on ground may have picked it up and walking around the pickup. \\n01:56 (Sensor): I didn’t quite catch that but I believe it. \\n… \\nI didn’t see it either. Should I believe it too? \\n02:29 (Pilot): Can’t wait till this actually happens, with all this coordination and *expletive* \\n(agreement noises from crew) \\n02:29 (Pilot): Thanks for the help, you’re doing a good job relaying everything in (muffled), MC. Appreciate it \\n… \\n02:48 (Sensor): Still a sweet *expletive* target, geez….Take out the lead vehicle on the run and then uhh bring the helos in \\n… \\n02:54 (MC): Looks like they’re bringing a Reaper in \\n… \\n02:54 (Sensor): *Expletive*that, man \\n02:54 (MC): just claim we’re here first \\n02:54 (MC): At least we know these guys have weapons \\n02:55 (Muffled talking off comms, some profanity, a chuckle) \\n… \\nLaughing and eagerness to be the one to pull the trigger. \\n02:58 (Sensor): Hey, that dude just put a weapon down right above the truck. See it? \\n02:59 (Pilot): See it. See if DGS will call that \\n… \\nDGS is an office that is supposed to approve before eager pilots push the button. A veteran in National Bird describes routinely trying to restrain the eagerness of pilots at Creech Air Force Base to kill. \\n03:01 (Sensor): Aww where is he going? Just pulling off the road maybe. They probably mostly left their weapons in the vehicles. I’ll be damned, it looks like a short dude back there. \\n… \\nNo weapons? They must be inside. A child? It must be a short dude. \\n03:05 (Pilot): Jag 25 standby one. Kirk 97, we’re checking. Looks mostly to be military aged males. We have seen approximately two children. Standby. \\n03:05 (Pilot): Dude the only thing I can see if this isn’t something [expletive deleted]is the locals trying to get away. You know what I mean? But I don’t think so. \\n… \\nHere a pilot surmises the situation accurately but chooses not to believe it. \\n03:06 (Sensor): 24 or 25 at the praying stop. \\n03:07 (Sensor): CLASSIFIED view I saw the one that looked short enough to be a child. \\n… \\n03:08 (Pilot): And Jag 25, our screeners are currently calling 21 MAMs no females, and 2 possible children. How copy? \\n03:08 (JAG25): Roger. And when we say children, are we talking teenagers or toddlers? \\n03:08 (Sensor): I would say about twelve. Not toddlers. Something more towards adolescents or teens. \\n03:08 (Pilot): Yeah adolescents \\n… \\n03:10 (Pilot): And Kirk 97, good copy on that. We are with you. Our screener updated only one adolescent so that’s one double digit age range. How Copy? \\n03:10 (JAG25): We’ll pass that along to the ground force commander. But like I said, 12‐13 years old with a weapon is just as dangerous. \\n03:11 (Sensor): Oh we agree. Yea. \\n… \\n04:05 (Pilot) : Yeah. Alright, so the plan is man, uh, we’re going to watch this thing go down, the helo’s are going to take out as much as they can and when they Winchester we can play clean up. \\n… \\n04:07 (Pilot) : As long as you keep somebody that we can shoot in the field of view I’m happy. \\n… \\nHappy! It’s good to stay positive about your job! Everybody knows that. \\n04:09 (Pilot) : Yeah, well that’s what we were talking on this. I was talking to the JTAC he said the exact same thing man. Um they called them an adolescent. We called it you know… most likely double digits age range. And he was like that’s old enough to be dangerous. \\n… \\n04:13 (Pilot): It’s a cool looking shot \\n04:13 (Sensor): O, awesome'"}, "time": 1742562838.537369}