{"duration": 0.0315248966217041, "input_args": {"text": "'GREENSBORO, N. C.  —   President Obama is weighing a “proportional” response to Russia’s efforts to interfere with this fall’s election campaign through hacking, the White House announced Tuesday. “The president has talked before about the significant capabilities that the U. S. government has to both defend our systems in the United States but also carry out offensive operations in other countries,” Josh Earnest, the White House press secretary, told reporters traveling with Mr. Obama on Air Force One to Greensboro, where he was holding a town   meeting with students and campaigning for Hillary Clinton. “There are a range of responses that are available to the president, and he will consider a response that is proportional,” Mr. Earnest said. Whatever the president opts to do would probably not be announced in advance and may never be acknowledged or disclosed if it is carried out, Mr. Earnest said. On Friday, the Obama administration publicly acknowledged for the first time that it believed that the Russian government was responsible for stealing and disclosing emails from the Democratic National Committee and a range of other institutions and prominent individuals, most recently Hillary Clinton’s campaign chairman, John D. Podesta. The emails were posted on the   WikiLeaks site and two newer sites, DCLeaks. com and Guccifer 2. 0. “Only Russia’s   officials could have authorized these activities,” said a statement from the director of national intelligence, James R. Clapper Jr. and the Department of Homeland Security. The statement did not name President Vladimir V. Putin of Russia, but that appeared to be the intention. Emails from the Democratic National Committee appeared to show party officials conspiring to sabotage the campaign of Senator Bernie Sanders of Vermont, leading to the resignation of Debbie Wasserman Schultz as chairwoman and the departure of several staff members from the organization. Much of the Russian efforts in the election appear directed at undermining the campaigns of Mrs. Clinton and other Democrats. Donald J. Trump, the Republican nominee, has called Mr. Putin a better leader than Mr. Obama and suggested a more collaborative relationship between the United States and Russia. The Russian efforts have become a talking point in the campaign. In Sunday’s debate, Mrs. Clinton called Russia’s interference in the campaign unprecedented. “And believe me, they’re not doing it to get me elected,” she said. “They’re doing it to try to influence the election for Donald Trump. ” In the debate on Sept. 26, Mr. Trump said the identity of the hackers was unknown and “could be somebody sitting on their bed that weighs 400 pounds, O. K. ” On Sunday night, he again suggested that Russia might not be to blame for the email releases and said that “they blame Russia because they think they’re trying to tarnish me with Russia. ” “I know nothing about Russia. I know  —   I know about Russia, but I know nothing about the inner workings of Russia,” Mr. Trump continued. “I don’t deal there. I have no businesses there. I have no loans from Russia. ”'"}, "time": 1742628495.7133534}