{"duration": 0.0692594051361084, "input_args": {"text": "'NRI Muslim returns to India from US, says intolerance is over now Posted on Tweet (Image via knowyourmeme.com) \\nAn Indian Muslim, who has been residing in the United States for the past one year, has finally decided to return home after the results of the US presidential election were announced. \\nJaved Ayub, a 30-year-old software developer, who had left for the US last year after getting a job offer during the dark days of intolerance in India ahead of Bihar election, had come to the realization yesterday that normalcy had finally been restored in India and hence there was no reason for him to live in a foreign land anymore. He immediately mailed his resignation letter to his boss and uploaded his resume on Naukri.com. \\nSpeaking to our correspondent, Mr. Ayub said, “I realized yesterday that my country needed me, but I was unsure as to whether the election results triggered the thought or I was really missing my homeland. Later when I was watching a movie…” \\n“Swades?” we inquired. \\n“Hmm, so while watching the movie, I could hear my heart pleading to me, “Ye jo des hai tera, swades hai tera, tujhe hai pukaaraaaa…” \\n“Is it actually possible?” \\n“Don’t know about yours but my heart definitely can sing.” \\n“But why did you leave India in the first place?” \\n“Well, let’s be honest, things were not that great last year.” \\n“But nothing has changed since then. People still fight over issues they are not remotely concerned about in reality.” \\n“That happens only on the internet. Do the same people fight in real world? No.” \\n“But can you really live peacefully amid sanghis and bhakts?” \\n“Arrey, no no, we never classified anyone. When there are 1.25 billion people living together, there will be difference of opinions, but we need to resolve our differences amicably, because at the end of the day, we are one big family.” \\n“Anyway, that was a good decision. So, whom did you support in the US election?” \\n“Hillary Clinton.” \\n“Was it because of Trump’s anti-Muslim statements or was there any other reason behind it?” \\n“No, no other reason. He is a racist and that’s why I did not support him. If I had a voter Id card, I would’ve voted against him,” his eyes darted towards a poster of Madonna on the wall in his living room as we concluded the interview.'"}, "time": 1742562903.8320608}