{"duration": 0.03725624084472656, "input_args": {"text": "'CNN    Chris Cillizza urged readers Friday to “stop talking” about disgraced former congressman Anthony Weiner, arguing that “there’s literally no reason to write or talk about [him] anymore. ”[“Can we now stop talking about Anthony Weiner? Like, forever?” says the headline of Cillizza’s piece.   Weiner pled guilty Friday to a charge of sending obscene material to a minor. The    girl alleged that he sent her nude photos, discussed his “rape fantasies,” and encouraged her to engage in sexually explicit conduct. Weiner will have to register as a sex offender and could face jail time. On the same day, his wife and top Hillary Clinton aide Huma Abedin reportedly filed for divorce.  The plea appears to mark the end of the saga commonly known as “Weinergate,” which began in 2011 when the late Andrew Breitbart reported that Weiner  —   then a New York congressman  —   had been sending explicit pictures of himself to women online. Breitbart was mocked and derided by mainstream media commentators, some of whom initially called on outlets to ignore his reporting. Weiner’s “sexting” led to his resignation from Congress and later torpedoed a 2013 New York mayoral comeback run when similar messages emerged. In 2016 yet more images emerged, as well as the allegation he had sent messages to the minor. The FBI opened a probe into Weiner’s behavior and in the course of that investigation discovered emails on his laptop sent to Weiner by Abedin that originated from Hillary Clinton’s private email server. This, in turn, led   Director James Comey to announce in a letter that the agency was revisiting the probe into Clinton’s homebrew server on Oct. 28, throwing her presidential campaign into turmoil.  Clinton has dubiously blamed that letter, along with alleged Russian interference, for her election defeat. If one believes Clinton’s assertion, it makes the   “Weinergate” one of the most important political scandals in modern history. Yet, Cillizza says, on the same day Weiner pled guilty, that it is time for everyone to move on and never talk about the disgraced Democrat again. Cillizza’s argument centers on the claim that Weiner has ultimately always sought attention. Here’s the thing: We know that Weiner craves attention  —   even the negative kind. What else would explain his decision to allow documentary cameras into his   trainwreck mayoral campaign?  Cillizza says it’s time to refuse him that attention. Now that Weiner is “irrelevant politically,” it’s time to stop. Let’s not get back on that ride. No matter what he says or how much remorse he expresses, it’s clear that attention fuels Weiner. It’s his lifeblood. So let’s not give it to him. The legal proceedings are now closed. Weiner is totally irrelevant politically. His wife, who remains a major player in Hillary Clinton’s orbit, has filed for divorce, according to CNN’s Dan Merica. There’s literally no reason to write or talk about Anthony Weiner anymore. It isn’t the first time Cillizza has sought to end discussion on a difficult political subject for Democrats. Writing for The Washington Post in 2016, Cillizza wrote a piece, “Can we just stop talking about Hillary Clinton’s health now?” which complained about “wacky theories that emerge out of the fever swamps on the very fringe of the conservative movement. ” Less than a week later, at a Sept. 11 memorial, Clinton collapsed and was pictured being dragged into a van by aides. The same day, Cillizza wrote a new hot take: “Hillary Clinton’s health just became a real issue in the presidential campaign. ” Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742628541.6161728}