{"duration": 0.2100820541381836, "input_args": {"text": "'LOS ANGELES  —   Sequel fatigue does not fully explain it. Nor does an overload of   event movies. A spate of terrible films? Yes, but that’s not entirely the explanation, either. In a summer when studios suffered more misfires than ever, many of them supersized, Hollywood is scratching for answers, and some longtime movie executives are pointing toward a nuanced shift in consumer behavior. For the first time since moviegoing became a staple of American life, an underappreciated revenue engine  —   ticket buyers who still trek to theaters more for the experience than for the movie itself  —   may finally be conking out. “We’re in a situation where, if people don’t get excited about a specific movie and plan in advance to go to it, you may end up with literally no one,” said Adam Fogelson, the former chairman of Universal Pictures who now runs STX Entertainment’s film unit. When movies do not seem worth the hassle, and there seem to be many more of those, there is less of a cushion for studios. Is it because the number of people just wandering in is dwindling? Theater owners and some analysts dismiss that idea, saying studios are refusing to look inward for explanations for a cavalcade of summer disappointments, including “The BFG,” “Teenage Mutant Ninja Turtles: Out of the Shadows,” “The Nice Guys,” “Ghostbusters,” “The Legend of Tarzan,” “Independence Day: Resurgence,” “Neighbors 2: Sorority Rising,” “Alice Through the Looking Glass,” “Warcraft,” “Ice Age: Collision Course,” “Hands of Stone,” “Star Trek: Beyond” and “Now You See Me 2. ” “ ” cost    and Paramount Pictures at least $150 million to make and market, but was savaged by critics and took in only $11. 2 million during its first weekend in theaters. That’s the Hollywood equivalent of “literally no one. ” (An art house example: Despite starring Matthew McConaughey and Naomi Watts, “The Sea of Trees” last month collected a total of $2, 894 over its first two weeks in two theaters.) Sequelitis and an overload of event movies have been blamed for much of the carnage. But sequels have sputtered before. The collapse of “Happy Feet Two” and the “Chronicles of Narnia” series led to similar anxiety a few years ago. “We think the issue is less that audiences are tired of sequels, and more that there are now so many sequels that they are cannibalizing each other,” Doug Creutz, an analyst at Cowen and Company, wrote in a report on Thursday. Nor is it just that the summer offerings were particularly awful. “The data suggests differently,” Mr. Cruetz wrote, noting that the summer’s 29 widely released movies had an average score of 57. 7 percent positive on the   site Rotten Tomatoes, the highest in 16 years. The lack of clear answers has led to    —   “Could This Be the Year Movies Stopped Mattering?” asked a Wired headline last month  —   and studio theorizing about    factors, like a decline in patrons who decide what film to see while standing in line. Most people would never consider arriving at a theater without a specific movie in mind. Astoundingly, though, more than a quarter of all ticket buyers still decide what film to see only after showing up, according to PostTrak, an audience polling service owned by comScore. Theaters offer supporting anecdotal evidence. “Our members say the most common questions their ticket sellers get are ‘What’s good?’ and ‘What’s playing next? ’” said Patrick Corcoran, vice president of the National Association of Theater Owners. Still, while data is scarce, PostTrak does show an erosion. In summer 2014, about 32 percent of people made their decision while in line at a theater. In 2015, the number was about 28 percent. PostTrak discontinued research on this audience segment in March, leaving studios to guess at what happened over the 2016 summer season, which started on May 6 and ends on Monday. If the    crowd is dwindling, the reasons include the comparative ease of other forms of entertainment (HBO Go, Netflix) the increasing cost of moviegoing (now $17. 25 per adult at the ArcLight chain’s Hollywood location, before   upcharges) and the movie business itself, which has aggressively pushed one kind of event movie (lumbering,    sequels) at the expense of variety. The increasing popularity of online ticketing and reserved seating may also be playing a role. At Fandango, “there has been a shift from   purchase to advanced purchase,” according to Harry Medved, a company spokesman. Last week, AMC Entertainment, the No. 1 theater chain in North America, said that all nine of its locations in New York City would soon offer reserved seating. “In the olden, olden days, people went to see whatever was playing, but people today, flooded with niche entertainment programming, don’t want to spend money on a movie they are only   in seeing,” said the film historian Jeanine Basinger, whose books include “The Star Machine. ” When hauling the family to the theater seems worth it, the upside can still be enormous, Ms. Basinger noted. “Finding Dory” and “Captain America: Civil War,” both from Disney, were the top draws of the summer, collecting a combined $891 million at North American theaters, according to comScore. Third place went to Universal’s “Secret Life of Pets,” which took in $360 million a sequel is already in the works. On a smaller scale, STX Entertainment hit the jackpot with its modestly budgeted “Bad Moms,” which passed $100 million over the weekend, and Sony similarly succeeded with “Sausage Party,” which has taken in about $90 million. Warner Bros. powered “Lights Out,” a horror movie made for $5 million, to $66 million in ticket sales. Over all, the handful of blockbuster hits made up for the misses  —   at least for theater owners, who will collect roughly $4. 49 billion at the summer box office, on par with 2015, according to comScore. (Last summer was one week longer.) Attendance is expected to total 513 million, a 3. 5 percent decline. For the year, theaters have generated about $8. 11 billion in ticket revenue, a 5 percent increase attendance is up about 1. 2 percent. But the misfires have added up for studios, most of which have been spending more on individual films as they search for global hits. Warner Bros. Sony, Universal, 20th Century Fox and Paramount all had diminished or nonexistent profits in the most recent quarter. Disney was the exception, with a huge $766 million in profit, a 62 percent increase from the same quarter a year earlier. But even Disney has struggled recently. Its last three   releases have been duds: “Alice Through the Looking Glass,” “The BFG” and “Pete’s Dragon. ” And, over the Labor Day weekend, a fourth, “The Light Between Oceans” is expected to sell a disappointing $6. 3 million. “We didn’t see a lot of middle ground this season,” Dave Hollis, Disney’s executive vice president for theatrical distribution, said on Sunday. “There are probably multiple reasons why, starting with the fact that people are making their selections much more carefully. ”'"}, "time": 1742562889.8730626}