{"duration": 0.04363083839416504, "input_args": {"text": "'Mariah Carey suffered through a performance train wreck in Times Square on New Year’s Eve as malfunctions left her at a loss vocally during her hit song “Emotions,” struggling to reach notes and to sync the lyrics and music. The trouble continued when she gave up on another of her   numbers, “We Belong Together,” while a recording of the song continued to play, a confirmation that she had been  . But on Sunday, a dispute erupted between Ms. Carey’s representatives and producers of ABC’s “Dick Clark’s New Year’s Rockin’ Eve With Ryan Seacrest,” on which the singer was performing. Ms. Carey’s manager, Stella Bulochnikov, charged that the show’s producers had been aware of technical problems but did not fix them  —   and chose to continue showing Ms. Carey’s messy performance “to get ratings. ” “I will never know the truth, but I do know that we told them three times that her mike pack was not working and it was a disastrous production,” Ms. Bulochnikov told Us Weekly magazine on Sunday. “I’m certainly not calling the F. B. I. to investigate. It is what it is: New Year’s Eve in Times Square. Mariah did them a favor. She was the biggest star there, and they did not have their” act together. Dick Clark Productions, which produced the show, issued a statement on Sunday night saying that Ms. Carey’s performance woes had nothing to do with the production, and that any suggestion that the company “would ever intentionally compromise the success of any artist is defamatory, outrageous and frankly absurd. ” “In very rare instances, there are of course technical errors that can occur with live television,” the statement said, adding that an initial investigation suggested that the production company “had no involvement in the challenges associated with Ms. Carey’s New Year’s Eve performance. ” A veteran audio producer, Robert Goldstein of Maryland Sound International, a company that has worked on the Times Square event for years, also said in an email that there had been no malfunctions with the sound equipment he oversaw. “Every monitor and   device worked perfectly,” Mr. Goldstein said. “ I can’t comment beyond that and don’t know what her nontechnical issue may have been. ” A spokeswoman for Ms. Carey said on Sunday that the singer was not at fault for her performance. “Unfortunately there was nothing she could do to continue with the performance given the circumstances,” the spokeswoman, Nicole Perna, told The Associated Press. It was a rare meltdown on national television by one of the   recording artists of all time. Ms. Carey, a pop phenomenon in the 1990s who won five Grammys out of 34 nominations over the years, was the final   act on ABC’s “Dick Clark’s New Year’s Rockin’ Eve With Ryan Seacrest. ” She had just finished “Auld Lang Syne” when her star turn began to spiral out of control. “We can’t hear,” she said in the opening seconds of “Emotions” after she sashayed down the stage before more than one million people who had gathered to watch the ball drop in Manhattan. Standing still with her left hand on her hip while music played, Ms. Carey told the audience that there had not been a proper sound check before her performance. Then she said, “We’ll just sing,” and noted proudly of her song, “It went to No. 1. ” But she could not manage the notes that followed, and she either forgot lyrics or did not want to deliver a subpar performance. “We’re missing some of these vocals, but it is what it is,” she said. “Let the audience sing. ” ABC quickly cut to shots of the Times Square crowd as Ms. Carey tried to perform some of her choreography. She continued suggesting fixes from the stage, and at one point seemed to defend herself. “I’m trying to be a good sport here,” she said. When the number ended, the crowd cheered her on. “That was  —   ” she said, pausing for effect, “amazing. ” She seemed to recover at first with “We Belong Together,” but there appeared to be another malfunction, and Ms. Carey again stopped singing. But this time, the prerecorded number kept playing. “It just don’t get any better,” she said, and then left the stage. The cause of the problem was not immediately clear. After the performance, Ms. Carey posted a mildly profane slang phrase on Twitter with an “upset” emoji, then wrote: “Have a happy and healthy new year everybody! Here’s to making more headlines in 2017. ” An ABC spokesman said on Sunday that the network would not comment on the problems with Ms. Carey’s performance.'"}, "time": 1742628443.0556922}