{"duration": 0.08929443359375, "input_args": {"text": "'President Donald Trump and Vice President Mike Pence have steered a course during the administration’s first 100 days that   activists have been dreaming about for decades. [“I think if you looked ten years ago, and you asked the question, ‘Will Planned Parenthood be defunded in the next decade?’ everyone would have said, ‘No,’” Susan B. Anthony List (SBA List) President Marjorie Dannenfelser tells Breitbart News. “But the presidency of Donald Trump and the vice presidency of Mike Pence have changed all that. ”  The   base of the Republican Party saw the beginnings of change from the start of Trump’s presidency. Within days of his inauguration, Trump signed an executive order that reinstated the Mexico City Policy, a rule that bans   organizations (NGOs) receiving U. S. funds  —   including International Planned Parenthood  —   from providing or promoting abortions overseas. The administration, however, not only reinstated the policy  —   which other Republican presidents have done  —   but also updated it by directing the secretary of state to expand it across all global health assistance funding, a move that ensures taxpayer funds will not support organizations that promote or participate in the management of a coercive abortion program. The United Nations Population Fund (UNFPA) for example, is one such organization, with its long history of supporting China’s   population control program, an agenda that has included forced abortions. Later in January, Trump tweeted his personal support for the March for Life  —   the world’s largest   demonstration  —   which convenes in Washington, DC, each year on the anniversary of the Supreme Court’s Roe v. Wade decision: The #MarchForLife is so important. To all of you marching  —   you have my full support!  —   Donald J. Trump (@realDonaldTrump) January 27, 2017,    activists, however, had even more reason to rejoice when Pence, a champion of the movement, became the first vice president to address the March for Life. The vice president will also serve as the keynote speaker of SBA List’s 10th annual gala on May 3. It was Dannenfelser who led the coalition that met with Trump and Pence during the campaign to outline a   agenda for a Trump administration, which included four policy commitments in a letter to   leaders: Trump has already started on the path to fulfilling his promise to nominate   justices to the Supreme Court. National   leaders hailed the newly confirmed Justice Neil Gorsuch as “reminiscent” of the late Justice Antonin Scalia, who regularly applied an originalist approach to the Constitution. The nomination led some   leaders to praise Trump as a “man of his word. ” Dannenfelser explains that much has changed in the   movement within the past decade because the “horrendous underbelly” of Planned Parenthood has been exposed. “And it wasn’t exposed for decades,” she says. “They were the Teflon organization no one could touch them. President George H. W. Bush was part of the reason for the original funding of Planned Parenthood. ” The national   leader says Planned Parenthood  —   the nation’s largest abortion provider  —   had for decades been likened to “the Red Cross” or a “nurses’ organization administering to suffering people. ” “Nobody wanted to touch that,” she explains. “So, clearly, there has been a turn in the understanding of what this organization is about. It took a lot of brave people who were willing to be slandered to question that. ” Recently, for example, California prosecutors charged the Center for Medical Progress video makers  —   who recorded Planned Parenthood officials allegedly selling the harvested body parts of aborted babies for a profit  —   with 15 felonies. The charges continue a long string of attacks by the abortion giant and its political and media allies against activists exposing its operations. The Trump administration reportedly unofficially informed Planned Parenthood it would have to cease performing abortions to keep its taxpayer funding. House Republican leaders  —   with support from the Trump administration  —   put forward the American Health Care Act (AHCA) legislation that contained a provision to defund Planned Parenthood for a   period. Though conservatives were successful in thwarting the bill because it failed to fully repeal Obamacare, Trump would likely have signed it if Congress had passed it, ending Planned Parenthood’s funding for a year.   leaders now hope Congress will put forward a single reconciliation bill to defund Planned Parenthood. Two weeks ago, Trump also signed a resolution that overturns former President Barack Obama’s rule that forced states to provide family planning grants under Title X to Planned Parenthood and other abortion providers. The measure passed the House but required Pence as vice president to break the tie vote in the Senate due to the votes against it by Sens. Susan Collins ( ) and Lisa Murkowski ( ). Trump, formerly   acknowledges he has adopted the   view. Some concerns have arisen, however, about the influence his daughter Ivanka  —   an apparent supporter of Planned Parenthood  —   would have on the president’s   agenda. Several weeks ago, a report surfaced that Ivanka held an “  ” meeting with Planned Parenthood President Cecile Richards to discuss possible “common ground” on the abortion issue. Asked whether she views Ivanka’s perhaps more conciliatory tone toward Planned Parenthood as a threat to the future of the   agenda, Dannenfelser quickly dismisses the idea. “I really do think this president understands what it is about  —   his commitments, his promises. And he’s got a vice president who knows how to lead the way legislatively,” she says. “I’m not concerned. ”'"}, "time": 1742563195.5413487}