{"duration": 0.08885717391967773, "input_args": {"text": "'Burning Fall Leaves Is Extremely Toxic For The Body & Planet Nov 8, 2016 0 0 \\nWith it being the time of autumn here in the northern hemisphere, the leaves have begun to fall and the colors have begun to change. In what has been a common practice of raking leaves and burning the piles, information is spreading as to why that practice is actually very harmful for people and the planet. Burning leaves is harmful to the health of a person. \\nAccording to Wisconsin’s Department of Natural Resources , burning leaves creates a large amount of dust, soot and other airborne particulates as a result of the often slow process that burning leaves takes. These toxic particles have the ability to reach deep into the lungs, which can cause long-term respiratory issues as well as short term issues to like coughing, wheezing and an accentuation of asthma issues. \\nMore specifically, burning leaves creates smoke which contains carbon monoxide. This is deadly as it binds with hemoglobin in the bloodstream, which then drastically reduces the amount of oxygen circulating through the body. A bit further down, we’ll look at supplements a person can take if they are exposed to leaf smoke. \\nThe smoke from leaves also contains benzo (a) pyrene , which is a known carcinogen as it binds to and mutates DNA and is thought to be a major factor in cancer from cigarette smoke. \\nAdditionally, according to the U.S. Environmental Protection Agency , the concentrations of pollutants coming from leaf smoke can be higher than all other forms of air pollution combined, including factories, vehicles, garden and lawn equipment. \\nInstead of burning leaves, one can consider composting them or looking into whether your town or city offers pick-up services for the leaves. Ensure though that the leaves are not being burned at a larger collection site. Consider composting your fall leaves. \\nComposting leaves creates a wonderful after-effect by helping to create nutrient rich soil that can be used for potting plants or growing a garden. Ensuring that the leaves are shredded will help to speed up the decomposition process as well as including a source of nitrogen, which could be freshly cut green grass, animal manure or a product from your local home and garden store that helps to catalyze the process. One such product would be beneficial microbes . Supplements \\nIf you are exposed to leaf smoke, the first and most obviously thing a person can do is to get as far away as possible from the smoke. The second would be to get to a place where the air is clean and begin doing deep in and out breaths to replenish your body with oxygen. \\nIf a person was exposed for a lengthy period of time to the smoke, eating plenty of green vegetables and salads greens is a great way to not only detoxify the body of harmful pollutants, but also to give your body plenty of chlorophyll, which will help to carry oxygen throughout your bloodstream and into your cells. \\nSupplements one can consider include chlorella and spirulina, which are both an algae that contains almost all known nutrients needed in the human body as well as a rich supply of chlorophyll. \\nA person can also look into fulvic acid , which is the most potent anti-oxidant known and is excellent at removing toxins and metabolic waste from the body. \\nIs there someone in your neighborhood that could benefit from this information? Or someone in your family? Let us all create healthier bodies and a cleaner atmosphere. \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and practices health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information on how to receive health coaching for yourself, a family member or a friend as well as view other inspiring articles.'"}, "time": 1742564506.3246903}