{"duration": 0.08918023109436035, "input_args": {"text": "'Wednesday, 16 November 2016 \\nWhat a week it has been for the Son of the Almighty. \\nTuesday, Jesus himself was seen at the Tampa\\'s infamous The Honey Pot night club, a night spot known for its super-hot drag show. A copy of Jesus\\'s bar tab reveals he and his \"posse\" of Lucifer ( a.k.a \"Lu\"), Peter and Paul who were in town visiting from Miami\\'s South Beach and his PR-man-cum-handler, John from the New testament, ran up a 2,400-dollar bar tab consisting of bottles of Crystal champagne and bottles of Ciroc vodka. \\nSince coming out of retirement to handle the End Times (signaled by the candidacy of Donald Trump and the emergence of the second Biblical Beast of Revelation, Mike Pence), Jesus has been quite a man around town, being seen at the hottest, newest and trendiest clubs and some of the seediest backwater bars, often extremely drunk and occasionally abrasive. \"The stress is getting to him, sure,\" his handler, John, confessed. \"I mean, his Old Man calls him out of retirement, ends his vacation and tells him he has to restore peace on Earth, and meanwhile he\\'s got Trump and Pence claiming they\\'re actually Christians - yeah, it irritates him. He\\'ll be okay, though. He\\'s got a good resume.\" \\nThe revelry escalated to the point of Jesus ushering several transvestite dancers behind the silken ropes of his VIP section, where things got admittedly sloppy. \"Yeah,\" The Prince of Darkness, Lucifer, admitted. \"Things did spiral out of control, got a little crazy. I\\'m kind of feeling it today.\" Lucifer was referring to Jesus\\'s bumping and grinding with his new cross-gendered \"friends\" and taking body shots off of their surgically implanted breasts. \\n\"Sodom and Gomorrah had nothing on that place, man,\" The Prince of Peace admitted. \"I thought Dad was going to send down the old fire and brimstone by the time Peter and Paul were swinging on the stripper pole.\" \\nThough The Almighty didn\\'t set the club ablaze for their transgressions, the pictures of Jesus carousing with his ambiguously gendered friends did set social media on fire. The rumor mill kicked into full gear and people began to question Jesus\\'s \"orientation.\" He seemed to be enjoying his new \"friends\" from the club a little bit too much. \\n\"I\\'ve known Jesus for a very long time,\" the Apostle Paul said candidly when asked about Jesus\\'s sexual preference. \"I know for a fact he\\'s not. I mean you can ask Mary Magdalene, and a whole bunch of other females in the Old World. I mean, he put the \\'fertile\\' in the Fertile Crescent, you know what I mean? And trust me, I know fabulous when I see it.\" \\nLong-time lawyer friend, Pontius Pilate, commented: \"Absolutely not. Not a chance. That\\'s nothing but slander and libel - and maybe a little wishful thinking on some people\\'s parts. You know everyone wants a piece of a celebrity. But no, he\\'s as straight as the Path of the Righteous. It\\'s this social media. He\\'s not too savvy with, you know? Didn\\'t grow up with it. I\\'ve discussed it with him a hundred times. He really needs to be more careful in this day and age.\" \\nJesus himself showed up to a press conference late the next day looking all the worse for the wear. In the press room, he kept his sunglasses on, complaining about the flashing of the cameras and how \"damned loud everyone was talking.\" With a Bloody Mary conspicuously perched in his right hand, Jesus stepped toward the microphone and addressed the crowd about the true intention of his booze-fueled antics, which it turns out was a subtle message to Gay-rights adversary Mike Pence. \"I know what we\\'re all here for. I\\'ve seen the pictures circulating on social media and, admittedly, they don\\'t look too good. I admit that. Things have been really tense around here lately and I guess I lashed out a bit at the other team, Trump and Pence. You know Pence with his whole Christian thing: \\'I\\'m a Christian, a conservative and a Republican in that order.\\' What a clown! I admit my disgust got the better of me and I just wanted to piss Pence off. Unfortunately, it got a little crazy. But, hey, what if I was gay? I\\'m Jesus. I can be gay if I want, and here Pence is screwing with gays in my name. Jerk! Who\\'s this Hoosier from Indiana anyway? I mean, he\\'s not Jesus Christ, I am damn it. He better remember that when it comes to Judgment Day because the Old Man Upstairs isn\\'t too happy about these Christians giving us a bad rep. You know how much PR work that takes to fix up? We\\'re still reeling from Bush and his whole Family Values thing. And Reagan, don\\'t even get me started.\" \\nA reporter finally asked the unthinkable: \"So you\\'re not gay?\" \\n\"I\\'ve been around a long time, like a couple millennia, man,\" Jesus started. \"I\\'ve seen a lot of things. I\\'m no prude. I\\'ve been to college. We\\'re all adults here. We\\'ve all tried things. And I don\\'t judge. That\\'s my dad\\'s job. Me? My philosophy is like what Bill Clinton said: \\'Don\\'t ask, don\\'t tell.\\' At the end of the day, though, Mary and I are going on almost two-thousand years together. I have my kids, good friends like Lu, Peter and Paul, and I have my health, mostly because I\\'m immortal. To answer your question, no. Not gay. Now if you\\'ll excuse me, I have to go lay hands on myself and fix this hangover.\" Make Chris Dahl\\'s  '"}, "time": 1742562109.5837498}