{"duration": 0.13248491287231445, "input_args": {"text": "'In a groundbreaking effort to close the wage gap between men and women, Massachusetts has become the first state to bar employers from asking about applicants’ salaries before offering them a job. The new law will require hiring managers to state a compensation figure upfront  —   based on what an applicant’s worth is to the company, rather than on what he or she made in a previous position. The bipartisan legislation, signed into law on Monday by Gov. Charlie Baker, a Republican, is being pushed as a model for other states, as the issue of men historically outearning women who do the same job has leapt onto the national political scene. Nationally, there have been repeated efforts to strengthen equal pay laws  —   which are already on the books but tend to lack teeth  —   but none have succeeded so far. Hillary Clinton has tried to make equal pay a signature issue of her campaign, while Donald J. Trump’s daughter Ivanka praised her father for his actions on this issue when she spoke at the Republican National Convention. By barring companies from asking prospective employees how much they earned at their last jobs, Massachusetts will ensure that the historically lower wages and salaries assigned to women and minorities do not follow them for their entire careers. Companies tend to set salaries for new hires using their previous pay as a base line. “I think very few businesses consciously discriminate, but they need to become aware of it,” said State Senator Pat Jehlen, a Democrat and one of the bill’s  . “These are things that don’t just affect one job it keeps women’s wages down over their entire lifetime. ” Federal law already prohibits   pay discrimination, but violations are hard to prove and wage gaps persist in nearly every industry. Nationally, women are paid 79 cents for every dollar that men earn, according to the United States Census Bureau. A number of factors affect that statistic, including the career fields women choose, but economists consistently find evidence of pay disparities not offset by other variables. The Massachusetts law, which will go into effect in July 2018, takes other steps as well to combat pay discrimination. Companies will not be allowed to prohibit workers from telling others how much they are paid, a move that proponents say can increase salary transparency and help employees discover disparities. And the law will require equal pay not just for workers whose jobs are alike, but also for those whose work is of “comparable character” or who work in “comparable operations. ” Workers with more seniority will still be permitted to earn higher pay, but the law effectively broadens the definition of what is equal work. Other states have also been stepping up their protections. In May, Maryland passed a law that requires equal pay for “comparable” work, and California last year enacted a law that is one of the nation’s strictest, requiring employers to be able to prove that they pay workers of both genders equally for “substantially similar” jobs. It, too, had the backing of important local trade groups, including the California Chamber of Commerce. And Massachusetts joins at least 12 other states that already require companies to let employees compare notes about how much they are paid. The distinguishing feature in the Massachusetts law is that job seekers will no longer be compelled to disclose their salary or wages at their current or previous jobs  —   which often leaves applicants with the nagging suspicion that they might have been offered more money if the earlier figure had been higher. People will still be allowed to volunteer their salary information. “This is a sea change, and we hope it will be used as a model in other states,” said Victoria A. Budson, executive director of the Women and Public Policy Program at Harvard’s Kennedy School of Government and chairwoman of the Massachusetts Commission on the Status of Women. The law in her state, she said, “will help every single individual who applies for a job, not just women. ” Efforts to pass a national   law, the Paycheck Fairness Act, have been repeatedly blocked by congressional Republicans. Opponents, including the U. S. Chamber of Commerce, a powerful business lobbying group, say that such laws would increase litigation and unfairly restrict employers’ compensation decisions. But proponents of equal pay laws say that attitudes are shifting among businesses. In Massachusetts, for instance, the Greater Boston Chamber of Commerce was an early and enthusiastic backer. “That really set the tone,” said State Representative Ellen Story, a Democrat and   of the bill. “Now it wasn’t just members of the women’s caucus, it was business leaders, too, asking for this. ” The Massachusetts attorney general will be in charge of enforcing the law, which also gives workers the right to sue companies directly for violations. In June, 28 businesses nationwide, including large employers like Gap, Pepsi and American Airlines, signed an Equal Pay Pledge promoted by the White House in which they committed to conducting annual audits of their pay by gender across all job categories. “Companies that want to do the right thing are seeing that these new laws really pose no threat,” said Vicki Shabo, vice president of the National Partnership for Women  Families, which tracks the fair pay bills introduced in state legislatures. “It’s absolutely started to pick up. These laws are not just passing in completely blue places,” she added,” they’re passing with bipartisan votes. ” Businesses are also beginning to talk more openly about the often uncomfortable things those audits find. PricewaterhouseCoopers published the results of a pay analysis it did of its British staff. It found a 15. 1 percent pay disparity between men and women, and changed its promotion practices to bring more women into senior leadership roles. Salesforce, a cloud software company, says it spent $3 million last year to raise the salaries of female employees to match their male counterparts. Academic research has illustrated the negative effect pay disparity has not just on individuals, but also on the broader economy. Closing the gender wage gap would lower the poverty rates in every state, according to an analysis by the Institute for Women’s Policy Research. Just as important, according to advocates of equal pay, are the changing demographics in boardrooms and statehouses. Ms. Jehlen, one of the Massachusetts bill’s   recalled the first time she testified about equal pay issues before the legislature’s labor committee: All the members were men. She and others had taken up the cause on behalf of a group of female cafeteria workers who filed a lawsuit in 1991 seeking parity with male janitors, who did comparable work, the cafeteria workers said, but were paid significantly more. The Massachusetts Supreme Judicial Court ruled against the women, saying that the state’s equal pay law was not clear in its definition of comparable work. This week, one of those cafeteria workers attended the ceremony at which Governor Baker signed the new law. “For me,” Ms. Jehlen said, “that was the most emotionally powerful thing. ”'"}, "time": 1742562871.566172}