{"duration": 0.05036163330078125, "input_args": {"text": "'Islamic State supporters are celebrating the recent terrorist attack on London, England, distributing propaganda images via their social media channels calling for “no compromise. ”[The propaganda image depicts the silhouette of a man with a knife against the backdrop of a burning Tower Bridge (Tower Bridge, located close to London Bridge, is often confused with the latter  —   ISIS’s propagandists appear to have made the same mistake).  Islamic   Nashir News Telegram channels have just distributed a poster celebrating #London attack with a set of hashtags to tweet pic. twitter.   —   Michael S. Smith II (@MichaelSSmithII) June 4, 2017,  The picture also shows a white van, similar to the one that was used by terrorists to run down civilians in London Saturday. The image was shared on   channels on the Telegram messaging app. A recent post in the channel featured a clip from the Islamic State calling on Muslims to stage terrorist attacks during Ramadan, the “month of conquest and jihad. ” Nashir Telegram channels reposted compilation of messages posted at start of Ramadan, featuring clip of Adnani’ 2016 Ramadan address #London pic. twitter.   —   Michael S. Smith II (@MichaelSSmithII) June 4, 2017,    social media accounts also distributed material calling for copycat attacks using trucks, knives, and handguns. 3) Earlier today, pro #ISIS channel urged to kill civilians: ”Run over them by vehicles”   image of truck, gunknife https:  .  pic. twitter.   —   Rita Katz (@Rita_Katz) June 3, 2017,  Other Islamic State supporters were seen celebrating, mainly on Telegram, the messaging app currently favoured by jihadis. “We’re coming for you from Iraq,” said one, while another boasted, “the wolves have awakened. ” 6) #ISIS channels continue to celebrate #LondonAttack as”the black days we’ve promised”,the wolves have awakened”responding to ISIS calls pic. twitter.   —   Rita Katz (@Rita_Katz) June 4, 2017,  Theresa May, the British Prime Minister, has responded to the attack on London by calling for more internet regulation, criticizing internet providers for allowing “safe spaces” for Islamist radicals. This approach has been criticized by civil liberties campaigners, who call May’s proposal a “poor, very political response” that could “push these vile networks into even darker corners of the web, where they will be even harder to observe. ” You can follow Allum Bokhari on Twitter and add him on Facebook. Email tips and suggestions to abokhari@breitbart. com.'"}, "time": 1742562750.7192204}