{"duration": 0.0314488410949707, "input_args": {"text": "'Share on Facebook \\nThere’s no doubt about it – the election of Donald Trump to be the next President of the United States has riled up the reality television star’s hateful supporters – hate crimes have dramatically increased across the country. To add to the fear and frustration that many Americans are feeling, the Republican Party doesn’t even have the guts to admit that the divisive rhetoric it has been spewing for decades has contributed to not only Trump’s rise, but the hateful attitudes that helped him get elected. \\nThis denial and lack of responsibility was on full display on CNN’s State of the Union this morning, when host Jake Tapper interviewed Speaker of the House Paul Ryan. When Tapper cornered Ryan and asked him to speak to the people who are afraid of the violence and hate crimes against minorities and women that have occurred post-election, Ryan said: \\n“First of all, I hate it that people feel this way. And second of all, they should not. I think people should be rest assured, America is a pluralistic inclusive country. It is, it has been and it will continue to be. So, I really think people should put their minds at ease.” \\nTapper pressed him, reminding him that this was a serious, nationwide issue. Ryan responded by shocking Tapper and Americans when he denied that the GOP had any role in it, stating that the Trump supporters that were responsible for these awful acts aren’t Republicans. \\n“That’s terrible. By the way, that’s not Republicans. We are the party of Lincoln. People who espouse those views, they’re not Republicans. We don’t want them in our party even if they’re thinking about it.” \\nFor the record, these attackers ARE most certainly conservatives whose main goal is to Make America White Again – there is no getting around this fact. And just when you thought Ryan couldn’t be any more full of sh*t, he said: \\n“And I’m confident Donald Trump feels the same way.” \\nIs he serious? Ryan and many other prominent Republicans have spent the last several months condemning Trump for his racism and hateful, divisive rhetoric – and even then, they were complete cowards. These GOPers distanced themselves from his actions, but never had enough of a backbone to actually do what was right and vote against him. Their loyalty to their hateful, discriminatory party has always prevented them from doing the right thing, and thanks to them we will now have a racist misogynist leading our country. \\nYou can watch the interview below: \\nFor Republican leaders to deny responsibility in what is now happening in our country is repulsive. They created a political climate that allowed Trump to thrive, and they supported a presidential candidate who encouraged the very violence and discrimination that we are now seeing. The GOP will not be forgiven, and they should not be able to pretend they didn’t contribute to this mess. \\nFeatured image is a screenshot Patti Colli My passion is bringing attention to human rights and equality issues. In addition to writing for New Century Times and other political platforms, I also run a website and digital magazine dedicated to social issues and promoting equality in all forms. Post navigation '"}, "time": 1742628491.0357513}