{"duration": 0.04948568344116211, "input_args": {"text": "'Secretary Of Interior Unveils Plans For New High-Speed Creek WASHINGTON—Calling the $650 million project the “future of America’s pastoral waterways,” Secretary of the Interior Sally Jewell unveiled the agency’s plans for a new high-speed creek Thursday that would reportedly connect Weybridge, VT with the adjacent town of Addison. Americans Confused By System Of Government In Which Leader Would Resign After Making Terrible Decision WASHINGTON—In the wake of Prime Minister David Cameron’s announcement that he would leave office following the United Kingdom’s vote to exit the European Union, tens of millions of Americans expressed their confusion to reporters Friday about a system of government in which a leader would resign after making a terrible decision. The Pros And Cons Of Affirmative Action The Supreme Court upheld a challenge to the University of Texas at Austin’s affirmative action program Thursday, reigniting debate over the merits of policies that favor members of groups frequently targeted by discrimination. Here are the pros and cons of affirmative action 47 Weak-Willed Senators Bend To Interests Of Powerful American People WASHINGTON—Saying the closely watched Senate vote clearly demonstrated where the elected officials’ loyalties lay, political observers confirmed that 47 weak-willed lawmakers bent to the interests of the powerful American public Monday by voting in favor of measures that would bar anyone on government terror watchlists from purchasing firearms. Dianne Feinstein Horrified After New Gun Control Bill Disintegrates Immediately Upon Crossing Into Senate Chamber WASHINGTON—Staring down in shock at her empty hands where the piece of legislation had been only seconds earlier, Sen. Dianne Feinstein (D-CA) was reportedly left horrified Monday after her gun control bill disintegrated immediately upon crossing into the Senate chamber. John Kerry Jettisons Russian Henchmen From International Space Station Airlock LOW EARTH ORBIT—Having stowed away aboard a Soyuz resupply rocket and silently slipped into the International Space Station as part of a high-level fact-finding mission, Secretary of State John Kerry reportedly found himself forced to jettison two Russian henchmen from an airlock Monday after being set upon by the thugs in an ambush that resulted in a violent zero-gravity struggle to the death. ‘There Is Beauty In Decay,’ Says Head Of Federal Highway Administration While Surveying Nation’s Crumbling Roads CHICAGO—Inspecting a lengthy fissure cutting across two lanes of U.S. Route 34, Federal Highway Administration head Gregory G. Nadeau told reporters Wednesday that while the nation’s infrastructure is in desperate need of repair, there was “a certain kind of beauty in decay.” CDC Horrified After Discovering Existence Of Thousands Of Public Pools WASHINGTON—Calling the finding an imminent threat to public health nationwide, horrified officials from the Centers for Disease Control and Prevention convened an emergency press conference Wednesday to announce they had discovered the existence of thousands of public pools throughout the country. '"}, "time": 1742563965.0156574}