{"duration": 0.06329584121704102, "input_args": {"text": "'An event organised by Gays Against Sharia to mark the anniversary of the Orlando shooting has been branded “divisive” and “Islamophobic” by LGBT activists planning a  . [The organisers of the Unite Against Hate march, set to take place in Manchester on Sunday, say they organised the event to “honour the victims of hate” including the 49 people who lost their lives at Pulse, a gay club in Orlando, Florida, at the hands of an Islamic terrorist on June 12, 2016.  Planned speakers include author Shazia Hobbs, a Glaswegian who was forced into an arranged marriage at 18 with a man who beat her, believing it was his right under Sharia law Mohammed Fiaz, a Christian convert from Islam and founder and former leader of the English Defence League Tommy Robinson. But LGBT activists have reacted with fury, insisting the event is nothing more than the cynical hijacking of gay rights by the “far right” as a cover for Islamophobia. Two groups, Lesbians and Gays Support the Migrants, and Action for Trans Health, are arranging a   against the march. “We’re protesting because the   want to use Orlando and the recent killings in the UK to demonise all Muslims,” one of the organisers of the   Anna, told Pink News. “We are clear that it is genocidal to consider millions of people responsible for the actions of a few violent men. “As queers, we know what it’s like for   to hate us  —   so we won’t be divided like this. ” One of the organisers of the Unite Against Hate march is Tommy English, a fellow traveller of Tommy Robinson’s and former leader of the English Defence League’s LGBT group who now runs Gays Against Sharia. Opponents have seized upon his presence to claim the march is nothing but a front for   Islamophobes. Pink News quotes Sam Bjorn as saying: “As LGBT+ people we won’t stand idly by as far right bigots like the EDL attempt to use our rights as a weapon against people from the Muslim community. “When groups like the EDL are preying on tragedy like the recent attack in Manchester to promote hate and division, it’s more important than ever to come together and say that we do not tolerate their Islamophobia and racism. “We encourage everyone, gay or straight, to join us on 11 June to show that the LGBT+ community and the people of Manchester won’t let the hate of   bigots divide us. ” Pink News has joined in the condemnation, branding the event as a “fake” and accusing the organisers of “hijacking the first anniversary of the Pulse nightclub shooting with an   march,” which it described as a “disturbing tactic”. Veteran gay rights activist Peter Tatchell has also entered the fray, tweeting his opposition to the march. If you like our work opposing Islamist homophobia https:  .  please consider donating https:  .  THANKS A LOT : ) pic. twitter.   —   Peter Tatchell (@PeterTatchell) April 16, 2017,  When confronted by fellow Twitter users who accused him of “defending the wrong people” he reacted by tweeting his “delight” at having been “targeted” by “fascists” as he said it showed he had “rattled the far right”. Just a few weeks later Tatchell tweeted an appeal to help overturn the death penalty for homosexuality, which still exists in several countries. Several countries still have the death penalty for LGBT people. We urgently need your help to stop it. Donate https:  .  THANX! pic. twitter.   —   Peter Tatchell (@PeterTatchell) May 11, 2017,  The ten countries in which homosexuality is punishable by death are Afghanistan, Iran, Mauritania, Nigeria, Qatar, Saudi Arabia, Somalia, Sudan, the United Arab Emirates and Yemen. In some cases, the laws apply only in regions of the country under Sharia law or are only applicable to Muslims.'"}, "time": 1742561947.3459227}