{"duration": 0.015782594680786133, "input_args": {"text": "'The large number of “privately educated white men” amongst Britain’s judiciary is a “serious constitutional issue” according to a report by senior lawyers, which calls for dramatic measures to increase the proportion of women and ethnic minorities. [Asserting that Britain’s judiciary has a “diversity deficit” law reform group Justice called for “systemic structural changes” to the selection process including “targets with teeth” so as to “deliver sufficient diversity to the bench”.  As well as describing diversity as an “intrinsic good” the report said the “lack of female and visible [black and ethnic minority] senior judges threatens to erode the public’s confidence in the judiciary” warning it could be perceived to be “unfair” that in the Crown Court “those tried are disproportionately   yet the judges are overwhelmingly white”. The   group said “positive action” must be taken to increase the share of women and ethnic minorities in the judiciary, stating: “‘Merit’ can all too easily become a vehicle for unconscious bias. ” Justice director Andrea Coomber said: “We realise that some of the measures recommended in this report will be unpopular with some, but if the   issue of lack of diversity is to be genuinely addressed then those at the most senior levels must accept that difficult and perhaps unpopular decisions will have to be taken to deliver a more diverse judiciary. ” Noting the majority of supreme court judges will be replaced over the next three years, Coomber said there is now an “unprecedented opportunity” to “change swiftly the demographic composition of [Britain’s] senior judiciary”. Justice recommends setting ambitious “targets with teeth” for courts deemed to lack sufficient numbers of women or ethnic minorities, the “teeth” meaning that there would be obligations to monitor and report on progress. The report said: “If there is persistent failure to meet targets over the next decade, strong consideration should be given to introducing quotas. “Structural change  —   not tinkering  —   is required if the complexion of the bench is to really change. ”'"}, "time": 1742628523.4399154}