{"duration": 0.12016940116882324, "input_args": {"text": "'CHASKA, Minn.  —   Ryan Moore was the last player to gain a spot on the teams for the 41st Ryder Cup. On Sunday, exactly a week after he found out he had made the United States team, he was 2 down with three holes to play in his singles match against Lee Westwood when two of his teammates, Patrick Reed and J. B. Holmes, showed up on the 16th hole in a show of support. As Reed and Holmes looked on, Moore produced an    finish to hand Westwood a   defeat and deliver the United States its 15th point, clinching the Americans’ first victory in the biennial event against a European team after      losses. It did not matter, Moore said, that he was making his Ryder Cup debut while Westwood was making his 10th appearance. “I saw both of those guys,” Moore said, “and I said: ‘All right, I’m going to do it for my team. I’m going to try to flip this match somehow. ’” The Americans, who had lost eight of the previous 10 Ryder Cups, flipped their fortunes in the competition one man and one match at a time. Playing for one another, the United States turned a   lead at Saturday’s close into a   victory, its first against Europe since 2008 and only its third in the past 11 years. Patrick Reed, whose fiery demeanor and   play earned him the nickname Captain America, gained the first point for the United States in Sunday’s singles matches with a   victory against Rory McIlroy in a showdown of showmen that featured exquisite shotmaking,   exchanges and a warm embrace when it was over. By sundown, every United States player had earned at least a point during the   event. The last time that happened was in 1975, when an American team captained by Arnold Palmer dominated a squad from Britain and Ireland. It was the perfect tribute to Palmer, who died five days before this year’s competition got underway at Hazeltine National Golf Club. The United States captain, Davis Love III, whose 2012 squad squandered a   lead and lost on the final day at Medinah Country Club outside Chicago, said he was proud of how his players competed in the face of immense pressure. “But mostly, proud of the way they came together as family and supported each other,” Love said. Brandt Snedeker, a player on that losing squad in 2012, said this team was closer. “I think this week the underlying theme was everybody had your back,” he said. Snedeker was the only American to go unbeaten. He said he could not have finished    if not for the support of Bubba Watson, who helped him get past his singles opponent, Andy Sullivan, by 3 and 1. Watson walked with Snedeker during the match on Sunday and kept him loose and in a positive frame of mind after Snedeker fell two holes behind after three holes. Watson, the   golfer in the world, was not playing because he had been bypassed for the 12th and final team berth in favor of Moore. Desiring to be included in the event, Watson volunteered to serve as part cheerleader, part errand boy for Love’s team. “I don’t know if I could have done it without him out there,” Snedeker said of Watson, one of the American team’s five vice captains. In truth, Love had six assistants, because everyone included Phil Mickelson  —   who, at 46, qualified for his 11th Ryder Cup  —   as part of the captain’s coterie. Perhaps no one, including Love, came into this competition with more pressure on his shoulders than Mickelson, who had spoken out against the status quo in the news conference after the Americans’   loss in Scotland in 2014. Mickelson criticized the leadership style of that year’s captain, Tom Watson, who was seated a few feet away. His   insurrection led to an overhaul of the system for selecting the players and the captain. The players, past and present, got more input, and a more collaborative process was put in place. One of the changes instituted paved the way for the   selection of Moore. Mickelson’s contributions to the victory ended with his    record but started with that news conference in 2014. At Sunday’s      session, the first question was for Mickelson. He was asked what he thought of Love’s leadership. Mickelson laughed along with everyone else on the dais. “We had a great week this week,” he said. “We had a lot of fun together as a team, and we played some great golf, and we are really excited to have won. ” When he was finished, Mickelson’s teammates and their support crew applauded him. “We can’t thank Phil enough,” Snedeker said, adding: “He realized how this week turned out was going to reflect on him 100 percent, and to have shoulders that big and go out there and realize you’re going to have to shoulder it one way or the other  —   we all felt invested in that. We were not going to let Phil go down as a scapegoat. ” Mickelson said he felt their support all week but especially Sunday, in his singles match against Sergio García. It was an epic contest, with the players combining for 19 birdies, 10 by Mickelson. He had one bogey for a 63 but made a clutch putt at the 18th hole to secure a halve with García and extend his career singles record to   . His teammates, Mickelson said, “told me all the time they had my back, and it was an awesome feeling. ” “It elevated me to a different level of play having that type of support system,” he added. “I felt the support, the energy, and I played my best golf. ” After his last putt dropped, Mickelson’s feet left the ground. His jump was not as high as his putt was long, but it didn’t matter. He got his message across. The margin of victory was deceptive. Trailing by 3 points on Sunday morning, Europe’s captain, Darren Clarke, had in desperation   his singles lineup. His strategy sent shivers through the partisan crowds when no American player in the first five matches held a lead after the first nine. The Europeans pulled to within a point of the United States with victories in three of the first four completed singles matches. But the Americans finished strong. Led by Moore and Snedeker, they won five of the last six matches while Mickelson sat with his wife, Amy, behind the 18th green soaking up the scene. The European team featured six Ryder Cup rookies, including Thomas Pieters, who compiled a record of  . Pieters and McIlroy are not going anywhere, so the United States cannot afford to rest on this win. “We need to build on this,” Mickelson said. “Otherwise, it’s all for naught. ”'"}, "time": 1742564221.6800992}