{"duration": 0.049266815185546875, "input_args": {"text": "'0 Add Comment \\nAFTER obstructing the publication of two separate reports into the Grace case, surrounding the sexual and physical abuse of a disabled person in a Waterford foster home between 1989 and 2009, the HSE then tried to get a whistleblower fired. WWN’s Viral Team got to thinking, this is about the most Irish thing you’re going to read about all year! \\nThe classic move by any Irish institution that gets a whiff of a child being abused in any way, shape or form, is to cover up any evidence which could see someone held responsible for the abuse itself or the subsequent covering up of the abuse, and we have to say the HSE has absolutely nailed it! \\nUsing parliamentary privilege Fine Gael TD John Deasy spoke of how HSE officials sought to have the whistleblower fired, a whistleblower who had tried to alert people to abuse in a Waterford foster care home which was in receipt of HSE funding. What. A. Classic. Irish. Move. \\nIt’s possibly even more Irish than eating Tayto and watching Glenroe on a Sunday and knowing you had school the next day! \\nAfter a psychological report on Grace was sent to the whistleblower by a new HSE disability coordinator in the region after years of being refused access to it, the head of the HSE in the south east at the time, who stands accused of mishandling Grace’s case, tried to have the whistleblower fired. The only thing more Irish than trying to silence someone who wants justice for the most vulnerable in our society is probably relocating a priest or 10 to a new parish while wearing your GAA jersey, LOL!!! \\nWith a full inquiry set to be launched in the coming weeks, you can bet there’s a distinct possibility that things could get ‘eating a snackbox after being in Copper Face Jacks all night’ levels of Irish if the publication of the inquiry is delayed a few years only to result in no one being held to account for what they have done.'"}, "time": 1742562682.4820917}