{"duration": 0.14340567588806152, "input_args": {"text": "'PHILADELPHIA  —   Democrats marked a decisive turn in their campaign against Donald J. Trump this week, moving to recast the 2016 race not as a conventional battle between left and right but as a national emergency that requires voters of all stripes to band together against a singularly menacing candidate. Abandoning their standard critique against conservative Republicans, allies of Hillary Clinton argued that Mr. Trump was not merely another champion of   ideas, deserving of rejection for his views on the environment or health care. Instead, in an onslaught of astonishing ferocity led by President Obama, they used their convention to portray Mr. Trump as a dangerously unstable figure and a friend of foreign despots like President Vladimir V. Putin of Russia. Some Democrats suggested Mr. Trump might have authoritarian impulses of his own: Prominent in Mrs. Clinton’s acceptance speech Thursday night was a pointed reminder that the American system was designed to prevent the rise of a dictator. In effect, Mrs. Clinton and Democratic Party leaders signaled that they would seek to fight the general election, to some extent, in nonpartisan terms  —   as a clash between the broad mainstream of American voters and a candidate they argue would put the nation in jeopardy. David Boaz, the executive vice president of the Cato Institute, a libertarian think tank, said Democrats had picked up on an unsettling theme in Mr. Trump’s campaign. He said the attacks this week on Mr. Trump as an autocrat had the potential to resonate outside the Democratic base. “I really don’t think that’s too over the top,” Mr. Boaz said. “We have one candidate who’s not even pretending  —   he is promising to be a   ruler. ” Mrs. Clinton herself stopped short of denouncing Mr. Trump as an authoritarian. But in her convention speech  —   and on the campaign trail in recent days  —   she described his political worldview as being in profound tension with traditional American values. That somewhat gentler argument, strategists close to Mrs. Clinton said, will be central to her campaign in the general election. She has rebuked Mr. Trump repeatedly for depicting the United States as a nation in decline and declaring, “I alone can fix it. ” That sentiment, Mrs. Clinton said, is inconsistent with democracy. Mrs. Clinton returned to that theme on Thursday, and said Mr. Trump’s proclamation should “set off alarm bells for all of us. ” “Remember,” she said, “our founders fought a revolution and wrote a Constitution so America would never be a nation where one person had all the power. ” Mr. Trump and his campaign have batted away suggestions that he holds antidemocratic views. Paul Manafort, Mr. Trump’s campaign chairman, said on Thursday that the Democrats’ new attempts to label Mr. Trump a    signaled desperation and were an effort to counter his rousing convention speech last week in Cleveland. In that address, Mr. Trump offered himself to the country as a “   candidate” and a champion of working people in a nation under siege. Democrats, Mr. Manafort said, were trying to attack Mr. Trump to skirt responsibility for the conditions he is now campaigning against. But the attacks Democrats leveled in Philadelphia may not be so easily dismissed: Vice President Joseph R. Biden Jr. said Mr. Trump was so unprepared and so divisive that he would put American lives at risk. In an electric Wednesday night speech, Mr. Obama lumped Mr. Trump’s candidacy with violent ideologies that have spawned attacks on America. “Anyone who threatens our values, whether fascists or communists or jihadists or homegrown demagogues, will always fail in the end,” Mr. Obama said. Americans, the president said, do not “look to be ruled. ” Democrats recruited respected figures from outside the party to amplify their appeal: Michael R. Bloomberg, the billionaire former New York City mayor, who is a political independent, warned sternly that   must rally with Mrs. Clinton to stop a “dangerous demagogue. ” John Allen, a retired   Marine general, thundered into an arena dotted with American flags that voters faced a choice between Mrs. Clinton and “a dark place of discord and fear. ” There is no recent precedent in American politics for such unrelenting and direct attacks on a presidential nominee’s commitment to the basic institutions of democracy. Alvin S. Felzenberg, a historian and conservative columnist, said the latest point of comparison for this week’s Democratic barrage might be the 1940 election, in which Republicans savaged Franklin D. Roosevelt for defying tradition to pursue a third term as president. Even that, Mr. Felzenberg said, was “not with this tenacity and not at the conventions per se. ” But Mr. Trump has stirred concerns throughout the 2016 race, on the left and right, with a political approach and a set of policy prescriptions that plainly defy the norms of American politics. He has campaigned on pledges to bar Muslims from entering the United States and to torture people suspected of terrorism. (Mr. Trump has recently suggested barring people from the United States based on their country of origin, though he has not ruled out a religious test.) In Philadelphia on Thursday night, Khizr Khan, whose son, a Muslim and a United States Army captain, was killed fighting in Iraq, stirred the convention crowd as he denounced Mr. Trump’s proposal, calling it an offense against the Constitution. “Donald Trump, you’re asking Americans to trust you with their future,” Mr. Khan said. “Let me ask you, have you even read the United States Constitution?” Mr. Trump has routinely praised autocratic foreign leaders for what he characterizes as their steely leadership abilities. He has hailed Saddam Hussein, the executed Iraqi leader, for his skill at maintaining power, and said of Kim   the North Korean leader, “You have to give him credit” for consolidating authority. This week, amid reports that   hackers had breached the Democratic National Committee, Mr. Trump said he considered Mr. Putin a superior leader to Mr. Obama. Mr. Trump also said on Wednesday that he hoped Russia would hack and release emails that Mrs. Clinton deleted from her time as secretary of state. He said later that the remark was intended as sarcasm. Mr. Manafort, the Trump campaign chairman, indicated that Mr. Trump would not back away from presenting himself as a rescuer for a nation in peril. “The reason Donald Trump’s speech at the convention worked was because he was saying what people are feeling and thinking,” Mr. Manafort said in an email. Mr. Trump’s emphasis on national strength, he said, is meant to hammer home that “weak leadership” from Mr. Obama and Mrs. Clinton “is what caused the instability in the world that exists today. ” And Trump aides have argued that his defiant claim  —   “I alone can fix it”  —   has been distorted by Democrats. Mr. Trump, they say, aimed to present himself as the only available candidate who can turn the country around. But Democrats intend to keep up their    assault on Mr. Trump’s worldview and fitness for office: Clinton surrogates will crisscross the country with the message that he is a singular threat, and a   “super PAC” plans to beam the message into   living rooms. Jennifer Palmieri, the communications director for Mrs. Clinton, said the campaign would hammer the message that Mr. Trump is “not a normal Republican. ” “He has an incredibly disturbing theory that at its core rejects the American values of both   and the value of community,” Ms. Palmieri said. Geoff Garin, a pollster for Priorities USA Action, the main   super PAC, said the race had entered a new phase. A defining goal for the group now, he said, was to ensure that voters “reckon with what it would mean to have a dangerous demagogue like Trump as president. ” Gov. Dannel P. Malloy of Connecticut, the chairman of the Democratic Governors’ Association, said Mr. Trump’s candidacy echoed the rise of fascism in Europe before World War II. “Maybe this is an American version of that: Divide and conquer, marginalize as many as you can,” Mr. Malloy said just outside the conventional hall. The Republican presidential nominee, Mr. Malloy said, should be cast as a “uniquely bad” force in American politics. “Whether he has evil purposes in mind,” Mr. Malloy said, “he is a dangerous man. ”'"}, "time": 1742562257.491475}