{"duration": 0.08100247383117676, "input_args": {"text": "'Go to Article Donald Trump was willing to give up a very fulfilling life that took decades to build, so he could step up and take control of an out of control government. He and his family have already sacrificed so much because he chose to put his country first. Making sacrifices is certainly not something loudmouth liberals like Robert DeNiro are accustomed to. DeNiro was very vocal about his opposition to the wildly successful business man Donald J. Trump. He felt so strongly about his hate for Trump that made a video where he angrily stated he’d like to, “punch him in the face.” Now that Trump won the election in a landslide, DeNiro has chosen to get behind the Trump rioters who are terrorizing cities across America. Anti-Trump rioters are breaking windows, using baseball bats to smash the windshields of innocent citizens who get trapped in their hellish protests as they try to escape. Women who are taking part in the protests are being punched in the faces by men who are also taking part in the George Soros funded protests. American flags are being burned and families who are walking in major cities are being subjected to the most vile and disgusting, hateful language and images imaginable. If this is the kind of America that Robert DiNero is openly supporting? And if so, why would any American pay to see his movie,”Comedian”? \\nRobert De Niro gave anti-Donald Trump protesters across the United States his backing Friday as he spoke about how “depressed” the tycoon’s win in the presidential election had made him. \\nThe 73-year-old star was on the red carpet at the world premiere of his new film “The Comedian” in Los Angeles when he was asked how he was coping with Trump’s victory over Democratic rival Hillary Clinton. \\n“How am I doing? I’m very depressed,” the famously laconic “Raging Bull” actor told reporters. \\n“We have to just wait and see how things go and keep our eyes ever vigilant on the new government.” \\nAsked if he thought the protests were an appropriate response to the outcome of Tuesday’s election, he replied: “Yes, absolutely. Things aren’t being done right.” \\nDemonstrators took to the streets in Miami, Los Angeles, New York and other US cities for a third straight night on Friday. \\nIn Manhattan, they held signs reading “Your Wall Can’t Stand in Our Way” — a reference to the anti-immigration barrier the billionaire has promised to build on the US border with Mexico. \\nDe Niro hasn’t minced his words in his criticism of Trump, describing him as “a punk,” “a pig” and “an idiot.” \\n“I’d like to punch him in the face,” he said before the election. \\nEarlier in the day a town in southern Italy where De Niro’s grandparents came from offered the actor a means of escape. \\n“If, after the disappointment of Trump, he wants to take refuge here, we are ready to welcome him,” said Antonio Cerio, the mayor of Ferrazzano. \\n“The Comedian,” De Niro’s passion project which took him eight years to bring to the big screen, was part of this year’s program for the American Film Institute’s annual AFI Fest in Los Angeles. – Yahoo \\nHere’s a clip of Trump-hater Megyn Kelly promoting DiNero’s hateful rant against Donald J. Trump:  '"}, "time": 1742564150.5336876}