{"duration": 0.0717172622680664, "input_args": {"text": "'\\nIn today’s, 25th, Wikileaks release of hacked Podesta emails, one of the notable highlights is a March 2, 2015 exchange between John Podesta and Clinton aide Cheryl Mills in which the Clinton Campaign Chair says “ On another matter….and not to sound like Lanny, but we are going to have to dump all those emails. ”\\nBack in July 2016, FBI didn’t go after Hillary because director Comey said “didn’t find any intent”. Well here’s your “intent” thanks to Wikileaks.\\nThe email, which may indicate intent, was sent at the same time as the NYT story “ Hillary Clinton Used Personal Email Account at State Dept., Possibly Breaking Rules ” – which for the first time revealed the existence of Hillary’s email server – hit, and just days before Hillary’s press conference addressing what was at the time, the stunning revelation that she had a personal email account, and server, in her home.\\nThe proposed “dumping” on March 2 takes place two days before the House Select Committee on Benghazi sent Hillary Clinton a document retention subpoena on March 4, 2015, with some hinting the NYT report may have served to tip off the Clinton campaign about the upcoming subpoena.\\nMills’ response to Podesta: “Think you just got your new nick name.”\\nIt is unclear which “Lanny” is referred to: the infamous former DOJ staffer Lanny Breuer who quit in January 2013 after telling Frontline that some banks are too big to fail, or, more likely Lanny Davis, special counsel to President Bill Clinton, and spokesperson for the President and the White House on matters concerning campaign-finance investigations and other legal issues\\nIt is also unclear – for now – which emails Podesta is referring to in the thread, but Podesta adds: “better to do so sooner than later.” We can hope that a subsequent response, yet to be leaked by Wikileaks, will provide more color.\\nIf the exchange is shown to disclose intent to mislead, it will negate the entire narrative prepared by Clinton that she merely deleted “personal” emails and will reveal a strategic plan to hinder the State Department and FBI “investigation.”\\nThis is the first time that particular exchange has emerged among the Podesta emails.\\nFurthermore, a search for Lanny Davis reveals the following curious exchange between Robby Mook and John Podesta from March 8, 2015, just days after the abovementioned exchange, in which Mook says:\\nWe gotta zap Lanny out of our universe. Can’t believe he committed her to a private review of her hard drive on TV.\\nIt seems the Clinton campaign was not happy with being set on a course of transparency by Bill Clinton’s special counsel.\\nFinally, in a separate email sent out in the first week of March 2015 , by Clinton campaign communications director, Jennifer Palmieri, we get yet another confirmation that the president actively mislead the public when he said he didn’t know Hillary was using a private email address:\\nSuggest Philippe talk to Josh or Eric. They know POTUS and HRC emailed. Josh has been asked about that. Standard practice is not to confirm anything about his email, so his answer to press was that he would not comment/confirm. I recollect that Josh was also asked if POTUS ever noticed her personal email account and he said something like POTUS likely had better things to do than focus on his Cabinet’s email addresses.\\nPerhaps while the DOJ/FBI is taking a second look into Huma Abedin’s emails, it can also take a repeat look at some of these, especially the ones involving POTUS.\\nSource \\n'"}, "time": 1742563594.1732292}