{"duration": 0.1324012279510498, "input_args": {"text": "'A tidal wave of revelations is pouring out of the Clinton campaign as the 2016 presidential election draws to a close. \\n‘MELTDOWN’– The Clinton campaign continues to unravel following a series of troubling details. (Photo illustration 21WIRE) \\nOver the weekend, it was discovered through a Wikileaks email dump, that Neera Tanden of the Center for American Progress , John Podesta ‘s top aide, had an email exchange with Michael Lux of Progressive Strategies revealing that the Democratic consultant Robert Creamer of Democracy Partners, was closely allied with Clinton campaign manager Robby Mook . \\n‘POLITICAL BOMBSHELL’– Clinton campaign manager Robby Mook had close ties to disgraced DNC consultant Robert Creamer. (Image Source: Lockerdome ) \\nCreamer gained national attention when he became the subject of video sting operation captured by the investigative non-profit Project Veritas . Not only was it revealed that the Creamer discussed ways to commit voter fraud and violence at Donald Trump rallies on camera – he also met with White House officials some 342 times over the past year, including 47 private meetings with President Obama or other senior officials. \\n‘DNC SCANDAL’– Robert Creamer of Democracy Partners and Democratic congresswoman Jan Schakowsky. (Image Source: National Vanguard ) \\nCreamer’s visits to the White House also included his wife, a 9-term Illinois Democratic congresswoman Jan Schakowsky . \\nWhite House visitor records have shown that Schakowsky took 47 “private meetings with Obama or his senior staff,” over the past year. The consultancy Democracy Partners appears to have applied Schakowsky as a political buffering point, in the event of a fallout over their operations at a grassroots level. The nature of this type of procedural separation is to keep certain high-ranking officials of the hook in case of a massive upheaval over various underhanded campaign tactics , potentially giving the Clinton campaign and the DNC plausible deniability. \\nThe Mook fallout is the latest in a laundry list of problems for the Clinton campaign and comes at a time when interim DNC chair Donna Brazile , is embroiled in controversy of over leaked debate questions prior to at least two 2016 town hall debates. Brazile stepped down from her role at CNN earlier in October. Here’s a passage from the Daily Caller describing the scenario: \\n“Donna Brazile, the interim chair of the Democratic National Committee, began providing town hall and debate questions to the Clinton campaign earlier than previously known, emails released by WikiLeaks on Monday show.” \\nThe article continued by stating that the revelations expose that the interim DNC chair was more deeply involved than previously outlined: \\n“In the March 12 exchange, Brazile mentions [Roland] Martin by name and offers to provide more than just the one town hall question that she is known to have shared with the campaign. \\n“I’ll send a few more. Though some questions Roland submitted,” Brazile wrote to Palmieri in the March 12 email thread, which is entitled “From time to time I get the questions in advance.” \\nMartin, is a commentator for TV One and the host of News One Now , as well as a CNN contributor. \\nIn another matter, the Wall Street Journal revealed the following , while disclosing an apparently contentious relationship between the FBI and DOJ, while the FBI appears to be somewhat fractured over the latest email server case developments: \\n“The latest development began in early October when New York-based FBI officials notified Andrew McCabe [of the Terry McAuliffe campaign contribution scandal], the bureau’s second-in-command, that while investigating Mr. Weiner for possibly sending sexually charged messages to a teenage minor, they had recovered a laptop. Many of the 650,000 emails on the computer, they said, were from the accounts of Ms. Abedin, according to people familiar with the matter.” \\nSome critics have called for McCabe to recuse himself after it was revealed his wife received $675,000 from a well-known Clinton confidant, Terry McAuliffe . This was further underlined after the House Oversight Commitee wanted more information about the Senate campaign of Dr. Jill McCabe and its ties to the Clintons. \\nThe alleged internal feud among agencies was compounded when Attorney General Loretta Lynch and Deputy Attorney General Sally Yates ‘objected’ to FBI Director James Comey reopening the Clinton email server case this past week – something that added to the Lynch/Clinton tarmac meeting before the first FBI ruling in the Clinton case. \\nAccording to a report filed by Zero Hedge , a close friend of Podesta, Peter Kadzik , the Assistant Attorney General of the Department of Justice (DOJ), will be in charge of a probe into Huma Abedin , Clintion’s closest aide. \\nInterestingly, as a mountain of controversy envelops the Clinton campaign, the FBI is now conducting an early inquiry into former Trump campaign manager Paul Manafort , over his alleged foreign business connections. \\nBack in August, the following business connection was revealed by NBC news : \\n“In 2008, according to court records, senior Trump aide Paul Manafort’s firm was involved with a Ukrainian oligarch named Dmytro Firtash in a plan to redevelop a famous New York hotel, the Drake. The total value of the project was $850 million. Firtash’s company planned to invest over $100 million, the records say. \\nThat same year, Firtash acknowledged to the U.S. ambassador in Ukraine that he got his start in business with the permission of a notorious Russian crime lord, according to a classified State Department cable. Other cables say Firtash made part of his fortune through sweetheart natural gas deals between Russia and the Ukraine.” \\nAlthough the US State Department has determined that Firtash may have ties to a criminal enterprise in Russia – so far, there’s nothing directly linking Manafort to any underground element at this time. \\nWatch this space – as the Russia/Trump meme fostered by mainstream media or some other politically polarizing element will look to deflect from the Clinton campaign meltdown. \\nMore from LifeZette below… \\n‘OUT OF CONTROL?’– Wikileaks reveals Robby Mook’s links to DNC contractor who discussed ways to commit voter fraud and violence. (Image Source: Slate ) \\nWikiLeaks: Trump Rally Agitator and Clinton Campaign Manager Are ‘Close’ \\nTop Clinton aides discussed Bob Creamer and his ‘grassroots/netroots’ operation \\nby Jim Stinson LifeZette \\nRobert Creamer, the operative behind sending provocateurs to Donald Trump rallies, was close to Robby Mook, Hillary Clinton’s campaign manager, according to new emails released by WikiLeaks. \\nCreamer, who allegedly spearheaded the dirty tricks for the Democrats, wasn’t just consulting for the Democratic National Committee, according to videos made by Project Veritas. He was sending people to provoke Trump at events. \\nCreamer has thus become a red-hot issue in the campaign. And now it’s apparent he is close to Mook. That surprising detail came out Sunday morning when WikiLeaks posted hundreds more emails from John Podesta’s Gmail account. Podesta is Clinton’s campaign chairman whose account was hacked in March. \\nMore from LifeZette here … \\nREAD MORE ELECTION NEWS AT: 21st Century Wire 2016 Files \\nSUPPORT 21WIRE – SUBSCRIBE & BECOME A MEMBER @21WIRE.TV'"}, "time": 1742562626.3761816}