{"duration": 0.13076019287109375, "input_args": {"text": "'“We declare the right of the people of Ireland to the ownership of Ireland, and to the unfettered control of Irish destinies, to be sovereign and indefeasible.”\\n–Proclamation of Easter Week 1916\\nControlling their own destiny has always been a bit of a preoccupation for the Irish, in large part because for 735 years someone else was in charge. From the Norman invasion in 1169 to the establishment of the Free State in 1922, Ireland’s political and economic life was not its own to determine. Its young men were shipped off to fight England’s colonial battles half a world away, at Isandlwana, Dum Dum, Omdurman and Kut. Almost 50,000 died in World War I, choking on gas at Ypres, clinging desperately to a beachhead at Gallipoli, or marching into German machine guns at the Somme.\\nWhen the Irish finally cast off their colonial yoke, they pledged never again to be cannon fodder in other nation’s wars, a pledge that has now been undermined by the U.S. Once again, a powerful nation—with the acquiescence of the Dublin government—has put the Irish in harm’s way.\\nThe flashpoint for this is Shannon Airport, located in County Clare on Ireland’s west coast. Since the Sept. 11, 2001 terrorist attack on Washington and New York, some 2.5 million U.S. troops have passed through the airport on their way to Afghanistan, Iraq, and Syria. The Shannon hub has become so important to the U.S. that it hosts a permanent U.S. staff officer to direct traffic. It is, in the words of the peace organization Shannonwatch , “a US forward operating base.”\\nThe airport has also been tied to dozens of CIA “rendition” flights, where prisoners seized in Iraq, Afghanistan, and Pakistan were shipped to various “black sites” in Europe, Asia, and Guantanamo Bay in Cuba.\\nIrish peace activists and members of the Irish parliament, or Oireachtas Elreann, charge that an agreement between the Irish government and Washington to allow the transiting of troops and aircraft through Shannon not only violates Irish neutrality it violates international law.\\n“The logistical support for the U.S. military and CIA at Shannon is a contravention of Ireland’s neutrality,” says John Lannon of the peace group Shannonwatch, and has “contributed to death, torture, starvation, forced displacement and a range of other human rights abuses.”\\nIreland is not a member of NATO, and it is considered officially neutral. But “neutral” in Ireland can be a slippery term. The government claims that Ireland is “militarily neutral”—it doesn’t belong to any military alliances—but not “politically neutral.”\\nBut the term militarily neutral “does not exist in international law,” says Karen Devine, an expert on neutrality at the City of Dublin’s School of Law & Government. “The decision to aid belligerents in war is…incompatible with Article 2 of the Fifth Hague Convention on the Rights and Duties of Neutral Powers and Persons in Case of War on Land.” Devine argues that “the Irish government’s decision to permit the transit of hundreds of thousands of U.S. soldiers through Shannon Airport on their way to the Iraq War in 2003 violated international law on neutrality and set it apart from European neutrals who refused such permission.”\\nArticle 2 of the Convention states, “Belligerents are forbidden to move troops or convoys of either munitions or war supplies across the territory of a neutral power.”\\nIreland has not ratified the Hague Convention but according to British international law expert Iain Scobbie, the country is still bound by international law because Article 29 of the Irish Constitution states, “Ireland accepts the generally recognized principle of international law as its rule of conduct in relations with other states.”\\nThe UN Security Council did not endorse the wars in Afghanistan or Iraq, making both conflicts technically illegal. Then UN General Secretary Kofi Annan said that the invasions “were not in conformity with the UN Charter. From our point of view, from the Charter’s point of view,” the invasions were “illegal.”\\nShannonwatch’s Lannon says the agreement also violates the 1952 Air Navigation Foreign Military Aircraft Order that requires that “aircraft must be unarmed, carry no arms, ammunition and explosives, and must not engage in intelligence gathering and that the flights in question must not form part of a military exercises or operations.”\\nThe Dublin government claims all US aircraft adhere to the 1952 order, although it refuses to inspect aircraft or allow any independent inspection. According to retired Irish Army Captain Tom Clonan, the Irish Times security analyst, the soldiers are armed but leave their weapons on board the transports—generally Hercules C-130s—while they stretch their legs after the long cross Atlantic flight. Airport employees have also seen soldiers with their weapons.\\nThe Irish government also says that it has been assured that no rendition flights have flown through Shannon, but Shannonwatch activists have tracked flights in and out of the airport. As for “assurances,” Washington “assured” the British government that no rendition flights used British airports, but in 2008 then Foreign Secretary Ed Miliband told Parliament that such flights did use the United Kingdom controlled island of Diego Garcia.\\nInvestigative journalist’s Mark Danner’s book Spiral: Trapped in the Forever War chronicles the grotesque nature of some of the “enhanced interrogation” techniques inflicted on those prisoners. The rendition program violated the 1987 UN Convention Against Torture, which Ireland is a party to.\\nRoslyn Fuller , Dublin-based scholar and author of Beasts and Gods: How Democracy Changed Its Meaning And Lost Its Way , says terror suspects were taken to sites where “in an appalling re-run of the Spanish Inquisition tactics, [they were] routinely tortured and mistreated in an attempt to obtain confessions and other information.”\\nFuller points out that Article 11 of the Hague Convention requires that troops belonging to a “belligerent” army must be interned. “In other words, any country that would like to call itself neutral is obligated to prevent warring parties from moving troops though its territory and to gently scoop up anyone attempting to contravene this principle.”\\nBesides violating international law, Ireland is harvesting “the bitter fruits of the Iraq and Afghan wars” and NATO’s military intervention in Libya, charges MP Richard Boyd Barrett of the People Before Profit Party and chair of the Irish Anti-War Movement. “The grotesque images of children and families washed up on Europe’s shores, desperate refugees, risking and losing their lives,” he says, “are the direct result of disastrous wars waged by the US, the UK and other major western powers over the last 12 years.”\\nThe Irish government, says Barrett, has “colluded with war crimes and actions for which we are now witnessing the most terrible consequences.”\\nThe government has waived all traffic control costs on military flights, costing Dublin about $45 million from 2003 to 2015. Ireland is currently running one of the highest per capita debts in Europe and has applied austerity measures that have reduced pensions and severely cut social services, health programs and education. Other neutral European countries, like Finland, Austria and Switzerland charge the US military fees for using their airspace.\\nShannon might also make Ireland collateral damage in the war on terror, according to the Irish Times’ Clonan. Irish citizens are now seen as a “hostile party,” and British Muslim cleric Anjem Choudary has named Shannon a “legitimate target,” according to Irish journalist Danielle Ryan.\\nThe Dublin government has generally avoided open discussion of the issue, and when it comes up, ministers tend to get evasive. In response to the charge that Shannon hosted rendition flights, then Minister of Foreign Affairs Dermot Ahern said, “If anyone has evidence of any of these flights please give me a call and I will have it investigated.” But even though Amnesty International produced flights logs for 50 rendition landings at Shannon, the government did nothing. Investigations by the Council on Europe and European Parliament also confirmed rendition flights through Shannon.\\nPeace activists charge that attempts to raise the issue in the Irish parliament have met with a combination of stonewalling and half-truths. Apparently kissing the Blarney Stone is not just for tourists.\\nThe government’s position finds little support among the electorate. Depending on how the questions are asked, polls indicate that between 55 and 58 percent of the Irish oppose allowing US transports to land at Shannon, and between 57 to 76 percent want to add a neutrality clause to the constitution.\\nThe “forward base” status of Shannon puts the west of Ireland in the crosshairs in the event of a war with Russia. While that might seem far-fetched, in 2015 NATO held 14 military maneuvers directed at Russia, and relations between NATO, the US and Moscow are at their lowest point since the height of the Cold War.\\nOf course Ireland is not alone in putting itself in harm’s way. The US has more than 800 bases worldwide, bases that might well be targeted in a nuclear war with China or Russia. Local populations have little say over the construction of these bases, but they would be the first casualties in a conflict.\\nFor centuries Ireland was colonialism’s laboratory. The policies used to enchain its people—religious division and ethnic hatred— were tested out and then shipped off to India, Kenya, South Africa, Nigeria and Guyana, and Irish soldiers populate colonial graveyards on all four continents, now, once again, Ireland has been drawn into a conflict that is has no stake in.\\nNot that the Irish have taken this lying down. Scores of activists have invaded Shannon to block military flights and, on occasion, to attack aircraft with axes and hammers. “Pit stop of death” was one slogan peace demonstrators painted on a hanger at the airport.\\nThat resistance harkens back to the 1916 Easter Rebellion’s proclamation that ends with the words that ring as true today as they did a century ago: “In this supreme hour the Irish nation must, by its valor and discipline and by the readiness of its children to sacrifice themselves for the common good, prove itself worthy of the august destiny to which it is called.”\\n '"}, "time": 1742628349.1647992}