{"duration": 0.08300900459289551, "input_args": {"text": "'Fox News Channel has canceled its     news program Red Eye. [According to AdWeek‘s TVNewser, which first broke the news, the last episode of Red Eye will air Friday, April 7 at 3 a. m.  The irreverent news program with the    timeslot launched in 2007 with host Greg Gutfeld, who left the show in 2015. Breitbart News founder Andrew Breitbart played a pivotal role in Red Eye‘s inception. Breitbart was a frequent guest on the program, which also regularly featured Gutfeld’s “repulsive sidekick” Bill Schulz, “ombudsman” Andy Levy and Tom Shillue, who became permanent host of the show in 2015. In a 2012 segment honoring the late conservative icon, Gutfeld said that Red Eye “would not exist” without Breitbart’s involvement. “It was him who talked to Fox to get me a job,” Gutfeld explained shortly after Breitbart’s passing. “I was living in England, and he talked to people at Fox. I met with people at Fox, and the next thing you know it was Red Eye. And everybody here who’s sitting here  …     we never would have met if it wasn’t for Andrew Breitbart bringing us together, because that’s what Breitbart does. ” The March 2, 2012 episode of Red Eye was dedicated to Breitbart, with the show airing clips of the late conservative icon’s most memorable appearances. In a column for Breitbart News following his departure, Gutfeld said Red Eye was successful because of a “beautiful deal made between its staff and its viewers. ” “The Redeye gang would refuse to underestimate the viewer’s intelligence, and the viewers would forgive us for our incoherence,” Gutfeld explained. “We attracted people that we would drink with, given the chance. These were late night types  —   up in the lonely hours for different reasons. Some had graveyard shifts. Others were nursing moms. Many, I learned were sick  —   or in hospitals, desperate for a distraction. ” According to TVNewser, current Red Eye hosts Tom Shillue and Andy Levy will remain with Fox News. A representative for Fox News Channel said the show’s 3 a. m. slot would be filled by repeats of Tucker Carlson Tonight.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564452.577636}