{"duration": 0.1296830177307129, "input_args": {"text": "'KABUL, Afghanistan  —   Around 20 guests gathered in a dusty corner of northern Afghanistan on Sunday night to break bread in celebration of a miraculous truce: the coming together of two bitter enemies who had been on opposite sides of the war. The centerpiece of the meal was roasted goat, a sacrifice by a father offered upon the return of his son, for that was what was happening. Just three months before, the host, Abdul Basir, a government militia commander, had fired his rifle in the dark of the night at his son Said Muhammad, a hardened Taliban fighter, and was sad not to have killed him. Now, after trying several times to fulfill their vows to kill each other, the father and son were embracing and exchanging garlands of plastic flowers in the northern province of Faryab, where their battle had played out. “He was my son  —   but he had been a coward out there fighting me,” said Mr. Basir, a lanky, cleanshaven commander in his 40s who has known little but combat since he was 15. Several of his children and five of his brothers serve in his militia. “Now I am very happy that he has returned to us. I hugged him and I said, ‘No matter what you did, you are my son. ’” It was an extraordinary twist, and perhaps not the last, in a story about how Afghan families have been fodder for a perpetual war, framed by grand ideologies but more truly depicted in misery and loss. Suddenly, a new chapter was starting. The celebratory feast was cut short as Mr. Basir’s outposts came under Taliban fire, seemingly in retaliation for Mr. Muhammad’s switching sides and bringing with him a couple of his comrades, as well as precious weapons and ammunition. In a telephone interview, Mr. Basir proudly described how he and his son hurried to the fight together, with Mr. Muhammad turning his gun against his old comrades. Since then, multiple interviews with both father and son, as well as relatives and officials in Faryab Province, detailed the family’s ordeal. For much of his life, Mr. Basir has been a commander in the northern militia of Abdul Rashid Dostum, a former warlord who now serves as Afghanistan’s vice president while continuing to draw accusations of human rights abuses. Mr. Basir crossed paths with the man who would turn his son against him in the 1990s, while the Taliban were in power. That man, Mawlawi Said Hafiz, was a Taliban military commander in Faryab Province, and Mr. Basir was a militia commander fighting him on behalf of Mr. Dostum. After the 2001 American invasion, Mr. Basir gained the upper hand, but he forgave Mawlawi Hafiz on the condition that he give up his links to the Taliban. Mr. Basir said he made Mawlawi Hafiz the imam of a village mosque, having the congregants pay him a tithe of wheat for his salary. Mr. Basir himself tried to take up a civilian life, though he maintained his cache of weapons and ammunition. Mawlawi Hafiz was keeping his powder dry, too. He secretly maintained his links to the Taliban and rose to become a senior judge for the insurgents’ shadow government in Faryab. After the Taliban grew stronger in the province in recent years, Mawlawi Hafiz was in a position to exact revenge. First, he recruited Mr. Basir’s teenage son. Mr. Muhammad stole thousands of his father’s bullets, more than 40 magazines and a Kalashnikov rifle, and joined the Taliban. “The mullahs told us: ‘Your father is an infidel  —   he is supported by the Americans. You should come join our jihad,’” Mr. Muhammad recalled. “I had decided to kill him. ” More than three years ago, Mr. Muhammad arrived at home with two pistols, set to gun down his father. But other villagers had tipped off Mr. Basir, who overpowered him. “I wanted to kill him right there, but my relatives said: ‘Let him be. He is your son,’” Mr. Basir recalled. “I let him live, and convinced him not to return to the Taliban but join the army. ” Mr. Muhammad enlisted and joined an army unit sent to the eastern province of Paktia. But his loyalties had remained with the Taliban. Every month, he said, he would send his salary of about $202 to the Taliban, depositing it into an insurgent account. Back home, Mr. Basir said, he found out about the arrangement and warned Mr. Muhammad’s superiors to be on watch in case the young man tried to surrender a post to the insurgents. But then Mawlawi Hafiz’s Taliban came directly for Mr. Basir. He was arrested, and only narrowly avoided execution. He and his second wife and children fled their home, in the Qaisar District of Faryab. “We paid money for his release, and all of us left the area,” said Mr. Basir’s brother Said Abdul Rahim. “But Taliban continued to burn our five houses and cut down our trees. Then Basir decided to fight them. ” When Mr. Muhammad returned from his army base in the east last year, he went straight to Mawlawi Hafiz in Faryab and rejoined the Taliban there. As Mr. Muhammad was making his way back to Faryab, Mr. Basir learned of his son’s plans and set up ambushes. Mr. Muhammad managed to avoid the traps, but Mr. Basir had made it his mission to kill his son. “It is up to God, but I think his blood is legitimate for me,” Mr. Basir told The New York Times in May, after an unsuccessful raid to kill his son. In the middle of the night, Mr. Basir’s men had surrounded their ancestral home village of Zyaratgah, which remained under Taliban control. “My mother came and said someone had shot the dog,” Mr. Muhammad said about that night. “I picked up the weapon and fired a couple times, but realized they had me surrounded. ” Mr. Muhammad flung himself out a window and ran into the orchards. Mr. Basir shot some rounds, chased him in vain and then left when other Taliban arrived to drive off the attack. At the heart of the blood feud, the women of the family were caught on opposite sides  —   especially Mr. Muhammad’s mother, Mr. Basir’s first wife. She remains in Taliban territory, and could not be reached by telephone this week for comment. Mr. Rahim, Mr. Basir’s brother, suggested that she was potentially a factor in Mr. Muhammad’s joining the Taliban. “Basir’s wife has complained that he married another woman and did not take care of her,” Mr. Rahim said. “So she convinced her son to join the Taliban. ” Mr. Basir insists that his first wife is not angry with him. “Such things happen,” he said. “But I love that wife of mine  —   she has put up with a lot. ” Mr. Muhammad said: “My mother was on both sides. Sometimes she was on my side, sometimes on my father’s side. ” Mr. Basir could not say what finally changed his mind about his son since trying to ambush him in May. In the months since, he began reaching out to try to persuade Mr. Muhammad to return. The men’s reunion was secured by shuttle diplomacy, with relatives going back and forth between the two. They sought to convince Mr. Muhammad that he was, in effect, burning his own property  —   seeking to destroy the orchards and home he stood to inherit. Mr. Muhammad said he had slowly realized that the Taliban were not the holy warriors they had portrayed themselves to be. Top commanders were getting payments, and none was trickling down to fighters like him. “I told Muhammad: ‘Your father is a serious enemy of the Taliban. If the father is an enemy, the son cannot be a friend,’” said Said Qayum, one of Mr. Basir’s cousins who served as a  . For now, Mr. Muhammad is fighting on his father’s side. Still, some in the family and their home district remain skeptical that someone who was once so determined to kill his own father, and who barely survived his father’s gunfire, could put it all behind him. What if he is an infiltrator? Mr. Basir said he had no doubts. “I believe him now  —   he was ignorant. My friends there told him that your father has killed 300 to 400 Taliban, they will kill you eventually. They will not leave you alive,” Mr. Basir said. “I told him, ‘I want to get you married. ’” When asked about that plan, Mr. Muhammad  —   who years ago explicitly chose the Taliban rather than bow to his family’s pressure to marry  —   had only a hesitant answer: “It’s not clear now  —   I can’t say if I will marry. ”'"}, "time": 1742563767.7477024}