{"duration": 0.051267147064208984, "input_args": {"text": "'Department of Homeland Security Secretary John Kelly joked to President Donald Trump he could use a ceremonial saber on the press Wednesday, in a comment caught on a hot mic. [After being presented the saber during Coast Guard Academy commencement in Connecticut, Trump sat beside Kelly who quipped: “You can use that on the press, sir. ”  “Yeah,” Trump chuckles. Gen. Kelly tells Pres. Trump ”you can use that on the press” after he’s presented with ceremonial saber at Coast Guard Academy commencement. pic. twitter.   —   ABC News (@ABC) May 17, 2017,  Kelly’s joke sparked a predictable freakout from media and leftists. Why, Gen. Kelly? When POTUS has repeatedly  aggressively attacked the press? https:  .   —   Jim Sciutto (@jimsciutto) May 17, 2017,  I fought with John Kelly in Iraq. This is shocking to me, and it’s not a funny joke. Professionals don’t say these kinds of things. https:  .   —   Mark Hertling (@MarkHertling) May 17, 2017,  Here’s a shitty thing to say to in front of hundreds of JOs who just swore to defend the Constitution of the US https:  .   —   Adam Weinstein (@AdamWeinstein) May 17, 2017,  If it wasn’t already clear, DHS John   about killing the   not the champion of democratic norms he once appeared to be. https:  .   —   Katherine Eban (@KatherineEban) May 17, 2017,  But, Gen. Kelly  …    the pen is mightier than the sword. https:  .   —   Ellen Rose (@icklenellierose) May 17, 2017,  Nothing about this ”joke” between @DHSgov Secretary Kelly and @realDonaldTrump is funny  …     https:  .   —   Joseph Amodeo (@josephamodeo) May 17, 2017,  Literal saber rattling https:  .   —   Ryan Teague Beckwith (@ryanbeckwith) May 17, 2017,  During his speech to the graduates, Trump hammered the media. “Look at the way I’ve been treated lately especially by the media. No politician in history, and I say this with great surety, has been treated worse or more unfairly,” he said. “I didn’t get elected to serve the Washington media or special interests. I got elected to serve the forgotten men and women of our country, and that’s what I’m doing,” he added.'"}, "time": 1742562351.797697}