{"duration": 0.06243324279785156, "input_args": {"text": "'By Rixon Stewart on October 27, 2016 Rixon Stewart — Oct 26, 2016 Donald Trump warned on Tuesday that Hillary Clinton’s Syrian policy could ignite World War III. “She has no plan for Syria. And, look, with her you’ll end up in World War III. She doesn’t know what she’s doing, just like with Libya, just like with everything else she’s done. So, Syria now is no longer Syria. Syria is Russia and the new Iran, that we built through the Iran deal, which is the worst—one of the worst negotiated deals I’ve ever seen.” ( democracynow.org ) Trump isn’t alone in warning of the danger to world peace a Hillary Clinton presidency would bring. Russia’s President Vladimir Putin has also sounded a similar warning, telling reporters recently: “Mrs Clinton has chosen to take up a very aggressive stance against our country, against Russia” Putin was quoted as saying. Unfortunately the elite want to see WWIII unfold as they see it as a solution to their most pressing problem: too many useless eaters. As a result they’ve set into motion plans for a large-scale military clash between the West and Russia and its allies. The end result, they hope, will be massive depopulation. Leaving themselves as overlords and those few who survive as little more than serfs on their global plantation. To this end U.S., British, Canadian, Italian and German forces are all preparing to deploy to eastern Europe early next year. Although ostensibly to deter “Russian aggression”, many of these combat ready units will be deployed within sight of Russia’s border. To those in Russia this will look less like a deterrent and more like a direct threat to their own sovereignty. Perfect Timing Assuming she wins, and there is good reason to believe that the polls will be rigged to ensure that she does, this will also coincide with Hillary Clinton assuming office. And as a mentor once remarked: there’s no such thing as coincidence. So the pieces are being put into place for an almighty clash between Russia and the West and the elite want Clinton to preside over it. She’s already voiced her readiness to impose a no-fly zone over Syria , a move that could easily provoke a military clash between Russia and the West. Moreover such a confrontation won’t merely involve Russia and the West; Syria and Iran would also be involved as would China. In other words a win for Hillary could easily set the stage for a world war. That’s what the elite want and that’s why we believe the U.S. presidential vote will be rigged in her favour. The warning signs are there to be seen. Tens of thousands of voting machines, which have been linked to George Soros and were used in a disputed election in Venezuela in 2004, are to be used in key states in the Nov 8 election. In addition surveys claiming Hillary a clear favourite have been called into question by the sheer numbers attending election rallies. While Donald Trump has been drawing capacity crowds Hillary Clinton’s campaign gatherings have been noticeably less well attended . There is moreover a wide disparity in pre-election opinion polls. Some are putting Trump ahead . While others are giving Clinton a double digit lead . Landing in Pennsylvania now. Great new poll this morning, thank you. Lets #DrainTheSwamp and #MakeAmericaGreatAgain ! TRUMP 42% \\n— Donald J. Trump (@realDonaldTrump) October 22, 2016 Call me a conspiracy theorist but such a wide discrepancy in campaign rally crowd numbers and survey findings suggests that the poll figures are being manipulated to create the illusion of support for Hillary. The elite have been trying to pull off a major global military clash for years. They tried it with Iran and its alleged nuclear weapons program. That failed after the Ayatollah proved himself to clever to fall into their trap. Now however, they’ve got Hillary Clinton to do their bidding as they prepare to position her as President of the United States. The warning signs are as clear as daylight. According to Secret Service agents charged with guarding Clinton, the woman is a nightmare to work for. Retired Secret Service agent Ronald Kessler writes: “When in public, Hillary smiles and acts graciously”. However, “As soon as the cameras are gone, her angry personality, nastiness, and imperiousness become evident.” He adds: “Hillary Clinton can make Richard Nixon look like Mahatma Gandhi.” I certainly hope that I’m wrong but we’ll know soon enough. Ed.'"}, "time": 1742628303.4916549}