{"duration": 0.04768252372741699, "input_args": {"text": "'News Outlets Already Report Hillary Losing By Landslide News Outlets Already Report Hillary Losing By Landslide Posted By admin on November 8, 2016 Subscribe In an unlikely and surprisingly early turn of events, news outlets across the country have reported that enough early votes have already come in to determine a winner in this election, making it the earliest call in American history for future President of the United States of America Donald Trump. Thanks to the incredibly fast processing power of computers in this day and age, early votes were counted in record time giving the soon-to-be-President an entire extra day to get ready for his imminent Presidency. The irony of an election called so early, and what Trump would have said had it been called in Hillary’s favor about it being “rigged” is not lost on many Americans. Local pig farmer and regional pie eating champion Kenneth Bacon said of the results, “Now how about that. I was gonna go vote for Hillary tomorrow, but I suppose if it’s a lost cause I’ll just farm some extra pigs. I know when I’m beat and I see no reason to pretend it ain’t how it is!” Many analysts are perplexed by the incredibly early voter turnout in favor of Trump, citing that poll numbers just don’t seem to match up. “I guess Trump supporters are just a close-lipped bunch that keep their opinions to themselves,” said Nate Silver, an American economist and well-respected predictor of both baseball and American elections. “We just couldn’t have seen this coming. \\nTo be honest with you, I’ve lost a lot of money and am going to have quite a bit of egg on my face when I get into the office tomorrow.” \\nEven if every person that hasn’t voted yet in the country rushed out and voted right this minute, Hillary could still not possibly win, meaning those of us that haven’t voted can just sit back and relax. Especially Trump supporters. \\nWhen reached for comment about the victory, Trump had few words, saying only, “Now that I’ve won I’m not going to just sit back and rest on my laurels. I’m going to get out there and start doing my damnedest to make America great again, just like I promised.” '"}, "time": 1742561794.3527663}