{"duration": 0.10454511642456055, "input_args": {"text": "'By Sarah Jones on Tue, Nov 1st, 2016 at 11:48 am A \"veteran\" spy is alleging that Russia is cultivating, supporting and assisting Donald Trump and has been for at least five years. The spy said the response from the FBI was \"shock and horror.\" Share on Twitter Print This Post \\nA “veteran” spy is alleging that Russia is cultivating, supporting and assisting Donald Trump and has been for at least five years. The spy said the response from the FBI was “shock and horror.” \\nThe report alleges that Trump and his “inner circle” have accepted a regular “flow of intelligence from the Kremlin and that Russian intelligence claims to have “compromised” Trump on his visits and could “blackmail him”. \\nDavid Corn at Mother Jones reported: \\nMother Jones has reviewed that report and other memos this former spy wrote. The first memo, based on the former intelligence officer’s conversations with Russian sources, noted, “Russian regime has been cultivating, supporting and assisting TRUMP for at least 5 years. Aim, endorsed by PUTIN, has been to encourage splits and divisions in western alliance.” It maintained that Trump “and his inner circle have accepted a regular flow of intelligence from the Kremlin, including on his Democratic and other political rivals.” It claimed that Russian intelligence had “compromised” Trump during his visits to Moscow and could “blackmail him.” It also reported that Russian intelligence had compiled a dossier on Hillary Clinton based on “bugged conversations she had on various visits to Russia and intercepted phone calls.” \\nThe former intelligence officer says the response from the FBI was “shock and horror.” The FBI, after receiving the first memo, did not immediately request additional material, according to the former intelligence officer and his American associates. Yet in August, they say, the FBI asked him for all information in his possession and for him to explain how the material had been gathered and to identify his sources. The former spy forwarded to the bureau several memos—some of which referred to members of Trump’s inner circle. After that point, he continued to share information with the FBI. “It’s quite clear there was or is a pretty substantial inquiry going on,” he says. \\nIn August, Corn reports, the FBI asked the spy for all information related to his findings and he “continued to share information with the FBI” which he says made it clear there was a “pretty substantial inquiry going on.” \\nIf this report is accurate, the spy’s information confirms what Senator Harry Reid says intelligence experts and FBI Director James Comey already shared with him regarding “explosive information” regarding ties and coordination between Donald Trump and Russia. \\nThis report also rings true given report about the Trump server repeatedly being connected to Russia, including Trump’s server possibly communicating with a Russian bank. \\nIt also makes sense given the many ties to Russia within Trump’s own campaign and indeed Trump’s own rhetoric regarding NATO and Russia. Trump changed the Republican Party platform’s pro-Ukraine proposals and talked about weakening NATO, both of which mirrored Putin’s wish list. NBC reported Monday evening that the FBI is in the preliminary stages of investigating Trump’s ex-campaign manager’s connection to Russia. \\nDonald Trump has already been busted for reading Russian propaganda at his rallies, as Newsweek’s Kurt Eichenwald uncovered an instance of Trump reading propaganda directly from Putin at a rally in Pennsylvania. \\nEichenwald pointed out something vital and that is that the Russians have been hacking into American emails and then falsifying them in hopes of impacting the presidential election, “The Russians have been obtaining American emails and now are presenting complete misrepresentations of them—falsifying them—in hopes of setting off a cascade of events that might change the outcome of the presidential election. The big question, of course, is why are the Russians working so hard to damage Clinton and, in the process, aid Donald Trump?” \\nThe answer to why Putin is trying so hard to defeat Clinton might be in multiple reports that he fears her. Unlike Donald Trump, Hillary Clinton is no pushover. According to former U.S. officials, Putin sees Clinton as a “forceful proponent of ‘regime change’ policies that the Russian leader considers a grave threat to his own survival.” \\nTrump has been acting like someone already groomed by the Kremlin. He’s been a willing puppet for their dangerous goal of destroying western democracy, he is easily flattered and easily manipulated. It’s also easy to see how they could have gotten something on him with which to blackmail him – see the Billy Bush bus tape of Trump bragging about sexual assault. Trump is easy bait. \\nThe fact that the FBI Director felt compelled to announce something about Hillary’s emails that turned out to not be about her emails but about her aide’s emails and even then he wasn’t sure what they said or even if they were duplicates, but he chose to keep this explosive information about Donald Trump’s ties to Russia under wraps is very disturbing. \\nThis isn’t a matter of partisan disagreement about the rules the FBI follows about ongoing investigations. This is a matter of national security at this point if all of these reports from different sources are accurate. But the fact that they come from different sources and that Trump willingly staffed his own campaign with Russian ties and he is advocating for their dream positions and he reads their propaganda straight from the vault so to speak — these facts add up to what looks like a terrifying fire of epic proportions.'"}, "time": 1742561765.9356725}