{"duration": 0.09627532958984375, "input_args": {"text": "'Former U. N. Ambassador John Bolton spoke to Breitbart News Daily on Thursday about speculation that President Trump will delay his decision to relocate the U. S. Embassy in Israel to Jerusalem but announce America’s exit from the Paris climate accords. [“I don’t really know one way or the other,” Bolton confessed. “I wish they would move the embassy to Jerusalem. I suspect if they were going to that in the near term, they would have announced it on the president’s trip to the region  —   which was very successful in both its Saudi component and its Israel component. ”  Bolton noted that on the same day the White House is expected to announce the Jerusalem decision, it is also expected to announce withdrawal from the Paris climate accords, a combination he described as “a kind of good   news strategy. ” “I have my fingers crossed that the president will get out of the Paris accords today. We’ll wait and see what happens on that, too,” he said. SiriusXM host Raheem Kassam asked why so many American leaders talk about moving the embassy to Jerusalem but never actually do it. Bolton replied that while there is “strong feeling about moving the embassy” among the general public not just among Jewish Americans, but also among dedicated Christian supporters of Israel, American politicians were given pause by the potential political fallout. He suggested that on the contrary, they should see moving the embassy as a domestic political winner. Another reason the embassy does not get moved is the U. S. State Department’s view that “the status of Jerusalem is a matter for the final negotiations in the creation of a Palestinian state. ” “Therefore, the argument goes, if you do anything to prejudice the outcome of the final status negotiations, you could blow the whole thing up,” he explained. “This is utter nonsense,” he argued. “Number one, the whole premise  —   that is to say, a   solution where a new Palestinian state is created, which we’ve been at now for more than 70 years  —   has proven to be a complete failure. If that’s the premise for the argument about final status, we can dispense with that pretty quickly. ” “I think, even more importantly, just as a practical matter, no one has ever suggested that the U. S. embassy, if it were moved to Jerusalem, would be put in East Jerusalem, which is what the Palestinians claim would be their capital,” he continued. “There has been space made available by the government of Israel in West Jerusalem, west of the ‘green line,’ in territory no one has ever in their wildest dreams claimed would be part of a new Palestinian state. So erecting a U. S embassy there could not conceivably prejudice the final outcome. ” “And then there’s another reason,” he added. “I think when the U. S. decides to have diplomatic relations with a country, it’s between the U. S. and that country alone to determine how they are going to conduct relations. I view this as an analog to dealing with Taiwan, where the mainland Chinese are constantly trying to tell the United States how to behave, and unfortunately, we respond. We don’t allow Taiwanese diplomats into the State Department, if you can believe it, because we don’t want to offend Beijing. I think it’s time for the United States to say, ‘You know, we’re going to conduct U. S. diplomatic relations the way we want, period.’ If that means putting the embassy in Jerusalem, let’s do it. ” Bolton shared Kassam’s dim view of the “hysteria emanating from Europeans” after President Trump’s overseas trip. He noted that the U. S. Embassy in Berlin issued an assessment that German Chancellor Angela Merkel’s negative comments about President Trump were intended to influence domestic politics. “In other words, this does not rise to the cosmic level of affecting the   alliance,” Bolton elaborated. “I remember very well at the beginning of the George W. Bush administration, the Europeans were saying much the same thing: ‘Oh, my God, the United States is going to create a national missile defense system! They’re going to hide behind it! They’re going to go isolation again! They’re going to leave us poor Europeans out here to defend ourselves! ’” “And then President Bush withdrew from the 1972   Missile Treaty so we could create a national defense,” he recalled. “We did withdraw from the International Criminal Court treaty, we unsigned it. We did get out of a hopeless negotiation over an utterly unworkable biological weapons verification protocol. The only thing really we didn’t wrap up was we didn’t unsign the Kyoto Protocol, which we should have done. ” “My point is, it was the same wailing and gnashing of teeth by the Europeans about the end of the   alliance, the decline of American leadership. It wasn’t true then. It’s not true now,” said Bolton. He sized up the Paris climate accord as “an excellent thing to withdraw from. ” “In fundamental terms, it’s basically an utterly meaningless document,” he noted. “Each country involved sets its own targets and then declares its own progress. The world’s two biggest polluters, India and China, don’t even have to begin reducing carbon emissions until 2030. The Europeans have the math rigged in their favor. ”  “The whole thing is a charade, except to this extent: even in effect as toothless as it is, what the Europeans and the Obama administration did when they negotiated the Paris accord was try to take a step forward toward formalizing this global governance structure that they had tried and failed, in the predecessor Kyoto agreement and the predecessor Copenhagen agreement,” Bolton charged.  “Even though it appears toothless in the near term, it sets a foundation that they hope to advance toward a greater multilateral global governance. Forget the environmental aspect for a minute  —   we could be talking about global cooling here, rather than global warming. The advocates of this treaty would propose the same kinds of structures because that’s their larger objective: the reduction of national sovereignty and the pooling of sovereignty as in their favorite institution, their paradigm of the world to come, the European Union,” he warned. “I think it’s important for the United States to say, ‘If you people want to pool sovereignty and reduce your democratic control over governments, which is a very widespread view regarding Brussels and the European Union now, you go right ahead. We’re not going to play any part of it,’” Bolton advised. Kassam amplified Bolton’s point about individual countries playing games with their Paris emission targets by recalling how the French themselves dealt with high   emission targets by simply moving the sensors onto rooftops. “You gotta love the French!” Bolton chuckled. “When they invented the word ‘hypocrisy,’ it came from Paris, and they are great at it, God bless ’em. ” John Bolton is a senior fellow at the American Enterprise Institute and head of his own political action committee, BoltonPAC. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. '"}, "time": 1742564426.3778148}