{"duration": 0.023694753646850586, "input_args": {"text": "\"Leaked memo lays out Clinton Foundation funny business that troubled ‘spoiled brat kid’ Chelsea Posted at 9:43 pm on October 26, 2016 by Brett T. \\nWith the debates behind her, Hillary Clinton is back to dancing with TV hosts and confirming the influence of West Coast rap on her wardrobe. \\nWikiLeaks, however, keeps on leaking, and a hacked memo posted Wednesday seems to show what inspired Bill Clinton aide Doug Band to describe Chelsea Clinton as “a spoiled brat kid who has nothing else to do but create issues to justify what she’s doing.” Teneo’s co-founder called Chelsea Clinton “a spoiled brat kid” after she said the firm was “hustling” for business. https://t.co/uYiO0F9YtV \\n— NYT Business (@nytimesbusiness) October 26, 2016 \\nWhat Chelsea was doing was retaining a law firm to review just what was going on at the Clinton Foundation, and that’s something Band certainly didn’t need, according to the newly released memo. INSIDE 'BILL CLINTON INC.': Hacked memo reveals intersection of charity and personal income https://t.co/dmzRtDck99 @postroz @thamburger \\n— Ed O'Keefe (@edatpost) October 27, 2016 Hacked memo: Clinton Foundation fundraisers pressed donors to steer business opportunities to Bill Clinton https://t.co/LobbUZUWhY 🔓 \\n— Wall Street Journal (@WSJ) October 27, 2016 \\nAnd here’s the Daily Caller’s take, which includes a little word the other headlines don’t: “illegally.” WIKILEAKS: Clinton Aide’s Law Firm Illegally Raised $150 Million for Clinton Charity https://t.co/eVix5hgOVO #WikiLeaks #PodestaEmails19 pic.twitter.com/LJhF5QjCFl \\n— The Daily Caller (@DailyCaller) October 27, 2016 \\nIn a memo for the law firm of Simpson Thacher, which was conducting the governance review of the nonprofit Clinton Foundation, Band explained how he leveraged his activities within his for-profit consulting firm Teneo to raise funds for the foundation and steer lucrative activities to the Clintons: \\n… we have in effect served as agents, lawyers, managers and implementers to secure speaking, business and advisory service deals. In support of the President’s for-profit activity, we also have solicited and obtained, as appropriate, in-kind services for the President and his family — for personal travel, hospitality, vacation and the like. \\nDid somebody say lucrative?\""}, "time": 1742628573.918528}