{"duration": 0.2096872329711914, "input_args": {"text": "'424 Views November 17, 2016 No Comments Guest Posts The Saker \\nby Oleg Maslov \\nIt’s official, Russia has decided to grab the bull by the horns. Just one week after the shocking vote in the US presidential election resulted in a Trump victory, Russia has decided to pull all the stops and take care of some long lingering business while Obama’s administration is working overtime to manage a transition that no one expected would happen and Obama himself is out of the office, making what might be his very last visit to Europe, calming the closest of American allies in a time of serious questions about the future of the American relationship with NATO. \\nObama has just two months before Trump will be sworn in and much of the time and energy of his staff will be consumed by briefing Trump and his cabinet, which is not yet fully formed, on their duties and on the situation in the world in general. Perhaps Obama’s own transition team will try to convince the Teflon Don and his staff to pursue a similar policy on many issues, not the least of which include Obamacare and the Paris agreement on climate change. Trump himself has already received a call from Putin shortly after the election, one of Trump’s most publicized calls with world leaders after news of his victory broke, putting even more pressure on Obama’s transition team to get their points across quickly. \\nIn the meantime, Obama is making his last expected tour of Europe before Trump’s inauguration. It is not certain exactly why Obama chose to visit Greece first, but it is certainly significant that he was greeted with tens of thousands of protesters, in the least because it shows the current zeitgeist. Obama has to perform his duties of Salesman in Chief as he goes around to NATO allies and reassures them of budget commitments to American forces stationed abroad. I can only imagine the brain-tingling questions that Obama will have to field from the German and French defense ministers. \\nThe main source of all the sweating European bureaucrats is Trump’s apparent friendliness with Russia and criticism of NATO, which could mean that Brussels will have to have some existential discussions on many long standing policies, including the sanctions against Russia. In fact, if Trump were to recognize Crimea as a legal part of Russia, as he has suggested that he is willing to do, Europe may either have to follow suit and bring down the house of cards commonly referred to as the Ukrainian Crisis or declare an open break with Washington’s foreign policy, a veritable checkmate. \\nIf the current batch of Eurocrats were to keep their jobs (which is looking questionable), they would most probably try to avoid an open break with Washington or, ironically, risk losing their jobs. An open break with Washington would set the European Union into open waters of foreign policy sovereignty, a move that would meet with great resistance from many sources. Either way, an incredible shake-up is coming to Ukraine soon as they are about to have much less friends in the ‘international community’. \\nHowever, all of these major theatrical dramas and loud, painful snowflake whines are actually working wonderfully to divert attention from the real news. This last Monday night, Russia did several noteworthy things on a globally relevant geopolitical level that will surely resonate with the global movers and shakers. Russia launched an all-out air assault onto ‘Syrian rebels’ operating in the Homs, Idlib, and Latakia provinces of Syria. Monday night’s military campaign coincided with the biggest corruption bust in the history of modern Russia – the Russian Economy Minister Ulyukaev was taken into custody by the FSB after being caught demanding and accepting a $2 million bribe. Lastly, and perhaps less significantly but just as suddenly and symbolically, Russia has announced that it will no longer participate in the International Criminal Court. \\nHowever, in the humble opinion of this author, the most important fact to note connecting these three events is that they represent huge milestones in the modern history of Russia. One event is on the domestic political and economic level, connecting staff thought to be within the inner circle of the Kremlin specifically with financial corruption. The second is purely military in nature and works to show off the power projection capabilities of the modern Russian military. Thirdly, Russia’s decision to leave the ICC is a huge signal to Russia’s positions in the context of international bodies, up to and including the UN. \\nI would like to highlight this point just one more time to make sure that the meaning doesn’t slide by anyone. The government of Russia has just performed the biggest government shake up since the fall of the Soviet Union, with the FSB arresting the ‘untouchable’ Economy Minister from his post and placing him on a very public trial for extorting a very large bribe. Russia have also launched the biggest attack on an enemy military at least since the Second Chechen conflict, which was the major event of the first few years of Putin’s presidency over 17 years ago, and, at most, since Soviet forces left Afghanistan in 1989, 27 years ago. And lastly, Russia has made a very major and unexpected decision to abandon the jurisdictions of the ICC, long known for its adherence to justice and fair verdicts (sarcasm). AT NEARLY EXACTLY THE SAME TIME! \\nIs it just me, or does it seem like the planets are aligning here? \\nLet’s analyze the first event. Alexei Ulyukaev was accused of extorting a bribe from state-owned oil company Rosneft to tune of $2 million, cold hard cash, and was arrested by investigators (mostly three letter agencies) at night. To top it all off, one official said under condition of anonymity that Ulyukaev’s arrest was the final act in a yearlong investigation by the FSB. Ulyukaev, a member of the Russian government since the break-up of the Soviet Union, has been considered as member of Russia’s liberal, Western-leaning politicians. Of particular interest is Ulyukaev’s CV. \\nUlyukaev has held some critical positions in the modern Russian government, including serving under Gaidar and managing the shock privatizations of Soviet assets (as well as the shock hyperinflation) from 1991-1994. He was a deputy to Finance Minister Alexei Kudrin from 2000-2004 before taking a job as the first vice-chairman of the Russian Central Bank, a position that he held from April 2004 to June 2013. When he was arrested, again, in the middle of the night, he was the acting Economy Minister. \\nUlyukaev was certainly high on the list of those considered to be untouchable. \\nAlong with Ulyukaev, the vice-governor of Saint Petersburg and some high-ranking officials in the regional government of the Kemerovo region have also been arrested for corruption after investigations by the FSB. \\nVarious commentary has already surfaced claiming that Putin has turned to the age old Russian tradition of the Purge. Opinion leaders in the community are writing that no ‘chinovnik’ or oligarch could feel that ‘untouchable’ anymore after Ulyukaev’s arrest and that corrupt officials better behave or face the ax. Still others are claiming that Putin is consolidating his power and is preparing to become a dictator in the classic sense. No matter which explanation you prefer, the fact remains that the Russian government is powerfully expressing its political and economic sovereignty and is publicly making a loud statement against corruption. \\nThe second incident was a comprehensive and simultaneous assault on rebel targets all over Syria in a very short time frame. Targets were struck with a bevy of missiles launched both from sea and by land. One of the most surprising features of this massive campaign is the sheer size and diversity of it. The Bastion system, highlighted as a defensive surface-to-surface missile system, showed off its potent attack power, engaging targets up to 300 miles away. \\nIHS Janes reports on the news that Russia is “not known to have previously claimed” that the Bastion, which is originally an anti-ship missile, “has a land attack capability”. It turns out that missile ‘defense’ systems designed to engage land targets, such as the United States Missile Defense systems in Poland and Romania, can easily be used to engage in attacks on land targets. Surprise, surprise. \\nHowever, the brunt of the missile strikes done by Kalibr missiles launched from the Mediterranean Sea, most notably from Russia’s new and improved frigate, the Admiral Grigorovich. In fact, the Russian naval group, led by the aircraft carrier Admiral Kuznetsov, made ‘waves’ in Europe as the group was headed to their final destination, the Syrian coast, from which they launched volley after volley of high precision cruise missiles at targets from what is most likely a confusing medley of rebel groups. It is highly likely that, among the rebel groups which met the explosive end of a Russian cruise missile, some were directly funded by American allies, and less likely that the Russians even targeted groups directly trained or supplied by the CIA. \\nThis major military move actually kills two birds with one stone. First, it provides Russia’s allies and ‘partners’ in the area with a bit of information about how far and in what quantity the Russian military can project its power. Further, it reveals that the Russians are most likely purposefully understating the power and capabilities of many of their newest technologies (although this should come as a surprise to no one). Also to this point, the Russian government did not ask permission of any international body when it passed through international waters and made its way to Syria, despite the ‘uncomfort’ felt in London. The second stone is that Russia has engaged in one of the most effective and convincing advertising campaigns for their newest export model military products. With loud fanfare, the Russians showed the world that Russian arms still give great bang for the buck. \\nThe last major move, but, in the view of this author, not nearly as significant as the other two, is Russia’s decision to withdraw its signature from the Rome Statute, which established the International Criminal Court. This move was sudden and symbolic, coming after the ICC ruled Russia’s ‘annexation’ Crimea illegal and called the current situation an ‘occupation’, but will lead to no noticeable change in real terms, since Russia never actually ratified the Rome Statute, meaning that it never submitted itself to the jurisdiction of the ICC to begin with. \\nOne can write more on the nature and meaning of the withdrawal of Russia from the ICC, but the readers are welcome to find their own facts and form their own opinions. I will also stop short of giving my opinion on this strange set of geopolitical ‘coincidences’, and finish only with a invitation for speculation on what these facts could mean for the future of Russia, Russia’s relationship with Europe and the world, and the global security structure as a whole. The Essential Saker: from the trenches of the emerging multipolar world $27.95 '"}, "time": 1742563103.3340642}