{"duration": 0.23703908920288086, "input_args": {"text": "'  25, 2016 4 Easy Solutions For Lighting Your Indoor Plants \\nWhether you’re trying to start your seeds so that you have healthy seedlings or young plants to set out when the weather warms or you’re growing all of your plants inside, lighting is an integral part of growing. \\nFinding the best indoor lighting options for your plants can be a challenge, though. \\nIt would be ideal if you could place all of your plants by windows so that they can get their natural source of light: sunshine. However, that’s not always possible, especially if you’re growing a lot of plants and you want to keep them under the radar. \\nThere are plenty of great options and, thanks to technology, they won’t all cost a fortune. We’ll discuss that as we go. \\nChoosing the Type of Light \\nBefore we start discussing bulbs, you need to understand a bit about growing plants and what type of light they need. Many newcomers to the scene think that, like owning a guinea pig or a snake, the light is used to keep the plant warm, but that’s not the case. \\nPlants require light to grow and flower, but not all light is equal. For that matter, not all light is necessary and the types of light that plants need are actually dim to human eyes. \\nThe sun offers a full spectrum of light colors that range from blue to red. It’s actually those two colors that plants need the most. Blue light enables the plant to grow bushy and full. Red light causes the plant to produce a hormone that makes it flower. As you’ve probably already figured, you want both for your edibles. \\nThe colors in between, particularly green, are completely unnecessary; green light is purely for aesthetic purposes. It just makes your plants appear green and glossy because the plant reflects it back. That may be useful information if you want your plants to look pretty as they grow. \\nAnother factor that you need to consider is heat. Unless you’re growing your plants in a cold room, standard room temperatures are more than enough heat to grow most plants. You really don’t need heat from your bulbs. Too much heat will burn your plants and many high-heat bulbs burn out fairly quickly, too. \\nYou’ll see watts , which is how much energy the bulb produces, and you’ll also see Kelvins . Kelvins are the basic unit of color temperature that’s used to measure that whiteness of a bulb’s output. In other words, it’s the best description of the visual warmth or coolness of the bulb. \\nThe higher the degree of Kelvin, the bluer the light. The lower the Kelvin, the warmer, or redder, the light looks. Shoot for 4000-6000 Kelvin because that level of light borrows from all parts of the spectrum including the blues and reds that you need for growth and flowering. \\nSome plants, such as peppers and lettuce, may not need as much red light because they don’t flower quite as much. \\nNow that you understand the basics of what you need to make your plants grow, let’s talk about the different types of light and whether they’re best for your needs. \\n1. Incandescent Lights \\nThese are the types of bulbs you probably already have in your fixtures. They’re pretty much standard bulbs. Incandescent bulbs put off a ton of heat and don’t really produce the type of light that your plants need to grow. \\nOnly about 10 percent of the energy that they produce goes toward light; the rest is heat. They’re OK for growing low-light plants such as vines, but they’re not much good for growing anything seriously. \\n2. Fluorescent Lights \\nThese lights put off mostly blue light, which means that you’ll have bushy plants. These are OK for growing plants that you don’t need to flower such as lettuce or cabbage. They’re also good for starting your plants inside. Fluorescents come in different lengths and are shaped like tubes. \\nOne of the biggest downsides here is that you have to hang them is special ballasts. Regular fluorescents are great for at least starting your seeds, and they’re good for plants that don’t need so much of the red light such as herbs. \\nIf you opt to go with fluorescent lights, you should know that the narrower the bulb, the more efficient the light is. They also use 75 percent less energy than standard incandescent lights. \\nNow there’s a new fluorescent system out called the T5 system. They put out double the amount of light per tube as regular fluorescent tubes and they’re full-spectrum. That means that instead of just having the blue light like regular fluorescent lights have. \\nIf you’re using a T5 system adjust the proximity of the light to the plant as it grows. Since the bulb isn’t insanely hot, you don’t have to worry about burning the plant. Video first seen on katie phibbs . \\n3. High Intensity Discharge Solutions \\nThese are great options for growing your plants but they’re expensive. High-intensity discharge lights are extremely efficient and produce a lot of light. There are a couple of types that emit different spectrums of light. \\nThe Metal Halide, of MH, light emits the blue light that will encourage the leafiness, and the High Pressure Sodium, or HPS, lights produce the reds that you need to make it flower. \\nYou could use the MH light to get it started and full, then swap it out for the HPS to get it to flower, or you could use them in tandem. These bulbs are expensive but one 1000-watt lamp can produce the same amount of light as fifty 40-watt fluorescent bulbs. They come in different sizes. \\nJust to give you an idea, one 400-watt bulb can produce enough light to cover a 15sf growing area, or a 4’x4’ garden. The 1000-watt bulb covers about a 7’x7’ area. Figure that each 25 watts covers 1 square foot of garden. \\n4. LED Lights \\nWe’ve been using them for Christmas lights for years but LEDs are relatively new to the agriculture scene. They produce practically no heat and don’t use hardly any power, either. Remember how we discussed the Kelvin measurements? Well LEDs can be programmed to 5700K to mimic the light spectrum of the sun. \\nRight now, LED grow lights are expensive but they’ll likely become cheaper as they develop the technology and the method becomes more popular. \\nFiguring Costs \\nRemember that you’re going to be in this for the long run. If you’re only growing a few plants, it’s probably fine to go with a cheaper bulb or system but if you’re going to grow a significant amount of plants and plan to do it for the foreseeable future, you’ll probably be better off to invest a bit of money in the beginning and let it pay off in the long run. \\nTo figure the cost of your system, add up the combined wattage of all of your lights and divide that by 1000. That will give you the kilowatts used. Multiply that by how much your power company charges you per kilowatt hour. Multiply that by the number of hours the lights will be on per month and you have your monthly energy cost that you can compare to the original cost of the system. \\nIf you’re fortunate enough to live completely off the grid and you are powering your house by solar or some other sustainable method, then you can go with the best system for your situation that’s within your price range. If you notice, though, the more expensive systems use relatively little energy. \\nEvery survival plan must have food at its core.   and discover how you can grow your own food with just 10 minutes a day! \\n  10 total views, 10 views today'"}, "time": 1742562155.7153118}