{"duration": 0.12079095840454102, "input_args": {"text": "'  28, 2016 | Politics , Science   The problem we have to solve is, as Howard Zinn told us, not too much civil disobedience, but too much civil obedience. \\nYour purchases at Amazon.com via affiliate links below will help support FPJ at no extra cost to you. \\nB ack in the winter of 1982, Air Florida flight 90 took off from National Airport. The first officer noticed dangerous readings on some instruments and pointed them out to the captain. The captain told him he was wrong, and he accepted the captain’s authority. He did nothing. Thirty seconds later the plane crashed into the 14th Street Bridge. Everyone on board died except for four passengers rescued out of the icy river. \\nDuring the latter decades of the 20th and first part of the 21st century, millions and millions of first officers on spaceship earth noticed that climate and nuclear dangers loomed. But every authoritative captain in sight, from elected officials to CEOs to media pundits, said “Don’t be a fool. I’ve got this.” And millions upon millions sat back and mumbled “Oh, all right, if you’re sure.” \\nThe people pushing through the vote this week at the United Nations to create a treaty next year banning nuclear weapons are engaged in necessary disobedience to mainstream authority and acceptance. The people putting their bodies in the way of a pipeline in North Dakota are disobeying immoral orders. \\nIra Chaleff’s book, Intelligent Disobedience , re-examines the lessons of the Milgram and Stanford prison experiments, and other more recent demonstrations of the severe dangers of uncritical obedience. Chaleff highlights some techniques that can facilitate intelligent refusals to obey. \\nWhen Milgram put the actor pretending to be given electric shocks in the same room, visible to the person ordered to shock him, obedience dropped by 40 percent. This suggests we need fewer trips to Disney World and more to Hiroshima, fewer student exchanges to England and more to Russia and Iran, fewer summer jobs at the local swimming pool and more at the nearest climate-impacted site in need of assistance. \\nMilgram also got obedience to drop by 20 percent by removing the authority figure from sight and having him deliver his orders by telephone. This does not suggest demonizing or antagonizing authority figures, but rather distancing and diminishing them. We need to metaphorically bring them down to size, and we need to physically and otherwise get away from them. Throw out your television to get their faces out of your living room. Read the news online as needed. Practice kneeling during the national anthem; it’ll give you a whole new outlook in which hearing a civilian refer to “our commander in chief” sounds frighteningly out of place. \\nMilgram reduced obedience by 100% by having a second authority figure contradict the first one. As long as people are going to practice subservient obedience, we need to identify and recruit and broadcast all apparent authority figures who contradict the destructive orders of the mainstream authorities. Who counts as an authority figure may vary from person to person, but we don’t have to choose. The more the murkier! \\nWe also need to lead by example. Even when Milgram’s lone authority figure ordered shocks, if the subject of the experiment saw someone else refuse to obey, then 90% of the time he or she would also refuse. This is a huge opening for us. But it does not mean that we can create a little Eco village and thereby save the world. It does mean that doing that will help. But we need examples of people challenging the entire system that deals weapons and subsidizes fossil fuels. And we need lots of examples so that everyone watching can see someone who looks like them engaged in constructive disobedience. \\nIn warfare, militaries condition people to obey immoral orders through, among other things, a number of distancing techniques. It’s easy to murder someone far away or unseen. It’s easier to order someone else to do it. It’s easier to be part of a group doing it together. It’s easier to think of it as defending someone else rather than simply committing murder. We have to reverse all of this distancing. We have to put the victims and potential victims of war and of climate chaos right up close to the vision of as many people as possible. We have to create unavoidable responsibility. The bill in the British parliament that would allow people to choose whether to pay war taxes is one possible approach. We have to make those engaged in ordinary, typical muddling through understand that as long as they fail to take radical action they are engaged in the slow but massive taking of human life. \\nWe should replace the pledge of allegiance with the Nuremberg principles and the Hippocratic oath. The problem we have to solve is, as Howard Zinn told us, not too much civil disobedience, but too much civil obedience. \\n '"}, "time": 1742564197.1790617}