{"duration": 0.039383649826049805, "input_args": {"text": "'Celebrities including Susan Sarandon, Dulé Hill and Lizzy Caplan know why President Donald Trump issued an executive order last week temporarily prohibiting some immigration to the United States  —   it’s because he’s working from an alternative, “cursed” Constitution. [In the latest political PSA from   comedy website Funny or Die released this week, a number of celebrities  —   including Shailene Woodley, Cara Delevingne, Jamie Chung and others  —   lay out the case for why they believe Trump is relying on an old “alternate” Constitution found in a musty old cave.   “We only know of two copies [of the alternative Constitution] one of which archaeologists found cradled in the mouth of a large golden   deity hidden in a deep underground cave,” explains West Wing star Hill. “Trump was accidentally given the other copy when he was a teen. ” “He’s working from the wrong Constitution and he doesn’t even know it,” says Delevingne. In the supposed “alternative” Constitution from which Trump is working appears the clause: “Congress shall make no law respecting an establishment of religion, but if a handsome, brave, scared president makes an executive order that favors one religion over another, he shall only experience pure ecstasy. ” The PSA marks the latest   entry from Funny or Die after the Will Ferrell and Adam   comedy website became nearly the premiere destination for such videos during the election.   offerings from the website included Tom Green’s parody music video “Do the Donald” and Katy Perry’s “Vote Naked” political PSA. Last year, the site released a   “lost” made for TV movie based on Trump’s bestselling book The Art of the Deal, with Johnny Depp starring as Trump. Watch the full “Alternative Constitution” sketch above.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562333.9557333}