{"duration": 0.12045836448669434, "input_args": {"text": "'Rare is the individual who hasn’t tripped over a pet or uneven pavement, tumbled off a bike, slipped on ice or maybe wiped out skiing or skating. Some get injured, while others go unhurt  —   often claiming it’s because they knew how to fall. According to paratroopers, stunt professionals, physical therapists and martial arts instructors, there is indeed a “right way” to fall  —   and it can save you a lot of grief if you know how to do it. Although often associated with older people, falls occur at any age and are the most common cause of injury seen in emergency rooms in the United States. The Agency for Healthcare Research and Quality estimates that falls cause more than a third of   emergency room visits, around 7. 9 million a year. “As physical therapists we talk a lot about preventing falls, but what we don’t talk about is what to do when you actually do fall,” said Jessica Schwartz, a physical therapist in New York City who trains athletes and people with prosthetic limbs to fall without hurting themselves. “It’s almost inevitable you are going to fall, so you really should know what to do. ” The number one thing to remember, she said, is to protect your head. So if you find yourself falling, pivot to your side and tuck in your head. “Have you seen those slip and fall cartoons where the characters fall flat on their back or face? Don’t do that,” said Dr. Schwartz. “You’ll hit your head like a coconut and get a concussion,” and the reverse motion, or bounce, of your head after impact “will give you something like whiplash. ” Moreover, falling straight forward or backward raises the risk of damaging your spine and vital organs. The other thing to avoid, she said, is “foosh,” an acronym for “falling onto outstretched hands. ” If you do that, all the force of impact will be concentrated there, raising the risk of breaking your wrist. You similarly don’t want to come crashing down on your knee so you break your kneecap or do that maneuver where you kind of pedal with your feet to catch yourself, which can lead to broken bones in your foot and ankle. Instead, if you feel yourself falling, experts said you should bend your elbows and knees and try to take the hit on the fleshiest parts of your body, like the side of your thigh, buttocks and shoulder. “Aim for the meat, not bone,” said Kevin Inouye, a stuntman and assistant professor of acting, movement and stage combat at the University of Wyoming. “Your instinct will be to reach out with hands or try to catch yourself with your knee or foot, but they are hard and not forgiving when you go down. ” The key is to not fight the fall, but just to roll with it, as paratroopers do. “The idea is to orient your body to the ground so when you hit, there’s a multistep process of hitting and shifting your body weight to break up that impact,” said Sgt. First Class Chuck Davidson, master trainer at the Army’s Advanced Airborne School at Ft. Bragg, N. C. Paratroopers’ goal is to fall sideways in the direction the wind is carrying them  —   in no way resisting the momentum of the fall. When the balls of their feet barely reach the ground, they immediately distribute the impact in rapid sequence up through the calf to the thigh and buttocks. Then they roll over on the latissimus dorsi muscle, the large, flat muscle running laterally down the side of your back, and kick their feet over, shifting their weight so they end up supine with legs bent in front of them. The procedure is strikingly similar to how martial arts practitioners learn to take a fall when they are, say, thrown over someone’s shoulder or have their legs knocked out from under them. “I would say the principles we follow are: Accept that you’re falling and go with it, round your body, and don’t stiffen and distribute the energy so you take the fall in the widest area possible,” said Paul Schreiner, a black belt jiu jitsu instructor at Marcelo Garcia Academy in New York City. While martial arts falls often have a gymnastic aspect, with rather elegant and snappy kinds of somersaults, it’s still all about spreading out the force of impact. “There may be an aesthetic component, but what it does is save the body,” said Mr. Schreiner. “If you don’t take the fall in any single place, you’ll still walk out sore, but you’ll walk out of there. ” Difficult as it may sound as you’re hurtling toward the ground  —   medical bills and disability flashing through your mind  —   experts said it’s important to relax as you fall. You’re less likely to hurt yourself if you soften up all your muscles and exhale. Rigidity is your enemy, while pliability is your friend. “As unfair as it is, that’s why people who are drunk” tend to be the ones who “don’t get hurt in car crashes,” said Mr. Inouye. “They are loose and just flop around. ” Of course, you will be better able to loosen up, pivot to your side, tuck and roll if you are in good physical condition. “If you have a room full of soccer players and computer desk workers and go around knocking people over, you can bet the soccer players are going to be less likely to get hurt because of their superior strength, agility and coordination,” said Erik Moen, a physical therapist in Kenmore, Wash. But that doesn’t mean you have to be an elite athlete or paratrooper to fall the “right way. ” Young children are arguably the best fallers because they have yet to develop fear or embarrassment, so they just tumble and roll without tensing up and trying to catch themselves. Physical therapists can be helpful in assessing your weaknesses and prescribing    exercises to improve your strength and agility (for example, jumping from side to side and on and off platforms or steps) so that you will be better able to execute a fall as well as lessen the risk that you will fall in the first place.'"}, "time": 1742561944.4764712}