{"duration": 0.07512640953063965, "input_args": {"text": "'Written by Jacob G. Hornberger   The latest massacre of many innocent people by US forces in Afghanistan provides another demonstration as to why it is imperative that the American people stop deferring to the authority of the national security state and demand the immediate withdrawal of all US forces from Afghanistan. In a war that has now gone on for 16 years, US forces just killed at least 32 more civilians, many of whom were children. Another 25 people were wounded. Of course, this is on top of all the wedding parties, hospitals, and other victims of US bombing attacks that have brought the death toll from US interventionism in Afghanistan to more than 200,000, not to mention the wounded, maimed, homeless, and refugees. In the last seven days alone, 95 civilians have been killed in Afghanistan and 111 injured. How many of those 30 people, including the children, who are now being buried had anything to do with the 9/11 attacks? It is a virtual certainty that none of them did. How did this latest US massacre occur? Afghan government forces, assisted by US troops, decided to raid a home in a densely populated neighborhood in a village where a Taliban commander was supposedly having a meeting. The soldiers got trapped in a narrow dead-end street, where they began taking enemy fire from surrounding homes. So, what did they do? Naturally, to save their lives, they called in air strikes, which necessarily involved firing missiles into the neighborhood, which killed those 32 people, including children. The US military’s position is the standard one: The military regrets the loss of innocent life but, they say, they didn’t really have a choice. If they didn’t fire the missiles, the US and Afghan troops would be killed. If they did fire the missiles, the innocent people living in the neighborhood would die. Not surprisingly, the military chose to protect the lives of the soldiers at the expense of those innocent people living in the neighborhood. But let’s be mindful of an important fact: If US troops had not still be intervening in Afghanistan, there never would have been a US bombing raid on that neighborhood. How do the people who survived the massacre feel about what happened? Not surprisingly, they were chanting “Death to America!” Americans should think about that the next time there is a terrorist attack in the United States. Despite the bombing attack, two US soldiers — Captain Andrew Byers and Sgt. First Class Ryan Gloyer — were killed in the battle. What did they die for? No, they did not die protecting our freedom or keeping us safe. That’s nothing but pabulum for the families of those two soldiers — to make them feel okay about losing their loved ones. fThey died for nothing, the same thing that those 58,000 plus US soldiers died for in Vietnam. Freedom and security of the American people have nothing to do with America’s 16-year war in Afghanistan. The Taliban are not coming to get us, any more than the North Vietnamese were coming to get us. The conflict in Afghanistan is nothing more than a civil war, one in which one side is battling to oust a regime that has been installed into power by the US government. Once the US presidential race is over — a race in which the 16-year-old war in Afghanistan has barely been mentioned — the American people need to demand an immediate end to the US occupation of Afghanistan. Continued US interventionism is accomplishing nothing positive and is only pouring fuel on the fire, making matters worse for everyone, including innocent women, children, and others in Afghanistan. Reprinted with permission from the Future of Freedom Foundation . Related'"}, "time": 1742561856.9613583}