{"duration": 0.1659538745880127, "input_args": {"text": "'Hillary Clintons E-Mails und die Muslimbruderschaft von Thierry Meyssan Die Ermittlungen des FBI zu den privaten E-Mails von Hillary Clinton sind nicht gegen eine Vernachlässigung der Sicherheitsbestimmungen gerichtet, sondern gegen eine Verschwörung zu dem Zweck, jede Spur ihres Schriftverkehrs, der auf Bundes-Servern hätte archiviert werden müssen, beiseite zu schaffen. Sie könnte den Austausch von E-Mails über illegale Finanzmittelbeschaffungen oder Bestechungen umfassen oder auch über die Verbindungen des Ehepaars Clinton zu den Muslimbrüdern und den Dschihadisten.\\nVoltaire Netzwerk | Damaskus (Syrien) | 1. November 2016 ελληνικά English Español français Türkçe русский Hillary Clinton und ihre Kabinettschefin Huma Abedin. Die Wiederaufnahme der FBI-Ermittlungen zum privaten E-Mail-Verkehr von Hillary Clinton ist nicht mehr auf Sicherheitsfragen gerichtet, sondern auf Mauscheleien, die bis zum Hochverrat gehen könnten.\\nIn technischer Hinsicht hatte die Außenministerin, statt einen gesicherten Server des Bundes zu benutzen, an ihrem Wohnsitz einen privaten Server einrichten lassen, um das Internet nutzen zu können, ohne auf einem Gerät der Bundesregierung Spuren zu hinterlassen. Frau Clintons privater Techniker hatte vor der Ankunft des FBI ihren Server bereinigt, sodass es nicht möglich war herauszufinden, warum sie diese Einrichtung hatte installieren lassen.\\nIm ersten Anlauf hatte das FBI festgestellt, dass der private Server nicht die Sicherheitsvorkehrungen des Servers des Außenministeriums aufwies. Frau Clinton hatte also nur einen Sicherheitsverstoß begangen. Im zweiten Schritt beschlagnahmte das FBI den Computer des ehemaligen Kongressmitglieds Anthony Weiner. Er ist der frühere Ehemann von Huma Abedin, der Kabinettschefin von Hillary. Dort sind E-Mails wiedergefunden worden, die von der Außenministerin stammen.\\nAnthony Weiner ist ein den Clintons sehr nahestehender jüdischer Politiker, der Bürgermeister von New York werden wollte. Nach einem sehr puritanischen Skandal musste er aufgeben: Er hatte erotische SMS an eine junge Frau geschickt, die nicht seine Ehefrau war. Offiziell trennte sich Huma Abedin während dieser Turbulenzen von ihm, in Wirklichkeit verließ sie ihn aber nicht.\\nHuma Abedin ist eine US-Amerikanerin, die in Saudi-Arabien aufgezogen wurde. Ihr Vater hat die Leitung einer akademischen Zeitschrift – für die sie jahrelang Redaktionsassistentin war –, die regelmäßig die Ansichten der Muslimbrüder wiedergab. Ihre Mutter hat den Vorsitz in der saudischen Vereinigung der weiblichen Mitglieder der Muslimbruderschaft und arbeitete mit der Ehefrau des ägyptischen Präsidenten Morsi zusammen. Ihr Bruder Hassan arbeitet auf Rechnung von Scheich Yusuf al-Qaradawi, dem Prediger der Muslimbrüder und spirituellen Berater von Al-Jazeera.\\nAnlässlich einer offiziellen Reise nach Saudi-Arabien besucht die Außenministerin in Begleitung der Vorsitzenden der Vereinigung der Muslimschwestern in der Bruderschaft, Saleha Abedin (Mutter der Kabinettschefin), das College Dar al-Hekma. Huma Abedin ist heute eine zentrale Persönlichkeit der Präsidentschaftskampagne Clintons an der Seite des Wahlkampfleiters John Podesta, dem ehemaligen Stabschef des Weißen Hauses in der Amtszeit Bill Clintons. Für die bescheidene Summe von 200.000 Dollar ist Podesta übrigens im Kongress der ständige Lobbyist des saudi-arabischen Königreichs. Am 12. Juni 2016 hatte Petra, die amtliche Presseagentur Jordaniens, ein Interview mit dem arabischen Kronprinzen Mohammed bin Salman veröffentlicht, in dem er die Modernität seiner Familie damit unter Beweis stellte, dass sie illegal zu 20 Prozent die Präsidentschaftskampagne Hillary Clintons finanziert habe, obwohl sie eine Frau ist. Am Tag nach dieser Veröffentlichung zog die Agentur die Meldung zurück und behauptete, ihre Webseite sei gehackt worden.\\nLaut der amtlichen jordanischen Presseagentur Petra vom 12. Juni 2016 hat die saudische königliche Familie illegal 20 Prozent der Präsidentschaftskampagne von Hillary Clinton finanziert. Frau Abedin ist nicht das einzige mit der Bruderschaft verbundene Mitglied der Obama-Regierung. Der Halbbruder des Präsidenten, Abon’go Malik Obama, ist Schatzmeister des Missionswerks der Bruderschaft im Sudan und Vorsitzender der Stiftung Barack H. Obama. Er ist dem sudanesischen Präsidenten Omar el-Bechir direkt unterstellt. Ein Muslimbruder ist Mitglied im Nationalen Sicherheitsrat, der obersten exekutiven Instanz der Vereinigten Staaten. Von 2009 bis 2012 war dies Mehdi K. Alhassani. Es ist nicht bekannt, wer sein Nachfolger war, aber das Weiße Haus leugnete, dass ein Muslimbruder im Sicherheitsrat sei, bis ein Beweis auftauchte. Auch der Botschafter der Vereinigten Staaten bei der Islamischen Konferenz, Rashad Hussain, ist Muslimbruder. Die anderen identifizierten Brüder besetzen weniger wichtige Ämter. Doch muss Louay M. Safi, zur Zeit Mitglied der Syrischen Nationalen Koalition und ehemaliger Pentagon-Berater, genannt werden.\\nPräsident Obama und sein Halbbruder Abon’go Malik Obama im Oval Office. Abon’go Malik ist Schatzmeister des Missionswerks der Muslimbrüder im Sudan. Im April 2009, zwei Monate vor seiner Kairoer Rede, hatte Präsident Obama heimlich eine Delegation der Bruderschaft im Oval Office empfangen. Bereits bei seiner Amtseinführung hatte er Ingrid Mattson, die Vorsitzende der Vereinigung der muslimischen Brüder und Schwestern in den Vereinigten Staaten, eingeladen.\\nDie Clinton-Stiftung hat ihrerseits als Verantwortlichen für ihr „Klima“-Projekt Gehad el-Haddad eingesetzt, einen der globalen Führer der Bruderschaft, der bis dahin Leiter einer Koran-TV-Sendung war. Sein Vater war 1951 einer der Mitbegründer der Bruderschaft bei ihrer Neubildung durch die CIA und den MI6. Gehad verließ die Stiftung 2012 zu dem Zeitpunkt, als er in Kairo Sprecher des Kandidaten Mohammed Morsi wurde, dann offizieller Sprecher der Muslimbrüder weltweit.\\nWenn man weiß, dass die Gesamtheit der dschihadistischen Führer auf der Welt entweder aus der Bruderschaft oder aus dem Sufi-Orden der Naqchbandis – die beiden Bestandteile der islamischen Weltliga, der saudischen antinationalistischen arabischen Organisation – hervorgegangen ist, wüsste man gern mehr über die Beziehungen von Frau Clinton zu Saudi-Arabien und den Muslimbrüdern.\\nNun befindet sich im Team ihres Herausforderers Donald Trump General Michael T. Flynn, der versucht hatte sich der Gründung des Kalifats durch das Weiße Haus entgegenzustellen und aus dem Vorstand der Defense Intelligence Agency (militärischer Nachrichtendienst) zurücktrat, um seine Missbilligung herauszustellen. Er kommt dort in Berührung mit Frank Gaffney, einem historischen „kalten Krieger“, der jetzt als „Verschwörungstheoretiker“ angeprangert wird, weil er die Anwesenheit der Bruderschaft im Föderalstaat aufgedeckt hat.\\nEs versteht sich von selbst, dass aus Sicht des FBI jede Unterstützung für die dschihadistischen Organisationen ein Verbrechen darstellt, unabhängig davon, wie die Politik der CIA aussieht. 1991 haben die Polizisten – und Senator John Kerry – den Zusammenbruch der pakistanischen Bank BCCI (obgleich auf den Kaiman-Inseln registriert) bewirkt, die von der CIA für alle Arten von Geheimoperationen mit den Muslimbrüdern und auch mit den Latino-Drogenkartellen benutzt wurde.\\nThierry Meyssan Übersetzung\\nSabine'"}, "time": 1742562410.1525607}