{"duration": 0.05171704292297363, "input_args": {"text": "'Former First Daughter Chelsea Clinton is set to release a children’s book entitled She Persisted, which will highlight the contributions of more than a dozen accomplished women throughout U. S. history. [The    daughter of Bill and Hillary Clinton shared the cover for her upcoming book on her Twitter page Thursday morning, writing that she was excited to share the stories of girls and women “who didn’t take no for an answer. ”  Persistence has changed the course of history  —   I’m so excited to share stories of girls  women who didn’t take no for answer on May 30th! pic. twitter.   —   Chelsea Clinton (@ChelseaClinton) March 16, 2017,  According to Entertainment Weekly, the book will feature 13 women who made a significant impact in their fields while overcoming adversity, including Helen Keller, Harriet Tubman, Sally Ride, Oprah Winfrey, Maria Tallchief, Sonia Sotomayor, Claudette Colvin, Ruby Bridges and Nellie Bly. The book is also expected to include Clinton’s mother, former Secretary of State and 2016 Democratic presidential candidate Hillary Clinton. The title of the book comes from a quote by Sen. Mitch McConnell ( ) after the Senate silenced Elizabeth Warren ( ) as she attempted to protest Jeff Sessions’ nomination as U. S. Attorney General. “She was warned. She was given an explanation. Nevertheless, she persisted,” McConnell said in February. The quote has since become a rallying cry for the Left, and has since made its way into Grammys performances and onto Reebok  . In a statement, Clinton said she wrote the book “for everyone who’s ever wanted to speak up but has been told to quiet down, for everyone who’s ever been made to feel less than. ” “The 13 women in She Persisted all overcame adversity to help shape our country —  sometimes through speaking out, sometimes by staying seated, sometimes by captivating an audience,” she told EW. “With this book, I want to send a message to young readers around the country —  and the world —  that persistence is power. ” The announcement of the book comes amid rumors that Clinton is preparing for her own entrance into politics, perhaps as a candidate for a New York Senate seat. She Persisted  —   with illustrations by Alexandra Boiger  —   is due out for release on May 30.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564277.0917227}