{"duration": 0.16974568367004395, "input_args": {"text": "'KINSTON, N. C.  —   At a community college turned hurricane shelter, Frednesa Pope, 37, wondered on Wednesday if the floodwaters from Hurricane Matthew, which are expected to crest here on Friday, would force her and her family out of an apartment they could barely afford. This week, Gregory   58, who lives on a fixed income and was taking shelter from the flooding in Fair Bluff, N. C. to the southwest, knew that the truck he had just bought was flooded. And over the weekend, Ethel and Austin Chavis of Lumberton, N. C. ripped the carpets out of their flooded home and wondered how much it would cost to make things right again and where they would find the money. “We’ve got to find some assistance,” Ms. Chavis, 66, said as she looked at the floorboards buckling around her, “because we definitely need it. ” Hurricane Matthew spawned ferocious wind and rain across North Carolina, dumping more than a foot of water in parts of the state and touching off a creeping disaster that had killed 22 people in the state by Thursday. Day after day, in town after town, swollen rivers have transformed thoroughfares into canals and homes into sodden islands, in some cases with only the roof or the windows peeking above the water. And the water has risen in some of the state’s poorest areas, upending the lives of many already living on the financial edge. “The poorest of the poor in North Carolina are the ones who are being hurt the most by these floods,” Gov. Pat McCrory said at an otherwise upbeat news conference on Thursday. “These people have nothing,” he added, urging people to donate to a state disaster fund. By Thursday, $2. 6 million in aid from the Federal Emergency Management Agency had been disbursed and 14, 000 people had applied for aid. Individual assistance from FEMA, which has averaged about $2, 000 a family in recent years, is designed to help with immediate needs  —   like temporary rental housing, repairs not covered by insurance, and the replacement of critical personal items  —   but those grants are somewhat limited. “It’s not designed to make survivors whole again,” said Rafael Lemaitre, a spokesman for the agency. “It’s more of a life vest, rather than a lifeboat. ” Mr. McCrory’s administration said that disaster unemployment assistance, which can cover wages lost because of a storm, would be available in 20 counties. But even when state and federal officials work to disburse flood aid, experts said, it is often harder for families living on the margins to bounce back. The Food Bank of Central and Eastern North Carolina estimated that 356, 000 people in the 21 counties it was monitoring for storm and flood effects did not have access to enough healthy food, even before the floods. Floodwaters have left downtown Lumberton, a city where a third of residents live in poverty, underwater. They crested at more than a foot above the record on Tuesday in Goldsboro, N. C. where the poverty rate is 25 percent. And in Kinston, residents waited in shelters for the Neuse River to crest on Friday. “Sometimes, you just have to think that God is piling on with these storms,” said Gene Nichol, a law professor at the University of North Carolina who researches poverty. Poverty in the region, he said, goes back to the time of slavery, but he added that the state’s   Legislature had further eroded the social safety net by winnowing unemployment benefits, cutting the state’s   tax credit and largely refusing to expand Medicaid. “There are challenging legacies,” Professor Nichol said. “The want of investment and opportunity in eastern North Carolina is made only more difficult by tragedies like this. ” Some natural disasters, like tornadoes, seem genuinely indiscriminate, as likely to damage wealthy neighborhoods as to damage poor ones. But in Kinston, the pain from the floods  —   which were preceded by days of warning  —   seem to a certain extent linked to economics. Those with cars have been able to take their valuables, or even their furniture, and leave town for hotel rooms or to stay with family. Those who earn more are more likely to have paid time off, and to have savings to cushion the financial blow from a storm. And floods often play out in   areas where the residents are disproportionately poor. The shelter here at Lenoir Community College, which by Thursday had become a temporary home for about 200 people, was full of residents with no money to spare  —   even among those working full time  —   and a sense of dread as the water rose. Ms. Pope, a cabinet sprayer in a local plant, evacuated her home in Kinston this week when fire officials told her it was almost certain to flood when the river crested. “I put my clothes up as high as I could,” she said. “I don’t have a car I wasn’t able to get a   like everyone else in the neighborhood. I live from paycheck to paycheck. ” Ms. Pope’s apartment had flooded during the devastation from Hurricane Floyd in 1999, and her landlord had told her it was unlikely to withstand a second event that forecasters said could be even worse. “I’ll have to start all the way back over,” said Ms. Pope, who already pays her $400 rent in two installments so she can pay the bills in the middle of the month. “Everything in there, it’s paid for. If it floods, I’m through. ” Wesley Turner, 71, a Vietnam veteran who retired from a rubber stopper plant in town, said his home seemed close to flooding even before the river’s crest. “I worked for years and years to make money for a   which I thought would be home for the rest of my life,” Mr. Turner said. “I can’t afford another trailer. I can’t afford a pup tent. ” Inside the shelter, LaVonda Hamilton, 42, was wondering whether she would need to take on a     loan to make ends meet. She had been unable to get to her job as an account specialist at an outsourcing firm near the coast for a week. “I have two kids, you know, in high school,” Ms. Hamilton said. “It sets you back. ” And in Lumberton, where floodwaters were just beginning to recede, Billie Thompson, 36, returned to her home to take stock of what she had lost  —   “It’s in a shamble right now,” she said  —   and scrambled to get to her job at the Butterball factory for the first time since last week. A single mother, Ms. Thompson tried to figure out how to replace ruined items, like school clothes that she bought in August for her daughter. “My daughter has started planning a birthday party next month I might have to cancel that,” Ms. Thompson said, adding, “She needs clothes more than she needs the party. ”'"}, "time": 1742564443.612982}