{"duration": 0.03156089782714844, "input_args": {"text": "'Endesa conectaba todos sus generadores a un enchufe de Iberdrola LO HA DESCUBIERTO LA SEÑORA DE LA LIMPIEZA DE IBERDROLA \"TIRANDO DEL CABLE\" robo \\nLa energía que hasta ahora recibían los abonados de Endesa, una de las empresas españolas líderes en el sector eléctrico, en realidad provenía de un enchufe de Iberdrola. La noticia se hacía pública esta misma mañana después de que la señora de la limpieza de Iberdrola encontrara un extraño cable enchufado a una regleta oculta tras un mueble. Al ir tirando de él, la mujer ha llegado a la sede de la otra compañía, destapando el fraude. \\n“No había visto a mi jefe tan enfadado en la vida. Me ha ordenado desenchufar el cable inmediatamente y se ha ido a gritarle al de Iberdrola desde la calle”, explica la señora. Nada más desenchufarse el cable, los clientes de Endesa han dejado de recibir electricidad. \\nEn estos momentos, Iberdrola, con su presidente José Ignacio Sánchez Galán a la cabeza, está revisando uno a uno todos los enchufes de la oficina, “no vaya a ser que también nos la estén jugando los de Fenosa o los de Abengoa, que son todos una panda de listos”. Según él, “llamas a la Policía y te dicen que no pueden hacer nada si no ha habido agresión o robo con fuerza”. \\nPor su parte, Borja Prado Eulate, presidente de Endesa, ha pedido que no se saquen las cosas de quicio. “Esto hay que leerlo como parte de la competencia sana en el sector”, ha argumentado Prado mientras descargaba de su coche unas bombonas de gas de la compañía Repsol y varios metros de cable de cobre. \\nEndesa ha informado que sus abonados experimentarán los próximos días algunos cortes en el servicio mientras sus responsables buscan otro enchufe al que conectar su red. En estos momentos, la solución más factible para Endesa es encontrar un alargador de varios kilómetros de longitud para poder robar la energía de Francia “porque allí no están tan pendientes”.'"}, "time": 1742628464.755411}