{"duration": 0.05047321319580078, "input_args": {"text": "'Cue the Johnny Cash music. On Sunday, a “ring of fire” eclipse will blaze over parts of South America and the southern and western tips of Africa. Scientifically known as an annular eclipse, this solar phenomenon occurs when the moon moves in between the sun and the Earth but is too far away to completely block the sun as it would during a total solar eclipse. “Because you have this thin little ring around the edge of the moon where the sun pokes out, it gives it that ring of fire effect,” said C. Alex Young, a solar astrophysicist from NASA. The moon’s orbit around the Earth is elliptical, meaning that at some points it is farther away from the Earth than at others, according to Dr. Young. Annular eclipses occur when the moon is at or near its greatest distance, known as apogee. The countries with the best chance to watch the “ring of fire”    include Chile and Argentina in South America as well as Angola, Zambia and the Democratic Republic of Congo in Africa. They are along something called the path of annularity. That’s where the moon’s shadow is cast on Earth, and it varies between 18 miles and 55 miles in width as it moves. Those outside of the line will be able to see a partial solar eclipse, which looks like some galactic giant took a bite out of the sun. Sunday’s annular eclipse will begin over parts of the Pacific Ocean. It will quickly make landfall in southern Chile around 9:10 a. m. local time, and then traverse into Argentina. Sky watchers in Argentina will see approximately 97 percent of the sun covered by the moon for about a minute, according to Dr. Young. After that, the spectacle will cross the South Atlantic into Africa. It will hit parts of Angola around 4:15 p. m. local time and make appearances in Zambia and the Democratic Republic of Congo before the sun sets. It will last for a minute and a few seconds when it crosses over these countries. If you’re not in South America, Africa or on a boat in the southern oceans, there will be a live stream from Slooh Community Observatory, a system of telescopes that observe the sky, beginning around 7 a. m. Eastern time. But if you’re in the United States, you should not experience too much fear of missing out, Dr. Young said. Come Aug. 21, you will have the opportunity to see a total solar eclipse. “There’s absolutely no comparison. While the annular eclipse is pretty exciting with its ‘ring of fire’ effect, it’s still just this bright object in the sky,” Dr. Young said. “But during the solar eclipse it’s not just what you see, it’s what you experience. The whole environment changes. ” Another big difference between a total eclipse and the annular eclipse is that you cannot see the sun’s corona  —   its outer atmosphere that appears as white wisps of light  —   during an annular eclipse. “We won’t be able to see the corona because it’s just going to be swamped by the photosphere, the visible surface of the sun,” Dr. Young said. “The photosphere is a million times brighter than the corona. ” He warns that the fiery ring will be very bright, so even though it will not be a total solar eclipse, you should wear a pair of eclipse glasses to watch the performance.'"}, "time": 1742563643.9354367}