{"duration": 0.05170607566833496, "input_args": {"text": "'A California high school senior headed for the Army is not allowed to wear an Army sash with his robe and mortarboard at his graduation Friday. [Elias Velazquez made a decision to enlist in the U. S. Army after he graduated from Redlands High School, but his school’s policy states that students cannot decorate their graduation gowns or caps except for California Scholarship Federation chords and sashes, KTTV reported.  “It means something really honorable to me, it’s a whole new life transition to me,” Elias said. Elias and his father are hoping the policy can be changed. “It’s kind of defeating the purpose of achieving that greatness,” Joe said. “We push our kids to strive and try to be better and do the best they can and then we tell them at their grad ceremony, ‘We need you all to be the same because we don’t want to hurt anyone else’s feelings. ’” His father, Joe, posted about the situation on social media to “open community dialogue” about the situation. “We’re simply trying to open some community dialogue and get people to understand some rules are okay to change,” Joe said. The Redlands School District said the reason for the rules is to promote fairness and has nothing to do with not supporting the military. “We are totally supportive of our men and women in the military. This has nothing to do with a lack of our support,” a spokesperson for the district said. Although Elias says he is not happy about not being able to wear the sash, he is “committed to following every order they give” him since he is not one to stray from the rules. The school said that students can wear sashes during other graduation events and before and after the ceremony. A high school senior in Indiana was also told not to wear her Army sash at graduation May 25 because the school district wanted to focus on “high school accomplishments” at the graduation ceremony. In 2016, a Maine high school senior was told by his school’s superintendent that he could not display his Army sash at graduation, but could display it at the school’s senior awards ceremony.'"}, "time": 1742561911.3728118}