{"duration": 0.09707999229431152, "input_args": {"text": "\"\\nPoor honest guy will be on the streets now. Sam Houston \\nCan we start hanging the traitors?!?! Giving votes to foreign nationals/States is tantamount to treason. Donald Costa \\nProblem is they hate this place and it’s people if you don’t stop them it will never end. Jensen \\nthis is the problem, I have seen videos of people from some where around the vicinity of Syria Africa and these are all MEN who say they use fake passports and they’re goal is to go where there is the best welfare. This is a form of Jihad to use our welfare system and tax us to death. These people will come to American on our dime and vote us out and make us pay for it. Are you ok with that… Im not sjcthrn5 . \\nThat is seriously messed up. I don’t understand our government sometimes. How can they get welfare or public assistance so easily? I was in a rollover accident a little over six months ago where my arm was ripped off at the elbow, had to have six vertebrae in my neck fused, had a couple of skin grafts and a wound on the top of my head that still hasn’t closed all the way up and healed. I went to DSHS to see about help while i recovered and filled out all the applications and medical records releases. I got denied on everything. I will say that they took over healthcare after insurance limits were reached, which didn’t take long the 15 minute helicopter ride was over $29,000 alone. I have never used any public service before, I’m a veteran and I have always had a job since I was 13 years old. I understand helping those immigrants that need it but shouldn’t their be some kind of vetting oversight? Especially when you make your own citizens jump through all kinds of hoops only to tell them no. r.terbeek \\nsjcthrn5, You need to get an attorney!! Find one that doesn’t get paid if you don’t. millerstwo \\nFor years the Marxist Democrats have openly committed voter fraud knowing that the cowardly Republicans would do absolutely nothing to stop it out of fear of being called racists. Cheating at the polls is now considered ‘the norm’ for this group of America hating liars and cheats. The following has nothing to do with our “voter fraud” conversation per se, but………a couple of days ago I read an article about the genius of Thomas Jefferson and his obsession with America and then I thought about the millions of American hero’s both “gentlemen and commoners” who died in wars defending our Nations freedom then I was suddenly overwhelmed with a sadness realizing what was at stake regarding possibly our last ‘real election’……these great Americans will have died in vane if the Marxists are allowed to steal this election. Then Patrick Henry’s immortal words came to mind….“.. I know not what course others may take; but as for me, give me liberty or give me death!” . \\nDido Patrick Bettyj9553 \\nLet’s all pray that Trump gets in. I am so disgusted with how this government and how it is running us all into the ground. The corruption has got to stop. I can’t even believe it is this hard to stop Hillary after all the stuff that has come out about her over and over. How can anyone feel that strongly about voting for a woman who is corrupt in every way. She has never done anything for anyone except when it benefits her. RICARDO36 \\nWhy do you think they’re so afraid of TRUMP, He is his own man and servant to none! He would clean up that rat”s nest in Washington and put the D.C. MAFIA out of business! GOD HELP AMERICA!! \\nPingback: Dem Official: 'I Think There's a lot of Voter Fraud' - Big Sky Headlines () Mary M.B. \\nGood guy…so sorry for him ( no good deed goes unpunished), he just lost his job and all forms of employment in N.Y…. Retire and come to Fl. and help us keep Conservatives in office. Keep our state RED! \""}, "time": 1742563876.7343497}