{"duration": 0.10269641876220703, "input_args": {"text": "'How the American Political System Changed and No One Noticed Posted on Nov 4, 2016 \\nBy Tom Engelhardt / TomDispatch Andrew Czap / (CC BY-SA 2.0) \\nTo say that this is the election from hell is to insult hell. \\nThere’s been nothing like this since Washington forded the Rubicon or Trump crossed the Delaware or delivered the Gettysburg Address (you know, the one that began “Four score and eleven women ago…”)—or pick your own seminal moment in American history. \\nBillions of words, that face, those gestures, the endless insults , the abused women and the emails, the 24/7 spectacle of it all… Whatever happens on Election Day, let’s accept one reality: we’re in a new political era in this country. We just haven’t quite taken it in. Not really. \\nForget Donald Trump. \\nAdvertisement Square, Site wide \\nDoh! Why did I write that? Who could possibly forget the first presidential candidate in our history preemptively unwilling to accept election results? (Even the South in 1860 accepted the election of Abraham Lincoln before trying to wave goodbye to the Union.) Who could forget the man who claimed that abortions could take place on the day of or the day before actual birth? Who could forget the man who claimed in front of an audience of nearly 72 million Americans that he had never met the women who accused him of sexual aggression and abuse, including the People magazine reporter who interviewed him? Who could forget the candidate who proudly cited his positive polling results at rallies and in tweets, month after month, before (when those same polls turned against him) discovering that they were all “ rigged ”? \\nWhatever you think of The Donald, who in the world—and I mean the whole wide world (including the Iranians )—could possibly forget him or the election he’s stalked so ominously? When you think of him, however, don’t make him the cause of American political dysfunction. He’s just the bizarre, disturbed, and disturbing symptom of the transformation of the American political system. \\nAdmittedly, he is a one-of-a-kind “politician,” even among his associates in surging right-wing nationalist and anti-whatever movements globally. He makes France’s Marine Le Pen seem like the soul of rationality and Philippine President Rodrigo Duterte look like a master tactician of our age. But what truly makes Donald Trump and this election season fascinating and confounding is that we’re not just talking about the presidency of a country, but of the country. The United States remains the great imperial state on Planet Earth in terms of the reach of its military and the power of its economy and culture to influence the workings of everything just about everywhere. And yet, based on the last strange year of election campaigning, it’s hard not to think that something—and not just The Donald—is unnervingly amiss on Planet America. \\nThe World War II Generation in 2016 \\nSometimes, in my fantasies (as while watching the final presidential debate), I perform a private miracle and bring my parents back from the dead to observe our American world. With them in the room, I try to imagine the disbelief many from that World War II generation would surely express about our present moment. Of course, they lived through a devastating depression, light years beyond anything we experienced in the Great Recession of 2007-2008, as well as a global conflagration of a sort that had never been experienced and—short of nuclear war—is not likely to be again. \\nDespite this, I have no doubt that they would be boggled by our world and the particular version of chaos we now live with. To start at a global level, both my mother (who died in 1977) and my father (who died in 1983) spent decades in the nuclear age, the era of humanity’s greatest—for want of a better word—achievement. After all, for the first time in history, we humans took the apocalypse out of the hands of God (or the gods), where it had resided for thousands of years, and placed it directly in our own. What they didn’t live to experience, however, was history’s second potential deal-breaker, climate change, already bringing upheaval to the planet, and threatening a slow-motion apocalypse of an unprecedented sort. \\nWhile nuclear weapons have not been used since August 9, 1945 , even if they have spread to the arsenals of numerous countries, climate change should be seen as a snail-paced version of nuclear war—and keep in mind that humanity is still pumping near-record levels of greenhouse gases into the atmosphere. I imagine my parents’ amazement that the most dangerous and confounding issue on the planet didn’t get a single question , not to speak of an answer, in the three presidential debates of 2016, the four and a half hours of charges, insults, and interruptions just past. Neither a moderator, nor evidently an undecided voter (in the town hall second debate), nor either presidential candidate—each ready to change the subject on a moment’s notice from embarrassing questions about sexual aggression, emails, or anything else—thought it worth the slightest attention. It was, in short, a problem too large to discuss, one whose existence Donald Trump (like just about every other Republican) denies, or rather, in his case, labels a “hoax” that he uniquely blames on a Chinese plot to sink America. \\nSo much for insanity (and inanity) when it comes to the largest question of all. On a somewhat more modest scale, my mom and dad wouldn’t have recognized our political world as American, and not just because of Donald Trump. They would have been staggered by the money pouring into our political system—at least $6.6 billion in this election cycle according to the latest estimate, more than 10% of that from only 100 families. They would have been stunned by our 1% elections ; by our new Gilded Age ; by a billionaire TV celebrity running as a “populist” by riling up once Democratic working-class whites immiserated by the likes of him and his “brand” of casino capitalism, scam, and spectacle; by all those other billionaires pouring money into the Republican Party to create a gerrymandered Congress that will do their obstructionist bidding; and by just how much money can be “invested” in our political system in perfectly legal ways these days. And I haven’t even mentioned the Other Candidate, who spent all of August on the true “campaign trail,” hobnobbing not with ordinary Americans but with millionaires and billionaires (and assorted celebrities ) to build up her phenomenal “ war chest .”'"}, "time": 1742562931.015383}