{"duration": 0.047636985778808594, "input_args": {"text": "'Trump supporters, swamp dwellers, and Americans from all walks of life had their eyes glued to coverage of the testimony by former FBI Director James Comey to the Senate Intelligence Committee this morning. [The hearing was treated like a major sporting event by D. C. locals, who lined up to gain entrance to local establishments for   only viewing parties.  The Comey watch party line at Shaw Tavern stretches down the block  …     #ThisIsWashington pic. twitter.   —   Jordan J Frasier (@jordanjfrasier) June 8, 2017,  As coverage and responses to Comey’s testimony continue to unfold, we’ve gathered together six of the most important revelations from the hearing. One thing is for sure, Comey’s testimony was anything but boring. When questioned by Senator Marco Rubio ( ) Comey answered that President Donald Trump was not under investigation by the FBI. It was also revealed that congressional leaders had previously been briefed on this fact. This morning Judicial Watch President Tom Fitton joined Breitbart News Daily and predicted this fact. Fitton called allegations against Trump “gossip” and “a nothing burger. ” Comey admitted to orchestrating leaks from the investigation to the media using a network of friends. Reponse was swift on social media: Senators should ask Comey the name of the Columbia professor and then subpoena the memos from him.  —   Alan Dershowitz (@AlanDersh) June 8, 2017,    So the collusion involves former FBI director, mainstream media, and the   academy to bring down the elected president #ComeyHearing https:  .   —   Joel B. Pollak (@joelpollak) June 8, 2017,  Columbia Law Prof Daniel Richman confirms to @ZCohenCNN that he is the friend that provided excerpts of the Comey memo to reporters.  —   Ryan Nobles (@ryanobles) June 8, 2017,  Senator Rubio pointed out the interesting fact that one of the few things not to leak out was the fact that Trump was not under investigation himself. Because if it was leaked that @realDonaldTrump was personally not under   it would have crushed the entire narrative. pic. twitter.   —   Dan Scavino Jr. (@DanScavino) June 8, 2017,  President Trump’s personal lawyer, Marc Kasowitz, issued a blistering statement after the hearing on the subject of Comey’s leaks. Senator James Risch ( ) questioned Comey early in the hearing about the possibility of obstruction of justice regarding the investigation of General Michael Flynn. Risch repeatedly questioned Comey about the exact wording used by President Trump to him in private, which Comey recorded in his   memo. The exchange leaves  Democrat’s hopes of impeachment for obstruction of justice considerably dimmed: Comey: I mean, it’s the President of the United States with me alone, saying, “I hope this. ” I took it as this is what he wants me to do. I didn’t obey that, but that’s the way I took it. Risch: You may have taken it as a direction, but that’s not what he said. Comey: Correct. Risch: He said, “I hope. ” Comey: Those are exact words, correct. Risch: You don’t know of anyone that’s been charged for hoping something? Comey: I don’t, as I sit here. Risch: Thank you, Mr. Chairman. James Comey had a few things to say about the reporting of the New York Times which reported on collusion between the Trump campaign and Russia. Senator Risch questioned Comey about the Times, asking “So the American people can understand this, that report by the New York Times was not true, is that a fair statement?” “It was not true,” Comey said. “Again, all of you know this, maybe the American people don’t. The challenge  —   I’m not picking on reporters about writing stories about classified information  …     [the challenge is] that people talking about it often don’t really now what’s going on and those of us who actually know what’s going on are not talking about it. ” Comey discussed the involvement of President Obama’s Attorney General, Loretta Lynch, in the investigation of Hillary Clinton. He stated that Lynch made an odd request for how the FBI investigation should be described. “At one point the attorney general had directed me not to call it investigation, but instead to call it a matter, which concerned and confused me,” Comey said. Comey added that Lynch’s infamous tarmac meeting with Bill Clinton during the campaign was the reason he decided to make a statement when the decision was made not to prosecute Hillary Clinton. “In a ultimately conclusive way, that was the thing that capped it for me, that I had to do something separately to protect the credibility of the investigation, which meant both the FBI and the Justice Department,” Comey said. Comey had quite a bit to say about his firing, which leaves him looking like a disgruntled former employee. Comey accused President Trump and his administration of lying about him, and “defaming him and more importantly the FBI. ” Comey also explained that his discomfort with the President and the belief that Trump would lie about him led to the creation of his memo on the meeting. “I was honestly concerned that he might lie about the nature of our meeting, so I thought it really important to document,” Comey said. “I knew there might come a day when I might need a record of what happened not only to defend myself but to protect the FBI. ” Comey did not comment on how his leaking of the memo through his personal network helped the FBI. Breitbart News will continue to pursue the many stories emerging from Comey’s testimony. Read through our livewire of the testimony for interesting commentary on the Comey hearing as it occured. Colin Madine is a contributor and editor at Breitbart News and can be reached at cmadine@breitbart. com'"}, "time": 1742628562.6071444}