{"duration": 0.20821142196655273, "input_args": {"text": "'  UP IN ARMS: Trump Nation Absolutely Rejects Mitt Romney For Secretary Of State Pick Mitt Romney, the 2012 GOP nominee, was highly critical of Trump during the campaign and called him a \"phony,\" and a \"fraud\" and dedicated an entire speech in March to denouncing his candidacy.   24, 2016 Top Donald Trump aide Kellyanne Conway said she is receiving a deluge of comments about the possibility of Mitt Romney being selected as secretary of State. \\nEDITOR’S NOTE: Donald Trump made promises that a majority of the American people clearly identified with, one of which was his promise to #DrainTheSwamp . But draining the swamp involves removing the inhabitants of that swamp. Globalist Mitt Romney, keeper of the Bush Crime Family legacy, is one of the big frogs in that elitist swamp. So it stands to reason that Donald Trump could – under NO circumstances – choose Romney for any position in his cabinet. What do you think? Please comment below. \\n“Receiving deluge of social media & private comms re: Romney,” Conway said, linking to a story about Trump loyalists who are unhappy with the possibility. Receiving deluge of social media & private comms re: Romney Some Trump loyalists warn against Romney as sec of state https://t.co/HDtpjeJTc3 \\n— Kellyanne Conway (@KellyannePolls) November 24, 2016 \\nShe also stressed loyalty as a key trait for a secretary of State in a follow-up tweet. Conway told CNN that her tweets reflect the private discussions she’s had with Trump and Vice President-elect Mike Pence . Kissinger & Schultz as Secs of State flew around the world less, counseled POTUS close to home more. And were loyal. Good checklist. \\n— Kellyanne Conway (@KellyannePolls) November 24, 2016 \\n“I am struck by the intensity and volume of resistance [to Romney] from the grassroots; words like ‘betrayal,’” Conway said. “I communicate with PEOTUS and VPEOTUS privately and regularly so this is not an attempt to do so publicly as some (who missed the election completely) are suggesting.” \\nShe said she respects “completely” that these “weighty decisions” rest with Trump, “a man whose political instincts and unconventional campaign defied the critics and made history.” \\nSome Trump supporters and allies have tried to steer the President-elect from nominating Romney as the U.S.’s chief diplomat. Mitt Romney, the 2012 GOP nominee, was highly critical of Trump during the campaign and called him a “phony,” and a “fraud” and dedicated an entire speech in March to denouncing his candidacy. \\n“He attacked [Trump] on a personal level about his character, his integrity, his honor,” Trump supporter Mike Huckabee said on “Fox & Friends” Wednesday. The former Arkansas governor added that it would be a “real insult” to Trump voters if Romney was nominated to be secretary of State. \\nOther Trump supporters, like former Speaker Newt Gingrich , have said they favor former New York City Mayor Rudy Giuliani for the job. \\n“I think that, if you want someone who is going to go out and be a very tough negotiator for America and represent American interest in the way that Trump campaigned, I think that probably Rudy is the better pick and has the right temperament.” source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742564554.018513}