{"duration": 0.10749602317810059, "input_args": {"text": "'RIO DE JANEIRO  —   The Supreme Court justice overseeing parts of the investigation into corruption at Brazil’s national oil company died on Thursday in the crash of a small plane, stunning the country as investigators are intensifying their efforts to prosecute an array of political figures on graft charges. The justice, Teori Zavascki, 68, was killed along with at least two other people traveling on a Beechcraft King Air C90 when it crashed into the Atlantic near Paraty, a town of   buildings on the coast between São Paulo and Rio de Janeiro, according to Brazilian news reports. The cause of the crash was unknown as of Thursday night. The federal police have begun an investigation that will be closely watched across Brazil, given Justice Zavascki’s influence in Brazil’s legal system. Justice Zavascki, who had kept a low public profile since being named to the   court in 2012, was responsible for some of the boldest moves in Brazil’s judiciary in recent years, earning him a reputation as a judge prepared to curb abuses by influential lawmakers and business leaders. In 2015, Justice Zavascki ordered the arrest and imprisonment of Delcídio do Amaral, a sitting senator from the leftist Workers’ Party, which was in power at the time. And in 2016, he ousted the speaker of the lower house, Eduardo Cunha, who had orchestrated the impeachment of President Dilma Rousseff. Large portions of Brazil’s political establishment are on edge over revelations of bribery by Odebrecht, the construction giant that was one of the largest contractors for Petrobras, the   oil company. Justice Zavascki was overseeing the ratification of Odebrecht’s plea deal, in which dozens of Brazilian politicians are accused of receiving funds from the company, and some prominent figures suggested that the plane crash could have been a result of foul play. “This ‘accident’ needs to be thoroughly investigated,” Márcio Adriano Anselmo, a federal investigator on the Petrobras case, said in a Facebook post. Mr. Anselmo called Justice Zavascki’s death “the prelude to the end of an era” before editing and removing parts of the post. Justice Zavascki’s death raises important concerns about the direction of the Petrobras investigation and the independence of the judiciary. President Michel Temer will be able to nominate a replacement, influencing the Supreme Court while his own   Brazilian Democratic Movement Party is facing intense criticism over graft cases and efforts to stifle the Petrobras inquiry. Within the court, justices were maneuvering quickly on Thursday to nominate a successor to oversee the Petrobras case, expressing concern about delays that could allow legislators to avoid going to jail. Under Brazilian law, the Supreme Court handles cases involving lawmakers and other senior politicians who enjoy special legal standing. Justice Marco Aurélio Mello said it would be a mistake to await Mr. Temer’s nomination of a new court member, which would be followed by Senate hearings that could take almost a year. “We cannot wait,” Mr. Mello said, citing the demands of the Petrobras investigation, called Operation Carwash in reference to a service station in the capital, Brasília, that laundered money. The plane carrying Justice Zavascki was owned by Emiliano, a Brazilian luxury hotel operator. The owner of Emiliano, Carlos Alberto Filgueiras, 69, and the pilot of the plane, Osmar Rodrigues, 56, also died in the crash. The hotel company said in a statement that Justice Zavascki and Mr. Filgueiras were “close friends. ” Brazilian news outlets also reported that a woman, whose identity was not disclosed, had died. Justice Zavascki, a specialist in tax legislation before becoming a judge, was named to the court by Ms. Rousseff, who was replaced last year by Mr. Temer, her vice president. Sergio Moro, the judge overseeing much of the Petrobras inquiry, called Justice Zavascki “an example for all judges, prosecutors and lawyers in this country. ” “Without him, there would not have been the Carwash investigation,” Judge Moro said. Legal scholars agreed that Brazil’s Supreme Court, along with Justice Zavascki’s replacement, would come under scrutiny. “This thing isn’t for amateurs,” said Antonio Valverde, a professor of ethics and philosophy at Catholic University in São Paulo, citing reports that some of Brazil’s most powerful men received bribes in the Carwash inquiry. “The names in those reports are in the federal government. ”'"}, "time": 1742564164.1428711}