{"duration": 0.019149065017700195, "input_args": {"text": "'  Associated Press — Nov 2, 2016 Boeing 777. Click to enlarge \\nA FRESH analysis of the final moments of doomed Malaysia Airlines Flight 370 suggests no one was controlling the plane when it plunged into the ocean, according to a report released by investigators. \\nAs experts hunting for the aircraft gathered in Australia’s capital to discuss the fading search effort , a technical report released by the Australian Transport Safety Bureau , which leads the search, seems to support the theory investigators have long favoured: that no one was at the controls of the Boeing 777 when it ran out of fuel and dived at high speed into a remote patch of the Indian Ocean off Western Australia in 2014. #MH370 Report: Search and debris examination update . https://t.co/BpauQTcsRm \\n— ATSB (@atsbinfo) November 1, 2016 \\nIt comes as the ABC reports the search for MH370 will be extended north, beyond the 120,000-square kilometre search zone in the Southern Indian Ocean. \\nIt’s believed the search will move on to new areas next year at an estimated cost of $30 million. \\nIn recent months, critics have increasingly been pushing the alternate theory that someone was still controlling the plane at the end of its flight . If that was the case, the aircraft could have glided much farther, tripling in size the possible area where it could have crashed and further complicating the already hugely complex effort to find it. \\nBut Wednesday’s report shows that the latest analysis of satellite data is consistent with the plane being in a “high and increasing rate of descent” in its final moments. The report also said an analysis of a wing flap that washed ashore in Tanzania indicates the flap was likely not deployed when it broke off the plane. \\nA pilot would typically extend the flaps during a controlled ditching. \\nThe report also revealed the falling pattern of the aircraft, detailing how it descended in a number of different directions. \\n“In an electrical configuration where the loss of engine power from one engine resulted in the loss of autopilot (AP), the aircraft descended in both clockwise and anti-clockwise directions.” \\nPeter Foley, the bureau’s director of Flight 370 search operations, has previously said that if the flap was not deployed, it would almost certainly rule out the theory that the plane entered the water in a controlled ditch and would effectively validate that searchers are looking in the right place for the wreckage . \\n“(It) means the aircraft wasn’t configured for a landing or a ditching — you can draw your own conclusions as to whether that means someone was in control,” Foley told reporters in Canberra. \\n“You can never be 100 per cent. We are very reluctant to express absolute certainty.”'"}, "time": 1742628584.6505897}