{"duration": 0.12720417976379395, "input_args": {"text": "'in: Big Pharma , FDA , GMOs , Government , Government Corruption , Medical & Health , Special Interests There was a time when “FDA Approved” was a vote of credibility. We could purchase a product and feel safe because the government watchdogs had checked it out thoroughly before allowing it to be sold. Now, “FDA Approved” means “The company that produced this product has enough money and clout to allow it to be sold.” Many people rely on the FDA as a source of knowledge and safety. Their recommendations mean something to folks who feel as though someone is watching out for them and that in America if something was bad, the government wouldn’t allow it to be sold. They believe that the drugs are tested and approved for our benefit and that the manufacturers of Big Pharma are at the mercy of the fierce protectors who are advocating for the people. Unfortunately, it couldn’t be further from the truth. This is all part of the giant marketing deception perpetrated on a trusting public. Some people are so snowed by what the FDA does that they want it to be even more powerful . There is actually an “alliance for a stronger FDA” whose mission reads like a diary entry from a hostage with Stockholm Syndrome. With responsibility for products that comprise more than 20% of all national consumer spending, the U.S. Food & Drug Administration (FDA) oversees aspects of several industries that are key to our nation’s growth and prosperity. A science-based, predictable, and efficient FDA helps these industries — including the food, drug, medical device, and cosmetics industries — to innovate and to create high-paying jobs here in America while improving our balance of trade. The Alliance for a Stronger FDA works to ensure annual appropriations that will adequately fund the FDA’s essential missions, and we believe that the American people expect this too. There is no backstop, no other agency, that performs this critical work. The federal g overnment gives the FDA about $8 per year for each American (an “appropriation” of $2.561 billion for FY 2014). Nowhere else in the federal budget does so little money need to go so far. The FDA has just 10,000 employees to monitor food safety, review the safety and efficacy of medical products, assure the safe use of those medical products, and protect the American people, their pets, and their farm animals from poorly made, counterfeit, and illegal food, drugs, and cosmetics. Recent research on a variety of topics has led me to note some astonishing facts about the GMO Food and Drug Pushers Administration. Like a bad penny, it seems whatever topic I’m looking into, the FDA keeps turning up. The FDA has a central role in the increasing tyranny in the United States and we, as taxpayers, are funding them to do this. Be warned, you aren’t going to like what you read below, but unless you are mired in intractable cognitive dissonance, you’re going to see a pattern of abuse and deception. The FDA’s Perpetual Conflicts of Interest First of all, it would be nice to believe that the group who decides whether foods and medicines are safe for our consumption is unbiased and benevolent. Unfortunately, that is not the case. Let’s take a look at the leadership – the head of the snake – and the ties of those leaders to Big Agri and Big Pharma. Some previous tsars/commissioners are: 2016: Dr. Robert Califf Califf is a cardiologist who was a tenured professor at Duke University School of Medicine. He’s long been criticized for having deep financial ties to Big Pharma. He worked closely with drug companies and convinced them to do large, expensive clinical trials that were very profitable for Duke. Califf was a paid consultant for Merck Sharp & Dohme, Johnson & Johnson, GlaxoSmithKline, AstraZeneca, and Eli Lilly per ProPublica from 2009 to 2013. In the disclosure information for an article published in the journal Circulation in 2013, Califf shared that he was a consultant for Gilead – the drug company that recently came under scrutiny for outrageously priced hepatitis C drugs. The price for a 12-week course of treatment with one of the drugs was initially set at $84,000 . 2010: Michael Taylor Taylor’s most recent resume entry: VP and attorney for Satan Monsanto. One of Taylor’s “accomplishments” for Monsanto was writing the rules that allowed recombinant Bovine Growth Hormone into the American food and milk supply, and forcing dairies who labelled their milk as rBGH-free to also state that there was “no difference between their hormone free milk and the chemically enhanced milk.” 2009: Margaret Hamburg Hamburg served on the board of directors of Henry Schien, Inc. previous to her appointment to the throne of the FDA. Henry Schien, Inc. produces amalgam dental products – products that contain toxic mercury. Hamburg spearheaded the legislation that allowed mercury to be allowed in dental products (without a required warning for the consumers) during her time at the FDA. Hamburg was recently named as one of the defendants in an $800 million RICO lawsuit . The suit accuses Hamburg of playing a role in a conspiracy to approve Levaquin, an antibiotic drug known to cause severe (and even deadly) side effects, in order to financially benefit her husband’s hedge fund which held very large financial positions in Johnson & Johnson, makers of the drug. 2006: Andrew von Eschenbach A Bush family friend, von Eshchenbach has a background as a drug peddler for Big Pharma and as the head of the National Cancer Society. Some highlights of his reign over the FDA were the speedy approval of Avandia, a medication for diabetes that had the unfortunate side effect of a 43% increase in heart attacks among those taking it; and accusations of corruption and intimidation by the FDA’s own scientists. **** But if that cast of characters isn’t enough to shed doubt on the veracity of any claim made by this organization, take a look at the following facts and tell me that they’re looking out for people instead of corporate interests. The FDA seems to be busily striving to regulate the family farm right out of business. The FDA has gone “SWAT Team” on producers of raw milk and cheese, performing armed raids on small farms , seizing and destroying inventory and handcuffing farmers to haul them off to jail. The FDA keeps adding “food safety” requirements to small organic farms while doing nothing about the factory farms’ abundant use of pesticides and toxins. The FDA pushed the Food Safety Modernization Act which could eventually shut down farmer’s markets across the country – or at least make the food more difficult and expensive for farmers to produce. According to the National Sustainable Agriculture Coalition (NSAC), “The regulations could erect new barriers to these important markets for small and mid-scale farmers unable to bear the expense of compliance.” Find the regulations here. With all of these new (time-consuming and pricey) legislations that farmers must adhere to , the price of local organic produce is skyrocketing, making the product unaffordable for most Americans. This, in turn, reduces competition for the huge factory farms and their GMO-tainted, chemical-sprayed products, allowing a huge profit at the end of the day for Big Agri. The FDA crackdown on health food stores and promoters of natural remedies is reminiscent of cops raiding a meth lab full of junkies. Since 1987, facilities such as the Life Extension Foundation, vitamin manufacturers, health food stores, natural pet food stores and naturopathic medical clinics have been raided by agents waving assault rifles. Owners and employees have been arrested and convicted of crimes. Countless merchandise and literature has been confiscated. What was the crime committed by these natural healing companies? They don’t tithe to the Church of Big Pharma. The FDA is busily “harmonizing” the United States policies with Codex Alimentarius . Codex is the United Nations’ sinister plot to be in control of the food consumption of the world, as per Agenda 21 . Codex promotes chemical agriculture, heavily medicated livestock and genetically modified produce. It’s all done under a do-gooder disguise – the CA Commission states its goals as “protecting the health of consumers, ensuring fair trade practices and promoting coordination of food standards.” Codex actually outlaws the sale of vitamins of beneficial dosages, as well as natural remedies. According to Mike Adams , the founder of Natural News, “the FDA will “harmonize” the U.S. food and dietary supplement industries with global Codex requirements which make illegal virtually all healthy doses of vitamins and minerals. Under full Codex “harmonization,” America will be left with a dead food supply and the health food stores will be virtually stripped bare of dietary supplements. Selling vitamin D at a reasonable dose such as 4,000 IU per capsule will be criminalized and products will be seized and destroyed by FDA agents who recruit local law enforcement to bring in the firepower.'"}, "time": 1742563334.0917418}