{"duration": 0.07907795906066895, "input_args": {"text": "'BEIJING  —   “FAKE NEWS,” a Twitter post declared. “” another said. “Cleverly orchestrated lies,” a news article asserted. President Trump’s harangues against the American news media appear to have inspired a new genre of commentary in China’s state media, whose propagandists spiced up social media posts and news articles with Trumpian flourishes this week. People’s Daily, the flagship newspaper of the ruling Communist Party, mimicked Mr. Trump’s characteristic bluster  —   and his fondness for capital letters  —   on Friday in denouncing Western news coverage of a Chinese lawyer and human rights advocate who said he had been tortured. An article on the topic a day earlier by Xinhua, the   news agency, had accused the foreign news media of “hype” and suggested that legal activists were manipulating the press to “smear the Chinese government. ” “The stories were essentially fake news,” Xinhua wrote, adopting a phrase that Mr. Trump has embraced. The Chinese government has long denounced Western news organizations as biased and dishonest  —   and in Mr. Trump, Beijing has found an American president who often does the same. The irony in China’s criticism is apparent, given Beijing’s history of obscuring facts and censoring stories that officials deem a threat to the party. Experts said on Friday that Mr. Trump’s continuing attacks on the news media would help lend credibility to Chinese efforts to undermine Western ideals and foreign journalists. “Trump’s attacks on the media will offer a good excuse for Chinese officials to step up their criticism of Western democracy and press freedom,” said Qiao Mu, a journalism professor at Beijing Foreign Studies University. “China can turn to Trump’s attacks to say Western democracy is hypocrisy. ” Some of Mr. Trump’s remarks about the news media would not seem out of place in some of China’s leading broadsheets, where commentators regularly denounce independent reporting by foreign news outlets on delicate subjects like Taiwan or religious persecution. Rights advocates said Mr. Trump had given China an opportunity to further distort the boundaries of journalism. “If the Chinese version of journalism, which is really only propaganda, is considered mainstream, it will challenge the understanding of what real journalism should be,” said Patrick Poon, a researcher for Amnesty International in Hong Kong. The heated commentary in the Chinese news media came in response to foreign coverage of a Chinese lawyer, Xie Yang, whose account of torture at the hands of interrogators was widely reported in January, including in The New York Times. The reports about Mr. Xie, who is still in custody, were based on transcripts of his interviews with his lawyers. Xinhua’s report suggested that the account of the torture of Mr. Xie, who was formally arrested last year on a charge of inciting subversion of state power, was fabricated. “Investigations by reporters and an investigative team have showed that the accusations were nothing but cleverly orchestrated lies,” the report said. Xinhua said Jiang Tianyong, a prominent human rights lawyer, had invented the story and shared it with foreign activists. One of Mr. Xie’s lawyers, Chen Jiangang, denied that on Friday. In a statement, Mr. Chen reiterated that Mr. Xie had provided the account of his torture, describing in detail the meeting at which he had done so. Chinese officials routinely block efforts to report on topics that the government deems delicate. On Friday, the BBC reported that its journalists had been harassed by the authorities in a village in Hunan Province while trying to interview a woman who says her family’s land was stolen. The BBC said that its journalists were assaulted during the encounter, and that a crowd in the village had smashed the crew’s cameras.'"}, "time": 1742563525.8919628}