{"duration": 0.07862281799316406, "input_args": {"text": "'Print \\nDouglas Band, one of former President Bill Clinton’s closest advisors, boasted to outside auditors that his for-profit corporation had a “historical role in carrying the majority of the fundraising burden” for the nonprofit Clinton Foundation. \\nA Nov. 16, 2011 memo Band authored , which WikiLeaks made public Wednesday, raises disturbing questions about charitable law violations due to mixing for-profit activities with the nonprofit foundation. \\nBand authored the extraordinary memo for the law firm of Simpson Thacher, in which he bragged that his for-profit Teneo raised “well over $150 million, much of it from people who did not know President Clinton when he was in office.” \\nBand co-founded Teneo with Declan Kelley who then-Secretary of State Hillary Clinton had appointed to serve as the U.S. Economic Envoy to Northern Ireland in 2009. \\n“This is a confession of widespread fraud that must have sent Simpson Thacher into overdrive,” Charles Ortel, a Wall Street analyst who has reviewed multiple documents related to the Clinton Foundation controversy, told The Daily Caller News Foundation. \\nWhen he wrote the memo in 2011, Band was under pressure to defend his fundraising work to the law firm, which had been retained by Chelsea Clinton to conduct a “ governance review” of the Clinton Foundation. The law firm is one of the nation’s foremost authorities on ethical nonprofit management and regulation. \\nBand described Teneo as devoted to “merchant and investment banking services, corporate restructuring, public relations and communication services, and strategic advising services.” \\nBut he said he “leveraged” his business activities to raise millions of dollars for the Clinton Foundation. \\n“Throughout the past almost 11 years since President Clinton left office, I have sought to leverage my activities, including my partner role at Teneo, to support and to raise funds for the foundation,” Band wrote. \\nBand admitted in the memo the “unorthodox nature of my roles” at the foundation, but he defiantly defended his work, saying: \\n[R]ightly or wrongly, I believe – given the foundation’s need to raise funds, the willingness of the partner owners of Teneo to help fundraise, and my historical role in carrying the majority of the fundraising burden – that Teneo should help raise funds for the Foundation, which it has. \\nOrtel told TheDCNF that neither Band “nor any of the Teneo folks ever bothered to register as professional solicitation agents in NY, or anywhere else.” The revelation could put Band and the foundation in legal jeopardy with the New York state attorney general’s office, which regulate charities. \\nBand also revealed for the first time the wide-ranging for-profit activities he undertook that helped enrich the Clintons. The conservative government watchdog group Judicial Watch has described Teneo as “Clinton, Inc.” \\nBand said in his memo that “independent of our fundraising and decision-making activities on behalf of the Foundation, we have dedicated ourselves to helping the President secure and engage in for-profit activities – including speeches, books, and advisory service engagements,” adding: \\nIn that context, we have in effect served as agents, lawyers, managers and implementers to secure speaking, business and advisory service deals. In support of the President’s for-profit activity, we also have solicited and obtained, as appropriate, in-kind services for the President and his family – for personal travel, hospitality, vacation and the like. \\nFormer President Clinton has frequently used free corporate jets for himself and his family, including those owned by people like convicted sex offender Jeffrey Epstein . \\nAt the time Band authored his memo, Chelsea Clinton was disturbed about the ethics of mixing Band’s for-profit activities with the foundation’s non-profit fundraising. She retained Simpson Thacher — one of the top law firms in nonprofit management – to review all of the foundation’s activities, including those of Band. \\nBand lashed out against Chelsea Clinton in a number of emails to John Podesta, the former White House chief of staff under former President Clinton who is now Hillary Clinton’s national presidential campaign manager. \\nThis report, by Richard Pollock, was cross-posted by arrangement with the Daily Caller News Foundation.'"}, "time": 1742563951.8314095}