{"duration": 0.1724550724029541, "input_args": {"text": "'WASHINGTON  —   Senator Jeff Sessions was confirmed on Wednesday as President Trump’s attorney general, capping a bitter and racially charged nomination battle that crested with the procedural silencing of a leading Democrat, Senator Elizabeth Warren. Mr. Sessions, an Alabama Republican, survived a    vote, 52 to 47, in the latest sign of the extreme partisanship at play as Mr. Trump strains to install his cabinet. No Republicans broke ranks in their support of a colleague who will become the nation’s top law enforcement official after two decades in the Senate. But the confirmation process  —   ferocious even by the standards of moldering decorum that have defined the body’s recent years  —   laid bare the Senate’s deep divisions at the outset of the Trump presidency. At the same time, the treatment of Ms. Warren, who was forced to stop speaking late Tuesday after criticizing Mr. Sessions from the Senate floor, rekindled the   politics that animated the presidential election and the women’s march protesting Mr. Trump the day after his inauguration last month. Mr. Sessions cast his final vote as a senator to note that he was present for Wednesday’s tally. His confirmation was met by applause from his colleagues, including a few Democrats, on the Senate floor. “I can’t express how appreciative I am for those of you who stood by me during this difficult time,” Mr. Sessions said shortly after the vote. “By your vote tonight, I have been given a real challenge. I’ll do my best to be worthy of it. ” Democrats spent the hours before the vote on Wednesday seething over the rebuke of Ms. Warren, of Massachusetts, who had been barred from speaking on the floor the previous night. Late Tuesday, Republicans voted to formally silence Ms. Warren after she read from a 1986 letter by Coretta Scott King that criticized Mr. Sessions for using “the awesome power of his office to chill the free exercise of the vote by black citizens” while serving as a United States attorney in Alabama. Since Mr. Trump announced his choice for attorney general, Mr. Sessions’s history with issues of race had assumed center stage. A committee hearing on his nomination included searing indictments from black Democratic lawmakers like Representative John Lewis of Georgia, the civil rights icon, and Senator Cory Booker of New Jersey, who broke with Senate tradition to testify against a peer. For weeks, Republicans rejected suggestions that Mr. Sessions could not be trusted on civil rights, arguing that he had been tarnished unfairly over accusations of racial insensitivity that have dogged him since the 1980s. “Everybody in this body knows Senator Sessions well, knows that he is a man of integrity, a man of principle,” Senator Dan Sullivan, Republican of Alaska, said during the debate on Wednesday afternoon. The “twisting” of Mr. Sessions’s record offended him, he said, even as Democrats continued their attacks on the nominee. As the 84th attorney general, Mr. Sessions brings a sharply conservative bent to the Justice Department and its 113, 000 employees. A former prosecutor, he promises a focus aligned with Mr. Trump in pushing a “law and order” agenda that includes tougher enforcement of laws on immigration, drugs and gun trafficking. Civil rights advocates worry, however, that he will reverse steps taken by the Obama administration in the last eight years to bring more accountability to police departments, state and local governments, and employers. Advocates point to his history of votes against various civil rights measures, as well as the accusations of racial insensitivity. Senator Patty Murray, a Washington Democrat, said on Wednesday that on civil rights, immigration, abortion, criminal sentencing guidelines and a range of other issues, Mr. Sessions had been far outside the mainstream and had pushed “extreme policies” often targeting minorities. That criticism peaked with Tuesday night’s rebuke of Ms. Warren, based on an arcane Senate rule that prevents members from impugning the character of a fellow senator, as she read the letter from Mrs. King, the widow of the Rev. Dr. Martin Luther King Jr. Mrs. King wrote the letter in response to Mr. Sessions’s 1986 nomination for a federal judgeship, for which he was ultimately rejected in part because of accusations that he had been insensitive to minorities as a prosecutor. Senator Mitch McConnell of Kentucky, the Republican majority leader, led the objection against Ms. Warren. His explanation afterward  —   “She was warned. She was given an explanation. Nevertheless, she persisted”  —   instantly became a liberal rallying cry,   Ms. Warren as a leading voice of Democratic resistance to Mr. Trump. “What hit me the hardest was, it is about silence,” Ms. Warren told a group of civil rights leaders on Wednesday at the Capitol. “It’s about trying to shut people up. It’s about saying: ‘No, no, no. Just go ahead and vote. ’” Senator Chuck Schumer of New York, the Democratic leader, said on Wednesday that the censure was “totally, totally  ” and that it reflected an “   attitude” emanating from the White House. He and other Democrats said it served to mute legitimate criticism of Mr. Sessions’s record on civil rights and racial issues  —   one of their main avenues of attack at his contentious nomination hearing last month. The vote on Mr. Sessions came a day after Senate Republicans broke through a bottleneck in Mr. Trump’s nominees by approving Betsy DeVos, the embattled Republican donor, as education secretary with the help of a tiebreaking vote by Vice President Mike Pence. With Mr. Sessions’s confirmation, votes are expected in coming days on the nominations of Representative Tom Price of Georgia for secretary of health and human services and Steven T. Mnuchin for Treasury secretary. Mr. Sessions’s path to confirmation hit another snag that riled Democrats and energized opponents of his nomination: Mr. Trump’s dramatic firing of the acting leader of the Justice Department. Last week, Mr. Trump abruptly dismissed Sally Q. Yates, the acting attorney general, setting off a fierce backlash from Democrats against Mr. Sessions’s nomination to fill her job permanently. Ms. Yates, a holdover from the Obama administration, had refused to defend Mr. Trump’s controversial order barring travel by some foreigners, which is now tied up in litigation in federal courts. Democrats seized on her firing to say that Mr. Sessions is too close to the president to be independent or stand up to him. As the first senator to support Mr. Trump’s   bid for president last year, Mr. Sessions became an influential campaign adviser. While he pledged repeatedly not to be “a mere rubber stamp” for the White House, Democrats asserted that he would not be willing to challenge legally questionable policies like the travel ban or the president’s threats to reinstitute the use of torture on terrorism suspects. The arguments failed to sway any Republicans on the Senate Judiciary Committee, which voted, 11 to 9, along party lines last week to approve Mr. Sessions’s nomination. Senator Charles E. Grassley, the Iowa Republican who leads the Senate Judiciary Committee, expressed confidence that Mr. Sessions would be a “fair and evenhanded” attorney general and would make good on his pledges to enforce even the laws he voted against in the Senate. “There should be no question,” Mr. Grassley said, “that he is more than qualified to be the nation’s top law enforcement officer. ”'"}, "time": 1742562584.591309}