{"duration": 0.06836366653442383, "input_args": {"text": "'The White House has refuted any association with a copy of an executive order allegedly drafted by President Donald Trump’s administration that inaccurately cites the date of the   attacks as “September 11, 2011. ”[Various mainstream media outlets, including the Washington Post (WaPo) and the New York Times (NYT) leaked the draft order, titled “Detention and Interrogation of Enemy Combatants. ”  House Speaker Paul Ryan ( ) also said on Wednesday that the Trump administration did not write the document. “My understanding is this was written by somebody who worked on the transition before who’s not in the Trump administration. This is not a product of the administration,” the Speaker told MSNBC. The draft order “is not a White House document,” added White House press secretary Sean Spicer on Wednesday, adding, “I have no idea where it came from. ” Despite the denials from the White House and Speaker Ryan, NYT, citing unnamed Trump administration officials, maintains that the debunked document is legit and suggests President Trump is poised to lift the Barack   ban on   “black site” prisons overseas used to hold terrorism suspects. The alleged draft order “raised the prospect of reviving C. I. A. “black site” prisons like those where terrorism suspects were once detained and tortured  —   has the potential to further fracture a national security team already divided over one of the most controversial policies of the    era,” reports the Times. NYT adds: The White House disclaimed the document, which was leaked to The New York Times and other news organizations, but three [Trump] administration officials said the White House had circulated it among National Security Council staff members for review on Tuesday morning. And many of its proposals  —   which also include halting transfers out of the Guantánamo Bay prison and sending new detainees there, which President Barack Obama refused to do  —   echo years of Republican national security policy and President Trump’s own speeches. But Mr. Trump’s most extreme campaign proposal for terrorism suspects  —   bringing back torture, which the draft order does not call for but hovers over in its direction to review reinstating a C. I. A. interrogation program  —   has been disavowed by senior members of his team  …     Although NYT implies that President Trump is trying to bring back torture, it acknowledges, “Mr. Trump’s order says no detainee should be tortured or otherwise subjected to cruel, inhuman or degrading treatment ‘as prescribed by U. S. law. ’” The debunked document is littered with edits, typos, and revisions, misstating that the   attacks occurred a decade later. “Our Nation remains engaged in a global armed conflict with ISIS, al Qaeda, the Taliban, and other associated international jihadist Islamist terrorist groups,” states the document. “This conflict is not of our choosing, but was declared against us by the jihadist terrorist organizations groups that have plotted and carried out mass attacks against the United States, its citizens, and its allies beginning well before the atrocities of September 11, 2011, and continuing to this day. ” NYT eventually acknowledged the errors, reporting, “It contained   phrases and typos. It said that the Sept. 11 attacks occurred in 2011, rather than a decade earlier. It was clearly not meant for public consumption. ” Nevertheless, the Times, citing BuzzFeed, doubled down on its assertion that the debunked document suggests President Trump is trying to bring back   “black site” prisons. “A draft executive order reviving   detention and interrogation policies that circulated on Wednesday is a revised version of the ‘most comprehensive’ executive action on the topic proposed for the first 100 days of a Mitt Romney White House,” reports BuzzFeed, citing an unnamed source. “The original text of the document was prepared in September 2012 by   candidate Romney’s legal and policy advisers as a potential executive order, according to a source familiar with the document who provided it to BuzzFeed News and metadata accessible in the document,” it adds.'"}, "time": 1742564264.6825583}