{"duration": 0.07906651496887207, "input_args": {"text": "'At Macy’s, the department store of “Miracle on 34th Street” fame, Santa, whoever he is, remains surrounded by corporate gatekeepers. The identity of the Santa who graces ABC Carpet  Home? His identity is off the record, too. “It isn’t a job,” Amy Chender, that store’s chief operating officer, wrote in an email. “He is Santa. ” We get it: Magic must be preserved. If you don’t want a Santa spoiler, stop reading here. Every now and then, a brave Santa offers a peek behind the red velvet curtain. John Gebbie, a    grandfather of three, agreed to share the tricks of his trade on one of his busiest weekends, the one before Christmas. 9 a. m.: It all starts with the beard.  A key ingredient to becoming Santa? You must nail the facial hair. “You know what the kids use to spike their hair?” Mr. Gebbie asks, gesturing to the loops in his mustache. “Got2b Glued. That’s what I used. ” Mr. Gebbie joined the Santa trade two years ago after crossing paths in a Costco store with another man who looked a lot like St. Nick. That man was Timothy Connaghan, a member of the International Brotherhood of Real Bearded Santas and the creator of School4Santas. com. Interested in extra income after retiring from a career as a customs broker, Mr. Gebbie enrolled in Santa school, where the coursework included lessons on how to talk with children (yes, this Santa has undergone a background check) winning over Santa skeptics and building his business. 9:30 a. m.: The commute begins. Mr. Gebbie lives in Port Jefferson, on Long Island, which is about 70 miles from today’s gig, a fitness complex called MatchPoint in Sheepshead Bay, Brooklyn. Mr. Gebbie begins his trip by clearing snow off his sleigh, a blue 1996 Subaru Impreza. “I tell the kids the dents are from the reindeer,” he said. 11:24 a. m.: The transformation. Some events offer valet service and changing rooms, but MatchPoint is a   affair. Mr. Gebbie lugs a garment bag and a rolling suitcase to the gym’s entrance. Still a relatively new Santa, Mr. Gebbie has personally booked about 15 events during this year’s   season, ranging from a stint at Cipriani 42nd Street to home visits. He can earn $200 to $1, 000 per appearance. (This event will pay him toward “the high end” of what he makes.) MatchPoint has been transformed into a festive wonderland. Mr. Gebbie finds a space to change behind a curtain. “I want to lose a little more weight next year,” he said of his red velvet suit. “I might get a 2XL instead of a 3XL. ” On his belt is a magic key to every house  —   this is crucial for warding off questions from children who don’t have chimney access. 12:13 p. m.: Taking the stage. Mr. Gebbie emerges from behind the curtain to take his place on Santa’s throne, where he plugs in a portable fan (Santas can easily overheat). Children wander near him, murmuring Ded Moroz  —   Santa Claus in Russian. This is an    event, stuffed with more than a dozen performers. Parents have paid up to $60 to spend the day here with their children. Troy Curtis, a performer who was once part of the boy band Menudo, is singing a Bruno Mars hit. The event is flashy, but the day’s success hinges on Santa, according to Dennis Jaigobin, who produced the event. The work is surprisingly physical: To beckon   children, Mr. Gebbie hams it up on stage by clapping, waving and cupping his hands around his mouth. One of Mr. Gebbie’s visitors, Gabriel Haskel, 5, is a professional. “This is the fourth Santa this year,” his father, Oleg Haskel, said. “Some of them he believes and others he’s like, ‘Nah, that’s a costume. ’” Onstage, the boy confers with Santa for a moment, and afterward, Mr. Gebbie cups his hands: “A piano!” he mouths to the boy’s parents. Gabriel says this Santa is the real deal. 1:24 p. m.: Santa takes a break. There are a few cardinal rules for being Santa, and one is that a break is mandated every hour. As gymnasts dance to Russian music, Mr. Gebbie disappears behind a blue tarp. An ice princess materializes with a plate of boiled hot dogs and a few pieces of fried food. “You never refuse it because you never know,” he says, accepting sustenance. 6:30 p. m.: The car ride home. After his shift is over, Mr. Gebbie faces a long drive back to Port Jefferson. Spending six hours working a bilingual event has reminded him of his goal for the next year. “I want to learn foreign languages,” he said. “I just want the kids to come in and feel comfortable. ” Another goal: less travel. Tomorrow, he’ll drive the 70 miles back to Sheepshead Bay and become Santa all over again. It’s not easy being Santa.'"}, "time": 1742562949.4106586}