{"duration": 0.1750047206878662, "input_args": {"text": "'UKIP leader Paul Nuttall has used a landmark speech to brand Islamist extremism a “cancer within our society” proposing a range of robust actions to ensure it is “cut out”. [The Liverpudlian MEP described how, in the past, the police and MI5 had “foiled plot after plot in the nick of time” but are now “being overwhelmed by the impossible scale” of the problem.  He criticised an establishment which has been complacent in allowing Islamists to “set up home in Britain” since the 1980s, on the mistaken assumption that they would not attack the country which had given them shelter. Nuttall also singled out particular actions undertaken by Theresa May in her former role as Home Secretary for denunciation, such as the massive police cuts carried out at the behest of former Chancellor of the Exchequer Geroge Osborne, and the abolition of control orders in favour of weaker TPims at the behest of former Deputy Prime Minister and Liberal Democrat leader Nick Clegg. The moment in 2015 that @theresa_may was told her government attacks and cuts on police were dangerous, by a police officer of GMP. pic. twitter.   —   Andrew Scattergood (@AJScattergood) May 24, 2017,  Nuttall also condemned the establishment’s tendency to “whip up cries of racism” against individuals and group who attempted to raise the alarm against the growing threat posed by mass immigration and the promotion of multiculturalism over integration, as well as failure to openly acknowledge the problem. “For far too long politicians in this country have lacked the courage to name the source of terror in our midst,” he said. “It is Islamist extremism. ” He described how he was “condemned” by   opposition chiefs from Labour, the Liberal Democrats, the Greens, and the Scottish and Welsh separatist parties as recently as the June 1st general election debate in Cambridge. “Islamist extremism is a cancer within our society,” Nuttall repeated Tuesday, appearing to feel vindicated by the recent attacks in London. Pakistan Home of London Terrorist Who Came to UK as Child Refugee Raided, Had Access to Tunnels Under Parliament https:  .   —   Breitbart London (@BreitbartLondon) June 6, 2017,  Nuttall pledged to rapidly reverse the cuts to police numbers, estimating that it would cost £1. 2 billion to replace the 20, 000 constables who have been lost since the Tories returned to power in 2010. “In these times of terror we need more bobbies on the beat,” he said, emphasising the importance of the ordinary community policing which the Police Federation claima has “collapsed” in recent years, causing local intelligence to “dry up”. Nuttall also pledged to tackle the “rampant radicalisation within our prisons” by reversing cuts to prison funding and officer numbers, and to train 4, 000 new border guards to “properly control our borders”  —   which experts now believe to be “porous” particularly along the coast. Asked how he would fund these changes, along with a “major increase in resources for MI5” the UKIP leader pointed to £35 billion in savings identified in his party’s manifesto, mainly from reducing the ballooning foreign aid budget, cutting the controversial High Speed Rail 2 project, and changing the Barnett formula  —   described as a “terrible mistake” by its late creator  —   which sees Scotland receive higher levels of funding than elsewhere in Britain. Armed with a baton, our brave officer faced the London Bridge attackers. We’re extremely proud of him and every single emergency responder. https:  .   —   BTP (@BTP) June 4, 2017,  Nuttall also called for a national debate on whether or not we should “routinely arm our police” after a British Transport Police officer was forced to take on the three London Bridge attackers with an extendable baton, leaving him hospitalised and in a very serious condition. Nuttall suggested the time has come to accept we now live in different times and pointed out that in Brussels and Strasbourg, where his work as an MEP takes him regularly, armed police are a commonplace sight. THE ENEMY WITHIN: Scale Of Terror In The UK  —   23, 000 Suspects Monitored Including 400 Who Fought For ISIS In Syria https:  .   —   Fox Nation (@foxnation) June 4, 2017,  Nuttall also echoed Colonel Richard Kemp, a former COBRA committee member and commander of British forces in Afghanistan, in calling for Islamic State volunteers holding British nationality to have their “passport revoked [and] their citizenship removed” ensuring they “never be allowed to return to this country”. He said he would “make no apologies for taking nothing off the table to ensure our people are kept safe”. However, he stopped short of joining Colonel Kemp in calling for foreign nationals on the terror watch list to be deported or interned, and ruled out following U. S. President Donald Trump’s lead in attempting to impose restrictions on travel to and from failed states such as Libya and Syria, which have become major hotbeds of Islamic radicalism. That’s right, we need a TRAVEL BAN for certain DANGEROUS countries, not some politically correct term that won’t help us protect our people!  —   Donald J. Trump (@realDonaldTrump) June 6, 2017,  In terms of the growth of radical extremism at home, Nuttall said “we must demand more from the Muslim community itself,” referencing statistics which suggest that “only one in eight referrals to Prevent”  —   the government’s   programme  —   “come from the Muslim community itself”. He also accused the Labour Party of being “culpable” in thwarting efforts to counter extremism by opposing Prevent, singling out Greater Manchester Mayor Andy Burnham for his opposition to the programme in particular. The UKIP leader also demanded the Government “close down mosques where extreme Wahhabi or Salafist versions of Islam are preached” and to bar the funding of religious institutions in Britain by Saudi Arabia and Qatar the latter of which was recently isolated by key Arab nations for its alleged support for overseas extremism. Nuttall also urged officials to release the findings of an investigation into Saudi funding of British religious institutions in particular, which are reportedly being suppressed. Leaked Hillary Clinton emails show U. S. allies Saudi Arabia and Qatar supported ISIS https:  .   —   Salon (@Salon) October 12, 2016,  Finally, Nuttall acknowledged that Theresa May had been “complacent at best” as home secretary, but said that the dangers posed by the Tories “pales into insignificance” beside the prospect of a Labour Government in which Jeremy Corbyn and Diane Abbott would be responsible for national security. Corbyn, he alleged, had “gone out of [his] way to befriend terror groups both in Northern Ireland and the Middle East” throughout his political career. With only a few exceptions, including Kate Hoey, Kelvin Hopkins, and Frank Field, Labour candidates “cannot be trusted on Brexit and cannot be trusted on national security” he said. He advised voters to bear this in mind when considering who to vote for in constituencies where a UKIP candidate is not standing  —   but told journalists that this sort of “tactical voting” strategy was a   for this particular election.'"}, "time": 1742562589.0712736}