{"duration": 0.03388690948486328, "input_args": {"text": "'Researchers in UC Davis’s Violence Prevention Research Program are worried President Trump will simply erase their data the way his administration erased climate change data from the White House web site. [The fear took hold on inauguration day, when members of the Violence Prevention Research Program watched the Climate Change information disappear.  Wired reports that Magdalena Cerdá saw the Climate Change information vanish and viewed is as a “call to action. ” She said she “worried the same thing could happen to gun violence data on websites belonging to the Centers for Disease Control and Prevention, the Bureau of Justice Statistics, or the Bureau of Alcohol, Tobacco, Firearms and Explosives. ” Cerdá was on an Amtrak train when she noticed the Climate Change material disappearing and she “sent an email to Garen Wintemute saying [they] needed to start downloading   …     data immediately. ” The goal was to get all the online resource material saved to a   drive so they would have it, even if an outside party ordered it removed or inaccessible on the internet. Veronica Pear is a data analyst at the Violence Prevention Research Center. She said, “I was scared. ” Pear is using “federal data for a paper on firearm mortality —  tracking hotspots in California between 1999 and 2015 —  and her work is almost complete. ” She said she had grown accustomed to finding the information she needed via online searches, and had therefore never downloaded or backed anything up. But once Cerda announced the erasure of Climate Change information, Pearl began searching and storing information. She said, “I had to enter around 50 different queries, I felt frantic. ” UC Davis now has untold numbers of resources saved on secure servers. Pear described the compilation of the material as “a public service for the scientific community. ” She added, “And for me, it feels more important now than ever to be vocally on the side of truth. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742628464.2578933}