{"duration": 1.254866123199463, "input_args": {"text": "'Judith Clark, who drove a getaway car in the infamous 1981 robbery of a Brink’s armored car in Rockland County, N. Y. that left a guard and two police officers dead, went into prison defiant, with seemingly little chance of getting out. The judge who sentenced her saw her as beyond rehabilitation, giving her a minimum of 75 years in prison and all but ensuring she would die there. But Gov. Andrew M. Cuomo, citing what he called Ms. Clark’s long sentence and “exceptional strides in  ” commuted her sentence on Friday. Mr. Cuomo’s action does not undo Ms. Clark’s conviction on   murder and robbery charges, but it reduces her sentence to 35 years to life and makes her eligible for parole in 2017. If Ms. Clark is freed, it would be in recognition of her evolution from radical to model prisoner, and serve as a coda to a notorious case that was among the last gasps of violent   extremism seen in the 1960s and 1970s. Ms. Clark, 67, must still win over the parole board, and law enforcement groups are expected to fight her release. Ms. Clark’s efforts to obtain clemency have gained wide attention in recent years, particularly as other participants in the Brink’s robbery have been released or granted parole hearings. Two of those involved, Mutulu Shakur, the stepfather of the rapper Tupac Shakur and described as the ringleader of the holdup, and David Gilbert, a leader of the Weather Underground who was also involved, remain incarcerated. Mr. Cuomo noted that Kathy Boudin, now a professor at Columbia University, was released in 2003 after receiving a    as part of a plea deal. The commutation was part of a raft of clemencies announced by the governor on Friday, which were hailed by a wide swath of criminal justice advocates. About 100 people who had finished serving time for nonviolent crimes they had committed as minors were pardoned, and the sentences of several other inmates were commuted. The clemency actions were the largest number by a governor in the state’s history, a spokesman said. The governor met Ms. Clark, who had one of the longest sentences of those in the Brink’s case, during a prison visit this year. A range of people have attested to Ms. Clark’s transformation, including Elaine Lord, former superintendent of the Bedford Hills Correctional Facility for women, the   prison where she has spent almost all of her 35 years behind bars. Ms. Lord wrote to  . David A. Paterson in 2010 that she had seen Ms. Clark “change into one of the most perceptive, thoughtful, helpful and profound human beings that I have ever known, either inside or outside of a prison. ” A group of 13 former presidents of the New York City bar association signed a letter seeking clemency for her this year. In the years before the robbery, Ms. Clark had bounced from mainstream civil rights causes to a group called the May 19th Communist Organization, an offshoot of the Weather Underground that believed a   revolution was in the offing. She did not quickly renounce her radical ideology once in prison. Deemed a major security risk, she spent two years in solitary confinement after being caught helping to plan an escape. But her attitudes began to change. She earned bachelor’s and master’s degrees while incarcerated, and led educational programs for inmates, including a prenatal course and an   program. Her release has been opposed by law enforcement groups and by some relatives of the men who were killed in the robbery and ensuing search: Sgt. Edward O’Grady and Officer Waverly Brown of the Nyack police, and Peter Paige, a Brink’s guard. Ed Day, county executive of Rockland County, called the push for clemency for Ms. Clark, “a vicious slap in the face to every member of law enforcement. ” “The blood of Nyack police Sgt. Edward O’Grady, Officer Waverly ‘Chipper’ Brown and Brinks guard Peter Paige will be on her hands until the day she dies,” he said in a statement on Friday. “Judith Clark is a domestic terrorist. Her only place in a civilized society is behind bars. ” Ms. Clark’s lawyer, Steven Zeidman, said on Friday that his client was aware of the concerns of the victims’ families. “She’s grateful for this opportunity and is very ecstatic, but is very fully aware that it’s painful and difficult for those who lost loved ones that day,” he said. Though Ms. Clark did not fire any shots, she was a willing participant in the robbery, which the militant group viewed as an “expropriation” for what they called the Republic of New Afrika. According to her account from that day, she had parked in a corner of a mall in Nanuet where other members of the group attacked an armored car, grabbing $1. 6 million while leaving Mr. Paige dead and another guard in a pool of blood. Gunfire was also exchanged later with the police. Ms. Clark’s radicalism had hardened by the trial. She called herself a “freedom fighter” and called the court officers “fascist dogs. ” In an email on Friday, Edward J. O’Grady III, the son of the slain officer, said that he was still processing the news. He called his father a hero and said he felt the pain of his loss every day. But, he said, “the release of Judith Clark will take no more away from me and will bring no more hurt to my life. ” He also wrote about Ms. Clark’s daughter, Harriet, a lecturer at Stanford, who was 11 months old when her mother was arrested. “She did no more to deserve her lot than my sisters and I did to deserve ours,” he wrote. “If it brings an end to the suffering that Harriet has to deal with every day, then perhaps I can be happy for both of them, and I can assure you, I’ll still be able to sleep at night. ”'"}, "time": 1742562585.9142659}