{"duration": 0.11586236953735352, "input_args": {"text": "\"Home / Badge Abuse / Shots Fired, 117 Arrests Made as Militarized Police Remove Pipeline Protesters Shots Fired, 117 Arrests Made as Militarized Police Remove Pipeline Protesters The Free Thought Project October 28, 2016 1 Comment \\nStanding Rock, ND — (RT) Hundreds of police in riot gear and with heavy military equipment have moved Dakota Access Pipeline protesters from their encampment on private land in North Dakota. Police have reportedly arrested at least 117 demonstrators so far. \\n“117 protesters have been arrested [as of 8:15 pm Thursday]. Morton County will be utilizing other jails in this mass arrest operation,” said Donnell Hushka, a spokeswoman for the Morton County, North Dakota, Sheriff’s Department. \\nPolice have entered the sacred ground camp and surrounded protesters there. Livestream videos showed more than one hundred protesters on the front line. Police have protesters more or less surrounded. #noDAPL pic.twitter.com/G4xGQuXpZM \\n— Jason Patinkin (@JasonPatinkin) October 27, 2016 \\nThe Morton County Sheriff’s Office confirmed to the Associated Press that it had cleared the private land of protesters around 6:30pm EST Thursday. \\nShortly after 7:00pm EST Thursday, the sheriff’s office posted on its Facebook page that “one woman has been arrested for firing a weapon at the police line near Highway 1806.” \\nThe sheriff’s office just after 8:00pm EST stated in a Facebook post that it received reports of “several incidents involving firearms.” One “involved a private individual who was run off the road by protestors. The victim was shot in the hand and is being treated. An investigation in underway. No law enforcement was involved with this shooting.” \\nWith regard to the woman arrested, the sheriff’s office said she “pulled a .38 caliber revolver and fired three shots at law enforcement, narrowly missing a sheriff’s deputy.” The sheriff’s office claims it did not fire any shots when taking her into custody. \\n“Ten shots were reported in the area. It’s possible it is local hunters. This incident is under investigation,” the Facebook post concluded. BREAKING: Sheriff: Dakota Access pipeline protesters cleared from private property. \\n— The Associated Press (@AP) October 27, 2016 \\nAccording to KFYR, police made 16 arrests by evening time Thursday. \\n“The protesters are not being peaceful or prayerful. Law enforcement has been very methodical in moving ahead slowly as to not escalate the situation. However, the protesters are using very dangerous means to slow us down. Their aggressive tactics include using horses, fire and trying to flank us with horses and people,” said Cass County Sheriff Paul Laney in a press release Thursday. 16 arrests at DAPL today…. #kfyrkafe \\n— KFYR AM 550 (@KFYR550) October 27, 2016 \\n“Move to the south,” police said over the loudspeaker. \\n“We see some of you have bows. Do not shoot bows and arrows at us,” they added, as protesters laughed. \\nNational Guard troops and police removed tents and other possessions from the new encampment, which the Standing Rock Sioux tribe says is sacred land granted to them via treaty in 1851. \\nPolice also dismantled the barricade across the road. \\nAs police corralled the protesters southward, some activists remained facing the police and even engaged with them while walking backwards. Atsa E’sha Hoferer was livestreaming on Facebook, telling officers that they should be on the side of the protests and that they too would suffer from contaminated water should the pipeline burst. Police are pulling down tents now. Just saw them spray paint an X on a teepee. pic.twitter.com/nNrWRPDggP \\n— Caroline Grueskin (@cgrueskin) October 27, 2016 \\nThe stand-off with police had lasted for several hours before authorties moved closer to the camp and started arresting people. The number of arrested is currently unclear. \\nThe protesters are currently blocking state Highway 1806, which law enforcement is attempting to clear using cop cars and military – style vehicles. Police said they will defend themselves against horses if necessary #DAPL #NoDAPL pic.twitter.com/5yWqKBUeGW \\n— wes enzinna (@wesenzinna) October 27, 2016 \\nPolice have said that they will defend themselves against horses, journalist Wes Enzinna tweeted. \\n“Do not ride horses at the police,” law enforcement announced. \\n“You’re endangering people’s lives by what you’re doing,” police told the protesters, telling them to move south or be arrested. People will not be arrested if they return to the main camp, one officer said at the barricade. \\nProtesters are burning tires, logs and other objects, sending smoke onto the roadway. A car has also been torched, journalist Jason Patinkin tweeted. \\n— Jason Patinkin (@JasonPatinkin) October 27, 2016 \\nAlthough the Federal Aviation Administration has restricted flights over the Cannon Ball area until November 5, there is a police helicopter above the faceoff, journalist Antonia Juhasz tweeted. \\nMore than 260 protesters have been arrested in the weeks leading up to Thursday’s operation, AP reported. \\nIn the morning police made a line in front of the fence and the company workers are behind them. The tents of the so-called North Camp were located a stone’s throw away from the police line. Authorities insist that this camp should be removed, according to activist Atsa E’sha Hoferer live-streaming from the site. \\nPeople on the barricades are retreating peacefully amid chants of “hands up, don’t shoot!” \\nPeople are moving from the road towards the construction site. “We might as well get arrested defending the sacred,” a protester told the Bismarck Tribune’s Caroline Grueskin. We need to band together and keep the pressure up against them. One is a map of Native American reservations the other is the DAPL. #NoDAPL pic.twitter.com/VQ5MXgXkpY \\n— Bart Starr Mistrot (@bartmistrot) October 27, 2016 \\nConstruction on the pipeline has resumed within sight of the confrontation on the state highway. While police came from north and things riled up, pipeline construction restarted to west. False flag much? pic.twitter.com/XxgC7vH11Z \\n— Jason Patinkin (@JasonPatinkin) October 27, 2016 \\n“Protesters’ escalated unlawful behavior this weekend by setting up illegal roadblocks, trespassing onto private property and establishing an encampment, has forced law enforcement to respond at this time. As I said yesterday, I visited the protesters roadblock and requested them to remove the barricade and have protesters vacate the private property. However, the spokesperson at the roadblock, Mekasi Camp-Horinek of Oklahoma, told law enforcement they ‘were not moving’,” Morton County Sheriff Kyle Kirchmeier said in a statement . “I can’t stress it enough, this is a public safety issue. We cannot have protesters blocking county roads, blocking state highways, or trespassing on private property.” So @potus , this means you're going to remove the National Guard from Standing Rock and cancel DAPL, right? Right? #NoDAPL https://t.co/FVV5KsgUom\""}, "time": 1742562021.2023823}