{"duration": 0.10717248916625977, "input_args": {"text": "'Hillary Reboots ‘Vast Right-Wing Conspiracy’ Playbook 10/31/2016 \\nLIFEZETTE \\nBefore even 24 hours had passed since the FBI director informed Congress on Friday that it was reopening the probe into Hillary Clinton’s emails, Clinton suggested the director was in cahoots with the Republican Party. \\n“We’ve made it very clear that, if they are going to be sending this kind of letter that is only going originally to Republican members of the House, that they need to share whatever facts they claim to have with the American people,” Clinton said on Friday, after initially being blindsided by the FBI’s announcement. \\nThe claim wasn’t true. All you had to do is turn the page and find Democratic members of Congress who had also received the letter from the FBI. But it shows how ready Clinton is to fight anyone in the government who dares investigate or question her. It is likely a habit Clinton picked up when she was first lady, from 1993 to 2001. \\nClinton’s opening salvo, though weak, is a sign of more to come. Her coming attack on the FBI and its director, James Comey, will likely begin in earnest on Monday, with her operatives using the letter to Congress as proof Clinton is the victim of a political conspiracy. \\nClinton previewed her attack in Daytona Beach, Florida, on Saturday, when she said the letter was “unprecedented and deeply troubling.” \\nClinton will also turn the issue into one of “transparency” — even though FBI investigations are inherently not transparent. In Daytona, she called on Comey to “explain everything right away, put it all right on the table” — a demand she knows will go unheeded. \\nBut many of Clinton’s allies in the media are likely to demand to see the emails found on former Rep. Anthony Weiner’s laptop. \\nIt’s a strategy that could work, even with only a few days left until Election Day. \\nSuch attacks on law enforcement worked fairly well for Clinton in 1998, when she and her husband, then-President Bill Clinton, vilified independent counsel Kenneth Starr. Starr had been tasked by Bill Clinton’s own attorney general to investigate corruption charges, but likely rued the day he ever took the job. \\nIn 1994, Bill Clinton faced questions from many, including The New York Times, about an investment the Clintons made in a company called Whitewater Development Corp. Bill Clinton’s attorney general, Janet Reno, made Robert Fiske the independent counsel. \\nFiske would later be replaced by Starr. Starr’s investigation would later reach into charges that President Clinton had lied in the Paula Jones sexual harassment civil trial. With explosive charges being published by the Drudge Report and Newsweek in January 1998 that Bill Clinton had seduced an intern, Monica Lewinsky, the Clintons could have been expected to admit the truth and take the punishments. \\nInstead, the Clinton White House and the Democrats began attacking Starr and the Republicans. \\nOn Jan. 27, 1998, Hillary Clinton went on NBC’s “The Today Show” and goaded the press into covering the opposition rather than President Bill Clinton, who had lied about his affair with Lewinsky just one day earlier. \\nMatt Lauer asked if Hillary Clinton had said the fight against Starr would be the “last great battle” of the Clinton White House. \\n“Well, I don’t know if I’ve been that dramatic,” Hillary Clinton replied. “But I do believe that this is a battle. I mean, look at the very people who are involved in this — they have popped up in other settings. This is — the great story here for anybody willing to find it and write about it and explain it is this vast right-wing conspiracy that has been conspiring against my husband since the day he announced for president.” \\nThe Starr report on the Clinton scandals was released months later. But what the Clintons are really proud of that is that the Democrats actually gained seats in the 1998 midterm elections, helping to cause a backfire against the GOP. \\nThe GOP didn’t have anywhere near the two-thirds majority in the Senate to remove Bill Clinton. In early 1999, the U.S. Senate acquitted Bill Clinton on two charges: obstruction of justice, and perjury. \\nIt taught the Clintons the wrong lesson: to fight authorities if authorities questioned them — even authorities within the Democratic Party. Clinton will be targeting and attacking President Obama’s own FBI director as Obama leaves office.'"}, "time": 1742561996.6945941}