{"duration": 0.157301664352417, "input_args": {"text": "'November 21, 2016 - Fort Russ News - \\n- Berliner Morgenpost , the complete interview, translated by Tom Winter -   \\n\\n\\nIn Merzig. Sahra Wagenknecht loves the idyllic nature of Saarland. \"This is the opposite to hectic Berlin, ideal for relaxing,\" she says. With Oskar Lafontaine, her husband, she often gets on her bike. \"When we have time, we bicycle a good 100 kilometers a day.\" \\nMerzig, a small town on the border with France, has become the new home of the 47-year-old, who was born in Jena, has her constituency in Düsseldorf, and leads the left-wing fraction in the Bundestag. In a café at the town hall, Wagenknecht sketched out her goals for the election year. \\n--- Ms Wagenknecht, you and your co-chairman Dietmar Bartsch were for a long time like Tom and Jerry. Could you be a successful candidate for the Bundestag election? \\n\\nSahra Wagenknecht: We have been successfully running the Bundestag campaign for more than a year now. The Left is now highr in all surveys than in 2013, despite the strength of the AfD. The climate in the faction has also improved. There is a relationship of trust between Dietmar Bartsch and myself, we work well together. This is the prerequisite for a successful election campaign. \\n\\nWhat is the purpose of the Linkspartei? \\n\\nWagenknecht: My wish for the Bundestag election is a clear signal that the same-old same-old of the grand coalition will be voted out and the social question finally comes to the agenda. For years inequality has grown in Germany, many people can no longer live by their labor,and more and more the elderly are humiliated with poverty. \\n\\nBut voting AfD doesn\\'t change this, because AfD also advocates a weak social state and privatization. A good double-digit result for the left would put the other parties, especially the SPD, under pressure to finally take care of the social interests of the majority. \\n\\nYou again rely on tax increases. What must happen before the Left thinks about the relief of citizens and businesses? \\n\\nWagenknecht: We demand tax reductions for the majority, namely middle-income and low-income earners. It is scandalous that an income tax rate of 24 percent will be payable from an income of 1140 Euro, while companies like Apple, Amazon or Starbucks in Europe will be hit with tax rates of 0.005 percent. \\n\\nIt is perfectly understandable that people feel they\\'re over a barrel by such a policy. We want the large companies and super-rich people to pay appropriate taxes. We demand, among other things, a millionaires\\' tax and the regular taxation of large inheritances. \\n\\n\"SPD has been making policies against its own voters for years\" \\n\\nIn the polls, even enough a red-green-green triple bundle won\\'t go. What power perspective do you see? \\n\\nWagenknecht: It\\'s not enough because the SPD has been doing politicies against its own voters for years. Why should workers and retirees choose a party that has created a huge low wage sector and destroyed the statutory pension. Sigmar Gabriel has recently fought like a lion for the CTE Group Protection Agreement. In the inheritance tax, he was undisturbed by Horst Seehofer. As long as the SPD does not signal that it wants something else than a more-of-the-same, the voters are running away. \\n\\nUnder what conditions would you be willing to co-ordinate with the SPD and Greens? \\n\\nWagenknecht: The basic direction of politics must change: the SPD and the Greens have been part of the inglorious party cartel that has destroyed the welfare state. We want to restore the welfare state. We do not need a Riester-Schwachsinn, which makes only the financial industry rich, but a sufficient legal pension. Everyone must pay for this, including self-employed persons, civil servants and politicians. \\n\\nWe need decent unemployment insurance again. In addition, the bargaining with temps and out-contracting has to end. In foreign policy, Germany should return to the tradition of a back-off policy ... \\n\\n... by which you mean? \\n\\nWagenknecht: Balancing interests instead of escalating conflicts through rearmament and war. The so-called war against terror did not make this world more peaceful, instead it ultimately strengthened terrorism - and brought it to Germany. Taking the Bundeswehr out of Afghanistan and Syria would be the best thing we could do for our security.  \\n\\nIt doesn\\'t sound like you\\'re going to govern. \\n\\nWagenknecht: What? For more than 40 years, the Federal Republic did well to keep its soldiers home. For Willy Brandt war was the \"ultima irratio,\" thus no road for politics. If the SPD today characgerizes such positions as \"non-governmental,\" this is a sad testimony to their own decline. \\n\\n\"Germany is not defended in Afghanistan\" \\n\\nShould the termination of all foreign operations of the Bundeswehr be agreed upon before signing a coalition agreement? \\n\\nWagenknecht: If we help poor countries after catastrophes, drill wells, or build schools, this is welcome. But it does not call for a Bundeswehr. The Technical Aid Organization, better equipped, would suffice. The Left will never support the military effort of the Bundeswehr. They are also contrary to the Basic Law. The task of the Bundeswehr is to defend Germany. Germany is not defended either in Mali, Afghanistan, or Syria. \\n\\nWould Sigmar Gabriel as an SPD chancellor candidate be an argument for or rather against red-red-green?   \\n\\nWagenknecht: If I were a leading SPD politician, I would give a thought to the result of the US election. The Democrats hindered the left-profiled Bernie Sanders, only to suffer with an unbelievable Hillary Clinton shipwreck. Clinton stood for arbitrariness, venality, and indifference to the social division of the country. Many have chosen Trump because they wanted to deselect this more-of-the-same. I think the SPD should take this seriously. \\n\\nWho is the SPD\\'s Bernie Sanders? \\n\\nWagenknecht: Well. If Mr. Gabriel, keep looking! In a large party like the SPD, there must be genuine Social Democrats who are credible in the eyes of voters. Sigmar Gabriel, on the other hand, stands for the politics since the turn of the millennium, that is, for the SPD aligning itself with the economically powerful - leaving its traditional voters in the lurch. \\n\\nSome utterances from the Linkspartei sound as if they came from the AfD. Do you want to recapture the voters who have migrated to the right-wing populists? \\n\\nWagenknecht: Of course, we want to win every voter who is angry and angry about the growing injustices. The fact that the AfD has reached such voters at all is only because it pretends to be committed to their social interests. But if you look at the program of the AfD, it sounds more like the economic wing of the CDU / CSU or the FDP. Merkel has handed the AfD many voters through her haphazard refugee policy. It would be irresponsible to deal with it. \\n\\nYou yourself said after the New Year\\'s Eve events at Cologne\\'s main station: \"Whoever abuses his rights as a guest forfeits them.\" That could also come from the AfD chairman Petry   \\n\\n...Wagenknecht: ... or from politicians of the SPD and the CDU / CSU, all of whom have also said it. I have not repeated this sentence because it\\'s been misunderstood. But the claim, that all who live in Germany - refugees and natives - must accept the local rules and laws, is not AfD, but reason. \\n\\n\\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742563534.4234548}