{"duration": 1.2229607105255127, "input_args": {"text": "'Given the shameless, over-the-top, almost breathtakingly cloying pro-Hillary promotional hype that Michael Moore has been spouting recently (roughly, since mid-July), the only explanation is that this man—this pride of Flint, Michigan, this modest film documentarian who grew up middle-class but is now worth upwards of $50 million—secretly harbors a desire to play a role in a Hillary Clinton administration.\\nIf not a Cabinet post, then something else. It’s more likely he has his eye on an ambassadorship. Maybe he covets being posted in a fun country, preferably a “resort country,” a country with a temperate climate and friendly people, a country where they speak English and don’t get all carried with civil unrest. The Honorable Michael Francis Moore, U.S. Ambassador to the Commonwealth of the Bahamas. You have to admit, it has a nice ring to it.\\nDon’t laugh. How do you think people get these ambassadorships? It’s never been about anything having to do with “qualifications.” Ambassadorships are handed out in return for loyal service, in return for an important political favor, in return for keeping a potential troublemaker quiet, and in return for helping to raise a shit-pot of campaign donations. It’s “quid pro quo” writ large.\\nOf course, when it comes to countries that might actually require a modicum of diplomatic ability, the administration has to be careful. You can’t just take someone off the street and make them ambassador to a place like Russia or China or Brazil, not if the U.S. wishes to maintain its credibility. But still, there are plenty of places in the world where you can pretty much dump anybody.\\nTake President Clinton’s administration, for example. In 1994, Bill Clinton rewarded congresswoman Maxine Waters for her long-time support, along with her role in securing African-American votes, by appointing her husband, Sidney Williams, to the post of U.S. Ambassador to the Bahamas. Prior to becoming an ambassador, Williams played football in the NFL, and ran a Cadillac dealership in Los Angeles. Life in Nassau was good.\\nAgain: “Michael Francis Moore: U.S. Ambassador to the Commonwealth of the Bahamas” has a nice ring to it. If not the Bahamas, then how about Barbados? There’s whole array of places to pick from. Granted, picturing Moore in a silk top hat and coattails instead of his usual baseball cap and sweatshirt is a bit of a stretch, but with a little coaching, there’s no doubt he can pull it off. After all, isn’t that why people in these positions have “personal assistants”?\\nSo best of luck to you, Michael. Let’s hope that when you or your “people” casually mention to Hillary that being an ambassador would be a cool job, she gets the hint. On the other hand, don’t count your chickens before they hatch (to coin a phrase). Because this is big-time politics, there will be a long list of people seeking the same job. Debbie Wasserman and Donna Brazile immediately come to mind.\\n David Macaray is a playwright and author. His newest book is “ Nightshift: 270 Factory Stories .” He can be reached at dmacaray@gmail.com'"}, "time": 1742562475.6700895}