{"duration": 0.0359194278717041, "input_args": {"text": "'President Donald Trump did not get funding for his wall in the recent budget agreement with Democrats, but the White House is arguing that they did get funding for “wall” fencing. [In a debate with Breitbart News, White House Press Secretary Sean Spicer claimed that Republicans did get funding for a “wall,” pointing to existing photos of fences with bollard style steel construction and “levee walls. ”  “That is called a bollard wall,” he said to Breitbart News, pointing to photos he displayed on a screen. “That is called a levee wall. ” Spicer refused to describe his fence photos as Trump’s promised wall, but assured them that it would be effective in protecting the border. He told reporters that the fencing was endorsed by DHS Secretary John Kelly. Kelly has proposed large bollard fencing to help secure the border, although he has also supported the idea of “a concrete wall” on the border. “There are places along the border, and I would offer to you, down in the southern Rio Grande valley, where a wall, a concrete wall, makes all the sense in the world,” he told Bloomberg News in April. “There are other places where a   wall, say a large bollard, if you will, fence, makes a lot of sense. ” The House budget agreement specifically cites funding for “border fencing” and “steel bollard designs,” not a wall, after Democrats insisted that money for border security would not be used to fund Trump’s wall.  Page 739 of the House budget agreement refers to “border fencing” and “steel bollard designs,” not a wall  &gt https:  .  pic. twitter.   —   Charlie Spiering (@charliespiering) May 3, 2017,  On the campaign trail, Trump assured supporters that he was not building a fence, but an actual wall of hardened concrete. “It’s going to be made of hardened concrete and it’s going to be made out of rebar and steel,” Trump said to a child in Manassas, Virginia during a rally in 2015. In a January interview with Sean Hannity, President Trump mocked existing “little toy walls” on the Southern border and said “I don’t know why they even wasted their time” on building them. Watch below: '"}, "time": 1742628415.3148913}