{"duration": 0.033093929290771484, "input_args": {"text": "'US Supreme Court: Transgender Bathroom in Schools November 02, 2016 \\nFor the first time the US Supreme Court will take up the issue of Transgender Bathrooms being forced on schoolchildren. \\nThe transgender bathroom and locker room issue has been debated in states across America since President Obama earlier this year publicly announced that Title IX anti-discrimination law includes transgender self-identity, he even weighed in specifically on the particular case in Virginia that has made it\\'s way to the Supreme Court. Caitlyn Hope, a 17-year-old began to self-identify as a boy in 2014. She has not undergone sex change surgery but is undergoing hormone therapy. Caitlyn legally changed her name to Gavin and started to use the boys\\' showers, toilets, and locker rooms at school. \\n\"This is the first time that the Court will be addressing the question of whether laws protecting against sex discrimination in education are applicable to \\'gender identity,\\'” Liberty Counsel noted. \\nParents voiced their concerns when hearing about what was happening at the school. Despite school board attempts to accommodate by building private, single-stall bathrooms and to keep school common bathrooms gender separate, they were sued. The American Civil Liberties Union (ACLU) brought a lawsuit on Caitlyn\\'s behalf, demanding that she may use all of the school\\'s facilities. It is expected that the Supreme Court ruling next year will have direct impact on community bathroom laws, such as North Carolina\\'s HB2, which keeps public bathrooms gender separate. \\nThere are currently only eight justices on the Supreme Court, and with Republicans disallowing hearings on Obama’s nominees, either pro-transgender Hillary Clinton or pro-life Donald Trump will nominate someone to fill the vacancy. On November 8th YOU will decide! \\nOriginal article by www.lifesitenews.com / TRUNEWS analysis.  '"}, "time": 1742628315.709218}