{"duration": 0.04910635948181152, "input_args": {"text": "'Television writer and executive producer Chuck Lorre has asked WikiLeaks founder Julian Assange to “get to work” and hack Donald Trump. [“You promised to use the Internet to expose and bring down all the corrupt bastards ruining our world, and boy did you almost follow through,” Lorre wrote in one of his infamous vanity cards, which are his trademark messages that appear   at the end of nearly every episode of his various productions.  “The job’s only   done! You need to show us you’re not just another gun for hire and hose down the other mosh pit. You know what I’m talking about,” read Lorre’s message to Assange, which appeared at the end of Thursday’s episode of the CBS comedy drama Mom. “The tax returns, the   maybe even some     beauty pageant video action. Time to step up,  . ” Assange’s WikiLeaks published thousands of Hillary Clinton campaign chairman John Podesta’s emails during the campaign. Lorre’s missive came on the heels of a news reports on a memo alleging that there was communication between Trump’s presidential campaign and Russian officials. Numerous allegation in the report, dubbed “fake news” by   Trump earlier this week, have since been found false. The Big Bang Theory creator, who attended a   fundraising dinner for Hillary Clinton in Los Angeles in July, also used a vanity card to react to Trump’s victory of Clinton. “” read the vanity card that appeared on both Big Bang Theory and Mom just two days after the election. In his latest salvo, Lorre asks Assange to become a “hero” and hack Trump. “It’s time to go all Talking Heads on this situation,” Lorre wrote. “Burning down the house, bubelah! You’re one   away from being a hero. Or maybe a martyr. Ecuadorean potato soup, Ecuadorean puhtahto soup, they’re usually the same thing. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562209.2281444}