{"duration": 0.10929322242736816, "input_args": {"text": "'Last weekend, Women’s Marches were held in cities all over the globe but   women were not welcome.   activists in Texas will be convening at Texas’ Capitol this weekend to demonstrate their     convictions during the 44th anniversary of Roe v. Wade. [The march in Washington, D. C. this past weekend “[d]espite its lip service to ‘diversity,’” “turned out to be just another front for the abortion lobby, promoted by Planned Parenthood and its cronies,” reported Breitbart News. It was “nothing more than a front for the U. S. abortion lobby” that “quashed attempts of   feminists to participate. ”  Breitbart News reported that the event pitched as a “’grassroots effort,’ in reality, [was] a massive   choreographed assembly paid for by major donors such as George Soros and Planned Parenthood. ” The list of “Partners” of the event in the nation’s capitol included: Catholics for Choice, the Center for Reproductive Rights, The Coalition of Nasty Women, EMILY’s List, Free the Nipple, GLAAD, NARAL   America Foundation, National Abortion Federation, National Center for Lesbian Rights, National Institute for Reproductive Health, Pussyhat Project, and Planned Parenthood. Although only   women were allowed to officially participate in the march, Breitbart News reported that the president of America’s largest organization of   youth “crashed” the march. Kristan Hawkins, president of Students for Life of America, wrote on her Facebook page  —   “Yeah so they wouldn’t let us in their march so we just ran ahead and got in the front. ” She did so after she posted a photo of her group holding a banner “Abortion Betrays Women: # . org. ” This weekend   women, men, and families will be traveling from all over the state to attend the 2017 Texas Rally for Life on the south steps of the Texas Capitol in Austin. According to the event website, www. TexasRallyforLife. org, more than 57 million unborn children have been aborted since that 1973 U. S. Supreme Court decision. A schedule of the time of the event, and where to   to march to the Texas Capitol, is   on the website. The rally will be held from 2:00 to 3:00 on the south side of the capital building. Melissa Ohden, an abortion attempt survivor and the author of the book, “You Carried Me,” is the keynote speaker at the rally this Saturday. “The Texas Rally for Life commemorates the tragic Roe v. Wade Supreme Court decision. That decision struck down Texas law protecting unborn babies from abortion, a law that had been on the books since 1865. We expect thousands of Texans from across the state to converge at the Capitol in Austin to show the Legislature and the media that Texas is  . More than 40   organizations across the state have formed a host committee to sponsor and promote this event. Texas Alliance for Life is proud to be one of them,” Joe Pojman, Ph. D. executive director for Texas Alliance for Life told Breitbart Texas. On January   “Over 200   students from across Texas will converge in Austin, Texas for the fourth annual Boots on the Ground Conference,” Melissa Conway, director for external relations for Texas Right to Life told Breitbart Texas. The Texas Right to Life spokeswoman said, “This year’s conference theme focuses on uniting diverse groups on one common cause: to make abortion unthinkable. Promoting the equal right to life for all human beings, including the   is a message that these students plan to voice by their participation in the   Rally for Life. ” Conway said that the students will be carrying #DismemberRoe signs that show the importance of protecting the   and ending the atrocity of abortion. Texas Right to Life is proud to lead the way for Life by equipping and empowering college students with the knowledge and tools needed to advance the Culture of Life in local communities and college campuses across the state. Texas State Representative Briscoe Cain (  Park) told Breitbart Texas, “On Saturday, Texans  will be gathering on the Capitol grounds to march united against the abortion cartel. I stand with them in the Texas Capitol. ” Many of the representatives in Texas are   and Texas has been a leader in passing   legislation. As reported by Breitbart Texas last June, the United States Supreme Court issued a decision which was a significant blow to Texas abortion law by striking down Texas House Bill 2 (HB 2). In a   decision, the nation’s highest court struck the legislation signed into law in 2013. The case of Whole Woman’s Health et al. v. Hellerstedt overturned provisions that Texas representatives said were designed to improve the quality of care for women and improve the sanitary conditions of surgical centers used to provide women’s health services. Kellyanne Conway, counselor to President Trump, and Baltimore Ravens tight end Benjamin Watson, are headlining the 2017 March for Life that will be held Friday in Washington, D. C. on the national mall, as reported by Breitbart News. The march will begin at the mall and end at the U. S. Supreme Court building. Lana Shadwick is a contributing writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.'"}, "time": 1742563221.689576}