{"duration": 0.07062697410583496, "input_args": {"text": "'Hannity, Judge Jeanine, Crowley “Hillary has Sold America’s National Security. WORSE than a CRIME FAMILY” Hannity, Judge Jeanine, Crowley “Hillary has Sold America’s National Security. WORSE than a CRIME FAMILY” Videos By TruthFeedNews November 6, 2016 \\nSean Hannity quotes his own and other sources on the FBI’s investigation into Clinton wrongdoing, noting that the law enforcement probe will continue regardless of who wins next Tuesday. After reading an update on the current state of the Clinton investigation he turns the floor over to Judge Jeanine Pirro who says, “It’s time for a grand jury.” \\nShe says, “It’s time for Loretta Lynch to allow Comey and the FBI to get this evidence before a grand jury. There is a mutiny in the FBI, that’s why all of this stuff is coming out. There are four offices that continue to investigate although Justice has tried to shut this down, saying there’s not enough evidence, this recording from this other person who apparently is an informant is hearsay.” \\nJudge Jeanine adds, “This woman should have been indicted a year ago. A simpleton could figure out that she would make a deal with a particular country, the money goes into the foundation, Bill makes a speech and then they get the benefit. This is classic RICO corruption; go to jail.” \\nHannity asks Monica Crowley, “What is Loretta Lynch hiding here, what is she resisting when it’s clearly an avalanche of evidence?” Crowley says she sees it as the revenge of the FBI rank and file “and the timing is not a coincidence.” She notes that in this country, “If you do not have an independent, impartial and fair Department of Justice and FBI which are only interested in enforcing the rule of law and finding the truth then you have nothing. Obviously that is not what we have with much of the DOJ and with senior FBI leadership. \\nShe describes the email investigation as the shiny object, while it is very important, the real mother lode of corruption is the Clinton Foundation. Crowley insists that the bigger point that the American people need to bear in mind before going to vote on Tuesday is that Clinton leveraged her public office in order to enrich herself, her husband and their foundation. \\nAs the conversation shifts to the fact that Clinton is a target for extortion and blackmail due to her emails being hacked by five different foreign governments, Judge Jeanine declares, “She has sold America’s national security for money. These people are grifters, they’ve been grifters since they came on the scene. And she knew that when she set up that server that it wasn’t secure. She did it for money, she did it to enrich themselves, she didn’t care about our security and Huma Abedin, I don’t know who she and Weiner are connecting with, but these are people who do not have our interests at heart.” \\nCrowley says Clinton should have her security clearance revoked tonight. She believes this will be the straw that finally breaks the camel’s back in the Clinton parasitic relationship with the United States. Crowley knew Richard Nixon well. This is so much worse, she says, reminding the audience that nobody was killed in Watergate and “nobody made one red cent.” \\nH/T – RickWells \\nFor once in our lifetime, we the people have an opportunity to elect a President who was NOT chosen by Multinational Corporations, Big Banks, DC Elites, and the Globalist Lapdog Mainstream Media. \\nPlease like and share if you are a TRUMP VOTER! '"}, "time": 1742562151.4956312}