{"duration": 0.16808128356933594, "input_args": {"text": "'Email \\nThe Clintons are a “crime family” and Hillary a “pathological liar,” said former assistant FBI director James Kallstrom during an interview Sunday. And it appears his belief is shared by current rank-and-file FBI agents, as a rebellion has apparently been brewing within the bureau. \\nThe latest shocking news on this front is that despite a plea deal to destroy laptops (evidence) belonging to Clinton associates, those devices were not destroyed and are still in the possession of the FBI. As the Daily Caller reports : Washington D.C. attorney Joe DiGenova said on The David Webb Show on SiriusXM Friday night that despite the FBI agreeing to destroy the laptops of Clinton aide Cheryl Mills and ex-campaign staffer Heather Samuelson as part of immunity deals made during the initial investigation of Clinton’s email server, agents involved in the case refused to destroy the laptops. “According to the agreement reached with the attorneys who handed over their laptops, the laptops were to be destroyed per the agreement after the testimony was given — the interviews were given — by the attorneys. The bureau and the department agreed to that,” DiGenova said. “However the laptops contrary to published reports were not destroyed and the reason is the agents who are tasked with destroying them refused to do so. And by the way the laptops are at the FBI for inspection by Congress or federal courts.” DiGenova said the laptops have already been subpoenaed and the FBI is waiting for Congress to ask for them. \\nAs to this report’s credibility, American Thinker’s Thomas Lifson notes that “DiGenova, a former US Attorney and Washington, DC superlawyer is no flake. He has plenty of contacts within the FBI and a reputation to protect. So I take his words on Sirius/XM’s David Webb show quite seriously.” \\nEver since FBI director James Comey (shown above) shook the political world Friday by announcing that the bureau was reopening the investigation into Clinton’s illegal use of a private e-mail server, theories as to why he’s acting now have proliferated. After all, since consensus was that Comey was covering for the Democrats at the Obama administration’s behest, no one expected a revisiting of Clinton’s criminality just over a week before the election. \\nOf course, given that tens of thousands of e-mails — some apparently Clinton related — were recovered from ex-congressman Anthony Wiener’s laptop during an investigation into his having sent illicit text messages to a 15-year-old girl, the most obvious explanation is that of Watergate journalist Carl Bernstein , that whatever was found is “a real bombshell.” As Thomas Lifson wrote in “3 competing theories on why the FBI re-opened the Hillary email server investigation,” “It is possible that something so dramatic came up in the pertinent emails that postponing a public reaction by not announcing the reopening of the investigation would, [sic] be regarded as political interference by covering up a smoking gun until after the election. In this scenario, Comey is assuming the evidence cannot be suppressed, and that he would be held accountable after it comes out. This scenario also indicates that we could be headed for a constitutional crisis, involving the possible indictment of a president-elect before an election. Or the evidence being turned over to the House of Representatives for impeachment hearings.” \\nThe second theory Lifson outlined was one put forth by radio host Rush Limbaugh. As Lifson wrote, “By announcing an FBI Investigation resuming, Comey is putting a lid on further attention to Wikileaks. I guess this means that Clinton forces will argue we must wait for the investigation to be complete (after the election) before speaking about what the evil Russians are planting into our politics.” \\nLastly, Lifson wrote that Comey “might be seeking to restore his badly damaged reputation, recognizing that the damage he has inflicted on the FBI is substantial. Three days ago, American Thinker published an open letter from a retired FBI agent, Hugh Galyean, that laid out some of the damage Comey has inflicted on the institution he leads. There is little doubt that this reached many in the FBI family, putting in print what people have only whispered about. If those silenced voices start speaking out, Comey could face a serious loss of face. In this scenario, he is heading off a staff rebellion, possibly including mass resignations.” \\nThis last theory is lent great credence by the news that the plea-deal laptops were never destroyed. If that story is true, it reflects a rebellion more serious than most anyone had imagined — with agents defying a direct order . This also adds weight to a related theory: that agents are so disgruntled that not only could some “resign and reveal,” but that active personnel could actually leak the truth to the media. If this is the case, Comey might be trying to get out ahead of such a development. \\nNone of this is hard to imagine. While the FBI director is a political appointee perhaps chosen based on party or ideological loyalty, rank-and-file agents didn’t join the bureau for political power or money. They often are people who chose their career because they wanted to serve their country, and many (if not most) take their oath to “support and defend the Constitution of the United States against all enemies, foreign and domestic” very seriously. And word has it that they have no respect for Comey, viewing him as a “dirty cop.” \\nThe aforementioned James Kallstrom vindicated this assessment, saying “that FBI Director James Comey and the rest of the FBI’s leadership were responsible for holding back the investigation, not the rest of the bureau,” reports the Hill . “‘The agents are furious with what’s going on, I know that for a fact,’ he said.” \\nThis is, apparently, because the agents know what Kallstrom does. As the Hill further writes: “The Clintons, that’s a crime family, basically,” Kallstrom said. “It’s like organized crime. I mean the Clinton Foundation is a cesspool.” ... He also blasted Attorney General Loretta Lynch, claiming that she impeded the investigation into Clinton’s private server. “The problem here is this investigation was never a real investigation,” he said. “That’s the problem. They never had a grand jury empanelled, and the reason they never had a grand jury empanelled, I’m sure, is Loretta Lynch would not go along with that.” “God forbid we put someone like that in the White House,” he added of Clinton. \\nThis appears standard FBI sentiment. I personally know of an ex-agent — someone with knowledge of Clinton “crime family” dealings — who I’m told is having trouble sleeping at night due to the prospect of a Clinton presidency. \\nTwo other people who may now have trouble finding the arms of Morpheus are Clinton and her longtime aide and confidante (and rumored lesbian lover) Huma Abedin. Abedin, who has questionable Islamic connections , is Anthony Wiener’s estranged wife and is apparently responsible for the Clinton-related e-mails found on his laptop. Note that Abedin may have legal problems herself, having sworn under oath that she relinquished “all devices” and having signed, under penalty of perjury, a document stating she wasn’t retaining any copies of the relevant materials. \\nWhether or not the new Clinton e-mails contain devastating information, they certainly provide an excuse for Director Comey to reopen the investigation, thus controlling a bureau rebellion that could lead to his own scandalization and career destruction. He may now realize that it’s a matter of Clinton — or him. \\nWhatever the case, this unprecedentedly scandal-ridden campaign — with Project Veritas, WikiLeaks, and now FBI revelations and a story that, as radio host Michael Savage put it, only a Shakespeare could write — should have a wild closing week. Logic dictates that Halloween will be followed by the scariest revelations yet, likely the result of another WikiLeaks dump. Hold on to your seats; the ride has just begun. Photos of Hillary Clinton and James Comey: AP Images Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742563225.3805978}