{"duration": 0.0986788272857666, "input_args": {"text": "'North Dakota’s Public Bank Is Funding Police Repression at Standing Rock Posted on Nov 4, 2016 \\nBy Matt Stannard / Cowboys on the Commons Matt Stannard \\nThe brutal repression of indigenous and allied protesters at Standing Rock has shocked the conscience of fair-minded Americans, particularly those advocating economic and ecological reform. Although the protesters had in some cases been encroaching on “company land,” they had done so peacefully, and their chief modes of political action have been prayer and nonviolent civil disobedience. The crackdowns of the last few weeks have seen attack dogs and rubber bullets causing bloody injuries to protesters, detention and malicious prosecutions, and other dehumanizing behavior from the cops and soldiers deployed there by North Dakota Governor Jack Dalrymple. \\nFor those of us in the public banking movement, used to holding up the Bank of North Dakota (the nation’s only public bank) as an example of how promising public banks are, the recent news that Dalrymple and an emergency spending panel voted to add $4 million in additional credit onto a $10 million line from BND, to fund law enforcement expenses at Standing Rock, is troubling. It means BND is using its heralded public power over fractional reserve banking to pay for those rubber bullets and a host of logistical expenses involved in arresting and evicting protesters the federal government has refused to evict, citing free speech concerns. \\nThis financing is part of one of BND’s core functions: providing emergency loans. A more positive deployment of that function happened in 1997, when BND provided emergency loans for the Grand Forks flood, at a time when communities desperately needed loans before receiving slow-moving FEMA reimbursements. Unlike the need to abuse   the flood was a real public emergency–the flooding caused structure fires and destroyed dozens of buildings via fire or water. Property losses in Grand Forks topped $3.5 billion. There were 50,000 evacuees. BND provided over $70 million in funds for relief. \\nThe Bank of North Dakota was conceived a century ago in the molding of distinctly American, agrarian-socialist populism. North Dakota farmers were in trouble, getting cheated by the big banks and big grain companies headquartered in Minneapolis and Saint Paul. Those entities knew they had farmers at their mercy, and so all the interest rates were double-digit, all the loan terms were unfavorable (and less favorable to those who relied on them the most), and as the grain companies operated every grain elevator along the railroad route; those companies offered farmers destructively low prices, often cheating on tonnage because the farmers had nowhere else to go. \\n  \\nIn 1915, led by a struggling farmer named A.C. Townley, a group of North Dakotans formed the Nonpartisan League to push back against those powerful grain and banking interests. The NPL ended up taking political power in the state, creating both the Bank of North Dakota and the North Dakota Mill and Elevator. Today, those two public utilities are the only institutions of their kind under any state government in the U.S. They’ve long outlived the NPL, whose inexperienced political leaders were subject to constant attacks and red-baiting from big business interests, exacerbating NPL infighting and corruption, culminating in the recall of Governor Lynn Frazier, alongside whom the state legislature had created one of the most progressive state agendas in American history. \\nSince then, for understandable reasons, BND has been militantly apolitical. BND President and CEO Eric Hardmeyer has explicitly repudiated arguments that the BND ought to be a model, despite his effective touting of its successes. The Bank exists to help the state and its businesses function well and to maintain liquidity and economic stability. BND created the infrastructure for North Dakota’s oil boom, and if the state were to commit to a truly proactive transition to renewable and clean energy (it has taken baby steps), the BND would make it happen financially–with an efficiency that would put the rest of the country to shame. \\nBut in the present political reality, cops and soldiers are brutally cracking down on Standing Rock protesters, and BND is funding it, and that makes BND not truly apolitical, but a facilitator of injustice. Public banks are tools, not sources of virtue in themselves. In the hands of bad policymakers, they can prop up bad policies. \\nSo what do we do with this unfortunate knowledge, besides continuing to support the Standing Rock protesters, calling the governor regularly (if you do, please mention that using BND to finance repression is shameful), and pushing for a just and sustainable transition to clean energy (including economic support for energy sector workers and their families)? What do these unfortunate events teach us about our movement? \\nFirst, the awful actions in North Dakota don’t undermine the idea of public banking. If anything, they’re more evidence against private ownership and shareholding in both fossil fuels and the financial sector. In financing those rubber bullets and smoke bombs, BND is paying the security costs of private corporations, subsidizing the worst of big oil capitalism. But as my colleague, Ira Dember, pointed out to me yesterday, North Dakota is rich in wind and is building wind farms. That four million dollars could have been better lent to develop additional wind resources and technology, and to train workers to transition from oil fields to wind farms and more. That depends on a larger movement, which I’ll talk more about below. \\nSecond, the actions illustrate the folly of pushing for state and local control without accompanying universal human and environmental rights. Economic and environmental justice advocates have long promoted local autonomy as a bulwark against big corporations and their puppets in national and state government. But local governments (often pushed by state legislators and governors) can do violence to indigenous communities just as they have enforced segregation and lynchings in the South. Human rights and environmental protection must be encoded in national and international norms and these norms need to have a complimentary and non-oppressive relationship with local communities. That makes our coalition-building and policy-making tasks bigger and more challenging. It makes allies and communication more important, and demands clarity about various movements’ and organizations’ ethical frameworks. \\nThird, you can’t keep people you disagree with ideologically out of single-issue movements. Sometimes this can be frustrating: There are all sorts of people in the public banking movement, including a few supporters who aren’t committed to ending fossil fuel consumption, and even weirder and more disturbing, a tiny handful of extremists who want to take down big private banks because they associate banking with Jews. Thankfully, those toxic forces don’t show up in any significant numbers (and the Public Banking Institute has explicitly repudiated them). While the movement is primarily white and bourgeois, there are powerful non-white, non-bourgeois voices in it, and its alignment with the New Economy Coalition and other economic justice coalitions helps considerably. It matters who you do your activist business with. \\nFinally, whatever your own organization’s commitment to justice, the policies and institution your movement creates, if it is lucky enough to create them, will only be as socially positive and ethically correct as the people working inside of them, and the communities overseeing them. Public banks can fund a post-carbon, sustainable energy transition–but only if people successfully demand a post-carbon, sustainable energy transition. Public banks can create safe and prosperous communities for all, but only if that’s what communities are already committed to. \\nPublic banking advocates, in particular, ought to emphasize the ways public control of state and municipal finance can fund new structures of work and production that neither exploit nor extract. That has always been the most powerful argument for public banks: that they can produce justice because as community-controlled entities, we can make them just. \\nMatt Stannard is policy director at Commonomics USA and was formerly on the Public Banking Institute ’s board of directors. The views expressed in this post are his own. TAGS:'"}, "time": 1742628343.5987012}