{"duration": 0.12913203239440918, "input_args": {"text": "'What powerful political woman is mocked for her clothes, is the target of pictures on Twitter depicting her as haggard and is routinely called a witch and a bitch? If you guessed Hillary Clinton, you’re right. But if you guessed Kellyanne Conway, you’re right, too. Misogyny, it seems, remains a bipartisan exercise. Whatever legitimate criticisms can be leveled at each woman, it’s striking how often that anger is expressed using the same sexist themes, from women as well as men. Mrs. Clinton “repeats her tacky outfits,” one Twitter critic sniped. The Inauguration Day outfit of Ms. Conway, a counselor to President Trump, looked like “a night terror of an android majorette. ” Mrs. Clinton’s hair has drawn relentless derision one Twitter user recently asked: “Why does Kellyanne Conway always look like she’s still drunk  wearing make up from last night’s bender?” And both women have been repeatedly compared to witches from “The Wizard of Oz,” most recently in pictures shared on Twitter tying Ms. Conway to the witch killed under Dorothy’s house. The two women are at opposite ideological poles, but they stir up the same lingering cultural discomfort with ambitious, assertive women. “These sexist memes are not the purview of one party,” said Karen Finney, a senior adviser to the Clinton campaign. “We fear strong women and women with power. These attacks are meant to delegitimize that power. ” Ms. Conway has drawn scorn, and been disinvited from some news programs, for her references to a “Bowling Green massacre” that never took place and her defense of claims about the size of the crowd at Mr. Trump’s inauguration as “alternative facts. ” Yet some of the criticisms have taken on a distinctly sexualized tone. Witness the furor over her sitting on her knees on a couch in the Oval Office during a reception for presidents of historically black colleges. While she drew fire for disrespect, some of the criticisms included digs about her spreading her legs and raunchy allusions to oral sex, Monica Lewinsky and Bill Clinton. Representative Cedric L. Richmond, Democrat of Louisiana, told a   joke that hers was a “familiar” position in the Oval Office of the 1990s, drawing a rebuke from none other than Chelsea Clinton. (Mr. Richmond apologized Sunday evening.) A “Saturday Night Live” skit riffed on Ms. Conway as a “Fatal Attraction” stalker, breaking into the CNN correspondent Jake Tapper’s house to seduce him into having her on his show. “There seems to be great resentment of both as power hungry and wanting to control men,” said Marjorie J. Spruill, the author of “Divided We Stand: The Battle Over Women’s Rights and Family Values That Polarized American Politics. ” “Whereas Hillary is called castrating or shrewish, Conway is often called a slut. The implication is that she is using femininity to control men. ” Ms. Spruill noted that Ms. Conway had leaned back to take pictures as a favor to the participants, but that some critics had cast the pose as a sexual  . Ironies abound. Ms. Conway is loathed by many Clinton aides as the architect of a presidential campaign that they felt used overtly and implicitly sexist messages. Mr. Trump repeatedly denigrated women for their appearance and, after taking office, directed his female staff members to “dress like women. ” Many conservative women, from Sarah Palin to Ann Coulter, have emphasized their femininity to distance themselves from feminists, whom they accuse of hating men. In a recent interview at the Conservative Political Action Conference, Ms. Conway said she supported many feminist principles but said she would not call herself one because feminism is     and identified with the left. “I think some of the reticence that might be coming across in not a huge chorus of defense of Kellyanne Conway in the face of these sexist comments is the feeling that she doesn’t have our back,” said Gillian Thomas, a senior staff lawyer of the Women’s Rights Project of the American Civil Liberties Union. “It’s a shame,” Ms. Thomas continued. “If women were more united and speaking up at this behavior, including when it’s perpetrated by the left, we’d all be a lot better off. ” Ms. Conway suggested in an interview with The Daily Caller that there would have been more outrage at the comments if she had been a liberal woman, adding, “And it is not just if I were a liberal woman, but if I were a   one. ” Ms. Conway did not respond to a message left with her assistant requesting comment for this article. Still, Ms. Conway has spirited defenders on the right on social media who say she should be championed as an example of a groundbreaking woman in politics instead of mocked in sexist terms, and some liberal women in Facebook comments chided others for sexism. “Ladies  Gents, I disagree with her as much as anyone,” wrote someone identified as Melissa Mae. “It would be nice to see comments sticking to valid points instead of ALWAYS going after women on the basis of ‘looks. ’” Mirya R. Holman, an assistant professor of political science at Tulane University who studies gender and politics, said, “This does mimic what conservative women have said in the past: ‘You liberals think you’re so enlightened, but we still get people saying vile things about us. ’” Jennifer Palmieri, the director of communications for the Clinton campaign, who memorably clashed with Ms. Conway at a postelection forum at Harvard, also sees echoes of the sexism that dogged her candidate in the attacks on Ms. Conway. She said she believed Ms. Conway should be held accountable for her actions. But she noted that while Stephen K. Bannon, Mr. Trump’s chief strategist, is portrayed as an “evil genius” who cannily promotes images of an America at risk from immigrants and foreign competitors, Ms. Conway is depicted as “crazy” for devising and promoting similar messages. “What I find really disturbing is because he’s a man, that’s really smart and strategic,” Ms. Palmieri said. “Why is there not a theory behind what Kellyanne does?” Whether the attacks come from the right or the left, they show a persistent anger toward women who step outside conventional roles. Social media has long enabled a thriving subculture of the violent disparagement of women, such as the GamerGate threats toward those who challenged the male bastion of video games. Much as latent racism surfaced during the presidency of Barack Obama, this election exposed a vitriol toward powerful women that continues to erupt, beyond the confines of Twitter or Reddit. “To me, the 2016 election was hopefully an opportunity to be reminded that we’re not in some kind of postgender society,” Professor Holman said. “There’s a smaller set of acceptable behaviors for women. ” Ms. Finney, a longtime Clinton aide, has watched those issues play out for more than 20 years in public life as Mrs. Clinton served as a   for debates about women’s roles. She said she and conservative women would sit in green rooms awaiting television appearances and trade stories about how they were attacked. “There is this sense: ‘Are you kidding me? ’” she said. “‘Are we going back to this?’ Maybe we have to go back to go forward. ”'"}, "time": 1742562980.3177347}