{"duration": 0.046204566955566406, "input_args": {"text": "'Mittwoch, 9. November 2016 So ein Ärger! Obama hat über Nacht sämtliche Atomcodes verloren Washington (dpo) - Wie konnte das nur passieren? Barack Obama soll in der Nacht zum heutigen Mittwoch seinen Atomkoffer verloren haben. Das gab der scheidende Präsident nach den ersten Hochrechnungen zur Wahl bekannt. Er glaube auch nicht, dass dieser innerhalb der nächsten vier Jahre wieder auftauchen werde. In dem Koffer befinden sich unter anderem die streng geheimen Atomcodes, auf die ausschließlich der Präsident Zugriff hat. Obama erklärte sein Missgeschick so: \"Ich schaute gerade gespannt die ersten Prognosen zur Wahl, als ich plötzlich zu meinem Entsetzen bemerkte, dass der Koffer weg war. Was bin ich nur für ein Schussel!\" Er habe zwar sofort das komplette Weiße Haus abgesucht, aber die Codes blieben verschwunden. \"So ein Ärger. Naja, nützt ja nichts. Aber die Codes wurden in der Vergangenheit ja ohnehin nicht benötigt, deshalb ist der Verlust nun nicht ganz so tragisch. Mein Nachfolger wird auch ohne Atomkoffer auskommen. Vielleicht fällt mir ja in vier Jahren wieder ein, wo ich das Ding hingepackt habe.\" Nicht hinter dem Sofa, nicht unter dem Schreibtisch und auch nicht von Bo im Garten vergraben... Der Atomkoffer ist und bleibt verschwunden. Zeit für eine noch intensivere Suche hat Obama, der in zwei Monaten das Weiße Haus räumen muss, eigenen Angaben zufolge leider nicht. \"Ich muss ja noch Schönheitsreparaturen für die Übergabe durchführen. Gerade bin ich dabei, alle Räume pink zu streichen.\" Es sollte nicht das einzige Missgeschick des Präsidenten bleiben: Nur kurz nach offizieller Bekanntgabe von Trump als Wahlsieger trat ein peinlich berührter Obama erneut vor die Mikrofone und teilte mit, dass er \"blöderweise\" jetzt auch noch ein Glas mit hochaggressiven Termiten fallen hat lassen, die das Weiße Haus bis zur offiziellen Übergabe womöglich schwer beschädigen werden.'"}, "time": 1742561755.6043696}