{"duration": 0.09517788887023926, "input_args": {"text": "'Countering Hillary’s Coup With a Counter Coup – or Not? By DailyBellStaff - November 03, 2016 \\nVideo: Corruption, Cooptation, Cronyism: The Hillary Clinton “Takeover”, The “Counter-Coup”, Action of America’s Intelligence Community –Global Research \\nIs it possible the recent counter coup announced by Steve Pieczenik, a former official in numerous Republican administrations, is actually part of a much larger dominant social theme designed to reinforce positive perceptions regarding the most secretive and powerful government agencies? \\nGlobal Research, one of the very best alternative websites, does us the favor of providing “ a video presentation by Dr. Steve Pieczenik, a former Deputy Assistant Secretary of State.” It has also provided us with a transcript of Pieczenik’s remarks. \\nPieczenik “has served as foreign policy expert in several US administrations including Gerald Ford, Jimmy Carter, Ronald Reagan and George W. Bush.” \\nMore: \\nThe analysis and focus presented below must be taken very seriously. It sheds light on the ongoing political crisis in the US and the opposition which is developing from within the US intelligence community against the Clinton crime cabal. \\nAccording to Steve Pieczenik, “Hillary and Bill Clinton are attempting a takeover of the United States and will stop at nothing. A coup d’état of this magnitude has never been affected in such a subtly calculated way.” \\nPieczenik goes on to explain how the FBI, CIA, Pentagon and other official military-industrial agencies have gotten together silently to fight the silent “coup” of Bill and Hillary Clinton. \\nBasically the argument is that “pay-to-play” has been created by the Clinton Foundation, which is apparently under substantive investigation. \\nHillary and Bill would use their contacts and influence to push the US government into taking action in ways which enhanced the interests and profits of certain countries and individuals if they contributed to the Clinton Foundation. \\nThe Foundation is evidently a government-in-waiting for the Clintons and having such a large entity as their disposal enhances their power considerably. \\nBut both Hillary and Bill Clinton don’t seem to be very stable people. Hillary has a horrible temper and is evidently contemptuous of those beneath her. Bill Clinton has been the subject of rape accusations and organized, international drug dealing – and Hillary has evidently abetted some of his worst behavior.. \\nYet it is certainly possible that neither Bill nor Hillary are fully aware of the scale of the manipulation in which they are enmeshed, nor its timeline. Are they now part of a rapidly unfolding psyop that has its roots decades ago? \\nMaybe Pieczenik, Julian Assange and others are indeed true heroes for countering the Clinton’s emergent authoritarianism, as they appear to be. This is certainly an incredibly admirable and deserved perspective. But there are other interpretations. \\nOur primary purpose is to analyze elite dominant social themes and that’s why we are raising these questions, hypothetical as they may be. Hillary Clinton is an apparent threat to the what’s left of the liberties of the USA but there is a possibility, perhaps a slim one, that this new “coup” narrative is not what it seems. \\nRegardless of the status of the US – corporation, democracy, republic – the US functions, day-to-day, with a certain expectation of freedom. This is why those on “right” – libertarian or conservative – are evidently shocked (on videos and in print) when the US government and those behind it take actions that one would not expect to take place in a “republic.” \\nNow we are informed that this sentiment is an animating force in parts of the Pentagon, CIA, FBI, etc. The counter-argument, of course, is that the FBI, CIA and Pentagon have not usually been seen as guardians of “freedom.” \\nThe FBI has put hundreds if not thousands of people in jail because of flawed fingerprint and hair analysis that some in the bureau knew to be false all along. To the best of our knowledge, a lot of the damage was never properly addressed. \\nThe CIA is responsible for the deaths, injuries and miserable lives of millions, even billions, around the world because it represses freedom in favor of elite control of countries and their governments. \\nConstitutionally speaking, the FBI and CIA probably should not exist, let alone be spread around the world. The Pentagon, which recently mislaid $8 trillion, supports CIA covert intel actions with its own more overt military activities. \\nIt is wonderful that people within them are supportive of freedom. But the CIA, FBI, Pentagon, etc., don’t actually work for the people in the US. At the top levels, they seem to work for the private banking interests that have installed and organized them and are pursuing a greater globalism that likely includes the destruction of the US.. \\nToday there is considerable conflict between private banking interests and the alternative ‘Net media, and the people it represents. One way to reduce this conflict would be to make it clear to people who value a culture of freedom that the most authoritarian agencies in the US are secretly aligned with them. (See also our skeptical comments regarding the Brexit vote in our “populism vs. globalism articles.”) \\nThis seems beyond the pale and ludicrous but these banking interests are both subtle and powerful. One way or another, they evidently control the central banks of the world and thus hundreds of trillions of dollars. They may even have propagated a kind of nuclear myth, as we have pointed out here in the past, that has affected people’s sentiments and priorities for decades. \\nThey tend to work through the dominant social themes we analyze because they are absolutely determined that people are to back their globalist plans on a voluntary basis without knowing they are doing so. \\nIn the Internet era, these “memes” have begun to founder in critical ways. But those creating them continue to try. They are abetted by millions (and more), who are aligned with them professionally or emotionally – some because they don’t know any better. \\nAt the very top, everyone else is likely disposable (except for a handful of owners) and apt to be manipulated as necessary. \\nThis is probably an article that many may react to emotionally and even negatively. But we are certainly not trying to support Hillary’s campaign, only to point out that in this world not everything is at it seems, especially when it comes to authoritarian agents of the state. \\nConclusion: Your first priority is to take care of yourself and your family. Politics, especially today, seems to offer the hope of greater freedom but usually does not. For more on the issues we’ve raised, please use a search engine to find “TheDailyBell” and “populism versus globalism” ( here , here and elsewhere). These issues may be tied to an an even larger propaganda campaign.'"}, "time": 1742564463.5244193}