{"duration": 0.06887245178222656, "input_args": {"text": "'Battle Over Dakota Access Pipeline Should Be the Most Important of the Year Posted on Nov 3, 2016 \\nBy Sonali Kolhatkar A protester against the controversial Dakota Access pipeline project takes a stand before law enforcement officers Oct. 27 as police and other forces attempt to force activists from a camp set up in the path of pipeline construction near Cannon Ball, N.D. ( James MacPherson / AP Photo ) \\nMore than a million people around the U.S. have “ checked in ” via Facebook to Standing Rock Indian Reservation in Cannon Ball, N.D. While this began as an attempt to confuse Morton County Sheriff’s Department officials thought to be digitally surveilling activists, the check-ins morphed into a collective gesture of solidarity. They are also a measure of how deeply the Standing Rock Sioux tribe’s fight over the Dakota Access pipeline (DAPL) resonates with the American public. A similar measure is apparent in how crowd-funding campaigns set up by activists have far outpaced their funding goals— one effort to raise $5,000 ended up generating more than $1 million. Americans who are unable to physically lend their support are eager to participate in some way in the struggle against the pipeline that one New York Times op-ed writer equates with the Keystone XL pipeline fight . \\nThe DAPL conflict is symbolic of so many wrongs and is at the intersection of so many issues that it is no wonder it is shaping up to be the most important contemporary struggle in the U.S. It embodies, in particular, the historic mistreatment of Native Americans, as well as their ongoing efforts to preserve their sovereignty. It is also a matter of environmental racism, given that the pipeline is routed under the water source of a vulnerable minority. Short-term pollution from pipelines and other oil infrastructure, as well as the longer-term pollution of greenhouse gases that affect the climate, are also part of the DAPL story. \\nIn the massive police response against protesters, we are seeing horrifying examples of police brutality and witnessing how state power protects private commercial interest and preserves corporate domination over people. This has engendered domestic solidarity from the Black Lives Matter movement, labor groups and others who consider it a common struggle, as well as international solidarity offered by oppressed communities, such as Palestinians. Many threads are coming together to weave a tapestry of struggle. \\nAdvertisement Square, Site wide \\nThe fight to stop the DAPL is a perfect storm of issues, a convergence of ills that represents so much of what is wrong with American society that needs desperately to be fixed. A growing list of celebrities—including actors Shailene Woodley, Mark Ruffalo and Chris Hemsworth, as well as musicians Neil Young and Dave Matthews—are lending their star power to the cause and turning their fans on to it. \\nThe fact that our elected officials are so deafeningly silent on this crucial struggle is exactly why many Americans are disillusioned by our electoral system. GOP presidential nominee Donald Trump has said nothing about the pipeline project, perhaps because he has numerous business interests tied to it. But Democratic nominee Hillary Clinton, who ought to be a natural ally to the “water protectors,” as they refer to themselves, had to be shamed into issuing a statement. Indigenous youths from various tribes occupied her campaign office in Brooklyn, N.Y., recently to demand she take a stand against the pipeline. When she issued a statement , it was a meaningless request that “all voices should be heard and all views considered.” Her campaign chairman, John Podesta, spouted similar nonsense in a recent interview, saying, “I think she believes that stakeholders need to get together at this point. ... It’s important that all voices are heard.” \\nSimilarly, President Obama, who seems to have very little to lose by stopping the project voluntarily halting its project. The company, obviously, did not comply. However the President did suggest in open letter to Obama , calling on him to “take a bold stand” against the project. \\nIt’s not just most elected officials and candidates running for office who are silent. Mainstream corporate media outlets have only recently begun covering the protests at Standing Rock, although they began in April. In September, the media watchdog group Fairness and Accuracy in Reporting called out TV networks for their “blackout” of the story. Even with increased media coverage, there has been little focus from traditional media outlets on police brutality against water protectors and journalists and the extreme felony charges many of them are facing.'"}, "time": 1742562149.506266}