{"duration": 0.03180646896362305, "input_args": {"text": "'  Sen. John McCain ( ) has reportedly told a   newspaper that he believes “American leadership” was better under President Barack Obama than President Trump  —   the latest in a series of shots the failed 2008 presidential candidate has taken at his fellow Republican. [According to the Guardian, McCain was “visibly irked” when asked about comments Trump made last week in the wake of the terrorist attack in London, in which he criticized London Mayor Sadiq Khan for his response to the atrocity.  “What do you think the message is? The message is that America doesn’t want to lead,” McCain said. “They are not sure of American leadership, whether it be in Siberia or whether it be in Antarctica. ” Then, when asked if America’s international standing was better under Obama, McCain reportedly responded: “As far as American leadership is concerned, yes. ” McCain  —   who lost his 2008 presidential bid against   Obama after a campaign in which he repeatedly defended Obama from his supporters’ criticisms  —   has been an outspoken critic of Trump and has refused to tone it down since his fellow Republican took the White House. In a recent tour of Australia, McCain told an audience in Sydney that Trump has “unsettled” allies and Americans alike. “Other American allies have similar doubts these days and this is understandable,” McCain said, according to The Associated Press at the city’s university. “I realize that some of President Trump’s actions and statements have unsettled America’s friends. They have unsettled many Americans as well. ” He went on to urge the Australians to “keep at” the   Partnership deal in the hope that one day “America will decide to join you. ” He also said in an interview with an Australian TV network that Trump makes him “nervous from time to time” and said he was bothered that Trump does not always take the advice of his national security team. “Can I tell you that he does all the time? No. Does it bother me? Yes, it bothers me,” he said. Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY.'"}, "time": 1742563259.4030075}