{"duration": 0.07251214981079102, "input_args": {"text": "'Breitbart Senior Editor MILO appeared on Real Time with Bill Maher on Friday night, and leftists on Twitter were not happy about it. [“Bill Maher” trended on Twitter Saturday morning, with over 35 thousand tweets about the show, including many who were angry with Maher for inviting MILO on.  @billmaher @Joan_Rivers Love you Bill, but you gotta stop normalizing folks like Ann Coulter, Steve Bannon, Milo, et al  …      —   Sara (@Hill4America) February 18, 2017,  @billmaher @Joan_Rivers You’re no longer on my watch list. That was the last straw.  —   #TheResistance (@ResistTilDeath) February 18, 2017,  @billmaher @Joan_Rivers Liberals need to stop acting like this vile human being is worth the energy  …    feeds on getting a rise out of people.  —   Graeme Rodgers (@graemenrodgers) February 18, 2017,  @Alexand52841248 @speakforme @billmaher milo is a   #whinylittlebitch in need of constant approval, just like trump,  —   Scott C Nevin (@scottcnevin) February 18, 2017,  @billmaher nah, you need to stop giving a platform to someone who would have you thrown in a camp.  —   Noah Zucker (@noahlz) February 18, 2017,  Bill Maher is just as much of a bigot as Milo can people please stop acting like he’s some kind of hero,  —   i miss my son (@JoseLothario) February 18, 2017,  @billmaher Well Bill, you fucked up on this one. Milo does not deserve a national platform for his lies and hate. He should be deported!  —   Jo Blackwood (@joblackwood3) February 18, 2017,  Maher said it was ”not unreasonable” for Milo to doxx a trans woman to protect ”women and children” in bathrooms. Fucking bigot.  —   Dan Arel (@danarel) February 18, 2017,  This @billmaher laugh fest with a racist, misogynistic, transphobic, Islamaphobic troll was disgusting ( an unnecessary platform for Milo) https:  .   —   Waymon Hudson (@WaymonHudson) February 18, 2017,  No longer liberal @billmaher SHOOK • SHOOK • SHOOK Milo Yiannopolous’ HAND LIVE  ! !! 😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡 #FuckMilo #FuckMilo #FuckMilo https:  .   —   Erik Landwehr 🏳️\\u200d🌈 (@EJLandwehr) February 18, 2017,  I knew Bill Maher was a coward and an idiot, but that Milo interview.. Yikes.  —   Morgan M Page (@morganmpage) February 18, 2017,  Would the gay community blame me if I bash this so called dangerous faggot,  Milo?  —   UnknownKnown (@XKnownXUnknownX) February 18, 2017,  In which the @nytimes continues to normalize #fascism by writing #meetcute piece on @billmaher hosting #milo #nope #resist #antifa https:  .   —   Irish In Slope (@IrishInSlope) February 18, 2017,  I’m watching Bill Maher  thinking ”He’s giving time to a nobody” He’s making Milo more important than he is. This was how Trump got elected,  —   Kelli Russell Agodon (@KelliAgodon) February 18, 2017,  You can watch MILO’s full interview with Maher here. Jack Hadfield is a student at the University of Warwick and a regular contributor to Breitbart Tech. You can follow him on Twitter @ToryBastard_, on Gab @JH or email him at jack@yiannopoulos. net.'"}, "time": 1742563050.4824069}