{"duration": 0.10966300964355469, "input_args": {"text": "'Email \\nSpeaking at a Hillary Clinton fundraiser in Canton, Ohio, last November, former President Bill Clinton (right) expressed disappointment concerning a then-recent Democratic presidential candidates’ debate, during which, he said, there was not a single mention of the fact that “84 percent of the American people, after inflation, had not had a raise of 1 cent since the financial crash.” \\nThe financial crash of which Clinton spoke began in late 2007 and extended into 2008 — the year Barack Obama was elected president. Though his administration was not responsible for the crash, when Clinton spoke last year, Obama had been president for more than six years. Therefore, Clinton’s observations indicated that the vast majority of Americans had made no financial progress during Obama’s entire first term and half of his second term. \\nBritain’s Daily Mail reported that the former president’s speech was published by WikiLeaks as part of the website’s release of Clinton campaign chairman John Podesta’s e-mails. \\nIn addition to the lack of income growth among most Americans, Clinton revealed a remarkable statistic: The life expectancy of middle-aged, non-college-educated white Americans is declining. Said the former president: And in the middle of all this we learned, breathtakingly, that middle-aged, non-college-educated white Americans’ life expectancy is going down and is now lower than Hispanics, even though they make less money. And the gap between African Americans and whites is closing, but unfortunately not because the death rate among African Americans is dropping but because the death rate among white Americans is rising. Why? Because they don’t have anything to look forward to when they get up in the morning. Because their lives are sort of stuck in neutral. \\nClinton’s explanation that the reason that middle-aged, non-college-educated white Americans’ life expectancy is going down is because “they don’t have anything to look forward to when they get up in the morning” is probably an oversimplification that requires greater analysis. \\nThe obvious reason why someone may not have anything to look forward to when they get up in the morning is because they are unemployed and therefore have no job to go to. Figures released by the Bureau of Labor Statistics for 2015 — the year Clinton gave his speech — indicated that those with only a high-school diploma had a 5.4 percent unemployment rate, compared with a 2.8 percent rate for those with bachelor’s degrees. (These figures did not account for race, and they didn\\'t count literally millions of unemployed Americans: After a few months of looking for work, the government drops them from the unemployment rolls, deeming them to not want to work. In 2009, 80 million Americans were deemed not in the labor force; now it\\'s 95 million. Also, if an American is able to find a low-paying part-time job out of his field, he is considered employed by the government.) \\nAn article published by Fortune on November 3, 2015 (about two weeks before Clinton’s speech) may have provided him with a basis for his statement. The article’s headline? “Is the Economy Killing Middle-Aged White People?” The article cited a survey released by a pair of researchers at Princeton University the previous day showing “a striking increase in the death rates of white, middle-aged Americans who have less than a college education.” \\nThough the researchers Angus Deaton, the 2015 Nobel laureate in Economics, and his wife, Anne Case, both professors at Princeton, didn’t form any steadfast conclusions about the reasons for the increase in death rates, they did speculate that economic factors are likely at least partly responsible. Fortune reported: Between 1999 and 2013, white men and women ages 45-54 saw their mortality rate increase by a half-percent per year, reversing decades of improvements up until that time. The main causes were suicide and the use of alcohol and drugs (both legal and illegal), according to the study published in the Proceedings of the National Academy of Sciences. \\nThe article noted that while it is impossible to know for sure how attributable the high death rates are to economic forces without more study, the Princeton researchers have speculated that the economic crisis of 2008 might have been a major factor. \\nThe research paper considered an explanation for why the higher death rate has affected white middle-aged people more than those in other ethnic and racial groups subject to the same economic downturn. Their explanation was that “working-class whites have decades of relative success and security behind them…. For the first time, perhaps, that group has seen a reversal of its fortunes.” \\nWe might add another explanation for the increased mortality rates: Workers accustomed to having their medical care paid for by their employers may find that, upon becoming unemployed, they can no longer afford medical insurance and, as a result, neglect the healthcare necessary to maintain their health. \\nWhile Clinton did not refer to the Princeton professors\\' paper in his speech, it is possible that its release just weeks before did provide him with some talking points. \\nClinton’s comments were made in the context of a stump speech on behalf of his wife’s candidacy, and he did not offer any substantive solutions for the crisis among white middle-aged Americans. He instead offered this vague proposal: We have unlimited potential in America to grow our economy if we do a few things right, and not a lot. Five or six or seven things, really we’ll see jobs start forming again; we’ll see business formation going up again; we’ll see wages rising again. And I believe she’s outlined reasonable responses to all the things that will do that. And I ought to have some credibility on that, because the only time in 50 years when all sections of the American economy have grown together were in the eight years I had the privilege to serve. \\nIn that regard, Clinton (on behalf of his wife) shared in rival candidate Donald Trump’s tendency to make many promises to grow the economy and create jobs offering higher wages, while offering few concrete details about how these lofty goals might be realized. Considering that the best thing that government can do to stimulate the economy is simply to get out of the way and allow the free market to flourish, however, any plan offered by a former Cabinet member of the administration that gave us ObamaCare might well be viewed with skepticism. We might also want to remember that the former president is the one who signed NAFTA, the trade deal that negatively impacted American jobs — leaving many Americans without \"anything to look forward to when they get up in the morning.”'"}, "time": 1742561692.3140955}