{"duration": 0.11550688743591309, "input_args": {"text": "'Two months ago, Charles Granatell’s house in Wyckoff, N. J. was filled with   camaraderie. His best friend from college, Mike Canfora, was getting married. Mr. Canfora flew in from Seattle, others drove in from Massachusetts and Manhattan, and some lived nearby. Eight of the 10 groomsmen were there. A   TV loudly projected the Giants N. F. L. game. Paper plates containing sandwiches, pasta, salad and steak, food that had been catered, were strewn about. Wine and beer were consumed. Then Dana Manganelli, a stylist who routinely makes house calls for Mr. Fox Suits in Montclair, N. J. arrived. The mood changed to an almost giddy quality as the eight groomsmen piled into the den, unzipped the garment bags, pulled out their custom suits and proudly showed one another their individualized linings. “We’ve looked forward to this day for months,” said Mr. Canfora, 27, who flew in with his fiancée, Jenna Campana, 28, for this second and final fitting before his wedding, which was Oct. 8 at the LaPlaya Beach  Golf Resort in Naples, Fla. “Women have so many events. Other than the bachelor party, guys don’t have another opportunity to get together and celebrate. ” The scene was a familiar one. In fact, it was an encore performance. On Aug. 5, these same men huddled around Mr. Granatell’s swimming pool, drank their favorite beer, ingested a similar meal, smoked some stogies and were fitted for wedding suits by Justin Fox, who owns Mr. Fox Suits. Women aren’t the only ones having fitting parties to celebrate their special day. And as the demand for these   increases, suit fitters and online rental companies are embracing this new transition by creating environments to meet clients’   and individual needs. “I opened my own shop last September, and my first gentlemen’s fitting was in January,” Mr. Fox said. Since then, he estimates he has done more than 20 events 10 have been groom gatherings. “So I developed ‘Suits  Scotch’ nights from this growing trend,” Mr. Fox said. “Evenings like this give men an experience. It’s like a Tupperware party for guys. ” Lewis Malivanek, creative director of Knot Standard, a   company on West 24th Street in Manhattan, agreed. “Group groom fittings have become surprisingly popular over the past few years as custom clothing becomes more important and more affordable to the consumer,” he said. “Now we have these parties once or twice a week. ” The company recently moved to a bigger space with the goal of accommodating these larger male celebrations. Some perks include drinks served by a bartender from a recently purchased antique bar,   TV, couches and lounging area. On weekends, bagels are served, and on weeknights, food is catered. “Men are realizing they don’t have to rent a tux or go to Brooks Brothers to buy something that’s made to fit everyone,” he added. “These are fitted for them and can be worn to other events. That’s very appealing to them. And they’re personalized. We had one recent party where everyone used their football team colors for the lining. This is them creating what they want to wear, and brides are giving them free rein, which is great for something that’s mostly planned by the woman. ” Many brides are pleased to see their other half’s fashion involvement. And it removes pickup,   and   pressures. “Having everyone get their suits handed to them took so much stress off of me,” the new Ms. Canfora said. “Rental is only for three days. Every day it’s late you’re charged. Because we’re a destination wedding, these guys would have had to pick it up in Florida on Thursday and drop it off on Sunday. There’s 10 guys. Do you think all 10 guys are going to drop it off? No. ” Then there is the      factor. “They’re going to forget and accidentally pack it,” Ms. Canfora added. “Even though it’s not my responsibility, I feel responsible, and I didn’t want anyone to be charged more. It’s enough that they’re paying to travel and stay in Florida. ” Bang for the buck is also a consideration. “Why rent something that doesn’t really fit for $250 to $300, which you can only wear once, when you can own a custom suit for $500, which I can wear to work or another occasion?” said Mr. Granatell, 31. Mr. Granatell and the others did indeed pay about $500 each for their custom suits. For some grooms, seeing themselves for the first time in their suits, standing in front of a mirror, with all of their friends watching and clapping, is the equivalent to a bride’s “Say Yes to the Dress” moment. “It’s like unveiling the wedding gown,” said Kendall Michaelis, a senior stylist at Knot Standard. “You’d never feel that from a rental. Rentals are not personal in any way. When they do it as a group, it’s more special and real, and this is their moment. ” Last year, the Black Tux was a mostly online rental service in Santa Monica, Calif. In April, it opened its first showroom in Chicago. Another followed in June in Santa Monica, and one in Dallas is in the works. “Groom gatherings were a   now they take place more than once a week,” said Dan Wenhold, the company’s director of retail sales. “Millennials have a desire to have a physical connection to retail and to each other. ” To meet this growing demand, the company developed a strategy. It closes early for the private parties. It serves beer or whiskey and pizza. It has hired more staff members for    with clients and added dressing rooms for simultaneous fittings. Over the next several months, Mr. Wenhold plans to add pool and shuffleboard tables and other activities  —   all of which will be free. Not everyone wants to host a party. Some men are accompanied by only their fathers or fiancées. “Few grooms will spend $1, 500 to $3, 000 for a tux,” said Ronald Rothstein, an owner of Kleinfeld Bridal, which after three years closed its men’s division last year and replaced the space with women’s shoes. “If he does, he’s going to Bergdorf or Saks. I can make $2, 000 for a tuxedo or $15, 000 on one bride’s dress. But other than the bachelor party, this is one of the only ways for men to get the same experience women do, so I understand why this has become popular. ” Rentals are a      generalized measurement item, sometimes poorly fitting and shapeless. “In the past, I went on my own to the Men’s Wearhouse or Joseph Bank, which are all the same,” Mr. Canfora said. “You open a contract, you get fitted and you leave. You never see your tux until you pick it up. And it’s all the same tux wherever you go to pick it up: New Jersey, Seattle or Florida. It’s convenient. That’s why people do it. But there was never a level of excitement like this. This was really bonding for all of us. ” Customization allows for a number of advantages. “Everything is styled and created just for you,” Ms. Michaelis said. Knot Standard offers six price ranges, from $795 to $3, 000, paired with 20 different measurements specific to body type. “We help you pick out fabrics, colors, linings, buttons, threading, collar and pockets. ” Then there’s the opportunity for names, dates and personalized messages. “We can add your wedding date to the inside of your collar, or monogram your wedding invite inside the tux, or add a message to the waistband,” she said. “I’ve even seen short messages on the inside zipper of the pants. Everyone likes these additions. ” In the end, however, a good consumer purchase is nothing compared to the memory it creates. After Ms. Manganelli did last looks, the men lined up outside for an iPhone photo shoot. A sense of   coolness and pride encompassed them. There were slaps on the backs,   and lit cigars. “This adds to the wedding process,” Mr. Granatell said. “This suit is special. Every time I open my closet and I see the suit hanging there, I’m going to think of Mike, the wedding and this experience. When I get married, I’d want to do the same thing. Renting, you have you give it back, and then it’s gone. I’ll have this for the rest of my life. ”'"}, "time": 1742562634.3027787}