{"duration": 0.03799104690551758, "input_args": {"text": "'By Hrafnkell Haraldsson on Fri, Oct 28th, 2016 at 9:19 am With the election just 10 days away, Trump has only donated just $56m of the $100m he promised and won\\'t even invest in his own campaign Share on Twitter Print This Post \\nYou have got to wonder if the Trump campaign wishes it had spent less on hats and more on polling now, as it is revealed they had only $16M left in their war chest on October 19 compared to Clinton’s $62M. Probably not. There are always others to blame and Trump’s list of those plotting against him grows in inverse proportion to his polling numbers. \\nFrom June 2015 through September 2016, the Trump campaign, meaning Donald Trump, spent $3.2m on hats according to FEC filings . They spent just $1.8m on polling. Unsurprisingly, they are behind on polling, leading in precisely ZERO (0) polls . You want to win an election? You need sweet hats\" -Abraham Lincoln \\nTrump has spent more on hats than direct mail or polling… pic.twitter.com/4TOf5DQ1MQ \\n— Jack Minor Jr. (@jackminorjr) October 26, 2016 \\nAnd now Clinton has four times the cash. \\nAnd The Washington Post is reporting that in the first 19 days of October, Trump only raised half as much as Clinton according to campaign finance reports. His biggest day was the $11.5 million he brought in on the day his sex assault tape was released, which tells you all you need to know about his base. \\nRemember when Trump claimed he would give $100m of his own money to his campaign? Yeah, this is a guy who won’t even buy his own autographed sports memorabilia. He uses other peoples’ money for that. With the election just 10 days away, he has only donated $56m. \\nMake what you will of this, but he had been giving $2m a month to his campaign. In the first 19 days of October? Just $31k in in-kind contributions. That’s right: even Trump won’t invest in his own campaign at this point. \\nTrump pulled in $61m up to October 19, down from $100m in September. Meanwhile, the Clinton campaign has pulled in a cool $101m in that same period. She spent less than normal, $54m, but that leaves her a war chest of $153m going into the final stretch. \\nDonald Trump says he is a great businessman, yet he has spent twice as much on collateral (including hats) as he has on paying his staff. He says he gets only the best people. And he bought a lot of his #MAGA hats. His campaign site only sells 18 different styles of hat at $20 to $30 apiece. \\nAnd according to Huffington Post , The October 15 Federal Election Commission filing for Trump Make America Great Again Committee shows Trump spent $300k of donors money to buy his own book – presumably The Art of the Deal. He profited personally by doing this by way of royalty payments, and then turned around and resold autographed copies of the $22 book at $184 each. \\nHis campaign pays him to rent his own campaign headquarters, yet Trump told a crowd in Geneva, Ohio that “Hillary Clinton has never earned an honest dollar, well I think that’s really, you know…” \\nTrump is probably the first presidential nominee to try to win the White House while turning a personal profit. \\nNow it looks as though Trump has seen a point of diminishing returns. He not only did not self-fund his campaign as promised, he has barely spent half of what he said he would spend, down to almost nothing at all as defeat looms and the potential for profit evaporates. \\nFull FEC report can be found here .'"}, "time": 1742628418.5490603}