{"duration": 0.06270003318786621, "input_args": {"text": "'O’FALLON, Mo.  —   For much of the year, Democrats viewed Jason Kander as a perfect Senate candidate running in the wrong state. A charismatic former military intelligence officer and Missouri’s current secretary of state, Mr. Kander, 35, faced an entrenched Republican incumbent in a place where Donald J. Trump seemed destined to win. Then Mr. Kander released a television ad last month in which he put an   assault rifle together blindfolded while reciting a script about gun rights, and started assailing his rival, Senator Roy D. Blunt, on his lobbyist ties. Suddenly, it was game on. Mr. Kander’s poll numbers soared. So did the panic among Republicans trying to save Mr. Blunt, and possibly their Senate majority. Mr. Kander’s ascent is the starkest demonstration of the volatile and at times confounding dynamics of the battle for control of the Senate, with at least six races in a statistical dead heat just over two weeks before Election Day. Surprisingly, Democrats have improved their chances in places like Missouri and North Carolina, where they seemed to have no shot just six months ago, while they have all but given up in Ohio and pulled their money out of Florida, where prospects had seemed bright. Republicans continue to cling to hope in New Hampshire, Nevada and Pennsylvania, despite what looks like faltering support for Mr. Trump in those states. In several cases, individual state dynamics, candidate quality and a   spending spree have had as much to do with the shifting prospects as the top of the ticket. “With two weeks to go, control of the Senate is up for grabs,” said Nathan Gonzales, editor of The Rothenberg  Gonzales Political Report. “If Republicans can break even in the tossup states, they have a chance to maintain control. But if the landscape shifts just a couple of points against Republican candidates, Democrats will capture the majority. ” In perhaps the oddest quirk of a decidedly erratic year, Mr. Kander may be benefiting from Mr. Trump’s   message. Mr. Blunt, who has served in Congress since 1997 and whose family is chockablock with lobbyists, is the archetypal boogeyman Mr. Trump has attacked in his assault on Washington insiders. Mr. Kander often finds Trump and Clinton supporters at his campaign events  —   people who fight among themselves, he said, even as they share support for him. “There are people who will choose to vote for Donald Trump because they want to shake up that conversation,” Mr. Kander said in an interview in St. Louis. “They are not going to go to that next line on the ballot and vote for somebody who they know is exactly who Donald Trump is talking about. ” Until 2004, Missouri was an even more reliable presidential bellwether state than Ohio. But growing homogeneity outside its larger cities has made it more reliably Republican on the presidential level. Still, it remains a state where voters have a tendency to pick Democrats for other statewide offices. “The misconception about Missouri is that it is a red state,” said Ken Warren, a professor of political science at St. Louis University. “They don’t like Democrats at the top of the ticket because they are seen as from out of town. But most of our statewide offices are held by Democrats. ” It is a reality that Mr. Blunt seems to be just starting to confront, much to his party’s chagrin. “It’s a competitive race, like Missouri races usually are,” he said in an interview at the local Republican headquarters here, where he nibbled on a   bagel grabbed off a buffet, the sort of campaign sustenance typical of the exhausting final weeks on the road. “I’m confident of where we are. But not overly confident. ” As of   Mr. Blunt led Mr. Kander 46 percent to 44 percent, a    drop since August. Democrats need to gain five seats to retake control of the Senate  —   four if Hillary Clinton wins the presidency, which would give Tim Kaine, her vice president, a tiebreaking vote. Both parties now, surprisingly, view Missouri as a crucial state in that battle. “I’m the 51st vote,” Mr. Blunt warned a small group of female Republican voters here on Thursday, casting himself as the critical piece of a majority. “If Mrs. Clinton gets elected, the last place to have an impact on the court is the Senate,” he said, referring to the United States Supreme Court. (It actually takes 60 votes to bring a Supreme Court nomination to the Senate floor.) In an extremely costly year for Senate races over all, Missouri has become the     state, with $15 million in ads pouring into its race. Two weeks after Mr. Kander’s   gun ad in September, political action committees and other outside groups dropped more than $8 million into the state on the two candidates, quadruple what they had spent in the previous two weeks, according to filings with the Federal Election Commission. Mr. Kander has benefited from being a sui generis blend: At once, he is a   Democrat, a veteran, a   lawyer who wears the outsider label, and the opponent of an incumbent who is the embodiment of Washington longevity. He has focused on trying to turn Mr. Blunt’s experience into a liability. He has also homed in on the senator’s tangled family ties. Mr. Blunt’s wife is a lobbyist, and his three adult children are registered lobbyists as well. Mr. Kander’s ads and those of outside groups have suggested, among other things, that Mr. Blunt took votes to enrich industries that his family represented. For his part, Mr. Blunt and those groups supporting him have tried to cast Mr. Kander, who was a state representative before becoming secretary of state in 2013, as a toady for Mrs. Clinton and President Obama, who are both unpopular here. One ad shows his face morphing into theirs with the tagline: “Fresh face. Same old liberal thinking. ” “Senator Blunt genuinely sees everything through the lens of partisan politics,” Mr. Kander said. (Actually, Mr. Blunt is widely viewed as a consummate   in Congress.) Mr. Kander’s military service is a boost, too, in a state with many veterans. Mr. Blunt’s draft deferments have also come up during the campaign, and he recently brought in another Republican senator, Joni Ernst, who has served in the military, to support him at a veterans’ event. “  goes a long way here,” Professor Warren said. “Superpatriotism is a big thing in Missouri. ” Missouri’s contest is indicative of the circumstances in many Senate races. While Mr. Trump is weak in Pennsylvania, for instance, the incumbent, Senator Patrick J. Toomey, has managed to keep the race close by dint of his own record and a Democratic candidate who has been less exciting than her party anticipated. At the same time, in a battle over an open seat in Nevada, Mr. Trump has been a drag on the Republican candidate, United States Representative Joe Heck, not because Mr. Heck supports Mr. Trump but because his support for the Republican nominee has waned. “In most cases Trump is responsible” for Republican weaknesses, said Jennifer Duffy, senior editor for The Cook Political Report, “but there are quirky things going on. ” It is the sort of year that produces voters like Michael Brown, a Vietnam veteran and conservative Republican who came to a small   discussion last week with Mr. Kander in Cape Girardeau. Mr. Brown will not vote for Mr. Trump, he said, but remains undecided about the Senate race. “This year is the toughest vote I’ve ever cast,” he said.'"}, "time": 1742628442.373035}