{"duration": 0.04769015312194824, "input_args": {"text": "'BEIJING  —   Under a microscope, the tiny beetle named in honor of China’s president, Xi Jinping, looks fierce, with black, armorlike ridges and beaded antennae. Yet more important to   Wang, the   Chinese entomologist who discovered and named it, the Rhyzodiastes (Temoana) xii eats rotten wood. That makes it a fitting symbol for Mr. Xi, whose campaign against official corruption is as important for China as the beetle’s diet is for the health of its environment, Mr. Wang said in a telephone interview. “President Xi is the same. He is fighting corruption. That is so important,” said Mr. Wang, 32, who added that his discovery last year excited him so much he could not sleep at night. He not only named it for Mr. Xi but added the word “wolf” in Chinese, for good measure: 习氏狼条脊甲  —   literally, “Xi Surnamed Wolf Spine Carapace. ” (The last words indicate a beetle, which has a hard carapace, unlike the cockroach.) Mr. Wang’s taxonomic gesture seems to have irritated China’s vigilant propaganda bosses, who have moved fast to block references to the “Xi beetle” from China’s heavily censored internet. Searches for the beetle’s name on Tuesday failed to return results. A Weibo search for the name in Chinese showed the message that “due to relevant laws and policies, results for ‘Xi Surnamed Wolf Spine Carapace’ cannot be shown. ” Still, many reports were available in Chinese outside the country’s Great Firewall, meaning a growing number of people who use VPNs, or virtual private networks, could read these, too. In an email before the interview, Mr. Wang expressed concern that foreign news reports had portrayed him as “belittling” Mr. Xi by comparing him to a small insect. (The beetle is 0. 3 inches long. Mr. Xi is   .) “They know nothing about entomology or taxonomy,” he wrote, and “have no idea about the meaning of a biological name!” Indeed, some Chinese have been puzzling over the notion that a beetle could be named after their president, in a country where traditionally the leaders are shielded from criticism and anything that might be interpreted as ridicule. One website, Weiming Space, which is based in the United States but caters to Chinese around the world, even filed it under the “joke” section on Monday. With the practice of naming new species for   figures common elsewhere, Mr. Wang said he saw nothing wrong with it. Mr. Xi’s name is presented respectfully, he said: “xii,” or “xi” for Mr. Xi, adding the Latin “i,” to show a male possessive. Why isn’t it called “Xi Jinpingi”? “In Chinese, for such a famous person, it’s a bit disrespectful to use the whole name,” he said. “The surname is enough. ” Above all, Mr. Wang said he wanted to steer clear of politics. “I am crazy on insects!” he wrote in the email earlier on Tuesday. “I love them. I do not want to make any trouble!” “I like Chairman Xi. Because of him, China is getting big and strong,” he said. Like the president, “This beetle is rare, in 10 collecting trips I’ve never seen one. ” Mr. Wang is hardly the first person to name a creature after a political leader. As a post on Weiming Space noted, President Obama has had a Californian trapdoor spider named after him, the Aptostichus barackobamai. Then there’s Obamadon, an extinct, toothy lizard. Nelson Mandela had not only a sea slug named after him, but its whole genus and family, a bigger honor, the Mandelia mirocornata. Among the beetles, there is the Aegomorphus wojtylai named for Karol Wojtyla, who is perhaps better known as Pope John Paul II, and Agathidium bushi for President George W. Bush. In the 1930s, Adolf Hitler got a blind beetle that lives in caves in Slovenia, the Anophthalmus hitleri. The gesture that was meant to be an honor started last year, when a colleague of Mr. Wang’s found several specimens in the forested highlands of the island of Hainan, China’s southernmost province. “He doesn’t research beetles, he researches cockroaches, so he gave them to me,” Mr. Wang said. Careful study of the new species followed in Mr. Wang’s lab at the Czech University of Life Sciences, where Mr. Wang is a postdoctoral researcher. Then came a paper in the journal Zootaxa, dedicating the finding “to Dr. Xi Jinping, the president of the People’s Republic of China, for his leadership making our motherland stronger and stronger. ” One online commenter in China drew parallels between a nation’s status and naming privileges for discoveries. “What does beetle research have to do with the country’s strength and size?” asked echowuhao on Weiming Space, noting that for decades it was mostly foreigners who were in a position to identify and name insects. “As an undergraduate, I studied cockroach species. Before liberation”  —   the 1949 Communist revolution  —   “people naming cockroaches were mostly Japanese, and the specimens mostly were in Taiwan University. ” Taiwan was a Japanese colony before 1945. “After liberation, it was mostly foreigners’ names,” echowuhao wrote. But all this has changed. “After economic reform, our own people began to name cockroaches for themselves and their country,” echowuhao wrote. “Classifying insects, this kind of work is definitely something that only countries with spare money can afford to do. ”'"}, "time": 1742628472.632969}