{"duration": 0.19358158111572266, "input_args": {"text": "'PUEBLO, Colo.  —   After obliging a request for a selfie from a woman in the lobby, Bill Clinton left his hotel here on Friday and rode to his rally, where he made the case that Hillary Clinton cared more about restoring jobs to forgotten workers than Donald J. Trump did. Mr. Clinton said that his wife got things done, as evidenced by “a lady in a hotel lobby right here. ” “I said, ‘Who do you think we ought to elect? ’” Mr. Clinton said, supposedly recounting his conversation with the woman. “She said, ‘You don’t have to ask me that. I’m from Belfast. I remember what she did to help make the peace in Northern Ireland. ’” It was Mr. Clinton, not his wife, who played a major role in brokering a peace accord. And the woman in the lobby, Lorraine Gordon, who immigrated from Belfast and is now an American citizen, never said those things. Like so many white Americans who adored Mr. Clinton but despise his wife, Ms. Gordon and her husband have already cast their ballots for Mr. Trump. “I don’t trust Hillary,” said Ms. Gordon, 57, who added that she resented illegal immigrants because she went through a long and expensive naturalization process. Her husband, John, 62, an engineer, added that “there’ll be more jobs” with Mr. Trump in charge. Since January, Mr. Clinton has done nearly 500 public events, a good deal of them designed to capture the affection white   voters had for him and then transfer it to Mrs. Clinton. But that happens to be the demographic that constitutes Mr. Trump’s base. Indeed, the man who was arguably the greatest political mind of his era has become something of a peripheral player, even within his wife’s campaign. He has spent much of his time seeking support on the Democratic margins among those white voters he refuses to believe have abandoned him  —   and his wife  —   for good. “They took a leave of absence from normal politics because, you know, they went a long time without a raise,” Mr. Clinton explained in a brief,   interview with a reporter in the hotel lobby. “So that’s cyclical. ” Mrs. Clinton’s campaign managers and pollsters, aided by sophisticated data models and experience in the elections of 2008 and 2012, have shifted their focus away from the “Bubba” voters and to the winning Obama coalition of   young progressives and Hispanics who are powering Mrs. Clinton. And while members of his campaign say they cannot imagine a more valuable political spouse to have, in interviews as well as hacked emails released by WikiLeaks, Mr. Clinton has sometimes come off as an old master struggling to get with the new program. According to two advisers to the Clintons, who declined to be identified because they were describing internal conversations, Mr. Clinton has at times doubted the    approach of her campaign manager, Robby Mook, and has required mollifying assurances from senior staff members. Sometimes   staff members, or one of his numerous Democratic allies in the country, have gone to Mr. Clinton to complain about decisions being made by Mrs. Clinton’s top campaign officials, causing irritation all around. One of the Clinton advisers said Mr. Clinton feared that her primary opponent, Senator Bernie Sanders of Vermont, would commit voter fraud in the Iowa caucuses by busing college students into the state, and urged the campaign to divert valuable energy away from organizing and onto defense against dirty tricks. Mr. Clinton saw his wife’s coming blowout loss in New Hampshire, where his unexpectedly strong showing in 1992 helped propel him to the nomination, as a crisis that desperately needed to be staved off, despite polling that showed Mrs. Clinton would quickly rebound as the race moved to more diverse states. “He still thinks that   should be spending more time in    —   earlier in January,” his chief of staff emailed Mr. Mook last December. Mr. Clinton’s travel schedule, while robust, has operated on a second tier, with Clinton surrogates such as President Obama and his wife, Michelle, Mr. Sanders and Senator Elizabeth Warren of Massachusetts appearing in the most prime locations. At times, the campaign even seems to prefer him off the radar. Before Mrs. Clinton’s debate with Mr. Sanders in October 2015 in Nevada, Jake Sullivan, Mrs. Clinton’s top policy aide, responded to an email from Huma Abedin, her top personal aide, confirming that Mr. Clinton would be joining his wife on the plane to Las Vegas with the words, “This is not a positive development. ” Asked about Mr. Clinton’s role and standing in the campaign, his aides said his trips to Massachusetts and Missouri, both of which Mrs. Clinton narrowly won in the primaries, were based on his feedback and that the campaign’s data showed Mr. Clinton was decisive in delivering victory. And Mr. Mook said Mr. Clinton has been nothing but helpful. “He’s been an integral part of this campaign throughout,” said Mr. Mook in a statement. “Once or twice a day I’m able to get his feedback and advice, and I could not be more grateful to have someone who is at once a mentor, a political junkie and a brilliant tactician for our campaign. ” Mr. Clinton acknowledged that he was glad the campaign was finally drawing to a close but added, “I’m having a good time, as you can see. ” But it has not always seemed like much fun. One of Mr. Clinton’s closest allies said he had been demoralized by an election that had resuscitated talk of his sexual affairs, alleged and otherwise. He has generally stuck to the script but sometimes unintentionally causes trouble, as when he met with Loretta Lynch, the attorney general, on a tarmac in Phoenix, an encounter Mr. Trump has used to accuse Ms. Lynch of rigging the State Department email investigation for Mrs. Clinton. In a January email, Mr. Clinton’s press secretary, Angel Ureña, let Mrs. Clinton’s staff know that one trip by Mr. Clinton to New Hampshire had resulted in no such drama: “Fair to say we didn’t break anything. ” And on the trail, his age can show, with drifting sentences coming out of a dried mouth. At a rally at the New Belgium brewery in Fort Collins, Colo. where a propeller plane with the words “Go Trump” painted under its wings buzzed overhead, Mr. Clinton relayed how he had told hurting coal miners who disliked his wife, “You guys did well when I was president, let’s come in and talk. ” But his few applause lines came when he mentioned the Black Lives Matter movement and Mr. Sanders, and when he doled out progressive red meat about free college. In a Denver nightclub, Mr. Clinton made his case under a giant disco ball. Brooke McReynolds, 24, said she was impressed, but found his attention to the white working classes “a dying  . ” Still, she said, “He’s getting there. ” And yet when Mr. Clinton returns to form, he remains something to behold. At his Pueblo rally, Mr. Clinton had the crowd   as he lamented Mr. Trump’s degradation of politics. (“It looks more like reality TV and doesn’t do anything to change reality. ”) He got them laughing when he told men who feared a female president to get over it because when women work on weekends, “We’ll have more time to watch football. ” And a hush fell over the crowd when Mr. Clinton slipped inside the mind of the white voters who had left his family to support Mr. Trump. “Look, his base is where I grew up. I was born in Arkansas to a mother of   lineage,” Mr. Clinton said. These were good, trustworthy people, he said, “but always and forever we have been manipulated by scoundrels. ” Mr. Trump, he said, followed in a long line of exploiters who “just  —   rub  —   salt  —   in our wounds. ” A white   man standing beside his young son in the back shouted the refrain often heard at Mr. Trump’s rallies: “Lock that bitch up. ” Mr. Clinton continued as if he had not heard a thing.'"}, "time": 1742561860.039276}