{"duration": 0.05172395706176758, "input_args": {"text": "'Hollywood comedy guru Judd Apatow took on President Donald Trump, his wife Melania, and their son Barron over the weekend in an     routine. [Apatow, the   who launched Lena Dunham’s career and   HBO’s Girls, began his comedy set by describing his feelings about Trump’s election and his presidency.  When Trump was elected, Apatow said, according to the Daily Beast, he felt like “a person about to get raped, but I didn’t know how bad it would be. ” Now that Trump is president, “I feel like I’ve just been raped and I just don’t know if I’m going to get murdered. ” The comic’s crude comments came Saturday night at the Regent Theater in Los Angeles during Pete Homles’   tour to promote his new HBO series Crashing, which Apatow executive produced. Later, he aimed his   insults toward the first family. Playing on reports that Melania Trump plans to move into the White House after Barron completes the school year in New York City, Apatow said. “That’s pretty bad. ” “I mean, think about it: Hillary Clinton didn’t move out of the White House and her husband got a blowjob in it,” Apatow joked. “Every day she’s not in the White House is a day she’s not getting f*cked by Donald Trump. Wouldn’t you stay away?” Then Apatow used Barron Trump to pan the president. “He f*cking gets it,” he said of the    Trump. “You ever see the look on his face when Trump’s talking? People are like, ‘Is there something wrong with him?’ No! He knows his dad’s a f*cking asshole!” Echoing comments he made last month at the Television Critics Association press tour about how “deeply troubling” it is that the president doesn’t laugh, Apatow told the L. A. crowd, “He only laughs when he makes someone feel bad. What does he do to laugh, just go on YouTube and watch Special Olympics bloopers?” Apatow has been a fierce critic of Trump since well before Inauguration Day. The director attended at least one fundraiser for former Democratic presidential nominee Hillary Clinton during the campaign, and was one of the celebrities hosting a “  ” to benefit progressive causes during Trump’s inauguration in January.   Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742563855.58937}