{"duration": 0.21180415153503418, "input_args": {"text": "'Counselor to President Donald Trump Kellyanne Conway is firing back hard at Morning Joe hosts Mika Brzezinski and Joe Scarborough for baselessly claiming she does not actually support President Trump. [Conway said in a statement on Tuesday:  The hosts of MSNBC’s Morning Joe have become virulent critics of the President and those close to him. Ignoring insults and insinuations is a valuable skill. But when sentiments are attributed to me that are not true, it is necessary to respond. My beliefs, commitments and loyalties are plain to see. The notion that I am serving for ‘the money’ or a ‘paycheck’ is absurd. As campaign manager, I made a fraction of what other consultants have made on unsuccessful presidential campaigns. Then I walked away from dozens of opportunities for millions of dollars, and instead walked into the White House. I would do it again. It is a privilege to assist President Trump in the White House, just as it was during the campaign. I know him, I respect him, I believe in him, and I am confident in his capacity to be a transformative and successful President. Taking a moment from more important matters to respond   …    . pic. twitter.   —   Kellyanne Conway (@KellyannePolls) May 16, 2017,  Conway’s Tuesday statement comes after   attacks from Scarborough and Brzezinski on Monday morning’s program, in which they claimed that Conway —  Trump’s successful general election campaign manager —  is only in it for the money. They even claimed that Conway once said she needed “a shower” after standing up for Trump when the microphones were off during the campaign, something on which they provided no proof. “This is a woman, by the way, who came on our show during the campaign and would shill for Trump in extensive fashion and then she would get off the air, the camera would be turned off, the microphone would be taken off and she would say ‘bleeech I need to take a shower’ because she disliked her candidate so much,” Brzezinski said on Monday. “Also said, that this is just, like my summer in Europe. I’m just doing this for the money, I’ll be off this soon,” Scarborough backed up his    . “I don’t know that she ever said ‘I’m doing this for the money,’ but this is just my summer vacation, my summer in Europe. And basically, I’m gonna get through this. ” Brzezinski then finished Scarborough’s sentence for him. “But first I have to take a shower because it feels so dirty to be saying what I’m saying,” she said. “I guess she’s just used to it now. ” And Scarborough did the same for her: “And also, I thought it was very interesting, after the Access Hollywood tape came out, that’s when she started referring to Donald Trump as ‘my client,’” Scarborough said. Scarborough and Brzezinski have been roundly panned by most for the unsavory and unsubstantiated comments. Fox News’ Tucker Carlson ripped them on Monday for smearing Conway with such comments. “Many journalists believe it’s literally impossible to be unfair to Donald Trump or the people who work for him,” Carlson said in a segment on Monday evening criticizing the media for bias, and particularly ripping Brzezinski and Scarborough for this extreme bias against Conway and Trump. “Extremism in the pursuit of Trump is no vice. That’s the view in newsrooms and you hear it in conversations all around Washington, a city that voted 91 percent for Hillary Clinton last fall  …     They’ve succumbed to Trump hatred that is so intense, it has destroyed their judgment and in some cases affected their character. ” What’s more, Brzezinski’s and Scarborough’s implication that Conway was just supporting Trump for the money —  as simply a client, rather than supporting somebody and something she believes in —  is not backed up by the facts. In fact, a piece in The Atlantic of all places, in March, detailed how Conway has spent the better part of her adult life helping build out the intellectual framework of the ideology that propelled Trump to electoral success. Calling her the “unsung architect of Trumpism,” the Atlantic’s Molly Ball detailed how she was not just a television personality or spin artist or generic GOP strategist, but “a principal architect of the theory behind Trump’s winning campaign. ” Ball wrote: Years before Conway went to work on Trump’s campaign —  when she was still a midlist conservative pollster and Steve Bannon was still running Breitbart —  the two were charter members, Bannon recently told me, of the ‘cabal’ he was forming behind the scenes to upend the Republican establishment. And Conway’s ideas were the key to a major shift in the way Trump addressed immigration, which became his signature issue. One Conway poll in particular —  a   2014 messaging memo commissioned by a controversial   group —  Bannon cited as a sort of Rosetta stone of the message that powered Trump’s victory. It was, Bannon told me, a pillar of ‘the intellectual infrastructure of the populist movement that candidate Trump galvanized’ from the moment he began his candidacy in 2015. Conway, when the rest of Republicans generally speaking were marching to the tune of amnesty in the wake of Mitt Romney’s embarrassing defeat in the 2012 presidential election, went a different route. After the Senate rammed through the   “Gang of Eight” amnesty bill in 2013, and a similar push in the House was maintained through 2014, Conway —  a pollster with The Polling Company —  in August 2014 published a poll that proved the opposite of the open borders lobby’s arguments. “There was, she wrote, ‘strong consensus on many populist immigration policies,’ including enforcing current immigration law, limiting illegal immigrants’ access to welfare and work, and reducing legal immigrants’ ability to bring family members to the United States,” Ball wrote in the Atlantic. Ball continued: The issue, she wrote, should be framed in terms of ‘America First,’ and as a matter of ‘fairness   …     to   workers.’   of likely voters, she pointed out, wanted more enforcement of current immigration laws. (Most economists agree that   immigration displaces some   workers while improving the economy and creating more net jobs overall. And while majorities of voters of both parties consistently oppose deporting the undocumented en masse, majorities generally also oppose increasing the number of legal immigrants.) Conway told me her argument was intended as an explicit rebuttal to the ‘autopsy’ report. ‘Candidates had been told after 2012, because Mitt Romney only got 27 percent of the Hispanic vote, that they had to support comprehensive immigration reform,’ she told me. ‘We were telling them, ‘That’s not true. ’’    white voters, in particular, supported the idea that illegal immigration was hurting their ability to find work, she said. So, in other words, after spending a great deal of her life working on building out the intellectual framework for the ideology that led to Trump’s victory, then personally joining his campaign and helping him across the finish line, somehow to Brzezinski and Scarborough she is not sufficiently committed to the president and his agenda? That does not pass the smell test.'"}, "time": 1742564494.9310775}