{"duration": 0.07832646369934082, "input_args": {"text": "\"Videos Wikileaks: CNN’s Donna Brazile Shared More Debate Questions With Hillary Clinton We can't imagine that Bernie supporters are very happy that this is the person chosen to takeover the leadership position at the DNC after Schultz was pushed out for showing favoritism toward the Clinton campaign. | October 31, 2016 Be Sociable, Share! Democratic National Committee Chair Donna Brazile speaks during the second day of the Democratic National Convention in Philadelphia , Tuesday, July 26, 2016. \\nOver the past several weeks DNC Chair Donna Brazile has been pummeled in the media after Podesta’s emails revealed that she provided a debate question to Hillary in advance of a March 13, 2016 debate with Bernie Sanders. \\nNow, the latest WikiLeaks dump reveals that it wasn’t just a one-off thing. The following email from Brazile, sent one day prior to a March 6th debate with Bernie, shows yet another occasion of her providing an advanced peak at debate questions to the Hillary campaign. We can’t imagine that Bernie supporters are very happy that this is the person chosen to takeover the leadership position at the DNC after Schultz was pushed out for showing favoritism toward the Clinton campaign. \\nAnd, sure enough, according to the following transcript from the New York Times , Hillary was well prepared for a question from Lee-Anne Walters about lead poisoning…she even had a handy stat about 500k children having “lead in their bodies”….but those are just stats that most people have on the top of their minds. \\nCOOPER: I want to go to Lee-Anne Walters. This is Lee-Anne Walters. She was one of the first people to report problems with the water in Flint. One of her twin boys stopped growing. Her daughter lost her hair. \\n\\nShe says she’s undecided, and has a question for both of you to answer, but we’ll start with Senator Sanders. Ms. Walters? \\n\\nQUESTION: A fter my family, the city of Flint and the children in D.C. were poisoned by lead , will you make a personal promise to me right now that, as president, in your first 100 days in office, you will make it a requirement that all public water systems must remove all lead service lines throughout the entire United States, and notification made to the — the citizens that have said service lines. \\nSANDERS: I will make a personal promise to you that the EPA and the EPA director that I appoint will make sure that every water system in the United States of America is tested, and that the people of those communities know the quality of the water that they are drinking, and that we are gonna have a plan to rebuild water systems in this country that are unsafe for drinking. COOPER: Let me just point out for accuracy’s sake, there is 10 million lead service pipes delivering water to people all across this country tonight. Secretary Clinton? \\nCLINTON: Well, I agree completely. I want to go further though. I want us to have an absolute commitment to getting rid of lead wherever it is because it’s not only in water systems, it’s also in soil, and it’s in lead paint that is found mostly in older homes. That’s why 500,000 children today have lead — lead in their bodies. \\nSo, I want to do exactly what you said. We will commit to a priority to change the water systems, and we will commit within five years to remove lead from everywhere. \\nWe were making progress on this in the 1990’s. I worked with then Senator Obama to get more money, more support to do more to remove lead. \\nAnd then there is also this follow-up to a previous email in which Brazile promises even more debate questions. \\n\\nDonna Brazile was noticeably uncomfortable for every second of the following 10-minute interview with Megyn Kelly of Fox News. Kelly pushed hard on the recent Project Veritas undercover videos showing DNC operatives plotting to incite violence at Trump rallies and commit massive voter fraud and over Brazile’s leaked email showing that she provided a CNN debate question to Hillary ahead of a March 2016 debate with Bernie. Brazile tried every trick in the book to deflect and pivot but Kelly held her feet to the fire. \\nBrazile’s response on the Project Veritas videos were mostly nonsensical though she did summon the typical democrat argument that O’Keefe is a criminal and has a history of doctoring videos. But the real fireworks came when she was pressed on her leaked email revealing that she shared a debate question with Hillary in advance of a debate. \\n“ I did not receive any questions from CNN , let’s just be very clear.” \\n“First of all what information are you providing to me that will let me see what you are talking about?” \\n“ As a Christian woman I understand persecution, but I will not sit here and be persecuted because your information is totally false. ” \\n“Podesta’s emails were stolen. You’re like the thief that wants to bring into the night what you found in the gutter. ” \\n“ I am not going to try to validate falsified information. I have my documents, I have my files. \\nBecause Donna seems to be afflicted with the same disease that haunted Hillary during her tenure as Secretary of State, an awful condition the causes the host to “not recall” significant life events, below is a refresher of the email in question. \\nAnd here is a similar interview by Jordan Chariton of The Young Turks : \\nYeah, but Russia. \\nThis article originally appeared on ZeroHedge.com . Be Sociable, Share!\""}, "time": 1742561819.505207}