{"duration": 0.07557392120361328, "input_args": {"text": "'Adelson boosts Trump with $25 million to defeat Clinton \\nAmerican-Jewish billionaire Sheldon Adelson has reportedly given $25 million to a super PAC dedicated to defeating Hillary Clinton’s presidential campaign. \\nJust a couple of weeks ago Adelson was frustrated with Donald Trump’s “lack of focus” and misdirected attacks at fellow Republicans, including House Speaker Paul Ryan. However, Fox News reported Monday that the casino magnate had added $25 million to the millions he’d already donated to Trump’s campaign. The report also indicated he may give more by the end of the week. \\nHis change of heart reportedly came in the wake of FBI Director James Comey’s announcement Friday that the bureau had discovered hundreds of thousands of emails that may be relevant to the bureau’s ongoing investigation into Clinton’s possible misuse of emails, and timing may indicate that Adelson now believes the GOP candidate has a real shot at winning the election. \\nThe donation, described to Fox News as a “massive” amount of money to be spent in the final week of the campaign, was given to Future 45, a pro-Trump super PAC. Future 45’s latest ad argues that the Democratic nominee cannot be trusted with the presidency as the Clinton Foundation has received millions of dollars from regimes around the world that persecute women and minorities. \\nA source told Fox News that Adelson is considering contributing up to $25 million more as the White House race enters its final few days. \\nIn May, Adelson bucked a substantial number of Republican Jews who opposed Trump — even though by that time it was clear he would be the party’s presidential nominee — endorsing the pugnacious real estate magnate and reality TV star and appealing to other top Republican Jewish donors to follow suit. \\nThe New York Times reported at the time that Adelson was prepared to spend up to $100 million to elect Trump, a greater sum than he has invested in previous elections. \\nIn the following months, however, Adelson seemed to sour on Trump, instead focusing on congressional races amid fears of the Republicans losing control of Congress due to Trump’s weak polling numbers and numerous controversial statements. He gave at least $40 million to super PACs focused solely on the fight for Congress, and the $10 million he initially dedicated to a pro-Trump super PAC was spent only on advertising in states with competitive Senate races. \\nTrump’s campaign has been plagued by charges of anti-Semitism, racism and sexism, and the nominee has been accused of running a divisive, hate-driven campaign. \\nAdelson is a prominent donor to Jewish causes and a staunch supporter of Prime Minister Benjamin Netanyahu. Related Posts: No Related Posts The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Ian Greenhalgh on November 1, 2016, With 955 Reads Filed under Election 2016 , Politics . You can follow any responses to this entry through the RSS 2.0 . Both comments and pings are currently closed.'"}, "time": 1742561907.685683}