{"duration": 0.1220705509185791, "input_args": {"text": "'As Tatyana McFadden churned the hand rings of her racing chair, she climbed the slope of the Queensboro Bridge. Head down, legs tucked underneath, her bent elbows jutted into the air like the hind legs of a grasshopper. It was Mile 16, one of the toughest climbs of the New York City Marathon, the critical spot where triceps scream and biceps throb. “That was my golden ticket right there, Mile 16,” McFadden said after winning the women’s wheelchair race for the fifth time. “I climbed it hard and lost everyone there. ” The race was expected to be one of Sunday’s most thrilling competitions, with a field that included the top three finishers from the Rio Paralympics. There the gold medalist Zou Lihong defeated McFadden in a photo finish. But on Sunday not even a zoom lens could find Zou, who suffered a flat tire near Mile 13 and never made it to Manhattan. McFadden won in 1 hour 47 minutes 43 seconds, almost two minutes ahead of Manuela Schär, to sweep the four major marathons (Boston, London, Chicago, New York) for the fourth straight year. For those riding in the marathon’s lead car, about 15 yards ahead of McFadden, it is a race amid a race. With the trunk of the black S. U. V. open, two race officials sit with their legs splayed in front. Their only backrest is a case of Gatorade tucked behind the back seat. When McFadden gets too close to the lead car, the officials yell, “Speed it up!” When she begins to tailgate again, the driver hits the gas. McFadden’s constant companion is a cameraman sitting precariously in the sidecar of a motorcycle, his dangling arms holding a camera low. She is also flanked by several cyclists who act as bodyguards of sorts by keeping wayward pedestrians at bay. Despite the blue police tape that cordons off the course, despite the barricades and police officers at every intersection, despite the 26. 2 miles of closed city streets, some people do not seem to notice that there is a marathon going on. Twice during the race, pedestrians dart in front of McFadden’s path. At Mile 3, a woman ambles across a line painted in marathon blue near Bay Ridge Avenue. “Watch it, lady!” the officials in the lead car scream. An escort cyclist frantically blows his whistle like a traffic cop trying to prevent a   collision. The woman looks up nonchalantly as if to say, “Oh, is this a thing?” The second near miss happens just before Mile 21. A man enters the crosswalk and looks up at the traffic light  —   which means nothing on Sunday  —   before he hears: “Outta the way! Move!” Stunned, he moves back toward the sidewalk, wondering what the commotion is all about. McFadden does not notice. The view of wheelchair racers is vastly different from that of most runners. In their   chairs, their heads are down, their bodies angled forward. Their attention is inward and downward, on the marathon blue line, on the possible potholes, with the occasional glance over their shoulder to see who trails behind. McFadden does not see the Hasidic Jews walking in Williamsburg, the crayoned signs taped onto a playground fence or the   stretch of Museum Mile. She does not hear the yapping dogs and the crying child or smell the glorious aroma of bacon. “Because of the bridges, because of the corners, because of the road surfaces, New York City is definitely the toughest marathon that we do,” the wheelchair racer Josh George said. “This is one of the few races where I cross the finish line, and I think: ‘Oh, thank you for being done. Thank you that this is over.’ A lot of the other races, you finish, and it was tough, and you’re tired, but you’re not on the brink of dying. ” On the lower level of the Queensboro Bridge, the stretch of the race that is closed to spectators, the Manhattan skyline looms, but it feels like a dark, quietly rumbling tunnel. “I love that bridge,” McFadden said afterward. No one loves that bridge, which is perhaps what sets McFadden apart. Uphill climbs are her specialty. Born with spina bifida and paralyzed from the waist down, she spent six years in a Russian orphanage before being adopted by an American family. Because she had no wheelchair, she taught herself to walk using her arms. Doctors said she probably would not live long, but sports changed  —   and perhaps saved  —   her life. McFadden’s family was here, as usual, including her youngest sister, Ruthi, and her parents, Debbie McFadden and Bridget O’Shaughnessey. They had all set their phone alarms.   time: 3:45 a. m. After a glass of beet juice and an espresso, there was a   of Tatyana’s prerace playlist  —   beginning with Beyoncé’s “Run the World (Girls)” and ending with a family singalong of the Black Eyed Peas’ “I Gotta Feeling. ” Before Tatyana left for the race, she told her parents, “I have to finish what I didn’t finish in Rio. ” McFadden won six medals in Rio, including four golds, in seven events. But it was the   finish on the flat, looped marathon course that tugged at her the most. Zou’s win had stunned the field because she had raced in only one other major marathon, finishing fifth in London earlier this year. After her win in Brazil, Zou was invited by New York Road Runners to become the first Chinese professional woman in its wheelchair event. None of the other top contenders quite knew what to expect from Zou on Sunday since they had never faced her in a race with so many inclines. The first mile, on the   Bridge, is the longest and steepest hill on the course. “We lost her on the first climb,” McFadden said of Zou. So much for a rematch, or even a rival. McFadden pushed well ahead of the field at the start, before Schär, Amanda McGrory and Susannah Scaroni caught up by Mile 6 in Brooklyn. The pack stayed tight until the Ed Koch Queensboro Bridge. Koch, a former New York mayor, had a trademark line  —   “How’m I doin’?”  —   and McFadden had an answer. Just fine. She even loves the crosswind. Makes it even tougher. Here she continued to pass the elite male wheelchair racers, including her coach, Adam Bleakney, a   Paralympian. What did he say to his star racer? “Not a word,” Bleakney said. “She was going too fast. ”'"}, "time": 1742564423.5461118}