{"duration": 0.13066673278808594, "input_args": {"text": "'Not long into a raucous,     set she performed on Thursday night at Carolines on Broadway, Leslie Jones described the experience of having to explain to an elderly aunt why there were pictures of Ms. Jones’s naked body on her computer screen. The awkward conversation followed an episode from last summer, when, amid a series of online abuses that Ms. Jones suffered, her personal website was hacked and explicit images of her were posted there. “Now I got to explain this to my aunties,” said Ms. Jones, 49, a cast member from “Saturday Night Live. ” “They old, and they from civil rights. They just now getting computers. ” Slipping into the quavering voice of one of these relatives, Ms. Jones said, “She was like, ‘Was it the Klu’s Klux Klan? ’” She examined her niece’s anatomy and added, “I didn’t raise you like that. ” Ms. Jones said she answered: “Just go back to sleep, auntie. Don’t turn the computer on. ” For Ms. Jones, this set  —   the first of six she is scheduled to play at Carolines this weekend  —   seemed to cap an exuberant reassertion of her comic self (on “S. N. L. ,” at the Emmys, on Twitter) after she was the target of vicious internet attacks. Most of her   focused on drawing distinctions between the person she seems to be on television and the person she is in real life. At Carolines, Ms. Jones was louder, more playfully confrontational, even more openly libidinous and less easily embarrassed than any character she plays on “S. N. L. ” (On more than one occasion, she told the crowd, “I’m a horrible person. ”) And when she did talk about the internet harassment, Ms. Jones showed that she could still find   humor in some devastating personal circumstances. When the nude photos of her were posted online, she said, “I actually laughed. ” “I was like, they don’t understand how many people I’ve actually tried to show that to,” she added. “You really just helped a sister out. Thank you for the distribution. ” Last summer, after the release of a new “Ghostbusters” movie that   Ms. Jones with a predominantly female cast, she was bombarded on Twitter with racist and sexist insults. At one point, she wrote that she was “in a personal hell” and was stepping away from her Twitter account. Shortly after, Twitter banned Milo Yiannopoulos, the inflammatory   commentator who had been a ringleader of those attacks. The hacking of Ms. Jones’s website occurred a few weeks later, but she gradually returned to the spotlight, addressing the indignities in her barnstorming and unabashed comedy. At the Emmy Awards in September, she appeared onstage with the Ernst  Young accountants who tabulate its votes to jokingly ask for their help in protecting her online. “Y’all over here using your skills to protect best   in a French sitcom,” she said at the time. “Meanwhile, I’m   on CNN. ” In a “Saturday Night Live” monologue in October, Ms. Jones said she had not been embarrassed by the trolling or the hacking, and she taunted her internet assailants. “I am very comfortable with who I am,” she said. “I am an open book. I keep my porn in a folder labeled ‘porn. ’” This week, as Mr. Yiannopoulos, her onetime antagonist, lost a book deal and a prominent speaking gig and resigned from Breitbart News amid the furor over a past interview in which he condoned pedophilia, Ms. Jones did not gloat too much. Without mentioning Mr. Yiannopoulos by name, she wrote on her Twitter account that people were devoting too much energy to his woes. “Been done and moved on,” she wrote. “He has no space here!” In her   set, Ms. Jones urged her female audience members not to be defined by how men perceive them  —   “Own your craziness,” she told them  —   and said there was no undoing the freedoms they had won. “All women are like me now,” she said. “We make our own money. ” Wondering aloud if she would ever find true love, Ms. Jones drew connections between her single status and the political era of President Trump. “I want to be in love,” she said. “I want to do that, but it’s 2017, and we got a pig in office. The world is about to end. ” But liberals, too, could be misguided, she suggested. “If I see another    white woman from Williamsburg saying ‘black lives matter,’ I’m going to punch you in the mouth,” Ms. Jones said. “Stop doing that. ” When she observes these political protests, Ms. Jones said: “Not one black woman out there. Black woman at home watching ‘Housewives of Atlanta. ’” During a riff about rescue dogs and   pet owners who say things like “Did I rescue the dog, or did the dog rescue me?” Ms. Jones spun a wicked fantasy. “How about both of y’all get caught in a fire, and neither one of y’all get rescued?” she said. Without waiting for the laughter of her aghast crowd to subside, Ms. Jones invoked her mantra from earlier in the night. “I told you, I am horrible,” she said.'"}, "time": 1742562935.62453}