{"duration": 0.20839357376098633, "input_args": {"text": "'From a single gust of wind, Clare Hollingworth reaped the journalistic scoop of the century. Ms. Hollingworth, the undisputed doyenne of war correspondents, who died on Tuesday in Hong Kong at 105, was less than a week into her first job, as a reporter for the British newspaper The Daily Telegraph, on that windy day in 1939. Driving alone on the road from Gleiwitz, then in Germany, to Katowice, in Poland  —   a distance of less than 20 miles  —   she watched as the wind lifted a piece of the tarpaulin that had been erected on the German side to screen the valley below from view. Through the opening, Ms. Hollingworth saw, she later wrote, “large numbers of troops, literally hundreds of tanks, armored cars and field guns” concealed in the valley. She knew then that Germany was poised for a major military incursion. Hastening back across the border to the Polish side, she telephoned her editor with the news, a world exclusive. The date was Aug. 28, 1939, and her article, published the next day, would become, as the British paper The Guardian wrote in 2015, “probably the greatest scoop of modern times. ” On Sept. 1, Hitler’s forces invaded Poland, marking the start of World War II. For the next four decades, Ms. Hollingworth (who over the years contributed articles to The Telegraph, The Guardian, The International Herald Tribune and The Wall Street Journal) covered World War II from Eastern Europe, the Balkans and North Africa the Greek and Algerian civil wars hostilities between Arabs and Jews in the waning days of the British mandate in Palestine and the Vietnam War, among other conflicts. Often under fire, occasionally arrested and possessed of such a keen nose for covert information that from time to time she was accused of being a spy  —   both by local governments and by the British  —   Ms. Hollingworth was friend, or foe, to seemingly everyone in a position of power in the world at midcentury. She obtained the first interview with Mohammed Reza Pahlavi after he became the shah of Iran in 1941, and what was very likely among the last, after he was deposed by Ayatollah Ruhollah Khomeini in 1979. In 1965, wanting to cover hostilities between India and Pakistan but discovering that reporters were barred from the front, she simply secured permission from an old acquaintance, Indira Gandhi, who was then India’s minister of information and broadcasting. Ms. Hollingworth was also one of the first Western journalists to report regularly from China, opening The Telegraph’s Beijing bureau in 1973. Her other major scoops included a 1963 article for The Guardian in which she cautiously identified the British intelligence agent Kim Philby as the   “third man” in the ring of Soviet spies then known to include the Englishmen Donald Maclean and Guy Burgess. Another was a 1968 article for The Telegraph in which she reported the United States’ incipient plans for peace talks with Vietnam. (The talks opened in Paris later that year and were concluded in 1973.) Ms. Hollingworth was never so happy, she often said, as when she was roaming the world equipped with little more than a toothbrush, a typewriter and, if need be, a revolver. Embedded long before the term was applied to journalists, she slept in trucks and in trenches, at times buried up to her neck in sand for warmth on cold desert nights. She once held off an armed Algerian policeman by threatening to hit him about the head with a shoe. Had her eyesight not begun to fail some 20 years ago, it was a life, Ms. Hollingworth made clear, that she would gladly have continued to the end of her days. “I must admit that I enjoy being in a war,” she told The Telegraph in 2011, on the eve of her 100th birthday. In 1989, though nearly 80 and nominally retired, Ms. Hollingworth, attired in a safari suit, her working uniform of choice for 60 years, was spotted in Tiananmen Square shinnying up a lamppost for a bird’  view of the government’s violent crackdown against civilian protesters. She periodically slept on the floor of her home in Hong Kong well into her 90s, just to keep from going soft. Through all her travels, with all their attendant rigors, there was only one thing, Ms. Hollingworth said, that she truly could not abide. “I do not mind not washing for a week or more,” she wrote, “but I do hate getting fleas in my hair. ” Her Graham Greene existence, with its typewriter, revolver and most particularly its fleas, was a far cry from the life her conventional,   British parents had envisioned for her  —   one of quiet propriety, dutiful wifehood, charity balls and hunting. Clare Hollingworth was born on Oct. 10, 1911, in Knighton in central England, outside Leicester. As a child, she enjoyed touring the historic battlefields of England and France with her father, who ran the family’s boot and shoe factory. At her parents’ insistence, the young Ms. Hollingworth attended domestic science college in Leicester, an experience that did nothing to make the prospect of hearth and home attractive. (“Although it is useful to be able to make an omelet,” she later wrote, “my domestic science training caused me to hate having anything to do with housework. ”) Partly in deference to her upbringing, she became engaged “to a suitable young man,” though she soon broke off the engagement and further scandalized her parents by announcing her intention to become a journalist. “My mother thought journalism frightfully low, like a trade,” Ms. Hollingworth said in the 2011 interview with The Telegraph. “She didn’t believe anything journalists wrote and thought they were only fit for the tradesmen’s entrance. ” In the 1930s, Ms. Hollingworth attended the School of Slavonic and East European Studies in London and afterward studied at the University of Zagreb, then in Yugoslavia. Working for the League of Nations Union, a peace and social justice group established in Britain in 1918, she was dispatched to Warsaw. There, in early 1939, she aided thousands of refugees from the Sudetenland  —   the region of Czechoslovakia that had been annexed by the Nazis in October 1938  —   arranging travel documents that would let them cross into Poland. She wrote about their plight for small publications in Britain. The Telegraph learned of Ms. Hollingworth’s work in Poland, and on Aug. 25, 1939, while she was visiting London, it hired her as a correspondent. Assigned to cover the prelude to war in the region, she flew to Warsaw the next day. From Warsaw she traveled to Katowice, commandeering an official car from the British consul general there. It was in that car, Union Jack boldly flying, that she drove over the border, past astonished Nazi guards and into Germany on Aug. 28. Ms. Hollingworth’s scoop comprised two parts. The first was her story of Aug. 29, about the advent of war. The second was her report on the start of the war itself. Awakened by explosions at dawn on Sept. 1, Ms. Hollingworth, from her quarters in Katowice, saw German bombers overhead and the flash of artillery fire in the distance. She telephoned a friend at the British Embassy in Warsaw. “The war has begun!” she cried. “Are you sure, old girl?” he said. Her published article notwithstanding, Ms. Hollingworth later wrote, British officialdom persisted in thinking that war remained weeks away. She held the receiver out the window as German tanks roared outside. The embassy was persuaded and soon, too, was her editor. Ms. Hollingworth’s article on the start of hostilities appeared in The Telegraph the next day. Her work from this period is unbylined  —   few reporters were accorded bylines then  —   a state of affairs she pronounced as being for the best: It simultaneously spared her parents familial anxiety and social indignity. What followed was more than 40 years of chasing danger, for it was in the most dangerous places, Ms. Hollingworth often said, that the best stories lay. Traveling with British troops in North Africa, she was buried in the sands for the night when she awoke to the sounds of a German reconnaissance party. “A sneeze would have brought death to us all,” she later wrote. She held her breath in the darkness, and the party passed unseeing. In Vietnam, a sniper’s bullet narrowly missed her head. Ms. Hollingworth’s first husband, Vandeleur Robinson, whom she married in 1936, divorced her for desertion 15 years later. (“When I’m on a story, I’m on a story  —   to hell with husband, family, anyone else,” she told The Guardian in 2004.) Her second husband, Geoffrey Hoare, a journalist whom she married in the early 1950s, died in 1965. Her death was confirmed by Patrick Garrett, her grandnephew and her biographer. Her survivors include a stepdaughter, Hilary Sandre. Over time, some members of the British press grew alienated by what they saw as Ms. Hollingworth’s imperious manner. “Ms. Hollingworth’s snobberies are very tiring, her cozy relations with British embassies irritating,” the English journalist Robert Fisk wrote, reviewing her 1990 memoir, “Front Line. ” But she remained a widely admired, even venerated, figure, a recipient of the Order of the British Empire in 1982 and a perennial fixture at the Foreign Correspondents’ Club in Hong Kong, where she had made her home since the early 1980s. Her other books include “The Three Weeks’ War in Poland” (1940) “There’s a German Just Behind Me” (1942) “The Arabs and the West” (1952) and “Mao and the Men Against Him” (1985). As Ms. Hollingworth made clear in later interviews, though there was no dearth of wars to accompany her old age, she did not truly expect to be called upon to cover them. Yet to the end of her life she slept with her passport and a pair of shoes within easy reach, just in case.'"}, "time": 1742561702.2370436}