{"duration": 0.12666654586791992, "input_args": {"text": "'Donald J. Trump says the abstruse Republican delegate system distorts the will of the people. Senator Ted Cruz says the party’s nominating rules have been in place from the beginning. Mr. Cruz is right, and he may be losing the public argument anyway. With polls showing a strong preference for nominating the candidate with the most popular votes  —   even if he fails to secure a majority of delegates before the convention in July  —   Mr. Cruz has brushed up this week against an uncomfortable reality: His only road to victory is a messy one. As he slogs through a merciless stretch of the primary calendar, straining to pick off delegates from Northeastern voters who seem disinclined to embrace his   conservatism, Mr. Cruz, of Texas, has appeared increasingly frustrated amid questions about his path. He has lashed out at Sean Hannity of Fox News, a onetime friend in conservative news media whom Cruz allies have accused of cozying up to Mr. Trump. “I cannot help that the Donald Trump campaign does not seem capable of running a lemonade stand,” Mr. Cruz said in a radio interview Tuesday, after telling an angered Mr. Hannity that his questions about the delegate system were a concern only to “  Donald Trump supporters. ” Mr. Cruz has struggled to formulate a concise argument rebutting Mr. Trump’s claim that the top   deserves the nomination, alternately citing the number of former Republican presidential hopefuls now supporting him, general election polls and Mr. Trump’s “hard ceiling” of support. On Wednesday, Mr. Cruz told reporters at the Republican National Committee’s spring meeting in Florida that only Mr. Trump’s loyalists believed that the candidate with the most votes should be awarded the nomination. When it was pointed out that a majority of Republican voters seemed to agree  —   62 percent, according to an NBC   Street Journal poll last week  —   Mr. Cruz largely ignored that fact. “We want to win, Republicans want to win,” he said, before turning to a new talking point: Even Abraham Lincoln, the greatest Republican of them all, lagged in delegates at the outset of the party’s 1860 convention. Mr. Cruz and his aides have also chafed recently at what they view as insufficient news media attention to his success in state delegate elections  —   feats of organizational strength that have heightened his chances of beating Mr. Trump at a contested convention. (If no candidate wins 1, 237 delegates on the first convention ballot, which largely reflects the primary and caucus votes, many delegates will be unbound and able to switch on subsequent ballots.) At a rally in Maryland on Thursday, Mr. Cruz knocked the “breathless coverage” of Mr. Trump’s blowout victory in New York. “Goodness gracious!” he said, impersonating television networks. “Donald Trump won his home state!” For the most part, the Cruz campaign has dismissed concerns about the public’s perception of the nominating process, with aides questioning whether the wording of the NBC   Street Journal survey truly captured voter sentiment. Bob Vander Plaats, an Iowa religious leader and a national chairman for Mr. Cruz, said Mr. Trump’s complaints had heightened doubts about his managerial acumen. “They’re just completely irrelevant. They’re a waste of time and money,” Mr. Vander Plaats said of the polls. “It is not being stolen. Every state has their own rules. If anything, I think it’s an admission on Trump’s part that he went into a presidential campaign without understanding the rules. ” Stuart Stevens, the chief strategist for Mitt Romney in 2012, said that many aspects of the primary process  —   holding the first contests in Iowa and New Hampshire, for instance  —   would appear widely unpopular if posed to voters in a poll. “None of this tests well,” he said. “It’s like a bowling league. Do the rules of bowling make sense?” But other Republicans, even those disinclined to support Mr. Trump initially, have worried about the appearance of denying Mr. Trump the nomination on technical grounds. Anthony Scaramucci, a member of Mr. Romney’s New York finance team in 2012, said his party remained in denial about its voters’ preferences. “There’s the spirit of something, and then there’s the letter of something,” he said. “I was a Scott Walker supporter. And then I was a Jeb Bush supporter. So I feel like I have some level of credibility. Donald Trump may not have been my first choice, but if he is in fact the people’s choice, I think my establishment friends are making a very big mistake by not acknowledging that. ” Mr. Cruz, who had argued for months that he could win a majority of delegates before the summer, has bowed to the math this week, acknowledging that a convention is his only option as he seeks to keep Mr. Trump from clinching the nomination. Mr. Cruz has targeted Maryland and Pennsylvania, two of the five states that vote on Tuesday, as potential sources of delegates, and is holding rallies in both states. But his campaign views two other contests as more critical: Indiana, which votes on May 3, and California  —   “the big enchilada,” Mr. Cruz said  —   which votes on June 7, the last day of primaries. In a sign of Indiana’s importance, Mr. Cruz campaigned there Thursday, ordering a pastrami sandwich at an Indianapolis deli and quoting the movie “Hoosiers” at a state party dinner. He also met with Gov. Mike Pence. The senator has warned reporters against underestimating him. “At every stage in this primary, folks in the press have reported that we couldn’t win,” he said in Florida, “and then we won over and over and over again. ”'"}, "time": 1742563067.5969605}