{"duration": 0.10287141799926758, "input_args": {"text": "'Tasmanian Devil Milk is capable of killing the most deadly superbugs \\nThursday, October 27, 2016 by: David Gutierrez, staff writer Tags: superbugs , drug resistance , Tasmanian Devils (NaturalNews) Milk from Tasmanian devils and other marsupials may be a natural cure for antibiotic-resistant infections, suggests a study conducted by researchers from the University of Sydney and published in the journal Scientific Reports. The researchers found that the milk contains no fewer than six compounds capable of killing some of the world\\'s worst superbugs .Unlike placental mammals (including humans), which gestate their young within the mother\\'s body, marsupials give birth after just a few weeks to highly immature offspring -- mobile fetuses, essentially -- that still need to complete significant development in their mother\\'s pouch.In particular, the immune systems of newborn marsupials are highly underdeveloped. Because a marsupial\\'s pouch is a significantly less controlled environment than a placental mammal\\'s uterus, researchers wondered if newborn marsupials might need -- and get -- an extra immune boost. Six times as potent as human milk? A previous study, conducted in 2015, cataloged many of the microbes that naturally make up the microbiome of the Tasmanian devil\\'s pouch. These included several disease-causing organisms.\"There are potential pathogens present in the devil microbiome, so the fact that the under-developed young in the pouch don\\'t get sick was a clue something interesting was going on,\" co-author Emma Peel said. \"That\\'s what inspired our most recent study.\"For the new study, the researchers analyzed the Tasmanian devil\\'s genome for genes coding for antimicrobial peptides called cathelicidins. They found that Tasmanian devil milk contains six different types of cathelicidin.For comparison, human milk, with all its antimicrobial and immune-boosting properties, contains just a single cathelicidin.The researchers artificially synthesized the peptides, then tested them against several known superbugs, including methicillin-resistant Staphylococcus aureus (MRSA) and Enterococci. The peptides killed every type of microbe they were tested against. Although the researchers had expected to find some antimicrobial effect, the potency of the peptides surprised them.\"We showed that these devil peptides kill multi-drug resistant bacteria,\" Peel said, \"which is really cool.\"Many marsupials have even more cathelicidins in their milk than Tasmanian devils. Wallabies have eight, for instance, while opossums (a Western hemisphere species) have 12.Preliminary results have also shown that similar antimicrobial peptides are found in koala milk. The global threat of superbugs Although MRSA has gotten most of the media attention, other superbugs such as Enterococci can also be highly dangerous. These bacteria -- which, like MRSA, often naturally occur on or in the human body -- can cause infections at several different sites. While such infections are minor if treated, Enterococci are growing increasingly antibiotic resistant.Health experts were alarmed recently when more strains of Enterococcus started turning up resistant to the antibiotic vancomycin.\"Vancomycin is a pretty potent antibiotic and if a bug is resistant to that, then there aren\\'t a lot of drug options available to you,\" Peel said.Margaret Chan, director-general of the World Health Organization, recently called antibiotic resistance \"a fundamental threat to human health, development and security\".And the United Kingdom\\'s Review on Antimicrobial Resistance recently concluded that unless urgent action is taken to stem the spread of drug resistance , superbugs will kill 10 million people annually by 2050. That\\'s more than the combined death toll of cancer and diabetes.Shockingly, that review estimated deaths from only six varieties of superbug: Klebsiella pneumoniae, E. coli, MRSA, HIV, TB and malaria.Researchers estimate that today, superbugs kill \"only\" 700,000 people a year. The number is expected to rise so dramatically due to the spread of drug-resistance genes through microbial populations, combined with the ongoing evolution of resistance to new drugs.The Review on Antimicrobial Resistance also failed to estimate the deaths that would come from people being unable to gain medical care, such as surgery or cancer treatment, that would be lethal without the use of reliable antibiotics. Sources for this article include:'"}, "time": 1742563868.7891312}