{"duration": 0.04677987098693848, "input_args": {"text": "'Just hours before what would have been his 70th birthday, David Bowie resurfaced. A new video for one of Mr. Bowie’s final songs and a brief EP of previously released tracks were made available late on Saturday, almost exactly a year since the release of the musician’s final album, “Blackstar,” and days before the first anniversary of his death on Jan. 10. The video, for the song “No Plan,” was directed by Tom Hingston, who also worked with Mr. Bowie on videos for the songs “I’d Rather Be High (Venetian Mix)” and “Sue (Or in a Season of Crime). ” The clip features a ghostly row of television screens flashing the lyrics of Mr. Bowie’s song, which explores themes of disembodiment and confusion. Above the screens is a sign for Newton Electrical, a reference to Thomas Jerome Newton, Mr. Bowie’s character in the film “The Man Who Fell to Earth. ” That character was resurrected as the protagonist of “Lazarus,” a musical featuring Mr. Bowie’s songs that began its run in late 2015. All of the songs on the new EP were featured on the “Lazarus” cast recording released this fall. The EP, also called “No Plan,” includes “Lazarus” from “Blackstar,” as well as “No Plan,” “Killing a Little Time” and “When I Met You. ” The four songs, all of which were recorded during sessions for “Blackstar,” are Mr. Bowie’s final studio recordings. Mr. Bowie recorded “Blackstar” with the Donny McCaslin Quartet, a jazz combo he had scouted in Greenwich Village, from January to March 2014 at the Magic Shop in SoHo. In “David Bowie: The Last Five Years,” a new documentary exploring the final period of his career that was broadcast on the BBC on Saturday night, Johan Renck, the director of the “Lazarus” video, said Mr. Bowie had learned his cancer was terminal during the filming of the clip, three months before he died. Reacting to the new release on social media, fans celebrated and mourned the musician anew. “Happy Birthday, Starman,” one Twitter user wrote. “I miss you every single day. ”'"}, "time": 1742563261.740187}