{"duration": 0.09784364700317383, "input_args": {"text": "'WASHINGTON  —   The Supreme Court on Wednesday temporarily blocked a court order that had allowed a transgender boy to use the boys’ bathroom in a Virginia high school. The vote was 5 to 3, with Justice Stephen G. Breyer joining the court’s more conservative members “as a courtesy. ” He said that this would preserve the status quo until the court decided whether to hear the case. Justices Ruth Bader Ginsburg, Sonia Sotomayor and Elena Kagan dissented. The court’s order has no effect on any other case. The move came amid a national debate over transgender rights. A North Carolina law that requires transgender people to use bathrooms in government buildings that correspond with the gender listed on their birth certificates has drawn protests, boycotts and lawsuits. A directive from the Obama administration threatening schools with the loss of federal money for discrimination based on gender identity has been challenged in court by more than 20 states. The case in the Supreme Court concerns Gavin Grimm, who was born female but identifies as a male and will soon start his senior year at Gloucester High School in southeastern Virginia. For a time, school administrators allowed Mr. Grimm to use the boys’ bathroom, but the local school board adopted a policy that required students to use the bathrooms and locker rooms for their “corresponding biological genders. ” The board added that “students with gender identity issues” would be allowed to use private bathrooms. Mr. Grimm sued, and a divided panel of the United States Court of Appeals for the Fourth Circuit, in Richmond, Va. ruled the policy unlawful. A trial judge then ordered school officials to let Mr. Grimm use the boys’ bathroom. The school board has said that it will file a petition in late August asking the Supreme Court to hear its appeal. In the meantime, the board submitted an emergency application that asked the justices to let school officials continue to bar Mr. Grimm from the boys’ bathroom. The alternative, the board’s lawyers said, was harm to “the basic expectations of bodily privacy” and “severe disruption to the school in the upcoming school year. ” The American Civil Liberties Union, which represents Mr. Grimm, responded that the trial court’s order did not amount to the kind of irreparable harm that warrants a stay from the Supreme Court, as it concerned a single student in a single high school which has taken steps to increase privacy in restrooms for all students. The legal question in the case, Gloucester County School Board v. G. G. No. 16A52, is whether the Obama administration was entitled to interpret a regulation under Title IX, a 1972 law that bans discrimination “on the basis of sex” in schools that receive federal money, to ban discrimination based on gender identity. The regulation, adopted in 1975, allowed schools to provide “separate toilet, locker rooms and shower facilities on the basis of sex. ” Last year, the federal Department of Education weighed in on the Gloucester School Board’s policy, saying schools “generally must treat transgender students consistent with their gender identity. ” In May, the department issued a more general directive that said schools may lose federal money if they discriminate against transgender students. The Fourth Circuit said the 1975 regulation was ambiguous and that the department’s interpretation of it was entitled to “controlling weight. ” Under a 1997 Supreme Court decision, Auer v. Robbins, agencies’ interpretations of their own regulations are generally entitled to deference. The Auer decision has been the subject of much criticism, and several justices have urged the Supreme Court to revisit the ruling. In a dissent in May, Justice Clarence Thomas said it was “on its last gasp. ”'"}, "time": 1742562923.564575}