{"duration": 0.05008339881896973, "input_args": {"text": "'7 Things You Need To Know About Trump And Sex Slave Island By: Amanda Prestigiacomo May 9, 2016 \\nPresumptive Republican presidential nominee Donald Trump has thrown everything but the kitchen sink at Hillary Clinton when it comes to her husband\\'s escapades. \"The kitchen sink,\" in this case, is Jeffery Epstein\\'s “Sex Slave Island” and President Bill Clinton’s ties to it . \\nWhy wouldn’t Trump use this ammo? The answer is simple: Trump himself has ties to Epstein, the billionaire Democratic donor and convicted pedophile known for having under-age sex slaves on his private plane and what the media calls \"Sex Slave Island.\" \\nHere are seven connections between Trump and Epstein\\'s sex slave endeavors that you need to know about: \\n1. Trump himself has said that Epstein is “a lot of fun to be with,” adding that he admired the sex offender\\'s affinity for beautiful women “on the younger side.” \\n\"I\\'ve known Jeff for fifteen years. Terrific guy,\\'\\' Trump once said about the convicted sex offender. \"He\\'s a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side. No doubt about it -- Jeffrey enjoys his social life.\" \\n2. Trump was named in Epstein’s “little black book.” \\nEpstein’s “ little black book ” was stolen by a former employee in 2004. The book, nicknamed \"The Holy Grail\" by the employee, revealed the name of Donald Trump and listed “14 phone numbers including emergency numbers, car numbers, and numbers to Trump\\'s security guard and houseman.” \\n3. Trump has allegedly flown on Epstein’s private plane — a hot spot for under-age sex orgies. \\n“Mark Epstein, Jeffrey\\'s brother, testified in 2009 that Trump flew on Jeffrey\\'s private jet at least once,” reports VICE News . “Meanwhile, message pads [see below] from Epstein\\'s Palm Beach mansion that were seized by investigators and obtained by VICE News indicate that Trump called Epstein twice in November of 2004.” \\nEpstein’s private Boeing 727, according to one of his alleged victims, Virginia Roberts, was nicknamed the “Lolita Express.” Roberts recalled “unsavoury” sex orgies on the private plane when she was just 15 years of age with Epstein and his friends. \\n4. Both Trump and Epstein are named as sex abusers in a case with an under-aged girl. \\nRadar Online reports that a woman in California, “identified” as Katie Johnson, filed a $100 million lawsuit against Trump on April 26, accusing the real estate mogul of raping her when she was just 13 years old. \\nJohnson “claims Trump raped her when she was 13-years-old and forced her to engage in sex acts by threatening to harm her and her family,” notes The Independent UK . “She claims the alleged abuse took place over a four-month period at underage sex parties held in New York City in 1994.” Epstein was also named for alleged sexual misconduct and threats. \\nTrump’s team adamantly denies the accusation, suspecting the claim is possibly a hoax since there is allegedly “no evidence” the plaintiff “actually exists.” \\n5. Epstein admitted to knowing Trump under oath, and curiously pled the fifth to Trump attending sex parties with underage girls. \\nBack in 2010, Epstein admitted to “socializing” with Trump, but when a lawyer representing an under-aged victim of Epstein’s asked if he has “ever socialized with Donald Trump in the presence of females under the age of 18,” Epstein curiously pled the Fifth. Per Vice News : Q: Have you ever had a personal relationship with Donald Trump? A. What do you mean by \"personal relationship,\" sir? Q. Have you socialized with him? A. Yes, sir. Q. Yes? A. Yes, sir. Q. Have you ever socialized with Donald Trump in the presence of females under the age of 18? A: Though I\\'d like to answer that question, at least today I\\'m going to have to assert my Fifth, Sixth, and 14th Amendment rights, sir. \\n6. At least one of Epstein’s underage sex victims was recruited from Trump’s Mar-a-Lago — which he frequented often. \\nVirginia Roberts, an alleged victim of Epstein’s, \"was recruited to perform a massage for Epstein while working as a $9-per-hour locker room attendant at Mar-A-Lago.” \\nRoberts claims that “Epstein turned her into a ‘sex slave’ and pimped her out to various friends, including England\\'s Prince Andrew. Over the years, the passengers on Epstein\\'s jet, she said, included ‘a whole bunch of other girls, sometimes famous people, sometimes some politicians.\\'\" \\n7. Trump was subpoenaed in 2009 for his connection to Epstein’s under-age sex slave rings. Trump has denied ever being served. \\nIn 2009, Trump was subpoenaed in a case against Epstein concerning victim Virginia Roberts. Trump\\'s attorney Alan Garten said that the subpoena \"never happened.\" \\n\"There is no debate over what happened,\" said one of Roberts\\' attorneys. \"I served Mr. Trump with a subpoena for deposition in 2009. He talked to me voluntarily, and consequently we withdrew the subpoena in light of his voluntarily providing information…. I can\\'t imagine there being any dispute of any of this.\" \\nAdditionally, Garten told VICE News in January that Mr. Trump has \"no relationship\" with Epstein other than the Democratic donor frequenting Trump\\'s Mar-A-Lago. \"A lot of people hung out there, including Jeffrey Epstein,\" said Garten. \"That is the only connection.\" \\nAccording to the evidence, however, the connections with Epstein appear to go a lot deeper than that. Tags'"}, "time": 1742628543.2312176}