{"duration": 0.11879873275756836, "input_args": {"text": "'On Monday, Oct. 24, 2016, the United States (U.S.) Register of Copyrights at the Library of Congress, Maria Pallante, resigned suddenly. Pallante’s letter of resignation, leaked to “The Hollywood Reporter,” came after the newly appointed Librarian of Congress, Carla Hayden, announced that Pallante had been moved to another position, senior advisor for digital strategy. At this same time, Hayden confirmed that Karyn Temple Claggett will act as Register of Copyrights. The Register of Copyright has not been dismissed in 119 years.\\nPallante, the former U.S. Register of Copyrights at the Library of Congress, claims that she resigned suddenly because she was locked out of her computer on Monday after being demoted. The Register provides expert advice to Congress on matters concerning intellectual property. In the past, Pallante has been critical of some of the big Silicon Valley companies, such as Google, who have pushed for more lenient laws related to copyrights to music and video. This connection between Hayden’s past as an advocate for antitrust laws and the demotion of Pallante leads some to question the value of intellectual property in Washington.\\nThere are two recommendations Pallante has made to Congress that may have set her in direct opposition to Google. The first of these came in January 2016, when Pallante warned Congress that a new method of licensing music called “100 percent licensing” would be devastating for songwriters who wish to retain control over their product. The licensing scheme was proposed by Renata Hesse, a former Google antitrust attorney who has become Acting Attorney General for antitrust cases at the Department of Justice. Essentially, the rule would allow anyone with partial ownership of a song, whether it is 2 percent or 99 percent, to sell the rights to that song to a user, such as Pandora. The U.S. Copyright Office heeded Pallante’s warning and stood against the implementation of the rule.\\nA second piece of advice Pallente offered, that could have frustrated Google, relates to the Federal Communications Commission’s (FCC) desire to update CableCARD. CableCARD is a Personal Computer (PC) card device that allows consumers to watch shows digitally on their PCs, with a newer system. The industry offered an app-based solution but apparently FCC Chairman Tom Wheeler opposed this plan in favor of a plan proposed by an organization called Public Knowledge who is reportedly funded by Google. The problem, as Pallante explains, was this:\\nRather than being passive conduits. . . it seems that a broad array of the third-party devices and services would be enabled by the Proposed Rule and would essentially be given access to a valuable bundle of copyright works, and could repackage and retransmit those works for profit.\\nWhen an U.S. Register of Copyrights at the Library of Congress suddenly resigns after being locked out of her computer, questions will be asked. Librarian of Congress Hayden was only appointed to her position in mid-September by President Obama and she is wasting no time in making changes. The exact reason for moving Pallante to a new position has not been disclosed. Hayden did say on Monday in her announcement that Karyn, the new Register, “is a skilled intellectual property lawyer and manager, and I am confident she will provide excellent leadership for the Copyright Office in the interim.”\\nBy Joel Wickwire\\n(Edited by Leigh Haugh)\\nSources:\\nBillboard –100 Percent Licensing: U.S. Copyright Office Argues New Proposal Threatens Song Owners’ Rights\\nFortune –U.S. Copyright Office Is in Turmoil Amid a Firing and Lobbying Controversy\\nIP Pro –Library of Congress Appoints Register of Copyrights\\nThe Hollywood Reporter –Maria Pallante’s Departure From the Copyright Office: What It Meant and Why It Matters\\nThe Register –Murder in the Library of Congress\\nThe Register –FCC Death Vote Looms for the Golden Age of American TV\\nTop Article and Featured Image Courtesy of Daniel Wickwire – Permission to Use Granted by Photographer\\nIn-Line Image Courtesy of Peter Brantley’s Flickr Page – Creative Commons License Congress , Library of Congress , Maria Pallante'"}, "time": 1742563145.8797634}