{"duration": 0.06272292137145996, "input_args": {"text": "'On Italy’s annual Day for Life, Pope Francis pledged his support for the   movement, urging Christians to pray for unborn children in danger of being aborted. [After his weekly Angelus prayer Sunday in Saint Peter’s Square, the pontiff said that he joined the Italian Bishops in “supporting bold educational action in favor of human life. Every life is sacred!”  “Let us promote the culture of life in response to the logic of disposability and a declining population,” he said. “Let us join together and pray for babies who are in danger of being aborted, as well as for people who are at the end of life. All life is sacred!” he said. “Let no one be left alone and may love defend the meaning of life. ” Pope Francis has been a vocal critic of abortion, calling it a “horrendous crime,” similar to Mafia murders and the slaughter of the innocents by King Herod 2000 years ago. The Pope also quoted Mother Teresa on Sunday, whom he declared to be a saint last September: “Life is beauty, admire it life is life, defend it!” before adding, “both for the child about to be born, and the person who is close to death: all life is sacred!” In last fall’s canonization ceremony, Pope Francis stressed Mother Teresa’s commitment to the poorest of the poor, especially unborn children threatened by abortion. “Mother Teresa, in all aspects of her life, was a generous dispenser of divine mercy,” the Pope said in his homily before the more than 100, 000 people overflowing Saint Peter’s Square, “making herself available for everyone through her welcome and defense of human life, those unborn and those abandoned and discarded. ” “She was committed to defending life, ceaselessly proclaiming that ‘the unborn are the weakest, the smallest, the most vulnerable,’” he added. On Sunday, Francis sent a special greeting to all who work for   causes, with his wish “that they may be capable of building a society that is welcoming and worthy for every person. ” Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742562529.502601}