{"duration": 0.027309894561767578, "input_args": {"text": "'Breitbart News is the #45th most trafficked website in the United Sates, according to rankings from Amazon’s analytics company, Alexa. com. [With over two billion pageviews generated in 2016 and 45 million unique monthly visitors, Breitbart News has now surpassed Fox News (#47) Huffington Post (#50) Washington Post (#53) and Buzzfeed (#64) in traffic.   “The numbers speak for themselves,” said Breitbart News President and CEO Larry Solov. “Our 2017 global expansion strategy is hands down the most aggressive growth initiative in the history of the company. We’re making major capital investments to execute a series of new offerings —  one of which Breitbart will announce this week. ” One driver of the company’s explosive traffic trajectory has been its dominance across social media. Breitbart has the number one political Facebook and Twitter pages in the world, according to analytics giant NewsWhip. Yet unlike many competitors, says Breitbart News    Alex Marlow, the company’s primary traffic is not disproportionately beholden to social media it comes from destination traffic. “Establishment media —  the same folks who laughed off Donald Trump —  are mystified by what makes Breitbart the powerhouse we’ve become,” said Marlow. “We’ve built an authentic,   community where people come to hang out to join in the conversation that’s taking place 24 hours a day. ” Marlow added: “It’s a beautiful, loud, intensely savvy 45   community where we read    reporting devoid of establishment spin and then discuss, debate, and share what it all means with the world. ” When Breitbart relaunched its website in 2012, the publisher generated roughly 12 million pageviews a month. Today, Breitbart receives more pageviews in a single month than it previously did in an entire year. That trend is likely to continue globally. With bureaus in London, Jerusalem, Washington, California, and Texas, Breitbart is in the process of establishing news bureaus in France and Germany.'"}, "time": 1742562384.1250124}