{"duration": 0.09257245063781738, "input_args": {"text": "'By wmw_admin on July 27, 2016 Baxter Dmitry — Your News Wire.com July 25, 2016 From left to right: Hillary Clinton and Evelyn de Rothschild, Bill Clinton and Lynn Forester de Rothschild. Click to enlarge \\nThe Wikileaks classified email dumps have exposed Hillary Clinton for what she really is – a member of the infamous Rothschild family’s inner sanctum, with occultist beliefs. \\nLending further credibility to the idea that Presidents are not elected but are selected by a global shadow government, the Wikileaks email dumps expose Hillary Clinton’s close relationship with the infamous Rothschild banking family and hints for a potential Rockefeller-State partnership. \\nThe fact the mainstream media have been exposed colluding with the Clinton campaign cannot come as a surprise, considering she is the Rothschild’s selected candidate. \\nLynn Forester de Rothschild wrote an email on April 18, 2010, in which she tells Hillary she would “ love to catch up ” — and “ I remain your loyal adoring pal .” Clinton responds “ let’s make that happen ,” and signs her response, “ Much love, H .” \\nOn September 23, 2010, Clinton emailed Lynn Forester de Rothschild saying, “ I was trying to reach you to tell you and Teddy that I asked Tony Blair to go to Israel as part of our full court press on keeping the Middle East negotiations going … ” \\nRothschild responds, thanking Clinton for “ personally reaching out to us ,” and adds, “ You are the best, and we remain your biggest fans .” \\nA January 9, 2012, email discusses a meeting set to take place at Jacob Rothschild’s “ historic estate, Waddesdon .” OCCULTIST TIES Bohemian Grove gathering. Click to enlarge \\nHillary Clinton is so deeply entrenched in the elite New World Order establishment that she even bows down to Moloch, the same occultist god they perform human sacrifice rituals for at the annual Bohemian Grove meetings. \\nIn an email from August 29 2008, a senior government staffer writes to Hillary Clinton, “ With fingers crossed, the old rabbit’s foot out of the box in the attic, I will be sacrificing a chicken in the backyard to Moloch . . . ” \\nThanks to the Wikileaks Hillary Clinton Email Archive (containing 30,022 emails, free to search), we now have more concrete proof that Hillary Clinton and other globalist elites have occult ties. Nobody randomly uses Moloch in a conversation. Most people don’t even know what Moloch is. Clinton email. Click to enlarge \\nBut Bohemian Grove, the playground of the world’s most wealthy and powerful men, has been performing sacrifice rituals to Moloch since the 1800s, offering charred human flesh according to some reports. \\nGiven the reputation Bohemian Grove has for deciding the next President of the United States in the year before the election (see former Presidents Eisenhower, Nixon and Reagan, the Bush dynasty, as well as Hillary’s husband Bill Clinton), it should come as no surprise that Hillary is wriggling her way into their dark, secretive world \\nThe Bohemian Grove club might be infamously male only, but temporary exceptions have been made for women before, and as it is apparent the New World Order has decided it is in their interest to ordain Hillary as the next President then they will bend their rules to let her in. \\nThis explains why the mainstream media – and social media platforms – are working overtime to get Clinton elected. The global elites have spoken and the mainstream media has begun marching to the beat of their drum – supporting their selected candidate, and destroying the chances of anyone they see as a threat to their corrupt, elite club.'"}, "time": 1742562361.798032}