{"duration": 0.40552377700805664, "input_args": {"text": "'Louis T. McFadden \\nLouis T. McFadden \\nLouis T. McFadden was a member of the House of Representatives in the twenties and thirties. He was the chair of the House Banking and Currency Committee during the twenties. He used his position in Congress occasionally to crusade against the Federal Reserve. \"Mr. Chairman, we have in this country one of the most corrupt institutions the world has ever known. I refer to the Federal Reserve Board and the Federal reserve banks. The Federal Reserve Board, a Government board, has cheated the Government of the United States out of enough money to pay the national debt. The depredations and the iniquities of the Federal Reserve Board and the Federal reserve banks acting together have cost this country enough money to pay the national debt several times over. This evil institution has impoverished and ruined the people of the United States; has bankrupted itself, and has practically bankrupted our Government. It has done this through defects of the law under which it operates, through the maladministration of that law by the Federal Reserve Board and through the corrupt practices of the moneyed vultures who control it.\" -- Louis T. McFadden, June 10, 1932 \\nAt one point McFadden started impeachment proceedings against the entire board of the federal reserve. Not too surprisingly, there were three attempts on McFadden\\'s life, one shooting and two poisonings, the second of which was cuccessful. Although still officially declared as heart failure, newspapers of the time reported ... \"Now that this sterling American patriot has made the Passing, it can be revealed that not long after his public utterance against the encroaching powers of Judah, it became known among his intimates that he had suffered two attacks against his life. The first attack came in the form of two revolver shots fired at him from ambush as he was alighting from a cab in front of one of the Capital hotels. Fortunately both shots missed him, the bullets burying themselves in the structure of the cab. \\n\"He became violently ill after partaking of food at a political banquet at Washington. His life was only saved from what was subsequently announced as a poisoning by the presence of a physician friend at the banquet, who at once procured a stomach pump and subjected the Congressman to emergency treatment.\" \\nPresident John F. Kennedy \\nPresident John F. Kennedy \\nAs President, John F. Kennedy understood the predatory nature of private central banking. He understood why Andrew Jackson fought so hard to end the Second Bank of the United States. So Kennedy wrote and signed Executive Order 11110 which ordered the US Treasury to issue a new public currency, the United States Note. \\nKennedy\\'s United States Note - Click for larger \\nKennedy\\'s United States Notes were not borrowed from the Federal Reserve but created by the US Government and backed by the silver stockpiles held by the US Government. It represented a return to the system of economics the United States had been founded on, and was perfectly legal for Kennedy to do. All told, some four and one half billion dollars went into public circulation, eroding interest payments to the Federal Reserve and loosening their control over the nation. Five months later John F. Kennedy was assassinated in Dallas Texas, and the United States Notes pulled from circulation and destroyed (except for samples held by collectors). \\nJohn J. McCloy \\n\\nJohn J. McCloy, President of the Chase Manhattan Bank, and President of the World Bank, was named to the Warren Commission, presumably to make certain the banking dimensions behind the assassination were concealed from the public. Kennedy\\'s E.O. 11110 has never been repealed and is still in effect, although no modern President dares to use it. Almost all of the current national debt has been created since 1963. \\nAs we enter the eleventh year of what future history will most certainly describe as World War Three, we need to examine the financial dimensions behind the wars. \\nTowards the end of World War Two, when it became obvious that the allies were going to win and dictate the post war environment, the major world economic powers met at Bretton Woods, a luxury resort in New Hampshire in July of 1944, and hammered out the Bretton Woods agreement for international finance. The British Pound lost its position as the global trade and reserve currency to the US dollar (part of the price demanded by Roosevelt in exchange for the US entry into the war). Absent the economic advantages of being the world\\'s \"go-to\" currency, Britain was forced to nationalize the Bank of England in 1946. The Bretton Woods agreement, ratified in 1945, in addition to making the dollar the global reserve and trade currency, obligated the signatory nations to tie their currencies to the dollar. The nations that ratified Bretton Woods did so on two conditions. The first was that the Federal Reserve would refrain from over-printing the dollar as a means to loot real products and produce from other nations in exchange for ink and paper; basically an imperial tax. That assurance was backed up by the second requirement, which was that the US dollar would always be convertible to gold at $35 per ounce. \\nThe Bretton Woods resort, New Hampshire \\nThe Federal Reserve, being a private bank and not answerable to the US Government, did start overprinting paper dollars, and much of the perceived prosperity of the 1950s and 1960s was the result of foreign nations\\' obligations to accept the paper notes as being worth gold at the rate of $35 an ounce. Then in 1970, France looked at the huge pile of paper notes sitting in their vaults, for which real French products like wine and cheese had been traded, and notified the United States government that they would exercise their option under Bretton Woods to return the paper notes for gold at the $35 per ounce exchange rate. The United States had nowhere near the gold to redeem the paper notes. By 1966, the IMF estimated foreign central banks held $14 billion U.S. dollars, however the United States had only $3.2 billion in gold to redeem those paper notes! So on August 15th, 1971, Richard Nixon \"temporarily\" suspended the gold convertibility of the US Federal Reserve Notes. \\nNixon announces the end of gold convertability \\nLater termed the \"Nixon shock\", this move effectively ended Bretton Woods and many global currencies started to delink from the US dollar. \\nThe \"Nixon Shock\" \\nWorse, since the United States had collateralized their loans with the nation\\'s gold reserves, it quickly became apparent that the US Government did not in fact have enough gold to cover the outstanding debts. Foreign nations began to get very nervous about their loans to the US and understandably were reluctant to loan any additional money to the United States without some form of collateral. So Richard Nixon started the environmental movement, with the EPA and its various programs such as \"wilderness zones\", Roadless areas\", Heritage rivers\", \"Wetlands\", all of which took vast areas of public lands and made them off limits to the American people who were technically the owners of those lands. But Nixon had little concern for the environment and the real purpose of this land grab under the guise of the environment was to pledge those pristine lands and their vast mineral resources as collateral on the national debt. The plethora of different programs was simply to conceal the true scale of how much American land was being pledged to foreign lenders as collateral on the government\\'s debts; eventually almost 25% of the nation itself. All of this is illegal as the Enclave Clause of the Constitution limits the Federal Government to owning the land under Federal Government buildings and military bases, and that Enclave Clause was written into the Constitution by the Founding Fathers specifically to prevent the Federal Government simply seizing the land belonging to the people to sell off, pledge as collateral, or rent! \\nclick for full size image \\nWith open lands for collateral already in short supply, the US Government embarked on a new program to shore up sagging international demand for the dollar. The United States approached the world\\'s oil producing nations, mostly in the Middle East, and offered them a deal. In exchange for only selling their oil for dollars, the United States would guarantee the military safety of those oil-rich nations. The oil rich nations would agree to spend and invest their US paper dollars inside the United States, in particular in US Treasury Bonds, redeemable through the slave labor of future generations of US taxpayers. The concept was labeled the \"petrodollar\". In effect, the US, no longer able to back the dollar with gold, was now backing it with oil. Other peoples\\' oil. And that necessity to keep control over those oil nations to prop up the dollar has shaped America\\'s foreign policy in the region ever since. \\nBut as America\\'s manufacturing and agriculture has declined, the oil producing nations faced a dilemma. Those piles of US Federal Reserve notes were not able to purchase much from the United States because the United States had little (other than real estate) anyone wanted to buy. Europe\\'s cars and aircraft were superior and less costly, while experiments with GMO food crops led to nations refusing to buy US food exports. Israel\\'s constant belligerence against its neighbors caused them to wonder if the US could actually keep their end of the petrodollar arrangement. Oil producing nations started to talk of selling their oil for whatever currency the purchasers chose to use. \\nSaddam Hussein and the lie of Iraq\\'s nuclear weapons \\nSaddam Hussein \\nIraq, already hostile to the United States following Desert Storm, demanded the right to sell their oil for Euros in 2000 and in 2002, the United Nations agreed to allow it under the \"Oil for food\" program instituted following Desert Storm. One year later the United States re-invaded Iraq under the lie of Saddam\\'s nuclear weapons, lynched Saddam Hussein, and placed Iraq\\'s oil back on the world market only for US dollars. \\nThe clear US policy shift following 9-11, away from being an impartial broker of peace in the Mideast to one of unquestioned support for Israel\\'s aggressions only further eroded confidence in the Petrodollar deal and even more oil producing nations started openly talking of oil trade for other global currencies. \\nGaddafi and the Gold Dinar \\nGaddafi \\nOver in Libya, Muammar Gaddafi had instituted a state-owned central bank and a value based trade currency, the Gold Dinar. \\nThe Gold Dinar \\nGaddafi announced that Libya\\'s oil was for sale, but only for the Gold Dinar. Other African nations, seeing the rise of the Gold Dinar and the Euro, even as the US dollar continued its inflation-driven decline, flocked to the new Libyan currency for trade. This move had the potential to seriously undermine the global hegemony of the dollar. French President Nicolas Sarkozy reportedly went so far as to call Libya a “threat” to the financial security of the world. So, the United States invaded Libya, brutally murdered Qaddafi ( the object lesson of Saddam\\'s lynching not being enough of a message, apparently), imposed a private central bank, and returned Libya\\'s oil output to dollars only. The gold that was to have been made into the Gold Dinars, 144 tons of it, is as of last report, unaccounted for. \\nUPDATE: Emails surfacing as part of the investigation into Hilary Clinton\\'s use of a private email server for classified information CONFIRM that the real reason for the US invasion of Libya was to destroy the threat of the Gold Dinar becoming a pan-African currency, displacing the dollar! \\nGeneral Wesley Clark blows the whistle on US plans to conquer the oil-rich Middle East \\nAccording to General Wesley Clark, the master plan for the \"dollarification\" of the world\\'s oil nations included seven targets, Iraq, Syria, Lebanon, Libya, Somalia, Sudan, and Iran (Venezuela, which dared to sell their oil to China for the Yuan, is a late addition). What is notable about the original seven nations originally targeted by the US is that none of them are members of the Bank for International Settlements, the private central bankers private central bank, located in Switzerland. This meant that these nations were deciding for themselves how to run their nations\\' economies, rather than submit to the international private banks. \\nUPDATE: Emails from Secretary of State Hillary Clinton released as part of the Benghazi investigation confirm that the true motive for the attack on Libya was to control the Libyan oil reserves and to destroy Libya\\'s gold-backed currency. \\nNow the bankers\\' gun sights are on Iran, which dares to have a government central bank and sell their oil for whatever currency they choose. The war agenda is, as always, to force Iran\\'s oil to be sold only for US dollars and to force them to accept a privately owned central bank. Malaysia, one of the few remaining nations without a Rothschild central bank, is now being invaded by a force claimed to be \"Al Qaeda\" and has suffered numerous suspicious losses of its commercial passenger jets. \\nWith the death of President Hugo Chavez, plans to impose a US and banker friendly regime on Venezuela are clearly being implemented. \\nSo, just where is the gold? \\nGermany\\'s gold bullion. Where is it? \\nThe German government recently asked for the return of some of their gold bullion from the Bank of France and the New York Federal Reserve. France has said it will take 5 years to return Germany\\'s gold. The United States has said they will need 8 years to return Germany\\'s gold. This suggests strongly that the Bank of France and the NY Federal Reserve have used the deposited gold for other purposes, most likely to cover gold futures contracts used to artificially suppress the price of gold to keep investors in the equities markets, and the Central Banks are scrambling to find new gold to cover the shortfall and prevent a gold run. So it is inevitable that suddenly France invades Mali, ostensibly to combat Al Qaeda, with the US joining in. Mali just happens to be one of the world\\'s largest gold producers with gold accounting for 80% of Mali exports. War for the bankers does not get more obvious than that! \\nMexico has demanded a physical audit of their gold bullion stored at the Bank of England, and along with Venezuela\\'s vast oil reserves (larger than Saudi Arabia), Venezuela\\'s gold mines are a prize lusted after by all the Central Banks that played fast and loose with other peoples\\' gold bullion. So we can expect regime change if not outright invasion soon. \\nCan a bank foreclose on your house if they have provided nothing of real value in the mortgage? \\nA little remembered footnote in banking history occurred in December 1968. A bank was moving to foreclose on a house, and the homeowner decided to fight the foreclosure in court, arguing that contract law requires two contracting parties to agree to swap two items of value, legally called the \"consideration.\" In the case of First National Bank of Montgomery vs. Jerome Daly , Daly argued that since the bank simply wrote a number in a ledger to create the loaned money out of think air, there was no real value and therefore no legally binding consideration. The lawyers for the bank admitted that this is how the bank works. They create money out of thin air as a ledger or computer entry, which you must repay with your labor. And there was no law in 1968 that specifically gave banks the legal right to do that. Daly argued that because there was no equal consideration, the mortgage was null and void and the attempt to foreclose invalid. The jury agreed! So did Judge Mahoney, who resisted demands to over-rule the jury in favor of the bank, and wrote a simple streightforward decision that stated that there was no question that the mortgage contract was void because the claim that the bank simply made up the money out of thin air was not disputed by the bank itself. \\nJudge Mahoney was murdered with poison less than six months later, and the lawyer representing Daly was debarred. The decision in favor of Daly was then nullified on procedural grounds and the entire matter forgotten! \\nYou are BRAINWASHED! \\nYou have been raised by a public school system and media that constantly assures you that the reasons for all these wars and assassinations are many and varied. The US claims to bring democracy to the conquered lands (they haven\\'t; the usual result of a US overthrow is the imposition of a dictatorship, such as the 1953 CIA overthrow of Iran\\'s democratically elected government of Mohammad Mosaddegh and the imposition of the Shah, or the 1973 CIA overthrow of Chile\\'s democratically elected government of President Salvador Allende , and the imposition of Augusto Pinochet ), or to save a people from a cruel oppressor, revenge for 9-11, or that tired worn-out catch all excuse for invasion, weapons of mass destruction. Assassinations are always passed off as \"crazed lone nuts\" to obscure the real agenda. \\nThe real agenda is simple. It is enslavement of the people by creation of a false sense of obligation. That obligation is false because the Private Central Banking system, by design, always creates more debt than money with which to pay that debt. Private Central Banking is not science, it is a religion; a set of arbitrary rules created to benefit the priesthood, meaning the owners of the Private Central Bank. The fraud persists, with often lethal results, because the people are tricked into believing that this is the way life is supposed to be and no alternative exists or should be dreamt of. The same was true of two earlier systems of enslavement, Rule by Divine Right and Slavery, both systems built to trick people into obedience, and both now recognized by modern civilizatyion as illegitimate. Now we are entering a time in human history where we will recognize that rule by debt, or rule by Private Central Bankers issuing the public currency as a loan at interest, is equally illegitimate. It only works as long as people allow themselves to believe that this is the way life is supposed to be. \\nBut understand this above all; Private Central Banks do not exist to serve the people, the community, or the nation. Private Central Banks exist to serve their owners, to make them rich beyond the dreams of Midas and all for the cost of ink, paper, and the right bribe to the right official. \\nBehind all these wars, all these assassinations, the hundred million horrible deaths from all the wars lies a single policy of dictatorship. The private central bankers allow rulers to rule only on the condition that the people of a nation be enslaved to the private central banks. Failing that, said ruler will be killed, and their nation invaded by those other nations enslaved to private central banks. \\nThe so-called \"clash of civilizations\" we read about on the corporate media is really a war between banking systems, with the private central bankers forcing themselves onto the rest of the world, no matter how many millions must die for it. Indeed the constant hatemongering against Muslims lies in a simple fact. Like the ancient Christians (prior to the Knights Templars private banking system) , Muslims forbid usury, or the lending of money at interest. And that is the reason our government and media insist they must be killed or converted. They refuse to submit to currencies issued at interest. They refuse to be debt slaves. \\nSo off to war your children must go, to spill their blood for the money-junkies\\' gold. We barely survived the last two world wars. In the nuclear/bioweapon age, are the private central bankers willing to risk incinerating the whole planet just to feed their greed? \\nApparently so. \\nThis brings us to the current situation in the Ukraine, Russia, and China. \\nThe European Union had been courting the government of the Ukraine to merge with the EU, and more to the point, entangle their economy with the private-owned European Central Bank. The government of the Ukraine was considering the move, but had made no commitments. Part of their concern lay with the conditions in other EU nations enslaved to the ECB, notably Cyprus, Greece, Spain, and Italy. So they were properly cautious. Then Russia stepped in with a better deal and the Ukraine, exercising the basic choice all consumers have to choose the best product at the best price, dropped the EU and announced they were going to go with Russia\\'s offer. It was at that point that agents provocateurs flooded into the Ukraine, covertly funded by intelligence agency fronts like CANVAS and USAID, stirring up trouble, while the western media proclaimed this was a popular revolution. Snipers shot at people and this violence was blamed on then-President Yanukovich. However a leaked recording of a phone call between the EU\\'s Catherine Ashton and Estonia\\'s Foreign Minister Urmas Paet confirmed the snipers were working for the overthrow plotters, not the Ukrainian government. Urmas Paet has confirmed the authenticity of that phone call. \\nThis is a classic pattern of covert overthrow we have seen many times before. Since the end of WW2, the US has covertly tried to overthrow the governments of 56 nations, succeeding 25 times. Examples include the 1953 overthrow of Iran\\'s elected government of Mohammed Mossadegh and the imposition of the Shah, the 1973 overthrow of Chile\\'s elected government of Salvador Allende and the imposition of the Pinochet dictatorship, and of course, the current overthrow of Ukraine\\'s elected government of Yanukovich and the imposition of the current unelected government, which is already gutting the Ukraine\\'s wealth to hand to the western bankers. \\nBrazil, Russia, India, China, and South Africa have formed a parallel financial system called BRICS, scheduled to officially launch on January 1, 2015. As of this writing some 80 nations are ready to trade with BRICS in transactions that do not involve the US dollar. Despite US economic warfare against both Russia and China, the Ruble and Yuan are seen as more attractive for international trade and banking than the US dollar, hence the US attempt to fan the Ukraine crisis into war with Russia, and attempts to provoke North Korea as a back door to war with China. \\nClick for larger image \\nFlag waving and propaganda aside, all modern wars are wars by and for the private bankers, fought and bled for by third parties unaware of the true reason they are expected to gracefully be killed and crippled for. The process is quite simple. As soon as the Private Central Bank issues its currency as a loan at interest, the public is forced deeper and deeper into debt. When the people are reluctant to borrow any more, that is when the Keynesian economists demand the government borrow more to keep the pyramid scheme working. When both the people and government refuse to borrow any more, that is when wars are started, to plunge everyone even deeper into debt to pay for the war, then after the war to borrow more to rebuild. When the war is over, the people have about the same as they did before the war, except the graveyards are far larger and everyone is in debt to the private bankers for the next century. This is why Brown Brothers Harriman in New York was funding the rise of Adolf Hitler. \\nAs long as Private Central Banks are allowed to exist, inevitably as the night follows day there will be poverty, hopelessness, and millions of deaths in endless World Wars, until the Earth itself is sacrificed in flames to Mammon. \\nThe path to true peace on Earth lies in the abolishment of all private central banking everywhere, and a return to the state-issued value-based currencies that allow nations and people to become prosperous. \"Banks do not have an obligation to promote the public good.\" -- Alexander Dielius, CEO, Germany, Austrian, Eastern Europe Goldman Sachs, 2010 \"I am just a banker doing God\\'s work.\" -- Lloyd Blankfein, CEO, Goldman Sachs, 2009'"}, "time": 1742563307.6177533}