{"duration": 0.11412620544433594, "input_args": {"text": "'Late last year I started reading a biography of Chester A. Arthur. Quickly, I began to feel as if I’d wandered into the plot of a Philip K. Dick novel, or succumbed to an especially unnerving fever dream. The book, by Zachary Karabell, tells the story of a deeply unpopular and untrustworthy New Yorker who, against all odds, achieves the presidency. Arthur, a   emblem of the   culture of the day, was never even elected to the highest office. His ascent was made possible by Charles J. Guiteau, the man who gunned down President James Garfield in a railroad station, thus promoting Arthur from the vice presidency. To contemporaries, the situation seemed dire. Arthur’s administration surely would be defined by unprecedented greed and corruption, full of woefully underqualified appointees lacking any experience in government. Even the most optimistic American could hardly have imagined that Arthur’s presidency would be a success. But as I continued reading, I was astonished to discover that Arthur redeemed himself. He championed   reform, hobbling the “spoils system” with which he had been so closely associated. He restored faith in the presidency, and faith in what the presidency can restore in its occupants. “No man ever entered the presidency so profoundly and widely distrusted as Chester Alan Arthur,” wrote the Gilded Age journalist Alexander K. McClure, “and no one ever retired . .. more generally respected, alike by political friend and foe. ” I finished the biography in late 2016, but found myself still carrying it with me as Donald J. Trump prepared to take office. I wasn’t rereading it, not exactly. Sometimes, when my dog lingered by a particularly intriguing tree, I’d open it up to a passage I’d marked. Other times, it served as a base for my phone, as if it were in conversation with the disquieting tweets I scrolled through. And during those notably edgy moments in late January, I’d hold onto it tight, like a security blanket, or just want it nearby, so that I could occasionally tap on it like a talisman. As an American historian, I’ve long relied on presidential biographies for edification and pleasure. If I’m using biographies to write a book or an essay, I have them propped up on a stand, next to my highlighters, pencils,   Notes and paper clips. But now my work doubles as an antidepressant these books are rife with the kind of horrors that led half of the country to believe, at any given time, that they were living out the end of the American experiment. I now surround myself with presidential biographies the way I would tissues if I had the flu. There’s a stack of them next to my bed, a few by the front door and some more next to the couch. You’ll spot them on my windowsill and   table, above the fridge and in my bathroom. They’re hidden around my car, and just this morning I remembered that I’d tucked a small published conference paper on George Washington’s nationalism into the interior pocket of my North Face puffy jacket. This obsession comes with a physical cost. The tomes make the straps of my bag dig painfully into my shoulder. Even the slenderest of biographies from the Arthur Schlesinger presidential series runs around 200 pages, and a Ron Chernow joint will push past 800. There are other costs, too. Having found some solace in these countless moments of national resilience amid chaos, I find myself constantly pushing these biographies onto others, believing in their therapeutic powers, and replacing my own copies time and again. Calvin Coolidge had a major depressive episode and basically checked out, I texted a worried friend  —   but we survived, I added, asking for her address. F. D. R. was an aristocrat before he contracted polio, I told another over drinks, reluctantly sliding over a   volume about how suffering transformed him. Ronald Reagan tried and failed to do away with the Energy and Education Departments, I told an acquaintance who teaches English. I was lugging around a thick George H. W. Bush book a few months ago when I decided, on the walk to an event where I’d be speaking, against reading from the biography and instead to read a segment I’d written for my podcast, “Presidents Are People, Too!” The event’s hosts quickly cued up a recent photo of Bush and his wife, which shone behind me as I read a letter George wrote about Barbara in 1943. The audience howled at the line “she is so very young and so darn attractive. ” But they might have laughed harder at the concerned email he wrote to his eldest granddaughters when they were off on spring break, shortly after he came across what he called the “’u2009‘Wild College Women’ TV show. ” Presidential biographies don’t tell you that everything is going to be O. K. but rather that nothing was ever really O. K. to begin with. And yet, for hundreds of years, Americans have not only survived heartbreaking, backbreaking periods but also stood tall in them. My advice, for these divisive times, is to find the perspective that history gives us. The next time you feel anxious or incensed, or even if you feel hopeful and gratified, turn off the television. Close your laptop. Silence your phone. Go ahead and put it   down for the rest of the evening. Instead, choose to hang out with the likes of President Chester A. Arthur: It’s good for your health.'"}, "time": 1742562204.2116084}