{"duration": 0.06578302383422852, "input_args": {"text": "'A Vote For Hillary is a Vote For World War 3 Do you stand \"with her\" nuclear holocaust? Paul Joseph Watson - October 28, 2016 Comments \\nDo you stand “with her” nuclear holocaust? \\nHillary Clinton has vowed to use military assets against Russia if Moscow is merely suspected of having engaged in a cyber attack. \\nHillary Clinton has already proven that she is a sociopathic warmonger. Her bloodthirsty zeal to overthrow Gaddafi in Libya directly led to the rise of ISIS, the international migrant crisis and a wrecked continent. \\nIf she is elected, Hillary will push for arming jihadist rebels in Syria with even more sophisticated weaponry and a no fly zone over the country – an effective declaration of war on the Syrian government and its ally, Russia. \\nA vote for Hillary Clinton is a vote for world war three. Jill Stein: \"If Hillary gets elected, we\\'re going to war with Russia, a nuclear armed power.\" pic.twitter.com/0mp7JVSWy1 \\n— Paul Joseph Watson (@PrisonPlanet) October 19, 2016 \\nHillary Clinton is George W. Bush 2.0 – that’s why she is supported by a plethora of ‘Never Trump’ neo-cons who are salivating over the prospect of getting back into power and launching new wars of aggression. \\nExcept this time the enemy won’t be Saddam Hussein, Gaddafi or any other third world nation with a flimsy, virtually non-existent army. \\nThe enemy will be Russia – a country with a 3 million man army and a huge stockpile of nuclear weapons. \\nIt is important to not fall prey to normalcy bias. Just because there hasn’t been a major conflict in most our our lifetimes doesn’t mean it can’t happen. The history of humanity is the history of warfare. \\nA vote for Hillary is a vote for World War 3. \\nMake this message go viral by sharing this video . Because nuclear war is progressive. https://t.co/bwYbmZbkrN pic.twitter.com/90UGR46I1g \\n— Paul Joseph Watson (@PrisonPlanet) October 28, 2016 \\nSUBSCRIBE on YouTube:'"}, "time": 1742561959.8621967}