{"duration": 0.2480604648590088, "input_args": {"text": "'The future Mrs. Donald J. Trump was puzzled. She had been summoned to a lunch meeting with her    and his lawyer to review a prenuptial agreement. It required that, should the couple split, she return everything  —   cars, furs, rings  —   that Mr. Trump might give her during their marriage. Sensing her sorrow, Mr. Trump apologized, Ivana Trump later testified in a divorce deposition. He said it was his lawyer’s idea. “It is just one of those Roy Cohn numbers,” Mr. Trump told her. The year was 1977, and Mr. Cohn’s reputation was well established. He had been Senator Joseph McCarthy’s   consigliere. He had helped send the Rosenbergs to the electric chair for spying and elect Richard M. Nixon president. Then New York’s most feared lawyer, Mr. Cohn had a client list that ran the gamut from the disreputable to the  : Anthony (Fat Tony) Salerno, Claus von Bulow, George Steinbrenner. But there was one client who occupied a special place in Roy Cohn’s famously cold heart: Donald J. Trump. For Mr. Cohn, who died of AIDS in 1986, weeks after being disbarred for flagrant ethical violations, Mr. Trump was something of a final project. If Fred Trump got his son’s career started, bringing him into the family business of   rentals in Brooklyn and Queens, Mr. Cohn ushered him across the river and into Manhattan, introducing him to the social and political elite while ferociously defending him against a growing list of enemies. Decades later, Mr. Cohn’s influence on Mr. Trump is unmistakable. Mr. Trump’s wrecking ball of a presidential bid  —   the gleeful smearing of his opponents, the embracing of bluster as brand  —   has been a Roy Cohn number on a grand scale. Mr. Trump’s response to the Orlando massacre, with his ominous warnings of a terrorist attack that could wipe out the country and his conspiratorial suggestions of a Muslim fifth column in the United States, seemed to have been ripped straight out of the Cohn playbook. “I hear Roy in the things he says quite clearly,” said Peter Fraser, who as Mr. Cohn’s lover for the last two years of his life spent a great deal of time with Mr. Trump. “That bravado, and if you say it aggressively and loudly enough, it’s the truth  —   that’s the way Roy used to operate to a degree, and Donald was certainly his apprentice. ” For 13 years, the lawyer who had infamously whispered in McCarthy’s ear whispered in Mr. Trump’s. In the process, Mr. Cohn helped deliver some of Mr. Trump’s signature construction deals, sued the National Football League for conspiring against his client and countersued the federal government  —   for $100 million  —   for damaging the Trump name. One of Mr. Trump’s executives recalled that he kept an     photograph of Mr. Cohn in his office desk, pulling it out to intimidate recalcitrant contractors. The two men spoke as often as five times a day, toasted each other at birthday parties and spent evenings together at Studio 54. And Mr. Cohn turned repeatedly to Mr. Trump  —   one of a small clutch of people who knew he was gay  —   in his hours of need. When a former companion was dying of AIDS, he asked Mr. Trump to find him a place to stay. When he faced disbarment, he summoned Mr. Trump to testify to his character. Mr. Trump says the two became so close that Mr. Cohn, who had no immediate family, sometimes refused to bill him, insisting he could not charge a friend. “Roy was an era,” Mr. Trump said in an interview, reflecting on his years with Mr. Cohn. “They either loved him or couldn’t stand him, which was fine. ” Mr. Trump was asked if this reminded him of anyone. “Yeah,” he answered. “It does, come to think of it. ” The gossip columnist Cindy Adams, who knew everyone, had no idea who he was. “This kid is going to own New York someday,” Mr. Cohn told her, gesturing at a tall   bachelor at a dinner party in the early 1970s. “This is Donald Trump. ” “Yeah, so?” Ms. Adams recalled replying. Mr. Cohn, the son of a prominent New York judge, had taken an uncommon interest in Mr. Trump. The two had met not long before at a private disco called Le Club, and instantly hit it off while discussing a nettlesome obstacle for Mr. Trump. The Civil Rights Division of the Justice Department was suing him and his father, accusing them of refusing to rent to black tenants. Mr. Trump told Mr. Cohn that their lawyers were urging them to settle. “Tell them to go to hell and fight the thing in court,’” Mr. Trump later recalled Mr. Cohn advising him. Mr. Trump did just that, with Mr. Cohn as his lawyer. Not only did Mr. Cohn countersue the government for $100 million, he filed a blistering affidavit on Mr. Trump’s behalf, mocking the case. “The Civil Rights Division did not file a lawsuit,” Mr. Cohn wrote. “It slapped together a piece of paper for use as a press release. ” The Trumps ultimately settled the case by agreeing to make apartments available to minority renters, while admitting no wrongdoing. For Mr. Trump, the benefits of his new representation were obvious. Mr. Cohn was one of the most famous and feared lawyers in America. He would later appear on the cover of Esquire beneath an ironic halo, and earn a posthumous parody on “The Simpsons. ” But Mr. Cohn saw something in Mr. Trump, too. “He could sniff out a    Roy could,” said Susan Bell, Mr. Cohn’s longtime secretary. After helping convict the Rosenbergs as a young federal prosecutor and then working in Washington as a top aide to McCarthy, Mr. Cohn had returned to New York, starting a boutique practice in his shabby but elegant townhouse on East 68th Street. The division of labor in the firm was clear. “We called him the rainmaker,” said Michael Rosen, a partner who handled many of the firm’s   cases. “We did all of the grunt work, if grunt work means preparing the case and trying the case. ” Mr. Cohn lived on the third floor, often traipsing downstairs in his bathrobe well after the workday had begun and taking clients upstairs to a small sun porch. The elevator rarely worked. In the winter, the lawyers stuffed towels around the windows to keep out the cold. Parties and business meetings tended to blur, with celebrities like Andy Warhol and Estée Lauder crowding in and spilling out. “That townhouse was a workhorse,” recalled Mr. Trump, a familiar presence there himself. He and Mr. Cohn became social companions, lunching at “21” or spending evenings at Yankee Stadium in the owner’s box of Mr. Steinbrenner, another Cohn client. After Mr. Fraser entered Mr. Cohn’s life, the two were frequent dinner guests at Donald and Ivana’s Trump Tower apartment, with its   murals. They were also regulars at Mr. Trump’s box at the Meadowlands, the home of his sports team, the New Jersey Generals of the   United States Football League. Mr. Cohn was the master of ceremonies at a Trump birthday party at Studio 54 years later, Mr. Trump returned the favor with a birthday toast of his own at a party in the atrium of Trump Tower, joking that Mr. Cohn was more bark than bite. “We just tell the opposition Roy Cohn is representing me, and they get scared,” Mr. Trump said, according to a cousin of Mr. Cohn’s, David L. Marcus, who attended. “He never actually does anything. ” Among the many things Mr. Trump learned from Mr. Cohn during these years was the importance of keeping one’s name in the newspapers. Long before Mr. Trump posed as his own spokesman, passing   tidbits to gossip columnists, Mr. Cohn was known to call in stories about himself to reporters. It was also through Mr. Cohn that Mr. Trump met the political operative who has played a leading, if    role in his campaign: Roger Stone. When Mr. Stone, the roguish former Nixon adviser and master of the political dark arts, came to New York in 1979 to court support for Ronald Reagan’s presidential bid, he arrived with a box of index cards filled with the names of actors and producers. And Roy Cohn. “I made an appointment and I pitched him on Reagan, and he said, ‘You have to meet Donald and Fred Trump,’” Mr. Stone recalled in an interview. Eventually, Mr. Cohn and Mr. Trump became so inseparable that those who could not track down Mr. Cohn knew whom to call. Once, Mr. Cohn chartered a plane with friends, without Mr. Trump, trashing it during a midair party. He refused to pay. So the airline found Mr. Trump, asking if he could help. He called Mr. Cohn, more amused than concerned. “I said, ‘Roy, what are you going to do about this? I mean, you destroyed the plane,’” Mr. Trump recalled. “He said, ‘Eh, we’ll pay them someday. ’” By the time Mr. Trump started getting serious with a Czech model named Ivana Winklmayr, Mr. Cohn had become something of an expert on marriage. “It’s difficult to imagine and admit that the flush of the moment may become the flush of the toilet as the relationship goes down the tubes,” he wrote about the importance of prenuptial agreements in his book “How to Stand Up for Your Rights  —   and Win!” According to “Trump: The Greatest Show on Earth,” a book by the journalist Wayne Barrett, Mr. Cohn advised Mr. Trump against marrying Ms. Winklmayr, but insisted that if he must, there had to be a prenuptial agreement. He would handle it himself. The agreement, completed only weeks before the wedding, did not quantify Mr. Trump’s net worth  —   “impossible to accurately determine due to the illiquid nature of his holdings”  —   and took a bearish view of Mr. Trump’s earning potential and a modest view of his tastes. “Donald’s standard of living is basically simple,” it said, calling Mr. Trump’s preferred lifestyle “neither opulent nor extravagant. ” When the marriage dissolved a few years after Mr. Cohn’s death, Mrs. Trump’s lawyers charged that she had not had proper representation on the prenup. Her initial lawyer had worked for Mr. Cohn on at least one case, and was a frequent passenger on Mr. Cohn’s yacht, the Defiance. The divorce case eventually ended with a settlement. The prenup was just one of many Trump deals, some more conventional than others, in which Mr. Cohn was intimately involved. He used his connections to help Mr. Trump secure zoning variances and tax abatements critical to the construction of the Grand Hyatt Hotel and the Trump Plaza. After one Cohn coup, Mr. Trump rewarded him with a pair of   cuff links and buttons in a Bulgari box. And if Mr. Cohn did not always feel comfortable charging a friend for his services, Mr. Trump was hardly one to put up a fight. “Roy said, ‘I’ll leave it to Donald to give me what he thinks is fair,’” Mr. Fraser recalled of one lengthy Trump tax case in particular. “But, of course, Donald didn’t give him anything. ” Some work would have been difficult to bill. For instance, Mr. Cohn lobbied his friends in the Reagan White House to nominate Mr. Trump’s sister Maryanne Trump Barry to the federal bench. (Questioned last year about this, Mr. Trump said his sister “got the appointment totally on her own merit. ”) “He was a very good lawyer if he wanted to be,” Mr. Trump said in the interview. Asked about Mr. Cohn in 1980, Mr. Trump was more blunt in his assessment: “He’s been vicious to others in his protection of me. ” It started with a cut that would not stop bleeding. Mr. Cohn’s diagnosis came not long after his former companion, Russell Eldridge, had gotten his. Mr. Eldridge had spent most of his final days in a private suite overlooking Central Park in Mr. Trump’s Barbizon Plaza Hotel. Ms. Bell, Mr. Cohn’s secretary, recalled that Mr. Trump’s secretary, Norma Foerderer, had billed Mr. Cohn for the room, and later called to say that Mr. Cohn had not paid. “I said, ‘Guess what, Norma, he’s not going to,’” Ms. Bell said. “And she kind of knew it. ” Mr. Cohn remained in his townhouse. Until the end  —   and even under interrogation by Mike Wallace on “60 Minutes”  —   he insisted that he had liver cancer, not AIDS. He received experimental AZT treatments in Washington and continued working. But his clients could not help but notice that his health was deteriorating. Mr. Trump started gradually moving cases elsewhere, he said, never telling Mr. Cohn why. “There’s no reason to hurt somebody’s feelings,” he said. “He was so weak,” Mr. Trump added. “He was so weakened that he really couldn’t do it. ” Mr. Cohn never spoke about Mr. Trump’s decision, but was plainly crushed, according to Ms. Bell. She remembers it happening not gradually, but “overnight. ” Even as his health was failing, Mr. Cohn, whom government prosecutors had unsuccessfully pursued for decades on charges including conspiracy, bribery and fraud, faced a final indignity: He was facing the prospect of disbarment. Among other offenses, he was charged with coercing a dying multimillionaire client  —   during a   visit to the man’s hospital room  —   to amend his will to make Mr. Cohn an executor of his estate. The hearings were closed to the public. But true to form, Mr. Cohn, riding to the daily proceedings in a red Cadillac convertible, insisted on a spectacle, describing his accusers as “a bunch of   just out to smear me up. ” The prominent figures whom Mr. Cohn summoned to testify on his behalf included Barbara Walters and William F. Buckley Jr. And, of course, Mr. Trump. He described his friend in simple terms. “If I summed it up in one word,” Mr. Trump told the hearing panel, “I think the primary word I’d use is his loyalty. ” Gaunt, frail and besieged, Mr. Cohn nevertheless managed to attend a dinner with Mr. Fraser at    in Palm Beach, Fla. shortly after Mr. Trump purchased the property in late 1985. It was a last glimpse at his final,   project. “I made Trump successful,” he would occasionally boast, according to Mr. Marcus, Mr. Cohn’s cousin, a former journalist who chronicled Mr. Cohn’s last months for Vanity Fair. In June 1986, Mr. Cohn was disbarred for “unethical,” “unprofessional” and “particularly reprehensible” conduct. To this day, Mr. Trump rues the outcome. “They only got him because he was so sick,” Mr. Trump said in the interview. “They wouldn’t have gotten him otherwise. ” During his final days, Mr. Cohn called Mr. Trump, ostensibly for no particular reason. “It was just a call: ‘How are things going? ’” Mr. Trump recalled. “Roy was the kind of guy  —   I don’t think he ever thought he was dying, frankly. ” About a week later, in August 1986, Mr. Trump received another call. Mr. Trump hung up the phone, repeating the news to an associate in his office: Roy Cohn was dead. “I said, ‘Wow, that’s the end of a generation,’” Mr. Trump remembered. “‘That’s the end of an era. ’” Mr. Fraser inherited all of Mr. Cohn’s possessions: the townhouse, his weekend place in Greenwich, Conn. his   his private plane and much more. But the Internal Revenue Service, collecting on Mr. Cohn’s tax debts, confiscated nearly everything. He did get to keep the cuff links Mr. Trump had given Mr. Cohn. Years later, Mr. Fraser had them appraised they were knockoffs, he said. Mr. Fraser soon returned to his native New Zealand, where he now works as a conservationist at the Auckland Zoo. He has not spoken with Mr. Trump since Mr. Cohn’s death, but he has no doubt that if his former lover were still alive, he would be an enthusiastic supporter of the Trump campaign. “Having trained or mentored someone who became president,” he said, “that would have been quite exciting for Roy. ”'"}, "time": 1742561786.0917916}