{"duration": 0.06370401382446289, "input_args": {"text": "'CLEVELAND  —   In her   and slowed by injuries, Meredith McIver, a classically trained ballerina who had danced under the limelight with Balanchine and the ensembles of Broadway musicals, decided to pursue her passion for writing. She tried her hand at short stories and poems in the style of Dylan Thomas before finding work writing advertising copy. “She was always very, very interested in writing as an art form,” said an   Stephen Palitz. He said Ms. McIver brought a dancer’s discipline, precision and rigor to her work. “She’s adept at crystallizing phrases and saying things in an elegant straightforward way. ” This week, Ms. McIver returned to center stage for her writing, but not in the manner she might have hoped. “My name is Meredith McIver and I’m an   staff writer at the Trump Organization,” began an extraordinary statement she released Wednesday morning in which she took the blame for the disastrous plagiarism of Michelle Obama in Melania Trump’s   speech Monday at the Republican National Convention. In the statement, Ms. McIver, a      of several books with Donald J. Trump, said that as she and Ms. Trump were preparing her speech, Ms. Trump mentioned that she admired Mrs. Obama and read to Ms. McIver parts of the first lady’s 2008 speech at the Democratic convention. Ms. McIver said she had inadvertently left portions of the Obama speech in the final draft. “This was my mistake,” she wrote. She wrote that she had offered her resignation, but that the Trumps had rejected it. “Mr. Trump told me that people make innocent mistakes and that we learn and grow from these experiences. ” “I feel terrible for the chaos I have caused Melania and the Trumps, as well as to Mrs. Obama,” Ms. McIver wrote. “No harm was meant. ” But harm was of course done. After a Twitter user discovered the plagiarism, the story of the cribbed lines hung over the convention and eclipsed the otherwise positive response to Ms. Trump’s speech. Her husband’s warring advisers pointed fingers at one another. His family was furious. The campaign chairman said that he believed Ms. Trump wrote the speech herself, as she asserted, and that it would be “crazy” to think she would crib lines when all of America was watching. As it turned out, Ms. Trump had torn up an early version of her address done by two professional Republican speechwriters. Instead, in a campaign that blurs the lines between family, business and politics, Ms. Trump reached out to one of the most trusted people inside Trump Tower for help. Now Ms. McIver, a registered Democrat with no known political experience, is suddenly at the center of one of the biggest political stories in the country. Mr. Palitz, a lawyer who has remained friends with Ms. McIver for decades, said that knowing her generally meticulous attention to detail, “it sounds like she sort of stepped up and fell on her sword. ” It was not the first time Ms. McIver was faulted for lines she wrote for the Trumps. In a 2007 deposition, Mr. Trump was grilled over whether he had overstated his debt by billions of dollars in a couple of his   books to make his comeback seem more significant. He acknowledged the exaggeration, but the mistake, he said, was not his. “This is somebody that wrote it, probably Meredith McIver,” Mr. Trump said. The daughter of ballroom dancers, Ms. McIver, who did not respond to messages seeking comment, grew up in Northern California, before coming to New York at age 14 on a Ford Foundation scholarship for dance. She studied at the School of American Ballet, the official school of the New York City Ballet, from 1965 through 1970. She then went to dance out west, Mr. Palitz said, and enrolled at the University of Utah. An English major, she graduated magna cum laude in 1976. She returned to New York and in 1981 danced in the company of the revival of “Can Can” at the Minskoff Theater in New York. It closed after five performances. ( “Mediocre material, no matter how it’s sliced, is still mediocre material,” The New York Times wrote in its review.) She settled on the Upper West Side, and her fashionable dress, dancer’s figure and green eyes turned heads at the grocery. She traveled to the Netherlands and France. In “How to Get Rich,” which she   with Mr. Trump, she thanked Alain Bernardin, the owner of a famed Paris striptease saloon, the Crazy Horse. But dancing eventually took its toll, and after writing lyrics with Mr. Palitz, a classical guitarist, she joined her sister Karen, the art director at the advertising firm Lotas Minard Patton McIver. Around the time Karen left the firm more than a decade later, her sister entered Mr. Trump’s orbit. In 2004’s “How to Get Rich,” Mr. Trump paid tribute to his   who worked from a desk outside his office. “As you know, my door is always open, so Meredith has heard everything, and she’s taken good notes,” he wrote. “She’s done a remarkable job of helping me put my thoughts and experiences on paper. I am tremendously grateful to her. ” And Ms. McIver seemed grateful to Mr. Trump, as well as his future wife. In 2005’s “Trump: Think Like a Billionaire,” Ms. McIver, again a   took the opportunity to acknowledge “Melania Knauss for her kind assistance. ” As she had once dreamed, her name appeared on the covers of books, and she sent copies of them signed by Mr. Trump and inscribed with her own notes to friends, including Mr. Palitz. “Meredith was a   person for a lot of projects  —   I often heard her name,” said Adam Eisenstat, who wrote for a blog and online newsletter under Mr. Trump’s name for Trump University in 2005 and 2006. “Like, ‘Meredith will take care of it.’ ” Georgina Levitt, an associate publisher at Vanguard Press, which published a collection of Mr. Trump’s essays called “Think Like a Champion: An Informal Education In Business and Life” in 2010, recalled Ms. McIver  —   a voracious reader often seen with a bob haircut, tailored blazers and red lipstick  —   as a helpful liaison to Mr. Trump. “It seemed like there was a history, an element of trust between them,” Ms. Levitt said. Today, Ms. McIver is considered part of the extended Trump family. “She is terrific, she’s a terrific woman,” Mr. Trump said in an interview Wednesday. “She’s been with us a long time and she just made a mistake. ” “She came in and she said, ‘Mr. Trump, I’d like to say what happened.’ I thought it was such a nice thing. Who knew this was going to be a big story?”'"}, "time": 1742628550.7915447}