{"duration": 0.10274028778076172, "input_args": {"text": "'The Council We know that most of you feel somewhat lost, at sea, and bewildered by what you see going on around you right now. The process of dismantling all that needs to be replaced has indeed begun. The thought that this is what is happening does cross your minds from time to time, but that does not make it much easier to deal with. And telling you that we forewarned you would not serve either.\\nMuch that needed to be renewed has already been shown to you and new ways have begun to be tried. This has been very successful in places; but, as yet, this has not been given much attention. One of the things you may wish to do when success of this nature comes to your attention, is to help spread knowledge of it to the best of your ability. Your new world is being constructed by you even as the chaos appears to be on the rise.\\nWe would love to say that the worst is over. The truth, however, is that it is not. The worst is still being hidden from you. And until one sees the truth, nothing will be done to change it. That is what is happening. You need to see what is coming to the surface to be seen. Many of you already understand, but again, the understanding does not bring much comfort.\\nNow, we have titled this message ‘Tipping Point’ for a reason. It is not because you are at the tipping point. The fact is that you passed that point some time ago. You are, in fact, now past the point of no return; and the old structures, and those who uphold them, are well aware that they are fighting for their very existence. If you look at what is around you in that light, you will see it is so. They see the outcome, and they do not like it. However, giving in to a possible better way of life does not look attractive from their viewpoint. They truly have nothing, but they imagine that they have everything to lose.\\nIt is more than likely that if you are reading this, you are not under the bombs, not getting Mace in your face, and not standing in front of ‘civil’ police that look like shock troops. But all of those things exist in your world, and therefore in your field of being. You feel them. But what can you do? Is there anything you can do?\\nWell, many of you are offering support in many ways, not the least of which is your resolve, your prayer, and your intent. And that is exactly what we would advise. The problem is that you do not see the effect of that. We do. We see the changes in the energy of your world very clearly. And we are telling you now that this energy is rising. This is what you came for. This is what you are good at. And this is what you are doing. Those of you who do indeed feel the energy of Earth’s field know this. All of you could feel it if you trained yourselves to do so. But regardless of whether or not this appeals to you, we ask you to know that your efforts are working and to find every opportunity to raise the frequency that you can.\\nOne thing we will remind you of once again. It is just as important for you to keep your own energies up as it is to pray or meditate for the troubled spots that you know about. If you are not in your highest frequency, you indeed cannot help much. If you are in your highest state of love and joy, and are doing all you can to reach higher, you are making major contributions to the final outcome. Fear and darkness cannot exist in an atmosphere of unconditional love. Darkness does not exist in the presence of bright light. As one of your greatest scientists once said, “This is not philosophy, it is physics.” Dearest family, it is also alchemy. It is what changes lead into gold. Buddhists call it ‘poison into medicine’.\\nThis is what you do. It is what you do well. Pat yourselves on the back. Pat each other on the back. Take a deep breath. And do more of it.\\nThere are two published books available on Amazon that contain the collected messages received by Ron Head (that’s me). The first is The Wisdom of Michael, available HERE , and the second is It Rings True, Available HERE . A third book is being compiled now. \\nIt Rings True: Guidance from The Council It Rings True: Guidance from The Council by Ron Head\\nBy Ron Head\\nIf you are dedicated to progressing on your journey through this lifetime, this is an uplifting selection you will want to have on your bookshelf. This is Ron Head’s second book of loving, channeled messages. Another internationally well-known channel has described this book as ‘filled with gentle and oftentimes humorous, reminders for those who have or are in the process now, of awakening to their own spiritual journey’. You will find numerous messages that approach age-old topics in fresh ways. Whether you read it through from cover to cover or refer to it daily, this is one you will be glad to have.\\nAvailable on Amazon → Copyright © Ronald Head. All Rights Reserved. You may copy and redistribute this material so long as you do not alter it in any way, the content remains complete, and you include this copyright notice link: http://ronahead.com/ \\nSource: Ron Head — Oracles & Healers \\n'"}, "time": 1742563080.6000578}