{"duration": 0.051477670669555664, "input_args": {"text": "'Is De-industrialization a “Natural Phenomenon” of Developed Economies? Increasing real revenues affect people’s lifestyle choices Jörg Guido Hülsmann | Mises.org   \\nLet me first state my position and then add a few arguments to back it up. \\nEconomic growth typically entails a re-allocation of labor away from industrial production, but it does not all by itself lead to falling industrial output. The decline of industrial production in the US and France in the past thirty years is to some extent due to capital exports, but especially to government interventionism in the form of mushrooming labor, business and financial regulations, education policies, social security funding, and taxation. This decline cannot be stopped through more interventions, even if they are designed with the good intention to reindustrialize the country. \\nNow let me offer a few considerations in support of these contentions. \\nThe reallocation of labor in a growing economy results most notably from capital accumulation and from changing preferences of the working-age population. Further investments and extensions of the existing structure of production make it necessary to spend more time devising new methods, preparing industrial activity, coordinating and monitoring supply chains. Low-quality blue-collar labor diminishes, whereas there is some increase in high-quality blue-collars, but especially an increase in white-collars working in and around the supply chains. \\nIncreasing real revenues affect people’s lifestyle choices. Rather than laboring long hours that provide essentially a monetary reward, they increasingly prefer enjoyable activities that provide immediate psychological and emotional rewards. Thus the blossoming of artistic, intellectual, and scientific activities in developed countries, at the expense of traditional industrial pursuits. \\nAs a natural consequence of economic growth, therefore, industrial production declines relative to what it could be if it attracted even more people. But this does neither imply a shrinking physical industrial output, nor does it imply shrinking industrial revenues. Capital accumulation and technological progress make it possible that industry thrives even when less people have industrial employment. Germany provides an example. \\nIn the past thirty years, western capitalists have invested large amounts of capital in formerly communist countries of the East and Far East. This reallocation of capital, though beneficial from the overall point of view of the world economy, has been detrimental in the short-run to the industrial development of those western countries where the capital would otherwise have been used. \\nBut capital investments in countries such as France and the US have declined even more as a result of mushrooming government interventions. Welfare checks diminish the incentive to accept low-paying and non-gratifying industrial jobs. Massive subsidies for secondary and higher education artificially prolong schooling; reduce the supply of qualified manual labor; and create an artificial bias among the working-age population for scientific, intellectual, and artistic activities. Panoply of regulations have, on the one hand, increased the costs of doing business and, on the other hand, stimulated rent-seeking and manifold forms of evasion and regulatory arbitrage. Today they are feeding entire armies of lawyers, accountants, auditors, and financial advisors, all at the expense of ordinary business. \\nThese tendencies cannot be stopped through so-called reindustrialization policies, which boil down to even more government spending, premised on the spurious notion that irresponsible (and often also inexperienced) politicians know best how to use the available scarce resources. Such policies have utterly failed in the past (Airbus included), and will fail in the future. Genuine reindustrialization requires more oxygen for industry. It requires nothing less than a rollback of the artificial obstacles for industrial development that government interventions have created in past generations.  '"}, "time": 1742562231.4996066}