{"duration": 0.0318601131439209, "input_args": {"text": "'Subscribe \\nOne of the best things about my childhood was that I lived within walking distance of a library. It wasn’t a huge library, but it fed my hunger for escape and story. \\nBecause of this, I have a special place in my heart for librarians. I’m pretty sure I was a hella annoying kid (none of us really changes over time….we only become more fully what we are. – Anne Rice). But our librarian never let on if I annoyed her. Or maybe she was just the kind of saintly librarian who enjoyed kids who liked learning? I dunno. But we’d go and spend hours, whole days even. It was Nirvana! \\nFrom ForReadingAddicts : This is an absolutely brilliant Parody of Bohemian Rhapsody, created by the Shoalhaven Library Staff to celebrate the end of the the school year, and all I can say is….. ‘Well, that escalated! \\nIndeed. Don’t be fooled by the slow start of this video. These brainiacs drop the mic! \\nWatch: About Tiffany Willis \\nTiffany Willis is a fifth-generation Texan, a proponent of voluntary simplicity, a single mom, and the founder and editor-in-chief of Liberal America. An unapologetic member of the Christian Left, she has spent most of her career actively working with “the least of these\" -- disadvantaged and oppressed populations, the elderly, people living in poverty, at-risk youth, and unemployed people. She is a Certified Workforce Expert with the National Workforce Institute , a NAWDP Certified Workforce Development Professional, and a certified instructor for Franklin Covey\\'s 7 Habits of Highly Effective Teens . Follow her on Twitter , Facebook , or LinkedIn . She also has a grossly neglected personal blog , a Time Travel blog , a site dedicated to encouraging people to read classic literature 15 minutes a day , and a literary quotes blog that is a labor of love . Find her somewhere and join the discussion. Click here to buy Tiff a mojito. Connect'"}, "time": 1742563041.3656335}