{"duration": 0.17459940910339355, "input_args": {"text": "'\\nAs of this writing, the increased U.S. troop presence in Eastern Europe includes a battalion-sized element of American troops being emplaced in the Suwalki Gap, Polish territory that borders Lithuania in a 60-mile stretch of corridor. The Russian Defense Ministry announced that 600 Russian and Belarussian airborne troops conducted training exercises in Brest, on the Belorussian-Polish border only a few miles from where the U.S. forces are deploying in Poland. This on the heels of Britain deploying 800 men, tanks, and jets to Estonia, along with pledges of Challenger 2 tanks, APC’s (Armored Personnel Carriers), and drones. Two companies of French and Danish Soldiers will join the British in the deployment to Estonia.\\nFor the first time since 1945, Norway has violated its treaty with Russia (then the Soviet Union) not to station foreign troops on its soil. A company of U.S. Marines will soon be stationed for a 6-month deployment in Norway. The situation is heating up in Ukraine, according to a report on fort-russ.com entitled Ukraine Moves Massive Force up to Lugansk Frontline , published October 28, 2016 . The report reveals the Ukrainian Army is deploying 3,500 soldiers and 200 armored vehicles of the 15 th Motorized Infantry Brigade to Krasny Oktyabr in the district of Lugansk in Eastern Ukraine. For the first time in history, Romanian airspace is being patrolled by the RAF (Royal Air Force) of Britain.\\nIn addition, the Ukrainian National Guard is deploying a tactical company equipped with 82 mm mortars and AGS-17 auto grenade launchers, along with APC’s and missile launchers. A separate reconnaissance battalion named the “Night Shades,” a nationalist volunteer battalion will be deploying to Lugansk as well. No doubt they will receive a “warm” reception, as the fighting has been ongoing in the region for more than two years. The area is a severe flashpoint, as the separatists are ethnic Russians of Ukrainian nationality who wish to secede in the manner that Crimea did…Russia annexed them after the popular vote to leave Ukraine. Now (since December 2015) the Congress gave the green light to send weapons and munitions to Ukraine; the “holdup” is due to Obama not wanting to jeopardize the election of Hillary Clinton, as the Russians have stated weapons to Ukraine means war with the U.S. and NATO.\\nMeanwhile the Varshankya-class stealth subs are deploying into the Black Sea as the Russian fleet is moving toward Syria. The Russian and Syrian armies continue to bomb and attack the al-Nusra/Jabhat Fatah ash-Sham fighters emplaced in the city of Aleppo. The mainstream media, meanwhile, is faltering in its attempt to create a “sacred U.S.-coalition crusade” to “free the city of Mosul,” as the offensive is not working quite as planned. There are also reports that the U.S. government has plans to “navigate” Islamic terrorists from Mosul into Syria, to cause more problems for Assad and the Russians; the mainstream media is notoriously silent on the collateral damages being caused by the U.S.-led Mosul attacks, in which U.S. aircraft are supporting with bombing missions.\\nLet’s be clear on this: The U.S. is beefing up conventional forces of American troops into Eastern Europe and convincing NATO countries to augment these deployments with soldiers and equipment. The Russians have been responding with opposing counter-deployments to offset the U.S.-NATO movements. The aggressive stance is being taken by the U.S.-NATO-IMF hegemony in its military buildup in Eastern Europe and the Baltic States, the very “backyard” of Russia.\\nThe bottom line: the stage is being set to start WWIII on the slightest provocation. \\nThe domestic perspective yields that just a few weeks after the ICANN (Internet Corporation for Assigned Names and Numbers) transfer from U.S. control to (basically) the UN on October 1, 2016, the U.S. has had a DDoS (Distributed Denial of Service) attack from hackers on October 21, 2016 affecting the east and west coast of the U.S. as well as Texas and part of Europe. Just one week before, on OCtobr 13, 2016 Obama signed an Executive Order for Space Weather anomalies just “in case” some “space weather anomaly” were to cripple the power grid and electrical infrastructure of the United States.\\nSomething even worse that happened may really tie into this. \\nLast week it was reported by the U.S. Army that Major General John Rossi had committed suicide . Rossi had been slated to take over as the Commander of U.S. Army Space and Missile Defense Command, and the Army Forces Strategic Command. General Rossi was about to complete 33 years of service and was only 55 years old. He was “found” at Redstone Arsenal, and the Army just ruled it a suicide. The Daily Mail on dailymail.co.uk reported that a U.S. government official told USA Today: “It seemed that Rossi was overwhelmed by his responsibilities” as a potential reason for his suicide.\\nThe problem is, he committed suicide on July 31, 2016…and it’s taken two months for the Army to rule it as being a suicide? \\nWith the command assignment, Rossi would have been privy to every procedure and protocol to defend the United States against an ICBM (intercontinental ballistic missile) attack or an EMP (electromagnetic pulse) attack or event . He would know everything from the “top” down: that is, the Commander-in-Chief (Obama) would have to foster a one-on-one relationship with the man who would hold the key post to defending against a foreign missile attack.\\nMaybe this time the missile would not have been foreign, or if it was? It may not have been the leader of a foreign country to direct it against the United States. \\nIt is almost impossible to believe that a Major General of the United States Army just receiving a top command post, a 55-year-old soldier…a general officer…with 33 years of service, a wife, and a loving family would “off” himself because of being “overwhelmed by responsibility.” Men such as Rossi (the highest-ranking member of the military to do such a thing) do not shirk responsibility: they meet it, head on. The whole thing stinks of a purge , in the manner that the entire military of the United States has been purged of hundreds of senior General Staff officers, Admiralty, and Senior Noncommissioned Officers…replaced by “yes” men over the course of Obama’s term.\\nThe whole thing stinks of an assassination : no suicide note, no real press coverage, and nothing from his friends, family, or fellow soldiers. This occurs, and then Obama signs his Executive Order to “protect” us from the dreaded space anomaly that will take down our infrastructure. Could this have possibly been a suicide? Think of all of the heartache and grief his family is going through with his loss. What about the benefits and retirement that his family would lose with such an act? If he really committed suicide, then it was probably because he found out about something so heinous, so vile that would occur to the U.S. that he couldn’t live with it and probably couldn’t stop it.\\nBottom line: Was he terminated when he wouldn’t go along with a false flag EMP-plan conceived by Obama to take down our grid, cripple our response time, and set the stage for martial law and the suspension of all rights under the Constitution of the United States? \\nAs I have mentioned in the past, I repeat once again:\\nThe next war will be initiated by an EMP device detonated above the continental United States followed by a limited nuclear exchange and then conventional warfare. \\nI never said that it wouldn’t be Obama who initiated the EMP device, and in all probability if he doesn’t initiate it…he’ll either provoke it, allow it, or request it. We haven’t even mentioned the voting (early voting) taking place where fraud is occurring in Maryland, Virginia, Illinois, and Florida, among others. The illusion of the vote: the joke of the year, but the joke is on us.\\nAnd Obama is the joker, setting the stage for the transfer of power. That transfer is not going to occur with the losing candidate (in either case) going gently into that good night. The stage is set for a war to begin. The stage is set for a false flag operation to take down our grid. The stage is set to steal the election for Clinton or declare it null and void. Within the next few weeks, the future of the United States will be decided…with or without the consent of the governed.\\nJeremiah Johnson is the Nom de plume of a retired Green Beret of the United States Army Special Forces (Airborne). Mr. Johnson is also a Gunsmith, a Certified Master Herbalist, a Montana Master Food Preserver, and a graduate of the U.S. Army’s SERE school (Survival Evasion Resistance Escape). He lives in a cabin in the mountains of Western Montana with his wife and three cats. You can follow Jeremiah’s regular writings at SHTFplan.com or contact him here . \\nThis article may be republished or excerpted with proper attribution to the author and a link to www.SHTFplan.com . \\nRelated: \\nThe Prepper’s Blueprint: A Step-By-Step Guide To Prepare For Any Disaster \\nTop Tier Gear: The Most Advanced Tactical Gas Mask In The World \\nThe United States Is Pre-Positioning “Enemy Assets” In Preparation For A Rigged Election \\nA Foreshadowing Of Things To Come: “This Cyberattack Was Initiated By The U.S. Government… A Beta Test Done In Preparation For A False Flag” \\nUnrest and Martial Law? Leaked Military Drill Anticipates “No Rule of Law” After Election Results \\nHow To Survive Occupied America: “Red Dawn Just Started… And You’re In It” \\nThe Threat Is Real And Imminent: The Next World War Will Be Initiated By A First Strike Utilizing An EMP Weapon '"}, "time": 1742562802.373546}