{"duration": 0.1679089069366455, "input_args": {"text": "'Original unreleased transcript of Sonia Gandhi’s interview with Rajdeep Sardesai obtained Posted on Tweet (Image via mensxp.com) \\nOn November 21st, all of India was agog in anticipation of India Today TV’s major scoop. All day long, the channel kept flashing the coming face to face interview of Congress President Sonia Gandhi with Rajdeep Sardesai at 9pm. The iron lady, (a moniker she appropriated from her legendary mother in law Indira Gandhi and Margaret Thatcher) was to reveal all to the famous journalist. A quick sidebar – this may be the only known instance of a journalist becoming more famous than a former Indian Test cricketer, namely his father, the late Dilip Sardesai. \\nOnce we were well into the interview, held imaginatively at the historic Swaraj Bhavan,India’s first family’s ancestral home in Allahabad, it quickly became apparent that Sonia Gandhi will confine her views and opinions primarily to the subject of her late mother in law, her late husband and in passing, doting reflections on her children. Current politics, her own health concerns, her views on her fiery sister in law and her son – all these and other spicy ingredients were strictly off limits. The viewers were thus treated to a pleasant but immensely dull interview. We hear many viewers switched channels after 15 or 20 minutes. \\nHowever, your intrepid reporter at The UnReal Times got hold of the actual transcript of the interview, held informally, while the cameras were switched off. Here it is, exclusively for our readers. \\nRajdeep Sardesai (RS) – “Madam Sonia Gandhi, once again many thanks for speaking exclusively with India Today TV. I know you have imposed strict limitations on what I can or cannot ask you, but as they are still setting up the cameras and equipment, I thought we can let our hair down a bit, so to speak. Off camera?” \\nSonia Gandhi (SG) – “Actually, it is I who must thank you, Arnab………” \\nRS – “Rajdeep, Soniaji. Rajdeep Sardesai. Kindly do not mention that other name again, please”. \\nSG – “Oh so sorry, Rajdeep. What was I thinking of? Yes, yes, as I was saying. I am very happy to grant you this exclusive interview. My husband was a great fan of your father’s cricketing skills. Of course, I know nothing about cricket, other than the fact that New Zealand’s Daniel Vettori may be my thrice removed cousin on my mother’s side”. \\nRS – “Yes Ma’am. If it’s all the same to you, can we keep cricket out of this discussion? First I would like to ask you about your health. All kinds of rumours are floating around about your health. Not unlike the rumours about the CM of Tamil Nadu. How in fact are you?” \\nSG – “But I am sitting right here in front of you Rajdeep, large as life, speaking normally, if you discount the Italian accent which I was born with. Do you find anything wrong with me?” \\n(Just then, her personal physician arrives and administers two injections, and asks her to swallow around seven multi coloured tablets). \\nSG – “Don’t read anything into these pills and injections. My iron content is a bit low, so I have to have these supplements. Just normal stuff”. \\nRS – “I understand, Soniaji. I have high BP myself, professional hazard, and you have just reminded me. Please bear with me while I pop these pills. Thank you. Tell me Ma’am, what do you feel about our PM’s demonetization announcement. Your son and other members of the Congress party have been very vocal in their criticism”. \\nSG – “See, Rahul Baba is young and hot blooded. Boys will be boys. Speaking for myself, I cannot comment on this because I do not know what demonetization actually means. Something to do with not being able to use the old Rs.500/- and Rs.1000/- notes. But I am not worried, because two truck loads of 10, 20, 50 and 100 rupee notes were delivered to my house the previous day prior to the announcement. And I had only two old Rs.500 notes in my purse which Rahul took away to exchange from a local bank, standing in the queue for over 4 hours. Poor darling”. \\nRS – “I see, so you had prior knowledge. But is it not cumbersome to handle so many notes?” \\nSG – “You see Rajdeep, I am getting used to your name now, in my home country Italy, when the Euro suddenly replaced the Lira, where 1 Euro was equal to a million Lire, things got a bit confusing, but we eventually mastered it. So I can handle all this small note problems”. \\nRS – “Turning to other matters. The country wants to know when you will make way for Rahul to ascend your throne as head of the Congress Party. Can you give us an insight?” \\nSG – “Insight? Why do you use such big words? Anyway, I will tell you. Firstly, why is the media so interested in this matter? In the UK, the Queen will soon be 100 years old, and she is still firmly occupying the throne. Poor Charles is almost 70, and I hear both Camilla and Prince William are getting very impatient. And the Duke of Edinburgh is not bothered one bit either way, so long as he gets his daily game of polo. Coming back to domestic issues, let us not forget that Priyanka is also there”. \\nRS – “That is interesting. What exactly are you implying, Soniaji?” \\nSG – “Ah, that is for me to know and for you to find out. You are an investigative journalist, no? Anyhow, first I have to put Robert’s house in order”. \\nRS – “Meaning what, exactly?” \\nSG – “Ah, that is for me to know and for you to find out”. \\nRS – “You are trying me, Ma’am. But the cameras are ready to roll, and before we actually start can I have one last comment on Maneka and Varun?” \\nSG – “Let the cameras roll”. \\nRS – “But you haven’t……” \\nSG – “You heard.” \\nRS – “All right, Soniaji. I understand. Can we roll the cameras?” \\nSG – “Of course, Arnab. Just say when” Tweet About Suresh Subrahmanyan \\nBangalore based brand communications consultant, occasional columnist, deeply interested in western classical and Carnatic music and 70s pop and rock, follow cricket and tennis, and an avid fan of P.G. Wodehouse.'"}, "time": 1742563683.5761738}