{"duration": 0.1283571720123291, "input_args": {"text": "'6 ‘miracle’ drugs Big Pharma now regrets With Big Pharma, first they promote it, then they discover the risks. By Martha Rosenberg Posted on November 1, 2016 by Martha Rosenberg \\nAre you depressed? It may have less to do with your mood than your birth control pills, high blood pressure pills, antibiotics or even anti-hair-loss drug, according to new research. New risks have also emerged with popular gastroesophageal reflux disease medicines and even the top-selling painkiller, Tylenol. \\nThere are two reasons the risks associated with popular drugs seem to trail their aggressive promotion. Certainly, as millions use brand name drugs, dangerous side effects and adverse events are seen that did not emerge in much smaller clinical trials. Who knew? But also, as Intrepid Report has noted before, dangerous side effects that might be considered major drawbacks to prescribing the drugs often emerge only when drugs have gone “off patent” and all their profit potential is realized. For both reasons, drug safety activists recommend waiting five years before taking a “new” drug—until it is not “new” anymore. \\nHere are drugs and drug classes that have raised new concerns. \\n1. Proton Pump Inhibitors \\nOne of Pharma’s most successful gambits has been its proton pump inhibitors (PPIs) like Nexium (the “Purple Pill”) and Prilosec that reduce stomach acid. To sell the drugs, Pharma aggressively raised “awareness” of gastroesophageal reflux disease or GERD a rare condition which, over time, can change the lining of the esophagus and lead to cancer. Actually, most PPI users have simple heartburn. Even babies are now given PPIs for “baby reflux” because they spit up 71 times a day—a normal occurrence that has been pathologized. \\nare addictive. “Once a patient has taken a PPI for longer than a few weeks, acid hypersecretion can occur on discontinuation,” says a recent article in Pharmaceutical Journal. “This causes rebound symptoms, and frequently establishes a vicious cycle of drug reinitiation and long-term continuation.” \\nClostridium difficile (“C Diff”), bone thinning and fractures and vitamin and mineral deficiencies to chronic kidney disease and heart attacks. Now there is a new reported risk: dementia. \\nJAMA Neurology of 73, 679 people 75 or older with no dementia and taking PPIs found the patients “had a significantly increased risk of incident dementia compared with the patients not receiving PPI.” Other studies have also found a link. \\nfluoroquinolone class which includes Cipro and Levaquin. Even as the FDA tries to curtail use of antibiotics on the nation’s farms to make animals grow faster (a use which accounts for most U.S. antibiotic sales) drug use on the farm is actually increasing. The FDA’s 2014 Summary Report on Antimicrobials Sold or Distributed for Use in Food Producing Animals reveals that cephalosporin sales increased by 57 percent between 2009 through 2014, sales of antibiotics like clindamycin increased by 150 percent and sales of antibiotics like gentamicin, a dangerous drug class, increased by 36 percent. \\n1974, Navy recruits were given antibiotics to see if they would gain weight, and after only seven weeks, they did. Similar results were seen in children in Guatemala and in babies . But making people fat or encouraging antibiotic resistant microbes like MRSA are the least of the risks, it turns out. \\nthe bacteria in our gut, the microbiome, which antibiotics compromise as they kill the “bad” bacteria, are responsible for much more than good digestion. Antibiotics also affect the brain and “influence our mood and temperament,” says food expert Michael Pollan. “If you transplant the gut microbiota of relaxed and adventurous mice into the guts of timid and anxious mice they become less stressed and more adventurous.” Antibiotic-affected microbiomes may also be behind asthma and autoimmune diseases, acn published reports. \\n\\nThe Doctors’ Case Against the Pill by Barbara Seaman was published, Wisconsin senator Gaylord Nelson held hearings about clear links between the Pill and depression, blood clots and decrease in libido cited nowhere on the label. No women were asked to speak at the hearings, moving Alice Wolfson, a co-founder of the National Women’s Health Network, to say, “It must be admitted that women make superb guinea pigs. They don’t cost anything, they feed themselves, they clean their own cages, pay for their own pills, and remunerate the clinical observer. We will no longer tolerate intimidation by white-coated gods antiseptically directing our lives.” \\nFast-forward to this year, when medical studies again c links between birth control pills and depression, especially in young women, and corresponding higher use of antidepressant drugs. \\n“The risk of depression has been recognized since women were able to get their hands on oral contraceptives,” says Cindy Pearson of the National Women’s Health Network. “It’s been reported by women for 50 years.” \\nSweetening the Pill: or How We Got Hooked on Hormonal Birth Control might also be vindicated, writes Lara Prendergast. The book was called “a dishonest anti-Pill treatise” because the author “dared to point out that hormonal contraceptives are ranked by the World Health Organization as a class-one carcinogen alongside tobacco and asbestos,” she writes. \\nabout Propecia, a popular treatment for male pattern baldness linked to disturbing side effects in men including sexual dysfunction and actual reduction in penis size. At the time, Propecia’s label assured users that sexual side effects “went away in men who stopped taking Propecia”; however, the current label warns about sexual dysfunction like “erectile dysfunction, libido disorders, ejaculation disorders, and orgasm disorders; male infertility and/or poor seminal quality” that continues after discontinuation of treatment. \\nBMJ found “the risk of erectile dysfunction was not increased for users of finasteride 1mg compared with unexposed men with alopecia [hair loss],” but reports of the disturbing side effects abound in medical j ournals and popular magazines. \\nMen’s Journal last year. \\nPost-Finasteride Syndrome Foundation . \\n& Johnson to increase warnings in 2014. Unintentional acetaminophen overdoses cause as many as 26,000 hospitalizations and 458 deaths per year reported the FDA. \\nSoon after the increased warnings, medical journals linked acetaminophen to birth defects in the children of women the drug such as poor motor development, behavior problems and language delays. A study in JAMA Pediatrics identified an increased occurrence of ADHD by the age of seven in children whose mothers took acetaminophen. A study in the International Journal of Epidemiology found children more likely to have behavior problems and slow motor development by the age of three if their mothers had taken acetaminophen. Not all medical voices concur. Some said the studies were poorly designed or that fevers , for which the mother presumably took acetaminophen, are responsible for the birth defects. \\nIn recent years, acetaminophen has been found to have psychological and mental effects not before described. The pain reliever may “blunt individuals’ reactivity to a range of negative stimuli in addition to physical pain,” says study. Another study found acetaminophen reduced the psychological pain caused by social rejection. \\n6. Beta Blockers \\nOne out of Americans has high blood pressure and beta-blockers like atenolol (Tenormin), carvedilol (Coreg), metoprolol, propranolol (Inderal), sotalol (Betapace) and timolol (Timoptic) which treat the condition have been linked to depression for many years. \\nearly as 1967, the British Medical Journal reported that hypertensive patients treated with propranolol for cardiac arrhythmias experienced a rise in the incidence of depression. Still, it has not been known if patients’ depressions were caused by the actual actions of beta blockers (like blocking the effects of epinephrine/adrenaline and slowing heart rate) or mood conditions associated with the diseases for which beta blockers are prescribed such as hypertension and congestive heart failure. \\nHypertension found that beta blockers “may have a role in the pathogenesis or course of mood disorders” and increased hospital admissions for mood disorders. A “bidirectional relationship between depression and cardiovascular disease” exists, says the study , “because of the overlapping pathophysiological processes that underlie both conditions.” \\nThere is a lot of data that depression and cardiovascular disease are related . . . but current hypertensive practices do not consider depression,” said the study’s lead author Sandosh Padmanabhan. “There could be some people who are predisposed to depression who we should not be giving these drugs.” \\nMartha Rosenberg is a freelance journalist and the author of the highly acclaim Facebook page.'"}, "time": 1742561904.469592}