{"duration": 0.07229065895080566, "input_args": {"text": "'Panic across country for a day after govt doesn’t introduce any new rule on demonetisation Posted on Tweet \\nPanic and confusion grew widespread across the country after the Modi government did not introduce any new rule pertaining to the ongoing demonetisation drive. Thousands of anxious citizens thronged the Reserve Bank of India offices in their cities inquiring about the latest alteration to the rules, or rather the absence of one, after no such rider was introduced for one whole day. (Image via intoday.in) \\n“Ever since Nov 8th, this whole demonetisation saga has been like a reality show – with sudden, new riders being introduced every day as twists to the existing format. We got used to these fluctuations being the norm. But yesterday was different – one whole day went by without Shaktikanta Das or Arun Jaitley or anyone announcing any exception to the rules. I waited and waited till night. After all, this is a government which introduced a rule to be applied for the next day even at 8 pm on the present day. Finally, I reconciled myself to the shock – that there was no new rider for one whole day. That got me worried and here I am, standing outside the RBI office waiting for an appointment, to make sure that it is indeed real!” Chinta Sagar, an anxious gentleman told The UnReal Times . \\n“First, it was the exception for those with weddings happening. Then came the inedible ink announcement. Then the reduction of exchange limit to 2000 per day. Then of course, the announcement that Saturday would be a senior citizens only day, as far as exchanges are concerned. Now, there’s another announcement about banks only catering to their own customers hereafter. So, following the natural train of action, we weren’t wrong in anticipating another new rule today as well. But we were stunned on not hearing any. I hope the RBI clarifies on this,” another tense youngster cried. \\nFinance Minister Arun Jaitley, however, assured citizens not to worry and added that to maintain status quo, the government will continue to announce some random new rule or the other every day. “We have always been a government for the people and we would do nothing that would throw them off the hook. It has come to my attention that a number of them were anxious yesterday after we didn’t announce any sudden change, so I would like to reassure them and state that for their convenience, the government will continue to announce random changes to the rules every day, until the 31st of December,” Jaitley told The UnReal Times NDTV’s Barkha Dutt. \\nAddressing a more recent problem, the Finance Minister also announced a new “Sonam Gupta Bewafa Cess” on old currency notes that have the “Sonam Gupta Bewafa Hai” slogan inscribed on them. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742561818.4756732}