{"duration": 0.12219667434692383, "input_args": {"text": "'Will Trump make America great again? 03.11.2016 A few days are left before the presidential election in the United States. For the time being, Hillary Clinton has a slight advantage over her rival in the race, Republican candidate Donald Trump . In electoral votes, Clinton has 259 vs. Trump\\'s 164 votes (270 votes are required for victory). It will be up to six doubting states to decide the outcome of the presidential election - Utah, Pennsylvania, North Carolina, Arizona, Florida and Ohio. Many experts believe that Trump will win the vote. Will he? First off, the United States is fed up with Obama and the Democrats, and it could be very well seen in the mid-term elections for Congress in 2014, when Democrats lost seven states and gave the vast majority of Congress seats to Republicans. The outgoing president had given many eloquent promises, but has not been able to keep them. Hillary Clinton is the successor of the dubious legacy of Barack Obama. She was part of Obama\\'s government during his first four years as Secretary of State. The infamous Islamic State terrorist organization (banned in Russia) appeared during her stay in power. It was during Clinton\\'s stay in power, when Putin started winning in the game against the USA, when the US Ambassador in Benghazi was killed and when the devastating Arab Spring started gathering pace. Print version Font Size A study conducted by Pew Research found that the highest approval rating of Obama (64 percent in February 2009) was the lowest for any US president since Eisenhower, that is, since the end of World War II. Also read: The many suspicious suicides surrounding Hillary Rodham Clinton Secondly, Clinton lies and makes mistakes all the time. She made her biggest mistake in her professional activities. She used her private email for officials messages, which is strictly forbidden in the USA. The FBI resumed investigation into the case a week before the election, having caused irreparable damage to Clinton\\'s rating. Thirdly, a lot will depend on the turnout. Real wages of the middle class in the United States have not increased since 2008. The people who make the core of the USA want change that Obama has not given to them. \"Who\\'s the candidate with the most rabid supporters? Whose crazed fans are going to be up at 5 AM on Election Day, kicking ass all day long, all the way until the last polling place has closed, making sure every Tom, Dick and Harry (and Bob and Joe and Billy Bob and Billy Joe and Billy Bob Joe) has cast his ballot? That\\'s right..\" US film director Michael Moore wrote. Fourth, Trump personifies the American dream in real life. Donald Trump has made his name himself. Hillary Clinton amassed her fortune when in public service and lecturing Wall Street bankers. Trump\\'s program says what the American people want to hear. The program raises such relevant issues as job losses, terrorist threat, immigration problems. Angry white Americans do not like the fact that various minorities in their country act as if they are a majority. Trump represents the conservative America. Therefore, immigration law, abortion ban, protection of military veterans, the revival of industry - these issues worry most Americans, especially those who go to church on Sundays and honor the commandments. Fifth, the Americans may vote contrary to propaganda. A man approached Michael Moore after a show, the director wrote in his article. \"Coming back to the hotel after appearing on Bill Maher\\'s Republican Convention special this week on HBO, a man stopped me. \"Mike,\" he said, \"we have to vote for Trump. We HAVE to shake things up.\" That was it. That was enough for him. To \"shake things up,\" Michael Moore wrote. Also read: Hillary plays Russian roulette in US presidential election Sixthly, 16 Republican candidates and the Republican establishment have tried all kinds of methods to fight against Trump , but nothing could stop him. Trump does not use anything but Twitter and meetings with electors in his election campaign, but he is still very close to Hillary Clinton. \"I think that Trump has very good chances to win. In fact, he has already left Clinton behind,\" Oleg Soskin, Ukrainian politician, economist and political scientist told Pravda.Ru. In this case, the expert believes, major geopolitical, geo-economic and strategic changes will take place as Trump\\'s victory will bring in completely new people, forces, organizations, structures, systems, etc. For Ukraine, Trump\\'s victory woud mark a political death for Poroshenko and his team. Germany and France will experience major changes as well, while the Baltic States will find themsleves in a difficult situation, because they completely depend on the United States. Tectonic changes will occur inside NATO as well,\" Oleg Soskin said. \"Clinton, if she wins, will protect the interests of global financial capital,\" Dmitry Mosyakov, the head of the Center for Southeast Asia, Australia and Oceania at the Institute of Oriental Studies, Doctor of Historical Sciences, told Pravda.Ru. - Trump\\'s coming to power will entail serious changes for East Asia and the Pacific region. Trump says that America should pursue its own interests in the first place in both political and economic fields. I think that Trump will win, if the election is held honestly. He says truly Republican things to revive America\\'s own businesses,\" the expert told Pravda.Ru. Also read: Donald Trump and the genius of idiocy \"The things that we can see happening in the USA now confirm my long-standing assumption of significant divisions of elites in the country,\" Karine Gevorgyan, a political scientist, expert on Iran, orientalist told Pravda.Ru. \"The hegemonic role of the United States has led to chaos both in domestic and foreign policies. Therefore, a serious split inside the administration may aggravate further no matter who eventually takes office as president,\" the expert added. Lyuba Lulko'"}, "time": 1742562104.521342}