{"duration": 0.16869783401489258, "input_args": {"text": "'CHICAGO  —   During Memorial Day weekend, this city reopens its Lake Michigan beaches, regular fireworks displays start at Navy Pier, and the downtown streets and   Riverwalk are crowded with tourists. But the holiday weekend is often seen here as the start of heightened violence as well. That has been particularly worrying this year to community leaders and city officials, as they grapple with a rise in gun violence that has traumatized some neighborhoods and left city officials searching for new ways to subdue street crime. “If something doesn’t change, if we don’t get jobs for these kids, if we don’t change the economic situation, I’m worried that we could be looking at a blood bath,” said the Rev. Corey Brooks, a pastor on the city’s South Side, a mostly   area where some of the shootings have been concentrated. “If something doesn’t happen, I fear that we’re potentially looking at one of the worst summers we’ve ever had. ” As of Friday morning, homicides in Chicago were up 52 percent in 2016, compared with the same period a year ago, and shootings had increased by 50 percent, though the pace of violence had slowed in recent weeks, the police said. Only five months into the year, at least 233 people had been killed. Officials are struggling with the problem and are using a range of strategies as the murder rate in Chicago, the nation’s   city, outpaces that of New York and Los Angeles. Over the weekend, the Chicago police increased the number of officers on the streets. About a week after a gang sweep that led to the arrests of 140 people, the police said they planned to have extra foot patrols in parks and neighborhoods and more officers on bicycles. They are also using social media to track potentially troublesome house parties. “I think you all know how important this weekend is,” the police superintendent, Eddie Johnson, said on Friday afternoon at a meeting with his top command staff. On Friday evening, people gathered at more than 100 gymnasiums, parks and churches around the city to call for gang members and others to stop the violence that has long plagued some Chicago neighborhoods. The activities were the start of Mayor Rahm Emanuel’s third annual Summer of Faith and Action initiative, which promotes safety and urges people to put down their guns. “If we all come together and reclaim our streets, reclaim our parks, there’s no room for the gangbangers,” Mr. Emanuel said, stopping by one of the gatherings on Friday night on the Southwest Side, where people played basketball and painted murals. “I would also say to the gangbangers what Eddie Johnson said,” Mr. Emanuel said, referring to his recently appointed superintendent. “There’s a small percentage creating an overabundance of the gun violence. The Police Department knows who you are. They know where you live. And they know what you’re doing. ” For a few hours on Friday evening, under periods of pounding rain, the peace held, and the police scanners were filled with mundane reports of disturbances and   problems after a Beyoncé concert. But by Saturday evening, the police reported, 19 people had been shot, four fatally, including a    girl. Last year during the   Memorial Day weekend, there were 46 shootings in Chicago, and 14 people were killed, the police said. Other years have been quieter in 2013, there were 22 shootings and six deaths. Some community leaders are concerned about what may lie ahead because of how widespread the shootings and killings were even before the warm summer months, historically the most violent time of year in Chicago. The Rev. Michael Pfleger said on Friday that residents seemed to be “hunkering down” because they expected bad things to happen. “It’s almost like everyone’s saying a hurricane is coming,” said Father Pfleger, whose parish, the Faith Community of St. Sabina, is on the South Side. “What we really need to be doing is getting out, walking around. Don’t board up your house. Be out on your block. Be vigilant. Fear either paralyzes you or it motivates you. We could have this be the safest weekend of the summer if everyone was out talking to one another. ” The worries about summer come at an extraordinarily complicated time for Chicago, which is facing parallel crises: a drastic spike in violent crime and a Police Department viewed with suspicion, even derision, in some neighborhoods.   relations between the Chicago police and residents, especially   boiled over after the November release of a dashboard camera video showing a white officer shooting a black teenager, Laquan McDonald, 16 times. In the months afterward, Mr. Emanuel faced calls for his resignation, the police superintendent was fired and the Justice Department began an investigation into the Police Department’s practices. Last month, a task force appointed by Mr. Emanuel issued a scathing report saying that racism had contributed to a long pattern of institutional failures by the department and that the department had lost the trust of residents. That mistrust, some here say, has made it harder to solve crimes on the streets: Witnesses and victims often choose not to share information with the police. “People think that to get justice, they have to take the law into their own hands,” said the Rev. Marshall E. Hatch, the pastor of New Mount Pilgrim Missionary Baptist Church, on the West Side. Some here expressed concern about focusing on preparations for violence on a particular weekend  —   Memorial Day or otherwise. “The fact is that it’s constant and relentless, and that you don’t know when it’s going to happen,” said Dr. Kimberly Joseph, a trauma surgeon at John H. Stroger Jr. Hospital of Cook County, where some shooting victims are taken. “Try to imagine what it must be like for a    trying to go to school every day and not knowing what’s going to happen. ” No one knows for sure why Chicago’s violence has increased this year, but the police say it is largely the result of a small number of people involved with the city’s increasingly splintered set of gangs, and a rising number of disputes playing out on social media. A new area of concern is shootings along the expressways, where the authorities say gang feuds are spilling out of the neighborhoods. There have been 20 shootings along   expressways this year, the police said, and no arrests. “This has all amped up from what I’ve ever seen,” Father Pfleger said. “There’s a boiling point, and guns have become part of America’s wardrobe. People out here presume everyone has one, and they’ll tell you, ‘I’m going to draw mine before I get laid down.’ ” Chicago’s population of 2. 7 million is nearly equally split among whites, blacks and Hispanics, but most of the shootings have taken place in black and Hispanic neighborhoods on the city’s South and West Sides, and the majority of the victims have been  . For many who live in these neighborhoods, a recent poll showed, crime and gangs have become overriding concerns. More than 20 people under 18 have been killed this year. A number of bystanders have also been shot. Zarriel Trotter, 13, who appeared in an   video last year, was injured by a stray bullet in March. Janaé Bonsu, the national public policy chairwoman for Black Youth Project 100, said she was hopeful that city leaders would address the increase in violence by investing more in community groups focused on better jobs and increased educational opportunities, rather than just bolstering the police. “The City Council, the mayor, nobody is being brave enough to say that maybe our efforts are concentrated in the wrong place,” Ms. Bonsu said. “When you don’t have much going for yourself, whether it be work, whether it be school, your options are on the block. ”'"}, "time": 1742562687.8082373}