{"duration": 0.14178991317749023, "input_args": {"text": "'As the military and political battle against the Islamic State escalates, Muslim imams and scholars in the West are fighting on another front  —   through theology.  Imam Suhaib Webb, a Muslim leader in Washington, has held live monthly video chats to refute the religious claims of the Islamic State, also known as ISIS or ISIL. In a dig at the extremists, he broadcast from ice cream parlors and called his talks “ISIS and ice cream. ” Sheikh Hamza Yusuf, an American Muslim scholar based in Berkeley, Calif. has pleaded with Muslims not to be deceived by the “stupid young boys” of the Islamic State. Millions have watched excerpts from his sermon titled “The Crisis of ISIS,” in which he wept as he asked God not to blame other Muslims “for what these fools amongst us do. ” It is a religious rumble that barely makes headlines in the secular West since it is carried out at mosques and Islamic conferences and over social media. The Islamic State, however, has taken notice. The group recently threatened the lives of 11 Muslim imams and scholars in the West, calling them “apostates” who should be killed. The recent issue of the Islamic State’s online propaganda magazine, Dabiq, called them “obligatory targets,” and it said that supporters should use any weapons on hand to “make an example of them. ” The danger is real enough that the F. B. I. has contacted some of those named in the Islamic State’s magazine “to assist them in taking proper steps to ensure their safety,” said Andrew Ames, a spokesman for the F. B. I. ’s field office in Washington. The death threats are a sign that Muslim religious leaders have antagonized the Islamic State, according to analysts who are studying the militant group. Their growing influence also contradicts those who claim that Muslim leaders have been silent in the fight against violent extremism. “This is what hurts ISIS the most. It is Muslims speaking out,” said Mubin Shaikh, a Canadian who once joined an extremist Islamist group and now advises governments on countering radicalization. “  is what ISIS is trying to do, whether to silence these people or to silence others as a deterrent. ” Several of the targeted Muslim leaders said in interviews that, while they were taking the threat seriously, they had no intention of backing off. They have hired security guards and fortified their workplaces, and some keep guns at home. “It’s an honor to be denounced by ISIS,” said Imam Webb, who frequently engages young Muslims over social media, whether on YouTube, Facebook, Periscope or Snapchat. “I consider it one of my greatest accomplishments in life. ” “It has only reinvigorated me,” he said, “to provide the antivenom to the poison of ISIS. ” These Muslim leaders say they are responding to fellow believers who are looking for a religiously based rebuke to violent movements that claim to be acting in the name of Islam. They say that extremist groups like the Islamic State are a threat not just to civil society and security, but to the future of their faith. Sheikh Yasir Qadhi, who is based in Tennessee and runs a popular Islamic educational institute, thundered against the Islamic State in a Friday sermon at one of Europe’s largest mosques in March, only three days after the group’s suicide bombers had attacked the Brussels airport and train station. “None of our senior scholars of any school  —   any school  —   has justified these deeds,” Sheikh Qadhi said at the East London Mosque. He argued that the terrorist attacks of recent years had clearly violated Islamic teaching because they “cause more harm than good,” bringing more bombs, more drones and more chaos to Muslim communities, he said. “Who has benefited? Please use the intelligence that Allah gave you,” he said. “These radical groups have harmed the image of Islam infinitely more than all of the foreign policy of Western lands combined. ” These scholars ridicule the Islamic State’s claim to have created a “caliphate” ruled by a successor to the Islamic prophet, Muhammad. Instead, in a highly effective bit of rebranding, they call the Islamic State Kharijites, a reviled group of Muslims who killed women and children and rebelled against the caliphs in the seventh century. The imams named by the Islamic State are based in the United States, Canada, Britain and Australia. They represent a broad spectrum of Islamic thought  —   from spiritual Sufis to puritanical Salafis, and even the more militant “Salafi Jihadis. ” To the Islamic State’s propagandists, it does not matter that the imams are fervent Muslims or critics of American foreign policy: They are all “unbelievers,” just like the Shiite Muslims, Christians and Yazidis that the Islamic State has killed by the thousands in Iraq, Libya, Syria and elsewhere. This is not the first time that the Islamic State has targeted Muslim leaders in the United States, but this is the longest list yet. It includes Sheikh Hisham Kabbani, a Lebanese Sufi now based mostly in Michigan who has been warning for years about rising extremism. The list also includes   preachers such as Bilal Philips, a Canadian convert who has been barred from several countries because of allegations that he preaches extremism Tawfique Chowdhury, an Australian doctor who founded organizations and charities that propagate orthodox views of Islam and Abu Basir   a Syrian preacher based in London who has spoken in support of Al Qaeda, according to news reports. Cole Bunzel, a scholar at Princeton University studying Islamic history and jihadist ideology, said, “What ISIS is saying is that even if you support Al Qaeda, even if you’re a supporter of someone like Tartusi, you’re still not on team Islam. ” The Islamic State’s magazine also targeted American Muslims in government, such as Representative Keith Ellison of Minnesota Huma Abedin, a longtime top aide to Hillary Clinton and Mohamed Elibiary, a Texas Republican and former adviser to the Department of Homeland Security. Several terrorism experts said that an attack on any of these people was more likely to happen abroad than in the United States, but that all it would take is one deluded or mentally unbalanced “lone wolf. ” In March, a popular Saudi preacher, Sheikh Aaidh   was shot and wounded by a gunman in the Philippines, soon after the Islamic State’s online magazine had put him on a list of “apostate” Saudi scholars. Sheikh Qarni, who writes Islamic inspirational books and has nearly 13 million followers on Twitter, had just given a lecture at Western Mindanao State University, and his assailant was an engineering student. The effort to undermine the Islamic State using religion is not just a Western phenomenon. In January, Muslim leaders from around the world gathered in Morocco and produced the Marrakesh Declaration, which denounces Muslim oppression of religious minorities. The Organization of Islamic Cooperation, which represents 57 Muslim countries, recently endorsed the declaration. Sheikh Hamza will soon air a television series in the Middle East, “Rihla With Sheikh Hamza Yusuf” (rihla is “quest” in Arabic). The show applies traditional Islamic scholarship to contemporary challenges in the Muslim world, and it includes strong messages against extremism  —   which Sheikh Hamza said amounts to “swatting the hornet’s nest again. ” It is likely to be seen in Iraq and Syria, the Islamic State’s strongholds, he said. Sheikh Qadhi, however, said that, based on several frightening experiences recently in Tennessee, he has more to fear from     than from adherents of the Islamic State. “I’m not scared of ISIS in America,” he said. “I feel very safe in every mosque I go to. But I am scared of other people in this land who are very ignorant and bigoted. ” He said he had gotten used to being vilified by both sides: “The right wing is calling me a stealth jihadist. And ISIS is calling me a sellout. We challenge both of their narratives, even as their narratives feed into each other. ”'"}, "time": 1742563315.920912}