{"duration": 0.027580976486206055, "input_args": {"text": "'AMSTERDAM  —   For the first time, the four paintings still known to exist from Rembrandt’s series depicting the five senses are being displayed together. The works, completed when he was still in his teens, are presented in the exhibition “Sensation: Rembrandt’s First Paintings,” on view at the Ashmolean Museum in Oxford, England, until Nov. 27. This   Dutch master’s allegory of smell, “The Unconscious Patient,” was discovered only a year ago at an auction in New Jersey, after being found in someone’s basement. The small auction house had given it an initial sales estimate of $500 to $800. Two Rembrandt experts suspected that it might have been an original and drove the bidding up to $870, 000. The painting has since been authenticated and is now part of the Leiden Collection in New York, a private grouping assembled by Thomas S. Kaplan and Daphne Recanati Kaplan, a married couple. The collection already contains two works in the series, depicting the senses of hearing and touch. These three were exhibited together at the Getty Center in Los Angeles in May. Now they are joined by the allegory of sight, on loan from Museum De Lakenhal in the Dutch city of Leiden, Rembrandt’s hometown. Created from 1624 to 1625, while Rembrandt was living there, these early paintings fit into a tradition of northern European genre painting. They sometimes play on the double meaning of the word for the sense that each depicts. For example, in Rembrandt’s “A Pedlar Selling Spectacles” (sight) an elderly couple with poor eyesight browse through a box of eyeglasses held by an untrustworthy street vendor. The image explores both meanings of sight: vision and observation. “These earliest of paintings by Rembrandt are fascinating in what they tell us of the young artist’s abilities and his precociousness,” An Van Camp, curator of Northern European art at the Ashmolean Museum, said in a statement. “The paintings show that at the age of just 18, Rembrandt already has a genius for representing human character and emotion, and for packing in amazing amounts of detail into the briefest of brush strokes. ” A fifth panel, which would depict taste, is missing from the exhibition, as it has not been seen for almost 400 years. Ms. van Camp said that it might be lost or destroyed. An empty frame in the exhibition space invites visitors to reflect on what it might have looked like, and, Ms. van Camp said, it might encourage them to look for it in their attics.'"}, "time": 1742628543.671938}