{"duration": 0.1407933235168457, "input_args": {"text": "'It’s all old news to those of us who, unlike Democrat LIVs (low information voters), pay attention to the Alternative Media. But it’s still significant because the information made it to Fox News’ Hannity Show . \\nHis name is Jeff Rovin . \\nAfter decades as one of Bill and Hillary Clintons’ many retainers, Rovin is outing himself as the Clintons’“ fixer ”— defined by Oxford Dictionaries as “ A person who makes arrangements for other people, especially of an illicit or devious kind. ” In Rovin’s case, he claims to have been employed by the Clintons to suppress and remove from the media any scandalous news of their sexual affairs. Note: For a few of the Clintons’ other retainers, see “ Hillary Clinton’s medical handler, cleaner, & prompter were all at the last presidential debate ”. \\nRovin says he was paid $4,000 a month to keep the Clintons’ open marriage and their respective adulteries from the news. In Hillary’s case, she had “affairs” with Vincent Foster and with a female Hollywood honcho. Note: On July 20, 1993, Foster — who was Bill Clinton’s deputy White House counsel at the time — was found dead on a park bench in D.C.’s Ft. Marcy Park, supposedly from a self-inflicted gun shot. See “ FBI files linking Hillary Clinton to Vince Foster suicide vanished from National Archives “. Note: According to the Clintons’ former assassin Larry Nichols, when she was First Lady, Hillary regularly went to California on weekends to be with Hollywood producer Linda Bloodworth-Thomason and other women to “worship” Satan at “a church”. See “ Clinton friend and assassin Larry Nichols: Hillary is a satanist ”. Linda Bloodworth-Thomason , 69, is a television producer who, with her husband Harry Thomason, is best known for creating, writing, and producing the TV series, Designing Women . The couple are notable for their friendship with Bill and Hillary Clinton, which dates back to Bill’s days as governor of Arkansas. The Thomasons created several short-subject political propaganda films for Bill, the most famous of which was The Man from Hope that introduced Bill at the 1992 Democratic Convention. The Thomasons did similar propaganda films for Hillary’s run for the U.S. Senate and for other candidates, such as General Wesley Clark’s presidential bid. Clark has endorsed Hillary for president. (See “ Obama-supporter Gen. Wesley Clarke: Disloyal Americans should be put in concentration camps ”) \\nHere’s Rovin on Hannity , on Oct. 24, 2016: \\nThe National Enquirer first broke Jeff Rovin’s story. Here’s what Rovin told the Enquirer : \\nDuring the 1980s and 1990s, I was working in Hollywood as a reporter for several national magazines and newspapers. Because of my good relationship with stars, publicists and the press I became “a fixer”: someone who helps stars keep embarrassing stories out of the press. I helped keep secrets safe for some of Hollywood’s leading men. \\nIn 1991, my reputation was such that I was asked to work on behalf of a fast-rising figure on the national stage: Arkansas Gov. William Jefferson Clinton. I attended a meeting in Hollywood where I was told by an intermediary: “There will be a lot of stories coming out in the tabloid press. We want them buried.” \\nI was informed that these stories would involve rumors of Bill Clinton‘s many sexual dalliances and an alleged ongoing affair of Hillary Clinton with a male member of her law firm, Vince Foster, as well as a female mover-and-shaker in Hollywood. \\nFor a retainer of $4,000 a month — paid by a third party, not the campaign — I was told to keep these stories hush-hush in one of two ways: by trading access to the Clintons for “positive” interviews, or by paying the reporters. \\nThe payments were always cash, usually delivered in a movie theater or restaurant on Sunset Boulevard, and came in two denominations: $100 for a heads-up that a bad story was coming; or considerably more to kill the piece. \\nIt did not appear that the job would be terribly time-consuming: After all, Hillary reportedly had just one lover, and Bill’s girlfriends were all in the past. \\nNot so. The sexual dalliances were ongoing — and so my communications with the West Wing, Air Force One and Camp David continued through 1998 — a stunning length of time when one considers that both the president and the first lady were supposed to be devoting their full energies to the business of the people of the United States! \\nThe gravest example of a Clintonian lack of judgment occurred in March 1994. Presidential brother Roger Clinton was marrying his eight-months-pregnant bride Molly. There was a bachelor party. Prostitutes were involved. Recordings were made. Recordings involving Bill Clinton. \\nArrangements for a meeting between Bill and a 26-year-old brunette were discussed when the president was to arrive in Dallas for the ceremony. \\nThe tape recording was offered, for sale, to The National Enquirer . Before the publication and its then-editor could publish a transcript, I swooped in and negotiated for the White House to give this paper exclusive access to the ceremony itself. Not even The Washington Post or The New York Times had that. The Enquirer was given leave to publish exclusive White House photographs. \\nAt the reception, while Bill Clinton sang with the piano player, Hillary was introduced to The Enquirer reporter. Her expression fierce, voice tight, she took and tightly held the reporter’s hand and demanded, “Are we done now?” The reporter replied, “Madam First Lady, with this incident, yes.” \\nOf course, we were not done. This was one of many in an endless string of sexual stories arising from what effectively was the Clintons’ open, polyamorous marriage. \\nI have kept these secrets for a quarter-century because Bill Clinton had become an elder statesman with heart trouble and Hillary Clinton seemed to be focused, at last, on the business of doing her job — for better or for worse. \\nI am coming forward now because of the endless attention the alleged indiscretions of Donald Trump have received. Nothing I have heard comes close to the sexual and moral corruption of the Clintons — many of which have yet to be revealed. \\nPredictably, the liberal media is focusing on one man’s alleged misdeeds and ignoring another’s proven sins. \\nI mention some of these here and now because we have only two serious candidates for the presidency. In the few weeks remaining until the election, we should not be weighing whose corruption is worse (the Clintons win by a landslide, if all were to be told), but who has the best ideas and leadership skills to become president of the United States. Hillary Clinton is transfixed by Christina Aguilera’s boobs, confirmed by the singer on the Ellen Degeneres Show in May 2016. \\nSee also:'"}, "time": 1742562215.5146356}