{"duration": 0.05556488037109375, "input_args": {"text": "'. The White Temple and the Great Ziggurat in the Mesopotamian City of Uruk The Egyptian pyramids are not the only ancient mystery of the old world; the ziggurat also sustains ... Print Email http://humansarefree.com/2016/11/the-white-temple-and-great-ziggurat-in.html The Egyptian pyramids are not the only ancient mystery of the old world; the ziggurat also sustains a substantial position of wonder. The ancient land of Uruk was once located in southern Mesopotamia, on the Euphrates river, which corresponds to our present day Warka, in Iraq. It was founded by a king named Enmerkar around 4500 BC, and it was the home of the epic hero king Gilgamesh.By 3200 BC, Uruk was one the largest cities in the world during its time, with an estimated population of over 40,000 people.Along with a developed agriculture system, the city thrived, and is considered to be the first true city in the world. The City of Uruk The city was continuously inhabited until around 300 AD, when its citizens started to leave due to both natural and man-made influences.Uruk was left abandoned until William Loftus, working for the British Museum, began excavating and unveiling the ancient city.Under the rulership of Ur-Nammu, who united all the cities of Sumer into a single empire, a new type of building was created for the gods, and this was the beginning of the ziggurat (or temple tower). Uruk cultural expansion c. 3600-3200 BC ( CC BY-SA 3.0 ) The Sumerians believed that the gods came from the mountains they could see in the distance, and that was a problem because their land was flat. It is believed that the ziggurats of Uruk were created to imitate mountains so that their gods could dwell in them, and be closer to their city. Because ziggurats were part of the temple complexes, it is believed that they were connected with religious rites; religion was a very important part of the ancient Mesopotamian culture.In the center of the Sumerian cities, temples of their favorite gods were built.But like many ancient structures, there is a great degree of uncertainty surrounding the reasons behind their construction, or how they were truly intended to be used. Eanna of Uruk. ( CC BY-SA 3.0 ) The Grand Construction Predating even the oldest of the Egyptian pyramids, the ziggurat (coming from the Assyrian word for \"raised up\" or \"high\") was a huge platform with a series of smaller platforms on top. Visually, it resembles a step pyramid, with a flat top. The ziggurat was built with mud-brick since stones were scarce in that region. It had stairs, and ramps in some cases, leading upwards to its flat top area where a small temple would be placed. Ziggurats were often expanded in size and each time a rebuilding work was done, the mud-brick walls were knocked down and the remains used as the foundation for the new construction. Remains of the ziggurat and White Temple in Uruk. ( CC BY-NC-SA 2.0 ) The White Temple of Uruk One of the oldest standing ziggurats supported what came to be known today as the White Temple, which dates from around 3200 to 3000 BC, and it is believed to have been dedicated to the sky god Anu. The White Temple and Ziggurat. ( aparthistory2015.blogspot.com ) With its whitewashed mud-brick walls, the White Temple would have been an imposing looking structure.Even with its modest size, with the rectangular surface area of its terrace measuring 45x50 meters, the Temple would have been visible from far away, even beyond the protective walls of the city. Its corners were oriented by the cardinal points. None of the three entrances of the Temple faced the ziggurat ramp directly.In Dr. Senta German\\'s words, regarding the structure of the White Temple: \"The visitors would have needed to walk around the temple, appreciating its bright façade and powerful view, and likely gained access to the interior in a \\'bent-axis\\' approach (where one would have to turn 90 degrees to face the altar) a typical arrangement for Ancient Near Eastern temples.\" When describing the interior of the White Temple, Dr. German states: \"The north west and east corner chambers of the building contained staircases (unfinished in the case of the one at the north end). \"Chambers in the middle of the northeast room suite appear to have been equipped with wooden shelves in the walls and displayed cavities for setting in pivot stones which might imply a solid door was fitted in these spaces. \"The north end of the central hall had a podium accessible by means of a small staircase and an altar with a fire-stained surface.\" Unfortunately, not many objects have been found inside the Temple and, therefore, archaeologists lack clues that could possibly assist in unveiling information about the accurate uses of this building. Reproduction of what would have been the inside view of the two-story version of the \"White Temple\". A postament in the center was probably used as an altar. © artefacts-berlin.de ; scientific material: German Archaeological Institute A last feature described in the reconstruction of the Temple was the presence of a system of shallow bitumen-coat conduits, which ran from southeast to southwest of the edge of the terrace and entered the Temple. Archaeologists are still unsure as of what kind of liquids would have flowed from the terrace to be collected in a pit placed in the center hall of the Temple, stated Dr. German.Speculation suggests that it was intended to be used for offerings, but the kind of liquid offering were involved remains a mystery to be discovered. Top image: Digital reconstruction of the White Temple and ziggurat in Uruk. © artefacts-berlin.de ; scientific material: German Archaeological Institute . Joshua J. Mark, Ancient History Encyclopedia (accessed on Oct 10, 2016). The British Museum . Dr. Senta German, Khana Academy . Artefact: German Archaeological Institute (accessed on Oct 9, 2016). McGrall Hill Education (accessed on Oct 9, 2016).This article was originally published on Ancient Origins and has been republished with permission. Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742628569.6870158}