{"duration": 0.07924342155456543, "input_args": {"text": "'Pete Souza/WhiteHouse.gov Will the Establishment elite allow Trump to take the presidency on Jan. 20, 2017? \\nWASHINGTON D.C. ( INTELLIHUB ) — The Establishment elite are in panic mode after their rigged elections backfired in their face when vast seas of patriotic Americans took to the polls in favor of Donald J. Trump, giving America’s new President-elect the electoral votes needed to win. \\nLast Thursday, during a meeting held at the White House, between Donald Trump and President Barack Obama, you could just see how irked Obama was knowing that he was sitting beside a truly patriotic soul; a man with a raging fire burning inside him; a man with the spirit to facilitate making America great again. Not to mention Trump was the man that brought Obama’s birth certificate issue to the forefront. The look on @POTUS face when he met @realDonaldTrump #priceless \\n— Shepard Ambellas (@ShepardAmbellas) November 12, 2016 \\nIn fact, during the meeting Obama was so threatened by Trump’s presence that his 8-year-long legacy likely flashed before his very eyes as the President of the United States realized that on day number one of Donald Trump’s presidency, a president Trump, at that point, could simply nullify any and all executive orders signed by the then would-be former president Barack Obama during his tenure as POTUS . What will happen if Trump nullifies all of Obama’s executive orders once POTUS? Ted Eytan/Flickr Does this mean no more ‘transgender bathrooms?’ \\nAbsolutely. Imagine that; a normal world, how it always was for hundreds, if not thousands of years. Naval History & Heritage Command/Flickr Does that mean Americans can keep their guns? \\nSure does. America would not be America if we did not have the right to bear arms and work to undo what anti-gunners have done in Washington D.C. over the past two decades and what Obama has done over the past 8-years against the U.S. Constitution . Fibonacci Blue/Flickr Does that mean the repeal of Obamacare or major failed portions of it? \\nYes it does. Does that mean the preservation of our civil rights and liberties per the Constitution? \\nSure does. Does that mean implementing a sensible immigration policy; possibly building a wall? \\nYes it does. After all, the Russians are now using advanced killer robots at their border, ones that can engage and kill humans from over 6 miles away. Nancy <I’m gonna SNAP!/Flickr Does that mean putting an end to dangerous geoengineering programs that our affecting all living things on the planet and our weather? \\nOne can only hope. \\nBut you can see where I am going with this. The Establishment elite simply do not want to lose their power and in my opinion will likely do anything to keep it. Remember, they have built a legacy and plan to protect it at all costs. \\nSo in other words; will Donald Trump actually take office against all odds? \\nPlease comment below and share your opinion on this highly important issue. \\nShepard Ambellas is an opinion journalist, filmmaker , radio talk show host and the founder and editor-in-chief of Intellihub News & Politics. Established in 2013, Intellihub.com is ranked in the upper 1% traffic tier on the World Wide Web. Read more from Shep’s World . Get the Podcast . Follow Shep on Facebook and Twitter . ©2016. INTELLLIHUB.COM. All Rights Reserved.'"}, "time": 1742564542.276381}