{"duration": 2.2117466926574707, "input_args": {"text": "'The UC Davis police team told the College Republican group who organised the event with MILO and Martin Shkreli that they “could not guarantee the safety of students, the speaker, or their officers. ”[“We were told by the chief of Davis police that they could not guarantee the safety of the students, the speaker, or the police officers if the event should go ahead,” said Gabrielle McDowell, vice chair of the UC Davis College Republicans.  “As the organisation hosting the event, we would have been held personally responsible for any harm caused as a result of its taking place. We were therefore forced to cancel the event” she continued. Dozens of police were deployed by the university in an attempt to control the protests, as protestors holding ‘ ’ banners tore down barricades and broke into scuffles in an attempt to stop the event from taking place. University of California, Davis cancels event featuring Milo Yiannopoulos and Martin Shkreli after protests, fights pic. twitter.   —   BNO News (@BNONews) January 14, 2017,  There are also photos of an arrest being made as a protestor attempted to break into the venue. Organizers, UC officials,  police discussing safety of holding #SHKRELOPOULOS event @ucdavis #abc7now pic. twitter.   —   Katie Utehs (@KatieUtehs) January 14, 2017,  The event was set to be the first event on the third and final leg of the MILO’s “Dangerous Faggot Tour. ” A day before the cancellation, the university’s interim chancellor released a statement condemning MILO’s allegedly “racist and sexist” beliefs but stating that “as a public university, we remain true to our obligation to uphold everyone’s First Amendment freedoms. “Therefore, we will not ask the Davis College Republicans, a   organization, to cancel their event,” he continued. The statement also condemned “messages that promote hate. ” He was probably talking about MILO rather than the protesters, but perhaps now he will reconsider? You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742563700.3142948}