{"duration": 0.0933835506439209, "input_args": {"text": "'Federal prosecutors in Manhattan have evidence that Sheldon Silver, the former speaker of the New York Assembly, engaged in extramarital relationships with two women connected to his position in Albany, according to newly unsealed court documents. The women were not identified in the papers, which were released on Friday, but one of them lobbied Mr. Silver “on a regular basis on behalf of clients who had business before the state,” the government said in a memorandum to a judge. In the case of the other woman, prosecutors said, Mr. Silver “used his official position” to help her get a state job, “over which he exercised a particularly high level of control. ” The government said it wanted to use evidence of the affairs at Mr. Silver’s sentencing, most likely to counter testimonials from the defense that he was a man of good character, strong ethics and integrity. The alleged relationships also lent credence to the notion that the former speaker had long engaged in questionable behavior, using his influence to dole out preferential treatment in return for favors. The court papers added a new and unexpected dimension to Mr. Silver, a Democrat from the Lower East Side of Manhattan who became one of the most feared and powerful politicians in New York State. With one of the two women, for example, he kept a separate cellphone to talk primarily to her it was not in his name and bills were not sent to him, the memo said. The allegations were in sealed court papers that federal prosecutors in Manhattan first presented to a judge last fall, in hopes of being allowed to use the material in Mr. Silver’s trial on federal corruption charges. The judge, Valerie E. Caproni of Federal District Court, did not unseal the materials at the time, but the issue arose again after the trial ended, when the office of Preet Bharara, the United States attorney for the Southern District of New York, asked to be allowed to use the materials at Mr. Silver’s sentencing, which is scheduled for May 3. “I view this as of a piece with the crimes for which Mr. Silver stands convicted,” Judge Caproni said on Thursday in court, where she said she would unseal the materials. “Not exactly the same no one is suggesting a quid pro quo, but of a piece of a misuse of his public office, and that’s why I think it’s relevant. ” The judge’s decision to make the documents public, with some redactions, followed a vigorous and ultimately unsuccessful legal fight by lawyers for Mr. Silver and the two women to block the release of the materials. The government had continued to press for the unsealing, as did The New York Times and NBCUniversal, which cited the First Amendment right of access to the courts. Steven F. Molo and Joel Cohen, lawyers for Mr. Silver, said on Friday morning after the release, “These are simply unproven and salacious allegations that have no place in this case or public discussion. ” Manuel Ortega, a lawyer for one of the women, denied the government’s assertion that his client had had an affair with Mr. Silver. He said the government’s “attempt at smearing the defendant with baseless allegations is not an attempt to seek justice, which is the prosecutor’s obligation, but a way to publicly embarrass innocent families and innocent people. ” A lawyer for the other woman, the lobbyist, declined to comment through a spokesman.  Mr. Silver, 72, was convicted on Nov. 30 of all seven counts against him, including honest services fraud, extortion and money laundering. The evidence at trial showed that he had obtained nearly $4 million in illicit fees in return for official actions that benefited a cancer specialist at Columbia University and two real estate developers in New York. Mr. Silver, the Assembly speaker for more than two decades, automatically forfeited his seat in the Legislature with his conviction, and faces up to 20 years in prison on six of the seven counts. In seeking to introduce the information last fall, prosecutors noted that after Mr. Silver was charged in January 2015, they had obtained “numerous recordings” on which he could be heard. In one case, Mr. Silver is heard discussing state and private business with a woman, apparently the lobbyist, according to the memo, which is heavily redacted, making it at times difficult to determine which woman he is talking to. In the conversation, Mr. Silver and the woman discussed “their desire to conceal the truth about their relationship from reporters inquiring about extramarital relationships,” and how they should handle such inquiries, the government said. The woman told Mr. Silver that she had been trying to see him urgently because a reporter was calling state legislators, asking whether certain other legislators were having affairs, the memo said. Mr. Silver is heard responding, “I don’t think he caught us,” but he also said that reporters had requested his travel and campaign finance records. He then expressed concern that those materials and telephone records “could reveal their relationship,” prosecutors said. The memo says Mr. Silver said “it was ‘not safe’ for them to be seen together, and that he did not see the press inquiries ‘dissipating for a long time,’” the memo says. In one ruling also unsealed on Friday, Judge Caproni acknowledged that disclosure of the alleged relationships risked greater harm to the women than to Mr. Silver, given that they had not been connected to or named in the prosecution. But the judge ruled that the women were not “entirely ‘innocent’ third parties. ” She added, “Each allegedly had an extramarital affair with a public official and then exploited her relationship with the public official for personal gain. ” Judge Caproni, in ordering the documents released, said on Thursday that the public had an interest “in understanding the whole scenario,” and in what she would be looking at to determine an appropriate sentence for Mr. Silver, who has been married to his wife, Rosa, for roughly 50 years. The allegations, she added, were “not one of his better moments. ”'"}, "time": 1742563828.1016126}