{"duration": 0.04900717735290527, "input_args": {"text": "' US Insiders \\x96 Not Russia \\x96 Leaked Clinton Emails By WashingtonsBlog\\nNovember 03, 2016 \" Information Clearing House \" - We\\x92ve repeatedly shown that it\\x92s much more likely that American insiders \\x96 not Russian hackers \\x96 leaked the Clinton emails.\\nToday, the NSA executive who created the agency\\x92s mass surveillance program for digital information, who served as the senior technical director within the agency, who managed six thousand NSA employees, the 36-year NSA veteran widely regarded as a \\x93legend\\x94 within the agency and the NSA\\x92s best-ever analyst and code-breaker, who mapped out the Soviet command-and-control structure before anyone else knew how, and so predicted Soviet invasions before they happened (\\x93in the 1970s, he decrypted the Soviet Union\\x92s command system, which provided the US and its allies with real-time surveillance of all Soviet troop movements and Russian atomic weapons\\x94) \\x96 told Washington\\x92s Blog:\\nMy vote all along has been on an insider passing all these emails to Wikileaks.\\nIf it were the Russians, NSA would have a trace route to them and not equivocate on who did it. It\\x92s like using \\x93Trace Route\\x94 to map the path of all the packets on the network. In the program Treasuremap NSA has hundreds of trace route programs embedded in switches in Europe and hundreds more around the world. So, this set-up should have detected where the packets went and when they went there.\\nBinney has previously explained to us that a Russian hack would have looked very different, and that he thought the hack may have been conducted by an NSA employee who was upset at Clinton\\x92s careless handling of America\\x92s most sensitive intelligence.\\nThe former intelligence analyst, British Ambassador to Uzbekistan, and chancellor of the University of Dundee (Craig Murray) \\x96 who is close friends with Wikileaks\\x92 Julian Assange \\x96 said he knows with 100% certainty that the Russians aren\\x92t behind the leaks.\\nMurray said today:\\n\\x93The source of these emails and leaks has nothing to do with Russia at all. I discovered what the source was when I attended [a] whistleblower award in Washington. The source of these emails comes from within official circles in Washington DC. You should look to Washington not to Moscow .\\x94\\nProminent investment advisor and economic forecaster Martin Armstrong writes today:\\nAll our indications from behind the curtain are suggesting that there are many within the \\x93intelligence\\x94 sector and \\x93law enforcement\\x94 sector who are deeply troubled with the Clintons. They are trying to release documents and info to stop the Clinton Inc. Machine. That\\x92s all we can say on this topic right now. Suffice it to say, there is a real internal battle going on in Washington.\\nAnd the Deputy Assistant Secretary of State under numerous administrations \\x96 both Democratic and Republican \\x96 (Steve Pieczenik ) said recently that a group of officers from various U.S. intelligence and military agencies have staged a \\x93counter-coup\\x94 to save America from corruption, and are the source of the leaked emails:\\nInteresting times, indeed\\nhttp://www.washingtonsblog.com'"}, "time": 1742563228.2427344}