{"duration": 0.48655271530151367, "input_args": {"text": "'Videos Economist Jack Rasmus: Eurozone Benefits The Strongest Economies At The Expense Of The Weakest ‘Greece has tied its tail to the eurozone, dominated by Germany, and it can never get out of this situation as long as Germany dominates the institutions, which it does, because the whole arrangement is great for Germany,’ the writer and economist tells MintPress News. | October 31, 2016 Be Sociable, Share! Bystanders wait to be handed bags of oranges during a free distribution of fruit and vegetables as a protest by farmers and vendors over proposed pension reforms, in Athens on Wednesday, Jan. 27, 2016. Greece’s leftwing government is facing an escalating wave of protests over its proposed pension overhaul that has been demanded by bailout creditors. (AP Photo/Petros Giannakouris) \\nATHENS — This has been another eventful year in Greece. Almost one year after it turned its back on the July 2015 referendum result which rejected further austerity, the Syriza-led government has pushed forward a program of even harsher austerity, spending cuts, and privatizations . \\nFollowing the British vote to proceed with “Brexit,” or a departure from the European Union, fears that Greece might follow suit led Greece’s lenders to demand even more austerity measures from a country already mired in an economic depression. \\nIn this interview, Dr. Jack Rasmus , a professor of economics and politics at St. Mary’s College of California, analyzes these issues and the many challenges facing the Greek and European economies today. \\nThe author of such books as “ Looting Greece ” and “ Systemic Fragility in the Global Economy ,” Dr. Rasmus shares his insights into the consequences of austerity for Greece and other peripheral European economies, and presents his proposed solutions for an end to the crisis and austerity. \\nMintPress News (MPN): In September, Greek Prime Minister Alexis Tsipras gave his annual “state of the nation” address, where he boasted that the Greek economy has turned the corner, that unemployment is going down, that salaries will be increased, and that the country is returning to growth. Is this what Greece’s economic indicators actually show? Protesters march to the Greek Parliament in Athens on Tuesday Nov. 6, 2012. Greece’s unions are holding their third general strike in six weeks to press dissenters in the country’s troubled coalition government not to back a major new austerity program that will doom Greeks to further hardship in a sixth year of recession. Two days of demonstrations are planned to start Tuesday, continuing until lawmakers vote late Wednesday on the bill to slash euro13.5 billion ($17.3 billion) from budget spending over two years. (AP Photo/Dimitri Messinis) \\nDr. Jack Rasmus (JR): No, not quite. Greece’s debt is still the same as it was in 2011, roughly 180 percent of GDP. Unemployment has come down by only 3 to 4 percent, so instead of 27 percent, it’s about 23 to 24 percent. That’s depression-level unemployment. All the other indicators in the economy are flat or declining, so I don’t see anywhere that Greece is really “recovering,” and neither, really, is the entire eurozone economy. It’s been bouncing along the bottom. \\nAs I said in my book “Systemic Fragility,” it’s a case of chronic stagnation. [The eurozone] might grow a little, 0.5 percent or 1 percent above GDP, mostly as a result of Germany’s growth, then it flattens out or goes below. Most of the periphery economies in Europe are stagnant or in a recession, as they have been for quite some time. \\nAs far as raising wages, Greece cannot raise, at least in the public sector, any wages without the approval of the troika [Greece’s three major lenders: the European Commission, European Central Bank, and the International Monetary Fund]. It’s a real stretch to say that Greece is recovering. It’s kind of moving sideways, in the condition of still chronic economic depression. \\nMPN: One of the perceptions that has been prevalent in global public opinion with regard to the economic crisis in Greece is that the country has been “bailed out” with billions upon billions of euros in free money. Is this really the case, and where has the so-called “bailout” money to Greece actually gone? \\nJR: Countries don’t get bailed out. Governments, banks, businesses, and sometimes, though not so frequently, households get bailed out. So the question is, who got bailed out here, in the debt restructuring deals of 2010, 2012, 2015, and this past spring? The banks got bailed out several times. Foreign investors and speculators in Greek bonds and other securities clearly got bailed out in 2012. If you look at where the money has gone, there’s $400 billion in debt in Greece still, that they have to pay off, with an economy that is less than half that size, so it’s impossible. \\nWhere has all this money gone? Recent studies by the European School of Management and Technology documenting the 2010 and 2012 bailouts indicate that 95 percent of all the loans to “bail out” the Greek government, which then bailed out the Greek banks — 95 percent of that went back to Northern Europe, mostly to the German and Northern European banks that had loaned so much money to Greece. [Bailout funds also went] to the troika, particularly the European Commission, that then distributed it to the banking system and investors in turn. The EC is the big player here, and to some extent the European Central Bank, and to a minor extent now the International Monetary Fund. So, 95 percent of all the money loaned to Greece went right back to [Europe] and less than 5 percent of that went back into the Greek economy. Greece has been subsidizing the financial system elsewhere in Europe. A supporter of the communist-affiliated union PAME takes part in an anti-austerity rally in front of the parliament in Athens, Monday, Oct. 17, 2016. \\nMPN: What do you believe needs to be done about the Greek debt? \\nJR: You might ask what needs to be done about debt throughout the eurozone, because it’s not just Greece. Greece is perhaps the most serious case, but other places in the periphery of Europe are still heavily indebted. You cannot sustain, with austerity measures designed to pay the interest and principal on debt, a $400-plus billion debt based on an economy that’s less than $200 billion. Even the IMF has come to that conclusion and is maneuvering with the other troika members on that particular point. \\nIs [the debt] legitimate? Well, you have to understand the origins of this debt. It was originally private sector debt that was created as a result of the formation of the eurozone in 1999, the ECB as part of that creation, and other elements of the eurozone agreements, particularly the Lisbon Strategy that Germany adopted. Germany and other Northern European businesses and bankers pumped money and capital into the periphery, including Greece, from 2005 onward. Germany had a strong competitive advantage in exports, so a lot of the money and capital was pumped into the periphery, including Greece, in order to purchase German and other exports. So the money went in and circulated around, leaving a pile of private sector debt in Greece, Italy, and other places. \\nThen we had the crash of 2008-2009 and the debt could not be repaid, and the troika stepped in to [offer] the governments of Greece and other countries money in order to continue to bail out the private sector and enable the repayment of the private debt. So it starts out as private debt, because of this great imbalance in exports within the eurozone, and then that gets converted to government debt, and then the big crash of 2008-2009 adds even more debt, and then you have the recession of 2011-2013 in the eurozone and the 2012 bailout, which piled on more debt in order to pay the old debt, and then in 2015 the same thing. So the troika’s piling more debt on Greece in order for Greece to pay the previous debt, and that’s totally unsustainable. They’re going to have to expunge some of that debt. \\nOf course, the Germans, Wolfgang Schauble [the German finance minister] and the coalition in the north, does not want to allow that. And they don’t really want to change the eurozone, because the eurozone, while very imbalanced for the periphery, has benefited Germany significantly. [The Germans] dominate the finance ministers’ council in the EC and they dominate the ECB, and they’re just keeping the situation the way it is because it’s profitable for them. Demonstrators hold a poster against the austerity policy of Germany prior to a special session of the parliament Bundestag on negotiations with Greece for a new bailout in Berlin, Germany, Friday, July 17, 2015. (AP Photo/Markus Schreiber) \\nMPN: Why must Greek banks be nationalized, in your view? \\nJR: Look at the debt negotiations of 2010, 2012, and 2015. What happened was the ECB, which pretty much controls the Greek central bank — the ECB is just a council of central banks dominated by the Bundesbank [the German central bank] and its allies, so they have control — and what you saw in the negotiations is that in 2015, the ECB put the screws to the Greek economy, and Syriza collapsed and agreed each time the screws were tightened, bringing the economy to a halt. They couldn’t deal with the squeeze on the economy by the ECB. This brought the economy to a halt, squeezing it and of course not releasing loans that [the troika] had agreed to provide Greece under previous agreements. There was an economic squeeze that Syriza did not have a strategy to deal with, and eventually it capitulated. \\nYou’ve got to nationalize, make the Greek central bank and the banking systems independent of the ECB. Gain control over your economy once again, and that is one of several key steps to prevent the squeeze every time you attempt to renegotiate the debt or restructure the debt. Without an independent, Greek, people-controlled banking system, the eurozone and the troika will squeeze and bring Greece to its knees every time. We’ve seen that three times. You’ve got to nationalize the banking system, including the central bank, or if you want to just leave the central bank as part of the ECB structure, go ahead, but create an independent central bank authority elsewhere in the Greek government. \\nIn the U.S. during the Great Depression, the U.S. central bank had screwed up badly, and [President Franklin Delano] Roosevelt took over and had his Treasury Department take over and run the economy. Greece would have to set up a parallel central bank in its finance sector, and isolate and bypass the influence of the ECB through the Greek central bank. You would have to create a parallel currency as part of this and impose serious controls on bank withdrawals and capital flows outside the country, which Syriza did not really do, because the ECB and the troika opposed it. When you have all the capital, bank withdrawals and capital flight is another way of squeezing the country economically. FILE – In this Sunday, Oct. 18, 2015 file photo, a man walks past street art depicting Greek Prime Minister Alexis Tsipras and German Chancellor Angela Merkel in Athens, Greece. Tsipras’ decision to sign off on a bailout led to many in his left-wing Syriza party to quit in protest. \\nMPN: The current government in Greece has been continuing a policy of massive privatizations of Greek public assets, with profitable airports and harbors having been privatized in the past year, in addition to the recent selloff of the Greek national railroad for a total of €45 million ($49 million). What are the short- and long-term impacts of the privatization of such public assets? \\nJR: The short-term is that when you privatize them, under the aegis of the troika, if you sell below market prices, which a lot of these assets are being sold at, that’s profit on the sale for the investors who are buying up these assets. But once the assets are in private hands, where does the revenue go? Does it go back into Greece or does it go back into the pockets of the investors and the corporations and the banks outside Greece that are buying it up? Well, it goes out. It’s a form of capital flight. Money that is needed in Greece flows out of Greece. \\nThis is a new form of financial imperialism, wealth extraction in other words, that is being structured and managed on a state-to-state basis. It’s not 19th century British imperialism where they set up a factory in India, paid them low wages, and brought the textiles back to London to re-sell at a higher price. It’s not that kind of production imperialism. This is financial imperialism imposed on Greece, and it’s a new form that’s emerging everywhere, where you indebt the country and then you force the country to engage in austerity in order to pay the principal and interest on the debt, and you extract the income from the country. Privatizations are another form of that. \\nYou privatize public goods, you get them at fire-sale prices, and then the income flows from those assets flow back to the coffers of the private companies or the banks, outside of Greece. \\nThe other consequence is when you privatize, they come in and they cut costs, which means they lay off people in mass numbers, they put a hold on wages, they get rid of benefits, and they do everything else to maximize their revenue. \\nFinally, longer term, it means that Greece has less control over its own economy if it can’t control its infrastructure and everything is owned by foreigners. Then you can’t influence it as much, and if you’re part of the eurozone, you’re legally prohibited from what you can do to make sure that these foreign-owned infrastructure companies are behaving in terms of the benefit for the public sector, for the rest of Greece. \\nMPN: You have argued in your book, “Systemic Fragility in the Global Economy,” that there are nine major trends which account for the economic troubles that are seen on a global scale. What are some of these trends? \\nJR: Everywhere, and particularly since 2008, we see central banks and monetary policy to be ascendant, and that means creating money, pumping it into the economy to bail out the financial systems, the financial institutions, the banks and the shadow banks, meaning speculators, hedge funds, private equity firms, asset management companies, and so forth. We’ve seen bailouts of tens of trillions of dollars since 2008. All of that liquidity injection into the economy has driven interest rates down to zero or even, in Europe and Japan and elsewhere, negative rates, and that fuels debt. With rates that cheap, corporations and businesses float new corporate bonds, and they use the money not to invest necessarily, they use it to buy back the stock and drive up the stock prices and pay out dividends, or they sit on it, they hoard it, or they send it to emerging markets. That’s a problem everywhere, and that’s the result of massive liquidity injections, which have really been escalating since the 1980s, when controls on international capital flows were eliminated everywhere. \\nAfter the 1970s, when the Bretton Woods system collapsed and central banks took over, the combination of those has led to the financialization of the global economy in the 21st century, where profits are far greater for investing and speculating in financial securities than they are in investing in real assets and real things that create real jobs and real income and real consumption. We’re becoming dependent on debt more and more. The economy is increasingly credit- and debt-driven, and that’s the result of this massive liquidity injection, and it also leads to a shift from real asset investment — investing in real things that create jobs that people need — toward financial asset investment. That means that real investment collapses over time and productivity collapses over time as well, and we see that happening everywhere. \\nThat’s a major point that I argued about in my book, “Systemic Fragility,” this financialization of the global economy based on liquidity and debt and squeezing out. It’s diverting money and capital from real investment into financial speculation. What’s going on in Greece is a concrete expression of this, the reliance on financial means and financial manipulation. The periphery in the eurozone is at a great disadvantage to Germany and others, and they’re being manipulated financially. All the payments on interest and the debt flow back to the north. This is all flowing through the EC to the private sector, and it’s a nice constant money capital flow from interest payments and privatization and speculation on government bonds and securities and stocks in these countries as the volatility occurs. \\nIt’s a reflection, in Greece, of what’s happening on a broader scale elsewhere in the global economy, and that’s why we haven’t seen much of a recovery in the global economy. Global trade is stagnant and real investment everywhere is drifting toward zero, productivity is negative almost everywhere, even in the U.S., and we’re seeing growth rates of barely 1 percent, 1.5 percent, at best, when it should be double that. We see these growing, non-performing bank loans, almost $2 trillion in Europe, the worst in Italy with about $400 billion. We see the same thing in Japan and in China. We’re becoming more systemically fragile financially because of this shift to financial speculation. In this July 5, 2012 file photo President of the European Central Bank Mario Draghi speaks during a news conference in Frankfurt, central Germany. (AP Photo/dapd, Mario Vedder, File) \\n\\nMintPress: What is your outlook for the eurozone economy and the difficulties that it is currently facing? \\nJR: The European banking system has never fully recovered from the 2008-2009 crash. The ECB is pumping money into the banking system in various ways, long-term refinancing options and all the bailout funds and qualitative easing and negative interest rates and so forth. They’re desperately pumping money into the banking system, but the banks aren’t really lending, at least to those businesses that would reinvest in real assets to create jobs. It’s far more profitable to make money now. Investors make more money from financial speculation than they do from investing long-term and expecting to get a return over 10 to 20 years for investment in a real company that creates real things. \\nWe can see the strains now with the non-performing loans, in particular in Italy. Of course, we know the situation with the non-performing bank loans in Greece. Portugal is in bad shape as well in terms of non-performing loans, and now we see even institutions like [Germany’s] Deutsche Bank and others beginning to feel this strain, and the further impact on the European banking system of the “Brexit” [the departure of Great Britain from the European Union]. \\nThe problem is that the private banks are either hoarding the cash, they won’t invest in real growth, or they’re sending their money offshore to emerging markets, or they’re using it, as in the U.S., to buy back stock and pay out dividends and loaning money to companies to do just that. The global economy has changed dramatically in ways that make it much more fragile than ever before. A lot of debt has been building up everywhere: Over $50 trillion in additional debt has occurred since 2009, and when the next recession comes, how are they going to pay that debt? \\nWhen times are stable or growing, you can add debt without a great crisis emerging, but when you have a recession or a downturn that’s significant, where are you going to get the money capital to pay the principal and interest on the debt? Then you start seeing defaults and you start seeing financial asset price collapses going on, and now you’re back in 2008-2009. That’s the picture of the global economy. A farmer tries to protect himself as he clashes with a riot policeman during an anti-government protest at central Syntagma square in Athens, Wednesday, Nov. 18, 2015. Greek farmers protesting over planned tax and pension reforms demanded by the country’s bailout creditors have clashed outside parliament with police, who used tear gas to disperse them. (AP Photo/Yorgos Karahalis) \\nMPN: What would be the steps for Greece to follow, in your view, in order to escape the spiral of economic depression and austerity? \\nJR: Syriza made it clear, when it came into power, that it was not in favor of “Grexit” [a Greek departure from the eurozone], and it has always maintained that position. An unprepared, “we’re leaving the eurozone and the euro” kind of decision would cause a collapse of values, particularly among those who have investments in some savings in Greece. To some extent, Syriza was caught between a rock and a hard place here. They couldn’t or didn’t want to advocate an exit, and at least those who had investments didn’t want it because of the potential effect on their investments. The broader Greek populace thinks, still, that to be European you have to be in the eurozone. That’s a big mistake. \\nI think what Greece and Syriza should have done is to create a parallel currency and to take over its banking system. In other words, make the banking system truly independent, including the Greek central bank, and if that was not possible, bypass the Greek central bank and set up a central banking function in the finance ministry, as the U.S. has done at different times. Create a parallel currency, and policies and programs to get people to convert their euros into the parallel currency. Maybe declare that henceforth all taxes to the Greek government will be paid with the parallel currency, and that means that people would then trade in their euros for the parallel currency to pay their taxes. \\nThen tell the troika [the EC, the ECB, and the IMF — collectively, Greece’s lenders] that we’re going to pay you in your euros, but if we run out of euros here as a result of the conversion, well, tough luck, we don’t have a way of paying you, let’s negotiate a final deal where you expunge some of it and we pay you off and we go our separate ways. Of course, you would have to create significant capital flow controls, which has always been a problem every time there’s been a crisis; the money flows out of Greece. Take the economy out of the control of the troika without a formal exit. \\nThat could have been done, but for some reason Syriza and its finance advisers either didn’t want to do that or didn’t know how to do that. \\nMPN: Arguments that have been heard against a parallel currency include the claim that the existence of two currencies would create a situation where there would be “haves” and “have nots” — between those who would hold a stronger, hard currency, compared to those holding a weaker, devalued currency. How do you respond to this? \\nJR: There are policies and approaches you can take that entice and require people to convert their euros into the new currency. That would raise the demand and therefore the value, the price of the new currency. If you just had the currency and you didn’t have this forced trade-in, then of course you would have “haves” and “have nots,” the new currency would collapse, and pretty soon no one would want to use it. But, for example, saying that taxes could only be paid with the new currency, would force people who had corporations and businesses and so forth to purchase the new currency with the euro. It would undermine the value of the euro in Greece and it would raise the value of the new currency in Greece as well. That might set off a parallel elsewhere in the eurozone with other countries thinking the same thing, which would undermine the value of the euro and put the squeeze on the troika for once. Greece never put the squeeze on the troika, it was just the opposite in all of these negotiations that occurred, they never really hurt the troika in negotiations, and that’s the only way you prevail in negotiations. You’ve got to make it unpleasant for the opposition. Syriza never did that, they played along and made concession after concession. \\nSyriza thought that their example would strike a spark elsewhere in Europe of other social democratic forces and governments. They thought that they would get the rest of the social democracies behind them and together they would reform the eurozone. That was a fiction, a fantasy thought on the part of Alexis Tsipras and others, but that was the core of their whole strategy. European social democracy is a dying force, and that’s why you see the growth on the fringes, both to the right and the left. \\nTsipras and [former Greek finance minister] Yanis Varoufakis’ problem was that they thought they could get all these elements behind them and that together they would have enough weight to force Schauble and other finance ministers to make concessions. Well, Schauble and the other ministers, the “German faction,” as I call it, within the finance ministers’ council in the EC, remained dominant. At every step along the way, whenever Syriza and its few allies tried to make a compromise where some concessions were made to them, the German faction squelched it. We saw that, for example, at the very end, when [Greece held] the referendum in July 2015. Greece held the vote, and the vote said “go back and negotiate a better deal for us,” and what did Tsipras do? He totally caved in to the Schauble faction, and then the Schauble faction said, “The offer we made last week is now off the table, you’re going to have to accept an even worse one.” So they put the screws to Syriza, and Syriza looked to its allies in the EC, and they totally caved in as well. Things just got worse and worse until you had the final [austerity] agreement on August 20, 2015. \\nIt was a step-by-step retreat from [Syriza’s election in] January 2015, because Syriza had the wrong strategy and was not engaged in certain necessary tactics. Of course, the troika itself had a lot of cards to play. It would have been an uphill fight for Syriza. The time where they might have been able to strike some concessions from the troika was 2012, but New Democracy [the center-right party in power at the time in Greece] was totally in the pocket of the troika, so that was impossible. \\n[This past spring], the IMF and the troika were worried about “Brexit” and what impact that might have on renewing “Grexit.” So they put the screws to Greece again, raised the debt even more, austerity even more, and I think another round of that is coming, because the IMF wants out of the troika deal. We’ll see what happens at the IMF meeting, but they haven’t endorsed even the 2015 agreement because they know it’s unsustainable. I think the IMF is maneuvering to have the EC to buy its portion of the debt, and once that happens, the EC will demand even more austerity from Greece. President of France Francois Hollande, U.S. President Barack Obama, Britain’s Prime Minister David Cameron and Germany’s Chancellor Angela Merkel attend the Transatlantic Trade and Investment Partnership (TTIP) meeting at the G20 the G-20 leaders summit in Brisbane, Australia, Sunday, Nov. 16, 2014. \\nMPN: In the event that a parallel currency is implemented and steps are taken to maintain or strengthen its value, could that be a prelude to a switch to a national, domestic currency? \\nJR: Yes. At some point, one currency will become dominant. You can’t have two equal currencies like that. Another advantage of the new currency is that it will start out at less value than the euro, and that will be used as the trading currency. That will stimulate Greek exports to elsewhere, outside the eurozone. \\nPart of the problem is that the periphery in Europe is so dependent on exports and imports to Germany and the north, that it can’t really engage in its own independent export strategy without cutting wages. Throughout Europe, you have what’s called “internal devaluation,” when you are stuck with a currency and someone else’s central bank, the ECB and the euro. You can’t really engage in independent monetary policy to stimulate your economy and you can’t engage in lowering your currency in order to gain some advantage in exports. You’re stuck, and only the most powerful country that’s most efficient and has the lowest costs is able to take advantage of global exports, and that’s Germany. The weaker economies of the periphery will always be at a disadvantage to Germany when it comes to trying to push their exports anywhere else outside the eurozone. \\nThat’s the lesson. The lesson is that you’ve got a 1999 agreement in which you have this quasi-central bank, the ECB, and you have [the euro], and that arrangement significantly benefits the most efficient, low-cost producer, which is Germany, at the expense of the periphery. Until you have a true central bank and fiscal union to some extent, that will pump the money into the periphery to help it grow when it doesn’t, you will always have the situation you have in Europe right now. \\nCompare that to the U.S., where there’s a fiscal union, so that if certain states have economic problems … the federal government can pump money into those specific locations. If you don’t have a true federal government and fiscal union, you can’t do that, and if your central bank is dominated by the largest economy — Germany — even the monetary policy has no effect. And if it’s a single currency, it’s to the advantage of the stronger economy at the disadvantage of the weaker. \\nThe eurozone economy is structured to emphasize the growth of the strongest economies at the expense of the weaker, and that’s not going to change. It’s built into the eurozone. You cannot create a currency union and a customs union without a true banking union and fiscal union. More and more countries in the eurozone are beginning to come to that conclusion, but it was foreordained. Economists knew this from the beginning, and that’s the tragedy. Greece has tied its tail to the eurozone, dominated by Germany, and it can never get out of this situation as long as Germany dominates the institutions, which it does, because the whole arrangement is great for Germany. A protesters carries a protest sign during a rally prior to the opening of the new European Central Bank (ECB) headquarter in Frankfurt, Germany, Wednesday, March 18, 2015. At least four police cars were set alight and two officers injured Wednesday as authorities confronted violent anti-austerity protesters ahead of the inauguration ceremony for the European Central Bank’s new headquarters (AP Photo/dpa, Arne Dedert) \\n\\nMPN: Tell us about your most recent book, “Looting Greece.” \\nJR: It’s really a case study of the consequences of financialization and globalization and integration. I argue that there is this phenomenon of the smaller economies being tied into the larger economies through free trade agreements, which lead to currency unions, which lead to banking unions, and then you’ve got a situation like Greece and the euro periphery and the problems associated with that. \\nThe book also takes a historical look at the origins of the Greek debt, that starts in 1999 with the [creation of the] eurozone, the adoption of the euro by Greece in 2002 and the consequences of that, how the debt developed, first in the private sector because of German export domination and then conversion of the private debt in 2008-2009 to the public debt, and then the collapse of 2008-2009, which added to the government debt. Then you had the 2012 agreement where the private sector was bailed out, and that added more debt, and then 2015 and so forth. All this is described in detail in the early chapters, and then most of the book is a step-by-step look at the negotiations between Syriza and the troika, from [Syriza’s January 2015 election] through the spring of 2016, and what were the strategic and tactical errors of Syriza and the strategic and tactical moves by the troika which enabled it to prevail. \\nAt the end, [the book discusses] how this is a form of a new emerging financial and wealth extraction from smaller economies by the larger economies, because of the globalization and integration arrangement that exists, the emergence of financial extraction and financial exploitation, and how central banks are feeding that all. This will lead to my next book, which is about global central banks and the problems they’ve created as we move to another crisis, which I think is coming in the next five years. Demonstrators dressed as clowns pass by a burning police car Wednesday, March 18, 2015 in Frankfurt, Germany. Blockupy activists try to blockade the new headquarters of the ECB to protest against government austerity and capitalism. (AP Photo/Michael Probst) Be Sociable, Share!'"}, "time": 1742563126.1984577}