{"duration": 0.032309770584106445, "input_args": {"text": "'Romney won the county overall by about 17% (58-41) four years ago. So this is an area that is full of Republican voters. But let’s check out how the votes came in: \\nEV = Early voting. This is people coming in to a polling place to vote before Election Day. Romney barely won among early voters by a 51-49 (2%) margin of the two-party vote. This represents a huge +15% Democrat advantage over the final outcome. \\nAV = Absentee voters. These are people who mail in their ballots. Romney won among absentee ballot voters by a 60-40 (20%) margin of the two-party vote. This represents a small +3% GOP advantage over the final outcome. \\nED = Election Day voters. These are people who cast their ballots in person on Election Day. Romney won among Election Day voters by a 60-40 (20%) margin of the two-party vote. This represents a small +3 GOP advantage over the final outcome. \\nSo based on this data (and I have confirmed this when looking at other counties), Democrats are much better at casting early votes than they are at mailing in absentee ballots or showing up on Election Day. \\nSo. What are the 2016 election numbers for Lee County so far, you ask? Well, here you go – \\nEarly voting figures so far show a GOP advantage of 61-39 (22%) in the two-party vote. This is a 20-point pro-GOP swing over 2012. \\nAbsentee voting figures so far show a GOP advantage of 66-34 (32%) in the two-party vote. This is a 12-point pro-GOP swing over 2012. \\nThis data is indicative of a possibly huge Trump win in Florida, which is something that hasn’t been showing up in the statewide polls. This suggests that the polls are underestimating the turnout of Trump’s base. And if the polls are underestimating the turnout for Trump in Florida, then it is likely that they are likewise underestimating the turnout in other states as well. \\nAnd note: Virtually all of this vote data came before news broke that Hillary is back under FBI investigation. So the numbers could move even more in Trump’s favor between now and Election Day. \\nSome really good news about early voting numbers in Florida. Keep in mind that Obama won Florida in 2012 by less than 1% of the vote and that Democrats usually perform much better in early voting than they do on Election Day. \\nObama won Hillsborough County (Tampa) by 7 points in 2012. Early voting shows Dems outperforming GOP voters by a similar margin this year. \\nBUT Obama won Pinellas County (St. Petersburg) by 6 points in 2012, while the GOP actually has a slight early vote advantage there so far this year. \\nAND Romney won Brevard County (Melbourne/Cocoa Beach) by 13 points in 2012. The GOP currently holds about a 16% advantage over Dems in the early vote there. \\nPoint of the above data is this: Trump is on pace to significantly outperform Romney in the state of Florida, meaning he is quite likely to win the huge swing state and all of its Electoral College votes. \\nObama beat Romney by 1% in FL and 4% nationally in 2012. So, let’s call Florida 3% more pro-GOP than the country as a whole. It could well be that if Trump is beating Hillary by more than 3% in Florida (which is certainly possible given the early voting numbers), then that means he is actually AHEAD of Hillary nationally, and is on pace to win the popular vote, and is therefore quite likely to win the election.'"}, "time": 1742628538.3593054}