{"duration": 0.061521291732788086, "input_args": {"text": "'LOS ANGELES  —   With the   of “Moana” over the holiday weekend, the reinvigorated Walt Disney Animation Studios cemented its status as  ’s reigning powerhouse for   films. “Moana,” one of the   wide releases of the year, collected about $81. 1 million at domestic theaters over the   holiday weekend, enough to rank as the   Thanksgiving opening on record, behind only “Frozen,” which took in $93. 6 million for Disney in 2013. (Disney Animation Studios and its corporate sibling, Pixar, now hold the top six spots on that Thanksgiving records list.) Costing at least $300 million to make and market worldwide, “Moana” took in an additional $16. 3 million in limited overseas release, including in China, where the response was muted. “Moana,” which navigated various controversies en route to theaters, including one over an   Halloween   and one over an oversize male character, is a   musical   Miranda, the virtuoso behind the Broadway smash “Hamilton,” contributed to the score. After a fallow period in the 2000s, when Pixar reigned supreme, Disney Animation Studios has delivered one successful original film after another, including “Tangled,” “Frozen,” “  Ralph” and, earlier this year, “Zootopia. ” Pixar, lately focused more intently on sequels, has recently had an uneven track record with originals, finding a blockbuster in “Inside Out” but fizzling with “The Good Dinosaur. ” Among other new   offerings, Robert Zemeckis’s period spy drama, “Allied” (Paramount) did the best, collecting about $18 million, according to comScore, which compiles box office data. Had the film not cost a hefty $85 million to make  —   not including marketing expenses  —   that sales total would have been fine. As it is, “Allied,” which drew soft reviews, will likely go down as another misfire for Mr. Zemeckis and Paramount. The studio is counting on foreign audiences to pick up the slack in partial overseas release, “Allied,” starring Brad Pitt and Marion Cotillard, took in $9. 4 million. “Bad Santa 2” (Broad Green) fared poorly. Costing an estimated $26 million to make, it sold about $9 million in tickets. The original “Bad Santa,” now considered a crude comedy classic, arrived to $22 million in Thanksgiving ticket sales in 2003, after adjusting for inflation. Bombing outright was Warren Beatty’s “Rules Don’t Apply,” a romantic comedic drama set in the late 1950s. Independently financed for $27 million and distributed by 20th Century Fox, “Rules Don’t Apply” collected a breathtakingly bad $2. 2 million for the   period. The movie likely suffered from mixed reviews, Mr. Beatty’s   absence from movie screens and   marketing materials that failed to make the film seem relevant to contemporary  . Even so, it was a strong weekend over all for Hollywood, as a broad array of movies, including the   arrival of the Weinstein Company’s “Lion,” and sizzling holdovers, including “Fantastic Beasts and Where to Find Them,” generated wide audience interest. For the year to date, total ticket sales in North America stand at $10. 1 billion, a 4. 5 percent increase from the same period a year ago.'"}, "time": 1742628302.4389362}