{"duration": 0.021003007888793945, "input_args": {"text": "'Producer Ryan Murphy says season four of his FX crime drama American Crime Story will tackle the Monica   Clinton sex scandal. [Actress Sarah Paulson  —   who starred in the first season of the   anthology series, The People vs. O. J. Simpson  —   has been confirmed for a role, Murphy told E! News, but said she would not be playing   Lady Hillary Clinton.  “That’s earmarked for talks with somebody else,” he explained. “We’re casting that now. I can’t say what Sarah is playing, but it starts shooting at the end of this year. ” Murphy says the show will focus on “the other women” who were ensnared in the 1996 sex scandal, involving   House intern Monica Lewinsky, and the events that led to the impeachment of President Bill Clinton. “It’s a very interesting book,” Murphy says about CNN legal analyst Jeffrey Toobin’s book, A Vast Conspiracy: The Real Sex Scandal That Nearly Brought Down A President, which 20th Century Fox optioned the rights for last month. “It’s not really about Hillary Clinton. That book is about the rise of a certain segment of a   group of people who despised the Clintons and used three women, Paula Jones, Monica Lewinsky and Linda Tripp to try and tear him down. The Toobin book is amazing. And there are a lot of bizarre crimes within that book that you can highlight. ” “But the show isn’t really about Hillary Clinton, it really is about the other women. In fact, we might be doing the Clintons with hand puppets [laughs] I don’t know,” Murphy explains. “We’re more focused on the mechanizations behind the scenes to try and get [Bill Clinton] impeached. ” The first season of American Crime Story explored the O. J Simpson murder trial. The     swept the Emmys and Golden Globes. Murphy said season two will tackle Hurricane Katrina and season three will focus on the 1997 assassination of Italian fashion designer Gianni Versace. “We’re striking while the iron’s hot,” Murphy says of the   filming schedule. “But that was largely due to actors’ availability. If you get Annette Bening, which I did and she says, ‘You’ve got me these months,’ then that’s when you do it. ”   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742628607.1910067}