{"duration": 0.12400484085083008, "input_args": {"text": "'ABD’de reform mu olacak yoksa parçalanacak mı? yazan Thierry Meyssan ABD’deki başkanlık seçimi kampanyasını gözlemleyen Thierry Meyssan, eski ve ağır uygarlık çatışmasının yeniden hortlamasını analiz ediyor. Hillary Clinton bu seçimlerde programların değil ama « Amerikalıların kim olduğunu » bilme konusunun öne çıktığını açıkladı. Cumhuriyetçilerin önde gelenlerinin Donald Trump’a verdiği desteği geri çekmesi siyasi sorunlardan daha çok kişisel tutumu yüzünden. Yazarımıza göre ABD, bugüne kadar farklı ufuklardan gelen ve özel bir cemaatin ideolojisine boyun eğmeyi kabul eden göçmenlerden oluşuyordu. Bugün, ülkenin bizzat kendisini parçalama tehlikesi riskiyle çatlamakta olan bu modeldir.\\nVoltaire İletişim Ağı | Şam (Suriye) | 26 Ekim 2016 français Español italiano русский English Deutsch Português ελληνικά عربي Milenarist (yani dünyanın sonunun yaklaştığına inanan) seçmenlerin %73’ü Donald Trump’u beğenmiyor. %68’i demokratların adayı Hillary Clinton’un orta sınıfların haklarını daha iyi koruyacağını; %64’ü dış politika, %61’i ise ekonomi alanında rakibinden daha iyi olduğunu düşünüyor. Geçtiğimiz ABD seçim kampanyası yılı sırasında, retorik derinden değişti ve iki kamp arasında beklenmedik bir bölünme ortaya çıktı. Adaylar başta sadece siyasi konular (servet dağılımı ya da ulusal güvenlik gibi) üzerine konuşsalar da, bugün artık özellikle seks ve paradan bahsediyorlar.\\nCumhuriyetçi Partiyi –ki partinin başlıca liderleri adaylarından desteklerini çektiler- sabrını çatlatan ve siyasetin satranç tahtasını yeniden şekillendiren siyasi sorunlar değil, çok eski bir uygarlık bölünmesini hortlatan bu söylemdir. Bayan Clinton bir yandan siyaseten doğru olma çabası içerisindeyken, diğeri, yani « Donald » eski « First Lady »nin ikiyüzlülüğünü ortaya seriyor.\\nHillary Clinton, kocasıyla yattıklarını itiraf eden kadınları hedef almaktan ve lekelemekten çekinmemesine rağmen, bir yandan kadın-erkek eşitliğini savunurken, kendini kişisel nitelikleriyle değil ama eski bir Başkanın eşi olarak sunarken, kadın cinsiyetine karşı duygularını gizlemediği için Donald Trump’u kadın düşmanlığıyla suçluyor. Diğer yandan Donald Trump Devletin özelleştirilmesi sürecini ve Dışişleri Bakanlığından randevu elde edebilmeleri için Clinton Vakfı aracılığıyla yabancı şahsiyetlerden para sızdırılmasını; ObamaCare’in kuruluşunun yurttaşların değil ama sağlık sigortalarının yararına hizmet ettiğini teşhir ediyor ve işi seçim sisteminin doğruluğunu tartışmaya kadar götürüyor.\\nDonald Trump’un kendini ifade etme tarzının ırkçılığı yüreklendirdiğinin tamamen farkındayım ama Clinton yanlısı medyaların çıkarttığı patırtıya rağmen bunun seçim tartışmasının merkezinde olduğunu hiçbir şekilde düşünmüyorum.\\nLewinsky olayı sırasında, Başkan Bill Clinton’un ulustan özür dilemesi ve selameti için rahipleri bir araya getirmesi önemlidir. Oysa bir ses kaydı aracılığıyla benzer olgularla suçlanan Donald Trump, din adamları sınıfından yardım dilenmeden sadece hedef aldığı kişilerden özür dilemekle yetinmiştir.\\nBugünkü bölünme, ABD’de Presbiteryenler, Vaftizciler ve Metodistler tarafından temsil edilen Kalvinistlere karşı Katolik, Ortodoks ve Luther’cilerin değerlerinin isyanını yeniden gündeme getirmektedir.\\nHer ne kadar iki aday da püriten gelenek içerisinde eğitilmiş olsalar da (Clinton Metodist ve Trump Presbiteryen), Bayan Clinton Babasının ölümüyle birlikte dinine geri döndü ve bugün silahlı kuvvetler genelkurmayının The Family adı verilen ayin gruplarına katılıyor. Trump’a gelince daha içsel bir tinsellik uyguluyor ve o kadar sık tapınaklara gitmiyor.\\nTabi ki, kimse yetiştirildiği şemalar içerisinde kapalı kalmıyor. Ama düşünmeden hareket ettiğimizde, haberimiz olmadan bunları üretiveriyoruz. Herkesin dini çevresi sorunu dolayısıyla önemli olabilir.\\nNeler olduğunu daha iyi anlayabilmemiz için XVIInci yüzyıl İngiltere’sine geri dönmemiz gerekiyor. Oliver Cromwell, yaptığı askeri darbe ile Kral I.Charles’ı devirir. Bir Cumhuriyet kuracağı, ülkenin ruhunu arındıracağı iddiasında bulundu ve eski hükümdarın kellesini uçurdu. Kalvin’in düşüncelerinden esinlenen sekter bir rejim kurdu, Papa’ya bağlı İrlandalıları kitlesel olarak katletti ve püriten yaşam tarzını dayattı. Aynı zamanda Siyonizm’i de tasarladı: Yahudileri İngiltere’ye geri çağırdı ve Filistin’de bir Yahudi Devletinin kurulmasını talep eden dünyanın ilk Devlet başkanı oldu. Bu kanlı serüven, « Britanya’nın ilk iç savaşı » adıyla anılıyor.\\nMonarşinin yeniden kurulmasından sonra, Cromwell’in Püritenleri İngiltere’den kaçarlar. Hollanda’ya yerleşirler ve aralarından bazıları Mayflower gemisiyle Amerika’ya giderken (« Pilgrimler »), bazıları güney Afrika’da Afrikaneer topluluğunu kurarlar. XVIIInci yüzyıldaki ABD Bağımsızlık Savaşı sırasında, Kalvinistlerin Britanya monarşisine karşı mücadelesine yeniden tanık oluruz. Bu mücadele, Britanya tarihi güncel el yazmalarında « İkinci İç Savaş » olarak tanımlanır.\\nXIXncu yüzyıldaki İç Savaş, Güney Devletleriyle (genelde Katolik kolonların yaşadığı) Kuzeydekileri (daha çok Protestan kolonların yaşadığı) karşı karşıya geldi. Galip gelenlerin yazdığı tarih bu çatışmayı köleliğe karşı özgürlük kavgası olarak sunuyor ki bu propagandadan başka bir şey değildir (Güney Devletleri, Britanya monarşisiyle bir ittifak anlaşmasına vardıklarında köleliği kaldırmışlardır). Dolayısıyla da, Püritenlerle İngiliz tahtının çatışması yeniden karşımıza çıkar ki bazı tarihçiler bu yüzden burada bir « Üçüncü Britanya İç Savaşından » söz ederler.\\nXXinci yüzyıl sırasında, Başbakan David Llyod George’un « konformist olmayan Hıristiyanlarıyla » Birleşik Krallıkta yeniden ortaya çıkmasını saymazsak, Britanya uygarlığının bu iç çatışması bitmiş gibidir. Bunlar İrlanda’yı bölerler ve Filistin’de « Yahudi ulusal yurdunu » yaratmaya girişirler.\\nNe olursa olsun, Richard Nixon’un danışmanlarından biri olan Kevin Philips, bu iç savaşlarla ilgili geniş kapsamlı bir tez hazırlar, sorunların hiçbirinin çözülmediği tespitinde bulunur ve bir dördüncü çatışmanın duyurusunu yapar [ 1 ].\\n40 yıldan beri kitlesel olarak Cumhuriyetçilere oy veren Kalvinist Kilisesinin müritleri, artık Demokratları destekliyor.\\nBayan Clinton’un ABD’nin yeni Başkanı olacağından ya da Bay Trump seçildiğinde, hızlı bir şekilde ortadan kaldırılacağından şüphe etmiyorum. Ama birkaç ay içerisinde, geridöndürülemez bir demografik gelişim temelinde seçmenler topluluğunun yeniden şekillenişine tanık oluyoruz. Halkın dörtte birinden fazlasını bir araya getiren Püriten kökenli Kiliseler, Demokratların kampına doğru kayıyor. Modelleri tarihsel bir kaza gibi görünüyor. Güney Afrika’da ortadan kalktı ve ne ABD’de, ne de İsrail’de daha çok hayatta kalması mümkün değil.\\nBaşkanlık seçiminin ötesinde, ABD toplumu hızla gelişmek ya da yeniden parçalanmak durumundadır. Gençliğin Püriten vaizlerin nüfuzunu kitlesel olarak reddettiği bir ülkede, eşitlik sorununu başka yöne kaydırmak artık mümkün değildir. Püritenler tüm insanların eşit olduğu ama eşdeğer olmadığı bir toplum öngörüyorlar. Lord Cromwell İngilizler için bir cumhuriyet istiyordu, ama ancak Papa yanlısı İrlandalıları katlettikten sonra. Böylece bugün ABD’de bütün yurttaşlar kanun önünde eşittir, ama aynı yasal metinlerden hareketle, mahkemeler aynı cinayet ya da suçlarla ilgili beyazlar için hafifletici nedenler bulurken sistematik olarak siyahları mahkum etmektedir. Ve eyaletlerin çoğunda, hız ihlali için dahi olsa ceza alınması durumunda, oy kullanma hakkı kaldırılıyor. Bunun sonucunda, beyaz ve siyahlar eşittirler, ama bazı eyaletlerde, siyahi insanların birçoğunun aynı şekilde oy kullanma hakkı elinden alınmıştır. Bu düşüncenin paradigması, dış politikada, Filistin’de « iki Devletli çözümdür »; eşit, ama özellikle eşdeğer olmayan.\\nRahip Carter, Reagan, Bush (Sr. ve Jr.’in her ikisi de Pilgrimlerin torunlarıdırlar), Clinton ve Obama yönetimlerini, kendi ülkelerinin ideallerine aykırı bir biçimde Vahhabiliği ve bugün de IŞİD’i desteklemeye Püriten düşüncesi itmiştir.\\nGeçmişte Pilgrimler, Plymouth ve Boston’de ABD’nin ortak hafızasında idealleştirilen topluluklar oluşturdular. Oysa tarihçiler biçimseldirler, « Yeni İsrail »’i oluşturduklarını söylüyorlardı ve « Musa’nın Yasasını » seçerler. Tapınaklarına Haç değil ama Yasanın Masalarını yerleştirirler. Zaten Hıristiyan olmalarına rağmen, Yahudi yazmalarına İncil’den daha çok önem veriyorlardı. Kadınlarını başlarını örtmeye zorladılar ve bedensel cezaları yeniden gündeme getirdiler.\\nThierry Meyssan Çeviri\\nOsman Soysal'"}, "time": 1742562368.4686449}