{"duration": 0.11034870147705078, "input_args": {"text": "'Planetary Activation Organization 12 Lamat, 11 Tzec, 13 Caban Selamat Jalwa! The process of clearing this land of its human vermin continues. The minions of this realm remain easy to find and arrest. They truly believe that the Light cannot obstruct their positions of power. Swiftly, they are discovering an awful truth. Their errant ways can no longer be tolerated. The rule of the dark is quickly ending and being replaced by various versions of “GESARA.” When the clearing of this unholy riff-raff is complete, those who hold the funds are to easily let this immense wealth run its course across this globe. You are to receive an abundance that is to forever end the wicked hoarding of the dark and its foolish minions. Never forget how the dark so evilly prevented you from receiving the resources that you urgently need to remake this reality. It is vital that you see this immense wealth as a way to ensure that your dreams come true. It is your confident and successful dreaming that is to allow you to let go of your unfounded fears and continuing belief that you are less than others. You are all a wondrous union of potential that needs to manifest in every way possible. \\nBe able to see yourself as a most valuable member of this global union and learn of your sovereign right to manifest your dreams. That is how this collective can produce creative solutions for a new reality. You have within you a profound wisdom. Do not think your dreams are unworthy. You are an important part of this collection of surface humanity. Constantly connect to one another and in so doing, realize how this continually flowing set is contributing to the changing of the whole. Adopt a position where you intuitively realize that this never-ending operation is framing your new reality. We are here, as is Heaven, to oversee this process. Feel free to contribute your own wonderfulness to this organic whole. Let the old ways and beliefs go. This is to be a new time, filled with freedom and prosperity. You need to let go of the control issues planted in you so meticulously by the dark. Welcome the playfulness of the Light and discover the magnificence of who you really are. This is just the precursor for this new age of spiritual discovery! \\nThis new age of discovery is really about understanding how the Light creates its realities. You are quickly learning this, and getting a glimpse into its exquisite intricacies. This new life of yours is to be founded upon your dreams and the operation of the Light within. You have long been in denial of how to transform by learning to truly be yourself. Long ago, you were a picture of inner creativity. The limits taught by those around you began at first to hinder you. Later, those limits turned into the walls that now enclose you. This imposed sense of limitation needs to be cracked open and totally abandoned. Instead, you require a new prototype. One that, seeing again your primitive playfulness, lets it take over. You feel, somehow, that this process is inappropriate. You need to end this feeling. Replace it with a need to see just how you can measure where you fit into the whole. This gauge is within you. Spirit gave it to you when you were born. All that is required is to know how to recognize it. This is the task that our mentors intend to explore with you. \\nBegin, therefore, to explore how it feels to be limitless in your resources. Look inside and, with intent, carefully explore your priorities for each of your dreams and how they fit into a magnificent whole. Use this grand framework to determine how you wish to manifest them. This, of course, is just a start. Look around and discuss all of this with your closest friends and family. We intend to fully expand this with you. Our mentors’ first task is to allow you to let go of fears and any other deep perceptions that can limit you. Our desire is to have you discover how amazing you truly are. This process is needed to empower you to eliminate your old perceptions. Ever bear in mind that you have an immense potential that is to be expanded to whatever you are able to perceive. This potential is a major element that your mentor is to weave and then explore with you. This operation may take some time to fully understand. We therefore intend to show you how this plan can open you to comprehensively fulfill your dreams. In this lies the key to your vast potential! \\nNamaste! We are your Ascended Masters! We come to emphasize the fact that your realm is changing for the better. Those who doubt this change need only look around and see that the posturing of the dark and its many minions has yielded nothing but distraught hopes for a success that is now truly unattainable. It is essential that those who hold visions similar to our own realize that this new world is indeed at hand! Let us together request first of Heaven and then demand of our governments that a system of governance be implemented for all to see. Heaven set up a timetable with the dark. The time draws near, Dear Ones, when this miracle is to manifest. Therefore be ready to explain, when approached, that the new ways come to rejoice! In this joy we can all leave undisturbed the years of frustration. Let go of all the tragedy that surrounds you. This is a time when your many dreams are to manifest and the old ways are finally to be done with. Let this bell of freedom ring out again and again throughout this realm! \\nEach of you since childhood has had a series of special wishes that were modified many times as you grew older. Liberate these grand visions. Acknowledge how deeply they can bring you great joy. Heaven sincerely wishes to make all of this happen. The wealth and benefits that make it possible for this to be realized are what all in Heaven intend to accomplish. The exalted Creator of all has been decreeing this for millennia. As we have mentioned before, a divine timetable is in effect. This time has been divinely set. This sacred time is near. We Masters are doing all that is necessary to bring this glorious moment to Gaia. Developments are currently underway to achieve this sacred event. Thus, it is necessary for you to bring forth your light so that this event may unfold now. Thus, it is essential that all be diligent in manifesting the last grand event. Please persevere in this task. \\nLong ago, the surface of this realm seemed extremely dismal. The Anunnaki were everywhere. Their dark deeds, intensified by the insanity of ritual murders and constant war, were the rule of the day. In the past century and a half, this darkness has begun slowly to lift. Now you are at the very edge of the Age of Light. What at one time seemed impossible is to occur. Now that this growing consciousness has reached a general awareness, some mighty miracles are coming to pass. Continue to work for the Light! Know that the darkness is slipping away. We Masters notice this every day. Become ever more confident of this. The dark is being forced to relinquish its torture of you. Potential wars will not come to fruition. An aura of peace is descending upon this blessed land. A time for wondrous events to suddenly appear is indeed near. Never lose your faith! Remain positive and expect even more miracles to occur! \\nToday, we have reported yet again what is unfolding around this precious orb! Announcements for many things long wished for are in place! A new time for all is upon us! Be prepared to be a most joyous part of this! Know, dear Ones, that the countless supply and never-ending prosperity of Heaven are indeed yours! So Be It! Selamat Gajun! Selamat Ja! (Sirian for Be One! and Be in Joy!)'"}, "time": 1742563438.9904733}