{"duration": 0.047661542892456055, "input_args": {"text": "'Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nSo much for the media narrative that there is a so-called “enthusiasm gap” between Clinton and Trump. Watching a Florida crowd roar as Hillary Clinton delivers a powerful speech in a downpour shows just how seriously people are taking this election. Clinton voters are just as motivated for her as Trump’s are for him, perhaps more so. \\nClinton was in Broward County, a crucial Democratic stronghold in what could be the deciding state of the election. The weather wouldn’t cooperate , with intense rains off-and-on in the lead up to the event, but it didn’t dissuade rally goers. By the time Hillary got up to the stage, the crowd was soaked but the atmosphere was electric. After a brief moment of sunshine, the rain returned in force. Hillary kept going. Clinton speaking a rally in Florida when it started to POUR. The crowd went nuts. pic.twitter.com/5xp2iZgf1V \\n— David Mack (@davidmackau) November 5, 2016 \\nThe crowd was roaring. The mood was positive. It was everything that Donald Trump and his allies in the media claim you don’t see at a Clinton rally. And it was in Florida, the state that could put Hillary over the top and the state that Trump must win to even have a hope of being elected. Watching Hillary’s rally probably sent a chill down the spines of Trump’s campaign staff. \\nHilariously, just yesterday, Trump got caught lying about the turnout of his own rally. According to his own account, “thousands” of people were left outside of his rally because it was too packed. Reporters on the scene debunked this claim instantly. Trump says \"thousands and thousands of people\" are standing outside. I am outside. There are maybe 500 people. pic.twitter.com/qKRNQYqBid \\n— Daniel Dale (@ddale8) November 5, 2016 \\nThis is not to say that Democrats can get complacent. In the closing weeks of the election, the polls have become disturbingly close. RealClearPolitics puts Clinton only 1 point ahead of Trump in Florida. It’s clear that this race will be won or lost based on which side’s supporters get to the voting booth. For Clinton, it’s a good sign that Floridians are showing that they will come out for her rain or shine. \\nFeatured image via Twitter'"}, "time": 1742562167.9198315}