{"duration": 0.07790017127990723, "input_args": {"text": "'Sen. John McCain wasted no time at the Munich Security Conference in Germany on Friday as he portrayed the Trump administration as being in a state of “disarray,” in contrast to the message of reassurance from administration officials. [McCain used the recent departure of National Security Adviser Michael Flynn to defend his portrayal of the administration as in “disarray. ”  “I think that the Flynn issue obviously is something that shows that in many respects this administration is in disarray and they’ve got a lot of work to do,” he said, according to the Huffington Post. McCain lauded Secretary of Defense Gen. James Mattis: “The president, I think, makes statements that on other occasions he contradicts himself. So we’ve learned to watch what the president does as opposed to what he says. ” McCain commented that his job was to work with President Donald Trump on areas where they agree. He spoke of the three coequal branches of the United States federal government, remarking on Trump’s recent   temporary travel restriction executive order: “I can assure you that    …     what we just saw on the immigration order that both the legislative and the judicial branches will be exercising our constitutional responsibilities. ” A senior White House foreign policy adviser told reporters this week that Vice President Mike Pence would seek to reassure U. S. commitment to European partners and the transatlantic alliance at the conference. In opening remarks to the conference, McCain said: I know there is profound concern across Europe and the world that America is laying down the mantle of global leadership. I can only speak for myself, but I do not believe that that is the message you will hear from all of the American leaders who cared enough to travel here to Munich this weekend. The senator continued, “These are dangerous times, but you should not count America out. ” McCain then pointed out that Secretary of Defense James Mattis, Vice President Pence, Secretary of Homeland Security John Kelly, and a bipartisan congressional delegation traveled to the conference. A senior administration official told reporters this week that the vice president is attending the security conference on behalf of the President of the United States. Austrian Foreign Minister Sebastian Kurz remarked that there was “still a lot of uncertainty,” according to the Post. Kurz said the “big topic” at the conference has centered around what to expect next from the United States. “Today, on behalf of President Trump, I bring you this assurance. The United States of America strongly supports NATO and will be unwavering in our commitment to this transatlantic alliance,” the vice president stated in a Saturday speech to conference participants. “For our part, thanks to President Trump, the United States will be stronger than ever before. Our leadership of the free world will not falter, even for a moment. ” Pence continued, “Today, tomorrow, and every day hence  —   be confident, that the United States is now and will always be your greatest ally. ” In closing, Pence said, “Our choice today is the same as it was in ages past: Security through shared sacrifice and strength, or an uncertain future characterized by disunity and faltering will. The United States chooses strength. The United States chooses friendship with Europe and a strong North Atlantic alliance. ” Follow Michelle Moons on Twitter @MichelleDiana.'"}, "time": 1742563872.7268257}