{"duration": 0.019811391830444336, "input_args": {"text": "'You are here: Home / US / Look What Students FORCED To Do After Muslims FLOOD Germany Look What Students FORCED To Do After Muslims FLOOD Germany October 27, 2016 Pinterest \\nIs this coming to the United States? \\nChildren in school in Germany are being taught to chant Islamic prayers, including the phrase “Allah Akbar,” which is used before Radical Islamists commit terrorist attacks. \\nThe father of a girl at a school in Garmisch-Partekirchen, Germany, discovered his daughter was forced to learn the Islamic prayer when he found a handout she was given, The Express is reporting . He said his daughter was “forced” by teachers to memorize the Islamic chants and forwarded the handout to a news organization in Australia. \\nThe handout read: “Oh Allah, how perfect you are and praise be to you. Blessed is your name, and exalted is your majesty. There is no God but you.” \\nIt had been given to the girl during a lesson in “ethics” at the Bavarian school. \\nHeadteacher Gisela Herl did not confirm the incident when questioned, but said the school would issue a written statement detailing its position in the coming week. \\nThe incident comes just weeks after parents complained to German newspaper Hessian Niedersächsische Allgemeine (HNA) that their children’s nursery was refusing to acknowledge “Christmas rituals” to accommodate the “diverse cultures” of other pupils. \\nThe Sara Nussbaum House daycare centre in Kassel refused to put up a Christmas tree, tell Christmas stories or celebrate Christmas in general because it said only a minority of pupils were Christian. \\nA spokesman for Kassel explained: “There will be no Christmas celebrations, in the strictest sense. Because the majority of children at this kindergarten are not Christian the festival will not be celebrated in the way that it is at other schools.” \\nMigrants now outnumber native children at many schools in Germany as the country has been inundated with migrants in recent years. \\nMore than one million migrants are estimated to have arrived in Germany during the last year alone. \\nThe Federal Office for Migration and Refugees estimates that another 200,000 people will apply for asylum in 2017.'"}, "time": 1742628505.3881588}