{"duration": 0.2537851333618164, "input_args": {"text": "'When democracy is at its best, elections are the civilized version of warfare: clashes of wit, personality and ideas that seek to resolve a nation’s biggest arguments. But sometimes an election is just a dirty fight. When Donald J. Trump arrived in Albuquerque last week, stepping from his   jet into an aircraft hangar that was thronged with baying supporters, he held his arms aloft like a champion boxer. His speech opened with dutiful attacks on Obamacare, the Iran nuclear deal and immigration. But it was when he uttered a single word  —   “Hillary”  —   that the crowd truly erupted. “Lock her up!” The roar filled the hangar. Mr. Trump paused his speech, then smiled. Two days later and 1, 500 miles away, Hillary Clinton punched back. Slamming her rival’s “dark and divisive vision,” she alternated between mocking Mr. Trump and painting him as a threat to America and global stability. Would America’s nuclear codes be safe in his hands? she asked the crowd at her own rally in Orlando, Fla. What about black people? Latinos? A harsh,   quality crept into her voice. This was the biggest election of their lives, she told supporters. “Now,” she said, “go and vote. ” I will not be voting in this election I’m Irish, and I’ve never lived in the United States. But since July, I have traversed the country to report on its extraordinary, bewildering campaign from a foreigner’s perspective. After the Republican and Democratic National Conventions, I met voters at a coal mine in West Virginia, at ranches along the Mexican border, inside casinos in Las Vegas and outside the gleaming black edifice of Trump Tower in Manhattan. Here is a video with comments from a few of them. As Nov. 8 approached, I wanted to see the candidates up close. I went to 10 rallies in six states, traveling more than 6, 000 miles (that’s nine flights in four days). After all that, I didn’t get closer than 30 yards from either candidate. The view was often better on television. Yet as they galloped down the home straight of this bitterly contentious race, the trip revealed less a snapshot of America than a measure of its temperature. Rallies felt like injections to the vein, jolts of political energy driven by voters who stood for long hours in crowded halls, cheering leaders they could barely see for promises that may never be fulfilled. But venom, not hope, was a driving force. Fear and loathing course through both campaigns, driven on one side by Mr. Trump’s   populism and on the other by Mrs. Clinton’s apocalyptic warnings of the consequences if he wins. Lurid personal attacks, insinuations of   rampant conspiracy theories  —   I might have been in Pakistan, where I lived for nine years, or at my current base in Egypt. In this election, America’s shining city on the hill, it seems, has more in common with those countries where the electricity blinks on and off. Below, some snapshots and notes from my time on the trail, first with Mr. Trump, then with Mrs. Clinton. LAS VEGAS, Oct. 30, 11:10 a. m. To see Mr. Trump speak live is to understand his wild popularity with a section of the electorate. In three nationally televised debates, he often came across as a blustering, barracking bumbler. But in the gilded ballroom of the Venetian hotel and casino, he is in complete control. He channels the energy of the crowd, listening as he speaks. When he hears the right note of approval, Mr. Trump amplifies his message and bounces it back, usually with one of his trademark   catchphrases. “Drain the swamp!” the crowd yells on cue  —   a reference to the swamp upon which Washington, D. C. was built. Then: “Build the wall” on the Mexican border. And: “Lock her up!” 11:43 a. m. We’re standing at the ballroom side door, having been hustled out by campaign aides before Mr. Trump finished. The jaded campaign reporters who have heard this speech dozens of times say the closer in perfect sync: “Make America great again!” Then we are herded into a giant service elevator that deposits us in the bowels of the casino where, among the concrete pillars, a convoy of gleaming black vehicles and burly Secret Service agents is waiting. Mr. Trump follows within minutes. I press up against the window of the press bus. The candidate walks briskly, but his shoulders are drooped, as if deflated by the effort of the speech. He steps into a   drive, and the convoy sets off for the airport. This, it turns out, is the closest I will get to him. McCARRAN INTERNATIONAL AIRPORT, noon. The Trump press plane offers several advantages over commercial air travel: There’s no   and there are no luggage limit or irksome restrictions about seatbelts or cellphone use. Every seat is business class (my bill for two days topped $5, 000). The crew is obliging, and the alcohol and   are free. You can eat during takeoff. But you don’t get to see the star. In a break with campaign tradition, Mr. Trump has declined to share a plane with the traveling press. He flies in his private Boeing 757  —   fancifully nicknamed Trump Force One  —   with its   gold taps and retinue of advisers. GREELEY, Colo. 2 p. m. When a Trump crowd unleashes on Mrs. Clinton, it is hard not to think of Orwell’s dystopian novel “1984,” when the people were allowed to spend two minutes every day venting hatred for the party’s enemy. Yet individually, many Trump supporters are a far cry from the snarling caricatures. At the University of Northern Colorado, they are cheery and polite, an odd mix of the prim and the profane: schoolteachers and churchgoers in sensible shoes, paunchy   men in tattoos and biker leathers. They seem to exult in the solidarity of the crowd, defiant in their identity as “deplorables. ” To them, Mr. Trump can do no wrong the problem is politics. Les Potts, a retired preacher, tells me that he worries about the progressives’ gaining control of the Supreme Court and the spread of communism. Is America not the global center of capitalism? No, he insists. “People are fed up,” he says. “In Washington, we need some big changes. And I don’t think we’ll have that without a revolution. ” GRAND RAPIDS, Mich. Oct. 31, 2 a. m. Confusion at   means that I spend 15 minutes hunting for a   room that, it turns out, is on the sixth floor.   I collapse into bed. 10 a. m. It’s Halloween, so “Werewolves of London” has replaced Pavarotti as the   music at Deltaplex Arena. The Statue of Liberty is posing for pictures, along with Laurie Sanger, in an orange jumpsuit, a blond wig and handcuffs: a jailbird Hillary Clinton. Ms. Sanger, who is 33 and works at a furniture factory, explains: Mrs. Clinton is a corrupt criminal, “bought and paid for by special interests  —   she deserves jail. ” Ms. Sanger’s placard is sponsored by infowars. com, a conspiracy website that, thanks to Mr. Trump, has leapt to prominence. It’s also a sign of the times: Thanks to Mr. Trump, fringe ideas are now aired in the mainstream, prejudice masquerading as fact. Danny Popma, a local factory owner, tells me that the Muslim community in Detroit  —   the largest in America  —   was implicated in  . WARREN, Mich. 4 p. m. Winning is a big part of Mr. Trump’s sales pitch. But what he’s offering feels like a defensive victory, a retrieval of lost glory rather than anything new. At Macomb Community College, north of Detroit, he paints a dismal picture of American foreign policy, laying the chaos of the Middle East  —   Libya, Syria, Egypt and Iraq, and the death of four Americans in Benghazi in 2012  —   at Mrs. Clinton’s doorstep. To him, the entire world is a stage of American humiliation, with a declining military and abandoned veterans. It resonates with people in the crowd. To them, Mr. Trump offers to salve fallen pride, flex American muscle and renew bruised notions of American exceptionalism.   NORTH OF TAMPA, Fla. Nov. 1, 1:15 p. m. I’m in an Uber, having left the Trump bubble to meet up with the Clinton camp in Florida, the most famous of the famous swing states, where Al Gore lost it all by a sliver in 2000. Rush Limbaugh, the     king, is on the radio, pouring cold water on suggestions that Mr. Trump is losing and basking in the email scandal that has exploded over the Clinton campaign  —   again. Nobody knows what was in these latest emails, not even the F. B. I. director, who revealed their existence. But that’s not the point. Mrs. Clinton’s emails have acquired a talismanic power in this election, a digital dung heap that embodies the negatives she has struggled to shake off: defensiveness, reflexive secrecy, the whiff of shortcuts and sharp practice. The candidates are neck and neck here in Florida, bombarding each other with negative ads. It’s hard to avoid them on TV: images of a vampirelike Mrs. Clinton, or Mr. Trump slinging insults at women. “I can’t wait till this is all over,” my Uber driver says. DADE CITY, Fla. 3:23 p. m. Waiting for Mrs. Clinton, I log on to the press   network: The password is “stronger together,” the campaign slogan. Yesterday it was “Trump Train. ” Everything is an opportunity for messaging in a modern campaign. Before the candidate arrives, a few of her supporters wilt under the scorching sun and are carried out for first aid. What strikes me among the older supporters is the intensity of their animus toward Mr. Trump. He is, one man tells me, “pure evil. ” Nancy Perkins, 64, a retired nurse, says she has unfriended every Trump supporter on Facebook: “I don’t need people like that in my life. ” The   act is Alicia Machado, the onetime Miss Universe who became an election argument when it emerged that Mr. Trump had once called her “Miss Piggy” and “Miss Housekeeping. ” Now the Clinton campaign has deployed her. Her voice quivers as she recounts how he called her ugly. “He’s the ugly one!” yells a man in a wheelchair at the back of the crowd. “Monster!” 4:34 p. m. A few hundred yards from the rally, a clutch of Trump supporters are yelling, “Lock her up!” As the press bus pulls away, the Trumpsters run around outside the window, laughing and making wild gestures. FORT   INTERNATIONAL AIRPORT, Nov. 2, 12:13 p. m. Wheels up: In the campaign’s final sprint, candidates often move east to west, exploiting the changing time zones to fit in more events. Much has changed since Timothy Crouse wrote “The Boys on the Bus,” his gritty account of covering the 1972 presidential campaign, and it’s not just Twitter’s replacing typewriters. Today, most of the   Clinton correspondents are women, so testosterone levels have fallen, too. Unlike Mr. Trump, Mrs. Clinton travels on the same plane as the press. But it’s a distinction without a difference: She is ensconced behind a curtain near the nose. That’s new only a few weeks ago, when the polls showed her with a comfortable lead, Mrs. Clinton sometimes strolled back to field questions. But then the F. B. I. email scandal hit. Polls tightened. Mrs. Clinton dispatched her aides to press the press. LAS VEGAS, 2 p. m. I’m back where I started with Mr. Trump. But instead of a fancy casino, Mrs. Clinton’s rally is in the rather prosaic headquarters of the city’s plumbers and pipe fitters union. Burly men walk around in “Carpenters for Hillary”   there are a lot of Hispanic supporters in the crowd. Here, Mrs. Clinton’s focus is Mr. Trump’s attitude toward immigration. She talks about what his “dark and divisive vision” would mean for blacks, Mexicans and Muslims. “Imagine what it would be like to have him in the most powerful office in the world on Jan. 20,” she says.  McCARRAN INTERNATIONAL AIRPORT, 5:27 p. m. For the short hop to Phoenix, I get switched into the chase plane  —   an executive jet, all walnut trim and bottled beer, for the reporters who do not fit on Mrs. Clinton’s plane. The press wrangler is Andrea, a consultant from Las Vegas who artfully dodges questions about whether she wants a job in a future Clinton administration. TEMPE, Ariz. 9:50 p. m. After a rally at Arizona State University with 15, 000 people  —   huge by Clinton standards  —   her convoy is at a standstill. The Chicago Cubs and the Cleveland Indians are heading into extra innings in the final game of the World Series. Mrs. Clinton, who was born in the suburbs of Chicago, is watching on an iPad and cheering for the Cubs, who haven’t won the championship in 108 years. On the press bus, the Twitter messages and filing of stories have halted reporters crowd over the dim glow of a laptop where someone has managed to stream a live feed. The bus erupts in cheers when the Cubs clinch the title with a final out. Mrs. Clinton allows herself to celebrate, holding aloft the Cubs’ W flag  —   for “ win”  —   as she is no doubt hoping to do for herself in a few days.'"}, "time": 1742563169.5031075}