{"duration": 0.11191344261169434, "input_args": {"text": "'by Outis Philalithopoulos By Outis Philalithopoulos, who met an untimely end five years ago, and now “wears the chains he forged in life” as an economist. Previous events in this series led the ghost of Outis back to 1996. After meeting the first of three Spirits and being shown a series of sometimes unwelcome visions, Outis found himself alone. I thought about the people I had seen during my spectral journey. They seemed to think of themselves as liberals, even though they would be out of place among modern progressives. I toyed with an evolutionary explanation. There were things Brown didn’t understand about forceful communication, and things Franken didn’t understand about a lot of subjects, but maybe the two of them were “primitive progressives,” who hadn’t yet developed into real progressives. Maybe if someone had just called them out, they would have understood, and grown. One thing Franken and Brown had in common is that they both came off as smarter than the people they criticized. To me, being progressive was basically about not being stupid, and so it was unsurprising that primitive progressives had also tried to show that they were intelligent. But to reach that end, Franken and Brown used different strategies. Franken seemed one of a group of 90s Democrats who saw themselves as having mastered the most defensible positions on each issue. Support of deficit reduction and trade pacts were orthodox positions of mainstream economics, and so for these liberals, there wasn’t any political problem here – you just needed to say the correct answer as quickly as possible. For Brown, on the other hand, her self-confidence was tied more closely to her academic career, and to her ability to see around and behind “narratives” that other people might believe in. What else brought the “whipsmart” Democrats and the academic postmodernists together? Not much, as far as I could tell, except that they both disliked sounding too definite. In other words, they also had in common a sort of “postmodern attitude.” I wondered if my generalizations about primitive progressives held more broadly. What else could I remember about liberals of the time? There was a lot said about self-esteem. One time in high school something bad happened and a teacher wanted us to hold hands, and talk and feel together – or was that a movie? Regardless, many people did seemed to prize being non-judgmental. Wendy Brown had worried about whether some liberals genuinely believed in postmodernism, especially those trying to represent particular demographic groups. Even those writers, according to Brown, typically claimed to believe that culture was socially constructed, but they also wanted to privilege the perspectives of people who had suffered more, and treat their suffering as objectively real. Brown didn’t explain why this was supposed to be a problem, and clearly later progressives had realized that Brown was wrong to be so concerned. If primitive progressives had been a “rainbow coalition” of disparate groups who didn’t have much in common besides smartness and a vague commitment to postmodernism, how were they able to work together at all? How had we managed to banish the specter of postmodernism, and build an unprecedented degree of cultural cohesion and confidence? A finger touched my shoulder. Michel had returned. “I know you are weary of my presence,” he began sympathetically, “and so I will speed you to the last clues I can provide.” “But can we instead…” I began. Before I could finish my sentence, the horizon blurred and I found ourselves in a large lecture hall, surrounded by people who seemed very important, and somber. At the podium was a stern man in suit and tie. His voice rang through the hall: Something else died on Tuesday, in addition to thousands of innocent people. It was the doctrine of moral equivalency — the idea that people everywhere are just like us, or can be made so by meeting their demands. These humanistic, “can’t we all get along,” “profiling potential terrorists is racism,” “we’re all God’s children,” Kumbaya, “all we’re saying is give peace a chance” moral equivalency equivocators will soon be back. They’ll try to wear down our resolve. They should be ignored. Evil exists. It must be opposed. If this is war, let’s start acting like it and tell America’s enemies that if they are so intent on seeing their God, we’ll help them get there. As for us, we intend to die of natural causes. The audience cheered. “I guess this is 9/11?” I said to Foucault. “Two days later,” he concurred. “And this guy is some sort of rightwinger?” He nodded. “Syndicated columnist Cal Thomas.” A young, smartly dressed woman was speaking to her neighbor. “Guess what’s on the bestseller list right now?” Her somewhat older neighbor shook her head. “ Quarterlife Crisis – a book written by two twentysomethings bemoaning the,” and here her voice became brutally sarcastic, ‘ landmine period in our adult development during the transition from college graduation into the real world.’“ “The poor dears,” said the neighbor. “Many of them feel,” and here her voice took the same tone as it had before, “ helpless, panicked, indecisive, and apprehensive . You know what this generation needs? A real crisis. And now…. we have one. Our generational wake-up call. Our bloody moment of shattered self-complacency.” “Michel, Michel,” I said, annoyed. “I get it. The Right was fixated on the idea that progressives lacked moral clarity. Whatever truth there was in that claim, it’s clearly false now. What I’d really like to know is…” But Foucault shook his head and put a finger to his lips. Again, the scene shifted. We were in another room, with another speaker and another audience. This venue, though, was rather small, and while some attendants looked rather professional, others were dressed informally. Foucault whispered to me, “2007.” The audience listened intently to the speaker. She exuded an infectious, intimate candor as she talked about Internet activism. You know what? Sometimes we’re very, very rude. I go right into the face of mainstream media writers’ faces and call them out. I’m right in there with the worst of them, foul-mouthed, vituperative, and personal. There’s a reason for that: it’s the only way to get their attention ! We have a beef – and I maintain it’s legitimate and important. For years we’ve watched the mainstream media aid and abet the right wing to the point at which they behaved like a bunch of puerile cheerleaders for an absurd impeachment and stolen election. Iraq was the frosting on the cake. There’s no amount of polite discourse that’s going to shake up that comfortable relationship. And after Iraq, it’s become downright dangerous. Finally, a real progressive, I thought to myself. As she ended her speech, two men in expensive suits, with open collars, faced each other. “She’s right, you know, and it’s not just the media,” one remarked. “No shit,” the other seconded. “Say what you want about the Republicans, they know how to win. All we know how to do is lose.” The first shook his head in disgust. “The whole Democratic Party has become a bunch of,” and he lowered his voice, “pussies.” I looked angrily at Foucault. He put a sympathetic hand on my shoulder. The second man also shook his head. “We need to grow some balls.” He paused, then went on. “The thing is, I know this sounds optimistic after the last couple decades, but I actually think some people are starting to get it.” “It’s true,” the first acknowledged. “Take Rahm Emanuel. Someone tries to swift boat him, he swift boats them back. Some people don’t like him ‘cause he’s abrasive and says fuck a lot, but if you ask me, we need more people where you kinda feel like, this guy isn’t intimidated by Karl Rove.” “Yeah, Rahm’s cool,” the second said. “We just need to put ourselves out there more. Stop letting the Republicans paint us as weak. Stop accepting that they’re just going to get all the good donors.” “Exactly,” the first said with some passion. “And it’s not like this means compromising our principles.” “Of course not,” snorted the second. “I mean, we have our convictions. We just need to be smarter.” “Michel,” I said with some heat. “if the point is supposed to be that in our efforts to stand up to the right wing, we became more like them, I have to say, I find the idea unpersuasive and offensive.” “Well…,” he began. I motioned him to silence. “I think it’s really not that complicated. With the rise of the Internet, it became easier for good ideas to circulate and harder for bad ideas to escape criticism. So of course we were able to stick up for the truth more vigorously, and be less wishy-washy than before. Sort of like how the printing press made the Reformation possible…” “I see!” he exclaimed, brightening. “You cast yourself as one of the early Protestants, upholding a more rigorous standard of morality against the worldly and corrupt Catholics who preceded you. The Internet punishes tentativeness, just as the printing press made it so Erasmus’ skepticism could be pilloried by Luther in their debate on free will.” “Uh…” I said, a little disoriented by his tendency to show off his erudition. “But perhaps,” he mused, “if the earlier liberals are the medieval Catholic church, then you are the Counter-Reformation, strengthening the discipline of the Catholic faithful by imposing meticulous rules of self-examination and intensifying the obligation of confession?” That sounded less flattering. Michel frowned and took a step back. Some sort of invisible force was tugging on the back of his shirt. He turned to me and sighed. “ Désolé, but my time has grown very short.” I opened my mouth to say something, but Foucault, and the room from 2007, disappeared. In their place stood a bunny, looking me straight in the eye. * * * In the next episode, Outis journeys into a popular and widely praised artistic representation of modern liberal culture. Sources: Cal Thomas’ column from September 13, 2001 can be read here . The young woman attending his talk is based on Michelle Malkin, see her September 12 column . The Internet activist is based on Heather Digby Parton’s recollections of Netroots , with past tense changed to present. Foucault’s comments on the Counter-Reformation are loosely paraphrased from p. 19 of Discipline and Punish . His comments on the Reformation are not based on anything concrete in his writings, and hopefully he would not disagree too strongly with them. 0 0 0 0 0 0'"}, "time": 1742628429.2854943}