{"duration": 0.1512606143951416, "input_args": {"text": "'  Ian Greenhalgh is a photographer and historian with a particular interest in military history and the real causes of conflicts. His studies in history and background in the media industry have given him a keen insight into the use of mass media as a creator of conflict in the modern world. His favored areas of study include state sponsored terrorism, media manufactured reality and the role of intelligence services in manipulation of populations and the perception of events. Saudis support Turkey’s hidden agenda to destroy Iraq By Ian Greenhalgh on November 4, 2016 [Editor’s note: As I have written previously, Asharq Al-Awsat is a Saudi government propaganda mouthpiece, which makes it useful for determining the Saudi opinion on various events. In this case, we have an article that tells us what the Saudis think about the situation in Iraq, in particular Turkey’s intent to seize Mosul and the northern half of the country for itself. It is important to realise that the Saudis are bitter enemies of both Iran and Iraq, furthermore, it is Saudi financial backing that created IS in Iraq, a cynical attempt at destroying the nation. One thing this article plainly tells us is that the Saudis are supportive of Turkey’s intentions towards Iraq, this is clear from the way that the author repeats the false narrative that both IS and the Kurds are enemies of Turkey and therefore it is legitimate for the Turkish army to move into Iraq in order to combat them. The truth is that IS in Iraq and Syria is largely the creation of the Turks, that much of the personnel fighting under the IS banner is Turkish, or rather was, most of those men have withdrawn back into Turkey where they removed their IS disguises and once again donned their Turkish army uniforms. When the author writes that they have not fought against Assad’s forces, Iranian forces, Russian forces or Hezbollah, he is inverting reality as that is precisely what the Turks have been doing, however they have been doing it while disguised as IS. The author goes on to repeat the Turkish propaganda line that they are trying to protect Turkey and ethnic Turkmen inside Iraq, another blatant lie; as I have written before, Turkey’s real intention is to seize the city of Mosul and large tracts of Iraqi territory for itself – how can it defend Turkey from groups that are in reality, Turks dressed up as terrorists? Mixed in with the support of the Turkish lies is a constant anti-Iranian thread, the author claims Iran wants to take over parts of northern Iraq, in reality, as I have explained, that is Turkey’s intention, not Iran’s. So what are we to conclude about Saudi intentions from this neat little package of propaganda and disinfo? I think it is clear that the Saudis are fully supportive of Turkey and it’s agenda to expand it’s borders at the expense of Syria and Iraq, in particular to seize the cities of Mosul and Aleppo, which Turkey still considers to be rightfully theirs. This is a continuation of the partnership that created IS in Iraq – Turkey recruited and trained them inside Turkey while the Saudis financed the whole thing. What we are seeing now is the Turkish army attempting to achieve what IS has failed to do – seize and hold northern Iraq while at the same time bringing down the Iraqi government and it’s army, leaving a power vacuum in the south which can be exploited by the Saudis. Ian] The map of Turkey according to the Ottoman Parliament-sealed, 1920 National Oath that designates today’s Kurdistan Region, Mosul, Syrian Kurdistan, Aleppo, parts of the Balkans and Caucasus as Turkish soil. Opinion: Will There be a Turkey – Iraq War? \\nThe political situation between Turkey and Iraq is at its worst. The Turkish President Recep Tayyip Erdogan has reiterated that his forces “will strongly participate in liberating Mosul” from ISIS. \\nThe Iraqi Prime Minister Haider Al-Abadi responded by saying “We will not allow Turkey to participate in the battle to liberate Mosul”. Disputes between the countries are not limited to the issue of Mosul and reflect the conflict and threats facing the region. \\nIraqi media is portraying the role of Turkey in Mosul as sectarian and anti-Shia. This is a false portrayal that exploits the statements of Arab journalists who translate Turkish statements according to their whims. The truth is that Turkish military activity was never sectarian. The Turkish army has not fought a single battle against Shiites or Alawites. Neither have they fought against Assad’s forces, Iranian forces, Russian forces or Hezbollah. \\nAll the battles that Turkish forces have waged have been against ISIS, Turkish-Kurdish separatists and Syrian Kurds allied with them. All of these groups are Sunni and not Shiite. The reason why Turkish forces are fighting them is because they pose a threat to the unity of Turkey and its stability. Turkish military operations are unrelated to the sectarian conflict as Iraqi leaders claim or as Arabs who naively think that Turkey is ready to engage in foolish sectarian wars are professing. Turkey itself is a multi-ethnic and multicultural country! \\nIn my opinion, the Turks are now paying the price for not intervening in areas close to their borders at the beginning of the Syrian uprising and not indicating the areas that they consider threats to their national security and that they will defend by force. \\nFor example, Aleppo represents their geographic and historic extension. As a result, Iran exerted its influence inside Syria and is bargaining with the west and Arabs over it. \\nAnkara wants to fight ISIS in Mosul and prevent the fighting from targeting the Turkmen and others. However, Iran is leading the political and military confrontation in Mosul and against Turkey also. We all know that the Iraqi government is helpless. \\nThe Iranians succeeded in filling the void in the years that followed the US President Barack Obama’s withdrawal of all his forces. They founded sectarian militias that rival the government and they named them Al-Hashd Al-Shaabi. Their aim was to weaken the central authority as they did in Lebanon, and these militias are now preparing to cross into Syria as well. \\nThe Turks have tried diplomatic channels and sent a delegation to Baghdad. The Iraqis responded and sent a delegation to Ankara but their endeavours did not succeed. Will the Turks defend the residents of those areas that their forces surround? Will they confront Al-Hashd Al-Shaabi that is bound to occupy Tal Afar? Will they do something if Al-Hashd Al-Shaabi militias cross towards Al-Hasakah in Syria as preliminary information suggests they will? \\nThe Iranians are acting quickly before the results of the US elections, and they want to take advantage of the slogan “Fighting terrorism”. They want to launch multiple wars aimed at tightening control over strategic border crossings between Syria, Iraq and oil rich areas. \\nDespite the risks to their interests, I do not think that the Turkish leadership wants confrontation despite knowing that its army is much stronger than Iran and Iraq and is better equipped. Iranian forces and the militias that it brought from Afghanistan, Pakistan, Iraq and Lebanon are moving towards the Turkish border and are chasing Syrian opposition forces that are loyal to Turkey. They have also encouraged the creation of a buffer zone for the Kurds that will act like a scarecrow to the Turkish government. \\nAt the same time, the Turks are paying the price on the economic and security levels; they are hosting more than two million Syrian refugees and are facing an Iranian-Russian plan to bring the fighting to their territory. This plan is supported by Turkey’s Kurds. Iraqis loyal to Tehran have explicitly declared that they will work to break up Turkey should it dare to challenge them in Mosul. \\nThe situation is very difficult and the Turks will be mistaken again if they think that the war will end at the Ba’shiqah camp in Iraq where their forces are stationed. The Iranians want to control the political decision making centres in Baghdad, Damascus and oil rich areas in Mosul and Deir ez-Zor. They also want to restrain Turkey in the region. \\nDespite this, I do not believe that threats exchanged by the Iraqi and Turkish leaderships will lead to the two armies clashing. Rather, they aim to intimidate the Turks and force them to leave so that Iran can expand its influence over Ninevah, neighbouring provinces, trade routes, southern Syria and passages. Turkey is in a difficult situation that requires it to form an opposing camp that proves its credibility on the ground. Related Posts:'"}, "time": 1742564122.2235441}