{"duration": 0.09051918983459473, "input_args": {"text": "'PARIS  —   First it was the Netherlands. After President Trump vowed to put “American first,” a Dutch television show made a satirical case for why the president should consider its country second. Now, the race for   has spread. Belgium, Germany, Denmark, Lithuania, Luxembourg, Portugal and Switzerland have all joined in with videos that capture the president’s trademark bombast, demonstrating a rare case of European unity through satire  —   and  . In the Dutch video, a     runs through a list of the country’s hallmarks and traditions that may pique Mr. Trump’s interest: the language, the tax code, the windmills and Black Pete, a contentious Christmas tradition in which Dutch people wear blackface. (“It’s the most offensive, the most racist thing you’ve ever seen,” the voice says. It adds: “You’ll love it. It’s great. ”) Arjen Lubach, a Dutch   host whose show, “Zondag met Lubach” (“Sunday With Lubach”) made the video that started the trend, said, “Because we realize it’s better for us to get along, we decided to introduce our tiny country to him in a way that will probably appeal to him the most. ” The     on this video belongs to a   American comedian named Greg Shapiro. “I’ve been working on the imitation for a while,” Mr. Shapiro said in a phone interview on Sunday from Paris. All it takes, he said, is repeating Mr. Trump’s interviews or tweets verbatim. “There’s hardly any heightening necessary,” he said. After the video went viral, Mr. Shapiro said, “it was nice having family from America send me these clips saying, ‘Oh, this is like Dutch and Trump.’ And I’d say, ‘Yeah, that’s my voice.’ My mom did recognize it. ” Mr. Shapiro, 48, has seen a bump on his YouTube channel, where he offers lessons in Trump impressions on his “United States of Europe” show and posted a spoof news conference on Monday, in which he impersonates the president. Germany’s video pleads its case  —   and expresses indignation that the Netherlands beat it to the idea. Its video lists Oktoberfest, the country’s experience with walls and Hitler, who, the video notes, “made Germany great again. ” “Germany wants to be second,” Jan Böhmermann, host of the talk show “Neo Magazin Royale,” said in the video. “Because we are strong, we are big, and who  —   if not us  —   deserves a third chance?” (Last year, Mr. Böhmermann’s satire of Turkish President Recep Tayyip Erdogan caused an international incident.) What did the Swiss think Mr. Trump would like about their country? The video championed the nation’s mountains (it’s not flat like the Netherlands) its nonmembership in the European Union and its cleanliness. It also said Mr. Trump, who was caught on video boasting about sexual assault, might appreciate the country’s history on women’s rights. “We also love to treat our women badly,” the Trump impersonator in its video said. “Love it. We didn’t let them vote until 1971. In some places, even until 1990. ” It added: “You love gold? We love gold. During World War II, the Jews gave it to us for safekeeping. They never returned  —   so strange  —   so we melted it, like fondue, our national dish. ” Portugal’s video noted that Portuguese has an untranslatable word, “saudade,” a combination of longing and nostalgia. “We can assure you that ‘saudade’ is something that billions of people are feeling right now about Barack Obama. ” It also jokes that its prime minister, António Costa, like Mr. Trump, came to power without winning the popular vote. “If you have any problems with Putin  —   which you will  —   immediately call António Costa,” it said. Belgium extended an olive branch to Mr. Trump in its video, agreeing with his comments last March that its capital, Brussels, was a “hellhole,” but urging him to check out the   north of the country. (It dismissed the French speaking south as “the Mexicans of Belgium” and told him to steer clear.) Denmark’s video, broadcast by the talk show “Natholdet” (“The Nightshift”) explained the difference between Danes and danishes, and cited Hans Christian Andersen, creator of beloved fairy tales, as a point in the country’s favor. “You have the Statue of Liberty, we have the Little Mermaid,” the video’s Trump impersonator said. “But don’t let the name fool you, O. K.? The Little Mermaid is actually pretty huge. ” In its video, Luxembourg boasted, “We have money, a lot of money,” adding: “And you know what, Mr. President? You don’t even have to pay taxes. None. Zero. Nada. Promise. ” Lithuania, a small Baltic country and NATO member that has been rattled by Mr. Trump’s fondness for Russia, attempted to win him over with its fast internet speed. “Just imagine how fast you can tweet when you have the fastest internet?” The video added that the Lithuanian president is a woman. “She probably rigged the election,” the   said.'"}, "time": 1742561848.7345204}