{"duration": 0.11069703102111816, "input_args": {"text": "'A busy brain can mean a hungry body. We often seek food after focused mental activity, like preparing for an exam or poring over spreadsheets. Researchers speculate that heavy bouts of thinking drain energy from the brain, whose capacity to store fuel is very limited. So the brain, sensing that it may soon require more calories to keep going, apparently stimulates bodily hunger, and even though there has been little in the way of physical movement or caloric expenditure, we eat. This process may partly account for the weight gain so commonly seen in college students. Scientists at the University of Alabama at Birmingham and another institution recently experimented with exercise to counter such   study food binges. Gary Hunter, an exercise physiologist at U. A. B. oversaw the study, which was published this month in the journal Medicine  Science in Sports  Exercise. Hunter notes that strenuous activity both increases the amount of blood sugar and lactate  —   a byproduct of intense muscle contractions  —   circulating in the blood and augments blood flow to the head. Because the brain uses sugar and lactate as fuel, researchers wondered if the increased flow of   blood during exercise could feed an exhausted brain and reduce the urge to overeat.   eight healthy college students were invited to U. A. B. ’s exercise lab to determine their fitness and metabolic rates  —   and to report what their favorite pizza was. Afterward, they sat quietly for 35 minutes before being given as much of their favorite pizza as they wanted, which established a baseline measure of   indulgence. At a later date, the volunteers returned and spent 20 minutes tackling selections from college and   school entrance exams. Hunter says this work has been used in other studies “to induce mental fatigue and hunger. ” Next, half the students sat quietly for 15 minutes, before being given pizza. The rest of the volunteers spent those 15 minutes doing intervals on a treadmill: two minutes of hard running followed by about one minute of walking, repeated five times. This is the sort of brief but intensive routine, Hunter says, that should prompt the release of sugar and lactate into the bloodstream. These students were then allowed to gorge on pizza, too. But by and large, they did not overeat. In fact, the researchers calculated that the exercisers consumed about 25 fewer calories than they did during their baseline session. The nonexercisers, however, consumed about 100 calories more. When the researchers factored in the calories expended on running, they determined that those students actually consumed 200 fewer total calories after their brain workouts than the resting students. The study has limitations, of course. “We only looked at lunch,” Hunter says the researchers do not know if the runners consumed extra calories at dinner. They also cannot tell whether other types of exercise would have the same effect as running, although Hunter says they suspect that if an activity causes someone to break into a sweat, it should also increase blood sugar and lactate, feeding the brain and weakening hunger’s call.'"}, "time": 1742562592.596122}