{"duration": 0.22828388214111328, "input_args": {"text": "'Waking Times \\nNo event in American history (if you ask me) has been more engineered, more anticipated and more built up than the upcoming November 8, 2016 presidential election. Face it. This presidential election season made the truth movement mainstream. Evil and corruption was brought into the light. We’ve observed what a George Soros-like engineered regime breakdown looks and feels like from the inside, our side this time. We had heard and read about all those foreign governments that the US overthrew with their “democracy” tactics using “special forces,” NGOs, paid-for revolutionaries, activists and in some cases flat-out murderous fighters (ISIS, moderate rebels). This time the engineered chaos was happening here in the US. \\nThis 2016 election season has been packed with outright exposed corruption, lies, propaganda, murders, stolen primaries, fabricated accusations, distractions, staged debates and much more. We have seen a criminally accused presidential candidate get away with crimes in broad daylight while suspected of suffering from Parkinson’s disease, passing out, having seizures and even being followed around by a creepy doctor with a seizure medication injector. This is the stuff Hollywood films are made of. The list of the insanity goes on and on, right? We’ve witnessed plenty of lies, propaganda and Jerry Springer Show -like attacks by the candidates to create just the perfect smokescreen so that Americans are not looking into the events in Aleppo or Mosul much less the Hillary-DNC- mainstream media corruption scandals and revelations. \\nInstead of keeping a close eye on the doings of the US criminal empire, the elite relied on a very in-your-face and increasingly arrogant, defiant and now very busted and discredited mainstream media to push the desired paradigm and reinforce it every which way they can. Actually, this understates the situation. What really happened was that the mainstream media joined forces with the chosen candidate of the ruling oligarchs (Hillary) and together their campaign (the DNC-Hillary-Soros-Moveon.org-Michael Moore-Hollywood-mainstream media complex) has brought us to the ending that truth seekers are now looking ahead to with great anxiety and anticipation. Actually, I’m understating the situation again. All or most Americans (awakened or not) are anticipating and anxiously awaiting the end results of the US presidential elections. \\nThe question we should all be asking then is, how did we get here? Oh, and perhaps more importantly, where are we going? To answer this, one must realize that the ruling elite have plans. They have a lot of money and they have players willing to go along with their plans. Not sure of this? Then please research Sandy Hook or Boston bombing events. Or research many of the crisis actor events of the past few years. \\nThat’s right. While they were staging one event after another, too many Americans were too busy and too afraid to call these fake events for what they were. Too many Americans fell for the trick that we were supposed to believe mainstream media “stories” and narratives unless we could “prove” that the account didn’t happen the way mainstream media said it did. In other words, many Americans were tricked into believing that, unless proven otherwise, we should BELIEVE mainstream media. Well here we are in October of 2016 and finally (though it has been common knowledge to many of us for a long while) the illegitimacy of the mainstream media is carved in stone. No longer can it be considered a “conspiracy” by anyone, that mainstream media is corrupt and acts as a tool of psychological terrorism against the public on behalf of the ruling elite. \\nThat said, now it is time to confront the fully engineered and long-planned ending of this 2016 US presidential election. Will staged “ political terrorism, ” a term just introduced a couple of weeks ago into the American psyche, be staged as Mike Adams at Natural News is writing about ? Will this “terrorism” or planned “event” mark the beginning of the end of America? If so, what will happen? How will it all go down? Many are now wondering how deep is this web of corruption and how far will the traitors identified before us be willing to go to destroy America? \\nThe one thing everyone should accept is that this ending has been planned just like so many “events” of the past several years have been scripted and planned. So today I invite readers to acknowledge this very important singular factor in today’s events. The fact that they are planned. The notion of organic and spontaneous results is something the ruling elite hate. They hate anything that is organic, spontaneous, unpredictable, people-powered, natural and real. They need everything to be controlled, scripted, planned, orchestrated, engineered. Do you see a pattern here? One consciousness longs for freedom, naturalness and spontaneity, the other longs to control, orchestrate, engineer and dictate the ending, like a master would want to control his slave. \\nUnderstanding this fundamental contrast between the control-freak consciousness (think ruling elite) and the free-spirited consciousness, will allow you to see what’s coming this November 8th 2016. What’s coming is a long-awaited day for which the ruling elite have paid a lot of money and hired many people to manipulate and control the ending of. So the real question is, will their operation succeed? Looking at the election day ending from a bird’s-eye view and seeing how the ruling elite think and operate it is not difficult to see that they, too, are waiting for that day so that they can implement whatever plan they’ll need based on the materializing reality at that moment. In this (what I’ll call) wait-and-see plan whose execution will either be entirely controlled from the beginning or be an adjusting reaction-based plan to be determined by the emerging reality, we can be sure that at no point will the ruling elite accept an ending that ruins their plan. In other words, they will adjust their plan as often and as desperately as possible and necessary to engineer an ending to their liking. \\nThis ultimately is all we need to know to plan our (truth seekers and freedom lovers) next move. And our next move should look something like this if you ask me: \\n1- Have a plan including options for self-sustaining yourself and your loved ones (food, water, shelter and other personal needs). \\n2- Expect corruption but continue fighting and exposing the perpetrators. Let’s not let one of these traitors (including crisis actors and operatives working for the State) get away with what they have done. \\n3- Don’t rely ONLY on the Internet to keep track of developing events. You might want to write down current event information, or better yet print out key articles and documents (proof). Also download important videos; don’t assume these videos will always be available on YouTube or the Internet. Remember we are entering a much more volatile and intense information war age. The main point is we need to archive the evidence against those criminals who have betrayed America and humanity. \\n4- Beware of layered psychological operations. Question everything you hear and don’t discount that some “news” is designed for you to hear it (get it?). Unfortunately the controllers have indeed upped the ante when it comes to the information war. In deceptive times like these, grabbing on to the principles you believe in become much more important than agreeing with someone on every little nuance about a particular event. Stay oriented and remember who the bad guys are, especially as we see the Hillary-mainstream media complex laughably blaming Russian president Vladimir Putin for all the now-revealed corruption and criminality of the Clintons, the mainstream media, the DNC and many others. \\nNow is the time to confront the very real and very relevant inherent concepts of truth versus lies, lightness versus darkness, freedom versus slavery and knowledge versus hidden knowledge (the occult); because this, my friends, is what we are dealing with. We (truth seekers) are all in this together. We didn’t ask to be put in this show, it sort of came to us. Perhaps we (awakened humanity) are fulfilling a role that we cannot fully understand. This species we call humans needs some members of its kind to save the rest of the species, and if you are reading this then you are probably a chosen vessel in this battle for humanity. \\nThere is nothing to fear, for the ending has surely been scripted. We (like them) will also respond in real-time in the most effective way possible. What we need to do more than anything else is …. (pay attention) … think ahead just like they do. \\nAnd so today I’m thinking ahead. I have plans for both scenarios (Trump or Hillary declared victory). I have plans for no “political terrorism” and political terrorism, shock or no shock, chaos or no chaos. In my world the problem remains the same until we hold these corrupt ruling elite, their politicians and players all responsible for their criminality and corruption. Plain and simple, the ruling elite must be identified, stopped and held accountable for their crimes against humanity and the US Constitution. This is more important than any presidential election. Will a Trump victory make this accountability more possible? Many are hopeful of this, but ultimately we must find a way to impose our will on the future and not rely on a politician to do this for us. \\nFinally, I’m reminded of the very last line of the film The American Dream when the villain asks, “What do you think this is?” and the answer: “This is AMERICA!!” Likewise, let’s remember, this IS America, the politically hijacked land that guarantees each and every individual inherent rights which are clearly and indisputably outlined in the US Constitution. Will an opportunity present itself for the rule of law to be restored or will the ruling elite have their way? That question will very likely be answered at a time not necessarily coinciding with election night. This is a reminder to all that the battle we face for humanity and truth is continuous and very long term, not about one isolated moment or day. About the Author \\nBernie is a revolutionary writer with a background in medicine, psychology, and information technology. He is the author of The Art of Overcoming the New World Order and has written numerous articles over the years about freedom, government corruption and conspiracies, and solutions. A former host of the 9/11 Freefall radio show, Bernie is also the creator of the Truth and Art TV project where he shares articles and videos about issues that raise our consciousness and offer solutions to our current problems. His efforts are designed to encourage others to joyfully stand for truth, to expose government tactics of propaganda, fear and deception, and to address the psychology of dealing with the rising new world order. He is also a former U.S. Marine who believes it is our duty to stand for and defend the U.S. Constitution against all enemies foreign and domestic. A peace activist, he believes information and awareness is the first step toward being free from enslavement from the globalist control system which now threatens humanity. He believes love conquers all fear and it is up to each and every one of us to manifest the solutions and the change that you want to see in this world, because doing this is the very thing that will ensure victory and restoration of the human race from the rising global enslavement system, and will offer hope to future generations. \\nThis article ( Awakened Humanity Awaits Fully Scripted Ending to the Election ) was originally created and published by Bernie Suarez at Truth and Art TV and is re-posted here with permission. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742564400.4994094}