{"duration": 0.025084972381591797, "input_args": {"text": "'By Hrafnkell Haraldsson on Thu, Oct 27th, 2016 at 6:47 pm Evangelical women support for Trump stood at 58 percent in mid-October. Barely above half. Romney had 77 percent in 2012 Share on Twitter Print This Post \\nDonald Trump is hemorrhaging Evangelical women voters. Their support for him stood at 58 percent in mid-October. Barely above half. Romney had 77 percent in 2012. As noted here yesterday , Romney had a lot of support Trump lacks. And Romney lost. \\nThere have been rumblings among prominent Evangelical women, like Beth Moore of Living Proof Ministries: Try to absorb how acceptable the disesteem and objectifying of women has been when some Christian leaders don\\'t think it\\'s that big a deal. \\n— Beth Moore (@BethMooreLPM) October 9, 2016 \\nPolitico asked earlier this month how long Evangelical women can remain behind Trump. \\nThat answer is in, according to the Wall Street Journal , which says they are turning away, that the “Republican nominee faces vocal backlash from evangelical women over lewd comments and sexual-misconduct allegations.” \\nWhile some are willing to overlook any number of deplorable remarks from Trump just to see Clinton defeated, others have had enough : \"Conservative Christian Women Turn Away From Donald Trump\" https://t.co/YH0ZFOzJRN pic.twitter.com/572wTqMTEm \\n— Sopan Deb (@SopanDeb) October 27, 2016 \\nKimberly Ross wrote at Red State earlier this month that, \\nI don’t believe that I, as an American woman, am oppressed. However, it is beyond disappointing that men who not only claim faith, but are in leadership roles, are so willing to dismiss a predator among them. Maybe Trump has promised them some future role? I don’t know. Regardless, they are lured away from doing their duty and instead join in with someone whose hobby is casting females aside. I’m disgusted by Trump and his male cheerleaders. You should be, too. Thankfully, women like Beth Moore and Rev. Lisa Sharon Harper won’t stay quiet on the sidelines as some Evangelical men have always wished they would. \\nShe is hardly alone, and more and more Evangelical women are joining the ranks of those who have heard enough misogyny from Trump. The reaction of Evangelical women, as Laurie Goodstein noted at The New York Times earlier this month, be a rift “that shapes politics for years.” \\nIt isn’t as if Trump hasn’t been saying these things all along. As David French protested at the National Review back in June, Trump “subverts all of our most cherished values.” The question is, what took them so long? \\nTrump has already had an effect on the Religious Right, an unrepentant sinner who represents everything they claim to oppose. He has 70 percent support from Evangelical men, but while Evangelical women seem to support him despite his misogyny, there are good reasons to suspect the men support him because of his negative attitude towards women. \\nIf Trump wants to further shrink his already deflated tent by shutting out another demographic, he’s going about it the right way.'"}, "time": 1742628535.2176783}