{"duration": 0.07492923736572266, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. The Supreme Court unanimously decided not to rule in a major case on contraception, averting a possible    deadlock. The suit, challenging rules of the Affordable Care Act, was sent back to lower courts for a compromise. Religious groups will buy insurance plans for their workers that do not cover contraception, and employees will be able to obtain that coverage from the same insurer. _____ 2. Doctors said this Massachusetts man was recovering well after undergoing the first penis transplant in the U. S. Thomas Manning, whose penis was amputated several years ago to remove a rare cancer, said he hoped his case would help reassure other men with genital injuries, especially veterans. “Don’t hide behind a rock,” he said. _____ 3. Donald Trump outlined his strategy against Hillary Clinton. “Just getting nasty” won’t work, he said, and could cost him women’s votes. Instead, he told our political reporters, he will portray her as enabling Bill Clinton’s infidelities, hold her responsible for the Benghazi attacks and challenge her as fundamentally corrupt. He’s also urging Bernie Sanders to consider running as a   candidate. _____ 4. Oregon’s primaries and Kentucky’s Democratic one are on Tuesday. Mrs. Clinton has been campaigning in Kentucky for the last couple of days, stressing her plans to revitalize the economy and her support for the coal industry. Mr. Sanders took his campaign to Puerto Rico, criticizing Wall Street banks for the territory’s crippling debt. A group of big unions pledged to boycott the Democrats’ ambitious     operation unless they cut ties with Thomas Steyer, a   manager who has spent millions to fight climate change. _____ 5. Dogs are at the forefront of a new approach to improve human health. Researchers are testing rapamycin, a drug that appears to delay the onset of aging in mice, to see if it has any canine side effects, before undertaking human tests. (The dogs’ owners are thrilled at the possibility of lengthening their pets’ lives.) The overall goal is to target the biology that underlies human aging, which is the greatest risk factor for the biggest killers in the developed world: heart disease, stroke, Alzheimer’s, diabetes and cancer. _____ 6. Venezuela’s economic crisis, set off by collapsing oil prices, has metastasized into a health crisis. Hospitals and clinics have little medicine, and even less in the way of sterile equipment. Some lack even sufficient water to wash blood from surgical tables. Deaths among new mothers in government hospitals have multiplied, and deaths of their newborns have skyrocketed more than a hundredfold. _____ 7. “The students brought elderly people into the school and beat them. They beat their teachers and principals. There was nothing in the way of law. ” That’s a    Chinese composer who now lives in France, remembering the Cultural Revolution, a decade of political upheaval unleashed by Mao Zedong. The Communist Party’s main newspaper broke a general silence about the 50th anniversary of the era’s beginning, writing, “We sum up and absorb the lessons of history in order to use it as a mirror to better advance. ” _____ 8. This week’s roundup of TV finales includes “Jane the Virgin” (9 p. m. Eastern, The CW) “ ” (Wednesday, 9:30 p. m. ABC) “Empire” (Wednesday, 9 p. m. Fox) and “Shark Tank” (Friday, 9 p. m. ABC). And our entertainment team recommends taking advantage of iTunes’   deals to rent “Sicario” with Emily Blunt or Spike Lee’s “ . ” Above, the stars of “Empire. ” _____ 9. A host of media organizations in the Bay Area  —   including television and radio stations, The San Francisco Chronicle, The San Francisco Examiner, Mother Jones and online publications  —   have set June 29 as their target date to publish comprehensive reports on homelessness. It’s a pervasive problem in a city where the tech boom has sent rents ever upward. “We want the full force of the Fourth Estate to bear down on this problem,” an editor said. _____ 10. Finally, President Obama honored 13 police officers with the Medal of Valor, the nation’s highest award for public safety officers. This Los Angeles officer, Donald Thompson, was   when he dashed across a highway to pull an unconscious man from a burning car, suffering serious burns in the process. Mr. Obama promised to listen and learn from the officers, and to provide the resources they need to do their jobs. “Our country needs that right now,” he said. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s the Weekend Briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561721.914782}