{"duration": 0.2901268005371094, "input_args": {"text": "\"Corrente. \\n2016 \\nDays Until: -3. Comment on polling: Election “calls” have never seemed very interesting to me — were it my place to make them — in the same way that predicting when a flood will crest is a lot less interesting than understanding (and perhaps managing) a watershed. That doesn’t mean predictions are not fun! Madison asked in the Federalist 51 : “But what is government itself, but the greatest of all reflections on human nature?” By the same token: “What is the horse race, but the greatest of all the performing arts?” That said, putting past Water Coolers into the “call” frame, the method I used didn’t yield bad results. Rather than tracking the very noisy individual polls, I decided to use the RealClearPolitics polling averages every Monday — once a week, for sanity’s sake — and plug those averages into a reasonable list of swing states provided by the New York Times, whose interactive tool then enabled me to game out scenarios in the electoral college. In all the weeks I did this but one, Trump had a plausible path to victory, depending on reasonable scenarios in individual states. In other words, still in the “call” frame, I beat most of the paid pollsters in the political class who were, er, trumpeting Clinton’s victory. And as we saw in yesterday’s Water Cooler, I tied the Trump team’s internal polling; they thought they were going to lose, though they qualified their views by pointing out the same plausible paths to victory that I did. Why did I not get the scale of Trump’s victory? I mean, in 2008 and 2012, and maybe farther back, the Republican candiate always made a show of putting Pennsylvania in play, and it never came to anything. Trump won it! Along with Michigan and Wisconsin (where Sanders, interestingly, defeated Clinton as well). \\nPolicy \\n“It is clear to any objective observer that the Affordable Care Act (ACA), which has resulted in rapidly rising premiums and deductibles, narrow networks, and health insurance, has not been a success. A Trump Administration will work with Congress to repeal the ACA and replace it with a solution that includes Health Savings Accounts (HSAs), and returns the historic role in regulating health insurance to the States. The Administration’s goal will be to create a patient-centered healthcare system that promotes choice, quality and affordability with health insurance and healthcare, and take any needed action to alleviate the burdens imposed on American families and businesses by the law” [ President Elect ]. Let us know how that works out. And: \\nTo maximize choice and create a dynamic market for health insurance, the Administration will work with Congress to enable people to purchase insurance across state lines. The Administration also will work with both Congress and the States to re-establish high-risk pools – a proven approach to ensuring access to health insurance coverage for individuals who have significant medical expenses and who have not maintained continuous coverage. \\nAnd: Modernize Medicare, so that it will be ready for the challenges with the coming retirement of the Baby Boom generation – and beyond Maximize flexibility for States in administering Medicaid, to enable States to experiment with innovative methods to deliver healthcare to our low-income citizens \\nHmm. \\n“‘Donald Trump has said he wants to repeal Obamacare, and we hope that wasn’t an empty campaign promise,’ said Twila Brase, president and co-founder of CCHF. ‘It will take more than a promise to make American health care great again and to restore health care freedom to patients and doctors. Republicans need to advance visionary ideas for health care, ideas that are bigger than buying across state lines; ideas that put patients and doctors back together again without the costly interference and intrusions of profiteering outsiders. The high cost of health care comes primarily from the middlemen, including managed care and government'” [ Citizens’ Council for Health Freedom ]. CCHF is a good conservative site on health care policy. I don’t agree with them on policy, but CCHF is relentless and above all they don’t make stuff up. \\n“Obamacare ‘Replacement’ Might Look Familiar” [ Kaiser Health News ]. Could be. ObamaCare was, after all, originally a Republican plan, so it should be possible to rebrand it. “‘It gets into a questions of semantics,’ said Mark Rouck, an insurance analyst for Fitch Ratings. ‘Are they really repealing the act if they replace it with new legislation that has some of the same characteristics?’… Topping the list of ACA provisions likely to survive under Trump is the requirement that employers cover workers’ children up to the age of 26, analysts said. The measure is widely popular and not especially expensive…. A health law crafted by Republicans might also retain the ACA’s protections for people with preexisting illness seeking coverage, said Glenn Melnick, a health economist at the University of Southern California… The ACA’s biggest coverage expansion came through the Medicaid program for the poor and disabled, which added more than 15 million people. Trump has suggested giving states fixed federal grants for Medicaid, which could lead to a substantial reduction in coverage or benefits.” \\n“Then Donald Trump was elected president, and now the tables may have turned again. Trump has on several occasions expressed his opposition to net neutrality, once calling it “another top down power grab” [ MarketWatch ]. \\n“Who’s Advising President-elect Trump on Heatlh Care?” (PDF) [ Holland & Knight ]. Rich Bagger: Executive Director (Health care policy advisor). Was Assistant General Counsel at Horizon Blue Cross and Blue Shield) Eric Ueland: Budget Advisor (Entitlements) Jim Frogue: Domestic Policy (Health Care, State Policy). Was Health Care Policy Analyst for Heritage Foundation [ home of ObamaCare , interestingly enough] Ado Machida: Domestic policies (Health) Ed Meese: Executive Office of the President Lead Andrew Bremberg: Domestic Policy (Affordable Care Act repeal and replace) \\n“Bremberg was on Walker’s team when the candidate unveiled a healthcare proposal that included repealing the Affordable Care Act and splitting Medicaid into smaller programs with separate funding” [ Modern Health Care ]. And: “For eight years, Bremberg served in the Department of Health and Human Services. From 2005 to 2007, he was special assistant to the Immediate Office of the Secretary and from 2001 to 2005, he was special assistant to the executive secretary” [ Health Care Finance ]. And: “Names reportedly under consideration for HHS secretary include former Louisiana Republican Gov. Bobby Jindal, former Republican presidential candidate Ben Carson, former House Speaker Newt Gingrich, Gov. Rick Scott, R-Florida, and former Rep. Renee Ellmers R-North Carolina.” Thin bench! \\n“One day after his election, we polled our readership of healthcare managers and clinicians to see what they think the short and long-term effects will be of Trump’s policies on the healthcare sector, and we were flooded with responses. While most of them detail the deep concerns industry professionals have, a small few felt the businessman’s idea could improve competition and lower costs” [ Health Care FInance ]. Good article. \\nRealignment \\n“At this early stage, we can’t know with certainty exactly why Clinton lost. In a narrow sense, obviously, the electoral vote was lost because she lost Wisconsin, Pennsylvania, Michigan, and Iowa. Exit polls (which are often unreliable, but all we have for the moment) and the vote distribution strongly suggest those states were lost because Clinton lost many of the white working-class voters that broke for Obama in 2012 . Overall exits show a 16-point swing to Trump among voters making less than $30,000 compared to the last presidential election — the biggest of any group in The New York Times crosstabs…. Also, general turnout was off from 2012″ [ The Week ]. So to fire the blame cannons at working class racism, you have to argue like this: “Trump won the racist vote because the people who voted for the black guy wouldn’t vote for the white woman.” Oh, OK. Now, you can deploy the misogyny blame cannons, but the identity politicians seem to be going with racism at the moment. \\n“People often talk about ‘racism/sexism/xenophobia’ vs. ‘economic suffering’ as if they are totally distinct dichotomies. Of course there are substantial elements of both in Trump’s voting base, but the two categories are inextricably linked: The more economic suffering people endure, the angrier and more bitter they get, the easier it is to direct their anger to scapegoats. Economic suffering often fuels ugly bigotry” [Glenn Greenwald, The Intercept ]. I would go further and urge that “racism/sexism/xenophobia” are forms of politics, and that they are the evil twin of identity politics, and together are the only forms of politics permitted by elites . See the next link. \\n“A top liberal group [The Center for American Progress] has temporarily abandoned plans for a new project designed to court white working class voters after it could not marshal the necessary financial support for the project, according to documents obtained by the Washington Free Beacon” [Washington Free Beacon (2014)]. So, the Democrats abandoned the (white) working class because the squillionaires wouldn’t fund the effort to reach out to them (and here we are!) Could it be that the squillionaires had a reason for that? Like that would be against their class interests? More: “The stated need for the project suggests potential pitfalls for Democrats in its eventual delay: In a midterm election year expected to heavily favor Republicans, CAP has apparently abandoned, for the time being, an effort to reach out to a constituency that it acknowledges could determine the viability of the Democrats’ voting coalition going forward. The Bobby Kennedy Project was the brainchild of CAP senior fellow Ruy Teixeira, who for the past decade has stressed that a lasting Democratic majority will require the party to make inroads with white working class voters.” Much too little, much too late from Teixeira, who injected the identity politics virus into the Democrat bloodstream to begin with . \\n“The Dems need organization and focus on the young. Need a fifty State strategy and tech rehab. I am in for chairman again,” Dean said” [ Yahoo News ]. Oh, HoHo. Really? After helping Clinton rig her selection as a superdelegate and smearing Trump as a coke user on no evidence ? Yeah, the 50-state strategy was great. But that was before you lost your mind! \\n“The Real Lesson in Grubhub CEO Telling Trump Supporters to Resign (Plus an Earlier, Personal One) – WP Original” [ WirePoints ]. \\n“Chelsea Clinton being groomed to run for Congress” [ New York Post ]. “Hail, Hydra! Immortal Hydra! We shall never be destroyed! Cut off a limb, and two more shall take its place!” \\nStats Watch \\nConsumer Sentiment, November 2016 (preliminary): “Indications going into the presidential election are very positive as the consumer sentiment index is up more than 4 points in the November flash to 91.6 for the best showing since June (the data were compiled before the November 8 result). The gain is concentrated in the expectations component” [ Econoday ]. People expect Trump to do better, then? And: “While this is a very small sampling that is not always universally accurate, investors, traders and economists love to dwell on this report because it is really the first real look at live data for each month” [ MarketWatch ]. \\nRail: “Week 44 of 2016 shows same week total rail traffic (from same week one year ago) marginally expanded according to the Association of American Railroads (AAR) traffic data. Rolling averages remain in contraction – but are improving” [ Econintersect ]. Finally some good news! \\nEmployment Situation: ” The good news is the prime working age group has started to grow again, and is now growing at 0.5% per year – and this should boost economic activity. And it appears the prime working age group will exceed the previous peak later this year” [ Calculated Risk ]. \\nHoney for the Bears: “Sales aren’t falling year over year but they aren’t growing at 5% as they would do in ‘normal’ times” (charts) [ Mosler Economics ]. ” In ‘normal’ times inventories increase with sales, adding to output. But when sales slow inventory growth stops and reverses:” \\nFodder for the Bulls: “Spot metallurgical coal topped $300 a metric ton for the first time since flooding in Australia curbed output from the world’s biggest seaborne exporter five years ago” [ Bloomberg ]. “China’s efforts to cut overcapacity in its coal industry have reduced domestic supply and boosted imports of both metallurgical and the variety burned in power stations.” \\nThe Bezzle: “If a variable is normally distributed we can use standard probabilistic techniques to analyse it. If it is not then we cannot” [Phillip Pilkington, Econintersect ]. “So, what about economic variables? Are they normally distributed? Short answer: no, they are not.” Oops. If you look at income (a proxy for class) you don’t see a bell curve. You see a power law curve. And see the last link in News of hte Wired, too. \\nThe Bezzle: “In September, with typical marketing hoopla, Fitbit Inc. rolled out two new gadgets, the Charge 2 and Flex 2. Designed to measure more detailed fitness stats, the trackers were well reviewed and seemed poised to help Fitbit retain leadership of an increasingly competitive market. But within weeks the devices were piling up in stores, according to analyst spot checks” [ Bloomberg ]. In other words, the stuff wasn’t moving. We need more spot checks everywhere. \\nThe Bezzle: ” UberEats And UberRush Couriers Complain They Don’t Get Their Tips” [ BuzzFeed ]. \\nThe Bezzle: “Apple cuts USB-C adapter prices in response to MacBook Pro complaints” [ The Verge ]. ” Apple’s cables, unlike those you might order from a random seller online, are going to be well-made and reliable.” That’s really funny. My genuine Apple cable wore out in about a year. The mouse cable is wearing out even faster. \\nCo-ops: “Can you lead and manage the operational activities of Co-operatives UK, the membership organisation which works to serve Britain’s seven thousand co-operative enterprises?” [ Cooperatives UK ]. \\nUPDATE Industrial Romance: “The Business of Being Pantone: Turning Color Into Money” [ The Fashion Law ]. “Pantone monetizes wavelengths and pigments the way Coca-Cola bottles water and Manhattan developers buy up chunks of the sky. Technically, it’s a kind of biochemical company. After developing colors in a lab, Pantone makes most of its money by selling the shades and corresponding formulas to fabric mills, printers, and designers in a range of disciplines. It’s a simple model, and business has never been better.” Reminds me of identity politics, conceptually and methodologically. \\n“Among facts that take a stubbornly long time to sink in, here’s one: Countries that borrow in their own currencies never have to default on their debt” [ Wall Street Journal, “Message from the Gilt Market: U.K. Can Never Run Out of Pounds”]. \\nToday’s Fear & Greed Index: 46 Neutral (previous close: 44, Fear) [ CNN ]. One week ago: 14 (Extreme Fear). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Nov 11 at 12:52pm. It’s amazing the dire predictions that didn’t come true. The global economy did not collapse. Neither did the markets or the Internet. There wasn’t violence at the polls. Putin did not hack our electronic voting systems. Funny how when you turn the gaslights off, things stabilize. As Peggy Noonan wrote: “[I]f trendlines that have proved reliable in the past continue, the sun will come up on Wednesday” [ Wall Street Journal ]. \\nClass Warfare \\n“The Elephant Chart: Divergence In Financial Sector Income” [ Econintersect ]. \\nNews of the Wired \\nRIP Leonard Cohen [ Rolling Stone ]. \\n“Regex that only matches itself” [ Stack Exchange ]. Too meta! \\n“What Percent of the Top-Voted Comments in Reddit Threads Were Also 1st Comment?” [ Max Woolf ]. “The answer is 17.24% of all top-voted comments! That’s certainly more than what I expected! Additionally, 56% of the top-voted comments were posted within the first 5 comments, and 77% within the first 10 comments. The chart follows a power-law distribution.” \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (ChiGal): \\nA second hornbeam tree… \\nReaders, Water Cooler is a standalone entity, not supported by the very successful Naked Capitalism fundraiser just past. Now, I understand you may feel tapped out, but when and if you are able, please use the dropdown to choose your contribution, and then click the hat! Your tip will be welcome today, and indeed any day. Water Cooler will not exist without your continued help. Donate\""}, "time": 1742561781.778693}