{"duration": 0.11794543266296387, "input_args": {"text": "\"Election crossroads: Socialism or capitalism? Exclusive: Jane Chastain explains impact of Dems' 'living wage' proposal Published: 20 mins ago Jane Chastain About | | Archive Jane Chastain is a Southern California-based broadcaster, author and political commentator. Despite her present emphasis on politics, Jane always will be remembered as the nation's first female TV sportscaster, spending 17 years on the sports beat. Jane blogs at JaneChastain.com. She is a pilot who lives on a private runway. Print \\nOur country is at a crossroads. Never before have we faced such an obvious fork in the road. One road, the one favored by politician Hillary Clinton and her Democratic colleagues, promises to lead us to a socialist utopia. The other, favored by businessman Donald Trump and some of his Republican colleagues, promises to get us back on the road toward free-market capitalism. \\nIt is no secret that most career politicians lean toward a socialist system. In this system they control the lion’s share of our money and, in turn, hand out favors. In this system, they make the major decisions that affect our lives. As the government accumulates more and more power, we invariably end up with less. Statistics show that the longer a politician stays in power, the more of our hard-earned money he or she spends. Yet we keep electing the same people over and over and over again, expecting a different result. \\nWe’ve been headed down the road toward socialism for quite some time, and this could be the last fork in the road we will have to get us back to the free-market system that has given this country the highest standard of living in the world. No, it isn’t perfect, but it works for everyone who is willing to work hard and wants to improve his or her life. \\nNotice what I didn’t say is “simply willing to work hard.” There is the belief by some that if you simply work hard, you should have what these politicians now call a “living wage” – the income necessary to support a family of four and supply all its basic needs, which is around $85,000 a year in some parts of the country. The Democrats want to replace the minimum wage, which is a training wage, with this living wage. That completely kicks the bottom rungs out from under the economic ladder Americans have traditionally climbed to reach their goals and live independently. \\nIdeally, it would mean that you could take a job flipping hamburgers and never gain any skills or accept any responsibility, and live as comfortably as the guy or gal who does. \\nUnfortunately, this so-called living wage will destroy jobs. It will cause companies to automate, and those that cannot will begin moving offshore at an even faster rate. \\nBut this living wage is only part of what the Democrats want to do in the name of fairness. \\nThis, no doubt, appeals to many in this poor economy who have lost all hope, so they are lulled into thinking that the socialist road is much better. \\nWages have remained flat for far too long, but the Democrats are proposing raising taxes even higher on businesses and job creators. \\nMost people simply do not understand that businesses don’t pay taxes. They are passed down to consumers in the form of higher prices. And when the price of the necessary goods and services becomes too high, such as we’ve seen in Obamacare, there is a large outcry. That’s when the government steps in and takes over the means of production and the control of those services. That’s when the door to socialism/communism slams shut. \\nThey tell us if we take this socialist road there is nothing to fear. Our benevolent government will take care of us. They are offering us free college – or almost free loans – in order to get the job we want at a salary we think we deserve. And if we don’t get that job, the government is going to give us free health care, free food and free housing. Under President Hillary, there will be free child care, free preschool and paid family leave. What a country! \\nIf we don’t reach our goals, everything will be OK because Social Security and Medicare will be there to finance our retirement, and if that isn’t enough, the government will put us in a retirement center where we live out the remainder of our years playing checkers or watching television. \\nWhat about the fact that Social Security and Medicare are going broke? How long can we keep printing money to keep us afloat before our economy collapses? They never talk about that. \\nAs British Prime Minister Margaret Thatcher once said, “The problem with socialism is that you eventually run out of other people’s money.” \\nDon’t be fooled: This election is about a lot more than the two personalities at the top of the ticket. It’s an important fork in the road: One fork requires hard work and sacrifice but offers freedom. The other offers a free lunch. \\nMedia wishing to interview Jane Chastain, please contact . Receive Jane Chastain's commentaries in your email BONUS: By signing up for Jane Chastain's alerts, you will also be signed up for news and special offers from WND via email. Name *\""}, "time": 1742562334.713961}