{"duration": 0.09404253959655762, "input_args": {"text": "'Donate Whether Trump or Clinton Wins the US Election, What Follows Is up to Us When the polls close, a new battle will begin – to resist a racist climate denier, or to force a centrist Democrat to deliver genuinely progressive change ‘A politician is not a given. Each one is in part what we make them, by pushing, blocking, pressuring, encouraging, fighting, reframing, emphasizing, organizing.’ (Photo: Michael Reynolds/EPA) By Rebecca Solnit / guardian.co.uk \\nPresidential elections are a form of madness that comes over us once every four years. They fit the great-man or -woman narrative of history, seducing us into forgetting how powerful we are. They erase our memory of grassroots power, direct democracy and civil society. Leaders beget followers; people pin their hopes on one person, and with that they seem to shed responsibility for anything beyond getting that one person into office. Or, they wash their hands of any further involvement if it’s not their one person. \\nAnd so it is this time around. With the election a matter of days away and the media engrossed in a fight to end all fights, it sometimes seems as though we’ve lost sight of the powers that belong to us and not them, and the responsibilities and possibilities that go with our power. The intensely personal nature of this campaign – and the particular danger of Donald Trump – has created a kind of tunnel vision. \\n\"We forget our own influence, the innumerable times we’ve swayed outcome.\" \\nWhich is not to say that the outcome is unimportant. Far from it. Many Clinton supporters seem quietly confident of a win. I am less complacent. We’ve had enough surprises this year – in Britain, in Colombia – to know that voters have a way of confounding those who observe them. A Trump presidency would be a terrible thing. But a Clinton victory would be far from an occasion to sigh with relief, sit back and resume life as though the last few months had been a bad dream. A Clinton victory, in fact, would be just a starting point for a new kind of campaign. \\nA politician is not a given. Each one is in part what we make them, by pushing, blocking, pressuring, encouraging, fighting, reframing, emphasizing, organizing. Every election season we pretend that one person will have all the power and that whatever they promise up front is exactly who they’ll be, for better or worse. We forget our own influence, the innumerable times we’ve swayed outcomes, such as the decision to veto the Keystone XL pipeline. We forget the way culture and activism set the norms for political decisions on matters such as same-sex marriage rights. \\nElection seasons erase the memory of movements that worked for years or decades, outside and around, below and above electoral politics. They drown out the histories that matter: how women got the vote, how the civil rights movement progressed, how the Free Trade Area of the Americas trade deal withered and died, how the World Trade Organization was hobbled and its poorer member nations inspired to revolt by the great 1999 shutdown in Seattle, how fracking got banned in New York State, how rape law has been radically revised in many ways and places thanks to feminist action and discourse. In all these cases, the people who we mislabel leaders only followed the will of the people. \\nTo reiterate: it matters who is president, but what a president does has everything to do with what the people demand or refuse or do themselves, and what the House and Senate send them or sabotage. \\nMitt Romney promised to build the Keystone XL pipeline himself if elected; Republicans for the foreseeable future will be puppets of the fossil-fuel industry. Democrats are not necessarily our friends or allies, but they are sometimes politicians who can be pushed. Obama wavered on that pipeline for several years. When he vetoed it, it was not because of who he is, but because of who we are, we the members of a climate movement that organized, educated, campaigned, blockaded and demonstrated for years, building a powerful movement. \\nThat the president has become so much more engaged with climate is a result what the movement did: it educated us on the science, made the case for the urgency and importance of action, built global coalitions, shed light on the ways climate is an economic and racial justice issue, started innumerable campaigns to block pipelines, divest, implement efficiency and good design, and shift to renewable resources. A lot of other changes that matter have happened at the local level as cities, regions and states have done great work on climate, led by community organizers, small groups and minor politicians you’ll never hear about. \\nThe Obama administration could have done much more if more of the people who elected him stuck around to push back against the corporations, well-organized conservatives and big-money interests. Which is not to even raise the question of that administration’s principles; it’s more useful to ask what are our own, if most of us do little or nothing about policies we deplore or ideals we praise. \\nThe same will be true of a Clinton administration, if that’s the one voters choose on Tuesday. The extent to which it serves the interests of people and our planet depends in part on the extent to which citizens apply pressure to it. You may feel exhausted right now; tired of a bruising cycle which has left no personal stone unturned (often to the detriment of policy scrutiny). But the truth is, we’re at the beginning – either of a period of sustained resistance against a racist, misogynist, deranged climate-denier – or a period of sustained action to push the first female president to deliver a genuinely progressive, climate-conscious agenda. \\nIf we end up with a Democrat (and I regret that that’s the best choice we get in this binary election), a lot is up to us. That’s a gift and a responsibility. I’ll take it. I hope you’ll join me. \\n© 2016 Guardian News and Media Limited \\nRebecca Solnit is an activist, TomDispatch.com regular, and author of many books, including the just published , Men Explain Things to Me (Dispatch Books, Haymarket Books). Her first essay for TomDispatch.com turned into the book Hope in the Dark: Untold Histories, Wild Possibilities , since translated into eight languages. Other previous books include: The Faraway Nearby , A Paradise Built in Hell , Wanderlust: A History of Walking , The Battle of The Story of the Battle in Seattle (with her brother David), and Storming The Gates of Paradise: Landscapes for Politics . She is a contributing editor to Harper\\'s Magazine . 0.0 ·'"}, "time": 1742563667.5581057}