{"duration": 0.15056443214416504, "input_args": {"text": "'On Tuesday, Shaun King, the “senior justice writer” for the New York Daily News, announced his boycott of the National Football League. The former black lives matter spokesman, deposed after the discovery that he is white and not the African American he claimed to be, accused the NFL of being “bigoted” against black people because it hasn’t hired   protester Colin Kaepernick. [King made his proclamation after it became clear that American anthem protester and former San Francisco 49ers   quarterback Colin Kaepernick would not find a team to take him on after he became a free agent at the tail of last season.  Kaepernick spent the entirety of the   season refusing to stand for the national anthem and spoke out against the U. S. A. our police, soldiers, and other first responders. He also repeatedly said the country was “never great. ” But after the season ended, in February the player announced both his free agency and an end to his     protests. But despite his new status and his pledge to end his embarrassing protests, Kaepernick has not been able to find a team to hire him for the coming football season. His inability to find a berth has sparked numerous protests by   fans and   sports reporters alike. Kaepernick was even the subject of a politician’s decree when a   socialist Seattle City Council member wrote an open letter demanding that the Seattle Seahawks bring him on. The demands ultimately fell on deaf ears. With Kaepernick left out in the cold,   football fan Shaun King now says he can’t watch football anymore. “I can’t, in good conscience, support this league, with many of its   owners, as it blacklists my friend and brother Colin Kaepernick for taking a silent, peaceful stance against injustice and police brutality in America,” King blathered in his June 6 column. “It’s disgusting and has absolutely nothing to do with football and everything to do with penalizing a brilliant young man for the principled stance he took last season. ” The white man who posed as a black man for a decade fulminated at Seattle Seahawks coach Pete Carroll for turning his back on Kaepernick and signing white quarterback Austin Davis instead. King labeled Davis a “scrub” over the incident. King, who admitted that he lied about being black, went on to rail at the Seahawks for hiring Davis who has far fewer accomplishments in the NFL than Kaepernick. The activist insisted that there could be only one reason that the Seahawks took a pass on Kaepernick: It’s racism. It’s bigotry. It’s discrimination. Period. It’s not football. Don’t call it football. If you call the decisions by 32 teams to not sign this man a football decision, you don’t know football and probably voted for Donald Trump. Nearly 100 quarterbacks —  96, in fact —  are usually signed to teams in the NFL. That Colin Kaepernick is not one of them is disgusting. Of course, he’s one of the top 96 quarterbacks in the league. Kaepernick’s longtime rival, Richard Sherman, said he believed Kaepernick was a   quarterback. King went on to add that the “ridiculous fragility of the conservative white male fan base” has kept Kaepernick on the sidelines. Finally, this very white “black activist” added that his decision was sealed when ESPN announced that it had rehired country singer Hank Williams, Jr. to once again sing his iconic Monday Night Football theme song at the start of each Monday game. Williams had been fired six years ago for being a conservative. “Hank Williams, Jr. is basically Donald Trump with a guitar. He’s a bigot,” King growled. “Everybody knows it. His songs and statements have echoed bigotry for years, but now that Obama is out of office, he’s back. ” King continued, bellowing: Hank Williams, Jr. and Austin Davis are employed right now, and Colin Kaepernick isn’t. Shame on this league for following Trump’s lead in spirit, tone and now in actions. I’m appalled. As a lifelong fan, I’m deeply disappointed. What I do know is this —  I can’t support this product. Warming to his closing statements, King then blamed his little son for launching the boycott with a claim that his    boy told him they could no longer watch football, “After what they’ve done to Colin and with all of those owners loving Donald Trump so much. ” So, in the face of all this purported “injustice,” King has set out on his road to boycotting the NFL: Maybe if Colin Kaepernick gets a deal, it would change my mind, but deep damage is already done. As a leader in the Black Lives Matter Movement, as a voice in the resistance to Donald Trump, and as a friend of Colin Kaepernick, I cannot, in good conscience, support the NFL any longer. If I did, I’d struggle to look my own son in the eyes or look at myself in the mirror. As a reminder, King is boycotting a sports league that is almost 70 percent African American. It is a business where the average rookie salary is $365, 000 a year, a number that goes up by tens of thousands every year the player stays signed to an NFL team. It is also a league where the average player’s salary is about $1. 9 million annually. This is the same sports league that Shaun King says isn’t black enough and is unfair and discriminatory to blacks. But, this is also a man who directly equates   to being “tolerant” and right thinking. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563625.377793}