{"duration": 0.07024860382080078, "input_args": {"text": "'No one can know for sure what was in the mind of the person who fired the shot that killed a woman as she drove through Milwaukee on Tuesday. The shooter was 2 years old. The woman who died on State Highway 175 was Patrice Price, 26, the Milwaukee County sheriff’s office said Wednesday, and the gun was in the hands of her own toddler. The weapon, which investigators found on the floor of the back seat, was a .  pistol used by Ms. Price’s boyfriend, a security guard. His gun belt and tactical vest were also in the car, the sheriff’s office said. The local news media reported that the blue Dodge sedan Ms. Price was driving belonged to the boyfriend. The sheriff’s office, which would not name the boyfriend, said in a statement that the    who was not in a car seat, “retrieved a firearm that slid out from under the driver’s seat and shot through the seat, striking the driver. ” Ms. Price managed to stop the car, but by the time rescue personnel reached her, she was not breathing. She was pronounced dead at the scene. The sheriff’s office did not say whether anyone would face criminal charges. In tales of gun violence, accidents involving curious children and weapons seem especially tragic, but they are not especially unusual. Most often, they involve guns left unsecured by the child’s parents. In the seven days that ended Tuesday, in addition to the death of Ms. Price, a    in Georgia, a    in Louisiana, a    in Missouri and a    in Indiana fatally shot themselves a    in Texas shot and wounded a family member a    in California killed a    friend in a shooting that officials called accidental a    in Texas accidentally shot and wounded a    friend and a    in Indiana accidentally shot and wounded herself. In an episode with striking parallels to the Milwaukee shooting, last month a mother driving in Florida was shot and wounded by her    son, who was in the back seat law enforcement officials said that in that case, too, the gun had been stashed under the driver’s seat, and then slid backward. The woman, Jamie Gilt, had operated a   Facebook page on which she said her children knew how to shoot, and “even my    gets jacked up to target shoot the . 22. ” Everytown for Gun Safety, the gun control group, says that since the start of 2015, at least 342 people in the United States have been accidentally shot by people under age 18. When Ms. Price, a mother of three, was fatally shot in Milwaukee, her mother and her    child were also in the car. “Now I don’t have her no more,” her father, Andre Price, told WISN, a local television station. “I got a knot in my chest. ”'"}, "time": 1742561738.539489}