{"duration": 0.3341343402862549, "input_args": {"text": "'  America Is The Loneliest Country In The World – Is It Because We’ve Abandoned The Traditional Family Structure?   13th, 2013 \\nOf all the nations on the entire planet, the United States is the most lonely place to be. We have the highest percentage of one person households on the entire globe, and the average size of our households has been steadily decreasing. Studies have shown that the number of close friends that Americans have is falling, and we have the highest divorce rate in the world by a wide margin. So why is this happening? Does this have anything to do with the fact that America is abandoning the traditional family structure? Back in the 1960s, the “sexual revolution” fundamentally changed the way that millions of Americans viewed sex and love. By throwing out all of the old boundaries, many Americans believed that they would ultimately be able to have more sex and more love. Today, this manifests itself in a “hookup culture” that is constantly being promoted as “healthy” in our popular music, in our television shows and in our movies. But instead of this “hookup culture” resulting in more sex and more love, most Americans are discovering that it leads to just the opposite. We have become a nation of desperately lonely people that have very few real ties to others. \\nNever in the history of our nation have Americans been so isolated from one another. Most people get up in the morning, drive to work or school, perhaps do a little shopping afterwards, and then drive home again. The rest of the evening is typically spent in front of the television or on some sort of electronic device. \\nIn addition, most Americans spend precious little time attending social gatherings of any sort these days. Church attendance is at historic lows , and most people don’t take the time or the effort to get involved in other types of social groups. \\nAnd even when Americans do go out and try to meet people, the relationships that are formed are very much “on the surface” at best. The truth is that most Americans have very few “close friends”. Just take a moment and consider how many people outside your immediate family actually “love you” and would be there for you no matter what. For most Americans that number is depressingly low. \\nIn a desperate attempt for human love and interaction, an increasing number of Americans have turned to social networking websites such as Facebook to fill that void. For the desperately lonely, some human contact is better than none. In fact, a growing number of people are so desperate for people to talk with them that they will pretend to be someone else online. Many will even use an attractive picture of someone else in an attempt to try to lure others. This has become so common that this phenomenon has even been given a name. It is known as “ catfishing “, and it has grown to epidemic levels. \\nOther Americans deal with their loneliness by recklessly indulging in food, drugs, gambling, shopping or other addictions. We are a fundamentally unhappy nation, and this is reflected in the fact that we lead the world in antidepressant use. In fact, the total number of Americans taking antidepressants doubled between 1996 and 2005. \\nCould a lot of this have been avoided if we would have just fully embraced the traditional family structure as a nation? \\nWouldn’t most of us be doing a lot better if we lived in homes that were filled with happy, healthy families? \\nJust consider what the consequences of “free love” and the “hookup culture” have been for America… \\n*At 26 percent, America has the highest percentage of one person households on the entire planet. \\n*100 years ago, 4.52 were living in the average U.S. household, but now the average U.S. household only consists of 2.59 people . \\n*Back in 1950, 78 percent of all households in the United States contained a married couple. Today, that number has declined to 48 percent . \\n*The marriage rate in the United States has fallen to an all-time low. Right now it is sitting at a yearly rate of 6.8 marriages per 1000 people . \\n*Today, an all-time low 44.2 percent of Americans in the 25 to 34 year old age bracket are married. \\n*According to the Pew Research Center, only 51 percent of all Americans that are at least 18 years old are currently married. Back in 1960, 72 percent of all U.S. adults were married. \\n*In the United States today, more than half of all couples “move in together” before they get married. \\n*The divorce rate for couples that live together first is significantly higher than for those that do not. \\n*America has the highest divorce rate on the globe by a wide margin. \\n*In 1970, the average woman had her first child when she was 21.4 years old . Now the average woman has her first child when she is 25.6 years old . \\n*The birth rate for American women in the 20 to 24 year old age bracket has fallen to 85.3 births per 1,000 women . That is a new all-time record low. \\n*Approximately one out of every three children in the United States lives in a home without a father. \\n*For women under the age of 30 living in the United States today, more than half of all babies are being born out of wedlock. \\nFor most Americans, marriage has come to be viewed as a temporary agreement that can be abandoned the moment that it no longer makes them happy any longer. This “me-centered” approach to love and marriage has had a whole host of negative consequences for us as a nation. \\nAs the National Marriage Project puts it, a marriage in America now “depends for its survival on the happiness of both spouses”… \\nOver the last four decades, many Americans have moved away from identifying with an “institutional” model of marriage, which seeks to integrate sex, parenthood, economic cooperation, and emotional intimacy in a permanent union. This model has been overwritten by the “soul mate” model, which sees marriage as primarily a couple-centered vehicle for personal growth, emotional intimacy, and shared consumption that depends for its survival on the happiness of both spouses. Thus where marriage used to serve as the gateway to responsible adulthood, it has come to be increasingly seen as a capstone of sorts that signals couples have arrived, both financially and emotionally—or are on the cusp of arriving. \\nAnd our young people are no longer taught to value marriage. Instead, they are told to put off marriage and to go out and “have some fun”. This message is constantly being reinforced by popular culture. For example, posted below is an actual pro-Obamacare ad . Yes, I know that this ad is almost too bizarre to be true, but it is actually a real ad. And as you can see, the messages that it is sending to our young people are not very subtle at all… \\nWe have become a nation where “anything goes”, and most Americans seem to like it that way. \\nSo what do you think? \\nIs America the loneliest country in the world because we’ve abandoned the traditional family structure? \\nPlease feel free to share your opinion by posting a comment below… What Are The Off-White Boxes That Are Going Up On Utility Poles All Over Seattle? » K \\nThe lack of family structure is part of it. But there is something far more basic, that has died in this Country. The dog eat dog business attitude, the money is the most important thing attitude,and the I come before everyone else attitude, All these things killed this precious concept. What is it? Trust. You can not have a good marriage, or friendship without it. Ask yourself, how many people you know, would you trust with your life? For most it is a rather small number. Sadly for some the number is 0. ISA \\no here. I dont trust, nor really care for, most any of you. I learned this in childhood, by watching the true nature of adults. Adult Humans are the virus of the World, of rotting flesh, that is a parasite. This can be proven empirically. Aston Martin \\nAdult humans except “# Godschosenones?” because saying that all humans are viruses inclusing the shoes is # antisemitic? I see where you are going.. rbolo29 . \\nIt’s because of the apathy of realizing there is no God; so the children play and do what they want. Kim \\nProbably why so many people attach themselves to their animals. I know people that treat their dog like their child. It’s because it’s all they have. ISA \\nSome dont treat their animals that way out of loneliness, but a dog just makes a better friend than Humans. Thats the truth. Take it or leave it. Humans are rather crappy things. Kim \\nSome humans, not all of them. Don’t get me wrong, I love my pet as much as anybody. But some people go overboard. A Dodgy Bloke \\nI think a number of components go into this. A big one is the sexual revolution I have seen personally how it’s a great thing for guys but a disaster for women. The tragic part is most women don’t see it, the want the same sexual freedom as men, but ignore the damage done. The damage is kids with no father, and a woman who has several children by different guys. The woman wakes up forty alone, has no control over her life dependent on welfare but has ultimate responsibility for what happens under her roof. Everybody wants to be loved in one form or another. I think the culture produces high expectations in what people want or expect in a spouse. Men want somebody young good looking with no issues. Woman are looking foe the same, but some have a attraction to bad boys who they find exciting. People don’t get to and know each other before they wind up in bed. They get caught up in the newness get married and wake up one morning look at their spouse and wonder ‘What did I see in you.” But I have hope that the coming hard times will reverse this because people will have to adapt, or not survive. rbolo29 . \\nIt really doesn’t matter; because we all die in the end and if there is no God to save us; then it’s a total lost cause to even try to be moral and good. Some Dude \\nfix yourself and become the change you seek in others for those others are all the reflections of the changes you made from within, granting them the permission to let their own light shine. \\nonly then will humanity rise above the din of the dark ages that still reigns with a rationale leading it only to extinction Dedalius Stanton \\nAbout to graduate from college within a short timeframe, this fearsome yet truthful article details some chilling events experienced in my academic career. Up unto this point, many of students within my campus follow a self-centered, selfish attitude, unaware that their destructive attitudes harm only but themselves. The idea of “STFU and leave me alone” concept continues to be pushed forth by faculty, peers, and the social environment. Having lived in the dorms, I’ve been through numerous roommates who refuse to talk to anyone, especially to me, stating that I’m too weird or someone who should just drop dead, yet later claim they have no friends and spend most of their time wasting it away, allowing their academic careers reach at a stag point. The same applies to my classes. I know about 70 students by name who will graduate this semester, but how many do I personally know and trust? Sadly, that number is zero. This is not because I don’t engage in conversations, but it’s rather the experiences that others around me only care only for themselves, while ignoring those that may be able to provide lasting friendships and improving the overall quality of life. rbolo29 . \\nIt’s ok; because they will graduate and find there are no jobs waiting for them; except being a manager at McDonalds. Jim Davis \\nAsst. Manager at best. Aston Martin \\nThe gullible femaleist women from colelge will probably go on dating websites to find elderly rich and wealthy men who are desperate enough to date goods which were expired a long time ago. \\nI agree I had similar experiences. Most people had their own little groups of friends and never really mingled with others. I think the problem is too, many people don’t know HOW to make friends. Everyone is so self-absorbed. MichaelfromTheEconomicCollapse \\nI am sorry to hear that you had such negative experiences with roommates. Finding a good roommate these days can be a real challenge. I am glad that I don’t have to worry about that anymore. \\nMichael John Doe \\n71 percent of young men between the ages of 18 to 34 in America are not interested in marriage: \\n71% of young men in America do not want to get married \\nI guess feminism killed marriage. Kim \\nThey can’t afford it. They are barely scraping by on their own. Ditto \\nBingo. I live just as the fine article says: I get up in the morning, drive 28 miles to work, drive 28 miles home again, do some shopping, then spend the other three or four hours of my day watching TV or surfing the web. No time or money for anything else. MichaelfromTheEconomicCollapse \\nYou probably burn up a lot of gas money too. I certainly don’t miss the days when I had very long commutes to work. \\nMichael ISA \\nCant afford it, and who would want to be married today? Even the boomer generation is throwing in the towel. If Americans can evolve, which they cant, then its over with soon. You all are still stuck in the model of 60 years ago, if not more, and are dying on the inside. \\nGood riddance. Lars Lonte \\nI totally agree with you – just compare Women from Eastern Europa or even Asia with the average Women from the East Coast or Europe (especially (West-) Germany and Great Britain as most US like states and cultures….there is a reason, why Eastern European men usually do not want to marry women from western Germany…. King Mercury \\nBecause American women have literally priced themselves out of the dating market! American women show that they want only guys with big, wide luxury sports Ferraris with all of the latest technology, gigantic mc mansions at least 5 times the size of the Home Alone house, three quarter million dollar or higher incomes, a growing number of them are even going for gangsters and thugs that get that kind of luxury through violent crime and illegal drugs. Jonathan \\nWomen are uncooperative, don’t care, too busy, incompetent at love and domestic life and think it’s cool to emotionally, psychologically, financially, and in every way abuse men and never receive any reciprocation for their bad behavior, nor offer any reciprocation for men’s gifts. The egomania in women has exploded, and the genie can no longer fit in the bottle. rwinkel \\nIt’s a no brainer. Lookup “hisanic paradox” on wikipedia. The abuse of infants in this country is an important factor in the rise of sociopathy and broken families. Infants imprint just like every other mammal on the planet, and American obstetrics is unique in its disregard for children’s dignity and human rights. P.F. \\nAmerica is in this state because it has turned to sin rather than YAHWEH’S HOLY LAW. Only in our LORD JESUS/YESHUA do we find fulfillment, peace, and joy. When people are filled with joy they share truth and love–when people are moaning miserably inside they become cold and detached. You can’t depend on people to bring you happiness first—you have to seek JESUS/YESHUA who teaches us how to love one another the right way, and then, and only then, will people know joy. america depends on itself to create its own happiness and you’re seeing the negative effects. Back in the 1950’s Biblical values were held strongly in the homes. That’s why you see your grandparents who were married during that time either still alive and married and buried next to each other. What you’ll see in the coming years are old ladies and men wondering around alone who are not married and who will be buried in single graves while the children carry on the negative tradition of their failed ways. Way to go america, you’re doing just fine. David McElroy \\nSad, but true, P.F. If it weren’t for hope in Jesus, there’d be no hope at all! MichaelfromTheEconomicCollapse \\nMichael David McElroy \\nAs the oldest of 12 children from an Irish father who stayed married to our mother, I can testify as to the merciless bombardments of anti-family messages delivered to us. My mother was urged to abort many of my siblings. Teachers and other “counselors” urged us not to spend so much time together, as we were “clannish”. I fell for the encouragement to go to college and make something of myself and “get ahead” before marriage and children. Even our church was discouraging, openly saying we took too much pew space and gave too little money. (Even though we physically labored to help build the building!) I went to college, became a journalist and, after a disasterous cohabitation I thought would lead to marriage, eventually a chaplain. But I also ended up an old bachelor who thought he would have a wife and grandkids by now. My computer is my companion! CollGen2 \\nYou are a wonderful person. Your parent’s stuck together. That is the way God’s original design was. Your writing touched my heart today, thank you! All things will work out for good to those who LOVE God and are called according to HIS purpose. HE created each one of us and He also beckons us. He put an end to sin by being the perfect sacrifice on that cross. He beckoned me and I did it my way…..til trouble hit! I have a husband, 3 children and 4 grandchildren. I am alone most of the time at home, answering the phone for my small business. But, most of the time, I am immersing myself in the King James Bible and fellowshipping with my Father. He is the only one who will never leave me nor forsake me. How do I know that? I was in a coma many years ago when He beckoned me. I have tried to do things the “me” way but every road was a disaster until I surrendered my life to Him! The suffering I go through here is nothing compared to the GLORY that awaits me.”! Tim \\nThere are good, faithful men out there who want a family. David McElroy \\nI’m with Tim, I was one of those guys who wanted to be a faithful husband and father. But I made the mistake of being smitten with a conniving woman who had no maternal domestic interests, being the “modern” sort. Jenn \\nI’m sorry that happened to you. Not all of us women are that way, but many of them seem to be these days. :-( Aston Martin \\nModern westernized women are victims of the you-know-who….research who founded and promoted the femaleist movement and the truth shall make you afraid while you struggle to set free of the international bankers. SafetyViking \\nGood. Why buy the book when there’s a library in town? godozo \\nUgly analogy. Knowledge is meant to be shared, women…not. Even the Founding Fathers and many of the old-school Robber Barons would agree (Carnegie anyone? He funded a nation’s worth of libraries.). \\nTry “Why buy the cow when the milk is free?”. Lifelong Mates (both male and female) ARE a limited resource, and like milk is worth paying for to keep (or keep the flow coming, depending on the item). wombleranger \\nI don’t like to be the one to say this but….if you remove spirituality and morals from a society you end up with the western world. America isn’t the only western power suffering this condition come to Canada where anyone with a problem gets a Prozac prescription and it’s free!!! We would be wise to remember the former Soviet Union and it’s devastation of the churches and religions. Now we must ask ourselves are we staring to become a communist nation? To quote William Penn ” .Those who will not be governed by God will be ruled by tyrants”-certainly is food for thought! A lonely mind is a dangerous mind. Eileen Kuch \\nVery well put, wombleranger. Indeed, if you remove spirituality and morals from a society, that society starts to fragment. Just look at America today. It’s barely recognizable as the God-fearing nation it used to be. \\nI don’t know about your Prime Minister, Stephen Harper, but Barack Obama is the worst Presidents we ever had. He’s hell-bent on destroying the old America and turning it into a USSA, a near image of the early 20th Century USSR, where Orthodox Christian Churches were devastated and the religion driven underground. \\nThose who will not be governed by God will be ruled by tyrants – William Penn \\nGreat quote, too. wombleranger \\nThanks Eileen. It’s comforting to see there are still moral people in this world, now we just need to wake-up the good souls from the deep sleep. It’s an uphill battle to be sure, but as long as i breath i will never forsake my dignity, morals and most of all my God. nilro \\nToo many nut cases out there, Animals are a better bet. Truman Golden'"}, "time": 1742564170.3902638}