{"duration": 0.10029745101928711, "input_args": {"text": "'Home / Badge Abuse / Blue Privilege in Action: Video Shows Cop Crashing into Cars & Fleeing Police — No Arrest, No Charges Blue Privilege in Action: Video Shows Cop Crashing into Cars & Fleeing Police — No Arrest, No Charges Jay Syrmopoulos October 28, 2016 Leave a comment \\nOroville, CA – In footage that looks like it came straight out of Broken Lizard’s Super Troopers, a California state parks law enforcement officer was caught on video crashing his police SUV into a power pole and parked vehicle – then attempting to flee from responding officers . \\nThe incident happened just before 2p.m. on Thursday afternoon, with video showing Daniel Kenney, 43, driving a state parks vehicle into a parked car and telephone pole, according to the California Highway Patrol. \\nThe bizarre scene shows officers around the vehicle after the crash, with one cop eventually smashing out the passenger window. Seemingly in response to the window being broken the vehicle lunges forward, then backward, in an apparent attempt to flee from officers – who can be heard yelling “stop” repeatedly. \\nKenney then came to a stop at the traffic lights momentarily, as police continued to command him to stop the vehicle. As an officer approached the driver side door, the vehicle abruptly takes off down the street with officers giving chase. \\nAccording to Photography is Not a Crime : \\nDaniel Kenney, who is listed as a state park peace officer supervisor, was then handed over to his department, who promptly placed him on paid administrative leave. \\nKenney, a K-9 officer who made more than $95,000 last year, was the recipient of the 2012 Top Dog Award along with his dog Kilo for “demonstrating the best discipline, teamwork, and overall skills.” \\nIt is not clear if Kilo was in the car with him as he made his getaway but the video shows the words “K-9 Unit, Stay Back” on the side of his patrol car. \\nMeanwhile, a man sitting inside the parked vehicle that was struck by Kenney’s patrol car was also transported to the hospital with minor injuries, according to Action News Now. \\nThe incident was so bizarre that the individual filming can be heard wrongly making the assumption that a civilian was driving the vehicle, most likely believing the vehicle was stolen. Eventually, Kenney was pulled over and placed in handcuffs – and after being found to not be under the influence of alcohol or drugs – he was released to state park supervisors and taken to a hospital for evaluation. \\nThe fact that this man was not arrested seemingly speaks to there being a separate set of rules for law enforcement, than for the rest of society. Although perhaps there were mitigating circumstances that haven’t been made public, there is a stark appearance of impropriety. Kenney has not been arrested or charged with anything, but has been put on paid administrative leave. \\nThe reality is that if this had been a civilian driving the vehicle the police would likely have shot and killed the driver and claimed they feared for their lives — as we have seen happen numerous times . \\nDo you think you would receive the same treatment as this man in similar circumstances? Let us know in the comments, and please share this wild video! Share Social Trending'"}, "time": 1742564122.438195}