{"duration": 0.02524280548095703, "input_args": {"text": "'INSPIRATIONAL VIDEO : 94 Year Old Supporter Walks a Mile a Day Stumping for Trump INSPIRATIONAL VIDEO : 94 Year Old Supporter Walks a Mile a Day Stumping for Trump Culture By TruthFeedNews November 3, 2016 \\nWALTON COUNTY, Fla. (WJHG/WECP) – At age 94, you could say Arlene Borges is one of Donald Trump’s biggest fans. \\n“I like him, I liked him before he was even thinking about being a president,” Borges said. \\nAnd thanks to a morning routine that has become a ritual, you could also call her a super fan. \\nEvery day, when most people are going to work, Arlene is going the extra mile for Donald Trump. The Santa Rosa Beach resident walks one mile around town in her Trump t-shirt, meeting and greeting passersby with her bubbly personality. \\nSo how did it all start? \\n“Well little did my son know, when he bought me a Trump shirt, I started wearing it, and boom – everything happened,” Borges said. \\nArlene has become something of a local celebrity now, with some fans even stopping to ask for a photo. She recalls one time in particular. \\n‘I was over on the church street and I was just sitting there getting some sun because it was kind of a chilly morning, and this car whizzes up and she gets out and had her camera or maybe it was her phone, and she says, ‘Oh I’ve wanted a picture of you with your Trump shirt on’!” \\nArlene says she wasn’t always a Republican, but she doesn’t remember what year she switched parties. Her husband was a Democrat and she voted the way he voted. \\nThe first vote she cast for president was for the 32nd one, back when the voting age was 21 instead of 18 years old. \\n“Franklin D, you know, everybody was great for Franklin D. Roosevelt,” she said. \\nAnd now, as she casts her ballot for the man she hopes becomes the 45th, this 94 year-old will continue her grassroots effort to encourage others to do the same. \\nH/T – WJHG \\nSupport the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742564498.2456496}