{"duration": 0.11085224151611328, "input_args": {"text": "'Posted on January 23, 2012 by Dr. Eowyn | 10 Comments While we were transfixed and distracted by the Newt vs. Mitt drama in South Carolina, Obama has quietly begun war with Iran — without informing the American people (or Congress?). \\nThis is the startling assertion made by James Rickards in an interview on January 13 with King World News. \\nRickards is a Senior Managing Director of Tangent Capital in New York, whose advisory clients include government directorates around the world. He is the author of Currency Wars: The Making of the Next Global Crisis (Penguin/Portfolio, 2011). Rickards is also the man who had negotiated the release of American hostages from Iran in 1981, and continues to be involved in US national security issues and the Department of Defense. \\nThis is what Rickards told King World News about the situation in Iran: “The fact that we, meaning the United States, are on a path to a war with Iran is very clear at this point. It does seem the countdown has begun and it’s coming to a head sooner rather than later. Things are moving very quickly. General Martin Dempsey, who is the Chairman of the Joint Chiefs of Staff has arrived in Israel and Israel is integrating itself with the U.S. European Command or EUCOM. So, at this point, the integration of the Israeli and the US operational capability, including NATO based in Europe, is very far along. There are an enormous number of US troops in Israel. I don’t know if people realize that, but they are operating the THAAD system (Terminal High Altitude Area Defense). They oversee weapons that will shoot down incoming Iranian missiles. There are joint exercises going on between the US and Israel. At the same time Iran is conducting war games. There are a lot of moving pieces on the chessboard at this point. This is not just war gaming or thinking about what might happen, the pieces have actually begun to move on the chessboard. For Israel this is really existential. The US would really like to see a world where Iran did not have nuclear weapons, but for Israel it is not a preference. If Iran gets nuclear weapons, Iran has said they will burn Israel to the ground. So, this is not just a strategic rebalancing, this is life or death for the Israelis….. All of the information I have is that the US is going to do it (attack Iran). So the tension between Israel and the United States is being resolved in favor of letting the US actually launch the attack. Part of the reason for this is the retaliation vector. If the US attacks and Israel keeps out, then Iran has no justification for attacking Israel. They (Iran) will attack US targets in the Middle-East, but we’re ready for that, we’re prepared for that. We will suppress the missiles and their air force is a joke, we’ll take that out in the first day. But they do have a serious missile capability. We’ll need anti-missile warfare and we will need to strike those bases. We will need to do a lot of other damage to Iran, cyber warfare, take down the power grid, take down the command and control structure. Do whatever we can to stop them from attacking our assets in the Middle-East. This war will be fought with air power, sea power, cyberwarfare, financial warfare, sabotage, special operation, assassination, things like that. This is already going on. As an example, yesterday a prominent Iranian nuclear scientist had an unlucky encounter with a magnet bomb. So this war is already being fought. The other day the United States sanctioned the Central Bank of Iran. By the way, we’ve been sanctioning them for years, but we’ve been dialing it up little by little. It’s like the frog that’s boiled in a pot of water and doesn’t know until it’s too late that the water is getting hot. President Obama sanctioned the central bank about a week ago. The Iranian currency, the rial, dropped 30% in a single day. Hyperinflation has broken out in Iran. This is financial warfare. My point to the listeners is this is not theoretical, this is not a war game, not an exercise, it’s happening now and the clock is ticking.” USS Abraham Lincoln \\nRickards’ startling claim is verified by the UK’s Telegraph this morning . \\nIn defiance of Iran’s threat to close the critical Strait of Hormuz, the United States, Britain, and France have deployed six warships to the Strait, led by the USS Abraham Lincoln. The 100,000 ton nuclear-powered aircraft carrier entered the Persian Gulf yesterday. \\nThat we are at war with Iran is also confirmed by a defense expert in the Australian government, a member of a military-strategic e-mail list I’m on. This is what he wrote about Rickards’ claim: “Got back from leave today and had our first major brief. The interesting thing to come out of it was that everyone in the 4 Eyes community regard ourselves at being in warlike mode, even though there is no ‘declared’ war. We are at war. It’s just that the general public can’t see it. We are certainly of the view that we have been at a cyber war for the last 12 years.” \\nGod help us.'"}, "time": 1742561811.423404}