{"duration": 0.07665085792541504, "input_args": {"text": "'MADRID  —   The Spanish minister of industry, energy and tourism resigned Friday morning after documents in the Panama Papers linked him to offshore investments in the Bahamas, and news reports then connected him to a company in the tax haven of Jersey. The minister, José Manuel Soria, a member of the acting government of Prime Minister Mariano Rajoy, is among the most   figures to suffer politically since the release of the leaked papers, which identify companies and people suspected of using offshore bank accounts and shell companies to conceal their wealth or avoid taxes. Last week, Prime Minister Sigmundur David Gunnlaugsson of Iceland said he was temporarily stepping aside after documents showed that he and his wife had set up a company in the British Virgin Islands in 2007. Prime Minister David Cameron of Britain has also been the subject of scrutiny after acknowledging that he and his wife had owned shares in an offshore trust, inherited from his father, that were sold before he became prime minister in 2010. The resignation of Mr. Soria, who has not been charged with wrongdoing, comes at a time of turmoil in Spanish politics, after inconclusive elections in December. Mr. Rajoy’s Popular Party won the most votes but lost its majority in Parliament, making it likely that new elections will be held in late June. Fernando   a senior official in the Popular Party, told Spanish national television that Mr. Soria’s resignation was linked to “a professional activity prior to his entrance in politics. ” “Mr. Soria has been a politician for more than 20 years and has led his political activity in exemplary fashion,” Mr.   said, describing the move as a “very logical decision. ” Mr. Rajoy’s party has been entangled in several corruption scandals. This week, the conservative mayor of Granada, José Torres Hurtado, was briefly detained by the police as part of an investigation into kickbacks tied to construction projects. Mr. Soria, who initially denied any connection to offshore business activities, gradually backtracked after his name appeared in the Panama Papers. The Spanish news media reported this week that the leaked documents identified him as one of the directors of UK Lines, a company registered in the Bahamas in the 1990s. Mr. Soria initially said he would not appear before Parliament to discuss his business dealings, and he described the inclusion of his name in the Panama Papers as “a mistake. ” “It is completely false that I had a relationship with any company, business or function based in Panama, in the Bahamas or in any other tax haven,” he said in a statement. But on Thursday, the Spanish daily newspaper El Mundo revealed that Mr. Soria and his brother had been, until 2002, on the board of another offshore company, based in the English Channel island of Jersey, linked to his family’s business activities. At that time, Mr. Soria was mayor of the city of Las Palmas, in the Canary Islands. Mr. Soria is considered a close confidant of Mr. Rajoy, who has not commented on the departing minister’s finances. “We have to put an end to the government of shame,” Pedro Sánchez, leader of the opposition Socialist party, said on Friday after Mr. Soria’s resignation. Still, Mr.   of the Popular Party highlighted that even though Mr. Soria had stepped down, he had not been charged with financial crime. “In Spain, where people talk about nobody resigning, here we have a clear example,” Mr.   said. “A resignation is not something easy. ”'"}, "time": 1742563781.9442396}