{"duration": 0.0789036750793457, "input_args": {"text": "'The cancellation of MILO’s event with pharmaceutical entrepreneur Martin Shkreli at UC Davis protestors dominated headlines over the weekend, as America looked on in shock at the violence and aggression of   student protestors. [Los Angeles Times  —   ‘Breitbart provocateur Milo Yiannopoulos is shouted down at UC Davis but gets the last word’  The Los Angeles Times reports on the initially successful attempt to stop the “puerile” Yiannopoulos from speaking, adding that his Dangerous Faggot Tour offers “nothing new,” despite being a “flamboyant gay Brit who wears jewellery, makeup and Gucci accessories, and carries a gold lame backpack. ” Whether for Milo or against, UC Davis protesters were ’passionate about his right to be there.’ @abcarianLAT https:  .   —   Marc Duvoisin (@MarcDuvoisin) January 15, 2017,  The Washington Post  —   Protests derail UC Davis event with Breitbart’s Milo Yiannopoulos, ‘Pharma Bro’ Martin Shkreli, The Washington Post focuses on factual reporting, chronicling the events from Friday evening right through to Saturday afternoon. One poignant quote came from student Zareen Nayyar, a MILO fan, who was reportedly in tears after being told to leave, saying that “she had every right to be here. ” Unlike other news organisations, rather than falsely declaring MILO the “King of the ” The Washington Post quotes what he has actually said on the topic, that being that he is “a chronicler of, and occasional fellow traveller. ” Protests derail UC Davis event with Breitbart’s Milo Yiannopoulos, ”pharma bro” Martin Shkreli https:  .   —   Washington Post (@washingtonpost) January 15, 2017,  CNN  —   ‘Protestors shut down Milo Yiannopoulos event at UC Davis’ CNN emphasises how an arrest was made inside the venue as a protestor attempted to storm the building. It also reports on Martin Shkreli’s comments, in which he describes the cancellation as “disgusting. ” “Progressivism is about having a conversation,” he said. Protestors at UC Davis force cancellation last night of talks by Breitbart’s Yiannopoulos  also Shkreli https:  .   —   Paul Knoepfler (@pknoepfler) January 14, 2017,  FOX News  —    Chancellor slams protests that shutdown Milo Yiannopoulos, ‘pharma bro’ at UC Davis, FOX News chose to focus on the comments of UC Davis Interim Chancellor Ralph Hexter, who said he was “deeply disappointed” by the protests, saying “our community is founded on principles of respect for all views, even those that we personally find repellent. ” Chancellor slams protests that shutdown Milo Yiannopoulos, ’pharma bro’ at UC Davis  https:  .  pic. twitter.   —   Fox News (@FoxNews) January 15, 2017,  The Independent  —   Protestors shut down Milo Yiannopoulos and Martin Shkreli University of California event, The Independent gleefully reports on how “heated protests” led to the cancellation of the event with MILO, who they describe as “ . ” The story also refers to a sign held by a student that claims “you can’t pink wash fascism. ” ’You can’t   fascism’: Protestors successfully shut down a Milo Yiannopoulos and Martin Shkreli event https:  .   —   Maya Oppenheim (@MayaOppenheim) January 15, 2017,  The Daily Beast  —   ‘Protests Derail University Event With Milo Yiannopoulos, Martin Shkreli’ The Daily Beast also takes a more favourable view towards the protestors, smearing MILO as someone “known for his controversial, racist rhetoric often used by the   movement. ” Gathering of Scumbags derailed by Protests            https:  .  via @thedailybeast,  —   Pampaw (@pampaw327) January 14, 2017,  LGBTQ Nation  —   ‘UC Davis Republicans cancel Milo Yiannopoulos event amid protests’ LGBTQ Nation takes a predictably skeptical view of the nights events, claiming that all instances of “violent” acts were not confirmed by police, adding that he is a person who “frequently demeans transgender people,” who has “also been accused of racism and misogyny. ” One might’ve thought they’d be a bit more complimentary of MILO, given that he won their poll for “LGBTQ Nation 2016 Person of the Year. ” Fortune  —   ‘Milo Yiannopoulos, Martin Shkreli Campus Event Cancelled Due to Protests’ The business magazine Fortune focuses on “pharma bro” Martin Shkreli’s role in the evening, being a special guest in what was meant to be an event called “Shkrelopoulos. ” Milo Yiannopoulos, Martin Shkreli campus event cancelled due to protests https:  .  pic. twitter.   —   Fortune (@FortuneMagazine) January 14, 2017,  Esquire  —   ‘A Protestor Pelted Martin Shkreli with Dog Poop’ The men’s fashion magazine Esquire reports the totally false news story that Martin Shkreli had dog poop thrown in his face. Shkreli confirmed to Breitbart News that at no point was dog poop thrown at him. I hope this happens literally every time this guy steps outside. Or steps inside. https:  .   —   Cozy Snugglefield (@GaryBuh) January 15, 2017,  Here are some others  …     The Daily Mail  —   ‘UC Davis cancels speeches by   commentator Milo Yiannopoulos and ‘pharma bro’ Martin Shkreli after angry students ‘throw dog feces’ and clash with police’ UC Davis cancels speeches by Milo Yiannopoulos and Martin Shkreli after protests | Daily Mail Online https:  .   —   Cookie (@Cookiemuffen) January 15, 2017,  The Week  —   Protests shut down UC Davis speech by Breitbart‘s Milo Yiannopoulos, #twickerfeed Protests shut down UC Davis speech by Breitbart’s Milo Yiannopoulos. https:  .   —   OttleyInk (@OttleyInk) January 15, 2017,  The Huffington Post  —   Protesters Shut Down   Event Featuring Milo Yiannopoulos, ‘Pharma Bro’ Protesters shut down   event featuring Milo Yiannopoulos, ”Pharma Bro” https:  .   —   huffpostqueer (@huffpostqueer) January 15, 2017,  The Sacramento Bee  —   ‘Controversial Breitbart editor talks to UC Davis crowd and ‘recreates’  ’ UC Davis embroiled in another   controversy https:  .   —   Christopher Cadelago (@CapitolAlert) January 15, 2017,  Reason. com  —   Censorship:   Student Protesters Shut Down Milo Yiannopoulos, #Censorship:   Student Protesters Shut Down Milo Yiannopoulos https:  .   —   Scott (@Scott20024) January 15, 2017,  Mediaite  —   ‘Milo Yiannopoulos Event at UC Davis Cancelled After Massive Protest’ Milo Yiannopoulos Event at UC Davis Cancelled After Massive Protest https:  .  (VIDEO) pic. twitter.   —   Mediaite (@Mediaite) January 14, 2017,  Haaretz  —   ‘  Favorite Milo Yiannopoulos Holds Rally at UC Davis, Despite Event Being Cancelled’   favorite Milo Yiannopoulos holds rally at UC Davis, despite event being cancelled https:  .   —   Haaretz. com (@haaretzcom) January 15, 2017,  You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742628373.8064346}