{"duration": 0.12691760063171387, "input_args": {"text": "'MEXICO CITY  —   For half a century, as Fidel Castro transformed Cuba into a Communist state and sparred with the United States, his brother Raúl worked in his shadow, the authoritarian leader’s disciplined, junior partner. But by the time the elder Mr. Castro died on Friday night, Raúl Castro, who assumed presidential powers in 2006 before getting the official title in 2008, had transformed Cuba into a country that was unrecognizable in many ways  —   and yet remarkably the same. Raúl discarded some of the precepts that Fidel had considered sacred, chipping away at the Communist scaffold his brother had built. And in a stunning embrace that caught the world off guard, he negotiated an end to the   diplomatic standoff with the United States that Fidel had fiercely maintained. It is now solidly Raúl’s Cuba, an island where millennials talk to their cousins on Skype, where restaurant owners hustle for zucchini at privately run farms and where Americans clog the streets of Old Havana. Over all this, he has a firm hold on power, secured by trusted military leaders in vital positions and a new economic course of his making in which private enterprise plays an essential  —   but unthreatening  —   role. Still, Fidel died at a time of great uncertainty. Cuba’s regional benefactor, Venezuela, is collapsing economically. And many Cubans are trying to reach the United States while special immigration privileges are still in place. And now, after multiple rounds of changes by President Obama to knit the two countries closer together, a wild card has emerged: the election of Donald J. Trump, who has threatened to undermine the détente between the two nations unless he can extract more concessions from the Castro government. Cuban officials say they have weathered financial and political swings before, whether they were the American embargo, the collapse of the Soviet Union or the economic troubles in Venezuela. With Fidel gone, a lingering question may now be answered: Did the weight of his legacy hold Raúl back, preventing him from substantially dismantling the cherished system his brother had constructed, or were the slow, halting steps toward change a reflection of Raúl’s own desire to insert new life into the ailing Cuban economy  —   without weakening the structures of state power? Roberto Veiga, the director of Cuba Posible, an organization in Havana that promotes political dialogue, said that Fidel’s passing would “deeply affect people” on the island, but that it would not change the course of the country. “It will have an emotional impact,” Mr. Veiga said. “It will have a political impact. But it won’t have any impact on how the country is governed. ” “It’s a long time since Fidel was in the presidency,” he added. “Raul Castro has been leading the country for years. He has a team. There’s stability. ” Enrique López Oliva, a retired church historian in Cuba, expects change. While he did not rejoice in Mr. Castro’s death, he said, he found himself excited about the possibilities that it could bring for Cuba’s future. “It’s the end of one era and the beginning of another,” he said. “The death itself, we were waiting for that to happen at any moment. But now it feels like a new phase is about to begin. ” Some experts contend that Raúl held back true economic reforms because his brother opposed them. Fidel, some believe, prevented the Communist Party from announcing major new endeavors at the party congress this year, Mr. López said. “Now Raúl will feel more free,” he said. “The process of change will undoubtedly accelerate. ” Mr. López added that Cubans were eager for more economic changes because the increase in tourism seemed to have had the adverse effect of diverting food and other necessities to the tourism sector. Shortages are common, and frustrations are running high. Mr. López, who lives on a $12 monthly pension, said he recently had to sell two luxury antique lamps in order to buy food. “When I was in Miami, people asked me why I didn’t stay in Miami, and I said I wanted to see the end of the movie,” Mr. López, 80, said. “Now I am watching it. We are living a historic moment. I was happy to have lived through the revolution and happy to live through this. ” Raúl has shown a willingness to change course. Brian Latell, a former C. I. A. analyst who has followed the Cuban leadership closely for decades, said the Castro brothers’ relationship was once like a show. Fidel played the mercurial, genius director spewing bold visions, while Raúl was the producer backstage, making sure that the microphone worked, that the actors were paid and that everyone followed the script. But as Fidel withdrew, he said, Raúl was increasingly free to steer the production in a different direction, while retaining its spirit. Raúl has long framed his vision as a continuation of the revolution, vowing to build “a prosperous and sustainable socialism. ” It was Raúl who grumbled about the bloated state bureaucracy and corruption, saying the public work force had to be cut. “We have to erase forever the notion that Cuba is the only country in the world where one can live without working,” he told the National Assembly in 2010. He replaced many of Fidel’s senior leaders with his own trusted allies in the military. He opened limited space for small private enterprise, introduced   salary increases and reduced state subsidies, publicly rejecting “three principles of Fidelismo: paternalism, idealism and egalitarianism,” Mr. Latell said. Fidel began his protracted retreat from public life in August 2006, when a grave intestinal illness forced him to step aside. He ceded power to Raúl, first provisionally, then permanently in 2008. Fidel’s silence after the United States and Cuba announced they would restore diplomatic relations in 2014 was interpreted by Cubans and by foreign experts as a sign that the former leader was extremely sick. Some Cuba watchers wonder if the breakthrough with the United States could have been achieved if Fidel had still been in power or in better health. But others believe that the changes must have carried Fidel’s endorsement, or at least that Raúl acted in a belief that he was following his brother’s grand design. In the televised speech to announce the rapprochement with the United States, Raúl said his openness to talks was “a position that was expressed to the United States government, both in public and in private, by our Comrade Fidel at different moments of our long struggle. ” While Raúl is firmly in control, and seemingly in good health, many people inside and outside Cuban wonder what kind of Cuba comes after him. Raúl, 85, has pledged to step down in 2018. His vice president and former minister for higher education, Miguel Mario   Bermúdez, 56, is expected to fill the presidency. But in the opaque, tightly guarded circles of Cuban politics, it is impossible to know for sure.'"}, "time": 1742564172.9536335}