{"duration": 0.08297133445739746, "input_args": {"text": "'0 comments \\nJust 11 days before the election, the FBI has re-opened its investigation into Hillary Clinton. According to The Political Insider , the news broke just as Donald Trump took the stage in New Hampshire, and it was the first thing heÂ mentioned. \\nWatch: BREAKING: Trump begins New Hampshire rally by reacting to FBI saying it\\'s probing new Clinton emails: â\\x80\\x9cPerhaps finally justice will be doneâ\\x80\\x9d pic.twitter.com/iiCU5PeF4d \\n— CNBC Now (@CNBCnow) October 28, 2016 \\nHere is Trump’s full statement: \\nI need to open with a very critical breaking news announcement.Â The FBI has just sent a letter to Congress informing them that they have discovered new emails pertaining to the former Secretary of State Hillary Clinton’s investigation.Â And they are re-opening the case into her criminal and illegal conduct that threatens the security of the United Staes of America. \\nHillary Clinton’s corruption is on a scale we have never seen before. We must not let her take her criminal scheme into the Oval Office. I have great respect for the fact that the FBI and the Department of Justice are now willing to have the courage to right the horrible mistake that they made. This was a grave miscarriage of justice that the American people fully understood and it is everybody’s hope that it is about to be corrected. \\nSo that is a big announcement that I heard ten minutes ago, and I guess obviously most of you folksÂ have heard about. And in all fairness, for all of the people that have suffered for doing so much less, including just recently 4-Star General James Cartwright, General Petraeus, and many others. Perhaps finally justice will be done. \\nWith that being said, the rest of my speech is going to be so boring. Should I even make the speech? We will talk about borders, right? We will talk about trade. We’ll bring back our jobs, we’ll strengthen our military… \\nTwitter reacted accordingly. Trump, at Manchester, N.H. rally, says FBI decision to reopen Clinton email case suggests \"the system might not be so rigged\" \\n— Gabby Morrongiello (@gabriellahope_) October 28, 2016 The crowd at this Trump rally is literally going insane. \\n— Andrew Clark đ\\x9f\\x8e\\x83 (@AndrewHClark) October 28, 2016 On HRC Trump said at a rally in Manchester, New Hampshire. \"We must not let her take her criminal scheme into the Oval Office.\" @BillKristol \\n— Robert Fischl (@robtdfischl) October 28, 2016 Unlike Trump, Clinton did not address FBI letter at start of her rally. She said she\\'s glad to be back in Iowa, talked about recent flooding \\n— Jennifer Jacobs (@JenniferJJacobs) October 28, 2016 Trump calls Clinton\\'s email investigation \\'bigger Than Watergate\\' https://t.co/nuHKoqtZDS \\n— ABC News Politics (@ABCPolitics) October 28, 2016 \\nSHARE this news if you are glad that the FBI is finally doing its job by investigating Hillary Clinton!'"}, "time": 1742562207.1136744}