{"duration": 0.13205194473266602, "input_args": {"text": "'Welcome to Breitbart News’s running count of worldwide jihadist terrorist attacks during Ramadan 2017. Check back for updates through the end of the Islamic holy month on June 24. [With only days left in this year’s holiest month for Muslims, the fatalities at 1, 434 have more than tripled the estimated 421 that took place during the entire Ramadan period last year, considered one of the bloodiest in recent memory.  The 2, 794 total number of casualties (1, 434 murders and 1, 360 injuries) have more than doubled the estimated 1, 150 (421 deaths and 729 injuries that took place in 2016. There have been nearly 140 incidents in more than 20 mainly Muslim nations during Ramadan this year, which began on May 27 and expected to end on June 24. In an audio message released last week purporting to originate from the Islamic State ( ) the jihadist group again urges its followers and sympathizers to launch terrorist attacks in the United States, Europe, Russia, Australia, Iraq, Syria, Iran, and the Philippines during the ongoing Islamic holy month. ISIS has issued multiple messages urging violent attacks during Ramadan. Consistent with the years since the group surfaced in 2014, ISIS, including its Boko Haram affiliate, takes the grim title of the world’s most prolific terrorist group during Ramadan 2017. ISIS has been linked to more than 90 of the nearly 140 incidents (about 65 percent) so far, with about three days left of the holy month. The Taliban, as well as   and its offshoots, have also been involved in the killing and murder of mainly fellow Muslims. This deaths during this year’s Ramadan have exceeded those from the same period in 2016, considered the deadliest holy month in recent memory. During Ramadan, the majority of Muslims follow the tradition of abstaining from eating, drinking, smoking, having sex, and other physical needs each day, starting from before the break of dawn until sunset. However, extremists perceive Ramadan as a time when martyrdom and jihad are especially rewarded in paradise, prompting a spike in the terrorist attacks during the period every year. Islamic extremist groups encourage martyrdom among their sympathizers and followers, promoting the belief that they will be doubly rewarded if they fatally castigate infidels during Ramadan. In previous years, the fatalities have included women, children, and members of the Christian, minority. This year is no exception. Although Muslims of all sects make up the majority, there are members of a wide variety of ethnic and religious groups among the victims: Westerners, Christians, Asians, Sunnis, Shiites, and Arabs, among others. The West has not been immune to the Islamic extremists’ call to massacre during Ramadan. Breitbart News’ count, gleaned from the Religion of Peace website in coordination with news reports, excludes casualties directly linked to battles between U. S.  coalition and   and   troops loyal to dictator Bashar  . The total number of Ramadan deaths and injuries could be higher. All the terrorist attacks during Ramadan 2017, as documented by Breitbart News, include: May 27  —   Charchino, Afghanistan  —   Group fighting in favor of imposing Islamic law ambushes checkpoint, kills 11. May 27  —   Qadis, Afghanistan  —   Taliban kills 14, injures 17. May 27  —   Khost, Afghanistan  —   Taliban suicide bomber targets U.  National Defense and Security Forces (ANDSF) which includes army and police units, killing 18, wounding six others, including children. May 27  —   Kacha Khuh, Pakistan  —   “Honor Killing”  —   Brother hacks one person to death: his    sister for denying to abide by   marriage. May 27  —   Marawi, Philippines  —   Jihadists kill 19 including women and a child. May 28  —   Marawi, Philippines  —   Jihadists murder eight for “having betrayed their faith. ”May 28  —   Ramo Adey, Somalia  —   Jihadists bury man to his neck, stone to death for adulteryMay 28  —   Mosul, Iraq  —   ISIS sets hospital ablaze and kills a dozen young people inside. May 28  —   Shirqat, Iraq  —   ISIS rocket attack kills three children and their parents. May 28  —   Gumsri, Nigeria  —   Boko Haram kills at least seven villagers. May 28  —   Shakhil Abad, Afghanistan  —   Islamic extremists kill district governor and his son inside their home. May 28  —   Baqubah, Iraq  —   Suicide bomber kills three, injures up to 16 others outside court. May 29  —   Nguro, Nigeria  —   Boko Haram beheads five people. May 29  —   Ghat, Libya  —   Suspected Islamic terrorists kill one, injure four. May 29  —   Shirqat, Iraq  —   Islamic shrapnel dismembers a child, injures seven. May 29  —   Baghdad, Iraq  —   17 killed, 32 wounded  —   ISIS launches suicide attack against ice cream parlor frequented by families who were breaking their Ramadan fast. May 29  —   Baghdad, Iraq  —   14 killed, 37 injured. ISIS attacked Shiites. May 30  —   Mattani, Pakistan  —   Islamist gun down four peace committee members. May 30  —   Peshawar, Pakistan  —   Suspected jihadist shoots one leader of    terrorist group while he was leaving a mosque. May 30  —   Shifa, Iraq  —   Mass grave found with 60 ISIS torture victims, including women, elderly. May 30  —     Syria  —   ISIS mortar kills 14, including children. May 30  —   Bay Hassan, Iraq  —   ISIS kills three Iraqi guards, wounds six others. May 30  —   Baghdad, Iraq  —   Jihadists kill seven, injure 19 in a blast. May 30  —   Baqubah, Iraq  —   A bomb explosion at mosque kills seven, wounds six. May 30  —   Hit, Iraq  —   Fedayeen suicide bomber kills eight, injures ten. May 31  —   Kaya, Nigeria  —  Boko Haram kills 14. May 31  —   Fafi, Kenya  —   Suspected   affiliate   burns down school, kills one teacher. May 31  —   Bab   Iraq  —   Suicide bombers kill three civilians, including a child. May 31  —   Hit, Iraq  —   Shahid suicide bomber kills three, injures seven. May 31  —   Mangai, Kenya  —      bombers kill eight. May 31  —   Kabul, Afghanistan  —   Suspected Haqqani Network kills at least 150, Wounds more than 460, including 11 Americans. May 31  —   Sinjar, Iraq  —   ISIS kills two, injures two. June 01  —   Abala, Niger  —   Jihadists kill six guards. June 01  —     Yemen  —   Terrorists kill six, wound 15. June 01  —   Behsud, Afghanistan  —   Suicide bomber kills one, wounds four. June 01  —   Oldenburg, Germany  —   Muslim kills one for smoking during Ramadan and refusing to fast. June 01  —   Zanjili, Iraq  —   ISIS kills seven for trying to flee caliphate. June 02  —   Kolofota, Cameroon  —   Islamist use two girls as suicide bombers: 11 killed and 30 wounded. June 02  —   Sidi Bouzid, Tunisia  —   Jihadist beheads one man. June 03  —   Marawi, Philippines  —   Islamic sniper kills    man. June 03  —   Halabsah, Iraq  —   Four suicide bombers kill one, injure three. June 03  —  London, England  —   Three Jihadists plow into pedestrians, then stab people, killing seven, injuring 48. June 03  —   Zanjili, Iraq  —   ISIS kills 43 for trying to flee caliphate. June 03  —   Lower Munda, India  —      kill two security troops, injure four. June 03  —   Nawabshah, Pakistan  —   Alleged victim’s    kills two people for alleged adultery. June 03  —   Kabul, Afghanistan  —   Suicide bombers kill 20, injure 87. June 03  —   Ferkane, Algeria  —   Muslim extremists kill two local soldiers, injure four. June 03  —   Burkina Faso, Soum  —   Jihadists kill five. June 04  —   Bijapur, India  —   “Honor Killing”  —   pregnant Muslim woman burnt alive by her family for marrying Hindu man. June 04  —   Kandahar, Afghanistan  —   Afghan police insider attack leaves six dead, one injured. June 04  —   Spini, Pakistan  —   Two Shiites from Hazara minority group killed. June 04  —   Talibul, Moula, Pakistan  —   “Honor Killing”  —   Father kills one    daughter for allegedly “having an affair. ”June 04  —   Zanjili, Iraq  —   Wave of suicide bombers kills 32, injures 24. June 04  —   Quaidabad, Pakistan  —   Jihadis kill one barber. June 05  —   Melbourne, Australia  —     migrant from Somalia kills man, takes prostitute hostage, an injures four. June 05  —   Baghdad, Iraq  —   Terrorist mortar fired into family home dismembers    boy, injures four. June 05  —   Kismayo, Somalia  —     affiliate   detonates bomb, killing three, injuring 20. June 06  —   Sinai, Egypt  —   Suspected Islamic extremists kill two police officers. June 06  —   Paris, France  —   Jihadist wounds one cop with a hammer outside Notre Dame cathedral. June 06  —   Herat, Afghanistan  —   Terrorist kill seven, injure another 16 near the northern gate of the Great Mosque of Herat. June 06  —   Garissa, Kenya  —   Suspected   affiliate   jihadists kill four aid workers with land mine. June 06  —   Mandera, Kenya  —   Unknown jihadist kill one woman, injure one. June 06  —   Mosul, Iraq  —   ISIS kills 15 women as they tried to escape the section of city controlled by the jihadist group. June 07  —   Kandahar, Afghanistan  —   Islamabad’s intelligence agency (ISI) attacked refugee camp in Kandahar province, which borders Pakistan, killing three, including two children and wounding eight, including women. June 07  —   Tehran, Iran  —   ISIS claims responsibility for attacking Shiite country’s parliament while wearing women’s attire, kills 12, injures up to 42, marking first time the Sunni extremist group carries out attack in Islamic Republic. June 07  —   Tehran, Iran  —   Islamic State suicide bombers target Shiite shrine of revolutionary leader Ayatollah Ruhollah Khomeini located just outside the capital, killing two and injuring ten. June 07  —   Maiduguri, Nigeria  —   Boko Haram kills 14, wounds 24. June 08  —   Puntland, Somalia  —        kills 70, including some women who were decapitated, and wounds 18. June 08  —   Diyala, Iraq  —   Terrorists, including ISIS, kills 9, wound 4. June 08  —   Mosul, Iraq  —   United Nations reports ISIS killed 231 civilians as they tried to escape the city between May 26 and June 3. June 08  —   Mosul, Iraq  —   ISIS fires   bombs at civilians, killing 13, mostly women and children. June 08  —   Baluchistan, Pakistan  —   ISIS claims to have killed two Chinese nationals kidnapped on May 24. June 09  —   Kerbala, Iraq  —   ISIS kills at least 30, wounds 34 in Shiite holy city. June 09  —   Hambagda, Cameroon  —   Boko Haram kill four, wounds six others. June 09  —   Paktia, Afghanistan  —   Suspected   Network jihadists kill three civilians, wound nine others while praying in mosque. June 10  —   Shirqat, Iraq  —   ISIS kills 38 civilians, Iraqi troops, wounds 40 others. June 10  —   Mosul, Iraq  —   ISIS kills eight civilians, wounds five others. June 10  —   Kobane, Iraq  —   ISIS landmine kills two children, wounds three other civilians. June 10  —     Cameroon  —   Three Boko   girls killed as suicide bombersJune 10  —   Nangarhar, Afghanistan  —   Taliban claims insider attack against U. S. troops, killing three, wounding one other. June 11  —   Baluchistan, Pakistan  —      jihadists kill three police officers, wound one civilian. June 11  —   Kayamla, Nigeria  —   Boko Haram kills eight members of civilian militia. June 11  —   Haripu, Pakistan  —   Suspected jihadists kill one journalist. June 11  —   Diyala, Iraq  —   Suspected ISIS suicide attacker kills two, wounds five others. June 12  —   Baddah, Yemen  —     kills two local soldiers. June 14  —   Mogadishu, Somalia  —     kills at least nine civilians, including women, at the Posh Hotel and wounds 10 others. June 14  —   Borno State, Nigeria  —   Boko Haram kills five civilians, wounds six othersJune 14  —   Helmand, Afghanistan  —   Suspected Taliban kills five, wounds four from breakaway faction. June 14  —   Ghazni, Afghanistan  —   Taliban kills one civilian, wounds three others. June 14  —   Paktika, Afghanistan  —   Suspected jihadists kill five civilians, including women and children, wound seven others. June 14  —   Mosul, Iraq  —   ISIS launches wave of suicide attacks in Mosul, killing  at least 15, including 11 police officers and four civilians. June 15  —   Kabul, Afghanistan  —   Suspected jihadists kill four, wound eight in mosque suicide attack. June 15  —   Kashmir, India  —   Jihadists kill Indian police officer. June 15  —   Limani, Cameroon  —   Boko Haram female suicide bomber leaves three people dead,  including    child, and at least six others wounded. June 15  —   Yarang, Thailand  —   Suspected Islamic insurgents shoot    Buddhist in the head. June 16  —   Marawi, Philippines  —   Clashes between   Abu Sayyaf jihadists leaves an estimated 100 people dead. June 16  —   Kirkuk, Iraq  —   Prominent female jihadist from besieged ISIS terrorist group in Iraq and her two sons ages six and nine found dead. June 16  —   Baghdad, Iraq  —   Jihadi detonated explosive device wounds four people. June 16  —   Kurdistan, Iraq  —   Suspected ISIS jihadists wound five civilians at a mosque. June 16  —   Diyala, Iraq  —   Suspected jihadist shoots civilian in the head. June 16  —   Baghdad, Iraq  —   Suspected terrorists kill one civilian, wound three others. June 16  —   Diyala, Iraq  —   Jihadi killed when bomb he was trying to plant exploded. June 16  —   Mandera, Kenya  —     kills four civilians, injures 11 others. June 16  —   Kashmir, India  —      (LeT) kills, mutilate faces of six Indian police officers with bullets. Indian security forces kill two terrorists in response. One civilian caught in crossfire. June 16  —   Jerusalem, Israel  —   Three Palestinian jihadists, linked to ISIS, kill one policewoman, injure two others before security forces took them down. June 16  —   Laghman, Afghanistan  —   Suspected jihadists kill four civilian workers in explosion. June 17  —   Bakol, Somalia  —   Clashes between   and Somali army leaves at least five dead, 12 others injured. June 17  —   Kashmir, India  —   Jihadists kill civilian. June 17  —   Kashmir, India  —   Jihadists kill political leader. June 17  —   Kashmir, India  —   Clashes between    (LeT) and Indian security forces leave two civilians and three jihadists dead. June 17  —   Mosul, Iraq  —   Jihadi suicide bomber kills seven local police officers. June 17  —   Bintagoungou, Mali  —   Jihadists kill five, injure eight others. June 17  —   Mosul, Iraq  —     Shiite militias kill family of five. June 17  —   Baidoa, Somalia  —     kills cleric inside mosque. June 17  —   Cairo, Egypt  —   Suspected ISIS jihadists kill one, wound four in roadside bomb attack. June 18  —   Paktia, Afghanistan  —   Taliban attacks police headquarters, killing six police officers, wounding 30 others, including 21 civilians. June 18  —   Bamako, Mali  —   Jihadists kill two, wound 14 at resort. June 18  —   Mosul, Iraq  —   Two ISIS suicide bombers killed. June 18  —   Mosul, Iraq  —   Five   suicide bombers, including a German national, killed. June 18  —   Diyala, Iraq  —   Police kill suspected ISIS suicide bomber. June 18  —   Salahuddin, Iraq  —   Suspected ISIS jihadists fire rocket, killing one civilian, injuring another. June 18  —   Daraa, Syria  —     militia kills five of its own fighters on charges of apostasy. June 18  —   Borno, Nigeria  —   Five female suicide bomber, likely linked to Boko Haram, killed  12 people, injured 11 others in the terrorist group’s birthplace. June 18  —   Kirkuk, Iraq  —   ISIS kills 34 civilians. June 19  —   Mosul, Iraq  —   ISIS kills one journalist, wounds three others with improvised explosive device (IED) also known as a homemade bomb. June 19  —   Baghdad, Iraq  —   Suspected ISIS terrorists kills one Sunni tribal fighter, wounds two others. June 19  —   Pattani, Thailand  —   Jihadists kill six soldiers, wound four others. June 19  —   Paris, France  —   Authorities take down “known extremist” who attempted to carry out terrorist attack at the  . June 20  —   Mogadishu, Somalia  —     kills at least 15 civilians, injures 20 others in suicide car bomb. June 20  —   Brussels, Belgium  —   Authorities kill   suicide bomber at train station. June 20  —   Nangarhar, Afghanistan  —   Terrorists kill judge, wound three other civilians.'"}, "time": 1742628566.6656797}