{"duration": 0.03169727325439453, "input_args": {"text": "'By Fink | Leave/Read Comments Vice President-elect Mike Pence claims that a 1983 conversion therapy saved him. \\nIndianapolis, IN — In a surprise announcement today, Indiana Governor and Vice President-elect Mike Pence said that gay conversion therapy saved his marriage. The controversial Republican, who was elected the 50th governor of the Hoosier State, has been a long-time proponent of a “Biblical view” on homosexuality and as a member of Congress stated that the legislative branch “should oppose any effort to recognize homosexuals as a ‘discrete and insular minority’ entitled to the protection of anti-discrimination laws similar to those extended to women and ethnic minorities.” \\n“It[gay conversion therapy] was instrumental in helping me overcoming certain urges,” said the Vice President elect in an interview with Fox News. “With God’s help, and the work of many of his therapists, I was able to seek the straight path when I was a younger man. If it wasn’t for that, I would have never been able to marry.” \\nConversion therapy is psychological treatment or spiritual counseling designed to change a person’s sexual orientation from homosexual or bisexual to heterosexual. Such treatments are controversial and are a form of pseudoscience. However many orthodox and fundamentalist Christians believe that it does work, citing numerous examples of success. In more ancient times prior to 1981, conversion therapies in the United States and Western Europe included ice-pick lobotomies, chemical castration and various hormonal treatments. Efforts were largely concentrated on men, as female homosexuality was generally viewed as “hot.” This split along gender lines was due American’s general stupidity. \\nMany of Mike Pence’s classmates at Indiana University said the young Pence struggled with “identity issues.” \\n“Oh Mike was always a well-groomed sharp dresser,” said University of Chicago Professor James Badwater who was a dorm roommate of Mr. Pence in 1983. “He was private and kept to himself. He had a large collection of Men’s fitness magazines and listened to Wham! continually. He got into the conversion thing the next year, and then immediately married Karen [Mike Pence’s wife] the following year. It’s going to be great to have our first gay Vice President.” \\nIt’s unclear how this news will impact the Donald Trump administration, if at all, however many GOP insiders maintain that this demonstrates the incoming administration’s commitment to diversity and the “widening” of the party’s platform to be more inclusive of what have traditionally been party outsiders.'"}, "time": 1742561771.3683152}