{"duration": 0.03178691864013672, "input_args": {"text": "'After making waves with a   dress at last Sunday night’s Grammy Awards and subsequently topping the singles chart on Amazon, singer Joy Villa revealed in an exclusive interview that she has one more goal in mind. [She wants to go to the White House and perform her rendition of Queen’s 1977 classic, “We Are The Champions,” for President Donald Trump.  “That is my goal,” she said of singing that song for Trump. “That is what I would love to do. I would like to show an outpouring of support and perform for the president. And that would be just the cherry on top of everything. “ Villa continued: “And also to create a wave of support for our president for Americans for patriotism and just for tolerance and love. And just changed the narrative. In the award shows. In the Grammys. In the red carpet. Anything that pops up. So it is a more fair portrayal of actually what Americans are feeling and thinking. Because we don’t all think like how they are telling us to think. And that is my whole platform. ” Villa was speaking in an interview to air on this reporter’s Sunday night talk radio program, “Aaron Klein Investigative Radio,” broadcast on New York’s AM 970 The Answer and NewsTalk 990 AM. Upon arriving at the Grammys, Villa took off a white robe to reveal a red, white and blue dress emblazoned with the sparkling words “Make America Great Again” and had “Trump” on the hem. Villa’s   Grammys appearance skyrocketed her album to #1 on Amazon’s digital chart. In an initial interview last week, Villa confirmed to this reporter that she is a Trump supporter and that she voted for the president. Asked why she decided to essentially troll the Grammys, Villa explained that she was “tired” of Hollywood’s treatment of Trump supporters. “I was tired of the bullying,” she said in a phone interview. “I was tired of being pushed down so that I couldn’t say my beliefs. And being fearful of losing sales. Losing fans. Losing bookings. Losing contracts and sponsorship. You know, that’s my day to day. And a lot of my friends have the same thing. And we live in Hollywood, which is supposed to be the most open viewpoint city. But the truth is there was a lot of hate and a lot of negativity and I wanted to change the storyline to love and support and unity as an American. ” Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742628533.0034301}