{"duration": 0.02909708023071289, "input_args": {"text": "'On The News Line ©AFP \\nThese are some of the headlines we are tracking for you in this episode of On the News Line: \\nThe Syria conundrum \\nThe crisis in Syria is getting more complicated. Many parties are participating in the war. The administration of US President Barack Obama has been talking about sending more sophisticated weapons to the so-called moderate rebels in Syria. But the White House is hesitant and the plan seems to have stalled. The Turks are after for their own agenda in Syria. It’s been almost two months since Turkey launched its offensive in northern Syria. According to Ankara, the mission is aimed at clearing its border area of ISIL militants and anti-Turkey Kurdish militants. And that has put Turkey on a collision course with the US, which has invested heavily on the Kurdish fighters. \\nEU threat of disintegration \\nThings seem to be falling apart in Europe which many believe is under strain from many factors ranging from the Brexit to the rise of the far-right across the European political spectrum to the refugee crisis, which is the worst to hit the continent. The prospect of the European Union seems so bleak that it has rung the alarm in Germany. German Foreign Minister Frank-Walter Steinmeier has warned: \"The financial crisis, the refugee influx into Europe and the shock from the Brexit referendum in Great Britain have brought the European Union into violent turmoil.” Steinmeier warned that this might lead to the collapse of the EU. \\nSaudis aim to starve Yemenis \\nReports have surfaced that Saudi Arabia is \"deliberately targeting impoverished Yemen’s farms and agricultural industry.\" Increasing evidence suggests that the kingdom is not merely bombing civilians, but it is systematically targeting infrastructure survivors will need to avoid starvation when the war is over. That includes water infrastructures, and even farms. Loading ...'"}, "time": 1742561696.3068562}