{"duration": 0.1165621280670166, "input_args": {"text": "'in: General Health , Toxins You’ve probably heard the buzz already about the many health benefits of probiotics , a word which literally translates to: pro- “for” + biotics “life”— FOR LIFE . But did you know that these remarkable commensal microorganisms, which outnumber our bodily cells 10 to 1, and contribute over 95% of our body’s total genetic information, also break down highly toxic manmade chemicals which your body is either incapable, or only partially capable, of defending itself from? Learn about some of the amazing ways in which ‘good bacteria’ help to detoxify chemicals within our body: Bisphenol A : This ubiquitous toxicant — linked to over 40 diseases — found in anything from thermal printer receipts, paper money , canned food liners, dental composites , and of course plastics, is a powerful endocrine disrupter now found in everyone’s bodies. Remarkably, two common probiotic strains, Bifidobacterium breve and Lactobacillus casei , have been found in animal research to help the body detoxify it by reducing the intestinal absorption of bisphenol A through facilitating increased excretion. [i] The animals receiving probiotic treatment were found to have 2.4 times higher excretion of Bisphenol A in their feces, suggesting probiotic supplementation could be of significant benefit to humans as well. Pesticides : Probiotic strains from the traditional Korean fermented cabbage dish known as Kimchi have been identified to degrade a variety of organophosphorous pesticides such as chlorpyrifos, coumaphos, diazinon, methylparathion, and parathion. [ii] These nifty organisms actually use these exceedingly hard to break down chemicals as sources of carbon and phosphorous – ‘food’! – and were found to break down the pesticide 83.3% after 3 days and degraded it completely by day 9. [iii] While this test tube study likely does not reflect exactly what happens in our gut when we ingest both chlorpyrifos and Kimchi, it is provocative, and may indicate there is some protective effects in the gut, and certainly cabbage tainted with organophosphorous pesticide which is subsequently fermented as an ingredient in Kimchi would certainly reduce the burden of this chemical in the diet. Heavy Metals: Lactobacillus bacteria found in food have been looked at as a potential adjunct agent for reducing metal toxicity in humans. According to one study, “This is because they have resistance mechanisms which are effective in preventing damage to their cells and they can bind and sequester heavy metals to their cell surfaces, thus removing them through subsequent defecation.” [iv] The study differentiates between detoxification and detoxication, the former of which is described as “the ability to remove drugs, mutagens, and other harmful agents from the body,” and the latter of which is the mechanism through which ‘good bacteria’ prevent “of damaging compounds into the body.” Because there is a large body of research on probiotics preventing and/or healing up intestinal permeability, this may be another way in which toxic stomach contents are preventing from doing harm to the body as a whole. Cancerous Food Preservatives : Another Kimchi study found it contained a strain of bacteria capable of breaking down sodium nitrate, a naturally and artificially occurring chemical (used from anything to rocket fuel and gunpowder) linked to a variety of chronic degenerative diseases, including cancer. [v] The study found a depletion of sodium nitrate by up to 90.0% after 5 days. Sodium nitrate becomes toxic when it is converted in food products, and even our intestines via microbiota, to N-nitrosodimethylamine. A recent study found that four lactobacillus strains where capable of breaking this toxic byproduct down by up to 50%. [vi] Perchlorate – perchlorate is an ingredient in jet fuel and fireworks that widely contaminates the environment and our food. Sadly, even organic food has been found concentrate high levels of this toxicant , making it exceedingly difficult to avoid exposure. It is now found in disturbing concentrations in breast milk and urine, and is a well-known endocrine disrupter capable of blocking the iodine receptor in the thyroid, resulting in hypothyroidism and concomitant neurological dysfunction. A recent study found that the beneficial bacterial strain known as Bifidobacterium Bifidum is capable of degrading perchlorate, and that breast fed infants appear to have lower levels than infant formula fed babies due to the breast milk bacteria’s ability to degrade perchlorate through the perchlorate reductase pathway. [vii] Heterocylic Amines : Heterocyclic aromatic amines (HCA) are compounds formed when meat is cooked at high temperatures of 150-300 degrees C, and are extremely mutagenic (damage the DNA). Lactobacillus strains have been identified that significantly reduce the genotoxicity of theses compounds. [viii] Toxic Foods : While not normally considered a ‘toxin,’ wheat contains a series of proteins that we do not have the genomic capability to produce enzymes to degrade. When these undigested proteins – and there are over 23,000 that have been identified in the wheat proteome – enter into the blood, they can wreak havoc on our health. Recent research has found that our body has dozens of strains of bacteria that are capable of breaking down glutinous proteins and therefore reduce its antigenicity and toxicity. While the role of probiotics in degrading gluten proteins sounds great, a word of caution is in order. Since modern wheat is not a biologically compatible food for our species – having been introduced only recently in biological time, and having been hybridized to contain far more protein that our ancient ancestors were ever exposed to – it would be best to remove it entirely from the diet. Also, the aforementioned research showing bacteria in the human gut are capable of breaking some of these wheat proteins revealed that some of the species that were capable of doing this for us are intrinsically pathogenic, e.g. Clostidium botulinum and Klebsiella. So, relying on the help of bacteria to do the job of digesting a ‘food’ we are not capable of utilizing on our own, is a double-edged sword. Again, the best move is to remove it entirely from the diet as a precuationary step. What Probiotic Should I Take? While plenty of probiotic pills and liquids exist on the market, and many of which have significant health benefits, it is important to choose one that is either shelf stable, or has been refrigerated from the place of manufacture all the way to the place you are purchasing it from. Moreover, many probiotics are centrifugally extracted or filtered, leaving the nourishing food medium within which it was cultured behind. This is a problem in two ways: 1) without sustenance, the probiotics are in ‘suspended animation’ and may either die or not properly ‘root’ into your gastrointestinal tract when you take them. 2) the ‘food matrix’ within probiotics are grown provides a protective medium of essential co-factors that help them survive the difficult journey down your gastointestinal tract. With that said, another option is to consume a traditionally fermented, living probiotic food like sauerkraut, kimchi, or yogurt (focusing on non-cow’s milk varieties, unless you are lucky enough to find a source that has the beta-casein A2 producing cows). There is always goat’s milk which is relatively hypoallergenic. Finally, the reality is that the probiotics in our bodies and in cultured foods ultimately derive from the soil, where an unimaginably vast reservoir of ‘good bacteria’ reside – assuming your soil is natural and not saturated with petrochemical inputs and other environmental toxicants . And really fresh, organically produced – preferably biodynamically grown – raw food is an excellent way to continually replenish your probiotic stores. Food is always going to be the best way to support your health, probiotic health included. References [i] Kenji Oishi, Tadashi Sato, Wakae Yokoi, Yasuto Yoshida, Masahiko Ito, Haruji Sawada. Effect of probiotics, Bifidobacterium breve and Lactobacillus casei, on bisphenol A exposure in rats. Biosci Biotechnol Biochem. 2008 Jun;72(6):1409-15. Epub 2008 Jun 7. PMID: 18540113 [ii] Shah Md Asraful Islam, Renukaradhya K Math, Kye Man Cho, Woo Jin Lim, Su Young Hong, Jong Min Kim, Myoung Geun Yun, Ji Joong Cho, Han Dae Yun. Organophosphorus hydrolase (OpdB) of Lactobacillus brevis WCP902 from kimchi is able to degrade organophosphorus pesticides. J Agric Food Chem. 2010 May 12;58(9):5380-6. PMID: 20405842 [iii] Kye Man Cho, Reukaradhya K Math, Shah Md Asraful Islam, Woo Jin Lim, Su Young Hong, Jong Min Kim, Myoung Geun Yun, Ji Joong Cho, Han Dae Yun. Biodegradation of chlorpyrifos by lactic acid bacteria during kimchi fermentation. J Agric Food Chem. 2009 Mar 11;57(5):1882-9. PMID: 19199784 [v] Chang-Kyung Oh, Myung-Chul Oh, Soo-Hyun Kim. The depletion of sodium nitrite by lactic acid bacteria isolated from kimchi. J Med Food. 2004;7(1):38-44. PMID: 15117551 [vi] Adriana Nowak, Sławomir Kuberski, Zdzisława Libudzisz. Probiotic lactic acid bacteria detoxify N-nitrosodimethylamine. Food Addit Contam Part A Chem Anal Control Expo Risk Assess. 2014 Jul 10. Epub 2014 Jul 10. PMID: 25010287 [vii] C Phillip Shelor, Andrea B Kirk, Purnendu K Dasgupta, Martina Kroll, Catrina A Campbell, Pankaj K Choudhary. Breastfed infants metabolize perchlorate . Environ Sci Technol . 2012 May 1 ;46(9):5151-9. Epub 2012 Apr 20. PMID: 22497505 [viii] Adriana Nowak, Zdzislawa Libudzisz. Ability of probiotic Lactobacillus casei DN 114001 to bind or/and metabolise heterocyclic aromatic amines in vitro. Eur J Nutr. 2009 Oct ;48(7):419-27. Epub 2009 May 16. PMID: 19448966 © October 26, 2016 GreenMedInfo LLC. This work is reproduced and distributed with the permission of GreenMedInfo LLC. Want to learn more from GreenMedInfo? Sign up for the newsletter here http://www.greenmedinfo.com/greenmed/newsletter . Submit your review'"}, "time": 1742628417.4081347}