{"duration": 0.22354555130004883, "input_args": {"text": "'The Election Of Donald Trump Is Already Having An Enormous Impact On The Economy   14th, 2016 \\n  sent shockwaves through the U.S. economy and the U.S. financial system. Since November 8th, the Dow has hit a brand new all-time record high , the U.S. dollar has strengthened greatly, and bank stocks are way up. But not all of the economic news is good news. Unlike stocks, bonds have reacted very negatively to Trump’s election victory. The past week has been an absolute bloodbath for bond traders, and as you will see below this is going to have dramatic implications for all U.S. consumers moving forward. \\nOver just a two day period, more than a trillion dollars was wiped out as bond yields spiked all over the globe. As CNN has noted , this type of “violent reaction” in the bond market has only happened three other times within the past ten years… \\nThe rate on 10-year Treasury notes has surged to 2.3%, from 1.77% before the election. Last week’s spike in Treasury rates was so big, that it had only happened three times before in the last decade. \\nBlackRock’s Russ Koesterich called it a “violent reaction.” \\nThe move stands to have broad repercussions for all Americans. Not only will the U.S. government have to pay more to borrow money, but mortgage rates and car loan costs should also rise. That’s because Treasuries are used as the benchmark for many other forms of credit. \\nAs interest rates rise, virtually everyone in our society is going to feel the pain. \\nThose that need an auto loan in order to purchase a vehicle are going to find that loan payments are significantly higher than they were before. \\nCredit card rates will also go up, and those just getting out of school will discover that their student loan payments are even more suffocating. \\nBut the biggest impact will be felt in the housing market. The average rate on a 30-year fixed mortgage just hit the psychologically-important 4 percent barrier, and that could mean big trouble for the housing market in 2017 … \\nThe average contract rate on the popular 30-year fixed mortgage hit 4 percent, according to Mortgage News Daily, a level most didn’t expect to see until the middle of next year. Rates have now moved nearly a half a percentage point higher since Donald Trump was elected president. \\n“The situation on the ground is panicked. Damage control,” said Matthew Graham, chief operating officer of Mortgage News Daily. “People were trying to lock loans quickly last week and are now facing a tough choice to lock today or hope for a bounce. Many hoped for a bounce last week heading into the long weekend and we obviously didn’t get it.” \\nRising interest rates was one of the key factors that precipitated the financial crisis of 2008, and many fear that it could happen again. \\nAnd without a doubt, this rise in rates is going to affect the affordability of homes that are already on the market … \\n“If you’re going to buy a house and your mortgage payment went up by $200 or $300, you may buy a smaller house. There’s impact on interest rate sensitive sectors, like autos and housing, and also corporate bonds themselves, where financial engineering has helped juice up the equity market,” said George Goncalves, head of rate strategy at Nomura. \\nIn addition, rising rates will make it more difficult for those with adjustable rate mortgages to keep their homes. Foreclosure activity was already up 27 percent during the month of October, and many are projecting that we could see another giant spike in foreclosures during the months ahead that is similar to what we saw during the last financial crisis. \\nMany Trump supporters don’t really care what the rest of the world thinks of our new president, but this is an area where what the rest of the world thinks really, really matters. \\nThe truth is that the rest of the planet is not all too fond of Trump, and if that makes them a lot less eager to lend us money that is a major problem. \\nThe only way that we can maintain our massively inflated debt-fueled standard of living is to continue to borrow gigantic mountains of money from the rest of the world at ultra-low interest rates. \\nIf the rest of the world starts demanding higher rates of return now that Trump is president, we are going to experience economic pain on a scale that most Americans don’t believe is possible. \\nOne of our big lenders has been China, and right now they are deeply   a Trump presidency might mean. Trump has talked very tough about trade with China, and the Chinese are gearing up for a major trade war. The following comes from CNBC … \\nDuring his election campaign this year, Trump spoke of a 45 percent import tariff on all Chinese goods while failing to outline how it would work. Should any such policy come into effect, China will take a “tit-for-tat approach”, according to an opinion piece in the Global Times , a newspaper backed by the Communist party. \\n“A batch of Boeing orders will be replaced by Airbus. U.S. auto and iPhone sales in China will suffer a setback, and U.S. soybean and maize imports will be halted. China can also limit the number of Chinese students studying in the U.S.,” the Global Times article read. \\nMost Trump supporters assume that since Trump has been a very successful businessman that he will be able to strengthen the U.S. economy. \\nBut it isn’t that simple. \\nThe only reason we are able to live the way that we live today is because we have been able to borrow trillions upon trillions of dollars at irrationally low interest rates. \\nThe moment the rest of the world decides that they are not going to loan us money at irrationally low interest rates any longer the game is over, and it won’t really matter who is in the White House at that point. \\nSo watch interest rates very carefully. If they keep going up, it is inevitable that a major economic slowdown will follow no matter what economic policies the new Trump administration implements. November 14th, 2016 | Tags: Bank Stocks , Bond Crash , Bond Traders , Bonds , Donald Trump , Economic News , Feel The Pain , Financial , Foreclosure , Foreclosure Activity , Foreclosure Activity Rising , Foreclosure Help , Foreclosures , Foreclosures Rising , Good News , Home Foreclosures , Pain , Stocks , The Dollar , The Dow , The Pain , The Stock Market , The U.S. Dollar , The U.S. Economy , The U.S. Financial System , Trump , U.S. Consumers | Category: Housing Crash , The Economy   » mleblanc138 \\nCrash and burn house prices, crash and burn. Houses go sky high while wages remain stagnant, not sustainable. Time for a correction, an excessive correction. Genada \\nTo lose weight you have to take some pain. Eat less, work out. Same goes with making our economy work for Americans. We are going to need to take some pain to be able to improve the economy and make it work for every American and not just the top. \\nThe rates had to go up, they couldn’t really go down anymore and it’s going to have some negative impacts but those impacts are due to living beyond our means and making bad choices. Now we will need to pay for that a bit. \\nLack of lending from others will require us to produce at all and that’s a good thing. Producing at home will lead to more jobs and make us less depend on others less. \\nThen the final major truth about the world economy is and you have detailed many times is that the world’s debt is far in excess of what can be payed. It’s time for write downs and admit this. Then after the pain of that to put things in place to prevent this from happening again. retired22 \\nUltimately we have them all by the gonads. With the EU sinking into bankruptcy America will be the last major consumer market left standing The American consumer economy is over 70% of the total economy! The exporting nations have no where else to sell their consumer products & raw materials,they will need to keep the American economy afloat! As for the debt,it will never be paid,it will be rolled over indefinitely. Also,…there will be financial chaos around the world when America drops the hammer on the outside world. Most of the big money from outside will be drawn to America for security,…South Florida is already a haven for wealthy Venezuelans who had money parked here for hard times in their homeland.California is in a similar situation with offshore Chinese wealth! Most of the world is part of a global financial system based on American dollars as the world’s reserve currency.A large part of the world are,in effect, provinces in an American financial empire,.America is their banker,they can’t extricate themselves from the Dollar & America. Paul Anders \\nBottom line, is one day soon this house of cards is coming down…Trump or no Trump. But if he can drain the swamp and get the political cesspool back on track, I think it’s worth the pain. Pain is coming sooner or later anyways… retired22 \\nThe main thing is to get rid of the Central Bankers & get a leash on the F.I.R.E economy,which is mostly huge overhead & is sucking the life out of the real productive economy! If it takes pain in the correction we will need to handle it if we want to turn the economic corner! CASTIEL \\nScrew the chinks….. screw those stupid and ignorant liberals…… screw the elites…….I hope they all burn….. Scott'"}, "time": 1742562579.034728}