{"duration": 0.0694735050201416, "input_args": {"text": "'FDA to withdraw 2 generic ADHD drugs after determining they have no therapeutic effects \\nTuesday, November 01, 2016 by: Vicki Batts Tags: FDA , ADHD drugs , market withdrawal (NaturalNews) ADHD medications have been subject to public scrutiny for quite some time. Two years ago, the FDA said it had discovered problems with a generic version of a popular ADHD drug known as Concerta. The generic, produced by the pharmaceutical company Mallinckrodt, just wasn\\'t up to snuff. And now, the FDA seems to finally be making moves to pull this inferior product off the shelves.Generic drugs are approved by the FDA through their abbreviated new drug application (ANDA) process. In the ANDA process, the federal agency is primarily focused on data that shows the generic drug is a bioequivalent for the reference listed drug, or what many people refer to as the \"brand name\" drug.The term \"bioequivalent\" means that there is no substantial differences in bioavailability between a generic drug and the brand name product. Specifically, it suggests that the extent and rate of absorption of two drug equivalents over the same period of time, at the same dose and under the same conditions, should exhibit similar results. As the FDA explains on their website, \"The generic version must deliver the same amount of active ingredients into a patient\\'s bloodstream in the same amount of time as the pioneer drug.\"Unsurprisingly, discrepancies in actual equivalence are often discovered after a generic has been approved.Mallinckrodt\\'s Concerta generic is not the only brand name knock-off under fire. Kremers Urban Pharmaceuticals, a subsidiary of the Lannett Company, also manufactures a generic form of the medication that the FDA\\'s Center for Drug Evaluation and Research (CDER) has deemed insufficient.As reported by the Regulatory Affairs Professionals Society: CDER tracked the issues from December 2013 through June 2014, ran a re-analysis of bioequivalence data and \"determined that the Mallinckrodt product may deliver methylphenidate into the body at a slower rate than Concerta during the time period of 7 to 12 hours post-dosing.\" Following the CDER\\'s findings, Mallinckrodt filed a lawsuit, which was thrown out by a Maryland federal judge. The pharmaceutical company has since declined to voluntarily withdraw their product from the marketplace. And according to the FDA, the drug manufacturer has yet to submit any new data or information that confirms the bioequivalence of their product to Concerta.Similarly, the CDER concluded in June of 2014 that the data on the Kremers product is insufficient to determine whether or not their generic product is therapeutically equivalent to Concerta. In November that year, the FDA announced that their product was not sufficiently equivalent to the name brand.Both manufacturers may submit a request for a hearing to the FDA within the next month so they can attempt to show why approval for their drugs shouldn\\'t be withdrawn.Of course, the FDA\\'s concerns about the apparent lack of efficacy seen in these generic drugs is rather ironic, given the magnitude of other concerns surrounding these drugs. In 2006, a CBS News report revealed that 25 people died and 54 more suffered serious cardiovascular problems following the use of ADHD medication, in a period of just four years.That may not seem like a lot, but is important to recall that the FDA Adverse Event Reporting System (FAERS), which is used to track such events, is a voluntary system. Only drug manufacturers are required to report adverse events – if they know about them. Doctors, patients and family members are under no such obligation. PSQH reports that drug safety experts estimate that only about 10 percent of all adverse events will even be reported – who is to say how many people have been harmed by ADHD medications (and other drugs) and don\\'t know it or haven\\'t reported it?The FAERS website itself states that because of its own limitations, \"FAERS data cannot be used to calculate the incidence of an adverse event or medication error in the U.S. population.\" And yet, in spite of this very statement, the FDA itself used this information to form a safety report?Over the years, several ADHD medications, like Adderall XR, have been linked to sudden death , cardiovascular problems and psychosis. According to Consumer Reports , the long-term safety of these drugs has not been evaluated or studied sufficiently, and there is evidence to suggest that the benefit of such drugs wears off after about two years. Many kids take ADHD medication for quite a bit longer than that.In spite of all of this, the FDA has yet to pull these drugs from the shelves, and is instead concerned with drugs that aren\\'t strong enough. Medications that don\\'t work obviously don\\'t belong in the marketplace. However, drugs that are killing children don\\'t belong there either. Sources:'"}, "time": 1742628324.6805923}