{"duration": 0.18564653396606445, "input_args": {"text": "'WASHINGTON  —   Congressional leaders confirmed this week what seemed inevitable with the triumph of Donald J. Trump: The   trade agreement with 11 other Pacific Rim nations that President Obama hoped to leave as a major legacy, but which Mr. Trump called “a terrible deal,” is dead. Senator Chuck Schumer of New York, the incoming Democratic leader, told labor leaders on Thursday that the pending   Partnership, the largest regional trade agreement in history, would not be approved by Congress. Senator Mitch McConnell, Republican of Kentucky and the majority leader, said   “no” when reporters on Wednesday asked whether the agreement would be considered in the   Congress that convenes next week  —   its last legislative chance, given the opposition from the  . Mr. Trump, whose invectives against trade agreements were central to his appeal to disaffected   voters, will have the authority as president “to negotiate better deals, as I think he would put it,” Mr. McConnell said. Yet there is little likelihood of Mr. Trump seeking a new agreement. That reflects not only his campaign statements, but also his yearslong hostility to past trade accords as well as the sheer difficulty of renegotiating a Pacific pact that was seven years in the making, entailing compromises among a dozen countries including Australia, Canada, Chile and Japan, but excluding China. Another broad trade deal still being negotiated, the Transatlantic Trade and Investment Partnership between Europe and the United States, is a likely casualty of the Trump election and a global backlash against trade. The discussions “are dead, and I think everybody knows it,” Matthias Fekl, the French secretary of state for trade, said Friday as trade ministers met in Brussels. “Globalization has created lots of losers, lots of difficulties. ” Mr. Obama faces the prospect of many of his signature achievements dying or being pared back dramatically during the Trump administration. The   and congressional leaders have vowed to repeal the Affordable Care Act. Mr. Trump has said he will pull the United States out of last year’s Paris climate agreement and kill off Mr. Obama’s global warming regulations. The   law regulating Wall Street could be carved up. But the   Partnership, painstakingly negotiated but little understood, will be buried with few in either party to mourn it. It was hailed by its negotiators as the most sophisticated such deal ever, establishing the rules of commerce that would rope both sides of the Pacific together into a   economy, while cementing the United States’ alliance with Asia. Which raises the question: What would be lost by abandoning it, for the nation and for specific industries from Hollywood to America’s ranches and farmlands? Its specifics were mostly ignored in the political attacks from both parties. Instead, for many voters the Pacific agreement was simply a lightning rod for their broader discontent with stagnant wages and job losses blamed on globalization and past trade agreements. The other parties to the agreement are Brunei, Malaysia, Mexico, New Zealand, Peru, Singapore and Vietnam. “Popular understanding of the T. P. P. is very low,” Kevin G. Nealer, a scholar at the Center for Strategic and International Studies, wrote in a postelection analysis on Thursday. With its abandonment, he added, “The risk to America’s role as trade policy leader  —   and therefore to the global economy  —   is real and immediate. ” Mr. Obama and his team likewise emphasized the potential geopolitical blow, even as they promoted the economic benefits the trade agreement would offer American exporters by eliminating thousands of tariffs and other trade restrictions in the other countries. Forsaking the agreement, the president insisted, would undercut the United States’ standing in the     region as a reliable counterweight to an expansionary China, economically and militarily, for America’s allies there. The other countries have approved the pact or are in the process of doing so, but without the approval of the United States, it does not take effect. That tension could well be evident later this month, when Mr. Obama and his trade representative, Michael B. Froman, attend the annual   Economic Cooperation summit. The Americans will have to explain their failure on the trade agreement to foreign leaders gathered in Lima, Peru, while China’s leader, Xi Jinping, is there seeking progress toward an emerging alternative to the   Partnership  —   the Regional Comprehensive Economic Partnership, known as R. C. E. P. which includes China, Japan and 14 other Asian countries but excludes the United States. “In the absence of T. P. P. countries have already made it clear that they will move forward in negotiating their own trade agreements that exclude the United States,” Mr. Obama’s Council of Economic Advisers wrote days before the election. “These agreements would improve market access and trading opportunities for member countries while U. S. businesses would continue to face existing trade barriers. ” One example is a bilateral agreement between Australia and Japan, which gives Australian beef exporters a price advantage over American producers whose exports are subject to higher Japanese tariffs those tariffs would ultimately have been removed under the Pacific agreement. “We are experiencing lost sales without T. P. P. ” of about $400, 000 a day as a result, said Kevin Kester, a California cattle rancher and vice president of the National Cattlemen’s Beef Association. “Multiply that over several hundred more products and several dozen more   relationships,” Mr. Froman said in an interview. The T. P. P. would have phased out some 18, 000 tariffs that the other 11 countries have on imports from the United States, thus reducing their cost to foreign buyers. Beyond such typical trade actions, it also would have established a number of precedents for international trade rules dealing with digital commerce, intellectual property rights, human rights and environmental protection. A number of countries had agreed to copyright protections, benefiting sectors like the film industry. The agreement would have assured an open internet among the 12 nations, including in   Vietnam, encouraging digital trade and serving as a contrast to China’s walls to internet traffic. It included commitments against wildlife trafficking  —   Vietnam, for example, is a major market for rhino horns and ivory  —   and against subsidies in that country and others on both sides of the Pacific that encourage overfishing. For the first time in a trade agreement,   businesses like those in Vietnam and Malaysia would have had to comply with commercial trade rules and labor and environmental standards. The agreement would have committed all parties to the International Labor Organization’s principles prohibiting child labor, forced labor and excessive hours, and requiring collective bargaining, a minimum wage and safe workplaces. While unions and human rights groups remained skeptical about enforcement, the United States reached separate agreements with Brunei, Malaysia and Vietnam in which the three countries committed to specific labor changes, under penalty of the United States’ restoring tariffs for noncompliance. Those side agreements will fall along with the overall trade pact.   antitrade politics aside, the biggest hurdle to Republicans’ consideration of the Pacific pact was objections from some  —   led by Senator Orrin G. Hatch of Utah, chairman of the committee responsible for trade  —   to   provisions that would have limited monopoly protections for   pharmaceutical companies’   biologics. Those are advanced drugs used, for instance, in cancer treatments. The Obama administration  —   pressed by nearly every other nation, the generic drug industry and nonprofit health groups like Doctors Without Borders, all of which wanted quicker access to affordable lifesaving drugs  —   had agreed that drugmakers could keep production data secret for five to eight years, fewer than the 12 years in federal law. Mr. Hatch had demanded 12 years. But administration officials were hindered in how far they could go to appease Republicans given strong opposition in other countries to any change. Without the trade agreement, however, drug companies have no monopoly protections for biologics data in some countries. Democrats, organized labor and the Ford Motor Company were especially opposed to the trade agreement because it did not include what they considered enforceable protections against other countries’ manipulation of their currency’s value to gain price advantages for their products. The pact did have a side agreement that, in another first for trade accords, included the parties’ “joint declaration” against currency manipulation, required them to report interventions in exchange markets and set annual meetings to discuss any disputes. Another innovation in the T. P. P. was provisions to help small businesses, which lack the resources of big corporations, to navigate export rules, trade barriers and red tape. Opponents on the left were especially critical of the agreement for opening the door to more foreign subsidiaries being able to go to special trade tribunals to sue to block local, state or federal policies  —   environmental or consumer safety rules, say  —   on grounds that the rules conflict with corporations’ rights under the trade pact. The administration, however, countered that the trade agreement actually reformed the     Dispute Settlement tribunals, which are a longstanding feature of trade policy. It called for changes responding to criticisms that the tribunals favor corporations and interfere with nations’ efforts to protect public health and safety.'"}, "time": 1742564158.2915845}