{"duration": 0.046788930892944336, "input_args": {"text": "'You are here: Home / US / HARD TRUTH About How a Country Evolves Towards Fascism [MEME] HARD TRUTH About How a Country Evolves Towards Fascism [MEME] October 27, 2016 \\nKimberly Morin reports that in 2015, Hillary Clinton gave a speech on Labor Day in Illinois that should seriously send shivers down your spine. \\nThe woman sounds more like a fascist dictator than a candidate running for United States President. \\nIn her effort to try and ‘woo’ the union crowd away from socialist Bernie Sanders, she made ridiculous claims like saying it was unions who created the middle class. \\nNewsflash Hillary: It was Capitalism that created the middle class, not unions. Unions are working hard to destroy it in the public sector and they are doing a damn fine job thanks to help from lunatic Democrats. \\nFrom Grabien : \\nSpeaking at a Labor Day rally in Hampton, Ill., today Hillary Clinton threatened to imprison employers for “wage theft.” \\n“We’re going to go back to enforcing labor laws,” Clinton said. “I’m going to make sure that some employers go to jail for wage theft and all the other abuses that they engage in.” \\n“And we are going to make it harder and harder to stop what should be the right of every American: to join a union and bargain collectively through that union,” she continued. “But, I’ll tell you, we’ve got a fight on our hands.” \\nWhat is she talking about when she mentions ‘wage theft’ and how is she going to jail employers because of it? How will this help the economy? The only ‘wage theft’ that happens in the United States is by the government in the form of taxes. \\nThe woman is clearly out of her collective mind. She continues to talk about Obama mandating federal contractor provide 7 paid sick days a year to their employees. This is more days than a majority of private sector business offer across the country. Benefits are between an employer and employee. It’s not up to the government to mandate them. \\nMake no mistake, just like with most Democrats, Clinton is on board with killing more jobs and hurting small businesses. All while lying through her teeth about wanting to ‘help them.’ \\nYou’ve got to watch the video here:'"}, "time": 1742563158.9515197}