{"duration": 0.03159618377685547, "input_args": {"text": "'Armenia genocide concert in Istanbul cancelled after reports of Erdogan being invited   18:31 Get short URL Turkish President Tayyip Erdogan. © Murad Sezer / Reuters A concert in Istanbul by the Dresden Orchestra to mark the 1915 genocide of Armenians by the Ottomans has been cancelled by Germany. That follows reports that the musicians sent out invitations to the Turkish President and his top aides. \\nThe concert, run by the renowned Dresden Symphony Orchestra, was scheduled to take place on November 13 in the German consulate in Istanbul. Read more German parliament acknowledges Armenian genocide amid intense Turkish pressure \\nCalled ‘Aghet’ or ‘catastrophe’ in Armenian, the performance was to commemorate the victims of the 1915 massacre that left around 1.5 million Armenians dead and hundreds of thousands forced to flee. \\nTurkish President Recep Erdogan was personally invited to attend the event by the orchestra, along with other top Turkish politicians, including Prime Minister Binali Yildirim and Foreign Minister Melvut Cavusoglu, German T-Online news outlet reports , citing DPA news agency, which gained access to copies of the invitations. \\nThe invitations were made despite Erdogan taking a hard stance against Germany’s recognition of the Armenian genocide – even threatening Germany with some “response measures.” \\nThe concert was cancelled by Berlin. On Wednesday, the German Foreign Office said that “the premises in the Istanbul consulate are not available on November 13th,” according to Deutsche Welle. \\nLater in the day, orchestra director Markus Rindt said he received notification from the ministry with nearly the same content. \\n“It’s definitely been canceled. They said they wanted to reschedule at a better time, but when would that be? This has been planned for years,” Rindt told Reuters. \\nThe piece by the Dresden Symphony Orchestra includes musicians from Turkey, Armenia, Germany, and the former Yugoslavia. It premiered last year in Berlin with additional performances scheduled in Belgrade on November 5 and in the Armenian capital of Yerevan on November 10. Read more Germany says Armenia genocide resolution ‘non-binding’ after reports Berlin keen to ‘satisfy’ Turkey \\nThe ‘Aghet’ has become one of several stumbling blocks in troubled Turkey-Germany relations. In April, the Turkish ambassador to the EU demanded that the bloc stop funding the project which received initial support from the European Commission’s Executive Agency for Education, Audiovisual and Culture. \\nOn June 2, 2016, the German parliament almost unanimously passed a symbolic resolution recognizing the 1915 massacre of Armenians by Ottoman Turkish forces as ‘genocide.’ The move was praised by Armenia and sharply criticized by Turkey, which even tried to pressure Germany ahead of the vote. \\nFollowing the move, Ankara recalled its ambassador to Germany, while Erdogan said that the government would discuss response measures. \\nThe mass killings began on April 24, 1915, when 250 Armenian intellectuals were detained by Ottoman authorities and later executed in Constantinople, present-day Istanbul. Most of the Ottoman Empire’s Armenians were then displaced, deported, or placed in concentration camps on the pretext of rebelling and siding with Russia in World War I. Up to 1.5 million Armenians were affected by these measures. \\nTurkey, the successor of the Ottoman Empire, concedes that many Armenians were mistreated at the time, but maintains that the number of victims has been grossly exaggerated.'"}, "time": 1742628450.6404324}