{"duration": 0.0157315731048584, "input_args": {"text": "'French presidential candidate Marine Le Pen has denounced radical Islam as “a monstrous totalitarian ideology that has declared war on our nation, on reason, on civilisation,” after a deadly Kalashnikov attack on police officers in Paris. [“Hate preachers must be expelled, the Islamist mosques closed,” the Front National leader declared, lambasting the Socialist Party government as “notoriously feeble”.  “We cannot afford to lose this war   …     for the past ten years,   and   governments have done everything they can for us to lose it. We need a presidency which acts and protects us,” she declared, calling on outgoing president François Hollande to expel all foreign nationalists on the extremist watch list and terminate France’s membership of the EU’s borderless Schengen area, which was castigated as “effectively an international   zone for terrorists” by former INTERPOL chief Robert Noble after Islamists killed 130 people in Paris in 2015. “I will protect you. My first measure as president will be to reinstate France’s borders,”  https:  .   —   Breitbart London (@BreitbartLondon) April 20, 2017,  Ms Le Pen’s main rival for the presidency, former Rothschild banker Emmanuel Macron, was the Socialist economy minister until recently, and struck a very different tone following the attack, telling RTL France he would not invent an   programme in response to the police killing. In another interview shortly after the shooting, Macron described radical Islamic terrorism as and “imponderable problem” which would be “part of our daily lives for the years to come”. C’est la vie! Macron tells #France terror will be ‘part of our daily lives for years to come’.   Valls advising? https:  .   —   Jack Montgomery ن (@JackBMontgomery) April 21, 2017,  Macron’s comments may prove to be a serious misstep. The presidential hopes of former colleague and prime minister Manuel Valls were dashed after he made a similar statement following the Nice lorry attack, saying “Times have changed and we should learn to live with terrorism” and earning a furious public backlash. A majority of France’s paramilitary police force  —   the Gendarmerie  —   were already planning to vote for Ms Le Pen before the recent killing, well ahead of Macron. The poll came as a French police officer was gunned down in Paris in a ’terror attack’ https:  .   —   Breitbart London (@BreitbartLondon) April 21, 2017, '"}, "time": 1742628510.7249432}