{"duration": 0.15157580375671387, "input_args": {"text": "'WARSAW  —   The bodies of Poland’s former president and his wife were exhumed Monday evening as part of an investigation into an April 2010 plane crash in Russia that killed the couple  —   after years of speculation, backed by little evidence, that the crash was not an accident. Over the next two months, prosecutors appointed by Poland’s   governing party plan to examine the remains of 83 of the 96 people who died in the crash, starting with the former president, Lech Kaczynski, and his wife, Maria. The couple’s bodies were interred in a crypt in a cathedral in Krakow, near the tombs of Poland’s kings and heroes like the military commander Thaddeus Kosciuszko and the poet Adam Mickiewicz. Jaroslaw Kaczynski, the former president’s twin brother and the leader of the ruling Law and Justice Party, was on hand for the ceremony, at the Wawel Cathedral. The party has long insisted that investigations by Poland’s former government and the Russian authorities failed to unearth the true cause of the crash. Reopening the investigation was one of the first acts of the new government after assuming power a year ago. So far, the party has offered little more than speculation about what might have caused the crash, pointing to discrepancies in paperwork and supposed missing seconds on flight data recordings to hint that something nefarious must have occurred. Two previous investigations  —   one by the Polish authorities under the previous government and one by the Russian authorities  —   found that the crash was an accident. But supporters of the Law and Justice Party have offered other potential theories. Some believe that Russians caused the plane to crash in heavy fog at a disused military airfield near Smolensk as the Polish leaders were arriving to join a commemoration of a   massacre of thousands of members of Poland’s military and political elite in the Katyn Forest in 1940. Others suspect that a bomb was hidden on the plane, and still others say the crash resulted from negligence by the former Polish government. So far, though, no credible evidence has been released to support those theories. A film called “Smolensk,” based on the bomb theory, was released this year in Poland and given a gala premiere at Warsaw’s opera house, attended by President Andrzej Duda. And some Law and Justice officials have talked about putting the former Prime Minister Donald Tusk  —   now the president of the European Council, which comprises the leaders of the 28 member states of the European Union  —   on trial for what they say is his role in the crash. One of Mr. Tusk’s top aides is already on trial over claims of negligence in preparations for the visit. The aide faces up to three years in prison. The Kaczynskis were exhumed in the presence of prosecutors, priests and family members. Marek Pasionek, the deputy prosecutor general of Poland, said the autopsies were crucial because of “numerous violations” found in medical documents prepared by the Russian authorities six years ago. Despite initial claims made by Mr. Tusk’s   government that Polish representatives had participated in the initial autopsies in Russia, Mr. Pasionek said that only Russian officials had conducted the examinations. He also said the coffins were sealed before the bodies were returned to Poland. Mr. Pasionek, who is responsible for the investigation, said that court medical experts had found mistakes in 90 percent of the medical records sent by Russia. Further, he said, when nine bodies were exhumed by prosecutors under the previous government, it turned out that six had been misidentified. The decision to exhume the bodies has been vigorously opposed by many of the victims’ families. More than 200 relatives of 17 victims wrote an open letter last month to the Roman Catholic Church, which holds significant influence over Poland’s   government, to join them in opposing the exhumations. “Six years after those tragic days, we are standing alone and helpless against a ruthless and cruel act,” they wrote. “Our loved ones are to be taken out of their graves, in spite of a sacred taboo that forbids disturbing the peace of the dead. ” Pawel Deresz, a journalist whose wife, a leading   politician, died in the crash, was one of the signers of the letter. He said he had also complained to the Mr. Pasionek’s boss, Justice Minister Zbigniew Ziobro. If that complaint is denied, he said, he plans to sue. “I think it would be fair to exhume bodies of those victims whose relatives support this action, but the rest of us should be left alone,” Mr. Deresz said. Mr. Pasionek said there would always be doubt in some minds until every stone is turned. “If we don’t examine and gather all the evidence that is possible to retrieve at this stage, there will always be some doubts,” he said. “We will look for possible traces of explosives, but if we don’t find them, we will eliminate the possibility of an attack on the plane. ” Magdalena Merta  —   whose husband, Tomasz Merta, a Culture Ministry official, died in the crash  —   said that she wanted to know if “it is my husband who lies in our family vault. ” “Six years ago, the previous government blatantly lied to us when they claimed that they had witnessed the autopsies performed by Russians,” Ms. Merta said. “I don’t know why they lied, but it is clear that they defended Russian interests. They acted as an ally of Russians, not Poles. ” In the years after the crash, a team of experts led by Antoni Macierewicz, who is now the defense minister, claimed that the plane had been brought down by explosives brought on board. Experts working with Mr. Macierewicz even suggested that Russia had pumped artificial fog over the runway. They tried to prove their theories, in one instance, by boiling sausages and noting that the split along the length of a cooked sausage matched a gash in the plane’s fuselage, indicating that high heat was involved. Independent experts found this evidence dubious at best. And while Mr. Macierewicz claimed over the years to have “irrefutable evidence” of explosives, his experts have yet to produce it. Since 2010, Law and Justice supporters have gathered outside Poland’s presidential palace every month to commemorate the crash and remember its victims. At the most recent gathering, last Thursday, Mr. Kaczynski told the crowd that “Poland will not be truly free without learning the truth” about the crash. “We want our fight for the truth to be revealed, for the victims of the Smolensk tragedy to be venerated, for monuments to be put up,” he said. Critics of Mr. Kaczynski’s inquiry into his brother’s death say it has been used by the governing party to rally its base, divert the public’s attention and discredit opposition politicians. Mr. Deresz said Mr. Kaczynski’s party had won parliamentary elections by “dividing the Polish people and promising to find the truth” about the crash. “They claim that it was a terrorist attack” orchestrated by President Vladimir V. Putin of Russia and Mr. Tusk, he said. “I mean this is madness. This is true Smolensk insanity. ”'"}, "time": 1742562218.9129188}