{"duration": 0.1277937889099121, "input_args": {"text": "'Good morning. (Want to get California Today by email? Here’s the  .) California appeared to witness a rise in hate last year. In 2016, the state was home to 79 organizations with animus toward blacks, whites, immigrants, Muslims and other groups, according to a new report by the Southern Poverty Law Center, an   group that tracks extremism. That’s up from 68 the year before. The report found that California had more hate groups than any other state  —   followed by Florida, with 63, and Texas, 55  —   a result presumably of its sheer size. But the data also revealed a notable cluster of activity in the corridor between the Los Angeles area and San Diego, where at least 40 of the groups operate. Mark Potok, a senior fellow at the center, suggested the presence of a heavy Latino population in Southern California played a part in fueling   sentiment. To earn a place in the hate index, an organization must publicly espouse the idea that a class of people is inferior by virtue of its characteristics. The   Southern Poverty Law Center, founded in 1971, has faced criticism in the past for applying the designation to mainstream conservative groups, such as the Family Research Council. In 2015, it apologized after labeling Ben Carson an “extremist. ” The latest report included many California groups, such as the Golden State Skinheads, Identity Evropa and Islam Threat, whose platforms are explicitly discriminatory. But the classification of other groups drew pushback. Californians for Population Stabilization, a Santa Barbara group with thousands of members, was labeled   by the center. Mr. Potok attributed the determination in part to troubling remarks about race and eugenics made by people formerly linked to the group. Benjamin Zuckerman, the group’s president, vehemently objected to the characterization. The organization’s objectives, he said, are twofold: environmental conservation and fairness to working Americans who are harmed by “over immigration. ” “I consider us pretty much just ordinary people,” said Dr. Zuckerman, who is also an astronomy professor at U. C. L. A. “We just have a view that too many people for a given environmental carrying capacity is just not good. ” (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Nearly 250 people were rescued from flooding in San Jose after rain combined with water from the overflowing Anderson Reservoir. [The Mercury News] • A water expert on the continuing flood threat: “If you are protected by a rural levee or levees in the delta, you are not sleeping well. ” [Los Angeles Times] • The Trump administration’s new immigration policy greatly expands the categories of people subject to deportation. [The New York Times] • The untold story of how Kevin Leon became Kevin de León, leader of the California State Senate. [Sacramento Bee] • A program in Richmond treats gun violence as an epidemic that spreads by exposure to it. [Opinion | The New York Times] • A California secession advocate has faced scrutiny over where he’s based: Russia. [The New York Times] • “I don’t think I’ve been as sorry. ” Milo Yiannopoulos resigned from Breitbart News after his remarks on pedophilia. [The New York Times] • Kenneth Arrow died in Palo Alto at 95. He was one of the most brilliant economic minds of the 20th century. [The New York Times] • In a momentous   the Lakers put Magic Johnson in charge of the team’s front office. [The New York Times] • Candice Wiggins, the former W. N. B. A. player and   at Stanford, said she was targeted for being heterosexual. [San Diego  ] • Led by Cheryl Boone Isaacs, its first black president, the motion picture academy is trying to solve its diversity problem. [The New Yorker] • A WikiLeaks opera is arriving in San Francisco after a bruising election year. [The New York Times] • With its sunshine, gorgeous beaches, breweries and   restaurants, San Diego is the spot for   fun. [The New York Times] Congress is in recess this week. That means it’s town hall time. The contentious first month of the Trump administration has left many Californians with questions, and in some cases complaints, as Representative Tom McClintock has learned. On Feb. 4, Mr. McClintock, a Republican from Elk Grove, faced a raucous crowd during a town   meeting in Roseville, where he was escorted from the venue by the police. Mr. McClintock was back for another meeting with constituents on Tuesday, this time in Mariposa, where more than a dozen police officers were on hand. According to The Fresno Bee, the questioning from the   crowd was boisterous, but peaceful. Have something to say to your representative? He or she may have a town hall scheduled. KQED in San Francisco compiled a list: Wednesday • Representative Jared Huffman in Weaverville. 4:30 p. m. [Details] • Representative Salud Carbajal in Arroyo Grande. 6 p. m. [Details] • Representative Tom McClintock in Sonora. 6 p. m. [Details] • Representative Scott Peters in San Diego. 6:30 p. m. [Details] • Representative Susan Davis in San Diego. 6:30 p. m. [Details] • Representative Ro Khanna in Fremont. 7:30 p. m. [Details] Thursday • Representative Lou Correa in Santa Ana. 6 p. m. [Details] • Representative Mark DeSaulnier in Pleasant Hill. 6:30 p. m. [Details] • Representative Mark Takano in Riverside. 6:30 p. m. [Details] Friday • Representative Brad Sherman in Van Nuys. 3:30 p. m. [Details] • Representative Lou Correa in Santa Ana. 5 p. m. [Details] Saturday • Representative Mike Thompson in Santa Rosa. 9 a. m. [Details] • Representative Nanette Barragán in San Pedro. 1 p. m. [Details] Want to submit a photo for possible publication? You can do it here. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742563787.8076797}