{"duration": 0.17408442497253418, "input_args": {"text": "'Craig Shirley, author of the seminal Ronald Reagan biographies Last Act: The Final Years and Emerging Legacy of Ronald Reagan, Reagan’s Revolution, and Rendezvous with Destiny: Ronald Reagan and the Campaign That Changed America, was a guest on the Breitbart News Daily Memorial Day special edition. [Shirley is also the author of an important book on one of the most significant months in all of history, December 1941: 31 Days that Changed America and Saved the World. This was the work SiriusXM host Alex Marlow asked about in light of Memorial Day.  LISTEN: Shirley noted that December 1941 marked America’s entry into World War II two years after the beginning of “a war that we swore we would never get involved in. ” “We didn’t want to get involved. There was an America First movement which rose up, which pressured the Roosevelt administration  —   civic leaders, business leaders, military leaders, everybody in America. There wasn’t anybody who really was for getting involved in another war,” he recalled. “We had a bad taste in our mouth after World War I. There was a saying going around America after World War I that all we got was debt, death, and George M. Cohan,” he said, the latter being the lyricist who wrote the enduring anthem of the First World War, “Over There. ” Shirley described America as “essentially isolationist” after the horrors of World War I, until the Pearl Harbor attack, followed by Germany and Italy’s declarations of war the following week, “changed our outlook instantaneously. ” “It’s like a cue ball hitting an   and sending it off in a radically different direction than the path it had been previously on,” he said. “It gives rise to Dwight Eisenhower, who was a   clerk on General Douglas MacArthur’s peacetime staff, who goes on to become the great commander of the   invasion, the supreme commander of the Allied forces against Nazi Germany and the Axis powers, goes on to become an underestimated but still great president. ” “John Kennedy becomes president  —   in large part, he runs in 1960 as a war hero,” he continued. “He was a war hero in World War II. Without his injuries in the Pacific, without his Navy Cross and the other awards he won, he would have just been considered a rich lightweight playboy in 1960, and would probably have lost. ” “On the other hand, it gave rise to Richard Nixon,” he added, noting that Nixon was a supply officer in the Pacific during World War II. He wryly observed that Nixon became an accomplished poker player during his leisure time during the war and won enough money to finance his first political campaign. Both his poker winnings and his wartime experience were arguably crucial to establishing his political career in 1946. Shirley observed that World War II profoundly advanced technology, in fields ranging from rocketry and nuclear power to industrial science and medicine, with both military and civilian applications. “World War Ii literally changes our world in ways that we think about, and in more ways that we don’t think about,” he concluded.  Those profound changes were not limited to America or the Western world, as evidenced by such profound events as the Rape of Nanking. “We are all guilty, I think, of being ” Shirley said. “Also, the more compelling figures of history  —   most especially Churchill and Hitler  —   are from Europe, so the European history of World War II has tended to dominate. ” However, he noted that “the atrocities committed by the Japanese were unspeakable. ” “They not only waged war against civilians, as they did in Manchuria, as they did in the Rape of Nanking, as in other aspects in the Philippines. They also, unlike the Germans, were brutally cruel to their POWs. The Germans were actually quite decent toward American and British POWs, especially pilots and officers. They treated them with a certain amount of respect. Those in POW camps were treated fairly well, relatively speaking. ” “But in the Japanese culture, in the shogunate culture that came up to dominate Japan in the Thirties, and then launched Japan into war with America, it was considered by that culture that the worst possible thing was for one man to be held captive or imprisoned by another man. That was the ultimate humiliation. It meant that they had no respect whatsoever for the American POWs, or the Australian POWs,” he explained. “This manifested itself in the Bataan Death March, in which thousands of American officers and military men, and Australians, were brutally savaged by the Japanese,” Shirley said, citing such torments as dousing prisoners in gasoline and setting them ablaze. “They performed unspeakable atrocities on American, Australian, and British enlisted men and officers  —   much, much worse than the Germans did,” he said. Conversely, Shirley agreed with Marlow’s observation that Japan learned the lessons of the war better than Germany, with respect to foreign policy and immigration in particular. “There’s an old saying about the German people: they’re either at your feet, or at your throat,” Shirley said. “What dominates Germany, dominates the culture and dominates politics, is an enormous sense of guilt, even    years later  —   over World War II, over the Holocaust, over the atrocities and the conduct of Adolph Hitler and the Third Reich toward Europeans, toward Americans, toward the British, toward Russians. Now they go in the opposite direction. ” “Whereas they were unspeakably cruel, they were horribly, evilly cruel, their natural reaction is to go just in the opposite direction and open up their gates to let in all sorts of immigrants, illegal immigrants, people from the Middle East. This is what dominates the German politics and culture in every way,” he argued. Shirley found December 1941 so eventful that he was able to dedicate a separate chapter of his book to each day. “It was a fun book to write, because there are a lot of good books on the military response to December 7 1941, but there haven’t been many books written on the civilian response  —   on the transition from a peacetime economy to a wartime economy,” he noted. He said he wanted to go into depth on what was happening across the country and around the world, inspired by childhood memories of how family dinners inevitably turned to conversations about World War II. “My grandfather would say something like, ‘Well, I bought that DeSoto before the war, but I didn’t sell it until after the war,’” he recalled. “There would be discussions about gas rationing, meat rationing, victory gardens. I just became really infused with how much the war really affected the culture of America. Iraq and other modern wars, even Vietnam, didn’t impact the civilian population too much, because they weren’t really involved. ”  “World War II was the first, and really the last, war in which the government called on the American people to make ultimate sacrifices, and they did so  —   gladly, willingly, happily. The refrain at the time, if somebody complained about coffee rationing at the local grocery store, the grocer would look at you and say, ‘Hey, there’s a war on.’ Everybody sacrificed,” he said. Shirley said his research found no evidence of extensive hoarding or black market activity to evade these wartime sacrifices despite ample incentives, since “everything was rationed. ” “The American serviceman came first in clothing, in medicine, in food, and if the American serviceman didn’t come first, it went to Britain and to Russia. The American civilian was pretty much last in line for food, goods, and services in the United States. And the irony is that nobody complained about it,” he said.  “Everybody knew what was at stake. Everybody avidly followed the war news. Everybody listened to the radio broadcasts  —   Gabriel Heatter, Lowell Thomas, and other war broadcasts. They listened to Winston Churchill, listened to Franklin Roosevelt, read their newspapers avidly, and knew about places that they’d never heard of before: The Burma Road, or Thailand, or Patton’s desert campaign against Rommel in North Africa. Everybody was knowledgeable and everybody was sophisticated in their conversations about the war,” Shirley recalled. Shirley recalled his uncle paying “the ultimate price” when he was shot down over the Pacific on his 20th birthday. He remembered childhood visits to the gravesite to leave flags and offer prayers for his Uncle Barney  —   a nickname he earned when Shirley’s   observed that his huge eyes resembled those of cartoon character Barney Google.  His father and another uncle also served in the war.  “For our family, it was deeply, deeply personal,” he said. “My grandmother would shed some tears. My grandfather would shed some tears. But there was also a certain amount of solemnity and dignity to our day,” he said of the family dinners and memorial visits. “I remember going as a child to the graveyard and seeing other families there, doing similar things for their family members, for the men in their family who had fought and died in World War II, or even World War I, as a child. I think there are many ways to celebrate Memorial Day: to think about it, to pray about it, to act on it, to do something charitable for your fellow Americans. Whatever you do, I think it’s important to do something to memorialize those who made the ultimate sacrifice,” Shirley urged. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full audio of Craig Shirley’s interview above.'"}, "time": 1742561828.1850743}