{"duration": 0.052698373794555664, "input_args": {"text": "'By wmw_admin on November 1, 2016 News Brief — Oct 31, 2016 Frankfurt central station. Click to enlarge On Sunday a knife wielding attacker stabbed four people in Frankfurt’s Hauptwache train station. At this stage the motive for the stabbings is still unknown and the assailant is still on the run. Frankfurt Police confirmed all four victims were still in hospital. However, the police have yet to issue any description of the attacker or any eyewitness accounts of the attacks. All of which prompts this writer to wonder why? Normally following such incidents police release an impression of the attacker based on victims description. But this time German police have released no such information, not even a photofit of the alleged attacker. Although it is still unclear who was responsible or what their motive was, the attacks follow a spate of similar attacks carried out by migrants and asylum seekers in Germany. In addition to a wave of sexual assaults that accompanied the migrant influx, more overtly politically motivated attacks have also been carried out. All of which have called into question Angela Merkel’s open-door immigration policy. A week of violence that rocked Germany began in mid July when Pakistani teenager Riaz Khan Ahmadzai, 17, posing as an Afghan refugee, hacked at passengers on a train in Wurzburg with an axe, wounding five. He was shot dead by police. Four days later mentally disturbed German-Iranian teenager Ali Sonboly shot nine dead during a rampage through a Munich shopping centre before taking his own life. Although the authorities said that there was no terrorist motive for the attack and that Sonboly had acted in response to bullying, that didn’t stop many Germans from arriving at their own conclusions. Two days later a Syrian refugee, 21, hacked a pregnant woman to death in Reutlingen and on the same night a 27year-old Syrian refugee injured 12 people when he detonated a rucksack packed with metal shards and screws in Ansbach. The bomber was also killed by the blast. However, in a message left on his mobile phone he claimed that the attack had been carried out on behalf of ISIS as an act of revenge against Germans . More deaths had been narrowly averted after the bomber was turned away by security guards at a music festival and instead detonated his rucksack bomb outside a nearby wine bar. Earlier this month the town of Chemitz went into lockdown after police raided the flat of Syrian refugee Jaber Albakr, who is alleged to have been plotting a terror attack on a German airport. All of which leaves us wondering: why no photofit or eyewitness description from the Frankfurt attack? In fact since the attack occurred on Sunday and the attacker went on the run there have been no further updates. Nothing. Almost as if a news blackout were being imposed. Ed'"}, "time": 1742562455.848943}