{"duration": 0.08300256729125977, "input_args": {"text": "'On a wintry morning last month, Julie Andrews and her daughter Emma Walton Hamilton breezed into the Jim Henson Company’s Creature Shop in Queens, where they warmly greeted puppets hanging limply from a stand. “Why, hello there!” said Ms. Andrews, 81, hailing the foam and fabric creations as if they were close friends. They sort of are. The puppets  —   animated and voiced by skilled puppeteers  —   star alongside Ms. Andrews in “Julie’s Greenroom,” a new children’s show produced by the Henson Company and available on Netflix beginning March 17. She was particularly partial to Hugo the Duck, a character she created, stroking his feather head until her daughter gently chided her. “Mom, you shouldn’t keep touching him,” Ms. Hamilton said. “We’re not supposed to get oil on them. ” Ms. Andrews quickly apologized. “I just wanted to lift his feathers up a bit,” she said. Ms. Andrews, an     and   actress who is as warm and forthright in person as anyone who grew up loving “Mary Poppins” would expect her to be, has worked with puppets before. As a child actress in England, she serenaded a ventriloquist’s dummy in “Educating Archie,” a popular radio show. In “The Sound of Music,” she yodeled with marionettes. And on “Sesame Street” and “The Muppet Show,” she vamped with their   denizens. The difference now? She helped bring these latest puppets into existence. Besides starring in “Julie’s Greenroom,” Ms. Andrews helped create, write and produce the show with Ms. Hamilton and Judy Rothman Rofé, an   writer on “Madeline” and other kids’ programs. On the show, she plays Ms. Julie, who teaches a performing arts class to five puppet pupils. Over the debut season’s 13 episodes, Ms. Julie and celebrity guests (including Alec Baldwin, Idina Menzel, Josh Groban, Carol Burnett and David Hyde Pierce) inspire the eager young thespians to create and perform an original musical. Both mother and daughter want the show to champion the vital role they see the performing arts play in teaching children critical thinking, empathy, tolerance and communication skills. “It’s the bridge across all countries,” Ms. Andrews said, referring to drama, dance and music. “The hardest part for us with the show was not to get preachy but also to make it wildly entertaining. ” Ms. Andrews is keenly aware that her new show is entering a rapidly changing children’s television world. The traditional major networks and even the Disney Channel and Nickelodeon are losing young viewers to streaming services like Netflix and Amazon Prime, which are plumping up their kids’ programming with ever more offerings. Netflix currently streams more than 40 of its own children’s shows, including “A Series of Unfortunate Events” and “Trollhunters,” while Amazon offers 15 originals, such as “Annedroids” and “Tumble Leaf. ” And HBO, which streams via HBO Go and HBO Now, cut a deal a year ago to air new episodes of “Sesame Street” nine months before they appear on PBS. “When I was growing up, I watched ‘The Smurfs’ on Saturday morning,” said Rich Greenfield, an analyst specializing in technology and media at BTIG Research, referring to the NBC cartoon show from the 1980s. “That was the definition of kids’ TV. Kids today don’t even think about turning on the TV networks or cable on Saturday. They want it on demand, and that’s how they’re used to getting it. ” For the streaming services, in particular, their treasure trove of data clearly show what their viewers crave: According to Netflix, more than half of its 93 million members in nearly 200 countries, for example, regularly watch its children’s shows. “Children’s content is important, because it’s our first opportunity to build brand love for Netflix that we hope will last a lifetime,” said Andy Yeatman, director of global kids content at Netflix. The real targets, of course, are parents who pay the subscription fees. “Kids’ content gives the household a reason to subscribe, because kids watch every single day,” Mr. Greenfield said. Following their schmooze with the puppets, Ms. Andrews and Ms. Hamilton discussed the birthing process for their show over scones and coffee in a conference room at the Creature Shop. The women have an easy rapport, built up not only as mother and daughter but also as the   of more than 30 popular children’s books, including the “Dumpy the Dump Truck” and “The Very Fairy Princess” series. (Ms. Andrews has four other children, including two stepchildren, as well as 10 grandchildren and three  .) After the Henson Company approached Ms. Andrews and Ms. Hamilton with the show’s concept, the project was shopped to Netflix in late 2015 Mr. Yeatman and his team quickly said yes. “One of the things that attracted us was not so much that Julie was attached, but that this was a topic she cared a lot about: building a love for the performing arts in kids,” Mr. Yeatman said. Then the real work started. Ms. Andrews and Ms. Hamilton, together with Ms. Rofé, spent a week last winter mapping out the show’s narrative arc and writing the pilot episode at the actress’s home in Sag Harbor, N. Y. The peripatetic Ms. Andrews, a widow since the death in 2010 of the director Blake Edwards, now considers Sag Harbor, a former whaling village (where Ms. Hamilton also lives) her primary residence. Next came the creation and building of the show’s seven puppet characters (which include a dog and Hugo the duck). Ms. Julie’s five pupils are a true rainbow coalition, including one who is in a wheelchair and another who is seemingly gender neutral. “That’s Riley she loves all the technical backstage stuff,” Ms. Andrews said, pointing to an androgynous puppet sporting shortish red hair and round glasses. “She’s a girl. ” Ms. Hamilton, 54, an actress turned writer and arts educator, chimed in. “If pressed, we’d say that she’s a girl, but maybe not forever,” she said. “We wanted to be as diverse as possible. ” Ms. Andrews and Ms. Hamilton weighed in extensively when the puppets were being designed and built at the Creature Shop. They helped choose hair color and texture, outfits, even nose shapes. “Mom, remember the 17 different fabric swatches we went through for Peri’s skirt?” Ms. Hamilton asked, referring to the    puppet. “Yes!” Ms. Andrews replied. “We wanted it as icing pink as possible. ” The women also sat in on final casting sessions to pick an actor to play Gus, Ms. Julie’s (human) assistant. Giullian Yao Gioiello (“The Carrie Diaries”) won the role after strumming his guitar and demonstrating his    prowess. “I was a bit in awe when I first walked in,” he said of meeting Ms. Andrews. But after spending six weeks of nearly   days shooting the series at Grumman Studios in Bethpage, N. Y. he came to regard his energetic   as his honorary grandmother. “She’d share stories and get me her favorite tea, a British brand called PG Tips. ” The biggest surprise? “That Julie Andrews at the end of the day wants a martini. ” Ms. Andrews and Ms. Hamilton also lined up many of the show’s celebrity guest stars. In the first episode, Ms. Menzel introduces the pupils to Broadway musicals. Ms. Julie informs them that Ms. Menzel was the voice of Elsa in Disney’s “Frozen,” a credit sure to impress young viewers more than her Broadway credits from “Wicked” or “Rent. ” “You don’t say no to Julie Andrews,” Ms. Menzel said. After working with her on “Julie’s Greenroom,” Ms. Menzel said, she’s especially impressed by the veteran star’s polite perfectionism. “We would rewrite things on the spot to make them better. She doesn’t settle. She wanted to get things right, but she did it with grace. ” Several of the guest stars sing with Ms. Andrews, warbling original songs. Following a botched surgery on her vocal cords 20 years ago, her once   range is now reduced to one. These days, she  . “I touch what notes I can and say the others,” Ms. Andrews said. “I have about three or four good bass notes left. I could sing you a terrific version of ‘Old Man River. ’” Ms. Andrews said she despaired,   because her whole identity “was being able to sing and the joy of it. ” She eventually realized  —   “It was a great lifesaver”  —   that there were other ways to incorporate music into her life. Ms. Hamilton nodded. “In this show, Mom was very   with the songs and the underscoring,” she said. Ms. Andrews added, “The arrangements, the scoring  —   it’s something I’m so passionate about. ” It shows. In one of the most spirited scenes, cast members from the   Off Broadway show “Stomp” visit to teach percussion. In an extended jam session, filmed in one long take, the “Stomp” cast, Gus and the puppet pupils turn everyday objects in their classroom in an old theater into instruments. Ms. Julie joins in, picking up a china teacup and rhythmically whacking at it with a spoon. The action was unscripted. “Who better than an English mum to pick up a teacup and start banging away?” Ms. Andrews said, laughing. “That’s serendipity. ”'"}, "time": 1742628579.0177157}