{"duration": 0.049451351165771484, "input_args": {"text": "'\\nIn an excerpt of a John Pilger Special interview, Julian Assange says that emails released by Wikileaks show that Hillary Clinton is intentionally misguiding voters about the degree to which US allies are supporting ISIS, and that Donald Trump will not be allowed into the oval office.\\nAssange explains that the same financial interests funding ISIS are funding Clinton. He references a 2014 email from John Podesta to Clinton, in which we find the following:\\nWhile this military/para-military operation is moving forward, we need to use our diplomatic and more traditional intelligence assets to bring pressure on the governments of Qatar and Saudi Arabia, which are providing clandestine financial and logistic support to ISIL and other radical Sunni groups in the region.\\n\\n“I think this is the most significant email in the whole collection,” said Assange. “All serious analysts know, and even the US government has agreed, that some Saudi figures have been supporting ISIS and funding ISIS, but the dodge has always been that it is some ‘rogue’ princes using their oil money to do whatever they like, but actually the government disapproves. But that email says that it is the government of Saudi Arabia, and the government of Qatar that have been funding ISIS.”\\nPilger asked Assange about the possibility that Trump would steal the election with the help of Russia, as many in the Democratic party claim.\\nAssange thinks that this is highly unlikely, but not because he is unpopular. “My analysis is that Trump would not be permitted to win. Why do I say that? Because he has had every establishment off his side. Trump does not have one establishment, maybe with the exception of the Evangelicals, if you can call them establishment,” he explained.\\nAssange says that Hillary is the establishment pick. “Banks, intelligence, arms companies, foreign money, etc. are all united behind Hillary Clinton. And the media as well. Media owners, and the journalists themselves.” Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Daily Sheeple of www.TheDailySheeple.com . \\nThis content may be freely reproduced in full or in part in digital form with full attribution to the author and a link to www.TheDailySheeple.com. '"}, "time": 1742562273.884725}