{"duration": 0.09481096267700195, "input_args": {"text": "'Welcome to Watching, The New York Times’s    guide. We comb through releases big and small to email readers twice a week with our timely recommendations. You can browse previous guides here, and to receive recommendations straight to your inbox, sign up here. Stay tuned for our coming website. Dear Watchers, Toss the confetti, pop the champagne, put on the nice sweatpants: We’re in for a great TV week. New shows, returning favorites, a bird documentary  —   heaven is a place on earth. And that place is within our televisions (and computers and tablets and whatnots). If you find yourself in need of some TV guidance, I’d love to answer your questions, or settle your disputes. I am, as I ever was, and ever shall be: watching@nytimes. com. And a “1776” fan. Happy watching! Watch “Gomorrah,” Wednesday, 10 p. m. SundanceTV. First came Roberto Saviano’s 2007 nonfiction book about Neapolitan organized crime. Then came the 2009 movie. Now there’s this   Italian 2014   airing weekly in   chunks. If you’re looking for romantic, sweeping Italian vistas, try “The Wine Show. ” “Gomorrah” is violent and bleak, almost suffocating. There are some familiar   beats here, but the cinematography alone is worth tuning in for. Watch “Halt and Catch Fire,” Season 3 premiere, Tuesday, 9 p. m. AMC.  The new season of this   drama transplants the show to Silicon Valley from Texas  —   sort of a bummer, unless you are dying for another show about how people in California are just a little different from the rest of us. Thank god enough of the show’s emotional core  —   Donna, mostly  —   is still intact. This   premiere highlights the strengths and shortcomings of “Halt. ” (The first episode is available now on AMC.) “Mad Men” is superficially about advertising, but more deeply it’s about constructing identity. “The Americans” includes tales of espionage, but foundationally is about defining truth. When it’s its best, “Halt” is about the need for human bonds, and how that need will override all other behaviors. Too often, though, it’s just about how computers and the internet worked (or didn’t) in the ’80s. Watch “The Profit,” Tuesday, 10 p. m. CNBC (Previous episodes are on Hulu). The entrepreneur Marcus Lemonis travels the country and invests his own money in struggling small businesses, on the condition that he be “100 percent in charge. ” If you like shows like “Tabatha’s Salon Takeover” or “Kitchen Nightmares,” but wish they were more supportive and had better   messages, “The Profit” is for you. Lemonis is calm and direct, and he doesn’t yell at anyone or look to humiliate people anyone who comes across poorly does so on their own. This week’s Season 4 premiere is another   venture (the show has included several such businesses) but more important, Lemonis seems to have retired his Hermès belt. Watch “Dallas Cowboys Cheerleaders: Making the Team,” Thursday, 9 p. m. CMT. Warning: The season premieres of “Dallas Cowboys Cheerleaders” tend to be the worst episode of the season. The early auditions include too many aspiring cheerleaders who clearly have no chance of making the team, and too many randos weighing in. (Being married to a football player does not make you an expert in dancing.) But once the show   into gear, it’s one of the most absorbing, brutal   reality shows going. The level of drive and athleticism on display is staggering, and if you’ve ever wondered just how extrinsic one’s image can be, this is the show for you. Everything is up for scrutiny: Are her eyes just too intense? Is that smile a little forced? Do her breasts seem natural enough? Hair: too severe? Every inch of the women’s bodies is critiqued candidly and often, which can be galling, but it’s almost refreshing to hear these narrow constraints articulated so openly. Watch “Toucan Nation,” Wednesday, 10 p. m. Animal Planet. Warning: This doc contains very sad footage of an abused toucan. But Grecia survives! And inspires the nation of Costa Rica! Viva Grecia and his new beak. On Monday at 8 p. m. ESPN2 has “Pin Kings”  —   wrestling, not bowling, alas. It’s the true story of high school wrestling teammates whose lives took different paths: One became a D. E. A. agent, one a cocaine kingpin. On Tuesday at 10 p. m. the tattoo contest show “Ink Master” returns to SpikeTV. And Thursday at 8 p. m. on Logo, it’s the premiere of the new season of “RuPaul’s All Stars Drag Race. ” Get swept up in the drama and passion of the dancers María Nieves Rego and Juan Carlos Copes in the recent Argentine documentary “Our Last Tango. ” Once a renowned couple from the Buenos Aires tango scene, the two split professionally after their marriage fell apart. Now the veteran dancers reflect on their life’s work and tumultuous   relationship before a   reunion. “Our Last Tango” goes a step further than the standard memoir doc, creatively reinterpreting moments from Rego’s childhood and her relationship with Copes into stylish modern and tango dance numbers. Between the couple’s colorful anecdotes and impressive choreography, the movie makes it easy to get caught up in its bittersweet story. (Watch on Netflix)  —   Monica Castillo'"}, "time": 1742563281.8044553}