{"duration": 0.230574369430542, "input_args": {"text": "'Breakdown of the Clinton Money Machine November 12, 2016 \\nAs troubling as Donald Trump’s election may be, it carries greater hope for some positive good than the alternative of Hillary Clinton, who represented a corrupt, money-churning machine, writes John Chuckman. \\nBy John Chuckman \\nBrushing away the extreme claims and rhetoric of much election analysis, there are some observations, which deserve attention and which unfortunately mostly provide hard lessons (and not a lot of encouragement for people who hold to principles of democracy, enlightenment and progressivity). \\nThe election demonstrated perhaps better than ever, and better than has been generally recognized, that America is, indeed, a plutocracy. It took a genuine American oligarch, a self-proclaimed billionaire, a man with a lifetime’s economic empire-building, to defeat a family which could provide the very definition of being politically well-connected, a family which had laboriously constructed and carefully maintained a kind of deep well ever-flowing with money for their ambitions. President Bill Clinton, First Lady Hillary Clinton and daughter Chelsea parade down Pennsylvania Avenue on Inauguration Day, Jan. 20, 1997. (White House photo) \\nIt was the ever-flowing well of money, drilled by Bill Clinton with help from some extremely shady friends, such as Jeffrey Epstein, that made the Clintons keystone establishment figures in the Democratic Party. It was not personal charm or exceptional political generalship – although Bill, in his heyday, displayed some of both of those – that earned the Clintons their place, it was the money, the “mother’s milk of politics.” In what is euphemistically called “fund raising,” many hundreds of millions of dollars were provided for the party over the last couple of decades by Bill Clinton’s efforts. \\nHillary Clinton fully appreciated the fact that money buys power and influence. She lacked Bill’s superficial charm, but she certainly more than shared his ambition. On the charm front, when she was ready to move into running for office, she adopted, perhaps under Bill’s tutelage, a kind of forced set of expressions with arched eyebrows, bugged-out eyes, and a smile as big as her lips would allow. These expressions were accompanied by little gestures such as briefly pointing to various onlookers or waving helter-skelter whenever she campaigned. \\nHer gestures reminded me of something you might see atop a float in a Christmas Parade or of the late Harpo Marx at his most exuberant. These were not natural for her. They were never in evidence years ago when she spent years as a kind of bizarre executive housewife, both in a governor’s mansion and later in the White House, bizarre because she indulged her husband’s non-stop predatory sexual behavior in exchange for the immense power it conferred on her behind the scenes over her far more outgoing and successful politician-husband. \\nMoney Talks \\nAnyway, Hillary knew that gestures and simulated charm do not get you far in American politics. She determined to build a political war chest long ago, and there are many indications over the years of her working towards this end of making this or that change in expressed view, as when running for the Senate, when sources of big money suggested another view would be more acceptable. She was anything but constant in the views that she embraced because when she ran for the Senate she spent record amounts of money, embarrassingly large amounts. U.S. Secretary of State Hillary Clinton meets with Saudi King Abdullah in Riyadh on March 30, 2012. [State Department photo] In her years of speaking engagements, she aimed at special interests that could supply potentially far more money than just exorbitant speaking fees. Later, in the influential, appointed post of Secretary of State – coming, as it does, into personal contact with every head of government or moneyed, big-time international schemer – she unquestionably played an aggressive “pay for play” with them all. It appears that covering up that embarrassing and illegal fact is what the private servers and unauthorized smart phones were all about.\\nA second big fact of the election is that both major American political parties are rather sick and fading. The Republican Party has been broken for a very long time. It hobbled along for some decades with the help of various gimmicks, hoping to expand its constituency with rubbish like “family values,” public prayer in schools and catering to the Christian Right – along with anti-flag burning Constitutional amendments — and now it is truly out of gas. \\nThe Republican Party had been given a breather, some new life, by Ronald Reagan in the 1980s. He had an extremely mixed record as President, but he was popular, held in some affection, and did have a clear vision, but his effect on the party was not lasting. Trump could be seen as another Reagan, but I think the comparison is superficial. Trump literally hijacked the party. He was not deliriously crowned by its establishment. \\nThe Republican Party itself was formed not long before Abraham Lincoln’s candidacy out of the remains of worn out and collapsed predecessors, including the Whigs and Free-Soil Democrats. Parties do not last forever, and here was Trump creating something of a minor political revolution inside a tired and fairly directionless old party, a phenomenon which I do not think was sufficiently noticed. \\nIn the Republican primaries, he was opposed by tired, boring men like Jeb Bush, seeking to secure an almost inherited presidency, and a dark, intensely unlikable, phony Christian fundamentalist like Ted Cruz, and it proved to be no contest. Trump’s capture of the GOP nomination was a remarkable political achievement, but I think it was only possible given the sorry state of the party. \\nThe press was too busy attacking Trump from the start to take notice or do any intelligent analysis, and he was attacked precisely for the potential damage to the Establishment that he represented. His most promising quality was his potential for creating a new coalition of interests and one excluding the continuation of the Neocon Wars that Hillary Clinton embraced and promised to expand. \\nA Democratic Party in Trouble \\nBut the Democratic Party is in serious trouble, too. It has a great deal of internal rot, as the WikiLeaks material from the Democratic National Committee clearly shows us. Arrogance, lack of direction, ignorance of the people whom the party has always claimed to serve, bad decision-making, and the absolute prostrate worship of money are the major symptoms. Sen. Bernie Sanders and former Secretary of State Hillary Clinton at a Democratic presidential debate sponsored by CNN. \\nIt would have been impossible for the party to have so made up its mind and committed its resources to Hillary Clinton without serious rot. She has always had strong negatives in polling, always been (rightly) suspected concerning her honesty. \\nThe WikiLeaks material tells us about many internal conflicts, including harsh high-level judgments of Hillary’s decision-making, resentment over the backstabbing character of daughter Chelsea who is said to resemble Hillary in her behavior and attitudes, and the belief of some that Hillary just should not have run. \\nAnd, frankly, Hillary Clinton had become for many a rather tiresome, used-up figure from whom absolutely nothing spectacular in politics or policy could possibly be expected. But they not only blindly supported her, they broke all their own party rules by internally and secretly working to defeat a legitimate and viable contender, Bernie Sanders. \\nSanders might well have been able to win the election for the Democrats, but their establishment was blind to the possibility and rejected his candidacy out-of-hand. After all, there were Bill and Hillary beckoning toward their running well of money. \\nIn hindsight, it might be just as well that Sanders was cheated out of the nomination. He proved a weak individual in the end, giving in to just the forces that he had claimed to oppose and leaving his enthusiastic followers completely let down. There he was, out on the hustings, supporting everything he ever opposed as personified in Hillary Clinton. Men of that nature do not stand up well to Generals and Admirals and the heads of massive corporations, a quality which I do think we have some right to expect Trump to display. \\nPublic Distrust \\nAnother important fact about the election is that it was less the triumph of Trump than the avoidance of Hillary that caused the defeat. The numbers are unmistakable. Yes, Trump did well for a political newcomer and a very controversial figure, but Hillary simply did badly, not approaching the support Obama achieved in key states, again something reflecting the documented fact that she is not a well-liked figure and the Party blundered badly in running her. President-elect Donald Trump \\nBut again, money talks, and the Clintons, particularly Bill, are the biggest fundraisers they have had in our lifetime. No one was ready to say no to the source of all that money. \\nNow, to many Americans, the election result must seem a bit like having experienced something of a revolution, although a revolution conducted through ballots, any other kind being literally impossible by design in this massive military-security state. \\nIn a way, it does represent something of a revolutionary event, owing to the fact that Trump the Oligarch is in his political views a bit of a revolutionary or at least a dissenter from the prevailing establishment views. And, as in any revolution, even a small one, there are going to be some unpleasant outcomes. \\nThe historical truth of politics is that you never know from just what surprising source change may come. Lyndon Johnson, life-long crooked politician and the main author of the horrifying and pointless Vietnam War, did more for the rights of black Americans than any other modern president. Franklin Roosevelt, son of wealthy establishment figures, provided remarkable leadership in the Great Depression, restoring hopes and dreams for millions. \\nChange, important, change, never comes from establishments or institutions like political parties. It always comes from unusual people who seem to step out of their accustomed roles in life with some good or inspired ideas and have the drive and toughness to make them a reality. \\nI have some limited but important hopes for Trump. I am not blind or delirious expecting miracles from this unusual person, and after the experience of Barack Obama, who seemed such a promising young figure but fairly quickly proved a crushing, bloody disappointment, I can never build up substantial hopes for any politician. And what was the choice anyway? Hillary Clinton was a bought-and-paid one-way ticket to hell. \\nTrump offers two areas of some hope, and these both represent real change. The first is in reducing America’s close to out-of-control military aggressiveness abroad. This aggressiveness, reflecting momentum from what can only be called the Cheney-Rumsfeld Presidency, continued and grew under the weak and ineffectual leadership of Obama and was boosted and encouraged by Hillary as Secretary of State. \\nHillary did a lot of killing during her tenure inside the federal government, advocating and promoting military interventions as First Lady, U.S. Senator and Secretary of State. She along with Obama is responsible for the deaths of tens of thousands of men, women and children, many of them literally torn apart by bombs. \\nWelfare of Americans \\nThe other area of some hope is for the welfare of ordinary Americans who have been completely ignored by national leaders for decades. George W. Bush’s lame reaction to Hurricane Katrina (before he was internationally shamed into some action) has become the normal pattern for America’s national government when it comes to ordinary Americans. President Franklin Delano Roosevelt at a press conference. \\nInside the Democratic Party, the truth is that the legacy of FDR has withered to nothing and no longer plays any role, and of course never did in the Republican Party. By welfare, I do not mean the kind of state assistance to the poor that Bill Clinton himself worked to end. Nothing can impress someone not familiar with America’s dark corners more than a visit to places like Detroit or Gary or Chicago’s South Side, parts of New Orleans, or Newark or dozens of other places where Americans live in conditions in every way comparable to Third World hellholes. \\nNo, I mean the people’s general well-being. Trump’s approach will be through jobs and creating incentives for jobs. I don’t know whether he can succeed, but, just as he asked people in some of his speeches, “What do you have to lose?” Just having someone in power who pays any attention to the “deplorables” is a small gain. \\nPeople should never think of the Clintons as liberal or progressive, and that was just as much true for Bill as it is for Hillary. His record as President – apart from his embarrassing behavior in the Oval Office with a young female intern and his recruitment of Secret Service guards as procurers for women he found attractive on his morning runs – was actually pretty appalling. \\nIn his own words, he “ended welfare as we know it.” He signed legislation that would send large numbers of young black men to prison. He also signed legislation that contributed to the country’s later financial collapse under George W. Bush. He often would appoint someone decent and then quickly back off, leaving them dangling, when it looked like approval for the appointment would not be coming. \\nHis FBI conducted the assault on Waco, killing about 80 people needlessly. A pharmaceutical plant in Sudan was destroyed by cruise missiles for no good reason. There were a number of scandals that were never fully explained to the public. \\nIt was his Secretary of State, Madeleine Albright, who answered, unblinkingly, a television interviewer’s question about a half million Iraqi children who died owing to America’s embargo, “We think the price is worth it.” He committed the war crime of bombing Belgrade, including the intentional destruction of the Serb TV building. When news of the horrors of the Rwanda genocide were first detected by his government, the order secretly went out to shut up about it. No effort was made to intervene in that case. \\nNo, any real change in America could never come from people like the Clintons, either one of them. \\nJohn Chuckman is former chief economist for a large Canadian oil company.'"}, "time": 1742561697.6308458}