{"duration": 0.1007986068725586, "input_args": {"text": "'Democratic leaders of the California legislature have hired former U. S. Attorney General Eric Holder to represent the liberal state in future legal battles with the Trump administration. [“With the upcoming change in administrations, we expect that there will be extraordinary challenges for California in the uncertain times ahead,” California Senate President pro Tempore Kevin de León and California Assembly Speaker Anthony Rendon wrote in a statement Wednesday.  “The Legislature will work with the Governor and our next Attorney General to protect California’s economy and our sensible policies on climate change, health care, civil rights and immigration,” the statement says. “The Legislature has retained the services of an expert legal team from the   Covington  Burling law firm, led by former United States Attorney General Eric H. Holder, Jr. ” Holder, who left the Obama administration in 2015, “will serve as outside counsel to the Legislature, advising us in our efforts to resist any attempts to roll back the progress California has made. ” “I am honored that the Legislature chose Covington to serve as its legal adviser as it considers how to respond to potential changes in federal law that could impact California’s residents and policy priorities,” Mr. Holder said in a statement, the New York Times reports. “I am confident that our expertise across a wide array of federal legal and regulatory issues will be a great resource to the Legislature. ” California lawmakers’ decision to tap Holder, a lifelong Democrat, seems fitting given his public criticism of Trump. In October, Holder called   nominee Trump dangerous for implying he may prosecute Hillary Clinton for using a private email server without permission while she was Secretary of State, and destroying tens of thousands of emails on the server. Be afraid of any candidate who says he will order   to act on his command This is   is @ ’s not qualified,  —   Eric Holder (@EricHolder) October 10, 2016,  Holder called FBI Director James Comey’s   of Clinton’s private email case a “mistake,” and implied Trump’s election was “rigged” because of voter suppression. But perhaps more troubling is that the Covington  Burling law firm, of which Holder is partner, has a history of punishing Republicans and protecting Democrats.   Holder’s tenure in the Obama White House was plagued by scandal, a fact not lost on one California lawmaker. “It is not surprising that California Democrats would hire someone with a record of lawlessness to represent them,” Assemblyman Travis Allen’s wrote in a statement, responding to what he called the California Democrats’ “Fast and Furious” hiring of Holder. “Eric Holder’s major accomplishments as Attorney General was allowing illegal gun running into Mexico with Fast and Furious and then being held in contempt of Congress for refusing to cooperate with the investigation,” said Allen.  “The goal of the California Democrats is clear: an open border with no restrictions on human traffickers, gun runners and drug smugglers. Eric Holder has the record to help them accomplish this goal. ” Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742563783.5383735}