{"duration": 0.13917946815490723, "input_args": {"text": "'Home / Be The Change / War on Drugs / The Real Reason Police Fear Monger About ‘Drug-laced Candy’ on Halloween The Real Reason Police Fear Monger About ‘Drug-laced Candy’ on Halloween William N. Grigg October 26, 2015 2 Comments \\nHalloween looms on the horizon like a rising Harvest Moon, and with its approach comes the perennial onslaught of scare stories about drug fiends trying to poison “The Children.” \\nThe Jackson, Mississippi Police Department was one of many that used their Facebook page to disseminate a warning about Ecstasy pills that were deviously disguised to look like children’s candy. The message contained a photo of what appeared to be an assortment of what appeared to be Pez-style hard candies in various shapes and colors. \\n“If your kids get these for Halloween candy, they ARE NOT CANDY!!!” bellowed the Facebook post , which was composed by someone dangerously addicted to punctuation marks. “They are the new shapes of `Ecstasy’ and can kill kids through overdoses!!! So, check your kid’s candy and `When in doubt, Throw it out!!!’ Be safe and always keep the shiny side up!!!” \\nNo instrument yet invented can measure the infinitesimally small possibility that a child in Jackson would receive Ecstasy or any other drug as part of the Halloween haul. However, parents who follow the police department’s admonition will infect their youngsters with alarm over the supposedly all-encompassing menace posed by fiendish drug addicts who spent considerable sums on expensive drugs that they simply give away to kids whom they will never see again. \\n“Law enforcement agencies across the country have caught people with ecstasy pills shaped like candy,” intoned Memphis CBS affiliate WREG , which also passed along a report from a sister station in Louisville that “a guy got busted last week for having ecstasy pills with Disney characters on them.” Shelby County Sheriff’s deputies contacted by WREG replied to requests for comment about this supposed threat. The Memphis PD insisted that “they have not heard anything about this, but would ask the Organized Crime Unit about it in the morning.” \\nThe families and the police ignore the fact that many ecstasy pill manufacturers mimic pop culture to brand their specific blend of drugs. The “Disney Characters” on pills are little more than that drug dealer’s logo. It is in no way intended to lure unsuspecting children into eating these pills that cost upwards of $30 each. \\nDr. Jon McCullers, Chief Pediatrician at Le Bonheur Children’s Hospital, introduced an element of sobriety into the discussion, endorsing he common-sense notion that “parents have to remain vigilant” while assuring the public that the specter of drug-tainted candy isn’t “on their radar.” \\n“We haven’t seen that here at Le Bonheur,” Dr. McCullers declared. “It [the annual scare over adulterated Halloween candy] goes back to when I was a kid. Everybody worried about that sort of thing.” \\nOne supposedly verified incident of children being given marijuana-infused candy took place not during trick-or-treating, but in a government-controlled, “drug-free” environment: One teenager was arrested and two others may face charges for allegedly giving pot-enhanced Skittles candies to students at the high school in Miller, Missouri. Police were told that five students “ate the tainted candy and their parents were immediately contacted,” according to a report from KY3news.com. \\nSchool superintendent Dustin Strom claims that the “poisoned” candy “has a different color, different look, and a different texture as well.” It’s not clear from available reports, however, that toxicology tests were performed on the candy to confirm that they had been coated with THC (the psychoactive compound in cannabis), and, if this is the case, where the alleged offenders had obtained it. \\nDespite Strom’s assurance that this alleged tampering was “an isolated incident,” the Miller Police Department announced that it will provide “safety checks” on Halloween candy at the request of concerned parents. \\nMoral panic of this kind bubbles up every year in mid-October, and the legalization of marijuana in Colorado and Washington – which can take the form of edibles that resemble brownies, cookies, or candy – has added a new flavor to that familiar witches’ brew. However, as MTV News reported a year ago , “we’ve been to this dance before. The myth of poisoned or drugged Halloween candy has been going around at this time of year since at least the ‘60s. Before marijuana candies, Americans have been scared of everything from heroin to metal shards in their kids’ sugary loot.” \\nDespite this annual outbreak of alarm, “there’s never been a proven case of some random madman intentionally poisoning random trick-or-treaters. In fact, children are more likely to be poisoned by a family member than a stranger around Halloween.” \\n“I have always been skeptical of claims that maniacs try to poison kids’ treats,” observes Joel Best, a professor of sociology and criminology at the University of Delaware. “Why would they do that?” \\nThe implicit answer, from the perspective of those promoting the panic, is that drug fiends are motivated by a sadistic desire to defile childhood innocence. Just as “war on terror” propaganda cultivates a directionless fear of swarthy, savagely bearded foreigners who “hate us for our freedom,” agitprop conducted in the “war on drugs” endlessly recapitulates similar themes put into circulation decades ago by the arch-prohibitionist Harry Anslinger . \\nIn testimony under oath before Congress in 1937, Anslinger insisted: “Marijuana is the most violence-causing drug in the history of mankind.” As head of the Federal Bureau of Narcotics and Dangerous Drugs, Anslinger maintained a “gore file” replete with lurid stories – many of them entirely fictitious — of marijuana-crazed people committing hideous crimes, including rape, murder, and “miscegenation.” Ansligner was endlessly preoccupied with the idea that black people are particularly susceptible to marijuana, and that one particularly acute danger posed by the demon weed was its role in breaking down the barriers against “race-mixing.” \\nThe most important reason to outlaw marijuana, Anslinger insisted, “is its effect on the degenerate races.” Marijuana was nothing less than the drug used to seal the bloody covenants sworn by members of the ancient Order of Assassins, Ansligner tremulously informed a credulous public, and even today it plays a central role in the never-ending plot by dark and devious men who seek to steal the innocence of “Our Children.” \\n“There are 100,000 total marijuana smokers in the US, and most are Negroes, Hispanics, Filipinos, and entertainers,” Anslinger reportedly said on one occasion. “Their Satanic music, jazz, and swing, result from marijuana use. This marijuana causes white women to seek sexual relations with Negroes, entertainers, and any others.” \\nFollowing World War II, after it was documented that marijuana did not promote outbursts of violent, aggressive behavior, Anslinger reversed field entirely. By 1948, he insisted that the same drug that turned men into paranoid, predatory criminals and white women into aggressive sluts would somehow turn young people into weak-willed pacifists unwilling and unable to obey the muster call to take up arms against the Communist Menace. \\nParents whose children participate in trick-or-treating should exercise discretion and supervise them carefully, but they shouldn’t fall prey to officially-promoted urban myths. Practicing adults should know better than to be spooked by the ghost of Harry Anslinger. Share R O M C H O M P A \\nnobody gives drugs away for free. cops are so dumb lol reversalmushroom \\nThe first one’s free. That’s how they get ya. Social'"}, "time": 1742562282.8510985}