{"duration": 0.07660269737243652, "input_args": {"text": "'Although around 500 people excitedly gathered at Union Pub Tuesday morning in Washington, D. C. in anticipation of the live airing of a Senate hearing featuring former FBI Director James Comey, many left disappointed. [At least 50 people were in line before the bar opened at 9:30 a. m. for the 10:00 a. m. Senate intelligence hearing, including unemployed former government officials. A woman standing in line at Union Pub said she looked forward to hearing “Comey tell the truth. ”  But after roughly     hours, people shuffled out, calling it “underwhelming. ” “It’s what I expected, it’s underwhelming, nothing explosive has been revealed so far. James Comey is pragmatic, he’s a Washingtonian who still has a lot of his future career ahead of him. He does not want to create unnecessary conflict,” said one man, who wished not to be named. “The investigation is not a public matter. It is a legal, technical, and professional matter. But people here in DC are turning it into the Super Bowl,” said another man, who also did not want to be named. An office manager at a university named Derek said he was happy that Comey called the President a “liar” but said he wanted some evidence. “I want there to be tapes,” he said. Another man who wished to remain anonymous said he was “hoping to hear more damning testimony, more smoking guns,” but that Comey “phrased things carefully to be accurate. ” One man with a computer wallpaper that said “Impeach Trump” refused to talk to Breitbart. Several people said they hoped more would come out of a closed hearing later in the day, where Comey can discuss classified information. “What we got out of this hearing was an affirmation of what we already knew. Any juicy bombshells will come out of the closed door meetings,” he said. A man named Ben, who is currently unemployed but used to work at the State Department, said that the “best hope” for Trump getting impeached would be the Democrats winning the House, since he doesn’t see Republicans going along with it. But one man, Christopher, who worked at Trader Joe’s, said he was happy with Comey’s performance, despite him not opining on whether there was any obstruction of justice. “Comey was in control, got his message out. He knows it’s not to say whether it’s obstruction. He did what he set out to do,” he said. Another said he came just to “enjoy Comey’s testimony. ” “He’s a rock of integrity,” Tom, a computer science major, said. “He’s willingly testified against and for both sides. ” Another man, Alex, who works in environmental relations for a utility, did not hide his anger. “My take can’t be quoted in a family friendly publication. It shows how   everything is  —   a bunch of senior Republicans abase themselves in a grotesque manner as they run flack for a man they’re covering for him and abasing themselves even though this is national security,” he said. Paul, an Army veteran and Ph. D. student, said there was “something for everyone here. ” “This is just confirmation bias both sides will find stuff that benefits them,” he said. There was only one person, a government affairs intern named Alex, who identified himself as a Republican in the elite DC watering hole. He called the hearing “same old, same old. ” “The only person who effectively pressed Comey was Marco Rubio. I’m not a Trump fanatic, but if he does well, it’s good for the country. We have an issue in this country of unprecedented division,” he said.'"}, "time": 1742561756.3356233}