{"duration": 0.091888427734375, "input_args": {"text": "'WASHINGTON  —   Rudolph W. Giuliani, facing a flood of questions about whether his business dealings should disqualify him from being named   Donald J. Trump’s secretary of state, on Tuesday defended his lucrative 15 years in the private sector as a credential for the job. “I have friends all over the world,” Mr. Giuliani, the former New York mayor, said in an interview. “This is not a new thing for me. When you become the mayor, you become interested in foreign policy. When I left, my major work was legal and security around the world. ” As secretary of state, Mr. Giuliani, a loyal, often ferocious backer of Mr. Trump’s candidacy, would make fighting Islamist terrorism the centerpiece of the incoming administration’s foreign policy. He vaulted to national prominence because of his leadership after the Sept. 11, 2001, terrorist attacks, and he still views foreign policy through the prism of that day. But Mr. Giuliani’s business ties are a major red flag. He built a lucrative consulting and speechmaking career after leaving City Hall. His firm, Giuliani Partners, has had contracts with the government of Qatar and the Canadian company that is building the Keystone XL oil pipeline, and Mr. Giuliani has given paid speeches to a shadowy Iranian opposition group that until 2012 was on the State Department’s list of foreign terrorist organizations. In one year  —   2006  —   Mr. Giuliani reported in a financial disclosure report that he had made 124 speeches, for as much as $200, 000 each, and had earned a total of $11. 4 million. He often made extravagant demands in return for agreeing to make a speech, including that the private plane that flew him to the engagement be a certain size. During the presidential campaign, Mr. Trump repeatedly criticized Hillary Clinton for her speeches to Goldman Sachs, as well as for contributions Qatar made to the Clinton Foundation, which he claimed betrayed her commitment to women’s and gay rights because of Qatar’s poor record on both. This week, Senator Rand Paul, Republican of Kentucky and a member of the Senate Foreign Relations Committee, questioned Mr. Giuliani’s fitness for the job, pointing to his list of paid speeches, his work for foreign governments and his support for the Iraq war. Mr. Trump has long claimed erroneously that he opposed the war. “It is worrisome, some of the ties to foreign governments, because that was a big complaint about many of us with Hillary Clinton and her ties and the money she received from foreign governments,” Mr. Paul told CNN on Tuesday. Mr. Giuliani defended his firm’s work for Qatar  —   which he said included training the Qatari police and analyzing the security of a desalinization plant  —   because, he said, it was done under the previous emir, Sheikh Hamad bin Khalifa   who abdicated in 2013. Mr. Giuliani said he had consulted the State Department about the contracts and had been told that Sheikh Khalifa was friendly toward the United States. Mr. Giuliani said he was one of dozens of prominent Americans who worked for the Iranian opposition group known as the Mujahedeen Khalq, or the M. E. K.  —   drawing payments at the same time it was on a State Department list designating it a terrorist organization. He sought to persuade the State Department to revoke its terrorist listing, which the Americans did in September 2012. “My ties to them are very open,” Mr. Giuliani said. “We worked very hard to get them delisted  —   by Hillary Clinton, by the way. ” Another Giuliani client, the energy company TransCanada, applied to build the Keystone XL pipeline in the United States, and was rejected last year by President Obama after a recommendation by Secretary of State John Kerry. If it decided to apply again for permission and Mr. Giuliani ended up at the State Department, the application would land on his desk. Mr. Giuliani did not address that issue directly in the interview, saying only that his firm had offered security advice to TransCanada, when it had a partnership to build a   facility on Long Island Sound. The proposal was turned down. “I’ve done no work on the pipeline,” he said. His other clients have included a long list of prominent American corporations, including Bear Stearns, Uber and CB Richard Ellis, the real estate giant. Under contract with Purdue Pharma, the maker of the   painkiller OxyContin, Mr. Giuliani used his clout with the Justice Department to press the federal authorities to offer a less onerous punishment to the company after allegations that security problems at its warehouses might have contributed to black market sales. But it is the   names that may draw the most scrutiny. TriGlobal Strategic Ventures, a company that aims to “assist Western clients in furthering their business interests in the emerging economies of the former Soviet Union,” according to its website, is among the more obscure clients. Records show Mr. Giuliani has had ties dating to at least 2004 to TriGlobal, a company that has provided image consulting to Russian oligarchs and clients with deep Kremlin ties. They have included Transneft, Russia’s   oil pipeline giant, which is the target of Western sanctions imposed after President Vladimir V. Putin annexed Crimea and began meddling in Ukraine. TriGlobal’s advisory board includes Ara Abramyan, listed on the company’s website as a “very close Advisor to the Russian Government’s inner circle including the President and the Prime Minister. ” The company’s founding partners are Andrey Drobyshev, who claims to have strong relations with regional and municipal governments in Russia, and Vitaly Pruss, whose website profile says that he has focused on “international image development and PR for Russian  Ukrainian companies” and that from 2008 to 2011, he worked “closely with Giuliani Partners LLC. ” Jeffrey Berman, one of TriGlobal’s managing partners, is also vice president of Berman Enterprises, a   company that worked with Giuliani Partners in 2008 to form a commercial and residential real estate investment vehicle called the Berman Opportunity Fund. Its purpose was to target foreign investors looking to take advantage of the weak dollar through real estate investments in New York and Washington. Few public details are available about Mr. Giuliani’s role in the real estate venture, and Mr. Berman did not return a call for comment. But some of Mr. Giuliani’s work for TriGlobal, which has offices in Moscow and Kiev, Ukraine, is featured on the company’s website. In 2004, for instance, the company arranged to have Mr. Giuliani come to Moscow to meet with the foreign minister, Sergey V. Lavrov, as well as other prominent Russian politicians and business executives. That year, Mr. Giuliani visited Magnitogorsk, Russia, “for a series of meetings with Viktor Rashnikov,” a Russian billionaire who is the chairman of the Magnitogorsk Iron and Steel Works. While Mr. Trump has vowed to bring back jobs in the United States steel industry, Russia has complained about American tariffs on steel that hurt companies like Mr. Rashnikov’s. TriGlobal also arranged for Mr. Giuliani to meet with executives from the Russian steel company in the next year in New York, where they dined at the St. Regis hotel at an event attended by Bill Clinton. In 2015, also at the company’s behest, Mr. Giuliani agreed to advise the mayor of Kiev, Vitali Klitschko, who has called for more Western support of the Ukrainian government’s efforts to combat Russian separatists. James A. Thurber, the director of the Center for Congressional and Presidential Studies at American University, said Mr. Giuliani’s consulting work over the last 15 years should disqualify him from taking the secretary of state job. “It creates an immediate conflict of interest with leaders of nations that he has worked with,” Mr. Thurber said. “People asked about Hillary Clinton and donations to Clinton Foundation. It is very different than being paid directly by foreign countries to represent them. ” Mr. Giuliani, in the Tuesday interview, acknowledged that he did not view the world exactly as Mr. Trump does. He said he regarded Mr. Putin, whom Mr. Trump has praised, as “a guy who is pushing us very hard,” adding: “I think he needs to be pushed back. I wouldn’t want to put Russia in the category of enemy  —   yet. ” “Donald Trump is not going to pick anyone who agrees with him 100 percent,” Mr. Giuliani said. He said, however, that he could not think of any disagreements with Mr. Trump’s closest foreign policy adviser, Lt. Gen. Michael T. Flynn, who shares Mr. Giuliani’s belief that Islamist militancy poses an existential threat. If General Flynn becomes Mr. Trump’s national security adviser, the Trump administration will almost certainly revive George W. Bush’s global war on terrorism. “In my case, it might have some extra emotion because of Sept. 11,” Mr. Giuliani said. In one respect, experts said, Mr. Trump would be different from Mr. Bush. While Mr. Bush thought a lack of freedom caused jihadist terrorism to spread, Mr. Trump and Mr. Giuliani believe the fault lies in Islam itself. “It is a sea change, and it really changes the terms of the discussion about what to do about it,” said William McCants, a senior fellow at the Brookings Institution and the author of “The ISIS Apocalypse. ”'"}, "time": 1742628549.6709423}