{"duration": 0.31822824478149414, "input_args": {"text": "'Home » Gold » Gold Miners » Gold Stocks’ Winter Rally \\nThe gold miners’ stocks have certainly had a wild ride this year. After initially skyrocketing out of deep secular lows into a mighty new bull market, they recently suffered a massive correction climaxing in an extreme plummet. This coincided with gold stocks’ major seasonal low in October. That heralds their strongest seasonal rally of the year heading into and through winter, a very bullish omen for coming months. \\nBuy 2017 Silver Pandas at the Best Price Online \\nSubmitted by Adam Hamilton, Zeal: \\nGold-stock performance is highly seasonal , which certainly sounds odd. The gold miners produce and sell their metal at relatively-constant rates year-round, so the temporal journey through calendar months should be irrelevant. Based on these miners’ revenues, there’s no reason investors should favor them more at certain times of the year than others. Yet history proves that’s exactly what happens in this sector. \\n\\nSeasonality is the tendency for prices to exhibit recurring patterns at certain times during the calendar year. While seasonality doesn’t drive price action, it quantifies annually-repeating behavior driven by sentiment, technicals, and fundamentals. We humans are creatures of habit and herd, which naturally colors our trading decisions. The calendar year’s passage affects the timing and intensity of buying and selling. \\n\\nGold stocks exhibit strong seasonality because their price action mirrors that of their dominant primary driver, gold. Gold’s seasonality isn’t driven by supply fluctuations like grown commodities experience, as its mined supply remains pretty steady all year long. Instead gold’s major seasonality is demand-driven , with global investment demand varying dramatically depending on the time within the calendar year. \\n\\nThis gold seasonality is fueled by well-known income-cycle and cultural drivers of outsized gold demand from around the world. And the biggest seasonal surge of all is just now getting underway heading into winter. As the Indian-wedding-season gold-jewelry buying that fuels this metal’s big autumn rally winds down, the Western holiday season is ramping up. The holiday spirit puts everyone in the mood to spend money. \\n\\nMen splurge on vast amounts of gold jewelry for Christmas gifts for their wives, girlfriends, daughters, and mothers. The holidays are also a big engagement season, with Christmas Eve and New Year’s Eve being two of the biggest proposal nights of the year. Between a quarter and a third of the entire annual sales of jewelry stores come in November and December! And jewelry historically dominates overall gold demand. \\n\\nAccording to the World Gold Council, jewelry accounted for 58% of total global gold demand in 2014 and 57% in 2015. That works out to about 4/7ths of annual gold demand. The first half of 2016 proved a historic exception, as gold investment demand trumped jewelry demand for two consecutive quarters for the first time ever . Nevertheless jewelry demand still ran 40% even in H1’16’s young investment-driven gold bull. \\n\\nThis outsized Western jewelry buying heading into winter shifts to pure investment demand after year-end. That’s when Western investors figure out how much surplus income they earned during the prior year after bonuses and taxes. Some of this is plowed into gold in January, driving it higher. Finally the big winter gold rally climaxes in late February on major Chinese New Year gold buying flaring up over there. \\n\\nSo during its bull-market years, gold has always tended to enjoy major winter rallies driven by these sequential episodes of outsized demand. Naturally the gold stocks follow gold higher, amplifying its gains due to their great profits leverage to the gold price. Today gold stocks are once again just heading into their strongest seasonal rally of the year driven by this robust winter gold demand . That’s super-bullish. \\n\\nSince it’s gold’s own demand-driven seasonality that fuels the gold stocks’ seasonality, that’s logically the best place to start to understand what’s likely coming. Price action is very different between bull and bear years, and gold is absolutely in a new bull market . Between the 6.1-year secular low it suffered in mid-December and early July, gold powered 29.9% higher easily exceeding that +20% new-bull threshold. \\n\\nGold’s last mighty bull market ran from April 2001 to August 2011, where it soared 638.2% higher! And while gold consolidated high in 2012, that was technically a bull year too since gold just slid 18.8% at worst from its bull-market peak. Gold didn’t enter formal bear-market territory at -20% until April 2013, thanks to the crazy stock-market levitation driven by extreme distortions from the Fed’s QE3 bond monetizations. \\n\\nSo the modern bull-year seasonality relevant to this new bull year of 2016 ran from 2001 to 2012 , before the Fed-induced bear-market years between 2013 to 2015. This first chart distills down gold’s bull-year seasonal tendencies by averaging gold prices indexed within each calendar year. This methodology is essential because it renders price percentage moves perfectly comparable despite differing prevailing gold prices. \\n\\nGold’s close on the final day of each preceding year is recast at a level of 100, with all the following year’s daily gold closes indexed off that. An indexed level of 110 simply means gold is up 10% year-to-date at that point. Each calendar year’s individually-indexed gold prices are then averaged together to arrive at this gold-bull seasonality. Gold has always had a strong tendency to enjoy major winter rallies . \\n\\nDuring its last bull-market years from 2001 to 2012, gold’s major winter rally started on average in late October . Technically gold’s major seasonal bottom averaged being carved on that month’s 16th trading day, which happened to be October 24th this year. From there gold surges into its strongest seasonal rally of the year. Between late October and late February in its last bull years, gold blasted 10.1% higher on average! \\n\\nThese big winter-rally seasonal gains are much larger than the 4.3% and 7.5% averages seen in gold’s other major seasonal rallies in spring and autumn! That makes late October one of the best times of the year to deploy capital into gold. That Western holiday gold-jewelry buying fuels such outsized demand that November has long proved gold’s best calendar month of the year with average bull-year gains of 4.0%. \\n\\nWhile this bullish gold seasonality really moderates in December with an average 0.8% bull-year gain, it soon accelerates again in January on that surplus-income gold investment buying. The 2.7% average gain gold enjoyed in January during those bull years between 2001 to 2012 makes for this metal’s third best month of the calendar year. This winter-rally span is when gold enjoys its peak seasonal tailwinds . \\n\\nUnfortunately the great majority of speculators and investors remain wary of deploying into gold to ride its strong seasonal winter rally. Just like last year, the former are terrified of the next Fed rate hike once again arriving in mid-December. Gold-futures speculators in particular have spent recent years fooling themselves into believing Fed rates hikes are gold’s mortal nemesis, despite history proving that totally false . \\n\\nThe record is crystal-clear, gold actually thrives during Fed-rate-hike cycles! Before today’s there have been 11 since 1971, and gold has averaged impressive 26.9% gains across the exact spans of all these Fed-rate-hike cycles. In the majority 6 of these where gold actually rallied, its average gains were a staggering 61.0%! In the other 5 where gold retreated, its average losses were an asymmetrically-light 13.9%. \\n\\nGold blasted higher during Fed-rate-hike cycles when they started with gold relatively low and unfolded at a gradual pace. Gold not only entered today’s current farce of a rate-hike cycle at major secular lows, the Fed under uber-dove Janet Yellen has never been slower in raising rates. With at least an entire year between hikes, it’s hard to imagine any more gradual. This snail-like rate-hike setup is very bullish for gold . \\n\\nDuring its last rate-hike cycle between June 2004 to June 2006, the FOMC hiked at 17 consecutive meetings for a total of 425 basis points! That more than quintupled the federal-funds rate to 5.25%, an inconceivably-high level today. Even though that was an extremely-aggressive rate-hike cycle, gold still managed to power 49.6% higher over that exact span! Rate hikes are no threat to gold’s strong winter seasonals. \\n\\nMeanwhile investors remain distracted by the Fed’s ludicrous stock-market levitation, which is retarding gold investment demand. When stock markets remain near record highs and drenched in complacency, investors aren’t interested in prudently diversifying into gold. Since gold tends to move counter to the stock markets , investment demand only surges when stocks weaken. That’s what ignited 2016’s gold bull. \\n\\nAs the Fed’s surreal stock-market levitation cracked early this year, American stock investors flocked to gold via shares in the flagship GLD SPDR Gold Shares gold ETF. When they buy its shares faster than gold itself is being bought, this ETF’s managers must issue sufficient new shares to offset all this excess demand and maintain gold tracking. The proceeds from these GLD-share sales are used to buy gold bullion. \\n\\nThus GLD holdings builds show stock-market capital migrating into gold . In Q1’16, GLD’s enormous 176.9-metric-ton build represented an incredible 80.6% of total worldwide demand growth in gold year-over-year. In Q2’16, GLD’s 130.8t build accounted for a colossal 93.6% of the total global increase in gold demand! The reason gold’s bull stalled in Q3’16 is because GLD’s holdings actually suffered a 2.1t draw. \\n\\nWhen these lofty Fed-levitated stock markets inevitably roll over again, differential GLD-share buying will surge again for prudent portfolio diversification into gold. That will really add to gold’s strong winter seasonals, amplifying its rally in the coming months. And gold’s strongest seasonal rally doesn’t even need to be kick started by GLD demand resuming, as it relies on November’s strong holiday gold-jewelry demand. \\n\\nSo neither speculators’ Fed-rate-hike fears nor investors’ current apathy towards gold thanks to near-record stock markets are likely to short circuit gold’s strong winter rally this year. And if gold’s bull-market seasonals again prevail, that’s super-bullish for gold stocks in the coming months. They also enjoy strong winter seasonals thanks to gold’s, because gold miners’ profitability and thus stock prices leverage gold’s price action. \\n\\nThis next chart applies this same bull-market-seasonality methodology to the leading benchmark HUI NYSE Arca Gold BUGS Index. Naturally gold-stock seasonals closely mirror gold’s, so the miners are also just entering their strongest seasonal rally of the year . On average in those last bull-market years from 2001 to 2012, the HUI powered a whopping 15.9% higher between late October and late February! \\n\\nGold stocks’ strong 15.9% average winter rally bests their 13.7% and 15.0% rallies heading into spring and autumn. On average gold stocks’ major seasonal bottoming heading into their winter rally arrives on October’s 15th trading day, which translates into October 21st this year. Like their primary driver gold, gold stocks tend to rally strongly in November, moderate in December, and then surge again in January and February. \\n\\nAnd given the sentimental, technical, and fundamental setups for gold stocks entering this year’s winter rally, the usual seasonal tailwinds are likely to help propel them much farther than usual . Just like gold and because of it, gold stocks entered a mighty new bull market early this year as well. Between mid-January and early August, they skyrocketed 182.2% higher in just 6.5 months! It was a wildly-profitable run. \\n\\nThat left gold stocks overbought in the middle of summer, their weakest time of the year seasonally. So as I warned in early July, gold stocks’ record summer surge soon rolled over into a major correction. That quickly ballooned to massive proportions exceeding 20%, the threshold for new bear markets in general stocks. Then gold stocks started grinding higher again in September, but were slammed by gold futures in October. \\n\\nEarly this month the HUI plummeted 10.1% in a single trading day, one of its worst losses ever, after gold-stock stops were run. That was sparked by cascading forced stop-loss selling in gold futures as gold slipped below $1300. By the time the dust settled, the gold stocks’ total correction per the HUI had mushroomed to a staggering 30.9% in 2.2 months! Such an enormous selloff naturally spawned great bearishness. \\n\\nSo the gold stocks are now entering their seasonally-strongest period of the year universally despised and very low technically . These are screaming buy signals within ongoing bull markets, greatly upping the odds gold stocks’ next major upleg is just getting underway. Add the winter rally’s strong seasonal tailwinds to exceptionally-bullish sentiment and technicals, and gold stocks’ coming gains should prove exceptional. \\n\\nThe gold miners’ fundamentals also powerfully line up with the winter seasonal strength this year, really boosting the bullish outlook. These companies’ third-quarter operating results will be fully released by mid-November. And they are highly likely to reveal more big gains in operating profits despite gold’s recent weakness. Improving gold-mining fundamentals will entice in more investors, magnifying seasonal gains. \\n\\nGold averaged $1185 in Q1’16 and $1259 in Q2’16. That 6.3% quarter-on-quarter gain in average gold prices led to enormous surges in operating profitability of the elite gold miners. They are represented by the leading gold-stock ETFs, the GDX VanEck Vectors Gold Miners ETF for the majors and its sister GDXJ VanEck Vectors Junior Gold Miners ETF for the juniors. These ETFs’ component stocks are excellent. \\n\\nEach quarter I analyze the operating performances of the individual gold stocks included in these top ETFs. Their cash flows generated from operations are a great proxy for current profitability. In Q2’16 on that 6.3% average-gold-price increase, the top 34 component companies of GDX saw their operating cash flows surge 32.3% higher quarter-on-quarter. And GDXJ’s skyrocketed an incredible 51.1% higher QoQ! \\n\\nQ3’16’s average gold price climbed another 6.0% QoQ from Q2 to $1334, despite gold’s big recent pullback. So those elite gold miners of GDX and GDXJ are very likely to soon report another major surge in operating profitability! It wouldn’t surprise me to again see big gains approaching Q2’s, which would certainly spark great trader interest. Improving fundamentals aligning with seasonals portends big upside. \\n\\nIf the gold stocks were entering this winter-rally period drenched in greed after a powerful upleg, the seasonal tailwinds probably couldn’t overcome the healthy correction tendency. If the gold miners’ fundamentals were deteriorating, that would likely prove too much heavy lifting for seasonals. But with the strong winter-rally seasonals aligning with very bullish sentiment, technicals, and fundamentals, gold stocks should surge. \\n\\nThis last chart breaks down gold-stock seasonality into more-granular monthly forum. Each calendar month between 2001 to 2012 is individually indexed to 100 as of the previous month’s final close, and then all like calendar months’ indexes are averaged together. While this November-to-February winter-rally period doesn’t encompass most of gold stocks’ strongest months, it does enjoy the most-consistent gains . \\n\\nOn average in bull-market years, November enjoys the third-best gold-stock gains of the calendar year at 6.3% in HUI terms. That’s not far off the best months of May and August, which have averaged rallies of 6.9% and 6.7%. But unlike the flat-or-lower months surrounding those other strong months, November is followed by December’s 2.3%, January’s 2.7%, and February’s 3.5% average bull-market-year gains. \\n\\nThis unparalleled consistency is what makes gold stocks’ winter-rally seasonals so impressively strong. Continuing to march higher on balance ultimately yields better upside than the two-steps-higher-one-step-back action throughout the rest of the calendar year. There are no significant gold-stock selloffs in seasonal-average terms at all between November and February, which facilitates exceptional winter gains. \\n\\nOf course the standard seasonality caveat applies that these are mere tendencies , not primary drivers of gold or gold stocks. Seasonal tailwinds can be easily drowned out by bearish sentiment, technicals, and fundamentals. May and August this year are perfect cases in point. Instead of rallying 6.9% and 6.7% in line with seasonal averages in 2016, the HUI plunged 13.8% and 19.2% in May and August to shred seasonals! \\n\\nSeasonality doesn’t always work, especially when it doesn’t align with the primary drivers of sentiment, technicals, or fundamentals in that order. Gold stocks entered both May and August this year up at very-overbought levels, at new bull-market highs stretched far above the HUI’s 200-day moving average. After rocketing 31.0% higher in April and surging up 11.2% in July, performance mean reversions were due. \\n\\nGold stocks’ resulting massive correction in August bucked the seasonal trends. While September saw a 4.3% HUI gain in line with normal +4.8% bull-market seasonality, early October’s plummet on stops being run was extremely excessive compared to normal October pullbacks. Thus gold stocks are unloved and oversold heading into this year’s winter-rally span, which is a super-bullish omen for outsized seasonal gains . \\n\\nThe serious gold-stock upside coming as bullish sentiment, technicals, and fundamentals align with seasonal tailwinds can certainly be played with those popular GDX and GDXJ ETFs. But because they hold so many gold stocks, their gains can only pace the HUI at best. A carefully hand-picked portfolio of elite individual stocks with superior fundamentals will really amplify sector gains, dwarfing the ETFs’ performances. \\n\\nAt Zeal we’ve spent literally tens of thousands of hours researching individual gold stocks and markets, so we can better decide what to trade and when. This has resulted in 851 stock trades recommended in real-time for our newsletter subscribers since 2001. Their average annualized realized gains including all losers are running way up at +24.1% as of the end of Q3! Why not put our expertise to work for you? \\n\\nWe’ve been super-aggressively adding gold-stock and silver-stock trades since that anomalous gold-stock plummet in early October. These new trades are already detailed in our popular weekly newsletter, and coming soon in our monthly one. Both draw on our vast experience, knowledge, wisdom, and ongoing research to explain what’s going on in the markets, why, and how to trade them with specific stocks. Subscribe today! For just $10 an issue, you can learn to think, trade, and thrive like a contrarian. \\n\\nThe bottom line is gold stocks are just entering their seasonally-strongest period of the year. Their big winter rally is fueled by gold’s own, which is driven first by outsized demand from holiday jewelry buying and later new-year investment buying. So both the metal and its miners’ stocks have strong tendencies to rally between late October and late February in bull-market years. It’s the best calendar span to own gold stocks. \\n\\nAnd this year’s coming winter rally looks exceptionally bullish because the seasonal tailwinds won’t be overpowered by bearish sentiment, technicals, or fundamentals. All of these primary drivers are bullish today and closely aligned with the strong seasonals, making for a powerful united force to propel gold stocks dramatically higher. Speculators and investors alike should be fully deployed for the coming months. \\nAdam Hamilton, CPA On Sale At SD Bullion… This Week Only…'"}, "time": 1742628405.3302188}