{"duration": 0.06853199005126953, "input_args": {"text": "'Rachel L. Lindsay, a    lawyer from Texas, will be the first   lead on “The Bachelorette,” 14 years after the show, a spinoff of “The Bachelor,” debuted on television. The decision was announced Monday night on “Jimmy Kimmel Live!” Ms. Lindsay, a contestant on the current season of “The Bachelor,” appeared on the Kimmel show to accept a rose from the host. “I’m ready to find love, find a husband,” she said, adding that she was looking for a partner who was ready to start a family. Ms. Lindsay received a law degree from Marquette University in 2011 and is a personal injury lawyer at the Dallas firm Cooper  Scully. Mr. Kimmel’s show airs on ABC, the network that broadcasts “The Bachelor” and “The Bachelorette. ” In both shows  —   “The Bachelor” began in 2002 and “The Bachelorette” a year later  —   contestants vie for the affections of the lead. Neither show has had a black lead, though several   and women of Asian and Iranian ancestry have appeared as contestants. One Hispanic man has been the bachelor. As the seasons have worn on, news outlets, fans and public figures including Whoopi Goldberg have criticized the show for the omission. The blogger Stephen Carbone, who has been digging up “Bachelor” scoops on his website RealitySteve. com for more than a decade, first reported the news on Monday. The final episode of the current season of “Bachelor” is scheduled to air next month. As Mr. Kimmel pointed out, the announcement that Ms. Lindsay is setting out on a new quest for love suggests that the current season doesn’t end well for her  —   a possibility that Ms. Lindsay greeted with a shrug. “We’re ready to get this started,” Ms. Lindsay said of the new season, and the next quest: “If you know anybody out there who needs to apply, sign up, go ahead and get it started. ” Asked on “Good Morning America” on Tuesday if she felt pressure from the distinction of being the first black lead, she replied: “I don’t feel added pressure. ” “I’m honored to have this opportunity and to represent myself as an   woman and I just hope that people rally behind me like they did in Nick’s season,” she added, referring to Nick Viall, the current “Bachelor” lead. “Even though I’m an   woman, it’s not different from any other bachelorette. ” Mr. Viall, for his part, wrote on Instagram: “Saying goodbye to Rachel was one of the most heartbreaking moments of my life. I have met very few people who possess as much beauty, grace, and charisma as Rachel and after hearing that she’ll be the next Bachelorette I couldn’t be more excited. ”'"}, "time": 1742563856.055671}