{"duration": 0.05996584892272949, "input_args": {"text": "'Leave a reply Mike Adams – Under FBI head James Comey, who has deliberately and clearly conspired to cover up the enormous number of crimes committed by Hillary Clinton and her closest staffers, the FBI’s investigation of additional emails is now concluded. “We have not changed our conclusions that we expressed in July with respect to Secretary Clinton,” Comey announced today. \\nWith this decision, James Comey essentially announces that the tyranny of criminal government in Washington is now complete . \\nThe rule of law has just been declared null and void by the head of the FBI. No sufficiently powerful person in Washington will ever be held accountable for their crimes… including crimes of treason against the nation, bribery, corruption, destruction of evidence and selling government influence. \\nUnless something reverses very quickly, the FBI has now cemented its position as nothing more than a corrupt branch of a totalitarian criminal regime that has seized power in Washington to protect the criminal class of political elitists who rule over the nation as lawless tyrants. \\nNow, it’s up to rogue FBI agents or the NYPD to go public with the evidence they have and expose the horrifying truth about what the Clintons really are, pedophilia and all. If that fails, my analysis says we may see a rapid ramping up of real talk of open revolt , perhaps even leading to an armed citizens’ march on Washington to depose the criminal regime in power. As I’ve pointed out before, that effort would only require a few thousand armed citizens to achieve the occupation of key government buildings and the overthrow of the criminals in power. Sadly, it would also involve tremendous bloodshed and loss of life. (Let’s hope it doesn’t come to that.) \\nHere’s the letter James Comey sent out today: I write to supplement my October 28, 2016 letter that notified you the FBI would be taking additional investigative steps with respect to former Secretary of State Clinton’s use of a personal email server. Since my letter, the FBI investigative team has been working around the clock to process and review a large volume of emails from a device obtained in connection with an unrelated criminal investigation. During that process, we reviewed all of the communications that were to or from Hillary Clinton while she was Secretary of State. Based on our review, we have not changed our conclusions that we expressed in July with respect to Secretary Clinton. I am very grateful to the professionals at the FBI for doing an extraordinary amount f high-quality work in a short period of time. Source: UK Daily Mail . SF Source Natural News  '"}, "time": 1742561951.725946}