{"duration": 0.07387733459472656, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. President Obama has offered Israel the largest package of military aid the U. S. has ever proposed to any nation, but the Israelis have asked for a more generous plan. The package, possibly more than $40 billion over 10 years, is meant to replace the current $3 billion a year, which expires in 2018. Israel says the Iran nuclear deal has intensified its security challenges. _____ 2. “Lucifer in the flesh. ” “I have never worked with a more miserable son of a bitch in my life. ” That was the former House Speaker John Boehner, revealing the depth of his antipathy for the Republican presidential candidate Ted Cruz. Mr. Cruz responded that Mr. Boehner had “allowed his inner Trump to come out. ” He said the comments validated his own standing as a maverick in Washington. _____ 3. Donald Trump’s sweep of five primaries this week added so significantly to his delegate count that he may not even need to win Indiana next week. He is estimated to have won 110 of the 118 pledged delegates at stake on Tuesday, and appears to have claimed about 40 of Pennsylvania’s unpledged delegates. Check out the numbers in our updated delegate counter. _____ 4. One of our   articles today looks deeply at President Obama’s handling of the economy. In a series of conversations with one of our top business reporters, Mr. Obama reveals frustration with Republican criticism that ignores gains, including the longest period of sustained job growth on record. When people hear “that things are terrible all the time,” Mr. Obama said, “then people will start absorbing that. ” _____ 5. Round 1 of the N. F. L. draft started tonight at 8 p. m. Eastern (ESPN and NFL Network). Chicago plays host for the second straight year. The Los Angeles Rams led off by picking the quarterback Jared Goff of California, and the New England Patriots won’t get to pick till Friday as part of their Deflategate punishment. Our live coverage is here. _____ 6. Two female journalists have jolted the sports world with a   video revealing the kind of messages they regularly receive  —   read aloud by male friends staggered by the viciousness. Examples: “You need to be hit in the head with a hockey puck and killed,” and “I hope you get raped again. ” Our columnist, who has received many similar messages, asks: “So much hate. And for what?” _____ 7. Mayor Bill de Blasio of New York is under scrutiny in five investigations by federal, state and local agencies. Most involve   linked to the mayor, his election campaign or a nonprofit group connected with him. “I can’t recall any other sort of perfect storm like this, coming from all those different angles,” a historian said of the welter of inquiries. _____ 8. China became the latest country to sharply restrict the operations of nongovernmental groups, fearing their power to undermine authoritarian rule. A new law requires some 7, 000 such groups to find an official sponsor and register with the police  —   serious obstacles for those that promote workers’ rights, ethnic equality or religious freedom. _____ 9. That’s it for DreamWorks Animation, maker of “Kung Fu Panda,” “How to Train Your Dragon” and “Shrek. ” Hollywood’s smallest publicly traded studio ended 12 years of turbulent independence with a deal to sell itself to Comcast’s giant NBCUniversal. Jeffrey Katzenberg, the founding chief executive, is expected to pocket nearly $400 million of the $3. 8 billion deal. U. S. stocks fell. Apple logged a second day of losses, helping drag down tech stocks, and energy stocks tumbled despite a gain in the price of oil. _____ 10. Syria’s partial truce shattered as the northern city of Aleppo plunged back into   war. Government airstrikes destroyed a hospital, and rebels counterattacked with mortars. Vice President Joe Biden traveled to neighboring Iraq, hoping to pull that country’s political leadership out of its latest crisis and strengthen the fight against the Islamic State. _____ 11. One of the first women to graduate from the Army’s elite Ranger school is now qualified to lead troops into combat. Capt. Kristen Griest, above right, finished a final course, breaking another barrier to full service. “We are at a time and a place in the world where we need to have the best leaders from everywhere,” an Army spokesman said, “and that includes women. ” _____ 12. Finally, Happy Ed Balls Day. Britain has been celebrating its Twitter joke for five years, ever since a political official named Ed Balls inadvertently posted his name on the platform. Mr. Balls, pictured above in a typically   moment last year, has taken the joke in stride. “It’s as incomprehensible as the Internet and social media can get, but people enjoy it,” he said. “I shrug my shoulders. ” _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742561954.1995056}