{"duration": 0.04991888999938965, "input_args": {"text": "'Tweet \\nIn this guest post for The UnReal Times, Rajdeep Sardesai explains why Indian journalists have a reason to be proud of themselves. \\nIt may be a sad day for Indian journalists given than Donald Trump won the presidency. But look at the brighter side. We have reasons to be proud. \\nAbout 52% of British voters voted to leave the European Union and about 47% of Americans voted to elect Donald Trump as president while only about 30% Indians voted Narendra Modi for Prime Minister. \\nDespite this Indian journalists at least asked whether there was a Modi wave and at least saw Modi becoming PM after the exit polls, albeit with a smaller majority than the actual results. \\nBritain is a small country and so excuses like the tyranny of distance do not hold. Also, Americans got the results on the tyranically distant east coast and the west coast right but missed the results from the rural heartland completely. \\nFurther, in India every state is potentially a swing state wheres in the US, the journalists only had to analyze a few swing states to analyze the poll outcome, a task they failed at. \\nThe American and British journalists have clearly lost their moral compass. \\nIf journalists had just travelled across the country and tried Key Lime Pie in Florida, Pulled Pork Sandwich in North Carolina, Cheesesteaks in Pennsylvania, Buckeyes in Ohio and Grilled Sweet Corn on the Cob in Iowa, they would have got a better sense of which way the elections were going. \\nYou cannot shut down people’s opinions by your intellectual arguments. You have to engage people, debate, occasionally fist fight to get a sense of what is happening, even against people who may or many not have paisa and class. \\nThis is where the American journalists failed. \\nThe American media has not done its homework responsibly. Even when elections were less than a month away, we were still seeing skeletons tumbling out of the closet like Trump’s offensive remarks about women and FBI’s reopening and closing investigations about Hillary Clinton’s private email server. What was the media doing all this while? How did these 2 candidates get this far? In India, we rigorously investigated every aspect of our prospective prime minister before he even was in the reckoning for the post of the prime minister. \\nIndian journalists do not need to give explanation to their readers like The New York Times had to do because we are neutral. \\nAs the world is bewildered by this resullts, I am writing a new book for their benefit titled “2016 – Elections that changed America”. Remember to preorder your copy. \\nGood night, Shubh ratri.'"}, "time": 1742564056.1265426}