{"duration": 0.08537936210632324, "input_args": {"text": "'  advocates have begun boycotting scheduled “stakeholder” meetings with immigration agency officials after the officials also invited   reform advocates according to CNN. [“We are frustrated and angry that what [has] felt like a productive conversation and an exchange of ideas and information about how to ensure the safe and fair treatment of immigrants in their [Immigration and Customs Enforcement] custody has morphed into a meeting with organizations whose mission is to restrict immigration,” one   advocate told CNN.   “Immigrants’ rights organizations have since notified ICE that they have dissolved the   Working Group and will no longer participate in the quarterly gatherings,” CNN said.  “It is not a surprise  —   they can’t tolerate anyone there that doesn’t agree with them” responded Mark Krikorian, director of the Center for Immigration Studies. “They figure they owned those meetings and the fact is now that they don’t, so they’re having a tantrum. ” Since the new administration arrived, Krikorian said he was invited to attend one ICE stakeholder meetings with the   groups. “It was just kind of a general information thing about what’s going on, what’s new with regard to ICE [policies on] detention, removal and all that,” he said.  Immigration advocates mostly “sat on one side of the table   …     we sat on the other side of the table,” he said, adding “one of them even kind of joked about it [although] it was not like there was some kind of icy atmosphere in the room. ” During the Obama administration, the   groups used the stakeholder meetings to lobby and pressure agencies, and to cooperate on shared goals. In 2010, for example, ICE officials used one of the meetings to ask   groups to collect complaints about ICE’s actions, according to a posting by a group titled “Stop Detaining Immigrants. ” ICE has informed members of the   Working Group   …      ICE has asked that NGOs provide to them complaints that we are seeing around the country specifically on issues that demonstrate that IGSA facilities are not currently meeting the baseline requirements   …      In order to respond to ICEs request for complaints data, we would like to provide examples of violations of detention standards to present a national overview of some of the more egregious violations for the snapshot period of January 1, 2010 to March 2010. Before Donald Trump’s election,   groups were invited to only a few of the events scheduled by Obama’s appointees.  Obama’s officials at the Department of State ended meetings with the   advocacy groups once the   groups managed to bypass bureaucratic barriers to get into the national and regional meetings, said Ann Corcoran, the director of Refugee Resettlement Watch. In 2016, for example, the main meeting in D. C. was canceled, and opponents of   refugee inflows were allowed only to submit recommendations that were never released, she said.  “The stakeholder meetings that the refugee industry has [with agency officials] are really keep very secretive,” she said. “They love to have stakeholder meetings [about refugees] and I’ve never gotten wind of them,“ Krikorian said.  The new boycott against the agencies comes alongside complaints by   groups about the administration’s hiring of two immigration experts formerly employed at   reform groups. According to CNN: Two   opponents of illegal immigration have obtained   advisory jobs at federal immigration agencies in the Department of Homeland Security. Jon Feere, a former legal policy analyst for the Center for Immigration Studies, or CIS, has been hired as an adviser to Thomas D. Homan, the acting director of Immigration and Customs Enforcement, according to Homeland Security spokesman David Lapan. At Customs and Border Protection, Julie Kirchner, the former executive director of the Federation for American Immigration Reform, or FAIR, has been hired as an adviser to Customs and Border Protection acting Commissioner Kevin McAleenan, said Lapan.   advocates protested the appointments, according to CNN:  “These groups have spent 20 years looking for ways that they could hurt immigrants and now they’ve been given the keys to the kingdom,” said Lynn Tramonte, deputy director of America’s Voice, a   advocacy group based in Washington whose goal is to create a pathway to citizenship for undocumented immigrants. The agencies should continue to open up their meetings to all side in the debate, said Krikorian.  “Obviously these kinds of information sessions with ICE officials should be open any interested party,” Krikorian said, adding “you can’t just grab people off the street, but any organization that works on the immigration issue should be able to come to these meetings. ” “It is outrageous that that wasn’t the case before, and I have to give credit to the agencies,” Krikorian said. '"}, "time": 1742561678.4428868}