{"duration": 0.0806117057800293, "input_args": {"text": "'MSNBC host Joe Scarborough sent a subtly coded message Tuesday morning to an audience of one: President Donald Trump, you should fire Steve Bannon. [This week, Scarborough has been on a tear against Bannon  —   a populist firebrand, top aide to the president, and former executive chairman of Breitbart News. The Morning Joe talk show host, twice in the span of three minutes, summed up Bannon’s political philosophy as “Leninist”  —   that is, wanting to “destroy the American republic. ” This meme is based on a quote which Daily Beast author Ronald Radosh, an octogenarian this year, attributed to Bannon based on a conversation that Radosh claims took place in 2013. Bannon said last year that he did not remember either meeting Radosh or having that conversation.   Scarborough linked a poll showing President Trump’s approval at 36 percent to Bannon’s role as White House chief strategist. Trump is stuck at that number, he argued, “because he has simply refused to listen to everybody that has told him you need to reach out and be more inclusive. ” One of the people most responsible for Trump overestimating his support, Scarborough continued, is “our favorite player of the week, Steve Bannon. [in, apparently, a Steve Bannon voice] ‘Oh, they’re going to want me to be Vladimir Lenin and tear down the government because 65 percent of Americans are against us.’ I mean, what idiots. ” “If he wants to get his 36 [percent approval rating] to 56,” Scarborough concluded, “he’s gonna have to fire Steve Bannon and anybody else who calls themselves a Leninist who wants to destroy the American republic and government and start working with Republicans and Democrats and doing what 78 percent of Americans told NBC News a week ago. They want their leaders to compromise and work with the other side and make Washington work again. ” Trump will need to take this warning seriously, given Scarborough’s impressive political chops. He served in the U. S. Congress for the better part of seven years, resigning in 2001 to spend time with his family. For a time, renowned conservative pundit Bill Kristol floated Scarborough as his pick for the 2016 presidential race  —   eventually settling on a National Review editor who did not run, then settling on a CIA    staffer. As for expanding his populist appeal, the president would do well to seek out Morning Joe‘s invaluable look into “what the smart set in Washington and Manhattan are thinking” every day. Scarborough’s advice to President Trump has, so far, focused on surrendering to the establishment that has called him a     spy since the start of his campaign: January 27, 2017: “The press always wins. Washington always wins. You figure out how to work with them or you’re going to get crushed. ” January 31, 2017: “[Trump aide Stephen Miller]’s not good on television, you guys should probably keep him off television. ” February 6, 2017: “I suggest somebody at the White House get him to write a statement  —   a very strong statement letting the world know that he condemns the assassination of journalists and political rivals. ” February 17, 2017: “Don’t fight the press, the press always wins. Ask Richard Nixon. The press always wins!” February 28, 2017: Trump should use his Joint Address to Congress to announce “sweeping immigration reform” (i. e. amnesty for illegal immigrants). March 22, 2017: “Next time a voice inside your head says ‘screw with the FBI,’ just stop. ” Unfortunately, Trump has signaled that he will ignore Scarborough’s tips on appeasing the   media elite. A few weeks ago, the president’s @realdonaldtrump Twitter account stopped following Scarborough and his partner Mika Brzezinski. Nevertheless, the MSNBC host persists with his invaluable hot takes and armchair governance.'"}, "time": 1742562207.6034153}