{"duration": 0.0728142261505127, "input_args": {"text": "'El misterio de la extinción de 10.000 ranas gigantes en un río de Perú Publicado: 27 oct 2016 02:43 GMT \\nSegún activistas medioambientales de la región, la muerte de miles de anfibios de esta especie autóctona del lago Titicaca fue provocada por la contaminación incontrolada del río Coata. Imagen Ilustrativa Pixabay / Couleur Síguenos en Facebook \\nLas autoridades peruanas están investigando la repentina muerte de al menos 10.000 ranas gigantes en el río Coata, que desemboca en el lago Titicaca. Se considera que la muerte de los anfibios fue provocada por la contaminación incontrolada del cauce de este río, informa el diario peruano \\' Correo \\'. \\nEl Servicio Nacional Forestal y de Fauna Silvestre (Serfor) de Perú \"actuó de forma inmediata tras recibir una alerta sobre la muerte de las ranas\", según un comunicado publicado en el sitio web del organismo. Sin embargo, los miembros del comité de lucha contra la contaminación del río Coata aseguran que las autoridades no han hecho todo lo posible para prevenir la tragedia . \\nLos activistas medioambientales llevaron unas 100 ranas muertas a la plaza central de la localidad más cercana, Puno, para atraer la atención sobre el problema. \"Me tocó traer las ranas muertas para que nos creyeran. El gobierno no sabe cómo estamos viviendo acá\", explicó la líder del comité, Maruja Inquilla. \"No saben el nivel de contaminación que tiene el río. La situación se está saliendo de control \", añadió. \\n\"El problema es que no cuidan el río\", afirmó Roberto Elías, un experto en anfibios que lleva trabajando en un programa para la conservación de esta especie desde 2010. \"Estos anfibios son muy sensibles y los llamamos centinelas ambientales, porque en cuanto se modifica algo en el ecosistema son las primeras especies en morir \", agregó. \\nConocida científicamente como \\'Telmatobius culeus\\', la rana gigante del Titicaca recibió su apodo por los enormes pliegues de piel que incrementan el volumen de su cuerpo. Esta especie autóctona del lago Titicaca , que comparten Perú y Bolivia, está declarada en peligro crítico de extinción desde el año 2004.'"}, "time": 1742564222.0883064}