{"duration": 0.16943764686584473, "input_args": {"text": "\"2016 presidential campaign by BAR executive editor Glen Ford \\nThe GOP won at the polls, but Black, brown and working class Democrats have been taking a beating from their own party for decades. “The Democratic Party has failed to deliver even small net increments of social justice to its base constituencies, always giving away more than it gained, and at times taking the lead in savaging the people.” Hillary Clinton hoped to lead a Government of Ruling Class Consensus – a victory only for the One Percent. The Democratic Debacle – The Day After by BAR executive editor Glen Ford \\n“The net economic loss to the people -- especially the masses of Black folks, who have been stripped of much of the gains of the Sixties and Seventies, and nearly all of their household wealth – has been staggering and unrelenting.” \\nThe White Nationalists won and Hillary Clinton’s Big Tent, the bastion of the ruling class that Blacks and browns were led to believe was their sanctuary, has ignominiously folded. The media echo chamber smothered the deep, rumbling sounds of the impending quake, allowing only the corporate consensus to be heard outside the precincts of the Deplorables. But Deplorables want good jobs, too, and a future secure from the predations of Mad Capital, if only for their own “kind.” Whites in the “Rust Belt” joined with Confederates to choose their own brand of “lesser evil” – evils being the only items on the duopoly menu. \\nSocial democrats – a broad group that includes the vast bulk of Black America, according to political scientist Michael Dawson -- huddled around the latrine of Hillary’s Big Tent, trying desperately to perfume the stench. Except for a few percentage points worth of Green voters, they opted, once again, for a fraudulent “incrementalism” – a foolishness dressed up as “pragmatism” and even masquerading as high “strategy” -- which has led “progressives” straight down a road to disaster in the neoliberal era. (My excessive use of quotation marks is intended to convey that even the language of much leftish discourse is crafted for the purpose of surrender to Power.) \\n“Whites in the ‘Rust Belt’ joined with Confederates to choose their own brand of ‘lesser evil’ – evils being the only items on the duopoly menu.” \\nRather than gradually strengthening the political hand of the working and oppressed classes, bit by bit, year by year -- which is the purported justification for incrementalism -- progressive slavishness to the Democratic Party has facilitated the deepening dictatorship of capital. The net economic loss to the people -- especially the masses of Black folks, who have been stripped of much of the gains of the Sixties and Seventies, and nearly all of their household wealth – has been staggering and unrelenting. \\nFor the past 40 years and more, Democrats have been perfect partners in the Dance of the Duopolists. It’s a simple two-step. The basic move is: the Democrats hug as closely as possible to the left flank of the Republican Party, thus staying within dog-whistle range of the White Man’s Party’s core base, rooted in white supremacy, while claiming everything to the left of Robert E. Lee as Democratic turf, including the huge, heavily Black social democratic electorate whose progressive agenda the Democrats have no intention of substantively addressing. \\nThe Clintons turned this two-step into a disciplined tango with their GOP partners. In 1994, the Republicans threatened to launch a social justice Armageddon through their Contract with America -- legislation they were incapable of fully enacting, however, without some level of Democratic consent. The Clintons vowed to defend Black, brown and poor people from the GOP barbarians at the gate – and wound up ramming through Congress corporate-crafted measures that the Republicans could not have passed on their own. Bill and Hillary cut a rug to that tune for eight years in the White House, stomping out welfare as we knew it, eviscerating Franklin Roosevelt’s New Deal banking regulations, presiding over the largest surge in mass Black incarceration in modern history, and delivering the broadcast spectrum to monopoly media, all the while pretending to defend a “progressive agenda.” \\n“Islamic jihadists were enlisted en mass as U.S. imperialism’s hellish foreign legion in the Muslim world.” \\nOn the foreign policy side, the Clintons pioneered Washington’s “humanitarian” military intervention doctrine, later refined by Barack Obama and his secretary of state, Hillary Clinton. In the Democratic Republic of Congo, Bill Clinton set in motion the worst genocide since World War Two, a holocaust that has killed at least six million people under three US. administrations, and still counting. Humanitarian intervention, or Responsibility to Protect (R2P), became Obama’s favored instrument of aggression, a more domestically palatable alternative to George Bush’s massive boots-on-the-ground fiasco in Iraq. Islamic jihadists were enlisted en mass as U.S. imperialism’s hellish foreign legion in the Muslim world. Together, “New” Democrats Barack Obama and Hillary Clinton turned Syria and Libya into maelstroms of slaughter and moved towards nuclear war with Russia. \\nObama’s domestic aggressions on behalf of Big Capital were equally bold. With both houses of Congress in Democratic hands and the GOP on the ropes in 2009, he rushed to put Social Security, Medicare and “all entitlements” “on the table” for cutting. Now dancing by himself, not even bothering to triangulate in the Clinton style, Obama tried to forge a “Grand Bargain” with the GOP by pulverizing the remnants of the social safety net. Only the Republicans' institutional imperative to defeat, rather than collaborate with,   -- its white supremacist DNA -- prevented consummation of the Grand Bargain, Obama’s Holy Grail. \\nFrom Jimmy Carter to Barack Obama, the Democratic Party has failed to deliver even small net increments of social justice to its base constituencies, always giving away more than it gained, and at times taking the lead in savaging the people. There is no historical basis in the neoliberal era for the claim that the Democratic Party provides net incremental benefits to Black and working people, or that the party can be seized from its corporate masters and transformed into a machine that fights for the people. It fights for Capital – tooth and nail, as Bernie Sanders’ followers discovered. \\n“The First Black President rushed to put Social Security, Medicare and ‘all entitlements’ ‘on the table’ for cutting.” \\nHillary Clinton seized the opportunity presented by the Trump-generated split in the GOP to create a ruling class consensus and headquarters in her own campaign tent. It was the ultimate betrayal, the incubator of a thoroughly corporatized Democratic Party – an undertaker of social democracy. Instead, the White Deplorables derailed her, as they had earlier derailed the Republican corporate establishment. \\nThus, the crisis of legitimacy in U.S. ruling institutions deepens. \\nIt now appears, in the early hours of President Elect Donald Trump, that the new administration will be a conventional rightwing Republican regime, with a cast of villains including Newt “Contract with America” Gingrich, and a Vice President Mike Pence in the role of Dick “The Real President” Cheney. Maybe Trump will insist on giving peace with Russia and China a chance, maybe not. The Trans Pacific Partnership is probably dead, unless it can somehow be resurrected in the lame duck session of Congress that begins next week, but there is no way Republicans or Democrats will slap 35 percent tariffs on U.S. corporations’ foreign-produced goods. That’s rhetorical theater a la Trump. \\nThe Trump regime has no fix for the ills of late stage capitalism that have immiserated both the triumphant Deplorables and the darker folks they scapegoat, and whom they can be counted on to harass, repress and deport. Neither does the Democratic Party, whose next administration, had it not been still-born, would have served the interests of the One Percent even more dependably than did Obama. \\nLeave Hillary’s nasty tent in the dirt, where it lies. The people need vibrant social movements that will produce new leadership in struggle and shape the parties of the future. BAR executive editor Glen Ford can be contacted  \""}, "time": 1742563759.1433396}