{"duration": 0.11087560653686523, "input_args": {"text": "'GOSHEN, N. Y.  —   Angelika Graswald, the woman accused of killing her fiancé while on a kayak outing last year, asked an investigator who “Miranda” was  —   a few hours after she had been read her Miranda rights, according to testimony in a pretrial hearing here on Tuesday. In his   of the investigator, Ms. Graswald’s lawyer, Richard A. Portale, sought to show that his client, a native of Latvia, did not grasp the implications of the   police interrogation that preceded her arrest on    charges. “My client,” Mr. Portale said in court, “is asking, ‘What’s Miranda? Who’s Miranda? ’” The investigator, Donald DeQuarto, responded that he felt confident that earlier in the police interrogation, Ms. Graswald had comprehended her rights. “I asked her if she understood it, and she stated yes,” Mr. DeQuarto said. “I remember her reading the piece of paper and writing it onto a piece of paper, the Miranda warning. ” During the interrogation, Ms. Graswald admitted to removing the drain plug of the kayak that belonged to her fiancé, Vincent Viafore, and also tampering with his paddle. Mr. Viafore, 46, drowned on April 19, 2015, when his kayak capsized in rough water on the Hudson River. The Miranda warning is usually read to suspects at the start of a police interrogation. It alerts them to their right to remain silent and to obtain a lawyer, and is intended to preserve the admissibility of evidence at trial. The Miranda rights get their name from a case involving Ernesto Arturo Miranda, a laborer whose confession led to his conviction for armed robbery, kidnapping and rape. His appeal resulted in a landmark Supreme Court ruling in 1966 that said suspects must be informed of their right to legal representation and against  . The purpose of the pretrial hearing is to determine how investigators obtained their evidence. In the case against Ms. Graswald, 36, the case hinges largely on statements she made to the police, including the videotaped interrogation that Mr. Portale is trying to keep out of the trial. During the hearing, Mr. DeQuarto said that he had read Ms. Graswald her Miranda rights only after they had spoken for more than three hours at the police barracks in Orange County. The questioning came 10 days after Mr. Viafore’s kayak had capsized in the river an autopsy report ruled the cause of death a drowning and the manner of death homicide, citing the “kayak drain plug intentionally removed by other. ” Prosecutors say that Ms. Graswald was motivated by Mr. Viafore’s life insurance policy she stood to collect $250, 000 in benefits. The long interrogation followed an encounter earlier in the day between Ms. Graswald and the police on Bannerman Island, where the couple, who lived together in Poughkeepsie, N. Y. had rested the day he capsized. On the island, Ms. Graswald, who was laying a memorial wreath, had told Mr. DeQuarto that she felt “trapped” in the relationship and confessed to sabotaging his kayak, he said in earlier testimony. But Mr. Portale said the video of the   interrogation shows that around the seventh hour, Ms. Graswald appears not to have understood her rights, inquiring about “Miranda” as though it might be a person. In another strange detail in a case full of them, Mr. DeQuarto testified that Ms. Graswald suggested she was pregnant at the time of Mr. Viafore’s death. “Two hours in, she asks to use the bathroom,” Mr. Portale said to Mr. DeQuarto. “She comes back and she relates to you that maybe she just had a miscarriage. Do you remember that?” Mr. DeQuarto said he did remember. In other testimony, Susan McCardell, a volunteer gardener at Bannerman Island, said she saw Ms. Graswald in distress when she was with the officers on the island last spring. Investigators have testified that Ms. Graswald, who also volunteered on the island, seemed agitated. “They were bullying her she was crying,” Ms. McCardell said. “It was obvious to anyone it was not a good situation. She was unhappy, she was crying, she did not want to be alone. ” But she said Ms. Graswald indicated that Ms. McCardell should not stay. So did the officers, she testified. Ms. McCardell said one of the investigators told her: “She doesn’t really need you. She’s OK. ” Ms. McCardell said she returned a second time, about a   later, and found Ms. Graswald still in tears. “She was still crying. She was a little more agitated,” Ms. McCardell said. “I said: ‘Do you want me to stay? I think I should be here with you. ’” Her testimony contrasts with that of the investigators, who testified that while Ms. Graswald was agitated on the island, she seemed “  ” on the boat ride back to Police Headquarters. Ms. Graswald’s English skills could prove crucial to whether jurors are allowed to view the taped police interrogation. (A decision is expected in late July.) A native Russian speaker, Ms. Graswald arrived in the United States as an au pair more than 15 years ago. Mr. Portale has portrayed Ms. Graswald as struggling with English, but during the police investigation she demonstrated a sophisticated grasp of the language. In a video clip of the interrogation shown last fall on ABC’s “” a detective asked: “When you watched him in the water, was a part of you saying, ‘My worries are going away now?’ Were you almost . .. ” He paused, but she filled in the word, offering “euphoric. ” The detective said, “Euphoric that he was gone  —   you felt that way?” She answered, “I still do. ”'"}, "time": 1742561930.516101}