{"duration": 0.062157392501831055, "input_args": {"text": "'A disturbing trend has emerged in India where call centers have cropped up for the sole purpose of scamming Americans out of money, The New York Times reports. [The scheme is simple: impersonate an Internal Revenue Service employee, threaten Americans with penalties, and demand immediate payment for back taxes.  The United States has been tracking this scheme from India since 2013, a period of time where Americans lost $100 million to scammers, with many of the victims being recent immigrants, according to a New York Times article from October. Suhel Daud, an F. B. I. agent who serves as assistant legal attaché at the embassy in New Delhi, said India is now seen as a major center for cyberfraud. Daud said several factors have contributed to this rise in cyberfraud cases: an increase in young,   job seekers, a   culture,   technology, and ingenuity. Some of these young,   job seekers include boys like Pawan Poojary and Jayesh Dubey, both college   who got jobs at a call center in a suburb outside of Mumbai making about 16, 000 rupees ($230) “but the bonuses were double or triple that, based on sales. ” “At that time, in my mind is that I want money,” Poojary, 18, said. “That’s it. I want money. That’s why. ” But Poojary felt guilty when a woman on the line “begged him to give her a little time” before sending the money, and his supervisor told him to push harder, so he called the IRS in the U. S. to report information about a crime. Poojary was connected to Betsy Broder, the Federal Trade Commission’s counsel for international consumer protection. “He was determined,” she said. “The number of times he called me was overwhelming. I would guess that is why he was reaching out to me, because he wanted some form of law enforcement to take it down. ” Eventually, the call center, known as the Mira Road scam, “named for the building’s neighborhood,” got raided by local police. Police arrested 70 senior employees and interviewed and released 630 of the call center workers. Five days later, another call center in Ahmedabad had been raided that had defrauded thousands of Americans. The U. S. Justice Department “released an indictment tracing 1. 8 million calls” to five call centers in Ahmedabad. Since the raids, calls have “dropped 95 percent, according to the Better Business Bureau. ” It is unknown who exactly brought down both operations, but other scams out to defraud Americans have continued. As Poojary and Dubey looked for another job, they got several lucrative offers from other scamming companies looking to defraud Americans, a sign that the call centers looking to scam Americans in India have no signs of slowing.'"}, "time": 1742561737.7394235}