{"duration": 0.09082961082458496, "input_args": {"text": "'Foreign Secretary Boris Johnson has said the UK will be “perfectly OK” even if the European Union (EU) refuses to conclude a bilateral agreement with it after Brexit  —   although he added he is sure an agreement will be made. [“We would be perfectly OK if we weren’t able to get an agreement, but I’m sure that we will,” he told ITV’s Peston On Sunday. “Our partners and friends around the EU desperately want this thing to work. They don’t want more misery they don’t want to fall out with the UK” he said.  ICYMI those @BorisJohnson comments claiming the UK would be ”perfectly okay”   without a trade deal with the EU #Peston pic. twitter.   —   Peston on Sunday (@pestononsunday) March 12, 2017,  The Foreign Secretary’s comments come just days after Hungarian foreign minister Péter Szijjártó warned the EU that seeking to “punish” the British people for backing Brexit would be a “suicidal strategy” liable to drive UK business abroad to the United States and growing economies around the world. “We need to avoid a situation whereby the EU goes to the back of the line for Britain” he said. “Losing such a partner and giving it away to others would be a suicidal strategy. ” The UK has been laying the groundwork for raft of new trade agreements once it is out of the EU, which does not allow   to conduct their own trade policy.  David Davis, the Secretary of State for Exiting the European Union, assured the public that “The whole of Whitehall every single [government] department” was working on a contingency plan in case a   agreement cannot be negotiated. Davis told the BBC’s Andrew Marr Show that he shared the Foreign Secretary’s view that a “no deal” situation was not “remotely likely” on Sunday morning, however, emphasising that “The whole government   …     have been engaged with every country in Europe and of course the [EU] institutions”. #Brexit secretary David Davis says government is working on contingency plan if deal can’t be reached with EUhttps:  .  #marr pic. twitter.   —   BBC News (UK) (@BBCNews) March 12, 2017,  “It’s going to be tough,” he said, “but it’s in absolutely everybody’s interests that we get a good outcome”. Addressing rumours that Remainer MPs are plotting to claim a veto over Brexit by backing House of Lords amendments to the government’s bill authorising the activation Article 50 of the Lisbon Treaty, which formally begins the exit process, Davis asserted that this would not be democratically acceptable. “What we can’t have is either house of Parliament reversing the decision of the British people,” he said. “They haven’t got a veto [  …    ] The decision has been made. The British people made the decision on June 23rd last year. ”'"}, "time": 1742564098.1802871}