{"duration": 0.037761688232421875, "input_args": {"text": "'Originally appeared at Pravoslavie.ru \\nA Siberian theatre triggered a storm today by cancelling a staging of Andrew Lloyd Webber’s musical Jesus Christ Superstar after a pro-Kremlin nationalist group condemned it as blasphemy. \\nThe touring production by Saint Petersburg’s Rock Opera theatre was due to open November 1 in the Musical Theatre of the city of Omsk, but the organisers cancelled it this week following protests by conservative activists. \\nIn a report from Omsk, Regnum news agency wrote today that the scandal “has prompted a major public reaction”. \\nIt quoted art critic Vadim Klimov as saying: “Today you cannot say that Russia is a secular state.” \\nAn obscure group called Family, Love, Fatherland had appealed to regional authorities to stop the staging and applied to hold a demonstration, accusing the long-running musical of “non-stop blasphemy” and “mockery of faith”. \\nThe closure comes as relatively small numbers of nationalist activists with Orthodox beliefs are voicing their views more and more stridently, supported by some officials. \\nAmnesty International called the cancellation of the show “the latest example of interference in Russian cultural life by nationalist ‘activists’.” \\nThe region’s culture ministry distanced itself from the decision to stop the show, with a spokesman saying the promoter cancelled the show “for some reasons of its own,” RIA Novosti state news agency reported. \\nThe Omsk diocese of the Russian Orthodox Church also denied any “interference” in the theatre’s repertoire. \\nLast year a director and the head of another Siberian theatre in Novosibirsk went on trial for “desecrating religious symbols” over a staging of Richard Wagner’sTannhauser opera. The case was dropped, but the theatre’s head was sacked. \\nRossiya-24 state television reported the decision to close Lloyd Webber’s “legendary rock opera” was most likely taken by the theatre “fearing to repeat the fate” of the Tannhauser staging. \\nThe musical was first staged in Russia in 1990 during Mikhail Gorbachev’s perestroika reforms. \\nRussia made offending religious believers a criminal offence after the Pussy Riot punk band performed a song slamming President Vladimir Putin in a Moscow church in 2012.'"}, "time": 1742562067.7675211}