{"duration": 0.0685732364654541, "input_args": {"text": "'Share on Twitter \\nThe fury over the Nobel Prize for Literature having been awarded to music legend Bob Dylan— and his subsequent snubbing of it— has come from many sources. \\nBut the most surprising source may be liberals who have championed Dylan for decades as the troubadour of progressive politics— even though he\\'s long since moved on from his folk song beginnings. Image Credit: Kevin Winter/Getty Images for AFI \\nAs Chris Queen of PJ Media points out in a piece posted there Wednesday, this isn\\'t the first time Dylan has failed to be on “the right side” of an issue— his pro-Israel stance has been irritating progressives forever. Image Credit: Koh Hasebe/Shinko Music/Getty Images \\nQueen cites a recent Al-Jazeera editorial written by French sociologist and media critic Ali Saad. \\nIn the article, Saad takes exception with much of the media for not pointing out Dylan\\'s pro-Israel political stance when reporting the news of his Nobel award. \\nSaad writes: \\n“....media outlets, both Arab and international, framed the story without taking issue with Dylan\\'s pro-Israel stance and instead portrayed him exclusively through the prism of his constructed image as defender of the oppressed.” \\nSaad also cites Dylan\\'s early \\'80s song “Neighborhood Bully,” whose lyrics supposedly express support of Israel metaphorically, as proof that Dylan has held that point of view for decades. \\nNaturally, since the majority of ultra-progressives tend to view Israel as an “occupying force” with an aggressive military, Saad sees it as unbecoming of an anti-war icon to pledge allegiance to such a state. Image Credit: Cynthia Johnson/Getty Images \\nOf course, more than a few were simply angry over Dylan\\'s refusal to acknowledge that he\\'d received the honor at all. The musician still hasn\\'t responded to the Nobel organization\\'s attempts to contact and congratulate him. \\nAs Ultimate Classic Rock writes: \\n\"Bob Dylan‘s decision to not acknowledge having won the Nobel Prize for Literature, unsurprisingly, isn’t sitting too well with the Swedish Academy, the body that awards the prize. Calling it \\'an unprecedented situation,\\' an academy member has lashed out at Dylan for ignoring their attempts to contact him. \\n\\'It’s impolite and arrogant,\\' Per Wastberg, a Swedish writer said on SVT public television, as reported by The Guardian. \\n\\'Yesterday, we reported that Dylan has rebuffed every attempt by the committee to contact him, either directly or through someone described as his “closest collaborator.” He even removed the acknowledgement of the prize from his website. They are remaining optimistic that Dylan will attend the ceremony on Dec. 10, at which point he will be given an 18-carat gold medal and a check for approximately $900,000. As of now, Dylan’s current tour is scheduled to conclude on November 23.\" \\nBut should any of it— Dylan\\'s “Zionism,” his public indifference to having received what\\'s considered one of the great humanitarian honors in the world— surprise anyone? \\nDylan has a long history of defying expectations, from when he abandoned folk music for electric rock \\'n roll, becoming a “Judas” to millions of folk fans, to when he converted to Christianity in the \\'70s and wrote gospel tunes. He even famously once beat up a stalker in 1971. Image Credit: Wikimedia Commons \\nIt seems that the man whom poet Allen Ginsberg once called a “trickster hero” isn\\'t someone who wants to be on anyone\\'s team. '"}, "time": 1742564317.2602174}