{"duration": 0.037872314453125, "input_args": {"text": "'Uber has hired NASA engineer Mark Moore as Director of Engineering for their flying car project “Uber Elevate,” which seeks to expand the cab service into airborne travel. [Moore worked at NASA “as an advanced aircraft engineer and basically kickstarted the current interest in vertical   and landing craft for   urban flight with a 2010 paper on the feasibility of the   vehicles. ”  “The engineer was impressed by Uber’s work on the subject, and saw a chance to make the vision he’d originally articulated years ago into something real, in a reasonable time scale,” according to TechCrunch. “Moore said that key to his decision to join Uber was that the company seemed to have a practical business case for making a flying commuter transit service real  —   and nothing would ever get done without market motivation behind the vision. ” Uber’s plans for a flying service were first hinted at in September 2016 by Uber’s Chief Product Officer Jeff Holden. In an interview, Holden shared his interest in “vertical takeoff and landing” vehicles (VTOL) claiming, “It could change cities and how we work and live. ” Holden added that he wanted to offer his customers “as many options as possible to move around,” and that passenger drone technology could be a fully functioning norm within a decade. “VTOL is another way to do that,” said Holden, after talking about ways to decrease city traffic. Uber’s Head of Product for Advanced Programs, Nikhil Goel, confirmed in a statement that Moore would be working on VTOL vehicles. “Uber continues to see its role as an catalyst to the growing developing VTOL ecosystem,” said Goel in the statement. “We’re excited to have Mark join us to work with companies and stakeholders as we continue to explore the use case described in our white paper. ” In 2015, rapper   and other   individuals, including members of the Saudi Arabian royal family, invested $20 million in JetSmarter, which has been billed as “the Uber for flying,” while an Israeli tech firm is also prepared to launch their   drone service in 2020, following 15 years of development. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.  '"}, "time": 1742562317.695519}