{"duration": 0.08400392532348633, "input_args": {"text": "'In a New York Times   piece, “sanctuary” cities are called out for not doing “enough” to protect illegal aliens. [The piece, written by Shakeer Rahman and Robin Steinberg, slams New York City Mayor Bill de Blasio for not going far enough when it comes to obstructing federal immigration officers from deporting illegal aliens:  The abruptness of the raids provoked criticism from local officials, including Mayor Bill de Blasio of New York, who vowed to stand with immigrant communities. But mass deportation under President Trump will also happen through a more routine policy that is in the mayor’s control: endless, unnecessary arrests for   offenses, which end up feeding immigrants into the federal government’s deportation machine. It’s not enough for cities like New York to declare themselves “sanctuaries,” which simply means that the local police won’t detain noncitizens on the federal government’s behalf. If cities really want to protect immigrants, they must also end the   style of policing that makes immigrants the victims of unnecessary arrests and disproportionate punishment. Many of these unnecessary arrests stem from the discredited idea that a draconian crackdown on the most minor offenses  —   littering, selling loose cigarettes, biking on the sidewalk  —   will prevent more serious crimes. This model of policing, known as broken windows or zero tolerance, helped to drive mass incarceration. Its next cost could be mass deportation. The   then decries the idea that illegal aliens can be deported for “minor offenses like simple marijuana possession” or any “crime involving moral turpitude,” despite that policy seeming to have not changed at least over the last decade. ICE agents were also attacked in the   with Rahman and Steinberg writing, “Even if cities stop sharing arrest information, Immigration and Customs Enforcement has been known to send plainclothes agents to local courts, where they wait for immigrants to appear for misdemeanor charges. ” The   goes on to say that Trump’s deportation effort of illegal immigrants, specifically those who have committed crimes, “can’t happen without boots on the ground,” though ICE has long used agents to investigate, arrest and deport criminals. “Until cities reject the failed thinking that led to mass incarceration, local police and prosecutors will be doing the legwork for mass deportation,” the   concludes. John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742562440.7005556}