{"duration": 0.03846859931945801, "input_args": {"text": "'Home / Be The Change / The State / “I Can’t Believe I’m Doing this’— Man Livestreams Himself Stealing a Cop Car on Facebook “I Can’t Believe I’m Doing this’— Man Livestreams Himself Stealing a Cop Car on Facebook The Free Thought Project November 3, 2016 3 Comments \\nTulsa, OK — (RT) Live footage has emerged on Facebook of a convicted felon stealing an unlocked police cruiser from outside a coffee shop in Oklahoma and taking it for a 40-minute joyride to his parents’ house. \\nJohn Pinney, 25, is alleged to have taken the police vehicle from a parking spot on Halloween night, after a Tulsa Police Department officer left her keys inside while she went on an 8pm coffee break, reports CBS News . \\nOklahoma man Pinney is said to have then led police on a 40 minute chase across the state, using the police officer’s iPad to livestream the incident from inside the vehicle. \\nPart of the livestream remains public on Pinney’s Facebook page and shows the 25-year-old singing to the “sh*t I want to go out to” while racing away from state police in one of their own vehicles. \\nAt one point Pinney appears to play with the sirens on the car while wishing viewers a “Happy Halloween.” \\n“This is my last video for sure, probably. I don’t even know where the f**k I’m going, honestly. \\n“I’m trying to learn how to work all these lights and stuff,” Pinney tells the camera. “I can’t believe I’m doing this for real. I’m driving with my knees right now trying to show you all this.” \\nTulsa police sergeant Steve Stoltz told reporters that the joyride prompted the response of “multiple agencies” and saw the suspect reach speeds of over 120mph before his arrest. \\n“The suspect was seen [driving] at high speed towards Sand Springs [Oklahoma] and then went north. The vehicle was eventually located by Skiatook Police Department, who initiated pursuit. The suspect, at high speeds, led them to an address… turned out that was where the suspect’s parents were,” Stoltz said. \\n— Annie Chang (@AnnieNewsOn6) November 1, 2016 \\nPinney has since been charged with possession of a stolen vehicle, eluding and resisting arrest, as well as the possession of a firearm. Share'"}, "time": 1742562022.0032246}