{"duration": 1.2945070266723633, "input_args": {"text": "'SAN FRANCISCO  —   Uber is one step closer to its dream of a   future  —   with a little help from a new partner. The   company announced on Tuesday a partnership with Daimler, under which the German automaker plans to build autonomous vehicles that will operate on Uber’s transportation network. The move marks the first time a major automaker will provide its own   vehicles  —   built entirely   and without Uber’s help  —   specifically to operate on the   company’s network. The agreement is not exclusive, and Daimler may produce autonomous cars for Uber’s competitors, while Uber can also bring other automakers onto what it calls its “open platform” for ride hailing. The two companies said they expected Daimler’s   vehicles to reach Uber’s network “in the coming years. ” “Auto manufacturers like Daimler are crucial to our strategy because Uber has no experience making cars  —   and in fact, making cars is really hard,” Travis Kalanick, Uber’s chief executive, said in a statement. “We can combine Uber’s global   network with the   vehicles of companies like Daimler, so that Uber riders can have a great experience getting around their cities. ” Uber has a history of cooperating with automakers to jointly produce autonomous vehicles. The company has worked with Volvo to develop the XC90, a   sport utility vehicle now being tested in Pittsburgh, near Uber’s   research headquarters. Uber has also modified a fleet of Ford Fusion vehicles, outfitting them with sensors and cameras for autonomous capabilities. Lyft, Uber’s largest competitor in the United States, has also worked closely with a major automaker, General Motors, which is making its own   vehicles for Lyft’s   network. Google struck a deal with Fiat Chrysler last year to work on   vehicles. Uber stands to benefit from the Daimler partnership in several ways. Collaborating with automakers could reduce the perception that Uber is a threat to the sales of the auto industry, for example. The company can also bolster its supply of vehicles to pick up a growing base of riders. Uber faced some setbacks with its   experiments last year. It ended a pilot program in San Francisco in December after disagreeing with California’s Department of Motor Vehicles over whether it had the proper permits for the test. Uber plans to begin a similar test in Phoenix in the coming months. “Daimler aims to be a leader in autonomous driving,” Dieter Zetsche, Daimler’s chairman, said in a statement. “Together with Uber, we seek to combine our strengths. ”'"}, "time": 1742563452.3775606}