{"duration": 0.031701087951660156, "input_args": {"text": "'Special Agent Henry Cabrera, a third Capitol Police officer who helped stop the massacre of GOP congressmen and their staff during baseball practice in Alexandria, VA, on Wednesday, went mostly overlooked. [Media attention primarily focused on hero Capitol Police officers David Bailey and Crystal Griner, who were wounded as they fired back at the gunman, James T. Hodgkinson.  But a third police officer, Henry Cabrera, who was also there at the time to protect House Majority Whip Steve Scalise ( ) also helped take down the shooter, but was not wounded. Cabrera appears to be a U. S. Army veteran, according to his Facebook page. His page features a picture of himself in fatigues, and another of an Army platoon at Fort Jackson, South Carolina, on Sept. 12, 1994. The unit is the 2nd Battalion, 39th Infantry Regiment. Asked to confirm whether he is a veteran, Capitol Police Spokeswoman Eva Malecki responded, “We can’t comment any further on an ongoing investigation. ” However, a relative of Cabrera confirmed to Breitbart News that he is a veteran. Cabrera’s name became known to the public after Capitol Police Chief Matthew Verderosa thanked him, Griner, and Bailey at a press conference on Wednesday. “I want to commend Special Agents Crystal Griner, David Bailey, and Henry Cabrera for their heroic and appropriate response in protecting the Members and others today during their practice for the Congressional baseball game,” he said. Cabrera posted on Facebook on Wednesday after the shooting: “Yesterday was   NUTS! !!! Many thanks to those who reached out to me yesterday. I’m proud of my TEAMMATES David Bailey and Crystal Griner. They took care of business! !!!! Prayers for Mr Scalise and his family. ” Supportive comments poured into Cabrera’s page and on Twitter. “Dont sell yourself short man. You are one of the heroes too!” a friend posted. There was a third officer there who should also be recognized. He just wasn’t wounded. Special Agent Henry Cabrera.  —   BAJ (@BarbAnnJ) June 15, 2017,  Why did CBS @CBSThisMorning NOT mention HENRY CABRERA from the Capital Police for his heroic actions??  —   teslaire (@teslaire) June 15, 2017,  Although details are scant, eyewitnesses say the officers took down Hodgkinson, 66, after he opened fire on Republican congressmen and their staff, critically wounding Scalise and lobbyist and former congressional staffer Matt Mika. Bailey, Griner, and an aide to Rep. Roger Williams ( ) Zach Barth, was also wounded. Those who were on the field that day credited the officers for saving their lives. Eyewitnesses said the officers stepped forward, towards the shooter, and saved everyone’s lives. “It could have easily been 25 deaths or more,” Williams said. “The thin blue line held today. And Americans everywhere should be thankful that it’s still the kind of country that produces these heroes. ” “Without the Capitol Police, who literally took a step forward   …     they saved all of us out there. There is no question about it. We had no arms, all we had were bats. And the shooter,” he added. Rep. Brad Wenstrup ( ) an Iraq veteran, said that after Hodgkinson fired at them with a rifle, he came out from behind a building with a pistol. “That’s when security detail was able to take him down,” he told ABC News. “You never expect a baseball field in America to feel like being back in a combat zone in Iraq, but this morning it did,” Wenstrup tweeted later. Sen. Rand Paul ( ) who was also there at the scene, said it would have been a “massacre” without the Capitol Police. “I can tell you, that I think with absolute certainty, nobody would have survived without the Capitol Hill Police. They saved everybody’s life,” he said. “It would have been a massacre without them. ”'"}, "time": 1742628563.866241}