{"duration": 0.013719320297241211, "input_args": {"text": "'The Newspaper \\nFor academics at the University of Maryland (UMD), merely collecting a toll from drivers for every mile they drive is not enough. UMD College Park researchers Di Yang, Eirini Kastrouni and Lei Zhang insist in a recent academic paper that motorists should pay a proportionally higher tax that is based on their income. Published in the journal Transport Policy, the article argues that a new variable-rate vehicle miles traveled (VMT) tax could supplement transportation funds being rapidly depleted by increased spending on transit infrastructure. \\n“On the revenue generation side, VMT fee policies can supplement the existing fuel tax revenues to mitigate the fiscal deficit,” the researchers wrote for the London School of Economics last week. “The three income-based VMT fees are all designed to double the revenue generated so that they are comparable with respect to their impacts on consumer surplus and travel behavior.” \\nCurrently, gasoline taxes at the state and federal level are collected primarily at the distributor level, which keeps the tax simple. The more one drives, the more one pays, with those choosing lighter and more fuel efficient vehicles spending less at the pump. Many politicians hate the gas tax because the public generally opposes hikes in fuel taxes. As a result, transportation officials have sought more indirect means of taxation that would make it easier to raise rates. The VMT has emerged as a popular solution in transportation circles, but opponents have objected that vehicle miles traveled taxes hit low-income drivers the hardest. The researchers suggest the solution is to raise more money for transit while simultaneously eliminating the fairness concern by imposing higher VMT taxes on drivers from high-income households. \\n“Among the proposed fee structures, the policy with a fixed interval increase rate as people’s level of income improves is considered to be progressive overall,” the researchers explain. \\nA ten cent per mile VMT tax would generate $44 billion nationwide over twenty years. The latest article is based on an analysis in Yang’s 2014 master’s thesis which calculated the impact of the fees using various economic and travel demand models. One model, for instance, would have the tax jump 50 percent at each income bracket. So a 10-cent-per mile rate for households earning less than $20,000 per year would rise to 15 cents up to the $20,000 to $40,000 per year bracket. From $40,000 to $60,000, the rate would be 23 cents, from $60,000 to $100,000 it would be 34 cents, and above $100,000 it would be 51 cents. As most drivers travel 12,000 miles per year, the low income tax would be $1200 compared to $6120 for the wealthy. \\nAt this rate, Yang calculates that the income-adjusted vehicle miles traveled tax would more than double the gas tax revenue, compared to the 57 percent increase a flat-rate VMT would generate. The paper presumes drivers facing a doubling of government fees would be more inclined to take the bus.'"}, "time": 1742628583.6855145}