{"duration": 0.054845333099365234, "input_args": {"text": "'Posted 10/31/2016 3:17 pm by PatriotRising with 0 comments Democratic strategist calls reopened Clinton probe an ‘attack’ on American democracy in MSNBC tantrum \\nFamed Democratic strategist James Carville may be the first Clinton surrogate to have officially lost his mind over the FBI’s decision to reopen its investigation into Clinton’s private email server. \\n\\nIn an appearance on MSNBC on Monday, Carville relentlessly — and repeatedly — attacked the FBI’s decision to reopen the investigation into Hillary Clinton, asserting it is part of a conspiracy to subvert American democracy. \\n\\n“This is in effect an attempt to hijack an election,” Carville claimed. “It’s unprecedented … the House Republicans and the KGB are trying to influence our democracy,” he said. \\n\\nApparently the fact that the Soviet security agency was disbanded in 1991 does not preclude its involvement in this vast, anti-Clinton conspiracy organized by the FBI, according to Carville. Poor Carville was clearly apoplectic at the news of Comey’s announcement, describing it as an assault or attack on American democracy multiple times. \\n\\nHe was also adamant about who was responsible. “Comey was acting in concert and coordination with the House Republicans,” Carville said. “We also have the extraordinary case of the KGB being involved in this race and selectively leaking things from the Clinton campaign that they hacked,” he claimed. \\nCarville was very upset that Comey’s announcement thrust Clinton’s surely unethical and likely illegal behavior back into the spotlight. “It would seem to me that the FBI shouldn’t be getting rolled by the House Republicans, that’s what happened here — there’s nothing else that’s going on — and in the meantime … democracy is under assault by the KGB,” he said. “To me that’s something we ought to be talking about.” \\n\\nUnfortunately for Carville, whilst fanciful tales about time-traveling Soviet spies and an FBI on the GOP’s take certainly make for interesting entertainment, they pale in importance to the real life stories of Clinton’s brazen lawlessness. \\nWhen the MSNBC anchor dared raise the fact that Democrats were praising Comey only a few months ago when he announced the FBI’s decision not to recommend indictment, Carville went into a stuttering, sputtering fit. Hillary Reboots ‘Vast Right-Wing Conspiracy’ Playbook Clinton camp set to wage effort to discredit FBI Director Comey and criminal probe as politically motivated \\n\\n“When the facts change I change my mind,” Carville said. “Why are you defending this, why are you sitting here as American democracy is under assault?” he asked angrily. Faced with the Democrats’ clear double standard \\n\\n“This is an unprecedented event that was done on behalf of the House Republicans,” Carville repeated. “And as we know the KGB is all over this election and this is what we are talking about? We ought to be talking about our democracy is under assault right now and what we are going to do about it, not [what somebody said in July] about James Comey.”'"}, "time": 1742562269.7012005}