{"duration": 0.07082843780517578, "input_args": {"text": "'We Are Change \\nOn note of the suggestive coded messages in Podesta’s emails and suspicion of child trafficking one email in particular discusses convicted House Speaker pedophile Dennis Hastert.\\n\\nHastert was convicted and sentenced to a measly 15 months in jail for molesting four boys last April. Hastert paid someone referred to as “Individual A” $3.5 million in hush money . You can read Hasterts indictment here. \\nIn the emails Richard L. “Jake” Siewert, Jr. the head of corporate communications for Goldman Sachs , forwards John Podesta with the subject line: “Tax Breaking News” a politico story about Dennis Hastert. Siewert then says to John Podesta, “Might be time for Denny to vanish to an undisclosed Japanese island.” Podesta never replied or his reply hasn’t been found yet.\\n“The Justice Department on Thursday announced an indictment against former House Speaker Dennis Hastert for allegedly structuring cash transactions to avoid financial reporting rules and lying to the FBI about his conduct. A grand jury in Illinois charged that Hastert agreed to pay an unnamed individual $3.5 million as part of an effort to conceal “his prior misconduct.”\\n“Might be time for Denny to vanish to an undisclosed Japanese island.”\\nFederal Judge Thomas Durkin the judge that sentenced Hastert is quoted calling Hastert, a “serial child molester.”\\nFBI translator whistle-blower Sibel Edmonds and James Corbett covered the real Dennis Hastert case back in October, 2015, that the mainstream media wouldn’t dare touch pedophilia, blackmail, Graymail and drug money. \\nIn 2015, Sibel launched a social network campaign to expose Dennis Hastert’s real crimes. \\nSibel is quoted calling the Hastert scandal “too deep, too dark” and said that it “covers too many people from both sides of the political aisle for it to ever proceed in public.”\\nBefore that in 2009, Sibel Edmonds testified in a deposition after being gagged for years about her personal knowledge of treason, blackmail of Members of Congress, bribery, and other criminal activities, including pedophilia in the government while working as a translator. Specifically Sibel talked about Dennis Hastert years ago on June 1st, 2008. In which Sibel said that, “Hastert was caught on FBI wiretaps accepting bribes from Turkish criminal elements associated with the Turkish government, as documented in Vanity Fair in 2005 and elsewhere .” Sibels history with Dennis Hastert didn’t start there though, before that Edmond’s published a gallery which included Hastert’s picture in response to being gagged.\\nIn her deposition, “Sibel testified that it was well known that Hastert engaged in these activities in non-secure locations and was videotaped” Cynthia McKinney, writes.\\nFormer U.S. representative Cynthia McKinney also knew about the pedophilia within the government in 2005. She grilled Rumsfeld on DynCorp’s child trafficking business selling women and children. None of this is new see our previous article on elite pedophilia on the Franklin cover up, the finders etc. It’s the elite’s dirty little secret so it wouldn’t surprise me if Podesta’s emails really were child trafficking coded messages . Especially since internet sleuths at reddit and /pol/ have connected some shocking dots regarding Podesta and Clinton friends. Even if some of it is far fetched like the Podesta brothers kidnapping of Madeleine Beth McCann doesn’t mean this research should be ignored.\\nWe are at war and to quote Sibel Edmonds one final time.\\n“Sure. They have all the mega print and TV outlets. But we have the power of numbers, resolve and persistence. And we have this website, the internet and all the social networks and forums that go with it.”\\n~Sibel Edmonds, writes.\\nIv provided a link to Sibel Edmond’s old website, BoilingFrogsPost and several YouTube videos of her and James Corbett’s investigation into the Hastert child abuse scandal. To quote Sibel and James, “P edophiles Run the Government AND No One Gives a Damn!” Do you?\\n\\nSibel relentlessly covered the Hastert scandal and fought to tell us the truth now iv been informed that Sibel needs our help we always tell you to support real independent media and journalist. When we say that we don’t only mean us. As alternative media we must stick together to conquer the mainstream media and put the MSM where it belongs in it’s grave. Besides covering the Hastert case Sibel has done a lot over the years if you can please help out and donate to Sibel Edmonds’s www.newsbud.com project kick-starter . We are the future, the mainstream media is in it’s death throes We Are Change the peoples funded media.\\n \\n“\\nThe post WIKILEAKS: Emails Discuss Disgraced House Speaker Pedophile Dennis Hastert appeared first on We Are Change .\\n'"}, "time": 1742563473.4626591}