{"duration": 0.033334970474243164, "input_args": {"text": "'2 tablespoons coconut oil (warm enough to be liquid, which means above 76 degrees F) 10 drops peppermint, clove, or citrus pure essential oil \\n\\nPut baking soda in a bowl, add the other ingredients and mix until you achieve a proper paste texture. Add a small amount of baking soda if it’s runny; add more coconut oil if it’s too dry. Taste, and add more essential oil if you want a more flavorful paste. Store in an opaque container (required to protect the hydrogen peroxide ) and use as usual. \\n\\nThe most simplified toothpaste recipe ever. \\n1. Mix Baking soda and coconut oil 50/50 \\n\\nHow effective is using baking soda? Baking soda is used for two reasons. First, it’s a mild abrasive that provides a gentle cleansing. Second, it’s alkaline. Being alkaline, baking soda can neutralize acids in your mouth that are often at the root of tooth decay. Baking soda also absorbs odors and helps produce fresh breath. \\n\\nCoconut oil is the magic ingredient . It is a key ingredient in homemade toothpastes because it’s a powerful, natural antibacterial and antifungal – so it works to kill harmful bacteria in your mouth while you brush. Coconut oil is excellent for your gums and brushing with it regularly can eliminate bleeding, sore gums. The oil kills the bacteria that are responsible for gingivitis – and if you have gingivitis, you might want to massage some coconut oil into your gums regularly, in addition to using it in your toothpaste. Brushing your tongue with the oil helps with thrush, a fungal problem localized in the mouth, and to boot, coconut oil has been found to stop and even reverse some tooth decay . \\n\\n\\nCoconut oil naturally contains Caprylic acid, a fatty acid that effectively destroys candida. This makes coconut oil one of the best ways to keep Candida levels under control which can be present in the mouth when overgrowth occurs.'"}, "time": 1742563418.4723208}