{"duration": 0.06825089454650879, "input_args": {"text": "'Mary Tyler Moore, who died on Wednesday at 80, had a   career in show business. But she is most remembered for two indelible sitcom roles: Laura Petrie on “The Dick Van Dyke Show” and later, Mary Richards on “The Mary Tyler Moore Show. ” [ Read Mary Tyler Moore’s obituary | 5 great episodes to stream ] Ms. Moore first appeared in The New York Times in 1962, during the first season of “The Dick Van Dyke Show,” which ran from 1961 to 1966. A reporter interviewed her during a brief trip to New York to   CBS executives and affiliates. (“When they saw Mary, there was quite a bit of applause and a few whistles,” a network spokesman said.) By 1965 the show was a hit and Ms. Moore was a star. The writer Joanne Stang called her the “virtually uncontested popularity queen of weekly television,” marveling that Ms. Moore “has made housewifery a highly palatable pastime. ” “I guess they simply like me,” Ms. Moore said in the article. At the time she was preparing to try to leverage her TV success into a film career, having recently signed a contract with Universal. But she was similarly   about her prospects. “If I don’t have the chemistry for the big screen, I guess I’ll look for something else to do when the ‘Van Dyke Show’ goes off,” she said. Ms. Moore did appear in films like “Thoroughly Modern Millie,” “What’s So Bad About Feeling Good?” and “Change of Habit,” but it was another television show that became her defining role. “The Mary Tyler Moore Show,” which Ms. Moore produced with her   Grant Tinker, debuted in 1970, arriving in an era whose social mores were signified by the groaner headline The Times used to introduce it and other new   series: “Out of the Kitchen, Ladies. ” Early coverage was similarly dismissive: “Mary Tyler Moore is caught in a preposterous item about life as an ‘associate producer’ in a TV newsroom,” Jack Gould wrote in The Times in a preview of the 1970 TV season. In his brief review of “The Mary Tyler Moore Show,” Mr. Gould complained that the star was saddled with “one set of bizarre happenings at a TV station’s newsroom and another in her living accommodations. ” But within a few years, The Times had reconsidered its stance. “Consistently tight writing and good acting have made this situation comedy the best of its kind in the history of American television,” Dan Menaker wrote in 1973. The following year, The Times was revealing “Why 30 Million Are Mad About Mary. ” (The answer: She is “beautiful and sexy, but not threatening. ”) As the show wrapped up its run, during which it had broken ground in prime time with its depiction of a single professional woman, an Associated Press article in The Times noted that the show “laid to rest the myth that audiences would not accept a situation comedy involving a woman, unless she was married and burned dinner at least one night a week. ” “I’m just part of it,” Ms. Moore said in the article. “But it really has affected a lot of people, all to the good. ” Ms. Moore’s career never again reached the heights of “The Mary Tyler Moore Show,” but she stayed busy branching out into musicals and additional,   series, and playing against plucky type in TV movies and films like “Ordinary People” and “Flirting With Disaster. ” In the twilight of her career, as the lifetime achievement awards started rolling in, she embraced her signature role in lighthearted reunion specials and in the occasional interview. In 2012, Neil Genzlinger, a television critic for The Times, watched the series finale of “The Mary Tyler Moore Show” with the actress, who apologized in advance for a watery eye that had been plaguing her. “As we finished,” Mr. Genzlinger wrote, “Ms. Moore reached for the tissue box. ‘Now I am crying,’ she said. ‘It’s not just a bad eye. ’”'"}, "time": 1742561758.6658509}