{"duration": 1.7929129600524902, "input_args": {"text": "\"Email \\nReading through Hillary and her ‘gang’ leaked emails, gives us a picture as to how America’s foreign policy was run, a policy that nearly wiped out Christians from the Middle East. Looking through Hillary’s email shows a gang bent on destroying the Middle East. It was as if a college Muslim Student Association (which Huma Abedin was member) took over the realm of power, not just any power, but the most powerful nation on earth, where all policy was directed by a handful ring of revolutionary students, who thought that the Middle East needed a facelift, and the only method was to start revolutions. The tragic part is that what you will read here is no fantasy or a simple school project, it is a reality that caused global destruction. It is in fact the prelude to World War III. \\nFeast your eyes into the secret workings of the Hillary band-of-trouble makers. You will only conclude that Hillary Clinton and her aide, Huma Abedin, should not just be imprisoned, but should face the execution by lethal injection for all the crimes they have committed against humanity. \\nReading through the volume of emails makes the operation easy to comprehend. A handful of opportunists with spy-huma continually flatter Hillary. Huma closely watches her confused buffoon boss and they all feed her daily dosages of unreliable information to form her mind by exerting undue influence. At times Huma even tells Hillary what time to “take a nap”. Huma even disclosed to another opportunist staffer that their boss is ‘Often Confused’. \\nOf course, with a confused boss, Abedin had access to Hillary’s Secretary of State email address that was not even secure using her email server to read everything coming in and everything going out. All this, regardless that she had no clearance to operate under such capacity. How she collected 650,000 emails does not take a rocket scientist to calculate. \\nAbedin worked for Hillary since 1996. 650,000 emails would average at 90 emails per day. Why would any simple aide want to store 20 years worth of secret emails on another computer besides hers, calls for question that what we are dealing with here is more than just an ‘aide’ but a hijabless spy taking the buffoon on a wild camel ride to create a Muslim Brotherhood revolution. Wrong. This buffoon is not a Hillary’s double and is not ‘photo shopped’ \\nIt is clear from the volumes of emails we obtained so far from Wikileaks, Huma then becomes the conduit and filter that ‘provides or denies access’ and dispenses just the right media press needed to form Hillary’s worldview on all things ‘Middle East’. This information concluded the policy which provoked civil unrest throughout the Muslim world. The team’s duty was simply to build walls and fortifications making it hard to reach Clinton while ‘Charlie’s angels’ accomplished what was needed. First, to prove American’s are voting for a buffoon is easy. In one example, Huma with undue influence writes Hillary: \\n“I understand you are ok making the abu mazen call. Everyone agrees you should make it and they want you to do it today.” \\n“Everyone” is the gang. They wanted her to speak to the Palestinian Authority leader Abu Mazen (Mahmoud Abbas). Hillary responds: “I don’t know what I’d say“. Huma would write back “these are points from him about what to say. And they asked if you would do today.” \\nHillary can’jt seem to survive without Huma, she writes Huma: “let’s go on our trip. I think it’s worth it. And we can always add Israel as we did before!” \\nHuma: “Ok great! We’ll do ecuador now cause otherwise we lose him. So pinato, mubarak, lobo.” \\nHillary: “That’s fine. How are you doing?” \\nHuma: “Excellent. Yesterday was a madhouse but got a lot accomplished.” \\nHuma bossing her buffoon boss, can’t seem to have Hillary do a simple task: “can you hang up the fax line, they will call again and try fax Just pick up phone and hang it up. And leave it hung up.” \\nObedient Hillary: “I did.” \\nHuma: “Yes but hang up one more time. So they can reestablish the line.” \\nHillary is so stupid “I thought it was supposed to be off hook to work?” \\nWhen Huma wants things done (like when she wanted favors for the Saudis) Huma would use key names who said that Hillary “should to do it”. The “aged Saudi ruler” needed to expedite his travel and Huma comes for the rescue. Huma would tell Hillary: “Jeff mentioned we are helping expedite visas for [Saudi] delegation.” \\nThe circle who influenced Hillary most had everything in common regarding political views. Huma, a Muslim, and a couple, of really, the most self-hating Jews money can buy, the Blumenthals, used what Hillary gobbles up most: flattery . Huma even nicknames Hillary “Fabius” a throwback to Quintus Fabius Maximus a Roman politician around 280 BC who was twice appointed Dictator.”Reminder fabius at 3:30 Take a nap” Huma tells Hillary as if she was mother and Hillary is a crib-ridden child. \\nAfter every speech or interview, this handful, her gang, would chime in “powerful” “wonderful” as to fatten the bosses’s head. Sidney Blumenthal who had made the greatest impact on Hillary was a senior adviser to Ms. Clinton during her 2008 and then was shut out of the State Department by the White House in 2009 for all his shenanigans. Presidential advisor Sidney Blumenthal, center, departs Capitol Hill after being deposed by House prosecutors Wednesday, Feb. 3, 1999 \\nBut now we know one of the reasons why Hillary wanted a private server. Through the Jewish Blumenthal and even his two sons, Hillary was under constant undue-influence and pressure to trust and believe un-vetted opinions titled as “facts” from supposedly “trustworthy” “secret sources” from “sources close to governments”. As it turns out, it was all third-hand rumors guised as ‘reliable’ and ‘confidential’ which formed the judgments of one of U.S. government’s most powerful figures. \\nSo if the issue at hand was the nation of lets say, Kyrgyzstan, Blumenthal would send Hillary some radio jockey’s (Scott Horton) report: “Scott Horton has just returned from a week in Kyrgyzstan, where he held lengthy private conversations with a range of leaders.” \\nWhat “range of leaders” was simply bogus. All Blumenthals contacts supposedly had ‘inside intel’, they are supposedly well connected to all the higher-ups. Despite his untrustworthiness and his opportunism, the Blumenthal’s had a lion-share of Hillary leaked emails . They continued their influence over Hillary by even having Max, Sidney’s son, one of America’s most notorious Israel haters, continually corresponding with Hillary influencing her mind. She loved his unsubstantiated articles and responded very favorably to them. With a private server they can now bash anyone who does not agree. Even Shoebat.com was not immune from reaching Hillary who was interested to later spread all sorts of slander on us. \\nBlumenthal’s writings was the springboard to Max’s anti-Semitic Goliath , comparing Israel to the Nazis, even calling for the expulsion of the Jews from Israel, while comparing the Israel Defense Forces to the SS. Hillary was obliged to respond with favor: \\n7/6/2010 – “Pls print 5 copies but w/out heading from Sid.” 8/17/2010 – “Pls congratulate Max for another impressive piece. He’s so good.” \\n11/18/2010- “A very smart piece as usual.” 4/7/2011 – “Will Max’s piece be published anywhere else? It is powerful and touching.” 12/23/2011 – “Max strikes again!” 1/21/2012 – “Interesting reading.” 9/13/2012 “Your Max is a mitzvah!” 12/7/2012 – “Good stuff. Where is he now?” \\nHillary’s favorite reports were Max’s, sent to her via his father Sidney, especially one that raised our eyebrow, on tracking ‘the dangerous Islamophobist Cabal’ revealing Shoebat as one, where Hillary requested the report printed for her read. Reports that attempt to minuscule the whistle blowers as “whacky” is written by Max who signs his name “ Blumenthal, The Great “. \\n“I’m at the post office but Huma has this printed for you” responds Monica Hanley regarding the report on us and the other dangerous ‘phobes’. \\nLiterally, hundreds of missive emails sent to Hillary completely re-brainwashing an already brainwashed buffoon with all sorts of conspiracy theories and untrustworthy information. \\nAnd if Max Blumenthal was ‘like father like son’, Huma was ‘like mother like daughter’ and was not much different from the Blumenthals. The true color of Huma was revealed when one major Hillary Clinton Jewish donor, Haim Saban, in one article complimented Hillary (its how you get in) while stating that there needs to be more scrutiny on Muslim immigrants, Abedin, the filter, was not thoroughly pleased, of course, and had to chime in scolding the Jew who had some anti-Muslim immigration ideas: \\n“Good interview. Thanks for sharing. But what you are saying about Muslims not consistent with HRC. Are you aware of that?” \\nIn other words, if you want to get through to Hillary, Huma was the gate-keeper and an ‘open sesame’ requires that everyone say the magic words about Islam or say something nasty about Israel. \\nIncluding all the anti-Israel reports will take an entire book. Yet when it came to Christians, we find nothing, not even a scant of services. Hillary would not reprimand Philippe Reines on his “mother teresa” comment calling Christians “those crazy right”. In an email by Reines sent to Hillary and copied to Huma regarding a Catholic orphanage, an adoption ministry, Secretary of State Hillary Clinton hailed as “a home she helped open with Mother Teresa” was closed down by red tape, Reines writes Hillary: \\nJust FYI on the below, from one of those crazy right “magazines” – notes that the home you referenced in your Prayer Breakfast remarks has since closed. \\nThere was no reprimand by Hillary to the type of language her advisor used. When it was a Christian publication, it was always dubbed “crazy right”. \\nBut perhaps satanism amongst the elites (and after reviewing the emails) is no longer conspiracy theory. The leaks from Colin Powel’s phone and Wikileaks match emails from Blumenthal to Hillary: \\n“I had lunch yesterday with Philip Bobbitt, who told me he had recently been at the Bohemian Grove and had lunch there with Kissinger and Colin Powell.” \\nEven the reputable National Geographic refers to the Bohemian Grove as having some pagan rituals and included the photos. Perhaps all the Free-Masonry theories about starting revolutions which I doubted as ‘conspiracy theory’ do have merit that what we are dealing with here are satanic elitists who call all truth ‘conspiracy theory’. \\nThere was not one comment revering Christianity or anything Christian. In reality, what difference does it make whether Huma bows to a black stone, like the ancient Jews of the Sinai, who switched from their God Yahweh and bowed to a golden calf, or the elites bowing to Molech or an owl at the Bohemian Grove. It all shows, for one to get ahead, they must first ensure their names are first blotted out from the book of life. Indeed, there is neither Jew nor Gentile, there is only good or evil. \\nVanity of vanities. But here comes the beefy tostada, that every American who votes, need to start paying close attention to. The “best way to help Israel” is to start a war in Syria was Blumenthal’s grand idea. Anyone is welcome to access Wikileaks and see : \\n“The best way to help Israel deal with Iran’s growing nuclear capability is to help the people of Syria overthrow the regime of Bashar Assad.” \\nFinally, every American now can snoop into the elitist thinking, to see how camel dung is made, processed, and fed to American liberal buffoons who hate America’s Christianity. Today is the day (just days before the election), we can remind you that ‘we told you so’. \\nIn an email sent by Sidney Blumenthal to Hilary Clinton suggesting that Iran would lose “its only ally” in the Middle East if the Syrian regime collapses. Our snooping into Hillary’s emails allows us to look into the Israeli political debate in 2012, where the decisions made caused an outcome making Iran stronger than ever. And despite the disastrous Syrian civil war with hundreds of thousands dead and millions displaced, Clinton still clung to the formula like Hitler clung to the trains, opting to transfer Jews to the crematoria than reverse course to save his nation. Likewise, Hillary continues on the destructive path. The email on 11/30/2015 reveals everything we need to know about Hillary and her gang’s mindset. \\nAnd when it comes to Syria’s revolution sparked by the Free Syrian Army who were truly nothing more than Muslim Brotherhood, Islamist Jihadi rebels, who wanted to establish a Sharia driven government, Hillary would obtain the analysis from her henchman and aide, Robert Russo, regarding the makeup of the rebels. And just as the typical Muslims on the streets would do, Hillary instead of relying on CIA reports, obtained Al-Jazeera’s false narrative. This even excited Hillary that the FSA “are not fighting for Islam but they are [only] inspired by it”. The subject title for Hillary would read “MUST READ ON COMPOSITION OF SYRIAN FSA”. \\nThe rebels in Syria were painted as ‘partial Islamists’ who do not believe in imposing Sharia law, but only used Jihad as a means of warfare against Bashar’s tyranny. \\nMany times Hillary would be in hibernation mode as the gang sent her dosages of mind forming articles from Al-Jazeera clips about how the Muslim world do not really hate the U.S. and that the real problem were strictly the Arab regimes that needed uprooting. Hillary would thank them for the info: \\n“Sorry I’m so far behind in responding–and thanking you–for forwarding this to us. The last month has been a whirlwind which is not likely to calm down …” \\nThe gang would encourage her with more flattery: \\n“You of all people NEVER need to apologize. Truly can’t wait until you are out and I can work with you again on issues we both think are so important.” \\nThe agents were less than crystal clear about anything, blaming innocent scapegoats and creating phony alibis, while mixing truths with lies. Truths like the Bush ‘no WMD’ in Iraq, which indeed was a faulty conclusion, but that the best way to fight Al-Qaeda is to continue Bush’s scandalous legacy, to destroy Iraq while they also destroy Tunisia, Libya and Egypt too … \\nSo under the guise of ‘aiding Israel’ they called to ‘destroy Syria’. \\nReading these emails reveal just how ugly is the reality we live in, that the best way to remove any secular government in the Muslim world was to install an Islamist one. In an indication of her murderous and psychopathic nature, Buffoon Hillary, also wrote back in December 31, 2012, that it was the “right thing” to personally threaten Bashar Assad’s family with death. Even the New York Times revealed this and began to pick up on more: Blumenthal’s memos, often appending a note: “Useful insight” or “We should get this around asap.” In an August 2012 memo, Mr. Blumenthal described the new president of Libya, Mohamed Magariaf, as someone who would “seek a discrete relationship with Israel” and had “many common friends and associates with the leaders of Israel.” “If true, this is encouraging,” Mrs. Clinton wrote to Mr. Sullivan. “Should consider passing to Israelis.” \\nBlumenthal would send emails with outlandish subject titles like “Subject: H[illary]: HIGHLY IMPORTANT! COMPREHENSIVE INTEL REPORT ON LIBYA. AND DRINK 8 GLASSES OF WATER. SID” \\nHillary responds with “I’m happy to report that”. The key bait given to Hillary to believe these reports and approve them was this style: \\n“Speaking on condition of absolute secrecy, a source with access to the Office of the President stated that during late December 2012 Magariaf and Zidan agreed that they must move quickly to deal with these problematic issues before they can address their long term strategy of developing productive diplomatic and business relationships with their neighboring states in North Africa, Western Europe and the United States.” \\nBlumenthal wanted business opportunities in Libya and Hillary was the key. The terminology to make Hillary believe was the use of jargon used by phony reports “confidential” “absolute secrecy” “sensitive sources” “According to a very sensitive source” and “In the opinion of this sensitive source” “Extremely sensitive sources” to even “Sources with direct access to the governments of Libya and Israel, as well as the highest levels of European governments, and Western Intelligence and security services …” \\nIt was all bogus, the type of charade one find in Nigerian scams or DEBKAFile reports that come from supposedly Israeli intelligence where no serious sources are given. \\nBuffoon Hillary would get her intel from the conspiracy theorist, Blumenthal, who claimed that Libya’s Magariaf has plans and connections to make peace with Israel. The Buffoon had no clue, Magariaf has no links to Israel whatsoever. It was all a hoax, undue influence on a left-wing loon. \\nRegarding the Egyptian revolution, the reports were void of the fact that the revolution was in reality a Muslim Brotherhood takeover. In one report Blumenthal even displays a fanciful victory against the Muslim Brotherhood by “nationalist football hooligans known as the Ultras”. \\nIt was as if the football hooligans represented the revolution. The key was to finagle the truth, use sophist and complicated jargon as to sound legit, and keep Hillary believing a fantasy, that Egyptians are tired of the tyranny of both, Hosni Mubarak as well as the Muslim Brotherhood, while explaining that is why they are staging a rebellion in Egypt. \\nTruth is, the unrest was fomented by Washington and it was clearly a Muslim Brotherhood uprising as we have warned in the initial stages as the outcome was revealed later when it was too late. For example on the faulty labeling of terrorists as ‘moderate’, in one report to Hillary, Blumenthal writes : \\nI have included below a private report from “Stratfor” that underscores that Syria is attacking the moderate wing of Hamas and the Palestinian accord. \\nThe simplistic labels worked. Hillary never asked is there a ‘ moderate wing of Hamas’ and a ‘ moderate wing of Al-Qaeda’ and a ‘ moderate wing of the Nazi party’? Yet nowhere in Strafor’s report does it even use such oxymoronic terms. \\nAnd how Hillary was obtaining her influence on everything Middle East came strictly from this un-penetrable little circle. \\n“The analysis on events in Egypt ring true to me” Hillary responds to one of her aide henchwomen, Anne-Marie Slaughter. The latter was acting like a college student, all excited about her dissertation as to why Egypt needs a populace control instead of the current structure, objecting why Egyptian heads of state were ‘military’ rulers and not ‘civilians’. \\nSlaughter according to her bio : “From 2009–2011 she served as director of Policy Planning for the United States Department of State, the first woman to hold that position”. But when the results were disastrous since the real world at times is not explained by just bookworms, like Hillary’s Benghazi fiasco, it was Mrs. Slaughter who sends Hillary the ointment, more deception that the rebels in Libya really love America: \\n“To have Libyans carrying placards saying “We are sorry America; this does not represent Islam,” is exactly what we hoped for when we supported the Libyan intervention. Many Libyan bloggers/tweeters have taken the same stance. And to have elected Libyan and Tunisian governments publicly apologizing and denouncing the violence shows a very different face of Islam — the Tunisian government is a Muslim Brotherhood government …” \\nIn other words, the Muslim Brotherhood was tame. To Hillary and her gang, it was no longer that this cobra spawned Al-Qaeda and Hamas and even those had ‘moderates’. It was ‘the Muslim Brotherhood loves America’ and therefore, Hillary ‘loves the Brotherhood’. \\nHillary was completely brainwashed to believe Egypt’s Muslim brotherhood will revive as a non-Islamist movement or half-Islamist ‘moderate’ and will all fix itself as it shifts from being uncontrolled by the military. She responds to one release which said: \\n“The last couple of weeks have seen a shift in Egyptian politics. It appeared that the Egyptian President, Mohammed Morsi, exercised his authority over the military establishment, and dismissed Field Marshal Mohammed Tantawi.” \\nThey just love this word ‘shift’ as if evil shifts and evolves to the better. The Muslim Brotherhood therefore played an important role in the dream world of Hillary that “military rule” is no more and now its populace rule as planed by the gang. \\n“The analysis on events in Egypt ring true to me” responds Hillary. After all the intel sent to her said: \\n“Hosni Mubarak, in this regard, was not a civilian authority: he was a military one, and part of the same structure, which simultaneously occupied the president’s office.” \\nSo when “ousting all dictators” domino effect began sparking in Tunisia, Huma would send Hillary the praise reports that now she is a prophetess: \\n“It was a fallout she herself [Hillary] had warned of just two weeks earlier. In a dramatic speech in Qatar, Clinton warned Arab leaders their regimes would “sink in the sand” if they did not reform their autocratic governments and create opportunities for their young citizens. Two days after that speech, Tunisia’s President Zine El Abidine Ben Ali fled the country after he was overthrown amid massive protests. Inspired, Egyptians began similar protests. Now, the U.S. pondered the potential fall of Hosni Mubarak — a critical ally who for 30 years served as a linchpin of security in the Middle East — which would dramatically affect America’s entire policy in the region for years to come. “There were a first few moments of wonderment and then she said, ‘We have to dive in,” recalled Cheryl Mills, Clinton’s counselor and chief of staff. Bad timing for a tough test …” \\nOne would think that such news was a disaster, but the message from Huma was simple, it was plan in progress. In other words, thus said Hillary and the world moved. Hillary thou art Fabius and now she can nap again. \\nAnd Muslim Brotherhood ‘populace control’ they got. And what would sound troubling to the normal mind, Huma would send a praise Hillary report . She could not even wait till she signed into Hillary’s server. She writes from state.gov to Hillary, giving her the news of the salvation caused by her messiah; riots sparking the Arab Spring starting in Egypt and spreading to Yemen, Libya, Kuwait, Pakistan, Indonesia, Malaysia, Sudan, India and Iran. To the ‘gang’ it was like watching a fireworks as Huma, the real boss behind the scene gives Hillary full credit: \\nI’m giving you credit for inspiring the “peaceful” protests. \\n“Peaceful” in quotes was meant to mean “nothing peaceful”. Captain chaos did the job. Even when Huma reported to Hillary “The Muslim Brotherhood, the big winner in the first election since the ousting of President Hosni Mubarak last February”, this was ‘good news’ and all Hillary did was to respond with some romance : \\nHave I told you how much I miss you on these trips? Not nearly as much fun [without you]. \\nHillary wanted Huma by her bedside. Huma, of course, with flattery speaks of their adventures together: \\nOh that’s so nice to hear!! Its soo hard to not be there. I miss our many adventures. Jeff feltman is beside himself that you emailed him bday greetings….says you are “incredible“. \\nFrom the rise of the Muslim Brotherhood in Egypt, to Al-Nahda’s Muslim Brotherhood success in Tunisia , Huma would send the news reports to Hillary as if it was ‘mission accomplished’. One cannot find a single line of any worry or comment resembling ‘we screwed up’. The Hillary gang would even send their boss images on how beautiful Ramadan was from images and photos on Al-Jazeera, the type of which dazzles Hillary’s imaginations. A Palestinian boy in Gaza City plays with fireworks to celebrate the beginning of Ramadan \\nIt was all progress as usual as if chaos was the goal. It is as if Hillary herself was Muslim or that this retard team of women thought they were about to take control of Islam to revolutionize it as Huma says ‘Yay’ when the Saudi Monarch stopped the lashing of a woman for driving. \\nEvil is always tucked under the good, just as camel-dung is tucked under the non-existing snow of the desert. The outcome was that the Clinton/Obama Administration, this whole time, has been the main sponsor of the growth of terrorism in the Middle East, refugee crisis to destroy Europe, real conspiracies that caused the death of countless Assyrian, Copt, Orthodox and Catholic Christians, and all was done in the name of “protecting Israel”. \\nYet we were painted by Clinton’s media henchmen as “the conspiracy theorists”? \\nUS support of Huma’s family’s dream aiding Saudi Arabia, financially and logistically, backed Syrian Islamist rebels which helped lead the creation of ISIS, a policy led to a war that has dragged in Turkey, the Kurds, Russia, Iraq, Iran, our Gulf allies and too many radical terrorist organizations to count, into the apocalypse, the very quagmire we see today which will lead to World War III. \\nIt is perhaps an ideal time to reveal the man whom everyone thought was so conspiratorial that he was viewed as Balaam’s donkey. Yet it was this donkey, Mummer Gaddafi , who prophetically declared to the Arab Summit that after killing Saddam Hussein, he told Bashar al-Assad “you will be next”. Watch Bashar Al-Assad smile as if what this donkey said was madness: \\nGod can speak through a select donkey while the geniuses laughing were the real jack-asses. To Hillary, Huma and the gang, the tribal leaders are ‘out’ and the Islamist universalists are ‘in’. \\nIt took years before Americans woke up to the ugliest of realities, where much repentance is needed, as to what happened to people, be it Muslim or Christian. Over a quarter million butchered. Lord have mercy. Do not exclusively blame the terrorist for the ISIS attacks on U.S soil. We all reap what we sow. \\nWhy Israel and the U.S. want the Arab tribal leaders removed is simple to explain. It was either that the Russian influence is weakened or creating chaotic Islamist regimes will finally unite Russia, Europe and the U.S. to unify against the Islamist savage. But this thinking disregards that creating such a Muslim beast brings utter destruction to the Christians and all secular pro-west Muslims living under the devil’s rule as we see Turkey’s call to be the peace-keepers of Iraq and Syria, in fact, the whole of the Muslim world. \\nWith Hillary, the gang conspired to subvert the power of the office of Secretary of State to violate UN Charter, International Law and U.S. law committing treason and committing war crimes. \\nAnd while claiming ‘love for Israel’ or we ‘did this for Israel’ reality was much different. The gang were acting more like a Muslim Student Union at a college campus. They were feeding Hillary all sorts of mad ideas to raise monies for “Palestine” while shaming Israel . Hillary would even respond with: “I am very interested”. Her aide Marie Slaughter dreamt this fanciful idea to have Hillary influence billionaires donate for Palestine: \\n“This may be a crazy idea, but as far as we can tell we need ideas. Suppose we launched a “Pledge for Palestine” campaign that copies Warren Buffet’s “The Giving Pledge” campaign, described below — he’s trying to get 40 billionaires to give away most of their money. I had asked some S/P folks to think about how we might take that campaign global to help change the attitudes of elites in places like Pakistan and Latin America, but perhaps Warren Buffet could be convinced to lend his name — or perhaps Michael Bloomberg or Danny Abraham (together with a very wealthy Muslim) – to a similar Pledge for Palestine campaign. Such a campaign among billionaires/multi-millionaires around the world would reflect a strong vote of confidence in the building of a Palestinian state and could offset the ending of the moratorium for Palestinians (there would also be a certain shaming effect re Israelis, who would be building settlements in the face of a pledge for peace). With even 30 calls to the right people in the Clinton fundraising network it should be possible to generate a substantial enough amount quickly enough to capture the public imagination on the heels of the President’s speech and, critically, to serve as an expression of global solidarity with the Palestinians“ \\nHow these women expected 40 billionaires to give up “most of their money” and wealth in a fundraiser for Palestine is the type of dreams one finds in a fantasy book. Did this gang of women think they are in the era of one thousand and one nights copulating with some Caliph to persuade him to pay all of his kingdom? \\nFrom Egypt, to the Freedom Flotilla in Gaza, Hillary was interested responding with “please print” “print” print” and “print”. \\nPrint what? How “this [Turkish supported Flotilla to Gaza] is movement that is going to grow and grow and that is going to be impossible to stop”. A revolution into the heart of Israel coming from the sea from all over the Muslim world was the gang’s solution to the Israeli-Palestinian problem. \\nHow is that good for Israel? So in the name of ‘aiding Israel’ they ‘destroyed the Arabs’ and in the name of ‘aiding Israel’ they were ‘destroying Israel’. \\nAnd when in 2009, the Muslim Rashad Hussain, was named deputy associate counsel to President Barack Obama, he tried to break protocol writing Huma directly: “Hope you are doing well. I’m looking forward to getting started as soon as possible”. Huma then writes to Cheryl Mill knowing that Cheryl was on vacation to deal with this “I Don’t want to bother you on vacation but see below”. Denis McDonough who was copied answers: “Weird. I will take care of this”. \\nRashad Hussein was not careful and stealth enough to enter the inner circle to promote the OIC (Organization of Islamic Conference), which is also Huma’s mother’s aspiration to join forces of the Muslim Brotherhood. He was appointed by the government and made comments to the Musim Student Association in 2004 supporting the convicted terrorist fundraiser Sami al-Arian. A direct contact with Rashad who was toxic could compromise everything. \\nYet Hillary still consulted Rashad via Jacob Sullivan. Rashad was not told that it was Hillary who wanted the advise. She had asked “ Does he [Rashad] have any suggestions as to how we handle the Ulema?” \\nUlema is Arabic for Muslim scholars . Rashad did not even know the advice went to Hillary who wanted an education on how to handle the Quran when meeting Muslim scholars: Jake- A few points (including some background) to respond to your friend’s question– Muslims believe that the Quran is the direct word of God and the final revelation that was sent to correct human changes that were made to the messages sent to previous prophets (Abraham, Moses, Jesus, etc.). They believe that the message sent to these previous prophets [Judaism, Christianity] was essentially Islam, but was changed [by Jews and Christians] because the texts (Bible, Torah, etc.) were not preserved… certain rules of etiquette have developed for handling the Quran: … one should keep the Quran above the waist when handling it and should keep it only in clean places (definitely never in a bathroom) … many scholars would say that unless non-Muslims are handling it for educational purposes, they should avoid handling it all together. In terms of disposing of old Qurans or other documents with God’s name, your friend is right … Muslims guard vigilantly against the deification of any person, including the Prophet Muhammad, because they fear that people will begin to worship him (as Christians began to worship Jesus … there have been so many recent instances of desecration in the news that people are not as shocked as they used to be to hear these types stories (Terry Jones, Gitmo toilet story, urination on corpses story) … That said, Muslims all over the world are definitely saddened/upset by the news, but for the most part, they understand that the Quran itself teaches that violence is not the answer. Rashad \\nSo Hillary was getting her Islamic education via Rashad Hussain. Hillary knew that claiming the Son of God and that Jesus is God was an insult to Muslims. \\nHillary’s chief of staff and counsel Cheryl Mills, during the time Michelle Bachman began to disclose our findings on Huma’s entanglements with Islamists, Abedin and family sent Hillary the media’s praise report of Huma: \\n“There’s John McCain, Lindsey Graham and Ed Rollins, Republicans who leapt to the defense of Hillary Clinton’s top State Department confidante when Rep. Michele Bachmann (R-Minn.) suggested that she just might be a traitor. There’s a Facebook group of folks who “stand with Huma.” (PHOTOS: Huma Abedin) And there are countless women and men around the country who thought she handled her husband Anthony Weiner’s Twitter malfunction with all the grace and elegance that he lacked. Abedin’s finding out an enduring truth of Washington politics: Yesterday’s victim is tomorrow’s hero.” \\nBut now things are different. The Muslim Brotherhood spy, Huma Abedin, by withholding evidence during her FBI interview having a home computer, then lying that she did and after showing that there were over 650,000 emails (these are ‘state.gov and HRC emails’) sent to her husband from that computer, Huma Abedin just cancelled her immunity deal. Now after examining some of the other leaked emails, this Muslim Brotherhood snitch, would either have to spill the beans on Hillary or face jail. \\nFor years they said we were ‘mad’ for exposing Huma, but finally the snow melted and this Hijabless camel is revealing all the dung that was hidden beneath the imaginary snow. \\nO how the tables turn, “tomorrow’s hero” will become Hillary’s scapegoat and tomorrow’s re-discovered Muslim Brotherhood “spy”. To understand all this, read the most extensive research we did on the topic which leaves no question to Huma’s family ties, not just to the Brotherhood, but to the Islamic revolution worldwide: \\nNice to have made your acquaintance Jezebel Clinton. Hope you end up in prison with your Muslim aide, PUN intended. Enjoy my report when you get it referring to me as “shock jock” and “right wing nut”. \\nArticle reposted with permission from Shoebat.com Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . \""}, "time": 1742562592.485425}