{"duration": 0.07927656173706055, "input_args": {"text": "'After eight years of Barack Obama putting his office into permanent campaign mode while keeping his campaign machinery in constant operation, NPR is accusing Donald J. Trump of waging  a “permanent campaign. ”[In a February 17 article, NPR’s Ron Elving claimed that the American people are tired of presidential campaigns that last too long, but “Now, they are confronted with one that refuses to end  —   even after reaching the White House. ”  Elving’s attack on Trump came in response to the President’s often combative February 15 press conference that the NPR Washington correspondent described with a simple “Wow. ” After noting the criticism of the presser published by various news outlets, Elving then complained that Trump used “I” or “me” or “the royal we” too often during his presentation. The NPR staffer then went on to say, “The president often seemed to be responding in the manner of a candidate. ” He added, “The campaign mode continues this weekend, with the president again rallying like it’s 2016. ” Elving suggested that Trump might be being using this “permanent campaign” as a tactic to keep his policy ideas at the front of the political discussion. “Or perhaps the campaign continues because it continues,” Elving said as he wrapped up. “The president does not yet seem comfortable in his new office with all the crosswinds and complications of divided powers and shared responsibilities. ” Perhaps Elving has been in a coma since 2007, when Obama launched a campaign for president that didn’t end until he left office on January 20, 2017. Obama spent eight years being hit with charges that he never stopped campaigning, It was one of the most common criticisms of the Obama presidency. In fact, Obama kept his campaign apparatus, Organizing for America, in operation even after what he claimed would be his “last election. ” In December of 2012, for instance, The Observer remarked that OFA was still soliciting contributions months after Obama won his second term. Indeed, OFA is up and running today, aiming to undermine Donald Trump  —   and many are making note of it. Obama continues to issue tweets using the OFA Twitter account, and gives marching orders to his OFA army, even in reputed retirement. In August of 2009, former George W. Bush political advisor Karl Rove charged that Obama was continuing to use “divisive,” and “permanent campaign tactics” despite easily winning his election. The Washington Times observed the same thing. The claim was not made only by disgruntled conservatives or   news sources, either. In 2013 The New York Times wrote that Obama’s “campaign without end” was fundraising in an “unprecedented” manner. Before that, the Washington Post’s Dana Milbank commented on the issue in May of 2012, saying that Obama had “embraced the permanent campaign” and was flying all across the country leading   rallies to push his agenda. “To a greater extent than his predecessors, Obama has used the trappings of his office to promote his reelection prospects even while handling   business,” Milbank wrote. In addition, several   websites and commentators actually celebrated Obama for using campaign tactics to continue to sell his ideas. MSNBC praised Obama for “putting the permanent campaign to good use,” and The Atlantic marveled that Obama’s “permanent campaign” was using his “reelection playbook to change Washington. ” With all this, it is interesting that today NPR’s Ron Elving seems to have only just noticed that a president is perpetrating a “permanent campaign” to keep his policies on track to completion. Finally, it was rather tone deaf for Elving to criticize Donald Trump for using “I” and “me” too much, coming off the last eight years of a president famous for his narcissistic references to himself in every appearance. Despite mocking the penchant of the   press for keeping count of his   habits, The Washington Post recently published a piece noting just how often Obama talked about himself. After all, Barack Obama was the president so enthralled with himself that he gave the Queen of England the dubious gift of an iPod filled with Barack Obama speeches. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742564217.0872748}