{"duration": 0.09472370147705078, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump, in a   speech Wednesday night at a dinner honoring his running mate, Mike Pence, jabbed at his new Republican allies and his critics alike, questioned the ethics of “super PACs” and talked about creating a “ ” immigration system. Mr. Trump credited Mr. Pence with helping to bring critics around to the ticket. “They all liked Mike. They were a little bit, you know, a little concerned with me,” the   said, drawing laughter from the crowd of about 500 people, which included donors, cabinet appointees and other supporters. Mr. Trump said that his aides told him that he was not required to be at the dinner, but that he thought he had to be there to honor a man whose role on the ticket he described as one of his best decisions. Mr. Trump lauded Mr. Pence in a roughly   speech, but poked at him for declining to endorse his candidacy in the primary in Indiana, where he was governor, instead backing Senator Ted Cruz of Texas. “The fact that every donor he had was in favor of” Mr. Cruz played no role in the decision, Mr. Trump said sarcastically, according to a recording provided by a guest. In the  ’s telling, Mr. Pence essentially endorsed him, and mentioned Mr. Cruz only as an afterthought. Mr. Trump also took aim at Mr. Cruz (a “smart guy, he was a little late to the plate, but that’s O. K. ”) Gov. Scott Walker of Wisconsin, a rival in the primary (“he can be nasty, that Scott Walker”) members of the “Never Trump” movement (“they’re really right now on a respirator they’re pretty much gone”) and the casino magnate Sheldon Adelson (he mocked him for being late to donate promised money to outside groups supporting his candidacy). Such groups, like super PACs, need to be “straightened out,” Mr. Trump said. “People get very rich running PACs. ” On immigration, two days before he assumes the power to begin rolling back President Obama’s executive orders, Mr. Trump said: “We’re working on the border. We want people to come into our country, but we want them to come in legally. ” He added that he wanted the immigration system “at least a certain degree to be  . ” It was not clear what that would entail. Mr. Trump, who has proposed “extreme vetting” of immigrants to weed out potential terrorists, said he wanted people who arrived here to work hard, but added, “We want people to come into our country who are going to love us and respect us. ” In a series of interludes and asides, Mr. Trump described asking the House speaker, Paul D. Ryan of Wisconsin, to focus on the effort to replace the Affordable Care Act, then shifted to talking about a change to the tax system. Mr. Trump said that people compared his success to the popular movement that put Andrew Jackson in the White House. “There hasn’t been anything like this since Andrew Jackson,” Mr. Trump quoted his admirers saying. “Andrew Jackson? What year was Andrew Jackson? That was a long time ago. ” Mr. Trump then gave the year  —   1828  —   and went on to suggest that his own nationalist movement had usurped Mr. Jackson’s. He said that even “the haters” who disliked him called his movement “unprecedented. ” Mr. Trump expressed gratitude to black voters who had stayed home on Election Day “because they liked me, or they liked me enough that they just said, ‘No reason. ’” Before returning to New York, Mr. Trump stopped by the Trump International Hotel, a few blocks from the White House, to have dinner. He did not dine at the Pence dinner or at a later dinner for his cabinet picks.'"}, "time": 1742563808.9799902}