{"duration": 0.06487226486206055, "input_args": {"text": "'NATO pushes military buildup plans near Russia Wed Oct 26, 2016 6:7AM EU NATO Secretary-General Jens Stoltenberg speaks during a news conference at the alliance’s headquarters in Brussels, Belgium, October 25, 2016. (Photo by Reuters) \\nThe North Atlantic Treaty Organization (NATO) is pushing for its biggest military buildup near Russian borders, as the Western military alliance continues to harbor perceptions of a Russian “threat” since the days of the Cold War. \\nNATO Secretary-General Jens Stoltenberg will discuss the plan for military deployments to the Baltic states and eastern Poland at a two-day meeting of NATO ministers in Brussels on Wednesday. \\nThe military alliance aims to send “battle groups” to the Baltic states and Poland early next year. The groups will consist of 40,000 forces. It will be the biggest military buildup near Russia since the Second World War. More forces would also be deployed if necessary. \\n“This is credible deterrence. Not to provoke a conflict, but to prevent conflict,” Stoltenberg claimed contradictorily on Tuesday, referring to the planned deployments near Russia. “Concrete proof that NATO can and will deploy thousands of forces to support our allies. And a clear demonstration of our transatlantic bond.” \\nThe United States, Germany, Britain, and Canada have already agreed to contribute forces to the “battle groups,” which are to be deployed to Poland, Lithuania, Estonia and Latvia. Norwegian and Italian fighter jets patrol over the Baltics during a NATO air policing mission from an airbase in Lithuania, May 20, 2015. (Photo by Reuters) \\nFrance, Denmark, Italy and other NATO members are expected to contribute forces of their own but have been reluctant so far. \\nAnti-Russia by default \\nRussia had previously warned that it would take unspecified measures to respond to the increased activities by the Western military bloc. \\nIt also moved nuclear-capable missiles to its westernmost region of Kaliningrad, near its border with the Baltic countries and NATO member states earlier this month. The Iskander-M cruise missiles are capable of hitting targets across Poland and the Baltics. \\nNATO was formed during the Cold War as a means of countering the former Soviet Union. \\nThe military alliance suspended all ties with Moscow in April 2014, after the then-Ukrainian Crimea Peninsula voted in a referendum to join Russian territory. \\nShortly afterwards, an armed conflict broke out in eastern Ukraine, areas inhabited by an ethnically-Russian population. The Ukrainian government, which militarized the originally peaceful unrest in the regions — known as the Donbass — has ever since been accusing Russia of having a hand in the conflict there. Moscow denies the claim. \\nThe conflict has so far claimed the lives of more than 9,200 people and left over 21,000 others injured. Loading ... '"}, "time": 1742564523.111293}