{"duration": 0.09930276870727539, "input_args": {"text": "'Posted on November 7, 2016 by Walter Brasch \\nWith less than a week until the election, just about every voter in the swing states has received dozens of robocalls, e-mails, letters, postcards, and exposure to almost-uncountable radio, TV, digital, satellite, and social media ads. Most are attack ads, with similar messages. \\nThe ads focus upon homeland security, taxes, immigration, pro-life/pro-choice, and bringing jobs back to America. The conservatives have thrown in the phrase “liberal extremists” in many of their ads in an effort to shock all America to believe that liberals are somehow tied to Muslim extremists. The liberals are pushing an agenda that defines the conservatives as greedy plutocrats who have little thought for the middle class. This election, from local offices to the presidency may be the dirtiest since 1800 when Thomas Jefferson challenged John Adams. \\nDonald Trump, who has outsourced much of his clothing line and construction materials, now says if president he will bring jobs back to America, stop illegal immigration, defeat Isis, repeal Obamacare, lower taxes for families while miraculously raising the budget for defense, and perform myriad miracle acts that are not part of a president’s constitutional responsibility. \\nOn his march to the presidency, Trump has focused upon Hillary Clinton’s e-mails, a scandal that isn’t one. Congressional hearings and the FBI have cleared her; innumerable times, Trump has continued to attack her. Clinton has already apologized for using a personal e-mail server during her four years as secretary of state. What turned up among more than 30,000 e-mails is about 55 e-mails that received a “confidential” tag, the lowest of three classifications, with another 55 receiving “secret” or “top secret” classification. As a cabinet officer, and fourth in line of succession, she had the right to classify any message. A few of the messages came from other agencies. About 2,100 messages were classified retroactively. \\nClinton, still ahead in numerous polls, has attacked Trump for his crude behavior. One of her TV ads, which penetrates almost every TV show, is a fast-paced collage of his many comments; among them, Trump mocks a disabled reporter, uses obscene language, and treats women as chattel. \\nBoth candidates call each other unfit to be president, with Clinton asking voters if they really want Trump to be the person in charge of unleashing the nuclear arsenal, and Trump asking voters if they want a corrupt liar in the White House. Trump has also played upon Clinton’s 30 years of public service, linking her as an insider and him as an outsider to Washington, D.C., politics. The “outsider” label has been resonating with voters at all levels of the election campaigns as voters believe they are outsiders, alienated to government, and are willing to be led by insiders who claim to be outsiders. \\nThe cost of airing ads by both candidates for the presidency and members of Congress is more than $4 billion, and that doesn’t include the cost of producing them. More than $600 million, spread among all major Democratic and Republican candidates for the presidency, has been spent on broadcast TV ads, according to Borrell Associates. During the past 21 weeks, Clinton has spent about $211 million on broadcast TV ads; Trump has spent about $74 million, according to data compiled by BloombergPolitics. However, Trump has used both Twitter and free TV time, due to outrageous statements, to equal Clinton’s campaign. During the final week prior to the election, Trump will spend $25 million in broadcast TV ads. \\nThe Trump totals don’t include a $3 million TV ad buy from the NRA, which stokes the fire of fear that Clinton, if elected president, will violate the Second Amendment and take guns away from civilians, something a president cannot do. By Tuesday’s election, it will be doubtful that either Clinton or Trump will know how many ads were placed by their campaigns or by SuperPACs on their behalf that aired on broadcast television. \\nThere is one reality in all the advertising—negative ads generally don’t work, and exist only to reinforce a candidate’s base of support. \\nDr. Brasch, who has covered politics and government for four decades, is author of “Fracking America: Sacrificing Health and the Environment for Short-Term Economic Benefit.”'"}, "time": 1742564148.2536478}