{"duration": 0.10002756118774414, "input_args": {"text": "'Videos It’s Rigged: Takes One To Know One Increasing skepticism of the U.S. government can either lead to ugly conspiracy theorizing, or fuel a movement to bend the status quo. Be Sociable, Share! \\nThe system is rigged. \\nLet’s be clear: the American political system favors the two major parties and our economic system favors the wealthy. The global system is similarly rigged in favor of powerful countries (such as the United States) and powerful economic actors (such as transnational corporations). \\nThis is not, however, a conspiracy. No secret group of Bilderburgers, Illuminati, Masons, or Jews works behind the scenes to control the system in the United States or globally. Concentrations of power distort the fabric of our societies, just as large celestial bodies distort the fabric of space. It doesn’t take an Einstein to understand the structural impact of wealth and influence. \\nDonald Trump, however, has his own theories about how the world works. \\nIn a chilling, if predictable, development in the presidential campaign, the Republican presidential candidate has amped up his assertions that a conspiratorial cluster of actors is out to get him. Trump’s latest charges — that the media is out to get him, that women “not his type” have invented sexual harassment charges against him, that debate organizers and election officials and international bankers are, as we speak, ensuring that Trump will fail — are of a piece with his earlier claims that President Obama was born in Kenya. \\nI would dearly love to believe that the system is rigged against racist, xenophobic misogynists, but the fact that Trump has gotten this far – in the election, in his career – suggests otherwise. As my colleague Chuck Collins points out, Trump was born on third base (and, as his latest book demonstrates , Chuck knows an unearned triple when he sees one). A growing All-Star roster of Democrats and Republicans is currently trying to prevent ambitious Donald from stealing home. It’s true: when you’re that loathsome, everyone is out to get you. \\nAnd now, within a few weeks of being tagged out at the presidential plate, Trump is crying foul. It beggars the imagination that someone like Trump, who has benefitted from so many backroom deals, now claims that the system that has so richly rewarded his family is tilted against him. But then, Trump the amoralist courts the evangelical vote , Trump the global capitalist casts himself as an American firster, and Trump the billionaire pretends that he’s suddenly a populist. There are not enough bridges in the world to sell to the credulous taken in by Trump’s hucksterism. \\nFor the comfortably well off, this kind of campaign tactic seems ludicrous in its transparently self-serving paranoia. But for the millions of Americans who have not prospered in the new economy, all this talk of conspiracies affirms a deeply held conviction that malevolent puppet masters are at work behind the scenes. It can be a great comfort to blame misfortune on someone specific — the Devil, immigrants, feminists, liberal reporters — rather than a capricious universe or the workings of structural inequality. \\nYou can expend a lot of time and energy patiently explaining the near impossibility of rigging a national election or getting a bunch of journalists to agree to follow any sort of plan. In the absence of any supporting proof, Donald Trump’s supporters have made a leap of faith. \\nThey’ll find out soon enough just how far a drop it will be. \\nFrom Practice to Theory \\nConspiracies used to be rather straightforward affairs. The former allies of Julius Caesar conspired to rid the world of their power-hungry leader. In 1605, a number of Catholic activists plotted to blow up the British parliament. In 1865, a group of disgruntled Confederate sympathizers succeeded in assassinating Abraham Lincoln, while in 1944 a group of disgruntled Nazis failed in their effort to get rid of Adolph Hitler. \\nIn all of these cases, conspiracy was a necessary tactic. If the secret got out — as it did with the Gunpowder Plot of 1605 — the mission would fail. \\nAt some point, however, the balance of power shifted in the equation. Where once the powerless created conspiracies to bring down the mighty — an emperor, a king, a president — “conspiracy” more often meant in the late 20 th century an effort by the powerful to increase their domination. During this shift, the logic of conspiracy seemed to dry up and flutter away. Why should the powerful need to rely on conspiracy to further their aims? Did they not already control all the levers of authority? \\nWhat were once concrete acts have become increasingly abstract theories. \\nLet me anticipate your objection that some conspiracy theories have turned out to be true. Didn’t the CIA indeed attempt to subvert the Cuban system and take out Fidel Castro? Didn’t the Nixon administration orchestrate the Watergate break-in as one of its many dirty tricks? And what about Iran-Contra? \\nIn all three cases, the conspirators didn’t control the system. They engaged in secret missions to get around checks and balances or the political rules of the game. Their efforts were a sign of weakness, not strength. These exceptions prove the rule that the system is not rigged in a wacky conspiratorial way but in far more mundane, structural ways. \\nToday, conspiracy means so much more than an agency run amok or a president who breaks the rules. Conspiracy theorists believe that the U.S. government is behind the 9-11 attacks, that NASA faked the moon landing, that the Holocaust never happened. Conspiracy theories boil down messy complex reality into digestible pabulum. And where philosophers would impute omnipotence to an omniscient deity, conspiracy theorists now attribute omnipotence to bureaucratic organizations (CIA, UN, World Bank, Federal Reserve). Anyone who has ever worked in these organizations knows, however, that they are too bureaucratically diffuse and, frankly, incompetent to accomplish even one small part of what conspiracy theorists expect them to do. \\nModern conspiracy theories are a desperate response to the bewildering proliferation of bureaucratic organizations and the increasing complexity of society. Conspiracy theories are, for the many who tout them, a secular version of God. Surely some invisible hand is behind the inexplicable. \\nTrump Goes Low and Outside Republican presidential nominee Donald Trump and Democratic presidential nominee Hillary Clinton are introduced during the presidential debate at Hofstra University in Hempstead, N.Y., Monday, Sept. 26, 2016. \\nIn a speech last week in Florida, Donald Trump declared that WikiLeaks documents reveal that “Hillary Clinton meets in secret with international banks to plot the destruction of U.S. sovereignty in order to enrich these global financial powers, her special interest friends and her donors.” \\nTrump continued, “This is a conspiracy against you, the American people, and we cannot let this happen or continue.” \\nLet’s look more carefully at this assertion, which was an intriguing bait-and-switch gambit of using veiled anti-Semitism to draw attention away from claims of explicit sexual harassment. The latest Wikileaks dump included a number of remarks Clinton made to bankers. Most of these excerpts were from speeches to domestic institutions like Goldman Sachs and Morgan Stanley. But there was also one nugget from a speech Clinton gave to the former Brazilian bank, Banco Itau. “My dream,” Clinton told the Brazilian bankers in 2013, “is a hemispheric common market, with open trade and open borders, some time in the future with energy that is as green and sustainable as we can get it, powering growth and opportunity for every person in the hemisphere.” \\nThe alt-right went crazy over this sentence largely because of the phrase “open borders.” They took this to mean no restrictions on immigration. Really? What international banking institution supports open borders for immigrants ? Banks, of course, want to see money flow around the world with as few restrictions as possible. But people? Clinton obviously meant open economic borders, which comes with its own problems but is hardly a conspiracy. \\nThe second part of Trump’s charge, Clinton’s efforts to destroy “U.S. sovereignty,” is almost laughable. Clinton, like Trump, is a firm believer in American exceptionalism. To keep American atop the global economy is a core belief for anyone who operates at the highest levels of the American political system. Clinton, like many others, believes that free trade is a way to keep America on top. She might alter her position on free trade for the purposes of the presidential campaign. You might believe her or not believe her. But she is firmly, perhaps even maniacally, committed to the preservation and augmentation of sovereign American power. \\nWhere is Trump going with all this? \\nOn April 29, 1991, the sports announcer and former footballer David Icke appeared on the Terry Wogan show on the BBC and declared that the world would end and he was, basically, the son of God. It was the end of one career as a respected public figure and the beginning of another as a serial conspiracy theorist. In perhaps his most famous book, The Biggest Secret , Icke argued that the Earth had been taken over by large alien reptiles that could assume the shapes of world leaders. Give or take a few asylum dwellers, 12 million Americans believe that Icke is right. \\nI think Donald Trump is now having his David Icke moment. Perhaps his true October surprise will be the revelation, just before the election, that Hillary Clinton is not just a lawbreaker, not just on drugs, and not just in conspiratorial cahoots with a cabal of corporate criminals. Soon, to borrow from TV parlance, Donald will jump the lizard. \\nOn October 31, Trump will declare that Hillary Clinton is an alien. \\nMeanwhile in Russia Russian President Vladimir Putin meets with then-Secretary of State Hillary Clinton in Vladivostok, Russia in 2012. \\nThe loony right is not the only side of the political spectrum that traffics in conspiracy theories. The loony left has its own bizarre takes on international affairs (I wish we could declare an Internet moratorium on the phrase “false flag”). \\nBut the center too has its conspiracy theories. There has been much speculation about Vladimir Putin’s desire to bring about a color revolution in the United States as payback for all the meddling the United States has done in the Russian near abroad. \\nI have no doubt that the Russian government is behind the hacking of the DNC, John Podesta’s email account, and so on. I also suspect that Julian Assange has gone off the deep end in his Trumpian effort to disrupt the status quo at any cost. I might even go so far as to presume a joint effort by the Kremlin and Wikileaks to release this information at the most damaging moments possible (just before the Democratic Convention, in the lead-up to the election). It’s not a conspiracy. Call it a marriage of convenience. Or a joint criminal enterprise, if you prefer. \\nBut I don’t think that Vladimir Putin has a grand plan for bringing the United States to its knees or even to disrupt the U.S. elections. Putin has enough challenges keeping his own far-flung network of interests intact. The hacking is a little something on the side, in the great Soviet tradition of disinformation. I doubt that anyone in the Kremlin puts much stock in the effort, particularly since the Russian president knows that Donald Trump would be a disaster for U.S.-Russian relations. Putin values predictable, boring leaders, not ones that can turn on a dime in their affections. \\nAll across the political spectrum in the United States, the lure of conspiracy theories is strong. Many people accept Donald Trump’s particular interpretation that “the system is rigged” — 25 percent of Americans don’t believe the economic data produced by the U.S. government and 41 percent believe that the election could be stolen from Trump. \\nThis radical skepticism can lead to the worst kind of conspiracy theorizing. Or it can fuel a movement to bend the status quo so that it aligns with the long arc of the moral universe. As economist John Maynard Keynes once said, “The power of vested interests is vastly exaggerated compared with the gradual encroachment of ideas.” Over the last decade, the idea that the growing inequality gap is wrong — morally, politically, economically — has been gradually encroaching upon American public opinion. Out of this sordid election campaign, perhaps Americans can find common ground on a new vision of justice. This work by Foreign Policy In Focus – A project of the Institute for Policy Studies , is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike International License. \\nThe views expressed in this article are the author’s own and do not necessarily reflect Mint Press News editorial policy. Be Sociable, Share!'"}, "time": 1742628480.4568183}