{"duration": 0.08879327774047852, "input_args": {"text": "'PARIS  —   The art dealer and billionaire David Nahmad says he is well aware of the scornful whispers that trail him when he travels to Brazil, to New York. He says he feels the disapproving stares when he enters his synagogue at home in Monaco. “People say, ‘Oh, David stole it he should give it back immediately,’” Mr. Nahmad said in a rare interview at a hotel here. “It” is a valuable painting by Modigliani, an oil portrait of a dapper chocolate merchant in a hat and tie, seated and holding a cane. A Nahmad holding company bought the work at auction in 1996 and has owned it ever since. But the grandson of a Jewish antiques dealer says it is the same work that was confiscated from his relative’s Paris shop during the Nazi occupation and sold off more than 70 years ago. For almost five years, the grandson, Philippe Maestracci, and a company specializing in recovering looted art have pressed a claim in New York state and federal courts for the work, once estimated to be worth as much as $25 million. Mr. Nahmad, the scion of a family of international art dealers, remains adamant that he will not settle. He is basing much of his stance on a French court record from 1947 that he says casts doubt on whether his painting is the same Modigliani that the antique dealer, Oscar Stettiner, tried to recover after World War II. The court paper, filed in connection with Mr. Stettiner’s 1946 claim to regain the painting, describes it as a Modigliani   not an image of a chocolate merchant. But there is conflicting evidence cited by Mr. Maestracci, including the provenance listed when the Nahmad holding company unsuccessfully tried to sell the disputed painting, “Seated Man With a Cane,” through Sotheby’s in 2008. In its sale materials, the auction house listed “Stettiner” as a possible previous owner of the painting and said it had then been sold anonymously in Paris between 1940 and 1945. “I think the evidence is overwhelming,” James Palmer, whose Mondex Company is trying to reclaim the Modigliani painting for Mr. Maestracci, said in an interview from Italy. In recent months, much of the conversation over the work has focused not on the particulars of its provenance but on whether Mr. Nahmad went to great lengths to conceal his ownership. Technically, the painting is owned by the International Art Center, a holding company that controls many masterpieces, from Monets to Picassos, and has long been known as a Nahmad company by art world insiders. “The International Art Center is me personally,” said Mr. Nahmad, who said he uses it for security purposes to mask his name. “It’s David Nahmad. ” Nonetheless, for years, Mr. Nahmad’s representatives avoided making that direct connection in interviews. Much of the court battle over the Modigliani has revolved around whether the Art Center company is controlled by the Nahmads. But the recent leak of a trove from the   Panama Papers  —   showing documents from the Mossack Fonseca law firm, which set up the holding company  —   made clear that Mr. Nahmad was indeed its principal. The resulting publicity was ugly and overwhelming, Mr. Nahmad said. “Looted art, hidden art  —   they made me look like a crook instead of doing real battle in the court,” he said. In April a Swiss prosecutor, reacting to the disclosure, placed a legal hold on the work, which is in storage in Geneva, while he investigated whether the painting was stolen property. (Last month, he dropped the seizure order, citing insufficient evidence.) Wasn’t it a mistake not to have been more transparent? Mr. Nahmad turned to his Swiss lawyer, Rodolphe Gautier, who said that when you are “filing a lawsuit in New York you have to go against a proper defendant. ” “No matter who is behind” the International Art Center, he added, “it really does not change the lawsuit. ” Mr. Nahmad, 69, has long loathed publicity, but he has changed his strategy. He hired a public relations firm and last week set up shop at a suite in the   Plaza Athénée hotel here where he met individually with several reporters. A glass coffee table was piled high with Modigliani catalogs that Mr. Nahmad, in a casual blue sweater and slacks, thumbed through. They showed that he had lent the disputed painting to several museums, including the Jewish Museum in New York in 2004. “If you had any doubt about looted art, would you really lend it to a Jewish museum?” he asked. Mr. Palmer, of Mondex, says a series of documents demonstrate the Stettiner ownership of the work, including the catalog for the 1930 Venice Biennale where a “portrait of a man” by Modigliani was exhibited and credited to the collection of a Mr. Stettiner. The listing for a July 1944 sale by the French auction house Drouot, which sold items taken from Mr. Stettiner, records the sale of an unnamed Modigliani picture. The price was 16, 000 francs, though, far too low, Mr. Nahmad says, for a large work in oil by Modigliani, even then. Today that price would be equal to almost 3, 000 euros, or about $3, 375. Mr. Nahmad said he feels his position has been strengthened by an obscure 1947 French court document located by his researcher in the Paris archives amid the files of the claim submitted by Mr. Stettiner. The document had been legally sealed until 2022, but Mr. Nahmad successfully applied for an exemption to examine it. The document is from a French bailiff who presided over Mr. Stettiner’s restitution case. In it, the bailiff refers to the painting as “a picture representing the painter Modigliani painted by himself. ” But Mr. Palmer, who has seen the document, said he is not persuaded. “The bailiff is not an art expert,” he said. “It’s pretty easy for a bailiff to make that kind of mistake. ” With that impasse, Mr. Nahmad said he is poised to fight on in the courts. In the meantime, he is weighing invitations to exhibit his painting. He said he thinks the best option is to loan it to a museum in Israel. For now, he said, he has too many doubts to relinquish the painting. But he said, “If it’s proven that this painting is looted by the Nazis, I will give it back. ”'"}, "time": 1742563316.724323}