{"duration": 0.04929494857788086, "input_args": {"text": "'  Desperate To ‘Preserve His Legacy’, Barack Obama Releases 527 Pages Of New Regulations In ONE Day! According to the Competitive Enterprise Institute, the Obama administration has just shattered the old record for pages of regulations and rules published by the in-house journal, the Federal Register. At 81,640 total pages for 2016, it ranks first and 235 pages more than all of those published in 2010, the previous record.   17, 2016 President Obama has just set a new record for rules and regulations, his administration spitting out 527 pages worth in just one day, as he races to put his fingerprint on virtually every corner of American life and business. \\nAccording to the Competitive Enterprise Institute, the administration has just shattered the old record for pages of regulations and rules published by the in-house journal, the Federal Register . At 81,640 total pages for 2016, it ranks first and 235 pages more than all of those published in 2010, the previous record. The rules, politics of federal regulations under Obama: \\nAs shocking as this video is , it was made 5 months ago and does not reflect the current race-to-regulate happening right now. What’s more, there are still about 26 working days left in the year. \\n“No one knows what the future holds, but at a pace of well over 1,000 pages weekly, the Federal Register could easily top 90,000 pages this year. The simple algebra says that at the current pace we’ll add 11,190 pages over the next 44 days, to end 2016 at around 92,830 pages,” said CEI’s Clyde Wayne Crews. \\n“This is astonishing and should be of great concern, and intolerable, to policymakers. It is remarkable enough that the all-time record has been passed before Thanksgiving,” he added. Obama has promised to regulate by executive authority, but the sheer number of pages of regulations being rushed through is astonishing. \\nStill, it’s not a big surprise to CEI and other regulation watchdogs. \\nThe reason, said Crews, Obama owns seven of the 10 highest-ever Federal Register counts. \\nHe called on President-elect Trump to make good on campaign promises and cut regulations. \\n“President-elect Donald Trump could take a page from President Reagan, who brought page counts down from Carter’s 73,258 to as low as 44,812. We don’t need a pen and phone, we need a meat axe,” said Crews. source \\n '"}, "time": 1742564403.070979}