{"duration": 0.15152621269226074, "input_args": {"text": "'Some of Massachusetts’s top politicians said on Wednesday that they would not attend the St. Patrick’s Day Parade in South Boston after organizers told a group of gay and transgender military veterans that they would not be allowed to march on March 19 after two years of L. G. B. T. inclusion in the event. The governor, Charlie Baker, and the mayor of Boston, Martin J. Walsh, both announced their decision to skip the parade over its decision to bar the group, OutVets. In a statement, the mayor encouraged the public to do the same. “I will not tolerate discrimination in our city of any form,” Mr. Walsh said. “I will not be marching in the parade unless this is resolved. Anyone who values what our city stands for should do the same. ” Mr. Baker said it “doesn’t make any sense” to exclude the group. “If veterans’ groups aren’t allowed to march in that parade for whatever reason, then I’ll probably do something else,” he told reporters on Wednesday. The controversy began on Tuesday night when the parade organizers, the South Boston Allied War Veterans Council, voted 9 to 4 to exclude OutVets. Dan Magoon, the executive director of Massachusetts Fallen Heroes, resigned as the parade’s chief marshal over that decision. Mr. Magoon, who voted in favor of including OutVets, said there was “strong opposition” to the group’s participation. He said opponents cited the group’s late application as well as a past code of conduct violation. “They didn’t tell us anything detailed or specific about the incident, but it was enough to swing the vote,” Mr. Magoon said. According to the code of conduct published by the Allied War Veterans Council, the parade does not ban L. G. B. T. groups, but it also “will not allow the advertisement or display of one’s sexual orientation as a topic that should in any way be depicted as a theme of our parade. ” Bryan Bishop, the founder of OutVets, said parade organizers told him on Wednesday night that a small rainbow patch that has been part of the group’s logo since 2014 was found to be in violation of that rule. “My jaw just dropped on the floor,” he said. Marchers from his group wore jackets with the logo in 2015 and 2016 without incident, he said. Organizers told him Wednesday that they had violated the rules two years in a row. “They said people felt that rainbows represent the gay community,” Mr. Bishop said. “I told them if that’s the case, then every picture of a rainbow in the parade that leads to a pot of gold needs to be removed. ” Mr. Bishop said parade organizers told him they would allow his group to march only if it removed the rainbow patch or did not display its logo, which he refused. “They refuse to change their minds,” he said. “They are stuck in an arcane time in our history. ” He said parade organizers also complained that allowing OutVets to march had cost them support from the Roman Catholic Church. Leaders of the veterans council did not respond to emails or return phone calls on Wednesday evening seeking comment. “This is an issue that didn’t need to exist because OutVets has marched consecutively for the last two years with no incident,” Mr. Magoon said. It was the first L. G. B. T. group to march in the Boston parade. The decision in Boston represents a backsliding on gay and transgender rights in one of the most liberal cities in the country, and it appeared to take many there by surprise. Michael Flaherty, a Boston city councilor, said the decision was “disgusting,” adding, “Whoever voted for this is a nitwit. ” United States Senator Edward J. Markey said he would boycott the parade, too, unless the veterans council changed its decision, which he called “a stunning and inexplicable reversal. ” “We all believed we’d moved beyond a time when the St. Patrick’s Day Parade was used as an occasion to exclude people, in this case veterans, from our community just because of who they are or who they love,” he said in a statement. Sponsors of the parade began to drop out on Wednesday as well. The supermarket Stop  Shop said it would no longer sponsor the parade, and   said it was “evaluating” its continued participation in the event. As politicians and sponsors began to object, The Associated Press reported on Thursday that the veterans council would hold an emergency meeting on Friday to reconsider their decision. Gay and transgender groups campaigned for years to be included in St. Patrick’s Day parades in Boston, New York and other cities. Organizers historically told gay and transgender people they could not march under their own banner but could march with other groups in the parades, which celebrate Irish heritage and were traditionally organized by   groups often deeply influenced by the Roman Catholic Church. When an L. G. B. T. group marched in the New York parade with Mayor David N. Dinkins in 1991, spectators shouted epithets and threw beer bottles at them for nearly 40 blocks. The mayor told reporters the experience reminded him of marching in Birmingham, Ala. during the civil rights movement. “I knew there would be deep emotions, but I did not anticipate the cowards in the crowd,” he said. The conflict over the New York parade came to a head in 2014 when Mayor Bill de Blasio boycotted it  —   the first mayor since Mr. Dinkins to do so  —   over its ban on L. G. B. T. groups. Guinness, a leading sponsor of the parade, also cut ties that year. The first L. G. B. T. group marched in New York in 2015. Niall O’Dowd, the publisher of several   news media outlets, said some   in Boston objected to the participation of OutVets in 2015, but when the group returned in 2016 “there was no problem. ” He compared opponents of L. G. B. T. participation in the parades to Japanese soldiers who refused to surrender at the end of World War II and kept fighting for decades from isolated positions. “This is just insane. This fight has been won. There’s no question,” he said. “Everyone thought this would be part of the usual historical progression, but now they’ve banned them again, which is extraordinary. ”'"}, "time": 1742562223.4567134}