{"duration": 0.24373769760131836, "input_args": {"text": "'It was around 10 a. m. on a   summer morning, and James Altucher, perhaps the world’s least likely success guru, was packing his worldly possessions, about 15 items, into a small canvas   bag. “If I were to die, my kids get this bag,” Mr. Altucher said sardonically as he packed away his laptop, iPad, three sets of chinos, three   and a Ziploc bag filled with $4, 000 worth of $2 bills (“People always remember you if you tip with $2 bills,” he said) and departed a friend’s loft on East 20th Street. A few months ago, the boyish    let the lease expire on his Cold Spring, N. Y. apartment, and dumped or donated virtually everything he owned, more than 40 garbage bags of sheets, dishes, clothes, books, his college diploma, even childhood photo albums. Since then, he’s been bouncing among friends’ apartments and Airbnb rentals. It is not that he is down on his luck. Several of the 16 books he has written, including his 2013   manifesto, “Choose Yourself,” continue to sell briskly. His weekly podcasts, “The James Altucher Show,” featuring interviews with notables as diverse as Ron Paul and Luther Campbell of 2 Live Crew, and “Question of the Day,” with Stephen Dubner, are downloaded about two million times a month. Mr. Altucher is simply practicing what he preaches. Over the last   this former tech entrepreneur, venture capitalist and financial pundit has reinvented himself as a     guru, preaching survival in an era when the American Dream  —   the   college diploma, the corner office, the   home  —   seems like a sham. So one by one, he has shed all of them. “I have ambition,” he said, “to have no ambition. ” “In the past 25 years, income has gone down for the      student loan debt is at an   high,” Mr. Altucher said over a lunch of zucchini pancakes at a Russian restaurant in the Flatiron district. “We had $3 trillion in bailout money, and income inequality got higher than ever. People feel like they were scammed. ” Mr. Altucher’s diagnosis will come as no surprise to the anxious middle class, the downsized and the dispossessed who have propelled the angry populism of Bernie Sanders and Donald J. Trump. But while there is no shortage of anger and confusion about the supposed waning of the American Dream, what makes Mr. Altucher stand out are his   conclusions. College, he says, is a waste of money. Although he graduated from Cornell, Mr. Altucher argues that the college degree has become a costly luxury in a world where millennials feel like debt serfs and   professional jobs are scarce. In a 2012   book, “40 Alternatives to College,” he argued that young adults could travel the world, educate themselves online and start a business with the same $200, 000 they may spend on college. Investing the money with even a 5 percent return would offer greater financial benefit over the course of a lifetime, he wrote in a  blog post. Similarly, he believes homeownership is a   foisted upon unwitting citizens by a $14 trillion mortgage industry. “It’s a total scam,” he said in an online interview. “Nobody should put more than 5 to 10 percent of their portfolio, their assets, in any one investment. But when people buy a home, they go crazy. They put like 50, 60, 70 percent of their net worth into this one investment. It’s illiquid, so when times are hard, you can’t sell it. ” And he think stocks are a racket. It’s a fierce worldview that is rooted in Mr. Altucher’s own   life. In the 1990s, as a young Silicon Alley   whiz, Mr. Altucher made millions with a   company, Reset Inc. that counted Sony and Miramax as clients. Soon, he and his wife at the time, Anne (they divorced in 2010) were living in a    loft in TriBeCa that he bought for $1. 8 million and spent another $1 million renovating. He felt flush enough to take a helicopter to Atlantic City on weekends to play poker. The lavish lifestyle did not fill his emotional void. “Nobody should feel sorry for me,” he said. “I was really stupid, but I thought I was dirt poor. I felt like I needed $100 million to be happy. So I just started investing in all these other companies, and they were just stupid companies. Zero of these investments worked out. ” As his fortunes collapsed, he was forced to sell his apartment for a $1 million loss (it was after the attacks of Sept. 11, 2001). To reclaim his wealth, he set his sights on the stock market. He read more than a hundred books on investing, and eventually wrangled a job writing for James Cramer’s site, TheStreet, and later The Financial Times. Before long, his trademark hairdo, which looks like carnival cotton candy spun from steel wool, was a familiar sight on CNBC. But his fortunes crumbled once again during the financial crisis that began in 2008. The hedge fund he started ran out of gas, various   withered, writing gigs dried up. With few options open, he decided to chronicle his failures on a personal blog, which he named Altucher Confidential. “I just said, ‘I’ve made every mistake in the book: Here’s what they are,’” Mr. Altucher said. To Wall Street friends, he seemed like Howard Beale, the anchorman in “Network” who had a meltdown  . Instead of touting the latest hot mutual fund, he wrote posts like “10 Reasons You Should Never Own Stocks Again. ” (Reason No. 1: You’re not that good at it.) He confessed thoughts of suicide. “Financial people were like watching a train wreck in real time,” Mr. Altucher said. “I had friends I hadn’t talked to since high school call me and say, ‘Hey, are you O. K.?’” He soon discovered a sizable audience of people whose own dreams had just gone down the sinkhole. They, too, were looking to claw their way out. “The No. 1 search phrase on Google that takes people to my blog is ‘I want to die,’” Mr. Altucher said. But Mr. Altucher seems like an unlikely person to look to for solace. Bookish, contrarian and given to speaking in staccato bursts, this skinny computer geek from North Brunswick, N. J. is like the   Robbins, the strapping   star. His   appearance turned out to be a plus, as he developed a following blogging about his     “life hacker” experiments. There was “the 5 p. m. diet,” in which he eats nothing after that time (“Your face gets more angular. I’ve seen it happen. Not just with me. With everyone on this   diet”). There was “the alien trick” to beat anxiety, in which he pretends to be an alien and wake up every day on another planet with a new body (“I have no worries because tomorrow I will be in a new body. No envies. No worries. Only new things to explore”). There was his zombie email gimmick, when he would respond to unread emails from seven years ago: “Sure! I’ll have coffee today” (“People laugh and all is forgiven,” he said). By writing candidly about his own triumphs and flameouts, Mr. Altucher “shows readers how they can succeed despite their flaws, not because of a lack of flaws,” said Tim Ferriss, author of the   “ ”   series. “This is hugely refreshing in a world of     gurus who are all forced smiles and  . ” It helped that Mr. Altucher, despite his biting views on topics like college, maintained a positive tone. “I am an optimist,” he said. “There’s a great novel from the ‘60s by Richard Fariña called ‘Been Down So Long It Looks Like Up to Me.’ Basically, I’ve been down on the floor so many times, I know now that I can always bounce back, and it gets faster each time. ” His philosophy is perhaps most clearly articulated in “Choose Yourself,” which he summarized over lunch like this: “If you don’t choose the life you want to live, chances are, someone else is going to choose it for you. And the results are probably not going to be pretty. ” Chapters include “How to Be Less Stupid” (“I lose at least 20 percent of my intelligence when I am resentful”) and “The Seven Habits of Highly Effective Mediocre People” (procrastination, he writes, “is your body telling you that you need to back off a bit and think more about what you are doing”). A key tenet of the book is the Daily Practice, a wellness regimen that comprises the physical (eat well, try to go to sleep by 9 p. m. and rise by 5 a. m. break a sweat for at least 10 minutes a day) emotional (be around people you love, who love you) mental (write a list of 10 ideas each day to exercise the “idea muscle” before it atrophies) and spiritual (feel gratitude every day). He calls them the four pillars of happiness. “A chair needs four legs to be stable,” he said. And there has never been a better time to choose yourself, he said. You do not have to be Mark Zuckerberg, he said, to be an entrepreneur. “You can learn basic web development,” he said. “You can go to Codecademy. com, learn the basic skills in three months, then sell them on Freelancer. com, where there are millions of jobs. I know    who are making a few thousand dollars a month. ” Thanks to   you don’t have to be Deepak Chopra to write books. “Everybody is or can be an expert on something,” he said. “Take me: I haven’t been in the kitchen in 20 years. I hate eating vegan. But how hard would it be to read every book on veganism, buy some ingredients, write up a little book: ‘The  ’s Vegan Cookbook’?” He would know. “Choose Yourself,” which Mr. Altucher   on Amazon, sold more than a   copies, he said, and made The Wall Street Journal’s   list. His fans swear by him. One reader, Beck Power, recently wrote an essay on Medium about how he inspired her to ditch a frustrating job to start her own online travel business. “I dance in my underwear,” she wrote. “I don’t have panic attacks anymore. ” A talk he gave at a London church last year drew about 1, 000 people, and fans have organized “Choose Yourself” meetups in cities around the world. On LinkedIn, where he publishes original free essays, Mr. Altucher has more than 485, 000 followers and is ranked the No. 4 “influencer,” after Bill Gates, Richard Branson and Mohamed A.   the financier and author. “He’s the Oprah of the internet,” said Kamal Ravikant, a tech entrepreneur who wrote the   Amazon best seller “Love Yourself Like Your Life Depends on It. ” Unlike most gurus, “James is on a very personal journey, allowing his readers and listeners to experience it in real time,” said Brian Koppelman, a creator of Showtime’s “Billions,” who also moderates “The Moment,” a podcast on Slate. “He’s telling you the story on Saturday, on Sunday he’s talking about how it failed, and on Monday he’s talking about doing it a different way. ” Mr. Altucher, in fact, disputes that he is a guru in the first place. “I am not a   guy at all,” he said. “Advice is autobiography,” he added. “I only say what has worked for me, and then others can choose to try it or not. ” Besides, what worked yesterday may not work tomorrow. “It’s like Mike Tyson says,” Mr. Altucher said. “‘Everyone has a plan until they get punched in the face. ’”'"}, "time": 1742561655.2390382}