{"duration": 0.08221268653869629, "input_args": {"text": "'Videos Tensions Rise As Pipeline Construction Nears #NoDAPL Blockade The Oceti Sakowin tribe declared eminent domain on land bought by Dakota Access and set up their new winter camp in the direct path of the pipeline on 1851 treaty land. | October 27, 2016 Be Sociable, Share! \\nOceti Sakowin, ND – On Sunday, October 23rd , water protectors extended camp beyond the overflow site, just north of the Standing Rock reservation, to the pipeline easement line. The Oceti Sakowin declared eminent domain on land bought by Dakota Access and set up their new winter camp in the direct path of the pipeline on 1851 treaty land. \\nAs the encampment was formed, two blockades were created, one on county road 146 and one north of the new winter camp on Highway 1806. We spoke to various blockaders who stated their goal was to ensure safety of the water protectors as they prepared their camps for winter. \\nThe video below contains interviews with various water protectors at the multiple blockades and camps. The following day, after the new winter camp was established, a no-fly zone was declared by law enforcement. FAA informed Unicorn Riot that \"only response aircraft in support of law enforcement\" can fly in no-fly zone https://t.co/4eax21fw59 #NoDAPL pic.twitter.com/nZuNKtbFrb This no-fly zone was created, according to the Morton County Sheriff, to ground all drones being flown by water protectors and journalists. The Temporary Flight Restriction (TFR) notice on the FAA’s website lists the North Dakota Tactical Operations Center as responsible for issuing the TFR . \\nOn October 26th, 2016, the Morton County Sheriff’s Department, and various other agencies working alongside them, erected a concrete blockade just two miles north of the frontline #NoDAPL blockade. The new law enforcement blockade is currently manned by sheriff’s deputies armed with automatic rifles. \\nWe reported live from the frontline as water protectors gathered near the blockades expecting a raid on the camps by police, military and private DAPL security assets. \\nAll day, patrol planes and helicopters flew low over the water protectors, while private security vehicles gathered on the hills west of the frontline camp. This yellow helicopter has been flying low over #NoDAPL water protectors for months- & seems to be exempt from new no-fly zone. pic.twitter.com/xPuq9bNneI \\n— Unicorn Riot (@UR_Ninja) October 27, 2016 \\nCass County Sheriff Paul Laney, who has been acting as “Director of Operations” for Morton County Sheriff, came to the new winter camp today with representatives from the National Guard and asked people to leave the new site and return to the main camp, Forum News Service reports. “We’re here telling you this is private property and you have to leave,” Laney told camp coordinator Mekasi Camp-Horinek. “We don’t want a confrontation. Please stand your people down and go back to the main camp.” Mekasi pointed at the road – “our no surrender line,” he said – and then back at the frontline camp standing in the way of the four-state, $3.8 billion oil pipeline – their “no retreat” line. “That’s your final word?” Laney asked. “That’s my final word,” Camp-Horinek said, walking away. \\nPipeline construction is less than half a mile from Highway 1806 and we can verify that machines can be heard working from the new frontline camp. Law enforcement in trucks & DAPL security in dune buggies watching Oceti Sakowin front line camp from hills maybe 200 yards away. #NoDAPL pic.twitter.com/NuqlC94gVd \\n— Unicorn Riot (@UR_Ninja) October 26, 2016 This work (including header image) by Unicorn Riot is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike International License.'"}, "time": 1742564356.604543}