{"duration": 0.16815614700317383, "input_args": {"text": "\"Keywords: Alzhemier's disease , anxiety , dementia , depression , food , health , IBD , IBS , immune system , mental health , nutrition , weight loss Fermented Foods: 5 Reasons to Consume this food Group Every Day \\nI’m sure you have heard about fermented foods and are wondering if this is just a fad. Here are some reasons why fermented foods should not be just a fad but a food group to keep in your diet daily. What are Fermented Foods? \\nBacteria and yeast are used as part of the fermentation process that gives these foods a nutritional boost. The bacteria convert sugars and starches into lactic acid through a process called lacto-fermentation. The yeast undergoes a process called ethanol fermentation. \\nThese yeasts and bacteria that undergo the fermentation process boosts the nutritional content of the food. What it does to the food Provides beneficial bacteria that promote gut health Provides beneficial enzymes Increases the amount of B vitamins, biotin, and folate. Increases the bioavailability of minerals. Provides short chain fatty acids (which helps to improve your immune function) Provides you with GABA, your calming neurotransmitter How can eating fermented foods help me? Optimize your Gut Health \\nWhy this may not seem like a big deal, it is. Your immune system is in your gut and much of your serotonin is made in your gut. Your gut may be in bad shape from NSAIDS, antibiotics, unknown food allergies, the standard American diet and more. \\nIdeally you want more “good” bacteria populating your gut as opposed to “bad” bacteria. Fermented foods can help shift the balance since most people who consume the Standard American “crap food” diet have a disrupted microbiome. \\nSo, you can take all the supplements in the world, but if your gut is in bad shape, are you even absorbing and benefiting from these supplements or are you just wasting your money? \\nA healthy gut can help to balance and support your endocrine system, immune system, digestive system, and nervous system. So, as you can see, a healthy gut is critical to your well-being. Support your Immune System \\nThe more beneficial bacteria you have, the stronger your immune system is to fight off colds, flu, allergies and more. Almost 80% of your immune system is found in your gut, thus, it stands to reason that to maintain a strong immune system, one needs to support their gut health. \\nAsthma and autoimmune conditions, among numerous other health issues, are all linked to having fewer good bacteria in your gut. The less diverse your microbiota is, the greater association with many chronic health issues. \\nAdding in probiotic rich fermented foods can also shorten the duration of a cold or upper respiratory infection. Aid in weight loss \\nStudies show that those with certain healthy bacteria in their gut can maintain a healthy weight while those with more negative strains have a greater incidence of gaining weight/difficulty losing weight. Obese people have different gut bacteria than lean individuals. \\nIn a 2011 study, it was found that kimchee had a significant impact on weight and body fat of those who are overweight and obese in the study. In a 2010 study, obese people were assigned to drink fermented milk for 12 weeks. Those that drank the fermented milk had significant fat loss as compared to the control group. Digestive/Bowel Issue Improvement \\nThose with IBS or IBD may have reduced symptoms of diarrhea and constipation when fermented foods are added into the daily diet. Dr. David Williams states that to eliminate digestive issues, you need to improve the balance in the gut microbiome and one of the most effective ways of doing so is by adding in fermented foods. Kefir in studies, has shown to improve symptoms of IBS and IBD. Research has shown that anywhere from 50 to 75% of those who make this change (Adding in fermented foods) will notice a significant difference in their IBS symptoms. Improved mental health, mood control and behavior. \\nThe gut is considered your second brain. A healthy gut therefore can mean a healthy brain. Several probiotic strains have been shown to reduce symptoms of depression and anxiety in short term studies. For this reason, to get more variety of probiotic strains, it is best to not stick with the same fermented food to eat over and over. Mix it up; for instance, have kefir one day, kombucha the next, fermented vegetables the next day and so forth. \\nMany of you know that GABA is your calming neurotransmitter. But did you know that fermented foods can supply you with GABA too? Oral administration of fermented rice bran and other traditional fermented foods have been shown to increase GABA content significantly! Whereas GABA in the oral form may have limited benefits due to absorption issues. \\nAnother study looking at 700 college students found that those who ate a variety of fermented foods has less negative emotions than before such as anxiety, fear, moodiness, worry, envy, frustration, and loneliness. \\nIt is possible that the fermented foods not only healed leaky gut but also provided some needed GABA. Even in psychiatry they are starting to recognize the benefits of fermented foods for mood disorders. Reduce the risk of brain diseases such as Alzheimer’s. \\nSome scientists have recently begun to consider the possibility that Alzheimer’s Disease is in fact an autoimmune disease. And as many of you may know, having one autoimmune condition puts you at risk for more autoimmune conditions down the road. For any autoimmune disease, the immune system must be supported. So, it would make sense that gut health needs to be addressed for AD. If you want to support your brain than I suggest that you add in fermented foods. \\nAlong with the benefits above, fermented foods can also benefit those with Autism and help prevent H-Pylori. You don’t need a whole lot of fermented foods daily. Start with small amounts until you know how your body will react and slowly build your way up to say 3 tablespoons of fermented vegetables or a cup of kefir per day. What to add in \\n\\nLook for the product to say raw and fermented. These foods should be in the refrigerator section of the store. Sauerkraut or other fermented vegetables : eat these cold, don’t heat them up. Bubbies pickles is a great way to get introduced to fermented foods. Kimchee : this is a Korean version of fermented cabbage, carrots, onions and garlic. Kefir: usually made from cow’s milk but is also made from goat milk or coconut milk. It has more of a drinkable texture than yogurt. I buy goat milk kefir and find that it is relatively thick and mix in some of my paleo granola and have this for breakfast. If you suspect any issues with milk it is best to opt for the coconut kefir or the goat milk kefir. If you have asthma or chronic sinus congestion, avoid the kefir until issues resolve. Opt for the other fermented choices instead. Tempeh: Indonesian type of “cake” with a nutty taste and chewy texture. A good vegan source of protein too. Kombucha : a fizzy fermented tea. Most stores carry a variety of flavors now. Don’t go overboard on the kombucha however. Some people who drink kombucha in excess amounts (i.e.: several bottles per day) report symptoms of gas and bloating. Miso: a fermented soybean paste which can be used in soups and sauces. A miso broth soup is a great way to start a meal and very easy to make. \\nNotice I did not sat yogurt. While some yogurts may contain some probiotics, many others are sugary processed foods in disguise. Yogurt is also not going to pack as powerful of a punch as the above-mentioned foods. \\nSources\""}, "time": 1742564526.8856199}