{"duration": 0.3167245388031006, "input_args": {"text": "'Read by 358 people \\nThis article was written by Brandon Smith and published at his Alt-Market.com site. \\nEditor’s Comment: Make no mistake, there is an agenda at work here. You can’t win for losing, or quit while you’re ahead. Everything is quick sand, and one step forward two steps back. The world is stuck in a very tight trap, and it will require more than two dimensional thinking to find our way out of it. Electing Trump sent the right message to the powers that be, but the end result will be used to maneuver their next move against us. \\nNearly everyone is convinced of the need to reform the system, change things and somehow drain the swamp. But it seems that the complex of the system has a way of dragging people back down into it. This is a dangerous cycle of corruption, and one that will be very difficult to crawl out of, like a funnel. Stay on guard, and watch carefully at where the people win and where they lose in the next few scenes. \\nWorld Suffers From Trump Shell Shock – Here’s What Will Happen Next \\nby Brandon Smith \\nI’ve been saying this for a long time, and I’ll say it again here — in life there are only two kinds of people: those who know and those who don’t. Some might claim there is a third option: those who don’t want to know. In any case, if you want to be able to foresee geopolitical and social trends, you have to be one of the people who know. \\nAbove all else, in order to know you must be willing to step outside of the confusion and theater of the circus and look at developments from above. If you are biased and retain too many sacred cows you will never understand how the world works. You will be too busy trying to reinforce your own fantasies to see anything else. \\nBeyond this, you must also understand that political and social developments are not random; they are either reactions to deliberate policies of special interests or they are driven by policies of special interests. Therefore, these developments are predictable and can be calculated (to a point). \\nI usually refer to these “special interests” as global elites, or globalists, because that is how they often refer to themselves. The point is, most of the events you see in the political world are engineered events designed to elicit a specific psychological response from you and the people around you. You are not a human being to these people; you are either an asset to be molded or an obstacle to be disposed of. This is how our world works. Period. And until we fully understand this and accept it, things will never change. \\nSo, to be clear, if you understand the minds of globalists and understand what they want, you can understand the basic direction of the future. \\nIt is this philosophy which has allowed me to consistently and accurately predict geopolitical and economic events that very few other people have been able to predict. For example, I correctly predicted the Federal Reserve taper of QE , I predicted the inclusion of China in the IMF’s Special Drawing Rights years in advance, I predicted the exact timing of the first Fed rate hike, I predicted the success of the Brexit referendum when most of the world and the liberty movement said it was never going to happen, I predicted that the Saudi 9/11 bill would pass , that Barack Obama would veto it and that congress would override his veto , I predicted that Hillary Clinton would be the Democratic candidate and that Donald Trump would be the Republican candidate for president of the U.S. and, for the past five months, I have been predicting that Donald Trump would win the 2016 election . \\nPeople can either attribute these series of successful predictions to pure “luck,” or they can consider the possibility that I know what I am talking about. I’ll leave that to them. \\nThe real issue, though, is not that my predictions were correct. What is more important is WHY they were correct. To begin with, I am often correct because it is a fact that globalists influence events. Globalists are human (at least partially); thus, they are predictable, making events predictable. If you can see from the perspective of a globalist, you will know what they want and what they are likely to do to get it. \\nIn a world without globalists I would have a hard time successfully predicting anything. \\nI never make a cold prediction without a concrete rationale for why I hold that view. I always break down the reasons and evidence that bring sense to them. Some analysts might be content to simply flip a coin and make a call without explanation; I am not. \\nAs far as the Trump election win is concerned, this is what I said in June of this year : \\n“In light of the Brexit I’m going to have to call it here and now and predict that the most likely scenario for elections will be a Trump presidency. Trump has consistently warned of a recession during his campaign and with the Brexit dragging markets lower over the next few months, he will probably be proven “prophetic.” \\n… Even if Trump is a legitimate anti-establishment conservative, his entry into the Oval Office will seal the deal on the economic collapse, and will serve the globalists well. The international banks need only pull the plug on any remaining life support to the existing market system and allow it to fully implode, all while blaming Trump and his conservative supporters. \\nThe mainstream media has been consistently comparing Trump supporters to Brexit supporters, and Trump himself has hitched his political wagon to the Brexit. This fits perfectly with the globalist narrative that populists and conservatives are killing the global economy and placing everyone at risk.” \\nAll of my predictions are rooted in a particular premise; that the global elites have been, since 2008 at least, deliberately setting the stage for an evolving international financial crisis greater than any other seen in modern history. This crisis is a means to an end. Globalists use one strategy above all others to achieve their goals — the Hegelian Dialectic; problem, reaction, solution. \\nAs I have documented for years, the elites openly call for the ultimate eradication of national sovereignty and the formation of a single world economy, a single world currency and, eventually, a single world government. In order to make this omelet, they intend to break a few eggs (and collapse a few economies). By blaming “national sovereignty” (and the people that defend it) for this crisis, they hope to convince the masses that the only practical solution is total centralization. You can read my in-depth analysis and evidence of this in my article “ The Economic End Game Explained. ” \\nI also specifically predicted the Brexit and the Trump win based on another premise; that the elites are allowing conservative movements to take political power in certain regions, only to remove stimulus support from the global economy afterward. That is to say, I successfully predicted the Brexit and the Trump win because I understand and accept the reality that conservatives and liberty activists are not “winning;” we are being set up as scapegoats for a financial crash that the globalists already created. \\nAgain, people can either say I am lucky, or that there is something to my position, but the fact of the matter is I have been right and I will probably continue to be right. This brings us to what will happen going into 2017. \\nThe election of Donald Trump signals a sea change in not only global politics, but more importantly, global economic stability and social developments. As frenetic and insane as 2016 has been, 2017 will be drastically more chaotic. Some of these changes will be obvious, some of them will once again only be visible to a handful of people in the world. Lets start first with my happier predictions… The Death Of The Mainstream Media \\nThis is an easy one. The mainstream media, with its insane regressive-progressives and elitist bias, misrepresented the “Alt-Right,” the Trump campaign and anti-social justice movements during the entirety of the election process. Not only this, but through Wikileaks the leftist media was made naked as numerous journalists and outlets were exposed; colluding directly with the DNC and the Hillary campaign to first bushwhack Bernie Sanders and then rig debates and polling numbers to show Clinton in a farcically superior position to Trump. \\nThe mainstream media is now seen by the majority of Americans on the left and right as a lumbering rotting propaganda corpse that needs to be decapitated before it spreads its disease to anyone else. I predict MSM outlet readership and viewership (with the exception of FOX News) will collapse even further than it already has and that many outlets will be forced to consolidate until they fade out of existence. \\nAs I have said for years, the mainstream media is dead, they just don’t know it yet. Well, after this election, everyone knows. The alternative media will take the place of the mainstream media. We will be adopting their viewership and growing explosively over the next year while they shrivel. \\nThey decided that their job was not to report the facts, but to manipulate public opinion. They are liars and a disgrace to true journalism. Good riddance. \\nThat said, some people will argue that my position that the elites wanted a Trump presidency is not tenable exactly because the liberal media worked so hard to rig public opinion against Trump. I will explain in my next article why these people are missing the bigger picture. The Crippling Of Social Justice Warriors \\nThe SJW cult is not dead, but it has been crippled. It is now a drooling bedridden quadriplegic eating its meals through a straw; a malfunctioning shell of a movement destined to be put out of its misery. \\nWhen I think of social justice warriors I think of the Island of Misfit Toys; nobody wants these people. They are a detriment to everything they touch, including the Democratic party. It was the zealotry of SJWs that caused conservatives to rally in anger around Trump. It was they that awakened the sleeping giant. \\nOne reason I was so certain Clinton had set herself up for a loss was her insistence that the Democrats openly adopt these hell spawn and their ideology. By embracing politically correct rhetoric and accusing all opposition of being “deplorable” racists, sexists and homophobes, Clinton doomed her campaign from the very beginning. Anyone with any sense could see the massive tide against SJWs growing on the internet. In fact, I propose that the globalists, using the advanced web analytics at their disposal, saw it even before the rest of us did. \\nSJWs are a tiny minority in American society. Their only strategy has been to use Alinsky tactics to make their movement appear much larger than it really is. Through mutual aid and elitist supporters in popular media, SJWs presented a fabricated consensus. They made it seem as though they were the majority view and, thus, the “superior” view. \\nOne fantastic result of the 2016 election has been the realization by conservatives that they are not isolated on the fringes of society. In fact, in America at least, we are a considerable force to be reckoned with. There is an old story of a Roman Senator 2,000 years ago who suggested the idea of forcing slaves to wear armbands to make them easily identifiable. Another senator admonished the notion, stating “No, if they realize how many of them there really are, they may revolt.” \\nThis is what Election 2016 did for conservatives — we have seen that millions of us have arm bands, and we are now in revolt. \\nI rarely comment on race issues because I don’t really see race as very relevant in most cases; but it has been the tactic of social justice cultists to constantly and brutally target straight white males as the monsters of history and therefore responsible for the ills and failures of every minority group from today to eternity. At this point I think it is safe to say that we will NO LONGER sit idly by as whipping boys for sad, deluded people clamoring for victim group status. The End Of Mainstream Polling \\nI was also confident in my prediction of a Trump win based on my knowledge of inconsistencies in modern polling methods. The fact of the matter is, polling suffers from the same lack of objectivity that any other “science” can at times suffer from — the results will always be vulnerable to influence from the observer. If the observer wants a particular outcome for the numbers, they will consciously or unconsciously rig their method to produce the desired result. \\nI saw this happen time and time again during the Brexit polls leading up to the referendum, and, as I stated many times before the U.S. election, the campaign polls seemed to be behaving the same way. This is how you get media sources like Reuters claiming a 90 percent chance of a win by Hillary Clinton just before the election. When pollsters weight their polls with far more democrats than republicans and when they poll the same groups repeatedly they are not going to get varied or honest data. \\nIn the end, polls become propaganda tools rather than litmus tests. The mainstream has tried desperately to explain why their polls were so utterly wrong, but it is too late for them. After the Brexit and the U.S. election, no one is going to trust these numbers again. Liberty Groups Will Get Some Breathing Room (For A Little While) \\nThe steady drum beat of government antagonism for “patriot groups” is probably going to subside for a short time. I happen to know that many militia groups and preparedness networks are breathing a heavy sigh of relief today after eight years of a hostile Obama presidency, the IRS sniping at liberty organizations and individual activists based purely on political zealotry, the DHS profiling liberty activists as terrorists and the SPLC frothing at the mouth like rabid animals looking to use their ties to the feds as a means to sink their teeth into any conservatives with the guts to refuse participation in the mainstream narrative. \\nWith conservatives launching into 2017 with complete control of government and a Trump mandate, it would seem that liberty groups have “won the fight” and have nothing to worry about. \\nThat said, don’t get too comfortable, folks, because now we are going to discuss my negative predictions going into next year… The Final Stage Of Economic Collapse \\nEconomic collapse is a process, not a singular event; stock markets play only a minor part in this process. Most Americans’ only relation to the economy is through the daily rise and fall of the Dow Jones. If they see the Dow in the green, they go on with their day. If they see the Dow in the red, they stop and question what is happening. The election of Donald Trump has surprised many with a sudden rise, rather than fall, in stock markets. But, as I told my readers before the election, it would be wise to wait a couple of weeks before trying to analyze these markets because that is how long it will take just to absorb the election results. \\nI predict first that central banks around the globe will further cut stimulus measures and that the Fed is now guaranteed to raise interest rates, probably in December before Trump even enters the White House. I also believe that the process of initiating a market crisis will take approximately six months to become widely visible to the public. As a consequence of the Fed pulling the plug on markets, I predict Trump and the Fed will enter into open hostilities against each other, which will erode international faith in the U.S. dollar as the world reserve currency. \\nBy extension, Trump’s presence in the White House will exacerbate already-existing tensions with Saudi Arabia. The Saudi 9/11 bill is just the beginning. As a result, I believe Saudi Arabia will dump the U.S. dollar as the petro-currency, influencing numerous other OPEC nations to do the same. I believe this will happen by early 2018. \\nIn my view, for now, oil prices will be the best indicator for where stocks are headed in the next few months. \\nThis is not something many Trump supporters want to hear. The response in the liberty movement to my prediction that the elites would allow Trump into office was rather predictable as well. In my article ‘Why The U.S. Election Has The Entire World Confused’ I stated: \\n“I have not taken this position just to be contrary. If I think about it honestly, my position is truly a losing position. If I am mistaken and Clinton wins on the 8th then I’ll probably never hear the end of it, but that’s a risk that has to be taken, because what I see here is a move on the chess board that others are not considering. If I’m wrong, then I’m wrong. \\nThat said, if I am right, then I still lose, because Trump supporters and half the liberty movement will be so enraptured that they will probably ignore the greater issue — that Trump is the candidate the elites wanted all along.” \\nThis seems to be the reaction from about half the liberty movement so far; a general blind faith and bias, clinging to the idea that the election (just like the Brexit) was a victory, and that conservatives had just won the culture war and defeated the globalists. It’s funny how it wasn’t much of a controversy when everyone thought I was wrong about Trump winning in the first place. \\nThere are two primary arguments that come up with these people. First, that my view on the influence of the elites is “unrealistic” and that the elites would have to be “omnipotent” in order to succeed in directing the outcome of these events so effectively. I will address this argument in detail in my next article on the Trump presidency and what the consequences will be for us all if Trump turns out not to be a constitutionalist. \\nThe second argument they present is that the elites “will never succeed” in blaming Trump and conservatives for an economic crisis that was decades in the making. To the people that embrace this argument I say — I understand mass psychology far better than you do. \\nThe reality is, half of America is ALREADY primed to blame Trump for everything that happens over the next four years (if we even make it that long). Possession is nine-tenths of the law in the minds of many. Beyond that, every meme in the global media and on the left is promoting the idea that Trump is an apocalypse in the making. Even Germany’s ‘Der Spiegal’ published its after-election magazine with a cover depicting Trump’s head as a giant comet hurtling towards the Earth. Don’t tell me that Trump cannot be blamed for an economic crisis. Only a complete idiot would suggest that he is anything other than the perfect scapegoat. \\nAt bottom, it does not matter whether people believe the above predictions or not. I have hundreds of emails from readers who called me a “tinfoil hatter” in the past and are now apologizing. So, if you plan to react in a knee-jerk fashion to the notion that Trump and conservatives are being set up by the elites for a final financial flagellation, be sure to write two letters — one for today saying I’ve lost touch, and the other for tomorrow when you find out I was right once again. \\nThis article was written by Brandon Smith of Alt-Market.com and first published at Personal Liberty.com . Click here to subscribe : Join over one million monthly readers and receive breaking news, strategies, ideas and commentary. Please Spread The Word And Share This Post \\nAuthor: Brandon Smith Views: Read by 358 people Date: November 16th, 2016 Website: http://alt-market.com/articles/3061-world-suffers-from-trump-shell-shock-heres-what-will-happen-next \\nCopyright Information: This content has been contributed to SHTFplan by a third-party or has been republished with permission from the author. Please contact the author directly for republishing information.'"}, "time": 1742563575.43563}