{"duration": 0.09967184066772461, "input_args": {"text": "'MOUNT VERNON, Va.  —   The costumed characters at George Washington’s gracious estate here are used to handling all manner of awkward queries, whether about   privies or the first president’s teeth. So when a visitor recently asked an     in a full skirt and head scarf if she knew Ona Judge, the woman didn’t miss a beat. Judge’s escape from the presidential residence in Philadelphia in 1796 had been “a great embarrassment to General and Lady Washington,” the woman said, before offering her own view of the matter. “Ona was born free, like everybody,” she said. “It was this world that made her a slave. ” It’s always 1799 at Mount Vernon, where more than a million visitors annually see the property as it was just before Washington’s death, when his will famously freed all 123 of his slaves. That liberation did not apply to Ona Judge, one of 153 slaves held by Martha Washington. But Judge, it turned out, evaded the Washingtons’ dogged (and sometimes illegal) efforts to recapture her, and would live quietly in New Hampshire for another 50 years. Now her story  —   and the challenge it offers to the notion that Washington somehow transcended the seamy reality of slaveholding  —   is having its fullest airing yet. Judge is among the 19 enslaved people highlighted in “Lives Bound Together: Slavery at George Washington’s Mount Vernon,” the first major exhibition here dedicated to the topic. She is also the subject of a book, “Never Caught: The Washingtons’ Relentless Pursuit of Their Runaway Slave, Ona Judge,” by Erica Armstrong Dunbar. Most scholars who have written about Judge’s escape have used it as a lens onto Washington’s evolving ideas about slavery. But “Never Caught,” published on Tuesday by 37 Ink, flips the perspective, focusing on what freedom meant to the people he kept in bondage. “We have the famous fugitives, like Harriet Tubman and Frederick Douglass,” Ms. Dunbar, a professor of black studies and history at the University of Delaware, said in an interview in Mount Vernon’s    food court. “But decades before them, Ona Judge did this. I want people to know her story. ” Research on slavery has exploded in the two decades since Mount Vernon, Monticello and other founder home sites introduced   tours and other prominent acknowledgments of the enslaved. “Lives Bound Together,” which runs through September 2018, was originally going to fill one    room in the museum here, but soon expanded to include six other galleries normally dedicated to the decorative and fine arts, books and manuscripts. “We had so much material, and it’s such an important story,” Susan P. Schoelwer, the curator at Mount Vernon, said. “We realized we could take many of the objects already on view and reframe them. ” The exhibition makes it clear just who poured from the elegant teapots and did the backbreaking work on the   estate. But integrating the harsh reality of slavery into the heroic story of Washington  —   “a leader of character,” as the title of the permanent exhibition across from the slavery show calls him  —   remains unfinished work, some scholars say. “He’s a much more mythic figure than Jefferson,” said Annette   the author of “The Hemingses of Monticello” and a Harvard professor. “Many people want to see him as perfect in some way. ” But his determined pursuit of Judge, she said, as much as his will freeing his slaves, reflects the basic   of slave owners. “It’s saying, ‘Whatever I might think about slavery in the abstract, I should be able to do what I want with my property,’” she said. Ms. Dunbar, the author of “Never Caught,” first came across Ona Judge in the late 1990s, when she was a graduate student at Columbia researching free black women in Philadelphia. One day in the archives, she noticed a 1796 newspaper ad offering $10 for the return of “a light Mulatto girl, much freckled, with very black eyes and bushy hair” who had “absconded” from the president’s house. “I said to myself: ‘Here I am, a scholar in this field. Why don’t I know about her? ’” Ms. Dunbar recalled. Since then, Judge’s story has inspired several children’s books, and even an episode of “Drunk History. ” But “Never Caught” is the first   nonfiction account, drawing on some newly unearthed sources to track her from Mount Vernon to New York City, Philadelphia and then New Hampshire, at a time when gradual abolition left the line between slavery and freedom ambiguous. “There’s a myth of the North as free, but her story shows how complicated that was,” Ms. Dunbar said. It is in the meticulous ledgers of Mount Vernon that we first see Ona Maria Judge, who was born around 1773 to an enslaved mother and a father who was a white indentured servant. At age 9 she was brought to live in the mansion house, eventually becoming Martha Washington’s personal maid. When Washington became president, Judge followed the first couple to New York and then Philadelphia, home to a growing free black community. Free blacks, Ms. Dunbar writes, aided Judge’s escape in the midst of a presidential dinner, after she had learned that she was to be given to Martha Washington’s granddaughter, Eliza. And it was free blacks who helped her catch a sailing ship to Portsmouth, N. H. where she married, had three children and lived on the edge of poverty, laboring in households far less exalted than the Washingtons’. In two interviews published in abolitionist newspapers shortly before her death in 1848, Judge testified to the desire for freedom that drove her to run away from the Washington household, where she had “never received the least moral or mental instruction,” she said. Judge’s story, Ms. Dunbar said, explodes any notion of “privileged” house slaves, or of the benevolence of the Washingtons, whose far from passive role in perpetuating slavery  —   and in doling out sometimes brutal punishment to the rebellious  —   is described in detail. Ms. Dunbar describes how the Washingtons quietly maneuvered around Pennsylvania’s 1780 gradual abolition law, rotating their slaves in and out of the state every six months. And she recounts their shock at the “ingratitude” of Judge, who fled “without any provocation,” the president wrote. After hearing that Judge was in Portsmouth, Washington, offering a story that she had been “enticed away by a Frenchman,” discreetly sent a federal customs officer to bring her back, circumventing procedures laid out in the 1793 fugitive slave law he himself had signed. When Judge agreed to return on condition that she be freed on Martha’s death, George Washington dismissed her demand as “totally inadmissible. ” However much he might favor general emancipation, he wrote to the customs officer, granting Judge any say in her fate would only “reward unfaithfulness” and give ideas to others “far more deserving of favor. ” In August 1799, Washington, through another associate, tried again to capture her, but was foiled when Judge received a tip about the plot and disappeared. Four months later Washington was dead, freeing all his slaves in his will. Judge and the others held by Martha Washington remained her legal property. Ms. Dunbar calls Washington’s act “no small thing,” but does not see the former president, who had no biological children to disinherit, as the hero of the story. “When it was safe, he emancipated his slaves,” she said. “He dealt with it after his death. And you know what? That’s what all the founders did with slavery: They kicked the can down the road. ”'"}, "time": 1742562159.0814111}