{"duration": 0.023729324340820312, "input_args": {"text": "'Liz Crokin of Townhall. com recently published an article titled “Why the MSM Is Ignoring Trump’s Sex Trafficking Busts” discussing the arrests of sex criminals under Donald Trump’s presidency and why it has been underreported by mainstream outlets. [Since President Donald Trump has been sworn in on Jan. 20, authorities have arrested an unprecedented number of sexual predators involved in child sex trafficking rings in the United States. This should be one of the biggest stories in the national news. Instead, the mainstream media has barely, if at all, covered any of these mass pedophile arrests. This begs the question  —   why? As a strong advocate for sex crime victims, I’ve been closely following the pedophile arrests since Trump took office. There have been a staggering   arrests in one short month compare that to less than 400 sex   arrests in 2014 according to the FBI. It’s been clear to me for awhile that Trump would make human trafficking a top priority. On October 8, 2012, Trump tweeted: ‘Got to do something about these missing children grabbed by the perverts. Too many incidents  —   fast trial, death penalty. Crokin then goes on to discuss the MILO controversy.  As the MSM has ignored these historical arrests, they have zeroed in on casting conservative icon Milo Yiannopoulos as a monster. They claim he supports pedophilia based on comments he made in a video years ago. The reality is Milo was a victim of child sex abuse, and although he did joke about his abuse in an interview, he in no way promotes pedophilia. The opposite is true, and he addressed this controversy head on in a press conference. Not only is it normal for sex abuse victims to make light of their abuse as a coping mechanism, Milo has personally taken down and exposed pedophiles in his columns over the years. However, the mainstream media and the left ignored this information and demonized Milo. The irony of all this is that the left and MSM have been the biggest proponents of pedophilia. Salon has published articles attempting to normalize pedophilia however, to maintain their faux outrage over Milo, they deleted them. The face of the very fake news network CNN, Jake Tapper, fired off several tweets condemning Milo. For example, he tweeted: ‘My friend, a survivor of sex trafficking: “Milo straight up defended abusing 13 yr old boys  …    Please don’t let that be normalized’ If Tapper is so concerned with sex trafficking, why in the world hasn’t he covered the massive sex trafficking arrests that have taken place since Trump took office? It seems he, and many in the leftist media, are only concerned with sex trafficking if it can be used to destroy a conservative. Read the full article here.'"}, "time": 1742628576.1192803}