{"duration": 0.06413483619689941, "input_args": {"text": "'Tweet (Image via intoday.in) \\nIn an announcement which has shocked workers and family members of the Samajwadi party, when their senior most leader Mulayam Singh Yadav said, “Anyone from the Yadav family, who can understand clearly each and every word that I speak will be unanimously appointed as the next UP Chief Minister.” \\nMulayam Singh came to this decision after he realized that 90% of the party members nod blankly to his speeches and instructions without understanding a single word that he speaks. \\n“It all started when Netaji realized that he always gave the same instructions to Shivpal, Akhilesh and Ram Gopal Yadav but they were understood differently by each of them each time. However all three of them would nod as if they had understood the same thing,” said a senior party member close to Mulayam Singh. “Obviously I myself don’t get half of his sentences, but I have become good at reading his lip movements,” he added. \\nThis is not the first time Mulayam Singh has been informed of it. As many as three decades ago, school teachers of Akhilesh Yadav had told Mulayam Singh that his son doesn’t listen to his father. While Mulayam mistook it for Akhilesh being a disobedient child, what the teachers actually meant was that Akhilesh hardly understands what his father speaks. \\nAccording to sources, Mulayam Singh is currently conducting a test among family members to determine who comes closest in understanding his speech in order to accordingly finalize party positions. \\n“To K!$@#$ Communal $Q#$ Q# %@bey @# #$$!@$ #$@#$@ Secular G#$#$%# @# UP, B bil #$Q$ $#$@#$$ Congrss P#!!$ #$@$ #$@ ByeP d#@# #$@$ erection,” said a family member when asked to repeat what Netaji said. \\nMore than half of the family members couldn’t come even remotely close. It was only Akhilesh and Shivpal Yadav who could clearly identify some of the key words from the sentence, which were ‘communal’, ‘secular’, ‘election’, ‘UP’ and ‘Congress’. \\nLater, confusion turned to consternation when an outsider by name Amar Singh heard this family conversation and clearly recited what Netaji said, which was: “To keep Communal forces away and have a secular Government in UP, we will tie up with Congress party and not with BJP during next elections.” \\nWhile Mulayam lauded Amar for the translation, Akhilesh got seriously pissed by the fact that a family conversation was heard by an outsider surreptitiously and launched into an emotional speech to his supporters. \\n(The writer is the author of the book, ‘The Bogus Read’ ) Tweet About D-MAN \\nA jack of many trades who now wants to master some. Born wisecracker who makes every effort to get the maximum out of life. He facebooks here and tweets here .'"}, "time": 1742561937.8324225}