{"duration": 0.19133782386779785, "input_args": {"text": "'MINNEAPOLIS  —   Terence Newman usually views film of the Vikings’ next opponent at the island in his kitchen, but on this night, three days before Minnesota was to host the Arizona Cardinals, he had relocated to a more comfortable spot. Lounging in an oversize leather chair, his legs dangling over the edge, Newman cradled a   digital tablet containing hours of video clips. He pulled up the   plays Arizona had run this season. Even though Newman, as a cornerback, is charged with making receivers disappear, on every snap he also studies the habits of running backs, tight ends and quarterbacks and how they work in concert. Once, he figured out that a team would pass whenever one of its receivers fiddled with his gloves before the snap, and now he was hunting for another subtle hint to tip off what might be coming next. “Ooh!” Newman said. He blurted an expletive and rewound the play he had just watched three, four, five times. “I just picked up something,” he said. “Oh, yeah. Oh, yeah, baby. See that?” Motioning for a visitor to come closer, Newman cued up the clip again. The play, from just before halftime of Arizona’s Week 8 loss at Carolina, featured four receivers, two on each side of the formation, with quarterback Carson Palmer lined up in the shotgun. As some of Carolina’s players realigned, Palmer glanced right and then left while twirling his index fingers in the air like helicopter blades. “It’s the same signals both sides,” Newman said. “And they’re both running the same routes. ” The outside receivers bolted across the middle, and the inside receivers, crossing in front to disrupt the coverage, darted toward the back pylons. No defenders followed, both outside receivers came open, and Palmer, with his pick of either, threw left for the touchdown. Earlier, Newman had seen Palmer make that same gesture, but he needed a recurrence to feel confident jotting his discovery, in small and neat penmanship, into a notebook. “That,” Newman said, “was superconfirmation right there. ” These revelations often occur when he is alone, in the sanctity of his apartment in the vibrant Uptown neighborhood here, where he lives by himself. His kitchen counter is speckled with the foodstuffs of a    bachelor  —   cans of vegetable soup, a   loaf of old bread, a bag of dried mango  —   and those who know Newman well credit his longevity in part to his having never been married. By 38, most N. F. L. cornerbacks have retired or, in far fewer cases, switched to the less physically demanding position of safety, no longer as capable of chasing bigger, stronger and faster receivers around the field. Newman is the oldest cornerback in the league by nearly five years, and by at least some measures, he is also one of the best. According to the analytics website Pro Football Focus, which rates him sixth over all, he has allowed the fewest yards (0. 64) per coverage snap. As Newman acknowledged, his freedom to do what he wants when he wants has prolonged his career. It has enabled him to obey what he called an intuitive understanding of his body, nurturing it with as much sleep, exercise and sustenance as he feels it needs. He keeps himself in such good shape that Minnesota’s strength and conditioning coach, Brent Salazar, said Newman would be ready to play a game in June. It also helps  —   and Newman shuddered, fearful of being jinxed, when this was mentioned  —   that through nearly 14 seasons he has managed to avoid the sort of devastating injury that has ended or curtailed the careers of many of his peers. Newman remains an incredible athlete. But as his speed, power and quickness have deteriorated, he has relied ever more on his cognitive skills. His capacity for decoding opponents’ tendencies through film study has mitigated his physiological decline. His aptitude for processing those tidbits and applying them on the field has preserved his livelihood. “He can think about what’s going to happen and get his body to do it,” Vikings safety Harrison Smith said. “He can make plays with his mind. ” Mike Zimmer, now Minnesota’s coach, witnessed that gift up close when he served as Newman’s defensive coordinator with Dallas from 2003 to 2006 and with Cincinnati from 2012 to 2013. Zimmer endorsed signing Newman, then 36, before the 2015 season, confident that he would be an asset in the Vikings’ secondary and a positive influence on the team’s young cornerbacks. They have spent two seasons absorbing his wisdom, accepting his red wine recommendations and poking fun at the old guy, presenting him with adult diapers, a walker and a cane that Newman keeps in his kitchen. But they have yet to take his job. A few minutes after 11 a. m. on a recent Tuesday, a day off for the Vikings, Newman walked into the makeshift auditorium at the team’s complex in nearby Eden Prairie. It is cordoned off by black curtains in a corner of the indoor practice field. Accompanied by cornerbacks Mackensie Alexander and Trae Waynes, Newman set down his daily cup of black tea, the only caffeine he ingests, on a table in the front row. He could be mistaken for an eager pupil if he were not the stern teacher. It was the first such tutorial for Alexander, who was told the previous day by the secondary coach Jerry Gray to watch film with Newman. “I want to soak up as much knowledge before he’s gone,” Alexander said. Newman prefers to study solo, or with people who respect his intensity and his mandate for silence. The only time he wears glasses is during these sessions. “I want that clarity,” Newman said. “When football comes on, my senses are at their peak. I want my brain to be able to process and diagnose all the information and then retain it. ” He sat before a computer and clutched a remote that linked to a large projection screen that loomed on a stage. Newman clicked on Arizona’s   and   pass plays and went through them in his favored manner, from most frequent to least, one formation at a time. He developed this methodology soon after entering the N. F. L. in 2003, taken fifth over all in the draft by the Cowboys, for whom he made two Pro Bowls. Teammates like Mario Edwards, Roy Williams and Darren Woodson mentored him, helping Newman expand his scope to focus on nuances like body language. He recognized that a team would run every time a receiver kept his hands on his knees, and he learned to eliminate certain routes if a receiver aligned with his outside foot up rather than his inside foot. “You see how their bodies move and how their feet are,” Newman said. “You understand there’s only certain places you can go. ” Early on in Dallas, Zimmer would give Newman homework: Return with all the routes a team ran out of a formation. He would watch every piece of footage to report his findings, and over the years he simplified his approach. Soon, he detected patterns. “By the end of the week, he’d know everything about everybody,” Mark Carrier, Newman’s position coach in Cincinnati, said in a telephone interview. For instance, by watching every play in sequence that a team has run when two receivers line up on each side of a formation, Newman can divine concepts and combinations. He scrutinizes how close each receiver lines up to the quarterback. He notices what routes they run when they line up on the bottom of the numbers  —   the digits that denote   increments  —   compared with the top. He examines if the quarterback is under center or in the shotgun. If a tight end is in, Newman scans to see if routes go toward or away from him. There are finite possibilities, he knows, and soon they mesh in his mind, categorized by down and distance. He backs up those mental files in his notebook, which devotes two pages to every opponent. Reminders are written beneath a general heading and more detailed logs of personnel and formations organized by downs. “I’ve always been a person where if I could see something, I pretty much remember it,” Newman said. Over dinner at a downtown steakhouse, he demonstrated his recall. The conversation shifted to Jets cornerback Darrelle Revis, whom Bengals receiver A. J. Green had beaten for a long touchdown in the teams’ season opener. Newman cited the details, from the length of the play (54 yards) to the route that Brandon LaFell had run across the middle to paralyze the safety who was supposed to assist Revis, as if he were on the sideline that September afternoon. How many times did Newman watch that play? “Just once,” he said. In training camp, Minnesota teammates playfully accused Newman of conspiring with Norv Turner, then the Vikings’ offensive coordinator. He called out routes so many times that they assumed Turner had told him the plays in advance. He had not. Newman just knew them  —   or rather, he had deciphered them. Now his fellow cornerbacks sat observing as Newman cycled through one play after another, pausing only to rewind or scrawl a note. He said little, if anything. A few other players appeared, and the chatter increased. Newman pulled the hood of his sweatshirt over his bald head. When the   session ended, he packed up his gear and walked out, off to receive treatment. Because Newman knew this above all: No matter how diligently he prepares watching film, his discoveries are useless if he is not healthy enough to employ them. After last season, Vikings General Manager Rick Spielman had something to tell Newman. Also, to ask him. “You’re going to be 38 coming up, and you played at a high level this year,” Spielman said he told him. “I did not expect what you were able to do for us. How does your body feel? Do you think you can go another year?” Minnesota’s analytics, Spielman said, revealed that Newman was an outlier. Based on data culled over the last two decades, Newman had defied what Spielman called a “critical age,” when cornerbacks’ effectiveness almost always declines. Players who endure deep into their 30s, and even into their 40s, are mostly specialists  —   long snappers, punters and kickers, like Adam Vinatieri, Indianapolis’s    marvel  —   or quarterbacks, like    Tom Brady, because they tend to absorb fewer     collisions. Few cornerbacks last that long because the position is just too taxing, demanding of its practitioners exceptional speed,   quickness, athleticism, anticipation, footwork and technique. According to the Elias Sports Bureau, the   cornerback in the league is    Tramon Williams of the Cleveland Browns. Newman is the first corner to start at least eight games at 38 since Otis Smith in 2003, according to Elias. “You do the most unnatural thing, which is running backward, turning and then sprinting,” Newman said. “How many people do you know that can run backward as somebody’s running full speed at you?” Mark Verstegen, the founder and president of EXOS, which operates   training centers nationwide, has for 16 years served as the director of performance for the National Football League Players Association. He called the action Newman described  —   acceleration to deceleration to reacceleration  —   the most stressful on a player’s body beyond collisions. “The amount of pure   mileage that he has put on his body  —   it’s immeasurable,” Verstegen said in a telephone interview. Comparing Newman to a racecar, Verstegen added, “But if you’re taking care of your car really well and you know how to drive it smarter, you’re still going to win the checkered flag even if you might have less horsepower and a little less tread on the tires. ” Newman takes an iconoclastic approach to his wellness. For one thing, he does not use a nutritionist. In maintaining his muscular 195 pounds, the    Newman does not deprive himself  —   at the steakhouse, he ordered lamb chops and a Caesar salad with anchovies  —   but he rarely indulges. With few exceptions, he limits his movement between team headquarters, where he eats a smart breakfast (  eggs without the yolk, half a waffle, oatmeal with berries) and lunch, and his apartment, which is near a tangle of food options. He orders the same food at the same restaurants on the same night (crab leg Wednesdays! ). At the Japanese place where he dines on Thursdays, he sits at the same seat, on the far edge of the bar, to await what the bartender calls Newman’s usual: a teriyaki chicken bowl (sauce on the side) and a lava roll (shrimp tempura and avocado topped with yellowfin tuna and sauce) complemented by a healthy pour of pinot noir. “I try to pay attention to some of the stuff that I put in my body now that I’m older,” said Newman, who also takes multivitamins,   fatty acids and supplements promoting joint and   health. “I don’t know if my metabolism is going to get superslow. But I’ve still got abs and stuff. How many     have abs?” Newman has never tested positive under the league’s    policy and is so fastidious about what he puts in his body that he does not understand how players get caught. “You have all the tools to find out what’s good and what’s bad you got an app to tell you all that,” he said, adding, “It’s simple. ” In the   he does not follow the team’s strength and conditioning program and for the past few years has not even worked out regularly with a trainer. He enjoys the spontaneity of tapping thoughts into his phone at breakfast and then amending the plan, if necessary, at the LA Fitness he visits five minutes from his   residence in Dallas. “I’ve worked out all my life, so I’ve learned all this free information,” Newman said. “I know I need to do whatever they ask after a certain period of time, so I work on the things I feel like I need to work on. ” His goal, when he was younger, was just “to get big. ” He realized the fallacy of that strategy when a misdiagnosed knee injury in his second N. F. L. season affected his strength and mobility for several years, even if it took until his fifth season for him to miss a game. He loves doing squats, and his former Bengals teammate Leon Hall, who is now with the Giants, said he rued that he would always have to remove weight plates if he   after Newman. But Newman concentrates on working the smaller, stabilizing muscles around his joints. A former champion sprinter at Kansas State, Newman now runs as fast as he needs to. The winner of the shuttle drill, which evaluates lateral movement and    skills, at the 2003 scouting combine, Newman now is as quick as he needs to be. He will never regain those attributes. But in the spring and summer, he wards off regression with   pickup basketball games, three times a week, against former N. B. A. and college players, a cardiovascular workout that he modifies to fulfill his needs. Newman reaps no physical benefits from scoring. He channels his energy into suffocating defense. He guards the opposition’s best offensive player. “They understand why I’m there,” Newman said. To work on quickness, many cornerbacks set up cones every 5 yards and then backpedal and break, again and again. That drill is popular, Newman said, but not functional. “That’s not reactive,” Newman said. “Our sport is 100 percent reactive. ” He continued: “I do the same things, just in a different way. In football, you turn and you reach out with your hand, use your arms, but in basketball you can’t do that you use all feet. You pick up a guy full court, you shuffle back, and then you’re breaking, turning and opening and cutting him off, trying to stay in front. If he gets by, you’ve got to cut him off and take the right angles. It’s literally the same thing as a corner. ” As he has gotten older, Newman has not dedicated additional time to recovery. But he has a standing appointment with the Vikings’ contracted acupuncturist, Hilary Patzer, on Tuesday mornings even though he hates needles  —   or rather, he hated them until Patzer treated his tight back. “I thought she was a witch at first, from Salem,” Newman said, laughing. “But I’ve never looked back. ” Newman considers this hour, which also includes the ancient Chinese healing method known as cupping, a vital part of his weekly recovery. Depending on how much hitting he did in the previous game, pain often does not set in until Wednesday, when practice resumes. It usually dissipates by Thursday. “Out of nowhere, I’ll feel like I’m 26 again,” Newman said. He devotes part of his afternoon a few days a week to napping, this on top of the eight hours of sleep  —   up at 7:20 a. m. in bed by 11 p. m.  —   he makes sure he gets. Instead of braving   traffic, he remains at the complex an extra 30 to 45 minutes, sitting in the massage chair or donning compression boots to facilitate leg circulation. When he returns the next day, he invariably hears some younger teammates talking about their aches. And this is what he tells them: “You’re walking around like I’m supposed to be walking around. You feel like I’m supposed to feel. ” Newman said he had not decided when he would retire. Could be after this season, or maybe next, depending on the demand for his services. But it will be soon, which saddens Gray, his secondary coach, who said he had seen no evidence that Newman’s body or mind was betraying him. Asked for an example of Newman’s mastery, Gray offered two, each of which resulted in an interception. The first came in a Week 10 victory last season at Oakland. Newman was supposed to thwart Amari Cooper’s release and then linger on the outside. But knowing he had a chance to undercut Cooper, Newman trusted his intuition and swooped inside. “I’m watching and thinking there’s no way,” Gray said. “I knew he knew that play because I know I didn’t coach him. ” The second example reflects Newman’s acumen. Late in the third quarter of a Week 3 win at Carolina this season, Newman matched up against Ted Ginn Jr. Trying to gain separation, Ginn ran tight with him for about 13 yards before making a move intended to force Newman to turn his hips in the opposite direction. It did not fool him. He knew that Ginn would come back, and when he did, Newman dashed in front to grab the ball along Carolina’s sideline. “It’s kind of like batters looking for pitches,” Newman said. “You try to see the ball coming out of their hand and see where the release point’s at. For us, though, it’s not as   as that. ” At the line of scrimmage, he tries decrypting the quarterback’s cadence and audibles. He uploads receivers’ mannerisms. When the ball is snapped, the play unfolds, to him, in slow motion. He begins expecting a catalog of possible routes, all of which are predicated on timing, and based on the receiver’s release or the depth of the quarterback’s drop, he starts winnowing them down. Zimmer favors an aggressive defensive scheme that often asks cornerbacks to play press coverage, denying the receiver a free release off the line. Newman rides receivers, feeling the route, aiming to run it better than they can. But when he plays off coverage, leaving space between him and the receiver, Newman cheats, he said, by watching the first three steps of the quarterback’s drop  —   and sometimes even the first five. From studying the quarterback, Newman knows exactly how he receives the ball, steps, plants and turns his shoulders to throw. There are plays, Newman said, when he knows precisely what will happen. As he spoke, he happened to look up at the television in his apartment, which was showing a Monday night game between the Giants and the Bengals. Based on where Green, his former Cincinnati teammate, lined up, Newman predicted he would run a stop, a slant or, more likely, a screen (which is was Green did). Once Newman thought he had cracked Palmer’s copter signal from his armchair, he wanted to delve a bit into some of Arizona’s receivers. He prompted a snippet of Michael Floyd running a comeback, a basic route in which a receiver runs, stops and turns toward the quarterback. Only the most adept can stop without having their momentum drive them downfield. Many receivers, particularly bigger ones, slow themselves by making rapid chopping movements with their hands and dropping their bodies. “I’m not watching his hips I’m watching his entire frame,” Newman said. “When I see the body go from high to low, I know he’s making his move. That’s when I start to break. ” Newman moved on to Larry Fitzgerald, who lined up behind other receivers at the top of the screen. As Fitzgerald went in motion, Newman correctly posited that he was getting a jump on his over route, an angled dash across the middle. Newman did not know whether he would be defending Fitzgerald, but generally speaking, he said, he prefers playing taller receivers like Fitzgerald off the ball so that he can counter their height with his quickness. “It’s knowing what I do well versus what they don’t do as well,” Newman said. That is the essence of Newman’s preparation, the hours he invests scouring film, surveying weaknesses, searching for clues that will sustain his value to the Vikings. His pursuit consumes him, and no matter how often he talks on FaceTime with his “kind of girlfriend” in California, in those spare moments away from his teammates  —   or the restaurant staff members who know him, or the apartment building concierge who invited him to watch the Vikings play, not realizing Newman would be busy that day  —   loneliness still descends. “Football’s like my escape,” Newman said. “It’s my everything. ” He yawned. His tablet needed recharging, and so did he. Newman has many hobbies  —   golfing, traveling, flying drones  —   but as a budding oenophile, he is perhaps most passionate about wine: strictly red, usually cabernet sauvignon or pinot noir. When he drifts off to sleep, exhausted, his mind is blank, he said, blissfully uncluttered by routes and formations, quarterbacks and receivers, his football mortality. Except for one thing. “I just think about grapes,” he said.'"}, "time": 1742628595.62429}