{"duration": 0.0872197151184082, "input_args": {"text": "'0 comments \\nDuring his final few months in the Senate, senile old Harry Reid has saved his most insane accusation for last. \\nHe is accusing the FBI Director of treason due to his announcement that the department is searching additional documents that could provide information related to the Hillary Clinton email probe. \\nWhat a loony. \\nIn a last ditch effort to save dirty Clinton, Reid accused the FBI chief of violating the Hatch Act, in other words, acting with political motives as a government official. Reid concluded that the FBI director violated this act by sending his letter to Congress days before Election Day. \\nReid stated that according to CBS News ,“Your actions in recent months have demonstrated a disturbing double standard for the treatment of sensitive information, with what appears to be a clear intent to aid one political party over another,” Then he added that that through Comey’s “partisan actions, you may have broken the law.” Harry Reid: FBI Director Comey’s ‘Partisan Actions’ May Violate Federal Law – Letter: pic.twitter.com/agXy4D1igh \\n— Ryan Ruggiero (@RyanRuggiero) October 30, 2016 \\nViolations of the Hatch Act are a serious offense (you might recall this, because numerous Obama Administration officials have been accused of violating the federal law with zero action taken against them. \\n“[Y]our highly selective approach to publicizing information, along with your timing, was intended for the success or failure of a partisan candidate or political group,” Reid wrote. \\nIn providing examples of what he claims are a violation of the Hatch Act, Reid pointed to the “selective approach:” Comey’s refusal to of investigate Trump and his possible campaign ties to the Russian government. \\n“In my communications with you and other top officials in the national security community, it has become clear that you possess explosive information about close ties and coordination between Donald Trump, his top advisors, and the Russian government – a foreign interest openly hostile to the United States, which Trump praises at every opportunity,” he said. “I wrote to you months ago calling for this information to be released to the public… and yet, you continue to resist calls to inform the public of this critical information.” \\n“You’re rushed to take this step eleven days before a presidential election, despite the fact that for all you know, the information you possess could be entirely duplicative of the information you already examined which exonerated Secretary Clinton,” he said. \\nThe Hatch Act is a federal law that was passed in 1939 by President Franklin D. Roosevelt to limit federal agencies or its employees from interfering with political activities or federally funded programs. \\nThis means federal employees can’t hold fund-raisers for politicians or receive donations, but they can vote for or against candidates running in an election, the law states. \\nReid ended the letter reminding the director that he used to be a supporter of Comey’s – even when Republicans filibustered his nomination as FBI chief: “I led the fight to get you confirmed because I believed you to be a principled public servant,” Reid concluded. “With the deepest regret, I now see that I was wrong.” \\nIn all actuality, Comey told Congress that even though he wasn’t “closing the case” in the FBI probe of Hillary’s emails, he was still ending the investigation. \\nIronically can you imagine if he hadn’t sent the letter? With the recent revelations, had he not sent a letter to Congress, he would have been blamed for attempting to lie to Congress and cover-up further investigation. As it stands, by sending the letter, he is simply accused of partisanship by sending the letter. \\nI’d say he’s damned if he does and damned if he doesn’t. \\nI little suspicion that Comey has a backbone MUCH stronger than Harry Reid or any of his spineless Democratic accusers now. \\nWhat an act of desperation on the Democrats part. Hillary is doing nothing but grasping at straws, whether or not anything comes of this new investigation before the election, we’ll see, but to actually accuse Comey of treason, is utter idiocy. Related Items'"}, "time": 1742564600.955445}