{"duration": 0.13843798637390137, "input_args": {"text": "'LONDON  —   The effect on the value of the pound of Britain’s vote to leave the European Union has rarely been out of the headlines since the June 23 referendum. But while the markets panicked  —   an estimated $2 trillion was wiped off world markets the day after the vote  —   the decline of the currency has proved a boon for Britain’s luxury watch retailers. With watches priced in pounds  —   particularly those at the high end  —   suddenly much more attractive to the international market, customers from all over the world have been buying in Britain. London has felt the biggest “Brexit” boom. According to the global market research company GfK, sales of watches priced at more than 10, 000 pounds, or about $12, 320, were up 67 percent in the British capital in September, compared with the same period last year. And the figure was almost as high outside London, up 56 percent. The Federation of the Swiss Watch Industry reported that exports to Britain were up 32. 4 percent year over year in September, making the country the world’s   importer of Swiss watches. In 2015, it was eighth. “Brexit has been hugely beneficial,” said Brian Duffy, chief executive of Aurum Group, which he said accounts for 46 percent of all British watch sales through its network of Watches of Switzerland, Mappin  Webb and Goldsmiths stores. “There are undoubtedly more tourists, and they’re looking to spend, because they’re confident in the value they’re getting. Luxury watch sales across the group are up by 40 percent, end of June to Week 1 of October. ” David Coleridge, chairman of The Watch Gallery, which operates showrooms in Selfridges on Oxford Street and in Manchester, as well as a Rolex boutique in the ultraluxury apartment building One Hyde Park in Knightsbridge, said Brexit had created “the perfect storm. ” “In July,   Arab customers arrived after Ramadan and discovered that London was almost free,” he said. “Then there was publicity around the world that the pound had slid and it was cheap to go to London, and visitor numbers leapt up. And then terrorism in Europe meant more people coming here. ” Sales by a rival retailer in Paris are down 50 percent, Mr. Coleridge noted, adding that even the highly publicized Oct. 2 robbery of Kim Kardashian West, in which jewelry worth millions was stolen while she was visiting Paris, has had an effect. Brands agree that Britain’s market has improved. Vacheron Constantin opened its Bond Street boutique in 2013 and while it had a slow start, the company’s brand manager in Britain, Celine Larose, said sales are picking up  . “Our clients are very ” she said. “But they are no longer waiting. ” And those sales increases have come despite what brands, including all the   houses such as Cartier and Montblanc, are calling inevitable price increases as they try to offset the global imbalance caused by the falling pound. “We put our prices up by 10 percent at the beginning of August,” said Mark Hearn, Patek Philippe’s managing director for Britain. “We try to ensure the playing field is level all around the world. If you have one market that is dramatically cheaper than everywhere else, there are customers who will gravitate to whichever market is significantly cheaper. ” In Britain, for example, Cartier announced a 10 percent rise after the June vote. Roger Dubuis followed an 8 percent price rise in August with a further 6 percent increase taking effect Nov. 1, the same day that Rolex, which had not increased prices in Britain for three years, announced a 10 percent rise. Now the challenge that brands face is convincing the domestic market that it is still a good time to buy. “While increasing U. K. retail prices will mean that a fine watch purchase needs to be even more considered by a domestic client than usual,” said Helen David, Harrods’s chief merchant, “generally, watch purchases, particularly at the higher end, are investment purchases, and as such we continue to see upward movement. ” She added that Harrods’s luxury watch division is experiencing high   growth this year. Richard Mille, whose watches frequently sell for six figures, takes a different approach. “We have a price list in Swiss francs, and we sell at the spot rate on the day,” said Peter Harrison, the company’s chief executive for Europe, the Middle East and Africa. “It’s the fairest way for our customers  —   that way, whether they’re spending in pounds, euros or dollars, it’s up to them when they spend. ” Not all brands are bowing to the pressures created by the weakening of the pound: Swatch Group and LVMH Moët Hennessy Louis Vuitton brands such as TAG Heuer and Hublot have held prices stable, absorbing shrinking margins in a bid to protect local business. Retailers, however, are expecting LVMH’s watch division to raise prices in the new year. “Omega and Swatch Group are not opportunistic,” said Raynald Aeschlimann, Omega’s president and chief executive. “To increase sales would go against our domestic market. For British customers, nothing has changed and we want to keep momentum with those local customers. Raising prices would send a wrong signal. ” Mr. Hearn said Patek Philippe’s price increase had not affected local business and said that despite the increase, Britons would continue to buy at home. “If it’s cheaper in the U. K. for tourists, it’s also cheaper for U. K. customers to buy here, as opposed to buying abroad,” he said. “Certainly, there are Patek Philippe owners in the U. K. who would have been interested in shopping in Hong Kong, the U. S. or Switzerland who choose to buy in the U. K. now. ” The question that brands and retailers are asking themselves is how long the Brexit boom will last. Sales of luxury watches in Britain were on an upward curve before the vote, plumped up by London’s improved reputation as a tourist destination over the past decade and by investment by brands and retailers in retail experience in the city, as well as by redirected sales because of security issues on the Continent. GfK’s figures indicate British sales of watches that cost more than £1, 000 grew 19. 5 percent between January and August, with significant growth even before the departure vote. “Without considering Brexit, our business has dramatically increased in the U. K.,” said Ricardo Guadalupe, Hublot’s chief executive. “Brexit was the icing on the cake, but other geopolitical variables such as terrorist attacks and the current feeling of insecurity have more severely jeopardized business in Europe. ” London also benefits from the variety of its tourist customers. “Compare London to Hong Kong  —   it’s suffering because it’s so reliant on Chinese customers,” Mr. Coleridge said. “London has a mix. We’re even selling to Americans, now. Rolexes are 35 percent cheaper here than in New York. ” Many experts predict a further fall in the value of the pound, posing a continuing problem for brands looking to manage a balanced global pricing strategy. But confidence among British retailers is high. “The U. K. will remain advantaged for the future,” Mr. Duffy said. “We were doing well before Brexit, despite being disadvantaged by a strong pound and visa restrictions. The consumer has confidence in the U. K. market. ”'"}, "time": 1742562222.1522467}