{"duration": 0.9799342155456543, "input_args": {"text": "'Until Nov. 8, 2016, historians of American politics shared a rough consensus about the rise of modern American conservatism. It told a respectable tale. By the end of World War II, the story goes, conservatives had become a scattered and obscure remnant, vanquished by the New Deal and the apparent reality that, as the critic Lionel Trilling wrote in 1950, liberalism was “not only the dominant but even the sole intellectual tradition. ” Year Zero was 1955, when William F. Buckley Jr. started National Review, the   magazine whose aim, Buckley explained, was to “articulate a position on world affairs which a conservative candidate can adhere to without fear of intellectual embarrassment or political surrealism. ” Buckley excommunicated the John Birch Society,   and supporters of the hyperindividualist Ayn Rand, and his cohort fused the diverse schools of conservative thinking  —   traditionalist philosophers, militant   libertarian economists  —   into a coherent ideology, one that eventually came to dominate American politics. I was one of the historians who helped forge this narrative. My first book, “Before the Storm,” was about the rise of Senator Barry Goldwater, the uncompromising National Review favorite whose refusal to exploit the violent backlash against civil rights, and whose bracingly idealistic devotion to the Constitution as he understood it  —   he called for Social Security to be made “voluntary”  —   led to his crushing defeat in the 1964 presidential election. Goldwater’s loss, far from dooming the American right, inspired a new generation of conservative activists to redouble their efforts, paving the way for the Reagan revolution. Educated whites in the prosperous metropolises of the New South sublimated the frenetic, violent anxieties that once marked race relations in their region into more palatable policy concerns about “stable housing values” and “quality local education,” backfooting liberals and transforming conservatives into mainstream champions of a set of positions with enormous appeal to the white American middle class. These were the factors, many historians concluded, that made America a “center right” nation. For better or for worse, politicians seeking to lead either party faced a new reality. Democrats had to honor the public’s distrust of activist government (as Bill Clinton did with his call for the “end of welfare as we know it”). Republicans, for their part, had to play the Buckley role of denouncing the political surrealism of the paranoid fringe (Mitt Romney’s furious backpedaling after joking, “No one’s ever asked to see my birth certificate”). Then the nation’s   birther ran for president. Trump’s campaign was surreal and an intellectual embarrassment, and political experts of all stripes told us he could never become president. That wasn’t how the story was supposed to end. National Review devoted an issue to writing Trump out of the conservative movement an editor there, Jonah Goldberg, even became a leader of the “Never Trump” crusade. But Trump won  —   and some conservative intellectuals embraced a man who exploited the same brutish energies that Buckley had supposedly banished. The professional guardians of America’s past, in short, had made a mistake. We advanced a narrative of the American right that was far too constricted to anticipate the rise of a man like Trump. Historians, of course, are not called upon to be seers. Our professional canons warn us against presentism  —   we are supposed to weigh the evidence of the past on its own terms  —   but at the same time, the questions we ask are conditioned by the present. That is, ultimately, what we are called upon to explain. Which poses a question: If Donald Trump is the latest chapter of conservatism’s story, might historians have been telling that story wrong? American historians’ relationship to conservatism itself has a troubled history. Even after Ronald Reagan’s   landslide in 1980, we paid little attention to the right: The central narrative of America’s political development was still believed to be the rise of the liberal state. But as Newt Gingrich’s   revolutionaries prepared to take over the House of Representatives in 1994, the scholar Alan Brinkley published an essay called “The Problem of American Conservatism” in The American Historical Review. American conservatism, Brinkley argued, “had been something of an orphan in historical scholarship,” and that was “coming to seem an    omission. ” The article inaugurated the boom in scholarship that brought us the story, now widely accepted, of conservatism’s triumphant rise. That story was in part a rejection of an older story. Until the 1990s, the most influential writer on the subject of the American right was Richard Hofstadter, a colleague of Trilling’s at Columbia University in the postwar years. Hofstadter was the leader of the “consensus” school of historians the “consensus” being Americans’ supposed agreement upon moderate liberalism as the nation’s natural governing philosophy. He didn’t take the   conservatives of his own time at all seriously. He called them “pseudoconservatives” and described, for instance, followers of the   Republican senator Joseph McCarthy as cranks who salved their “status anxiety” with conspiracy theories and bizarre panaceas. He named this attitude “the paranoid style in American politics” and, in an article published a month before Barry Goldwater’s presidential defeat, asked, “When, in all our history, has anyone with ideas so bizarre, so archaic, so   so remote from the basic American consensus, ever gone so far?” It was a strangely ahistoric question many of Goldwater’s ideas hewed closely to a   American distrust of statism that goes back all the way to the nation’s founding. It betokened too a certain willful blindness toward the evidence that was already emerging of a popular backlash against liberalism. Reagan’s gubernatorial victory in California two years later, followed by his two landslide presidential wins, made a mockery of Hofstadter. Historians seeking to grasp conservatism’s newly revealed mass appeal would have to take the movement on its own terms. That was my aim when I took up the subject in the late 1990s  —   and, even more explicitly, the aim of Lisa McGirr, now of Harvard University, whose 2001 book, “Suburban Warriors: The Origins of the New American Right,” became a cornerstone of the new literature. Instead of pronouncing upon conservatism from on high, as Hofstadter had, McGirr, a social historian, studied it from the ground up, attending respectfully to what activists understood themselves to be doing. What she found was “a highly educated and thoroughly modern group of men and women,” normal participants in the “bureaucratized world of   War II America. ” They built a “vibrant and remarkable political mobilization,” she wrote, in an effort to address political concerns that would soon be resonating nationwide  —   for instance, their anguish at “liberal permissiveness” about matters like rising crime rates and the teaching of sex education in public schools. But if Hofstadter was overly dismissive of how conservatives understood themselves, the new breed of historians at times proved too credulous. McGirr diligently played down the sheer bloodcurdling hysteria of conservatives during the period she was studying  —   for example, one California senator’s report in 1962 that he had received thousands of letters from constituents concerned about a rumor that Communist Chinese commandos were training in Mexico for an imminent invasion of San Diego. I sometimes made the same mistake. Writing about the movement that led to Goldwater’s 1964 Republican nomination, for instance, it never occurred to me to pay much attention to McCarthyism, even though McCarthy helped Goldwater win his Senate seat in 1952, and Goldwater supported McCarthy to the end. (As did William F. Buckley.) I was writing about the modern conservative movement, the one that led to Reagan, not about the brutish relics of a more gothic,   and supposedly incoherent reactionary era that preceded it. A few historians have provocatively followed a different intellectual path, avoiding both the bloodlessness of the new social historians and the psychologizing condescension of the old Hofstadter school. Foremost among them is Leo Ribuffo, a professor at George Washington University. Ribuffo’s surname announces his identity in the Dickensian style: Irascible, brilliant and deeply learned, he is one of the profession’s great rebuffers. He made his reputation with an   1983 study, “The Old Christian Right: The Protestant Far Right From the Great Depression to the Cold War,” and hasn’t published a proper book since  —   just a series of coruscating essays that frequently focus on what everyone else is getting wrong. In the 1994 issue of The American Historical Review that featured Alan Brinkley’s “The Problem of American Conservatism,” Ribuffo wrote a response contesting Brinkley’s contention, now commonplace, that Trilling was right about American conservatism’s shallow roots. Ribuffo argued that America’s   traditions were far more deeply rooted in the past, and far angrier, than most historians would acknowledge, citing a long list of examples from “regional suspicions of various metropolitan centers and the snobs who lived there” to “white racism institutionalized in slavery and segregation. ” After the election, Ribuffo told me that if he were to write a similar response today, he would call it, “Why Is There So Much Scholarship on ‘Conservatism,’ and Why Has It Left the Historical Profession So Obtuse About Trumpism?” One reason, as Ribuffo argues, is the conceptual error of identifying a discrete “modern conservative movement” in the first place. Another reason, though, is that historians of conservatism, like historians in general, tend to be liberal, and are prone to liberalism’s traditions of politesse. It’s no surprise that we are attracted to polite subjects like “colorblind conservatism” or William F. Buckley. Our work might have been less obtuse had we shared the instincts of a New York University professor named Kim  . “Historians who write about the right should find ways to do so with a sense of the dignity of their subjects,” she observed in a 2011 review, “but they should not hesitate to keep an eye out for the bizarre, the unusual, or the unsettling. ” Looking back from that perspective, we can now see a history that is indeed unsettling  —   but also unsettlingly familiar. Consider, for example, an essay published in 1926 by Hiram Evans, the imperial wizard of the Ku Klux Klan, in the exceedingly mainstream North American Review. His subject was the decline of “Americanism. ” Evans claimed to speak for an abused white majority, “the   Nordic race,” which, “with all its faults, has given the world almost the whole of modern civilization. ” Evans, a former dentist, proposed that his was “a movement of plain people,” and acknowledged that this “lays us open to the charge of being hicks and ‘rubes’ and ‘drivers of secondhand Fords. ’’u2009” But over the course of the last generation, he wrote, these good people “have found themselves increasingly uncomfortable, and finally deeply distressed,” watching a “moral breakdown” that was destroying a   nation. First, there was “confusion in thought and opinion, a groping and hesitancy about national affairs and private life alike, in sharp contrast to the clear, straightforward purposes of our earlier years. ” Next, they found “the control of much of our industry and commerce taken over by strangers, who stacked the cards of success and prosperity against us,” and ultimately these strangers “came to dominate our government. ” The only thing that would make America great again, as it were, was “a return of power into the hands of everyday, not highly cultured, not overly intellectualized, but entirely unspoiled and not   average citizens of old stock. ” This “Second Klan” (the first was formed during Reconstruction) scrambles our   sense of what   ideology does and does not comprise. (Its doctrines, for example, included support for public education, to weaken Catholic parochial schools.) The Klan also put the predations of the international banking class at the center of its rhetoric. Its worldview resembles, in fact, the   politics of contemporary Europe  —   a tradition, heretofore judged foreign to American politics, called “herrenvolk republicanism,” that reserved social democracy solely for the white majority. By reaching back to the reactionary traditions of the 1920s, we might better understand the alliance between the “ ” figures that emerged as fervent Trump supporters during last year’s election and the ascendant   nativist political parties in Europe. None of this history is hidden. Indeed, in the 1990s, a rich scholarly literature emerged on the 1920s Klan and its extraordinary, and decidedly national, influence. (One hotbed of Klan activity, for example, was Anaheim, Calif. McGirr’s “Suburban Warriors” mentions this but doesn’t discuss it neither did I in my own account of Orange County conservatism in “Before the Storm. ” Again, it just didn’t seem relevant to the subject of the modern conservative movement.) The general belief among historians, however, was that the Klan’s national influence faded in the years after 1925, when Indiana’s grand dragon, D. C. Stephenson, who served as the de facto political boss for the entire state, was convicted of murdering a young woman. But the Klan remained relevant far beyond the South. In 1936 a group called the Black Legion, active in the industrial Midwest, burst into public consciousness after members assassinated a Works Progress Administration official in Detroit. The group, which considered itself a Klan enforcement arm, dominated the news that year. The F. B. I. estimated its membership at 135, 000, including a large number of public officials, possibly including Detroit’s police chief. The Associated Press reported in 1936 that the group was suspected of assassinating as many as 50 people. In 1937, Humphrey Bogart starred in a film about it. In an informal survey, however, I found that many leading historians of the right  —   including one who wrote an important book covering the 1930s  —   hadn’t heard of the Black Legion. Stephen H. Norwood, one of the few historians who did study the Black Legion, also mined another rich seam of neglected history in which   vigilantism and outright fascism routinely infiltrated the mainstream of American life. The story begins with Father Charles Coughlin, the   “radio priest” who at his peak reached as many as 30 million weekly listeners. In 1938, Coughlin’s magazine, Social Justice, began reprinting “Protocols of the Learned Elders of Zion,” a forged tract about a global Jewish conspiracy first popularized in the United States by Henry Ford. After presenting this fictitious threat, Coughlin’s paper called for action, in the form of a “crusade against the   forces of the red revolution”  —   a call that was answered, in New York and Boston, by a new organization, the Christian Front. Its members were among the most enthusiastic participants in a 1939   rally that packed Madison Square Garden, where the leader of the   Bund spoke in front of an enormous portrait of George Washington flanked by swastikas. The Bund took a mortal hit that same year  —   its leader was caught embezzling  —   but the Christian Front soldiered on. In 1940, a New York chapter was raided by the F. B. I. for plotting to overthrow the government. The organization survived, and throughout World War II carried out what the New York Yiddish paper The Day called “small pogroms” in Boston and New York that left Jews in “mortal fear” of “almost daily” beatings. Victims who complained to authorities, according to news reports, were “insulted and beaten again. ” Young   men inspired by the Christian Front desecrated nearly every synagogue in Washington Heights. The New York Catholic hierarchy, the mayor of Boston and the governor of Massachusetts largely looked the other way. Why hasn’t the presence of organized mobs with backing in powerful places disturbed historians’ conclusion that the American right was dormant during this period? In fact, the “far right” was never that far from the American mainstream. The historian Richard   writing in the journal Social History, points out that “scholars of American history are by and large in agreement that, in spite of a welter of fringe radical groups on the right in the United States between the wars, fascism never ‘took’ here. ” And, unlike in Europe, fascists did not achieve governmental power. Nevertheless,   continues, “fascism had a very real presence in the U. S. A. comparable to that on continental Europe. ” He cites no less mainstream an organization than the American Legion, whose “National Commander” Alvin Owsley proclaimed in 1922, “the Fascisti are to Italy what the American Legion is to the United States. ” A decade later, Chicago named a thoroughfare after the Fascist military leader Italo Balbo. In 2011,   groups in Chicago protested a movement to rename it.   in America declined after World War II. But as Leo Ribuffo points out, the underlying narrative  —   of a diabolical transnational cabal of aliens plotting to undermine the very foundations of Christian civilization  —   survived in the   diatribes of Joseph McCarthy. The alien narrative continues today in the work of National Review writers like Andrew McCarthy (“How Obama Embraces Islam’s Sharia Agenda”) and Lisa Schiffren (who argued that Obama’s parents could be secret Communists because “for a white woman to marry a black man in 1958, or ’60, there was almost inevitably a connection to explicit Communist politics”). And it found its most potent expression in Donald Trump’s stubborn insistence that Barack Obama was not born in the United States. Trump’s connection to this alternate   genealogy is not just rhetorical. In 1927, 1, 000 hooded Klansmen fought police in Queens in what The Times reported as a “free for all. ” One of those arrested at the scene was the president’s father, Fred Trump. (Trump’s role in the melee is unclear the charge  —   “refusing to disperse”  —   was later dropped.) In the 1950s, Woody Guthrie, at the time a resident of the Beach Haven housing complex the elder Trump built near Coney Island, wrote a song about “Old Man Trump” and the “Racial   stirred   the bloodpot of human   he   color line” in one of his housing developments. In 1973, when Donald Trump was working at Fred’s side, both father and son were named in a federal   suit. The family settled with the Justice Department in the face of evidence that black applicants were told units were not available even as whites were welcomed with open arms. The 1960s and ’70s New York in which Donald Trump came of age, as much as   Indiana in the 1920s or Barry Goldwater’s Arizona in the 1950s, was at conservatism’s cutting edge, setting the emotional tone for a politics of rage. In 1966, when Trump was 20, Mayor John Lindsay placed civilians on a board to more effectively monitor police abuse. The president of the Patrolmen’s Benevolent Association  —   responding, “I am sick and tired of giving in to minority groups and their gripes and their shouting”  —   led a referendum effort to dissolve the board that won 63 percent of the vote. Two years later, fights between supporters and protesters of George Wallace at a Madison Square Garden rally grew so violent that, The New Republic observed, “never again will you read about Berlin in the ’30s without remembering this wild confrontation here of two irrational forces. ” The rest of the country followed New York’s lead. In 1970, after the shooting deaths of four students during antiwar protests at Kent State University in Ohio, a Gallup poll found that 58 percent of Americans blamed the students for their own deaths. (“If they didn’t do what the Guards told them, they should have been mowed down,” one parent of Kent State students told an interviewer.) Days later, hundreds of construction workers from the World Trade Center site beat antiwar protesters at City Hall with their hard hats. (“It was just like Iwo Jima,” an impressed witness remarked.) That year, reports the historian Katherine Scott, 76 percent of Americans “said they did not support the First Amendment right to assemble and dissent from government policies. ” In 1973, the reporter Gail Sheehy joined a group of   workers watching the Watergate hearings in a bar in Astoria, Queens. “If I was Nixon,” one of them said, “I’d shoot every one of them. ” (Who “they” were went unspecified.) This was around the time when New Yorkers were leaping to their feet and cheering during screenings of “Death Wish,” a hit movie about a liberal architect, played by Charles Bronson, who shoots muggers at   range. At an October 2015 rally near Nashville, Donald Trump told his supporters: “I have a license to carry in New York, can you believe that? Nobody knows that. Somebody attacks me, oh, they’re gonna be shocked. ” He imitated a   quick draw, and an appreciative crowd shouted out the name of Bronson’s     film: “’u2009‘Death Wish’!” In 1989, a young white woman was raped in Central Park. Five teenagers, four black and one Latino, confessed to participating in the crime. At the height of the controversy, Donald Trump took out   ads in all the major New York daily papers calling for the return of the death penalty. It was later proved the police had essentially tortured the five into their confessions, and they were eventually cleared by DNA evidence. Trump, however, continues to insist upon their guilt. That confidence resonates deeply with what the sociologist Lawrence Rosenthal calls New York’s “  populism”  —   an attitude, Rosenthal hypothesizes, that Trump learned working alongside the tradesmen in his father’s real estate empire. But the case itself also resonates deeply with narratives dating back to the first Ku Klux Klan of white womanhood defiled by dark savages. Trump’s public call for the supposed perpetrators’ hides, no matter the proof of guilt or innocence, mimics the rituals of Southern lynchings. When Trump vowed on the campaign trail to Make America Great Again, he was generally unclear about when exactly it stopped being great. The Vanderbilt University historian Jefferson Cowie tells a story that points to a possible answer. In his book “The Great Exception,” he suggests that what historians considered the main event in 20th century American political development  —   the rise and consolidation of the “New Deal order”  —   was in fact an anomaly, made politically possible by a convergence of political factors. One of those was immigration. At the beginning of the 20th century, millions of impoverished immigrants, mostly Catholic and Jewish, entered an overwhelmingly Protestant country. It was only when that demographic transformation was suspended by the 1924 Immigration Act that majorities of Americans proved willing to vote for many liberal policies. In 1965, Congress once more allowed   immigration to the United States  —   and it is no accident that this date coincides with the increasing conservative backlash against liberalism itself, now that its spoils would be more widely distributed among nonwhites. The liberalization of immigration law is an obsession of the  . Trump has echoed their rage. “We’ve admitted 59 million immigrants to the United States between 1965 and 2015,” he noted last summer, with rare specificity. “’u2009‘Come on in, anybody. Just come on in.’ Not anymore. ” This was a stark contrast to Reagan, who venerated immigrants, proudly signing a 1986 bill, sponsored by the conservative Republican senator Alan Simpson, that granted many undocumented immigrants citizenship. Shortly before announcing his 1980 presidential run, Reagan even boasted of his wish “to create, literally, a common market situation here in the Americas with an open border between ourselves and Mexico. ” But on immigration, at least, it is Trump, not Reagan, who is the apotheosis of the brand of conservatism that now prevails. A’u2009puzzle remains. If Donald Trump was elected as a Marine Le    —   or Hiram    —   herrenvolk republican, what are we to make of the fact that he placed so many bankers and billionaires in his cabinet, and has relentlessly pursued so many    policies? More to the point, what are we to the make of the fact that his supporters don’t seem to mind? Here, however, Trump is far from unique. The history of    between conservative electioneering and conservative governance is another rich seam that calls out for fresh scholarly excavation: not of how conservative voters see their leaders, but of the neglected history of how conservative leaders see their voters. In their 1987 book, “Right Turn,” the political scientists Joel Rogers and Thomas Ferguson presented   data demonstrating that Reagan’s crusade against activist government, which was widely understood to be the source of his popularity, was not, in fact, particularly popular. For example, when Reagan was   in 1984, only 35 percent of voters favored significant cuts in social programs to reduce the deficit. Much excellent scholarship, well worth revisiting in the age of Trump, suggests an explanation for Reagan’s subsequent success at cutting back social programs in the face of hostile public opinion: It was business leaders, not the general public, who moved to the right, and they became increasingly aggressive and skilled in manipulating the political process behind the scenes. But another answer hides in plain sight. The   negotiation between populist electioneering and plutocratic governance on the right has long been not so much a matter of policy as it has been a matter of show business. The media scholar Tim Raphael, in his 2009 book, “The President Electric: Ronald Reagan and the Politics of Performance,” calls the   commercials that interrupted episodes of The General Electric Theater  —   starring Reagan and his family in their     Pacific Palisades home, outfitted for them by G. E.  —   television’s first “reality show. ” For the California voters who soon made him governor, the ads created a sense of Reagan as a certain kind of character: the kindly paterfamilias, a trustworthy and nonthreatening guardian of the white   suburban enclave. Years later, the producers of “The Apprentice” carefully crafted a Trump character who was the quintessence of steely resolve and   mastery. American voters noticed. Linda Lucchese, a Trump convention delegate from Illinois who had never previously been involved in politics, told me that she watched “The Apprentice” and decided that Trump would make a perfect president. “All those celebrities,” she told me: “They showed him respect. ” It is a short leap from advertising and reality TV to darker forms of manipulation. Consider the parallels since the 1970s between conservative activism and the traditional techniques of con men.   pioneers like Richard Viguerie created       letters about civilization on the verge of collapse. One 1979 pitch warned that “federal and state legislatures are literally flooded with proposed laws that are aimed at total confiscation of firearms from   citizens. ” Another, from the 1990s, warned that “babies are being harvested and sold on the black market by Planned Parenthood clinics. ” Recipients of these alarming missives sent checks to battle phony crises, and what they got in return was very real tax cuts for the rich. Note also the more recent connection between Republican politics and “multilevel marketing” operations like Amway (Trump’s education secretary, Betsy DeVos, is the wife of Amway’s former president and the    of its  ) and how easily some of these marketing schemes shade into the promotion of dubious miracle cures (Ben Carson, secretary of housing and urban development, with “glyconutrients” Mike Huckabee shilling for a “solution kit” to “reverse” diabetes Trump himself taking on a     multilevel marketing scheme in 2009). The dubious grifting of Donald Trump, in short, is a part of the structure of conservative history. Future historians won’t find all that much of a foundation for Trumpism in the grim essays of William F. Buckley, the scrupulous constitutionalist principles of Barry Goldwater or the   optimism of Ronald Reagan. They’ll need instead to study conservative history’s political surrealists and intellectual embarrassments, its con artists and tribunes of white rage. It will not be a pleasant story. But if those historians are to construct new arguments to make sense of Trump, the first step may be to risk being impolite.'"}, "time": 1742562633.492033}