{"duration": 0.06171464920043945, "input_args": {"text": "'Clear heart blockages with this powerful lemon and garlic mixture \\n  Amy Goodrich Tags: cholesterol , heart blockages , natural remedies (NaturalNews) When your coronary arteries narrow, they fail to supply the heart with enough oxygen-rich blood. At first, this may result in chest pain and shortness of breath. However, when fatty substances continue to build up, a total blockage may cause a heart attack.In the United States, high levels of LDL cholesterol – also known as \"bad\" cholesterol – remain a major risk factor for cardiovascular disease and stroke. To avoid these sticky cholesterol build-ups, millions of Americans resort to cholesterol-lowering drugs .According to the Centers for Disease Control and Prevention (CDC), more than 33 percent of U.S. adults – or 78.1 million people aged 21 or older – are eligible for cholesterol-lowering medication or are already taking it. Unfortunately, most of these drugs come with a host of negative side-effects. Think of the whole statin debate that has been going on for quite a while now.If you are one of the millions of people struggling with high cholesterol levels, regular exercise, eating a heart-healthy diet and losing weight are all it takes to lower them. Below, you\\'ll find three remedies using lemon and garlic that will help you to keep your arteries free and your heart healthy. Heart-friendly lemon and garlic mixture Heart remedy #1 1 cup apple cider vinegar 3 cups natural honey In a saucepan or pot, combine lemon juice, garlic juice, ginger juice and apple cider vinegar. Mix well and boil for half an hour or until approximately one cup of the liquid has evaporated. When cool, stir in honey and transfer to a glass bottle or jar. Store in the fridge. Every morning before breakfast take one tablespoon of the mixture. Heart remedy #2 6 lemons, peeled and cut into small pieces 30 cloves of garlic, peeled and chopped into small pieces 2 liters filtered water Add lemon and garlic pieces to a blender or food processor. Top with one-quarter to half of the water and blend. Pour the mixture into a pot and add the remaining filtered water. Bring to a boil and simmer for five minutes. Allow to cool and strain the liquid into a glass bottle or jar. Discard the residue and store the lemon garlic mixture in the fridge. Note: Do not pour the mixture into a plastic bottle as it may leach toxic compounds into your drink.For three weeks, drink 50 milliliters of the mixture daily. Then pause the remedy for a week, followed by another three weeks of a dose of 50 milliliters a day. Repeat the treatment every 6 months. Heart remedy #3 Method 3 is for you if you don\\'t like the lemon garlic taste. It is similar to the second method, the only difference being that it has double the amount of water and a bigger serving size. 6 lemons, peeled and cut into small pieces 30 cloves of garlic, peeled and chopped into small pieces 4 liters filtered water Work in batches. Add half of the lemon and garlic pieces to a blender or food processor. Top with one liter of the water (or less if you have a small blender) and blend. Pour the mixture into a pot and add another liter of water. Repeat with the remaining lemon, garlic and water.Bring to a boil and simmer for another five minutes. Allow to cool and strain the liquid into a glass bottle or jar. Discard the residue and store the lemon garlic mixture in the fridge.For three weeks, drink one normal-sized glass of the mixture daily. Then pause the remedy for a week, followed by another three weeks of one glass a day. Repeat the treatment every 12 months.If you want, you can slightly warm the mixture to create a healing tea or pour over ice for a refreshing iced tea. Sources for this article include:'"}, "time": 1742561943.980756}