{"duration": 0.07874202728271484, "input_args": {"text": "'The US Pivot to Asia: Death by Trump \\nIn my opinion, the pivot was always an auto - da - fé , an act of faith: a cumbersome, expensive, difficult, and onerous strategy that ran counter to the trend of declining American relative strength and indeed was attempting to reverse it. Sort of like how the Catholic Church used the Inquisition as an elaborate public ritual to command faith in the universal power of the church and its doctrine when things were headed in the opposite direction. An auto - da - fé was often but not invariably punctuated by the public execution of some victim, hence its association with getting burned at the stake, but an auto - da - fé was really supposed to instill faith in the doctrinal and moral rightness of the church in the onlookers. \\nYou know, like sending two carriers into the South China Sea to declare the US ain’t goin’ nowhere. \\nGotta have faith, in other words, with thin lines between affirming faith that’s already strong and reinforcing faith that was wavering and, when things get desperate, pretending faith is there when it isn’t. \\nOne of the most magnificent auto - da - fés was conducted in Madrid in 1680. It serves as subject of one of the masterpieces of Spanish painting in the Prado, Auto-da-fe in the Plaza Mayor of Madrid by (an Italian) Francisco Rizi. If the picture below messes up your browser, here’s a link to a high-resolution version . \\nThis elaborate spectacle was staged to affirm the stature of the young King Charles II as the spiritual as well as political leader of Spain, and impress his new bride. Somewhat borderline-blasphemously, at least in my opinion, the ceremony is a temporal dramatic rendering of the last day of judgment, with Charles II symbolically sitting in judgment of sinners (and burnishing his credentials as a religious leader) in place of You-Know-Who. \\nThe painting itself is a carefully-composed document to confirm the religious and royal authority of Charles II. Fortunately, a detailed analysis of the painting by Dr. Helen Rawlings of Leicester University is available on the Internet. If readers consult her piece instead of viewing Rizi’s painting as an ornate jumble of colorful figures, they will be rewarded. For instance, that crowd of people on the risers to the right aren’t season ticket holders with preferred seating: they’re the accused, 118 of them, mainly Portugese peasants accused of practicing Judaism, waiting to be led to the central platform to hear their sentences. 19 were burned the next day; 68 repented and were subjected to various non-lethal punishments; and 34 were represented only by effigies since they had fled or already died. \\nThose who repented received clemency and were reconciled to the Church during the auto - da - fé, in a ritual that was meant to form the emotional and religious heart of the ceremony. However, for understandable reasons the grotesque and galvanizing spectacle of the unrepentant getting burned to death the next day is what stuck in peoples’ minds. \\nConveniently for the purposes of my analogy, the 1680 auto-da-fe was both the culmination and the inflection point for the decline of the Inquisition and Spain itself. As Dr. Rawlings puts it, Rizi’s magnificent painting is “a defining image of the decline of the Spanish Inquisition rather than a celebration of its triumph.” \\nSo I think the Asian pivot was, at its heart, an auto - da - fé, an elaborate and expensive ritual that affirmed America’s position at the heart and as the heart of the regional security order–and implying its impermanence. \\nFor the Asian countries to resist the urge to integrate economically with China and instead signing on to a military containment structure led by the US, they had to have faith that the United States would be there, if not forever, for the foreseeable future, injecting pressure, inducements, and political and financial capital into the region to sustain the strategy. \\nWell, the pivot isn’t dead—never say never—but the simple uncertainty introduced by Trump makes it harder for Asian countries to have faith in the US commitment to the strategy of the pivot–by which the US trades considerable current national capital in return for future and rather intangible advantages–and the long term sustainability of the pivot architecture. \\nThe pathetic public demise of the TPP ain’t helping. \\nAsh Carter had characterized TPP—an everybody-but-China trade club intended to provide Asian nations with a “high standards” alternative to succumbing to the PRC’s economic gravity—as the equivalent of another aircraft carrier. Instead, the US under Trump will go bilateral on its trade policy and instead of two big trade blocs, one US-led and the other PRC-led, Asian nations will go “all of the above” in their trade treaties, something that, as PRC regional clout grows and relative US clout declines, will not please US pivoteers attempting to claim the “Pacific Century” for America. \\nI think part of the strategy of the pivot was an attempt to embed it—get enough buy-in and make it complex enough that the costs of dismantling it would be regarded as unacceptable. \\nA collateral advantage was that it was so complicated that only dedicated pivoteers would be able to run it. Job security! as well as policy continuity, in other words. \\nIronically, it appears a good number of pivoteers may have inadvertently taken themselves out of the game by coming out so early and so strongly against Trump. Part of this was probably a matter of conviction, and partly in response to a Clinton strategy of stockpiling declarations of support by token solicitations for advice from the FP community. \\nAnyway, the word from the Trump campaign via Buzzfeed is that everybody who signed a letter denouncing Trump as unfit for the presidency is—not a big surprise here—blacklisted, and it looks like by default the only Republican Asia heavyweights left are a bunch of Bush-era realists. \\nAs I state in my AT pieces, there are some really opportunities to improve the US position in the Philippines and vis a vis North Korea if the U.S. sheds the pivot incubus. \\nBut I don’t think Trump has the inclination or energy to come up with an alternative to the pivot, and the pivoteers embedded in the Pentagon, State Department, and think-tanks will continue to push for implementation of their cherished strategy. \\nProblem is, the pivot was already tottering in some secondary markets—Thailand, Burma, and the Philippines—in response to intensive Chinese pressure and blandishments. \\nNow, I think the Asian democracies, including heavy hitters South Korea and Japan, will be less inclined to provide these initiatives with the enthusiastic support they require as Trumpismo reinforces the new reality that America is in Asia when it wants to be; China will never leave. \\nThat’s the new article of faith. (Reprinted from China Matters by permission of author or representative)'"}, "time": 1742628546.8077376}