{"duration": 0.14156007766723633, "input_args": {"text": "'Marital strife smolders, explodes and uneasily subsides on “Lemonade” (Parkwood Entertainment) the album Beyoncé   on Saturday night. “You can taste the  ’s all over your breath” are the first words she sings in “Pray You Catch Me,” and that’s just the beginning of an album that probes betrayal, jealousy, revenge and rage before dutifully willing itself toward reconciliation at the end. Many of the accusations are aimed specifically and recognizably at her husband, Shawn Carter, the rapper Jay Z. “Tonight I regret the night I put that ring on,” she   in “Sorry,” a twitchy, flippant song that’s by no means an apology. It’s a combative, unglossy track on an album full of them. “Lemonade” is the kind of album that a star like Beyoncé (as well as, lately, Rihanna) can release in the streaming era because she’s already guaranteed attention for her every utterance. The album is not beholden to radio formats or presold by a single fans are likely to explore the whole album, streaming every track and hearing how far afield  —   a brass band, stomping   ultraslow    —   Beyoncé is willing to go. As she did with her 2013 album, “Beyoncé,” she has also paired the music with   video that expands and deepens its impact. On their own, the songs can be taken as one star’s personal, domestic dramas, waiting to be mined by the tabloids. But with the video, they testify to situations and emotions countless women endure. It’s not a divorce announcement the singer, songwriter and director is credited as Beyoncé Knowles Carter. Beyoncé released “Lemonade” online at 10 p. m. on April 23, immediately after the HBO showing of the hourlong “visual album” version. It’s a   music video that intersperses the songs, and broadens them, with compelling poetry from the   writer Warsan Shire, poems that often extend women’s physicality toward the archetypal. As Beyoncé recites them, Ms. Shire’s words radically reframe the songs, so they are no longer one woman’s struggles but tribulations shared through generations of mothers and daughters. The video is filled with images of female solidarity and of family, Southern and African roots, women of all ages and roles and eras. Often, Beyoncé is joined by   women in white clothes enacting shared work, gatherings of women or eerie communal rituals. Beyoncé, in multiple hairstyles and fashions, is shown both alluring and unglamorous:   unhappy, sweaty, harshly lit. For the last few songs she often appears in a     dress remade with fabric patterns derived from African textiles, a rich twist. The album title comes from a family gathering that’s shown in the video and heard on a track: the 90th birthday of Hattie White, Jay Z’s grandmother, who says, “I was served lemons but I made lemonade. ” “Lemonade” is not necessarily the album listeners might have expected after “Formation,” the song Beyoncé performed at the Super Bowl with dancers in Black   outfits and in a video clip using images of New Orleans, of   in a plantation mansion and of Beyoncé atop a police car, sinking under a flood. It’s the last song on “Lemonade,” almost a postscript it’s not in the extended video. One other song on “Lemonade” mixes preaching and a prison song (both collected by John and Alan Lomax) a Kendrick Lamar rap and 1960s   psychedelia (sampling the collectors’ item Puerto Rican band Kaleidoscope) to call for “Freedom”: “I break chains all by  ’t let my freedom rot in hell,” Beyoncé vows. But most of “Lemonade” arrives like a   to “Jealous” on the 2013 “Beyoncé,” a song that moans, “I hate you for your lies. ” “Jealous” is offset on “Beyoncé” by songs about ecstatic lust, a topic largely absent on “Lemonade. ” In most of the new songs, Beyoncé has been taken for granted or pushed aside. It’s a situation that, she finds, is both “a wicked way to treat the girl that loves you” and also flabbergasting given that she is, after all, Beyoncé. Beyoncé!: “The baddest woman in the game,” as she sings in “Hold Up. ”  : She is. Her reactions swing from sorrow to rage to determined loyalty, and she reaches beyond the   of “Beyoncé” to embrace new influences and collaborators: the Yeah Yeah Yeahs, Father John Misty, Vampire Weekend’s Ezra Koenig, Animal Collective and Led Zeppelin. “Don’t Hurt Yourself,” a collaboration with Jack White, is a     that has Beyoncé fighting back, declaring, “You ain’t trying hard   ain’t loving hard enough,” working up to a scream. “Pray You Catch Me” is one of two collaborations with the British songwriter James Blake:   ballads of suspicion and longing. During “Forward,” the other Blake collaboration, the video has its most moving sequence: family members stoically holding photographs of men who were killed by police. It’s followed by a scene of a New Orleans Mardi Gras Indian in full feathered and beaded costume, shaking a tambourine in posh dining rooms as if to exorcise them. Yet eventually, she makes peace with trying to hold on. “Love Drought,” with whispery vocals amid pillowy synthesizers, points out that “10 times out of nine I know you’re lying,” but strives to reconnect. “Sandcastles,” a slow piano hymn that eventually gathers a choir, recalls a   fight but turns a double negative into a positive: “I know I promised that I couldn’t stay,   promise don’t work out that way. ” By the time Beyoncé reaches “All Night,” a gospelly ballad roughened with electric guitar, she resolves to “Give you some time to prove I can trust you again. ” Will it work out? No one knows. But in the meantime she sings wholeheartedly, encapsulates deep dilemmas in terse singalong lines and touches on ideas and emotions that so many people feel. She is a star whose world is vastly different from that of her listeners. But in matters of the heart, with their complications and paradoxes, Beyoncé joins all of us.'"}, "time": 1742561635.7437716}