{"duration": 0.10505843162536621, "input_args": {"text": "'Villanova ( ) which won last year’s N. C. A. A. men’s basketball tournament on a   at the buzzer in the championship game, was awarded the top overall seed in this year’s bracket, released Sunday evening, one day after winning the Big East tournament. The other No. 1 seeds include North Carolina ( ) the team Villanova beat in that thrilling 2016 title game Kansas ( ) which has now received a top seed seven times in Coach Bill Self’s 14 seasons and Gonzaga ( ) from the West Coast Conference, which despite several deep runs and, now, 19 straight berths has never made the Final Four. The preseason Nos. 1 and 2 in the Associated Press poll, Duke ( ) and Kentucky ( ) earned No. 2 seeds. Both are loaded with talent, including several freshmen expected to turn pro later this year, and while each struggled at times due to inexperience and injury, in recent weeks they seem to have cohered, respectively winning the Atlantic Coast and Southeastern Conference tournaments. The   team from the   was conference champion Arizona ( ) with a   while the Big Ten’s   member was   Purdue ( ). Northwestern ( ) was virtually assured of its first berth ever in the nearly 80 years of the tournament. Here’s a breakdown of each region:   Gonzaga was installed as a No. 1 seed for the second time in program history, but the last time, in 2013, did not go so well. The Bulldogs lost to   Wichita State in the second round. But while Gonzaga ( ) still has never been to a Final Four, the Bulldogs are a worthy No. 1: They lost only to Brigham Young and outscored opponents by more than 23 points a game. The Zags’ biggest problem? Arizona, the   champion, lurks at No. 2. NORTHWESTERN IS IN Is something in the water in Chicago? First the Cubs win the World Series, and now the Wildcats, the darlings of the Big Ten, are in the tournament for the first time.   Northwestern will face Vanderbilt in a battle of colleges used to being overlooked  —   sometimes for good reason  —   in sports. UPSET SPECIAL Harvard in 2014. Yale in 2016. Don’t bet against the Ivies. Princeton, unbeaten in the conference, winner of the league’s inaugural tournament, has won 19 in a row. You can make it 20. Sorry, Notre Dame. Winning a   title was clearly valued by the selection committee, which made North Carolina a No. 1 seed despite its loss to Duke in the Atlantic Coast Conference tournament. The South might be the most fun region to watch: North Carolina, the   blue bloods Kentucky and U. C. L. A. and Wichita State and Wake Forest all have   scoring offenses. OH, YOU AGAIN A Wichita   rematch? Sign us up. Too bad it would come in the second round. Three years after a classic    game, Wichita State could be poised for revenge. One analyst, Ken Pomeroy, rates the   Shockers as the nation’s   team. UPSET SPECIAL Louisville Coach Rick Pitino and his son Richard, who leads Minnesota, are the first   coaching duo in one N. C. A. A. tournament. But Minnesota is a good bet to go down to Middle Tennessee State, which is   and which eliminated Michigan State a year ago. Kansas may have the easiest path to the Final Four of any of the No. 1 seeds. The Jayhawks would not normally like seeing Michigan State in its region, but the   Spartans have been troubled by injuries. Louisville, the No. 2 seed, is typically tough on defense, but the Jayhawks appear rested and ready as they chase their first N. C. A. A. title since 2008. TEAM OF DESTINY Something happened in those few harrowing seconds when Michigan’s plane skidded off the runway in an aborted takeoff en route to the Big Ten tournament. The Wolverines, the eighth seed in that tournament, won four straight games to earn a No. 7 seed in this one. A deathly scare seems to have given Michigan new life. UPSET SPECIAL Few picked Iona to win even the M. A. A. C. tournament, but don’t be shocked if the Gaels stun No. 3 Oregon. The Ducks are reeling after losing the senior Chris Boucher (11. 8 points, 6. 1 rebounds, 2. 5 blocks) to a knee injury. It was no surprise that Villanova, the Big East champion, received the bracket’s No. 1 overall seed. But the Wildcats ( ) could end up meeting Duke ( ) for a trip to the Final Four. Despite three straight wins over ranked teams en route to the Atlantic Coast Conference tournament title, the Blue Devils failed to supplant North Carolina  —   whom they defeated in two of three meetings this season  —   as a No. 1 seed. HARD TO FORGET Try to remember this name: Jesusemilore Talodabijesu Ojeleye. Better known as Semi, the junior forward leads   Southern Methodist, a No. 6 seed that has won 16 in a row. Coach Larry Brown’s abrupt resignation last summer seemed to galvanize the Mustangs, who are third in the nation in scoring defense. All five starters are 6 feet 6 inches or taller. UPSET SPECIAL South Carolina is staggering in with six losses in its past nine games and was probably   as a No. 7. The Gamecocks will struggle with Marquette, which leads the nation in   shooting percentage (43 percent). You want a hot team for your bracket? How about Michigan, which has not lost since its plane slid off the runway in Ypsilanti on Wednesday. No one was hurt, but the accident meant the team had to travel to the Big Ten tournament on game day morning and wear makeshift uniforms for their first round game. Not a recipe for success? Think again. Michigan, seeded just eighth, reeled off four straight wins in four days, over No. 9 Illinois, No. 1 Purdue, No. 4 Minnesota and No. 2 Wisconsin to take the tournament. Hot teams in conference tournaments have sometimes immediately flamed out in the N. C. A. A. tournament, so there’s no guarantee Michigan’s run will continue. But if you believe in momentum, you might want to give the Wolverines a close look. Arizona, Bucknell, Duke, East Tennessee State, Florida Gulf Coast, Gonzaga, Iona, Iowa State, Jacksonville State, Kent State, Kentucky, Michigan, Middle Tennessee, Mount St. Mary’s, Nevada, New Mexico State, New Orleans, North Carolina Central, North Dakota, Northern Kentucky, U. N. C. Wilmington, Princeton, Rhode Island, South Dakota State, Texas Southern, U. C. Davis, Vermont, Villanova, Wichita State, Winthrop. 28 and Counting for Kansas: The Jayhawks will make their   28th consecutive appearance in the tournament, passing North Carolina’s mark from  . Kansas also won the Big 12 conference this year for an N. C. A. A. Division I record 13th straight time, breaking U. C. L. A.’s conference streak from  . After Kansas was upset by Texas Christian,   in the Big 12 tournament, we’ll see if the Jayhawks are able to play up to their seeding, which they have not always been able to do in past tournaments.'"}, "time": 1742562015.1910238}