{"duration": 0.04027533531188965, "input_args": {"text": "'Disclosure of classified X documents and archaeological Aztec origin objects found in Ojuelos de Jalisco, Mexico The Aztecs came long after the Maya. The Mexican government had agreed to disclose to the public several archaeological objects that have remained hidden for decades, from the time they were discovered. \\nA helmet-shaped head of Alien, etched in stone tablets of gold and silver, which can be recognized in engraved details – how astronauts that traveling in space ships with other ships scenes actually looks like. Also you can observe comets and planets there.\\n\\n\\nThe Mexica or Aztecs were a people of the Nahuatl culture that existed in the area of Mesoamerica from the twelfth to the sixteenth century. These people are called themselves Mexica (pronounced meshicas) or tenochcas (inhabitants of Tenochtitlan). The Aztec word meaning ‘from Aztlán’ and was their tribal name. In just 70 years, the owners would greatest empire that had existed in Mesoamerica. A lost culture and never seen until now. They are objects filled with details of the lives of these characters in our remote distant and forgotten history, which until now had remained hidden. Several families of Ojuelos city in the province of Jalisco, Mexico, have been collecting for about 50-60 years a total of 400 artifacts extraordinary, with the dream of one day open his own museum, and publicize to the the public such an amazing objects. Here Are Some of the Approximately 400 Objects Found: \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nPrints, sculptures, rings, pendants. It seems that this former American culture had contact with eyes elongated creatures who lived with them over time and represented their craft in the skies. The same figures Alien contacted many say seeing them today. Or at least it seems. Conclusions Scientific analysis by Ma Luisa Trujillo of the two objects found: Based solely on the interpretation of all we have, chemical analysis, we can infer that the person who drew up the pieces did not know the process covers and glazes as is now known, whereby the characteristics do not match 100% with some type of nail Today, we might think that used in the composition principles of stoneware but at a lower temperature which completely changes the finish. Covers or stoneware glazes give good results with oxidizing or reducing atmospheres, generally used to initiate a reducing atmosphere and at the end a neutral or oxidizing atmosphere on assessed pieces oxidizing atmosphere was used. Via: Earth Mystery News '"}, "time": 1742563695.8438022}