{"duration": 0.16046977043151855, "input_args": {"text": "'A UC Berkeley professor has come under fire after a Wikipedia edit project for one of his courses branded President Donald Trump “racist” and “sexist. ”[Berkeley Professor Michel Gelobter has faced a backlash in the Wikipedia community after his students labeled Trump “racist” and “sexist” in edits that were eventually removed. Gelobeter has since been blocked indefinitely from Wikipedia.  A course description for Gelobter’s course on environmental justice activism at UC Berkeley posted on Wikipedia argued that the first few months of the Trump administration have been uniquely “  sexist, and racist. ” This semester represents a unique moment in history  …    the first few months of a historically unique U. S. President whose agenda has been explicitly   sexist, and racist. This course will use this moment in two ways: • First, as a learning opportunity for students to engage with critical issues as they emerge on the social, economic, policy, and political landscape • Second, to be of service by documenting key developments and creating a neutral source of information about them. The post was ultimately removed, as Wikipedia prevents unsourced negative claims about living people. A Wikipedia editor said that the line about the Trump administration was a “blatant BLP [Biography of Living Person] violation,” which means that commentary on a living person does not come from a “neutral point of view. ” As part of Gelobter’s course, students created Wikipedia articles that advanced an   agenda, containing   critiques of Trump’s EPA policy among others. Wikipedia edit projects are now common in the social justice sectors of academia. Feminists at Oberlin, Bucknell, and Temple University hosted Wikipedia    events during the   academic year. Commenting on this trend, Wikipedia user “Jytdog” argued that academia does not have the right to take over articles for the purpose of education. “Wikipedia is the commons and governed by community policies and guidelines. Just like companies don’t have the right to dump things into public waters, classes don’t have the right to take over space in the commons for classwork. Can you see that?” he wrote. Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742628566.1839895}