{"duration": 0.0950932502746582, "input_args": {"text": "'Police Attack and Arrest Peaceful Protesters at the Dakota Access Pipeline Posted on Oct 27, 2016 \\nNear Standing Rock, North Dakota on Oct. 22, armed police corralled and arrested more than 140 people seeking to protect themselves, their cultural heritage and the health of the planet on the site where contractors bulldozed the peoples’ ancestral burial ground to make way for the construction of an oil pipeline. \\nJihan Hafiz, a journalist for The Intercept who was among the arrested, filmed the clip above, which is among the most compelling eye-level footage of the months-long protest of the Dakota Access Oil Pipeline, which is led by members of the Standing Rock Sioux tribe and reservation. \\nAfter a morning of prayer, the protesters “were attacked by police forces who used pepper spray and beat protesters with batons,” Hafiz wrote . “Dozens of officers, backed by military trucks, police vans, machine guns, and nonlethal weapons, violently approached the group without warning.” \\nAs the protesters attempted to leave, the police began beating and detaining them. Several Native American women leading the march were targeted, dragged out of the crowd, and arrested. One man was body-slammed to the ground, while another woman broke her ankle running from the police. The military and police trucks followed the protesters as nearly a hundred officers corralled the protesters into a circle. Among the arrested were journalists, a 17-year-old pregnant girl, and a 78-year-old woman. \\nIn total, more than 140 people were detained in half an hour. It was the largest roundup of protesters since the movement against the pipelines intensified two months ago. A majority of those arrested were charged with rioting and criminal trespass. Overall, close to 300 people have been arrested since protests against the pipeline kicked off over the summer. \\nAdvertisement Square, Site wide \\nWhen we arrived in Mandan, the jail was so overwhelmed with people that we had to sit on the floor in the jail’s common area. Two Native American men were thrown into solitary confinement. A number of women faced humiliating strip searches, which included spreading their body parts and jumping up and down while coughing. We were refused phone calls and received no food or water for eight hours after being arrested. Two women fainted from low blood sugar and another had her medication taken away, causing her to shake and sweat profusely. \\nWhen I was released from jail, my camera was missing. When I asked about its whereabouts, a police officer said, “Your camera is being held as evidence in a crime.” \\nThe video footage presented here was shot from the beginning of the march, during the prayer, and ends the moment I was arrested. Many families, nearly all of them Native American, can be seen running for the hills. Many people told me they felt as though they were re-enacting the massacres of the Lakota nation during the westward expansion of the United States, when families were shot in the back as they fled.'"}, "time": 1742561860.9617991}