{"duration": 0.040758609771728516, "input_args": {"text": "'Peculiar supernatural activity which is suspected to involve alien creatures has been occurring in the vicinity of Russian submarines ever since the days of the Soviet Union. However, it appears as though the Russian authorities are very keen to keep whatever is going on under wraps and all files on the subject have been sealed. Now, two researchers named Paul Stonehill, and Phillip Mantle is determined to get to the bottom of these mysterious occurrences.\\n\\n\\nRussian military commanders speak out about underwater alien lifeforms \\n\\nIn the course of their research, these two men have examined the veil of secrecy surrounding some extraordinary claims relating to underwater extra-terrestrial activity by eliciting a huge amount of eye-witness testimony. They say that these bizarre incidents have involved UFOs duping aircraft into the sea, encounters with underwater creatures which are believed to be of extra-terrestrial origin and highly unusual objects found under the later.\\n\\nPerhaps the most stunning of the claims comes from Major General V. Demyanenko, a Russian commander of the Military Diver Service. The Major claimed that he and his crew encountered a race of humanoid aliens who were nicknamed ‘the Swimmers’. These creatures are said to be approximately three meters in height, who garb themselves in silvery suits and spherical helmets and live in the icy waters surrounding the Russian territory of Siberia. When Soviet Navy divers attempted to capture one of these creatures for investigation, they were apparently flung to the surface of the water by a powerful source . \\n\\n\\nStonehill and Mantle have also documented several other bizarre encounters. In 1965, the crew of the steamship Raduga witnessed an enormous fireball shooting up from the depths of the Red Sea. The crew also noted an unidentified flying object in the vicinity of the fireball and the gigantic pillar of water it thrust into the air upon ejection. They have also collected data from the Russian chief of the Pacific fleet’s intelligence department, Admiral V.A. Domislovsky who claimed to have an object of approximately 900m in length in the ocean. They have also examined claims made by other former Russian military commanders about underwater alien activity surrounding the infamous Bermuda Triangle.\\n\\nMr. Mantle said that this is not the first time that multiple witnesses have attempted to speak out about the highly unusual activity that they have witnessed underneath Earth’s ocean. However, any attempts to speak out previously have tended to result in their silencing and public ridicule.\\n\\nDisclose TV \\nSOURCE '"}, "time": 1742562681.65609}