{"duration": 0.03699851036071777, "input_args": {"text": "'0 comments \\nThere are things that we tend not to agree with when it comes to Putin. However, I think when you see the point he is trying to make here, this is common ground we can all meet on and agree with one another on. \\nHis reason for being upset with the government is clear. They allowed a sexual predator free for reasons that are so asinine that one could think the defendant himself made the ruling. \\nIt’s sickening.. \\nThe Russian president rarely comments on the internal affairs of European countries, and even less on specific court cases. However, Mr. Putin refused to stay silent this week as he slammed the Austrian justice system over a case in which the infamous “sexual emergency” migrant rapist was alleged to have been acquitted by an Austrian court who will seek a retrial on the case, reports OE24. \\nAccording to Mr. Putin, the court’s decision was the result of a “dissolution of traditional national values”. He added: “In a European country a child is raped by a migrant. The court acquitted him for two reasons: he speaks the language poorly and he did not understand that the boy, yes it was a boy, didn’t want this.” \\nPutin called the resulting court ruling inconceivable and said that a nation that refuses to defend its children has no future. “This is the result of the dissolution of traditional national values and a sense of guilt towards migrants,” he said. \\nBreitbart London reported on the attack, which occurred late last year, in which the Iraqi asylum seeker brutally raped a ten-year-old boy in a swimming pool in the Austrian capital of Vienna. \\nThe boy was so brutally assaulted that he had to be hospitalised for his injuries and the migrant, when asked why he committed the crime, claimed it had been a “sexual emergency”. The phrase became notorious on social media as many used it to highlight the clear social problems many of the new migrants presented to European societies. \\nAccording to Austria’s chief justice, the migrant had not, in fact, been acquitted of the charges, but rather the trial was expected to be re-run on the basis that the boy now suffers post-traumatic stress disorder. This new charge could allow prosecutors to put the Iraqi behind bars for up to 15 years. \\nPutin says when a country refuses to protect its’ children, it becomes a country with no future. What do you think about that, would you agree? Related Items'"}, "time": 1742562383.30333}