{"duration": 0.06342959403991699, "input_args": {"text": "'Republican presidential nominee Donald Trump likes to hold himself up as a paragon of charitable donations. But do his claims stand up to reality? Trump Charitable Donations? Almost Nothing \\nThe Washington Post published a piece this afternoon stating that they’ve been researching Trump’s claims for months and have come up nearly empty-handed. \\nAccording to the Post : “After calling 420-plus charities with some connection to Trump, The Post found only one personal gift from Trump between 2008 and the spring of this year. That was a gift to the Police Athletic League of New York City , in 2009. It was worth less than $10,000.” \\nThe article goes on to mention Trump’s self-inflating talk and random appearances at charitable events with which he has no monetary connection. Many of those involved with the charities have felt swindled in one way or another by the Republican nominee over the years. \\nIt tells the story of a woman, employed by Trump, who asked him to help sponsor a gala for the Professional Women in Construction, where she was being honored. He didn’t, spent $100 on a single ticket, and then took over the microphone at the event for 15 minutes to make himself look like a big donor. \\nThere’s the story of the time when he was “principal for a day” at a poor school in the Bronx. He gave them a phony $1 million bill. He did manage to fork over $200 before taking off in his limo. \\nOr the time when he decided to take the stage at an event to benefit children suffering from AIDS. He took the chair designated for someone who actually made a charitable donation (unlike Trump), and then posed for pictures as though he was a donor. The executive director of the charity, Gretchen Buchenholz, sent an email to the person whose chair Trump had commandeered, Steven Fisher, apologizing for Trump’s transgression: “I immediately said ‘no,’ but Rudy Giuliani said ‘yes’ and I felt I had to accede to him. I hope you can forgive me.” \\nSteven Fisher’s chair happened to be right next to Giuliani’s, too. Go figure. Some Things Never Change \\nThe instances above are only a tiny handful of the stories laid out in the Post article. All the evidence together points to a man who talks a big game about all his various charitable donations, but who, in reality, is as miserly as Ebenezer Scrooge. \\nTrump, however, continues to try to portray the image of generosity. \\nAn archived page for Trump’s corporate website ends his biography with these words: “He is the archetypal businessman — a deal maker without peer and an ardent philanthropist.” \\nOn October 20, 2016, Trump appeared as a featured speaker at the Al Smith charity dinner alongside his rival, Democratic presidential nominee Hillary Clinton. Despite all that we know now, despite all the questions that have been raised since he began his campaign about his charitable donations (or lack thereof), his biography in the program at the dinner contained those exact same words. \\nTrump lives in a bubble. And that bubble needs to burst. \\nFeatured Image by Gage Skidmore via Flickr under a CC BY-SA 2.0 license About Carrie MacDonald \\nCarrie is a progressive mom and wife living in the upper Midwest. Connect'"}, "time": 1742561745.1864178}