{"duration": 0.045424461364746094, "input_args": {"text": "'NBCNews. com on Thursday posted a two minute and 34 second preview clip of anchor Lester Holt’s exclusive   with President Donald Trump. The clip features Holt conducting an   interview in which the NBC personality interrupted Trump nine times and spoke over the president on many of those occasions. [The short clip is part of a   White House interview set to air Thursday night on NBC Nightly News.   In the clip, Holt can be seen questioning almost every statement made by Trump. In one instance, Holt asked Trump about his May 9 letter ousting F. B. I Director James Comey in which Trump wrote, “I greatly appreciate you informing me, on three separate occasions, that I am not under investigation. ” Holt asked Trump, “Why did you put that in there?” Trump replied, “Because he told me that. I mean, he told me  …    ” Before Trump could finish his sentence, Holt interrupted, asking, “He told you you weren’t under investigation regarding the Russian investigation?” “Yeah, and I’ve heard that from others. I think  …    ” Trump began to respond before Holt interrupted again. “Was it in a phone call? Did you meet   ?” Holt interjected, speaking over Trump. “I had a dinner with him. He wanted to have dinner because he wanted to stay on. We had a very nice dinner at the White House  …    ” Holt spoke over Trump again, interrupting this time by asking, “He, he asked for the dinner?” “A dinner was arranged. I think he asked for a dinner. ” Holt interrupted Trump again when Trump was explaining he knew that he wasn’t under investigation both from Comey three times and from a “committee level. ” “So that didn’t come directly from him?” Holt cut in and asked before Trump could finish his explanation about the times he says he heard from Comey that he wasn’t under investigation. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.  '"}, "time": 1742564607.4370272}