{"duration": 0.12390375137329102, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Europe: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at europebriefing@nytimes. com. Here’s what you need to know: • Kurdish forces reported success in their opening salvos of a vast operation to retake the Iraqi city of Mosul from the Islamic State. Analysts say the battle could be a turning point in the war against the militant group. We have two reporters and a photographer near the front lines as Kurdish pesh merga troops advance on villages east of the city. Warplanes from the U. S.  coalition are providing air support for the crucial operation, which could take months and involve nearly 30, 000 troops. • European Union trade ministers meet today in Luxembourg to vote on a free trade deal with Canada. Anything short of unanimous approval could derail plans to sign the agreement, known as CETA, at a summit meeting in Brussels this month. • Donald J. Trump said that if he won the U. S. presidential election, he might meet with President Vladimir V. Putin of Russia before being sworn in. Russia’s ambassador to the United Nations, meanwhile, said the country’s relations with the U. S. were the worst since 1973. Hillary Clinton is beginning an ambitious assault on traditionally Republican states to further diminish support for Mr. Trump. And new documents show sharp disputes between the State Department and the F. B. I. over Mrs. Clinton’s emails, including a discussion of a possible “quid pro quo” to settle one disagreement. • A   separatist commander was killed by a bomb as he rode the elevator in his apartment building in Donetsk, in eastern Ukraine. Russia and Ukraine traded accusations of responsibility. The two countries’ presidents are expected to meet in Berlin tomorrow, along with Chancellor Angela Merkel of Germany and President François Hollande of France, for talks aimed at reviving the peace process. • In Britain, a candidate to lead the U. K. Independence Party, Steven Woolfe, quit, saying there was “something rotten” in it. He called on Nigel Farage, who resigned as the party’s leader after successfully campaigning for Britain’s departure from the E. U. to return. And widespread uncertainty about “Brexit” is shaking not only Britain’s business community, but also scientists who rely on   funding and international collaboration. • France has been enthralled by the publication of letters that the late President François Mitterrand sent to Anne Pingeot, the   “other woman” during his years in the Élysée Palace. Ms. Pingeot typed up the handwritten letters herself. “I don’t know if I did the right thing,” she said. • An explosion at the chemicals maker BASF’s largest production site in Germany killed at least two people and injured at least six others. • Russia’s main   satellite network, RT, said a bank in Britain, NatWest, had abruptly closed its accounts. The network, which critics call a Kremlin mouthpiece, denounced it as a   attempt to interfere with freedom of speech. • One of China’s richest men, Wang Jianlin, announced sizable financial incentives to draw Hollywood filmmakers to China. His conglomerate’s $8 billion investment in the U. S. film industry has raised concerns in Washington. • Need a tractor in India? There’s an app for that. Rural residents are turning to their smartphones to rent heavy equipment for farming. • The euro and the pound gained against the U. S. dollar overnight. Here’s a snapshot of global markets. • Der Spiegel: “The Kitsch King’s Palaces Get a Facelift. ” The   palaces built by King Ludwig II of Bavaria are in decay and now require extensive restoration. • Politico: “Why Central Europe’s Youth Roll Right. ” New   nationalism is taking root among new voters. • BBC: “Exorcism in Italy a Job ‘Too Scary. ’” The Catholic Church is struggling to recruit young priests willing to confront demons. • Monocle: “World Atlas of Tea. ” In this podcast, a tea expert discusses changes in the industry. • ExoMars 2016, a spacecraft launched by the European and Russian space agencies, is to arrive at the red planet on Wednesday and begin gathering data on gases that may provide clues about geological processes, or even hints of life. • The American first lady, Michelle Obama, has drawn praise for quietly and confidently changing the course of U. S. history. Four influential thinkers  offer   notes. The Obamas will host Prime Minister Matteo Renzi of Italy tonight at the White House, in what could be the administration’s last state dinner. • Romania is investigating allegations that the Orthodox archbishop of Constanta, a city on the Black Sea coast, fraudulently claimed 300 million euros, or $330 million, in E. U. agricultural funds. •  Bob Dylan, the newest Nobel laureate for literature, has said nothing about the award, even to the Swedish Academy (which says it is in touch with one of his associates). A black American doctor was in the news last week after writing on Facebook that a flight attendant seeking help for a sick passenger refused to believe she was a physician. Her experience touched a nerve with other professional women of color who have faced skepticism about their credentials. The episode also calls to mind the poet Phillis Wheatley’s ordeals nearly 250 years ago. Kidnapped as a child in West Africa and sold into slavery, she was bought by the Wheatley family in Boston, who used for her first name that of the ship that brought her across the Atlantic. They taught her to read, and she channeled her intellect into writing poetry. Her work earned praise in both the colonies and Europe. Some of Boston’s most learned men, though, doubted that a slave could write so beautifully. In October 1772, Wheatley successfully defended herself to an   panel. She “is thought qualified to write them,” the men said of the poems. The following year she toured England, where her book was released, “marking the beginning of an   literary tradition,” according to Henry Louis Gates Jr. a historian. A letter to an acquaintance on this day in 1773 indicates that her renown also won her freedom. “Since my return to America my Master, has at the desire of my friends in England given me my freedom,” she wrote. But in one of her poems, she addressed the pain of slavery more directly: “And can I then but   may never feel tyrannic sway?” Sean Alfano contributed reporting. Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at europebriefing@nytimes. com.'"}, "time": 1742562056.0532317}