{"duration": 0.03491377830505371, "input_args": {"text": "'  DCG | 5 Comments \\nConsidering that Timberlake supports Hillary, he may not be the brightest bulb. We should at least be grateful that he’s not offering blowjobs to anyone voting for Hillary. \\nFrom Daily Mail : Tennessee officials are investigating Justin Timberlake after the singer took a selfie in a voting booth. \\nIn a photo posted to his Instagram account on Monday, the 35-year-old celebrity stands in front of a ballot machine and makes a scrunched up face. The caption reads: ‘Hey! You! Yeah, YOU! I just flew from LA to Memphis to #rockthevote !!! No excuses, my good people! There could be early voting in your town too. If not, November 8th! Choose to have a voice! If you don’t, then we can’t HEAR YOU! Get out and VOTE! #excerciseyourrighttovote.’ \\nTaking a photo or recording audio in a voting booth is a crime in Tennessee, with a penalty of up to 30 days in prison and a $50 fine. \\nAfter the picture was posted on Monday, a representative from the Shelby County, Tennessee District Attorney’s office told TMZ that Timberlake’s actions are ‘under review’. The Tennessee law banning ballot selfies was passed last year and so far no one has been prosecuted for violating it. \\nAn official for the election board where Justin voted told TMZ that the hitmaker should be lauded for calling on his more than 31million followers to vote. \\nTimberlake and his wife Jessica Biel hosted a $33,400-a-ticket fundraiser for Hillary Clinton last spring. \\nLaws nationwide are mixed on whether voters are allowed to take pictures of themselves in the act or of their ballots –‘ballot selfies’. Federal judges have struck down bans on selfies in New Hampshire and Indiana, and rules have been changed in places like California and Rhode Island, but in many states it’s still a violation that carries potential fines or jail terms. \\nThere are laws against sharing any photo of your ballot in 18 states, while six other states bar photography in polling places but do allow photos of mail-in ballots. \\nCritics say such regulations have not kept up with technology and are confusing for voters and election workers. Some states that ban ballot selfies or have moved to block them cite concerns the photos could harm the integrity of the voting process by encouraging vote-buying or coercion, though some acknowledge there’s no evidence to support those fears. \\nDCG'"}, "time": 1742562135.890896}