{"duration": 0.0358579158782959, "input_args": {"text": "'By Michael J.R. Schindler on November 5, 2016 Proven, No-Cost IT Training for Veterans \\nTransitioning from active duty military back into the civilian sector often presents a number of new challenges – one being how to reposition ones’ skills, abilities, and leadership training into a well-paying civilian job. \\nWhile the majority of veterans eventually land on their feet, close to 50 percent live through or experience unemployment after separation. One program, SAP National Security Services (SAP NS2), under the leadership of retired U.S. Navy Vice Admiral Joseph Kernan and SAP NS2 CEO Mark Testoni , is set on closing that gap and doing so with great success. \\nNS2 Serves helps veterans by providing valuable IT training and employment assistance, at no cost to the veterans and has pledged to train & place 400 veterans in new careers by 2021. \\nTo date more than 100 veterans have completed the training and been placed in high-tech careers. \\nThose who qualify and are selected to take part in the 3 month in-house program will find that their travel, room and board are covered, leaving the GI Bill dollars for college courses. In addition, a monthly stipend is provided during the training program as well as mid-term bonuses for completion of requirements. \\nThe training courses in SAP solutions are geared for U.S. national security missions, leading to “Certified SAP Associate” status, a credential that is valuable in many career paths in the U.S. and worldwide. \\nThe Certified Consultants who emerge from the NS2 Serves Training Program will be qualified for several kinds of career opportunities: Data Warehouse Administrator •Data Modeler •Data Architect •Data Warehouse Architect Data Extraction Consultant •Business Intelligence Platform Administrator \\nIn order to be considered for the program, one needs to meet the following qualifications: Honorably discharged U.S. military veterans, including disabled veterans Veterans must be within (3) three years of their date of separation A minimum of a high school diploma or GED, and relevant technology experience Gold Star Spouses who meet the same education and experience requirements listed above \\nUpon graduation, placement assistance is provided to work in the U.S. national security field. And as mentioned earlier, every participant to date has been placed in careers with starting salaries around $60k. \\nBottom line: Today’s veterans and their families have had some of the best training in the world while on active duty. The NS2 Serves Training Program is one program that recognizes that with just a bit of additional training, America’s Greatest Asset can be repurposed to still help with our national security. Related Posts:'"}, "time": 1742562995.3151202}