{"duration": 0.029433012008666992, "input_args": {"text": "'(AFP)  —   Syrian President Bashar  ’s comments that last week’s chemical weapons attack was a fabrication to justify a US military strike are “100 percent lies” French Foreign Minister   Ayrault said Friday. [“It’s 100 percent lies and propaganda,” Ayrault said during a visit to Beijing, responding to an exclusive AFP interview with Assad on Wednesday.  “It’s 100 percent cruelty and cynicism. ” The French minister mirrored language used by Assad himself, who dismissed the allegation that his regime perpetrated the attack that left 87 civilians dead, including many children. “Definitely, 100 percent for us, it’s fabrication,” Assad said in the interview. The Syrian leader questioned whether the attack had in fact occurred, claiming that “fake videos” and “propaganda” were being used against his government. He also accused the United States of colluding with terrorists and “fabricating the whole story in order to have a pretext” for a cruise missile strike on a Syrian air base last week. The French minister made the remarks during a joint press conference with Chinese Foreign Minister Wang Yi. “The reality is that more than 300, 000 have died, 11 million people have been displaced or become refugees, tens of thousands have been placed in Syrian prisons and a country has been destroyed,” Ayrault said. “That is the reality. It is not a fantasy. ” He emphasised the need for an end to the conflict with a “real ceasefire, one which restricts the Syrian air force and military and is upheld by the international community. ” Ayrault praised China’s role in the matter, noting its abstention from a United Nations Security Council vote on a resolution to condemn the Syrian gas attack. In the past, China has voted alongside Russia to veto UN resolutions on the Syrian conflict. Wang expressed his agreement with the French minister, noting that an “independent, fair and professional investigation” into the chemical weapons attack should be conducted “as soon as possible. ”'"}, "time": 1742562272.8925989}