{"duration": 0.0503087043762207, "input_args": {"text": "'An ethics complaint has been filed against Representative Jason Chaffetz for releasing information provided to him in a letter from FBI Director James Comey. \\nThe Democratic Coalition Against Trump announced the complaint in a statement: \\nThe Democratic Coalition Against Trump filed a complaint against Representative Jason Chaffetz on Monday morning with the Office of Congressional Ethics for his role in releasing information provided to him by FBI Director James Comey. \\n“Representative Chaffetz, in an ill-planned partisan attempt, released information that compromised the integrity of the FBI, when he irresponsibly tweeted out that the case investigating Secretary Clinton’s emails had been reopened, when in fact it had not been. Members of Congress are elected to make our country a safer, better place- not to use their power to work with leaders such as Comey in a partisan fashion. I hope that both are held accountable for their actions,” said Scott Dworkin, Senior Advisor to the Democratic Coalition Against Trump. \\nDirector Comey is already facing a complaint that was filed with Department of Justic e accusing him of violating the Hatch Act by using his position as a federal employee to influence the outcome of an election. \\nThe Comey letter couldn’t have gone much worse for Republicans. What the GOP originally hoped was an election shifting moment had become a Republican scandal that Democrats are strongly suggesting will inspiring hearings if they win back the Senate majority . \\nThanks to Chaffetz, House Republicans have already their credibility for future Clinton investigations, a s the Utah Republican’s spin of Comey’s letter was debunked in a matter of hours. \\nIt’s all gone wrong in short order for Republicans. Comey and Chaffetz are facing complaints, and Hillary Clinton remains on course to be elected the next President Of The United States.'"}, "time": 1742564615.4897997}