{"duration": 0.21405601501464844, "input_args": {"text": "'Just before Thanksgiving 2012, Ariel Levy, a staff writer at The New Yorker, flew to Mongolia to report on that country’s mining boom. She was 38 years old and five months pregnant, and on her second night there, she miscarried in her hotel room, delivering her son in a torrent of blood that nearly killed her. Her son would not survive, but Ms. Levy detailed in a heartbreaking essay a year later that would win her a National Magazine Award that after she yanked the placenta from her body, crawled to the phone and called a local doctor, she took the boy’s photo. “I worried that if I didn’t,” she wrote, “I would never believe he had existed. ” The essay, titled “Thanksgiving in Mongolia,” was a brutal read. Ms. Levy wrote of the feeling of her son’s skin, “like a silky frog’s on my mouth,” and of the image of a white bath mat someone had thrown over a bloodstain next to her bed that would slowly darken as her blood seeped through it during the five days that she spent holed up in her hotel room. Back home, she wrote, she sobbed, bled and lactated in an awful storm of hormones and grief. Before the miscarriage, she had considered herself lucky: buoyed by the gains of   feminism, successful at her chosen career, legally married to a woman and carrying a baby made by a friend’s donated sperm. Afterward, as she wrote, she felt buffeted by a different kind of fate, something more Shakespearean or biblical, “the 10 or 20 minutes I was somebody’s mother were black magic there is no adventure I would have traded them for. ” And yet. Not only did she lose her child, but her marriage also fell apart. This felt like a karmic smackdown, and Ms. Levy wanted to interrogate her own responsibility for such a sequence of grim events. That is the intellectual backbone, anyway, of “The Rules Do Not Apply”: her memoir, out March 14, that lays the groundwork for what happened in Mongolia and picks up where the essay left off, raising, once again, that hoary conceit, the one about women and “having it all. ” “I felt like this very fortunate beneficiary of the women’s movement,” she said during a recent interview in her bright,   walk up in Chelsea. “I got to have all these choices, and the rules”  —   biological, historical  —   “did not apply. So it was a very shocking experience to find myself, childless and alone at 38. I felt like a complete failure, on the deepest level. “Some of it was like someone in a Jane Austen novel, getting her comeuppance, but some of it, most of it, was feeling like a mother, but where’s the baby? There is no child. Then you’ve got a little identity crisis on your hands. ” Ms. Levy bought the apartment during her marriage, when she and her former spouse, now a recovering alcoholic, separated for a time. She lives there alone, attended by two amiable, rotund cats. On a Friday afternoon, she was preparing for an appearance at the 92nd Street Y, where she would be interviewed by her friend Lena Dunham. “This thinking that you can have every single thing you want in life is not the thinking of a feminist,” Ms. Levy told the audience that night. “It’s the thinking of a toddler. ” “ !” Ms. Dunham said, “  for all! Hashtag toddler. ” A thoroughly modern memoir, the elements of “The Rules Do Not Apply” seem plucked not from the script of “Girls,” which has also been exploring reproductive issues of late, but “Transparent”  —   even “Portlandia. ” When Ms. Levy, at 30, marries her girlfriend, her   parents are put out not because she is a lesbian, but because they are against the square traditions of marriage. “Are you impressed with how cool I am about all this?” her father said when she brought home her first girlfriend. She has a gothic affair with a brutish and unhinged transgender man who hacks Ms. Levy’s computer. When Ms. Levy conceives a child with the sperm of a dear friend who is rich enough to pay the child’s college tuition but wants a   relationship to parenthood, you imagine a sort of Michael Cunningham utopia for Ms. Levy and her wife in their house on Shelter Island. Or perhaps a reality show. Simon Doonan and Jonathan Adler, colorful exemplars not just of   marriage but also of Manhattan’s creative class, are their neighbors. Of her generation, Ms. Levy writes: “Sometimes our parents were dazzled by the sense of possibility they’d bestowed on us. Other times, they were aghast to recognize their own entitlement, staring back at them magnified in the mirror of their offspring. ” Ms. Levy, who in person speaks in the vernacular of her era  —   “dude” and “girl” are her preferred terms of address  —   presents a memoir often festooned with   irony. It’s her second book. “Female Chauvinist Pigs,” out in 2005, wondered just how liberated the heroines of “raunch” culture actually were. She knows she is a different sort of cultural cliché, a bisexual Wesleyan graduate who never quite learned to mind her pronouns. She wears her   sensibility lightly. Before her wedding, Ms. Levy writes of trying to woo her wife’s Minnesotan mother, whose strongest expression of emotion was the phrase, “Oh, honestly. ” In conversation one day, Ms. Levy lets loose an “Oy vey,” startling her      . As she writes, Ms. Levy had to explain, “That’s what my people say when we mean, ‘Oh, honestly. ’” She grew up, in Larchmont, N. Y. as an outlier. She was the only child of   parents who didn’t fit in with the suburban ethos of her neighborhood: her father wrote copy for Planned Parenthood, Naral and NOW, among other organizations her mother worked with Down syndrome children and opened an   day care. And there was a family secret hiding in plain sight: Her mother was engaged in a   affair with a   classmate who would appear periodically, camping on blankets in the living room. By her account, Ms. Levy was a brash,   unpopular child who took to her diary for companionship, using a notebook to puzzle her way through a hostile social environment at school and the weirdness at home. “That was my lifeline,” she said. “People didn’t like me, I was loud and aggressive. People can take it from a    but when you’re a little kid, and people are like, ‘You’re loud and awful,’ you think, ‘I guess I am awful,’ so writing and figuring out how to put things into words was the way I felt better. ” Not long after college, she got a job at New York magazine, where she was mentored by the editor John Homans. David Remnick, editor in chief of The New Yorker, hired her away after a lunchtime courtship during which Ms. Levy suffered a bad case of flop sweat. When she tells her father about her new job, he says, “Well, nowhere to go but down. ” Ms. Levy has spent much of her career profiling women who are, in her words, “too much,” like Caster Semenya, the African runner with elevated levels of testosterone who upended the way the Olympics thought about gender Lamar Van Dyke, a founder of a band of lesbian separatists from the 1970s and Edith Windsor, the octogenarian lesbian whose suit against the United States paved the way for the legalization of   marriage. Last week, Ms. Levy profiled the photographer Catherine Opie, once an SM aficionado and darling of the Whitney Biennial, circa 1995, unpacking her homey radicalism. While a gay or bisexual woman like Ms. Levy would seem to be the ideal image for what is now called “intersectional” or multilayered feminism, Charlotte Shane, a writer for The New Republic, recently accused her of   feminist sins  —   or the “dangerous failures of neoliberal feminism”  —   in a piece headlined “Ariel Levy’s Infuriating Memoir of Privilege and Entitlement. ” “It’s unlikely many black women or Arab women or undocumented women would presume a similar degree of permission and mobility,” Ms. Shane wrote, “regardless of their exposure to Gloria Steinem and Betty Friedan. ” This line of argument amused more than rankled Ms. Levy. “If one of my students at Wesleyan tried to take down a writer,” she said, “I’d say, ‘white and from Larchmont’ is a good start but you need more of a case. ” She added: “I think it would be difficult to argue that I’m a   for womenkind. I’ve tried pretty hard to bring in unusual female voices and perspectives. Not just young women and not just white women, either. I don’t know that I’m the best target for improvement. I don’t know that I’m the problem. ” Her friend Mr. Doonan would label Ms. Levy a   feminist, like his own mother, who served in the Royal Air Force during World War II. “She’s like those fearless viragos,” Mr. Doonan said of Ms. Levy. “She’s uniquely intrepid. Tremendously grateful for opportunities and never complaining. That isn’t in a way a contemporary thing. People tend to see things through the lens of victimhood, but Ari takes full responsibility and carries on. ” Ms. Levy is deferential to her   whose alcoholism arguably tanked the relationship, though Ms. Levy said, “We made a fine mess together. ” She gave her a pseudonym, Lucy, and she also gave her the manuscript to read before she showed it to anyone else. Lucy suggested no changes. “She said, ‘It’s your story, I’m not going to censor you,’” Ms. Levy said. (The identity of the baby’s father is even more veiled, in keeping with his wishes, she said.) “I don’t come from addicts,” she said. “My parents never drank. What I did know about was something being amiss in the house, there being a secret, and knowing  —   knowing  —   something’s off. ” When she attends an   meeting, reluctantly (because its jargon irritates her) she learns a “profound concept,” she said. “The idea that you’re off the job, that it doesn’t matter if you figure it out, you can try and persuade the person at the center of it that there’s a problem but you’re never going to get anywhere, so just punch your punch card out. You’re done. ” She added: “It’s not that I have no regrets, but I no longer think, for example, I shouldn’t have gone to Mongolia. It wouldn’t have mattered. People say, ‘Oh, it would have been better to have miscarried in New York.’ I’m not sure about that. There’s no way your baby is going to die in your hands and you’re going to be, like, ‘Well, that worked out well! ’” When “Thanksgiving in Mongolia” landed on his desk, Mr. Remnick said he read it right away, against his habit. “I couldn’t get out of my chair,” he said. “It’s not as if I hadn’t known what had happened we had been talking even when she was still there. The world is full of personal essays. My illness. My divorce. My delight. They are everywhere. Arguably there are too many. Among the average ones, there’s a kind of grasping aspect to them. When they connect, as Ari’s did, there’s really nothing like it. ” She is a joyful person, and a joyful writer, he added. “No question she has an absolutely magnetic personality,” he said. “One imagines Joan Didion hanging around the Doors and   was a recessive presence. Ari ain’t recessive. ” As it happens, Ms. Levy’s adventures fit into an older tradition than the   “the autopathographies,” as James Atlas wrote, introducing the wave of literary memoirs from the early 1990s  —   Mary Karr, Susanna Kaysen, et al  —   that have dominated the form for decades. When her marriage finally ends, Ms. Levy strikes up a correspondence with the handsome South African doctor John Gasson, who had treated her in Mongolia. The memoir ends ambiguously, with Ms. Levy pondering a flight to South Africa. But in real life, she and Dr. J. as she calls him, conducted an epistolary romance through email that continued to blossom. There would be setbacks, as Ms. Levy tried  —   “400, 000 times,” she said  —   to get pregnant through IVF treatments, until “my heart was broken and I had no money and I was like: ‘Girl, it’s done. Let it go. ’” “Not everybody gets everything, but you get some stuff,” she continued. “You get other stuff. ” She and Dr. Gasson, a rotational doctor whose work schedule at a clinic in Nigeria is five weeks on, five weeks off and who also writes, are engaged. If either one of them can get it together to file the paperwork, she said, they will marry. As to where they will live, she added, “We’re going to be mobile. The fact that I cannot bear a child works rather well with that. Given that I have no choice in the matter, that’s the upside. ” And so, despite all the postmillennial complications of Ms. Levy’s    tale and her sexual fluidity, in the end she gets the guy. Who says modernity killed the marriage plot? Or as Ms. Dunham put it, Ms. Levy “fully is like hitting it with the hot doctor in the book. ”'"}, "time": 1742562005.7647696}