{"duration": 0.02278733253479004, "input_args": {"text": "'HOT: \"Norpoth\\'s Model\" Predicts Trump Presidency Trump Is Going To Be The Next President, According To This ModelBY: Eugene Daniels12:34 PM, Oct 26, 2016 LINK: [ link to www.theindychannel.com ] ARTICLE TEXT:Forget the polls. Donald Trump is going to be the next president &#65533;&#65533;&#65533;&#65533;&#65533;&#65533;&#65533;&#655\\u200b33;&#65533; at least according to one pretty accurate election model.This assertion isn\\'t a surprise. In February, the model\\'s creator, Helmut Norpoth, gave Trump a 97 percent chance of becoming No. 45 if he got the GOP nomination, though the model now gives Trump an 87 percent chance.Norpoth\\'s model predicts general election results based on how the candidate does in his or her party\\'s primary. Norpoth applied the model to past elections and says it worked for every presidential election except one since 1912.\"My feeling always has been, what I saw in the primaries, was that Donald Trump did very well,\" Norpoth said. \"He beat a large field. According to my metric about how primaries are shaping up, he did better than Hillary Clinton in the Democratic race, so that gave him a leg up.\"There are a couple of issues with this. Usually, candidates shift their message after the primary to appeal to voters outside their base. Trump isn\\'t doing that. His speeches haven\\'t changed much, if at all, and he\\'s not really bringing anyone new into his tent.Also, the model doesn\\'t factor in anything that\\'s actually happening in the country at the time. And factors like the economy, the incumbent president\\'s approval numbers and the country\\'s demographics all affect how people cast their vote in November.Outside of Norpoth\\'s model, basically every other measurement out there shows Donald Trump\\'s chance of winning 270 electoral votes is super slim. But, hey, this is 2016, and if we\\'ve learned anything, it\\'s that there is nothing normal about this election cycle. Page 1'"}, "time": 1742562059.6171405}