{"duration": 0.12597155570983887, "input_args": {"text": "'Sixty percent of adults feel “hopeful and optimistic” about the future of the country, a Wall Street   News poll released Sunday shows, while President Trump’s net approval rating is negative —  for now. [When asked, “When you think about the future of the country, would you say that you are mainly hopeful and optimistic or mainly worried and pessimistic,” sixty percent of 1, 000 adults surveyed from Feb. 18 t0 Feb. 22 said they were hopeful, not pessimistic. That’s a steady upward drift from 53 percent in August, and 56 percent in December. Pollsters note the margin of error is plus or minus 3. 1 percentage points.  Meanwhile, Trump himself fares slightly less well: 44 percent approve of the job he’s doing as president, while 48 percent disapprove.  The surge in optimism is driven in part by Trump voters’ enthusiasm, according to what pollster Bill McInturff told the Washington Examiner: “This is a strong number being driven by very high numbers among Trump voters who express optimism across a number of measures on the poll, including higher economic confidence. ” But other groups are feeling hopeful, too. Over half, or 52 percent, of Hispanics are hopeful about the future of America, not worried. So are 65 percent of whites. (Among blacks, only 36 percent feel optimistic.) Nearly all Republicans, or 87 percent, are hopeful about the future, as well as 56 percent of independents. And so are 37 percent of Democrats. So, Trump has broad appeal with whites and Hispanics, along with a significant minority of Democrats —  and a majority of independent voters. That’s solid enough of a coalition to sustain power and encourage a younger generation of Republican leaders, such as Arkansas Sen. Tom Cotton, to champion a populist, nationalist agenda. Trump’s approval ratings may be low at the moment, but his administration is still brand new and voters outside centers of concentrated, Democratic power are still cautiously warming to him. The losers of the globalization game were stigmatized as bigoted or hateful for protesting policies enabling cheap labor, low wages, mass immigration,   communities, family disintegration, drug addiction, suicide. The years leading up to the election were marked by an incredible expansion of the labor pool and a $  wealth transfer to Wall Street. Every job created from 2000 to 2014 went to the large,   population residing in the U. S. which stands at roughly 42. 4 million people. Coincidentally, morality rates “from drug poisoning, alcohol poisoning, and suicide increased by 52 percent between 2000 and 2014,” according to one university study. “Nearly half of all young white male deaths are caused by drugs, alcohol, or suicide,” wrote the author, compared to roughly a quarter of young Hispanic male deaths and 13 percent of young black deaths. The Economist found that 41 percent of white, working class men have given up looking for work. Over 47, 000 people died from   deaths in 2014 alone, and heroin overdose deaths have more than tripled between 2010 and 2015. The wave of death washing over American communities elicited little notice, let alone outrage, from the political establishment and mega media outlets. Immigration also fueled this surge of   : Nearly all of the heroin used in the U. S. is brought across the border by   Mexican traffickers. But the globalist class plowed ahead with its agenda anyway, deepening the sense of alienation many felt, particularly those drawn to Trump. “The sacredness of mass immigration is the mystic chord that unites America’s ruling and intellectual classes,” as  one pseudonymous essayist wrote in the in the Claremont Review of Books. Many sensed they were being denied a say in the way their lives were being shaped, and in many cases, destroyed by the globalists’ preferred policies: Before Trump assumed office, 84 percent of white,   voters told pollsters that U. S. government did not represent their views. “The archipelago of constituencies loyal to Democrats is small geographically. But it has lately set close to 100 percent of the agenda, and did so even in the 2016 election,” writes the Weekly Standard‘s Christopher Caldwell. “The important cultural innovations of the Obama Administration can fairly be said to have been introduced without debate, or at least in disregard of what debate had been going on,” Caldwell writes. “Gay marriage was this way, as was the complex of issues surrounding transgender bathrooms. Where did the   movement Black Lives Matter come from, with its mix of street violence and campus political correctness?   …     Why was no one in authority talking about the heroin and opioid epidemic, even as it was killing more Americans than any drug wave in American history, more even than car accidents?” “Perhaps the main thing voters were trying to do in 2016 was to restore democratic scrutiny to actors who had long managed to evade it. We will never know, because for many years Americans have felt unable to talk about such things in public at all,” he said. And now, Trump has an opportunity to build a lasting governing coalition out of   voters ignored or mocked by the globalist class. “The globalists gutted the American working class and created a middle class in Asia,” White House Chief strategist Steve Bannon said during a November interview. “The issue now is about Americans looking to not get f —  ed over. ” “If we deliver, we’ll get 60 percent of the white vote, and 40 percent of the black and Hispanic vote and we’ll govern for 50 years,” he said. “That’s what the Democrats missed  …     They lost sight of what the world is about. ”'"}, "time": 1742563229.0414507}