{"duration": 0.031620025634765625, "input_args": {"text": "'Tweet Home » Silver » Silver News » Silver Signals The Flight To Real Safety Is On Again – Fund Manager \\nThe movement back into non-fiat assets is starting again – anything connected to debt, like housing, is a de facto fiat asset. The best indicator of this is not gold, but silver: \\n\\nFrom PM Fund Manager Dave Kranzler : \\nGold is powering higher because the dollar is dropping. The dollar index is down 1.7% in the last 3 1/2 trading sessions. It’s down 2.3% vs the euro in the last 5 1/2 days, down 2.1% vs the yen in the last 3 days and down nearly 2% vs. the Swissie since Sunday night. \\nThis is NOT about the political chaos connected to the U.S. election. That’s a sideshow distraction to the real problems going on behind the scene. \\nThe U.S. economy is starting to collapse. This is becoming glaringly evident from most of the data, notwithstanding the highly manipulated economic reports like auto sales. \\nThe movement back into non-fiat assets is starting again – anything connected to debt, like housing, is a de facto fiat asset. The best indicator of this is not gold, but silver. Silver was correlating with SPX for most of October, when the investment “thesis” was “a strengthening economy is good for industrial metals.” \\nThe graph below illustrates this. It shows silver’s movement vs. the SPX for the last 3 months: \\nSilver correlated almost perfectly with the movement of the SPX for most of October (shaded area on the graph). But silver has moved up while the SPX has been selling off (including today, Nov 2nd) the past 4 trading sessions. This signals a switch from silver performing as an “industrial” metal to silver functioning as a “monetary” metal. \\nCertainly based on the gold-silver ratio, silver is extraordinarily cheap to gold and thus represents a prototypical “value” trade as the markets begin to accept and reflect economic reality and reject the politically-charge propaganda about a “healthy” economy coming from the Fed, the White House and the Democratic candidates. \\nIRD sponsor’s the Mining Stock Journal , which provides unique commentary and insight into the precious metals and mining stock market. It also presents typically an under-followed junior mining stock investment idea and, when warranted, large-cap trade. A few issues ago I recommended First Majestic calls. As of today, those calls are up over 50% from offer side at issue to bid side right now. New subscribers also receive all of the back-issues. You can subscribe by clicking here: Mining Stock Journal.'"}, "time": 1742628496.4517972}