{"duration": 0.04690885543823242, "input_args": {"text": "'Comments \\nWith Donald Trump obsesses over Hillary Clinton’s e-mail “scandal”, one wonders why he never mentions the Bush Administration and the April 12, 2007 revelation that the White House had “lost” 5 million e-mails related to an investigation into the partisan firing of eight U.S. attorneys . Eventually, the true number was found to be over 22 million e-mails. \\nSalon reports that: \\nThe emails had been run through private accounts controlled by the Republican National Committee and were only supposed to be used for dealing with non-administration political campaign work to avoid violating ethics laws. Yet congressional investigators already had evidence private emails had been used for government business, including to discuss the firing of one of the U.S. attorneys. The RNC accounts were used by 22 White House staffers, including then-Deputy Chief of Staff Karl Rove, who reportedly used his RNC email for 95 percent of his communications. \\nAccording to the Washington Post, “Under federal law, the White House is required to maintain records, including e-mails, involving presidential decision- making and deliberations.” But, of course, these millions of e-mails went missing — many of which were important evidence. \\nMost troubling, researchers found a suspicious pattern in the White House email system blackouts, including periods when there were no emails available from the office of Vice President Dick Cheney. \\n‘“That the vice president’s office, widely characterized as the most powerful vice president in history, should have no archived emails in its accounts for scores of days—especially days when there was discussion of whether to invade Iraq—beggared the imagination,” says Thomas Blanton, director of the Washington-based National Security Archive. The NSA (not to be confused with the National Security Agency, the federal surveillance organization) is a nonprofit devoted to obtaining and declassifying national security documents and is one of the key players in the effort to recover the supposedly lost Bush White House emails. \\nAs Rove and others were investigated for the partisan “unmasking” of Valerie Plame, a CIA black market specialist, it came to light that Rove’s server was used for official communications — the exact sort required to be preserved under the Presidential Records Act. \\n“I wouldn’t rule out that there were a potential 5 million e-mails lost,” White House spokeswoman Dana Perino said at the time. By 2009, it was revealed that Perino’s numbers were a little off when 22 million missing e-mails were discovered. \\nThe partisan nature of this Clinton email investigation is obvious. How is it not relevant that an administration notorious for committing war crimes and crimes against humanity was able to delete millions of emails without a word from Congress? For all their so called concern for our national security, the Republican Party has an appalling double standard.'"}, "time": 1742564120.792662}