{"duration": 0.11114001274108887, "input_args": {"text": "'After disclosures of an extensive,   doping program in Russia, sports officials have been retesting urine samples from the 2008 and 2012 Summer Olympics, in Beijing and London. Their findings have resulted in a    rewriting of Olympics history. More than 75 athletes from those two Olympics have been found, upon further scrutiny, to be guilty of doping violations. A majority are from Russia and other Eastern European countries. At least 40 of them won medals. Disciplinary proceedings are continuing against other athletes, and the numbers are expected to climb. Anyone looking at the record books for the Beijing and London Games might think them an illusion. Medals are being stripped from dozens of athletes and redistributed to those who were deprived a spot on the podium. “The numbers are just impossible, incredible,” said   Kasper, an executive board member of the International Olympic Committee. “We lose credibility. Credibility is a major concern. ” The results of the retests are coming at a time of intense international scrutiny on Russian athletes. The country’s longtime antidoping lab chief in May described an elaborate doping program and cheating scheme, and nearly a third of Russia’s Olympic team was barred from the Summer Games in Rio de Janeiro. The Olympic committee announced penalties for 16 athletes last week and another 12 on Monday. Suddenly  —   and unceremoniously  —   some undecorated Olympians are inheriting medals for their performances eight years ago. Even some   finishers are discovering that they are bronze medalists. “This completely rewrote my Olympics story,” said Chaunté Lowe, an American high jumper who participated in four Summer Games but had never won a medal. Sitting at home last week, Ms. Lowe received a curious Facebook message from a German athlete against whom she competed in 2008: “Congratulations, bronze medalist,” it read. After three women who finished ahead of Ms. Lowe were disqualified for doping  —   Anna Chicherova and Yelena Slesarenko of Russia, and Vita Palamar of Ukraine  —   she moved up to third place, newly successful in a jump she took when her    daughter was an infant. “I kept doing the math,” said Ms. Lowe, who originally finished sixth. “Wait: 6, 5, 4.   …     Oh my gosh  —   they’re right. I started crying. ” Accompanying the joy of her belated recognition, she said, was an awareness of the opportunity costs she suffered. In 2008, her husband was laid off. The couple’s house in Georgia was foreclosed on that year, something Ms. Lowe said would not have happened had she distinguished herself in Beijing. “I was really young and promising at that point, and sponsors were interested in me,” said Ms. Lowe, now 32. “A lot of interest goes away when you don’t get on that podium. ” Edwin Moses, the American Olympic hurdler and chairman of the board of the United States   Agency, said it was difficult to measure the “agony of winning and losing, of having medals ripped away. ” “I don’t know how you recover those damages,” he said. The Olympic committee generally coordinates with the federations that govern each sport, along with the national Olympic committees of the affected countries, to collect medals from penalized athletes and redistribute them. Of the athletes so far implicated in the retests, a vast majority competed in track and field events and weight lifting. It is standard practice for Olympic officials to store urine samples for up to a decade so they may conduct additional tests if they obtain new information. While the first wave of retests began last year, the longtime director of Russia’s antidoping laboratory told The New York Times in May about a cocktail of banned substances that he used to improve the performance of scores of Russian athletes over the past several years. Dr. Olivier Rabin of the World   Agency, who has been collaborating with the Olympic committee on the retests, confirmed that officials had been informed by disclosures regarding specific drugs Russian athletes used. “Clearly when you look at the findings, they correlate with the intelligence about Russia,” Dr. Rabin said. Nearly all of the violations, across nationalities, were for the anabolic steroids Stanozolol or Turinabol, the very substances that notoriously fueled East Germany to global dominance in the 1970s and 80s. A rash of Turinabol violations have also recently cropped up in major and minor league baseball in the United States. “The good   drugs work very well for strength,” Dr. Rabin said. “There’s a reason they’re still around. ” The drugs were not detected by the Olympic committee’s   lab years ago, during the Games, because the science at the time was not sensitive enough to detect such small residual concentrations, according to Dr. Richard Budgett, medical and scientific director of the I. O. C. New testing methods have increased the period of time during which   drugs can be detected in the body. “Science progresses every day,” Dr. Rabin said. “Just over the past probably five years, the sensitivity of the equipment progressed by a factor of about 100. You see what was impossible to see before.” Rarely are doping violations found during the Games. At the London Games, the Olympic lab found only eight possible violations, a fraction of the dozens more exposed this year. “It’s sad to say,” Ms. Lowe said, “but a lot of times when you go to these competitions, you’re like: Just get close enough to top three because you never know who’s going to test positive. ” As the I. O. C. ’s retests continue, the standings of the past Winter Games may be upended, too. Officials have focused on samples from past Summer Games this year, seeking to ensure they caught possible cheaters who were eligible to compete in Rio de Janeiro in August. Ahead of the 2018 Winter Games in Pyeongchang, South Korea, the I. O. C. is expected to turn its attention to samples from the 2010 Games in Vancouver. Officials have already scrutinized some 500 samples from the 2006 Winter Games in Turin, but the I. O. C. has not provided details on how many violations were discovered. “The I. O. C. cannot and will not issue further comments with regard to this process, nor will it answer questions, at this point in time,” a spokeswoman wrote by email on Monday regarding the tests from the Turin Games. As fallout from the Russian doping scandal continues, medals from the 2014 Sochi Olympics are also likely to be called into question, particularly after the World   Agency publishes the results of an investigation into Russian athletes who doped in Sochi and had their violations concealed by a   operation. That group includes at least 15 Russian medalists, the nation’s former antidoping chief told The Times. Such a sizable number of violations by one country’s delegation at a single Olympics could prompt sports officials to consider penalties ahead of the next Games. “To say that justice is being served is very pretentious,” said Francesco Ricci Bitti, chairman of the Association of Summer Olympic International Federations and former president of the International Tennis Federation. “But we’re on a path forward. ” Mr. Kasper, the Swiss I. O. C. executive who also oversees the sport of skiing, had a more pragmatic perspective. “We need to stop pretending sport is clean,” he said. “It’s a noble principle, but in practice? It’s entertainment. It’s drama. ”'"}, "time": 1742561964.5719156}