{"duration": 0.040628910064697266, "input_args": {"text": "'The   at the Democratic National Committee after an embarrassing breach of its email system continued on Tuesday with the departure of three senior officials. Amy Dacey, the committee’s chief executive Luis Miranda, its communications director and Brad Marshall, its chief financial officer, will leave amid a reshuffling of leadership positions, said Donna Brazile, the interim chairwoman. The departures came more than a week after WikiLeaks posted almost 20, 000 of the committee’s emails, a number of which revealed officials showing favoritism toward Hillary Clinton in her primary campaign against Senator Bernie Sanders of Vermont. The messages confirmed the concerns expressed by Mr. Sanders throughout the campaign, cast a cloud over the start of the Democratic National Convention in Philadelphia last week and led to the resignation of Representative Debbie Wasserman Schultz of Florida as the committee’s chairwoman. Ms. Brazile praised the outgoing staff members and made no mention of the controversy. “Thanks in part to the hard work of Amy, Luis, and Brad, the Democratic Party has adopted the most progressive platform in history, has put itself in financial position to win in November, and has begun the important work of investing in state party partnerships,” she said in a statement. “I’m so grateful for their commitment to this cause, and I wish them continued success in the next chapter of their career. ” American intelligence officials believe that the Russian government was behind the breach of the committee’s emails and documents, possibly as part of an effort to damage Mrs. Clinton and sow discord in the Democratic Party. An email from Mr. Marshall to Mark Paustenbach, a communications official, and Ms. Dacey suggesting that the committee promote questions about Mr. Sanders’s faith drew particular scorn from the senator and his supporters. “It might may no difference, but for KY and WVA can we get someone to ask his belief. Does he believe in a God,” Mr. Marshall wrote, referring to Kentucky and West Virginia. “He had skated on saying he has a Jewish heritage. I think I read he is an atheist. This could make several points difference with my peeps. ” In May, Mr. Paustenbach wrote to Mr. Miranda about encouraging reporters to write that Mr. Sanders’s campaign was “a mess” after a glitch on the committee’s servers gave the Sanders campaign access to the Clinton campaign’s voter database. “Wondering if there’s a good Bernie narrative for a story, which is that Bernie never ever had his act together, that his campaign was a mess,” Mr. Paustenbach wrote. Mr. Miranda wrote back: “True, but the Chair has been advised to not engage. So we’ll have to leave it alone. ” The committee has since apologized to the Sanders campaign. To help fill the void, the committee announced, it is bringing on Tom McMahon, a former executive director of the committee, to lead a transition team.'"}, "time": 1742564577.785344}