{"duration": 0.06590938568115234, "input_args": {"text": "'\\nIn something that could’ve been scripted by George Orwell, President-elect Donald Trump just has pretty much every major media personality and/or outlet over to Trump Tower for a closed-door meeting. \\nThe NY Post stated : \\n“The hour-long session included top execs from network and cable news channels. Among the attendees were NBC’s Deborah Turness, Lester Holt and Chuck Todd, ABC’s James Goldston, George Stephanopoulos, David Muir and Martha Raddatz, \\nAlso, CBS’ Norah O’Donnell John Dickerson, Charlie Rose, Christopher Isham and King, Fox News’ Bill Shine, Jack Abernethy, Jay Wallace, Suzanne Scott, MSNBC’s Phil Griffin and CNN’s Jeff Zucker and Erin Burnett.” \\nBefore the meeting, everyone was speculating as to what was going on. Why is Trump colluding with the media? Is he trying to control the conversation and form some sort of state sponsored media? \\nWell, speculate no further. Trump called everyone to his tower to scold them like the Henry the 8th he is very much turning out to be. \\nAccording to one source who confided in the NY Post : \\n“It was like a f–ing firing squad…Trump started with [CNN chief] Jeff Zucker and said ‘I hate your network, everyone at CNN is a liar and you should be ashamed.” \\nAdding: \\n“The meeting was a total disaster. The TV execs and anchors went in there thinking they would be discussing the access they would get to the Trump administration, but instead they got a Trump-style dressing down.” \\nIt was basically Trump throwing a hissy fit and talking down to everyone in the media to tell them how very awful they are to him. Even though they were pretty soft on him throughout the course of his campaign, often given him an open forum and hours of free airtime to tout his craziness. \\nAnother source said: \\n“The meeting took place in a big board room and there were about 30 or 40 people, including the big news anchors from all the networks.” \\nFurther: \\n“Trump kept saying, ‘We’re in a room of liars, the deceitful dishonest media who got it all wrong.’ He addressed everyone in the room calling the media dishonest, deceitful liars. He called out Jeff Zucker by name and said everyone at CNN was a liar, and CNN was [a] network of liars…Trump didn’t say [NBC reporter] Katy Tur by name, but talked about an NBC female correspondent who got it wrong, then he referred to a horrible network correspondent who cried when Hillary lost who hosted a debate – which was Martha Raddatz who was also in the room.” \\nSome of the media did try to get a word in edgewise, but it was pretty much all for naught. Trump was there to scold and not get a lesson from the media in freedom of the press and speech. \\nNY Post reported a source saying: \\n“[CBS Good Morning co-host Gayle] King did not stand up, but asked some question, ‘How do you propose we the media work with you?’ Chuck Todd asked some pretty pointed questions. David Muir asked ‘How are you going to cope living in DC while your family is in NYC? It was a horrible meeting.” \\nAccording to Kellyanne Conway, however, it all went really well. Yet, it’s hard to believe a word that comes out of the Trump camp, because they will say only what they want people to hear, and most of the time there’s barely a sliver of the truth involved. \\nNo word as to who the source is that spoke to the NY Post . \\nIt’s pretty clear Trump wants to control the narrative of the press, why else would he have so many big news names over to his palace tower? He wanted to scold them and likely tell them how they should be operating, and we should all be very, very mortified that he even had them over in the first place. \\nAfter all, if you control the press, you control what the people hear. If you control what the people hear, you can tell them anything you want, even if it’s not in their best interests. It’s horrifying, to say the least, absolutely Hitler-esque, if we’re going to be honest. \\nThe press need to be counted on to hold Trump accountable for everything that he says or does, and if they don’t someone needs to hold the press accountable as well. This is a scary time we’re entering into and hopefully the Constitution will not be shredded and honesty with accountability will prevail. \\nFeatured Photo by Spencer Platt/Getty Images '"}, "time": 1742562682.4185042}