{"duration": 0.06459236145019531, "input_args": {"text": "'Leave a reply \\nGillian MacBeth Louthan – The 11:11 doorway will issue a time out, not for bad behavior but for examination of the new patterns of light. Like a spider’s web, messages are hidden sculpted in sacred geometries and codes. What is sacred seeks an outlet a place of shelter. As we move past the previous markers of this years limitations, we begin to dimensionally float like an island in a gust of hurricane force wind. Everything floats like ivory soap causing all of us to feel a little nauseous like altitude sickness and seasickness wrapped in one big burrito. \\nWe truly have become almost Island like, moving ever so slightly with the changing dimensional tides, no longer attached to any outcomes. Everything tries to right itself like an upside down cake. The winds of change are dominant and push us in directions we would not choose on our own. Like a multi colored autumn leaf, we allow that ‘which is’, to buffer our shift. We are quickly learning Dimensional riff is not a place for sissies. \\nLearning to float is ‘a must’. The cells of your body and heart sound with glee as you bring love into your future via intent and word ‘This is the time of your life’ spend it well, with reverence for all. Find the bounty in your hearts desires. You will learn to skate the highways and byways of dimensional conversion as all of Earth enters a new hologram in 2017.This ‘mother of all holograms’ will support the smaller projections within her own body like a great sturgeon before it gives birth to millions of eggs. \\nEveryone will unwrap themselves before the holidays. at the time of the winter solstice you will see the true diamond light that lives inside. Reflections of realism fill the room as thick as frankincense and myrrh. Faces show the topographical map of worry as lines are crossed. Sometimes a road once traveled ends, we are all under construction. \\nEverything serves the Light and one should have no regrets on any level. Words will have much more punch and you who have called energy with your mutterings will see the end results. We all walk forward with our hearts in our hands on bended knee with humble thoughts. We, who wear the Codes of Light, do so throughout time, never ceasing to trust what lives in our divine blueprint. We have been cut from a blessed cloth and sewn into a holy vessel. \\n11:11 is a doorway or gateway into your highest potential as a human seeking complete divine memory. One is a singularity within ‘all that is’. The ‘one’ seeks itself through mirror-like reflections of the world around it. This doorway offers an opportunity to surpass any limitations you have unknowingly set for yourself. One to one to one – enter the oneness hidden deep within your being at the center point of your soul. SF Source www.thequantumawakening.com  '"}, "time": 1742563534.9997678}