{"duration": 0.11002802848815918, "input_args": {"text": "'RIO DE JANEIRO  —   The brothers Dan and Anthony Rigney of Australia attended the Olympic weight lifting competition on Sunday and were not exactly mortified that the sport is more polluted than Guanabara Bay. Sure, they want athletes to be   but they also want to be entertained by raw human power. So yes, they would have preferred to see the Russian and Bulgarian teams, which were barred for doping. Likewise with Ilya Ilyin, a suspended   Olympic champion from Kazakhstan, who is the Barry Bonds of the clean and jerk. “You like to see world records,” said Dan Rigney, 28, a physiotherapist and competitive lifter from Sydney. “It’s like baseball. People just want to see home runs. ” There has long been a    pragmatism about weight lifting. Drugs have been a hushed but vital part of doing business. If there is an argument to be made that any sport should permit doping, or even make it mandatory, that sport is weight lifting. “Maybe it already is,” Dan Rigney said with a laugh, adding that, in his view, doping “is what’s keeping the Olympics going. ” Let’s be honest. We don’t want to see anybody lift a keg. We want to see someone hoist a Buick. We are nostalgic for champions like Vasily Alekseyev, the great Soviet superheavyweight who won gold medals in 1972 and 1976. He set 80 world records and was the first person to lift 500 pounds in the clean and jerk. He was so massive that his uniform fit like a chin strap on a bowling ball. And those sideburns  —   great thickets wide and deep enough to plant potatoes. Oh, sure, we say we are against doping in sports. But we don’t care enough to stop buying tickets or watching on television. And let’s ask ourselves this: Would anyone stay tuned if the Olympic champion ran the 100 meters in 15 seconds instead of nine? Who would watch the N. F. L. if linemen were built more like Gilligan than the Skipper? Most fans seem to view doping in the same way they view special effects in “Star Wars” movies, said Charles Yesalis, a retired Penn State professor and an expert on   drugs. “It enhances the enjoyment of viewing because you see    people doing    things,” Dr. Yesalis said in a recent interview. “If everybody looked like normal people, chances are the N. C. A. A. the N. F. L. and the Olympics would not be   entities. ” Before the Games, international sports officials tossed out assorted male and female lifters from Azerbaijan, Armenia, Cyprus, Kazakhstan, Moldova, North Korea, Romania, Turkey, Ukraine and Uzbekistan, a Fodor’s guide through the world of banned substances. Olympic weight lifting without Russia and Bulgaria is like Harry Potter without Lord Voldemort and Bellatrix Lestrange (if those villains wore spandex and had necks the size of Easter hams). The competition will go on, but it won’t be the same. Until recently, weight lifting officials had mostly turned the other way, keenly understanding that the final word of the Olympic motto, “Faster, Higher, Stronger,” is not easily achieved over the counter. Of course, with the Rio Games upon us, the International Weightlifting Federation is suddenly affronted. It has called revelations of widespread doping in Russia “shocking and disappointing” and has said that the “integrity of the weight lifting sport has been seriously damaged. ” Integrity? Now they worry about integrity? There were 24 positive tests at the world weight lifting championships last year, and retesting of urine samples from the 2008 Beijing Games and the 2012 London Games revealed at least 20 additional positives, including four from Olympic champions, according to the news agency Agence  . Essentially, comedy has become reality. Remember that “Saturday Night Live” sketch, with Phil Hartman playing a Soviet weight lifter named Sergei Akmudov at the All Drug Olympics? “His trainer has told me that he’s taken anabolic steroids, Novocain, NyQuil, Darvon and some sort of fish paralyzer,” the announcer, played by Kevin Nealon, says earnestly. “Also, I believe he’s had several cocktails within the last hour or so,” the announcer says. “All this, of course, is perfectly legal at the All Drug Olympics. In fact, it’s encouraged. ” Akmudov tries to lift more than 1, 500 pounds, triple the world record in the clean and jerk, except for one small problem. “Oh, he’s pulled his arms off!” the witless announcer yells. “He’s pulled his arms off! That’s got to be disappointing to the big Russian. ” With the fall of the Berlin Wall and the dismantling of the Soviet Union, the Olympics lost a gripping appeal for many Americans  —   the rivalry between East and West. With Russia now absent from Rio in weight lifting and track and field, that enthralling tension erodes further still. “There was no one to root against,” Matt Futterman wrote last month in The Wall Street Journal, lamenting the parting of the Iron Curtain for international sport. “It was like watching a Bond film in which everyone was working for MI6. ” One wonders whether medals won in Rio will be devalued in particular sports, as they were when the United States boycotted the 1980 Moscow Olympics and the Soviet Union reciprocated at the 1984 Los Angeles Games. “Weight lifting is so riddled with doping problems, it’s hard to call any medal devalued,” said Bill Mallon, an Olympic historian. And to be sure, many people in weight lifting have applauded the mass suspensions. “Rules are rules,” said Mika Tiainen, Finland’s Olympic coach. “Lifting makes the competition, not the country. ” Still, it would surprise no one if the retesting of urine samples from Rio led to the stripping of medals in coming years. Anthony Rigney, 33, a teacher, said he had seen a meme online: “I can’t wait until 2024 to see who won the gold in Rio. ”'"}, "time": 1742564541.5803423}