{"duration": 0.15128612518310547, "input_args": {"text": "'NTEB Ads Privacy Policy Donald Trump Will Be 70 Years, 7 Months And 7 Days Old On First Full Day In Office As President On May 14, 2018, Israel will have been officially regathered, in fulfillment of Bible prophecy, for exactly 70 years. In 70 AD, Israel was destroyed by the Romans and the Temple stones toppled to the ground exactly as Jesus said it would happen. When you subtract 70 AD from 2018 AD, where does that leave you? It leaves you square in 1948 AD. Please pause here and allow that thought to sink in for a moment. by Geoffrey Grider November 3, 2016 God likes to orchestrate events relating to Israel around the number 70 \\n“In the first year of his reign I Daniel understood by books the number of the years , whereof the word of the LORD came to Jeremiah the prophet, that he would accomplish seventy years in the desolations of Jerusalem.” Daniel 9:2 (KJV) \\nPeople, you better buckle up because things are about to become unglued. For well over a year now, we here at NTEB have been telling you that Donald Trump is God’s man for the White House, and that Bible prophecy would be fulfilled in the process. Two very eye-opening articles you need to read are The Real Reason Why Donald Trump Was Chosen To Be The Republican Candidate For President and Why A Bible Believer Is Supporting Donald Trump For President Of The United States . I wrote those articles on May 4 and February 13, respectively. Israel in general and Jerusalem in particular are God’s time clock for the fulfillment of Bible prophecy \\nOn our Sunday night radio show , which you can access here , we talked about Donald Trump, Bible prophecy and the coming global shaking. And believe me when I tell you it’s coming. In the 9th chapter of Daniel we see that he finally understands what Israel’s Babylonian captivity is all about by reading the prophecy Jeremiah had written. That was Daniel’s “a-ha!” moment. \\n“And this whole land shall be a desolation, and an astonishment; and these nations shall serve the king of Babylon seventy years . And it shall come to pass, when seventy years are accomplished, that I will punish the king of Babylon, and that nation, saith the LORD, for their iniquity, and the land of the Chaldeans, and will make it perpetual desolations.” Jeremiah 25:11,12 (KJV) \\nAfter digesting that bombshell , Daniel is then visited by the angel Gabriel who gives Daniel his own shocking prophecy of the Seventy Weeks Of Years. All of that prophecy has been fulfilled except the last week, or 7 year period, known as the time of Jacob’s trouble as found in the book of Jeremiah and mentioned by Jesus in Matthew 24 as the time of “great tribulation”. \\n“Alas! for that day is great, so that none is like it: it is even the time of Jacob’s trouble; but he shall be saved out of it.” Jeremiah 30:7 (KJV) \\n“For then shall be great tribulation, such as was not since the beginning of the world to this time, no, nor ever shall be.” Matthew 24:21 (KJV) \\nOn May 14, 2018, Israel will have been officially regathered , in fulfillment of Bible prophecy, for exactly 70 years. In 70 AD, Israel was destroyed by the Romans and the Temple stones toppled to the ground exactly as Jesus said it would happen. When you subtract 70 AD from 2018 AD, where does that leave you? It leaves you square in 1948 AD. Please pause here and allow that thought to sink in for a moment. \\nDonald Trump was born on June 14, 1946. If you move ahead 70 years from that date, that brings you to June 14, 2016. Moving forward another seven months brings you to Jan. 14, 2017, and moving forward another seven days brings you to Jan. 21, 2017. This is happening in the year 5777 according to the Jewish calendar. \\nAnd if Donald Trump wins the election , Jan. 21 will be his first full day in office. Of course Trump would be inaugurated on Jan. 20, but he would only be president for part of that day. So that means that Donald Trump would be 70 years, seven months and seven days old on his first full day as president of the United States . Please pause here as well, and allow that thought to sink in for a moment. \\nAll this brings us to our last point, and here it is. One of the many campaign promises that Donald Trump has made is that he will move the US Embassy in Israel from its current location in Tel Aviv, to its new location in Jerusalem in accordance with the Jerusalem Embassy Act of 1995 . By doing that, the United States will recognize Jerusalem as the capital of Israel, and thus set off the Psalm 83 War as found in the Bible. \\n“They have said, Come, and let us cut them off from being a nation; that the name of Israel may be no more in remembrance. For they have consulted together with one consent: they are confederate against thee:” Psalm 83:4,5 (KJV) \\nFor it is Jerusalem, what the Bible calls the “apple of God’s eye”, that the real battle will be fought over. Why do you think that the Palestinians have always rejected the so-called Two State Solution? Because that solution calls for Jerusalem and the Temple Mount to stay with Israel, and the Muslims will not stand for that. They want Jerusalem for the same reason that the Antichrist fights the Battle of Armageddon for it. Because Jerusalem is where Jesus returns to, and where He will rule from for a thousand years. Jerusalem is the reason for all the conflict, all the fighting, all the past wars, and the coming war. \\n“Behold, I will make Jerusalem a cup of trembling unto all the people round about, when they shall be in the siege both against Judah and against Jerusalem. And in that day will I make Jerusalem a burdensome stone for all people: all that burden themselves with it shall be cut in pieces, though all the people of the earth be gathered together against it.” Zechariah 12:2,3 (KJV) \\nThis election is going to usher in a time of amazing fulfillment of Bible prophecy. It is no coincidence of any kind that Donald Trump will be 70 years, 7 months and 7 days old on his first full day in office. It is not luck, fortune, happenstance or karma that he beat his 16 competitors for the nomination. As I have said for over a year now, Donald Trump is God’s man for “such a time as this”, and that we are living in the days of visible fulfillment of Bible prophecy. \\nAs we started our radio show on this topic on this past Sunday night, do you know what the headline story on the Jerusalem Post website was? It was this: Ivanka Trump says her father will move US embassy to Jerusalem ‘100%’ if elected \\nIf Donald Trump becomes President on Tuesday , as I believe with all my heart he will, then you better start thinking about the time of Jacob’s trouble beginning sometime on or around May of 2018. That means the Rapture of the Church will have to happen before that. Please pause here as well, and allow that thought to sink in for a moment. \\nAre YOU ready for what comes next? Because, brothers and sisters, it sure looks like it’s coming. \\nGeoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742562860.4103594}