{"duration": 0.01593017578125, "input_args": {"text": "'We Are Change \\n\\nHillary Clinton’s election night fireworks have reportedly been cancelled, after reports surfaced last week that she was already planning her victory celebration for Tuesday night.\\nA report from the New York Post claimed that law enforcement and fire department officials in New York City were being prepped for a “barge-launched pyrotechnic display off Manhattan’s Javits Center, where Clinton and running mate Tim Kaine will join their supporters for the Nov. 8 vote count.” The show was planned for 9:30 p.m. EDT, half an hour after the polls close.\\nWhile the Jacob K. Javits Center where Clinton is hosting the event has a symbolic glass ceiling , it is also important to note that the company she is reportedly using for the fireworks display is Garden State Fireworks. The same company produced the fireworks special for the grand opening of the Trump National Golf Club in Bedminster, NJ, in 2007.\\nFormer Republican nominee Mitt Romney made similar plans in 2012. According to a report from the Daily Caller, the Romney campaign planned “an eight-minute, $25,000 fireworks show over Boston Harbor to celebrate a victory over Barack Obama that never happened.” \\nReport of Clinton’s celebration drew criticism on Twitter, with some users resurrecting calls of a rigged election:\\nOh, so #HillaryClinton already booked the fireworks? https://t.co/jiRSjKmclH \\n— Andrew Wilkow (@WilkowMajority) November 1, 2016 \\n\"She will still try to steal the election…….that\\'s what criminals do.\" — nobamunism https://t.co/KJdFJgbgpE \\n— Luana H. (@LuanaMacLac) November 1, 2016 \\nHillary must be pretty confident her cronies will snag the election for her to plan fireworks victory celebration. https://t.co/xPcUqF1RqI \\n— Copper Penny (@wallingfordgurl) November 1, 2016 \\n\\nNYPD chief of intelligence Tommy Galati, Mayor Bill de Blasio and Police Commissioner James O’Neill held a press conference on Election Day security on Monday morning, where they revealed that the fireworks show has been cancelled.\\n“They do have a permit for fireworks, but at this point we believe the fireworks is canceled,” Galati said.\\nWhen asked what the reason was behind the cancellation, Galati said, “I cannot tell you that.” \\n \\nFollow Rachel Blevins on Facebook and Twitter . \\n \\n \\nThe post Does Hillary Clinton Already Know The Results Of The Election? appeared first on We Are Change .\\n'"}, "time": 1742628478.2345166}