{"duration": 1.2019519805908203, "input_args": {"text": "'BALTIMORE  —   Two officers have been acquitted. Another had a deadlocked jury. And on Thursday, prosecutors in a courtroom here began their fourth attempt to convict a police officer in the fatal arrest of Freddie Gray, the black man who died of a spinal cord injury he suffered while in police custody last year. This time, the defendant is Lt. Brian Rice, the   officer present at Mr. Gray’s arrest, who, prosecutors said, knew the rules and “needlessly risked Mr. Gray’s safety and life” by failing to put a seatbelt on him in a police van that morning. “Because of the decisions that Lieutenant Rice made, Mr. Gray is dead,” said Michael Schatzow, the chief deputy state’s attorney for Baltimore City, in an opening argument that legal experts said did not introduce significant new details to a narrative that has so far failed to win any convictions. Mr. Gray’s death in April 2015 prompted violent protests here and put this city at the center of a national reckoning over race and policing that took on renewed intensity this week after killings of   men by police officers in Baton Rouge, La. and Falcon Heights, Minn. But it is rare that police officers are brought to trial, and even more so to convict them. Lieutenant Rice’s trial began with doubts that prosecutors had the evidence to secure convictions against any of the six officers charged in Mr. Gray’s death  —   especially after the acquittal last month of Officer Caesar R. Goodson Jr. the driver of the van in which Mr. Gray broke his neck, who had been charged with   murder. On the morning of April 12, 2015, as he was walking through a downtrodden section of West Baltimore with two friends, Mr. Gray began running after seeing Lieutenant Rice. The officer called for assistance to help chase Mr. Gray, who was arrested and loaded into a transport vehicle as a crowd formed. Mr. Gray was later found with a broken neck inside the van, after it had made several stops throughout the neighborhood. “This defendant is not an inexperienced officer who was ignorant of the rules that governed his conduct,” said Mr. Schatzow, the prosecutor, who said Lieutenant Rice was criminally negligent when he helped put a shackled and handcuffed Mr. Gray into the van at its second stop, but did not put a seatbelt on him, as Mr. Schatzow said, duty required. “He knew it, and he ignored it. ” Lieutenant Rice, 42, faces charges of involuntary manslaughter,   assault, reckless endangerment and misconduct in office. A second charge of misconduct was dropped by prosecutors on Thursday morning. Chaz Ball, a defense lawyer for Lieutenant Rice, described his client as an   veteran of the Baltimore police force with an interest in community policing. He cited what he called the “three Cs” of the case  —   “The crowd, the combativeness of Mr. Gray, and the confined space of the wagon”  —   and said that Lieutenant Rice had acted reasonably. “The   assessment that it was too dangerous to try to force Mr. Gray into a seatbelt wasn’t criminal negligence,” Mr. Ball said. “The evidence,” he added, “will show that Mr. Gray’s death was a tragic, freak accident nobody could have foreseen. ” Lieutenant Rice, like Officers Edward M. Nero, who was acquitted in May, and Officer Goodson, chose to waive his right to a jury trial and place his fate in the hands of Judge Barry G. Williams, once a police prosecutor himself. The judge ruled in Officer Goodson’s trial that there was insufficient evidence to show that his failure to place a seatbelt on Mr. Gray created serious risk to Mr. Gray’s life and led to his death. “I think the state is on notice that they’re going to have to work pretty hard to show that an officer’s failure to follow and ensure that someone is buckled in alone is enough to satisfy criminal negligence,” said David Jaros, an associate professor of law at the University of Baltimore who has been following the cases. “And we haven’t heard, in the opening anyway, about how they’re going to fill that evidence gap,” Mr. Jaros added. It was quiet outside the courthouse as defense lawyers concluded their opening arguments, where Arthur Johnson, a retired steelworker, stood on the sidewalk with a tattered sign reading “Justice for Freddie Gray. ” A stranger in a white   walked by and looked at Mr. Johnson’s sign. “They just had another senseless shooting,” the man said, and Mr. Johnson said that he, too, was feeling a sense of dèjá vu. “I hear it’s the same old, same old  —   it’s going to be the same result,” Mr. Johnson said of the proceedings in the courtroom. “All these people being victimized, and nobody being held accountable. It’s hard to be optimistic. ”'"}, "time": 1742562587.4067585}