{"duration": 0.1255955696105957, "input_args": {"text": "'What may come as a shock to some of the staunchest liberals in California  —   who wear their Trump “resistance” as a badge of honor  —   is that California was the birthplace of “Trumpism,” according to Politico writer Scott Lucas. [Lucas called into Breitbart News Daily Show, hosted by Alex Marlow, on Monday, and for about 14 minutes, one of the most conservative radio hosts and one of the most liberal political journalists had an extremely good conversation —  one that was both insightful and respectful.  (Something lacking in the current political climate.) Marlow and Lucas attended Berkeley together  —   where they battled on blogs and in the school paper  —   and still talk occasionally to this day.  Lucas recently penned a piece for Politico entitled, “How California Gave us Trumpism” —  and Marlow asked him how it was received. In response, Lucas quoted a conservative friend from high school, who was a contestant on The Apprentice and “knew Donald Trump a little: “Scott, I feel like this piece does a really, really good job of understanding sort of how I see the world, seeing things through my eyes. ” And that sort of sums up Trump’s appeal. He saw the world through the eyes of the tired, the forgotten, the everyman  —   who’d been left behind. In California, conservatives are the truest of true believers, whose isolation has made them all the more ardent about their beliefs. According to Lucas, it was that environment that gave birth to “Trumpism,” described by Lucas as the “marriage of ‘Constitutional Conservatism’ coming out of the Claremont Institute with a sort of ‘Entertainment Populism’ coming out of Breitbart. ” When asked who were some of the names who sparked what Lucas later in the interview calls “an important intellectual moment,” more than 80% of the names are likely familiar to Breitbart’s audience: One name that came up later would bring the entire discussion full circle  —   and that was none other than Andrew Breitbart himself, who Lucas noted embodied both schools of thought. Breitbart was on a Lincoln Fellowship at the Claremont Institute when he launched the website that would bear his name, and later help launch one of the most unlikely presidencies in modern times. What is ‘California Trumpism’? Lucas says, “’Trumpists’ are people who think California  —   and by extension the United States  —   are in decline  …    that there’s something wrong, something’s on the downslope, and they’re very willing to say that, point it out, try to figure out what to do about it. ” For Lucas, there are two seminal moments in the rise of “Trumpism. ”  First, the publication of Michael Anton’s “The Flight 93 Election”  —   in which Anton, under an alias, lays out the perfect case for why a   figure can only arise as a Phoenix from the ashes of a corrupt,   Republic  —   and the tragic murder of Kate Steinle, the beautiful 32   woman cut down in the prime of her life by an illegal alien set loose on the streets of San Francisco by liberals’ sanctuary policy. Lucas was very open about the way he and other liberals were taken by complete surprise by Trump’s election  —   something that many conservatives in California understood intuitively was a foregone conclusion once Trump made it clear he would stand and fight like Reagan did, instead of cutting and running  like the Mitt Romney wing of the party.  But unlike most liberals, Lucas admitted that he believes it is important to understand how we got here, instead of simply demonizing Trump and his supporters. “We’re all in this country together, we’re all in this state together  —   who are you people?” Lucas asks, rhetorically.  “What do you think?” He answers his own question early in the interview: It seems a very important intellectual moment in bringing together these sort of two strands of Conservatism that have emerged in Southern California. On the one hand, this idea from the Claremont Institute  —   that the United States was founded as sort of an expression of ancient political theory coming from Aristotle and people like that.  And that we’re in serious trouble with the rise of Progressive Liberal Government in the 20th Century. And on the other hand, sort of Andrew Breitbart’s idea that culture is ahead of politics  —   that you had to create a media vehicle that sort of spoke to people where they are  —   and bring them along politically after that. And it struck me that was very obviously the formula for Trump  …     Lucas decried the violence and death of free speech in Berkeley (the birthplace of the Free Speech Movement’):  “It’s very disheartening to see people [on the far left and the far right] who’d rather punch each other than talk to each other when they have political disagreements. ” When asked by Marlow if life is going to get better or worse for conservatives in California, Lucas had a warning. “California is always a decade or two ahead of the United States  —   and  …    as goes California, so, too, very often goes the United States  …    ”. He suggested that progressive leftism was likely going to take over the rest of the nation in that time. Not likely in places like Texas or the heartland of this country, at least not anytime soon. Maybe there’s another takeaway  …     Since “Trumpism” was truly born in California, perhaps there’s hope for the Golden State after all. Tim Donnelly is a former California State Assemblyman and author who is doing a book tour for his new book: Patriot Not Politician: Win or Go Homeless. He ran for governor in 2014. FaceBook: https:  . facebook. . donnelly.  Twitter:  @PatriotNotPol,  '"}, "time": 1742562868.6666734}