{"duration": 0.12070536613464355, "input_args": {"text": "'WASHINGTON  —   Prime Minister Narendra Modi of India condemned global terrorism and said during a lengthy address to Congress on Wednesday that growing economic ties benefit both his country and the United States. “The innovation strength of our two countries comes together in California,” said Mr. Modi, who visited California last year. “Here, the innovative genius of America and India’s intellectual creativity are working to shape new industries of the future. ” Mr. Modi made clear that he intended the speech to hail a new moment in relations between the United States and India when he told Congress at the outset that he had started his visit to Washington with a trip to Arlington National Cemetery. He called it “the final resting place of many brave soldiers of this great land. ” “I honored their courage and sacrifice for the ideals of freedom and democracy,” Mr. Modi added. Indian leaders have long been skeptical of American military power and have often been deeply critical of the Vietnam War and other military interventions by the United States. Celebrating American war dead, though, was a telling signal of what both sides say is a very different relationship between the two countries. Mr. Modi has encouraged a continued American military presence in Afghanistan because he is worried that Pakistan will have unchallenged influence there once the Americans leave. “Your contribution in keeping the region safe and secure is deeply appreciated,” Mr. Modi said, adding: “A commitment to rebuild a peaceful and stable and prosperous Afghanistan is our shared objective. ” Almost exactly 31 years ago, Rajiv Gandhi, then India’s prime minister, also spoke of Afghanistan in an address to Congress. But he did it in the context of justifying the Soviet military presence there because, he said, Soviet troops were “invited by the Karmal regime,” a reference to the   government of President Babrak Karmal. The different references to Afghanistan are a measure of just how much relations between the world’s largest democracies have changed in three decades. In another sign of a break with the past, Mr. Modi gave a strong endorsement for global institutions, most of them created with American leadership. “Growing uncertainties and political complexities  —   our engagement can make a difference by promoting cooperation, not dominance,” Mr. Modi said. “Connectivity, not isolation. Inclusive, not exclusive mechanism. Respect for global commons and, above all, for international rules and norms. ” Then Mr. Modi made an explicit reference to China by endorsing the “freedom of navigation on seas,” referring to disputes involving the South China Sea and China’s efforts to carve out part of those waters as its own. Mr. Modi was the fifth Indian prime minister to address Congress, and the appearance represents a turnaround in his acceptance within the United States. For years Mr. Modi was barred from getting a visa to come here because of his role in 2002 riots in the Indian state of Gujarat that cost the lives of more than 1, 000 people, mostly Muslims. But as he rose as a national political figure in India, United States diplomats sought to put that difficult history to rest. Mr. Modi’s decision to accelerate   ties with the United States has been greeted in Washington with excitement and surprise. On Tuesday, he held meetings at the White House with President Obama, where the two leaders formalized a wide range of agreements covering climate change, renewable energy, security and economic issues. Before Congress, Mr. Modi also repeated that India was open for business. Mr. Modi is eager for greater foreign investment, and although he has failed to deliver many fundamental reforms that would make business easier to conduct there, the smaller steps he has taken and his obvious enthusiasm have persuaded some major investors to give India a try. In his speech, Mr. Modi gave a nod to his difficulties in passing much of his economic reform agenda. Although Mr. Modi’s Bharatiya Janata Party has a majority in the Lok Sabha, India’s lower house of Parliament, it does not have a majority in the upper house, the Rajya Sabha. “Mr. Speaker, I’m informed that the working of the U. S. Congress is harmonious,” Mr. Modi said to laughter. “I’m also told that you’re well known for your bipartisanship. Well, you are not alone. Time and again, I have also witnessed a similar spirit in the Indian Parliament. ” India’s economy is now the   large economy in the world, but jobs are not being created at anywhere close to the pace needed to employ the roughly one million Indians who come of age each month. Mr. Modi also touched on the issue of climate change in his speech, but subtly reinforced the point that the willingness of India  —   the world’s   carbon emitter  —   to cut its own pollution will depend on help from the United States. “The protection of the environment and caring of the planet is central to our vision of a just world,” he said, adding, “for us in India to live in harmony with mother earth is part of our ancient beliefs. ” But, he said, “Our partnership aims to balance responsibility and capacity and focuses on new ways to increase availability of renewable energy. ” Mr. Modi has vowed to sharply increase the growth of solar power in India, but Indian diplomats have also pushed for commitments from the United States to make new solar power technologies available as cheaply as possible, either by waiving intellectual property fees or by providing favorable financing. “This has been the goal of our efforts in G20 and climate change summits,” Mr. Modi said, to a mixed ovation  —   lawmakers on the Democratic side of the aisle stood and clapped, while those on the Republican side mostly stayed seated. Mr. Modi was forceful in his condemnation of global terrorism, a subject he dwelt on at length. “Not just in Afghanistan but elsewhere in South Asia and globally, terrorism remains the biggest threat,” he said, adding in a clear reference to Pakistan: “Although its shadow is spreading across the world, it is incubated in India’s neighborhood. ” India’s long rivalry with Pakistan has meant that India has been a target of terror attacks funded and encouraged by Pakistan, most famously in the Mumbai terror attacks of 2008. Some members of Congress have criticized Mr. Modi’s human rights record, but the politics of a visit by an Indian leader have also changed. Before Mr. Modi spoke, the House speaker, Paul D. Ryan, and Vice President Joseph R. Biden Jr. announced more than a dozen members of Congress who were said to be escorting Mr. Modi into the chamber. There are 3. 5 million   and they are a highly successful immigrant group with both wealth and deep community connections, making them sought after by politicians. In just one example, some 40 percent of hotel rooms in the United States are owned or managed by   according to Arun K. Singh, India’s ambassador to the United States.'"}, "time": 1742564607.5639808}