{"duration": 0.07118749618530273, "input_args": {"text": "'Rajoy aparece en un Delorean para llevar a los españoles una hora atrás en el tiempo \"DEBEMOS VIAJAR AL PASADO PARA RESTABLECER EL EQUILIBRIO\", HA DICHO viajes en el tiempo \\nGritando que no hay tiempo que perder y que todos los españoles deben desplazarse al pasado, el recién investido Presidente del Gobierno, Mariano Rajoy, ha irrumpido en la madrileña Puerta del Sol montado en un coche marca Delorean al que ha animado a subir a todo el mundo, según han explicado varios testigos. Su aparición ha tenido lugar a las 2:55 de la madrugada. \\nEn cinco minutos, según el Gobierno, todos los españoles deberán subir al coche del presidente a fin de poder viajar al pasado y poder llevar a cabo el cambio de hora anual que debe efectuarse hoy. \\n“¡Rápido, subid, no hay tiempo para explicaciones!”, ha gritado Rajoy, según las fuentes. \\nDespeinado y con más tics nerviosos de lo habitual, Rajoy se ha mostrado muy agitado, han explicado los testigos. Al parecer, se le veía desorientado y pronunciando frases inconexas como “Rápido, se va a cerrar el agujero de gusano”. \\nEl Gobierno también advierte que una vez todos los españoles se hayan desplazado al pasado “es absolutamente imprescindible que nadie toque nada”. Si un español se encuentra consigo mismo en el pasado “es conveniente evitar el encuentro” y es imprescindible no advertir a nadie sobre lo que ya sabemos del futuro “especialmente el hecho de que Rajoy al final ha sido investido”. \\nRajoy ha configurado su máquina del tiempo para viajar tan sólo una hora, a las dos de la mañana, pero ya ha advertido que “no soy mucho ni de twitter ni de máquinas del tiempo y no prometo nada”. \\n“Soy el Dr. Mariano Rajoy. Estoy en el estacionamiento del Centro Comercial Bazar Amigo. Es sábado, 29 de octubre de 2016. 2:58 a.m. Este es el experimento temporal número uno”, ha declarado Rajoy, grabadora en mano. \\nFinalmente, el político ha señalado boquiabierto al reloj de la plaza: las manecillas se movían hacia atrás por el cambio de hora. “¡Salven el reloj de la torre! ¡Salven el reloj de la torre!”, ha gritado Rajoy temiendo que el icónico reloj de Puerta del Sol estuviera estropeado, según los presentes. \\nCuando las manecillas han marcado de nuevo las 02:00 a.m., Rajoy ha vuelto a bajar del Delorean, eufórico, gritando: “¡Lo he conseguido! ¡Lo he conseguido!”. Siempre según los testigos, ha agarrado a Dora la Exploradora por la pechera de su disfraz, y le ha preguntado: “Dime, joven del futuro: ¿Quién es el Presidente del futuro?”. Cuando Dora le ha respondido “Mariano Rajoy”, éste ha reído, sorprendido: “¿Rajoy? ¿El registrador de la propiedad? ¿Y quién es Vicepresidente? ¿Una mujer?”.'"}, "time": 1742561990.111784}