{"duration": 0.10045742988586426, "input_args": {"text": "'Audio-Slideshows Kunst am Werk: Wie UralMasch zur Bilder-Galerie wurde Der Ural und die Schwerindustrie sind seit Urzeiten untrennbar miteinander verbunden. Bis heute ist die Region so etwas wie Russlands Ruhrpott. Doch die Zeiten ändern sich. Die Kunst hält Einzug in stillgelegte Industriegebiete – wie etwa in die gigantischen Werkshallen von UralMasch. Einst war der Maschinenbauer das Flaggschiff der Sowjetindustrie. Heute ist es ein Eldorado für Künstler und Kreative. Scrollen Sie nach unten um mehr zu sehen Denis Tarasov Von den späten Sechziger- bis in die Neunzigerjahre arbeitete bei UralMasch ein gewisser Gennadij Wlassow. Geboren wurde Wlassow 1943 in Swerdlowsk – heute Jekaterinburg, Hauptstadt der Ural-Region. Denis Tarasov 1961 absolvierte er die UralMasch-Handelsschule und wurde beim Maschinenbauer übernommen. Sein Verantwortungsbereich war die interne Unternehmenskommunikation: Er schrieb Wandzeitungen, entwarf Slogans und zeichnete informativ-satirische Poster. Denis Tarasov In den Achtzigern entdeckte er ein neues Format, um den Industrie-Alltag der Belegschaft zu verschönern: Er fing an, Landschaftsbilder berühmter russischer Künstler auf den Werkzeugspinden in den Werkshallen nachzumalen. Denis Tarasov Unter den berühmten Werken, die er kopierte, war zum Beispiel das „Mädchen mit dem Tragejoch“ und die „Heuernte“ von Arkadij Plastow. Der Sowjetkünstler stellte Alltagsszenen aus dem Dorfleben im Stil des sozialistischen Realismus dar. Zugleich entwarf Wlassow auch Eigenkreationen. Denis Tarasov Irgendwann fingen die UralMasch-Arbeiter an, sich bestimmte Motive für die Werkzeugboxen auszusuchen. Meist waren das Naturlandschaften – in der Spätphase der Industrialisierung war die Kunst eine Möglichkeit aus dem grauen Fabrikalltag auszubrechen. Denis Tarasov Bis heute wirken die malerischen Landschaften wie ein frischer Windzug durch das Riesenreich gewaltiger Maschinen, die zum Schweigen verdammt sind. Denis Tarasov Vor wenigen Jahren tauchten einige dieser Bilder im Internet auf und fielen einer Gruppe von Galeristen ins Auge. Die Liebhaber zeitgenössischer Kunst hatten Wlassows Spinde in ein Projekt verwandelt, das sie im Rahmen einer Biennale in Jekaterinburg vorstellten. Denis Tarasov Die Werkzeugspinde sind ein Beispiel dafür, wie alltägliche Gegenstände zu Kunst werden können, sobald sie in Szene gesetzt sind. Denis Tarasov „Wir waren jahrelang hier und haben uns an den Bildern sattgesehen“, lachen ehemalige UralMasch-Mitarbeiter beim Anblick einer Gruppe, die die Wlassow-Ausstellung besucht. Denis Tarasov Wobei „Ausstellung“ leicht übertrieben ist: Außer dass Kuratoren, Kunstkritiker und Journalisten vorbeikommen, hat sich in den Werkshallen nichts verändert. Facebook'"}, "time": 1742564615.5944624}