{"duration": 0.0215299129486084, "input_args": {"text": "'Representative Steve King, Republican of Iowa, questioned the historical contributions of nonwhite “subgroups” during an appearance on MSNBC on Monday, igniting swift backlash online. Mr. King spoke during a panel discussion, led by the MSNBC host Chris Hayes, about the racial makeup of the Republican Party on the first day of the party’s convention. “If you’re really optimistic, you can say this was the last time that old white people would command the Republican Party’s attention, its platform, its public face,” Charles P. Pierce, a writer at large at Esquire magazine, said during the panel discussion. In response, Mr. King said: “This whole ‘old white people’ business does get a little tired, Charlie. I’d ask you to go back through history and figure out where are these contributions that have been made by these other categories of people that you are talking about? Where did any other subgroup of people contribute more to civilization?” “Than white people?” Mr. Hayes asked. Mr. King responded: “Than Western civilization itself that’s rooted in Western Europe, Eastern Europe and the United States of America, and every place where the footprint of Christianity settled the world. That’s all of Western civilization. ” Frantic yelling ensued, with the panelists speaking over one another. “What about Africa? What about Asia?” April Ryan, a reporter on the panel, said. “We’re not going to argue the history of civilization,” Mr. Hayes said. “Let me note for the record that if you’re looking at the ledger of Western civilization, for every flourishing democracy you’ve got Hitler and Stalin as well. So there’s a lot on both sides. ” Some Twitter users said Mr. Hayes should have allowed a response instead of going to a commercial break, and he said on Twitter that they might have a point. Mr. King, who was first elected to Congress in 2002, did not immediately return a message seeking comment. In 2013, he attracted criticism after saying that for every child of illegal immigrants “who’s a valedictorian, there’s another 100 out there who weigh 130 pounds and they’ve got calves the size of cantaloupes because they’re hauling 75 pounds of marijuana across the desert. ” In June, he moved to block an effort to put Harriet Tubman, the abolitionist, on the $20 bill. On Twitter, Ms. Ryan called Mr. King “mentally stunted” and said she had wanted to respond but had not been able to get her word in. “Steve King you need to learn about race and contributions by other societies in this country,” she tweeted. Other Twitter users quickly attacked Mr. King for the comments.'"}, "time": 1742628545.366911}