{"duration": 0.1346287727355957, "input_args": {"text": "\"People over profits The Ease of Doing Halloween à la Russe \\nThe West's biggest monster this Halloween is Russia, but behind the mask the country is doing absolutely fine Print The author is Chairman, Disciplinary Committee, National Association of Corporate Directors, Russia \\nOver the past few years I have had various views levelled at me by my fellow citizens such as “You are an apologist for Russia!”, “Putin and his circle are mass murderers”, “you are now blind to the truth!” and so on. I get such statements mostly long distance through the internet from the States and some cases the EU. It is understandable given that bad news sells news, and objective deep investigative reporting by professionals appears relegated to selective interests mostly in the blogosphere. As I live and work in this “nasty, criminal Russia” and am concerned for my family’s welfare, I am more than interested to get the facts on what is happening around us and where we are heading. My sources of information like most people comes from friends, neighbors, work acquaintances, colleagues and of course the global media. A potpourri of opinions, much accusatory noise, so where in this hubbub lurk simple evidential truths? As it is now Halloween, I thought it only appropriate to wheel out the ever-popular ghoulish Russian monster and the attendant gaggle of batty tricky gremlin familiars from Siberian wastes. I do this to pay homage to one of my favorite holidays with the help of such “evildoers” as a backdrop. I invite you to have a look into this fiery pit of horrors, it may entice you re-examine your views, question, and set you on the course to establish your business in Russia! Hhmmmm… trick or treat? Although statistics and rankings tend to overlook fundamental differences in what drives economic progress, or from what starting point one or another nation had to contend with, nonetheless the wicked witch of the west and her legions of LaGardettes have researched some interesting views, namely: The World Bank, Ease of Doing Business Rankings ( http://www.doingbusiness.org/data ). To be fair, I thought a ten-year slice would be sufficient to compare and contrast Russia against the rest of BRICS and the USA, so 2006 through 2016 it is, otherwise Russia’s Government guided by “Count Vlad the Bad” would look even more horrifying. Ease of Doing Business Rankings (World Bank) Countries Rank 2006 Rank 2016 Brazil 119 123 United States 3 8 (Note: The higher the number, the more difficult to do business). What the above indicates to me is that there are general trends becoming apparent, in all cases except Russia and China the ease of conducting business is becoming comparatively harder. Each of the six countries listed above have an individually complex bouquet of internal and external specifics that make direct comparisons almost meaningless, however what is common are overall directions based on common metrics. I would recommend going to the world bank website mentioned earlier as it breaks down the components leading to these overall rankings, which if you are an aficionado of economics and history is an invaluable additional overlay to any reasoned geopolitical assessments of our world. Russia is paternalistic, steeped in a black miasmic lagoon of traditions long since abandoned by our innovative world, stifling development, basic freedoms, and even repressing women! Back home, the issue of women’s rights is vital, newsworthy, of vast political import – it can and does titillate the electorate in many ways both subjective and objective as witnessed in these 2016 elections. Russia on the other hand, popularly prejudged an outcast country, feels it has little to shout about or act on concerning women. This aside from the fact that they are in the main warm, intelligent, competent and stunningly beautiful – fodder for male sexist fantasies. I was horrified to learn that Russia (almost like Don Trump) perniciously tops the list of countries with the highest number of female board members, and that at least 45 percent of senior management positions across its nine time zones are held by women. This evolved without quotas, Hillary Clinton, or any extraordinary outside pressures, which really disappoints me. The pragmatic characteristics of Russians tend to value the actions a person chooses to make, rather than rhetoric and show. In this context, the traditionally developing values and roles between women and men seem naturally to be doing fine. Whistling in appreciation of a woman passing on the street is not insulting; it is what it is, a compliment, pleasure, a bravo between strangers, and a positive normal interaction. Cultural preferences can be hard mistresses to live and work with, no doubt. What Halloween would be complete without including the most odious, shuddersome monster of all? Who else but Vladimir Putin, or “Count Vlad the Bad” as Washington and Brussels like to paint him. His background is frighteningly direct given the infamy he gets. Serving as a KGB analyst for much of his career in East Germany when the wall came down. Moving back to St. Petersburg with his family he worked advising the then mayor on foreign affairs. He resigned from the KGB and progressed within the political administration of the mayor’s office coordinating relations with the military, police, district attorney, customs officials, and other city related diplomatic matters. Considered by those who knew him then as a progressive and talented manager who played a key role attracting a number of Western corporations to the city. He pushed for and directly assisted enabling a great many of joint ventures with foreign companies, establishing a large foreign banking presence, legalizing sale of land that allowed privatization of residential properties, opening the international trade center, strengthening municipal and regional banks. He earned a good reputation within the foreign business community of being an open, practical, ethical man who to the amazement of many, and contrary to the norms of those times did not ask for or accept bribes. Seen by colleagues in Moscow as objective, disciplined and capable was therefore invited into president Yeltsin’s administration where he advanced to the level of prime minister. On New Year’s Eve in 2000, he became acting president, a Yeltsin parting gift to Russia. Count Vlad it seems takes his task of representing Russia’s national interests seriously as evidenced everywhere one looks today inside this monstrous, politically incorrect federation. Russia to be seen as a successful country, particularly in spite of doing so in ways not answerable to the west, does not seem to play well with the leaders in the US and EU. The record of accomplishment of the Russian administration is chilling, the citizenry saw their incomes rise many fold, the poverty rate was halved, consistent economic growth, flat income tax, and a country safe to live in. Unlikely as it may sound coming from this authoritarian hellhole of a country, it has one of the highest rates of education in the world with 54% of Russians having college degrees. Legally mandated paid maternity leave for women, and a payment made directly to the mother on giving birth of a second child of 450,000 rubles (up from 250,000 due to effects of US/EU sanctions). Healthcare is improving steadily as is life expectancy, which has steadily risen to 71 (from a deep dark abyss) and is still rising. All this without Tories, Labor, GOP, Democratic Party, EU a la Brussels, or other “democratic brands” and popular models currently on sale – just the government of the Russian Federation. Frightening! Have a fun and reflectively chilling Halloween!\""}, "time": 1742562131.875264}