{"duration": 0.03639674186706543, "input_args": {"text": "'Ausbildung französischer Soldaten in der Führung von Daesch Voltaire Netzwerk | 26. Oktober 2016 français Español italiano Am 22. September 2016 sahen Arbeiter bei der Reinigung der Umgebung einer verlassenen Höhlenunterkunft nahe der Kirche Saint-Florent an der Ausfahrt von Saumur (Frankreich) drei Männer, die überstürzt in einem weißen Lieferwagen flohen. Als sie in die Grotte eindrangen, entdeckten sie Videomaterial, einen Generator, Zeitschriften in arabischer Sprache und die Fahnen von Daesch.\\nBei der Beschwichtigung der Aufregung in der Bevölkerung, bei der Polizei und Gendarmerie und dem Unterpräfekten erklärte Arnaud Nicolazo de Barmon, der Kommandant der Militärschulen von Saumur, dass es sich nicht um Terroristen handele, sondern um eine Übung des teilstreitkräfteübergreifenden Zentrums für die nukleare, radiologische, biologische und chemische Verteidigung (CIA NBCR).\\nWenn dies mitten im Ausnahmezustand der Fall war, hat die CIA NBCR gegen die Vorschriften zur Bekanntmachung dieser Übung vor ihrer Durchführung bei verschiedenen Kommunalbehörden verstoßen. Darüber hinaus ist nicht einsichtig, inwiefern dieses Material irgendeinen Nutzen für Übungen zur nuklearen, radiologischen, biologischen und chemischen Gefahrenabwehr haben sollte.\\nIn denselben Räumlichkeiten der CIA NBCR in Saumur befinden sich Schulen, die auf Nachrichtendienste und das Gefecht der Verbundenen Waffen spezialisiert sind.\\nSeit Beginn der Ereignisse in Syrien 2011 ist dort die Anwesenheit französischer Streitkräfte nachgewiesen. 2012 waren 19 französische Soldaten, die gefangen genommen worden waren, an der libanesischen Grenze dem Generalstabschef der Streitkräfte, Édouard Guillaud, zusammen mit anderen Soldaten, die dem Islamische Emirat von Baba Amr zugeordnet waren, übergeben worden. Der Tod von französischen Soldaten in Begleitung islamistischer Truppen ist an vielen Orten bescheinigt worden, besonders 2013 in Sanayeh. Obwohl Frankreich 2014 al-Qaida gegen Daesch unterstützt hat, wurde 2016 die Anwesenheit französischer Offiziere im Kalifat von mehreren Zeugen bestätigt.\\nIm November 2014 gab das Pentagon bekannt, in Samarda einen Agenten des französischen Auslandsnachrichtendienst (DGSE), David Drugeon, der innnerhalb der al-Qaida arbeitete, getötet zu haben, während das französische Verteidigungsministerium jede Verbindung zu dem Opfer dementierte. Im Anschluss bestätigte die US-amerikanische Presse, David Drugeon habe Mohamed Mera (Attentat von Toulouse und von Montauban) und die Brüder Kouachi (Attentat gegen Charlie Hebdo ) ausgebildet.\\nFrankreich hat sich nie offiziell dazu bekannt, Soldaten auf syrischem Boden zu haben, obwohl es zugegeben hat, dort ein gemeinsames Hauptquartier mit verbündeten Spezialkräften zu unterhalten.\\nÜbersetzung\\nSabine'"}, "time": 1742562651.4091282}