{"duration": 0.05886483192443848, "input_args": {"text": "'A large cache of documents hacked from French Presidential Candidate Emmanuel Macron’s campaigning team have been dumped on the internet, with just hours to go until polling opens in the final round of voting. [The information includes genuine staffers’ personal and professional emails as well as campaign finance material and contracts, all of which were taken by anonymous hackers some weeks ago, Macron’s En Marche movement confirmed in a statement.  However, they added that false documents had been mixed in to the file dump to “seed doubt and disinformation. ” Staffers said they would “take all measures” to uncover what happened. The incident is embarrassing for the campaign, which had previously denied reports that staff emails had been hacked. They were also unable to point out which documents were false. Links to the documents were posted to the internet chat site 4Chan shortly before midnight in France, just as the Presidential election entered a mandated media blackout. Traditionally no public discussion of the election takes place on the eve of polling day, nor on the day itself, to give voters time to make their own assessment of the campaign and vote accordingly. Consequently, Macron rival Marine Le Pen’s campaign team were unable to comment formally on the leak. However, Florian Philippot, one of Le Pen’s main advisors, asked in a tweet, “Will the #Macronleaks teach us something that investigative journalism deliberately buried?” He added “[I] fear democracy is wrecked”. Les #Macronleaks   des choses que le journalisme d’investigation a délibérément tues ? Effrayant ce naufrage démocratique.  —   Florian Philippot (@f_philippot) May 5, 2017,  France’s electoral commission moved quickly following the release of the documents to issue guidelines asking French media to refrain from covering the leaks. “Free and fair elections are at play,” a statement said, adding that penalties for rebroadcasting forged documents could include criminal charges. It also confirmed that it will be holding a meeting early Saturday to address the hack and leak. The incident arose just hours after the commission confirmed in a separate statement that it had called on the Interior Ministry to investigate claims by the Le Pen campaign that ballot papers nationwide are being tampered with nationwide, to the benefit of Macron,  The Le Pen campaign said electoral administrators in several regions who receive ballot papers for both candidates have found the Le Pen ballot “systematically torn up. ”  '"}, "time": 1742561857.8884218}