{"duration": 0.08140182495117188, "input_args": {"text": "'Last week, California Governor Jerry Brown unveiled his May revisions to the state budget proposal he rolled out in January. Buried deep among billions of dollars in proposed new spending are millions of dollars for the state to provide criminal defense for illegal immigrants in California who are facing deportation to their home country by our own federal government. [Apparently the governor is proposing to put taxpayer money where his mouth is, following up on his bold statement last January in his State of the State speech to the California legislature: “Let me be clear: We will defend everybody  —   every man, woman and child  —   who has come here for a better life and has contributed to the   of our state. ”  It is certainly controversial, to say the least, for a state government, within the United States, to start providing taxpayer dollars to fight efforts by the United States to deport people who have entered the country, or overstayed their visas, in violation of the law. To find this controversial spending proposal, just in the summary document of the budget, you have to comb through to the Department of Social Services section, and then read all of the way through to page 38, in the Health and Human Services subsection  —   where you find under “Immigration Services” an increase of $15 million to $30 million “to further expand the availability of legal services for people seeking, “  …    deportation defense  …    ”. President Donald Trump ran and was elected on a platform of cracking down on illegal immigration. Trump’s Attorney General, former Senator Jeff Sessions ( ) has been carrying out the President’s promises by focusing federal law enforcement resources on cracking down on illegal immigration. The Trump administration’s focus on this issue, conversely, has been a rallying cry for the progressive Democrats that control the levers of political power in California. Legislation authored by State Senate President pro Tem Kevin De León (  Angeles) to make California a “sanctuary state” is rapidly advancing through the legislative process. In addition, the state legislature has produced stinging   resolutions. Last week, it was announced that the California legislature extended a controversial contract for former   Attorney General Eric Holder and his law firm, at $25, 000 per month, focused on taking an aggressive posture against the Trump administration. Sacramento Democrats are not the first to engage in this very aggressive funding of efforts to stymie federal immigration enforcement. Several large cities around California with Democratic mayors and city councils have already entered into this space. Last December, Los Angeles Mayor Eric Garcetti announced the creation of the “L. A. Justice Fund” to include $5 million in taxpayer funds, saying that the city would fight for and, “  …    reach out to people who are American by every measure except the papers they hold  …    ”. (Earlier this year, the Los Angeles City Council also unanimously passed a resolution calling on the President to be impeached.) In February, San Francisco Mayor Ed Lee allowed the city’s Public Defender’s Office to use more than $200, 000 in savings from the city’s budget to hire additional staff attorneys for the defense of illegal immigrants facing deportation. Most recently, earlier this month, at the request of Sacramento Mayor Darrell Steinberg, the city council of California’s capital voted unanimously to make $300, 000 of city funds available to assist a network of legal, education and   groups help illegal immigrants facing deportation. In yet another example of the high priority that Governor Brown places in “taking on” the policies of the federal government and President Trump, he has also proposed increasing the budget of California Attorney General Xavier Becerra to support a stream of lawsuits challenging executive orders of the President. The revision to the Attorney General’s budget includes funding for 19 attorneys and 12 other staff members. There is no doubt that Democrats in California are on the “tip of the spear” in taking on the policies and directives of the newly elected Republican president. Frankly, in and of itself, that is not so surprising. But what is controversial to say the least is the fact that tens of millions of dollars are being spent, so far, by the State of California and some of the state’s largest cities to  wage public relations and legal battles against the federal government.  —   —    Jon Fleischman is the Politics Editor for Breitbart California. His columns appear regularly on this page. Jon has been chronicling public policy and politics in the Golden State for nearly three decades. You can follow him on Twitter here.'"}, "time": 1742564216.7553093}