{"duration": 0.0888829231262207, "input_args": {"text": "'WASHINGTON  —   Former Senator Bob Dole, acting as a foreign agent for the government of Taiwan, worked behind the scenes over the past six months to establish   contact between Taiwanese officials and   Donald J. Trump’s staff, an outreach effort that culminated last week in an unorthodox telephone call between Mr. Trump and Taiwan’s president. Mr. Dole, a lobbyist with the Washington law firm Alston  Bird, coordinated with Mr. Trump’s campaign and the transition team to set up a series of meetings between Mr. Trump’s advisers and officials in Taiwan, according to disclosure documents filed last week with the Justice Department. Mr. Dole also assisted in successful efforts by Taiwan to include language favorable to it in the Republican Party platform, according to the documents. Mr. Dole’s firm received $140, 000 from May to October for the work, the forms said. The disclosures suggest that   Trump’s decision to take a call from the president of Taiwan, Tsai   was less a   diplomatic gaffe and more the result of a   plan by Taiwan to use the election of a new president to deepen its relationship with the United States  —   with an assist from a seasoned lobbyist well versed in the machinery of Washington. “They’re very optimistic,” Mr. Dole said of the Taiwanese in an interview on Tuesday. “They see a new president, a Republican, and they’d like to develop a closer relationship. ” The United States’ One China policy is nearly four decades old, Mr. Dole said, referring to the policy established in 1979 that denies Taiwan official diplomatic recognition but maintains close contacts, promoting Taiwan’s democracy and selling it advanced military equipment. The phone call between Mr. Trump and Ms. Tsai was a striking break from nearly four decades of diplomatic practice and threatened to precipitate a major rift with China, which admonished Mr. Trump in a   editorial in the overseas edition of People’s Daily. The disclosure documents were submitted before the call took place and made no mention of it. But Mr. Dole, 93, a former Senate majority leader from Kansas, said he had worked with transition officials to facilitate the conversation. “It’s fair to say that we had some influence,” he said. “When you represent a client and they make requests, you’re supposed to respond. ” Officials on Mr. Trump’s transition team did not respond to requests for comment. The documents suggest that Mr. Dole helped the government of Taiwan establish early access to Mr. Trump’s inner circle during the campaign, when Mr. Dole worked to involve Mr. Trump’s aides in a United States delegation to Taiwan and to facilitate a Taiwanese delegation to the Republican National Convention in Cleveland in July. The effort has continued in the weeks since the election, with Mr. Dole on Tuesday saying he was trying to fulfill a request from a special envoy from Taiwan who was visiting Washington to see Reince Priebus, tapped by Mr. Trump to be White House chief of staff, and Newt Gingrich, who is close to the  . (The Priebus meeting, Mr. Dole said, would most likely have to wait until Mr. Trump is inaugurated.) Mr. Dole, the only former Republican presidential nominee to endorse Mr. Trump, arranged a meeting between Senator Jeff Sessions, Republican of Alabama, whom Mr. Trump has chosen to be his attorney general, and Stanley Kao, Taiwan’s envoy to the United States, and convened a meeting between Taiwanese officials and Mr. Trump’s transition team, the documents say. Mr. Dole, who said he first took an interest in Taiwan as a senator when Congress was considering the 1979 Taiwan Relations Act that established the current policy, has lobbied for the Taiwanese government for nearly two decades. In a letter in January, Mr. Dole laid out the terms of his agreement to represent the Taipei Economic and Cultural Representative Office in the United States, Taiwan’s unofficial embassy, including a $25, 000 monthly retainer. That letter and the document detailing Mr. Dole’s work for the Taiwanese were filed at the Justice Department, which requires foreign agents to register and detail their efforts at influencing the United States government. Among his duties, the letter said, were helping Taiwan achieve its “military goals” and obtain membership in the   Partnership, the   trade deal that Mr. Trump has promised to withdraw from. Mr. Dole was also to arrange for Taiwanese officials to meet with members of Congress from both parties and arrange access to Republican presidential contenders and to the party’s national convention. The government of Taiwan has retained a powerful bipartisan constellation of former members of Congress to promote its interests in Washington. Richard A. Gephardt, a Missouri Democrat and former House majority leader, also signed a $   contract to represent the Taipei office this year, as did Thomas A. Daschle, Democrat of South Dakota, a former Senate majority leader, in 2015. Mr. Trump’s transition team has sent mixed messages about the call with Ms. Tsai, whether it was meant as a mere gesture of good will or a provocation aimed at drawing Taiwan closer to the United States as a way of challenging China, which considers Taiwan a breakaway province. Vice   Mike Pence suggested in the days after the call that Mr. Trump had merely been affording a courtesy to another “democratically elected leader. ” But in a series of Twitter posts on Sunday, Mr. Trump suggested a more confrontational motive, criticizing China for unfair trade practices and aggressive military moves. “Did China ask us if it was OK” to take such actions, Mr. Trump asked rhetorically, appearing to counter suggestions that the United States must ask Beijing’s permission to communicate with Taiwan. Several senior advisers to Mr. Trump have long advocated stronger United States support for Taiwan, arguing that it would help to counterbalance Beijing’s influence. Alexander Grey and Peter Navarro, Trump transition advisers, wrote an article last month in Foreign Policy branding the Obama administration’s treatment of Taiwan “egregious. ” Over the weekend, Taiwan’s official Central News Agency said that Edward J. Feulner, a member of Mr. Trump’s transition team and the former president of the Heritage Foundation, a conservative think tank that supports stronger ties with Taiwan, had played a crucial role in bringing about the call with Mr. Trump. Mr. Feulner met with Ms. Tsai in Taiwan in October. Even before the phone call, Taiwan had succeeded in accomplishing important goals with Mr. Trump’s team. At their convention in Cleveland in July, Republicans adopted a platform that for the first time enshrined the “six assurances” to Taiwan made by President Ronald Reagan in 1982, including that the United States would not set a date for ending arms sales to the Taiwanese.'"}, "time": 1742562450.573872}