{"duration": 0.017005205154418945, "input_args": {"text": "'Posted on November 7, 2016 He goes to school full-time and works three part-time jobs, but running this pantry is important to him. Credit: Justin Franks \\nWhat started as a simple act of kindness has since exploded into a movement that some students rely on at a college in Alabama. Justin Franks, a 20-year-old student at Alabama A&M University, first noticed that some students in his dorm building were going to bed hungry. \\n“They didn’t have any food,” Franks told ABC News. “The cafeteria here closes pretty early, and a lot of students here don’t have the money to go outside of campus to eat. I wanted to cater to those students.” \\nFranks spent $40 of his own money to build up a stock of instant noodles, Capri Suns, and a few household items, such as tissues and bottled waters. He planned to share his stash with those few in need, and decided to share the news of his small stash on Facebook. His post reached over 600 shares, and word spread like wildfire. \\n“I didn’t think it would get shared that much, but people really cared about our students and Alabama A&M University,” Franks told WHNT News 19. Credit: Fox 5 \\nSoon after, donations for the food and basics pantry started rolling in to help fund Franks’ small operation. He has since moved the pantry to an old mail room in his dorm’s building. It’s open from 6pm to 11pm, just after the cafeteria closes and into the evening in case late-night studiers need a pick-me-up. \\nThe pantry also includes bigger basic items, such as toilet paper, deodorant, and toothpaste, along with the dozens of non-perishable food items. It’s run just like a regular pantry, where students can come in twice a week and take up to three items. Franks is even training someone else to take over so that the pantry can continue long after he graduates. Credit: Justin Franks \\nThe full-time student who works three part-time jobs takes this job seriously as well, and has already helped over 100 students. He told ABC News, \\n“‘Service Is Sovereignty’ is our school’s motto and I want to live up to that. I’m hoping that we can keep expanding the pantry and that it’ll continue for years to come.” \\nIt might be a small gesture but it’s helping these students in this small way that can help them get through one of the most challenging years of their life. \\nWhat are your thoughts on this news?   College Student Runs Food Pantry Out Of His Dorm To Help His Schoolmates  '"}, "time": 1742628492.13128}