{"duration": 0.0427398681640625, "input_args": {"text": "'Hispanic Crowd Boos Marco Rubio off Stage Rafael Bernal, The Hill, October 25, 2016 \\nSen. Marco Rubio (R-Fla.) took the stage in Orlando at Calle Orange, a Puerto Rican-themed festival, on Sunday when some in the crowd started booing, NPR reported . \\nThe jeering got louder as the Cuban-American senator, seeking reelection after dropping his presidential bid earlier this year, was introduced. \\nAnd when the emcee asked for applause as Rubio took the same, boos drowned out any supporters in the crowd, NPR added. \\n“Thank you for having me today,” Rubio said in Spanish. “I want you to enjoy this day. We’re not going to talk about politics today. Thank God for this beautiful day, and for our freedom, our democracy, our vote, and our country. God bless you all, thank you very much.” \\nHe left the stage to more boos from the crowd, according to the report. \\n{snip} \\nRubio is running against Rep. Patrick Murphy (D), and the latest average of polls in the race shows Rubio ahead by about 3 points. \\nMurphy’s campaign seized on the Sunday incident and blasted out video it says shows the booing. It also noted that Murphy attended the festival “with a leader for Puerto Rican communities, Rep. Nydia Velazquez,” while “Marco Rubio was booed off the stage.” \\nRubio’s campaign shared a video with The Hill Monday that it says counters what the Murphy campaign sent out and shows him being greeted enthusiastically as he moves through the crowd. \\n{snip} \\nFestival attendants said they disapproved of Rubio’s endorsement of Trump, who is deeply unpopular among Hispanics. \\n“When we have someone like Trump, who hits our Mexican brothers, our Latino brothers, then you jump on that bandwagon after all that stuff he says not only about you personally . . . as a Latino, you’re a freaking sellout. I would not vote for him if they paid me,” Calle Orange attendant Angel Marin told NPR about Rubio. \\n{snip}'"}, "time": 1742561724.17799}