{"duration": 0.09352540969848633, "input_args": {"text": "'The 2016 presidential election has left the country more divided than ever. As many continue to celebrate Donald Trump’s victory, others are fighting their way through the five stages of grief surrounding Hillary Clinton’s defeat and President Obama’s departure. As much as some would wish otherwise, many of the wars that have stormed social media have extended through families and friendships. With Thanksgiving just a couple of days away, people are concerned that opposing voters may find it difficult to enjoy a long meal together. However, politics should not ruin thanksgiving.\\nThere is always at least one person who arrives at the family gathering ready to talk politics and express why their view is the right one. These are the worst kind of guests. Politics should be the uninvited guest to Thanksgiving festivities as people from around the country celebrate the many reasons to be thankful this year. Anyone that brings up politics over Thanksgiving dinner, with an aim of convincing another or adding insult to injury should be dismissed and possibly not invited back.\\nPresident-elect Trump has done many distasteful things throughout the recent campaign, but ruining Thanksgiving should not be one of them. Families work hard to set up the perfect holiday gathering so they can rehash old stories, bond with the newest additions, watch their favorite football team win or lose, and celebrate life over a table filled with favorite foods. Politics should not ruin thanksgiving; instead of a deadly spiral, redirect the conversation back to what really matters.\\nTruth is, without the likes of a tumultuous election season, holidays have the potential to produce large amounts of anxiety. Relatives and friends, near and far, all gathered into one location hashing out competitive family updates can be stressful enough. Add some spiked cider to that mix and it becomes a recipe for a potential holiday meltdown, so there is no need for politics to ruin Thanksgiving dinner.\\nFamilies should remain a family long after Trump takes the Oval Office, so politics should not accompany the turkey at the dinner table. Somewhere down the track, attendees will be split along bipartisan lines. Instead of joining in, why not bow out before blowing up. More than politics, preserving important relationships should be the focal point.\\nPost-election emotions have already complicated life, as many Americans have known it. Navigating Thanksgiving dinner should not be an added stress. As such, many who are already bruised by the election are now dreading what should be an entertaining and eventful family gathering of food and fellowship. This is a time for expressing thanks while making new memories, not overshadowed by the results of a turbulent electoral season.\\nPolitics should not ruin what has been noted as one of America’s favorite holidays. With multiple personalities and beliefs at the dinner table, the only safe way to handle politics at Thanksgiving dinner is by avoiding it. Not only is it neither the time nor the place, but avoidance protects everyone’s health and sanity. The holiday’s intent is to bring people together peacefully and to celebrate this great country’s resiliency and diversity.\\nOpinion by Cherese Jackson (Virginia)\\nSource:\\nMercury News: Families dread holiday after Trump’s election win\\nPhoto Credits:\\nTop Image Courtesy of Bart – Flickr License\\nInline Image Courtesy of Louish Pixel – Flickr License\\nFeatured Image Courtesy of Freaktography – Flickr License family , Holiday , stress , thanksgiving'"}, "time": 1742562829.3803825}