{"duration": 0.05815887451171875, "input_args": {"text": "\"Democratic presidential candidate Hillary Clinton speaks at a rally at Cuyahoga Community College in Cleveland.\\nNo longer able to sit on the sidelines and remain silent about the battle raging in North Dakota over Indigenous rights to clean water and sacred land, Democratic presidential nominee Hillary Clinton released a statement on Thursday about the Dakota Access Pipeline (DAPL) fight—and it says “literally nothing.”\\nThe statement was delivered via email to a handful of Indigenous journalists and news outlets and was said to be in response to a letter that Native leaders had sent to the former secretary of state asking for her help, as the Indigenous water protectors and their allies have faced tanks, militarized police forces, mace, and attack dogs as they’ve stood their ground in protest of the tar sands pipeline.\\nFed-up about her months-long silence , Indigenous youth from the Standing Rock Sioux and other tribes also demonstrated outside Clinton’s campaign headquarters in Brooklyn, New York on Thursday asking for some sort of acknowledgement.\\nBut coming the same day that over 300 police officers in riot gear and armored vehicles—brandishing pepper spray, percussion grenades, sound cannons, and non-lethal shotguns, according to observers— forcibly cleared hundreds of water protectors from the frontline camp recently reclaimed through eminent domain , the response struck many as non-committal and lacking appropriate “outrage.”\\nThe statement from director of coalitions press Xochitl Hinojosa, who oversees Hispanic, black, and women’s media for the Clinton campaign, reads in full:\\nWe received a letter today from representatives of the tribes protesting the construction of the Dakota Access Pipeline. From the beginning of this campaign, Secretary Clinton has been clear that she thinks all voices should be heard and all views considered in federal infrastructure projects. Now, all of the parties involved—including the federal government, the pipeline company and contractors, the state of North Dakota, and the tribes—need to find a path forward that serves the broadest public interest. As that happens, it’s important that on the ground in North Dakota, everyone respects demonstrators’ rights to protest peacefully, and workers’ rights to do their jobs safely.\\n“What a crock,” said Ruth Hopkins, a Dakota-Lakota Sioux writer for Indian Country Today Media Network .\\n“Hillary Clinton managed to make a statement about the Dakota Pipeline that literally says nothing. Literally,” 350.org co-founder Bill McKibben tweeted in response.\\n“Kind of a BS statement by the Clinton camp on #NoDAPL, frankly,” wrote MSNBC host Joy Reid. “The outrage taking place out there cries out for outrage.”\\nOthers noted that the statement “is the most Clinton thing of all times,” as Fairness & Accuracy in Reporting journalist Adam Johnson put it .\\nIn a lengthy Twitter thread , anonymous commentator @ActualFlatticus breaks down what they say is the campaign’s “triangulation” of the protest.\\nIn other words, you're going to protest by our rules. You're going to do it as we tell you. Or you can't protest.\\n— Alan Smithee (@ActualFlatticus) October 28, 2016\\nNo part of this statement is concerned with the safety of the water protectors in any way. But the workers are in danger? How, exactly.\\n— Alan Smithee (@ActualFlatticus) October 28, 2016\\nThe corporations (her donors) have a right to push their pipeline through sacred land (never mentioned). Despite the treaties we made.\\n— Alan Smithee (@ActualFlatticus) October 28, 2016\\nAnd what makes it all so unbelievably offensive? Is we all know Hillary Clinton didn't write this. Not a word. She approves, that's it.\\n— Alan Smithee (@ActualFlatticus) October 28, 2016\""}, "time": 1742563317.5954604}