{"duration": 0.031693220138549805, "input_args": {"text": "'Apparently Michelle hasn’t ruined the kids’ lunches enough already. An example of Michelle Obama’s mandated school lunches \\nFrom Yahoo : Students might notice some changes in the cafeteria when they go back to school in a few weeks. The USDA will announce rules today that require schools to get rid of unhealthy snacks and eliminate students’ exposure to junk food , ABC News has exclusively learned. \\nThe biggest difference this year will be what students see around the school. If a snack, food item or beverage is not healthy enough for a school to sell or serve, it can’t be advertised either. That means no more pictures of soda on vending machines or in the cafeteria. \\nKatie Wilson, USDA deputy under secretary for Food, Nutrition and Consumer Services, said many schools requested these changes. “Education and wellness and advertising to kids about healthier choices [and] that all has to be part of the school environment just like making sure they have pencils and paper and computers,” Wilson said. \\nOne study found that 70 percent of elementary and middle school students see ads for junk food at school and research published earlier this month showed that kids tend to eat more after seeing ads for unhealthy food. Another lovely school lunch \\nSnacks can’t have too many calories or too much sodium, fat or sugar, according to the guidelines for schools . Foods that are “whole grain-rich” or mostly made up of fruits or vegetables are emphasized, and schools are recommended to sell only water, low-fat milk or milk alternatives, or 100 percent fruit or vegetable juice. \\nWilson said 98 percent of schools around the country already meet these standards. Now that the rules are finalized, she said the USDA will continue its efforts to educate parents, communities and school staff about better nutritional food choices. \\nHealthier food in schools is nothing new. Guidelines about healthy school lunches and snacks have been rolling out for several years and are part of First Lady Michelle Obama ’s “Let’s Move” campaign launched in 2010 to fight childhood obesity . \\nDCG'"}, "time": 1742628553.4673553}