{"duration": 0.1042625904083252, "input_args": {"text": "'| November 9, 2016 Be Sociable, Share! \\nBETHLEHEM (Ma’an) — A bill preventing supporters of the Boycott, Divestment, and Sanctions (BDS) movement from entering Israel was authorized on Monday for its first reading in the Israeli parliament, according to Israeli media. \\nAccording to the Jerusalem Post , the interior committee of the Knesset, Israel’s parliament, approved the bill, which was initiated by Knesset Member Yinon Magal from the ultranationalist Home Party, paving the way for the bill to enter its first reading in the Israeli Knesset. \\nThe bill would allow individuals supporting a boycott against Israel to be banned from entering the country. \\nThe BDS movement was founded in July 2005 by a swath of Palestinian civil society as a peaceful movement to restore Palestinian rights in accordance with international law through strategies of boycotting Israeli products and cultural institutions, divesting from companies complicit in violations against Palestinians, and implementing state sanctions against the Israeli government.The move came after several months of Israeli efforts to crack down on the BDS Movement. Israeli Minister of the Interior Aryeh Deri and Minister of Public Security Gilad Erdan announced in August that they were forming a joint task force to “expel and ban the entry of BDS activists” into Israel and the occupied Palestinian territory. \\n“We must not allow BDS activists to enter the state of Israel. This is a necessary step, given the malicious intentions of these activists to delegitimize and spread lies and distortions about the reality in our region,” Erdan was quoted as saying in a statement released at the time, adding that the boycott movement against Israel “must have a price.” \\n“Fighting against Israeli boycotts starts by fighting those who undermine the state of Israel,” Deri also said at the time. \\n“We have a responsibility to do everything possible to crush any boycott and to state clearly that we will not allow the State of Israel to be harmed. Forming the task force is an important step in that direction.” \\nWithout citing any names, the statement estimated that “hundreds” of pro-Palestinian activists and dozens of organizations were currently in Israel “to gather information and use it to boycott Israel, and harm its citizens,” and that the task force would also try to prevent the entrance of activists in the future. \\nThe statement also alleged that BDS activists traveled to the occupied West Bank and East Jerusalem to “incite” Palestinians. \\nThe announcement led to outcry from groups like the International Solidarity Movement (ISM), which believed they were the targets of the newly-formed task force.“Isolation of Palestinians by denying access and/or deporting human rights activists aims to make Palestinian communities already vulnerable and suffering from abuse…even more vulnerable,” ISM said in a statement in response to the plans of forming the task force .“We condemn Israeli suppression of Palestinian nonviolent resistance. This recent attempt to further isolate Palestinians indicates the occupation authorities’ unwillingness to do the only thing that will actually bring an end to Israel’s isolation — to adhere to international law, end the occupation and grant Palestinians their rights.”ISM argued that its foreign activists play a crucial role in trying to prevent Israeli army violence against Palestinians.“As a civilian population living under military occupation Palestinians in the occupied territories are promised protection under International law,” the group said in its statement. “(Foreign) civilians have been attempting to fill in the gap created by the failure of governments and official international bodies to provide protection and fulfill their obligations.“We find that our presence sometimes results in reducing the level of lethal force used by the Israeli military against unarmed Palestinians.”The boycott, divestment, and sanctions (BDS) movement against Israel has gained momentum over the past year, with activists targeting companies that act in compliance with Israel’s illegal occupation of East Jerusalem and the West Bank. \\nIn late July, the Black Lives Matter movement — which denounces police violence against African-Americans in the United States — came out in support of BDS , stating that it was committed to “global struggle, solidarity, and support of the Boycott, Divest and Sanction (BDS) movement to fight for freedom, justice and equality for Palestinian people and to end international support of the occupation.”The Israeli government, meanwhile, has grown increasingly concerned about the growth of the BDS movement, as the movement’s support base has expanded to include companies, universities and religious institutions around the world divesting from organizations complicit in Israel’s violation of Palestinian rights. \\nIn January, the Israeli Knesset held a conference to discuss ways to combat BDS , and dedicated 100 million shekels ($26 million) of the government’s 2016 budget to the issue.In May, Israel issued a travel ban on BDS cofounder Omar Barghouti , a permanent resident in Israel, as Mahmoud Nawajaa, the general coordinator of the Palestinian BDS National Committee, stated at the time that the decision reflected “the lengths [Israel] will go to in order to stop the spread of the non-violent BDS movement for Palestinian freedom, justice and equality.” \\nMore recently, Israel’s Parliament, the Knesset, passed a controversial NGO “transparency bill” into law on July 12 , compelling organizations to reveal their sources of funding if more than half came from public foreign entities — a law which human rights groups and opposition Knesset members condemned for seeking to “silence criticism” of Israel and delegitimize left-wing groups .Opposition leader in the Knesset Isaac Herzog of the Zionist Camp party then slammed the law for “symbolizing the budding fascism that is rising and flourishing in Israeli society” and making a “mockery” of the “right to organize, which is a sacred founding principle of a democratic society.”'"}, "time": 1742562833.0965283}