{"duration": 0.11927938461303711, "input_args": {"text": "\"I'm so tired of all these psychotics babbling anti Trump Propaganda Fucking libtards are completely brainless.I don't like Trump. Never have. Never watched The Apprentice. Turned the channel every time he came on TV. He was like the Khardashians to me. Crass commercialism by a person who was neither talented nor interesting. But. I am sick of all this insane Bullshit. 1. He is not a racist. He has been a public figure for 50 freaking years and nobody ever said that until he runs for President. And we know that they call every Republican racist. So why the fuck are you repeating, it you brainless fucktard? Don't you know propaganda when you hear it?- building a wall and saying SOME Mexicans are criminals IS NOT RACIST. Some Mexicans are criminals. Just look at the Federal Prison stats, idiot.- saying we must ban Muslims UNTIL WE KNOW WHO THEY ARE AND WHY THEY ARE HERE is not racist. There are assholes walking into malls in Minneapolis now screaming 'Allah Ahkbar' as they stab my fellow Americans. They BLEW UP THE FUCKING BOSTON MARATHON. So take that 'Islamaphobia' propaganda and shove it up your fucking ass. - saying 'the mexican judge' who keeps ruling against me in a lawsuit is biased is not racist. The Fucker is part of LaRaza. The law firm that brought the suit is sending other La Raza lawyers into the court to try the case. That is a conflict of interest. And I don't care if the guy was born in fucking Illinois. There are all kind of guys I know, he was born in NY. He is still 'Irish' to me because his family was. Or 'Italian'. Or 'A Jew'. It's just a shorthand, especially used a lot by New Yorkers because everyone is something. 2. The sexual harassment crap is bullshit. The guy has been running for President for over a year. Not a tweet. Not a chirp. Then he whacks that fucking fat-ass midget with the mean streak and the history of documented lying who covered for her whore hopping scumbag husband for 30 years with it all, and suddenly Gloria Allred, A CLINTON DELEGATE TO THE DNC CONVENTION, starts popping up people from left field to make spurious claims out of the ass while CNN, run by MAJOR CLINTON SUPPORTER Zucker, shills for the whole thing. What are you fucking stupid eating that bullshit? You look like an idiot.3. Nuclear Codes. What a bunch of shit. First, Hillary is an old ill woman who has seizures, can't stand up, can't hear, and when she testifies before Congress claims she can't remember anything that happened. So....you are worried about Trump with the Nuclear Codes?Oh, yah, and she was Sect. of State exactly while the US policy in the Middle East went to shit, created ISIS and directly caused the greatest Human disaster since World War II which is now threatening to spread terrrorists all over Europe and the US. AND SHE IS COMPLETELY CLUELESS ABOUT IT. She will tell you that we need to be kind and nice to the religion of peace OR it will Cause Terrorism. Oh Ya? Well Obama did it your way...AND NOW PEOPLE ARE WALKING INTO MALLS IN MINNESOTA SCREAMING 'ALLAH AHKBAR' AS THEY STAB MY FELLOW AMERICANS.So, beside that what do we have? Your propaganda masters used to claim that the Republicans were all anti-gay christian bigots. Well, OBVIOUSLY NOT TRUMP. He is from New York. He bangs models. He used to hangout at Studio 54 in the coke and gay days. He knew Andy Warhol. Guy is middle of the road. Guy went to the Wharton School and has testified before Congress about Money Supply, Credit and Economics. Guy will fill his cabinet with the best people and run things like a CEO. Guy seems to care about Veteran Issues, Social Security and the safety net, healthcare. All the things you fugging libtards are usually all inflamed about. You are like Pavlov's dogs, sitting up on your hinds and barking on commands because your liberal propaganda masters tell you to. You are pathetic. You suck. You are a monumental asshole. Last Edited by Craazee8 on 10/26/2016 02:04 PM\""}, "time": 1742562245.1776614}