{"duration": 0.04376411437988281, "input_args": {"text": "'You are here: Home / US / Difference Between Growing Up In The 1960s Compared To 2016 Difference Between Growing Up In The 1960s Compared To 2016 October 27, 2016 Pinterest \\nSeth Connell reports that in August of this year, campus carry went into effect on Texas’ public college campuses, enabling students and staff with valid concealed handgun licenses to legally carry their firearms. Predictably, leftists freaked out at the idea of people legally carrying firearms in their “safe spaces.” \\nAs we reported back in August, the most famous form of protest on Texas college campuses was “Cocks Not Glocks,” a movement where students who opposed campus carry took adult sex toys with them all across the campus. \\nRelated: Campus Carry Starts Today In Texas; Here’s How Liberal Students Are Protesting… \\nDespite these protestations, campus carry is in effect in Texas, and there is not mass murder happening in dorms, classrooms, or professors’ offices. Who’d have thunk, right? \\nWell, it turns out that “Cocks no Glocks” is not going away any time soon. In fact, they have been invited to The White House as a kind of reward for their childish, bratty temper tantrums. \\nGuns.com reported: \\nOrganizers of an anti-gun protest at the University of Texas in Austin against a new campus carry law noted for garnering some 4,000 adult toys which they gave away, earning immortality on the Daily Show, have made their way to Pennsylvania Avenue. \\nInvited by DoSomething.org to join a gun control advocates to talk to senior officials about grassroots activism, the CNG gang posted images of their visit to the White House to social media– and contend some important firsts were made. \\n“They think it’s the first time ‘dildo’ has been said in the Roosevelt Room in the West Wing,” the group noted on social media. “‘Cocks’ also reverberated around the room dozens of times and Rosie, who was sitting right next to the Oval Office where Obama was sitting 10ft away, could hear his voice through the door. Does that mean he could hear ours?” \\nThe Facebook page for “Cocks Not Glocks” proudly claims that they are “Fighting Absurdity with Absurdity.” Yes, because using sex toys is a perfectly respectable and mature way to establish your credibility, and to show that you are making well-thought out and logical arguments. \\nLadies and gentlemen, this is what the gun control crowd has come to. There is effectively no logic in this kind of protest. It is all fear-mongering and appeal to one of the basest of human passions: sex. \\nThese people are not making any logical or coherent argument. They are lashing out using highly emotionally charged rhetoric and spreading fear. That kind of argumentation is done by demagogues. \\nThis is evidence of the en masse mental enslavement that is happening in public colleges. These students have been trained to think that an inanimate object is evil and has a will of its own, and that the best way to fight that inanimate object is to whine to the point of absolute lunacy. \\nThese people need a dose of reality ASAP.'"}, "time": 1742563023.5606096}