{"duration": 0.04756569862365723, "input_args": {"text": "'CNN host Jake Tapper tells the Hollywood Reporter that his “dream” interview subject is Russian President Vladimir Putin  —   after a dose of sodium thiopental, a drug often depicted as a “truth serum” in fiction. [In a roundtable with four other “top TV broadcasters”  —   ABC’s George Stephanopoulos, NBC’s  Savannah Guthrie, CBS’s Gayle King, and Fox News’s Bret Baier  —   Tapper jokingly hoped that he could uncover real Truth from Putin with the help of barbiturates.  Final question: Who would you most like to interview?   …     TAPPER Are these   or are they sodium pentothal [a trademarked name for the compound] interviews? (Laughter.) I mean, as long as we’re doing a dream [interview] a Putin interview with sodium pentothal would be fantastic. Tapper’s network CNN has doggedly pursued a conspiracy theory that President Trump and his associates are pawns in an international plot led by Putin. CNN was the first outlet to report on a dossier that claimed Russia had gathered blackmail material on Donald Trump before he ran for office, stating that intelligence officers briefed the    on these specific claims. Following CNN’s lead, the advertorial   justice blog BuzzFeed published this unverified dossier in full  —   quite obviously to air claims that Trump has a urine fetish. NBC later quashed CNN’s reporting, writing that the dossier was appended to Trump’s daily intel briefing as an example of “unvetted disinformation. ” Tapper himself appears to be a true believer that Russia “influenced” the 2016 election and displays a very healthy interest in the topic, calling several detractors “Russian trolls. ” Not quite. They indeed testified there was no hacking of voting machines no votes changed.  But influencing the process  —  rather different https:  .   —   Jake Tapper (@jaketapper) March 20, 2017,  Except:1) Comey acknowledged for 1st time that FBI is investigating whether there was any 2016 coordination btwn Trump team  Russian govt https:  .   —   Jake Tapper (@jaketapper) March 20, 2017,  Five months, eight prominent Russians dead  —   CNN https:  .   —   Jake Tapper (@jaketapper) March 25, 2017,  next time tune in to when we’re discussing how your boss Vladimir Putin is responsible for human rights abuses and cyberattacks of US https:  .   —   Jake Tapper (@jaketapper) January 20, 2017,  And how about the deaths of Alexander Litvinenko, Boris Berezovsky,  Boris Nemtsov? Putin or God? https:  .   —   Jake Tapper (@jaketapper) December 15, 2016,  @DCnyrMAGA @CalebHowe @PressSec @CNN cold in Moscow tonight, Comrade?  —   Jake Tapper (@jaketapper) February 10, 2017,  If all these Russian trolls got off Twitter and got to work maybe they’d finally have an economy bigger than Italy’s.  Just a thought. pic. twitter.   —   Jake Tapper (@jaketapper) January 15, 2017,  The Hollywood Reporter roundtable provided little else of interest, aside from Tapper and his peers’ newfound outrage, at the start of a Republican administration, that political flacks try to push spin. Tapper proudly recounts how he tried to make     Mike Pence answer for Mike Flynn Jr’s tweets  —   then says that he would cover “more policy” if given a chance to do 2016 any differently.'"}, "time": 1742563203.992971}