{"duration": 0.05305194854736328, "input_args": {"text": "'As London Bridge terrorist Khuram Shazad Butt’s home in Pakistan is raided, authorities reveal the Islamist had access to tunnels under Parliament. [Sky News reports that Butt, who they say came to Britain with his parents from Pakistan as asylum seekers, worked for Transport for London.  Further reports indicate Butt’s work gave him access to tunnels under the Houses of Parliament from the Westminster Underground Station  —   despite the fact he had been investigated for terror links by MI5 and even been featured on a Channel 4 documentary about   Islamists titled ‘The Jihadis Next Door‘. Pakistani security officials told The Telegraph newspaper that raids on homes and businesses connected to the Butt family were being carried out as a precaution, but that the terrorist was likely radicalised in Britain and trained in Syria. “Our British counterparts told us they don’t think he was radicalised here, and we think it is probably more likely that he was trained in Syria,” one said. “But we are searching the homes of any relatives connected to him and we are tracing all telephone calls made by family members. ” The news comes as Metropolitan Police Assistant Commissioner Mark Rowley declared Britain was now facing a “completely different” level of threat and indicated that current policing and security methods are not equal to the task of containing it. “In nine weeks, we’ve had five plots foiled and three successful attacks. That is completely different to anything we have seen for a long time,” he said. “As the Prime Minister has indicated, we’re going to need to do some things differently. We’re going to have to think again about the next iteration of our police and security service model, which has constantly had to innovate over many decades. ” Regarding Butt, the Assistant Commissioner defended the decision to drop an inquiry into his activities by saying there was “no intelligence to suggest that this attack was being planned”. He added that he expected the authorities “will probably discover information on covert communications that were [not in] our knowledge that if we had access to those communications it may have changed our judgment” suggesting he wants new powers to monitor encrypted messaging services such as WhatsApp.'"}, "time": 1742561958.2862122}