{"duration": 0.19083952903747559, "input_args": {"text": "'  6 Reasons Why You’re Not Happy 6 Reasons Why You’re Not Happy \\nCorey is an aspiring iconoclast. He believes that the key to life is for men to honour their primal nature. \\nLearn more about his views at theprimalmale.com You can also follow him on Twitter . November 7, 2016 Mind \\nHappiness: it’s what we all want as human beings no matter the differences in where we seek them. We are motivated to do things to be happy and we avoid things that may detract from it. Even those who claim that they don’t care about happiness or that they’re living for a higher purpose is doing what they do because it makes them happy. In that way, happiness is beyond a state of feeling; it is a state of being. \\nNow, although you don’t want to be obsessive about happiness and make your life revolve around attaining it, there are few things you can do to live a more fulfilling life and improve the quality of your being. And as it’s often the case with self-improvement, I believe that addressing the bad habits will lead to a healthier life than trying to gain the positives. \\nHere are some ways you may be sabotaging your own happiness. 1. You are chasing it “I’ll be happy once I finally…” \\nThe more you chase happiness, the less you have of it. And not only are people today chasing happiness, they’re chasing all the wrong things in hopes that it will bring them everlasting joy. Money, women, and status may elevate your life, but they can’t be the source of happiness alone. They will especially fail as being compensation for some void in your life that you’re trying to fill. \\nAlso, know that your mood will naturally fluctuate over time. Constantly obsessing over how you feel and getting stressed over your emotional state will not help you. So, rather than jumping from one thing to another in hopes that it will boost your mood or dull your pain, focus on things that matter to you. It’s far better to work on self-improvement and enhancing the overall quality of your life than be wavered by feelings. 2. You don’t have the basics taken care of Good sleep is extremely underrated in our busy society. It affects your mood, testosterone level, mental capacity, and more. Prioritize sleep as much as you do with healthy diet and working out. \\nIt’s often the basics that are overlooked. Ask yourself: Are you sleeping well (it’s harder to tell than you think)? Are you eating healthy? Are you keeping yourself fit? Are you getting enough sunlight? Do you ever take the time to connect with nature? Do you have a stable life? Do you have a purpose or a meaning? I doubt most people have all of these basic needs checked off. But I’m willing to bet that an improvement in even one area will significantly improve a person’s mood and well being. 3. You concern yourself with things you can’t control “No! Something bad is happening in the world and I can’t do jack shit about it! Time to complain about it on the internet.” \\nThe more you sweat over issues which you can take no practical action over, the more helpless you feel and the more unhappy you will be. Of course, being able to tell the difference between what you can control and what you can’t is an art in itself that you need to master through experience. One thing I’m personally doing to lower stress is to reduce my news consumption and be less concerned with events around the world that are irrelevant to my personal life. I’ll read enough to get a general awareness of what’s happening around the world, but I refuse to be emotionally invested in things I have no control over. 4. You lack intimacy and deep human connection If you don’t have any friends to be vulnerable with, you didn’t have any to begin with. \\nI would argue that this is one of the biggest, if not the biggest factor in causing anxiety, depression, and general unhappiness in the modern world. Humans are social creatures and we need to bond with others. And beyond simply spending time with people to chat and drink, deeper connection needs to be made with people. The quality matters much more than the quantity. \\nIn today’s society—especially in North America—it seems people have all become superficial and afraid of intimacy whether it be for friendship or romance. Without opening up your true self due to the fear of being rejected or ridiculed, all the relationships you have with others will not be genuine and it will not be fulfilling. 5. You are not living in the present reality You may be conscious, but are you aware? \\nIf you live in the past or the future, you lose touch with the present reality. That disconnection will cause longing which can only lead to dissatisfaction and loss of joy. \\nThe lure of nostalgia and daydreaming of a better life or an improved world is actually quite insidious because of how intoxicating it is. When your mind drifts to imagining a pleasurable experience or a more exciting life, you are tricked into thinking that the longing is happiness itself, sort of like how mirages work. On the contrary, studies have actually shown that you are actually happier (and more productive) when you focus on what you’re doing right now even if the task is boring. So, stick to the reality and forget about your fantasies. Either make things happen or accept that you’re just wasting your time and energy on wishful thinking. 6. You engage in junk activities “I’m happy, I’m happy, I’m happy…” \\nJust as there are junk foods, there are junk activities that may feel pleasurable at the time but dissatisfying and even harmful in the long-run. \\nAsk yourself: do you really need entertainment? I’ve squandered my youth by immersing myself in long hours of digital entertainment day after day. I barely even noticed that I was unhappy the whole time because I was so sedated. And what did I even get out of them? Those were several hours everyday that I could have spent reading, working out, learning new skills, meeting new people, and experiencing the world. \\nThe fact is, giving up on entertainment has no negative impact on your level of happiness. Sure, you might miss them when they’re suddenly gone, but overall, as long as you find more valuable things to do, your life can only get better when you ditch them. Learn to enjoy things that give you value rather than seeking enjoyment in things without value. Conclusion \\nUnlike what many people today say, no one deserves happiness; that’s something you’ll have to earn. I’ll go as far as to say that “happiness”—as defined by modern standards—isn’t even necessary and hard to come by for certain individuals. Everyone has their own path towards living life to his unique potential and there is no universal rule that applies to all. So while I haven’t really listed anything specific for the reader to strive towards, I hope I laid out some pitfalls that you can avoid in your journey. Nov 7, 2016 Corey Savage'"}, "time": 1742563543.5243595}