{"duration": 0.01762247085571289, "input_args": {"text": "'LOS ANGELES  —   Now it’s war: Nickelodeon, once again winning the children’s ratings race against Disney Channel, has decided to throw its weight behind . .. a princess. Nickelodeon has always had its share of magical kingdoms, but this   cable network has tended to leave the princess business to Disney. (And what a business it is, generating an estimated $5. 5 billion a year in merchandise revenue alone.) But here comes “Nella the Princess Knight,” which Nickelodeon will introduce on Monday in a programming block for preschoolers. The   Princess Police, mostly academics who use Snow White, Sleeping Beauty and their slender ilk to make  points about their negative impact on young girls, have been a perennial thorn in Disney’s side, even as the company has introduced black and Latina royals, along with a preschool one, “Sofia the First. ” Will Nickelodeon now find itself in a similar position? Maybe not. The   Nella pushes boundaries, at least for television aimed at    in the areas of race and gender. She is biracial, with a black father and a white mother, a decision informed by Nickelodeon research indicating that most children under 12 will be nonwhite by 2020 and that already 17 percent are biracial. The character also mashes together traditional boy and girl gender norms. Nella may ride a unicorn with a pink mane (à la My Little Pony) but she does it while brandishing a sword and wearing knight gear, a bit like a preschool version of Brienne of Tarth from “Game of Thrones. ” She is a girlie girl but does traditional boy activities (battling a dragon) and does not spend the majority of her time in a ball gown. Nickelodeon’s princess may strike some adults as subversive, particularly given the surge of conservatism that helped push Donald J. Trump into office. But children see   families and the blurring of gender lines as normal, said Cyma Zarghami, Nickelodeon’s longtime chief. “Adults might say, ‘Oh, look  —   she’s biracial,’ but our viewers just say, ‘That looks like my friend,’” she said. “An older generation was taught tolerance, and this audience is demanding difference,” said Ms. Zarghami. She led Nickelodeon to ratings strength in 2016 among total viewers and children ages 2 to 11, even as competitors like Disney Channel and Cartoon Network recorded sharp    drops. (According to Nielsen, Disney still has a big lead among viewers 6 to 14.) She added, “This series seems to be taking on a life of its own, which is incredibly exciting. ”'"}, "time": 1742628500.907646}