{"duration": 0.8666307926177979, "input_args": {"text": "'Home / Badge Abuse / Police Admit Officers May Also Be Responsible For Gunning Down Orlando Nightclub Patrons Police Admit Officers May Also Be Responsible For Gunning Down Orlando Nightclub Patrons Jay Syrmopoulos June 14, 2016 233 Comments \\nOrlando, FL – New details have emerged that may shed more light on the extreme casualty count in the Orlando nightclub killings. On Monday, Orlando Police Chief John Mina intimated that some of the victims may have been killed by officers trying to perform a rescue operation. \\n“I will say this, that’s all part of the investigation,” Mina said. “But I will say when our SWAT officers, about eight or nine officers, opened fire, the backdrop was a concrete wall, and they were being fired upon.” \\nA confidential law enforcement source close to the investigation said a crowd of up to 300 people within the club — combined with the complex layout of the structure — may have resulted in numerous patrons being struck by gunfire from officers, according to WFAA-ABC 8 . \\nMina stood by his decision to employ a tactical strike amidst the rising likelihood that a number of the dead were the result of “friendly fire” from officers. \\n“It was a hard decision to make, but it was the right decision,” he said. “Our No. 1 priority is on saving lives, and it was the right decision to make.” \\nDetails of the investigation are a being pieced together by local, federal and state investigators, as they continue to process the gruesome scene from a number of law enforcement mobile command units. \\nAuthorities have determined that Mateen, 29, walked to the club at 2:02 a.m. armed with a semi-automatic long rifle and a Glock handgun. \\nAn off-duty police officer working security at the club was outside investigating an underage drinker when he heard gunshots inside the club. The off-duty officer then proceeded to run inside the club and exchange gunfire with Mateen, with three additional officers soon arriving to back up the off-duty cop, law enforcement sources told WFAA-ABC 8. As the officers fired at Mateen, he retreated into a bathroom toward the rear of the club with a number of hostages. \\n“Those additional officers made entry while the suspect was shooting,” Mina said. “They forced him to stop shooting and retreat to the bathroom where we believe he had several hostages.” \\nWhile in the bathroom Mateen called 911 three times, pledging his allegiance to the Islamic State during one of the calls, although currently he has no known affiliation with any specific terrorist group. Mateen has been linked with American suicide bomber Moner Abu-Salha — who drove 16 tons of explosives into a Syrian government facility on behalf of Al Qaeda-linked Nusra Front in late May of that year. The men had also attended the same Eastern Florida mosque. \\nIt has since come to light that he was a regular at the gay club, which raises serious questions about the credibility of his Islamist “terrorist” connection, and raises the possibility that Mateen suffered from severe identity issues that manifested in violence. The FBI confirmed that Mateen had been on their radar and had been interviewed on 3 separate occasions. \\n“He was in one bathroom fortified with hostages,” Mina said. “There were people in the opposing bathroom, about 15 or 20 people. And the details are unknown, they’re part of the investigation.” \\nOrlando police crisis negotiators that spoke with Mateen said he remained calm during the talks, but that he intimated that he intended to kill more people, Mina said. \\n“Based off statements made by the suspect and based on information we received by the suspect and from the hostages and the people inside,” Mina said, “we believe further loss of life was imminent. I made the decision to commence the rescue operation and do the explosive breach.” \\nThe SWAT team attempted to topple the exterior wall leading to the bathroom that held 15 to 20 people, but failed, so Mina decided to use a Bearcat to break a hole in the wall. The vehicle rammed the wall, creating a small opening — about 3 feet wide and 2 feet off the ground — that captives could use to escape. \\n“We were able to rescue dozens and dozens of people who came out of that wall,” Mina said. “The suspect came out of that hole himself with a handgun and a long gun and engaged in a gunbattle with officers where he was ultimately killed.” \\nMateen engaged officers immediately , striking one of them in his helmet, as officers returned fire striking the assailant several times. \\nThe exterior concrete wall where the siege occurred is dotted with dozens of bullet holes, evidence of a shootout that included dozens of rounds fired by officers that likely hit and killed many hostages. \\nThe final exchange of gunfire Mateen had with law enforcement occurred at 5 a.m., ending the three-hour ordeal. Officers then walked into the nightclub and found the dead bodies of club patrons strewn about the club, with more bodies found in a nearby bathroom. \\nThere is a strong likelihood that we will never find out how many of the victims were ultimately killed by “friendly fire”. Jay Syrmopoulos is a political analyst, free thinker, researcher, and ardent opponent of authoritarianism. He is currently a graduate student at University of Denver pursuing a masters in Global Affairs. Jay’s work has been published on Ben Swann’s Truth in Media, Truth-Out, Raw Story, MintPress News, as well as many other sites. You can follow him on Twitter @sirmetropolis, on Facebook at Sir Metropolis and now on tsu. Share \\nswat teams are responsible for cleaning up the scene the fbi created Prince \\nWhere’d they put all dead bodies? john smith \\nwut? the swat teams have been proven to be the real killers in these false flags..so ummm they did not put them anywhere Prince \\nJust wondering, as I didn’t see any footage of mass bodies being loaded into hearses. Mighty-Morphin Larry \\nonly time will tell… mrshouse \\nWhy won’t we find out? Can’t they tell from the bullets used to kill the victims? Matthew Shapiro \\nThe forensic examination and reconstruction will most definitely determine which rounds were fired by police vs. terrorist, even if it is not possible to identify the particular officer who fired each shot. Sangreaal \\nThey would be able to tell which gun fired what bullet via the rifling signature, so sure, they can indeed find out which officer fired the shot. Anon22385 \\nlol, all of the bullets fired by the officers will be found to be “significantly damaged as to prohibit accurate analysis”… 2broke4 her \\nexactly, and the rounds would go through most people if not all of them, unless damaged by ricocheting off something and stayed intact in the victim, then too distorted to pin point which cop..imagine a cop being told he/she killed several people.. that should make his/her day! Jo6346 \\nI make in the range of $6.000-$8.000 /month doing an online job. So if you are willing to work simple online jobs for several hours /a day from your house and earn good payment in the same time… This is perfect for you… http://ur1.ca/p7vx2 \\nhkhjhj \\nThe sarcasm was wasted on you. spg210 \\nRounds do NOT go through most people. Even at close range, unless a high powered weapon is being used. Even then the range is a deciding factor. Where did you even get that from? 2broke4 her \\nfunny the ones i knew in Nam went through their bodies! A 22 magnum will go through a person unless it hits bone.. the .44 special Bulldog, i have the round travels around 850 fps, it wont go through a person unless the area is unobstructed and soft tissue.. a .45 Colt 875fps wont go through either.. a cop i know was shot with a .223 at about 150 feet away and it went clean through.. in reality it comes down the factors of ballistics and if the round is affected by an obstacle, as in Bone or soft tissue.. \\nThey may go through, but they may also turn, and fragment. There is some very dense, and hard tissue in humans, and also tissue that is very light. benbernecky \\nyou’re overlooking the trail that is always left by the spent casings on the ground. How many of which caliber and their location gives a lot of clues as to how a shooting went down. If for instance they find 30 spend casings in the bar with the shooters firing pin “finger print” and other firearm indicatives like extractor marks etc. That’s why you always see spent casings designated wi5th a marker. The only problem, besides grief obviously, I have is the knee-jerk reaction to enact more inane stupid senseless gun laws that only disarm citizens of their 2nd amendment rights. You are supposed to have access “shall not be infringed” access to the heaviest firepower it takes to prevent your government from putting you into a FEMA camp. The 2nd amend. is NOT a duck-hunting right. Its for self protection. One person armed with a concealed gun would have made a world of difference and you ALL know it. CA just passed a pile of anti-gun, anti-citizen gun laws. One requires ALL parts of guns to have serial numbers? That’ll really make the jihadists think twice huh? We are not fighting a gun, we are at war with Islam jihadist which their Quran -only one- calls for all adherent’s to kill infidels- like myself. Good luck with that any of you jihadists out there. Molon Labe! Tothe \\nFMJ v. JHP? Do we know which bullets were used by either side yet? 2broke4 her \\ntrue Jeremy Shives \\nMy rounds go through 250lb deer at well over 100 hundred yards. Since they haven’t yet released which MCX setup the guy had we don’t know if it was 5.56, 7.62, or 300 BLK. I can assure you that 7.62 and 300 BLK will def go through a human at close range. You have to remember though the officers who may have hit patrons fired through a concrete wall first so I would suspect those rounds would be pretty messed up prior to hitting club goers… disqus_s4n9NxE7Bi \\nof course. Bill Garrett \\nThe shooter was using .223. The SWAT team was most likely using 5.56 NATO which fires the exact same bullet. Most likely 90% of the bullets fired that night were 77 grain Sierra Match King hollow point .223. Good luck guessing which rifle they came out of. Friend of Tibet \\nEven for 9mm the cops were most likely equipped with Glock pistols as well. NortonSmitty \\nOrlando issues .40 S&W. Bill Garrett \\nLooks like the reporting was wrong (really? the media calling a random rifle AR-15 because it was black and magazine fed?). If the shooter was using a Sig MCX then it would have been 300BLK rather than .223. LE may have been using 300BLK as well, but it was most likely 5.56. benbernecky \\nI seriously doubt they won’t be able to identify any bullet. If you believe that you do not know ballistics or what rounds police prefer/required to use in close encounters. A FMJ will usually get cleanly through a human without causing blood loss trauma. That is what kills is massive blood loss. That’s why anyone trained to use a gun shoot at the core of a human target -head included. At a distance as the 223/5.56 slows down it has time to mushroom and deform causing massive soft tissue damage but can still be survivable. At close range most high powered bullets do not have time to distort even hollow points that hit nothing solid .Been doing ordinance, and ballistics all my life kids. katz ro \\nThey probably can’t tell if the bullet went all the way through Friend of Tibet \\nBoth sides used .223/5.56mm ammunition during the attack. So we are talking about exact same bullets here. disqus_s4n9NxE7Bi \\nor so we’ve been told. (both sides using same ammo) Friend of Tibet \\nPolice uses ar15 and Suspect used SIG MCX, both chambered in .223/5.56 NATO round. So yep…… Robert Karp \\nNo. The difference would be the the ones used by the terrorist was a hunting round and the bullet would perform differently from the rounds used by the police. The police rounds do less damage to the body, because the hunting round is designed to most assuredly kill it’s target. They both kill but you’re more likely to survive a police round because it doesn’t expand and splinter as much. Friend of Tibet \\nGimme a break. Orlando shooter used a SIG MCX as primary weapon. It is a Tactical Semiautomatic rifle intended for LEO market. As someone who regular shoots ar15 with friends for .223/5.56 there are no so called “hunting round “and “Police round”. Both sides use off the shelf Ammunition and both sides used FMJ type ammunition. Police do not and will never choose ammunition of ” less damage to the body” on their duty rifle because they are looking at maximum stopping power. disqus_s4n9NxE7Bi \\nthat’s what we’ve been told, kind of convenient, no? Lily Munster \\nThey’re going to shut your theory down. Tom Losh \\nThe active shooter and many of the police were using the same ammo – .223/5.56 – and at the distance they were firing from I suspect many/most of the bullets went right through the victim so all you have is a quarter inch entry wound and a larger exit wound with no hint of what weapon it came from… \\nThe cartridges used may be the same as the M-16s used by the police. The rifling may be different, but high velocity rifle rounds often break up when hitting flesh, walls or floor at short range. kat \\nIf you google the location you will see that the bar was not very big. I can’t see how 300+ people fit into the place. The parking lot holds no more than 20 cars and it is bigger than the bar. The videos that you see on tv of people carrying other people actually shows them walking towards the bar and not away from it. You can see for yourself. https: [email protected] \\nOh fucking please! Get an education fool! Prince \\nFlagged for profanity, and not a false flag John J Publicus! WestDetroitNigga \\nCan you be flagged for stupidity? Bobby5939 \\nPerhaps you better open yours eyes son. The raw footage is everywhere of the errors they made. Education means nothing without common sense, and common sense would dictate if you are helping injured people that were shot in the club, they would be walking AWAY from the club, not towards it. \\nYou lose bucko. John J Publicus \\nSure you would. Except for the hospital that’s two blocks away in that direction. \\nDo you need to work hard to get to your level of batshit crazy or is it more something you’re born with? kat \\nSo they carried everyone in the wrong direction first then they decided that the hospital was in the other direction so they turned around and started carrying people 4 blocks in the other direction. Is that correct? Where would ambulances be at this point? Or even police cars would be better then people carrying people with no blood what so ever on them……. John J Publicus \\nGo it. You need to work REALLY hard to reach your level of utter stupidity. \\nFunny, I’d have thought it more of a calling…. kat \\nThe video’s are very clear, I’m not the utterly stupid one here. You and your actors failed to fool the public once again. John J Publicus \\nYou’re cute!. Do you actually think I’m ‘debating’ you? disqus_s4n9NxE7Bi \\nCan you send me links to where I can see this footage? I haven’t seen it- or noticed the observations you noticed. But i did notice a lack of bodies. Pist-Off \\nhttp://investmentwatchblog.com/100-proof-nobody-died-in-the-orlando-homocaust-doctors-victims-are-fake-lone-gunman-doesnt-seem-possible/ kat \\nGo to youtube Orlando false flag and you will see many videos of mistakes they made while producing this false flag. john smith \\nexcellent point. Mark Choi \\nNo it’s not. Anyone who has ever gone to clubs that size knows full well what capacity they have. The idea that there could not have been 300+ patrons would only come from an ignoramus with no experience with matters at which he pretends expertise. John Willis \\nyaa like 300 plus fit in there no way Rogue cops cost us money \\nBullshit It is called ballistic…….. There is a strong likelihood that we will never find out how many of the victims were ultimately killed by “friendly fire”. We may never know it depends on how FDLE does their job. Past performances dictate it will be a shit job, and all ballistics related information will be ignored tainted or covered up. disqus_s4n9NxE7Bi \\nUnfortunately, we will never know. Has our gov’t or any other governmental entity every admitted to fault or wrongdoing? (serious question) I mean even on a different scale hell- cops kill black kids in plain sight and not one has been charged/convicted. Bob Btme \\nGood thing law enforcement was focused on “underage drinking” Andy Cripps \\nMultiple shooters theory kind of proved, just not quite as the conspiracy theorists had imagined. All so tragic. I suppose a fast acting consciousness blocking gas canister through the hole created in the walls to subdue the shooter was out of the question, do they exist even? spg210 \\nI guess that’s kind of like asking why didn’t the cop use his taser instead of shooting the suspect. David Hall \\nCowards waited almost three hours to breech the bar and ended up killing probably 15-20 hostages. They will never release how many were killed by cops. 50 fucking people get killed and that one cop running around showing everyone he got shot in his kevlar helmut. Like anyone is worried about the little knick in his helmut, compared to over 100 people being shot. Guy \\nEasy enough for you to accuse people of cowardice as you sit safe, fuzzy and warm in your easy chair while, weekend quarterbacking of police who were trying to make safe almost 300 people from a deranged homicidal killer armed with a AR-15 type of assault rifle and a clock, who is shooting and killing people, in a very enclosed space with no rear exits ! Be sure to let everyone know how you from your vast experience, would have done it differently to keep people from being hurt or killed, from sniper or friendly fire, in a situation that was changing from minute to minute. Guy’s like you, who take cheap shots, piss me off ! Easy enough for you to flap your opinion about it, as long as there is a captive audience ! But put your ass on the line were it counts, and you all become very quiet ! SexForUs \\nThere is no such thing as an assault rifle. \\nAn assault is an action. \\nMy fist is a weapon. Me throat punching you with it for being a fucking idiot, would be an assault. \\nGuy’s like you talk a lot of shit defending people who did what was mentioned and yet, where is your fucking vast experience? spg210 \\n“‘GUYS’ like you” I see what you did there. John J Publicus \\nThe military themselves named this type of rifle an ‘assault’ rifle when it was developed around the time of Vietnam. It was developed to REPLACE a ‘wood’ rifle, the kind your type like to compare the AR-15 to (the rifle used was a ‘souped up’ version of an AR-15) and claim its ‘just like the other rifle, with different pajamas’ or some such shit. \\nNo morons, the military developed this weapon to REPLACE rifles like the Garrand specifically BECAUSE is performed better. Faster rate of fire, more reliable, larger magazines that are faster to load, lighter and changes very quickly. They also required a smaller, lighter round that would have the same or similar stopping power to the 30.xx cal that was in current use (they did this with added velocity). I’m actually paraphrasing the requirements that the armed services had developed for this weapon. The ‘auto fire’ feature was almost dropped and later modified to 3 round bursts for accuracy and because troops could not keep the weapon on target under auto fire. Different suppressor/compensator fixtures were later added to correct that. \\nSo you see, this rifle and all it’s variants were originally developed to do one thing, kill people, as quickly and as efficiently as possible. Nothing you ammosexuals say or do can change this history and frankly, the more you continue to padal this crappola, the more you will look like utter morons to anyone who actually KNOWS the development history of this weapon! John Willis \\nand the military designates that as a “select fire ” small arm ,,youre blowing smoke troll or youre chooomin benbernecky \\nyes there are assault weapons, a 50 cal is most certainly an assault weapon. But since they are illegal -assault weapons that is -then when the media starts doing the AR-15 monkey dance and screaming assault weapons we all know what they’re trying to spite out is the term “semi-automatic rifle”, but assault weapon sounds more dramatic, to hell with truthful accurate journalism. it all went out with the ol “untouchable” supreme court. Rights judge Roberts? SexForUs \\nFDR’s NFA of 1934 already requires machine guns to be heavily taxed, highly regulated and registered with the federal government but it isn’t an assault weapon. \\nAn assault is an action and regarding the Jackals in Black Robes, I’ll refer to Thomas Jefferson’s take on that Bench of Control Freaks. \\nhomas Jefferson strongly opposed the doctrine of judicial review, and feared it would lead to “judicial despotism,” an opinion he voiced often. \\nJefferson wrote to Abigail Adams (wife of former President John Adams) in 1804: \\n“The Constitution… meant that its coordinate branches should be checks on each other. But the opinion which gives to the judges the right to decide what laws are constitutional and what not, not only for themselves in their own sphere of action but for the Legislature and Executive also in their spheres, would make the Judiciary a despotic branch.” \\nto Spencer Roane in 1819: \\n“In denying the right [the Supreme Court usurps] of exclusively explaining the Constitution, I go further than [others] do, if I understand rightly [this] quotation from the Federalist of an opinion that ‘the judiciary is the last resort in relation to the other departments of the government, but not in relation to the rights of the parties to the compact under which the judiciary is derived.’ If this opinion be sound, then indeed is our Constitution a complete felo de se[act of suicide]. For intending to establish three departments, coordinate and independent, that they might check and balance one another, it has given, according to this opinion, to one of them alone the right to prescribe rules for the government of the others, and to that one, too, which is unelected by and independent of the nation. For experience has already shown that the impeachment it has provided is not even a scare-crow… The Constitution on this hypothesis is a mere thing of wax in the hands of the judiciary, which they may twist and shape into any form they please.” \\nto William C. Jarvis in 1820: \\n“To consider the judges as the ultimate arbiters of all constitutional questions [is] a very dangerous doctrine indeed, and one which would place us under the despotism of an oligarchy. Our judges are as honest as other men and not more so. They have with others the same passions for party, for power, and the privilege of their corps. Their maxim is boni judicis est ampliare jurisdictionem [good justice is broad jurisdiction], and their power the more dangerous as they are in office for life and not responsible, as the other functionaries are, to the elective control. The Constitution has erected no such single tribunal, knowing that to whatever hands confided, with the corruptions of time and party, its members would become despots. It has more wisely made all the departments co-equal and co-sovereign within themselves.” \\nand to Edward Livingstone in 1825: \\n“This member of the Government was at first considered as the most harmless and helpless of all its organs. But it has proved that the power of declaring what the law is, ad libitum, by sapping and mining slyly and without alarm the foundations of the Constitution, can do what open force would not dare to attempt.” ~ Thomas Jefferson. John J Publicus \\n“There is no such thing as an assault rifle” \\nActually, there is. The weapon and the round itself was designed from the ground up to kill as many people as efficiently as possible on the battlefield-by DEFINTION, it’s an ‘assault rifle’. \\nBy definition, this weapon is NOT “just like any other semi auto rifle”. If you actually knew what you were shooting off your mouth about this would be self evident… SexForUs \\nWhat you are saying is, it’s the only military grade assault rifle not used by any military anywhere in the world. \\nGot t. \\nYeah them clocks sure are deadly Brandon Swords \\nYou’re a credulous moron. Sangreaal \\nUmmm…there was NO AR15 John J Publicus \\nOh really? So he was using a sling shot? Moron… Need_to_Know \\nNo, Moron, it was a Sig MCX, which is NOT an AR-15. John J Publicus \\nOh, so,it was an AR-15 VARIANT? Silly me \\nYeah, get your money back from school, you were robbed…. John J Publicus \\nYes it was Einstein. Here’s a little from the brochure for,the MCX; \\n“Even while in the field, you can configure the SIG MCX as needs or conditions change. The combination of the 13″ monolithic upper receiver and handguard create a 17 3/4″ continuous top rail. The upper is backwards compatible with any mil-spec AR lower, allowing you to upgrade your existing AR platform to the SIG MCX. The AR upgrade kit includes side-folding stock assembly and adapter.” \\nYeah, sounds to me like it was nothing like an AR-15. More like an AR on steroids if you ask almost anyone…. \\nApparently you are a bigger moron than first thought!! \\nIT’S A CARBINE!! \\nA Carbine is NOT an AR. John J Publicus \\n‘Carbine’ describes a style of weapon whose most recognizable feature is a short barrel length. You might want to stop using words that you don’t actually know the meaning of. \\nEven while in the field, you can configure the SIG MCX as needs or conditions change. The combination of the 13″ monolithic upper receiver and handguard create a 17 3/4″ continuous top rail. The upper is backwards compatible with any mil-spec AR lower, allowing you to upgrade your existing AR platform to the SIG MCX. The AR upgrade kit includes side-folding stock assembly and adapter. \\nA carbine is a style of rifle, most usually defined by a shooter barrel. \\nAre you really this arrogantly misinformed? Need_to_Know \\nCarbines have a shorter and different gas system than AR-15’s, thus making the difference much more than barrel length. John J Publicus \\n“most usually defined by a (shorter) barrel.” \\nI was very specific in what I said. James Paul \\nJohn, you are a idiot. The media has said the shooter had a handgun, a Glock. He didn’t have a AR-15. Look up the fact before making a fool of yourself. John J Publicus \\nIt was an AR-15 variant. \\nFool NortonSmitty \\nYou know what is easy to say? THE ASSHOLES WAITED THREE HOURS IN SWAT GEAR WHILE UNTOLD DOZENS BLED OUT ON THE FLOOR! That, sir, is the very definition of cowardly incompetence. Mark Choi \\nYou have no information on which to make that claim. You do however, appear to have a broken shift key. NortonSmitty \\nIt was in every story on every venue if you actually paid attention. Moron. Mark Choi \\nNo it wasn’t. But thanks for your superficial analysts of events that were too complex for you to understand. First, the shooting began at a little after 2:00. Almost IMMEDIATELY he is engaged by gunfire by an OPD officer, at 2:02 AM. Within MINUTES more OPD backup arrives, engaging Mateen and forcing him to retreat into a bathroom, taking hostages. It is now about 2:30. Mateen calls 911 several times. Meanwhile, he has taken hostages in the restroom, preventing a direct, all out assault. OPD SWAT requests a bomb unit. It is now 4:10 AM. A controlled explosion demolishes a small section of exterior wall of Pulse, leading to the aforementioned restroom. The hole is not large enough to allow a breach, so another officer uses his vehicle to ram the wall, making an opening large enough to enter. Police immediately engage Mateen in gunfire, and rescue 30 hostages. It is now 5:05 AM. Mateen is pronounced dead. It is now 5:53. NONE of this timeline backs up your claim, either of cowardice, or that anyone bled out in the intervening time. Moreover, you most certainly can NOT state definitely that more people would not have been killed, particularly those 30 hostages, had they performed a full frontal assault on the building. In fact, even as it was, the OPD can not be sure their officers did not accidentally shoot some of the victims in the ensuing chaos. It is you, sir, who are the one who is mentally deficient. But at least you appear to have fixed your keyboard. Mark Choi \\nhttp://www.laweekly.com/news/did-swat-wait-too-long-to-storm-the-orlando-nightclub-7027891 Mark Choi \\nNo it wasn’t you microcephalic idiot. As already mentioned, what WAS on the news coverage was the fact that during that three hours, the shooter repeatedly called 911 claiming that he had an explosive vest, and that he had set booby traps all throughout the building, that nevertheless the police were actively accessing the building and evacuating as many people as possible, and that no additional shots were fired during that standoff, changing the situation from an active shooter protocol to a hostage negotiation protocol. What is also known is that you’re a bloviating, misinformed idiot. Funny how after all this went mainstream, and the 911 tapes were released, all of a sudden you began radio silence. You would have done well to start there. John Willis \\nit was televised ding dong ,and there are records showing time elapsed from police arrival till mop up , where do you morons come from ? John J Publicus \\nFrom under the nearest rock. \\nThe real question is; will they crawl back under those rocks once tRump loses in a landslide? Mark Choi \\nNo it wasn’t you idiot. What WAS televised is that during that three hours, during which the shooter repeatedly called 911 claiming that he had an explosive vest, and that he had set booby traps all throughout the building, nevertheless the police were actively accessing the building and evacuating as many people as possible. What is also known is that no additional shots were fired during that standoff, changing the situation from an active shooter protocol to a hostage negotiation protocol. Did I happen to mention that you’re an idiot? You’re an idiot. Tothe \\nI’m not the one whose alleged job is charging into dangerous situations and putting my life on the line. Isn’t that what people say when I argue that the law enforcement monopoly is ever in the wrong? “You aren’t the one charging into dangerous situations,” or something, right? \\nRemember when cops sat on the sidelines during the Columbine massacre, too? David Hall \\nYou stupid POS, I have put my ass on the fucking line for 27 months. I lost my right eye, half of my face, back of my right leg nearly blown off and a bayonet ripped throught 17 inches of my right arm. Dude I have earned to say what I damn well please. Have you?. I spent 23 months in hospitals in three Countries.Arm chair asshole like you is what pisses me off. If you bothered to read 3 of the best guys in the business that trains the SWAT officers said the same thing, that they should have went in hours sooner. Policy is now with a mass type shooter to immediately engage the shooter. Learn before speaking, go back to you Mom’s basement and take some meds. I went into a hundred fucking places tighter and smaller than that with many hostages. James Paul \\nListen up Guy, The official story says the shooter had a hand gun, not a AR-15. Get your facts straight before making a fool of yourself. James Paul \\nThe truth is, it never happened. It was a staged event, false flag, just like Sandy Hook. The powers that be want our guns and will do anything to get them. Staging a event like this to push gun legislation is not out of the realm of possibility. if the event actually happened there would not be so many discrepancies spotted so quickly. Interrupting Reply Bot 2014 \\nI’d like to see things from your point of view. But no sane person can possibly shove their head that far up their assholes. Lily Munster \\nIt’s a secret! Ed \\nThere is a strong likelihood that we will never find out how many of the victims were ultimately killed by “friendly fire”. But we better thoroughly investigate, no matter the cost! Prince \\nWhere’s all the dead bodies? John J Publicus \\nIdiot,,what makes you think you’ll see dead bodies? Prince \\nAn off-duty police officer working security at the club was outside investigating an underage drinker when he heard gunshots inside the club. The off-duty officer then proceeded to run inside the club and exchange gunfire with Mateen, with three additional officers soon arriving to back up the off-duty cop, law enforcement sources told WFAA-ABC 8. \\nWell why were there 3 additional cops so close to the off duty cop? Dark_Space \\nI’m guessing they were close to where they get regular calls… stubbikins \\nIt was Saturday night in an area with a lot going on, probably several places with private security. Three is not that many Sangreaal \\nNo wonder there were witness reports of there being more than one shooter killing people. spg210 \\nPolice tend to hang out around night club areas, especially close to last call, for obvious reasons. Marlene Piazza \\nand what about all the reports that state the officer engaged in a shoot out with the gunman OUTSIDE the club first, before he went in. And stories about one victim and his girlfriend being shot when they were walking to their car, as they passed the gunman on his way to the club? Paul Val \\nthere is absolutely NO REASON why they can’t figure out who was shot by friendly fire, it’s called BALLISTICS Dan Bray \\nYou watch too much CSI. Prince \\nyoure :john q pubiclikus jean boyd \\nPeople saw the cops shooting so they had to cover their butts somehow. Same thing happened in San Bernadino. People saw SWAT type soldiers at the scene but they just ignored it on the news. These are False Flags and look at the family members crying and reading scripts. Been going on for a while. The Government and news stations are allowed to produce propaganda for the continuation of their agenda and the American people just buy it up. Please investigate people. They just want a gun grab. Alberto \\nWho’s to take responsibility for the victims the swat team killed, it was a moronic decision that took place. The swat team probably killed or injured most of the victims. Lets take a close look at the weapon the shooter had with him a semi-automatic long rifle carries 10rounds per clip and a Glock handgun 10-15 rounds depending on the type of hand gun. I’m puzzled how did the shooter managed to shoot and kill 50 people and injured 53 more. This shooter must’ve been an expert at changing his clips. stubbikins \\nHe was in there for 3 hours. Taylor Franklin \\nIt’s a magazine and a standard mag holds 30 rounds but even so he would have had to have 31 of them to have that many rounds Dan Bray \\nAllegedly 202 rounds fired. Less than 10 mags. Patrick \\nI suspect the real culprits were actually the first four ‘police’ on the scene 🙁 Samantha Atkins \\nUh, ballistics can tell you how many of the dead were not killed by Mateen. Lily Munster \\nYou think we’ll ever know that? It will destroy Obama and Billary’s master plan a-la Wasserman. Wild_Bill_vintage_1948 \\nWhy would anyone be interested in doing such ballistics? I’m sure they won’t. Windell Clark \\nNo excuse – You have adrenaline pumping – you dont want to hurt any innocents now add in the fact YOU dont want to die and its not a drill and you cant take back a bullet and start over. You can have the best gear with lights on the front, laser sights etc but add emotion and someone trying to kill you and things change. Ask any cop whats going through his of her mind when just room clearing in the most basic form – its tough. Now add an active shooter(s) with an Auto or Semi Automatic weapon(s) and the stakes jump. Add people begging for help but you cant stop and render aid because the threat is not neutralized -so you must leave them for time being-. Oh did i mention this is only the first 30 seconds of a dynamic entry? If other Officers have entered at another point you dont want to shoot them by accident – someone runs at you with something in hand you have maybe a fraction of a second to determine if its a cellphone in hand or a weapon guess wrong and you’re dead or that innocent with a cell phone is dead. Ok now that either you have killed an innocent or your team is stepping over your body because you guessed wrong the mission must go on. You still have 5 or 10 of the longest nerve racking minutes of your life to clear a building you’ve never been in..Good luck Kyle Pinson \\nThat sounds compelling, but this took three hours. Care to revise your fantasy here? Windell Clark \\nOnly painting a picture of what a person MIGHT possibly come up against in that situation. Bud Miser \\nMe. Lie_Buster \\nRelax, children. Normal logical questions are rendered “conspiracy theory” and “tinfoil hats” etc when the rulers do their false flag thing. Its starting to look obvious that MOST of the victims were murdered by sharp, accurate-shooting members of the police force. Oops – sorry for questioning the guvmint’s tall tale(s). Now, if the truth turns out to be that the cops are responsible for most of the deaths, I want y’all to hold your breath that some “forensics” lab is gonna tell y’all that truth. Sirios \\n“Our number one priority is on saving lives” WTF? The cops were saving the people from the shooter as they were shooting the people they were saving? Ghassan Awada \\nWe had to destroy the village to save it That strategy is longstanding policy in the US 2broke4 her \\na 3 hour wait because cops thought explosives might be there.. meanwhile a turkey shoot is going on and then the cops killing people.. sounds like an excellent plan! Contrarianthefirst \\nNo film, no pics, it never happened. John J Publicus \\n“There is a strong likelihood that we will never find out how many of the victims were ultimately killed by “friendly fire”.” \\nOh fucking please! Do they really think we are that stupid? Of COURSE they will be able to tell which bullets came from who’s weapon! Do,they think we’re in the 18th century? Every bullet in every single body will be catalogued and identified. \\nI was wondering why the LE suits were pushing how many lives they saved by rushing the club. I’m betting that the coming weeks will show how much of a police induced cluster duck it REALLY was….. Prince \\nJohn J Publicus – Flagged again for profanity. Can’t stop using the “F” word, can you? John J Publicus \\nCan’t stop being bat$hit crazy, can you? David Nininger \\nSo just to recap, collateral damage is allowed on US citizens from police but is a war crime when out military does it…. ? spg210 \\nUh… NO. Collateral damage is NOT a war crime. Collateral damage is not purposely killing civilians. Purposely killing civilians is a war crime. So just to recap, if you drop a bomb on a verified enemy stronghold and kill some civilians in the process, that’s not against the Geneva Convention. bf110c4 \\n“Our No. 1 priority is on saving lives, and it was the right decision to make.” The lives he is speaking of were the cops. They let dozens of victims bleed out during the 3 hour stand-off. Mateen basically had his way with the patrons and the cops. Thunder_Kiss_1965 \\nThis should be kept out of the public domain. Before anyone jumps me you should take into account what happens the next time . A SWAT team leary of hitting civilians doesn’t go in and the death toll is higher you can’t reason with a radical. Kevis \\nThey can get a very good idea on how many were hit by whom. Even where exact matching isn’t possible marks on fragments can exclude or include certain guns fired. disqus_s4n9NxE7Bi \\nOrlando Alligator Detractor/Distraction? Anyone else think this 2 yr old Alligator Death was set up to distract the American Public away from critically analyzing and questioning this night-club shooting? I do. Very much so. The vast majority of our pubic are just “sheep” ;( blindly following without questioning Prince \\nDidn’t some singer in Orlando that was on the T.V. show The Voice supposedly also get killed too while signing autographs? Reuel Excalibur Francis \\nThat happened before the shooting tho disqus_s4n9NxE7Bi \\nIt’s true: WHERE ARE THE BODIES?! Zero footage?!? No way. Prince \\nDon’t worry they’ll splash around some fake blood for post event pictures to be taken. lancelotlink \\n“It was a hard decision to make, but it was the right decision,” Madeline Allbright \\n“We went, we saw and he died.” Hillary Clinton MrMiran \\nJust how big is that bathroom, and how many people were in it when the gunman was forced to retreat into it? I mean once he was pinned down in there by the officers on location, evacuate the club… then work on rescuing the hostages in the bathroom. \\nHey, I wasn’t there… I don’t have all the facts… I’m just asking questions about how it was handled. With cops on-site when it went down… and the gunman’s quick retreat… I’m just trying to get my head around how over 100 people were shot. My thoughts and prayers are with the victims and their families and friends. Andy Cripps \\nApparently this guy was a regular visitor. Looks like he was in two minds. Instinctual same sex urges and ideological nonsense that bans it. How about a system where you could be honest about your personal situation to get the help required without fear of character annihilation to maybe stop some of this sort of stuff happening. The war on crime has been as successful as prohibition of alcohol was and the war on drugs is. Maybe time to address what it is to be human and assess the damage crass ideologies have on people and start banning shit that really damages society! Chris Shirah \\nWho gives a rats ass who did what. Peoples lives were saved and peoples lives were taken, that’s all that matters. When the dust cleared that fruit cake was dead. On to the next one, people will die then too just hope it isn’t your family grieving while a bunch of tardos make dumb ass remarks about the police that do the saving of the rest. Prince \\nWhat R U, a cop lover? Chris Shirah \\nI don’t know. Is a convicted felon a lover of cops? All I care about is that a lot of lives were saved. I wouldn’t have cared if it was Minnie and Mickey Mouse that saved them. What are you? A hater of human life? NortonSmitty \\nThis makes no sense. If the officer(S) chased the shooter into a bathroom with 15 or 20 hostages within seconds how did over 100 people get shot with a semi-automatic weapon. As a veteran I can tell you it’s impossible. Prince \\nIt most likely didn’t happen. Lily Munster \\nHey, Boo! Mark Choi \\nAs a person who can read, I can tell you that you’re a misinformed idiot. d griffin \\nGrossly irresponsible “reporting.” The death-toll inside the club would have been in the hundreds, had police not responded forcefully. Also, the terrorist made it very clear what his motivation and allegiance were, and his being probably gay is a sidenote. Get a clue, kiddies. The war is against Islamic terror, and you’ll be fighting it for the next hundred years or so. Prince \\nThe club didn’t even hold that many people. d griffin \\nThe Miami Herald reports that as many as 800 people have packed that club. On that night, at closing, there were upwards of 300 people inside at closing time. So go back to being dead from a stupid overdose, you. lol Bud Miser \\nAren’t you just a ray of sunshine! Prince \\nNot what Eye heard. It could have been a murder as well… John J Publicus \\nWhy can’t you stay dead? Bobby5939 \\nYour attempt at disinformation is pathetic. Martin351 \\nFalse flag is a false flag. While were talking about cops in this case… why on earth when you get of a report of an armed gunman with either an AR15 or AK47 (yes botth of these being reported showing they can’t even get that right).. \\nWhy on earth would they send conventional cops to the scene with no armor, no kevlar, and no helmets? \\nSeriously people, how stupid can you be to believe this garbage? People being carried TOWARDS the club? People being caught off camera standing on their own and moving around after they were shot in the leg? Then their rescuers laughing and smiling? News reports can’t decide if an armored vehicle crashed into the club or explosives were used? It is clear either a sledgehammer was used and a special cutting saw. We have the same person conducting multiple interviews under different names yet never bothered to even change her shirt to attempt to deceive? We have “survivors” of the shooting with time and location stamps on social media pitting them completely out of the state 1-2hrs before hand? \\nNo bodies, no blood, no ambulances, no Swat, no bullet holes, no ID when entering the club (think about that one for a second), people having oodles of time to post on facebook during the incident? Even the nightclubs webpage has time to update to get out of the club and keep running?? LMFAO \\nAnd to think some of you bought this hook, line, and sinker.. unbelievable. Bob413 \\nYou can easily tell by some of the comments on this article that the people are commenting to spread disinformation and divert attention away to the errors made in the cover up. \\nSorry folks, there are more critical errors and holes in this incident and cover up than swiss cheese. You really dropped the ball on this one, and the whole world knows it now. The rest of the countries have washed their hands of this story and calling it like it is, a false flag. That’s bad when massive media outlets across the globe are now calling it a false flag not even 4 days after. Patricia Golding \\nNow they have released this crock of a florida gator eating a baby story because now they realize they’ve made so many mistakes with this shooting they are quickly trying to divert people’s attention John J Publicus \\nSo many stunningly stupid people. You as much a moron as the last one… disqus_s4n9NxE7Bi \\nYES I said this yesterday. And guess what? It worked! I’m so glad others are wise enough to realize the staged gator incident. \\nThe vast majority of American People are “sheep” following without questioning. disqus_s4n9NxE7Bi \\nBut my genuine question is this: Do they get families to cooperate (family of the boy)? Or would the family be completely unsuspecting? How does this whole thing work? (even with the “survivors” of orlando and witnesses) kat \\nDid you not see the same people interview over and over again. They are called actors. Go to youtube and watch how the one Mother smiles and laughs through the entire video with CNN after she finally finds out her son is dead. You can’t make this crap up. Lily Munster \\nA Philadelphia native and Fox 29 intern who survived the Orlando mass shooting has disputed claims on social media that she was a “crisis actor” for the station, and was not actually at Pulse nightclub when the incident occurred. Lily Munster \\nLord, don’t let my tears fail me now! \\nShe could have at least got a wig that doesn’t sit 3 inches behind her forehead. John J Publicus \\nYou just can’t fake stupid like you…. Fardale Labradors \\nI guess you didn’t see the kevlar helmets that save a few cops? Know what you;re talking about before you post bs. Autumn \\nIt was one cop, and the kevlar helmet had a hole in it and damage that was not consistent with a bullet’s entry point. Rather, it looked as though it had been bashed against some concrete. \\nNo ambulances. People declared dead inside the nightclub (that can’t be done until you reach the hospital.) Injured being carried from down the block toward the club. One loaded into a truck. \\nI understand that part of you may feel wrong to question a tragedy, but when something doesn’t feel right, you should follow your gut. That’s what I did for Sandy Hook and have been doing ever since. \\nLook into the points that have been made, Faradale, and see for yourself. Fardale Labradors \\nWere you there Autumn? My husband, a retired Port Authority 911 P.O had friends on the scene , a relative working in the hospital and others I can’t discuss on the scene. What we can ALL do is show some respect to those lost and stop arguing about what went on and what didn’t. Trysmiling \\nWe certainly can and should show respect to those that lost loved one during this shooting. No one is trying to disrespect them or the pain they are experiencing. But they need to know that those they loved and lost were sacrificed by a sick government for their agenda of immigration and gun control. That is all those poor people were, pawn is a huge game of chess.We never saw what happened inside, but what we saw outside was nothing but crisis actors. Your husbands friend probably has no clue that this was a staged event. It’s not like everyone has to be in the know to pull something like this off. Nahla Salvia \\nThe article was stating that it never happened. That’s why he mentioned no ambulances. A set up or not people died and out of respect for their families, maybe people should wait and let them mournemourne before busting out conspiracy theories George \\nI guess that people died in Star Wars too. I mean really died. Fardale Labradors \\nShooting? I was talking about 911. When we reach FL next month we will both CONCEAL CARRY by Law. He has his badge, we have to with his retirement badge on him. No further discussion, we will carry. Lily Munster \\nIs’t that ALWAYS the case when the truth must be shrouded? \\nSanders vs. Billary – same thing. Lily Munster \\nAll mainstream media publications, gay and straight alike have been compromised by the same entity. \\nThe want to shut Indie press down too. Nahla Salvia \\nWhy isn’t anyone in Orlando saying it never happened? Did you watched the local news of that city, when they were showing the live broadcast? George \\nLMAO No helmets? It says right there in the article that when mateen emerged he engaged the officers immediately and even hit ONE IN THE HELMET. Cry wolf. \\nHow long have you been insane, son? You know they have meds for that, now. John J Publicus \\ni see,you’ve posted all those facts her for all to see…oh, wait. disqus_s4n9NxE7Bi \\n@Martin351:disqus my gut instinct also feels it is false flag. Not being facetious, but where/what footage photos etc have you seen that confirms what you posted above? \\nI personally didn’t notice the reporter with the same shirt and many psuedonyms (do you have a name or channel she reports for?) Also, I didn’t see any footage of rescuers laughing or carrying people towards club. \\nI did notice there were no bodies. I did notice it took 4 days for “vine” clips to emerge (doubt their authenticity). In these circumstances, does the govt recruit and compensate people to make such statements in their interviews? Genuine Question. Pist-Off \\nE7Bi, this site may shed some lite on things for you. I believe that Martin is rite on. http://investmentwatchblog.com/100-proof-nobody-died-in-the-orlando-homocaust-doctors-victims-are-fake-lone-gunman-doesnt-seem-possible/ John J Publicus \\nThat ‘gut instinct’ is the compacted shit in your colon. A diet that didn’t include Taco Bell and McDonald’s washed down with non stop soda. Just because you have a great big gut, doesn’t mean you have the first clue of what reality looks like. \\nIt’s assholes like you that give syphilis a bad name! Nahla Salvia \\nThey don’t really show bodies in US news, i don’t really see them on the news I watch. Also too, no one that lives there is saying anything about it never happening. If it didn’t, l know for sure that Orlandoneans would be talking not foreigners. This is an ongoing investigation, they have to withhold information devontae hook \\n‘no bodies’ what a piece of shit you are, i went to school with 2 people that died in that club that shit wasnt fake, you moron fgvyti \\nwhat school and what are their names \\nshill'"}, "time": 1742561829.3692446}