{"duration": 0.0946805477142334, "input_args": {"text": "'Iraq Leader of Iraq’s semi-autonomous Kurdistan region, Masoud Barzani, (R) talks to Chairman of the Islamic Supreme Council of Iraq (ISCI) Ammar Hakim (C) in Zartac Mountain, near Nineveh, October 27, 2016. (Photo by Reuters) \\nThe leader of Iraq’s semi-autonomous Kurdistan region has assured that Kurdish Peshmerga forces will not set foot in Mosul during a joint operation with the army and allied fighters aimed at liberating the Daesh-held northern city. \\n“The Peshmerga will not enter the city of Mosul,” Masoud Barzani said in a news conference with Chairman of the Islamic Supreme Council of Iraq (ISCI) Ammar Hakim, in Zartac Mountain, near the city of Nineveh, on Thursday. \\nBarzani further said the Kurdish fighters are coordinating their role in the Mosul liberation operation with the Iraqi military, adding that the collaboration will continue. \\nThe Kurdish leader further highlighted unity among different Iraqi political parties, adding that Daesh was no more a threat as most areas are back in control of the Iraqi forces. \\nLast week, the Popular Mobilization Units, a mainly-Shia military group backing the Iraqi army in the Mosul offensive, also said its forces would not march into Mosul, adding that Iraqi army soldiers and security personnel would enter the embattled city. \\nBarzani further referred to recent Daesh terror activities in the Kurdish-controlled city of Kirkuk, saying the Takfiri terror group is making desperate attempts to cover up its defeats in the Mosul battle. \\n“We were able to control the situation quickly and kill the terrorists,” the Kurdish leader said. \\nTerrorists launched several rounds of attacks in the city of Kirkuk over the weekend as Iraqi officials are focused on the Mosul offensive. \\nOn Friday, at least 100 Daesh elements went on a rampage in Kirkuk to divert an Iraqi and Kurdish military advance on Mosul. The incident left 99 civilians and members of the security forces dead as well as 63 militants, according to Iraqi security officials. Leader of Iraq’s semi-autonomous Kurdistan region, Masoud Barzani (2nd L) receives Chairman of the Islamic Supreme Council of Iraq (ISCI) Ammar Hakim (2nd R) in Zartac Mountain, near the city of Nineveh, October 27, 2016. (Photo by Reuters) \\nFor his part, Hakim highlighted the need for avoiding rifts in Iraq and staying focused on the fight against Daesh. \\nHe further stressed that a Turkish base present in Bashiqa near Mosul was not welcome. \\n“This (Turkish) base, and the forces that came to the base, were present without coordination with the Iraqi government. They are armed forces, and we strongly refuse the participation of any non-Iraqi fighter in this battle,” Hakim said. \\nLast December, Turkey deployed some 150 soldiers, equipped with heavy weapons and backed by 20 to 25 tanks, to the Bashiqa camp. \\nAnkara claimed the deployment was part of a mission to train and equip Iraqi Kurdish Peshmerga forces in the fight against Daesh, but Baghdad denounced the unauthorized move as a violation of Iraq’s sovereignty. \\nRecently, Ankara claimed that his country is involved in the Mosul operation, but Baghdad denied such a role. \\nLast week, the Iraqi army, volunteer Shia and Sunni fighters as well as Kurdish Peshmerga forces launched a long-awaited operation to wrest control of Mosul, the last stronghold of Daesh in the Arab country. \\nMany believe that the recapture of Mosul, which fell to Daesh in 2014, would signal the terror outfit’s total defeat in Iraq. \\nIraqi Special Forces commanders said Thursday that the Mosul operation was proceeding as planned and they were now waiting for further gains in the south before resuming their push toward the city. \\n“The operation has not been stopped and is proceeding as planned,” Special Forces Brigadier General Haider Fadhil said. \\nIn another development on Thursday, the US estimated that up to 900 Daesh terrorists have been killed in the Mosul liberation operation so far. \\nGeneral Joseph Votel, the head the US military’s Central Command, said the operation was taking a heavy toll on the Takfiris. \\nThere are between 3,500 and 5,000 Daesh elements in Mosul and up to another 2,000 in the broader area, according to US figures. \\nMore Daesh tunnels uncovered \\nAlso on Thursday, Iraqi troops discovered several tunnels used by Daesh terrorists in recently recaptured villages of Bartella and Bazwaia, located between 5 and 7 kilometers east of Mosul. \\n“When we entered the Khazna Taba neighborhood (in Bartella) and after we liberated it, we found several tunnels,” said Razed Qusai al-Kinani, a member of Iraqi Counterterrorism forces. \\nOne of the tunnels, which is 200 meters long and 10 meters deep, was used by Daesh for meetings and allowed the terror outfit’s ringleaders to move around during the battle, he added. \\nElsewhere in the village of Tob Zawa, the Iraqi troops found a tire shop that had been converted into a factory for making roadside bombs and attaching armor to vehicles. \\nThey also discovered another tunnel in the village equipped with fans and lights that ran from beneath a mosque out to a road. Loading ...'"}, "time": 1742562024.5274858}