{"duration": 0.016131877899169922, "input_args": {"text": "'Prev post Page 1 of 3 Next \\nFor as long as many of us can remember, we have purchased antibacterial hand soap and body washes, believing that were beneficial to our overall health and cleanliness. However, recent research and an order by the FDA seems to show otherwise. It could also show that some of the ingredients in these products could be harmful with long-term use. The findings are causing many of us to rethink what we know about staying clean. \\n“Consumers may think antibacterial washes are more effective at preventing the spread of germs, but we have no scientific evidence that they are any better than plain soap and water,” says the director of the FDA Center for Drug Evaluation and Research, Dr. Janet Woodcock. “In fact, some data suggests that antibacterial ingredients may do more harm than good over the long-term.” \\nThe Food and Drug Administration recently issued a press release regarding some of the ingredients in common antibacterial hand soaps and body washes. In the statement, the FDA states that they are ordering manufacturers to remove certain ingredients that were originally believed to kill germs. \\nIn the press release, the FDA states , “The U.S. Food and Drug Administration today issued a final rule establishing that over-the-counter (OTC) consumer antiseptic wash products containing certain active ingredients can no longer be marketed.” \\nThe ruling is regarding an investigation that dates back to 2013 targeting certain ingredients that may be harmful to the public. The FDA had received pressure from environmental groups and law makers regarding these ingredients and the effects they had shown in lab animals. The new ruling applies to 19 different chemical agents found in common antibacterial soaps. The most common of these were triclosan and triclocarban. \\n“Companies will no longer be able to market antibacterial washes with these ingredients because manufacturers did not demonstrate that the ingredients are both safe for long-term daily use and more effective than plain soap and water in preventing illness and the spread of certain infections,” states the press release from the FDA. “Some manufacturers have already started removing these ingredients from their products.” \\nSoap manufacturers will have one year to remove these chemicals and are no longer allowed to market products containing them. This is because the chemicals were found to be either harmful or to provide no additional benefits as washing with regular soap. Prev post Page 1 of 3 Next Be the first to comment Leave a Reply Your email address will not be published. Comment '"}, "time": 1742628587.7155683}