{"duration": 0.04969525337219238, "input_args": {"text": "'Home › POLITICS › LYNCH OBJECTED TO COMEY’S DECISION TO NOTIFY CONGRESS OF EMAIL REVIEW LYNCH OBJECTED TO COMEY’S DECISION TO NOTIFY CONGRESS OF EMAIL REVIEW 0 SHARES \\n[10/29/16] Attorney General Loretta Lynch and Deputy Attorney General Sally Yates objected to FBI Director James Comey’s decision to notify Congress about his bureau’s review of emails related to Hillary Clinton’s personal server, law enforcement officials familiar with the discussion said. \\nComey decided to disregard their objections and sent the letter Friday anyway, shaking the presidential race 11 days before the election and nearly four months after the FBI chief said he wouldn’t recommend criminal charges over the Democratic nominee’s use of the server. \\nThe officials acknowledged there was little Lynch and Yates could do given the fallout over Lynch’s controversial meeting over the summer with former President Bill Clinton. \\nLynch and Yates objected after Comey gave advance notice to top officials at the Justice Department before sending the letter to lawmakers, law enforcement officials briefed on the matter said. Justice officials didn’t sign off on Comey’s decision and he didn’t seek their approval, one official said. \\nInstead, he made an independent decision to go against longstanding Justice Department and FBI practice to not comment publicly about politically sensitive investigations within 60 days of an election, the official said. \\nComey later explained his decision to provide Congress with the information in a letter to FBI employees. \\n“We don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed,” Comey said. “I also think it would be misleading to the American people were we not to supplement the record.” \\nClinton’s campaign and allies quickly decried the decision’s timing, and the candidate herself on Friday forcefully called on the FBI to release the “full and complete facts” about its review. \\n“Voting is underway, so the American people deserve to get the full and complete facts immediately,” Clinton said at a brief news conference in Des Moines, Iowa, adding it was “imperative that the bureau explain this issue in question, whatever it is, without any delay.” \\nClinton said she was “confident whatever (the emails) are will not change the conclusion reached in July,” when Comey said he wouldn’t recommend criminal charges in the matter. \\nRepublican nominee Donald Trump, who has spent the past several weeks on defense, seized on the issue. \\n“Hillary Clinton’s corruption is on a scale we’ve never seen before,” Trump said at a rally in Manchester, New Hampshire. “We must not let her take her criminal scheme into the Oval Office.” \\nHe later responded to Clinton’s statement, saying she “tried to politicize the investigation by attacking and falsely accusing the FBI director of only sending the letter to Republicans.” \\nIn a letter to eight congressional committee chairmen Friday, Comey said investigators are examining newly discovered emails that “appear to be pertinent” to the email probe. \\n“In connection with an unrelated case, the FBI has learned of the existence of emails that appear pertinent to the investigation,” Comey wrote the chairmen. “I am writing to inform you that the investigative team briefed me on this yesterday, and I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation.” Post navigation'"}, "time": 1742562084.7729917}