{"duration": 0.1131432056427002, "input_args": {"text": "'Waking Times \\nToday, the government has returned in force, in multiple busses brimming with militarized police and tactical weaponry, all for some peaceful non-violent protesters. Arrests have already begun at the “front-line camp,” a no-fly zone has been instituted, and cell and internet coverage have been shut-down; all the more reason to question the legitimacy of this pipeline and the people from whom the land is being taken , as clearly the desire is to have as little coverage of this as possible. \\nAsk yourself why, despite the national outcry against the DAPL and others like it, and virtually zero support save for corporate and governmental entities, the US government is unfaltering in its push to accomplish this environmentally damaging, unconstitutional defiling of land that will put to risk, not only multiple states’ well-being, but desecrate sacred Native-American land. It’s not enough that this entire nation is built on the robbery of land from an entire race of people, but it appears the government has returned to finish the job. \\nNow this may seem sensationalist to many, but for those who have been following the story in North Dakota, the level of totalitarian police state control that is being witnessed is staggering. From stars such as Shailene Woodley being singled out from thousands involved and arrested for simply participating in a peaceful protest(as if to make a clear point to other famous Americans with a conscious), to children and senior citizens getting attacked and treated like criminals for attempting to stand, in a non-violent fashion, and fight for their rights as Americans; the original ones at that. Journalists are even getting arrested and charged just for trying to cover this extremely relevant story . \\nAfter being outlasted and outmanned, the government had recently chosen to leave the scene, claiming a lack of man-power to remove the protesters. This left many to hope that they might have come to their senses and realized that this level of resistance and this type of national story wasn’t worth it; or that the government realized that they should be fulfilling the will of the people and not fighting for some faceless corporate entity … but those wishful thinkers clearly didn’t realize how dedicated the US government is to maintaining its symbiotic relationship with its corporate sponsors , and its unwavering ability to disregard the Constitution when it suits their needs. \\nAside from the obvious constitutional violations, one must consider that the leaking and spilling of these pipelines in the surrounding areas, is a common occurrence . If recent years have shown us anything, it’s that environmental catastrophes such as these are the rule, not the exception. It has become so common place that these corporate giants can devastate the Amazon with a massive oil spill , and it does not even make the evening news . \\nWhat many don’t know, is that the clean-up associated with a spill from one of these pipelines, or from a tanker for instance, is massive business, and creates millions in profit for those involved . Connections between the oil companies and the groups hired to conduct the oil clean-up are quite apparent, but with the infectious nature of corporate influence today, these companies no doubt have clear connections with just about every one of relevance. That being said, the mutually beneficial partnership that exists in this dynamic is nonetheless alarming. BP makes enough in under a week to cover much of the costs that go along with such an intensive clean up. In an article by Think Progress , they outline this absurdity following the Gulf spill : \\nFor now, at least, BP’s prodigious costs combating the oil spill in the Gulf are outweighed by prodigious profits. \\nOn Monday , BP said it spent $350 million in the first 20 days of the spill response, about $17.5 million a day. It has paid 295 of the 4,700 claims received, for a total of $3.5 million. By contrast, in the first quarter of the year, the London-based oil giant’s profits averaged $93 million a day. \\nThe amount of oil leaking into the Gulf of Mexico has been estimated at 5,000 to 25,000 barrels a day. In the first quarter, BP produced 2.5 million barrels of crude oil a day worldwide\\u200a—\\u200aand it received $71.86 for every barrel. \\nWhen confronted with the astounding level of profit that these oil companies make in a given day, it is very clear that, to them, the losses taken were inconsequential, which gives them all the more motivation to play it fast and loose next time around. It is also clear that they make enough money to spend more to ensure this simply no longer happens if they truly wanted to, yet, they instead choose to play chicken with the world’s ecosystem, as the US government seems to have no problem turning a blind eye when it pertains to any such industry. \\nThe continual profit being made by cutting corners and forgoing precautions, due to their lack of concern of actually being held accountable, surpasses the minuscule cost to them of hiring their clean-up company, from which they no doubt receive some sort of kickback and most likely have on speed dial. “At $93 million a day in profits, BP makes $350 million in about 3.8 days. The Washington Post noted that Exxon, through a decision by the Supreme Court, was able to pay only $507.5 million of the original $5 billion in punitive damages that it had been assessed for the 1989 Valdez disaster.” So even when being “held accountable,” if you can call it that, these monolithic companies get let off with a proverbial “slap on the wrist” when considering the amount of profit they generate in a given year. \\nSome would even go as far as to make the claim that companies will intentionally create circumstances that make these type of disasters more of a possibility, just to create an artificial demand, hire their go-to clean-up company, and start the process all over again. And many are unaware that deliberate discharges from oil tankers have traditionally been the biggest source of oil pollution from ships, greater than the accidental spills by far, and they are common-practice. So either way, this entire industry is one big environmental disaster that continues to grow with dependence upon it. \\nThese pipelines, such as the one being forced upon the Standing Rock Sioux Tribe in North Dakota, are put in as quickly as possible by the lowest bidder with little to no concern for the preservation of the local lands. The only motivation given to the locals, if any, is that there will be an increase in jobs from the pipeline(while being built), but that is hardly worth the environmental destabilization of ones homeland. This does not even take into consideration the detrimental effects of the drilling and construction work alone, but that aside, one single leak can cause generations of problems, that in many cases will never be recovered, such as an endangered species . Yet sadly, this country has all but forgotten about the damaging effects its industry can have on our co-inhabitants of this planet. \\nAs this atrocity continues in the face of public resistance and nationwide protest, ask yourself if this feels like the democracy politicians so fervently claim we have (even though it should be a republic), or the freedom we are continually told the world begrudges us. Ask yourself if the will of the people ever truly dictates the path of the United States, or if that is simply what we are told. About the Author \\nRyan Cristian is the author of website, The Last American Vagabond . \\nSources:'"}, "time": 1742563189.2980416}