{"duration": 0.10140323638916016, "input_args": {"text": "'When it comes to Europe’s lengthy investigations into Google, Margrethe Vestager, the region’s competition chief, is hoping that the third time’s a charm. Ms. Vestager announced on Thursday a new round of antitrust charges against the company  —   the third set since early 2015  —   claiming that some of the company’s advertising products had restricted consumer choice. The efforts are part of her continuing  push to rein in Google’s activities in the European Union, where the Silicon Valley company has captured roughly 90 percent of the region’s online search market. “Google’s conduct, based on our evidence, is harmful to consumers,” Ms. Vestager told reporters in Brussels on Thursday. “Google’s magnificent innovations don’t give it the right to deny competitors the chance to innovate. ” The announcement represents a setback for Google, which vigorously denied any wrongdoing in two previous European antitrust charges linked to Android, its popular mobile operating system, and some of its dominant online search services. It also comes at a difficult time for Europe’s competition authorities, which have been unable to land a knockout punch against Google’s perceived abusive activities in the region, despite investigations that date back to 2010. The stakes are high. Google could face fines of up to 10 percent, or about $7 billion, of its global annual revenue if it is found to have broken Europe’s tough competition rules. For months, both sides have been jockeying for position, with Google already filing lengthy legal arguments about why it believes its European activities are lawful. Ms. Vestager’s antitrust charges are just one of a number of regulatory challenges to Google’s activities in Europe, ranging from tax investigations in France and Spain to concerns that Google does not fully protect people’s online privacy rights. The company denies any wrongdoing. Other Silicon Valley technology companies, including Amazon, Apple and Facebook, have also faced regulatory investigations in Europe, raising questions over whether the region’s lawmakers are specifically focusing on these American giants, which have come to dominate much of the digital world. European officials deny any such bias. Google said in a statement on Thursday that it would provide a detailed response to Europe’s latest charges, but it added, “We believe our innovations and product improvements have increased choice for E. U. consumers and promote competition. ” The company has until the fall to respond. American competition officials have also reviewed claims that Google abused its market position to favor its services over those of rivals, though the Federal Trade Commission has yet to find any violations. Europe’s new antitrust charges represent a further ratcheting up of the region’s often frosty relationship with Google. In particular, European antitrust officials are taking aim at some of the company’s online advertising tools  —   the main engine for Google’s $75 billion in annual revenue. They say that the company may have abused its dominant market position when offering some of its search products on   companies’ websites. These businesses  —   including publishers and online retailers  —   can use Google’s search engine on their sites so that people can find information like newspaper articles or promotions. Such agreements with   companies, which date to 2006, also include showing   advertising next to search results, often provided by Google. Ms. Vestager said on Thursday that the technology company may have abused its dominance  —   it holds roughly an 80 percent market share in this type of niche   search  —   by forcing companies to sign onerous contracts that limited competition and reduced consumer choice. Since 2009, Google has made it easier for advertising rivals to show their offerings alongside its services. But Europe’s competition chief said that Google still required   companies to show a minimum number of   ads on their site. The Silicon Valley company also requires businesses using the service to ask for approval on where some rivals’ ads may be shown on their websites. “All these restrictions allowed Google to protect its market share and stifle competition,” Ms. Vestager said. Europe’s antitrust authorities have also doubled down on a previous competition charge, announced last year, which claimed that Google had diverted traffic from competitors in favor of its own   site. On Thursday, Ms. Vestager said her team had found new evidence to buttress their claims, adding that because of Google’s actions, European consumers may not have access to the most relevant search results when looking online for goods and services. Yet when asked about the failure of European antitrust authorities to order fines or changes to the way Google does business, despite several years of investigations, Ms. Vestager said she aimed to ensure the charges against the company stood up in European courts. “Speed is of the essence,” but “the other side of that coin is quality,” Ms. Vestager said on Thursday. “Sometimes that kind of quality comes at the cost of speed. ”'"}, "time": 1742563524.26595}