{"duration": 0.1179053783416748, "input_args": {"text": "'Good morning.  Here’s what you need to know: • President Trump’s foreign policy was tested over a weekend of golf diplomacy with Prime Minister Shinzo Abe of Japan when North Korea launched a ballistic missile. Mr. Trump reacted with surprising restraint, intent on showing that he would not be baited into a confrontation. The president’s   positions are proving less radical than forecast on China and other countries. He meets with Prime Minister Justin Trudeau of Canada today and Prime Minister Benjamin Netanyahu of Israel on Wednesday. _____ • The whiplash legal drama over Mr. Trump’s immigration actions is likely to continue. Mr. Trump said he might sign “a   order” today to replace the travel ban a judicial panel refused to reinstate. Here’s a look at his options. For now, refugees and travelers from seven predominantly Muslim countries can continue to enter the U. S. but undocumented immigrants are bracing for a surge in deportations. Some are fleeing to Canada. Here is a    tracker of Mr. Trump’s cabinet and agenda. _____ • The mystery over a missing Chinese billionaire deepened. People who have seen security video from a luxury hotel in Hong Kong say Xiao Jianhua, one of China’s wealthiest financiers, above, was taken away last month in a wheelchair, his head covered by a blanket, by about half a dozen men. He is believed be in custody on the mainland. Why is unknown, but Mr. Xiao, as the de facto banker to the Communist Party elite, stands to know a great deal about the financial holdings of the country’s leading political families. _____ •  In Indonesia, fears are rising that the incumbent governor’s quest for   on Wednesday is creating a backlash against other   a tiny but often resented minority who have a long history of being persecuted. Fake news stories link them to dark plots, suggesting that Beijing will invade Indonesia and that China is poisoning Indonesians by exporting contaminated chili seeds. _____ • “I closed my eyes and played dead. ” That is how a terrified    fruit and vegetable vendor survived a drug raid that ended like so many others in the Philippines, with all the suspects shot by the police. The victim’s testimony is at the heart of the first court case to challenge the brutal antidrug campaign of President Rodrigo Duterte. Above, the mother of a victim. _____ • And an epic Grammy Awards showdown has begun. Beyoncé and Adele compete for best album, record and song. There will be musical tributes to Prince and George Michael, and politics may emerge in performances or speeches. Here is our full coverage. The musical world will be mourning Al Jarreau, a supple vocalist who sold millions of records and won Grammys for his work in jazz, pop and RB. He died at 76. _____ • Yum China is gambling that a reinvented Taco Bell, with dishes like a shrimp and avocado burrito, will recapture the lost allure of American   chains. • Japan  is rethinking tight restrictions on immigration that led to a labor shortage, even as it created a murky, sometimes abused class of   technical trainees brought in from abroad. • China’s Geely Automobile Holdings looks set to buy a controlling stake in Malaysia’s Proton carmaker, which would enable Geely to ship cars   to the entire ASEAN market. • OPEC publishes oil output numbers for January, the first month of production cuts agreed to in December. • Here’s a snapshot of global markets. • Cooler temperatures brought hope in Australia’s New South Wales after a “catastrophic” day of extreme heat and more than 100 fires. [ABC] • Indian security forces in Kashmir fought militants with the group Hizbul Mujahedeen for 12 hours. [The New York Times] • Sam Rainsy resigned as head of Cambodia’s opposition party after Prime Minister Hun Sen threatened to dissolve all parties led by individuals convicted of crimes. [The New York Times] • Japanese conservationists are worried about rare species in an area used for U. S. Osprey   aircraft, including the endangered Okinawa woodpecker. [Asahi Shimbun] • Tiger Woods has pulled out of next week’s Genesis Open in Los Angeles and the Honda Classic the week after in Florida. It is his fifth set of   absences since his   season in 2013. [The New York Times] • We’re in Week 3 of our New Year’s resolution month, when we’re helping you stick to your goals. There’s still time to participate if you haven’t joined already. Sticking to your resolution can be a lot easier with a support system to keep you headed in the right direction. Some ideas that may help: Pursue a financial tuneup with the help of a detailed checklist turn your Instagram feed into a visual, social support group to stick to your diet or even use wearable devices that deliver shocks to keep you from reverting to old habits. We’d love to hear what support systems work for you in keeping your resolutions. Email us, and on Thursday we’ll share some of our favorites. • Recipe of the day: If you’re the type who plans for Valentine’s Day, chicken confit is the recipe you need. • Valentine’s Day is tomorrow. Romantics can check out our latest Modern Love podcast or revisit one of the column’s perennially most popular entries: “The 36 Questions That Lead to Love. ” • Having ”way too much fun” to retire. Women in their 60s and 70s have become significantly more likely to stay on the job at an older age, many out of enjoyment as much as obligation. • And Jiro Taniguchi, a Japanese manga artist and writer renowned for works like “The Times of Botchan” and “The Walking Man,” died at 69. Mail delivery has always been a headache in the archipelago kingdom of Tonga, where some addresses are no more than a village and island name. “Undelivered mail piles up,” said Siosifa Pomana, the head of Tonga Post. “We often have to rely just on the description: In this village, on the left, there is a mango tree and on the right there’s a guy with two dogs,” he said. “It’s very difficult. ” But this week, he’s beginning to unroll a new address system that will pinpoint residents across the country’s 36 inhabited islands. The system, developed by a     is called what3words. It divides the entire planet into 3 meter by 3 meter squares, identifying each with a unique string of words. For the New York Times office in Manhattan, it’s “zest. ropes. along. ” For the Tonga Post headquarters, it’s “international. bashfully. placidity. ” That’s in English  —   users can also find   identifiers in French, Spanish, Portuguese, Swahili, Russian, German and more. Mongolia, Ivory Coast and St. Maarten have signed on. The Red Cross uses it in the Philippines for disaster relief. One consequence in Tonga, Mr. Pomana said, will be more postal work: “This is going to spike up our inbound mail. ” Patrick Boehler contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742561788.644394}