{"duration": 0.06312775611877441, "input_args": {"text": "'Home / Be The Change / Antiwar / United Nations Finally Acknowledges US-Backed Rebels in Syria are Murdering Civilians United Nations Finally Acknowledges US-Backed Rebels in Syria are Murdering Civilians Baran Hines November 2, 2016 Leave a comment \\nUnited Nations Special Envoy for Syria Staffan de Mistura stated Sunday that he is “appalled and shocked by the high number of rockets indiscriminately launched by armed opposition groups” which have killed hundreds of civilians in Aleppo during recent weeks. The attacks from groups supported by the United States were described as “ relentless and indiscriminate” while targeting civilians and killing children, according to the statement released by de Mistura’s office. \\nThe battle for eastern Aleppo has become more violent as the Syrian army continues to regain control of the strategic city while targeting the UN designated terrorist group Jahbat Al Nusra, which is known as Al Qaeda in Syria. Most of the attacks by opposition groups have targeted civilians as almost 100 civilians were reported killed in 3 days in western Aleppo, which is controlled by the Syrian government. \\nUS officials and others claim that opposition groups supported by the United States are also being targeted by the Syrian army and civilians are being killed. However, US-backed groups have continued to work directly with Al Nusra in Aleppo, and, for more than six months, have refused requests by the United States and Russia to separate from terrorist groups. \\nUN Envoy Staffan de Mistura condemned the attacks by these groups because they continue using inaccurate weapons to launch attacks which are claimed as self-defense against the attacks from the Syrian army. \\n“Those who argue that this is meant to relieve the siege of eastern Aleppo should be reminded that nothing justifies the use of disproportionate, indiscriminate [attacks,] including heavy weapons on civilian areas and it could amount to war crimes,” de Mistura said. \\nOpposition groups have also used chemical weapons with the most recent attack occurring on October 30, killing 3 and injuring 40 civilians in western Aleppo areas controlled by the government. Non-governmental organization Amnesty International said the attacks show “ a shocking disregard for civilian lives ” in a statement released Monday. \\n“ The goal of breaking the siege on eastern Aleppo does not give armed opposition groups a license to flout the rules of international humanitarian law by bombarding civilian neighborhoods in government-held areas without distinction ,” said Samah Hadid , a senior Amnesty official in the Beirut regional office. \\nThe Syrian war has seen an increase in violence after the collapse of the September 9 ceasefire agreement negotiated by diplomatic officials from the United States and Russia. Opposition groups contributed to the collapse of the ceasefire after violating the ceasefire over 300 times in the first two weeks, according to the Syrian news agency SANA . Amnesty International also cited the United States being responsible for more than 300 civilian deaths in recent weeks. \\nThe ceasefire agreement called for Russia to influence the Syrian government forces to stop fighting for control and for the US to influence rebel groups to separate from terrorist groups Al Nusra and Islamic State so they could be targeted by joint US-Russia military campaigns. The US has failed to achieve this since February 2016 despite US officials claiming to be in daily contact with rebel groups. \\nAnother significant incident causing the Syrian ceasefire to fail was the September 17 attack by the United States on Syrian troops fighting the Islamic State near the city of Deir Ezzor, killing more than 80 troops and wounding over 100 others — including civilians. That incident, which the US called an accident, led to public accusations from Russia that the US is intentionally helping the Islamic State. \\nA few days later on September 19, Russia was accused by the US of bombing a United Nations aid convoy for Aleppo, a charge denied by Russia citing forensic evidence indicating that the attack was not an airstrike. The ongoing public tension led to the United States ending direct negotiations with Russia over the Syrian conflict on October 3 , and both sides have since traded public declarations which many see as heightened war rhetoric . Share'"}, "time": 1742562122.9629006}