{"duration": 0.13450193405151367, "input_args": {"text": "'About 5, 000 years ago, 10 donkeys were laid to rest in painstakingly constructed brick grave chambers at a site connected with one of the earliest Egyptian kings. They were buried in a place of importance, “where the highest lords would be,” said Fiona Marshall, an archaeologist at Washington University in St. Louis who studies the domestication of donkeys. Because of their importance in trade across the Sahara, she said, donkeys had “superhigh status. ” Unfortunately, even the most passionate defenders of donkeys recognize that the animal they love gets little respect in the wider world today. Veterinarians, donkey rescuers and donkey defenders gathered recently for the fourth annual Donkey Welfare Symposium at the Cornell University veterinary school in Ithaca, N. Y. to talk about the problems faced by an animal often at the bottom of the ladder of human regard. “Donkeys are the least of the least,” said Eric Davis, the veterinarian from the University of California, Davis, who started the symposium. He travels with other vets to provide free care to donkeys in many places where none is available. Donkeys are sometimes abused and, in the worst cases, slaughtered for gelatin and for meat. Fortunately, as the symposium made clear, the animals are not friendless. Their benefactors may not be large in number (conference attendance was 77) but they are as fierce in their loyalty as donkeys are in defense of their territories (more about donkey fierceness later). They are also devoted to debunking donkey myths. You may have heard, for instance, that donkeys are stubborn. But Ben Hart, a trainer who works for the Donkey Sanctuary in Britain, put it this way: “Anybody who says a donkey is stubborn has been outsmarted by a donkey. ” They are cautious, he said, not contrary. They like to think before they act. The reason may be that their ancestor, the African wild ass, is not a herd animal. Wild asses have individual territories, and each must decide where to go and when to eat, run or fight. Donkeys have retained some of that thoughtful intelligence, said Dr. Marshall, who was not at the symposium. They like to decide for themselves. So if you try to lead a donkey over a shadow on the ground that looks a bit like the edge of a cliff, the donkey may balk. That’s what Balaam’s donkey did in the Bible. It refused three times to go forward even though its master had insisted. He beat it for its apparent balkiness, and the donkey, the only animal in the Bible other than the serpent to speak, said, “What have I done unto thee, that thou hast smitten me these three times?” The donkey was quite sensibly avoiding a very threatening angel with a sword, who explained to Balaam after the fact that if it had not been for the animal’s sagacity, Balaam himself would have died by the angel’s sword. Although donkeys may avoid armed angels and can run when threatened, that isn’t their usual reaction to predators. That’s when they become fierce. “A donkey will stand and fight,” said Mark Meyers, who runs Peaceful Valley Donkey Rescue in Miles, Tex. and had brought donkeys to the symposium for adoption. He and others at the meeting said donkeys would attack dogs, coyotes or foxes. There has been at least one report of a donkey attacking a mountain lion. That is why donkeys are kept to protect sheep, goats and other animals. That’s right. Guard donkeys. Google them. Their history with humans, of course, is as the ultimate beasts of burden. And among the earliest. The donkey, not the camel, opened up the Sahara, Dr. Marshall said, enabling trade between Egypt and Mesopotamia. That is why those 10 were buried with a king. Camel caravans did not appear until about 3, 000 years ago. The first donkeys were probably domesticated about 6, 000 years ago, and their importance was evident in those    burials. Since then, donkeys have carried building stones, food, trade goods, ammunition and people, including Jesus when he rode into Jerusalem on the day Christians celebrate as Palm Sunday. And yet museums are full of celebrations of horses, not donkeys. “It’s so galling, when you become an eccentric donkey person,” Dr. Marshall said. True, they are not the most exciting animals. Unlike their equine cousins, “donkeys have two speeds: slow and slower,” the saying goes. But the gap in prestige between the elegant horse and the dumpy donkey is of human doing. African wild asses  —   of which there are perhaps 600 left in nature  —   are “magnificent wild animals,” Dr. Marshall said, “really elegant and fast and feisty as anything. ” And they are the animals from which the first donkeys were bred. The first horses, she said, “were short, stubby little things, sort of like a barrel on legs. ” People bred them to be   racers and great jumpers, just as the lithe wild ass was bred to become a stubby little donkey. One nonscientific claim about donkeys is that they are lovable, and they are. I stood in a corral with Ben Hart while he spent half his time scratching the ears of one donkey that chased away 10 or so others who wanted to get in on the petting. Kimberly Brockett, who keeps mammoth donkeys at Tripledale Farm in Guilford, Conn. said, “It’s a dog you can ride. ” In the United States and Britain, a number of organizations work to rescue donkeys that are poorly cared for or abused. Groups like the Donkey Sanctuary in England and Brooke: Action for Working Horses and Donkeys support education and veterinary care. But many donkeys are not kept as pets or working animals, but slaughtered for their meat or hides. Philip Mshelia, a veterinarian from Nigeria, spoke at the symposium about the suffering of donkeys in Africa. They have been slaughtered without regulation in several countries for food and for shipment to China, where a gelatinlike substance, or ejiao, from their hides is used in medicines. Because tens of thousands of donkeys have been killed, Burkina Faso and Niger  banned the export of donkeys this year. Dr. Davis warned those at the conference that the future may hold more such horrors. Even though the number of donkeys is increasing, he said, global economic development might well mean that tractors, cars and trucks will become available to the poor who now depend on donkeys. What happens to donkeys then may be what happened to horses in developed countries as cars and trucks replaced them  —   widespread slaughter. If that happens, he added, donkey lovers might have to work to make their inevitable deaths as humane as possible. Dr. Davis spoke by telephone at 7 a. m. one recent morning, fresh from feeding the five donkeys that he and his wife keep. Asked why people who do not have or know donkeys should care about them, he said, “Much of human civilization was created because there were donkeys to move pastoralists and traders around the world. ” “I think that we as a species owe something to donkeys. ”'"}, "time": 1742563808.3795786}