{"duration": 0.10165953636169434, "input_args": {"text": "'This week, we meet for breakfast to talk through our conflicting feelings about the new film “When the Bough Breaks,” the No. 2 movie in America. Jenna loved it Wesley not so much. We also decode the inherent racism of the sharing economy. Airbnb recently issued a report about how they plan to fight discrimination on the site. One of the proposed solutions is to make the avatar photos of   smaller, making it harder to discriminate. Um, what? “I’ve got to be honest with you,” Wesley tells Jenna on the show. “If AirbnB wants to make the avatars smaller, make mine twice as big! If you don’t want me staying in your house, don’t front like you’re happy to have me. ” “This moment of reckoning is bigger than has ever happened before with the whole tech wave,” Jenna says. ”The fact that we have these founders that want to be woke,” Jenna says, is a big step in the right direction. But even with that awareness, she says, the fact remains: “You can’t code yourself out of racism. ” We also bring in the dance writer Shanti Crawford to review the moves we watched at the United States Open. From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “Still Processing” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for “Still Processing” and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742564254.5860827}