{"duration": 0.10226845741271973, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump is expected to choose as director of national intelligence   Senator Dan Coats, a former ambassador to Germany, secret foodie and lover of all things Indiana who also served as a member of his chamber’s Intelligence Committee. Known for a   style, Mr. Coats was popular among his colleagues. “I always thought he should wear a red cardigan,” said Senator Cory Gardner, Republican of Colorado. “He was the closest thing to Mister Rogers we could come up with. ” While fiscally conservative, Mr. Coats, an Indiana Republican who completed his second Senate stint this month, often found common cause with Democrats, who described him as thoughtful on intelligence and national security issues, with a sharp intellect and disarming humor. “I have always been impressed with his demeanor,” said Senator Angus King, a Maine independent who caucuses with the Democrats, and who served on the Intelligence Committee with Mr. Coats and traveled with him in Eastern Europe. “He’s not a fierce partisan and knows the intelligence community. He’s very amiable and easy to work with. ” The position of America’s top intelligence official was created by Congress in 2004, as a response to criticism that the nation’s spy agencies had failed to detect and prevent the terrorist attacks on Sept. 11, 2001. Since then, the director has been charged with coordinating the   and analysis of the country’s 16 civilian and military spy agencies, helping to prevent a terrorist attack and serving as a central liaison to presidents and their White House staff. But bureaucratic turf wars have dogged the office of the director of national intelligence since its creation. Officials who run the C. I. A. and the Defense Intelligence Agency, among others, have sought to maintain control over parts of the spying apparatus, and to exert influence with presidents and members of Congress. In 2009, for example, Leon E. Panetta, President Obama’s incoming C. I. A. director, clashed with Dennis C. Blair, the director of national intelligence at the time, after Mr. Blair sought to select the top American spies for overseas postings. Mr. Panetta sent a dispatch to the agency’s employees telling them to ignore Mr. Blair’s message  —   an assertion that the C. I. A. was in charge. The rivalries have weakened the national intelligence office and led some critics in the government to question its effectiveness. The year that Mr. Obama took office, an internal report criticized the office of national intelligence for adding to  —   not removing  —   bureaucratic bloat and doing little to end the tensions among the various spy agencies. In 2010, James R. Clapper Jr. the current director of national intelligence, insisted during his Senate confirmation hearings that he would not be a “hood ornament,” saying that despite the inherent limitations on his job, he would try to bring an end to turf battles among the nation’s spy agencies. Six years later, the job appears to have limited appeal to some intelligence professionals, several of whom were not eager to serve in the position for fear that they would not be empowered. Mr. Coats had been an early and strong contender for secretary of defense in the first term of President George W. Bush, until Mr. Bush’s vice president, Dick Cheney, successfully pressed for Donald H. Rumsfeld. Mr. Coats, 73, graduated from Wheaton College in Illinois, and served in the Army before studying at the Indiana University Robert H. McKinney School of Law. He began a career in life insurance in Fort Wayne, Ind. before joining the office of   Dan Quayle as a district representative. Mr. Coats owed much of his political career to his ties to Mr. Quayle, the former vice president. Mr. Coats won Mr. Quayle’s House seat in 1980, the year the latter was elected to the Senate. After Mr. Quayle was elected vice president in 1988, Mr. Coats was appointed to fill his seat he served on the Senate Armed Services and Intelligence Committees. In 1998, Mr. Coats decided to not seek   largely because the Democratic challenger, Evan Bayh, was considered unbeatable. In 2001, Mr. Coats was named ambassador to Germany, arriving only three days before the Sept. 11 attacks. “Ambassador Coats found himself thrown into a role he couldn’t have foreseen a day earlier, a role in which he would excel but one that would forever change him,” Senator Mitch McConnell of Kentucky, the Republican leader, said on the Senate floor last year in remarks praising Mr. Coats. “Those who know Dan Coats say that day in September affected him profoundly,” he said. “He may not have known it then, but he would feel the tug of that responsibility many years later, and answer the call. ” After a brief foray into lobbying, Mr. Coats returned to the Senate in January 2011, serving again on the Intelligence Committee. Mr. Coats was also one of only a few Republican senators who supported compelling Congress to officially authorize the use of military force abroad. “You’re asking our sons and daughters to take up our cause,” he said, “and every person who is here has to decide with their own conscience if that’s something we’re going to do. ” Mr. Coats enjoys visiting restaurants both in Indianapolis and in small hamlets that serve    food, and featured several interesting restaurants and food purveyors when it was his turn to host lunch for his Republican colleagues.'"}, "time": 1742563367.5126266}