{"duration": 0.15100574493408203, "input_args": {"text": "'LOS ANGELES  —   “The Great Wall,” an epic fantasy film that cost at least $150 million to make, opens with Matt Damon fleeing on horseback through red stone formations in Northwest China. A snarling swarm of   green monsters is hot on his heels. One fast plot twist later, he stands atop a monumental stone wall, one guarded by thousands of Chinese warriors in dazzling uniforms. Cut to generals with furrowed brows fretting in Mandarin as the monsters come tumbling over a hill. Will their megastructure do its job? The same question, more or less, faces “The Great Wall” as it begins its global theatrical release. The movie, filmed entirely in China, was engineered not just as escapist entertainment but also proof that the Chinese film industry can serve up global blockbusters too  —   that event films can rise in the East and play in the West. The last   film to become a breakout hit in North America was “Crouching Tiger, Hidden Dragon,” which awed with its martial arts and stunt work and took in a surprising $180 million in 2000, after adjusting for inflation. “If this doesn’t work, then I don’t know what will,” said Stanley Rosen, a   professor at the University of Southern California who has studied China’s efforts in recent years to emerge as a moviemaking superpower. “The film addresses a lot of the previous issues that China has faced as it’s tried to internationalize its film industry, like language and the lack of internationally known stars. ” “The Great Wall” passed its first test. Released in Chinese theaters on Friday, the movie collected a strong $67 million in tickets over its first three days, according to the Beijing box office tracker Ent Group. The film’s total after five days was $82 million, as much as “Fantastic Beasts and Where to Find Them” collected in China during its entire run. “Step 1 went really, really well,” said Thomas Tull, chief executive of Legendary Entertainment, which produced “The Great Wall” with Universal Pictures, China’s Le Vision Pictures and China Film Group. “Given market conditions, I feel like it was a big success,” Mr. Tull added, noting that the Chinese box office has lately been in a funk, with growth slowing sharply, partly because of a glut of fantasies. Even so, “The Great Wall” remains a long way from the box office threshold Legendary ultimately hopes to hit in China  —   $200 million or so for its full run  —   and some analysts were underwhelmed by turnout given the marketing push the film received. Before its release, expectations for the film had become as considerable as the epochal structure for which it was named. Marketing efforts included two trailers, three music videos, 60 online video ads and stunts in 260 shopping malls owned by the Dalian Wanda Group, the Chinese conglomerate that bought Legendary for $3. 5 billion in January. “It’s too soon to say,” Mr. Tull said, when asked whether he thought the film, which drew mixed reviews in China, would be profitable. The crucial test lies ahead. “The Great Wall” arrives in North American multiplexes on Feb. 17. Movie executives say prospects in the United States and Canada come down to one question: Are ticket buyers ready to embrace a film that is very much Chinese, even if it does have an American star in a lead role? “It’s daunting,” said Peter Loehr, a Legendary executive in Beijing and one of the film’s producers. “I do hope it works, but I don’t know. ” The People’s Daily, the Communist Party newspaper, even weighed in on “The Great Wall” this week, publishing a commentary following what it called “lively online criticism” of the film. “Even if it is successful in overseas markets, the road on which Chinese culture goes out to the world is bound to be bumpy,” the article said. Directed by Zhang Yimou, known for films like “House of Flying Daggers” and for orchestrating the opening and closing ceremonies of the 2008 Summer Olympic Games in Beijing, “The Great Wall” finds Mr. Damon in ancient China as William Garin, a bedraggled European mercenary. Garin and his partner (Pedro Pascal, known for Netflix’s “Narcos”) soon discover that the wall was not, as history tells it, erected to keep out invading nomads, but rather to protect against the mythical   creatures that rush the wall every 60 years in an attack on humanity. Garin spends much of the film learning about the Chinese culture of   and sacrifice. Meanwhile, there are astounding action sequences as the wall is defended (similar to the siege of Minas Tirith in “The Lord of the Rings: The Return of the King”) and a subplot involving sneaky Westerners, who covet China’s “black powder. ” Chinese stars include Andy Lau, Jing Tian and the pop idol Lu Han.   Industrial Light  Magic handled the visual effects. To appeal to international audiences, about 80 percent of the dialogue is in English. (Those portions were subtitled in Chinese for the Chinese run Western audiences will get a version that is 20 percent subtitled in English.) Mr. Zhang’s extreme   pacing and use of   effects that come straight at viewers are likely to stand out as a departure from Hollywood’s usual cinematic language, but Ms. Jing’s character may best sum up the cultural needle the movie tries to thread. Her general is at once the supreme leader (in keeping with a recent trend in Hollywood movies to depict women as every bit as tough as men) and strikingly demure when not in battle (something the filmmakers felt made her more viable to Eastern audiences). Trying to appeal to everyone often warps the result. Movie executives, citing past experiences, say that audiences leave thinking that something was off the mark, even if they aren’t quite sure what. “The biggest challenge in the film was integrating the two cultures,” Mr. Zhang said in an interview in Beijing this month. “We knew it would not be enough to rely on the novelty of the film’s Chinese elements to attract Western audiences. So we spent a lot of energy and time working on the story. ” Part of the plot  —   the inclusion of a white hero  —   has incited controversy. Some critics, judging the film by its trailers, accused Mr. Zhang of giving Mr. Damon a part that should have gone to an Asian actor, a practice known as whitewashing. In truth, the role was written specifically as  . Mr. Damon was sought for the part because he is a proven box office star around the world, including in China. “There are five major heroes in our story and he is one of them  —   the other four are all Chinese,” Mr. Zhang said in a statement when the outcry erupted online in August. “The Great Wall” will attract additional scrutiny when it arrives in the United States because it comes as some lawmakers question China’s increasingly aggressive efforts to use motion pictures to promote itself. But the movie, if successful, could foster more collaboration between Chinese and American filmmakers. It qualified under Chinese rules as an official “” a coveted governmental status that entitles   film companies to a greater share of the ticketing revenue.   receive 43 percent of   ticket sales, compared with 25 percent for typical Hollywood imports. American studios have struggled to meet the   requirements, which mandate the inclusion of “Chinese elements,” a nebulous umbrella term that touches on everything from the film’s financing to its casting, story line and shooting location. “The Great Wall” was filmed in locations across China, including in Qingdao, the eastern port city where the real    behemoth Dalian Wanda is building an $8 billion movie facility and tourism complex to attract American productions. “I have a feeling that Qingdao is going to be calling a lot of us back over the next few years,” Mr. Damon said in an interview. “It’s pretty incredible. ” But does he think “The Great Wall” will be a hit on his home turf? “I’m not really the target audience for the movie,” he said. “It’s really fun and spectacular in the true meaning of the word. But, then again, I don’t know how to predict what that will mean. ”'"}, "time": 1742561798.6099508}