{"duration": 0.12930035591125488, "input_args": {"text": "'10 Signs That An All-Out Attempt Is Being Made To Sabotage The Trump Campaign Michael’s Latest Video At This Current Pace, A Record-Shattering 2.4 Trillion Dollars Will Be Added To The National Debt This Year   17th, 2016 \\nBarack Obama is about to become the 20 trillion dollar man. With less than two months to go in his second term, the U.S. national debt stands less than 150 billion dollars away from the 20 trillion dollar mark. And at the pace that the debt is increasing, it seems almost certain that we will cross 20 trillion dollars before Inauguration Day. After promising us that “deficits are under control”, the federal debt jumped by more than 1.3 trillion dollars last fiscal year, and so far this year it is on pace to rise by a record-shattering 2.4 trillion dollars . This is a recipe for national suicide, and yet it wasn’t even a major issue during the recently concluded presidential campaign. \\nIt is really, really hard to spend a trillion dollars. For example, if you were alive when Jesus was born and you had spent a million dollars every single day since that time, you still would not have spent a trillion dollars by now. \\nAnd even though the Republicans have had control of the House of Representatives since 2010, the wild spending has not slowed down one bit. In fact, it is actually accelerating as we near the end of Obama’s second term. Last year’s rise in the debt of more than 1.3 trillion dollars was shocking enough, but this year we are on pace to top that number by more than a trillion dollars. The following comes from Simon Black … \\nAccording to data released by the Treasury Department yesterday, the US national debt has soared by a whopping $294 billion since the start of the 2017 fiscal year, just 45 days ago. \\nThat’s an annualized increase of 13%. \\nSo if they keep up this pace, the national debt will increase by $2.4 trillion this fiscal year, surpassing $21 trillion by next September . \\nThe only reason we have been able to go on this debt binge for as long as we have is because the rest of the world has been willing to loan us trillions upon trillions of dollars at ridiculously low interest rates that are well below the real rate of inflation. \\nThis is a highly irrational state of affairs, and once this changes we are going to be in a massive amount of trouble. \\nAnd since Donald Trump’s election victory, we have already seen the rate on 10 year U.S. Treasury notes shoot up dramatically . \\nOver the long-term, the average rate of interest paid on U.S. government debt has been about 6 percent. Right now we are way below that, but that cannot last forever. \\nAt some point rates will rise, and if we were to just get back to the 5 percent mark we would be paying more than a trillion dollars a year just in interest on the national debt once the debt hits $21 trillion. \\nThe bottom line is that we are racing toward national bankruptcy. \\nBut instead of focusing on getting the debt under control, Donald Trump is already promising a whole bunch of new spending in addition to what is already taking place. \\nThis week, Federal Reserve Board Chair Janet Yellen warned Congress about what Trump’s $1 trillion infrastructure spending program may mean for our financial situation… \\nPresident-elect Donald Trump has pledged a $1 trillion infrastructure spending program to help jump-start an economy that he said during the campaign was in terrible shape. \\nSpeaking on Capitol Hill Thursday, Federal Reserve Board Chair Janet Yellen warned lawmakers that as they consider such spending, they should keep an eye on the national debt. Yellen also said that while the economy needed a big boost with fiscal stimulus after the financial crisis, that’s not the case now. \\n“The economy is operating relatively close to full employment at this point,” she said, “so in contrast to where the economy was after the financial crisis when a large demand boost was needed to lower unemployment, we’re no longer in that state.” \\nThe truth is that we simply can’t afford to keep going into so much debt. \\nDebt literally destroys the future, and since Barack Obama has been in the White House our government has been stealing more than 100 million dollars an hour from our children and our grandchildren every single hour of every single day . It is a crime of such a magnitude that I don’t know if there are words to describe it, and yet only a very small fraction of the population is upset about this right now. \\nWe have just come to accept that ripping off our children and our grandchildren is normal. But someday if they get the chance they will curse us for what we have done to them. \\nIn our extreme arrogance, we actually think that it is okay to saddle them with a giant mountain of debt that they will be servicing for their entire lives. In a just society, those that have done this to future generations of Americans would be going to prison. \\nWhen you go into debt, you take consumption from the future and bring it into the present. In essence, we are taking money that they should have been able to spend, and instead we are spending it right now. \\nWithout a doubt, government spending helps the economy in the short-term. When the government spends money, it gets into the pockets of ordinary Americans who in turn spend that money on goods and services that they need. So that is why politicians like to borrow and spend – it makes the economy perform better than it otherwise would, and voters tend to vote for incumbents when “things are going well”. \\nIf the federal government had only spent the money that it took in through taxes over the past eight years, we would be in a rip-roaring depression right now. Barack Obama and those that work under him understand this, and that is why they were perfectly fine with running the national debt up to 20 trillion dollars. They will take credit for “fixing the economy”, but the truth is that all they did was steal trillions of dollars from our kids and our grandkids. \\nAnd anyone that has ever gotten into trouble with debt knows that a day of reckoning comes eventually. \\nCould our day of reckoning be just around the corner during the Trump years? \\nDonald Trump will be blamed if everything crashes while he is in office, but the real blame should be placed at the feet of Barack Obama, George W. Bush, Bill Clinton and a deeply corrupt Congress that always went along with the wild spending.'"}, "time": 1742561918.6186805}