{"duration": 0.03153634071350098, "input_args": {"text": "'Prince released music steadily from 1978 on, making for one of the most daring, radical and inventive catalogs in all of pop. Here are five of his finest albums, released at   moments in his career, that show the artist, who was found dead, at 57, on Thursday, in his fullness: a cunning vocalist, a fiery musician, and a peerless songwriter and producer. This was Prince’s third album, but the first on which his lusty   experimentalism was operating at full sweat levels. Playing and producing almost the whole album himself, he created a universe of unbridled id, from the hunger of “When You Were Mine” to the   incestual drive of “Sister,” while also creating a   hybrid of new wave, flashy rock and   soul. Here is Prince at his orchestral best: “Purple Rain” is the first album he released with his backing band, the Revolution, and the one that cemented him as one of pop music’s essential stars. “Purple Rain” is glorious, ecstatic, piercing, with anthems of quiet desperation (“When Doves Cry”) boundless energy (“Let’s Go Crazy”) or both (“I Would Die 4 U”). Though the album was designed as a soundtrack for the film of the same name, it stands as one of the most important records in pop history. Here is Prince collecting material recorded over several years, showing off how his flamboyant, daring skill could tackle almost any sound or attitude of the day. The title track addressed a litany of societal ills, and “If I Was Your Girlfriend” represented Prince at his carnal best. But those were only two extremes on an album full of them, one that showed the full scale of his ambition. By this stage of his career, Prince wasn’t as loose as he’d been in his early days, but he found ways of   his erotic impulses, which weren’t weakened at all. On this album  —   his first billed with the New Power Generation, then his backing band  —   he made   pop “Cream,” sly   on “Willing and Able” and clangorous   on “Gett Off. ”   Prince could be a hodgepodge  —   after he split with his record label Warner Bros. in the   he pinballed among styles, releasing music at an idiosyncratic clip. “Musicology,” an album that is jubilant and grounded in Prince’s   sonics, marked his return to the major label system, and also to controlled form. He also gave away copies of the album to people who bought tickets to his tour, showing that his skepticism of typical   practices remained high.'"}, "time": 1742628434.1834562}