{"duration": 0.04218578338623047, "input_args": {"text": "'Comments \\nIt’s an understatement to say that Republican nominee Donald Trump does not have a good record when it comes to charity and donating to good causes. But as the death knell sounds for his campaign, he still isn’t changing his miserly ways. New reports indicate that Trump graciously allowed the Palm Beach Boys & Girls Club to hold a fundraiser at the Trump International Golf Course in Florida – and then charged them $20,000 for the favor. \\n“This ‘free’ event is costing us $20,000 between golf and catering fees. What we had hoped for as far as a ‘net’ income for this event has been cut in half (if we are lucky)” complained Mark Casale, vice president of philanthropy for the Boys and Girls Clubs. \\nThe course usually charges around $5,000 and leaves the county off the hook for the rest, but not this time. The annual charitable tournament goes to a different organization every year; it just so happens that this year’s choice was made by District 6 commissioner Melissa McKinlay – who is a Democrat. \\n“None of this was disclosed to me when given the choice to select a charity. I was under the impression the charity was able to host the event without any charges. Explain to me how this is supposed to be a benefit to the county?” demanded McKinlay in an email. “If I were the Boys & Girls Club, I would pull out. How are smaller charities supposed to be able to afford this? This has placed me and the charity in a very bad position and I am quite upset by it.” \\nNeither the Trump International Golf Course nor the Trump campaign have responded to requests for comment. \\nWashington Post reporter David Farenthold has undertaken a minutely detailed investigation into Donald Trump’s charitable past – and found that he has donated far less than he claims to have give n. Most of the money Trump has “donated” was donated to the Trump Foundation by other donors; many charities – including those belonging to veterans’ organizations – were promised donations that were never paid out . It’s been discovered that the “Trump Foundation” was never properly certified to solicit donations in the first place, and Farenthold’s research shows that Trump has been using his “charitable foundation” to launder money through to evade millions in taxes. Trump would charge a starving person for the scraps from his table; he has not a charitable bone in his body. His selfishness is legendary, and we cannot elect such a morally deficient man to the Presidency.'"}, "time": 1742563473.5078862}