{"duration": 0.0693964958190918, "input_args": {"text": "'— Justin Green (@JGreenDC) October 27, 2016 \\nIf you get the feeling that President Obama doesn’t really understand what it’s like to have to live under Obamacare … then this probably won’t make that feeling go away. \\nOn a conference call this afternoon, Obama tried to give enrollment staff a pep talk: . @POTUS tells ObamaCare enrollment staff they have to overcome the skeptics and prove to next Administration, the program is working well. \\n— Mark Knoller (@markknoller) October 27, 2016 Despite rising health insurance premiums, @POTUS says tax credits will help eligible 7 in 10 find a plan for less than $75/month. \\n— Mark Knoller (@markknoller) October 27, 2016 \\nThat pep talk included this little gem: \"Have to clear the bugs off the windshield to see the road ahead,\" says Pres Obama on conference call with ObamaCare enrollment personnel. \\n— Mark Knoller (@markknoller) October 27, 2016 \\nBeg your pardon? \\n— Jimmy (@JimmyPrinceton) October 27, 2016 \\nSo, if we’re understanding you correctly, Mr. President, Obamacare’s countless glitches and inadequacies and broken promises are just … pesky? Lost your plan? Lost your doctor? Higher premiums co-pays and deductibles? You\\'re just a bug on the windshield! https://t.co/WhgW3MAHbA \\n— jimgeraghty (@jimgeraghty) October 27, 2016 \\nThis friggin’ guy … This guy lied repeatedly to the public and this is how he refers to the problems his law created. https://t.co/Ve8SHvMDz2 \\n— Jason C. (@CounterMoonbat) October 27, 2016 \\nNice, huh? @JimmyPrincetoni I guess those of us that are paying +50-60% more for health ins are dead bugs on a windshield. Nice. @markknoller \\n— Kris Kinder (@kris_kinder) October 27, 2016 @markknoller The bugs on the windshield are the American people that are getting killed by Obamacare premiums and deductibles. \\n— Matt Moyer (@mrmattmoyer) October 27, 2016 . @markknoller people being forced to pay thousands more for a shitty law we didn\\'t want and he shrugs it off as bugs on a window? Smug POS \\n— Dupes & Knaves (@DupesKnaves) October 27, 2016 \"I lost my doctor & I\\'m paying a lot more for insurance now.\" \\nPOTUS: Hey, we gotta clear the bugs off the windshield to see the road ahead. \\n— Jason C. (@CounterMoonbat) October 27, 2016 @markknoller concerns me more when hearing the likening of a nation\\'s failed healthcare system to an everyday inconvenience \\n— mark mark mark (@RevJimJonesInc) October 27, 2016 What about the big ones that just stick and smear everywhere? https://t.co/puTOzrb0Mi \\n— Bigly Shoe (@TheOneSoleShoe) October 27, 2016 @markknoller If there are that many bugs, doesn\\'t that indicate trouble? Blocks your view? \\n— Kris Murphy (@KrisinAL) October 27, 2016 @markknoller I think it is more than bugs on this windshield.This Pres drove us right into it \\n— Jean Tuttle (@waffle721) October 27, 2016 Except the bugs are huge. And angry. And still coming. And stole the windshield. And your car fell apart around you. https://t.co/JDx9Z3vYyW \\n— Sunny (Mat) (@sunnyright) October 27, 2016 @CounterMoonbat @markknoller does he realize the car\\'s totaled on the side of the road?'"}, "time": 1742563467.2774603}