{"duration": 0.1344461441040039, "input_args": {"text": "'Lupita Nyong’o calls her “badass. ” Ava DuVernay says, “She’s a big part of my creative process. ” The ballerina Misty Copeland has her to thank, in part, for the ads that made her a household name, not to mention her namesake Barbie doll. And Raoul Peck, the director of the bold documentary “I Am Not Your Negro,” says that he couldn’t have made his film, a current awards season contender, without her. Unknown to those outside Hollywood, the lawyer Nina L. Shaw is a secret weapon, a    power player adept at striking deals that cultivate freedom of voice, especially for black members of the creative class whose mission it is to be artist and  advocate. “When I started making films, she was the first person I called,” said Ms. DuVernay, the director. “Not just for legal advice  —   she’s really a bit of a consigliere in all things. ”   and   enough to navigate the industry, Ms. Shaw is also someone “who really has power behind her punch,” Ms. DuVernay said. Ms. DuVernay made waves by hiring only female directors for her television series, “Queen Sugar. ” Lately, Ms. Shaw, 62, has also been outspoken about the inequities in her own field, giving speeches that pointedly ask artists to demand more diversity among the teams that write their contracts. “You can’t just ask it of the people who hired you, you have to ask it of the people who represent you,” she said. “Why aren’t there more women here? What’s the plan for there to be more women here? I think that’s a fair question. ” Despite strides in broadening onscreen and production roles in the wake of #OscarsSoWhite and other movements, the business side of Hollywood  —   in particular the talent agencies  —   remains “overwhelmingly white and disproportionately male,” according to a study released in February by the Ralph J. Bunche Center for African American Studies at U. C. L. A. A flip through many of the entertainment industry’s lists of power lawyers yields approximately the same results. Bert Fields, the longtime Hollywood lawyer, applauded an emphasis on diversity in hiring: “Sure as hell, there’s more to be done,” he said. But, he added: “When it comes to selecting who I want to be my lawyer, I want the best lawyer for the price. I don’t want to think about diversity in selecting who’s going to represent me at a trial, or negotiate my contract. ” Ms. Shaw saw an obligation to do things differently. In her over 35 years as an entertainment lawyer, she was often the only woman or person of color in a meeting like many of her contemporaries, she has stories of male colleagues who asked her to fetch coffee or hang coats. Early on, she said, “I actually felt things were going to change. I thought there would be lots of women in law firms and lots of women in agencies. And I’ve come to realize that that’s not the case, and if it’s going to happen, I’m going to have to be a big part of the change. ” Now, as one of the few women of color leading the legal side of show business, Ms. Shaw has become a beacon. A founding partner at the firm Del Shaw Moonves Tanaka Finkelstein  Lezcano  —   where about half the lawyers are women  —   her roster of clients includes Ms. Nyong’o, James Earl Jones, Laurence Fishburne, John Legend and the writer   Coates. Projects with a social justice mission, which don’t necessarily produce as many billable hours, stir her. “I want to have been part of the work in this industry that makes society better,” she said. “I want to have left some kind of legacy here. ” Even through the country’s current political upheaval, she said, representation in entertainment still matters, “because ultimately the audience matters, and the audience is an inclusive, diverse audience. ” Ms. Nyong’o shares that attitude. Suddenly in need of representation after her   debut in “12 Years a Slave,” she met with several lawyers before choosing Ms. Shaw. “Her being   and being at the top of her game and having that cultural perspective on top of the smarts that it takes was very important to me,” Ms. Nyong’o said. With a multicultural upbringing and perspective, she added, “I needed a team that appreciated that  —   did not just see it but deeply understood it. ” Those teams and projects aren’t always an easy sell. At a panel at the Albertine cultural festival this month, Ms. Shaw spoke about the studio and network programs meant to foster diversity in hiring, calling them out for their limitations  —   a taboo subject in Hollywood. The programs, which are expanding, “are heartfelt,” Ms. Shaw said in a separate interview, and worthwhile for grooming young talent. But, she added, they’re “meaningless in the sense of, if you really want to hire people of color, there are a multitude of experienced people of color who you can hire. ” Asked why she had decided to discuss issues that might cost her industry relationships, Ms. Shaw said she was too grown to worry about the repercussions. “You get older, and you just reach a point where you say, ‘I don’t care, I am who I am, what I have is what I have,’” she said, adding: “So many people don’t have control over their destiny in a way that I do, don’t own their own businesses, don’t have their own clients. I owe it to them to speak freely. ” Her steadfastness is practically  . In an interview in her Santa Monica, Calif. office, Ms. Shaw showed off a photo of her   Mary Catlett Hardy and George Evans Hardy, who studied at Oberlin College and became prominent citizens of Charlottesville, Va. where Ms. Shaw visited them often. They were assertive and   she said, and a big influence on her, particularly her   a descendant of slaves. (Ms. Shaw, who has the graciousness of a Southerner and the moxie of a New Yorker, started a scholarship at her undergraduate alma mater, Barnard College, in her  ’s name.) Ms. Shaw’s background also gave her a deep affinity for the arts: A child of Harlem and the Bronx, she grew up going to Broadway shows and spending hours at the Met Museum. It gave her, Ms. DuVernay said, an uncommon appreciation for the artistic side of Hollywood Ms. Shaw is part of a small group of people Ms. DuVernay invites to critique working cuts of her films. Ms. Nyong’o, too, has embraced her in her inner circle  —   last year, Ms. Shaw joined her on a trip across Kenya, visiting Ms. Nyong’o’s ancestral home. Mr. Peck, the director of “I Am Not Your Negro,” based on the writings of James Baldwin, found her to be supportive of even his most   ideas. “Particularly at that level of professionalism and experience,” he said, “people tend to be not reachable or cynical or not listening, because they have seen it all. And that is not Nina. ” It was she who helped secure Samuel L. Jackson as the narrator for his film, although Mr. Jackson has never been her client. (She knew his manager and agent, she said.) Sharp and elegant, Ms. Shaw also has a reputation as a tough negotiator, skilled in getting equitable deals for her female and minority clients, pressing the other side to explain why her clients won’t get fair pay. At the Albertine panel, she quoted Shirley Chisholm: “If they don’t give you a seat at the table, bring a folding chair. ”'"}, "time": 1742562880.5442412}