{"duration": 0.04340076446533203, "input_args": {"text": "'WASHINGTON  —   A federal appeals court has ruled that consumers must be allowed to buy certain types of health insurance that do not meet the stringent standards of the Affordable Care Act, deciding that the administration had gone beyond the terms of federal law. The court struck down a rule issued by the Obama administration that barred the sale of such insurance as a separate   product. “Disagreeing with Congress’s expressly codified policy choices isn’t a luxury administrative agencies enjoy,” the United States Court of Appeals for the District of Columbia Circuit said on Friday in a decision that criticized “administrative overreach” by the Department of Health and Human Services. At issue is a type of insurance that pays consumers a fixed dollar amount, such as $500 a day for hospital care or $50 for a doctor’s visit, regardless of how much is actually owed to the provider. Such “fixed indemnity” insurance is normally less comprehensive and less expensive than the “minimum essential coverage” required by the Affordable Care Act. Under the rule, issued by the Obama administration in 2014, fixed indemnity policies could be sold only to people who already have the more comprehensive coverage that meets detailed federal standards. State officials and insurers estimate that as many as four million people might have fixed indemnity policies without major medical coverage. The Obama administration gave several reasons for cracking down on fixed indemnity insurance. It is “an inadequate substitute for major medical coverage” because “it does not provide protection against major medical expenses,” the administration said. Moreover, it said, consumers may be confused and may buy fixed indemnity insurance in “the mistaken belief that it provides comprehensive coverage”  —   a concern also voiced by consumer groups. In adopting the final rule in 2014, the Obama administration said that allowing people to buy   fixed indemnity insurance would undermine the goal of “maximizing the number of individuals who have comprehensive, major medical coverage. ” Since 1996, fixed indemnity insurance has generally been exempt from federal insurance standards, and the Affordable Care Act did not change that, nor did Congress “give even the slightest indication” that it meant to alter the exemption, the appeals court said. But, the court said, the administration “effectively eliminated   fixed indemnity plans altogether,” by tacking “additional criteria” onto the 1996 law. The ruling in the case, Central United Life Insurance v. Burwell, was issued by a panel composed of Judges Janice Rogers Brown, Patricia A. Millett and Douglas H. Ginsburg. Fixed indemnity insurance differs from major medical coverage in many ways. It does not have to provide the “essential health benefits” required by the Affordable Care Act, nor does it have to pay any specific percentage of medical costs. Some fixed indemnity policies provide coverage only for specified diseases, like cancer. In general, consumers have fewer protections. Under the rule issued by the Obama administration, fixed indemnity insurance would be allowed only as a supplement to major medical coverage that complied with the 2010 health care law. People buying the more limited coverage would have to attest, in their applications, that they already had “minimum essential coverage. ” The plaintiffs in the case, who sell fixed indemnity insurance, said the federal rule would essentially destroy the market for such products. “Even after the Affordable Care Act,   consumers may not be able to afford major medical coverage,” said Quin M. Sorenson, a lawyer at Sidley Austin who represented the plaintiffs. In states that have not expanded Medicaid eligibility, he said, three million people fall into a coverage gap: They make too much to qualify for Medicaid, but not enough to qualify for subsidies in the public insurance marketplace, and they cannot afford major medical coverage on their own. For some of them, he said, fixed indemnity insurance plans may be a valuable option. Under the Affordable Care Act, people who go without major medical coverage may be subject to tax penalties. In a     brief, Wisconsin and 10 other states said that some consumers had found they could save money by buying fixed indemnity insurance and paying the tax penalty. “Fixed indemnity insurance is a rational choice for these individuals because it provides meaningful access to the health care system,” the states’ brief said. The appeals court upheld an earlier decision by Judge Royce C. Lamberth of Federal District Court, who said the Obama administration’s rule “has no basis in the statutory text it purports to interpret and plainly exceeds the scope of the statute. ”'"}, "time": 1742628585.780481}