{"duration": 0.09551882743835449, "input_args": {"text": "'This week’s biggest political controversies exposed fault lines within the country’s major political factions, with the right fighting about civil disobedience while the left fought over the attempted murder of a Republican Congressman. [Shakespeare in the Park,  On Friday night, two conservatives disrupted a New York performance of Shakespeare’s Julius Caesar that escalates the left’s campaign of imagery designed to cathartically depict the death or murder of President Donald Trump. TheRebel. tv’s Laura Loomer was arrested for running onstage during the Shakespeare in the Park production, while activist Jack Posobiec taped her demonstration and shouted at the crowd: “The blood of Steve Scalise is on your hands!” “Old Right” Several authors at   conservative publications condemned Loomer and Posobiec, arguing that the two infringed on the free speech of Shakespeare in the Park and their tactics were too close to the Occupy of Black Lives Matter movement.   conservatives labeled this faction the “old right,” stating that there is no moral equivalence between this disruption and the violence of   protesters in dozens of recent incidents. The old right losers who are upset about what Laura did don’t realize that unlike them, we fight  —   and that’s why our guy won. #FreeLaura,  —   Cassandra Fairbanks (@CassandraRules) June 17, 2017,  Which is appropriate  She broke the law.  To fight an injustice  Just like #RosaParks https:  .   —   Google ”CNN, 175, Sue” (@NolteNC) June 17, 2017,  They’re literally shooting at us and you want to play Marquis of Queensbury.  Cowardice.  Fight the enemy or fuck you.  —   Google ”CNN, 175, Sue” (@NolteNC) June 17, 2017,  Oh yeah, leftist students threatening conservatives with violence is the exact same as a 1 minute interruption of Shakespeare in the Park https:  .   —   Scott Greer (@ScottMGreer) June 17, 2017,  This is the mentality that has sat, patted itself on the back, and watched for decades as America has gone further and further Left https:  .   —   DanRiehl (@DanRiehl) June 17, 2017,  We went to one play and accomplished more for the message than the millions donated to think tanks and handed to K Street. Let that sink in,  —   Jack Posobiec 🇺🇸 (@JackPosobiec) June 17, 2017,  Schlichter vs. Podhoretz, One archetypical exchange in the aftermath of the Julius Caesar demonstration saw Tablet editor and “Never Trump”  John Podhoretz facing off with lawyer and author Kurt Schlichter. I’d say I just learned tonight you’re a drooling, immoral, melodramatic idiot, but alas, I learned that long ago. https:  .   —   John Podhoretz (@jpodhoretz) June 17, 2017,  you want affirmative action for being a moron because you wore our country’s uniform? Happy to oblige.  —   John Podhoretz (@jpodhoretz) June 17, 2017,  Cernovich vs. Shapiro, Even more heated was the war of words between independent author and White House reporter Mike Cernovich, responding to criticism from former Breitbart News Senior    and “Never Trump”  Ben Shapiro. This obnoxious stupid snowflake crap is no better than the protesters who try to block college speeches. https:  .   —   Ben Shapiro (@benshapiro) June 17, 2017,  He doesn’t matter. None of those guys matter anymore. They don’t break news or make news. Controlled opposition for media to abuse. https:  .   —   Mike Cernovich (@Cernovich) June 17, 2017,  This is total, complete horse crap. She invaded a public performance to obstruct it. She has no right to the stage. https:  .   —   Ben Shapiro (@benshapiro) June 17, 2017,  👇🏻This is what a coward looks like. #FreeLaura 👇🏻 https:  .   —   Mike Cernovich (@Cernovich) June 17, 2017,  After trading a few intense personal insults, both men reiterated their arguments  —   but no longer directly to each other. They took stage for 1 minute. The left pulls fire alarms, uses pepper spray, hits people with bike locks. It’s not even close.  —   Mike Cernovich (@Cernovich) June 17, 2017,  Use free speech in ways that irritate the left. Do not impede other people’s freedom of speech. This is not difficult.  —   Ben Shapiro (@benshapiro) June 18, 2017,  At the same time, the left was infighting over a much more   topic: targeted political violence. Steve Scalise, On Wednesday, a    Illinois man opened fire on Republican lawmakers practicing for the annual Congressional Baseball Game, wounding House Majority Whip Steve Scalise and putting him in critical condition through the weekend. The attacker  —   James Hodgkinson, who was killed by police returning fire  —   also shot Two Capitol Police officers, a congressional staffer, and a lobbyist. The Daily Caller has reported that investigators found a list of GOP lawmakers’ names on Hodgkinson’s body. Instead of universal condemnation, Hodgkinson’s attack has brought about a   feud between the establishment left and the social justice left. Impulse Control, Over the weekend, several Verified progressives of varying prominence  —   an L. A. Times blogger, the creator of #OscarsSoWhite, a rapper with 250 YouTube subscribers, an Uproxx editor, and TV actor George Takei  —   argued that sympathy for Rep. Scalise should not outweigh his sinful acts as a lawmaker. In most cases, more traditional liberals scolded their more radical peers for generating bad optics. When will it be time to move Scalise’s opposition to gun control from the last graf of a story to the first? https:  .   —   Michael Hiltzik (@hiltzikm) June 18, 2017,  You can despise Scalise’s politics and also despise the fact someone thought gun violence would somehow change his or anyone’s mind.  —   John Haltiwanger (@jchaltiwanger) June 16, 2017,  Wounded Congressman Scalise, who the GOP are so sad about, voted TWICE to not recognize the #MLK holiday. https:  .   —   Iskandrah (@iskandrah) June 18, 2017,  I ask you simply to look at Rep. Scalise’s record. Do you have sympathy for other white supremacists?  —   Iskandrah (@iskandrah) June 15, 2017,  Was Scalise a ”human” when he voted against Marriage Equality and spoke at a white supremacy function? Or do only Dems need to be ”human?” https:  .   —   April (@ReignOfApril) June 16, 2017,  and don’t tell me the man has a family and allat shit, because so do folk with their premiums traveling on a rocket to Mars,  —   SUPER SIZE (@GrandeMarshall) June 14, 2017,  Made the mistake of looking up Steve Scalise voting record on women and LGBT rights. Time to break out Milkshake Duck.  —   Donna Dickens (@MildlyAmused) June 14, 2017,  I don’t have any tolerance for caveats on condemning political violence right now. You’re opening the door a crack. It needs to stay shut.  —   jessicashortall (@jessicashortall) June 16, 2017,  Cool  —   I guess enough time has passed since Scalise got shot that we can go back to attacking him as a homophobic bigot. Stay classy, Sulu. https:  .   —   Josh Jordan (@NumbersMuncher) June 17, 2017,  Why do we have to list Philando’s accolades? How come the headlines aren’t, ”Steve Scalise, a bigot who is trying to kill you, got shot”?  —   Brandi Geography B. (@ItsTheBrandi) June 17, 2017,  Josh Barro, an editor at Business Insider, wrote a thread on how the dehumanization of the left’s political opponents is “bad for society. ” Dozens of progressives rebuked Barro in the responses, calling him misguided, “insincere,” and “white boy. ” This feels like the wrong week to do an analysis of whether Steve Scalise is a good congressman.  —   Josh Barro (@jbarro) June 18, 2017,  On the other side of the argument, New Jersey Democratic strategist James Devine urged progressives to “hunt Republican Congressmen. ” Scarborough vs. Reid, On Saturday, MSNBC host Joy Reid called the situation “delicate” because, while “everybody is wishing the congressman well and hoping that he recovers” from an apparent assassination attempt, Reid lamented that “Scalise has a history that we’ve all been forced to sort of ignore on race. ” Joe Scarborough, one of Reid’s colleagues, appeared to attack this segment  —   without naming his target. CNN anchor Jake Tapper   the condemnation. Rep. #Scalise was shot by a white man with a violent background, and saved by a black lesbian police officer, and yet  …     #AMJoy pic. twitter.   —   AM Joy   Reid (@amjoyshow) June 17, 2017,  If you are attacking Steve Scalise’s voting record right now, do yourself a favor and just stop now. I can’t even believe what I’m seeing.  —   Joe Scarborough (@JoeNBC) June 17, 2017,  Who would even think for one second that it is appropriate to attack a man who is fighting for his life after an assassination attempt?  —   Joe Scarborough (@JoeNBC) June 17, 2017,  Agreed. Unfathomable. https:  .   —   Jake Tapper (@jaketapper) June 17, 2017,  Pelosi vs. Pelosi, Septuagenarian Democratic leader Nancy Pelosi’s conflicting reactions to the Scalise shooting provided the clearest example of progressive id vs. progressive  . On the day of the shooting, she said  —   in direct contradiction to virtually every other statement she has made about President Trump and Republicans  —   that she prayed for unity in the wake of the attack. On days like today, there are no Democrats or Republicans, only Americans united in our thoughts for the wounded. https:  .   —   Nancy Pelosi (@NancyPelosi) June 14, 2017,  Yet the very next day, in a seemingly unscripted moment, she returned to her default position of partisan blame: Somewhere in the 1990s, Republicans decided on the politics of personal destruction as they went after the Clintons and that is the provenance of it and is what has continued. Again, I feel as if we’re having a family moment that is very, very serious and we’re talking about things that we can say, the discussion —  save the discussion for another day. When you have a president that says, “I can shoot somebody on 5th Avenue and nobody would care,” when you have people saying, “beat them up and I’ll pay their legal fees,” when you have all the assaults that are made on Hillary Clinton, for them to be so sanctimonious is something. The New Political Landscape, Two parties  —   Republicans and Democrats  —   still essentially rule American politics, but their constituencies are becoming more tribal and divided, even against their electoral allies. Trump voters hate Republican lawmakers, such as Sens. John McCain and Ben Sasse, for publicly attacking the president and his agenda during and after the 2016 election. Democrats are still picking up the pieces from a contentious DNC leadership race, where   Obama ally Evan Perez narrowly defeated   Rep. Keith Ellison. These same divisions play out in cultural institutions, such as the social justice warriors purging classical liberal professor Bret Weinstein from the Evergreen State College campus or Fox News’ internal fight over the future of its programming style. The arguments taking place now are over what are appropriate means to victory over the other side: for the right, whether to be polite or ruthless  —   and for the left, whether to be ruthless or violent.'"}, "time": 1742628519.364626}