{"duration": 0.09418630599975586, "input_args": {"text": "'BOGOTÁ, Colombia  —   Gildardo Ramírez reached Mocoa on Sunday, only to find a scene of rubble where his Aunt Claudia’s neighborhood had been. He looked desperately through the ruins for his missing aunt, who he said had not been seen since a flood of mud and debris plowed through Mocoa the night before. “I arrived to the house, and it was destroyed,” he said by telephone from Mocoa, a small city in the southern mountains of Colombia near the border with Ecuador. “The only thing I found was a backpack. ” Anxious relatives like Mr. Ramírez and more than 1, 500 rescue workers raced on Sunday to find anyone who might still be alive and trapped in the wreckage in Mocoa, where parts of the city have been wiped off the map by a deluge of mud and floodwaters. In the air of the town, witnesses said they could already smell the dead under the rubble. Cadavers lay unburied in a cemetery while those in the town focused on search and rescue. “We have a huge challenge to find the missing people,” Carlos Ivan Márquez, the head of Colombia’s natural disaster unit, told reporters. The Colombian Red Cross said on Sunday that at least 234 people had died some news outlets reported higher tallies from other sources. Mr. Márquez said that in addition to the deaths, the authorities believed that more than 200 people had been injured. Some 600 residents were evacuated to temporary shelters. The destruction began with an overnight downpour of rain that lasted for hours, causing rivers around Mocoa to overflow their banks while most residents were sleeping. The resulting flood surged through the city on Saturday, carrying tons of debris, leveling houses and sweeping away cars and even large trucks. “The avalanche startled me when I was sleeping, and I went out to the street,” said Carolina Garreta, 20, a firefighter. “People were running and yelling the names of family members. Others were screaming at God. ” Ms. Garreta said that night she had found a    boy clinging to a washing machine that had been carried away by the waters. “He told me that his mother and father were still in the home,” she said. “But where he pointed to, there was nothing. ” Torrential rains have pummeled other parts of the region as well, including Peru, where at least 80 people have been killed in mudslides in recent weeks. Roads and bridges throughout Peru have been damaged, and some 120, 000 people have been left homeless. After Wilson Carrera heard the news of the disaster in Mocoa, he traveled 50 miles on treacherous roads from the Colombian town of Puerto Asis to search for his parents. He said he had found his father, who told him that his mother may not have survived. “They had managed to get out of the house when they started to hear noise,” he said in a telephone interview. “But the water caught up to them in the street, and my mother let go of his hand. ” The city was cut off from many services on Sunday, leaving nearly all residents without electricity, clean water or gasoline many people huddled in shelters. Survivors used car batteries to recharge cellphones in hopes of contacting loved ones in other towns. “There’s not a single drop of drinkable water  —   we need water, that’s what’s urgent  —   and there’s nothing to eat,” Marisol González, the head of a nearby technological institute, told the newspaper El Tiempo. President Juan Manuel Santos visited Mocoa on Sunday for the second time since the disaster struck. He said more help was on the way, while acknowledging that there had been “bottlenecks” in the response. He promised that electric power would be restored soon, that water would be brought in and that destroyed parts of the city would be rebuilt. “The idea is that Mocoa will be better than it was,” he said. Colombia’s Weather Service predicted light rains on Sunday, far less extreme than those that hit the region earlier in the weekend. Dr. Herman Granados, a surgeon at a hospital in Mocoa, said the medical staff there was overwhelmed and that blood supplies were running very low. Many people were still missing, he said: “Under the mud, I am sure there are many more. ”'"}, "time": 1742563282.0550342}