{"duration": 0.06079602241516113, "input_args": {"text": "'Comments \\nLast night, Louisiana Senate candidates vying for disgraced Senator David Vitter’s empty seat took the stage at the historically black Dillard University. Among them was former Ku Klux Klan Grand Wizard David Duke, who is making yet another run for public office. The students at Dillard rightfully came out to protest – but were met with shocking violence from the police. \\nSeventy or so students protested Duke’s presence at their college. “They’re allowing a terrorist, a neo-Nazi Ku Klux Klan member to be secured in a building in which we paid thousands of dollars to attend annually,” said political science major Brielle Kennedy , who was arrested moments later. \\nNobody was allowed in the building during the debate, but students tried to enter anyway to express their fury – and were met with pepper-spray and beatings from police, who arrested six students. “They sprayed us directly in the face with it. I was covered on my shirt, my arms, my face. They’re bodyslamming people, they pulled girls’ hair. They’re just acting like heathens” recounted student Hannah Galloway. \\nThe debate itself went off the rails almost immediately as David Duke began complaining about “Jews ,” saying that “there is a problem in America with a very strong, powerful tribal group that dominates our media, dominates our international banking.” He then went on to say that “[Hillary Clinton] should be getting the electric chair, being charged with treason.” \\nWhat did the police and state board of elections expect would happen when they held a debate at a historically black school in the deep South and invited a deplorable white supremacist and prominent Trump supporter to attend? \\nThe violence with which the police reacted evokes the violence that white police visited on black protesters during Jim Crow and the battle for African-American civil rights – and is a painful symbol of how little has changed in the past sixty years. The fact that David Duke had the support to qualify for the ballot is evidence enough.'"}, "time": 1742561638.6537418}