{"duration": 0.035074710845947266, "input_args": {"text": "'BNI Store Nov 7 2016 BIGGEST MUSLIM LIE OF THE DAY: “White supremacists are openly threatening Election Day violence…so the FBI is hassling Muslims” Is it the inbreeding? Or just that they think they can promote any fantastical lie or obfuscation and the Kardashian-worshipping American public won’t notice. It’s been reported for days that The Islamic State/al-Qaeda is calling for the “slaughter of U.S. voters” on Election Day. But that didn’t stop officials from designated terrorist group CAIR from inventing a fake potential threat against Muslims…to deflect the fact that the FBI is questioning potential terror-linked suspects in the Muslim community. USA Today Ritz Katz, director of the SITE Intelligence Group, said Saturday on Twitter that the threats appear in an essay carried by the Islamic State’s Al Hayat media center that declares militants “have come to slaughter you and smash your ballot boxes.” 3) #ISIS urges Muslims to refuse participate in #Elections2016 & to announce that they “have come to slaughter you & smash your ballot boxes” \\n— Rita Katz (@Rita_Katz) November 5, 2016 “May Allah make this year’s U.S. presidential election a dreadful calamity like no other to have struck America throughout its pathetic history,” the seven-page manifesto, entitled “The Murtadd Vote ,” read. Murtadd is an apostate who turns his back on Islam. The essay, which uses lengthy religious arguments in an effort to justify such attacks, also declares there is no difference between the Republican and Democratic parties in their “policies against Islam and Muslims” In an article from the perpetually Muslim-sympathizing Fusion website: As if Muslim Americans haven’t had it hard enough during this presidential campaign—what with Donald Trump’s steady drumbeat of Islamophobic racism–now comes reports that federal agents are paying surprise visits to Muslims across the United States ahead of the November 8 election. According to officials from the Council on American Islamic Relations, representatives from the FBI have questioned Muslims living in at least eight states leading up to November 8, reportedly searching for information pertaining to a possible Election Day al Qaeda threat . Over the weekend, the designated terrorist group CAIR (Council on American Islamic Relations) received reports from Muslim-Americans in eight states, who said they were approached by FBI agents who wanted to speak to them about the alleged threat. Those states included California, Washington State, Michigan, Pennsylvania, Kansas Oklahoma, Florida and Texas. Hassan Shibly, executive director of CAIR’s Florida offices, called the reported questioning “completely outrageous,” and “borderline unconstitutional,” telling the Washington Post : “That’s the equivalent of the FBI visiting churchgoing Christians because someone overseas was threatening to blow up an abortion clinic. It’s that preposterous and outrageous.” The people who were interviewed this weekend were asked if they knew anyone who might want to harm Americans at home or abroad. Shibly said all of those interviewed appeared to be of Afghani or Pakistani descent. Shibly says such sweeps are dangerous to Muslim-American relations.’Unfortunately we’re dealing with an environment that’s not very friendly to American Muslims,’ he said. ‘The environment is very hostile to the American Muslim community.’ On Twitter, CAIR’s Dallas-Fort Worth director Alia Salem posted a short video updating her followers about the FBI visits, and offering a series of resources for anyone approached by law enforcement. “It was made apparent to us that the FBI has a list of a couple hundred people they are wanting to visit,” Salem told the Dallas Morning News . “And ask a series of eight generic questions intended to drum up information about the attacks.” The FBI’s sudden scrutiny of Muslim Americans comes as the United States is experiencing a surge in white nationalism and militia groups , fueled in no small part by Donald Trump’s KKK-backed candidacy . Militant Trump supporters have, in fact, explicitly stoked fears of violence come Election Day. (But it’s Muslims who actually carry out terrorist attacks on Americans) “Prior to this campaign season, these ideas were relegated to sort of the political fringe of the American political landscape,” Ryan Lenz, a researcher at the anti-American, Muslim-funded Southern Poverty Law Center told Reuters . “Now these ideas are legitimized.” Perhaps while the FBI is questioning Muslim Americans over vague international threats, they should check in with some of the no-longer-fringe radicals on America’s far right wing, too.'"}, "time": 1742628582.0592105}