{"duration": 1.4201099872589111, "input_args": {"text": "'Newborn Baby Kidnapped from Alabama Hospital After Parents Decline Birth Certificate and SSN Christian and Danielle Holm – on a mountaintop in 2015. Photo source: Christian Holm’s Facebook page . \\nby Health Impact News/MedicalKidnap.com Staff \\nTheirs was a spiritual journey of getting back to nature and rejecting the materialism that they felt held them in bondage. Christian and Danielle Holm began their journey together in early 2016 as itinerant missionaries, traveling across the country and speaking to churches as they sought to live simply and biblically. \\nThe last thing that they expected was for Child Protective Services to seize their 1 day old baby literally off of his mother’s breast in an Alabama hospital. What started out as an apparent case of mistaken identity has turned into a nightmare that the family cannot wake up from. They don’t understand why their baby was taken from them, or why he still remains in state custody in foster care while social workers continue to challenge their religious beliefs. \\nAccording to a close family friend who contacted Health Impact News , the couple are grieving. \\nThe most sacred thing to Danielle and Christian is the bond of male and female coming together and giving life with God. This bonding process in the beginning of a baby’s life has been stolen from them. \\nThere was never any reason for their baby to be taken from them to begin with, and even now, they have adequate housing and anything else that could ever be needed and they still don’t have their baby back. Story Reported in Local Media \\nThe Anniston Star first reported their story on October 13, 2016, just days after the couple’s baby was born on Monday, October 10. Excerpt: \\nJust out of Regional Medical Center, Danielle has a belly still swollen from a pregnancy that ended Monday with the birth of a healthy baby boy. \\nHer arms, however, are empty. Her son was taken from her the day after he was born and is in the custody of the Cleburne County Department of Human Resources pending a hearing at Cleburne County Courthouse this morning. \\n“We told them that we were going to do whatever we could,” she said as tears ran down her face. “I’m his mother. I’m supposed to be nourishing and bonding with him right now and I can’t.” Judge Issues Gag Order, Family Friend Contacts Health Impact News \\nShortly after the story was reported, District Judge Melody Walker of the Cleburne County Circuit Court issued a gag order on the couple, forbidding them to speak about their case. \\nSince that time, Health Impact News was contacted by a close family friend who talked to us about the couple and their story. The source, who asked not to be named, made it clear that the information that she gave us was from conversations which occurred before the gag order was placed on Danielle and Christian Holm. \\nShe communicated that the Holms want to cooperate with DHR to do everything that they can to get their baby back. They are heartbroken, and they are scared. The source is concerned that the couple may have unwittingly stumbled into a great deal of corruption, and their baby could be an innocent victim of some sort of trafficking ring. Couple Chooses to Leave Materialism Behind, Pursue Spirituality \\nThough their simple lifestyle of hiking and backpacking through state parks may suggest otherwise, the Holms come from a background of means and education. 32 year old Danielle holds a triple bachelor’s degree in psychology, sociology, and biology. She has worked as a nurse, chiropractic assistant, child and adolescent mental health counselor, personal trainer, and was a group leader for Special Needs children at a youth center. Her husband Christian, 35, comes from a very well-off, politically connected family. He spent several years caring for his ailing grandparents before their deaths. \\nThey met and fell in love after finding common ground online. They decided to make a life together in August of 2015 and moved to New Hampshire together. Both increasingly felt that possessions and materialism were holding them in bondage. After they married in February, they made the conscious decision to give away their possessions to charity and live simply, traveling as itinerant missionaries and getting closer to nature. \\nExcerpt from The Anniston Star : \\nThe process of surrendering is difficult, though. It took them until May to start travelling, and even then they were driving, he said. They only recently left their car in a storage unit in Montgomery and started walking. \\nThey found the journey amazing; people they met along the way would give them money, food and water to keep going, they said. On the way they stopped at probably 30 churches to talk with people and minister to them, Christian said. \\nThey travelled about five miles a day and ended up camping at Cheaha State Park a few days ago, Christian said. Pulpit Rock at Cheaha State Park. Photo Source: Alabama State Parks They Wanted as Close to Natural Birth as Possible \\nThe expectant couple reportedly sought prenatal care and preparation along the way from midwives, doulas, ob-gyns, and lactation consultants. They researched and read and asked questions. \\nThey considered seeking a midwife in Alabama, since they expected to be in the state when the baby was born, but they found information that told them that midwifery is illegal in Alabama. However, the only reference in the Alabama code to non-nurse-midwifery is in the section governing nurse-midwives, Al Code 34-19-3 (b): \\n(b) Nothing in subsection (a) of this section shall be construed as to prevent lay midwives holding valid health department permits from engaging in the practice of lay midwifery as heretofore provided until such time as the permit may be revoked by the county board of health. \\nThere is no definition of lay or other non-nurse midwives, such as traditional midwives, in the Alabama statutes. Because of conflicting information in the media and online, the Holms did not know that having a traditional midwife was an option open to them. Instead, they prepared for an unassisted, husband-coached, natural lotus birth, planning to birth as closely to nature as possible. \\nWhen Danielle went into labor, they had been camping for several days at Cheaha State Park in Cleburne County, Alabama. After 2 days of labor, they reportedly became concerned about some bleeding and decided to call an ambulance, which took them to Northeast Alabama Regional Medical Center (RMC). Danielle gave birth to a baby boy the next morning, and he was “perfectly healthy” according to a family friend. Simple Lifestyle Conflicts with Standard Protocols \\nThe couple wished to adhere to their religious beliefs and remain as natural as possible, declining any unnecessary hospital interventions. They agreed to allow eye ointment in their baby’s eyes, but declined the other typical interventions, including the hospital security band on the baby’s leg. They reasoned that, since there was never a need for the baby to be out of his parents’ sight while he was at the hospital, there was no need for the hospital security band. Danielle chose to breastfeed her baby. \\nThe couple were able to bask briefly in the beauty of their new son, but their joy was short-lived. Danielle with her new baby at the hospital. Photo source: Christian Holm’s Facebook page . \\nThe source close to the family reports that Danielle and Christian sensed that the hospital staff got a bit nervous when the parents declined a birth certificate and social security number for their baby. \\nThere were 2 reasons for their declining the documents. Christian and Danielle felt that the naming of their baby is a spiritual experience. They wanted to wait to decide on a name for their baby until they first had time to bond with and get to know their baby to see what name would be the most appropriate. They also believed that the decision as to whether or not to have a social security number was one that should be left up to the child to make when he is older. \\nBecause they sensed that the hospital staff was uncomfortable with their philosophy, which is rooted in their spiritual beliefs, the family friend states that Christian pro-actively decided to approach the hospital social worker “on his own terms,” to ensure that there were no issues and that they would be in compliance with applicable laws. \\nInstead of answering, the social worker reportedly left to seek more information. A short time later, she returned to their room with an intern from DHR, the Department of Human Resources, Alabama’s Child Protective Services. The DHR representative reportedly questioned the couple about their religious beliefs. The Holms reportedly stated that they wanted to “live as close to nature as possible, just like their native American ancestors.” \\nWhen Christian asked, “What is the most simple way we can live without being harassed?” the DHR worker reportedly told him she had never been asked that before, and that she would consult her supervisor. Baby Snatched from Mother’s Nursing Breast Danielle and Christian loved the simple life. This photo was taken atop Mt. Percival. Photo source: Christian Holm’s Facebook page . \\nThe family friend explained that Christian has a house in his name, but it is currently tied up in a family trust. Despite their journey of walking through nature, camping wherever they found themselves, the couple has been in process of trying to move into the house, but there have been complications, causing those plans to fall through. The friend reported that Christian had hoped to discuss this with the social worker, but he did not get the opportunity, because the hospital social worker and the DHR intern returned to the hospital room with 4 police officers, a detective from the sheriff’s department, and a hospital security guard. \\nAfter Christian was escorted to another room, Danielle was shocked when the sheriff’s detective allegedly reached down and pulled the baby literally off of his mother’s breast where he was latched on. \\nAs she cried out, asking, “Why?” and telling them she has done nothing wrong, the detective told her that they had reason to believe that they were not who they said they were. He reportedly told her that the baby was now in state custody. Case of Mistaken Identity Has Devastating Consequences \\nThe detective reportedly began a barrage of questions aimed at the confused new mother, demanding “her real name.” Danielle thought that the confusion could be from her previous married name. Her ex-husband was Holmes, and her current husband is Holm, so she simply deleted 2 letters from her last name. That was apparently not the source of the confusion. \\nThe detective asked Danielle if she was really Daniella Ruiz, and asked her about her involvement in human and drug trafficking in Arizona. She asked if she had ever been arrested in Arizona, and when she had crossed the border into Mexico. \\nNone of this reportedly made any sense to Danielle, who had spent a short amount of time in Arizona as she and Christian were on their journey, but she had never been to Mexico, never been arrested, and had never been in any trouble at all. The name Daniella Ruiz meant nothing to her. \\nThey asked if Christian had ever gone by another name, which he had. His middle name is Clarke, and that is the name he went by growing up. \\nBoth Danielle and Christian readily showed the detective their IDs. In addition to her New Hampshire drivers license, she showed her social security card and her passport, which did not show any trips to Mexico. Christian reportedly showed his New Hampshire drivers license, social security card, and a federal ID. \\nIt was not enough. DHR took their baby into custody, and they were only able to see their baby once more before they left the hospital, and that visit was under the watchful eyes of a nurse and a police officer. \\nChristian Holm later posted an article on his Facebook page that he found about the criminals that the Cleburne County officials apparently thought they were. Though the comment has since been deleted, Christian had this to say: \\nSo this is who the investigating officer said that my wife and I are after giving her three forms of identification from both of us showing that we are not these people. She was not satisfied with that and told me that these can be faked. They really need an oops button in these situations when an infant and or innocence is involved to give child back. Swallow the pride and stop destroying lives for your view on life. We are children of God being attacked by the ones influenced by the devil. They know not what they do. \\nThe criminals arrested in Arizona were Daniella Ruiz of Tuscon, Arizona, and Richard Christian Holm of Nogales, Arizona. There are several news stories which appear to originate from the same source which simply describe 2 separate incidents in the same article, such as this article that Christian Clarke Holm found: \\nThough both people arrested have similar names to the couple traveling in Alabama, the Arizona duo do not appear to be connected even to each other. They were arrested on 2 different days in 2 separate incidents. Is Violation of the 4th Amendment Standard Practice in Alabama? \\nAccording to the Holms’ friend, there was no court order or warrant to seize the baby, nor was there an emergency situation. This is consistent with what other Alabama parents have reported to Health Impact News . Earlier this year, Shelby County DHR social worker Ahzshaka Evans told a 14 year old rape victim: \\nThere are two people who don’t need a court order or a warrant: the Department of Human Resources and law enforcement. (See story .) \\nShelby County police officer Edmunson told the Prince family in June that DHR didn’t need a court order or warrant to take a child. All they needed was a pickup order from DHR. \\nHaly Boothe’s 3 day old baby was taken in May from a Birmingham hospital without a court order or warrant. (See story .) \\nSeveral parents have reported being told that the state legislature has given authority to DHR to seize children with only a “DHR pickup order,” which may apparently be merely verbal, not necessarily written. Parents are told that the court hearing within 72 hours meets the standard of search and seizure laws. \\nHowever, this practice stand in direct conflict with the 4th Amendment of the Constitution: \\nThe right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no warrants shall issue, but upon probable cause, supported by oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized. New Mother Denied Basic Care After Baby Seized \\nIn another disturbing similarity between the Holms’ story and others of mothers whose newborn babies are taken from them at the hospital, basic medical care was reportedly withheld from Danielle after her baby was seized by DHR. She was given no discharge instructions. There was no counsel or handout given about what signs of infection to watch for or how to care for her stitches, even though she was a first-time mother. \\nOrdinarily, all patients checking out of hospitals are escorted out in a wheelchair. Not so with many mothers whose babies are taken from them by the state. Despite their pain and grief, they are singled out to walk out of the hospital on their own strength. Orders Given to Put Baby on Formula Against the Wish of Parents \\nThe family member reports that Danielle is still pumping her milk for her baby, even though the Anniston Star reports that the Holms have no idea whether or not their baby is receiving the breastmilk, and that there were orders given at the hospital for the baby to be given formula. \\nThis is especially hard for mothers to deal with who know the myriad of benefits of breastfeeding and the multitude of health risks that formula-feeding carries. Feeding their baby his mother’s own milk in the natural way that God designed was a very important value to Danielle and Christian Holm, according to their friend, and knowing that their baby is being fed formula from the hands of a stranger is yet another tragic aspect of their baby’s kidnapping. \\nThe couple are also reportedly very concerned about the emotional and psychological well-being of their baby, because they understand that separation of mother and baby, especially in the early weeks and months, can have a devastating psychological impact on the growing baby. Danielle celebrated freedom on Mt. Washington. Where is that freedom now? Photo source: Christian Holm’s Facebook page . Gag Order Issued \\nThe Anniston Star reported that the Holms were issued a gag order after the publication brought the story to public attention. In their article dated October 18, some important considerations are raised. Gag order ensures privacy, but at a cost, experts say \\nExcerpts: \\nCourts can use gag orders to protect the interests of children or victims, but some attorneys say the instrument does so at the cost of other constitutional rights. Gag orders are not a black-and-white issue, though, and they can be challenged, said Andy Olree, professor of law at Faulkner Law in Montgomery. Gag orders can be an infringement on constitutional rights, Olree said.The first amendment of the U.S. Constitution protects citizens’ right to express themselves and the public’s right to hear discussions of issues of value to them, but that right is not absolute, Olree said. \\nSee also: Family Court Judges’ Unconstitutional Gag Orders On Parents \\nDHR has questioned the intelligence of ordinary citizens with regard to understanding the meaning of confidentiality. According to the Anniston Star : \\nAll juvenile dependency cases, those in which a child’s custody is decided, are confidential cases by state law, Cleburne County Judge Melody Walker said Monday. Tony Hamlin, attorney for the Department of Human Resources, said a judge could issue a gag order because lay people don’t always understand what confidential means. Alabama Attorney – Confidentiality Laws Not Designed to Silence Parents Birmingham-area attorney Lisa Chasteen disagrees. She told Health Impact News that the Alabama law regarding confidentiality of juvenile cases is often misused by the system to tell parents that they cannot talk about their own cases, but that is not the way the law is written. Alabama Code § 12-15-133(g) states: Except for the purposes permitted and in the manner provided by this section, whoever discloses or makes use of or knowingly permits the use of information identifying a child, or the family of a child, who is or was under the jurisdiction of the juvenile court, where this information is directly or indirectly derived from the records of the juvenile court or acquired in the course of official duties , [emphasis added] upon conviction thereof, shall be guilty of a Class A misdemeanor under the jurisdiction of the juvenile court and also may be subject to civil sanctions. Provided, however, that nothing in this section shall be construed to prohibit or otherwise limit counsel from disclosing confidential information obtained from the juvenile court file of the child as needed to investigate the case of the client or prepare a defense for that client, provided that the disclosure is in furtherance of counsel’s representation of the party. \\nChasteen asserts that the confidentiality laws were designed to protect the family from the people working on their case disclosing information to the public. They do not apply to the families themselves talking about their case with friends, family, or the media. \\nAttorneys, GALs, social workers, or any other agent working for the state could “acquire” information about the case “in the course of official duties,” and are thus bound by confidentiality laws, but the family members are not. \\nShe cites KR v. LAUDERDALE COUNTY DEPT. OF HUMAN, 133 So. 3d 396 – Ala: Court of Civil Appeals 2013 , which clarifies that the information that law 12-15-133 refers to is that which is “derived from the records of the juvenile court.” The findings of the Appeals Court further state that “§ 12-15-133 is intended to protect the identity of juveniles, not DHR employees, guardians ad litem, or juvenile-court judges….” \\nThough this law is often cited to parents simply as the “confidentiality law” and is often used in the attempt to bully and silence parents from discussing their case with the media, attorney Lisa Chasteen maintains that this was not the intent of the law at all. The family has the right to discuss their story with whomever they wish. She made these points in a meeting last year with other attorneys and DHR state commissioner Nancy Buckner, and reports that no one refuted her that day. \\nLaw Professor Jenny Carroll notes issues of concern with gag orders, reports the Anniston Star : \\nAn additional problem with a gag order in the Holmses’ case is that the public has no information about what steps the state is taking to protect the child and if the parents’ rights are being protected through the proceedings, said University of Alabama School of Law Professor Jenny Carroll. It is, she noted, the parental rights that are in question in the case. \\n“The public has a right to check if actions being taken in our names are in fact correct,” Carroll said. \\nThe courts are public forums, she said. If they are insulated to the point that the public is excluded it makes it very difficult to know that everyone involved is being treated fairly. That’s not how our courts are supposed to work, she said. Land of the Free? \\nBecause of the gag orders and threats about confidentiality, Danielle and Christian Holms are reportedly afraid to speak out about the injustices that their friend says are happening to them. The lifestyle they are leading appears to be similar to that of John the Baptist or some of the Old Testament prophets. Many of the patriarchs of the Judeo-Christian faiths, such as Abraham, Isaac, and Jacob, lived relatively nomadic lifestyles. While Jesus told his disciples to “Follow Me,” He also said: \\nFoxes have dens and birds have nests, but the Son of Man has no place to lay his head. (Luke 9:58, NIV) \\nThe Holms’ friend doesn’t understand how America, “the land of the free,” can take someone’s newborn baby away from them for choosing to follow their religious beliefs and living a life that is not like the mainstream. Yet, Danielle and Christian Holm are stuck in a state they were simply passing through, engaged in the fight of their lives for their baby. How You Can Help the Holms \\nCall Alabama Governor Robert Bentley’s office at 334-242-7100. He may also be contacted here . He is also on Facebook . \\nSenator Gerald Dial is the Senator for Cleburne County. He may be reached at 334-242-7874, or contacted here . \\nRepresentative Richard Lindsay represents their district. He may be reached at 334-242-7713, or contacted here . According to the Alabama Family Rights Association , ALFRA: Alabama has a nine-member task force created to examine the work of the Alabama Department of Human Resources (DHR). If you have issues or concerns about DHR services, your best plan of action is to contact the following legislators/lawmakers and committee members: Connie Rowe, State Representative, has replaced Mac McCutcheon as the Task Force Chair / 334-242-7600/ email here . Chris England, State Representative / 334-242-7703 / 205-535-4859 / email here . Greg Reed, State Senator / 334-242-7894 / he is on Facebook . The complete list of committee Members can be found here: Executive Order Number 11 Comment on this article at MedicalKidnap.com. Support the cause of Medical Kidnapping by purchasing our new book! If you know people who are skeptical and cannot believe that medical kidnapping happens in the U.S. today, this is the book for them! Backed with solid references and real life examples, they will not be able to deny the plain evidence before them, and will become better educated on this topic that is destroying the American family. 1 Book – 228 pages'"}, "time": 1742562951.2642338}