{"duration": 1.5926947593688965, "input_args": {"text": "'NTEB Ads Privacy Policy WHEN LIBERALS ATTACK: Crazed Crooked Hillary Supporter Attacks Tea Party In Saint Augustine, FL This woman, obviously a Crooked Hillary supporter, was walking with 3 other friends, when they stopped to watch a meeting of the St. Augustine Tea Party on the street corner. They all stopped and she went back and forth with herself until she had the nerve to confront - the assault - this member of the Tea Party. by Geoffrey Grider October 29, 2016 Moments later, she flies into a rage, rips the sign out of his hand and throws it to the ground, then rips the Tea Party flag out of his hand and throws that to the ground. \\nHave you ever sat back and watched someone who was working up the nerve to do something nasty like shoplift from a store or slash someone’s tire? They go back and forth, reasoning amongst themselves, until they finally have worked up the courage to carry out the deed. That’s exactly what happened today on Saint George Street in St. Augustine, FL, as I stood there and watched the event unfold. \\nThis woman , obviously a Crooked Hillary supporter , was walking with 3 other friends, when they stopped to watch a meeting of the St. Augustine Tea Party on the street corner. They all stopped and she went back and forth with herself until she had the nerve to confront – then assault – this member of the Tea Party. \\nThe Tea Party member asked her: “Why do you kill babies?” \\nHer immediate response was: “Because it keeps the crime rate down”. \\nFlabbergasted at her answer , he asked her again and she again gave the same response. Moments later, she flies into a rage, rips the sign out of his hand and throws it to the ground, then rips the Tea Party flag out of his hand and throws that to the ground. Having finished her assault , she storms off in a huff. \\nCan you imagine the cry and faux Liberal outrage that would have resulted if a Donald Trump supporter had acted like this with a female Crooked Hillary supporter? It would be headlines on the nightly news for a week and jail time for the Trump supporter. \\nNow you have see with your own eyes what real Hillary Clinton supporters look like and act like. Please share! \\nGeoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742564007.122431}