{"duration": 0.152846097946167, "input_args": {"text": "\"Fox Host Jeanine Pirro: FBI ‘Disgraces And Politicizes’ Itself With ‘Wrong’ Letter About Hillary Emails (VIDEO) By Darrell Lucus on October 30, 2016 Subscribe \\nIt’s no surprise that Democrats are up in arms over FBI director James Comey’s announcement to Congress that his agency was looking into emails that were potentially related to Hillary Clinton’s email server. However, a number of Republicans–including a number of Comey’s own agents–are also rolling their eyes in disgust . Well, on Saturday, another Republican joined that list . And that Republican happens to be a host on Fox News Channel. \\nWhen Jeanine Pirro led off Saturday night’s edition of “Justice with Judge Jeanine,” she hiked eyebrows into hairlines by blasting the manner in which Comey and the FBI handled this matter. Watch here. \\nPirro got right to the point in her “Opening Statement”–from where she’s sitting, Comey’s decision to send that letter “both disgraces and politicizes the FBI” and was the definition of “all that is wrong in Washington.” \\nIt’s no secret that Pirro is a staunch Donald Trump supporter. Indeed, she has spent most of the campaign finding ways to attack Hillary–to the point that The Washington Post’s Erik Wemple called her “a key Fox News apologist for Trump.” But Pirro took off her red-tinted blinders long enough to come to the same conclusion as a number of other Republicans–there is no defence for the manner in which this was handled. “Whether it’s Hillary Clinton or anyone else, Comey’s actions violate longstanding Justice Department policy, the directive of the person he works under, the Attorney General–but even more important, the most fundamental rules of fairness and impartiality.” \\nOn paper, unlike the average Fox News host, Pirro knows how investigations are supposed to be conducted. She was a prosecutor in Westchester County, New York–a wealthy suburban county north of New York City, and home to White Plains and Yonkers–for 15 years, a judge for three years, and Westchester County district attorney for 12 years. \\nBut Pirro takes what happened to Hillary personally as well. She recalled that in 2006, when she was the Republican candidate for New York state attorney general, the FBI announced it was investigating her for secretly recording her husband almost a month before the election. Pirro contended that this announcement, like Comey’s announcement about the emails, ran counter to longstanding Justice Department policy against commenting on potentially politically-charged investigations for at least 60 days before an election. \\nThe investigation ultimately went nowhere. However, Pirro argued that “the adverse publicity” cost her dearly at the polls; she was ultimately routed by future governor Andrew Cuomo. For her, Friday’s announcement brought back memories of how she believed she was treated a decade earlier. “What happened to me in 2006 was wrong. And what happened to Hillary Clinton yesterday was equally wrong.” \\nIn the interest of fairness, it’s not likely that the announcement in and of itself cost Pirro the election. New York was swept up in a massive Democratic wave that year, one that saw Eliot Spitzer win the governorship with the second-biggest victory for a statewide race in New York history. \\nNonetheless, Pirro’s point is very well taken–no responsible investigator should make public comments about politically-charged investigations this close to an election, unless there is something absolutely earth-shaking. She reminded her viewers that the DOJ/FBI rule against commenting publicly on politically-charged investigations is in place for a reason–“announcements so close to elections have an impact,” and the FBI should not even appear to have “its finger on the scales of justice.” \\nLike a judge scolding a lawyer, Pirro then knocked down two of the arguments that have been advanced in favor of Comey writing the letter. She didn’t see anything in his congressional testimony that would have left him with no option short of a public announcement. What about fears of leaks? Well, Pirro said Comey should have collared the committee chairs to whom the letter was addressed and told them, “If this gets out, I’ll know that you did it.” Pirro left out what may have been the biggest argument of all–at the time, the FBI hadn’t even obtained a warrant for those emails. It finally did so on Sunday night. \\nApparently Pirro anticipated that this wouldn’t go over too well in fair and balanced land; she closed by reverting to the usual GOP talking point that Hillary would be facing charges right now had Comey conducted a real investigation in the first place. It didn’t save her. Most of the commenters on two Facebook posts Pirro made on the matter have argued Comey had no other option. \\nThen again, it’s not entirely surprising. After all, most Fox News viewers don’t think any Democratic president is legitimate in the first place, so apparently they’re perfectly fine with fundamental fairness being thrown out the window. The mere fact that we have to applaud Pirro for having the guts to speak out against Comey’s actions–which, at this point, seem incompetent at best–says a lot about the state of our discourse. And it isn’t good. \\n( featured image courtesy Pirro’s Facebook) About Darrell Lucus \\nDarrell is a 30-something graduate of the University of North Carolina who considers himself a journalist of the old school. An attempt to turn him into a member of the religious right in college only succeeded in turning him into the religious right's worst nightmare--a charismatic Christian who is an unapologetic liberal. His desire to stand up for those who have been scared into silence only increased when he survived an abusive three-year marriage. You may know him on Daily Kos as Christian Dem in NC . Follow him on Twitter @DarrellLucus or connect with him on Facebook . Click here to buy Darrell a Mello Yello. Connect\""}, "time": 1742562153.4383843}