{"duration": 0.48148179054260254, "input_args": {"text": "' The night of Nov. 13, 2015, Islamic State militants attacked eight places in and around Paris, killing 130 people and wounding nearly 500. It was the most lethal attack in France since World War II. Confusion gripped the city as two teams of attackers struck nearly simultaneously. One struck at the Stade de France, just outside Paris, while the other shot up cafes and bars in the hip 10th and 11th Arrondissements. About 20 minutes later, a third team of attackers entered the Bataclan concert hall in the same neighborhood, taking hostages and killing scores. The New York Times interviewed 27 people who witnessed parts of those events and asked them to recount what they experienced: suicide bombs, gunfire, the terror of near death. Two of the people interviewed, the Paris fire chief and the brigade’s chief medical doctor, had a uniquely comprehensive view as they helped oversee the response, shuttling back and forth between the attack sites and their headquarters. The chronology here is taken from an official report on the attacks that was published by a French parliamentary inquiry. These accounts have been edited and condensed. This is the story of the attacks by those who lived through them. A soccer game between the national teams of France and Germany begins at 9 p. m. It is televised and watched by millions. Some 75, 000 people are at the stadium, including President François Hollande, several government ministers and a German delegation. The first bomber explodes his vest outside the stadium at 9:19 p. m. Gen. Philippe Boutinaud, 54 The commander of the Paris Fire Brigade. He had worked at NATO and the European Union in Brussels and had been on missions in Afghanistan and the Balkans. On Nov. 13, he had been invited to watch the game and was not there in an official capacity, but he soon went to work. I was at the Stade de France when the first explosion took place. The thing that stopped me from imagining that this was an attack was that there was no blast. It was like a firecracker. I immediately asked my driver, who was outside, to see what was happening. He had also heard the explosion, he got close, and he told me he believed it was a firecracker. He told me that there was a person wounded in the leg, but at first glance it didn’t seem very serious. There was no one nearby. The first suicide bomber who blew himself up, we don’t know why, but he blew himself up in the middle of nothing. Salim Toorabally, 43 A security guard at the Stade de France. Before the game, he stopped a man trying to force his way into the stadium. Five days later, he learned from the police that the man was one of the suicide bombers. I heard the first explosion. At that point I thought to myself that this wasn’t a smoke bomb and it wasn’t firecrackers. It was much more than that. I looked behind me, toward the interior of the stadium. The president was present, the players, a fair number of important people. And I thought to myself, I hoped that I was wrong. Noël Le Graët, 74 The president of the French Football Federation. He was in the stand along with Mr. Hollande. The president was warned by his services very, very quickly. There was a whole security system around our stand, with a video camera on each gate, so the president was told discreetly to come upstairs to see what was happening. And someone came to tell me: “Don’t move, no need to show panic, but you’re going to meet the president in two minutes, but very calmly, leave with your hands in your pockets so you don’t show any sign of panic. ” 9:22 p. m. A second suicide bomber explodes his vest outside the stadium. Mr. Toorabally  The second explosion was much more violent. I shook, the ground vibrated. I told everybody who was working on the exterior perimeter, my colleagues: “Guys, we are facing an attack. You need to get inside. You need to take shelter. ” Then I saw three people who were wounded, who were being carried by someone. I took the first victim, I put him on the ground. I didn’t have any gloves. He was hurting a lot. I saw a piece of flesh on his pants. I didn’t think that we were being attacked by suicide bombers. I would never have thought that we were going to see this type of attack in France. 9:24 p. m. Within five minutes, General Boutinaud is called by one of his deputies,   Tourtier, the chief doctor for the Paris Fire Brigade, who has received a call himself from the operational headquarters that there were explosions at the Stade de France, as well shootings in central Paris. General Boutinaud The second explosion had just happened, and I still did not have the sense that these were attacks. I exit, because something strange is going on. But when I leave the Stade de France, I stumble on the leg of a suicide bomber. I came across his mangled body, in the middle of nothing. I see the other leg on the other side of the street, and I see the rest of the body to the left and it’s completely twisted. The second striking image was the stuffing from the anorak [one of the bombers was wearing]. The second suicide bomber had blown himself up about 30 or 40 meters to my right, and there was a lot of stuffing from the anorak’s inner lining, a kind of white cotton that the wind was blowing. For me, there are no ifs or buts, it is obvious that these were suicide bombers. Because it was one of the scenarios that we had been working on for many months. Mr. Le Graët  The president asked me to speak to our players and not to tell anyone. And the game must go on because the [Interior] Ministry wanted to secure all exits. My mission was to go down to the locker rooms, make sure there was no television, nothing, not warn anyone. 9:53 p. m. A third explosion occurs near the stadium in front of a McDonald’s. A decision is made not to tell the crowd. The game is allowed to continue and ends about an hour later. Franck Bargine, 47 The announcer at the Stade de France and a radio personality known as Max. He addressed the crowd as it left. In light of external events  —   we keep the vocabulary soft  —   people can leave the stadium and a few exits are closed, and one or two parking lots are not accessible, but for the rest we’re safe, the stadium and the area around is safe. As people are evacuating the stadium, firecrackers go off nearby, and suddenly many in the crowd, aware from text messages and rumors that Paris appears to be under attack, turn and rush back into the stadium, pouring onto the field. General Boutinaud [The Stade de France] is clearly the center of gravity of the terrorist attacks. You don’t send three suicide bombers to blow themselves up in the middle of a crowd if it’s a secondary target. It was the primary objective. We asked that the stadium not be evacuated and that the match continue. It is this decision that avoided a massacre. The third terrorist, he walked around for half an hour, and then he found a target of opportunity, which was a McDonald’s, and, pardon me, but I think he chose a McDonald’s because it embodies America. But what he was waiting for during that   was for us to give the order to evacuate the stadium to blow himself up. I am personally convinced of it. At the Stade de France, sadly, there was one dead and 54 wounded. As a main target for the terrorists, it was a complete failure. 9:24 p. m. The cafe attacks began at Le Carillon bar and Le Petit Cambodge restaurant when a team of three attackers opened fire with   assault weapons, killing 15 people. By coincidence, General Boutinaud, Dr. Tourtier  and other Paris authorities had conducted a drill for a terrorist attack just that morning involving the use of assault weapons in 13 locations.  Dr.   Tourtier, 48 The chief doctor for the Paris Fire Brigade. He was home with his wife and children when the attacks started. I get a phone call telling me there are explosions at the Stade de France, and almost in the same moment, I get a call telling me there is shooting in Paris, and I immediately understand that we are dealing with a complex terror attack. I make two calls. The first one is to General Boutinaud, but he was already aware of the situation. The second call I made is to Professor [Pierre] Carli, the head of the emergency services. I tell him: “Pierre, something peculiar is happening. Prepare yourself to mount a   response. ” Some of the hospitals we contacted, at first, said, “So is this a   to the drill we did this morning?” So we had to tell them that ‘no’ this was definitely real. 9:26 p. m.  The three attackers quickly drive on and shoot at the terraces of the Casa Nostra pizzeria and of the Café Bonne Bière in the 11th Arrondissement, killing five more.   Triomphe, 58 A former civil servant in the Labor Ministry. He went to the Café Bonne Bière because he thought it would be a quiet place for a drink with a friend, and was wounded there. When I got to the cafe, the waiter asked me if I wanted to be on the terrace outside or inside, and since it was a mild night, I said at first the terrace, and I don’t know why, but at the moment when I sat down I said, “No, actually, I prefer inside. ” Each time I say to myself, that saved my life. The people who died at La Bonne Bière were those who were on the terrace. Me, I was just by the window. About 9:30 p. m. General Boutinaud leaves the Stade de France to go to the Fire Department’s operational headquarters, which answered 580 calls in the first   after the attacks began. Trailing in the wake of the attackers, his deputy, Dr. Tourtier, arrives at Rue Bichat, the crossroads where the carnage took place at Le Carillon bar and Le Petit Cambodge. Dr. Tourtier I find a sight close to one that I could have seen as a military doctor with a combat company under fire in Afghanistan or the Sahel with this small difference, which is that the public is not protected. So some wounds are extremely serious. We were walking on bullet cartridges from Kalashnikovs. There are already many dead, and we had to organize the chaos to do the best job possible. Mr. Triomphe The former civil servant, who was wounded at La Bonne Bière. I remember I was lying down, and I saw someone in white. For that reason, I thought it was an angel. [It was an Italian doctor.] She put on tourniquets to stop the bleeding, because I was still losing blood. She used napkins. She was the only doctor there, and she was very busy. The three attackers continue driving south through the 11th Arrondissement to another cafe, La Belle Équipe.  Mandy Palmucci, 34 An American  internet technology consultant. She had been in Nice to run a marathon, and then spent a couple of nights in Paris with her two best friends and the sister of one of her friends. At about 8:30, we went to a restaurant on the Rue de Charonne, Clamato, to put our names in. At about 8:45, 9:00, they told us they would call us in about 30 minutes when they had a table ready. And so we wandered down to the Belle Équipe to have a drink. Someone happened to notice a table on the patio, basically right next to the entry into the restaurant. It had three chairs, so we sat down. Myself and one of my friends shared a chair. At 9:35, the phone rang, and it was the restaurant saying our table was ready. 9:36 p. m. The shooters arrive. The carnage at La Belle Équipe is the worst of any at bars and cafes that night, leaving 19 dead.  Ms. Palmucci I did not see anybody because my back was to the street, but we heard a bunch of popping noises. I glanced to my right and began to see flashes. It was the gunfire. I apparently screamed, “Get down!” and the four of us dropped to the ground. I remember linking my arm with one of my friend’s arms and one with the other one. And every time somebody shot, feeling them shake, and I must have been shaking, too. I thought they were being hit with bullets because their bodies were jerking. They shot at us for 90 seconds, and there was a     pause and then they resumed shooting. In that pause, people were screaming. Just  —   I still remember the screams  —   and I remember thinking: Stop screaming or they’re going to keep shooting because they are going to know people are still alive on this patio. But they shot for another 60 seconds, and the screaming had decreased at that point. Listen to the owner of La Belle Équipe, Grégory Reibenberg, whose wife was killed, talk about returning to the bar after the attacks in a 360 video. François Vauglin, 46 The mayor of the 11th Arrondissement. It was an elected colleague, who lives above La Belle Équipe, who called me. “Listen, François, this is very serious: There are gunshots in the street. The people are wailing. It’s very serious. ” I called the commissioner of police, and I said: “I am going to go there. Apparently, there’s gunfire. ” The commissioner said to me: “No, no, no. Above all, don’t go to that place. The situation has not been stabilized. “Come to the Police Headquarters. ” General Boutinaud directs the emergency response from the Fire Department’s headquarters, receiving constant updates from fire companies on the scene.  The gunmen flee, but one goes into the nearby Comptoir Voltaire, a cafe.  General Boutinaud One of them blew himself up at the Comptoir Voltaire. We started to give him a heart massage. We hadn’t understood that he was a terrorist. The explosives had not completely blown up. His leg had been ripped off. When our guys opened his jacket to start the heart massage, they saw the electrical wiring. That’s when they understood that he was a suicide bomber. 9:40 p. m. The final set of three attackers arrive at the Bataclan, where an American band, the  Eagles of Death Metal, took the stage around 8:45 p. m. before a    crowd of about 1, 500 people. One attacker was killed by police officers who arrived within 15 minutes of when they opened fire on the crowd. Two attackers retreated upstairs with hostages. In all, 90 people were killed.  Audrey Guiny, 25 A stretcher carrier for ambulances. She went to the concert with two friends. She was wounded so badly that she has been unable to return to work. I don’t remember anymore what the first songs were, but they were just super great. The atmosphere was very good, very joyous. I had my telephone in my hands to take photos, and I was receiving notifications from Le Parisien [a newspaper] that told me that there was shooting not far away. I said to my friend who was on one side of me, “Ah, there’s gunfire not far from here,” and she said to me: “We’re not at risk. We’re in a concert hall. ” Aurelia Gilbert, 43 A worker for a Swedish security company. She has two daughters, ages 13 and 15. She went to the concert with a friend. At around 9:40 at the end of the sixth song, “Kiss the Devil,” during the guitar solo we heard what sounded like a firecracker. But I knew it was not a firecracker. I knew right away it was a gunshot. Then I heard screaming coming from behind me, more gunshots and people screaming. The guys from the band froze, and the lead guitarist and singer disappeared. Julian Dorio, 34 The drummer for Eagles of Death Metal. This tour was the first time he had played with them. I heard and felt the gunfire at first. I didn’t see it initially. We were near the end of playing a song when the rounds of gunfire began, but at the time we weren’t sure what it was. One thing that will always stand out was how powerful it was. As a loud rock ’n’ roll band, there’s not much that’s louder than us. I’ll never forget how small we felt. It dwarfed the band. I was surprised I wasn’t hit, because as a drummer on a riser I’m a sitting duck. Ms. Guiny I heard noise behind me, I realized that this was gunfire. My reaction was to pull my two friends to the floor. I turned my head to be aware of what was going on. I clearly saw the terrorist with his gun. Ms. Gilbert The main entrance to the Bataclan was at our backs and I turned around, and I saw some white flashes and heard the noise of machine guns, and dived to the floor. I told my friend and his daughter to get down. My friend said, “It must be a firecracker. ” I yelled: “No! Get down on the floor! Now!” Then we heard more screaming and the sound of gun shots. I was lying on the floor and people were lying alongside me. I turned my head and saw one of them reloading his gun. I saw him clearly and was able to later identify him at the police station. We couldn’t go backward toward the main entrance and the street because the gunmen came from there. We couldn’t go toward the concert pit. So we began to crawl toward a nearby door that led to the beginning of a staircase and several staff rooms. The stairs led to the balcony. I thought to myself: I am going to die today. But if I was going to die, I preferred to die moving than to die on the floor. Ms. Guiny They shot the first magazine, and then they reloaded. For us, it went on for an eternity: It was five or 10 minutes. We saw people next to us dying. We heard the sounds. We knew everything. I knew that right next to us there was death. He was reloading. It was now or never. Except it was based just on the terrorist that was aiming in our direction. Mr. Dorio I moved off the drum riser to my left so I could take cover behind some of the guitar amps. I’ll never forget looking up and seeing the first half of the audience coming towards the stage, and the back half I couldn’t see at all. In a matter of seconds, those people had hit the floor or they are running and trampling each other. It was awful. It’s at this point I can see the shooters firing aimlessly into the crowd. I looked out, and I saw some stuff that you can’t unsee. I saw the most unpleasant things I’d ever seen in my life. Daniel Psenny, 59 A journalist who writes about television for Le Monde and lives on the opposite side of the small street, the Passage    that runs alongside the Bataclan. It’s 35 years that I’ve lived here. At the end of the concerts, the artists leave by the emergency exit, and often the spectators, the fans, come to the artists’ exit. There is a bit of a scrum. I heard gunfire. I understood that it was gunfire and not fireworks. I was curious. I called the newspaper and said: “I want to alert you that there is something very serious happening at the Bataclan. People are dead. ” By reflex, I told myself I am going to film what’s happening. Listen to Mr. Psenny talk about the night of the attack in a 360 video outside the Bataclan. Ms. Guiny There were many of us, and we got up, but just then, we took fire from the other side. A person who was behind me fell on top of me, and I found myself back on the floor. I fell with him to the ground, because at that moment I was wounded and he was wounded, too. It was my left foot. Mr. Dorio I just started to crawl. I was flat on my stomach with my chin on the stage as low as I could get behind the drum riser. As I got across the stage, I was close enough to the stage door to hop up while the shooters were reloading. I made some wrong turns, but eventually I found an exterior metal door  —   the only way out  —   and braced myself even in that billionth of a second for there to be shooters outside. I didn’t hesitate  —   that wasn’t an option. Once I pushed open the door, there’s a side alley, and it was chaos. You can hear the gunfire. They are trying to hit people that are exiting. I remember people turning to help and asking, “Are you O. K.?” “Let’s go” and “Run. ” You see how kind and compassionate everyone is even though we’re all at risk. 9:57 p. m. Police officers, armed only with handguns, kill one of the terrorists. Mr. Psenny I was making the video from my window, trying to understand what was happening. The people would come out of the Bataclan, fall down. There was gunfire, cries. There was a father calling for his son: “Oscar, Oscar. ” There were neighbors helping the wounded. It was a war, really, not a fight. I went downstairs very carefully. I looked to see what was happening. It was a desolate landscape with many bodies lying there, some people who cried still, who were wounded. Just to the right of the entry hall, I see a man who is close. Afterward, I will know to call him Matthew and that he is American. Was he dead? Is he still living? I didn’t know. I touched him. I sense he’s alive. He speaks to me. He says something I don’t understand. A man wearing black helps me drag him into the entry hall of my building. In closing the door, I lean out a little bit to see what’s going on. It was then that I took a bullet. Afterward, I realized it was a bullet, but at the time, it burned me. It was like a firecracker had exploded on my arm. Ms. Gilbert Trying to reach an exit from the orchestra pit. When they stopped a second time to reload, someone said: “Go! Go! Go! We have to go! They are coming upstairs!” I saw two of them climbing the main stairs. People around me were dropping as they shot. There was a wounded guy on his back, and I tried to grab him. I screamed. It was 15 meters to the door, but it felt like it took hours to get there. There were 20 of us moving at that moment and 50 people on the [side] stairs when we finally arrived. A security guard told us there was no exit. When we looked back, we saw people lying on the floor. I remember yelling: “You have to move. You have to come join us. ” But they didn’t move. Before I shut the door, I saw two of the gunmen, and they were targeting individuals and shooting them. When I finally shut the door, I had the first feeling of security. 11:30 p. m. General Boutinaud, Dr. Tourtier and other members of the emergency services arrive at the Bataclan. Ms. Gilbert  At 11:30 p. m. we heard a lot of people moaning and crying and crying for help. We waited. Dr. Matthieu Langlois, 46 The chief doctor for the special police unit, known by its French initials, RAID, that responds to terrorist attacks and hostage situations. He had been at a jazz concert with his wife when he got the call for duty.  We enter the Bataclan with the RAID assault team. We are at the back of the column. I immediately see victims everywhere, everywhere, everywhere. In the lobby of the Bataclan, the entrance is strewn with victims, but my job is not to stop at the first victims but to have a comprehensive idea of what is going on. General Boutinaud When I entered the Bataclan, we found 78 bodies, when I went in the first time. But these were people who, the vast majority, were wounded with immediately deadly injuries. I am not a forensic doctor  —   but these were bullets to the head, in the lungs, with massive hemorrhages. Things that you can’t stop with a tourniquet. Dr. Langlois I am told that there are two terrorists and that they have an explosive. I tell my commander that I want to evacuate the [orchestra] pit, and they give me the authorization and tell me it’s secure and that in any case they’ll cover me. So they put shooters at the four corners of the pit. We were applying tourniquets and compressive bandages and treating collapsed lungs. There was also the human aspect where we were talking to the victims to explain to them what we were doing. Saying, “I’m a doctor, my name is Matthieu, we’re going to get you out of here. ” I remember the looks in their eyes, the words of some of the victims. One of the first things I did when I got to the pit was to shout  —   I have a loud voice that carries  —   “All the victims who can move on their own, please stand up and come over here. ” Unfortunately, all those who could move had either already fled or had hidden. Ms. Gilbert At around midnight, people heard the cops knocking at the door. People were asking, “Should we open the door?” The terrorists had gone to the bathroom where people were hiding and pretended to be special forces. So it was not obvious what to do. They opened the door, and we left to go through the exit near the stage. I saw the cops, and one was young and he looked so scared. I took one girl with me and told her to put her hands on her eyes. I walked through the central area near the stage, and it was war. Young people had been dancing two hours earlier, but now there was blood everywhere. It was horrible. Mr. Vauglin The mayor. I arrived [at Police Headquarters] to see televisions screens with images of the video protection [security cameras] of Paris that are connected to the police and that have   of what was happening in different places. Then there was this whiteboard, and it had all the sites listed on it and then columns for absolute emergency, relative emergency and dead. It seemed surreal to me. There were perhaps more people in the column “deceased,” at least at the beginning, than the other columns. General Boutinaud Inside the Bataclan. I will always live with the fact that I saw ringing cellphones that said “Papa,” “Maman,” on the dead. But the parents, they will have to live with the lasting loss of their loved ones. 12:18 a. m. The French police start their assault on the two attackers who had retreated upstairs with hostages. Both are killed, all the hostages are freed, and a police officer is seriously wounded when one of the assailants detonates his explosive vest. Antoine Leiris, 35 A father who lost his wife, Hélène   during the Bataclan attack, leaving him alone to raise their    son, Melvil. France is still recovering. There is a real threat and a legitimate fear. Everyone feels it. This fear is there, and it is rational. These are isolated acts, but we know that behind them there are also more   attacks being prepared. It is a reality. But we seldom say how remarkable it is that people are going on with their lives, and overcoming that fear. Taking the Metro, going to cafes to drink a beer, to concerts or shows  —   because Paris is still full of life. I don’t think we say enough how courageous this is.'"}, "time": 1742563155.2638423}