{"duration": 0.33943963050842285, "input_args": {"text": "'WIESBADEN, Germany  —   The pianist starts his show abruptly, with a wail. The words and music are Arabic, but the pain is clear in any language. “How, God?” he sings, “How could God bring you this scourge?” He is performing for a German audience in a quiet German town with   spires. But Aeham Ahmad is thinking of his pulverized, starving neighborhood in Syria, where a few years ago, before coming to Germany as a refugee, he embarked on a strange career by playing concerts in the rubble. He jumps up, bobs his head in an impish little bow, and says by way of introduction: “I’m sorry, I’m not a good piano player. I learned in Syria. It’s not like Mozart and Bach, but this is the way we play it. ” In a Germany deeply torn between embracing and fearing the million migrants who have arrived in the past year, Mr. Ahmad, 27, has set himself the task of putting a human face on his fellow refugees. His aim is to ease their integration and maybe even help the millions more, not least his wife and children, whom he left behind. That mission has become more urgent lately, after Germany was shocked by two separate attacks in which refugees linked to the Islamic State tried to kill civilians. Only the assailants died, but the attacks have left many Germans angry, anxious and ready to slam the door shut. There is already talk of accelerated expulsions. Onstage, Mr. Ahmad flatters his listeners, reassures them, owns them. He tells of his flight from bombs, hunger and repression. He sings of minarets and church bells “calling for peace. ” He declares that “terrorism has no religion,” and that refugees come “to build Germany,” not to harm it. “History will remember that Germany has taken in the Muslims,” he declares, then leads them in a singalong of “All My Little Ducks,” the German equivalent of “Mary Had a Little Lamb. ” He leaves the hall, as usual, in a shower of hugs and selfies. But the next day in his tiny room in the town of Wiesbaden, he lacerates himself over the role he has honed so well: He is “the good refugee,” making “good Germans” feel good about themselves. He cannot help seeing a touch of minstrel show in his act. He imagines how he might look through German eyes: a charity case, a trained animal dancing for treats. “He’s a refugee dog,” he says in a singsong voice. “They play with him, and he’s playing, and he’s happy. ” Before the Syrian catastrophe, Mr. Ahmad, a   Palestinian refugee and the son of a blind violinist, was a piano teacher and music shop salesman. Now, his message of resilience, along with Germans’ desire for a reassuring symbol, has made him Germany’s most popular refugee. He sings, he plays and, sometimes, he smacks the piano in grief and rage. Mr. Ahmad is booked virtually every night, crisscrossing the country from stadiums to modest provincial bars. He has appeared in dozens of uplifting German news accounts and received a prestigious prize named for one of his idols, Beethoven. Christina Aguilera’s film production company has been in touch. “I feel like I’ve been taken out of reality,” he says one day on a bullet train between venues. He grew up, he continues, hearing his father spin his life story into legend, “like you tell stories about Sinbad the sailor. ” But even the   tale of a   blind musician who learned to play the violin pales in comparison with his own fantastical voyage, from Syrian government siege and Islamist extremist rule through shipwreck and exile to uneasy celebrity. Onstage every night, he   that journey. And on every road trip in between, he   it  —   rather mercilessly, like the   artist he has always been. “I feel like a frog that’s being dissected,” he confesses, collapsing into a seat at the start of a     trip to his next gig, which, as always, because of labor restrictions on refugees, he will play for free. “I’m selling myself,” he says, “and I’m not even getting the money. ” Worse, he wonders if he is making any difference: “They clap for me, but the rest”  —   back in Syria  —   “are still in prison, under siege, under bombs. ” His own boys rebuke him: “You didn’t send a plane to bring us. ” God, stop the world from spinning I can’t stand it any more. I’m dizzy. I want to come down. Mr. Ahmad’s life as the   refugee began three years ago when he parked his instrument on a street of destroyed buildings  —   walls collapsed, awnings askew  —   and began to sing. He lived in Yarmouk, a neighborhood on the outskirts of Damascus, the capital, that started as a refugee camp for Palestinians in the 1950s. Over the years, it grew into a bustling district of a   Palestinians and Syrians. But it was now gutted by the Syrian civil war. Government troops kept it cordoned off, pounding it with artillery and sometimes airstrikes. Insurgent groups vied for control. Lack of regular access to food and medicine was beginning to kill some of the most vulnerable starved to death. His only audience was his neighbors, trapped with him. And his goal was almost painfully modest: to keep everyone from losing their minds. “I want to give them a beautiful dream,” he said back then, over a spotty internet link. “To change this black color at least into gray. ” Mr. Ahmad played with a young men’s chorus he called the Yarmouk Guys. Some of his songs were sad, yearning for those who had fled  —   “My emigrants, come back, the mint is still green”  —   some rollicking and funny, skewering Arab and world leaders. His toddler would sit atop the piano girls and old women joined in his father had cameos with his violin. Soon, videos of the performances spread online, first among Syrians, then more widely, a different kind of dispatch from a war so brutal that it had already left much of the world numb. Mr. Ahmad became a symbol of hope and defiance and began to embrace a larger mission: showing that there were human beings stuck in Yarmouk. “Everyone is against the civilians,” he said in a video chat. Eventually, his new fame would help him escape the siege  —   to join the emigrants he sang of. That helps drive his ambivalence and fuel a colossal case of survivor’s guilt. It is also how, after years of online correspondence, my colleague Hwaida Saad and I find ourselves on the main square of Wiesbaden on a late spring afternoon, meeting Mr. Ahmad in person for the first time. It is clear how much he has already changed. He wheels his bike confidently up to the cafe, birdlike and sprightly in a striped shirt and skinny jeans, and wolfs down an éclair. He has learned some staccato English. When his phone rings, which it does constantly, he adopts the brisk, businesslike tone of a performer too busy for all of his fans. “I talk to a million people on the phone,” he tells a caller. “I’m sorry, which one is your concert?” The very first thing he tells us is that he does not want to sugarcoat the experience of exile, or to be anyone’s poster child for Europe as a happy ending. “They see me as a star,” he says. “But still, they look at us funny. ” He says people often ask how it feels to play in Germany, and now, for once, he wants to give the honest answer: “I feel nothing. I close my eyes, and all around me  —   I play and I remember Yarmouk. ” The memory of war is everywhere in Wiesbaden. The dormitory where Mr. Ahmad shares a room with five other refugees is called the American Camp, for the troops it long housed after World War II. Every day, he wheels his bike past brass tiles bearing the names of deported Jews, embedded in sidewalks outside their onetime homes. Many of Mr. Ahmad’s enthusiastic helpers here see aiding refugees as part of Germany’s moral burden, atoning for its Nazi past. When the local newspaper reported that he needed someone to donate a piano, he was offered 30. Mr. Ahmad marches us down a grand avenue lined with palatial villas to a   cafe to meet some friends, elegant women who envelop him in motherly good will. One, Elke Gruhn, the director of an arts center, has adopted Mr. Ahmad’s cause  —   and, effectively, Mr. Ahmad himself. Lately, she has been battling rules that have blocked Mr. Ahmad from being paid for performances, or even collecting the Beethoven prize honorarium of 10, 000 euros, about $11, 200. He has reached a stage in his asylum process that lets him work as, say, a wage laborer. But German rules, Ms. Gruhn says, seem not to envision a refugee artist or musician. So he subsists on the government’s €300 monthly refugee stipend. But still, he keeps playing because that is not just what he does, but who he has become. That evening, as he rushes to yet another concert, he insists that he is not a great pianist, just good at marketing his story. He has invited other refugees to join him at concerts, to ease the minds of Germans who fear that every refugee might be a terrorist. “People will see them sitting and listening to music,” he explains. “Sweet people, following German rules. ” The concert is a hit. But he cannot sleep afterward, and a day later, his mood darkens as he heads to his next show. At the train station, he learns the venue is five hours away, not two, as he was told. Too many patrons are booking too many shows, not coordinating, not considering his exhaustion. Germans, he says, would never subject themselves to such a schedule. “Just say no,” Ms. Gruhn has told him. But he cannot. He feels obligated. As the train zips through a storybook landscape  —   castle turrets, deep woods  —   he brings to mind an enchanted child, unable to stop dancing. Disembarking at Gütersloh, an industrial town clear across the country, he sees a car hit a bicyclist, who falls with a thud. “She’s going to die,” he says. “I know the sound. Just look at it, the blood. She will die for sure. ” But there is no blood. The paramedics think the cyclist will be all right. Is Mr. Ahmad reliving Yarmouk? There’s a little child sleeping in the bed, Hungry, tired, but dreamy. The barrel [bomb] came. It didn’t leave behind the small or the old. The child is up in paradise. So happy, so full. The first time a government fighter jet attacked Yarmouk is seared into Mr. Ahmad’s memory: Dec. 16, 2012. Rockets landed near a United Nations school and a mosque sheltering displaced people. Body parts littered the ground. People fled headlong with hurriedly packed bags. It was a shock to Palestinians raised on the Syrian government’s claim to be their champion. For Mr. Ahmad, it was the start of “a second Nakba,” or disaster, the Palestinians’ name for their displacement in 1948. To him, Yarmouk was a substitute homeland. But his father, born in southern Syria after his parents were driven from their home in the Galilee, had always told him different. “He told me music is our country,” Mr. Ahmad tells us. “And now I’m noticing this is true. ” Mr. Ahmad’s parents, like him, were rescued by music. His father, Ibrahim, lost his sight at 8. He was sent to a school for the blind in Damascus, bound for a life of weaving wicker chairs. But he lied, telling his father that he needed a violin or he would be kicked out of school. He learned to play Arabic classics and opened a music shop in Yarmouk. Later, in the Old City of Damascus, a young Syrian woman named Iman, whose conservative father did not want her studying music, sneaked to Ibrahim’s shop and asked for accordion lessons. Romance ensued, but her father rejected her blind suitor: “You want to be a servant?” So Iman, pretending her accordion needed repairs, took her mother to the shop. Ibrahim played, Iman’s mother sang. A few years later, Aeham Ahmad was born. As a small boy, he watched his father dip wooden slats in water, softening and bending them to build the fat belly of an oud. He remembers his father’s storeroom, a mysterious expanse of broken guitars and pianos. His father enrolled him in an elite music school when he was 6 to learn to read scores and play Western classical music. He worked hard but lacked the grades, and the connections, for a concert career, so he studied music education and worked in the shop. Still, he played with a driven energy. “I always feel I’m not good enough,” Mr. Ahmad says. “I was like this before, and the war made it worse: I play every day to fix something that is screwed up in me. ” One day, Mr. Ahmad noticed a young woman in glasses lingering at the window. Mortified, he pretended to be on the phone. Later, she walked in with shawarma sandwiches. “For me and you,” she said. “We’re going to eat. ” It was a bold move in their traditional neighborhood. But Mr. Ahmad liked that. He felt even luckier after war broke out. His wife gave birth twice while their town was under siege, and she supported him when playing music became risky. “I thank God,” he says, “for having a strong woman. ” When protests against President Bashar   of Syria began in 2011, he says, he watched with interest but did not join. He was reluctant to embrace a cause or identity beyond music, “my own personal revolution. ” Security forces fired on protesters armed rebellion gathered steam. Yarmouk stayed neutral at first, as Palestinian leaders urged. But Syria’s relatively good treatment of Palestinians gave them a stake in the country, and like Syrians, they were divided. Many joined the rebellion. Yarmouk Camp sheltered wounded rebels and displaced civilians, enough to provoke government attacks. Rebels seized the camp, and security forces sealed it off. Officials rarely allowed United Nations aid deliveries. People were shot while picking up food boxes, or arrested, like Mr. Ahmad’s brother Alaa. Food prices soared. Those who could afford to bribe their way out did. Those who could not ate grass. Mr. Ahmad did not try to leave he was wanted for military service. To feed the family, he spent its savings. Then an uncle set his pigeons free and fled himself, leaving the birds’ feed, a mountain of lentils. Mr. Ahmad opened a falafel stand. Falafel should be made of chickpeas, but people were hungry. One day, a shell landed near his stand, killing three customers. Shrapnel hit Mr. Ahmad’s hand. He started playing piano more, to rehabilitate his fingers. That gave him an idea. The lentils were running out, but music never would. He found seven friends sharing a water pipe (tobacco was scarce). One, Mahmoud Tamim, liked to write songs mocking Mr. Assad Mr. Ahmad asked him to write one about Yarmouk. They became the first Yarmouk Guys, Shebab  . For their debut, they pushed the piano to the rubble from the first airstrike and sang the new song, “Yarmouk Is Missing You. ” It remains their biggest hit. The project felt pure back then, but as their fame grew, some singers asked for pay. Next, activists started selling photographs to media outlets. Even Mr. Ahmad saw opportunities. “Always, there is the ego,” he recalls. “They made money off me, but without these photos, I am not famous. ” The attention made it harder to fend off warlords. A   Palestinian faction demanded that he remove a line about Yarmouk’s being “surrounded by cannons,” since the obvious culprit was the government. Then came   Islamists. They objected first to   concerts, later to music in general. “If the Prophet Muhammad were here, they would call him an infidel if he disagreed with them  —   it’s about ‘agree and obey,’” Mr. Ahmad complained at the time in a video chat. “Can they stop the birds from singing?” He stopped playing in public. He hid his electronic keyboard in a duffel bag and climbed to rooftops to play, watching out for government snipers. Still, he felt unsafe. Members of his band were being abducted: Mr. Tamim by security forces, others by Islamist fighters. One day, a gunman set his piano on fire. Finally, Mr. Ahmad cashed in. A German journalist sent enough money to get him and his family out of Yarmouk. Halfway to Turkey, security forces stopped them and threw them in jail, the children included. They got out a week later, but, shaken, they decided that his wife and their children would wait in Syria because relatives are still in danger, we are not disclosing their names. Mr. Ahmad went on alone. Emigration, kidnapping, killing and hunger My heart is torn among my bones, Bleeding blood, fire and light. Misery has crossed the sea. For a while, he was just another refugee. He faded into the masses fleeing then, in August 2015, as the exodus to Europe grew. Paying smugglers, he crossed mountains, dodging checkpoints and border guards. His first boat from Turkey sank, and several people drowned. Mr. Ahmad filmed his second crossing for the BBC. Safe in Europe, he started posting his progress on Facebook. Now, he was traveling openly as the Piano Man of Yarmouk. He arrived in September in Munich, entering Germany at the peak of European sympathy. A wrenching photograph of a drowned Syrian toddler, Alan Kurdi, had gone viral borders were open and Germans were meeting trains with flowers. Mr. Ahmad bounced from camp to camp, but practically everywhere, he found helpers who knew his story. In Stuttgart, an online fan invited him home. They played a   duet, his first German performance. Concert invitations multiplied. In November, the   welcome came to an abrupt end with the Islamic State’s attacks in Paris. Though the killers were European citizens of North African origin, fears grew that sleeper cells were among the Middle Eastern arrivals. There were angry calls to send refugees back. German liberals spreading a message of inclusion seized on Mr. Ahmad, “as if,” he joked, “I’m the only refugee around. ” He performed with German celebrities like the folk singer Judith Holofernes and received the International Beethoven Prize for Human Rights, Peace, Inclusion and the Fight Against Poverty. After migrants attacked women in Cologne on New Year’s Eve, he tried to ease tensions with a concert. Audiences and journalists skewed his story to fit European fears, he says, emphasizing Islamist extremists but playing down the government siege. But he could hardly complain, counting on the attention to speed the paperwork to bring his family to Germany  —   and maybe even smooth others’ path to integration. “I failed to change anything in Syria,” he reasoned, “but here I might have a chance. ” By the time we visit, Mr. Ahmad is used to the contrasts of life in this wealthy German town. Outside his dormitory, spacious houses are draped with lilacs and rhododendrons, and a poster advertises a €50 reward for a lost teddy bear. Rarely alone, he is lonely. He walks head down, video chatting with his wife and boys. He bounces between his dorm room and fancy hotels paid for by concert organizers. He has met the German chancellor, Angela Merkel. Television news amps up fear of refugees and reports occasional attacks on migrants. But Mr. Ahmad insists that no German has ever threatened him. And so, he keeps playing, trying to change German minds  —   and fight stereotypes. A day after the Wiesbaden concert, Mr. Ahmad plays for a high school class. The students listen, rapt, then ask questions that rankle. “If you were still in Syria, would you be fighting for ISIS?” “How could you learn piano in Syria?” He answers gamely: He is against all violence Syrians are the Islamic State’s main victims prewar Syria was troubled, not destitute his family owned several houses and pianos. “How has your integration been?” someone asks. “Perfect,” he says. Just once we see him lose his temper: a wealthy concert host demands €2 change from a €200 train ticket. “Everyone is promoting themselves,” Mr. Ahmad splutters later. In recent weeks, things have improved for Mr. Ahmad. He received residency status and a small apartment. His bureaucratic tangle is solved: Now, he will be able to incorporate a company, hire a manager and be paid for concerts. And finally, days ago, his wife and children arrived. Still he wonders onstage: “Are they feeling the music I’m feeling? Or do they just feel pity because I’m a refugee?” Germans, he tells an audience in Wiesbaden, often ask if he has heard of Mozart. He pauses a beat, then charges into a   medley: Mozart’s Rondo Alla Turca intercut with Beethoven’s “Für Elise. ” He slows down, speeds up, flashes a grin, then swipes a hand up and down the keyboard like Little Richard, or Liberace. The crowd laughs, clapping in time. It is a musical joke, a jab at racist assumptions. And they are in on it.'"}, "time": 1742562233.9356043}