{"duration": 0.03963875770568848, "input_args": {"text": "'■ The “red lines” that would bring President Obama back into the political fray. ■   Donald J. Trump talked “life” with Kanye West at Trump Tower  —   and Kanye puts off a White House run? ■ A Hill press aide vaults to the White House. In an interview on “The Daily Show,” President Obama drew a red line on “core issues” that might lead him to speak out against his successor in the first year of his  . If Mr. Trump sought to create a Muslim registry or sought to round up those brought illegally to the United States as children, “I might have to say something about that. ” “But it’s not my intention to be, I’ve said this before, the old guy at the bar who’s just kind of hanging on,” he said. “I need to take some time. ” That reluctance to speak out is beginning to anger some fellow Democrats. He also told Trevor Noah, the “Daily Show” host, “When the D. N. C. got hacked, we immediately assigned our intelligence community, our law enforcement, to investigate what had happened. ” “This was not a secret,” the president said. The rapper and music impresario Kanye West, who told an audience that he would have cast his ballot for Mr. Trump if he had bothered to vote, dropped by Trump Tower to discuss   issues with the  . And the moment wasn’t going to slip by Mr. Trump, who came down to the lobby to greet the “New Kanye” in front of the cameras. “Just friends, just friends. He’s a good man. Long time. Friends for a long time,” Mr. Trump told reporters about the meeting. He added: “Life. We discussed life. ” Mr. West took to Twitter after the meeting to explain. He then suggested cryptically that his own promise to run for the presidency in 2020 would be delayed  —   presumably so as not to challenge Mr. Trump’s second term. Some of his fans may be saying they miss the old Kanye. For congressional reporters of even a moderately long vintage, Stephen Miller was known as an eager press aide to Senator Jeff Sessions of Alabama, eager to talk . .. and talk . .. and talk about policy, especially his views on immigration. Mr. Miller hit it big when he left the Senate for the Trump campaign when few gave Mr. Trump much of a shot to win the Republican nomination. On Tuesday, he was named assistant to the president and senior adviser to the president for policy. Before Mr. Trump is even inaugurated, the first poll of his potential Democratic opponents in 2020 is now out. Not surprisingly, it looks a bit premature. The survey of 400 Democratic primary voters, conducted last week by Public Policy Polling, drops off precipitously from there, with Senator Cory Booker of New Jersey coming in at 4 percent, Senators Al Franken of Minnesota and Kirsten Gillibrand of New York at 3 percent, Senator Sherrod Brown of Ohio and Gov. Andrew Cuomo of New York at 2 percent, and Julián Castro, President Obama’s housing secretary, at less than 1 percent. In other words, the field is wide open  —   though Mr. Biden did keep his options open. “Four years is a lifetime in American politics. And I think that nominees are determined by their parties based mostly on what skill set is most needed at that time,” the departing vice president said Sunday. “And who knows where we’re going to be two years from now when people really start looking seriously at what they are going to do. ” Senator Joe Manchin III of West Virginia, perhaps the most conservative Democrat in the Senate, discussed the post of energy secretary, but in the end, his appointment would have only let his state’s new Democratic governor appoint a successor. Mr. Manchin still may be the  ’s best Democratic partner as he tries to enact his agenda. His statement after Rick Perry got the energy job: The Trump transition team announced early Tuesday that Rex W. Tillerson, the chairman and chief executive of Exxon Mobil, was the  ’s choice for secretary of state, despite concerns over Mr. Tillerson’s close ties to President Vladimir V. Putin of Russia. Those “relationships with leaders all over the world” are what has both Democrats and Republicans worried. Democratic interest groups are happily providing visual evidence. And: But the concern is bipartisan.'"}, "time": 1742628520.3918784}