{"duration": 0.09529709815979004, "input_args": {"text": "'Good morning.  Here’s what you need to know: • The U. S. Justice Department urged a federal appeals court to reinstate President Trump’s targeted travel ban, saying immediate action was needed to ensure the nation’s safety. Almost 100 U. S. companies  —   including Apple, Facebook, Google and Microsoft  —   filed a legal brief arguing that the order is unconstitutional. President Trump’s confrontation with the courts may foreshadow years of legal battles, and in Congress   debates have turned into proxy battles over a combative president. Here’s what to watch for this week. _____ • Mr. Trump, who returned to Washington after military briefings in Florida, has rejected criticism. In a Twitter post, he said polls showing that a majority of Americans oppose his travel order were “fake. ” In another, he bristled at suggestions that Stephen K. Bannon, his chief strategist, holds the real power in the West Wing. But the chaos and shock waves at home and abroad appear to be prompting Mr. Trump and his top staff members to begin rethinking their improvisational approach to governing. _____ • A U. S. task force of influential China specialists, including former government officials and scholars, reports on two years of assessments of one of the world’s most important bilateral relationships. Set up during the Obama administration as relations began turning rocky, the panel will recommend ways to pursue U. S. interests given the current political strains. _____ • Other than a timing error that left the Israeli prime minister, Benjamin Netanyahu, briefly hanging outside 10 Downing Street and disagreements over the Iranian nuclear deal and Israel’s advancement of settlements, his meeting with Theresa May was cordial. Mr. Netanyahu was on his way back to Israel when the Knesset passed a provocative law retroactively legalizing Jewish settlements on privately owned Palestinian land  —   a measure almost certain to be nullified by the high court, but one that makes the ascendance of the country’s right wing inescapable. _____ • Remarkably good public health news: Researchers may have found the tools to stop cholera, the global pandemic that rose from the swamps of Bangladesh two centuries ago. Extremely effective treatments draw on studies and tests by a research center in Dhaka. And a vaccine accepted by the W. H. O. is being stockpiled for epidemics. _____ • In an epic, overtime Super Bowl, the New England Patriots came back from a   deficit to defeat the Atlanta Falcons,  . We also reviewed Lady Gaga’s halftime performance and the commercials. _____ • Introducing The Daily, your audio news report. Our reporter Michael Barbaro runs down the big stories and the big ideas. Fifteen minutes a day, five days a week. Listen here if you’re on a computer, here if you have an iOS device or here for an Android device. • More than 46 billion digital red packets  —   online versions of envelopes of cash  —   were sent on WeChat, the Chinese social media platform, during the Lunar New Year period, China’s   media reported. • President Trump’s  travel ban has disrupted the business of corporate travel to the U. S. “Many groups will just look to move the meeting elsewhere,” one industry leader said. • The new head of the Federal Communications Commission, Ajit Pai, has rapidly moved against net neutrality and consumer protections. • Qatar Airways inaugurated the world’s longest scheduled commercial flight, 16 hours and 20 minutes, connecting Doha to Auckland, New Zealand. • U. S. stocks were weaker. Here’s a snapshot of global markets. • India’s southern Tamil Nadu state is set to swear in Sasikala Natarajan as chief minister, a confidante of her predecessor: the influential politician Jayalalithaa Jayaram, or Amma, who died two months ago. The opposition has been scathing, the Supreme Court is considering a petition to block the move until it rules on a corruption case against her. [The Financial Express] • An Australian panel investigating child sexual abuse confronted reports of 4, 444 allegations involving Catholic priests between 1980 and 2015. [Al Jazeera] • A South Australian senator, Cory Bernardi, is expected to resign from the Liberals to establish a conservative party, despite a flood of pleas from his colleagues trying to save the government. [ABC] • In France, Marine Le Pen, the leader of the   National Front, set the tone for her bid for April’s presidential election in a speech with echoes of President Trump that warned against globalization and Islamism. [The New York Times] • The U. N. mission in Afghanistan reported that 2016 was another year of record civilian casualties, expressing particular concern over a 65 percent jump in the number of children killed or injured by explosive remnants. [The New York Times] • The police in Myanmar confiscated more than 4. 6 million methamphetamine pills from a Buddhist monk. [The Irrawaddy] • Xiao Jianhua, the   tycoon missing since being escorted from a Hong Kong hotel by mainland officers last week, shared something with many mainland billionaires: a preference for female bodyguards. [South China Morning Post] • We’re all busy in the morning, so don’t waste time: Here’s how to do the shortest workout possible. • Two brothers and a sister credit a surprising source for their lifelong closeness: their parents’ ugly divorce. • Recipe of the day: Everyone needs a spicy noodle dish that comes together in less than half an hour. Here’s a great one. • The golfer Aditi Ashok is ranked No. 100 in the world at the age of 18, but she is just the second Indian member of the L. P. G. A. and among the few female professionals in her nation. • Queen Elizabeth II’s sapphire jubilee, marking 65 years on the British throne, brought new coins, a stamp and gun salutes. The only thing missing? The queen, 90, who spent a private and reflective day. The Berlin International Film Festival opens this week with a tale of survival, that of one of the 20th century’s greatest jazz guitarists: Django Reinhardt. He was born in Belgium in 1910 to a Roma family that earned a living playing music from town to town. Reinhardt started off playing the banjo in Paris dance halls. At 18, he lost the use of two fingers on his left hand in a fire, and adapted with a new technique. He rose to fame in the ’30s. But with World War II and the Nazi occupation of France, Reinhardt tried to flee, fearing that, as a Roma and a jazz musician, he would be detained and killed. Instead, his fame  —   and the popularity of an officially discredited art form  —   may have saved him. “The Germans used Paris as the base for soldiers to rest and relax,” said Michael Dregni, a Reinhardt biographer. “Jazz was the hot music of the time, so they all want to go out and see Jazz, and Django was the biggest star in Europe. ” Reinhardt lived through the war, dying of a sudden stroke in 1953. His legacy lives on in the genre he helped create: Gypsy jazz. Patrick Boehler contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742628512.1957328}