{"duration": 0.0589292049407959, "input_args": {"text": "'Share on Twitter \\nSen. Mark Kirk (R-Ill.) ignited a political firestorm Thursday night after he randomly brought up his Democratic rival’s heritage after she touted her military experience during a debate. \\nRep. Tammy Duckworth (D-Ill.), who is of mixed Thai and American descent, cited her military service as well as her family’s when making the case against rushing into war. \\n“I’m a daughter of the American Revolution. I’ve bled for this nation. But I still want to be there in the Senate when the drums of war sound,“ she said. ”Because people are quick to sound the drums of war and I want to be there to say, ‘This is what it costs, this is what you’re asking us to do’. Let’s make sure the American people understand what we are engaging in.” \\nWhen given a chance to respond, Kirk remarked, “I had forgotten that your parents came all the way from Thailand to serve George Washington.” Illinois Senator Mark Kirk Made A Racist Remark About His Opponent’s Heritage https://t.co/MmS5HnGEG7 pic.twitter.com/Q1bFnqviAG \\n— BuzzFeed News (@BuzzFeedNews) October 28, 2016 \\nNo one, including the debate moderator, quite knew how to react. After a brief awkward silence, the moderator moved the discussion forward. Critics immediately branded the comment as “racist” and distasteful. \\nDuckworth lost both of her legs while serving as a pilot in the Army during the Iraq war. Her father also served in the U.S.army and her family’s military service goes all the way back to the Revolutionary War, BuzzFeed reported . US Representative Tammy Duckworth of Illinois arrives to address delegates on the fourth and final day of the Democratic National Convention at Wells Fargo Center on July 28, 2016 in Philadelphia, Pennsylvania. Image Credit: Saul Loeb/AFP/Getty Images \\nDuckworth responded on Twitter with an indisputable message. My mom is an immigrant and my dad and his family have served this nation in uniform since the Revolution #ILSEN pic.twitter.com/ehEBHswFMs — Tammy Duckworth (@TammyforIL) October 28, 2016 \\nKirk’s campaign later issued a statement addressing the controversy: \\n“Senator Kirk has consistently called Rep. Duckworth a war hero and honors her family’s service to this country. But that’s not what this debate was about. Rep. Duckworth lied about her legal troubles, was unable to defend her failures at the VA and then falsely attacked Senator Kirk over his record on supporting gay rights.” \\nBut at that point, the damage was already done. '"}, "time": 1742562923.191873}