{"duration": 0.06579780578613281, "input_args": {"text": "'The Patriot News Agency website popped up in July, soon after it became clear that Donald J. Trump would win the Republican presidential nomination, bearing a logo of a red, white and blue eagle and the motto “Built by patriots, for patriots. ” Tucked away on a corner of the site, next to links for Twitter and YouTube, is a link to another social media platform that most Americans have never heard of: VKontakte, the Russian equivalent of Facebook. It is a clue that Patriot News, like many sites that appeared out of nowhere and pumped out   hoaxes tying his opponent Hillary Clinton to Satanism, pedophilia and other conspiracies, is actually run by foreigners based overseas. But while most of those others seem be the work of young, apolitical opportunists cashing in on a conservative appetite for viral nonsense, operators of Patriot News had an explicitly partisan motivation: getting Mr. Trump elected. Patriot News  —   whose postings were viewed and shared tens of thousands of times in the United States  —   is among a constellation of websites run out of the United Kingdom that are linked to James Dowson, a   political activist who advocated Britain’s exit from the European Union and is a fan of President Vladimir V. Putin of Russia. A vocal proponent of Christian nationalist,   movements in Europe, Mr. Dowson, 52, has spoken at a conference of   leaders in Russia and makes no secret of his hope that Mr. Trump will usher in an era of rapprochement with Mr. Putin. His dabbling in the American presidential election adds an ideological element that has been largely missing from the   landscape of websites and Facebook pages that bombarded American voters with misinformation and propaganda. Far from the   Macedonian teenagers running fake news factories solely for profit, Mr. Dowson made it his mission, according to messages posted on one of his sites, to “spread devastating     memes and sound bites into sections of the population too disillusioned with politics to have taken any notice of conventional campaigning. ” “Together, people like us helped change the course of history,” one message said, adding in another: “Every single one of you who forwarded even just one of our posts on social media contributed to the stunning victory for Trump, America and God. ” In a recent email interview from Belgrade, where he has met with Serbian nationalists, Mr. Dowson explained how his decision to establish an American social media presence was similar to the move into European markets by Breitbart News, the conservative provocateur media operation run by Stephen K. Bannon, Mr. Trump’s chief strategist. “Simple truth is that after 40 years of the right having no voice because the media was owned by the enemy, we were FORCED to become incredibly good at alternative media in a way the left simply can’t grasp or handle,” Mr. Dowson said. “Bottom line is: BREXIT, TRUMP and much more to follow. ” While it is easy to overstate the influence of fringe elements whose overall numbers remain very small, the explosion of fake news and propaganda sites and their possible impact on the presidential election have ignited alarm across the American political spectrum. A recent study found that most people who read fabricated stories on Facebook  —   such as a widely circulated hoax about Pope Francis endorsing Mr. Trump  —   were inclined to believe them. Then there is the added element of Russian meddling. The Central Intelligence Agency has concluded that Moscow put its thumb on the scale for Mr. Trump through the release of hacked Democratic emails, which provided fodder for many of the most pernicious false attacks on Mrs. Clinton on social media. Some of those attacks found a home on Russian websites such as the one for Katehon, a   Christian think tank aligned with Mr. Putin. Katehon recirculated   conspiracies under headlines like “Bloody Hillary: 5 Mysterious Murders Linked to Clinton. ” Another Russian site that urged support for Mr. Trump, called “Just Trump It,” is linked to the International Russian Conservative Forum, an annual gathering of   leaders in St. Petersburg that has featured Mr. Dowson, among others, as a speaker. The site, which seems mostly aimed at selling Trump   was registered to an individual at a Russian company that trademarked a logo used to certify that merchandise was not made with migrant labor. Some analysts see danger signs in the nexus of Russian interests and   agitators in Europe and the United States. Social media can amplify even the most obscure voices, giving them a stage from which to broadcast a distorted message to credulous audiences. “These messages seep into the mainstream,” said Alina Polyakova, a senior fellow at the Atlantic Council, a nonpartisan international affairs institute in Washington. “They may have been extreme or fringe at one point in time, but they have been incredibly influential in shaping people’s views about key geopolitical events in a very specific direction. ” Russia is particularly adept at playing this game, Ms. Polyakova said. “Moscow specifically encourages and facilitates” the spreading of propaganda through proxies, she said, as well as through events like the Russian conservative forum, which showcases views and narratives favored by the Putin government. At the inaugural forum in March 2015, Mr. Dowson praised Mr. Putin as a strong defender of traditional values, while belittling President Obama and the United States itself as “feminized men. ” In the email interview, Mr. Dowson said he was not supported by Russia in any way, and he accused critics of trying to tar conservatives as dupes of Moscow. “I look on this rebirth of     hysteria by the LEFT as a hilarious reaction born out of the left’s inability to realize THEY elected Trump, not me, not the Russians, not even the right,” he said via email. A colorful if somewhat enigmatic figure in Britain  —   The Times of London recently described him as “the invisible man of Britain’s far right”  —   Mr. Dowson, at first blush, would not be an obvious mouthpiece for Russia. Formerly a church minister in Northern Ireland and the father of nine, he became involved in   campaigns, joined the British National Party in the   and, later, founded Britain First, a stridently   group opposed to what it called a creeping Islamic threat to traditional British values. He publicly split with the group in 2014 after some of its leaders started invading mosques and threatening Muslims, which he criticized as   and counterproductive. While involved with Britain First, Mr. Dowson made deft use of social media and websites to promote its work and convey the impression of a mass following. A British watchdog group called Hope Not Hate, which has tracked Mr. Dowson’s online activities, concluded that he has “a rather canny knack for building up protest groups and movements on the basis that it was your Christian duty to follow his work. ” Mr. Dowson claims to have reached millions of Americans across all of his online platforms in the   to the November presidential election, a number that could not be verified, in part, because he would not confirm all of his sites. Online visits to Patriot News did not come close to that, although when combined with several other sites that appear to be connected to Mr. Dowson, the total number edges above a million most viewers were in Britain. Whatever the precise numbers, there is little question that postings on the sites and Facebook pages linked to him were viewed and shared hundreds of thousands of times. Many of the postings appear to be lifted from other conspiracy websites, repackaged and launched back into the social media maelstrom. Another site that trafficked heavily in   news was run by Knights Templar International, a militant religious group that Mr. Dowson is involved in, which has recently supported   militias patrolling border areas in Bulgaria and Hungary. For Mr. Dowson, such activities are in keeping with his philosophy that traditional Christian values are under siege because of feckless leadership by America and European powers. The success of Mr. Trump, he said, is the logical result of voters’ rejection of the weakness of global elites. Mr. Dowson has long been optimistic about the effectiveness of social media. During the 2015 conservative forum in Russia, he spoke presciently about the looming online battle for the attention of American voters. “We have the ability to take a video from today and put it in half of every single household in the United States of America, where these people can for the first time learn the truth, because their own media tell lies, they tell lies about Russia,” Mr. Dowson said then. “We have to use popular culture to reach into the living rooms of the youth of America, of Britain, France, Germany, and bring them in,” he said. “Then we can get them the message. ”'"}, "time": 1742628598.2760613}