{"duration": 0.04448056221008301, "input_args": {"text": "'Окт 5 2016 в 5:26 PDT \\n\\nMit zwei Jahren konnte Bella kurze Sätze bilden und in drei Sprachen schnell lesen. Kurz vor ihrem dritten Geburtstag fügten ihre Eltern Chinesisch zum Ausbildungsprogramm hinzu. Laut Julia zeigte ihre Tochter ein großes Interesse an der neuen Sprache und wollte selbst Cartoons auf Chinesisch schauen. \\nMit drei Jahren und zwei Monaten lernte Bella mit Begeisterung Spanisch und Deutsch, aber nicht nur: Nebenbei tanzte sie, spielte Geige und sang. Später kam noch die arabische Sprache hinzu. Damals wie heute geht Bella spazieren, spielt Verstecken und liest normale Kinderbücher –in verschiedenen Sprachen. Grundsätzlich haben Spiele einen wichtigen Platz in ihrem Lernprozess. \\nDie kleine Bella verbringt ihre Zeit mit Reisen mit Muttersprachlern, besucht eine englischsprachige Theatergruppe, hat Malunterricht auf Französisch, Tanzunterricht auf Spanisch und lernt Eiskunstlauf mit einem deutschen Muttersprachler. Außerdem organisieren ihre Eltern für sie Sprachunterricht mit ihren Freunden, die genauso mehrsprachig aufwachsen. Sprachen lernen ist gut für das Gehirn Авг 25 2016 в 10:32 PDT \\n\\nWissenschaftler fanden heraus, dass die Fähigkeit, verschiedene Sprachen zu sprechen und zwischen ihnen zu wechseln, von unterschiedlichen Gehirnarealen abhängt. Sie werden je nach phonetischen Sprachmerkmalen, der Grammatik, Vorstellungen und sogar der Tonalität der Aussprache aktiv. \\n„Jede neue Erfahrung führt dazu, dass unser Gehirn neue Nervenverbindungen herstellt”, erklärt Psychologin Tatjana Djatschenko. „Der für unser Gedächtnis zuständige Hippocampus stimuliert das Wachstum von neuen Neuronen. Dadurch wachsen wortwörtlich einige Gehirnareale.“ \\n„Die Mehrsprachigkeit wirkt sich positiv auf die allgemeine Entwicklung des Kindes aus, obwohl es manchmal Sprachentwicklungsstörungen im frühen Alter verursachen kann. Dies tritt bei Kindern, die einsprachig aufwachsen, seltener auf”, sagt Kira Iwanowa, Mitarbeiterin des Instituts für linguistische Studien der Russischen Akademie der Wissenschaften. \\nSprachunterricht im frühen Alter sei jedoch keine Garantie dafür, dass ein Kind diese Sprache später gut beherrschen werde, erklärt Maria Molina, wissenschaftliche Mitarbeiterin des Instituts für Sprachwissenschaften der Russischen Akademie der Wissenschaften. “Ich kenne ein Beispiel: Eine Mutter hat mit ihrem Sohn nur Englisch gesprochen, bis er drei Jahre alt wurde. Dieser Junge kann derzeit nicht einmal sein Pensum in einer ganz normalen Schule schaffen.”'"}, "time": 1742562276.5343468}