{"duration": 0.2771449089050293, "input_args": {"text": "'Financial Markets , Gold , Market Manipulation , Precious Metals , U.S. Economy Deep State , silver , silver eagles , war on cash admin \\nDesperation is setting in. The blatant attacks on gold are occurring almost exclusively during the Comex floor-trading hours now. Every night gold pushes higher as Asia’s appetite is seemingly voracious. The two most systemically dangerous banks right now, it was revealed according to the IMF, are JP Morgan and Citibank. I’m sure part of the smash is in response to that. All this action between gold and the dollar means is that the counter-force reaction to what the Fed is doing is going to be even more forceful. They already can’t control the dollar and the strong dollar is going to decimate Q4 revenues and earnings. Give it 6 months and I bet they start talking about the need to print more money. Gold will sniff that out well ahead of time. \\nStewart Dougherty has provided another guest post for IRD. I think this is his best commentary yet. \\nThe people hold in their hands the key that can unlock the door to financial independence and steadily increasing wealth, but they do not realize it. An obvious truth, being clear, is the hardest thing for people to see. They look right through it, as though it were not there, even though it is. Once they do see a truth, they never overlook it again. It becomes an invaluable fixture of their thinking. \\nLike the adult elephant taught from youth that the light chain around its leg cannot be broken, the people believe that the strangulating government currency chain around their necks is unbreakable. The fact is that if the grown elephant pressures the chain, it will snap, setting him free. The people, too, have the power to break the currency chain that chokes them and reclaim their financial freedom from the plunderers who have usurped it, if only they would study, understand and act. \\nThe key to which we refer is private money, the most important forms of which are physical gold and silver. Cash is another, albeit greatly inferior form, in that currencies (not technically money) are controlled by their issuers. Global Deep State efforts to restrict or even eliminate the people’s ability to possess private money are now rampant, and running into resistance. Denied the ability to possess private money in the form and quantity they desire, the people will be deprived of financial freedom, and in the end, given that freedom is indivisible, any freedom at all. \\nGiven the oligarchs’ clear, unmistakable intention to deprive the citizens of financial freedom, the people now have not just a financial, but a moral obligation to redenominate a portion of their liquid assets into private money. The people need to tell the Oligarchy in clear terms that they have gone too far, and will not be going any farther. \\nThere are 7,000,000,000,000 people on this earth. There are fewer than 5,300,000,000 troy ounces of gold. If every person were allotted an equal share, each could possess 0.76 troy ounces of gold. In that gold can only be mined, and not printed by Deep State oligarchs, this sum is projected to remain consistent going forward, and may even shrink if mining cannot keep up with population growth. \\nThe actual ownership of gold is vastly skewed. Fewer than one billion troy ounces of physical gold worldwide are thought to be potentially available to the market, in current circumstances. This is not gold actually offered at this time, but that could be offered to the market if the selling climate were opportune and owners decided to sell. The other 4,300,000,000 ounces are believed to be immobile, at least for now, and include government reserves, non-trading private reserves, and forms of jewelry that are highly unlikely to be sold unless people’s personal or financial circumstances significantly change. People do not sell their wedding rings or other jewelry having deep sentimental value unless there is a pressing reason to do so. \\nThis means that there are perhaps 1,000,000,000 ounces of gold available to 7,000,000,000 people. Put another way, 1,000,000,000 ounces are available to what is estimated to be well more than $200,000,000,000,000.00 in net private wealth. Which translates into 0.143 available ounces per person; and total available gold amounting to only 0.65% of total global private wealth, at a price of $1,300 per ounce. If a low single-digit percentage of the people or the private wealth decided to mobilize into gold, where would the gold come from? The answer is: from radically higher prices, because that is the only place it can come from. We wonder, what is it about these numbers that the people cannot see? The conclusion is: the obvious, which is the hardest thing for them to see. Gold is so rare, and demand for it so potentially overwhelming that it is literally ridiculous it sells at today’s price. Yes, the “Great Oz” of price manipulation and corruption continues to hold sway for now, but Toto is sniffing him out and zeroing in. He is going to find the curtain and pull it back, and then all hell is going to break loose, because the current price of gold is a colossal fraud and lie. An historic price reset is inevitable. \\nAt its core, gold’s price is not a Deep State oligarchy manipulation problem, even though we know for a fact that the oligarchs totally dominate and rig the precious metals market to manufacture fraudulent profits for themselves while advancing a corrupt, statist narrative to assist their government puppets. \\nGold’s absurd price is, in fact, a marketing problem. The gold mining industry has been singularly incompetent when it comes to marketing its precious product. The gold industry has not produced one original marketing idea in 250 years, and gold’s current price proves it. Once people’s eyes are opened to gold’s unparalleled virtues as private, personal money, everything is going to change, most notably, its price, which is going to surge out of fundamental necessity. \\nBrexit and the Trump victory reflect a rising populist tide in the west. The people are saying that they want to take back their countries and their lives. We believe that the same type of popular anger and dissatisfaction that has produced the sharp and ongoing political reset in the west is likely to erupt next in the field of currency and money. The populist movement was fomented in the first place by people who had become disgusted by constant financial regression and the real prospect of and trajectory toward eventual impoverishment. Their sentiments have set the stage for a populist monetary revolution. A determined segment of the people, those who still have liquid assets, is going to figure out that now is an excellent time for them to take back their money. They are going to say it’s time to “drain the monetary swamp” of its Wall Street swindlers and central bank fakers, escape the financial tyranny of zero interest rates, and return to ancient money that is rare, possesses intrinsic value, is beautiful and is virtually certain to appreciate. \\nFor the oligarchs, it is one thing if the people want to take back their countries; it is an entirely different, and totally unacceptable thing if they want to take back their money. The control of national currencies, money supplies and interest rates has been the Deep State oligarchs’ secret preserve and heavily protected “No Go” zone for decades. Their domination of this preserve has enabled them to mint phenomenal amounts of, guaranteed, risk-free profits; profits not measured in the millions or billions, but in the trillions of dollars. To the oligarchs, monetary populism means war. Which now rages, even though most people don’t yet know it. \\nTo combat monetary populism, the oligarchs have launched a War on Private Savings. To put the monetary genie back in the bottle, they need to herd the people’s liquid funds into institutions they control. Now that they can clearly see the whites of the people’s eyes, as the populist sentiment spreads into finance, they have put their actions into overdrive. They need to defeat monetary populism before it becomes a “movement,” which it has every potential of doing. \\nThe War on Private Savings is the largest conflict ever declared in the history of mankind. It is different from all other wars because: it is being fought against humanity, not a national or political enemy; it is global; it is being waged with trickeries, lies, schemes, propaganda, prohibitions and demonetizations, not military weapons; it is synchronized; it targets personal, after-tax savings, not a country’s natural resources, geography, government or political leaders; it has been declared by a non-elected Oligarchy; it is about contempt for freedom; and its ultimate objective is about one thing and one thing only: the conquest of other people’s money. \\nThe War on Private Savings, while massive in itself, is actually part of a larger conflict, the War on Human Freedom. While human freedom has been under attack in various ways since the dawn of mankind, it has never faced such a concerted, coordinated, massively well-funded attack as the one now declared against it by the Deep State oligarchs. If the initiators of the War on Private Savings win, the real casualty will be human freedom, because there can be no human freedom if there is no financial liberty. The stakes of this war for the people are impossible to overstate. \\nIndia has been turned into a 1.3 billion person human laboratory for the advanced research, development and testing of the weapons to be used in the full-scale, global War on Private Savings. The weapons that prove successful in India will then be used on other people in other nations throughout the world. What happens in India is a global prologue of what is yet to come. \\nThe term “War on Cash” is a deliberately misleading misnomer. It is merely one act in a much more sweeping drama. There is no war on cash; there is an attack on cash. The attack on cash is just one of the many battles within the much larger War on Private Savings. We can now observe a rapidly intensifying, synchronized, global effort to demonize, control and eliminate cash in Australia; Europe, especially the Nordic countries; the United States; India; and virtually everywhere in between. The War on Private Savings is strategic; cash controls are tactical. The oligarchs want you to focus on the tactic, not the full strategy. You don’t want to fall for that. \\nIn addition to the attack on cash, other tactics currently being used in and planned for the War on Private Savings include: 1) Low and negative interest rates that are less than the rate of inflation and therefore rob savers; 2) Civil asset forfeitures; 3) The explosion of government regulations accompanied by confiscatory fines; 4) Across the board tax increases; 5) The creation of entirely new tax categories (e.g., Obamacare; carbon taxes) that pile onto but never streamline or reduce existing tax structures; 6) The intense manipulation of precious metals prices, resulting in artificially low prices that lessen savings; 7) Endemic corruption resulting in increased consumer costs and national debt that must be borne by the people (e.g., Medicare; Medicaid; Military (for example, the $6 Trillion in unaccounted-for Army spending, alone, all of which is now constitutes additional national debt); 8) Massive, structural government deficits that heap even more non-repayable debt upon the people; 8) Open borders, which spike the cost and deficits of government, which are similarly borne by the people and nationally impoverishing; 9) Deliberately engineered inflation that devalues national currencies and savings; 10) Outright demonetizations and forced conversions of currencies, with massive attendant costs, a new weapon that has been rolled out in India; to name just a few examples of the existing and emerging weapons being used against the people in the War on Private Savings. \\nTo sum up the situation, we believe that: 1) Populism is spreading into the Forbidden Zone of currency and money; 2) To prevent Monetary Populism from becoming a “movement” that they cannot contain, the Deep State Oligarchs have declared a War on Private Savings, as part of a larger conflict, a War on Human Liberty; 3) Precious metals, particularly gold, are an extraordinarily powerful weapon in the hands of the people, and one that can defeat the Oligarchs’ oppressive, anti-humanitarian campaign, but only if the people take up the weapon en masse, and soon; 4) The Deep State oligarchs are fully aware of the threat posed to them by the weapon of private money wielded by the people, which is why they are attacking; 5) If, through simple messaging, the people’s eyes are opened to the unique capability of precious metals to restore to them the financial stability, freedom and dignity that are rightfully theirs, no less than their other constitutionally guaranteed rights, they will embrace this obvious solution in large numbers, ensuring their victory. In the process, monetary populism will be transformed from a sentiment into a powerful, invincible movement. \\nIn our next article, we will discuss the simple ways by which the managements of publicly traded precious metals mining companies can ignite demand for and price escalation of their product, as is required by their fiduciary obligation to shareholders. \\nStewart Dougherty November 22, 2106 \\nStewart Dougherty is the developer of a principles-based forecasting methodology named Inferential Analytics. The unique IA model assesses monetary, fiscal, financial, market, social, political, empirical and anecdotal factors to get a glimpse of tomorrow, today. He has 35 years’ worth of management, corporate strategy and business development achievement. He is a graduate of Tufts University (MA) and Harvard Business School (MBA). Share this:'"}, "time": 1742562297.8466575}