{"duration": 0.10873055458068848, "input_args": {"text": "'By Christopher Manion November 1, 2016 \\n“Most voters see America as a divided nation and only expect things to get worse over the next year no matter who the next president is,” reports Rasmussen Polls \\nOh dear. What shall we do”? \\nStart with Hillary’s primal scream: “Those nasty Russians are trying to destroy our democracy, and Donald Trump is helping them!” \\nThe perpetration of this ideological fiction so hilariously concocted by the bottom-feeders in Clinton campaign is bad enough; that the hapless Nobel-Peace-Prize-winner-foreign-policy-disaster Narcissist-In-Chief jumps aboard is farce itself. \\n“The Russians Are coming” routine is designed not merely to distract any Americans who might still know where Russia is from the corruption of the Obama-Clinton regime. It has a future purpose, more sinister and more profound than its immediate purpose of merely manipulating the gullible. \\nAfter the election, should Hillary’s criminals be able to pull off a victory, half the country will be boiling in contempt and resentment, not ignorant fear but informed and righteous anger, at the corruptos who control the Bipartisan National Establishment. \\nThese naysayers will be the establishment’s enemy, and a President Hillary will have to bring them to heel. \\nHere’s how. \\nIf there is a single bureaucracy in Washington that has not been infected fatally with the disease, we don’t know about it. And so, after the election, there will be no time to waste for the Establishment Mafia – not to allay the defiance of their detested Deplorables, but to manipulate it. \\nThe bipartisan establishment hates the military, of course, but it is willing to use wars and the rumors of wars to line its own pockets, expand its commercial interests, and satisfy its insatiable desire for power. At the same time, as we learned from Lyndon Johnson and George W. Bush, the establishment doesn’t actually want the military to win wars – because that means peace will be at hand, and that is not good for the establishment. \\nBetter to have chaos. \\n“Hey, they need our help!” \\nSo they load the military with PC crap, solar panels, pregnant sailors and puny grunts, all guaranteed to have access to a generous dollop of the degenerating sex of any variety. Nothing like having critical personnel take long leaves to have their babies or their sex-change operations while on duty. \\nWell, we go to war with the military we have, but we do need war: after all, as we edge closer to Orwell’s vision of the future and away from Huxley’s, it is a permanent war that will keep the masses at bay – by keeping them occupied and keeping them subjugated. \\nIn 1916, Wilson ran on the mantra, “He kept us out of war!” A majority of Americans opposed getting involved in Europe’s mess, but Wilson found a critical ally in the Catholic Primate of America, James Cardinal Gibbons of Baltimore. \\nAmerica was “divided” then, too, in a sense: Anti-Catholicism was real and widespread among the Protestant elites (few care today that the KKK hates Catholic a lot more than it hates Jews or Blacks). \\nSo Gibbons defied his own Pope (Benedict XV) and told Wilson that Catholics would fight for their country. Right or wrong, he feared a backlash against the “Papists” who were “loyal to a foreign power.” \\nConscripted Catholics could not refuse to serve. “Division” was ended – by war. \\nA quarter-century later, Roosevelt’s administration was a socialist disaster. In running for his own third term, he mouthed the peaceful pleasantries that resonated the firm desire of the American people to stay out another one of Europe’s wars. Of course, he had already sold his soul to the internationalists who insisted otherwise. So he had to lie. \\nLucky for FDR in 1940, he didn’t have Donald Trump to run against. \\nBut Hillary does, and while “Crooked Franklin” confronted strong opposition from the heartland, Bush and Obama have successfully eviscerated everything west of the East Coast. \\nToday the establishment has no formal competition, and the Military-Industrial-Financial-Etcetera Complex has been inoculated with the ideology of the Clinton generation of the 60s – communists, proven terrorists, liars, and their simpering useful idiots gorging at the trough. \\nBut now, 100 million Americans know the score. They are patriots in the old sense of the term. They love their patria – their fatherland. That implies that they have a pedigree – an aristocratic anachronism that the Left hates, of course. They have a home, a neighborhood, a church, a family, and the community that they love. \\nThat is also hateful to the Left, which has attempted over the years to destroy communities everywhere with all sorts of “civil rights” pretexts drawn from class envy – to the point where today we are commanded to welcome the stranger who has been brought up, south of the border and in the Middle East, to hate America, everything it stands for, because it is the source of their suffering. \\nAs Lord Peter Bauer cryptically explained, they all grew up believing that “their poverty is our fault.” \\nAnd so the Left will demand war. To keep the peace (a.k.a. Martial Law) domestically, they will follow Stalin’s practice of bringing in troops of different ethnic backgrounds to police resistant neighborhoods and communities. Conscripted inner-city black youths will be sent to predominantly white communities to “pacify” them, while conscripted rural whites will be sent to gang-infested Latino enclaves, and so on. \\nHaving effectively and intentionally weakened the military itself with gay activists, PC blather, purging of well-meaning patriots, and the rest, they will nonetheless send it into battle to keep the plunderers of the military-industrial complex well oiled with taxpayer cash. \\nWhat about victory? As Robert Strange McNamara and Clark Clifford had to slowly and clearly explain to LBJ, “victory” is not what we’re about here; in fact, the longer the war the better. \\nWe are at war with Al Queda and Syria is our ally. We are at war with Syria and Al Queda is our ally. \\nBoth can be true at once – even though both are false. DoubleThink rules. \\nHere’s the dirty little secret of their enterprise: while the Establishment hates the military, there still resides among the Deplorables a nostalgic, patriotic allegiance to the military. These people might hate the establishment, but they love their country more. The corrupters, confident that they now have the major persuasive public organs at their command, will immediately go into high gear identifying that patriotism with the New War of the corruptos . \\nThere will be one avenue of resistance that falls outside the mold: millions of millennials hate both the establishment and war. One might believe, therefore, that these draft-eligible millions (both men and women now registered with the Selective Service) would be strong opponents of the war, as were their grandparents during the Vietnam era. But not to worry: the corruptos will encourage those socialists to enter government service at all levels, to stay in school (free college!) as long as they do it to defend socialism, and otherwise to support the war effort without having to take part in it. \\nNo, the cannon fodder will be drawn from the ranks of the deplorable trash – the millennials whose families had been impoverished, whose communities have been destroyed, whose futures are so bleak that being drafted will not be so much a disaster as a means of feeding their families. \\nThe thought police have it all figured out. Of course, there will be pockets of resistance – but war is the health of the state and a fatal disease to its dissenting and resisting subjects. Those who pose a real danger will easily be identified with the help of the NSA – how laughable that Hillary blamed the Russians! – And they will be dealt with in many ways easy to predict. Some will be isolated, some will be disappeared, and some will be sent to fight for their country – the way David had Joab send Uriah the Hittite to the front lines to be conveniently killed so that David could satisfy this salacious carnal desires with Bathsheba. \\nThe Establishment Hot Tub is full of Bathshebas. \\nHillary’s hordes (America’s legacy media) have created this myth about Russia to deflect attention (as usual) from reality. One might consider this a cute ploy, but this sets the stage for a very dangerous consequence which she if elected, will find it hard to avoid. \\nNamely, war with Russia. \\nPerhaps they don’t teach 1984 anymore in high schools. Pity. Our youth (who will be drafted to fight this endless carnage) have never heard of the daily “Two Minutes Hate” at the Ministry of Truth. \\nYet Hillary throws this out there, as a self-serving temporary device, ignorant of the long-term consequences. \\nIf she wins she will face a bevy of threats – from Congress, a rebellious FBI, more lawsuits, and general chaos. \\nThere is only one way a Leftist can imagine “uniting” such a country: \\nWar. \\nAnd when it comes, we will no longer be permitted to explain it rationally. In the tradition of Father Abraham, who jailed thousands during the War Between the States, Hillary will have to act forcefully “to preserve the Republic.” \\nIn the spirit of Tom Lehrer, “If we’re going to write any songs about World War Three, we’d better write them now!” The Best of Christopher Manion Tags: Christopher Manion [ ] a Catholic teacher and writer, is president of Manion Music, LLC , which produces copyrighted, royalty-free music collections for telecommunications media and commercial and hospitality sites that use background music or music-on-hold. He writes from the Shenandoah Valley, where he is a volunteer Spanish translator for local law enforcement. Copyright © 2016 Christopher Manion'"}, "time": 1742628397.7981372}