{"duration": 0.07335329055786133, "input_args": {"text": "'Dan Savage On Trump’s Misogyny: ‘If Gay Was a Choice,’ Trump Would Be (VIDEO) By Jordan Baranowski   \\nSex advice columnist Dan Savage is often outspoken about his concerns with how politicians treat minorities, women, and the LGBT community. In a recent interview, Savage took a break from giving relationship advice and revealed a theory he has about Republican presidential candidate Donald Trump. \\nSpeaking with host Mike Pesca on Slate ‘s The Gist podcast, Savage tried his hand at figuring out the root of Trump’s misogynistic comments and alleged sexual assault : “I’ve never really said this out loud before, so forgive me if I say this in an inarticulate way, but I’ve encountered over my life straight guys who hated women so much that you could almost sense that if gay was a choice, they would make it.” \\nTrump has an almost pathological need to be seen as powerful and in control, and Savage thinks that need, as well as fear of the power of female sexuality, is the root of his misogynistic behavior: “They’re condemned to sit with both their hatred and disgust with women and their fear of women’s bodies and their insecurity and their need for them, their desire for them, because they are who they are sexually attracted to, and the cognitive dissonance that can produce — you see those guys who are much more comfortable in the company of men, but they need this thing… They need this woman, and they need her as an object. They can’t see her as a human being, or see them as human beings.” \\nSavage states that he does not think Trump is actually gay, but that he would probably be happier if he was, since he would never have to interact with women in that case. \\nSavage’s biggest concern with the Trump campaign is not the actual candidate, however. He is more concerned with the hatred and vitriol that the Republican party has adopted because of him: “I’m more concerned that, like climate change, assault is now a partisan issue, and that’s going to play out for 30 years… You’ve got the Giulianis and the Gingriches from their moral high grounds defending this. You’ve got rank-and-file Republican knuckle-draggers — including Republican women — defending this.” \\nIt should be noted that both former New York City mayor Rudy Guiliani and former Speaker of the House Newt Gingrich adamantly defend Trump in the face of sexual assault allegations. It should also be noted that both have been married multiple times and engaged in very public affairs. \\nIt will be up to those “rank-and-file” Republicans to put the ugly, misogynist rhetoric of Donald Trump behind them after election day. Hopefully Savage is wrong when he says that he expects this to be a partisan issue for 30 years. \\nCheck out another interview from Savage here , where he refers to Trump as the “enemy of the LGBT community.” \\nFeatured Image via YouTube Video About Jordan Baranowski \\nJordan is a writer and teacher based out of Kansas City. Connect'"}, "time": 1742563318.8545606}