{"duration": 0.0752706527709961, "input_args": {"text": "'Jake Gyllenhaal will return to Broadway next year in a brief revival of “Sunday in the Park With George. ” The production, a more fully developed version of a   City Center benefit concert that Mr. Gyllenhaal anchored in October, will be the first show in 49 years at Hudson Theater, which is being reconverted into a stage after decades of other uses. Mr. Gyllenhaal’s concert performances wowed critics and sold out. “This is one of those shows that seems destined to be forever spoken of with   bragging rights by anyone who sees it,” Ben Brantley wrote in The New York Times. Mr. Gyllenhaal’s City Center   Annaleigh Ashford, will join him on Broadway. The production will be shorter than the usual Broadway run, at 10 weeks, with previews beginning Feb. 11 and the opening on Feb. 23 it will close on April 23. The show will be produced by Ambassador Theater Group, the British company that is restoring the theater for Broadway, along with New York City Center Jeanine Tesori, who produced the City Center staging and Riva Marker, who runs Mr. Gyllenhaal’s company, Nine Stories Productions. The short run in a   theater will make it difficult to recoup capitalization costs, but a spokeswoman said that the company believed it could be done. The company has been eager to land a starry first production that would bring attention to the theater, which is on West 44th Street and most recently has been used as a hotel event space. The spokeswoman said that the Broadway staging would be “fully memorized,” unlike the concert, and that the show’s sets and costumes would be “deepened. ” “Sunday in the Park With George,” with music and lyrics by Stephen Sondheim and a book by James Lapine, is one of the most beloved musicals in the canon, and in 1985 it won the Pulitzer Prize for drama. The show, inspired by the painting “A Sunday on La Grande Jatte,” has a first act imagining the artwork’s creation by the painter Georges Seurat, and a second act, set a century later, imagining the artistic struggles of the painter’s  . The revival will be directed by Sarna Lapine, who is Mr. Lapine’s niece, and who will be making her Broadway debut as a director. She directed the City Center concert performance, and has been associate or assistant director on other Broadway shows. “Sunday in the Park” was first presented on Broadway in 1984 there was a revival in 2008. Mr. Gyllenhaal, whose only previous Broadway role was last year in the play “Constellations,” will play Seurat and his   (Georges and George). Ms. Ashford, who won a Tony Award last year for her role in “You Can’t Take It With You,” will play Seurat’s lover, Dot, as well as their daughter, Marie. The rest of the cast has not been announced. Mr. Gyllenhaal, a frequent film star, previously agreed to star in a play, “Burn This,” that was to have opened the theater but postponed, citing unspecified scheduling conflicts. He was able to do “Sunday” instead because it requires less of a time commitment.'"}, "time": 1742563250.4891846}