{"duration": 0.04863309860229492, "input_args": {"text": "\"Share on Facebook This man loses pulse for 45 minutes, but then wakes up with an incredible vision of afterlife! A trucker in Ohio shocked hospital staff after coming back to life nearly an hour after he lost his pulse following a massive heart attack — but it's what he claims to have seen during those tense moments that has him sure there's an afterlife. Brian Miller, 41, was opening the lid of a container when he knew something felt wrong — he immediately called 911 and told the operator, “I'm a truck driver and I think I'm having a heart attack.” Sure enough, his main artery was completely blocked — causing what's known as a “widow-maker” heart attack, Fox 8 Cleveland reported . He was rushed to a local hospital where doctors managed to revive him and clear the blockage, but after regaining consciousness and feeling the pain dissipate, he developed ventricular fibrillation, when the heart starts quivering wildly and is unable to pump blood. “He had no heart rate, he had no blood pressure, he had no pulse,” said ICU nurse Emily Bishop. “I mean think about that.” Doctor's performed “strong, hard, fast CPR” and shocked Miller four times to try to revive him, but had no luck. It was during that time that Miller said he slipped away into a celestial world, “The only thing I remember I started seeing the light, and started walking toward the light.” He described walking down a flower-lined path into white light — until he came upon his step mother, who had died recently, “She was the most beautiful thing when I seen her, it was like the first day I met her, (she) looked so happy.” Miller remembered, “She grabbed ahold of my arm and told me, ‘It's not your time, you don't need to be here, we've got to take you back you've got things to go and do.’” After 45 minutes, his pulse returned “out of nowhere,” Bishop said. ”His brain had no oxygen for 45 minutes, the fact that he's up walking, talking, laughing, everything is amazing.” Glad to be back amongst the living, Miller now says there is one thing he is sure of, “There is an afterlife and people need to believe in it, big time.” Related:\""}, "time": 1742561819.5625553}