{"duration": 0.1437232494354248, "input_args": {"text": "'Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name Red Banana Health Benefits \\nby Elisabeth Dahl – JillianMichaels.com If you’re looking to add some variety to your fruit bowl, consider the red banana. They’re available year-round in supermarkets and specialty stores. Use them as you would yellow bananas — eating them raw, slicing them into fruit salads or baking or frying them. While tasty, these purplish bananas are also […] How GMO foods alter Human DNA \\nHow GMO foods alters human DNA as explained by the one and only “Health Ranger” Mike Adams. Mike does a great job explaining just how GMO foods work to alter the GNA code of human beings over time. The more GMO food that is ingested, the more the DNA is changed. This change occurs over […] Neurosurgeon Speaks Out On How Vaccines Harm Child Brain Development \\nby Dave Mihalovic – Prevent Disease Arguably one of the most outspoken and articulate leaders in raising awareness on the dangers of vaccination, Dr. Russell Blaylock, MD, provides compelling arguments why the vaccination of pregnant women is harmful and a hidden cause of neurological disorders. He also discusses the toxic ingredients in vaccines such as formaldehyde, […] Is eating vegan the key to superhuman strength? \\nby Jonathan Wells – The Telegraph “The world’s strongest animals are plant-eaters. Gorillas, buffaloes, elephants and me”. It was with these words that, earlier this week, Barnabas du Plessis revealed himself to be the new spokesperson for animal rights and vegan advocacy organisation PETA. A world-renowned body-builder and former Mr Universe, du Plessis cut meat, fish, eggs and […] The Herxheimer Reaction: Feeling Worse Before Feeling Better \\nThe Herxheimer Reaction is a short-term (from days to a few weeks) detoxification reaction in the body. by Silver Colloids As the body detoxifies, it is not uncommon to experience flu-like symptoms including headache, joint and muscle pain, body aches, sore throat, general malaise, sweating, chills, nausea or other symptoms. This is a normal — […] The Best Ways to Get Your Own Alkaline Ionized Water \\nIf you’re interested in discovering the best way to start reaping the benefits of drinking alkaline ionized water, you’ve come to the right place. Let’s explore the best ways of getting your own alkaline water so you can begin enjoying the many health benefits it has to offer. Home Alkaline Water Ionizer Machine: The cream […] What Most Doctors Won’t Tell You About Cholesterol \\nWhy don’t many doctors tell you the truth about cholesterol? Cholesterol that naturally occurs in animal foods is not harmful to your health! But it can become harmful to your health if it is damaged by exposure to high levels of heat and/or harsh processing techniques. by Dr. Ben Kim – Drbenkim.com During my university years, […] U.S. Senate Reaches Deal on National GMO Labeling \\n(AP – NBC News) Senators have a bipartisan deal to require labeling of genetically modified ingredients nationally, a week before a labeling law in Vermont goes into effect. The deal announced Thursday (July 23, 2106) by the top Republican and Democrat on the Senate Agriculture Committee would require the nationwide labeling of genetically modified organisms, or […] Varicose Veins: Is There Hope? \\nVaricose veins are difficult for conventional medicine to treat. Alternative medicine shows some promise and can alleviate, even regress, some of the symptoms. by Anna Sienicka – HomeopathicCare.ca When valves inside the veins are weak or absent, or return of blood from congested areas is inefficient, veins can become enlarged and swollen aching. Varicose veins are […] Dehydration a leading cause of diseases \\nDehydration is a lot more than just not drinking enough water. The side effects of being dehydrated involve numerous body systems and symptoms can range from mild to life threatening. by Dr. Cory – New Vision Water makes up a large percentage of blood, the life giving red liquid that brings oxygen, nutrients and vital […] The brain on LSD revealed in groundbreaking images \\nby Ian Sample – The Guardian The profound impact of LSD on the brain has been laid bare by the first modern scans of people high on the drug. The images, taken from volunteers who agreed to take a trip in the name of science, have given researchers an unprecedented insight into the neural basis […] Put Down the Pork Chops! US Pork is Hazardous to Your Health \\nPork Chops Are Hazardous To Your Health – Stop Eating Them! by Anna Brones | Organic Authority While bacon-anything gets a free pass in the foodie world, the reality is that pork is a dirty business–for the pigs, for the environment and for public health. China’s pork industry is buying up US companies in an attempt […] Copper may play key role in Alzheimer’s disease \\nNew research shows that copper may play a large role in Alzheimer’s disease! by Melissa Healy – LA Times New research finds that copper in amounts readily found in our drinking water, the foods we eat and the vitamin supplements we take likely plays a key role in initiating and fueling the abnormal protein build-up and […] Homeopathy is ineffective? Decide for yourself! \\nBy Anna Sienicka Let’s start at the very beginning of what Homeopathy is, a few years ago I didn’t know myself and kept calling it ‘home something’. I was studying Kinesiology and Health Science at York University, working out 5 times a week, eating a super healthy diet, but still had a skin condition, diagnosed […] Subscribe For Free! Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name '"}, "time": 1742562277.2837176}