{"duration": 0.06853747367858887, "input_args": {"text": "'Sports Rumors Floyd Mayweather vs Manny Pacquiao Rematch Will Be A Disappointment, To Be Staged Just For Money? \\nManny Pacquiao caused quite a stir following his stirring win over Jesse Vargas earlier this month. It was, however, the presence of Floyd Mayweather Jr. at ringside that all the more ramped up rematch rumors. Is it actually possible? \\nBy Comment \\nManny Pacquiao caused quite a stir following his stirring win over Jesse Vargas earlier this month. It was, however, the presence of Floyd Mayweather Jr. at ringside that all the more ramped up rematch rumors. Is it actually possible? \\nAs most know, the ghost of the first Pacquiao vs. Mayweather encounter is still in the air and most believe it will remain the same. For the benefit of those who have forgotten, Mayweather will defend and run while Pacquiao will try to pin down the undefeated American boxer. Profit is the only reason for a rematch. \\nMany are aware that the first encounter between Pacquiao and Mayweather was pretty lucrative. Unfortunately most feel that they didn’t get their money’s worth. A rematch will still be the same though the earnings may dip slightly. \\nAlso read: Manny Pacquiao Wanted To Show Floyd Mayweather He Deserves A Rematch \\nSuch is shared by Jim Lampley, a prominent blow-by-blow announced. He believes that it will be nothing more than to rip-off patrons once again and urged most to push for a Gennady Golovkin vs. Canelo Alvarez showdown instead. \\n“There’s a decent chance Triple G-Canelo can take place in [2017]. So, it would be a shame, and another loss for boxing, if casual fans and the general public were distracted by a for-profit-only replay of a considerably less interesting fight,” Lampley said via Forbes.com . Rematch means more to Pacquiao than Mayweather’s record chase. \\nMoney aside, Pacquiao is looking to avenge his loss and prove that Mayweather is not that invincible. For Mayweather, it is the perfect chance to become the only undefeated boxer with 50 wins. \\nAlso read: Fantasy Boxing Match Happening Soon? \\nRight now, Mayweather is content being a promoter even as Pacquiao has added more responsibility as a senator. Compared to Golovkin and Alvarez, that too may be another point worth taking, Boxing News 24 reported. \\nIt doesn’t take a genius to figure that out but unless Mayweather says so, a Pacquiao sequel will be nothing more than a rumor at least for now. \\nAlso read: Manny Pacquiao vs Mayweather 2016 Rematch – Fight Confirmed By Both Pacquiao And Mayweather? \\nLiked this story? Subscribe to our newsletter or follow us on Twitter and Facebook for more updates on America. Continue Reading You may also like...'"}, "time": 1742564282.3745728}