{"duration": 0.09457850456237793, "input_args": {"text": "'So after almost 21½ hours and two centuries’ worth of singing, dancing, and jiggling after all 650 of us had been asked to   everything from the Civil War and the Oklahoma land rush to white flight to the suburbs after a narcotically swampy rendition of “Amazing Grace” and a production of “The Mikado” that glowed in the dark because its minstrelsy might make sense if it was set on Mars after visionary   costumes that called to mind descriptions like geisha Andrews Sister and Tiki apocalypse after we’d stood in lines for small portions of bread and split pea soup at 3 a. m. and not many people took the bread (because even during a poignant Depression homage some people will still refuse to eat a carb) after we’d batted around an enormous    penis balloon whose design really did look more like the flag of Puerto Rico and then made a funeral procession for Judy Garland’s corpse after a   of the Bee Gees’ “Stayin’ Alive” and Led Zeppelin’s “Kashmir” after Taylor Mac, the performance artist who dreamed this whole thing up, had cavorted onstage and in the laps and arms of strangers after all of this  —   the delirium, the mania, the possibly simulated sex  —   it might have been the balloon that broke us. It was around 9:30 a. m. on Sunday. Most of us hadn’t slept since the show had begun Saturday at noon, because Mr. Mac’s “A   History of Popular Music” was intended to last a magnificent 24 hours. With the finish line in sight, the balloon stopped by. It was pink and at least partly full of helium. But it did that thing balloons sometimes do: It gained consciousness. Making its way around the audience and inevitably onto the stage inside the vast St. Ann’s Warehouse in Dumbo, Brooklyn, the balloon slowed down and took in Mr. Mac. As it regarded him, we laughed. Maybe, by this point, we were delirious because we watched the balloon for what felt like a very long time. The technicians even adjusted the lighting to capture it. On the one hand, it was a balloon. On the other, it had become something oracular. Anyway, Mr. Mac, who had given us almost everything he had and was trying to give us the rest, had had enough. “Stop putting the light on it,” he requested, his demeanor somewhere between joking weariness and the real thing. The whole interlude had gone on longer than he thought it should. But I, at least, sensed a spot of admiration, a cosmic grace note. It was the sublime saying “good morning” to the sublime. Mr. Mac gave me one of the great experiences of my life. I’ve slept on it, and I’m sure. It wasn’t simply the physical feat. Although, come on: 246 songs spanning 240 years for 24 straight hours, including small breaks for him to eat, hydrate and use the loo, and starting in 1776 with a   band and ending with Mr. Mac, alone in 2016, doing original songs on piano and ukulele. He remembered all the lyrics and most of Walt Whitman’s “Song of Myself. ” And he sang them  —   in every imaginable style, at every tempo, with every possible facial expression and every register of his handsome, protean voice. An entire day of all that prowess, energy and virtuosity would have been astounding. But Mr. Mac is also a devastatingly intelligent artist of conflation. Spending 24 hours filtering 240 years of predominantly American music  —   battle hymns, black spirituals, war ballads, minstrel tunes, works songs, Tin Pan Alley, Broadway musicals, Motown, Top 40 and   punk done up in   the blues and Laurie Anderson    —   through the prerogatives of a drag show is daring. Yes, that requires an artist who understands the power of drag to subvert convention. And in song after song (after song) Mr. Mac, who’s white, gay and 43 years old, explored the racism, chauvinism, homophobia, misogyny and white supremacy coursing through the history of American song. With all due deference to the subtitle of Tony Kushner’s “Angels in America,” this, too, is “A Gay Fantasia on National Themes” and at about four times the length. The “ ” project was, at least in part, about becoming who we Americans want to be, by recognizing who we have been. It’s about artistic confrontation, reinterpretation and personal transcendence. The scope of the project allows you to consider the centuries of artistic ghosts we live with. (Mr. Mac’s tagline was “radical faerie realness ritual. ”) Not everything worked in “ . ” His sustained disdain, for instance, for cultural appropriation probably kept him from making a clearer identification with slaves as individuals. His moral grasp of the larger picture costs him the richness of the smaller, human one. He’s much better at attacking racists and racism than fleshing out their victims. But the show, which was   by Pomegranate Arts, got its power from Mr. Mac’s larger, subjective moral force. He keeps most of the decades humming with queerness and problematized whiteness, inventing characters and ghosts in his stories to dramatize the issues of the day. Early on, he made a stirring case for the British homophobia of “Yankee Doodle,” and lets you think its standing as an American staple is an early example of American  . Anyway, I’ll never hear the song the same way again, and I’ll probably always only hear his version, which keeps speeding up until it reaches   velocity. By about 10:30 a. m. donning a giant pair of butterfly wings, Mr. Mac mustered the fire to shred through a version of  ’s “One Beat. ” He stalked the St. Ann’s stage in his bare feet and in comically high heels. He sang through costume changes and through  . (At one point, it looked as if the audience members carrying him from table to table were going to drop their load.) He never lost his sense of humor or the pathway to any of the punch lines in his 24 hours of stage patter or his knack for the dramatic and comedic power of holding a silence. Normally, he’s a star. This weekend he was a solar system. But why were we there? It’s an important question. Unlike my other experience with a   magnum opus, Christian Marclay’s   montage “The Clock,” this one needs an audience. For one thing, the audience member’s chairs had to be moved several times  —   to do war and segregation and dinner  —   and they weren’t going to move themselves. Really, though, we were there because this ultimately is, on top of everything else, a show about empathy and identification. Mr. Mac devoted an entire hour, 1846 to 1856, to a figurative,   battle for the title of Father of American Song. His opponents were Stephen Foster and Walt Whitman. Sounds gimmicky, but it was actually brilliant. The match was staged in a makeshift boxing ring and required the audience to pelt the loser with   balls. Initially, the fix seemed in. (The balls hit only the poor but game audience member standing in for Foster Mr. Mac gloriously embodied Whitman.) The aim was disproving Foster’s professed abolitionism by playing up the racism of songs like “Massa’s in de Cold Ground” and “Camptown Races. ” Whitman, meanwhile, wasn’t much of an abolitionist. (He was there as a queer pioneer.) Mr. Mac’s question, though, wasn’t “Who was the better abolitionist?” The point was that Foster’s lack of empathy made him  —   and other white people like him  —   a dubious abolitionist. The audience was as essential to this performance as we are inessential to Mr. Marclay’s masterpiece. Those clocks keep ticking whether or not you’re there to watch them. But you need people for empathy. And Mr. Mac had hundreds (and retained most of them). We were asked to be racists and homophobes. And act like they would act, to feel how hate feels. But also, in Mr. Mac’s way, to feel love and experience the shedding of shame. That entailed asking a great deal of himself, which entailed asking a lot of others  —   of his band and crew of the artsy helpers (his “dandy minions”) who were also very much part of the show of his ingenious musical arranger, Matt Ray, and endlessly witty costume designer, who goes by the name Machine Dazzle and helped Mr. Mac change outfits onstage. Off to its right was a napping loft. And at some point, sleeping bags were distributed, but lots of us managed to stay awake for most, if not all, of this event. So you paid the price of admission, which also seemed to include a night of dreamlessness. That, of course, might have been the point. What if some of America’s trouble is that we’ve been too caught up in our own individual dreams  —   that some dreams mean a nightmare for somebody else. What if Mr. Mac’s fantasia was the   and those 24 beautiful hours were about the wisdom of staying woke?'"}, "time": 1742628423.4361098}