{"duration": 0.06882262229919434, "input_args": {"text": "'Written by Jacob G. Hornberger   A dispute that is taking place between Saudi Arabia and Egypt indirectly demonstrates the nature of US foreign aid. After dumping a walloping $25 billion in foreign aid to help the Egyptian military dictatorship’s economic woes, the Saudis are hopping mad. Why? Because last month in the United Nations, contrary to Saudi Arabia’s wishes, Egypt voted in favor of a Russian resolution on Syria. In the world of foreign aid, that’s a super no-no. When a regime has received $25 billion from another regime, it is expected to vote the way its benefactor wants it to vote. In a remarkable admission regarding foreign aid, at least in this particular case, the New York Times, in an article on the matter, wrote, “The Saudis may have thought they were buying loyalty….” The Times article pointed out that to punish the Egyptians for their independence, “The state-owned Saudi oil company, Aramco, postponed a promised shipment of 700,000 tons of discounted oil in October, and the spokesman for Egypt’s oil ministry said the fate of November’s shipment remains unknown.” Although the New York Times would probably be reluctant to describe US foreign aid in the same way, that’s precisely what it is — a way to purchase “loyalty” from foreign regimes, including dictatorships. The US government loves to put foreign regimes on the federal dole because once that happens, US officials know that they have bought them, lock, stock, and barrel. Once a regime is on the dole, it inevitably becomes dependent on it. The racket works like this: The IRS collects money from hard-pressed US taxpayers, which US officials use to send millions of dollars in foreign aid to foreign regimes. The foreign regimes then use the money to buy weaponry to fortify their hold on power or to just to line the pockets of government officials. It doesn’t matter to US officials what the tyrants do to people within their country. They can abuse them, incarcerate them, torture them, or kill them. None of that matters to US officials. What matters to US officials is the international arena. Like votes in the UN. Or just public support for US invasions, coups, interventions, assassinations, kidnappings, and the like. That’s when US officials expect “loyalty,” in the form of blind support, which was what Saudi Arabia was expecting from the Egyptian tyrants. And heaven help any nation that takes the “wrong” position. The US will respond in the same way the Saudis have responded to the Egyptians. It will threaten to do very bad things to the nation that opposes a U.S invasion, coup, or resolution within the UN. When a nation is on the US dole, US officials expect “loyalty.” Americans can’t do anything about foreign aid by the Saudi government. But they can do something about US foreign aid. What they should do is demand that it be ended, immediately.   the Future of Freedom Foundation . Related'"}, "time": 1742563563.1542435}