{"duration": 0.05165290832519531, "input_args": {"text": "'Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Home › POLITICS › ING TO CUT 7,000 JOBS… ING TO CUT 7,000 JOBS… 0 SHARES \\n[11/3/16] ING Group ‘s plans to shed 7,000 jobs and invest in its digital platforms to make annual savings of 900 million euros ($1 billion) by 2021, drew swift criticism from unions of the Netherlands’ largest financial services company on Monday. \\nThe layoffs represent slightly less than 12 percent of ING’s 52,000 workforce because nearly 1,000 are expected to come at suppliers rather than the bank itself. \\nBut they are the heaviest since 2009, when ING was forced to restructure and spin off its insurance activities after receiving a state bailout during the financial crisis. \\nLabor unions were highly critical of the decision. \\n“I don’t think this was the intention of the (government) when it kept ING afloat with bailout money,” Ike Wiersinga of the Dutch CNV union said. \\nIn Belgian, where the number of jobs lost will be highest, labor leader Herman Vanderhaegen called the decision a “horror show” in a statement published on the website of De Tijd, and said workers would strike on Friday. \\nAlthough other large banks have announced mass layoffs at branch offices in the past year to boost profitability, ING said the job cuts were partly to combine technology platforms and risk control centers as well to help it to contend with regulatory burdens and low interest rates. \\n“You have to announce these programs and these intentions at a time when you can afford them,” CEO Ralph Hamers told reporters on a conference call. “We’re strong right now, we have good results, we are growing and then you have to do the repairs, and not when you don’t have any choice anymore.” Post navigation Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 Warning : array_key_exists() expects parameter 2 to be array, null given in /home/content/p3pnexwpnas07_data02/05/3222705/html/wp-content/plugins/widget-options/core/functions.widget.display.php on line 182 RESOURCES'"}, "time": 1742562073.4716816}