{"duration": 0.02944469451904297, "input_args": {"text": "'Mankind destroys animal kingdom with enormous velocity 27.10.2016 Print version Font Size The populations of vertebrate creatures - mammals, birds, fish, amphibians and reptiles - have decreased by 58% as a result of human activities from 1970 to 2012, The Living Planet report published by the WWF and the Zoological Society of London.The greatest damage was caused to freshwater vertebrates. Their total populations haves reduced by 81% during 42 years. The populations of terrestrial vertebrates have decreased by 38% and marine - by 36% in the same period. The report was based on the research data collected for 3,706 species of mammals, birds, fish, amphibians and reptiles.The researchers concluded that the most common threat to the vertebrates is either the loss or the deterioration of their natural habitats.\"Wildlife is disappearing within our lifetimes at an unprecedented rate,\" said Marco Lambertini, director general of WWF International. \"We should not be deceived into thinking humanity can do without,\" he added.\"Biodiversity forms the foundation of healthy forests, rivers and oceans. Take away the species , and these ecosystems collapse, along with clean air, water, food and climate services they provide us,\" Mr Lambertini also said. The experts predict that animal populations on Earth may decline by 67 percent by the end of this decade if humans do not take measures to curb the harmful effects of human activities on nature. Noteworthy, pollution-related diseases claim the lives of 5.5 million people every year. A half of this frightening number accounts for residents of China and India, scientists at the US-based company Health Effects Institutes said.The current level of air pollution in Delhi and Beijing may reach 300 micrograms per cubic meter of air, thus exceeding the limit 8-10 times. At the same time, North America, Western Europe and Japan have achieved great progress in the fight against air pollution in the last 50 years, creating cleaner fuel and engines, as well as reducing the consumption of coal. The main sources of pollution, according to the study, are emissions from electric power plants, factories, car exhausts, coal and firewood combustion products. The particles that the process of combustion produces remain in the air for a long time, thus posing danger to human health. In the capital of China, announcing the top \"red\" level of environmental hazard has become a commonplace event. Beijing was recognized one of the most polluted cities in the world. The concentrations of nitrogen dioxide and other harmful substances in the air of Beijing is the highest due to a large number of cars and the emission of chemicals from factories. Pravda.Ru Read article on the Russian version of Pravda.Ru Top ten of world\\'s most unusually colored animals'"}, "time": 1742628438.003639}