{"duration": 0.1490345001220703, "input_args": {"text": "'Russia\\'s opposition leader Navalny declares presidential bid Prominent opposition figure and anti-corruption campaigner Alexei Navalny has announced he plans to run for the presidency, with criminal charges against him suspended. However, Russia’s experts are divided in their assessments of his chances in the 2018 presidential elections Prominent opposition figure and anti-corruption campaigner Alexei Navalny has announced he plans to run for the presidency, with criminal charges against him suspended. However, Russia’s experts are divided in their assessments of his chances in the 2018 presidential elections. \\n\\nRussian opposition activist Alexei Navalny during an interview to the Associated Press in Moscow. Photo: AP \\nLast week Russia’s Supreme Court suspended the criminal charges against Russia’s well-known opposition activist and anti-corruption campaigner Alexei Navalny, who was accused of embezzlement of assets belonging to ;the state-run timber company ;Kirovles. \\nThe decision came after the European Court of Human Rights reviewed and endorsed Navalny’s complaint about the trial, which the defendant found unfair and politically motivated. The Russian authorities are to reassess their decision in light of the February ruling, which called for Navalny to be fully acquitted and for Russia to pay $8,000 each to him and his co-defendant Pyotr Ofitserov plus legal costs. \\nAlso read: \" Khodorkovsky drums up support in Europe for an alternative to Putin \" All this means that the criminal charges against Navalny are at least suspended, if not canceled. The accused is rehabilitated and has chances to stand for Russia’s presidency in 2018. Navalny confirmed his presidential bid last week and has left his intention to run as an alternative candidate in no doubt. Russian oligarch and opposition activist Mikhail Khodorkovsky, who now lives in London, has approved Navalny’s candidacy . Meanwhile, the Kremlin is reticent about the anti-corruption campaigner’s intentions to run for the presidency. \\n“This question is not on our agenda now,” said Kremlin spokesperson Dmitry Peskov. “The presidential elections will take place in 2018.” ; ; ; ; ; ; \\nToo early for forecasts Meanwhile, experts argue that it is too early to talk about the 2018 presidential elections and the chances of their candidates. For example, democratic activist and politician Leonid Gozman believes that Navalny has enough political heft, but the fact that he is associated with the opposition will hinder his chances. \\n“Alexei Navalny is a celebrity,” he said. “He is a well-known figure with an interesting history, which has its own flaws and advantages.” ; ; \\nGozman argues that t he opposition candidate’s major disadvantage is an unfavorable political environment within the country and people\\'s distrust of opposition, with him fighting against those at the helm . However, Navalny might be able to turn this disadvantage into an advantage and earn political credentials not only inside, but also outside Russia. According to Gozman, Navalny’s anti-corruption political platform is a valuable and very meaningful asset, which he will be able to use in his favor. \\nLikewise, Mikhail Vinogradov, the chairman of the Petersburg Politics Foundation, argues that Navalny has enough political heft and can be compared with Russian President Vladimir Putin to a certain extent. \\n“Navalny is the No. 2 politician in Russia’s public politics,” he told ; Russia Direct . “That’s why he’s more effective and interesting than the leaders of the parliamentary parties, which have been competing with each other for so long. He has well-developed political instincts. In addition, he has much better chances in the elections than those retirees who head the parliamentary parties. From the point of view of populist potential, Putin and Navalny are comparably equal.” \\nVinogradov is sure that Navalny is capable of recruiting a large number of supporters in a short period of time, as indicated by the results of the 2013 Moscow mayoral elections, when he won more than 27 percent of the vote. However, at that time he focused primarily on the protest electorate . Today, there are a lot of people who are not satisfied with the current situation in the country and Navalny is capable of winning their votes as well as the votes of those who support the authorities, Vinogradov speculates. \\nHowever, it remains to be seen if the opposition activist will be able to use his tactics to help win nationwide support. “This is one of the major intrigues,” said Vinogradov. \\nA dose of legitimacy for Russia’s elections At the same time, Gozman argues that the participation of Navalny in the presidential elections will make them more interesting and less artificial. \\n“His bid is useful for the elections themselves,” he said. “This means that a campaign with Navalny will look more real than one without him.” \\nAlso read: \" Hawks vs. doves: Who will dominate in the Kremlin before the 2018 elections? \" Gozman gives an example of the 2013 mayoral campaign, which he sees as \"more natural” because Navalny challenged Sergei Sobyanin and encouraged him to change his tactics. In contrast, Alexei Mukhin, the ;general director of the Center for Political Information, ;a Moscow-based think tank, argues that the participation of Navalny will be a bigger disadvantage for regional campaigns rather than an advantage. According to him, the opposition figure will bring instability and disorder, while pursuing a sole goal: self-promotion.\" \\n“Navalny is a professional troublemaker,” he told ; Russia Direct . “He is likely to look for a trade-off with the authorities. For example, he will withdraw his bid if the Kremlin offers him some political privileges.\" \\n“It is a matter of a pure political calculation. He is not a populist — he is a political strategist,\" Mukhin added. \" He is a sort of dealer within politics and he can use skills to earn political points. Moreover, a refusal to register Navalny as a presidential candidate will be a big asset for him, because it will give him a reason to claim that the authorities are afraid of him. It may strengthen his political heft .” \\nPopulist or not? \\nUnlike Mukhin, Gozman sees Navalny as a potential populist in the upcoming presidential campaign. However, it is too early to talk about specific positions or a platform he is going to stick since it is unclear what kind of environment the 2018 elections will be held in. \\n“A populist is easy to recognize only in a specific environment,” he said. “Most importantly, it is necessary to know what position his opponents will take. It is a matter of debates: You’re inclined to take a tougher position in a dispute than under other circumstances, at least because you need to prove your point of view.” ; \\nWhen discussing populism in presidential campaigns, most Russian experts give the example of Vladimir Zhirinovsky, the firebrand leader of Russia’s Liberal Democratic Party (LDPR). Throughout his political career, he has garnered about 10 percent of the vote. For instance, the results of the recent parliamentary elections showed that his party even improved its record in comparison with previous years. This indicates that Russians are easy to manipulate and they are ready to support a populist candidate. However, the populism of Zhirinovsky is not taken very seriously. \\nRecommended: \" Inside the anti-corruption campaign against Russia\\'s liberals \" “If a new populist like [U.S.-President-elect Donald] Trump , who would avoid Zhirinovsky’s buffoonish style, emerges in Russia’s political arena, the rest of the politicians, including Navalny himself, are likely to take a more moderate position. If such a populist doesn’t appear, somebody else will fill his shoes,” ;says Gozman. \\nMukhin doesn’t agree. He argues that Russia’s political system prevents such populists from coming to power. The most obvious example is Zhirinovsky himself, who is seen as something of a clown. ; \\nWhat most pundits agree on is that Navalny’s odds of winning in the 2018 elections are slim: It will be extremely challenging for him to launch a presidential bid and win enough support from voters , partly because Putin , who still enjoys high approval rankings and wields political heft, doesn’t support his candidacy, according to Vinogradov and Gozman. This is the very logic of Russia’s current political system, in which elections are not a game-changer: Their results are always predictable. \\n'"}, "time": 1742562481.6519134}