{"duration": 0.07290458679199219, "input_args": {"text": "'German   Sigmar Gabriel has said it is “no longer unthinkable” for the EU to break apart in light of the Brexit referendum, migrant crisis, and ongoing troubles in the Eurozone. [Gabriel is the Nick Clegg to Angela Merkel’s David Cameron, with his Social Democratic Party (SDP) propping up her administration serving as the junior partner in her coalition government. He has butted heads with the German chancellor repeatedly in recent weeks, in an apparent attempt to put some distance between them in advance of this year’s federal elections.  “I once asked the chancellor, what would be more costly for Germany: for France to be allowed to have half a percentage point more deficit, or for Marine Le Pen to become president?” Gabriel told Der Spiegel, as reported in EurActiv, referring to the populist leader of the French nationalists, who has won increasing support through her strong opposition to mass immigration and radical Islam. ”Until today, [Merkel] still owes me an answer. ” The Saxon politician appeared to be indicating that he would like his senior partner to relax the rigid fiscal rules which govern the European Union’s (EU) single currency zone, although he conceded that any proposal to transfer money from Germany to the Eurozone’s struggling periphery would be “extremely unpopular”. As of late 2015, Germany had gained some 100 billion euros (£70 billion) from the euro crisis which has been crippling countries such as Greece, discouraging any inclination for Berlin to veer from the status quo. “But I also know about the state of the EU. It is no longer unthinkable that it breaks apart,” he added. “Should that happen, our children and grandchildren would curse us,” he added. “Because Germany is the biggest beneficiary of the European community  —   economically and politically. ” Gabriel has also clashed with Merkel over mass migration, arguing for Salafist mosques to be shut down, their preachers deported, and communities dissolved. It was a surprising   by the socialist, who was calling for Germany to take “half a million” migrants a year for “several years” and “maybe more” prior to election season.'"}, "time": 1742561943.647883}