{"duration": 0.0503840446472168, "input_args": {"text": "'License DMCA \\nI woke up yesterday (Thursday) to a small but somewhat encouraging snippet on page 19 of my local (German) paper headlined \"Trump: Clinton Risking World War,\" referring to Trump\\'s remarks on Tuesday in a Reuters interview that was headlined \"Trump says Clinton policy on Syria would lead to World War Three.\" \\nThe five-sentence German article ended with this: \"Critics noted that such [no-fly zones as proposed by Clinton] might have to be enforced militarily.\" This was apparently (back-translating from the German) a translation of \"Some analysts fear that protecting those zones could bring the United States into direct conflict with Russian fighter jets\" (Reuters). \\nThe Reuters article goes on to say: \"Clinton\\'s campaign dismissed the criticism, noting that both Republican and Democratic national security experts have denounced Trump as unfit to be commander-in-chief.\"\"\\'Once again, he is parroting Putin\\'s talking points and playing to Americans\\' fears, all while refusing to lay out any plans of his own for defeating ISIS or alleviating humanitarian suffering in Syria,\\' Clinton spokesman Jesse Lehrich said in a statement.\" \\nThe New York Times and other mainstream outlets reported similarly. I suppose this is considered \"balanced\" coverage -- as if what Lehrich or \"Clinton\\'s campaign\" said was a substantive response to what Trump has finally said clearly and should be obvious. To their credit, the BBC did add (at the end of a 21-sentence article) that Trump \"echoes concerns raised last month at a congressional hearing by the highest-ranking military officer in the US armed forces.\" \\n\"Chairman of the Joint Chiefs Marine Gen. Joseph Dunford told lawmakers a \\'no-fly zone\\' in Syria could spell war with Russia. \\'Right now, senator, for us to control all of the airspace in Syria it would require us to go to war, against Syria and Russia,\\' Gen. Dunford told the Senate Arms Services Committee.\" - Advertisement - \\nAt this point, just days before the election, it is probably too late, but it would be Trump\\'s last opportunity to appear statesmanlike, and also save the planet from the catastrophic military adventurism that Clinton seems bound to embark on if she becomes commander-in-chief. At the least it would be a chance to ratchet up popular protest against the warmongering that has driven virtually all U.S. foreign policy since WWII, and is now taking us (and by \"us\" I mean the world) directly toward the precipice of WWIII. \\n\"Stop demonizing Russia; work with them, not against them.\" This is the message that needs to be shouted from the rooftops, and surely Trump has access to experts like Stephen Cohen, Ray McGovern, Robert Parry and others who can help him do so. He should be able to easily \"trump\" the empty arguments of the bellicose Russia-bashers, even if the latter are aligned across party lines against him -- and against us, since the war they are pushing for will be global. How stupid does one have to be to propose \"no-fly zones\" when the highest military officer in the country says it would result in war with Russia? How stupid does one have to be to believe that Putin is \"Hitler,\" that Russia shot down MH17 and is guilty of \"aggression\" on the eastern European borders, in Ukraine, and in Syria, without ever questioning the \"evidence\" for any of these assertions, much less the equally problematic role the U.S. has played in every case? Yet this is the mainstream narrative, repeated uniformly and relentlessly at every turn. \\nTrump is obviously not the best candidate in this race (Jill Stein is), but he is right on this most important issue of relations with Russia, which should have been the No. 1 issue from the beginning. So there is still a slight chance that Trump (and Stein also!) can at least go down with a (non-nuclear!) bang, not a whimper -- by giving peace, and reason, a chance. We should all hope that happens. - Advertisement -'"}, "time": 1742563521.7867146}