{"duration": 0.11741828918457031, "input_args": {"text": "'MOSCOW  —   On the top floor of Russia’s antidoping laboratory, the largest office is empty but for two unopened glass bottles of Montblanc writing ink, in Irish Green and Midnight Blue. The longtime director of the lab, Dr. Grigory Rodchenkov, treasured expensive pens. But last November, he packed up hurriedly and fled to the United States after Russia was accused of a   doping program and Vitaly Mutko, the country’s minister of sport, tourism and youth policy, asked him to resign. The lab’s operations, headquartered in a nondescript   building a few miles from the Kremlin, have mostly ground to a halt since global antidoping authorities decertified the facility. Dozens of staff members report to work from 9 a. m. to 6 p. m. but do little except surf the internet in lab coats, stare out the casement windows onto an adjacent open field and wipe down clean countertops while waiting for occasional blood samples to arrive. The sense of suspended animation in the lab reflects Russia’s standing in international sports as it awaits the result of an investigation into claims of a coordinated,    cheating operation at the last Olympics that could affect its participation in the upcoming Summer Games. “We’re just waiting,” Tatiana Radushina, a technician specializing in urine analysis, said on Wednesday, shrugging when asked how she spent her days. A short walk away, in the sports ministry  —   a former duke’s residence that dates to 1799  —   Mr. Mutko is waiting, too, but with a greater sense of urgency. He is logging   days, he said, seeking to counter the damage that Dr. Rodchenkov, who fled to Los Angeles, did when he spoke out in May about his work in Russia. Dr. Rodchenkov told The New York Times that at the 2014 Sochi Games, he swapped out the   urine of dozens of Russian Olympians, including at least 15 medalists, under orders from Mr. Mutko’s ministry. The World   Agency commissioned an investigation into Dr. Rodchenkov’s account. With the results expected on Monday, Mr. Mutko, 57, is preparing for what could prove a damning indictment of his administration, and he is in an unusually powerless position. Russia’s track and field athletes were already banned last month from competing at next month’s Rio Olympics by the International Association of Athletics Federations, the sport’s governing body. On Saturday, at least 10 national antidoping organizations  —   including those in the United States, Germany, Spain, Japan, Switzerland and Canada  —   and more than 20 athlete groups representing Olympians from around the world made clear that they were preparing to request that the International Olympic Committee ban Russia’s entire delegation from the Rio Olympics, if the report on Monday validates Dr. Rodchenkov’s allegations. In a   interview in the ministry last week, sitting alongside a large Russian flag and a grand window with Corinthian columns, Mr. Mutko expressed a range of emotions: defiance, contrition, indignation and shades of hesitant acceptance. Speaking through an interpreter, he said that most Russian athletes and coaches saw   drugs as necessary to win, and he admitted that he used to share that view, not explaining when and how his attitude changed. Shortly after he was appointed minister eight years ago, he said, he told Vladimir V. Putin  —   at that time the prime minister  —   that doping was a “black spot” on the country. Still, he scoffed repeatedly at the names of Dr. Rodchenkov and the other   who have alleged systematic doping in Russia, waving his hands dismissively and averting his otherwise intense stare. “Rodchenkov created traps,” Mr. Mutko said, scribbling on blank paper as he spoke. “He involved people in them. ” Dr. Rodchenkov said he had received direct orders from Mr. Mutko’s deputy, Yuri Nagornykh, and to back up the claim, he supplied spreadsheets that he said the ministry sent him as instruction manuals, listing athletes whose doping samples needed to be substituted at Sochi. Invoking his training as a lawyer at Leningrad State University, Mr. Mutko demanded proof. “Nagornykh was in close contact with Rodchenkov preparing for the Games,” he said. “What kind of communications they had, it’s complicated to judge. ” But if proof were produced, he said, global regulators should bear responsibility. He emphasized that WADA had accredited the Moscow lab, clearing it to conduct testing at the Olympics, in spite of its suspicious test results, and applauding its performance at Sochi. Until last fall, Mr. Mutko said of antidoping authorities, “they praised Russia constantly they had no questions for Russia. ” Grabbing a fistful of five pencils from the table, he pointed their sharpened tips toward the glittering chandelier above him and pounded their erasers on the table like a gavel. “Nobody blamed us when we were 11th or 12th in the world,” he said, raising his eyebrows and pausing uncharacteristically. “Our problem is not the problem of Russia but of the whole system of doping control. ” Indeed, the allegations about Russia have raised questions about the broader antidoping system, which last month the president of the International Olympic Committee called deficient. Even the supposedly   bottles, the standard at international athletic competitions, have been called into question by Dr. Rodchenkov, who said Russia’s internal intelligence service devised ways to break into them. Russia is preparing to host the World Cup in 2018, and Mr. Mutko, who is an executive with FIFA, world soccer’s governing body, expressed confidence that if the Moscow facility was not recertified in time, adequate drug testing would be conducted abroad. “We could send samples to Almaty, Kazakhstan,” he said. The Kazakhstan lab, however, was suspended by WADA last month for unspecified problems. With three weeks remaining until the Games, Russia is challenging the I. A. A. F.’s decision with the Court of Arbitration for Sport in Switzerland. “I have read all the documents,” Mr. Mutko said. “It’s all outside the legal framework. ” The World   Agency has reported that athletes in Russia have continued to systematically evade drug testing, as recently as last month. Mr. Mutko said he knew nothing about such violations. “Didn’t you know Russia is a huge country?” he said, adding that as minister he had many responsibilities. Mr. Mutko is well connected in international sports and not used to being kept in the dark, as he has been in the Sochi investigation. Seeking to contain the damage, he has written repeatedly to the president of WADA, Craig Reedie, who sent the ministry a reassuring note during an investigation into allegations of   doping in Russia last year. Early this month, Mr. Mutko wrote that he wanted to participate in the Sochi investigation, and he asked for an advance copy of the report due to be published on Monday. In reply, Mr. Reedie, who has been accused of being slow to act on allegations of doping within Russia, deferred to the Canadian lawyer leading the inquiry. To Mr. Mutko’s surprise, that lawyer, Richard McLaren, denied his requests. “I do not think it necessary to have any dialogue,” Mr. McLaren wrote on July 6. “I will report my factual findings, and then others will have to determine what it is they should do as a result. ” The International Olympic Committee and sports federations would have the authority to impose disciplinary measures based on Mr. McLaren’s findings. Mr. Mutko thus dismissed the power of the independent commission and WADA. “It’s about the decisions,” he said. “With respect to the commission, they do not determine the fate of world sport. ” In the United States, lawmakers and government investigators will probably also be watching for the results of the Sochi inquiry. The Department of Justice also opened an investigation into Dr. Rodchenkov’s claims. Mr. Mutko expressed little concern about American authorities, noting that no Russian was among the dozens of soccer officials charged in the United States’ FIFA case. Nearing 5 p. m. aides stood up, trying to bring the conversation to an end. Mr. Mutko continued talking, about his Sunday walks in Moscow’s botanical gardens, about his commute from St. Petersburg and about the Department of Justice. “When I visit New York, I will pay you a visit,” he said with a laugh. “But for the time being, I’m not visiting New York. ”'"}, "time": 1742563381.2988498}