{"duration": 0.10425543785095215, "input_args": {"text": "'Email \\nHafnarfjorður, Iceland. \\nThe votes are in. In a greater-than-expected 79% turnout, election results show that Iceland’s Pirate Party has not come out in first place as earlier polls indicated might be the case. They have, however, increased their size in the Parliament 3-fold (from 3 seats to 10) but this will not be enough to steer Iceland in their direction. \\nNow it´s all about coalition building. \\nHad they maintained those poll numbers from earlier this summer (at a one-time high of 35%), that would have given them the probable first choice to form a coalition government with either the Left-Greens, the Social-Democrats, or the center-leftish Bright Future. As it stands now, they will need to band together, something they all they agreed to consider during a pre-election press conference. \\nThe largest single party remains the corporate-right Independence Party with 29% or 21 seats and which is now part of the governing coalition along with the center-right Progressive Party (who suffered a humiliating loss of 11 seats, now down to 8). This coalition is the same center-right configuration which led Iceland to financial disaster, the flight of skilled doctors and other professionals, and whose members were implicated in off-shore money scams which led to the resignation earlier this year of their last PM from the Progressive Party, causing these early elections, and now to the formal resignation of their present PM just a few hours ago. Technically these two parties could form a 3-party coalition along with the new Regeneration Party. However, Regeneration leader Benedikt Jóhanesson has said he wouldn´t consider a coalition with the governing parties. Thus that particular scenario is doubted. \\nAfter years of political stagnation following the collapse of the economy, and controversy over the Panama Papers leaking of wealthy Icelanders´ involvement in Tortola, this new development reflects a growing, widespread disgust at the traditional two party coalition rulers who have alternately or in pairs run the country for most of its years following Iceland’s independence. \\nThe ship is floundering and the present course is unsustainable. \\nThe other numbers however, are pointing to a change of course: The Pirates won 14.5% giving them 10 seats in the 63 seat Parliament, the Althing. The Left-Greens received 15.9% (for 10 Seats); the Social Democrats 5.7% (3 seats) and Bright Future 7.2% (winning 4 seats).Together they represent almost 30% of the electorate. These are the groups which began talking about joining forces this past week, just before the election. \\nIf a four party coalition is solidified, then Iceland becomes the second nation to have a viable Pirate Party within its government (Germany is the first) and the first to have it this close to the helm in the country´s governance. \\nThe kingmakers could very well be Regeneration, a new, center-right grouping who won 10.5% of the votes getting them 7 seats. They characterize themselves as “liberal”, though the head was a long-time supporter of the Independence Party before leaving this past year. On the 18th of October he said he wouldn’t consider joining a coalition with the two-headed ruling hydra of the Independence and Progressive parties. Were he instead to agree to an alliance with the four roughly left, center-left groups of which the Pirates are a part (something he declared he was open to the morning after the election), then that would net a total of 34 seats (27 + their 7) and a solid majority. A five party coalition. \\nWhat does this all mean? It means several things: in the short run, the helm of the Icelandic political ship will remain loosely dominated by the Independence Party as the largest single grouping in the Althingi (Parliament). But aside from that approximately 30% of the electorate who aren´t swayed by anything but their loyalty to the ruling class, the rest of the country is moving on. They are actively exploring hitherto unheard of politics (with the Pirates) and considering broad coalition politics (5 groups trying to control the direction of the country). This may be the wave of the future. Or it may simply be a transitional era where loyalties are split and serious discussions about radical ideas like ownership of public resources (and actually and clearly defining such) occur openly as the public coalesces around a new, dominant ideology. In the long run, things are changing. And then there is this issue of a new Constitution which was voted on and accepted by the public but which the ruling coalition simply ignored and shelved. If that was now formally accepted, then some serious changes may be in store for the Owners of the country. But today is only the day after, and nothing has been decided yet. \\nSo what´s next? Well, the new President’s job just got more complicated as he is the one who traditionally asks the leading party to form the new government and, if they fail in securing a stable majority, the next leading party would get a shot. This was easier when the totals were generally in favor of one or the other of the two ruling groups. Now, however, a new multi-party dynamic is at play. Who knows how the discussions are heading right now, and which horses are being traded? \\nIceland has always been the most USAmerican of the Nordic countries but with tugs in both directions. Much like the island itself, rent down the middle by volcanic cracks dividing the European and American tectonic plates, these tugs are causing great tension as to which political direction the country should follow. With history having taken them this far and a growing unease about the dominant parties´ corruption and rehashed free market rhetoric, it appears Iceland is not quite ready to jump ship and hand the wheel over to the Pirates. But they and their kind are looking better and better as each year passes and Iceland drifts without a clear direction to prosperity and fairness. In the long run, that tectonic split in politics is getting wider and wider, just like its geographical counterpart. \\nBut it is the Pirates who at least have captured the imagination of the people (and, in particular the young). If they can convince the rest of the public that they are more seriously interested in governing than in luring Edward Snowden here (a publicity stunt at best) and have more relevant meat and potato concerns beyond internet privacy, then they may very well be the ultimate winners a few years down the road. Join the debate on Facebook José M. Tirado is a Puertorican poet, Buddhist priest and political writer living in Hafnarfjorður, Iceland, known for its elves, “hidden people” and lava fields. His articles and poetry have been featured in CounterPunch, Cyrano´s Journal, The Galway Review, Dissident Voice, La Respuesta, Op-Ed News, among others. He can be reached at .'"}, "time": 1742561695.4230783}