{"duration": 0.04442286491394043, "input_args": {"text": "'Caitlyn Jenner is reportedly planning to bare it all in a nude photo shoot after undergoing gender reassignment surgery earlier this year. [According to the Daily Mail, Jenner’s son Brody Jenner says the former Olympian’s forthcoming photo shoot has infuriated the Kardashian clan.  “Brody told them that Caitlyn has planned and booked a full nude photo shoot and they were like, that’s unacceptable, it’s taking things too far,” a source told the Mail. “They’re hoping the shoot doesn’t come to pass because that would be their worst nightmare,” the source added. “Taking it to that level and unveiling her [new body] with a fully naked photo spread is going way too far. ” In a new memoir, Jenner  —   who was previously known as Bruce Jenner  —   reveals details about the reported $20, 000 surgery. “The surgery was a success, and I feel not only wonderful but liberated,”the    former gold medalist writes, adding that the book will address every question that went unanswered after Jenner came out as transgender in a blockbuster interview with Diane Sawyer in 2015. “I am telling you because I believe in candor. So all of you can stop staring. You want to know, so now you know. Which is why this is the first time, and the last time, I will ever speak of it,” Jenner writes. Meanwhile, Kris Jenner has blasted her ex’s memoir, saying it’s “all made up. ” “I read it and basically the only nice thing she had to say was that I was great socially at a party one time   …    . Everything she says is all made up,” Kris Jenner explains to her daughters Khloé and Kim Kardashian in a preview for Sunday’s episode of Keeping Up with the Kardashians. ” Why does everything have to be that Kris is such a bitch and an a**hole?”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742564439.8822684}