{"duration": 0.04181265830993652, "input_args": {"text": "\"Society The US is charging dozens of people with participation in a major Indian-based fraud. \\nThe US Justice Department has charged 61 people and entities with involvement in a major India-based scam that targeted thousands of Americans. \\nThe scheme involved Indian call centers, where some workers called American citizens and convinced them to pay their non-existent debts by impersonating Internal Revenue Service (IRS), immigration and other federal officials, the Justice Department said in a statement on Thursday. \\nSome victims were even offered short-term loans or grants on condition of providing good-faith deposits or payment of a processing fee. \\nThe scammers had stolen more than $300 million from at least 15,000 unsuspecting citizens, the department noted. \\nThe victims’ money was laundered by an American network of criminals who used debit cards or wire transfers under fake identities, the indictment said. \\nFederal officials arrested 20 people across America on Thursday. Additionally, 32 individuals and five call centers in India were charged with connection to the case. \\nUS Assistant Attorney General Leslie Caldwell said in a press briefing that Washington was looking forward extraditing the suspects from India to face jail terms. \\n“It's really important for the scammers in India to know that the United States is looking at this, is watching them and they could, if they engage in that activity, be extradited to the United Sates and could sit in jail ... for several years,” she said. \\nIn a bill of indictment for the scammers, the US District Court for the Southern District of Texas had pointed to scare tactics employed by the operators of call centers in Ahmedabad, in the Indian state of Gujarat. \\nThey “threatened potential victims with arrest, imprisonment, fines or deportation if they did not pay taxes or penalties to the government,” it read. \\nThe extent of the scam was so vast that major federal organizations such as Immigration and Customs Enforcement, Treasury, Homeland Security, US Secret Service and police had to help with the investigation, according to the Justice Department. Loading ...\""}, "time": 1742561740.0930343}