{"duration": 0.03144955635070801, "input_args": {"text": "' \\nDonald Trump supporter and former Speaker of the House Newt Gingrich got into a heated discussion with Kelly File host Megyn Kelly Tuesday while discussing the Republican nominee’s debate performances, poll standing and allegations of sexual indiscretions.\\nKelly broached the subject saying, “If Trump is a sexual predator…” at which point Gingrich launched into his defense of Trump.\\n“He’s not a sexual predator. You can’t say that. You can not defend that statement,” Gingrich retorted.\\n \\nRelated Stories Donald Trump’s Star On Hollywood Walk Of Fame Vandalized Independent Voters Push Trump To The Front In Florida And Ohio O’Reilly Grills Washington Post Columnist Who Says He Is Not A ‘Real’ News Person Following the show, Gingrich posted video of the exchange to Twitter.\\nMy exchange with @megynkelly tonight https://t.co/IZVXeiprJN \\n— Newt Gingrich (@newtgingrich) October 26, 2016 \\n\\nIn the exchange which lasted several minutes, Gingrich said, “I am sick and tired of people like you using language that is inflammatory that’s not true!”\\n \\nKelly reminded the speaker that, while she was not taking a position on the allegations, he did not know whether they were true or not.\\nAccording to Gingrich, she took a position when she uttered the words.\\nGingrich accused Kelly of being “fascinated with sex” and unconcerned about the issues and public policy.\\n“Me, really?” Kelly said, before adding, “Well, you know what, Speaker, I’m not fascinated by sex. But I am fascinated by the protection of women and understanding what we’re getting in the Oval Office. And I think the American voters would like to know …”\\n \\nTrending Stories Frustrated With Media Bias, Trump Campaign Takes Its Case Directly To Voters With Nightly Show On Facebook Independent Voters Push Trump To The Front In Florida And Ohio RNC Official Takes CNN Host To Task For Claiming There Is No Media Bias Gingrich went on to accuse the media of bias, pointing out the fact that three major networks spent 23 minutes covering the release Trump’s Access Hollywood conversation, while choosing not to cover a speech made by Democratic nominee Hillary Clinton in which she expressed her hope for open borders in the United States.\\nThe two also discussed certain polls showing Trump trailing behind Clinton with only two weeks to go until Election Day.\\nWhile Kelly asserted that many polls have Clinton ahead in the race, Gingrich reminded her that early voting statistics show Republicans outvoting Democrats in Florida and Pennsylvania.\\nWhat do you think?'"}, "time": 1742562407.5424984}