{"duration": 0.03143715858459473, "input_args": {"text": "'Syria This October 19, 2016 photo provided by Norwegian Armed Forces shows a plane taking off from Russian aircraft carrier Admiral Kuznetsov (R) with helicopters escorting nuclear-powered battle cruiser Pyotr Veliky (L) southwest of the city of Trondheim in international waters on its way to the Mediterranean. \\nA fleet of Russian warships has entered the eastern Mediterranean off the coast of Syria amid speculations that Moscow and Damascus are about to launch a massive operation against terrorists in the northern Syrian city of Aleppo. \\nThe commander of Russian aircraft carrier Admiral Kuznetsov told state-owned Russia-1 television network on Saturday that the military vessels were positioned in the “designated zone... in the eastern Mediterranean and are now jointly carrying out tasks, maneuvering to the west of the Syrian coast.” \\nCaptain 1st rank Sergei Artamonov added that fighter jets have already started taking off from the carrier’s deck to survey the conflict zone. \\n“Flights are being carried out from the deck... they are working on coordination with the shore port. The flights have been going on practically every day for the last four days,” the high-ranking Russian naval commander pointed out. \\nThe remarks came a day after Russia’s Interfax news agency reported that Russian MiG and Sukhoi warplanes routinely fly from the Kuznetsov aircraft carrier into the Syrian airspace to “determine combat missions.” \\nMeanwhile, the commander of the Pyotr Veliky nuclear-powered battle cruiser, Captain 1st rank Vladislav Malakhovsky, said on Saturday that no foreign aircraft dared to “come closer than 50 kilometers” away from the Russian fleet. This file photo shows Russian frigate Admiral Grigorovich on its way to the Mediterranean. (Photo by Reuters) \\nOn November 4, Russian frigate Admiral Grigorovich passed through the Bosphorus Strait in northwestern Turkey and arrived off the Syrian coast. \\nGrigorovich is reportedly capable of launching land-attack Kalibr cruise missiles, which are equivalent to US Tomahawk ones and equipped with the latest high precision guidance systems. \\nRussia has been bombing Daesh and Jabhat Fateh al-Sham, formerly known as the al-Nusra Front, terror groups in Syria since September 30, 2015 at the official request of President Bashar al-Assad. \\nBacked by Russia’s aerial campaign, the Syrian troops have retaken several militant-held areas in the Arab country. \\nSyria has been gripped by foreign-backed militancy since March 2011. United Nations Special Envoy for Syria Staffan de Mistura estimates that over 400,000 people have been killed in the conflict. Loading ... '"}, "time": 1742561692.691301}