{"duration": 0.09178519248962402, "input_args": {"text": "'MANILA  —   President Rodrigo Duterte’s declaration of a “state of lawlessness” in the Philippines after a blast that left at least 14 dead raised fears on Saturday that it could lead to a curtailment of basic freedoms. The declaration of a state of lawlessness would allow the military to carry out some police operations, including patrolling urban areas, conducting searches, enforcing curfews and setting up checkpoints, Mr. Duterte said. A presidential spokesman, Ernesto Abella, said Saturday that the declaration was “limited” and allowed for the use of troops only to deal with security threats and to “suppress” violence. Mr. Abella emphasized that the president was not declaring martial law, which he could do only in response to an “invasion or rebellion, and when the public safety requires it. ” He called for unity and told the public to “complain less and do more” in the wake of the explosion in Davao, on the southern island of Mindanao, on Friday. Mr. Duterte’s announcement was viewed with concern by some lawmakers and human rights groups, who had already expressed alarm over a violent war on crime and drugs initiated by Mr. Duterte. Nearly 1, 800 people were killed by the police and vigilante groups in the weeks after his inauguration in June. The human rights group Amnesty International said Saturday that while it recognized government’s duty to protect civilians, Friday’s attack “must not be met by government action that itself disregards human life. ” “Resort to unlawful killings, arbitrary arrests or other human rights violations will only play to the hands of those who seek an   cycle of violence and abuse,” said Champa Patel, Amnesty’s senior researcher in the region. The extremist group Abu Sayyaf claimed responsibility for the blast, according to The Associated Press, but Mr. Duterte said investigators were also looking at other possible suspects, including drug syndicates singled out in his recent crackdown. A military spokesman, Col. Edgar Arevalo, said that the country’s armed forces had been placed on red alert and that all leaves had been canceled. Colonel Arevalo said provincial military commanders would work with their police counterparts and regional officials to set up local “peace and order councils. ” To “tackle this affront to our democracy,” he said, the military was asking “our people to bear with us as we dutifully, but courteously, conduct our checkpoints and increase our presence in some areas. ” The explosion, which also wounded more than 60 people, appeared to have been caused by a bomb set off at a market near a hotel frequented by the president. Mr. Duterte was Davao’s mayor for nearly two decades before becoming president. Mr. Duterte was in Davao at the time of the blast. Presidential aides said they suspected that Abu Sayyaf militants were retaliating for an intensified military offensive against the group. In the past week, the military sent thousands of troops to hunt for the extremists on the island of Jolo, in the southern province of Sulu, where members of Abu Sayyaf are believed to be holding hostages. Responding to the president’s remarks after the explosion, the Senate minority leader, Ralph G. Recto, urged Mr. Duterte to “explain and elaborate in writing” his reasons for placing the “whole country under a state of lawlessness” and clarify the scope of his order. Franklin M. Drilon, the president pro tempore of the Senate, advised the president to be “prudent,” saying such a declaration would affect the business climate. Mr. Abella, the president’s spokesman, contended that the declaration was covered under the 1987 Constitution, which he said gave the president the authority to call out the military and police to “suppress lawless violence, invasion or rebellion. ” But Senator Risa Hontiveros said it raised “deep concerns” and might increase public fears in ways that could be used by the Abu Sayyaf, or others. “I worry that the president might play to the script of the perpetrators of the violence,” Ms. Hontiveros said.'"}, "time": 1742561673.742008}