{"duration": 0.05478167533874512, "input_args": {"text": "'Home › POLITICS | US NEWS › DONALD TRUMP CLOSES GAP WITH HILLARY CLINTON IN MICHIGAN DONALD TRUMP CLOSES GAP WITH HILLARY CLINTON IN MICHIGAN 0 SHARES \\n[10/27/16] Republican nominee Donald Trump is now within striking distance of Democratic nominee Hillary Clinton in Michigan, a state that has not voted for a Republican presidential candidate since 1988. \\nIn the latest Fox 2 Detroit/Mitchell Poll , Trump trails Clinton by just six points. In the four-way poll, Clinton received 48 percent, Trump received 42 percent, Libertarian candidate Gary Johnson received 4.5 percent, and Green Party candidate Jill Stein received 1 percent. Clinton led Trump 50 percent to 44 percent, in the head-to-head. \\nFifty-nine percent of polled voters said that jobs and the economy are the most important issues, while 29 percent said that national defense and terrorism were most important. \\nA Detroit Free Press/WXYZ-TV poll places Clinton ahead of Trump by 7 points, which is still a significant narrowing compared to previous polls. \\nPublic backlash against trade deals like President Barack Obama’s Tran-Pacific Partnership – a deal that Clinton once called “the gold standard in trade agreements”– was so fierce that Clinton changed her tune during the Democratic primary where she was defeated by Vermont Sen. Bernie Sanders. \\n“Across Michigan, Republicans are coming home and taking a united stand against Hillary Clinton’s radical, open-borders agenda and plan to double-down on failed Obama policies, such as Obamacare. We are also seeing independents, Democrats and union workers saying no to Clinton’s special interest driven agenda, and yes to Mr. Trump’s plan to put America first,” Tim Lineberger, communications director for Trump’s Michigan campaign team told The Daily Caller News Foundation. \\n“Hard working Americans will be voting for change in November because they feel like the system is rigged against them, and they know that Clinton and her cohorts are the ones rigging it,” Lineberger added. \\nClinton was previously caught on tape telling a group of foreign bankers that her dream was a “hemispheric common market, with open trade and open borders.” Trump is also hoping to capitalize on the government’s recent report, stating that the price of Obamacare premiums are expected to increase an average of 22 percent. Post navigation'"}, "time": 1742564561.8922737}