{"duration": 0.06884479522705078, "input_args": {"text": "'Kyle S. Reyes, CEO of The Silent Partner Marketing, claims he makes potential employees take a “snowflake test” before hiring them, in a new article for the New Boston Post. [In the article, Reyes explained how his test works, and what questions it includes.  “I don’t want most people to work for my company. No, seriously. Most people suck,” wrote Reyes. “And I want people to work for me who don’t suck  …     So I’ve implemented something that is going to give HR managers and the PC Police night sweats. I lovingly refer to it as The Snowflake Test. ” “Anyone who may be a viable candidate for our agency has to take the test before they get an   at an interview,” he continued. “It’s 30   and   questions that help us to really get to know a candidate. We want to get in their heads. See how they apply logic and reason to different scenarios. See what makes them tick. See if they’d be a good fit for our culture. ” The test includes questions on how the applicant feels about guns, safe spaces, and trigger warnings, as well as some which are more personal and complex. “When was the last time you cried and why?” is allegedly one, as well as “You see someone stepping on an American Flag. What happens next?” “Since I launched this ‘filtering’ process, if you will, I’ve gotten a tremendous amount of whining from the general public,” claimed Reyes, added that he was “scolded by a woman on the phone yesterday who told me she wouldn’t take the test and ‘shame’ on me for making people take a test to come work for us. ” “She “demanded” I remove the test or risk losing out on ‘perfect employees’ like herself,” he claimed. “Bummer. Well, snowflake, it’s back to the heaping pile of applications for me. ” Reyes has previously criticized safe spaces and trigger warnings, publishing “An open letter to college crybabies from a CEO,” last year. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563813.408763}