{"duration": 0.04871535301208496, "input_args": {"text": "'UKIP MEPs Steven Woolfe & Mike Hookem reported to French police over... UKIP MEPs Steven Woolfe & Mike Hookem reported to French police over Strasbourg scuffle By 0 61 \\nMEPs Steven Woolfe and Mike Hookem have been reported to French police over an altercation at the EU’s Strasbourg parliament, which saw Woolfe hospitalized and plunged crisis-hit UKIP into further turmoil. \\nEuropean Parliament President Martin Schulz said he had referred the “regrettable” incident to the French authorities “given the seriousness of the reported facts and their possible criminal implications.” \\nSchulz says he had been recommended to do so by the European Parliament’s advisory committee on conduct, according to the Press Association. Following recommendation of EP Advisory Committee on Code of Conduct, I referred incident involving MEPs Hookem and Woolfe to FR authorities \\n— EP President (@EP_President) October 26, 2016 Based on the result of the investigations, I will then take a decision about sanctions to be imposed according to EP rules \\n— EP President (@EP_President) October 26, 2016 \\n“The committee concluded that the versions of the facts given by the two members involved diverged substantially and the facts seem to have happened in the absence of direct witnesses,” he told the parliament. \\nRead more \\n“It also stressed that given the seriousness of the reported facts and their possible criminal implications, further evidence is needed to clarify this matter. \\n“As a result I have decided to follow the recommendation of the advisory committee and I have referred this matter to the competent French authorities. \\n“Based on the result of the investigations, I will then take a decision about a sanction to be imposed.” Hookem off the hook \\nAn internal investigation by UKIP published on Wednesday afternoon ruled Hookem should not be held responsible for the altercation. \\n“ In the absence of eye witnesses, the true facts of what took place in the ante room itself are impossible to determine and neither man has made an official complaint to the party over the incident. ” \\nDespite the ruling, party investigators went into a detailed hypothesis as to what took place in the ante room between Hookem and Woolfe. The only thing it determines with any certainty is that “ the door was open prior to Mr Woofle’s fall. ” \\nThe investigation concludes Hookem was not close enough to the ante room door to open it himself, and so it is “ reasonable to assume that Mr Woolf opened the door whilst attempting to exit the ante room backwards. ” \\n“ The investigation does find it unlikely that Hookem was in a position to be able to push Woolfe through the door, given where he was standing in the ante room immediately afterwards, but in the absence of an eye witness, it cannot make a definite determination .” \\nWhile the report lets Hookem off the hook, it actually finds a series of quotes given by Woolfe to the Daily Mail earlier this month to have brought the party into “ disrepute .” \\n“ Had Mr Woolfe continued his membership of the party, a disciplinary panel would have been convened to investigate these quotes ,” the report concludes. Crying Woolfe \\nWoolfe quit UKIP last week, abandoning his leadership bid, and branded the party “ungovernable” without Nigel Farage as leader and the EU referendum to unite supporters. \\nHe will now sit as an independent in the European Parliament. \\nWoolfe stands by the claim he “received a blow” from Hookem during an altercation at a private meeting of UKIP MEPs, where they were discussing Woolfe’s rumored plan to defect to the Conservatives. \\nWoolfe says the incident caused him to suffer two seizures, partial paralysis and the loss of feeling in his face and body. He says he issued a police complaint. \\nHookem denies hitting Woolfe. \\nThe fallout from the incident has continued with claims Woolfe has been warned about “inappropriate behavior” by senior party figures. \\nHookem has also claimed Woolfe signed for £276 (US$300) in daily allowances at the European Parliament three times while recovering from his injuries earlier this month. \\nWoolfe had been seen as a frontrunner in the race to replace Diane James, whose term as UKIP leader lasted just 18 days. \\nAmong the other contenders are Suzanne Evans, Paul Nuttall and Raheem Kassam. \\nAlso running is John Rees-Evans, who apologized this week over a 2014 claim that a “ homosexual donkey ” tried to rape his horse. He described the comments as “ playful banter .” \\nThe new UKIP leader will be announced on November 28. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742628565.4620278}