{"duration": 0.14094924926757812, "input_args": {"text": "'As is the case with a lot of cinephiles my age (let’s say I’m a late boomer) horror movies were my gateway drug to movie love. It started in the late 1960s, when my mom asked me to watch “The Haunting” with her when it played on network television. (My dad was working nights.) I was traumatized but hooked. Martin Scorsese cites the New York TV station WOR’s “Million Dollar Movie” as the site of his early film education mine was that station’s “Chiller Theater” (not to be confused with a similar program on WPIX). It would be a few years before I’d see a horror movie  —   “Night of the Living Dead”  —   in an actual movie house. Things have come full circle in a sense. My favorite American contemporary horror director is Mike Flanagan, and I’ve yet to see any of his movies in a theater. (His latest theatrical release, “Ouija: Origin of Evil,” is one I need to catch up with.) His 2011 debut feature, “Absentia,” is a tense, creepy tale about a woman who registers her husband’s death seven years after his disappearance, only to have him turn up alive, and in very weird state. “Oculus,” from 2014, about an evil mirror and the havoc it wreaks on a brother and sister during two distinct periods in their lives, is an ingenious atmospheric shocker with intimations of the 1944 classic “The Uninvited. ” This year’s “Hush” is a brisk     exercise, with its deaf heroine terrorized in her cabin in the woods by a sadistic killer. “Absentia” and “Oculus” I saw on Amazon “Hush” had its premiere at the 2016 South by Southwest Film Festival, and went to Netflix directly thereafter. Mr. Flanagan just completed shooting a film set for Netflix in 2017, “Gerald’s Game,” an adaptation of Stephen King’s very provocative 1992 novel, in which the battle of the sexes takes on a grotesquely Grand Guignol dimension. Mr. Flanagan is, like Mr. King, eclectic in his range: He can do supernatural and   horror with equal conviction. His movies contain violence, sometimes of the grisly kind, but he doesn’t go for the constant semiautomatic,   sadism that distinguishes the “Saw” franchise and other movies. He also doesn’t go for the arguably cheap “jump scares” that are a feature of many contemporary horror pictures. But it won’t do to call him  . He’s doing new things. The parallel editing of “Oculus,” portraying his characters as young children and young adults in shifting flashbacks and   that become increasingly complex as the movie progresses, is innovative. In “Hush,” the way he uses movie language to change perspectives  —   from the deaf heroine to the hearing outside world  —   is similarly inventive. (“Hush” was written by Mr. Flanagan and his lead actress, Kate Siegel, who were married this year.) While he worked with celluloid only briefly while studying film at Towson University in Maryland, Mr. Flanagan said in a phone interview that whatever platform they’re going to be viewed on, he wanted his movies to feel like   …     movies. “With digital technology there’s a huge spectrum of flexibility in what you can do to manipulate sound and image,” he said, “which you can push into a really artificial realm if you aren’t careful. ” Mr. Flanagan, who is in his   mentioned “Jaws” as a picture that showed him “what cinema can do” and also cited horror classics like “The Changeling,” “The Exorcist” and “The Shining” as influences. He said the 1940s movies of the producer Val Lewton (“Cat People”) gave him an appreciation of atmosphere. But without the advent of the digital age, Mr. Flanagan acknowledged, he “might not have a career. ” “Absentia” was financed in part by the crowdfunding website Kickstarter. He admits that when he first envisioned a film career, he didn’t see the internet as a congenial home for his work. When he was studying film, he attended a seminar about broadband at the International Film Festival of Manhattan, “and it seemed insane that you’d be able to watch a movie in high quality on the internet. I never imagined it as a viable outlet. ” But working with online production entities has been crucial for Mr. Flanagan. He was frustrated with the troubled movie studio Relativity earlier this year over its handling of his movie “Before I Wake,” which he made in 2013. His experience with Netflix, which, he notes, “could release ‘Gerald’s Game’ the day after I delivered it if they were so inclined,” has been exhilarating. “A movie studio has to answer to a marketing department, and to shareholders, to ensure the broadest audience possible for its product it tends to err on the side of caution as a result,” he said. “Netflix has an incredible bravery about things that just don’t excite a studio anymore. You can feel the excitement they have about just getting a project into production. “‘Gerald’s Game,’ we could not have made it at a studio without substantive changes to the story. Working in this way takes away a lot of the red tape that you’d have to machete your way through in the studio system. ” Is there any downside? “The question is how long that attitude can survive the bigger the company becomes, but I haven’t seen any signs of it flagging,” Mr. Flanagan said. Netflix will probably release “Gerald’s Game” in the spring. Mr. Flanagan said the service may want to give it some festival exposure before offering it to subscribers.'"}, "time": 1742563602.8845572}