{"duration": 0.10338997840881348, "input_args": {"text": "'in: Government Corruption , US News It’s been almost a week since FBI director announced the reopening of the investigation into Hillary Clinton’s illegal use of her state department emails and this story is only getting bigger with every passing day. Hillary’s fully controlled liberal left mainstream media and her attack dog politicians and authority figure minions are doing things that some may argue resemble a silent coup d’etat. Yes, I’m talking about an American coup d’etat. I believe in many ways we are witnessing a slow motion coup d’etat that if it succeeds it will mark the permanent end to the rule of law, any resemblance of justice and the end of America itself. Let’s begin by first looking at the definition of coup d’etat : a sudden and decisive action in politics, especially one resulting in a change of government illegally or by force Recently reopened by the FBI, the investigation of Hillary’s criminality is very real and under any normal circumstances would or should guarantee not only her removal as presidential candidate regardless of how close we are to the elections, but also a warrant for her arrest. The Hillary crime team is not about to lay down for this incredible moment in US history however. Hillary has unleashed her attackers on the FBI and its director James Comey, who of course has been one of Hillary’s very controlled minions all along until now perhaps. To counter the application of the rule of law (remember, Hillary broke the law), to preserve her road to presidency and to block her road to jail Hillary’s attack dogs have been released on the justice system itself, something historically unusual and alone worthy of top news status. Attack dog number one, Senator Harry Reid recently threatened FBI director Comey stating the following in a letter to him: I am writing to inform you that my office has determined that these actions may violate the Hatch Act… Through your partisan actions, you may have broken the law. Historically and astonishingly Reid is attempting to put the elections before the rule of law itself. This is apparently a common theme and strategy in the Hillary criminal camp. So much so that they are attempting to make this about James Comey instead of the actual criminal who broke the law, Hillary Clinton. Attorney General Loretta Lynch also jumped in on this pro-Hillary, screw-the-rule-of-law narrative now being perpetuated by the pro-Hillary minions and attack dogs when it was reported that she “advised Comey not to send a letter to Congress informing them of the discovery of new emails”. The New Yorker put out anonymous quotes designed to attack Comey saying (anonymity emphasized in bold) “You don’t do this,” one former senior Justice Department official exclaimed . “It’s aberrational. It violates decades of practice.” The reason, according to the former official, who asked not to be identified because of ongoing cases involving the department, “is because it impugns the integrity and reputation of the candidate, even though there’s no finding by a court, or in this instance even an indictment.” In fact, according to the Washington Post James Comey’s critics are “ growing by the hour “. All of this is a continuation of what we’ve been seeing throughout this US presidential election campaign. Ignore the suspect on trial and attack the investigator instead. Ignore the details of the videos and emails being revealed and question the source or blame it on Russia. In the case of Hillary, this craziness is what we’ve been seeing for decades. Hillary (like Bill) is above the law and any attempt to bring her to justice will be fought and resisted by her army. They know that they are close to taking over the presidency (very likely via voting fraud ) that they don’t have to answer to the rule of law. The process of getting Hillary in, which we call election day, is therefore more important than the application of the law itself and justice. According to the pro-Hillary resistance (to the rule of law and justice), removing a potential criminal candidate who has repeatedly lied and murdered her enemies is apparently only of secondary importance to election day itself. The idea, the deep rooted delusional belief that Hillary really is actually above the law seems to be believed by her followers, supporters and attack dogs. Thus by perpetuating this belief they (the Hillary attack dogs) are trying to WILL their way into a Hillary presidential victory while completely ignoring the possibility and prospects that Hillary is in fact a criminal. It’s incredible how times have changed. It’s like we are watching the Watergate scandal in reverse. Imagine if AFTER the Watergate scandals of the 1970’s THEN Richard Nixon would have ran for president instead of the other way around. This, my friends, is what we are seeing with Hillary. The logic sequence goes like this: 1. Hillary criminality revealed and exposed to the world via leaks, witnesses, emails etc. 2. Hillary body count rises, many of her enemies coincidentally end up dead. The world watches this. 3. Hillary’s fully revealed criminality not allowed to be investigated because pursuing justice is seen as “interfering” with an election. 4. Known criminal Hillary Clinton becomes president and assumes power with the aid of George Soros and a mass criminal operation of voter fraud. 5. Hillary assumes power to go after all her enemies who tried to hold her to the law. Again, this is their (the pro-Hillary insiders) desired sequence and this is how they want to see things unfold. Adding to the recent attacks from the Clinton attack dogs Democratic Strategist James Carville recently stated: “This is in effect an attempt to hijack an election,” Carville claimed. “It’s unprecedented… the House Republicans and the KGB are trying to influence our democracy,” he said. Yes, the KGB apparently is behind the recent application of the rule of law as it pertains to Hillary’s lies and criminality now further revealed in her personal assistant’s ( Huma Abedin ) emails discovered by the FBI. The emails that offer further hard evidence to the Hillary criminal accusations. According to the NEW rule of law, especially the rule of law that Hillary will bring with her regime, none of this apparently matters any more. What most Americans don’t see is how closely all of this resembles a coup d’etat. Taking over the rule of law and declaring your own version of the law is a takeover any which way you cut it. The arrogance seen in Hillary Clinton in one hearing after another which she has sat for is mind boggling. At no point in any of these hearings (including the Benghazi hearings) has Hillary ever admitted doing anything wrong. She has just the right arrogance to take over the criminal Obama regime and push the West’s global order plans forward. She has just the right arrogance and criminal mindset to push the world into world war 3 and destroy whatever is left of America and individual freedom. Everything we are watching resembles an American coup d’etat from a legal point of view if you ask me. And the Hillary attack dogs at every level are riding out the final storm before (they hope) they insert their leader on election day. The criminals ignoring the rule of law surely have a stake in what they hope will be the next regime. Submit your review'"}, "time": 1742562045.1502485}