{"duration": 0.055325984954833984, "input_args": {"text": "'¿Y ahora qué? Oposición venezolana patea la mesa de diálogo con el gobierno   01:13 GMT | Última actualización: 27 oct 2016 01:15 GMT \\nDespués de las contradicciones entre sus voceros con respecto al diálogo con el gobierno, la derecha venezolana decidió patear la iniciativa de entendimiento con el chavismo y atizar la confrontación política. Un paro nacional, un intento de \"juicio político\" y movilizaciones siguen en agenda. Carlos Eduardo Ramirez Reuters   \\nLa derecha tomó el este de Caracas este miércoles y luego pateó la mesa. Aunque hubo amagos de algunos sectores de la oposición por sentarse con el gobierno, hoy desistieron. \\nEn la autopista Francisco Fajardo confluyeron los manifestantes opositores en una importante movilización que culminó con cuatro anuncios: la negativa de asistir al diálogo convocado por el gobierno el próximo 30 de octubre, el llamado a un \"paro nacional\" este viernes, una marcha a Miraflores el 3 de noviembre y una concentración para mañana jueves frente al Parlamento. \\nEl candidato presidencial recurrente de la oposición y actual gobernador de Miranda, Henrique Capriles, aseguró que si el Consejo Nacional Electoral (CNE) no revierte la decisión de suspender el revocatorio por las denuncias de fraude, el 3 de diciembre \"todo el pueblo venezolano\" irá a Caracas para llegar al palacio de gobierno. \\nEn tono de ultimátum, el presidente de la Asamblea Nacional, Henry Ramos Allup, reiteró: \"El día 3 de noviembre vamos a Miraflores pacíficamente a notificarle a Nicolás Maduro el veredicto popular. Son apenas ocho días a partir de hoy\". \\nPero el parlamentario de derecha tuvo oportunidad de estar este miércoles en Miraflores y no asistió. El mandatario nacional lo había invitado personalmente para la conformación del Consejo de Defensa de la Nación, un órgano de consulta y planificación previsto en el artículo 233 de la Constitución. \\nMaduro lamentó la ausencia del parlamentario porque, de acuerdo a la Constitución, \"estaba obligado a asistir\" a la reunión convocada en el Palacio. En una entrevista radial, Ramos Allup aseguró que no iría para \"hacer el papel de tonto\". \\n\"Lamento mucho que el presidente de la Asamblea Nacional continúe en desacato a la Constitución y no quiera dialogar, impulsando el verbo de la intolerancia\", sostuvo el mandatario. ¿Abandono del cargo? \\nLa movilización de la oposición ocurrió un día después que la mayoría de derecha en el Parlamento aprobara un acuerdo que pretende iniciar un \"juicio político\" a Maduro, una figura que no existe en Venezuela porque no está prevista en la Constitución. \\nEl único mecanismo posible de aplicar al mandatario nacional es un antejuicio de mérito que requiere, obligatoriamente, el aval del Poder Moral y el Tribunal Supremo de Justicia (TSJ), instancia última que la oposición en el Parlamento ha decidido desconocer desde hace meses. \\nEl desacato a las decisiones del máximo tribunal del país invalida todos los actos de la Asamblea, reiteró este miércoles a RT el dputado socialista Héctor Rodríguez: \"hasta que no acaten las sentencias del TSJ, sus decisiones son ilegales\". \\nPara el chavismo, la maniobra de un impeachment a Maduro es un intento de golpe de Estado porque la Asamblea no tiene ningún poder para ejecutar esa acción de manera unilateral y, además, ha desconocido al Poder Judicial. \\n\"Hay que llamarlos a la sindéresis, a que defiendan sus ideas en el ámbito político sin pasarle por encima a la Constitución. No es a través del fraude y de la fuerza que se van a imponer las cosas en Venezuela\", apuntó. \\nEl panorama no es favorecedor para la oposición y eso quedó claro con las declaraciones del diputado derechista Freddy Guevara: \"Yo sé que todos estamos desesperados, pero tenemos que utilizar el último recurso que nos queda: declarar desde la Asamblea Nacional el abandono del cargo de Nicolás Maduro\", refiere AVN . \\nEl abandono del cargo, reza la Constitución, se aplica cuando es \"público y notorio\" y puede ser declarado pasados los cinco días de ausencia del país, sin notificación al Parlamento. Pero Maduro está en Venezuela, estuvo fuera sólo cuatro días en una gira por el Medio Oriente y ejerce plenamente sus funciones como Presidente. Divisiones internas \\nEn la víspera a la movilización se evidenciaron las profundas fracturas dentro de la derecha venezolana. Mientras el secretario de la Mesa de la Unidad Democrática (MUD) había dicho que la oposición participaría en los diálogos con el gobierno, la fracción de Ramos Allup aseguró que no estaba al tanto de esa decisión sino que se enteró \"por la televisión\". \\nPor otra parte, el grupo de extrema derecha liderado por Leopoldo López rechazó de plano cualquier acercamiento. Las escisiones, sostiene el diputado Rodríguez, obedecen a las apetencias políticas de todos los sectores que adversan a Maduro. \\n\"No es la primera vez que esto pasa. Esas contradicciones están marcadas por las distintas visiones dentro de la derecha, unos quieren salidas violentas, otros quieren negociar, y en medio de esas pugnas están los deseos de quienes sueñan con ser candidatos presidenciales\", destacó el jefe de la fracción chavista en el Parlamento. \\n\"El problema es que las divisiones internas de la oposición ponen en riesgo la estabilidad del país\", agregó. A Miraflores aún no \\nAunque Capriles amenazó la semana pasada con llevar la movilización opositora a Miraflores, sus declaraciones se quedaron frías. Hoy la manifestación en el este de la ciudad -la zona más pudiente- ni siquiera se acercó al centro de Caracas, lo que causó frustración entre muchos de sus adeptos. \\nLos alrededores del palacio presidencial, en cambio, fueron custodiados este miércoles por una multitudinaria concentración chavista que fue recibida por el presidente Nicolás Maduro. La militancia socialista ha prometido mantenerse en la calle \"en defensa de la paz y la Constitución\".'"}, "time": 1742628550.307169}