{"duration": 0.07714056968688965, "input_args": {"text": "'HOBOKEN, N. J.  —   A careening commuter train plowed through the barrier at the end of the tracks and crashed into a wall at a terminal here during the morning rush on Thursday, killing one person, injuring more than 100 others and unleashing chaos as part of the station’s roof came tumbling down in a jumble of metal. The startling impact tossed commuters around on the crowded train and created enough force to knock bystanders to their knees, transforming a historic station  —   one of the busiest in the New York region  —   into a disaster area around 8:45 a. m. The person who died was a woman standing on the platform, who was hit by falling debris. Officials said they had not determined why the train, which was carrying an estimated 250 passengers, was traveling at a high speed and failed to halt on the track. “I remember thinking, Why aren’t we stopping?” said Jamie   who was standing between the first and second cars on the train. “But we just kept going and going, no braking, no nothing. ” “People were screaming to stay calm, but how do you stay calm in a moment like that?” she added. The crash sent passengers flying out of their seats in a violent tumble. Then the lights cut out. Shouts and cries underscored the sense of panic. And after passengers managed to escape from the train, many crawling through its windows, they emerged to find the station a mess of metal beams, smoke and treacherously hanging wires. Water poured from ruptured pipes. The most seriously injured were carried out. Others emerged on their own with blood staining their clothes. A New Jersey Transit worker said a train is typically supposed to come to a stop about 10 to 20 feet in front of the bumper. Its speed limit while entering the station is 10 miles per hour. Instead, this train barreled over the bumper and onto a concourse, coming to rest at a wall near the station’s waiting area. The train’s engineer, who was released from the hospital, was Thomas Gallagher, 48, according to Nancy Snyder, a spokeswoman for New Jersey Transit. Mr. Gallagher has worked for New Jersey Transit for 29 years, Ms. Snyder said. Officials said the terminal, housed in a   building dating to 1907, would remain closed until engineers could assess whether the significant damage had affected the building’s structural integrity. The terminal serves about 60, 000 people a day on commuter trains, light rail and buses, and is one of the largest transportation hubs for New Jersey Transit, the country’s   commuter railroad. It was severely damaged by Hurricane Sandy in 2012 after being swamped by five feet of water and remained closed for months. The woman who died was identified as Fabiola Bittar de Kroon, 34, of Hoboken, who was killed when the crash caused a portion of the station’s ceiling and supporting structure to collapse, officials said. “An extraordinary tragedy,” Gov. Chris Christie of New Jersey said, flanked by Gov. Andrew M. Cuomo of New York and transportation officials at a news conference near the station on Thursday afternoon. In all, at least 114 people were injured in the crash, a flood of victims sent to hospitals that forced at least one to set up a triage area for some patients in its cafeteria. That hospital, the Jersey City Medical Center, treated 66 patients from the crash, releasing all but 13 of the more seriously injured by Thursday afternoon. They remained in “guarded condition,” a spokesman said. Elisa Rosario, 33, who was sitting in the hospital’s emergency room, said she was in the station when the crash occurred. She said she felt a strong wind at her back, which pushed her onto her knees. “Everything was dark and all of a sudden I start seeing things flying through the air,” she said. She felt pain in her head and knees and felt blood dripping down her face onto her lips. “It was my worst nightmare,” Ms. Rosario said.   other patients were taken to Hoboken University Medical Center, and one to Christ Hospital, a spokesman for CarePoint Health said. All but two had been released by Thursday night, the spokesman said. The crash’s impact was magnified by its timing  —   in the midst of one of the fundamental daily routines, the morning commute to work. Many passengers, emerging from local hospitals with blood still on their clothes and skin, said the psychological toll rivaled the impact of their injuries. “The injury is nothing,” said one passenger, Mike Scelzo, who had a black eye and a facial cut. His striped   shirt was splattered with blood. “It’s more just the shock of what happened,” he said. Alexis Valle, 24, a commuter from Bergenfield, N. J. who is five months pregnant, was in the first car. She walked out of Hoboken University Hospital with a large bandage and four staples on her head. “The baby’s fine, but the ceiling of the train fell on my head,” she said. “Somebody picked me up and passed me through the window to someone else. I told them, so I was the first one out. ” She is still struggling to understand what happened. “The train just didn’t stop,” she said. “It kind of picked up speed and crashed. ” The train started its journey shortly around 7:30 a. m. in Spring Valley, N. Y. and traveled south to Hoboken along the Pascack Valley line. The National Transportation Safety Board and the Federal Railroad Administration said they were investigating the crash. They planned to interview the engineer, Mr. Gallagher, and to examine another crash at the Hoboken Terminal in 2011 involving a PATH train, which carries New Jersey commuters to Manhattan. After that crash, in which a PATH train hit a post at the end of the tracks and 30 people were injured, the safety board determined that the engineer had failed to control the train’s speed as it entered the station. The last fatal train crash involving New Jersey Transit was in 1996. Two recent train crashes in the Northeast have prompted federal officials to push for the expansion of a technology, known as positive train control, that can automatically stop or slow a train. An Amtrak train derailed in Philadelphia last year, killing eight people and injuring nearly 200 others, when the engineer became distracted and accelerated to more than twice the speed limit. In 2013, when a   Railroad train derailed in New York, killing four people, the safety board said the engineer had fallen asleep as a result of undiagnosed sleep apnea. In both derailments, the safety board cited the absence of the technology to stop or slow a train as contributing to the crashes. The crash on Thursday also rekindled anxiety in a region where less than two weeks ago bombs were set off in Manhattan and a town on the Jersey Shore. The suspect in the bombings was also accused of leaving five pipe bombs inside a backpack at a New Jersey Transit train station in Elizabeth, forcing the shutdown of a major line. The suspect, Ahmad Khan Rahami, was arrested nearby the next day. “Between terrorist attacks, natural disasters, we’ve had our hands full in this country,” Mr. Cuomo said. The victim’s mother, Sueli Bittar, was   on Thursday at her home in Santos, Brazil. Ms. de Kroon was a lawyer who was married to a Dutch man and had a    daughter. “She was very, very happy,” Ms. Bittar said in a telephone interview. Ms. de Kroon had worked in Brazil for the software company SAP before moving earlier this year to New Jersey, and the family was looking for a new apartment. Ms. Bittar said that her daughter wanted a little garden. Ms. Bittar was making plans on Thursday to travel to New Jersey to bring her daughter’s body home to Brazil. A friend of Ms. de Kroon’s, Sarah Alvarado, said they met when they were both studying in an M. B. A. program at Florida International University. They became fast friends, and when Ms. de Kroon moved to São Paulo before coming to the New York area, Ms. Alvarado visited her in Brazil. “She was very smart, a ” Ms. Alvarado said in a telephone interview. “She was accomplished in her career. A dynamic woman. ” Stephen Wang, 35, who usually transfers to a train at the Hoboken station, said the rerouting will probably add an hour to his normally   commute  —   “for days or weeks or months, who knows. ” Ms. Rosario, who sustained a concussion, was still shaken hours after the crash. “I barely made it,” she said. “I’m going to go home, and kiss my kids and pray and thank God that I made it out. ”'"}, "time": 1742628476.6878684}