{"duration": 0.049962520599365234, "input_args": {"text": "'Share on Facebook \\nOver the course of the presidential campaign, Donald Trump has found himself on the wrong side of issues relating to U.S. military veterans. Trump, unlike even other Republicans, has insulted veterans and used them as props to boost his campaign. \\nWith less than a week to go until the presidential election, Trump is back to his old dirty tricks with veterans. With Medal of Honor recipients seated behind him, Donald Trump tells supporters: \"I\\'m brave — financially brave.\" https://t.co/uWUUhCtQso pic.twitter.com/EDd7F0PLHT \\n— ABC News (@ABC) November 4, 2016 \\nThe Republican presidential candidate was listing the Medal of Honor recipients at the rally, when he stopped and said, “Oh, they’re so much more brave than me. I wouldn’t have done what they did.” \\nBut, that self-deprecation didn’t last long. \\n“I’m brave in other ways,” he said at the rally in Selma, a town 45 miles southeast of Raleigh. “I’m brave — I’m financially brave. Big deal, right? These are real brave.” \\nMedal of Honor honorees are given their medals for demonstrating extraordinary valor in combat, under fire. By comparison Trump has always led a life of privilege, including the way he avoided being drafted to serve in Vietnam, by citing mysterious “bone spurs” that disqualified him from going into the armed forces. Coincidentally, those debilitating “bone spurs” never showed up on Trump’s official medical records. \\nOther instances of Trump insulting the military include his attack on Khizr Khan, the father of a U.S. Army captain who was killed in Iraq. Trump claimed that he had suffered “sacrifices” like the Khans as well, while building luxury apartments and hosting a reality TV show. \\nTrump insulted Senator John McCain, who spent years in a Vietnamese POW camp. When he disagreed with McCain, Trump said he liked soldiers “who don’t get captured,” spitting in the face of the hundreds of prisoners of war. \\nThe nominee also used veterans as human shields while he was feuding with Fox News. Trump claimed he was holding a fundraiser for veterans when he decided to boycott a primary debate co-moderated by Megyn Kelly. But it turned out he never bothered to donate the money he had promised veterans until he was publicly shamed on being a cheapskate by the Washington Post . \\nFeatured image via screen capture'"}, "time": 1742628385.7188187}