{"duration": 0.06481289863586426, "input_args": {"text": "'Nuevas sanciones europeas contra la República Árabe Siria Red Voltaire | Bruselas (Bélgica) | 28 de octubre de 2016 français Decisión de ejecución (PESC) 2016/1897\\ndel Consejo del 27 de octobre de 2016\\nque pone en aplicación la decisión 2013/255/PESC sobre medidas restrictivas contra Siria La Unión Europea ha agregado 10 personas a la lista de « personas y entidades objeto de sanciones contra el régimen sirio » (sic), o sea la República Árabe Siria.\\nEsta decisión eleva a 217 personas y a 69 entidades los blancos de sanciones.\\nNúmero Nombre Datos identificativos Motivos Fecha de inscripción 207 Adib Salameh (alias Adib Salamah; Adib Salama; Adib Salame; Mohammed Adib Salameh; Adib Nimr Función: General de división, director adjunto de la Dirección de Inteligencia de la fuerza aérea en Damasco Miembro de los servicios sirios de seguridad e inteligencia después de mayo de 2011; director adjunto de la Dirección de Inteligencia de la fuerza área en Damasco; ex jefe del Servicio de Inteligencia de la fuerza aérea en Alepo.\\nMiembro de las fuerzas armadas sirias con rango de coronel o equivalente o un grado superior, en el cargo desde mayo de 2011; tiene rango de general de división.\\nResponsable de la represión violenta ejercida contra la población civil en Siria, como planificador de los ataques militares en Alep, en la que ha participado, y por tener autoridad para ordenar arrestos y encarcelar civiles. 28/10/2016 208 Adnan Abud Hilweh (alias Adnan Abud Helweh; Adnan Abud) Función: General de brigada Tiene rango de general de brigada de la 155ª y la 157ª brigadas del ejército sirio, en el cargo después de mayo de 2011.\\nComo general de brigada de la 155ª y la 157ª brigadas, es responsable de la represión violenta ejercida contra la población civil en Siria, específicamente debido a su responsabilidad en el despliegue y uso de misiles y armas químicas en zonas civiles en 2013 y su participación en olas de encarcelamientos a gran escala. 28/10/2016 209 Jawdat Salbi Mawas (alias Jawdat Salibi Mawwas; Jawdat Salibi Mawwaz) Función: General de división Tiene rango de general de división, oficial superior en la dirección de artillería y misiles del ejército sirio, en el cargo después de mayo de 2011.\\nComo oficial superior en la dirección de artillería y misiles, es responsable de la represión violenta ejercida contra la población civil en Siria, incluyendo el uso de misiles y armas químicas por parte de las brigadas bajo su mando en zonas civiles densamente pobladas, en 2013, en la Ghouta. 28/10/2016 210 Tahir Hamid Khalil (alias Tahir Hamid Khali; Khalil Tahir Hamid) Función: General de división Tiene rango de general de división, jefe de la dirección de artillería y misiles del ejército sirio, en el cargo después de mayo de 2011. Como oficial superior en la dirección de artillería y misiles, es responsable de la represión violenta ejercida contra la población civil en Siria, incluyendo el despliegue de misiles y armas químicas por parte de las brigadas bajo su mando en zonas civiles densamente pobladas, en 2013, en la Ghouta. 28/10/2016 211 Hilal Hilal (alias Hilal al-Hilal) Fecha de nacimiento: 1966 Miembro de una milicia afiliada al régimen conocida como “Kataeb al-Baath” (milicia del partido Baas). Apoya el régimen por el papel que desempeña en el reclutamiento y organización de la milicia del partido Baas. 28/10/2016 212. Ammar Al-Sharif (alias Amar Al-Sharif; Amar Al-Charif; Ammar Sharif; Ammar Charif; Ammar al Shareef; Ammar Sherif; Ammar Medhat Sherif) Influyente hombre de negocios sirio que ejerce su actividad en Siria, activo en los sectores bancario, de seguros y la atención hospitalaria. Socio fundador del Byblos Bank Syria, principal accionista de Unlimited Hospitality Ltd y miembro del consejo de administración de Solidarity Alliance Insurance Company y de Al-Aqueelah Takaful Insurance Company. 28/10/2016 213 Bishr al-Sabban (alias Mohammed Bishr Al-Sabban; Bishr Mazin Al-Sabban) Gobernador de Damasco, nombrado por Bashar Al-Assad y vinculado a él. Apoya el régimen y es responsable de la represión violenta ejercida contra la población civil en Siria, específicamente bajo la forma de prácticas discriminatorias hacia las comunidades sunnitas en la capital. 28/10/2016 214 Ahmad Sheik Abdul-Qader (alias Ahmad Sheikh Abdul Qadir; Ahmad al-Sheik Abdulquader) Gobernador de Quneitra, vinculado a Bashar Al-Assad y nombrado por él. Ex gobernador de Latakia. Apoya el régimen y se beneficia con ello, específicamente apoyando públicamente a las fuerzas armadas sirias y las milicias favorables al régimen. 28/10/2016 215 Dr. Ghassan Omar Khalaf Gobernador de Hama, nombrado por Bashar Al-Assad y vinculado a él. También respalda el régimen y se beneficia con ello. Ghassan Omar Khalaf está estrechamente vinculado a los miembros de una milicia afiliada al régimen presente en Hama y conocida como brigada de Hama. 28/10/2016 216 Khayr al-Din al-Sayyed (alias Khayr al-Din Abdul-Sattar al-Sayyed; Mohamed Khair al-Sayyed; Kheredden al-Sayyed; Khairuddin as-Sayyed; Khaireddin al-Sayyed; Kheir Eddin al-Sayyed; Kheir Eddib Asayed) Gobernador de Idlib, vinculado a Bashar Al-Assad y nombrado por él. Se beneficia con el régimen y lo apoya, específicamente apoyando a las fuerzas armadas sirias y las milicias favorables al régimen. Vinculado al ministro des Awqaf, Dr. Mohammad Abdul-Sattar al-Sayyed, que es su hermano. 28/10/2016'"}, "time": 1742628601.9187956}