{"duration": 0.024649381637573242, "input_args": {"text": "'The Bundy brothers and their comrades were clearly guilty. \\nThey took over the national wildlife refuge, threatened violence if accosted, and wouldn’t let anyone in. \\nHowever, the Portland jury acquitted Bundy, his brother Ryan Bundy and five others of conspiring to impede federal workers from their jobs at the Malheur National Wildlife Refuge, 300 miles southeast of Portland. The jury could not reach a verdict on a single count of theft for Ryan Bundy. \\nThe charges were conspiring to impede federal workers from doing their jobs and that’s exactly what they did. \\nBut in the end, the jury acquitted them . \\nThe jury wasn’t dumb, or blackmailed or somehow brainwashed. They were sick and tired. \\nSick and tired of a bureaucracy in Washington that didn’t listen to them. That dictated use of their lands from thousands of miles away with an iron fist. \\nIt was a classic case of jury nullification : where despite the evidence, the jury is so convinced that the laws are immoral or so wrongly applied that the accused must be set free. \\nAnd so Ammon Bundy, his brother Ryan and their five co-defendants were found not guilty. Most of them were set free from the courtroom. Ammon faces charges in Nevada, so he is still being held. \\nAs the Associated Press reported it, even lawyers for the Bundys were shocked at the verdict: \\n“It’s stunning. It’s a stunning victory for the defense,” said Robert Salisbury, attorney for defendant Jeff Banta. “I’m speechless.” \\nThe U.S Attorney in Oregon, Billy J. Williams, issued a statement defending the decision to bring charges against the seven defendants: “We strongly believe that this case needed to be brought before a Court, publicly tried, and decided by a jury.” \\nThis is what happens when the American people see an out-of-control Washington bureaucracy: They ignore them. They ignore the law and decide for themselves that no, these people shall be set free. \\nWhile courts are reluctant to inform juries of their right to “nullify,” that’s exactly what they can do. \\nEffectively, the jury nullifies a law they believe is either immoral or wrongly applied to the defendant, and that’s what happened here. \\nAnd it bodes well for America. Jury nullification sends a messages to prosecutors and lawmakers about their priorities and about what they see as harassing or abusive prosecutions. \\nA professor at the University of Missouri at Kansas City wrote about how important the power of jury nullification really is: \\nJuries clearly have the power to nullify; whether they also have the right to nullify is another question. Once a jury returns a verdict of “Not Guilty,” that verdict cannot be questioned by any court and the “double jeopardy” clause of the Constitution prohibits a retrial on the same charge. \\nSo whether the Bundy’s antics were stupid or dangerous or just plain wrong, it doesn’t matter. The Portland jury found that in this case – the seven defendants were to be set free because in our court system, a jury of their peers felt the government went too far . \\nYes, this is good news for America, for the people, for the rule of law and for the right of the people to object. To say: “ No. We will stand for this no longer.”'"}, "time": 1742628566.6913254}