{"duration": 0.076507568359375, "input_args": {"text": "'Making the most of the fractured political and media landscape, 20th Century Fox created a group of fake news sites as part of a viral marketing campaign for its new film “A Cure for Wellness. ” The sites displayed ads for the movie and slipped references to its plot alongside   stories about divisive topics like abortion, vaccines and President Trump. Fox used at least five fake news sites designed to look like local news media  —   The Sacramento Dispatch, Salt Lake City Guardian, Houston Leader, NY Morning Post and Indianapolis Gazette  —   to stir online outrage and drum up interest in the movie, which was produced by New Regency Productions and is to come out this week. It used other fake sites to promote the film as well, including one designed to resemble HealthCare. Gov and another for a fake bottled water company. Regency Enterprises and 20th Century Fox acknowledged their role in the fake news operation in a statement on Tuesday. “A Cure for Wellness is a movie about a ‘fake’ cure that makes people sicker,” the statement said. “As part of this campaign, a ‘fake’ wellness site, healthandwellness. co, was created and we partnered with a fake news creator to publish fake news. ” A Fox spokeswoman, Daria Vogel, declined to answer   questions on Tuesday, including whether the companies were using any other fake news sites to promote their film or whether they had used similar methods to promote movies in the past. The company is owned by Fox Entertainment Group, which also owns Fox News Channel and Fox Business Network. “A Cure for Wellness” was directed by Gore Verbinski and stars Dane DeHaan and Jason Isaacs, who in the past have both made jokes online about the phenomenon of fake news. The film opens on Friday and has received mostly negative reviews. One critic, Joe Dziemianowicz of The Daily News, described its plot as “preposterous gothic nonsense. ” The five sites known to be part of the fake news campaign were taken down after the story was  reported by BuzzFeed News on Tuesday. Users who entered their URLs were redirected to the film’s official website, but archived versions of some of their articles remained available online. The stories they published hit the viral sweet spot that has made fake news such an online force, even though most of them were not related to the movie. Some were shared thousands of times on social media by users who appeared to believe that they were factual news stories, and others were reposted by partisan websites like Red State Watcher. A partial list of headlines published by the movie studio’s campaign: • “Utah Senator Introduces Bill to Jail, Publicly Shame Women Who Receive Abortions” • “BOMBSHELL: Trump and Putin Spotted at Swiss Resort Prior to Election” • “LEAKED: Lady Gaga Halftime Performance to Feature Muslim Tribute” • “Trump Refuses to Provide California Federal Support in Midst of Natural Disaster, Cites Sanctuary Cities” • “California Legislature to Consider Tax Rebates for Women Who Get Abortions” Lynn Walsh, the president of the Society of Professional Journalists, said in an email that corporations had a responsibility to engage in “the ethical and responsible sharing of information no matter the intent or purpose. ” “In this country, we have the right to speak and publish information freely, and that’s a good thing,” Ms. Walsh said. “But if someone or a company is publishing incorrect information and trying to make it pass as actual news, we think that content should be properly labeled and very explicit that it is not true and does not contain actual facts. ” Those are guidelines that 20th Century Fox and New Regency Productions did not follow. “This absolutely crosses the line,” added Bonnie Patten, the executive director of the consumer watchdog TruthinAdvertising. org. “Using a fake news site to lure consumers into buying movie tickets is basically a form of deceptive marketing. ” One story published as part of their campaign claimed that Mr. Trump had issued a   ban on the vaccine for the measles, mumps and rubella. The report was published on The Houston Leader and debunked by the   website Snopes, which called the site “one of a series of fake news sites that masquerade as real news sites by emulating the appearance of   newspapers. ” Another story falsely reported that the American Medical Association had recognized a form of   anxiety or depression, “Trump Depression Disorder,” that it claimed affected one third of the country. It urged readers “to tweet #cureforwellness to raise awareness of the growing epidemic. ” Some of the film’s fake marketing websites remained active on Tuesday night, including the health and wellness website and the website for the fake bottled water company, which claimed to source its product from a Swiss village (that does not exist). The website designed to resemble HealthCare. gov (it is called HealthCureGov. com) also remained active. Ms. Vogel, the Fox spokeswoman, declined to explain why those websites had not been disabled. A phone call to the purported office of healthandwellness. co went unanswered, and emails to six people listed as its “managing editors” bounced back as undeliverable.'"}, "time": 1742561987.6648095}