{"duration": 0.06347441673278809, "input_args": {"text": "'PARIS  —   He was beaten in the last presidential election, his presidential term was considered a failure, and he has been the subject of numerous judicial inquiries. In most other political systems, he would be a  . Yet in a France under terrorist threat, Nicolas Sarkozy may be the man of the moment in a presidential race picking up steam. By hammering on the idea that France’s “identity” is being challenged at a moment of deep unease over terrorism, the mercurial Mr. Sarkozy may be on to something with the electorate. This past week, his new book put “identity” front and center in his new campaign. It quickly climbed to the top of a popular   list, outpacing even the season’s novels. As is typical with such instant books, Mr. Sarkozy used his hastily written extended pamphlet to announce his candidacy. He will run in his    party’s November primary, he said. And he is consistently strong in polls. At a rally in a sweltering auditorium in France’s south late last month, his first of the campaign, Mr. Sarkozy got his loudest cheers when he conflated the fight against terrorism with the fight for France’s identity. “France is under threat,” he told the crowd. “France is a target. War is war. We’ve got to win. We’ve got to crush our enemies, render them harmless. ” As the crowd in Châteaurenard cheered, Mr. Sarkozy announced, “Our identity is under threat. ” By “our identity,” it is clear he means   France. Mr. Sarkozy is positioning himself as its No. 1 defender against weak Socialists and competitors on the right. With his exclamations, Mr. Sarkozy is all about ensuring that next year’s presidential campaign will be fought largely over the threat from Islam, real and perceived. Already, he has touched a nerve with voters. For months, the calm, cerebral and moderate mayor of Bordeaux, Alain Juppé, with his soothing talk of a France at ease with what he calls its “happy identity,” has been considered the   easily pushing Mr. Sarkozy and the bedraggled Socialist president, François Hollande, way back in polls. Mr. Juppé is still the favorite, but he is losing ground in his own party. The new polling numbers suggest as much: Mr. Sarkozy gained four points last week in one widely watched measure and two points in another, nipping steadily at Mr. Juppé’s heels. In one of the polls, he was nearly 40 points ahead of Mr. Juppé among voters in their party, the Republicans. Mr. Sarkozy recently said he would introduce a law banning the burkini, the   swimsuit worn by some Muslim women, and it has not hurt him. Anything but. Even on the French left, the burkini has few defenders. The Socialist government’s female ministers have been quick to say they are against it, even when they do not support a total ban feminists have published diatribes against it in the French news media. Mr. Sarkozy characteristically pushes it a step further. “The burkini is a political, militant act, a provocation,” he told Le Figaro magazine. He calls for locking up,   Muslims who are potential security threats, with thousands of them in the government’s files. Mr. Juppé’s appeal, to preserve republican values and the rule of law, seems less in tune with the voters in France’s moment of sustained tension. With Marine Le Pen, the leader of the   National Front, oddly silent after its defeat in local elections in December and largely absent from public debate, Mr. Sarkozy seems intent on scooping up both the Front’s   xenophobic electorate and more centrist   voters who, like much of France, are still in a state of shock after a wave of terrorist attacks. So far, he appears to have the wind in his sails. How is it that Mr. Sarkozy  —   a politician who left France’s chronic economic problems intact after five years in office, embarrassed it with a messy personal life, and wound up being interrogated by investigators over party finances and other matters  —   appears to be coming back so strongly? Much of it has to do with France’s     political system, said Gérard Grunberg, a political scientist at the Institute of Political Studies. Such a system leaves little opening for outsiders and newcomers. Those who are strong in their parties can almost always be guaranteed a long political life. If you are already in the club, you stay in it. Even in defeat, Mr. Sarkozy maintained firm control of his Republicans, not stepping down from their leadership until he announced his candidacy on Aug. 22. And although the French president is directly elected, not chosen by Parliament, the office exists in the shadow of the country’s long parliamentary tradition, Mr. Grunberg said. In that tradition, “the fact of having been beaten did not mean the end,” he said, with prime ministers and other top leaders often recycling themselves after losing crucial votes. But perhaps more important, Mr. Sarkozy may be the politician most in tune with the country’s unease. He is certainly the loudest, pounding even more explicitly than Ms. Le Pen the themes of secularism and the need to oppose the influence of Islam. “The Republic has retreated too far,” Mr. Sarkozy says in his book. “Nobody should be allowed any external sign of religious affiliation. ” He adds that it is “not with religions that the Republic has problems, but with one of them. ” In the face of the terrorist attacks, Mr. Sarkozy projects aggression and pugnacity where Mr. Hollande merely looks stricken and concerned. Among the voters, “Sarkozy responds to a demand for authority” in a “very tense, dangerous situation,” Mr. Grunberg said. “He’s decided to go very far to the right. And Juppé hasn’t said anything, though now he is beginning to speak. ” Whether Mr. Juppé’s “tranquillity” in the face of the threat can sway voters  —   Mr. Grunberg believes it might  —   is an open question. Mr. Sarkozy, he pointed out, remains unpopular with a broad portion of the electorate.'"}, "time": 1742628600.0726347}