{"duration": 0.13562273979187012, "input_args": {"text": "'DANVILLE, Pa.  —   The Geisinger Health Plan, run by one of the nation’s   health care organizations, foresees medical costs increasing next year by 7. 5 percent for people buying insurance under the Affordable Care Act. So when Geisinger requested a rate increase of 40 percent for 2017, consumer advocates were amazed. And Kurt J. Wrobel, Geisinger’s chief actuary, found himself, along with other members of his profession, in the middle of the health care wars still raging in this political year. Actuaries normally toil far from the limelight, anonymous technicians stereotyped as dull and boring. But as they crunch the numbers for their Affordable Care Act business, their calculations are feeding a roaring national debate over insurance premiums, widely used to gauge the success of President Obama’s health care law. Health plans around the country have just filed proposed rates for 2017. State insurance commissioners are still reviewing them. But questions about the proposed increases are reverberating through the health care system and into the political campaign. “Historical experience is the lifeblood of what we do,” Mr. Wrobel said, in an interview at Geisinger’s headquarters here. “We take that experience, adjust it for the underlying growth of health costs and project it into the future so we can estimate the expected costs for a particular insurance policy. ” Such niceties may be lost in this scorching campaign season. “There is panic and anger as health care costs explode!” Donald J. Trump, the presumptive Republican presidential nominee, wrote in a recent Twitter post, seizing on increases of nearly 60 percent sought by Blue Cross and Blue Shield of Texas. Obama administration officials are more sanguine. Consumers, they say, should not worry. Proposed rate increases are often reduced by state officials. Federal subsidies will generally rise along with premiums, offsetting much of the additional costs, and consumers can, in any event, switch to cheaper health plans next year. But as they prepare for the fourth year of coverage under the Affordable Care Act, many insurers are struggling to find the best ways of providing care to their new customers. The giant UnitedHealth Group, having lost money on individual policies under the federal health law, is pulling out of many insurance exchanges next year. A number of health insurance cooperatives created under the law have shut down. Geisinger is different. During debate on the 2010 health care law, Mr. Obama and members of Congress repeatedly hailed it as a model providing “  care at costs well below average,” in the president’s words. Geisinger serves residents of rural central and northeast Pennsylvania, and its roots in the community are as deep as the coal mines that once flourished here. Dr. David T. Feinberg, the president and chief executive of the Geisinger Health System, said its health plan was losing $30 million a year on coverage sold on the federal exchange in Pennsylvania. But leaving the market here would be unthinkable. “For its shareholders, United made the right decision,” Dr. Feinberg said, “but we don’t answer to shareholders. We answer to the nice people of Danville, Shamokin and Bloomsburg. ” It would be difficult to find a health plan more aligned with the goals of the federal law. The Obama administration recruited a former chief executive of the Geisinger Health Plan, Dr. Richard J. Gilfillan, to be the first director of the Center for Medicare and Medicaid Innovation, created by the health law to test ways to improve care and cut costs. Geisinger has been a pioneer in the use of electronic health records and genomic medicine, recruiting 100, 000 patients for DNA sequencing studies in the last two years. It has embraced “pay for performance,” offering a warranty for major surgical procedures and promising not to charge extra if complications occur. But innovation has been no match for the actuarial surprises dealt out by the Affordable Care Act. Mr. Wrobel said Geisinger had simply underestimated how much care its new customers would need. “Our rates for Medicare, Medicaid and   insurance have been relatively stable, but those products have to bear the cost of our losses on exchange business,” Mr. Wrobel said. Last October the Pennsylvania Insurance Department, headed by a former Obama administration official, approved a 20 percent increase in Geisinger’s rates, about half of what the company had requested. “But based on experience,” Mr. Wrobel said, “the 2016 premium rate is too low, so we want to correct it in 2017. ” Julia T. Philips, an   actuary who worked 19 years for the state of Minnesota, said insurance regulators generally do not let a company make up for past losses with future rate increases. “But regulators often allow companies to catch up,” she said. “If you assumed that claims would average $400 per member per month in 2015 and the actual cost was $440, you can use the higher number as a starting point in predicting claims costs for 2017. ” Obama administration officials suggest that insurance companies seeking big rate increases have been slow to adapt to the new law. But Geisinger executives welcome innovation, and they have celebrated the reduction in the number of uninsured under the Affordable Care Act. Geisinger is not alone. The Pennsylvania Insurance Department says insurers have proposed premium increases averaging 23. 6 percent for individual coverage for 2017. “People with   conditions are now getting treatment,” said Antoinette Kraus, the director of a statewide consumer group, the Pennsylvania Health Access Network, “and it’s more expensive because they were shut out of the market for many years. ” But, she added, “we expect that they’ll eventually become healthier, so we won’t see these huge rate increases every year. ” Kevin J. Counihan, the chief executive of the federal insurance marketplace, acknowledged that “  demand for health care is greater than people expected and is lasting longer than expected. ” In April, before most insurers had filed their rate requests for 2017, the Obama administration began a campaign to play down their significance. “Proposed rates aren’t what consumers pay,” the Department of Health and Human Services said. “Most people receive tax credits and can buy a plan for less than $75 per month. ” Moreover, the administration says that the health law created a competitive market in which consumers can shop for the best deal. As evidence that this market is working, the administration boasts that more than 40 percent of returning consumers switched to different plans for 2016. However, Mr. Wrobel said, such turnover is making it more difficult for insurers to predict costs. “The whole point of what we do, the foundation of good health insurance,” he said, “is to develop   relationships with our members and to make   investments in their health. It’s not like buying a book on Amazon. ” Besides, he said, substantial numbers of consumers do not receive subsidies. The Congressional Budget Office estimates that 12 million people will receive subsidies, in the form of tax credits, next year. But it says that an equal number  —   three million on the exchanges and nine million buying insurance outside the exchanges  —   will have to pay the full unsubsidized price. “When we developed rates for 2014,” Mr. Wrobel said, “we had no historical data. It was basically an educated guess. ” Mr. Wrobel said rates were still being affected by a federal policy, adopted in late 2013, that allowed some people to keep and renew insurance that did not meet standards in the Affordable Care Act. “Healthier people chose to keep their plans,” he said, “so the collective cost of care for people buying insurance on the exchange was higher than expected. ” Many insurers hope to profit from the Affordable Care Act, but for Geisinger, the calculus is a little different. “Geisinger has been here for 100 years, and we expect to be here another hundred,” Mr. Wrobel said. “We are going to be taking care of the people in this community one way or another. So it’s really important for this program to be financially stable and sustainable. ”'"}, "time": 1742564437.7697055}