{"duration": 0.06532120704650879, "input_args": {"text": "'Good morning.  Here’s what you need to know: •   Donald J. Trump’s latest picks for top posts offer more evidence of a tough approach to national security and the   of crucial ties with Beijing. Gen. John F. Kelly, a retired   Marine General, will be secretary of homeland security, and Gov. Terry Branstad of Iowa was named ambassador to China. Mr. Branstad has a long relationship with President Xi Jinping. Above, the two in 2012. Mr. Trump also selected Scott Pruitt, an ally of the fossil fuel industry and an architect of legal efforts to fight President Obama’s climate change policy, to run the Environmental Protection Agency. Here’s the latest on the transition. _____ • In a   telephone interview with a morning television news show, Mr. Trump said Mitt Romney remained a candidate for secretary of state and denied any responsibility for dividing the nation. Mr. Trump did not dispute the interviewer’s comparison of campaign promises to crack down on undocumented immigrants who kill and rape Americans to comments made by the Philippine president, Rodrigo Duterte, about annihilating drug dealers and users. Our photojournalist documented 57 homicides over 35 days in Mr. Duterte’s bloody crackdown. (Warning: graphic images.) _____ • In Indonesia, rescue teams are searching for survivors in the aftermath of a 6. 5 magnitude earthquake that struck the island of Sumatra. Nearly 100 people have been reported killed so far, many crushed in their homes as they slept. _____ • Rescue teams in Pakistan found no survivors among the wreckage of a   turboprop that crashed in the country’s north with 48 people on board. One of the passengers was Junaid Jamshed, a former pop star who became an Islamic proselytizer. _____ • “We are trapped under bombs. ” The Twitter account shared by a    girl in Aleppo, Bana   and her mother has captured global attention with posts about bombs, death and despair. It has also raised questions about authenticity. Syrian government forces appear to be pushing deeper into the city. _____ • European antitrust regulators fined Crédit Agricole, HSBC and JPMorgan Chase a total of just over 485 million euros for colluding to fix benchmark interest rates tied to the euro. • China will announce its balance of trade figures for November. Both imports and exports declined in October. • Britain’s investigation into the pound’s “flash crash” in October is focusing on the rapid succession of sell orders made by Citigroup in Japan, The Financial Times reported. • Some Vietnamese who fled their country during its Communist takeover are returning for its vibrant   environment. • Google says its global network of 13 data centers, each one containing hundreds of thousands of computers, will be entirely powered by wind farms and solar panels by sometime next year. • U. S. stocks jumped to their biggest gains since early November. Here’s a snapshot of global markets. • Thailand is investigating the BBC’s Thai language service for defamation over a profile of the new king. [The Guardian] • Cricket plans to introduce red cards that allow umpires to eject players for aggression and bad behavior, the first time the sport has used any form of   penalties. [The New York Times] • India’s Cho Ramaswamy, an actor, playwright and   journalist known for his staunch defense of a free press, died at 82. [The Hindu] • Over 30 percent of children in the slums of Bangladesh’s capital work over 60 hours each week in the garment sector. [Reuters] • “I just wanted to do some good and went about it the wrong way,” the gunman arrested at a pizzeria in Washington on Sunday told our reporter, discussing his plan to investigate false reports he read online that claimed the pizzeria was at the center of a child sex slave ring. [The New York Times] • Julian Assange, the WikiLeaks founder, maintained his innocence against rape allegations and accused the Swedish and British governments of “cruel, inhumane and degrading treatment. ” [The New York Times] • Saudi Arabia issued death sentences for 15 men accused of spying for Iran in a trial denounced by rights groups. [The New York Times] • In the   conflict, Facebook finds itself caught between free speech and incitement. [The New York Times] • Muay Thai, the Southeast Asian combat sport, and cheerleading were recognized by the International Olympic Committee, a move that provides $25, 000 annually to the sports’ governing bodies and opens the way for them to apply for inclusion in the Games. • Matt Damon is courting controversy, playing a British mercenary in “The Great Wall,” which aims to be China’s first   blockbuster. • And the film critics of The New York Times  —   Manohla Dargis, A. O. Scott and Stephen Holden  —   share their picks for the best movies of the year. • Tasmania, London, Lagos: seven accomplished writers took us inside their favorite bookstores. Our latest 360 video features a bookshop in Portugal popular with Harry Potter fans. If you look at bank notes across the world, you most often see portraits of men. But images of women are beginning to proliferate. This year, the U. S. said it would put the abolitionist and former slave Harriet Tubman on the $20 bill. Argentina added a female guerrilla leader who fought Spanish colonialists on its new 10 peso note. Colombia honored a female painter and an anthropologist. New Swedish bank notes show the  actress Greta Garbo and the Wagnerian soprano Birgit Nilsson. And Scotland selected the novelist Nan Shepherd and Mary Somerville, a trailblazing scientist. Poland, in a less timely choice, selected Dobrawa, a 10th century Bohemian princess credited with bringing Christianity to her people, for a commemorative note. Today, Canada will announce the first woman to be featured solo on a bank note other than royalty. A survey conducted in May suggested that Nellie McClung, a women’s rights activist, was the most popular choice, but she is not among the five finalists. The Toronto Star is rooting for Emily Pauline Johnson, who celebrated her Mohawk heritage in her poetry. Its editorial, invoking Ms. Johnson’s aboriginal name, concludes: “Ideally, all these women should be featured on bank notes. But if it must be just one, we vote for Tekahionwake. ” Patrick Boehler contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742628585.9405446}