{"duration": 0.25397419929504395, "input_args": {"text": "'His newest showstopper, a   hotel near Miami, has three pools, a   spa and eight restaurants, including a seriously upscale steakhouse. That electric blue sculpture in the lobby? You’d swear it was by Jeff Koons. Over near Orlando, work has started on his $800 million family resort, which will include a   water park and 1, 200 homes priced at up to $1 million apiece. His company, which had $1. 5 billion in sales last year, is introducing a line of jewelry. He has one of America’s   craft beers. A team  —   led by a former Google executive  —   is working to transform his digital media business. The man is Jimmy Buffett. And it’s time to toss whatever you thought you knew about his lazy, hazy Margaritaville out the window. Forget the ville. This is a Margarita World. “People are always shocked when they find out how big we’ve gotten,” Mr. Buffett said recently over lunch, grinning and splashing Tabasco on a modified Cobb salad. “We just kept quietly doing our thing. Not saying much. And now  —   bam!  —   here we are. ” Margaritaville, with its themed restaurants (erupting volcanoes,   booths) started as a tropical cousin to T. G. I. Friday’s. Through trial and error, Mr. Buffett and a partner, John Cohlan, have since expanded Margaritaville Holdings to include four booming divisions: lodging, alcohol, licensing and media. Now, as they pursue growth for the first time overseas, where Mr. Buffett has a much softer fan base, they are trying to recast Margaritaville as a broad, aspirational brand  —   the Ralph Lauren of leisurely escape, if you will. “The stroke of genius was making Margaritaville a feeling, not a place,” said Mindy Grossman, the chief executive of the   behemoths HSN and Frontgate, where   Margaritaville items include a $799 hammock and $159 penny loafers. “If you don’t take the name so literally, growth could be endless. ” Endless? “O. K. not endless,” Ms. Grossman said. “I wouldn’t suggest doing fake fur coats. But almost. ” Mr. Buffett, patron saint of the untroubled, has long been known for his business acumen. In some ways, with his approach to concert merchandise and tour sponsorship in the 1980s, he created the model of    that managers for artists like Madonna and Dave Matthews have pursued more recently. Other singers have parlayed their personas into business empires  —   Dolly Parton, for instance, with her Dollywood theme park, Dixie Stampede dinner theaters, Dolly slot machines and “Coat of Many Colors” merchandise  —   but none are as singularly sprawling as Mr. Buffett’s Margaritaville. “He understands his brand, which has a substantial reach,” Warren E. Buffett, a friend (but not a relative) said by phone. “One of the secrets to his success is that he never really loses any fans. ” Still, a thriving brand needs to steadily recruit new devotees, and that may be Margaritaville’s biggest challenge. While Mr. Buffett’s fan base includes young people  —   drunkenly singing along to “Margaritaville” in a college bar is practically an American rite of passage  —   his core followers are baby boomers. How does Margaritaville make itself more relevant to people in their 30s? What fuels sales of those licensed products once Mr. Buffett, 69, has warbled his last warble? It’s a subject that Mr. Cohlan, who is Margaritaville’s chief executive, was not especially keen to discuss. Asked about how the company thinks about a future without its public face, Mr. Cohlan said, “Jimmy Buffett is an American treasure,” and changed the subject. A more robust media presence beyond Mr. Buffett seems to be one answer. Last year, Mr. Cohlan expanded the company’s digital media efforts, which already included a SiriusXM satellite radio channel. He hired Laura Lee from the Google ranks, where she was a senior executive at YouTube, and charged her with building a digital content studio, improving Margaritaville’s social media presence and introducing mobile games. (One casual game coming in July will have users searching for their lost shaker of salt.) The goal is a fully formed ecosystem. Last year, an estimated 15 million people ate at one of Mr. Buffett’s 67 restaurants or stayed at one of his seven hotels and   resorts. The company also wants the masses to buy Margaritaville food at their local grocery store (items like iced tea, frozen shrimp and tortilla chips are already on shelves) watch   videos on their phones (“The Best Beach Bars of the Caribbean” is one idea in development) and maybe even sleep on Margaritaville bedsheets (in various designs, including “Strawberry Daiquiri” coral, starting at $19. 98). Ms. Lee’s efforts could also lead to more traditional TV programming. A model is Vice Media, which began as a   video company and went on to sprout an HBO series and Viceland, a   cable channel. Not by coincidence, Margaritaville in 2014 sold a minority stake to the Raine Group, a merchant bank known for its investment in Vice and ties to the William Morris Endeavor talent agency. “The international opportunity for the Margaritaville ecosystem is really exciting,” said Joe Ravitch, Raine’s  . Mr. Buffett and Mr. Cohlan are   of the rest of Margaritaville. In success, could Margaritaville be a candidate for a public offering? “The brand isn’t yet for everybody,” said the political polling expert Douglas E. Schoen, who has conducted extensive consumer research for Margaritaville. “It’s not for me, and it’s not for most journalists. But it’s much, much bigger than I initially thought. ” Mr. Schoen added, “It has the potential to be a major global brand. ” To understand the evolving Margaritaville, consider the   Margaritaville Hollywood Beach Resort (that’s Hollywood, Fla.) which cost $190 million to build and held its grand opening in November. Relying almost entirely on word of mouth, the hotel has reached an occupancy rate of 93 percent, the lodging equivalent of a smash hit. Euphoric Margaritaville executives estimate that Parrot Heads, as Mr. Buffett’s   fans are known, make up less than 50 percent of the bookings: The hotel is attracting people that Mr. Buffett was probably not reaching before. “I personally sweated every freaking detail of this place for eight years,” said a beaming Mr. Cohlan in March, as he held court in the hotel’s   lobby, which is accented with palm trees and a lime green and turquoise carpet. “Hey! Good to see you!” he hollered to an employee as she stopped to tell him how proud she was to work at the hotel. “Thank you, doll,” he said. “That means the world. ” Located about 40 minutes north of Miami Beach, Hollywood is still Old Florida, land of grim souvenir shops, jai alai courts and   cinder block motels. And some residents worried that Mr. Buffett’s arrival would make it worse. “We don’t need people being wasted away in Margaritaville,” Audrey Joynt, a past president of the Hollywood Beach Business Association, told The Miami Herald in 2010, as Mr. Cohlan was pushing city managers to approve the project. But Margaritaville surprised critics by building a quite upscale resort. Envisioning a hotel sound system that blares “Cheeseburger in Paradise” until you want to lose your mind? Think again. Mr. Buffett’s songs play very sparingly. In fact, his persona often seems a half step removed. Rooms, decorated with white shutters, aqua blue accents and hardwood floors, start at nearly $300 and go up to $1, 800 for oceanfront suites. The steakhouse, JWB Prime Steak and Seafood, could hold its own in Manhattan. “Hotel companies always make the same mistake when the budget gets tight at the end of a project,” Mr. Cohlan said. “The last coat of paint gets cut. But guess what? That’s what your guests see. ” Pat McBride, whose McBride Company designed the hotel, noted the   lobby chandelier, made from dozens of   margarita glasses. “It looks almost like Lalique,” he said by phone. Go ahead and roll your eyes. But see it and you realize that he was kind of right. There is a boozy,  ’  ’ clientele, for sure. But there are also men and women in business suits  —   the hotel has 30, 000 square feet of meeting space  —   and guests like Lynn and Pam Wilken, visitors in their 50s from Ashkum, Ill. where they farm soybeans and run a candle business. “We don’t follow Jimmy Buffett’s music, but his name gave me comfort about booking a hotel online that we didn’t know anything about,” Mrs. Wilken said, as she lounged poolside with her husband. The couple, finishing a weeklong stay at the resort, vowed to come back, despite a caveat or two. “You don’t want to wander too far down the beach, particularly at night, but that’s fine with us. ” Mr. Wilken added: “It’s hard to put your finger on, but there is something authentic about this place. It doesn’t feel forced on you. ” That may be the biggest compliment of all. For a   lifestyle brand to flourish, it cannot feel as if it was created by a corporate focus group. That genuineness is a difficult trick to pull off, as hotel giants like Marriott and Hyatt have learned with their attempts to build   boutique chains like Edition and Andaz. “We somehow got it right,” Mr. Buffett said of the Hollywood property. “Thank you, Baby Jesus and John Cohlan. ” Fittingly, the Margaritaville empire started with a nap. The year was 1996, and Mr. Cohlan, then working for the corporate raider Nelson Peltz, known for targeting companies like Snapple and Arby’s, had gotten to know Mr. Buffett’s wife, Jane, on the Palm Beach, Fla. society circuit. One day, Mr. Cohlan turned up at the Buffetts’ home to talk about the potential growth of Margaritaville, which was then just a popular song  —   released in 1977, it peaked at No. 8 on the pop charts  —   and a   chainlet. But the singer was asleep. “Had it not been for Jane, who went to wake Jimmy up, this extremely successful partnership might not have happened,” said Richard Plepler, the chief executive of HBO, who knows both men. Asked about this anecdote, Mr. Buffett smiled sheepishly and said: “I do like a good nap. That’s true. ” Mr. Buffett opened his first Margaritaville restaurant in 1987 in Key West, Fla. It found instant success  —   so much, in fact, that he opened a second location in New Orleans in 1993. But the sequel was a relative dud, and Mr. Buffett applied the brakes, rebuffing an offer from the Walt Disney Company to build a lavishly themed Margaritaville at a Walt Disney World shopping mall. Enter Mr. Cohlan. He had recently experienced the Parrot Head phenomenon for himself  —   their wild tropical clothing, their endless tailgating  —   and had an epiphany. “All I really knew before I went to that concert was that girls would put on halter tops and play his songs when the weather turned nice,” he said. “When I saw him perform, I said to myself, ‘Whoa. Holy   . This is a brand. ’” Mr. Buffett took on Mr. Cohlan as a partner, and together they began to expand Margaritaville, beginning at the Universal Orlando Resort, which at that time was owned by Seagram. Mr. Buffett recalled how he told Seagram during negotiations that he had one final request: “Can you just tilt that bridge a little so that people leaving your park literally roll into the front doors of my restaurant?” Mr. Cohlan and Mr. Buffett cracked up recalling the look on the Seagram team’s face. Just before the Orlando opening, Mr. Cohlan played hardball with Seagram over a liquor matter and inadvertently started a new line of business. Seagram, which also owned Mr. Buffett’s record company then, had introduced Parrot Bay rum, which Mr. Buffett felt   his band’s Parrot Head imagery. Mr. Cohlan  —   quite seriously, this time  —   told Seagram that Margaritaville would boycott its alcohol. In a matter of weeks, Margaritaville had its own tequila and beer brand. The theme park Margaritaville has been a runaway hit since opening in 1999. Last year, according to Mr. Cohlan, the restaurant generated about $22 million in sales. Something about Mr. Buffett’s mellow, unchallenging persona seems to make parents feel O. K. about tying one on with their children in tow. “Believe me,” Mr. Buffett said, “I didn’t know I was going to end up as family entertainment, either. ” Not everything has gone Margaritaville’s way. For starters, that early beer, Lone Palm Lager, named after one of Mr. Buffett’s songs, did not sell as they had hoped. “We only found out later, after we did consumer research to figure out what was going on, that the name bummed people out because it made them think about drinking alone,” Mr. Cohlan said. They renamed it LandShark Lager, a nod to Mr. Buffett’s song “Fins. ”  : Sales started to take off. The company’s first resort, a planned $700 million casino and hotel in Biloxi, Miss. was delayed by the   economic collapse. Margaritaville eventually opened a much smaller hotel in Biloxi, but it went belly up, perhaps because the company picked a bad location. This month Mr. Cohlan announced a third attempt, set to open later this year. This time, there will be more of a family focus, and no casino. Eight more Margaritaville hotels, including one in Grand Cayman, are in various stages of development. Margaritaville’s signature restaurant chain is expanding quickly  —   it will soon push into California for the first time, opening at Universal Studios Hollywood  —   but a spinoff series of restaurants in the Midwest called Cheeseburger in Paradise has struggled. Margaritaville sold its Cheeseburger stake in 2005 and, since then, roughly half the locations have closed as the brand was lobbed between owners. Still, Margaritaville has mostly had smooth sailing, building a unique corporate culture  —   employees all use the same valediction in emails: “Fins Up!”  —   and drawing fanatic customers like Carol and Butch Wayland, who live in St. Catharines, Ontario. The Waylands, who own a trade school, have made it their mission to visit as many Margaritaville outposts as possible in May they plan to try their first Margaritaville at Sea, a new offering by Norwegian Cruise Line. “We’re not Parrot Heads,” Mrs. Wayland said. “We’re just normal, everyday people who happen to be residents of the Margaritaville state of mind. ” Mrs. Wayland, who is in her 50s, added that she had “spent a fortune” on Margaritaville products, including hats,   dress shirts, shorts, clocks, coffee mugs, barware, a blender and underwear. They also have a framed photograph of themselves popping out of a    Jacuzzi, snapped at a Margaritaville location in the Caribbean. If all of this sounds like maybe Mrs. Wayland sometimes has one margarita too many, she wouldn’t entirely disagree. “That too!” she said. “I once fell off a bar stool at the Margaritaville in Turks and Caicos and landed right in the water. Kerplop. ”'"}, "time": 1742562208.287297}