{"duration": 1.2256791591644287, "input_args": {"text": "\"More Americans Than Ever Are Losing Their Religion By Michael Snyder, on August 25th, 2016 \\nNever before in U.S. history have so many Americans chosen to be unaffiliated with any particular religious group. As you will see below, the percentage of “nones” in this country has absolutely skyrocketed over the past decade. But not all faiths are losing members in the United States. In fact, Islam, Buddhism, Wicca and various New Age organizations have all experienced excellent growth in recent years. Sadly, almost all of the growth for the “nones” has come at the expense of Christianity. Americans are leaving the Christian faith in droves, and this is why many of our churches are less than half full on Sunday mornings. What we are doing right now is clearly not working, and hopefully we can get the church in America to wake up while there is still time to do so. \\nEarlier today I came across a brand new study from the Pew Research Center entitled “ Why America’s ‘nones’ left religion behind “. One thing that particularly stood out to me was the fact that most “nones” were once affiliated with a particular religion but have now discarded that label… \\nPerhaps the most striking trend in American religion in recent years has been the growing percentage of adults who do not identify with a religious group . And the vast majority of these religious “nones” (78%) say they were raised as a member of a particular religion before shedding their religious identity in adulthood. \\nOverall, the percentage of “nones” in this nation has been absolutely soaring in recent years. Back in 2007, “nones” made up 16 percent of the population, but now that number has risen to 23 percent. The following is from a different Pew Research Center report that was published last year … \\nReligious “nones” – a shorthand we use to refer to people who self-identify as atheists or agnostics, as well as those who say their religion is “nothing in particular” – now make up roughly 23% of the U.S. adult population. This is a stark increase from 2007, the last time a similar Pew Research study was conducted, when 16% of Americans were “nones.” ( During this same time period, Christians have fallen from 78% to 71%. ) \\nI want you to notice one particularly sobering fact in the excerpt posted above. The seven percent increase in the percentage of “nones” was matched exactly by a seven percent decrease in the percentage of Christians. \\nIt is time to face a very hard truth – Christianity is in rapid decline in America. \\nSo why is this happening? \\nIs there an explanation for why so many people are leaving the church? \\nWell, here is some of the feedback that the Pew Research Center received while conducting their new survey… \\nAbout half of current religious “nones” who were raised in a religion (49%) indicate that a lack of belief led them to move away from religion. This includes many respondents who mention “science” as the reason they do not believe in religious teachings, including one who said “ I’m a scientist now, and I don’t believe in miracles .” Others reference “ common sense ,” “ logic ” or a “ lack of evidence ” – or simply say they do not believe in God. \\nThis is such a tragedy, because during my decades of research into these things I have found that logic and reason should always point people toward the Christian faith and not away from it. There is an absolutely gigantic   for Christianity out there, but unfortunately most people don’t know about it or they are not interested in considering it. \\nThe biggest cultural shift has been happening among our young people. Most of them have been raised in an environment where God has been removed from almost every corner of public life, and the results have been beyond catastrophic. \\nIn America today, 35 percent of all Millennials are “nones”. \\nMillennials are more than twice as likely to be “nones” as Baby Boomers (17 percent), and they are more than three times as likely to be “nones” as the Silent Generation (11 percent). \\nIn other words, the younger you are the more likely you are to be religiously unaffiliated. \\nAnd this shows up in the church attendance numbers as well. Millennials are much, much less likely to be in church on any particular Sunday morning than the oldest Americans are. The following information comes from another Pew Research Center report … \\nMillennials – especially the youngest Millennials, who have entered adulthood since the first Landscape Study was conducted – are far less religious than their elders. For example, only 27% of Millennials say they attend religious services on a weekly basis, compared with 51% of adults in the Silent generation . Four-in-ten of the youngest Millennials say they pray every day, compared with six-in-ten Baby Boomers and two-thirds of members of the Silent generation. Only about half of Millennials say they believe in God with absolute certainty, compared with seven-in-ten Americans in the Silent and Baby Boom cohorts. And only about four-in-ten Millennials say religion is very important in their lives, compared with more than half in the older generational cohorts. \\nWe are slowly losing an entire generation. \\nWhen you walk into most churches in America on Sunday morning, what are you going to find? \\nYou are going to find that the congregation is dominated by “the greys”, and I am not talking about space aliens. \\nAs the oldest Americans die off, the United States is becoming less and less Christian. We are on the exact same path that Europe has already gone down, but most churches are just going on with business as usual and don’t seem to even understand that we have a major crisis on our hands. \\nAs I said at the top of this article, what we are doing right now is clearly not working, and if we continue on the path that we are currently on we will continue to lose young people by the millions. \\nAmerica needs revival more than it has ever needed it before. \\nLet us pray that one arrives very soon. There Is A Mainstream Media Conspiracy To Hide Hillary Clinton’s Rapidly Failing Health » Grillsgt. \\nAnd then there are those who realized virtually all churches in their area are either preaching heresy, or are downright apostate. Mke \\nOr they are so watered down and user-friendly that you feel like you wasted a good part of your Sunday when you leave. I’m amazed at most churches I go into these days. Not a lot of comprehensive, honest Bible-teaching going on. That’s why people are walking away. Sure, some will walk away when you boldly teach the Bible, but that’s the way it is supposed to be. iris \\nYes, people need truth. Can the church growth models! Preach the gospel. If church leaders won’t do it, that’s their problem, we can share Christ every day with those we come in contact with, by word and deed. I’m glad we’re in a congregation where it is shared every week. PoorBoy2 \\nCould it be that all of these years of focusing on “Religion” and do’s and don’t’s instead of relationship with the one true God is bearing fruit? Though ritual and tradition can be meaningful and helpful, without relationship they are dead and empty leading to “nones”. Mike \\nI’d say it’s more related to greasy grace, once saved always saved no matter how backslidden you are, and “we don’t want to offend anybody” type teaching going on. Most of the teaching on the radio and in the churches is weak. Paul Patriot \\nSo, do you think someone can lose their salvation based on works Can one obtain salvation by works \\nIf someone is a backsliding “Christian” then I concur that they were never really saved. \\nReference the parable of the sower and this will reveal the wheat and tares sitting next to one another in churches across this world. \\nIf Jesus does not have the power to truly save you and by your actions you can lose that salvation, then his work on Calvary was not as great as the Bible says it was…….he is either the Savior or he is not, and a saved person will act a certain way, and not backside back into the pig pen, thus revealing their false conversion. \\nJust sayin…….I agree with you most teaching today is weak, there is no more preaching of he’ll and no more preaching that unless you are born again, you will not be saved…and that Jesus is the ONLY name j Der heaven in which we can be saved. algol2000 \\nThe righteousness of Jesus is for Jesus. Work out your own by following in his footsteps. iris \\nSo very true! When Christians realize that it is His righteousness living in, guiding and empowering us, sanctifying us, redeeming us, we humbly and gratefully, submit to His leading in hope, peace and joy. We boast in Him, not in ourselves or our ability to do good, and have that blessed assurance. He is our confidence and our worth is in Him. We cling to what He has accomplished for us on the Cross, and even more, in what He is doing in our lives by God’s Holy Spirit. 1Corinthians 1:30-31. Grillsgt. \\n“8 For by grace you have been saved through faith, and that not of yourselves; it is the gift of God, 9 not of works, lest anyone should boast.” Eph. 2:8-9 algol2000 \\nThe watering down, so to speak is in these very words, and has led to the blatant apostasy that you are witnessing. The grace that Jesus provides is so that God can be patient while you bring forth the fruits (works) required for sonship. Grillsgt. \\nA works-based salvation?? Seriously?? Do you also believe that one can lose their salvation? Not trying to sound snarky, but just asking about your views. watchmannonthewall \\nWhy would Jesus speak about blotting a persons name out of the Book of Life if it is an empty threat? Wouldn’t He be guilty of atempted manipulation, deception, if one really can’t be blotted out? of course the writer of Hebrews refers to this in Hebrews 6:4-6 and again in 10:26-31. \\nKorah is a prime example in the OT, having seen all of God’s miracles and even been choosen to minister for God as Levite yet he rebelled and fire came out from God and the earth opened to receive him. The fire and opening of the earth is just a concealed OT way of indicating he went to the Lake of Fire for his rebellion! \\nOnce saved always saved is another false doctrine that has made many feel comfortable in their sin! But Jesus said, “Depart from me you workers of lawlessness.” This was to people convinced they knew Him, but He said He didn’t know them! We need to make sure He knows us and this means, by definition, we walk in a “Lawful” manner! algol2000 \\nA work-based salvation is what Jesus taught. “Except your righteousness shall exceed the righteousness of the pharisees and the pharisees, ye shall in no wise see the kingdom of heaven”. “Be ye perfect (in deeds) just as your heavenly father is perfect”. \\nOn this earth, deeds are the basis for judgement in an earthly court, how much more so in heaven? Without laws to govern conduct, there can be no sin. Sin is the transgression of the law. And law-breakers will be punished by the Judge. watchmannonthewall \\nCan we take a look at scripture to see how well the statement you quoted, made by Paul, aligns itself to all of scripture? \\nGod says in Isaiah 46:10 that He declares the end from the beginning. Let’s go to “the End”, work our way back to “the Beginning”, and see what God says in His Word, OK? \\nRev. 20:13- “And the sea gave up the dead which were in it, and death and Hades gave up the dead which were in them; and they were judged, every one of the according to THEIR DEEDS [works].” This is speaking only of those who are “lost”. What about the “saved”? \\nRev. 14:13- “And I heard a voice from heaven, saying, ‘Write’, “Blessed are the dead who die in the Lord from now on!” “Yes” says the Spirit, “that they may rest from their labor, for their DEEDS [works] follow with them.” \\nThe book of Revelation indicates the works by both saints and the wicked are noticed by God. See also in the message to each of the seven churches in Revelation 2-3, John records Jesus as claiming, “I know thy works…” Clearly Jesus considers “works” in His assessment of His people! \\nJames, the brother of Jesus, had this to say about works (James 2:14-24): “What use is it brethren, if a man says he has faith, BUT he has no works? Can that [workless] faith save him?”…”Even so faith, if it has no works, is DEAD being by itself.”…Was not Abraham our father justified by works, when he offered up Isaac his son? You see that faith was working with his works, and as a result of THE WORKS, faith was perfected…You see that a man is justified by works, and NOT by faith ALONE.” James states works are a necessary addition to faith. What does Paul say? \\nIn Paul’s pastoral epistle to Titus, he writes the following (3:8): “This is a trustworthy statement; and concerning these things I want you to speak confidently so that those who have believed God [those who have faith] may be careful to engage in good DEEDS.” \\nIn his letter to Timothy (1 Tim. 6:17-18) Paul tells Timothy, “Instruct those who are rich in this present world not to be conceited or to fix their hope on the uncertainty of riches, but on God who richly supplies us with all things to enjoy. Instruct them to do good [deeds], to be rich in good WORKS, to be generous and ready to share…” Again, Paul speaks about putting feet to one’s faith! \\nJust two verses after the one you quote in Ephesians above, Paul writes (v.10), “For we are His [the Father’s] workmanship created in Christ Jesus FOR good works, which God prepared beforehand , that we should walk in them.” God obviously expects His people to “do” good works, having prepared these ahead of time for them! \\nJesus said the following concerning “works”: “For the Son of Man is going to come in the glory of His Father with His angels; and will then recompense every man ACCORDING TO HIS DEEDS.” (Mt. 16:27) Note that this specifically occurs with regard to the return of Christ and applies to His people, those who are “saved”! Jesus also said we are to let our light shine before men so they see our “good works” and glorify His Father. (Mt. 5:16) You see Paul agreed with Jesus’ teaching concerning His expectation of His people to perform “good works” and says they will be rewarded in the kingdom according to these. \\nSo what are these “good works”? Lots of debate about this, but not surprisingly, scripture clearly identifies these. It is just that people don’t want to accept what God said that they tend to ignore His Words! \\nPaul tells us in 1 Timothy 3:16-17, “ALL Scripture is given by inspiration of God and is profitable for doctrine, for REPROOF, for CORRECTION, for TRAINING IN RIGHTEOUSNESS [traininng in the performance of “good works”],that the man of God may be adequate, and EQUIPPED for every good work”. \\nPaul says Scripture, OT and NT(and understand the NT wasn’t written when Paul wrote this to Timothy and Paul never claimed his letters were scripture as the Gentile “Church” made this claim many years later), is the source of instruction to identify and instruct us in the performance of “good works”. Paul just got done speaking to Timothy, in the prior two verses, about how he had known the “scriptures” from childhood. When Timothy was a child, none of the NT had been written! Not one word! Paul therefore told Timothy and US the OT contains the instructions regarding what God considers good works and how they are to be performed. We already have looked at the fact we will all be judged on how well we obey God’s instructions in this matter! \\nWe see the NT, John, James, Paul , Jesus, all teach people, saved and unsaved , will be judged by their works. Where does “faith” enter the outcome? If one has saving faith, as James said Abraham did as evidenced by his obedience to God’s instructions, we will be obedient to God’s Word. Note James also says the devils “believe”, but we know they do NOT obey God’s instructions. How many of us are just like them? \\nIs being judged by our works just a NT expectation? James already used Abraham as an example to indicate it is not. Jeremiah (17:10) also says, “I, the LORD, search the heart, I test the mind, even to give to EVERY man according to his ways, according to the results of his DEEDS.” Adam and Eve were cast out of the Garden, according to their deeds! \\nThe “greasy grace” of today is one catalyst for the current malaise affecting the people’s relationship to God and/or the lack of relevance Christianity has for many. Many of today’s preachers don’t even know scripture says what I just shared, straight from scripture, with you! \\nWhen Jesus said he came to destroy the “works of the devil” He was referring to destroying rebellion against obedience to God by empowering His people to obey His Word through the indwelling Spirit! \\nUnfortunately, the devil has now got many believing that once you say the prayer of faith, you’ve done all you need to do to go to heaven, but Scripture doesn’t teach that , does it? It actually teaches your faith is to be able to be seen by your daily walk, your works as defined by God’s Word! Now you know!! Just do it! Grillsgt. \\nEphesians 2:10…” For we are His workmanship, created in Christ Jesus for good works, which God prepared beforehand that we should walk in them.” Notice Paul said, FOR good works, not by them. Also, Titus 3: 4-7…”4 But when the kindness and the love of God our Savior toward man appeared, 5 not by works of righteousness which we have done, but according to His mercy He saved us, through the washing of regeneration and renewing of the Holy Spirit, 6 whom He poured out on us abundantly through Jesus Christ our Savior, 7 that having been justified by His grace we should become heirs according to the hope of eternal life.” Now…does the Bible contradict itself, or could it be, one or more opinions of this subject might be mistaken? Grillsgt. \\nRight, PB2! There is a movement afoot to replace Christianity with “Churchianity”. AverGo \\nExciting, If you believe that God’s Word, Never Returns Void. Then couple that with, Bring up a Man in the Way he should go, then Later he will not depart from it. Then as the Endtimes become more undeniable, God will bring back the Prodigal sons and daughters. 2 Thessalonians 2:3 Let no man deceive you by any means: for that day shall not come, except there come a falling away first, and that man of sin be revealed, the son of perdition; watchmannonthewall \\nBoth Paul and Solomon spoke of the children of the last generation being very rebellious and full of pride. It is the mirror image of what happened at the Exodus. \\nThere it was the parents who did not believe God and obey Him, refused to go up and take the Land. Here, in this last generation, it is the children who have rebelled againt parents and Jeus even said the those of a man’s OWN household would be HIS worst enemies. \\nUnderstanding the passage, a paraphrase from Micah 7:6, the father, the man, is in the right and those opposing him are in the wrong! \\nJesus never taught opposition to parents any more than He taught opposition to the Father! Both are the Creators of others and Creators are to be honored and obeyed by the Created. 1st commandment and 5th commandment- Love God and others and parents are the first neighbors we are to love! K \\nWhich came first. People walking away from the Church? Or the Church walking away from real Godly teachings. Dale Graley \\nvery good point Ambassador 2Co 5:20 \\nA few years ago I was with a group of professed Christians who had this “as long as we believe in Jesus it doesn’t matter what else we believe” attitude. They were lamenting the dumbing down of America in our schools primarily but the dumbing down of culture in general as well. I asked them if they believed the USA was a Christian nation, now or in the past. They said yes to which I replied “you can’t dumb down a Christian nation unless you dumb down Christianity first.” As you can imagine that didn’t go over very well. \\nIsaiah 4:1 And in that day seven women shall take hold of one man, saying, We will eat our own bread, and wear our own apparel: only let us be called by thy name, to take away our reproach. \\nThat verse is a prophetic statement told in symbols, so those who don’t have eyes to see will not get it. Read the surrounding context and you can tell it’s about the end times. Anyway the symbol breakdown is this: \\nseven = completion or totality women = churches (bride of Christ) one man = Jesus bread = doctrine apparel = righteousness (white robes or filthy rags) \\nReread Isaiah 4:1 with the symbols decoded and it says “And in the day all the churches shall say to Jesus, we will teach our own ways, and present ourselves to the world in any manner we see fit: only let us be called Christians to take away our shame. OriginalRS \\nThe latter, most definitely. RageHard84 \\nDang. This question cuts to the point. I mean, there are churches which have abandoned sound doctrine and adopted heresies like serpent seed, the idea that homosexuality and transgenderism are promoted by the Bible when they’re really sins, it’s crazy. LowellST13 \\nThe government and the 501C3 tax exempt for Churches has dissolved sound doctrine. Churches have sold their soul to the devil, government, I get those two confused. I am fortunate to be part of an Independent Baptist Church that is sound in the KJV 1611 and if I have a problem with Sermon’s I look at the bible first and if it is there than it is my problem. I need to change, not THE CHURCH or the BIBLE THE BIBLE and how GOD Authored it is the same Yesterday, today, and forever AMEN David \\nrepenting is not enough. If you can’t forgive others for their trespasses against you or harbor hate & anger towards others then God can’t forgive you and you won’t make it into heaven. Joan Camara \\nCan I have hate and anger toward evil people? krinks \\nThe Church walking away from Godly teaching. When I was a young man in the early 70s I clearly recall very few politicians dared to proclaim their support for abortion. They feared the wrath of the Christian Vote. Only the far left Pelosi/Sanders type dared to proclaim such. Over time people stopped taking the Lord into the Voting Booth, emboldening the Perverts. Today rare is the politician that can get ahead by proclaiming Christian Principles. The DNC in hacked correspondence actually discussed the best way to get rid of Religious Liberty in America. Yet even at this most that call themselves Christians will vote for them. It is all I can do to not go to Church and cuss them all out for what they have allowed our nation to become. watchmannonthewall \\nK, great question! I’d like to give a shot as to the apex of the problem and answer a question Michael posed in his book, “The Rapture Verdict”, where he inquired if anyone knew what the “great apostacy” is, which Paul spoke of in 2 Thessalonians 2:3 saying, “Let no one in any way deceive you, for it [the Day of the LORD from verse 2] will not come unless the apostasy comes first [1] and the man of lawlessness is revealed [2], the son of destruction.” (NASB) We see there is first a great apostacy, which comes BEFORE the anti-christ and THEN the anti-christ is revealed (Michael pointed this out in his book). It agrees with Jesus’ timeline in Mt. 24:29-31 regarding the “gathering” of His saints! In fact, since the anti-christ is called “the man of lawlessness”, this should clue us in to the fact the “apostacy” is related to “lawlessness” increasing, a necessity to set the stage for the anti-christ, even as Jesus prophesied in Mt. 24:12. Recall, Jesus also said He did not know those who “PRACTICE lawlessness” in Mt. 7:23, even though these people were PERFORMING MIRACLES using His Name!! The KJV translates “apostacy” as “falling away” in 2 Thess. 2:3, and Strong’s says the term is used just twice in the NT: “Grk. #646- apostasia” and defines the term as “defection from truth”. The great end time apostacy is “defection from truth”. What is truth (Truth)?“All Thy commandments are Truth.” (Ps. 119:151) “Thy Law is Truth.” (Ps. 119:142)“Thy Word is Truth” according to Jesus (Jn. 17:17), and Jesus is “the Way, the Truth, and the Life “. (Jn. 14:6) Jesus also prayed for us saying, “Sanctify them by Thy Truth; Thy Word is Truth.” We, God’s people, are to be set apart from the world by “practicing” the Word of God, the Law, the Commandments, the Word of God, and Jesus! Using the substitution principle, we can define defection from Truth as a defection from God’s Commandments, His Law, His Word, and from Jesus. This should be easy to understand since present day Christian teaching has God’s Truth, His Law, His Word, and His Commandments as all put to death by Jesus Christ at the cross; of course, Jesus had to die since He is Truth also! Today’s Christianity, for the most part, worships ANOTHER resurrected Jesus, not the one of the NT! Can God’s Truth die…or is it forever? There are scriptures that say “No”, despite claims of portions of God’sWord passing away. In case one is not convinced, let’s look at two NT examples: The first is the murder of Stephen, called the first martyr of “the Church”, and the second is when Paul returns to Jerusalem after his third missionary journey to keep God’s Festival of Leviticus 23:15-21, Shavuot, or what we call Pentecost. Why was Stephen put to death? What does Scripture say?“And yet they were unable to cope with the wisdom and the Spirit with which he [Stephen] was speaking. Then they secretly induced men to say, ‘We have heard him speak blasphemous words against Moses and against God.’ And they stirred up the people, and the elders and the scribes, and they came upon him and dragged him away, and brought him before the council [the Sanhedrin].”“And they put forth FALSE witnesses who said, ‘This man incessently speaks against this holy place, and the Law [the Law of Moses- but they were FALSE witnesses, meaning he did NOT speak against EITHER the holy place OR against Moses]; for we have heard him say that this Jesus will destroy this place and altar the customs which Moses handed down to us [but they were FALSE witnesses- so Stephen never spoke against the customs MOSES handed down to them]'”. (Acts 6:10-14) Please note: “the Church” definitely believes the customs Moses handed down were changed, but if that were true, wouldn’t the FALSE witnesses actually be TRUE witnesses? Well? Let God be true and every man a liar! What was it they thought Moses had taught them, the customs, but which he never really did? It was the Jewish Oral Law which Jesus referenced in Mark 7:9 where He referred to it saying, “You nicely set aside the commandment of God in order to keep your tradition”! They had their own “traditions” which superceded God’s commandments, you know, sort of like how the Catholic church has its own traditions that are contrary to the Word of God, or how the Protestant Churches do the same. (See Romans 10:3 where Paul speaks of the same.) The second use of “apostasia” is found in Acts 21 and it actually gives us God’s definition of “apostacy”, if one will accept it! God loves to hide things in plain sight!“And when we [Paul and Luke, and others] had come to Jerusalem, the bretheren received us gladly. And now the following day Paul went in with us to James, and all the elders were present. And after he had greeted them, he begun to relate one by one the things God had done among the Gentiles through his ministry.”“And when they heard it they begn glorifying God; and they [the elders] said to him, ‘You see brother, how many thousands there are among the Jews of those who have believed, AND THEY ARE ALL ZEALOUS FOR THE LAW [the Truth!]; and they have been told about you that you are teachinig all the Jews among the Gentiles to forsake Moses [to GRK- “apostacize” Moses], telling them not to circumcise their children nor to walk according tot he customs.” (Acts 21:17-21) Note that the charges leveled against Paul are the same ones which Paul consented unto regarding the death of Stephen. It was about “the customs” of Moses. Paul did explain circumcision without a circumcised heart will not get you salvation before God. They didn’t much like that one, did they? God wants both, but especially the spiritual one! But that was one “custom” of Moses Paul taught against, the NT records these debates, but Moses never taught that! Moses said, “Circumcise therefore your heart and stiffen your neck no more.” (Deut. 10:16) And, “Yet to this day the LORD has not given you a heart to know, or eyes to see, nor ears to hear.” (Deut 29:4) Moses clearly taught God wanted a circumcised heart so they could understand God”s instructions! The Acts passage lets us know James, the brother of Jesus, and the elders were rejoicing that so many of their Judean brothers were finally living out the Mosaic Law the way God intended it to be lived, zealously! There is no hint of the idea that following the Mosaic Law is to be avoided here, is there? Also, James and the elders reported to Paul that some of their Judean brothers had heard Paul was teaching the Gentiles and those in the Diaspora to “apostacize” the teachings of Moses. Stephen wans’t guilty of this and neither was Paul! , What are the teachings of Moses? They are the Law, the Commandments and the Word of God; they are “the Truth”, according to God’s definition! I did not say it! God did! You can find it in your own Bible! God plainly defines the great end time apostacy as a departure from the Law of Moses! Jesus accused the Jews of not even knowing what Moses said and informed them Moses would be testifying against them in the judgment. (Jn. 5:45-47) Has “the Church” forsaken, apostacized Moses in this day? You bet! This doctrine infiltrated the American church through the institutions of higher learning in the late 19th and early 20th centuries and has spread from there. It has been opposed by the RCC heirarchy from the 3rd century on, since if one puts God’s Word as the highest spiritual authority then the RCC heirachy is not the highest authority but rather is to be in submission to God’s Holy Word. Rome does not willingly abandon its power to claim to speak for God even for God Himself! I think the NT makes a great case for the great end time apostacy to be related to God’s shepherds teaching and encouraging His people to “practice lawlessness” by removing the standard of holiness God established through Moses and confirmed in Jesus Christ. Thisis why both jeremiah (23) and Ezekiel (34) speak of how the LORD is going to judge His shepherds uppn His return for the way they have destroyed His Word and people! One last point with respect to the OT: 1) Nearly the very last words of the last book written there, Milachi 4:4, are, “Remember the the Law of Moses My servant, even the statutes, and ordinances, which I commanded him in Horeb for ALL of Israel.” Paul says we have been grafted into Israel therefore this verse is for us, as Israel! (Romans 11:19-24 and Eph. 2:11-13) Everyone has a choice: one can begin to read Scripture as God had it written, a book of instruction on how He expects His family to live with one another, or one can decide to pick and choose favoite passages that seemto support our doctrine and the theologians, the leaders are nearly always wrong(!), and twist the scriptures to live according to the standard they want to live by in this life. We will all give an account of the things done in our body. However, if you love God, you will keep His Commandments, His Law, His Word, Jesus and Truth! If you want to know why today’s “Church” is dying, it is because it has perverted Gods’ Truth, which only brings death! God’s Word is bread and sustains life. Departing from life, means death! Paul Patriot \\nONE thing to look at, and would make a great subject for a future article is the invasion and take over of the education system, via common core and other ideological brainwashing of young Minds, all in the name of “separation of church and state” which is a twisted invention and re interpretation of the 1st Amendment. The founders would not even recognize what is being done today as being remotely Constitutional. \\nSo, the removing of Biblical principles from schools and teaching absolute morals and Godly accountability, thus opening up young minds for indoctrination…….has created thus anti-God, anti-Christian, anti-Bible………anti-US Heritage mindset that is and will lead to our destruction as a free society, and one that is and will continue to plead with the God of the Bible to judge this nation and pour out onto her what she deserves. \\nMay we repent and call out to “nature’s God”…….the God of our heritage for restoration….if that is even possible at this point. Gay Veteran \\nhey, what are the parents doing??? religious indoctrination is THEIR job, not that of the State Jesus Freak \\nhey GV hopefully loving their kids like Jesus loves all of us sorry losers John \\nDo you get the irony in having a government endorsed school teach your children about morals and values and god’s accountability in public school? Apparently no one is accountable to god, especially our own government because they have yet to be punished by god’s wrath for all the evil mass murdering, lying, cheating, stealing they have done since the USA’s inception. Jim Davis \\nToo many bat-guano crazy people in churches. Not too mention the hypocrites, gossipers, back-stabbers, etc. eunuch is blocked word \\nAnd then a number of fundamentalist Christians have a holier–than–thou pious mindset. (no i’m not saying they’re all that way) Jim Davis \\nWas this a robo-post? WTF! Heather \\nDon’t judge unless you are perfect. Lorelei Vision \\nIt’s not a judgment, it’s the Truth! I knew a “Christian” woman who gossiped about everyone, sometimes Falsely. When Biblical Scripture was pointed out to this woman, admonishing her “sin”, what did she do? She emphatically stated that she “would not change”! She continued to speak with “forked tongue” until she died, even though her gossiping actually harmed other people. Many religious people hate it when their sin is pointed out, they hate being shown their hypocrisy. That is why so many non-believers hate Christians – our sheer hypocrisy of “do as I say, not as I do” is deceitful, insincere, pretension and off-putting. Those that truly follow God and His word have no problem being told the Truth about themselves. If the chastisement is True, we will heed the admonishment and act accordingly. Just because we are “saved” doesn’t mean we are to go out in the world with a chip on our shoulder, we are to walk a higher path and be an example to others. If you can’t handle the Truth, then maybe you need to revisit your walk with God… Heather \\nHi Lorelei! Thanks for the honest feedback. Yes, you are right, some Christians set very bad examples, and their words are only a reflection of what is in their heart. Their relationship with the Savior needs much work! I’ve been Born Again Christian for about 30+ years and in the first 10 years you would have never known it…drinking and everything else under the sun. My ‘communication’ with Jesus was non existent, therefore my lifestyle reflected the world, nor Christ. After much heartache, I began a dialogue with Jesus, put my trust In Him, etc and I haven’t been the same since. All we can do is pray for those who have wondered away. My guess is that this Christian woman dId not fully commit her life to Jesus. The New Testement (Bible) tells us exactly what God expects from us…to be like Christ! God bless, and Marantha Lorelei Vision \\nThere is much Truth to your comment, Jim. How many Christians actually walk the walk? Not many that I have met… Dawg01 \\nIt is wrong to lump all churches together. I go to a church that is not perfect, but does it’s best to interpret the bible, preaches Jesus is Lord and Savior, does missions overseas including very dangerous areas, and does outreach for the community. What are you who are criticizing all churches doing to spread the Gospel of Jesus Christ and helping others. Grillsgt. \\nGoogle the Church of Laodicea, Dawg. “The Bible clearly prophesies that the Church of the end times will be characterized by apostasy. Paul said that the Antichrist will not be revealed until “the apostasy comes first” ~ Dr. David Reagan Joan Camara \\nRight! The “falling away”…..it’s definitely happening..! Grillsgt. \\n“3 For the time will come when people will not put up with sound doctrine. Instead, to suit their own desires, they will gather around them a great number of teachers to say what their itching ears want to hear. 4 They will turn their ears away from the truth and turn aside to myths. “ WWF \\nOne thing I don’t like is sites that won’t approve your comment when you leave a Bible verse. Like Naturalnews had a story about Muslim terror so I put that verse about he shall be a wild man and guess what??? not approved! JF \\nMost sites today will not ‘approve’ anything that is anti-muslim. Grillsgt. \\nYeah, no moral courage. Joan Camara \\nMike Adams from naturalnews, is not a godly man, at all. He just knows about health, and likes to put government articles on his site too. shots = autism \\nThere’s a page on natural news that discusses distillation and links to the H20 labs water distiller site. I left a comment pointing out that H20 labs sells the same distillers as Megahome but ups the price and my comment was rejected. Robert \\nIt is more disturbing that anyone would find this disturbing. There are two ways, a narrow one and a broad one. Also bothersome is some saying that “whatever we are doing it isn’t working” as if there is a certain strategy to all this. Some few receive the gospel while most by far reject it. No surprise. We do not do anything. God remains sovereign. VigilanteCaregiver \\nThe Church of Jesus Christ of Latter-Day Saints is still growing – both by births and converts. \\nMembership as of April 2016 was 15,634,199 folks. It keeps going up. https://www.lds.org/general-conference/2016/04/statistical-report-2015?lang=eng Gay Veteran \\ncults tend to get bigger Guest \\nSo is atheism a cult? And nice to see your back GV, I was starting me to miss you and your contributions! VigilanteCaregiver \\nIf that’s about the homosexual usurper; he’s not atheist. He’s anti-Christ. Big difference. John \\nWhat if gay vet is not a vet nor gay? What if their name is just something being used to test people – to see how they will react to their comments based on said name? \\nIt is interesting how everytime gay vet comments their sexuality is brought up and mocked/scorned by followers of christ. VigilanteCaregiver \\nGV’s pro-deviant, anti-christian, anti-unborn child, anti-American, anti-civilization, and anti-constitutional garbage is not acceptable. \\nShe’s proudly wears her homosexuality in her name – of course we’re going to call her out on it. Homosexuality is a proven mental disorder; linked to narcissistic personality disorder and she really needs to get help as it’s dangerous physically, mentally, and emotionally. I will not enable someone with obvious mental problems and call it normal. \\nThe LDS Church has instructed members to be loving towards those who suffer homosexuality, and we should. This person needs help. Acceptance and cognitive dissonance to self-harming behaviors and GV’s destructive and possibly criminal views is not loving – that is evil. Joan Camara \\nTrue enough! mleblanc138 \\nI’m LDS too, but that number includes a lot of inactives and less actives. Think about all the people on your Ward’s list that never show up. Now multiply for every ward and I also hear the inactivity rate outside the US is way higher. VigilanteCaregiver \\nHalf of our ward is disabled. We have low attendance during meetings, but go out and meet with them and their families at home. \\nWe’re supposed to contact and do what we can for the inactive. Usually they’re inactive for a good reason. greanfinisher . \\nThe country was never Christian to begin with. In fact, during the country’s entire history, only four popes had decided not to avoid the United States during their world tours. Heck, this country had spent the vast majority of its time inciting wars and expanding its empire so I would hardly describe it as being Christian. At best, it would more resemble the Roman empire, and even that characterization would be too kind. Make no mistake. Wealth, power and control have always reigned in the country, and not the Creator. Grillsgt. \\nHow many nations did the US conquer and occupy, like the Romans? The nations we defeated in battle, i.e. Germany, Japan, did not become a possession. After the war, we helped to restore them to become free nations. greanfinisher . \\nThe U.S. conquered and/or occupied a horde of sovereign lands during its history including those territories held by Mexico, Cuba, Ukraine, Libya, Russia, Dominican Republic, Columbia, Haiti, Kuwait, Puerto Rico, Jordan, Canada, Hawaii, Iraq, Panama, Guatemala, and Afghanistan. As per Germany, Japan and South Korea, all of these countries are still occupied by the United States, and answer only to their American masters. With tens of thousands of American troops holding these three countries hostage, they could hardly be described as free nations. Grillsgt. \\nWhich of these “territories” do you believe we unilaterally invaded and occupied? Were they nations? And was the US the aggressor? Who drew first blood? Can you cite references? Grillsgt. \\nI think I see your reasoning. We have differing views what an empire is. Some examples that come to mind would be the Babylonian Empire, the Soviets, Ottomans, the Byzantines, Romans, etc. Yes, we did change the course of countries’ directions, but we are not the central authority, as the ones I mentioned. Mexico IS a sovereign nation, as are the other countries you listed. Others were occupied by tyrants, like Saddam Hussein, for example. Columbia was involved in the drug trade that was affecting the US. We could go on, but I think you get my drift. As for Germany, Japan, and South Korea, they want us there. John \\nThank you greanfinisher for being one of the few quiet voices of reason that try to reach the unreachable. greanfinisher . \\nI can fully appreciate Grillsgt’s problem as he had likely been brainwashed and indoctrinated by the American propaganda machine. With time, he will eventually see things from a true perspective. Gay Veteran \\n“…This is such a tragedy, because during my decades of research into these things I have found that logic and reason should always point people toward the Christian faith and not away from it. There is an absolutely gigantic   for Christianity out there, but unfortunately most people don’t know about it or they are not interested in considering it….” \\nevery religion on the planet think their religion is THE religion! \\nbtw, why does “god” never regenerate the limbs of amputees? it that happened then talk about “an absolutely gigantic   for Christianity out there” Grillsgt. \\nA passage in Matthew touches on that thought…“The Pharisees and Sadducees came to Jesus and tested him by asking him to show them a sign from heaven. \\n2 He replied, “When evening comes, you say, ‘It will be fair weather, for the sky is red,’ 3 and in the morning, ‘Today it will be stormy, for the sky is red and overcast.’ You know how to interpret the appearance of the sky, but you cannot interpret the signs of the times.[a] 4 A wicked and adulterous generation looks for a sign, but none will be given it except the sign of Jonah.” Jesus then left them and went away. Matthew 16: 1-4 \\nThe “Sign of Jonah” was Christ’s death, burial, and Resurrection. Gay Veteran \\nbut there are tons of people claiming “god” cured them, and yet NOT one amputee John \\nPeople really should study the human brain as it is the reason we have the mass psychosis called: religion. \\nIt is a virus that spreads from generation to generation and never stops. \\nThis includes not only the major religions in the world, but also those religions that subscribe to satanism, etc. \\nThey are all just a farce created by clever tricksters who know more about our brains, motivations, etc than we do. \\nPeople do not have time to study themselves – they are too busy being children, going to school, falling in love, working 9 – 5, then golfing in their golden years or working till they drop to ever examine themselves and all the b.s. they have been taught. \\nThey will continue this cycle with their own children and so on and so on. Because the beat goes on and on and never stops. Save for a few. DJohn1 \\nThe churches need to do some things. One of which is to establish what is fact and what is fiction. If I look at the material world then there are physical laws by which everything on this planet operates. One of those laws is the operation of gravity and the surface tension of water. It is mentioned in the BIble about Jesus walking on water and Peter attempting to do so. Without Jesus helping he could not walk on water. According to Jesus his faith was to weak. In the natural order of things Peter should drown when he attempts to walk on water. No representative of any religion that I know of can duplicate Jesus in walking on water. And there lies the problem. We live in the natural order of things. We live in the natural world with a set system of physical laws that none of us can break as Jesus could at will. Miracles are in the realm of the supernatural rather than the realm of the natural order of things. Yet many Christians have experienced Miracles of one kind or another. Just do not depend on Miracles. They are at the whim of our God and Creator. He decides what happens not us. I have felt the power of God in the form of the Holy Spirit before. Someone I was spiritually attached to confirmed this for me without prompting of any kind and 5,000 miles approximately between me and that person when I was 21. Yet none of this is taught anywhere that I know of. It is there. It is real. But it is not reproductable. So science has a huge problem attempting to reproduce anything that is talked extensively about in the New Testament. To them it is fable. It is myth without substance. And that basically in the form of Humanism is taught in the schools. So yes the old time religion of the churches is obsolete in not addressing the problem of science and natural laws of the universe. The young people are quick to pick up on this lack. They dismiss the Holy Spirit as a force. People like me have experienced it first hand and know different. I don’t have all the answers. If Jesus ever chose me for anything I would be totally surprised. I have met him only second hand in the Bible. As just about everyone in this time has done. IF Jesus as a God and as an immortal being came back, the forces of this world would attempt to kill him again. Those forces of this world do not represent all of humanity and they certainly do not represent me. Jesus gave many lessons in 3 years of ministry on this planet. One of which was Peter attempting to walk on water. Another concerning Peter was in his fear of crucifixion he denied Christ. The lesson is you do not know what you might do under the right kind of pressures. Jesus taught many things. One was the limits we put on ourselves. I have no clue to the answers that science information has come up with. Is the universe 13.5 billion years old. Are galaxies as common as a grains of sand on deserts? Is the Universe so large it is difficult to even conceive how large it is? The universe as we see it through our telescopes is so incredibly large as to be above the ability of most people to even understand. AS for me and mine, we worship the God of creation, the alpha and omega, the beginning of it all and the end of it all and are loyal to both God and his son, Jesus. When will Jesus come back? Only God knows. john \\n“Yet many Christians have experienced Miracles of one kind or another. Just do not depend on Miracles. They are at the whim of our God and Creator. He decides what happens not us.” \\nSo you are saying that god decides if a child will be abused? Is that really OK with you from your own logistical standpoint? DJohn1 \\nI am saying that God created it all. And no I am not all right with a lot of things allowed in this creation. But I wasn’t there when it was created and had no say one way or another in how it was created. I also do not have the big picture as God sees it. God is not human. God is also immortal and all powerful in this universe. \\nLook around you. This world is full of violent interactions. Yet good Christians once took out the predators. The result was a far worse disaster. The herds increased too fast and starvation loomed. All because we upset the balance of nature. Is a child being abused part of God’s creation or something else? Something wicked this way comes. God appears to have an opposite number in the Father of all Lies, Satan. This is documented fairly well in Job, the oldest book of the Bible. \\nWhen, not if, we succeed in finding life on another planet, will it follow the patterns of this world? The answer to that is it is likely. The reality of this world is it is a sick, violent place, and Christians are killed every day in other areas of the world. I do not agree with a lot of the reality I see out there. But only God can change it. To give him the glory is also to give him the responsibility. So in answer to your question ultimately the responsibility of this world lies on God’s shoulders. john \\n“So in answer to your question ultimately the responsibility of this world lies on God’s shoulders.” \\nThat is exactly where you are wrong. Thinking that it is god’s responsibility is why the world is the way it is. We are responsible for evil and good. We make the choice in how we behave and how we treat other people. There is no satan and no god. If you want to see god look in the mirror. If you want to see satan look in the same mirror. We are all light and dark. watchmannonthewall \\nThat’s what satan told Eve: “For God knows in the day you eat from it your eyes will be opened, and you will be LIKE God, knowing good and evil.” (Gen. 3:5) \\nKnow what? Satan told the truth and you agreed. We all choose either the good or evil, but keep in mind only God, the Creator, gets to define what each term means. \\nThe problem with Adam and Eve eating from the Tree of Knowledge of Good and Evil was that neither was yet mature enough or had the wisdom necessary to properly choose between good or evil. To overcome this deficit, mankind makes up its own definition of each. Many people are still in the same place. Those who accept God’s definitions of “good and evil” are further along than others! \\nThose who have chosen to obey God and follow His Word, are being taught the wisdom to properly make that choice, now. When Jesus returns and teaches Torah in Jerusalem during the Millennium (Is. 2:1-4, Micah 4:1-4), there will be a quantum leap forward in righteousness as this wisdom is taught without error, not like today. MaxRockatansky33 Ebedmelech the eunuch \\nThat’s because they’re not allowed to have a wife which is contrary to the Bible. There’s a guaranteed solution to stopping the priests’ abuse (unless they get T prescription) if you know about farm work but messing up could mean sepsis / fournier’s gangrene. Someone needs to have a lot of stuff like infection stoppers including colloidal silver and calcium bentonite clay which stops gangrene if you know how to use it. Messing up costs over 14 grand but if you pay a lot when there you might get most of it canceled, however each specialist sends a separate minor bill and the shrink charges 150. \\nThe lack of androgens did not change any of my opinions, hobbies or worldview but it does remove reproductive desire completely including all interest in lib-i-do related stuff. For example I used to like piercings on some women but now it’s like why do they hurt themselves? Looks gross. Also lost most attraction to women. ALL aggression goes away and i’m also more docile. \\nOverall I don’t recommend it cause osteoporosis risk. I can’t have sugar, much coffee, much salt, fluoride water and I need real foods and sunshine on skin for vitamin D. Also wearing all that priest garb would require a lot of Estroven, evening primrose oil, black cohash–especially from month 3-4 until about a year when male men-opa-use ends & then they’ll just get normal heats. Taking hor-mo-nes and then quitting for awhile might retrigger male me-nop-ause but I’ll probably have to do this when food is hard to get. Rebel w/out a Cause \\nWTF? You’re recommending castration???? Isn’t that a little extreme, as in “eliminating” the natural way of things? How about you be like Paul and fight the “good fight”, and “finish the course”? Why resort to damaging/destroying what God gave you to begin with? Do you think God made a mistake…? SHOTS = AUTISM \\nI don’t recommend it, I’m saying it WILL stop the priest sxeuual abuses. The effects are REALLY extreme so if a priest had that tendency toward kids he should go on lupron or licorice root to lower androgen-based behavoir instead. carson \\nwhat is the falling away of 2nd thessalonains 2? Can folks fall away from what they were never near too? So there was a nearness and now a falling away from it? An atheist falling away into satanism as example isn’t what the verse is concerned with is it, it’s dealing with those falling away from a nearness but not quite thereness to Christ and also from ‘natural’ love and natural kindnesses etc etc (covered in 2nd timothy 3), falling away from goodness and natural love but mostly a nearness or form to Christ… \\nBut what was a nearness to but not quite thereness..a ‘form of godliness but one which denied the power thereof’? religion’osity? But what does God direct those who are His to do with that anyway? ‘from such turn away” (2nd timothy 3:5). \\nThe falling away is not the catching up, it’s falling away and is happening just as written. \\nand menkinds attempts to ‘grow the church’..via men’s means, worldly lures and baits and ‘programs’ and things pleasing to the flesh is NO answer, never should have risen to prominence anyway, unless God builds the house it doesn’t stand, God grants faith we throw out the seeds but God causes the growth..etc etc etc, those trying to grow the church via man should know that, it’s written all over after all. \\nunless God builds the house it doesn’t stand, and now all these churches are falling…hmmm. On the otherhand some churches are still preaching the truth, and not really ‘growing’ (although in truth they are growing in Christ, but pew sitters/numbers not so much) while other churches with the fleshly bent ear tickling lures are growing also, but here ‘growing’ and ensnaring further are interchangeable. \\nBut rejoice always many are and many will be saved for sure, even while others fall away, rejoice when even one sinner repents. Richard \\nWhy is religion losing ground? Because it never did anything for anybody. it doesn’t put food on the table. It doesn’t provide jobs. It doesn’t cure disease. It doesn’t prevent divorces. I doesn’t pay the mortgage. It had to be just a matter of time before people woke up and realized that religion was just a political ploy to keep the plebs down and satisfied with ‘their lot’. \\nOK, now let it rip, all you religious fanatics. I’m ready for you… Go for it… John \\nRichard thank you for speaking the truth. You will no doubt either be 1. ignored or 2. have a list of bible verses that blame adam and eve for the reason this world and many of the people in it completely suck. Cause it’s all about the sin. Yet who caused us to sin? God did by allowing the temptation to be placed before 2 innocent people. That would like placing one of those laundry pods in front of a toddler, along with a cookie and telling them they can eat the cookie but not the laundry pod. You know what would happen… Paul Patriot \\nSo according to your comments, God is to blame for the mess we are in, because he gave us free will to choose, rather than making us robots. \\nWow!!!! You have no idea the dangerous path you are walking, a path of blasphemous, accusing of the Living God of tempting the human race by giving them free will. \\nI pray you wake up and see the danger and foolishness of your pointing a finger at your creator…. TJAW \\nApologies for butting into this discussion, but God is not my creator, because I do not believe in him. He is not real to me, so there is no “dangerous path”. Of course, you will attempt to convince me otherwise, but there is no solid argument that can be made for his existence. Atheism is on the rise for a simple reason – it’s better to think for yourself than blindly believe in fairy tales and exaggerated history. Paul Patriot \\nAnd you will continue in your rejection of God, and will be without excuse on judgement day. Just because he is not real to you, does not mean that he does not exist. \\nThe Bible has had its enemies like you for thousands of years, yet it has been true and unwavering in its scientific, historical and prophetic truth, so, I will trust in writings that have proven themselves for centuries ( over man’s emotion and opinion and “feelings”) \\nRest assured the Bible will be here and still be true long after you and I have died, and will continue to be a stumbling block to folks like you, and a source of peace, comfort and hope for folks like me. \\nGod “is not real to me” as an excuse to run away fro the savior that calls them to repent (of their sins) and believe in the only name under heaven in which a man can be saved…Jesus. \\nNo hard feelings, I appreciate you corresponding with me. \\nHope you don’t mind, still praying for you…….I used to believe what you did, that’s why I know where you are and how blind I was once Jesus came into my life Paul Patriot \\nHow blind I was until Jesus opened my eyes. TJAW \\nYou are hopelessly deluded. Jesus died almost 2000 years ago. Whatever happened to him back then has absolutely no correlation to your life. TJAW \\nEven if I believed in God, even if there was concrete proof that he exists, he has done NOTHING for me. He does nothing for anyone. He does not rid the world of disease, he refuses to shield the world from terrorism and evil, he lets children starve to death and families suffer. I don’t need you to pray for me. I don’t live in your childish fairy tale world of angels and demons and spirits. IsabellaSpeaking \\nSaying that you know that God has done “nothing for anyone” implies that you know everything. Many people claim God has done a lot for them, so…how would you know otherwise…unless you know everything? And since you know everything, why don’t you rid the world of disease, shield the world from terrorism and evil, etc.? If not the whole world, then maybe one little part of it? Maybe, though, it can’t be done…not in this world… iris \\n(:!!! Can’t argue with that one at all. As for the veracity of the Bible: historical details, archeological finds and detailed fulfillment of hundreds of prophecies, (about 300 about the Messiah, alone, almost all of which were fulfilled by Yeshua of Bethlehem, the remaining ones all have to do with the end of days and Messiah’s return and reign on earth regarding the Messiah), the fact that 66 books, written 1500 years apart in some cases, by 40 authors from all walks of life, all having the same theme and going with each other, should give anyone doubting it, pause, at least. And the intricate patterning of the universe implies the opposite of random chance, not to mention the law of cause and effect. God bless! Paul Patriot \\nYou are repeating the same mantra that has been repeated by God hating folks for centuries. \\nOur founding fathers would disagree with you regarding the role of religion and faith in society, and the positive influence absolute morals has. I agree, “religion” can be destructive, but, a personal relationship with the Lord Jesus Christ, will only produce citizens who strive to please God in their actions, and cause fell o human beings no harm, and on the contrary, a relationship with Jesus, will prevent divorce, adultery, drug abuse, rape, robbery, murder, and entitlement attitudes. \\nAgain, it’s not “religion” that is beneficial per say, it is a personal relationship with the Savior. Paul Patriot \\nThe “religion of peace” is not losing ground….somehow the pied piper of propaganda has brainwashed people to criticize Christinity due to its “intolerant” view of saying the Jesus is the only way to be saved from hell…….yet are silent about a religious ideology in which the founders teachings are obeyed, have shown over the past 1400+ years, that “religion of peace” leaves a path of death, destruction and oppression wherever is goes and gains the “upper house”, proving to be the most intolerant religion known by modern man. \\nNo one here who criticize Christianity seem to want to speak out about Islam though……. iris \\nYes, interesting, since Islam, like many religions, is based on man’s perceived ability to perform enough works of righteousness, as they interpret them. The ways of man are sinking sand. We can never do enough to make it into heaven, for only God is perfect. We need the salvation provided by Jesus Christ, first, last and always. All religions are mankind trying to get to God or to become God or a god. Christianity is a relationship with God, who humbled Himself to come to us as one of us, to give His very self in our place, and took the punishment we all deserve, in order to provide the way of reconciliation to our Holy Creator. He is “the Way, the Truth and the Life”. Maximus \\nI identify as a Christian. I just don’t attend church. My beliefs are mine and mine alone; I have a pretty good understanding with the Lord. If other’s think along the same lines, fine. If they don’t, well that’s fine too. \\nWhat gets me is the vilification of Christianity in modern times. I’m not worried about it personally. You either stand with Him or stand alone. horse777res \\nAmerica has abandoned GOD, and GOD has abandoned America. The BIBLE says”The wicked shall be turned into hell, and nations that forget GOD.” Psalm 9:17 tacoma \\nAll religions (with a few rarest exceptions) are based on the impossible. Christianity calls it miracle, other religions have other names. Miracles are impossible in the real world. It is delusion to believe they exist. \\nReligion is also about worshiping a god (or gods). The god represents the miracle. By doing this act of worship all kinds of powerful, even impossible benefits will happen. The differences between religions is one of different definitions of god, how to conduct the worship, and what kind of benefit will emerge. Only human beings of the past 10,000 years (but not earlier) do this kind of nonsense. It is the result of our powerful imagination. \\nWell the basic nonsense of worshiping gods is so great the leaders of religions were required to construct all kinds of fantastic structures and elaborate rituals to convince people to maintain belief and worship. Add to his are punishments and bloody enforcements. But why? The leaders want to keep their power over people, the age old human character. \\nMost religions offer ‘teaching’, some kind of wisdom. But teaching can certainly be offered without religion. An American Native (who treat lightning as a god) is as moral as any of the European religion without their teaching. Follower of Buddhism is at least as moral, likely much more, than followers of other major religions. But Buddhism does not have a god, and does not compel anybody to do anything. \\nBut are there gods, are they real? Of course there are gods, history of religion list thousands of gods. They are real, but only in the minds of man. A god is software; can be created, defined, killed off at will. Anybody can make a god, based on something real (like the Sun) or fantasy. This is why to make the ‘establishment’ god one needs to wrap all kinds of fantastism and protection around it, make it special. The world always have enough fools to be taken in. 90% of humans are born followers, and they love to be led or fooled. \\nIn the end, religions are just forms of sociology, politics, philosophy, mind over body. \\nThere have been great debate between science and religion. Well there are as many religions as human can create them. There is only one science, one based solely only proven facts and accurate predictions. This is why 10,000 universities of the world offer scientific education. And the modern world of great achievements is build on engineering, which in turn is built on science. Rebel w/out a Cause \\nOh my. I’ve read through a lot of the comments, and I have to make a few observations. 1) I graduated from a Independent Fundamental Baptist Bible college, which was controlled by an IFB church, which in turn was easily identified as a cult. And therein lies the rub. Too many “churches” are in reality “cults”. Following the preacher’s teachings as if they’re direct from God. Truth becomes warped. God’s “Word” becomes manipulative teachings to contribute to the preacher’s power and control. Don’t believe me? Google the Hyles family and the First Baptist Church of Hammond Indiana, and the cesspool of corruption it entailed. Even after the demise of Dr. Hyles, the corruption went on to bring down his successor. These are the things that turn people away from Christianity. Who can you trust? What teachings can you trust to be real, and not perverted and twisted? I’ve been a “member” of numerous churches. Only one would I trust to be called “Godly’. The rest were ALL manipulative, controlling, and deceitful. What does THAT tell you about “organized religion”? iris \\nYes, indeed. MR.RANDY DOUGLAS MILLER \\nAS A LIFELONG PREACHERS KID AND GREWUP IN THE ANTI-SCIENCE CREATIONIST EVANGELICAL CHRISTIANITY I’M ABSOLUTELY ECSTATIC TO SEE THIS WONDERFUL THING HAPPENING.I’VE BEEN A “NONE” FOR DECADES!\""}, "time": 1742562319.4707825}