{"duration": 0.15055465698242188, "input_args": {"text": "'Trump\\'s presidency and the future of US-Russia relations With Donald Trump winning the U.S. presidency in surprising fashion, Russia Direct sat down with Carnegie Moscow Center Director Dmitri Trenin to discuss the implications of his presidency on U.S.-Russia relations With Donald Trump winning the U.S. presidency in surprising fashion, Russia Direct sat down with Carnegie Moscow Center Director Dmitri Trenin to discuss the implications of his presidency for U.S.-Russia relations. \\n ;\\nU.S. President-elect Donald Trump stands during a rally in Bentonville, Arkansas. Photo: AP \\nRegardless of the early forecasts and preliminary exit polls predicting the loss of Republican presidential candidate Donald Trump, he won, doing far better than anyone could have predicted. By the end of the night, he had garnered 288 of the required 270 Electoral College votes, with his Democratic counterpart Hillary Clinton having received 215 votes, according to the latest data from CNN .\\nThe question is whether Trump now has a political mandate to move forward with his many controversial domestic and foreign policy initiatives. Critics point to the fact that Trump and Clinton split the popular vote almost exactly in half, and that many of the states Trump won were only by virtue of razor-sharp margins. In addition, he will still need to contend with divisiveness within the U.S. Congress, where it may be harder to unite the nation.\\nPrimarily, Trump’s victory results from the fact that Americans —faced with social and economic challenges within their own country — became very disappointed with their establishment and political elites as well as with the whole concept of globalization . And this trend is commonplace, not only for the U.S., but also the entire West.\\nAlso read: \" The real reason why Vladimir Putin needs Donald Trump \" As Russia’s Former Finance Minister Alexei Kudrin wrote via his Twitter account , the American presidential elections show that the current dynamic of the global processes doesn’t meet the expectations of many people. He described the U.S. elections as “the continuation of the Brexit,” with right-wing and populist forces gaining influence throughout Europe.\\nProminent Western experts echo this view. For example, historian Niall Ferguson, a senior fellow at Stanford University’s Hoover Institution and Harvard University’s Center for European Studies, argues populists like Trump “are nearly always part of a global phenomenon,” with 2016 having generated “a populist backlash against globalization” and this crisis itself being “global in its scope.”\\n“Populism today has a similarly global quality,” Ferguson wrote . “In June, the British vote to leave the European Union was hailed by populists right across the European continent as well as by Donald Trump in the United States and, implicitly, by Vladimir Putin in Russia.”\\nHowever, the fact that Trump was finally elected indicates that democracy has proven its resilience, despite any current challenges. ;\\n“Democrats have lost, but democracy has won. America keeps going because it keeps changing. [It is] a bitter pill to swallow, but the body politic needed it,” wrote Carnegie Moscow Center’s Director Dmitri Trenin after the U.S. presidential election results indicted the victory of Trump.\\nAmidst the post-election buzz, Russia Direct sat down with Trenin to discuss the reasons why Americans elected Trump and what it means for U.S.-Russia relations .\\n\\nCarnegie Moscow Center Director Dmitri Trenin. Photo: Russia Direct \\nRussia Direct: Donald Trump is going to be the next president of the United States. What policy toward Russia should we expect from him and how can his presidency affect U.S.-Russia relations? Dmitri Trenin: Trump is unpredictable, in my view. Yet, on the other hand, the reaction to his presidency from the American establishment will also be unpredictable, because Trump won’t be able to conduct and carry out foreign, military and any other initiatives by himself.\\nHe will need a team and people. So far, it is very difficult to imagine who will be included in the Trump administration. How will these people be able to work with each other and find common ground? This is also not such an easy question to answer. So, this unpredictability is multilayered in its very nature. That’s why is impossible to outline the Trump administration’s policy.\\nAnd today this aspect should be taken into account, given the fact that the current agenda of U.S.-Russia relations adds up to one key question, just like it was during the Cold War : How to prevent a hot war? I hope the U.S. and Russia will cooperate and be able to prevent the escalation from spinning out of control and turning into a conflict at the nuclear level. I hope we will avoid such a catastrophe.\\nRD: Some pundits and historians try to find certain logic in the impact of American presidential elections on U.S.-Russia relations throughout history. The logic is very simple: the Republicans are good for the Kremlin — the Democrats are not; the business-minded Republicans are easy to get along with, the idealistic Democrats are not. Thus, Trump is a chance for Russia — Clinton is not. This oversimplified assumption is very popular among many Russian politicians and pundits. What is your take? D.T.: Of course, it is a big oversimplification. It is a myth and it emerged in the times of Republican Richard Nixon’s presidency (1969–1974), when the Soviet Union and the United States established a productive dialogue and the Soviet elites came to the conclusion that their American counterparts saw them as equals, based on their military-strategic parity.\\nThis myth was further confirmed by the presidency of Jimmy Carter, who came to power as a Democrat with his ideas on human rights and nonproliferation. During his tenure, Soviet-American relations saw a significant decline. The big difference between the Republicans, whom the Kremlin saw as reasonable and approachable, and the intransigent Democrats was obvious to the Soviet leaders. Nixon and his National Security Advisor Henry Kissinger were easier to get along with than Carter and his team, who were very difficult to negotiate with. ;\\nYet if one looks at the problem from a broader historical perspective, the closest relations between Russia and the United States were generally established in the times of Democratic presidents, including Franklin Delano Roosevelt (1933–1945) and Bill Clinton (1993-2001), regardless of the fact that the last years of Clinton’s presidency left an unpleasant aftertaste for Russia.\\nIndeed, during Clinton’s tenure the U.S. saw itself as the patron. Washington was both very friendly and too intrusive toward post-Soviet Russia and didn’t see it as an equal partner. But, at any rate, we cannot deny the fact it was a friendship between Moscow and Washington.\\nSo, in my view, believing that the Republicans are better for Russia than Democrats is a myth, not to mention the fact that the U.S. is changing today, and the nature of differences between Democrats and Republicans is not the same as previously.\\nRD: Yet where do such myths come from historically? Politically, are there any grounds to come up with such conclusions? D.T.: Yes, there are some reasons to believe in this myth. If we oversimplify, the Republicans embody U.S. business — the Democrats exemplify the ideals of America. However, in reality there is no unanimity — there are many differences within both Republican and Democratic parties.\\nBusiness is pragmatic. It negotiates, persistently defends its interests and sincerely believes in healthy completion. This is what the Republicans put forward.\\nMeanwhile, the Democrats, since the times of President Woodrow Wilson (1913-1921), prioritize not material and tangible things, but political ideals such as democratic values.\\nBecause the U.S. sees itself as the global center of democracy, the key goal of the Democrats is to make the world safer through democracy. Thus, democracy in this context is seen as the major foundation of security and the entire world order. Such logic implies that moral superiority is much more important than materialism. That’s why the Democrats, unlike the Republicans, more rigorously focus on the domestic policy of other countries and human rights. ;\\nAlso read: \" Trump, Clinton and the great realignment in American politics \" Thus, the co-existence of these two trends — material and moral aspects — shapes American politics.\\nRD: If we extrapolate this to the U.S. policy toward Russia, we face problems at any rate: in the case of idealism, the tensions between two countries will increase if the expectations of two sides about each other won’t come true. Likewise, business-minded and blunt politicians won’t necessarily alleviate these tensions. In contrast, they might aggravate the problem. So, the scheme “Good Republicans—Bad Democrats” is totally flawed. D.T.: Exactly. ; ; ; ;\\nRD: There is a lot of talk about American foreign policy , with the Democrats becoming more hawkish toward Russia and their Republican counterparts being friendlier toward the Kremlin. However, historically, it was vice versa. D.T.: If we talk about Donald Trump, it is the case: He is ready to establish dialogue with Russia. However, if you take the Republican camp in general, there won’t be agreement and unanimity [on how to deal with Russia]. Most importantly, the Republican representatives of the establishment are divided in their view on Trump: Some see him in a very negative light, while the others would like to establish close ties.\\nIf we put Russia into this context, it is not seen as a serious problem for American politics despite the fact that it played a role during this year’s presidential campaign as a factor of the pre-election race . However, Russia is not a factor in U.S. foreign policy. It is not a top priority for the United States and the political establishment is hardly likely to overestimate the significance of Russia. And this trend seems to persist in the future.\\nNobody in the U.S. believes that relations with Russia will be improved until the Kremlin changes its foreign policy course and stops its political rebellion against the system of international relations, established by the United States . Likewise, nobody within the U.S. establishment really believes that Russia’s foreign policy will be changed under Russian President Vladimir Putin, not to mention its domestic policy.\\nMoreover, the U.S. establishment is hardly likely to take Putin very seriously and negotiate with him. And this trend in U.S.-Russia bilateral relations will persist for seven-eight years. The changes that might take place in Moscow-Washington relations will depend to a greater extent on the domestic policies of Russia and the United States.'"}, "time": 1742628335.7191398}