{"duration": 0.21250438690185547, "input_args": {"text": "'The Vexed Question of the Dollar \\nby Alasdair Macleod, GoldMoney : \\nThere is little doubt that the rapid expansion of both dollar-denominated debt and monetary quantities since the financial crisis will lead us into a currency crisis. \\nWe just don’t know when, and the dollar is not alone. All the major paper currencies have been massively inflated in recent years. With the dollar acting as the world’s reserve currency, where the dollar goes, so do all the other fiat monies. Until that cataclysmic event, we watch currencies behave in increasingly unexpected, seemingly irrational ways. The fundamentals for Japan are not good, yet the yen remains the strongest currency of the big four. The Eurozone risks a systemic collapse, overwhelmed by political and financial headwinds, yet the euro’s exchange rate has proved relatively impervious to this deep uncertainty. The British economy is strongest, yet sterling is the weakest of the four majors. \\nIf nothing else, today’s foreign exchanges are evidence that subjectivity triumphs over macroeconomic thinking. Mackay’s Extraordinary Popular Delusions and the Madness of Crowds beats computer modelling every time. Furthermore, any official attempt to establish a rate for the dollar has to address two separate questions: the value of the dollar relative to other currencies, and its purchasing power for goods and services. \\nThe chart below indicates how the dollar has behaved against other currencies over the last five years, both on a trade weighted and on a predefined currency basis (DXY). \\nIt should be noted that the dollar has risen on both these measures by roughly 18% since early 2014. At the same time, the Chinese yuan has fallen against the dollar by about 12%, so it has actually risen slightly against the DXY basket as a whole, particularly against the euro component, where it has gained 12% since early 2014. This matters, because far from devaluing, which is what we are routinely told by dollar-centric analysts, the yuan has been relatively stable over time against a basket of currencies. It has been weak against the dollar and yen, but strong against both the euro and sterling. \\nWe should look at this from the Fed’s Federal Open Market Committee’s point of view. America runs a record trade deficit with China, and the only major economies where China’s terms of trade have improved are with the US, excepting Japan. Therefore, the Fed is bound to be very sensitive to the dollar’s exchange rate with China’s yuan Furthermore, on two occasions when the Fed had signalled it was going to raise the Fed Funds Rate, it backed off when the Chinese lowered the rate at which it had pegged the yuan to the dollar. Chinese devaluation against the dollar is obviously a prime concern for the Fed. \\nThe situation becomes better understood when the Peoples Bank’s position is taken into account. The bank has been selling US Treasury stock in large quantities, stockpiling commodities and oil with the proceeds, though it has been diversifying into Japanese Government bonds as well. China’s dollars have been welcomed by markets, which are short of both quality collateral and raw currency. However, China’s supply of both has failed to stop the dollar rising against the yuan. Furthermore, China isn’t the only Asian and Middle Eastern state selling American paper, so the demand from other international players on the buy side has been immense, enough to determine the underlying direction of the dollar’s exchange rate. \\nThe situation is being exploited by the Peoples Bank. In effect, the Peoples Bank is in a position to dictate Fed policy by adjusting the rate at which it is prepared to supply dollars into the market. So long as the dollar remains fundamentally strong, it only has to slow the pace of Treasury and dollar sales for the dollar to rise, and therefore the Fed’s planned interest rate rises to be deferred. This is not understood properly by western commentators, who erroneously think China is being forced to defend a declining yuan. Nothing could be further from the truth. It will be interesting to see whether this happens again ahead of the December FOMC meeting, when for the umpteenth time we have been promised a rise in the Fed Funds Rate. \\nA major consideration behind China’s foreign exchange policy is the outlook for the euro. The Eurozone represents a market as large as the US, with the added importance of being tagged onto the Asian continent. There can be little doubt that China sees her own long-term future being aligned more with Europe than America, despite Europe’s current troubles. It is, if you like, a situation that is primarily of strategic importance. Europe’s economy will need rescuing at some stage, and is therefore a future opportunity for China’s intervention. '"}, "time": 1742564117.7989836}