{"duration": 0.1372995376586914, "input_args": {"text": "'Email \\nAn Oregon jury delivered a stunning blow to federal prosecutors Thursday, acquitting seven principal defendants in the five-week long trial of participants in the occupation of the Malheur National Wildlife Refuge that riveted national attention on southeastern Oregon earlier this year. \\nThe jury acquitted brothers Amman and Ryan Bundy, the most high-profile of the occupation participants, along with five of their co-defendants, of charges of conspiring to use “force, intimidation, and threats” to prevent federal employees from working at the refuge. They were also charged with possessing a firearm in a federal facility with the intent that it “be used in the commission of a crime.” Also acquitted were: Shawna Cox, Kenneth Medenbach, Jeff Banta, David Fry and Neil Wampler (shown). \\nThe 41-day occupation of the wildlife refuge was launched in protest over the prosecution (and persecution) by federal authorities of Harney County ranchers Dwight Hammond, Jr. and Steven Hammond , who were charged with arson and received harsh prison sentences for setting controlled burns on their own range that got out of control, and did minor damage to small plots of federal land. As we have reported previously, federal agencies such as the Bureau of Land Management, the U.S. Forest Service, and the National Park Service regularly burn up huge tracts of “public land” — as well as private homes, farms, ranches, and businesses — with virtually no legal consequences. The hypocrisy, injustice, and viciousness of the federal prosecution of the Hammonds, a respected ranching family, played strongly with the many supporters — both local and from across the country — who flocked to their defense. \\nAlthough there was plenty of photographic, video, and eye-witness evidence that many, if not most, of the participants in wildlife refuge were indeed armed, the jury noted that the prosecution had failed to prove “intent.” In an e-mail to the Oregonian/Oregon Live , one of the jurors, known only as Juror 4, stated that the defense lawyers\\' arguments, coupled with the jury instructions on how to apply the law to the evidence, resonated with the jury. The juror also suggested that the arrogance of the federal prosecutors offended members of the jury. \"Inference, while possibly compelling, proved to be insulting or inadequate to 12 diversely situated people as a means to convict,\\'\\' Juror 4 wrote. \"The air of triumphalism that the prosecution brought was not lost on any of us, nor was it warranted given their burden of proof.” \\nA melee of sorts broke out in the courtroom after the jury verdicts were read, resulting in Ammon Bundy’s attorney, Marcus Mumford being tasered and taken down by several U.S. Marshalls. The courtroom drama began, reportedly, when Mumford protested U.S. District Judge Anna J. Brown’s order that Ammon and Ryan Bundy remain in custody. Mumford approached the bench and argued that his client should be allowed to leave the courtroom a free man, along with the other acquitted defendants, unless he was presented with papers providing the authority to place Bundy in custody. As the noise and commotion escalated, Judge Brown ordered, “Everybody out of the courtroom!” Mr. Mumford was briefly detained and then joined the celebrating defendants and their supporters on the courthouse steps. He said he was \"very pleased, very gratified,” by the verdicts. “This jury was dedicated,” he said. “They listened to our case.” \\n\"I had a very peaceful feeling but I didn\\'t know we\\'d all be found not guilty,\" said defendant Shawna Cox. \"I\\'m so grateful to the jury.\\'\\' \\nDefendant Neil Wampler told reporters, \"It\\'s a tremendous victory for rural America.\\'\\' \\nU.S Attorney Billy Williams, who was in charge of the prosecution, was obviously disappointed. \"While we had hoped for a different outcome, we respect the verdict of the jury and thank them for their dedicated service during this long and difficult trial,\\'\\' Williams said. \"We strongly believed that this case needed to be brought before a Court, publicly tried and decided by a jury.\\'\\' \\nNot surprisingly, Williams disappointment was shared by activists on the Left. The Oregonian/OregonLive quoted Jennifer Rokala, executive director of the Colorado-based Center for Western Priorities (CWP), one of the anti-ranching Big Green attack groups. \"We are deeply disappointed in today\\'s verdict, which puts our park rangers and scientists at further risk just for doing their jobs. The outcome of today\\'s trial will undoubtedly embolden extremist groups,\\'\\' Rokala said. \"It\\'s imperative that local, state, and federal law enforcement ensure the safety of our land managers.\\'\\' \\nHowever, Rokala and her faux environmentalist colleagues at CWP, are likely more concerned with expanding federal control over lands in the western states than with any real danger to “rangers and scientists” posed by “extremists” such as the Bundys. Rokala’s Center for Western Priorities is part of an immense network of Astroturf “environmental” organizations fronting for Big Business/Big Foundation globalists, and retailing the smears of the radical Southern Poverty Law Center (SPLC). \\nEchoing the CWP’s Rokala, the Washington Post used the verdict to cite so-called “experts” about the rise of “rightwing extremists.” Citing the subversive and discredited SPLC the Post reported: Experts say right-wing extremists were emboldened by the outcome of that standoff. The Southern Poverty Law Center issued a report stating that the Bundy ranch standoff “invigorated an extremist movement” across the country. \\nThe only violence or shooting that came out of the occupation was initiated by federal and state authorities when, on January 26 of this year, they shot to death rancher LaVoy Finicum , in a highway ambush they euphemistically called a “traffic stop.” \\nThe Bundy brothers and their father, Cliven Bundy, are still slated to stand trial on federal charges related to the 2014 standoff with federal authorities at their Nevada ranch . \\nAnd another seven Malheur Wildlife Refuge defendants are scheduled to go on trial in Oregon in February. However, it is difficult to see how federal prosecutors intend to get a conviction on these lesser occupation participants, some of whom were merely visiting supporters, if they couldn’t get a jury to convict the “ringleaders.” Photo of defendant Neil Wampler being greeted by supporters after acquittal: AP Images \\nRelated stories :'"}, "time": 1742562981.871375}