{"duration": 0.05456280708312988, "input_args": {"text": "'When Libby Chamberlain, the creator of the   Clinton Facebook group Pantsuit Nation, announced this week that she plans to publish a Pantsuit   book, she framed the publication deal as a collective victory for the group. “A book of YOU. A book BY YOU,” she wrote. “A permanent, beautiful, holdable,       shareable, tearstainable book. ” But pretty swiftly, she faced a backlash from some of the page’s members, who derided the deal as a betrayal of the group’s primary function as a private place for people to share personal stories. Many commenters asked whether people whose stories appeared in the book would be compensated, and how the profits would be spent. Some accused Ms. Chamberlain of crass profiteering. “What a  ! You had the biggest group of new political activists this country has ever seen, and you chose   and profiting off that instead of harnessing that energy to make the country better,” one member wrote on the page. “Very disappointed,’’ another group member fumed. “I was hoping this group would become a powerful force for activism to fight the evil we all have to face. You chose another direction and that’s your right of course. But my energy and money is going elsewhere. ” The book, which is scheduled to be published in May by Flatiron Books, will draw on the stories and images from the group, which now has around four million members. In her original announcement on Monday, Ms. Chamberlain encouraged people who want to submit their posts and stories to contact her, and said that she would seek permission from others to use their material. In a   post addressing irate members on Wednesday, she explained that the proceeds would be used to “support Pantsuit Nation and the causes that are central to the group. ” She also said that the Pantsuit Nation nonprofit organizations she is forming will help raise money for other   groups, including Planned Parenthood, the American Civil Liberties Union and the Southern Poverty Law Center. Some members voiced their support for Ms. Chamberlain’s plans, arguing that a book would amplify the group’s message beyond Facebook. Still, others saw the deal as another big letdown after their hopes of electing a woman to the country’s highest office were crushed on Nov. 8. “I voted for the first female POTUS and all I got was this lousy book,” one person wrote.'"}, "time": 1742562234.4716706}