{"duration": 0.051235198974609375, "input_args": {"text": "'Saturday on Fox News Channel’s “Fox  Friends,” while discussing federal courts in Hawaii and Maryland halting President Donald Trump’s new restrictions on travelers from   countries, Harvard Law professor Alan Dershowitz said if Trump’s predecessor former President Barack Obama had issued the same order, the courts would not have intervened on the constitutionality of the executive order.  “The idea of focusing so heavily on campaign rhetoric and essentially saying, look, if Obama had issued the very same order with the same words it would be constitutional, but if Trump issues it, it’s unconstitutional because he said some things about Muslims in the   to the campaign,” he said. Dershowitz continued, “That’s not the way the law is supposed to operate. And finally, the Trump Justice Department is getting smart. They are appealing this not to the Ninth Circuit where they are likely to get an adverse ruling. They are appealing it to the Fourth Circuit. The Fourth Circuit is a much more conservative court. And much more likely to uphold the travel ban, and then if the case goes to the Supreme Court and ties four to four, Trump wins. ” He added, “I actually said that this wasn’t constitutional analysis. It was psychoanalysis. There is precedent in extreme cases where legislators in enacting a statute say things that you can sometimes look to the legislative intent. But I have never heard of a case where the rhetoric of a candidate, ambiguous rhetoric to be sure  —   because I do not believe this is a Muslim ban  —  focusing on a country like Iran, the greatest exporter of terrorism, not only no vetting, it sends terrorists out in order to kill Americans. Iran has so much blood on its hands of Americans and American allies, to exclude a country like Iran from the list would be absurd. And the list  —  although for a different purpose  —   was originally designed by President Obama. So how can you say that the exclusion of six countries on the list was motivated by what Mr. Trump said when he was candidate Trump? That is not good legal analysis. I’m putting my reputation on the line —  I predict the case gets to the Supreme Court, the Supreme Court will uphold the major provisions of this ban. ” Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742562104.0543408}