{"duration": 0.06338930130004883, "input_args": {"text": "'Equally infuriating to a radical Islamist killing innocent children at a pop concert in Manchester, is the very likely possibility that it will not be the last time. [We’ve seen this tragic routine before: a radical Islamist wages violent Jihad against the Western world and, after a few days of cliché sloganeering and useless hashtags, all is forgotten.  Well, for the parents and loved ones of those who were killed, all is not forgotten. They will live forever with a hole in their hearts that can never be filled. These are the consequences of open borders, and the willingness of a society to bury its head in the sand while attempting to shame and silence anyone who dares speak the truth. The truth is this: when you flood your country with millions of   migrants from the Islamic world, you shouldn’t be “shocked” when your society acquires the same problems as the Islamic world. One plus one equals two. We can have borders, or we can have terror. No, there is no third option. This is the real world, not a sociology lecture, or CNN. You cannot force Islamists to assimilate because Islamists do not value the same things we do in the West. While most in the West view an Ariana Grande concert as an opportunity for young girls to have a fun night of singing and dancing with their friends, many in the Islamic world views it as a shameful display of dirty infidels, who deserve death for their indulgence. Manchester bomber Salman Abedi’s parents were Libyan “refugees. ” He was given refuge and even tax dollars of the very parents whose daughters he killed. Jihadists are not impressed by Katy Perry’s almost instantaneous call for “no borders” and “ ” in response to the Manchester massacre. They are emboldened by it. She, and every other pompously ignorant celebrity like her, are worse than useless. They are useful for our enemies. This pacifistic, “let’s all hold hands” reaction to the death of innocent children perfectly encapsulates why the West remains a giant sitting duck for radical Islamists. Imagine the disbelief our enemies must be feeling about how easy it is to wage war on a society that seeks to fight them with tolerance. Even after one of their caliphate soldiers bombs a teenage pop concert, one of the most popular singers on the planet welcomes more Islamists to our shores with open arms. But we shouldn’t make Katy Perry feel like the lone wolf in her suicidal delusions. After all, we’re only 6 months removed from a kumbaya President that fought ISIS with a live serenade of “You’ve Got a Friend” by James Taylor. While I, like most Americans, fear another deadly Islamic terror attack, the mainstream media’s biggest concern is  —   that’s right, you guessed it  —   “Islamophobia. ” Martha Raddatz, who gained notoriety for her appallingly biased Presidential debate moderation, lamented to George Stephanopoulos on ABC’s Good Morning America, “This is likely to fuel   backlash across Britain, across Europe. ” Don’t worry Martha, chances are there will still be plenty of niqabs worn in Manchester long after the carnage of young children is removed from the concert venue, and we have open border propagandists to thank for that. Unfortunately, for those who actually want to protect ourselves and our children from Jihadists, nitwitted celebrities and media pundits aren’t the only problem.   groups like the SPLC and ACLU have volunteered themselves to be useful idiots for radical Islamic outfits like CAIR, a notorious Muslim Brotherhood front group that has been declared a terrorist organization by the United Arab Emirates and named by federal prosecutors as an unindicted   in a   operation. Their strategy? To smear, intimidate, bully, and ultimately silence anyone who gets in the way of their   agenda. They are counting on patriotic Americans to stay silent and seated, while their   agenda marches on. Are we really going to let these open borders fanatics do to America what they’ve done to Europe? Are we really going to allow terrorist attacks to become the norm in America, as they are the in the Islamic world and, increasingly, Europe? Let the goons at the SPLC and the mainstream media call me what they want, I know what I am. I am an American who loves her country, and doesn’t want to see it diminished to the same rubble I laid under when Islamists blew up my home as a little girl. For those who want to do more than just tweet their outrage, who want to make their country, community, and family a safer place to call home, I invite you to join me, and every other   patriot at ACT for America’s National Conference this coming October in Arlington, Virginia. Go to actcon. us for more information about how you can fight back against America’s enemies. Brigitte Gabriel is a terrorism analyst and a   New York Times   author of “Because They Hate” and “They Must Be Stopped”. She is the Founder and Chairman of ACT for America, the nation’s largest grassroots organization devoted to promoting national security and defeating terrorism.'"}, "time": 1742562284.4346359}