{"duration": 0.0896601676940918, "input_args": {"text": "'At first glance, a Kiki and Herb cabaret show could come off as a bizarre and politically incorrect, yet addictive, mess. Kiki, with the faded glamour of Norma Desmond, sings deranged takes on Top 40 hits and slurs through tactless banter about current events. Herb, with   gray hair and a kitschy suit, hammers a keyboard and sips Canadian Club. A medley might start with “Frosty the Snowman” and end with Patti Smith. From 1993 until 2008, Kiki and Herb, known offstage as Justin Vivian Bond and Kenny Mellman, performed under the guise of failed, septuagenarian lounge singers, earning a devoted audience that included luminaries from the pop, film and fashion worlds. What started small in San Francisco evolved into a Broadway show and ended with a   farewell at Carnegie Hall. And now, after eight years, Kiki and Herb are reuniting for a monthlong engagement beginning Thursday, April 21, at Joe’s Pub, as part of the commissioning program New York Voices. The show, “Seeking Asylum! ,” sold out within minutes. “I guess this is how ‘Star Wars’ fans must feel when a new movie comes out,” said Kathleen Hanna, a feminist punk musician and a longtime fan. Ms. Hanna first came across Kiki and Herb in the late 1990s when visiting her boyfriend, Adam Horovitz of the Beastie Boys, in New York. She was living in North Carolina then and considering a move to either New York or Chicago. She thought the cabaret act was weird, brilliant, even devastating. “This is the New York of my fantasies,” she remembered thinking. Forget Chicago, Ms. Hanna told her boyfriend, “I want to be where Kiki and Herb are. ” Now, she plays with Mr. Mellman in her band the Julie Ruin, and Mr. Horovitz, now her husband, accompanies another downtown cabaret fixture, Bridget Everett. Kiki and Herb fans often have stories like this, in which they stumble on a new cabaret act and end up obsessed. Doug Wright, the Pulitzer   playwright and an occasional director of Kiki and Herb shows, called them “Greek tragedians in tacky lapels and stiletto heels” who turn familiar songs into “  lamentation. ” After seeing their act for the first time, he said, “In some dark little corner of my heart, I wanted them to adopt me. ” But when the act started in San Francisco, Mr. Mellman and Bond, who uses the   honorific Mx. counted only a small number of regulars in the audience (a “boutique audience,” Mx. Bond called them). They first performed together in 1989, in Mx. Bond’s cabaret show “Dixie McCall’s Patterns for Living. ” At the time, Mx. Bond was 26 and considering a career as a professor of art history. Mr. Mellman was 21, in college and writing poetry while living on Market Street. One night, during a later engagement at Cafe du Nord, Mx. Bond was sick and told Mr. Mellman: “I’m not going to be able to sing. So I’m going to be Kiki, and you’re going to be Herb, and we’re going to do this material in the style of old vaudeville people. ” Herb drank Scotch, they decided, and Kiki drank Canadian Club and ginger ale. (Later, Herb took up Canadian Club because they couldn’t afford two bottles of liquor.) The act was improvised but well received. “From the moment this coalesced, I felt it was artistically right,” Mr. Mellman said. They found inspiration in real people. Herb, for example, was a lot like Eddie, who played piano at Athens by Night, the tiny Greek restaurant that first hosted “Dixie McCall’s. ” “Eddie would get drunk and talk about his cat,” Mr. Mellman said. “And he’d weep on his piano keys. I was like, ‘Oh, that’s what happens to an old piano player. ’” Kiki was based on the mother of Mx. Bond’s childhood friend Nancy. The woman had been a showgirl in Baltimore in the 1950s, but gave up performance for parenthood and later had terminal cancer. Mx. Bond remembers radiation pencil marks on her neck, but also   fingernails and a turban on her head. “When I first met her, she started doing a   in my friend’s bedroom, and she said, ‘I started out as a dancer in the 50s, and I still got it,’” Mx. Bond said. “And that became one of Kiki’s signature lines. ” The woman, like Kiki, was also very opinionated about politics. One day, she was sick and lying in bed, Mx. Bond said, and watching President Reagan on TV. “She looked at me and said, ‘You know, the saddest day of my life was the day John Hinckley missed. ’” When Kiki and Herb first began performing regularly, Mr. Mellman said, “San Francisco was one big protest. ” People were angry about AIDS and fighting for gay rights, and Kiki’s banter catered to them. When the act moved to New York in the late 90s, Mx. Bond wove humor with empowering political statements and frank talk about race and other issues. In a video from 1999 at Flamingo East in Manhattan, Kiki tells the story of her fictional son, Bradford. It begins with a joke: “He would say we’re estranged, perhaps. ” Then Kiki says that Bradford called to say he has AIDS. “I said, ‘You’re calling me on Mother’s Day to say you’re dying of AIDS,’” Kiki slurs, “and he says, ‘No, Mother, I’m living with AIDS. ’” The audience whistles and cheers, but Kiki doesn’t let the political message linger. She ends with another joke: “I sent him a card and wrote, ‘I hope you’re feeling chipper, get well soon.’ He could have picked a better day. ” The act works only because of Mx. Bond and Mr. Mellman’s “100 percent commitment” to the characters, said the fashion designer Isaac Mizrahi, a friend and occasional collaborator. The actress Molly Ringwald, another friend, recalled, “The transformation to Kiki was so complete that it felt like she existed somewhere in the ether, and Justin was simply channeling her. ” This method acting extends to their seemingly misguided musicianship. Both Mx. Bond and Mr. Mellman are classically trained, and “the way I sing as Kiki is very difficult,” Mx. Bond said. “Dolly Parton said, ‘It takes a lot of money to look this cheap.’ Well, it takes a lot of work to look this haphazard. ” The actress Tilda Swinton referred to their performance as a “truly beautiful” partnership. “It’s a love story,” she said, “if one played out through the tantalizing veils of mutual frustration and   screaming. ” Over the years, Kiki and Herb moved from downtown basements to the mainstream, even Off Broadway at the Cherry Lane Theater. In 2004, they gave a   farewell performance at Carnegie Hall, with guests like Mr. Mizrahi and Jake Shears of the Scissor Sisters. But they were back onstage the next year, touring and eventually arriving on Broadway. The show was nominated for a Tony Award but lost to the ventriloquism act “Jay Johnson: The Two and Only!”  —   or, as Mx. Bond and Mr. Mellman said, “We lost to a puppet. ” Then, in 2008, they gave another performance at Carnegie Hall that would turn out to be their last in New York. “We reached a crossroads,” Mx. Bond said. “To make a commitment to those characters would have been a career choice. Joan Rivers could never not be Joan Rivers. Robin Williams was very popular as Mork. And he could have been that character for his entire life, but he wanted to do other things. ” Mx. Bond wanted to be more like Mr. Williams Mr. Mellman was fine as Rivers. So Kiki and Herb ended suddenly, and not amicably. They didn’t speak for five years. In their time apart, they thrived individually, pursuing projects that for years had taken a back seat to Kiki and Herb. Mx. Bond wrote a memoir, has had three solo   shows and is behind a fragrance, “Afternoon of a Faun” (named after the 1912 Nijinsky ballet, which Mx. Bond called “the first queer performance”). Mr. Mellman contributed to other cabaret acts, like Ms. Everett’s, and with Ms. Hanna founded the Julie Ruin, which has a new album scheduled for release on July 8. In 2013, Mx. Bond had a 50th birthday party at Le Poisson Rouge and wanted to invite Mr. Mellman, but didn’t. After a bittersweet email exchange, Mx. Bond said, “We acknowledged to each other that we missed being together, and that we meant a lot to each other. ” Their renewed friendship, combined with Mx. Bond’s   retrospective underway at Joe’s Pub, made for a natural opportunity to reunite as Kiki and Herb. And not a moment too soon for some fans, like Ms. Swinton, who said, “I’m longing for the sight and rhythm of Kiki’s   embonpoint and the deathless glamour of her style, updates on Herb’s mental health and her   analysis of the world of political cut and thrust. ” For their reunion, Mx. Bond and Mr. Mellman have also brought on board their longtime costume designer, Marc Happel, the director of costumes at New York City Ballet. He has been working on Kiki and Herb’s outfits in his off hours because, he said, “How often do you get to dress a failed, drunk cabaret singer?” “Seeking Asylum!” will address where Kiki and Herb have been since Carnegie Hall. Without giving too much away, Mx. Bond said, “Herb had a scenario that got complicated when he was visiting Southeast Asia as a sexual tourist. ” Kiki has been in   Syria, where “she has a long history with the Assad family,” Mx. Bond said. “But you don’t know what people are like. ” With a signature coy smirk, Mx. Bond added, “Some of the most evil people in the world are charming. ”'"}, "time": 1742628460.8027322}