{"duration": 0.12126398086547852, "input_args": {"text": "' \\nIn 2002, Elizabeth Smart was abducted during the night at knifepoint from her bedroom at only 14-years-old.\\nHer kidnapping quickly garnered national media attention. Her media savvy parents worked overtime to keep her story in the news throughout the ordeal.\\nDuring her 9 months in captivity she was raped repeatedly, often as many as 3-4 times per day. Each day was a mental and physical war for her to survive at the hands of her kidnapper and rapist, Brian David Mitchell.\\n \\nRelated Stories American Student Presumed Dead Turns Up In North Korea As Kim Jong Un’s Personal Tutor With the help of an America’s Most Wanted television broadcast, the police were able to locate and free her on March 12, 2003. Her disappearance and subsequent miraculous return to her family made her one of the best known teenagers in America at the time.\\nJustice wasn’t finally served until 2011 when Mitchell received two life-terms in a federal prison.\\nSmart, now 28 years old, is married and a mother with a family of her own. Her daughter, Chloe is now 20 months old.\\nAfter a long day of working I like to slip back to my happy place, with Chloé on horseback. #daydreaming \\nA photo posted by Elizabeth Smart (@elizabeth_smart_official) on Aug 15, 2016 at 7:30pm PDT \\n\\n \\nNow as a parent herself, Smart has realized how horrible the kidnapping was for her parents.\\n“When I go back to my own situation, I almost think it was worse for my parents than for me because I knew that I was alive, but they didn’t know,” she told People magazine.\\n“I always knew how much they loved me, but until I had my own daughter I didn’t realize how all-consuming that is. The worst thing in the world would be if something happened to my little girl,” she continued.\\nSmart has made it her life’s work as a reporter, teacher and activist to make sure other parents, families, victims and survivors are supported, “Nobody should have to go through the aftermath of a terrible crime alone.”\\nCall if you or someone you know needs help. Report it! #StopChildAbuse w/ @helpspreadthis https://t.co/FUqHbDoyoJ pic.twitter.com/laWxOfcu9G \\n— Elizabeth Smart (@ElizSmart) August 14, 2016 \\nSmart now works for Crime Watch Daily a program hosted by Chris Hansen. With one season under belt, she’s signed on for a second season.\\n \\nTrending Stories Frustrated With Media Bias, Trump Campaign Takes Its Case Directly To Voters With Nightly Show On Facebook Independent Voters Push Trump To The Front In Florida And Ohio RNC Official Takes CNN Host To Task For Claiming There Is No Media Bias Finding purpose in her work, she told People, “I decided to continue because sharing the stories of survivors is a way to keep their cases in the spotlight and hopefully give them a better chance of bringing criminals to justice.”\\n\\nSpeaking today to a gathering in Oklahoma, Smart said, “It’s not what happens to us that defines who we are, it’s what we decide to do about it.”\\nWhat do you think?'"}, "time": 1742564611.2474134}