{"duration": 0.09537148475646973, "input_args": {"text": "'ORLANDO, Fla.  —   It was a wrenching ritual that has become all too familiar for President Obama. One by one on Thursday, inside an arena in downtown Orlando where friends and relatives of the victims of the nation’s deadliest mass shooting had congregated, Mr. Obama embraced mourners sick with loss. He told them that the nation stood with them and that his own heart was broken, offering words of comfort for a tragedy that he confessed he could not fathom. “Their grief is beyond description,” Mr. Obama said after a   meeting with the mourners. “Through their pain and through their tears, they told us about the joy that their loved ones had brought to their lives. ” Behind closed doors, Mr. Obama told the grieving that it was the 15th time during his      tenure that he had had to offer these sorts of condolences after a shooting, according to those who attended. “There were times when he choked up,” said Angelica Jones, a performer at the Pulse nightclub, where a gunman killed 49 people and wounded 53 on Sunday. “And it’s a hard thing to do when you’ve got mothers crying out. He was up to it. ” Mr. Obama has had plenty of practice for this particularly grim task. The settings vary, but the pattern is chillingly constant. Mr. Obama’s armored limousine deposits him at a nondescript building big enough to hold a large number of families whose loved ones have died in a mass shooting somewhere in America. Away from the news cameras that normally track his every interaction, he enters rooms thick with grief and the hushed voices of people in shock. He grasps for words of sympathy, comfort and condolence and offers long, tight embraces that the mourners will remember far more vividly than his words. His visit to Orlando came four days after the massacre. Accompanied by Vice President Joseph R. Biden Jr. the president entered the Amway Center, about two miles from the club, and the two men took turns hugging and grieving with the scores of people who lost sons, daughters, siblings, partners and friends. “Our hearts are broken, too,” Mr. Obama said he told them, after placing 49 white roses at a makeshift memorial nearby to commemorate each of those killed. In an emotional statement to reporters before he returned to Washington, Mr. Obama said the encounters with mourners underscored his determination to change the debate over gun restrictions and enact the sort of measures that might have prevented the tragedy. “As has been true too many times before, I held and hugged grieving family members and parents, and they asked, ‘Why does this keep happening? ’” Mr. Obama said. They pleaded for more to be done to stop the carnage, he said, adding, “Those who defend the easy accessibility of assault weapons should meet these families. ” Beyond politics, the trip was a moment for the president to play the somber official role of consoler in chief. It was also the setting for a deeply personal and private set of encounters in which Mr. Obama, better known for his cool and unruffled temperament, dispenses with the trappings of his office and becomes an emotional father identifying with parents who have lost children. “The president understands that he is a symbol of the country, and when he travels to a community and meets with a family that has endured a terrible tragedy, he’s offering a message of condolence and comfort on behalf of the American people,” Josh Earnest, the White House press secretary, said on Wednesday. “But it would be impossible for him to not be personally affected by these kinds of conversations and these kinds of interactions,” he added. In such instances, Mr. Earnest said, the president “draws on his faith. ” As Mr. Obama comforted the mourners, his critics in Washington were blaming him for Sunday’s tragedy. Senator John McCain, Republican of Arizona and his 2008 presidential rival, told reporters on Capitol Hill that Mr. Obama, through his policy decisions, was “directly responsible” for the carnage because he had failed to thwart the rise of the Islamic State. The president has called visits like the one to Orlando among the most difficult duties he performs. Spending time with families who lost young children in the shooting rampage at Sandy Hook Elementary School in Newtown, Conn. in 2012, was the “hardest day of my presidency,” he said afterward. “And I’ve had some hard days. ” So over and over again on Thursday, the president hugged the mourners tightly, relying on body language almost more than words to convey his support. “He took time to go to each family individually and embrace them, and there was no rush or a sense he wanted to be anywhere else,” said Azsia Finn, a manager at Pulse. “It was embracing, hugging, just very warming. It felt like he cared. ” Amid a blur of sorrow and disbelief, these embraces have stood out to many of the mourners Mr. Obama has met after earlier tragedies. “He hugged each one of us individually  —   and I mean hug, so that I was able to smell his cologne,” said the Rev. Sharon Risher, 57, who lost her mother, Ethel Lance, and two cousins in the shooting in Charleston, S. C. last year, and met privately with Mr. Obama the next week. “It was not a little pat on the back. The intimacy of that hug is what I’ll always remember. ” Mr. Obama takes his time with each family, listening to details that mourners are eager to offer about their lost loved ones. It is at once intimate and awkward he is aware of how disorienting it is for people to be meeting the president of the United States at the worst moment of their lives. Many of them forget they are talking to the president. At a high school in Newtown, Conn. in 2012, Mark Barden, whose    son, Daniel, was among the 26 killed at Sandy Hook two days earlier, decided, in what he now calls a fog of shock and trauma, to lecture Mr. Obama on the importance of spending time with his children. “He looked me in the eyes and said, ‘I’m coming from a recital right now,’ ” Mr. Barden said in an interview, adding that he now finds the episode “horrendously embarrassing. ” But Mr. Obama could relate, he said. “He was looking at this 100 percent as a father,” Mr. Barden said. “He feels it in his heart as a human being, and it transcends his role as the leader of our country. ” Roxanna Green  —   whose    daughter,   Green, was one of six people killed in a 2011 shooting in a supermarket parking lot in Tucson where Representative Gabrielle Giffords was holding an event  —   said she had campaigned for Mr. Obama with her daughter and mother and had often dreamed of meeting him. “But you never want to receive a visit like that from anybody,” Ms. Green, 50, said in an interview. “He said she was a beautiful girl, and he’s so sorry, and it was just a horrible loss, and his girls are about the same age,” she recalled.'"}, "time": 1742562305.3825507}