{"duration": 0.10315990447998047, "input_args": {"text": "'Topics: Donald Trump , Bill Cosby , Sexual Assault , Roger Ailes , support groups , billionaire Monday, 31 October 2016 When translated Bill Cosby\\'s shirt says: \"If you can see this notice, you consent to unconscious butt sex.\" \\nDonald Trump, the man who heaped blistering criticism on Bill Cosby for drugging and raping women without a prenup, is now joining forces with the embattled comedian. \\nB.L.A.M., or Billionaire\\'s Lives Also Matter, is the new support and counseling organization that has also become the latest vessel of reality denial for Donald Trump the former reality TV star. \\nTrump explained his turnaround on Bill Cosby and also the creation of the new support group when he talked to CNN\\'s Jake Tapper last night. \\n\"You know Bill was saying all along that these women were lying and just trying to find ways to sue or get money from him, and now I understand. Now that crooked Hillary and the rigged media have set these women up to falsely accuse me of sex--uh, kissing and touching them, it\\'s really stressful for me, of course I can take it--and these women all of the sudden have lawyers and the press on their side, I mean they have more rights than the people they are wrongfully accusing, and meanwhile everybody says, \\'Well Trump and Cosby are billionaires, maybe they did it, but their lives are so good and so what if some bimbo or old hag says they did this or that twenty five years ago.\\' But it never happened Jake, none of it, all lies.\" \\nThe CNN Host and Anchorman Jake Tapper squinted in disbelief as Trump bellowed on. \\n\"And so, Jake, that\\'s why we need our own support group, because billionaire\\'s lives do matter. People have no idea how it feels, what\\'s happened to us--I mean they can\\'t relate because most people aren\\'t\\' billionaires. \\nTapper followed up to Trump\\'s incoherence, asking: \\n\"Aren\\'t you guys just avoiding culpability by denying the accusations of a hundred plus women between you and Cosby, and then creating a support group for the so called \\'wrongfully accused?\\'\" \\n\"Excuse me, Excuse me Jake,\" Trump started before Tapper even finished. \"People are always talking about how the victims have to be heard and treated with kid gloves, well what about us? We\\'re victims--and I can\\'t even describe how it felt to hear Bill and Roger [Ailes] tell their stories, and I thought \\'Oh my God, that\\'s my story\\' and if I had a heart, I would have cried then, but my shallowest reaction instead was to try and monetize the situation, and so the first meeting of B.L.A.M. will be a pilot for a new reality show by the same name.\" \\nThe Spoof\\'s own legal analysts say Donald Trump, Bill Cosby, and Roger Ailes would be exposing themselves to even more lawsuits if they were foolish enough to air Billionaires Lives Also Matter. It\\'s also highly unlikely that Trump\\'s former partner NBC would pick up such a show, some say Trump will air the show himself if there are no takers for B.L.A.M. \\nCould this be the start of Trump TV? \\nBill Cosby later released a statement to the press that read, \"The dingy doo in da dingy bop, dee boop dee boop dee doo doo, buh razbatax\" Make XRhonda Speaks\\'s day - give this story five thumbs-up (there\\'s no need to register , the thumbs are just down there!)'"}, "time": 1742561972.76578}