{"duration": 0.16239571571350098, "input_args": {"text": "'Iraq’s Skies Darken as Islamic State Torches Oil Posted on Oct 28, 2016 \\nBy Kieran Cooke / Climate News Network Photo: Kuwait, 1991. Today, the Islamic State copies Saddam Hussein, threatening Iraq’s environment with oil blazes. (Lt. Steve Gozzo USN via Wikimedia Commons) \\nLONDON—Even at the height of the day, the skies in many parts of northern Iraq are dark as ISIS torches oil wells and oil-filled defensive trenches in its retreat. Artillery fire and bombing raids by US aircraft and others battling Isis are also causing conflagrations at oil installations. Aid teams near the town of Qayyarah, about 80 kilometres south of the Isis stronghold of Mosul, talk of escaping civilians being covered in oil residues . “Everywhere is covered in a fine dusting of black soot and grime”, one aid worker from the Save the Children charity told the BBC. “And the children we met were covered in it—their hands were black, their feet were black and their hair was matted…they were coming out in rashes, developing problems with their lungs.” Deliberate pollution There are fears that as ISIS comes under ever greater pressure it will unleash “scorched earth” tactics, setting alight ever more oil wells and deliberately polluting the waters of the Tigris and Euphrates, two of the region’s main rivers, which supply water and power to millions. Setting oil fields alight could also have wider climate-related consequences. During Saddam Hussein’s invasion and subsequent retreat from Kuwait in 1990/91, the Iraqis set alight nearly 800 Kuwaiti oil wells: at one stage—in March 1991 – it was calculated that up to six million barrels of oil were being burned each day . The result was daytime darkness and long plumes of black smoke across a wide area of the Gulf. Though the long-term impact of Kuwait’s oil fires on the climate is still being assessed, the release of vast amounts of climate-changing greenhouse gases into the atmosphere is considered to have added to the problems of warming, on both a regional and a global scale. The Gulf region is one of the fastest-warming in the world, with many areas forecast to be uninhabitable in the not too distant future because of higher temperatures and chronic water shortages. Long-term damage Pollution from the Kuwait oil fires and ruptured oil pipelines are also believed to have caused serious long-term damage to the waters of the Gulf. There are fears that, with pressure on the group mounting, similar developments could unfold in northern Iraq as Isis torches oil installations 25 years later. In recent years Iraq has been trying to ramp up its oil production in order to raise more revenues—partly to fund the war against Isis. But much of the development of Iraq’s fossil fuel resources has been badly planned and mismanaged . The World Bank says that, globally, approximately 140 billion cubic metres of natural gas produced together with oil are burned or flared off each year— adding 350 million tonnes of carbon dioxide emissions to the atmosphere . “From exploding fuel barrels to exposure to carcinogenic chemicals and inhalational toxins, these makeshift oil refineries will have a long-lasting health impact. ...” Iraq is now one of the world’s leading gas-flaring countries: a lack of pipelines and infrastructure means that its gas is mostly burned off. Meanwhile the country has been forced to import large amounts of gas from neighbouring Iran in order to meet its energy needs. Across northern Iraq and eastern Syria—the country’s main oil-producing region—Isis controls large numbers of oil wells and derives considerable income from selling fossil fuels on the black market . A lack of maintenance and expertise means that many of these installations are a hazard to the environment. Badly-run oil facilities also cause considerable human suffering. A recent report by Pax , a Netherlands-based church grouping, says that more than 5,700 makeshift oil refineries are operating in the ISIS-controlled Deir ez-Zor area of Syria. Thousands of civilians, many of them children, are forced to work at these crude, basically-run facilities. “From exploding fuel barrels to exposure to carcinogenic chemicals and inhalational toxins, these makeshift oil refineries will have a long-lasting health impact on communities and their environment”, says the report. \\nKieran Cooke, a founding editor of Climate News Network, is a former foreign correspondent for the BBC and Financial Times. He now focuses on environmental issues. \\nAdvertisement'"}, "time": 1742563175.76795}