{"duration": 0.16877341270446777, "input_args": {"text": "'Mose Allison, a pianist, singer and songwriter who straddled modern jazz and Delta blues, belonging to both styles even as he became a touchstone for British Invasion rockers and folksy troubadours, died on Tuesday at his home in Hilton Head, S. C. He was 89. His death was confirmed by the singer and songwriter Amy Allison, his daughter. Mr. Allison began his professional career as a piano player, at a time when his style  —   percussive and jaunty, carried along by a percolating beat  —   suited the sound of the jazz mainstream. In addition to leading his own trio, he worked with some of the major   bandleaders of the late 1950s, including the saxophonists Stan Getz and Gerry Mulligan. But he found greater success, and a singular niche, as a singer of his   pungently observant songs, beginning in the early ’60s. For the next 50 years he worked almost exclusively as the leader of his own groups. Mr. Allison used his cool, clear voice to conversational effect, with an easy blues inflection that harked back to his upbringing in rural Mississippi. Backing himself at the piano, he favored a loose call and response between voice and instrument, or between right and left hands, often taking tangents informed by the complex harmonies and rhythmic feints of bebop. His artistic persona, evident in his stage manner as well as his songs, suggested a distillation of folk wisdom in a knowing but unpretentious package. He was especially revered by 1960s English rockers who idolized the blues, and who saw in his example an accessible ideal. John Mayall recorded “Parchman Farm,” Mr. Allison’s ironic adaptation of a prison blues so did the English    singer Georgie Fame. Other songs by Mr. Allison found their way onto albums by the Yardbirds, the Kinks and the Clash. The Who based their   anthem “My Generation” partly on his “Young Man Blues,” which the band also featured as the opening track on its 1970 album, “Live at Leeds. ” Mr. Allison’s tunes were covered almost as widely by his fellow Americans, including the blues artists Paul Butterfield and Johnny Winter, the   singer Bobbie Gentry and, more recently, the jazz vocalist and pianist Diana Krall. The Pixies, a     band, named an album track “Allison” in his honor. In a 1986 interview with the pianist Ben Sidran, conducted for NPR, Mr. Allison grouped his material into three categories: slapstick, social comment and personal crisis. “Sometimes,” he added, “all three of those elements wind up in a tune. ” Many of his songs inhabit an air of wry amusement or exasperated skepticism, often pivoting on a single phrase. He skewered hypocrisies in “Everybody’s Cryin’ Mercy,” recorded by Bonnie Raitt, and mastered the sardonic   in “Your Mind Is on Vacation (And Your Mouth Is Working Overtime),” covered by Elvis Costello. For all of his   eminence in rock, Mr. Allison never stopped seeing himself as a jazz artist. “My definition of jazz is music that’s felt, thought and performed simultaneously,” he said in “Ever Since I Stole the Blues,” a 2006 BBC documentary. “And that’s what I’m looking for every night. ” Mose John Allison Jr. was born on Nov. 11, 1927, on a family cotton farm near Tippo, Miss. His mother taught elementary school and his father, a   stride piano player, owned a general store. A service station across the road had a jukebox, on which Mr. Allison heard blues singers like Memphis Minnie and Tampa Red. He began taking piano lessons at 5 and was playing in bands as a young teenager  —   around the same time he wrote his first song, “The   Palmolive Plan,” a satirical jab at radio commercials in the style of the saxophonist, singer and bandleader Louis Jordan’s jump blues. His main hero then was Nat King Cole, a   jazz pianist who had begun singing with his trio in a smoothly urbane style. For a while Mr. Allison also played the trumpet, on local gigs and, after he joined the Army in 1946, with the 179th Army Ground Forces Band. He had put in a year at the University of Mississippi before his service, and he briefly returned to Ole Miss  —   one reason, perhaps, for his sobriquet “the William Faulkner of jazz,” popularized by Mr. Sidran. But he soon lost interest in his chosen field, chemical engineering. He ended up graduating from Louisiana State University with an English degree and then briefly worked the Southern club circuit. Moving to New York City in 1956, Mr. Allison found work as a jazz pianist, initially with the saxophonist Al Cohn. He joined a successful quintet led by Mr. Cohn and his fellow saxophonist Zoot Sims. His style had evolved, in line with modernists like Lennie Tristano and Thelonious Monk, but he still had a trace of the South in his earthy attack, and in his untroubled relationship with blues inflection. Mr. Allison recorded his debut album, “Back Country Suite,” for Prestige in 1957. A song cycle for piano trio inspired by his   roots, it was well reviewed but not a great commercial success. The same was true of “Local Color,” his second album, which introduced “Parchman Farm. ” At the time, his unorthodox musical blend often ran up against preconceived notions of style. “In the South, I’m considered an advanced bebop type,” he told DownBeat magazine in 1958. “In New York, I’m considered a country   type. Actually, I don’t think I’m either. Maybe I’m a little of both. ” Still, his star rose enough for him to be signed by Columbia Records, which in 1960 released “The Transfiguration of Hiram Brown,” an ambitious suite with a loosely autobiographical theme: the excitement and disillusionment of a young man who has moved from the country to the city. (Mr. Allison later returned to this subject on “If You’re Going to the City,” a signature tune.) But “Transfiguration” produced middling sales Prestige did far better with a 1963 compilation of his vocal sides, simply titled “Mose Allison Sings. ” By that time, Mr. Allison’s move to Atlantic Records had begun to sharpen his reputation as a singer and songwriter. His first album for the label, “I Don’t Worry About a Thing,” released in 1962, introduced several of his   tunes, including the title track, a blues that deflates its own trite expression with a caustic addendum: “’Cause I know nothing’s going to be all right. ” When Atlantic released “The Word From Mose” in 1964, the album cover featured a memorable tagline next to Mr. Allison’s photograph: “Words of wisdom from the jazz sage. ” Rather than make a pop or    album for the label, Mr. Allison stuck to his hybrid style, and his relatively modest commercial profile. He settled down on Long Island, where he lived for more than 40 years with his family before moving to Hilton Head Island. In addition to his daughter Amy, Mr. Allison is survived by his wife of 65 years, Audre two other daughters, Janine and Alissa Allison a son, John and two grandchildren. While Mr. Allison released fewer albums from the   on, he never stopped writing songs, in his dryly satirical vein. The title track of one album in the ’80s was “Middle Class White Boy. ” A later album  —   released in the early 1990s, when he was 66  —   opens with “Certified Senior Citizen,” followed by its incredulous pushback, “This Ain’t Me. ” For many years Mr. Allison kept up a busy touring schedule, typically with a trio. He reached some of his biggest audiences as an opening act for Van Morrison, who in 1996 made the album “Tell Me Something: The Songs of Mose Allison,” with Mr. Sidran and Mr. Fame. (Mr. Allison turned up as a guest on a couple of tracks.) Mr. Allison’s final studio album, “The Way of the World,” was released on the British independent label   in 2010. Produced by Joe Henry, who had coaxed him out of semiretirement, it finds him in an autumnal but still trenchant frame of mind, despite plaints to the contrary on the opening tune, “My Brain. ” The title track, set at a saunter, has the bittersweet resignation of an old man taking stock of what he’s seen. A live album recorded in 2006, “Mose Allison American Legend, Live in California,” was released in 2015. In recent years Mr. Allison stopped performing but kept receiving accolades. A marker with his name and biographical details was added to the Mississippi Blues Trail in 2012. The next year, he was recognized as a National Endowment for the Arts Jazz Master, the highest honor for jazz musicians. At the induction ceremony in Manhattan, Mr. Allison accompanied his daughter Amy at the piano in a version of his ballad “Was. ” A parlor waltz with connotations both mortal and memorial, it begins with some   wordplay, quickly turning poignant:'"}, "time": 1742563321.1239703}