{"duration": 0.06150698661804199, "input_args": {"text": "'Thomas Frank Explores Whether Hillary Clinton and the Democratic Party Will Address Inequality Posted on Nov 1, 2016 \\nBy KiMi Robinson Robert Scheer and Thomas Frank. \\nThomas Frank’s writing about electoral politics and and its impact on American culture has been published for decades in places like Harper’s Magazine, The Wall Street Journal and his 2004 novel, “What’s the Matter with Kansas?” In his latest book, “Listen Liberal: Whatever Happened to the Party of the People?” the journalist and political analyst tackles the question of what changed within the Democratic party to make it become a “ liberalism of the rich .” \\n“The Democratic Party itself has changed,” Frank told Truthdig Editor in Chief Robert Scheer during an episode of “ Scheer Intelligence ” this year. “What’s changed about them is the social class that they answer to, that they respect, that they come from.” \\nThe trend has gotten worse. \\n“Democrats look at Wall Street, and they see people like themselves,” he said in an interview with Scheer during the Democratic National Convention in July. \\nAdvertisement Square, Site wide \\nOn Tuesday night, Frank will join Scheer at the University of Southern California to discuss “Listen Liberal” and his analysis of Hillary Clinton during this election cycle, from her public views on inequality in United States to her promises to tamp down greed on Wall Street. The conversation will be live streamed on our Facebook page at around 7 p.m. PDT. \\nIn March, Frank summarized his complex investigation of the Democratic Party and the answers he found: \\nAnd you know, we call it inequality; it is the one great problem that we have. And so my, the question in the book is […] the Democrats have been talking about inequality forever. This is why they exist as a party, is to take this on. Why haven’t they been able to do anything about it? And the answer isn’t what you think. You know, it’s not just because Republicans are so diabolically clever and stop them all the time. And it’s also not just because of the money that is sloshing around in politics, although that’s […] a huge part of the story. But the answer is because the Democrats aren’t who we think they are. You know, they talk about inequality, but their heart really isn’t in it. Income inequality is really not something that they have cared about for a very long time. You know, there are individuals here and there who do, but you talk about people like the Clintons—I mean, Hillary Clinton, her concern for inequality is, this is, I would say is almost completely feigned. \\nFrank also joined Scheer earlier this week to promote “Listen Liberal.” Watch a portion of the discussion below: \\n</p><p>'"}, "time": 1742564620.3624253}