{"duration": 0.08476972579956055, "input_args": {"text": "'Terry Jones, an original member of Monty Python, has a form of dementia that is affecting his ability to communicate, his family said in a statement. The statement, published on Thursday on the website of the British Academy of Film and Television Arts in Wales, also known as BAFTA Cymru, said: “Terry has been diagnosed with primary progressive aphasia, a variant of frontotemporal dementia. This illness affects his ability to communicate, and he is no longer able to give interviews. ” On Friday, Ben Timlett, a producer on one of Mr. Jones’s films, said in an email that Mr. Jones’s son Bill confirmed that the statement had been released to BAFTA Cymru on behalf of the family. BAFTA Cymru chose Terry Jones  —   a Welsh comedian known for his Python characters like a doting mother of a coal worker son criticized for being a slacker by his playwright father and an everyday Superman who needs his bicycle repaired  —   to receive its award for Outstanding Contribution to Film and Television. Hannah Raybould, the director of BAFTA Cymru, said a retrospective of Mr. Jones’s work starting from 1969 would still be celebrated at an awards ceremony in Cardiff on Oct. 2. “Terry is proud and honored to be recognized in this way and is looking forward to the celebrations,” the statement said. Lydia Jones, a spokeswoman for BAFTA Cymru, said Friday that the organization had been told there would be no further details on Mr. Jones’s condition. Primary progressive aphasia is a rare nervous system syndrome that affects a person’s ability to express his or her thoughts and understanding, or to find words, according to the Mayo Clinic. Symptoms begin gradually, often before age 65, and worsen over time. The news of the diagnosis was also reported by the BBC and Britain’s National Press Association. The announcement of Mr. Jones’s illness dominated Monty Python fan sites on Friday, where it was described as “sad” and “terrible” news. Eric Idle, a   of the ribald, outrageous and internationally acclaimed British troupe, tweeted thanks to fans for their support while noting Mr. Jones’s participation in the 2014 stage reunion of the comedy gang. Mr. Jones, 74, was born in Colwyn Bay, a seaside community on the north coast of Wales. He has written and directed dramas, presented documentaries, composed operas and penned short stories, as BAFTA Cymru noted. But it is his work in the Monty Python television series, which was brought to the stage in London in 2014, that arguably contributed most to his fame. He worked on some of the troupe’s   films, including “Life of Brian,” 1979 (director and a writer) “The Meaning of Life,” 1983 (a writer and, with Terry Gilliam, a director) and “Monty Python and the Holy Grail,” 1975 (a writer and  ). Last year, Mr. Jones released the documentary  “Boom Bust Boom,” about how the economy cycles through periods of growth and collapse. “This film is about the Achilles’ heel of capitalism,” Mr. Jones says at the opening of the film. “How human nature drives the economy to crisis after crisis, time and time again. ” A review in The New York Times called it ominous but enjoyable. In addition to   Mr. Jones helped to direct the project.'"}, "time": 1742562675.1176827}