{"duration": 0.17096447944641113, "input_args": {"text": "'The politics of populism and mudslinging undermines democracy By Linda S. Heard Posted on November 8, 2016 by Linda S. Heard \\nOur world is on the cusp of a new era. Traditional taboos are being smashed. Respect has become an old-fashioned word. Nothing is too low or too dirty to be ignored, overlooked or even applauded by some. \\nThe rise of antiestablishment popularism plays to the lowest common denominator and is potentially divisive and corrosive of values held dear for generations. We’ve witnessed how a populist candidate spouting what he imagines the struggling sectors want to hear has not only lowered the tone but has dragged many of his supporters and rivals down to the same level. \\nThe American political sphere has turned into a swamp of muckraking, hatred of the other and threats of violence to the extent that white supremacist militias are preparing to attack African Americans if their candidate doesn’t make the White House. \\nIt’s suddenly okay for the son of one to announce the former head of the Ku Klux Klan “desperately needs a bullet in the head.” What happened to judicial process? On the other hand Democratic presidential candidate Hillary Clinton cynically attempted to woo African Americans by appearing on the stage with her new buddies, celebrity black rappers. \\nRobert de Niro’s video urging voters not to support Republican presidential candidate Donald Trump, adding he would love to punch him in the face went viral. Trump supporters claim they are a ‘movement’ and threaten revolution if he fails to win an election they believe may be ‘rigged.’ Republicans anxious to keep their grip on Congress have threatened to block Clinton’s initiatives at every turn. \\nEven the feuding Justice Department and the FBI aren’t exempt from the ire. Both are being hit by accusations of interfering in the political process. The country that’s stood as the greatest example of democracy and the rule of law is gradually embracing the law of the jungle. I’m amazed that most Americans see nothing amiss about their president, his wife and his vice-president spending days stumping for their candidate. Isn’t a US president supposed to represent all Americans? \\nThere are echoes within the UK where politicians still quarrel over the validity of a referendum over Britain’s exit from the EU. The High Court’s judgment to the effect that the prime minister doesn’t have the authority to take the country out without a parliamentary vote has resulted in media attacks on judges whose reputations were formerly unassailable. I may be wrong but I don’t recall such venom directed at the judiciary throughout my lifetime. \\nTabloid headlines scream “Who do you think you are? “The judges versus the people” and the Daily Mail has gone as far as to post photographs of three judges referring to them as “Enemies of the People,” describing one as being “openly gay.” This is nothing short of an attack on democracy’s checks and balances. \\nThe High Court has pronounced on a legal point, not on the pros and cons of Brexit. The government has the right to appeal in the Supreme Court but UK Prime Minister Theresa May has indicated she will proceed with triggering Article 50 come what may. \\nCharles Falconer writing in The Guardian was right to assert “the judiciary is a vital pillar of our constitution. The government must defend it from these unconscionable attacks—or put all our freedoms at risk.” \\nGina Miller, an activist who lodged the legal challenge is now receiving online death threats! Britons posting on Facebook have called for her “to be shot or hung.” \\nPopulist leaders tap in to people’s basest instincts. They are not reliant on knowledge of how the world works or of experience but rather on personal charisma and the power of persuasion. They inspire devoted followings blind to their transgressions which gives them a sense of power and infallibility. \\nWe’ve seen the rise of rank outsiders in the Philippines and Indonesia whose rhetoric and policies defy all norms. \\nThis ‘anything goes’ trend fuelled by fear and economic grievances is a slippery slope reminiscent of Germany in the early 1930s when Hitler wasn’t viewed as the monster he was but as a saviour from a brutal economic depression resulting in worthless currency and unemployment in the millions. He mesmerised crowds as he vowed to make Germany strong again. Perhaps it’s time that lessons were learnt before there’s no going back. \\nLinda S. Heard is an award-winning British specialist writer on Middle East affairs. She welcomes feedback and can be contacted by email at .'"}, "time": 1742564408.8636515}