{"duration": 0.17084074020385742, "input_args": {"text": "'PARIS  —   On Saturday, the New York City Ballet will wrap up a     season at Théâtre du Châtelet here, the company’s longest international tour to one city since 1976. City Ballet was presented by Les Etés de la Danse, an annual summer festival that brings dance companies  —   often American ones  —   to the French capital. “I spent a lot of time here with Balanchine, listening to him talk about his experiences in Paris,” said Peter Martins, the company’s ballet master in chief, referring to George Balanchine, the   of City Ballet, whose groundbreaking choreography forms the backbone of the company’s repertory. “Balanchine didn’t get good reviews here they liked Jerry Robbins, and Balanchine knew that,” Mr. Martins added. “So our first week was all Balanchine because I wanted to say, this choreographer is not only arguably the greatest choreographer in history, but our choreographer. ” The logistics are impressive: 150 people came from New York, including 94 dancers an additional 60 board members and patrons came for the opening and a gala dinner. Four sea freight containers were sent, containing costumes, scenery, props, lighting booms, physical therapy equipment, orchestra music and stage management supplies. (These include floor tape, tissues, ammonia, mops, Sharpies, bandages and Altoids.) Houses have been full, critics have been fulsome, and audiences rapturously appreciative. Meanwhile, the dancers have been enjoying Parisian life, sightseeing on their days off, hanging out in cafes and occasionally proposing marriage. Here are some snapshots of City Ballet in Paris, and edited excerpts from conversations with the dancers. Justin Peck, a soloist with City Ballet as well as its resident choreographer, came to Paris a month earlier than his colleagues to work with the Paris Opera Ballet. His “Entre Chien et Loup” for Paris Opera has been running at the same time as the City Ballet season. “It’s my first experience working in Europe, and it has been so nice to be living here and not feel so much like a tourist,” Mr. Peck said over a coffee on Monday. “I stayed in the Marais, which was great because I could walk to work every day. Sometimes I did class with the Paris Opera Ballet, other times I’d warm up by myself and listen to my music to get into the right head space. “Basically in any off time, I’ve tried to eat my way through Paris. I’d go with [the choreographer] Bill Forsythe, who was also working at the Opera, to this great French place near the Palais Garnier, and I have a favorite   new wave place. ” He added: “The Picasso and Rodin museums are my favorites, but it’s crazy, because I’ve been here for so long, and I keep thinking I’m going to get to things. Now it’s the last week, and there is so much I still haven’t done. ” Dancing at Châtelet was a homecoming for Robert Fairchild, a City Ballet principal who starred in Christopher Wheeldon’s production of “An American in Paris,” which appeared at the Châtelet in 2014 before opening on Broadway in April 2015. “The first day, after class, we ran over to the stage, and I got the chills seeing that house again,” said Mr. Fairchild, who left the show in March. “But I’ve tried not to compare the experiences. One was making a Broadway show here we were in the theater all day long, and you only went out to get a sandwich. This time has been more about living here and doing things in Paris. It’s nice to be here with Tiler [Peck, Mr. Fairchild’s wife, also a City Ballet principal]. We also went back to a lovely restaurant at the top of the Musée du Quai Branly, because after I proposed we had gone there for dinner, but we were so tired that we were falling asleep at the table. It was good to go back there and be awake this time!” “I feel almost Parisian by now!” Ms Hyltin said after company class on Monday. “I’m on the Metro, I know where I’m going, I’m practically a local. I go for lunch every day to one place, because I love their  . This one is so big that I keep a third of it to eat just before the show. ” Ms. Hyltin said that the rehearsal schedule was as intensive as it is in New York, partly because the company is preparing for its annual summer season in Saratoga Springs, immediately after the Paris tour. She has performed almost every night, but has made the most of company days off. “I’ve been up the Eiffel Tower to the Musée d’Orsay the Rodin museum a great architectural museum, Cité de l’Architecture et du Patrimoine and to   twice,” she said, adding that she loved the Rodin especially, “looking at the musculature and elegance of those sculptures. It really hit me how rich the culture is here everywhere you look there is history. ” Mr. Martins doesn’t teach company class every day, but when he does, there is always a   turnout of dancers, and on Tuesday morning, almost 90 bodies were crammed into the studio space at Théâtre de la Ville, where the dancers do their daily class and rehearse. (It’s across the plaza from Châtelet.) Mr. Martins gives   instructions, indicating steps by motioning silently with his hands the dancers seem to pick it up by osmosis or telepathy. Unusual rhythmic accents and quick differences in dynamics (from fast to slow, sharp to soft) give some clues about why the City Ballet style is so specific to this company. The dancers worked with concentration, finishing with a partnering sequence. “I notice how hard you work,” Mr. Martins told a corps de ballet dancer after the class. “I always notice. ” Silas Farley, a corps de ballet dancer, proposed to Cassia Wilson, a dancer with Ballet Austin, on Sunday. (She accepted.) On Monday, Mr. Farley recounted the story. “Cassia’s favorite movie is ‘Funny Face,’ and her sister suggested that I propose at the Château de la Reine Blanche, which is in it. I didn’t tell her where we were going, and we took the train out there. It was picture perfect, sunny, blue sky, blue lake, swans. We had lunch there, and at one point I told our waiter, I’m going to propose, please take my phone and video it. Then I got down on one knee in front of the chateau and asked Cassia to marry me. The waiter got it perfectly he turned out to be a wedding photographer in his spare time!” Indiana Woodward, a corps dancer, is half French and came to Paris to stay with her father during every school break while growing up. She said she had always dreamed of performing with City Ballet for her French family. “My face hurt from smiling after the first show I danced here,” she said. “And I’m staying at home, in my room!” Ms. Woodward said she had taken her City Ballet friends to all her top Paris spots  —   the Jardin du Luxembourg, a small park at the top of Montmartre, the banks of Seine  —   and handed out “a giant list of vintage shops. ” Paris, she added, feels more relaxed than New York. “People sit around having a coffee. You take that for granted when you are here. ” Craig Hall, a soloist, is retiring this season and performing some of his last shows in Paris, although he will remain with the company as a ballet master. “It’s a really great way to end off,” he said, as he, Lauren Lovette and Brittany Pollack set off for the Île   in search of the famed Berthillon ice cream. Ms. Lovette, a principal, said that she had visited the Normandy war memorial on an off day, and had been very moved at the sight of thousands of graves. “It’s part of our history too,” she added. She had a more upbeat excursion to the Champagne region to visit Ruinart, which supplies the bubbly stuff to City Ballet. “They gave us an amazing vintage Champagne to try, then more over lunch,” she said. “Probably not so wise of us, but we figured, we’re in France!”'"}, "time": 1742563144.8068895}