{"duration": 0.05907797813415527, "input_args": {"text": "'Saudi Film Days, a two-day showcase designed to celebrate filmmakers from Saudi Arabia, will be held in Los Angeles, on Nov. 3-4, 2016. Paramount Studios and the Ace Hotel will hold screenings of the short films for free, on November 4.\\nThis is the first showcase for Saudi Arabian films and the creators. Seven talented and dynamic filmmakers will present their fresh perspectives on the silver screen. The event will include the complete Hollywood experience: the red carpet, Gala dinner, presenters and an MC.\\nThe Saudi Film Days showcase is hosted by The King Abdulaziz Center for World Culture. This institution strives to offer multiple avenues for people to experience other ways of life.\\nShort Films and Interviews “I Can’t Kiss Myself”: follows a man who is surrounded by fame and attention, until someone causes him to question what these accolades truly mean for him. Directed by Ali Alsumayin.\\nAlsumayin began his career in advertising before becoming a broadcast designer for The Middle East Broadcasting Corporation Group. He directed television programs and a web series before making his debut as an independent film director. He strove for this new career because it allows him to present an idea in a different form and give it emotion. He said the concept is taken from the human mind and given breath on the screen, touching the audience.\\nHe believes, as a director, it is important to relate to the topic of the film. “I Can’t Kiss Myself,” was created to reach the people of his generation. The goal was to show people that being popular on social media is only an illusion. Nevertheless, it still changes how people view themselves and how they behave.\\nThe Saudi filmmaker is currently working on a new television series and is hoping to begin filming when he returns after the showcase. He is reviewing two other scripts for a possible mini-series. Television commercials are a major part of his career, and there are many for him to finish when he arrives in Saudi Arabia.\\nHe would like to direct more dialogue-based movies. He is writing an outline for a film about a troubled married couple talking over dinner. When asked where he wanted his career to be in the future, Alsumayin said, “I just want to do more films and read more scripts that would blow my mind.”\\n“Is Sumyati Going to Hell?”: Sumyati is the family maid. This film is shown through the eyes of the family’s youngest child, Layan, as he watches her navigate her way around racist employers.\\nMeshal Aljaser enjoys sharing his different opinions with an audience through social media and creative film. At a young age, he began his career as a producer and director and has continued to build on these skills to attain his goal of becoming a well-known Saudi Arabian director.\\nHe uses his YouTube show, “Folaim,” to share his viewpoints and unique perspective. The show recently earned him an award from Qomra, the Ramadan Program competition. He won the award through audience voting.\\nSince Aljaser was a small child, movies have fascinated him. Watching the characters live the story was a time-traveling experience for him. Now, he is expanding his career to include acting.\\nIn the future, the filmmaker wants to establish a Saudi HBO. When asked about his future, he responded:\\nTo where my career is heading exactly doesn’t matter, what matters that it is within the amazing and fascinating world of filmmaking and i am enjoying every minute of it.\\nSpokesman for the King Abdulaziz Center for World Culture Albara Auhaly talked about the opportunities Saudi Film Days could bring. “By offering [these young Saudi filmmakers] this showcase to come together and show their talents, we hope to lead them down the path to transition from digital to successful film and television careers.” The filmmakers have expressed how excited they are to be part of such a groundbreaking Hollywood endeavor. These young directors are hoping to affect society and culture outside Saudi Arabia.\\nBy Jeanette Smith\\nSources:\\nInterview: Ali Alsumayin\\nInterview: Meshal Aljaser\\nPress Release: Saudi Film Days\\nImages Courtesy of Saudi Film Days – Used With Permission filmmakers , hollywood , King Abdulaziz Center for World Culture , saudi , spot'"}, "time": 1742562983.0472732}