{"duration": 0.08956766128540039, "input_args": {"text": "'Current and former officials at the United Nations responded negatively to President Trump’s announcement Thursday that the U. S. is pulling out of the Paris climate accord  —   with one senior U. N. adviser calling Trump “an idiot” and a former climate envoy saying the U. S. is now “a rogue state. ”[Jeffrey Sachs, an economist and senior adviser to the U. N.   since 2002, told Bloomberg Television Friday that President Trump lives in a “dream world” and is an “idiot” for his decision to pull out of the treaty. He also blamed the decision on the left’s favorite boogeymen  —   the Koch Brothers.  “The president doesn’t know what he’s doing, this is obvious he’s an idiot,” he said. “But what’s happening behind here is real politics. This is the victory paid and carried out for 20 years by two people: David and Charles Koch. ” “This is all about the Koch brothers, I’m sorry to say it, they have bought and purchased the top of the Republican Party,” Sachs said, pointing also to House Speaker Paul Ryan ( ) and Senate Majority Leader Mitch McConnell’s ( ) support of Trump’s position. Sach’s Koch claim is particularly unusual in that President Trump and the Koch Brothers have frequently clashed on a number of issues. The conservative patriarchs refused to back Trump in 2016, while Trump mocked conservatives who sought their backing  —   once accusing Sen. Marco Rubio ( ) of being their “puppet. ” Little Marco Rubio, the lightweight no show Senator from Florida, is set to be the ”puppet” of the special interest Koch brothers. WATCH!  —   Donald J. Trump (@realDonaldTrump) February 28, 2016,  Sachs, who was retained by current   António Guterres this year, is known for his   views. In April, he wrote a column titled: “Donald Trump’s Climate Fantasies. ” “In less than 100 days, we have learned that Trump is a man living in a fantasy world. He issues decrees, barks orders, sends out midnight Tweets, but to no avail. The facts  —   real ones, not his ‘alternative’ variety  —   keep intervening,” Sachs wrote. He has also called Trump a “  font of lies” in a column in March. Sachs’ remarks come after a former U. N. special envoy on climate change, Mary Robinson, said the decision makes “a rogue state on the international stage. ” It isn’t the first time Robinson, a former president of Ireland, has made such remarks. In November, she said in a Reuters interview, “It would be a tragedy for the United States and the people of the United States if the U. S. becomes a kind of rogue country, the only country in the world that is somehow not going to go ahead with the Paris Agreement. ”   Guterres was more restrained in his language, calling Trump’s decision “a major disappointment. ” “The decision by the United States to withdraw from the Paris Agreement on climate change is a major disappointment for global efforts to reduce greenhouse gas emissions and promote global security,” Guterres’ spokesman Stéphane Dujarric said in a statement Thursday. However, he remained optimistic and said he “looks forward to engaging with the American government and  all actors in the United States and around the world to build the sustainable future on which our grandchildren depend. ” Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY'"}, "time": 1742563096.0837142}