{"duration": 1.4557878971099854, "input_args": {"text": "'By Brig Asif H. Raja on November 3, 2016 \\nAsif Haroon Raja \\nThe political temperature that had begun to boil from 28 October onward became menacing on the following three days, but mercifully it scaled down dramatically on the evening of November 01 after Imran Khan (IK) decided to call off his much hyped foray into Islamabad (Isbd) on November 2. IK led PTI had been drumming up the Panama papers scandal since April 2016 and straining their lungs to demean Nawaz Sharif (NS) and implicate him and his family on charges of corruption and money laundering. Earlier on, IK had made rigging in 2013 elections into a big issue and undertaken 126-day sit-in at D-Chowk Isbd to implicate PML-N and topple the govt. Despite the physical assault on the parliament, PM House and the PTV, the protest fizzled out without achieving any results. IK had to tender an apology to the judicial commission when his legal team failed to produce any evidence to prove the rigging charge. IK covered up his embarrassment by saying that “rigging was just a political stunt for point scoring”. He then shifted his goal post from rigging to corruption and in that Panama scandal came as a godsend opportunity to push his chief rival against the wall and possibly unseat him. \\nIrrespective of the fact that NS name was absent from the list of account holders in the offshore company in Panama, and several of his party’s leading lights including himself were maintaining offshore accounts, he insisted that accountability should start from NS and his two sons based in London and daughter Marium only and none else. He emphasized on immediate resignation of NS and quoted weak examples of PM of Iceland who had resigned and PM UK who presented himself for accountability. Other political parties like the PPP, JI, PML-Q and AML joined his battle to put NS in the dock. The two sides got locked over the issue of Terms of Reference (ToRs), the opposition demanding commencement of investigation by Supreme Court from NS and his family, while the govt maintained that NS name should be excluded since he had not been named, and that accountability should be across the board. The tussle consumed 6-7 months without any breakthrough. \\nFeeling frustrated, IK once again decided to show muscle power on the streets and after several public meetings held a big gathering at Raiwind on Sept 30. He had all the intentions to move forward and organize a sit-in in front of Jati Umra (private residence of NS), but truculence expressed by PML-N activists and reluctance of other political parties to join him, coupled with heating up of LoC and threat of surgical strike by India restrained him, and he decided to wrap it up the same night. He however, pledged to invade and lock down Isbd on October 30 and force NS to quit or offer himself for accountability. He built up the tempo throughout October and made efforts to take as many political parties on board. Social media and electronic media in particular demonized NS and made him into an object of hate. Most political parties and saner elements advised IK to change his plan of confrontation in the wake of acceptance of case of Panama scandal for hearing by the Supreme Court, but he refused and remained adamant. \\nHaving discovered the foul intentions of PTI, the govt announced that all out efforts will be made to prevent the activists of PTI and their partners from besieging Isbd on October 30. Punjab Police and Frontier Constabulary were requisitioned to bolster the strength of Isbd Police and containers from all over Punjab were impounded to block the roads leading to Isbd. Hawks within the ruling party also flexed their muscles and showed readiness for the combat. \\nIn the meanwhile, GHQ’s annoyance over security leak gave a shot in the arm to the agitators and it was assumed that the Army would be on their side and Gen Raheel would raise his finger once the desired chaos was stoked. To neutralize one front, NS hastened to sack Information Minister Pervaiz Rashid and a high powered inquiry was ordered to trace the culprits and punish them. Pervaiz ouster was rejoiced by PTI but the sacrifice was considered too small. They wanted a bigger head to be rolled and their obvious target was NS and none else. Quite a few critics of Pervaiz are now shedding tears of sympathy. \\nThe date of incursion was advanced to November 2. Refusal of PPP and PAT to join up for the D Day was a setback for the PTI, but it decided to once again take the suicidal plunge single-handed. Its main dependence was on the main effort launched from KP by the PTI workers under the command of Chief Minister (CM) Pervez Khattak. IK repeatedly underlined that a force of one million will assemble in Isbd. Armed Tiger Force had been trained to deal with the police and paramilitary forces. Secondary effort was to be launched from the direction of Lahore and PML-Q activists under Ch brothers were to join the party from Gujrat. Purpose was to flood the capital city with people, choke the city, paralyze the administration, parliament and judiciary and give a fait-accompli to NS to either voluntarily step down peacefully, or be ready to be brought down forcibly. Tahirul Qadri’s zealots were expected to join the gathering to dig the last nail. \\nNS ouster on yet to be proven corruption charges in their view would cook the goose of PML-N and victory will be theirs. Knowing that the Panama case didn’t have required strength to convict NS, they wanted to decide the case their way through street agitation. They also understood that each passing day was tilting the balance in favor of PML-N due to fast paced developments and CPEC and in next elections PTI’s chance of winning will become very bleak. For them, this was the only chance to get rid of NS, and hence decided to take a huge risk without constitutional and legal cover. Like in 2014, they assumed that Army was on their side. \\nBlinded by their quest for power, they turned a blind eye to the possible socio-political turmoil that may erupt as a result of their reckless venture to scuttle the democratic process. They ignored the possibility of takeover by the Army in the wake of commotion. IK’s bellicosity and rashness was motivated by his rancor with NS family, and his obsession to acquire the coveted seat of PM. In every speech, he and Sheikh Rashid used foul language and ridiculed the PM brazenly. Many are of the view that IK may be having hidden malicious intentions to pursue sinister goals at the behest of hostile forces to Pakistan. His detractors particularly Maulana Fazlur Rehman, who himself has a shady past, dubs him as an agent of Israel. \\nOthers say that his fascist methods resemble MQM’s fascism and give strength to Indo-US-Israel-Western agenda to foment chaos. They have seen the fate of Iraq, Libya, Yemen and Syria and know that Pakistan is the next target. They particularly noted the ill-timed attack on Isbd when India and Afghanistan are breathing fire, the US is in highly rasping mood and China is getting worried over political uncertainty. Last time the sit-in was timed with the scheduled visit of President of China which got postponed for six months and this time the Peshawar-Isbd road blockade coincided with the passage of first convoy from Kashgar-Khunjarab to Gwadar along the western route. They ask as to why IK and his ilk cannot wait for May 2018 elections and gain power through a legitimate course rather than using high handed tactics. \\nThe preliminary offensive was intended to be launched under the garb of youth convention in Isbd on October 28. This gathering was to exert pressure from within the city once the pincers from KP and Punjab reached the premises of Isbd. Leaders and foot soldiers started collecting at Bani Gala which was to act as the command and control centre for “Operation Lockdown Isbd”. Having gained intelligence about the sinister plans afoot, the govt machinery sprang into action and ordered positioning of containers on all entry points into Isbd as well as in Bani Gala. When the protesters became rowdy, the police baton charged and arrested PTI workers of both genders. The scuffle and hide-and-seek which went on the whole night created a big scene and gave plentiful of grist to the media to sensationalize the event to the hilt. Planned meeting of Shiekh Rashid in front of his residence Lal Haveli could not take place on October 30 but the Sheikh managed to reach Committee Chowk riding a bike and delivered a short speech to the few people present there. This act of his was glorified by the media. \\nThe situation took a serious turn when the CM KP Pervaiz Khattak started a caravan from Swabi on October 31 and not only hurled highly jingoistic statements but made things nasty by adding ethnic color to his diatribe against the govt. Unmindful of his skinny and frail physique, he behaved like a conquering Rambo ready to trounce any hurdle placed in his way. He expressed his determination to reach Bana Gala at all cost on the following day. He has nothing impressive to brag about in KP. Most of development funds of the last year could not be spent and lapsed and no headway has been made on corruption. \\nAs regards the PTI, there are visible cracks within the party and several top leaders like Javed Hashmi and justice Wajihuddin have left the party. PTI leaders have tainted past and several leading lights are the turncoats of other parties. Performance of PTI in bye-elections, local bodies, Gilgit-Baltistan and AJK has been dismal. These factors when seen in the backdrop of impressive performance of PML-N in tackling energy crisis and existential threat of terrorism and in improving economic indicators, gives no plausible reason to the PTI to maneuver its premature downfall through hooliganism. \\nThe govt in anticipation had placed series of containers on the three interchanges along the motorway at Swabi, Hazro and Burhan and deployed heavy contingent of police equipped with heavy stocks of tear gas shells. Khattak made use of the cranes to remove the containers but the barrage of tear gas shells and baton charge by police had a toll on the PTI tigers. The caravan lost its steam and was ultimately grounded at Burhan. It was in this timeframe that the first cargo convoy of 100 vehicles was to cross the interchanges to reach the motorway of CPEC. Cognizant of its importance the Army soldiers helped in clearing the mess on critical interchanges. \\nWhen IK realized that he and other leaders of his party stranded in his house in Bani Gala cannot move out and join party workers braving the hardships and that Khattak led men will not be able to reach Isbd, he was in a dilemma. Possibility of a bigger clash at Burhan resulting in casualties couldn’t be ruled out. The govt was in no mood to soften up its stance. The other factor was failure to mobilize the party workers and bring them to Isbd in sufficient numbers. The total strength didn’t exceed 20-25000. IK and his colleagues wanted to call off the sit-in but not the party men. The Supreme Court gave the much needed face saving formula by offering to frame the ToRs in case the govt and opposition parties failed to do so and also promised to start hearing the Panama case and expedite its completion as early as possible. IK was allowed to hold a peaceful meeting at parade ground. The court also ordered removal of containers. \\nThese offers were promptly accepted and IK announced the withdrawal on a triumphant note saying that November 2 will be celebrated as ‘Thanksgiving Day’ with fanfare. Rather than appreciating his decision, hyper media sank into a pool of sadness. Same was the case with opposition parties and PTI activists that were expecting the party to remain in full swing for full month if not more. Eight RAW/IB agents based in Indian High Commission in Isbd in the garb of diplomats having dangerous plans up their sleeves felt so depressed that they became indiscreet and got exposed. \\nIK once again boasted of assembling one million but had to eat his words. True to commitment, the Supreme Court held its first session on November 3 in which NS and IK appeared. Next hearing of the court will be on Monday in which children of NS would also appear. IK and his team are very hopeful that the court would give verdict in their favor but in case of unfavorable decision, he will again come on the roads. Relations of PTI with PPP and PAT have become frosty, while Sheikh Rashid is also feeling out of sorts. Reportedly an understanding has been forged between PML-N, PPP and MQM-Altaf, but apparently the PPP is trying to change its posture from friendly to genuine opposition to outdo PTI. \\nThe writer is retired Brig, war veteran, defence analyst, columnist, author of 5 books, Vice Chairman Thinkers Forum Pakistan, DG Measac Research Centre, Member Executive Council PESS. aifharoonraja@gmail.com'"}, "time": 1742563523.6491053}