{"duration": 0.05183696746826172, "input_args": {"text": "\"  Sean Adl-Tabatabai in Entertainment // 0 Comments \\nAngelina Jolie’s father, Jon Voight, has publicly spoken out against the illuminati elite’s that he says are attempting to prevent Donald Trump from winning the Presidency. \\nIn a video uploaded to YouTube , Voight slammed both George Soros and Hillary Clinton, claiming they are attempting to turn America into a country of tyranny. \\n“May God protect the real truth and may Donald Trump win this presidency. He will save our America, and he will certainly make it great again,” he said . \\nDaily Mail reports: \\nVoight has repeatedly supported Trump throughout the election cycle despite the business tycoon’s unprovoked attacks on his daughter Angelina Jolie’s looks. \\nIn the video, posted on Voight’s social media channels, he said: ‘We were once a country of freedom. Now we’re becoming a country of tyranny. \\n‘Thousands of refugees will flood our nation, and no one will know the good guys from the bad guys. It will kill our economy which is at an all time low under the years of Obama’s presidency.’ \\nMillions of jobs have been created, unemployment has plummeted, and the economy has grown about two per cent each year under Obama’s administration, with experts grading it a ‘solid B or B+’, CNN reported. \\nBut Voight also warned that people would lose their Second Amendment rights under Hillary Clinton, even though she has repeatedly disputed similar statements. \\nVoight went on to say: ‘Freedom of religion will be attacked…and Hillary will try to stop all conservative voices on TV and radio. \\n‘Our highest courts will become socialist, and she will restrict what America was founded on – our freedom to become a small business owner and pursue our own personal dreams.’ \\nVoight also accused Soros of ‘turn[ing] hundreds of Jewish people over to the Nazis to be exterminated during World War II,’ an idea perpetuated by conservative commentator Glenn Beck. \\nWhen Soros was 14, his father bribed an agriculture official in Nazi-occupied Hungary to pose as his Christian godfather. \\nSoros once accompanied the man during an inventory of an estate left behind by the wealthy Jewish aristocrat Mor Kornfeld. \\nIn a 1998 episode of 60 Minutes, Soros said: ‘I had no role in taking away that property. So I had no sense of guilt.’ \\nWhile Voight made no reference to Trump’s comments about women in his latest video, he came out to defend the business tycoon days earlier. \\n‘I am so ashamed of my fellow actor Bobby DeNiro’s rant against Donald Trump…’ I am so ashamed of my fellow actor Bobby DeNiro's rant against Donald Trump. What foul words he used against a presidential nominee. cont'd \\n— Jon Voight (@jonvoight) October 8, 2016 \\n‘Donald Trump’s words were not as damaging as Robert DeNiro’s ugly rant. Trump’s words did not hurt anyone.’ Voight tweeted in response to the Republican candidate’s comments that he could sexually harass women without consequence. Donald Trump's words were not as damaging as Robert DeNiro's ugly rant. Trump's words did not hurt anyone. Can you imagine. cont'd \\n— Jon Voight (@jonvoight) October 8, 2016 \\n‘I don’t know of too many men who haven’t expressed some sort of similar sexual terms toward women, especially in their younger years,’ Voight added. \\nTrump has since been accused of sexual harassment by six women in the days following the 2005 hot mic recording’s emergence. \\nThe presidential candidate has spoken out against Voight’s daughter over the last decade, saying in 2006: ‘[Angelina Jolie has] been with so many guys she makes me look like a baby, OK, with the other side. And, I just don’t even find her attractive.’ \\nIn 2007, Trump said: ‘Angelina Jolie is sort of amazing because everyone thinks she’s like this great beauty. \\n‘I really understand beauty. And I will tell you, she’s not—I do own Miss Universe. I do own Miss USA. I mean, I own a lot of different things. I do understand beauty, and she’s not.’\""}, "time": 1742562860.8555095}