{"duration": 0.06821393966674805, "input_args": {"text": "'Transcript: \\n“My dear fellow Americans, \\nWe are all feeling tremendous anxiety with only a few weeks left to the election. This will be the most important election in American history. \\nWe were once a country a freedom, and now we’re becoming a country of tyranny. We are witness to our own people burning down and looting our cities: Ferguson, Missouri; Milwaukee; Atlanta; Florida; Baltimore. We are all witness to our own people killing our policemen. Islamic terrorists have killed thousands of people all over our country, and Hillary and Obama want to be politically correct and pretend all the killings are not happening. \\nHow many Americans are aware of George Soros? — an evil man who turned hundreds of Jewish people over to the Nazis to be exterminated during World War Two. He was interviewed on ’60 Minutes’ and was asked if he feels guilty for what he’s done, and arrogantly he said, ‘Absolutely not. If I didn’t do it, someone else would have.’ Soros is a billionaire who makes most of his money manipulating currencies and almost bankrupting many countries. He supports hate groups responsible for taking down our cities. He’s a close friend of Hillary Clinton and a major supporter of her campaign. \\nRobert De Niro is a millionaire, as are so many of our Hollywood stars who are voting for Hillary, and who have absolutely no tolerance for anyone of a different opinion, forgetting that that is what our country is founded on — freedom of choice. But they will not be affected by Hillary’s open borders. Only the poor and middle class will suffer. Thousands of refugees will flood our nation, and no one will know the good guys from the bad guys. It will kill our economy, which is at an all time low now under years of Obama’s presidency, and Hillary boasts of how proud she will be to continue Obama’s legacy! \\nNo one can afford health insurance now. Prices for health care have gone through the roof. Thanks to Obamacare, our once reasonable health care is gone. With Hillary as president, we will lose our Second Amendment with our right to bear arms. Freedom of religion will be attacked, and Hillary will try to stop all conservative voices on TV and radio. Our highest courts will become socialists, and she will restrict what America was founded on — our freedom to become a small business owner, and pursue our own personal dreams. \\nShe has blood on her hands from the Benghazi terrorist raid. Four of our American patriots died. And when the parents stood over their loved ones’ coffins, she lied to them about the cause of their sons’ deaths. \\nThe pendulum of freedom is not balanced. Hillary and her followers are running a cruel campaign to stop and degrade all of Trump’s followers. Her words were echoed loud and clear for all Americans to hear. Hillary said, ‘Trump’s followers are a basket of deplorables. They are unredeemable.’ \\nMay God protect the real truth, and may Donald Trump win this presidency. He will save our America, and he will certainly make it great again. \\nThank you.”'"}, "time": 1742561797.504654}