{"duration": 0.11061882972717285, "input_args": {"text": "'Are women trending? I guess they are! Suddenly, they seem to be just everywhere, onscreen and offscreen, in   flicks, in   comedies and even in the presidential race. The latest   evidence that women are hot (kind of) and not simply in a   way, is “Bad Moms,” a funny, giddy, sentimental   from Jon Lucas and Scott Moore, who wrote the 2009 hit comedy “The Hangover. ” That movie pretty much ignored the ladies but made enough money to spawn another smash and a second, less successful sequel that may have killed off the franchise. So if “Bad Moms” kind of feels like leftovers, there’s a reason. Much like “The Hangover” (Mr. Lucas and Mr. Moore can take writing credit and blame only for the first movie) “Bad Moms” is a comedy of outrage pegged to a gender stereotype, this time the smother mothers of America. You know the type, or maybe you’ve just read about her in lifestyle articles featuring enlightened parenting and   snacks. She’s the one who  —   in between enjoying a fulfilling career and flipping through cookbooks for vegan cookie recipes (for a bake sale, natch)  —   ferries the kids from school to soccer and whatever other extracurricular activities can pad a college application. It’s a cliché that Amy (Mila Kunis) struggles to emulate. The frantic, pinwheeling center of “Bad Moms,” she enters in heels at full speed, a pace she keeps up as she sprints from one demand to another, often with her two children in tow. Mr. Lucas and Mr. Moore, who both wrote and directed, keep Amy on the run for a while, playing her harried purposefulness against some gently disruptive sight gags: a giant head of Richard M. Nixon that she makes for a school project, a dog wearing a helmet, an office run by giant children. (Clark Duke plays her boss, while Christina Applegate, Jada Pinkett Smith and Annie Mumolo offer backup as the   mean girls  —   i. e. the momsters.) The    mother might be a fantasy, but she’s good for a laugh. She’s also been good for sales. You could fill an entire Amazon fulfillment center with parenting books, with a few rows reserved for putatively bad or just   moms. These range from   reads like Allison Pearson’s “I Don’t Know How She Does It” to   manuals with   titles, like one coyly subtitled “The Parenting Guide for the Rest of Us. ” (If a lot of these humor books seem to focus on mothers, it’s probably because that’s the way the world still turns, although you also have to wonder if stories about terrible fathers cut too queasily close to the bone for mass readership.) The   movie was inevitable, given both this industrial parenting complex and the boomlet of comedies about badly behaved women that have appeared in the wake of “Bridesmaids” (2011): “Tammy,” “Trainwreck,” “Sisters” and so on. Most of the women in these movies don’t resemble villainous vixens of old, like those film noir femmes fatales who caused tough guys to go weak in the knees and murmur, “Baby, I don’t care. ” Most of these funny ladies aren’t even particularly naughty. They just do things that women aren’t supposed to do or, more truly, don’t often do in mainstream American movies, like pound shots, fall flat on their faces and have sex without tears. The comedy in “Bad Moms” hinges on a rarer type: the good mother gone rogue, which here mostly involves kicking back, something Amy does after she boots out her cheating husband and stops coddling her kids. (They’re forced to eat cold cereal. From a box.) The naturally likable Ms. Kunis, who has a screwball heroine’s springiness and the eyes of Bambi under fire, helps humanize the story’s mechanical turns, as do her gal pals, the neurotic, overachieving Kiki (Kristen Bell) and the   slacker Carla (Kathryn Hahn). If I could write sonnets, I would write one about Ms. Hahn, whose timing  —   she finds depths in that little pause before a joke crests  —   can turn laughs into howls. Carla aside, the movie’s yuks are tame stuff. What makes “Bad Moms” funny (aside from its lineup of gifted performers) isn’t that Amy and her friends go wild they don’t, not even close. It’s the women’s shared,   pleasure in their freedom and friendship. In the most comically honed and sustained scene, Amy, Kiki and Carla run mild and a bit loony  —   and in slow motion  —   through a supermarket, where they rip open boxes, chug booze and (absurdly) terrorize a guard, their every offense turned into an epic of   destruction by the decelerated visuals. There’s nothing genuinely transgressive about their behavior they’re just drunk, happy and together. “Bad Moms” is rated R (under 17 requires accompanying parent or adult guardian). Booze and some bedroom rocking and rolling. Running time: 1 hour 41 minutes.'"}, "time": 1742561788.5106642}