{"duration": 0.06797623634338379, "input_args": {"text": "'The Pentagon announced on Wednesday that Secretary of Defense James Mattis will visit Japan and South Korea in early February, on his first overseas trip since confirmation. [“The trip will underscore the commitment of the United States to our enduring alliances with Japan and the Republic of Korea, and further strengthen U. S.   of Korea security cooperation,” said Pentagon spokesman Capt. Jeff Davis.  “President Donald Trump raised concerns during the campaign by asserting that some allies are not pulling their weight and by suggesting that he might not object to Japan or South Korea developing their own nuclear weapons if they do not pay more for U. S. military support,” Stars  Stripes noted in reporting Mattis’ travel agenda. CNN reports the trip is scheduled to last four days, and will include meetings with Mattis’ opposite numbers in Japan and South Korea. There are currently about 50, 000 U. S. troops stationed in the former nation and 28, 000 in the latter. A defense official told CNN that “folks in Japan are very happy about the visit. ” Japan has been looking to improve its military capabilities to deal with potential threats from China and North Korea. The Japan Times reports that Mattis will meet with Defense Minister Tomomi Inada on February 3rd, after paying a courtesy call to Prime Minister Shinzo Abe. During these meetings, Japan Times anticipates that Mattis “may request that Japan increase defense spending and expand the role of the   Forces abroad in line. ” Mattis and Inada are also expect to “exchange views on China’s island construction and military buildup in disputed areas in the South China Sea and North Korea’s development of nuclear weapons and ballistic missiles,” as well as on a plan to relocate the U. S. Marine Corps Air Station in Okinawa. In South Korea, Mattis will likely discuss “North Korea and the planned deployment of an advanced U. S. missile defense system known as the Terminal High Altitude Area Defense system (THAAD) to South Korea” with Defense Minister Han  . The Financial Times writes that THAAD deployment is “looking increasingly in jeopardy amid political strife in Seoul and increasingly strident Chinese opposition. ” Said opposition recently took the form of punitive Chinese action against the South Korean conglomerate that owns the land where the THAAD system would be erected, prompting the conglomerate to delay negotiations. South Korea’s Yonhap news agency predicts “  for U. S. Forces [and] Korea may also be on the agenda, as Trump called for U. S. allies to pay more for the upkeep of the U. S. military during his election campaigning. ”'"}, "time": 1742562334.4906893}