{"duration": 0.08556723594665527, "input_args": {"text": "'Hello Everyone,\\nI know many of you like to keep in touch with our website via Facebook. I’ve had several reports from people over the past week that Facebook has been censoring some of our posts again. Unfortunately, there isn’t much I can do about that but I wanted you to know that I’m aware of it and keeping an eye on the situation.\\nMany of you may not know that Facebook changed their algorithm this past June to favor “friends and family”. What this means is that Facebook now shows you more posts specifically from your friends and family, which is great! But, you may not be seeing as many posts from news outlets or small businesses that you follow and want to keep in touch with. You can read more about Facebook’s algorithm change here .\\nThere is a way to fix this! If you go to our Facebook page and click the triangle next to the ‘Liked’ button, you can click See First, and this will ensure that our posts make it onto your news feed.\\n\\nFacebook does not show all posts to people who follow pages. The new algorithm changes the way posts show up in your feed based on how many likes and shares a post accumulates within a short timeframe after it is published. This means that you may not have the opportunity to view information you might be interested in.\\nIf you want to ensure you see more from The Event Chronicle, you can follow us on Twitter , or sign up for our newly redesigned newsletter.\\nSubscribe to Our Newsletter → Don’t want to miss a thing? Our RSS feed will show you every single article published on our website. Need a news reader? We recommend Feedly . Feedly is available on the web in your browser , or on many popular smartphones and tablets; iPhone , iPad , Android , and Kindle .\\n\\nOn a Personal Note It’s been a bit of a struggle to get the news out this week as my computer is getting old and the hard drive is beginning to fail. This is not something that’s fixable and it’s time to get a new computer. I’ve been crossing my fingers and saying a little prayer each morning when I wake my computer from sleep hoping it will turn on for another day. So far so good, but the day is quickly coming that it will no longer turn on.\\nIf you enjoy reading our website, please see this page for more information about the computer problem and ways you can help. Even small donations of $5 or $10 add up and your help would be greatly appreciated. \\nHave a great weekend! I have a handful of posts scheduled in the queue to go out throughout the weekend. I’ll pop in here and there on social media to make sure I don’t miss anything important, but my focus this weekend will be on finishing up Volume 2 of The Event Handbook !\\n…as well as doing a bunch of vacuuming and laundry because it seems Miss Ellie has brought home a flea or two. I think I’ve caught it in time so it shouldn’t be too much of a hassle. Does anyone know of any good natural remedies that are safe for cats? Please let me know in the comments. Thanks!\\nYou wanna see some pictures of my cat? Of course you do! \\nMiss Ellie Thanks Everyone. I love you ALL! '"}, "time": 1742563517.5540166}