{"duration": 0.12224578857421875, "input_args": {"text": "'| Zero Hedge | www.zerohedge.com | 0 views \\nCiti’s chief political analyst, Tina Fordham has had a busy month. \\nAt the start of October – when Trump’s victory odds were in the gutter and a Clinton presidency had been priced in – in a hotly debated statement, she suggested that the establishment may be approaching the US presidential completely incorrectly: “This is an unusual juncture but we keep looking at it through the same kinds of lenses. What if it’s all wrong because society, technology, opinion polling methods, and everything else don’t capture marginalized voters in the way they might once have?” \\nAccording to Fordham, the US presidential race felt more like an election in a developing nation where public distrust in government is high and conspiracy theories are rife. Markets seem unaware how much that low trust raises the risk of an anti-establishment vote. Fordham has focused on the Gallup World Poll on public health, which analyzes two decades’ worth of health records of Trump supporters. The numbers show a correlation between the increase in the number of people going through difficult times – as measured by suicide rates, depression, mental illness and drug addiction – and the rise in Trump’s popularity, Fordham said. \\n“This is the kind of thing that investors just don’t normally run into, but it provides another useful way to think about things because income inequality is necessary but not sufficient,” she said. “There is something more subtle going on about public expectations and exhaustion and a sense of corruption, elite abuse of power, and lack of control.” \\nHer conclusion was troubling for Clinton fans: “ I’m getting this Brexit-y feeling and I know other investors are as well,” she said. “The thinking is: I didn’t expect Brexit, so I better assume Trump is going to win. That element of investor psychology is at play here.” \\nShe followed up on Monday , when she predicted that the FBI’s Friday announcement “could have a meaningful impact on the presidential race” and cautioned that this may not be the end of it: “we continue to emphasize the potential for more Black Swan events emerging making things more complicated for forecasters and pollsters.” \\nToday, in her latest media appearance, Fordham has penned an Op-Ed for the FT, looking at the post-election landscape and warning that “ Investors face political risk whoever wins in the US election .” \\nShe first analyzes if a a Clinton victory will “mean business as usual for America and the global order” and responds: “ Not so fast.” \\nInvestors should brace themselves for the new form of advanced economy political risk, what ever the outcome of the US presidential election. \\nFirst, any market relief from a victory for Mrs Clinton over Donald Trump, her Republican opponent, will almost certainly be followed by the realization that a divided Congress will mean a return to gridlock and brinkmanship over the debt ceiling with little prospect for reform. \\nMore broadly, following the vote in the UK to leave the EU, the rise of Mr Trump and, according to a YouGov study, authoritarian populism, politics in advanced economies are having what might be termed an emerging markets moment. Vox populi risk, a concept I formulated in 2012 after a wave of protests, coups and the rise of non-mainstream political parties, has become a global phenomenon. \\nShe then notes that “the economic and market implications of advanced economy political risks are more likely to become systemically significant than their emerging markets counterparts. According to the International Monetary Fund’s recently published World Economic Outlook, political risk in the advanced economies has become the biggest threat to global growth.” \\nSpecifically, she envisages the Trump campaign: \\nFrom threats to jail opponents on corruption charges to the proliferation of conspiracy theories, the Trump campaign and its supporters have borrowed heavily from the EM political playbook, sowing doubts not only about his opponent’s suitability for office but also about US political institutions. A majority of Republicans now say they believe the election will be rigged, according to data from Pew Research Center, despite the lack of any precedent in US election history for such claims. \\nReverting to her notion that the US election looks a lot like that of a developing nation, she notes that “ what links this advanced economy political risk with its EM cousin is low trust in institutions and elites — political and business elites, “experts”and the media. It is trust, plus belief in the future, not growth alone, that immunizes the body politic against the populist virus. The collapse of trust is also evident in the sheer number of outright lies the fact-checking website Politifact has tracked during the campaign. If everything is bogus than anything goes .” \\nThere are also the market implications: \\nThe reaction of financial markets may be the starkest illustration of this change in trend. According to the Brookings Institution, the effect of Mr Trump’s candidacy has been to give rise to price movements suggesting that a Trump victory would reduce the value of the S&P 500 and lead to a 25 per cent decline in the Mexican peso, as well as pricing in future volatility. \\nHowever, Fordham’s punchline has little to do with a Trump victory, but rather the consequences of another Clinton presidency: \\nMr Trump \\u200emay be heading for defeat but the prevalence of low trust, identity politics and demographic divides across the developed world suggests that he will not be the last non-mainstream candidate to come close to power . This constellation of risks will be in evidence before elections next year in Germany, France and the Netherlands, and will have a significant impact on Brexit negotiations. Moreover, a Clinton presidency is highly likely to be marked by near-continuous investigations as well as the risk of impeachment. \\nIf Citi is right the pre-election circus, and endless drama and theatrics is just the beginning of what is about to be unleashed, a world in which the political realities of DM and EM worlds will converge: “The new normal in advanced economies looks a lot like the emerging markets’ old normal, but with considerably higher stakes for the global economy.” We encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Zero Hedge of www.zerohedge.com . Wake The Flock Up! Please Share With Sheeple Far & Wide: Post navigation'"}, "time": 1742563494.3867774}