{"duration": 0.051241159439086914, "input_args": {"text": "'Humana announced on Tuesday that it would no longer offer health insurance coverage in the state marketplaces created under the federal health care law, becoming the first major insurer to cast a   vote over selling individual plans on the public exchanges for 2018. President Trump immediately seized on the company’s decision as evidence that the Affordable Care Act needed to be repealed and replaced. “Obamacare continues to fail,” he said on Twitter. The company’s decision is likely to set off a contentious debate about who is to blame for the market’s current shakiness. While the president and Republicans have vowed to undo the health care law, they have yet to come up with a solid plan. Insurers are complaining loudly about the uncertainty surrounding what will happen in the coming years, even though many states’ exchanges have showed some signs of stability. Several major insurers have said they cannot begin to decide whether to offer coverage next year until the government clarifies if and how it plans to change the rules. Based in Louisville, Ky. Humana is not a major player in the individual exchanges and is among the national insurers, like Aetna and UnitedHealth Group, that have struggled to make money in the market. The company has steadily scaled back its presence, selling policies for 2017 in just 11 states. In early January, the company said the number of its customers buying coverage through the exchanges had dropped to about 150, 000, a small fraction of the roughly 12 million individuals who initially signed up for coverage through the exchanges. The company’s main focus has been selling private insurance under Medicare. Humana released word of its withdrawal on Tuesday after it announced that it would no longer pursue a merger with Aetna, another large insurer. The Justice Department won a legal challenge against the combination last month. The company cited an “initial analysis of data” about the type of customers who signed up for its plans this year, and it said that it saw no evidence that the market was improving but that it was “seeing further signs of an unbalanced risk pool,” as customers with expensive medical conditions continued to enroll as compared with healthy people. Humana’s move “could be a harbinger of things to come,” said Sabrina Corlette, a research professor at Georgetown University who studies the health insurance market and who has warned that the lack of clarity from Congress and the Trump administration could result an exodus by insurers. “These insurance companies are having to make business decisions in an environment of great uncertainty,” Professor Corlette said. “They’re not required to participate in these markets. ” Humana did not immediately respond to requests for comment, but the decision was also clearly intended to tell its shareholders and others how it viewed its future as a   company. “They’ve been pulling out of the market for a couple of years,” said Gary Claxton, a policy analyst for the Kaiser Family Foundation, who said it was not clear how much the current uncertainty might have affected the company’s thinking. “I don’t really think this was their future. ” On the same day, the fallout from the Justice Department’s decision to block the merger of two other large insurers, Anthem and Cigna, resulted in a lawsuit by Cigna seeking $13 billion in damages from Anthem. The two companies have been reluctant partners, and Anthem had recently vowed to appeal the judge’s decision to support the challenge by the Justice Department.'"}, "time": 1742562582.48674}