{"duration": 0.04944181442260742, "input_args": {"text": "'0 comments Our Constitution REQUIRES us to defend from ALL enemies, foreign and DOMESTIC and that is the message Trevor Loudon puts forth in “ The Enemies Within ” \\n“ The Enemies Within ” exposes the anti-American, Socialist, Communist and Jihadist sympathies of leading figures in the Democratic Party including Bernie Sanders, Barack Obama, and Hillary Clinton. \\nLoudon uncovers the shocking Communist connections of many of our elected servants, which explains well why they do not act like servants…and instead like masters. \\nTrevor Loudon has lived through the horrors of handing the reigns over to communist sympathizers in New Zealand. What is happening in the United States scares him. \\nHe points out that 100 Congressmen and 20 Senators could not qualify to obtain a basic security clearance to clean the toilets at any military base in the nation. Neither could Barack Obama. He discusses how many elected officials have close ties to Russia, China, Cuba and Venezuela and even Iran and North Korea. \\nWe have some serious problems in the United Stated and as the Apostle Paul told Timothy, they will wax worse and worse if we do not wake up! \\n“ The Enemies Within ” is designed to show American voters exactly how modern communism works and how it impacts on your life, every single day. Just how do the communists win big on things like Obamacare and immigration “reform,” which go completely against the wishes of the American people?” This has been a “deliberately engineered attack” on the United States! \\nWatch the trailer : \\nOrder your copy now at EnemiesWithinMovie.com \\n“The Enemies Within” zooms in on the best-kept secret of modern politics. Almost no one is aware of the fact that fewer than 20,000 U.S. communists, socialists and extreme “progressives” are able to influence the politicians and even write the laws that control the lives of over 300 million Americans. \\nThis movie is a must have for your library! Order the movie today and share with your friends. How we stop the madness is by shedding the light on the insanity!'"}, "time": 1742562204.9918532}