{"duration": 0.1522681713104248, "input_args": {"text": "'By Rixon Stewart on November 5, 2016 Rixon Stewart — Nov 3, 2016 Migrants and refugees run to a refugee center after crossing the Croatian-Slovenian border near Rigonce on October 24, 2015. Slovenia says it is considering building a border fence to help stem a record influx of migrants and refugees, as thousands more people arrived from Croatia on October 23. AFP PHOTO / JURE MAKOVEC (Photo credit should read Jure Makovec/AFP/Getty Images) Over one hundred years ago General Albert Pike wrote a letter to Giuseppi Mazzini, the founder of modern Italy. The letter turned out to be grimly prophetic and to this day its content are still highly controversial. In the letter Pike foretold the coming of three world wars. The first would see a clash between the “ British and Germanic Empires”, Pike wrote, and it would result in the overthrow of the Russian Czar. Thereafter, Pike continued: “The Second World War must be fomented by taking advantage of the differences between the Fascists and the political Zionists. “During the Second World War, International Communism must become strong enough in order to balance Christendom, which would be then restrained and held in check until the time when we would need it for the final social cataclysm.” ( Quote source ) Of course there have been claims that Pike’s letter is a forgery . Just as there have been similar allegations about the Protocols of the Learned Elders of Zion. However, that doesn’t change the fact that many of the events we see unfolding before us today were outlined in Pike’s letter, which first became more widely known in the 1950s through the writings of Willaim Guy Carr , a former Canadian intelligence officer. That was well before the current migrant crisis and the so-called ‘War on Terror’, both of which can be seen alluded to in Pike’s 1871 letter to Mazzini. So regardless of the letter’s provenance, it still foreshadows much of what we see unfolding in the world today. Pike continues: “The Third World War must be fomented by taking advantage of the differences caused by the “agentur” of the “Illuminati” between the political Zionists and the leaders of Islamic World. The war must be conducted in such a way that Islam (the Moslem Arabic World) and political Zionism (the State of Israel) mutually destroy each other. ( Ibid ) Readers will note that mention is made of “political Zionism”. This effectively neutralises arguments to dismiss Pike’s letter as an “anti-Semitic forgery, as has been attempted with the Protocols. Because Pike doesn’t mention “Zionism” in way that suggests its complicity in the plot. He simply refers to it as a another element in the overall equation. Just as he mentions “communism”, it’s another means to manipulate the uninitiated. Moreover, according to Pike, the conflict will spread beyond the confines of the Middle East: Meanwhile the other nations, once more divided on this issue will be constrained to fight to the point of complete physical, moral, spiritual and economical exhaustion… ( Ibid ) How will other nations “be divided on this issue”? Through the mass influx of migrants from the “Muslim Arabic World”, ostensibly fleeing conflicts that the West has helped initiate. How will they be “constrained to fight”? On the basis of “humanitarian concerns”; that conveniently provide a false justification for military interventions: as happened in Iraq, in Libya and now Syria. Nor is it a coincidence that there are so few women and children among the migrants currently streaming into Europe. Most are able bodied men of military service age and four out of five are not even Syrian . Moreover, most are not even refugees, in the strict sense of the term. They are economic migrants in search of better prospects, which explains why there are so few woman and children among them. What’s more the majority are not devout Muslims. The ‘Muslim’ angle is being peddled by the corporate media in order to promote the idea of a wider conflict; a notion first proposed by Illuminati strategist Samual Huntington under the label the Clash of Civilisations . The idea being that out of the chaos spawned by wars a “new order” would arise. The need to provide the migrants with “humanitarian” aid is a pretext promoted by the likes of billionaire George Soros to get European nations to open their borders. At the last count over one million migrants had entered Germany and from there spread out to the rest of Europe. Given their demographic make-up — able-bodied men of military service age with little education and few job prospects — it’s a potential time bomb. It will only take renewed strife in the Middle East for the conflict there to spread among Europe’s newly arrived immigrants, and manifest in bombings, shootings, suicide attacks etc. All of which sets the scene for what Pike described as: …a formidable social cataclysm which in all its horror will show clearly to the nations the effect of absolute atheism, origin of savagery and of the most bloody turmoil. ( Ibid ) Gangs of migrants armed with clubs and staves prowl the streets of the 10th Arrondissement, Paris, at night. Click to enlarge Recent reports from Paris demonstrate how this scenario is beginning to unfold on the streets of the French capital . This is no accident. It is exactly as foreseen by Albert Pike over a century ago and it is now being brought to fruition with the help of what Pike called “agentur” of the “Illuminati” . Who can probably be more readily identified today in the likes of George Soros and Angela Merkel The ultimate objective is to destroy the old existing order and establish a new world order in its place. To this end the likes of Soros and Merkel are working toward establishing a new global feudalism. A fiefdom presided over by themselves, the bankers, their security personnel and their technocrats. While beneath them a huge global underclass, made up of a mix of various races and tongues, toils in their global plantation. However, there is one major obstacle to the fulfilment of this plan — and that is Putin’s Russia. It’s no mere accident that the Soros’s supposed charity Foundation has been banned in Russia . Nor is it a coincidence that NATO is steadily encircling Russia with military bases and encroaching ever closer to its borders. The stakes couldn’t be higher. What happens in the next few years will be critical to the development of the human race. Will future generations grow up in a global slave state, where political correctness is paramount? Or will they find themselves in a world where individuality and personnel freedom are more highly prized?'"}, "time": 1742563644.4429562}