{"duration": 0.05617380142211914, "input_args": {"text": "'Kejriwal in talks with Dr Manmohan Singh to become AAP’s Punjab CM candidate Posted on Tweet (Image via intoday.in) \\nDr Manmohan Singh is back with a bang and how!! After his hard-hitting speech in Parliament in which Dr Singh blasted the Modi regime’s demonetization drive, the former Prime Minister is being wooed by none other than Arvind Kejriwal to become AAP’s Punjab CM candidate. If Dr Singh takes the bait, political pundits opine that it could bolster AAP’s chances of grabbing power in Punjab. \\nAAP has been criticized for not naming its CM candidate thus far. Kejriwal is also being painted as an outsider who wants to willy-nilly become Punjab CM after handing over Delhi to Sisodiya. Kejri on the other hand is reluctant to name a CM candidate. That would create a rival power center and Kejri understandably doesn’t want a repeat of the Yogendra Yadav-Prashant Bhushan fiasco . \\nWho can Kejri trust? Naming someone from his coteries is a non-starter – Announcing The Ashutosh as CM candidate would ensure that AAP candidates would lose their deposit in all the seats. Sanjay Singh’s tharki ways make Bill Clinton look like a priest. And even Hafiz Saeed is more popular than Ashish Khetan in Punjab. \\nTo make matters worse, after months of intense negotiations, Sidhu has ditched AAP and hitched his bandwagon to the Congress. The signs aren’t good – TrollKejri gets more RTs than Kejri, Sardesai is back to wooing Sonia, even Rahul seems to be edging ahead. And that’s why announcing Dr Manmohan Singh as AAP’s Punjab CM candidate is, to paraphrase the great Shastri, ‘just what the doctor ordered’. For one, AAP’s CM candidate will be a true blue Punjabi, a Sikh, and that too a former PM!! On the other hand, Kejri can go to sleep easy with the remote control firmly in his hand. In fact, by adopting the 10 Janpath formula of diarchy, Kejri can continue to wield power in both Punjab and Delhi, while having the time and space for Vipasna sessions in Bengaluru, Friday movie reviews and campaigning in Goa. It’s a win-win deal. \\nInsiders say Sonia has agreed to let Kejri borrow Dr Manmohan Singh. To defeat Modi in 2019, AAP needs to come to power in Punjab in 2017. And for that, Sonia is willing to lose Punjab. So under the new arrangement, Dr Singh will report to Kejriwal as well as Sonia. \\nHowever, Dr Singh has placed a few conditions of his own before transferring allegiance to Kejriwal. One, Monty must be made Deputy Chairman of the Punjab Planning Commission. Two, Dr Singh must be given complete freedom in formulating Punjab’s 5 year plans. Three, he will not be required to campaign during the polls. \\nKejriwal has accepted these conditions. Looks like Indian politics is all set to enter a new epoch.'"}, "time": 1742561969.5286674}