{"duration": 0.03192424774169922, "input_args": {"text": "'Ads ISIS Chainsaw Massacre: Nine Christian Youths Literally Sawed In Half, Accused Of Being Part Of Resistance Faction Oct 27, 2016 Previous post \\nJust when you thought ISIS (Islamic State in Iraq and Syria) could not possibly develop more heinous ways of executing captives and prisoners, news out of the besieged city of Mosul, Iraq, reveals that a group of youths have been put to death in what amounts to nothing short of a chainsaw massacre. According to a source, nine Mosul youths were killed, all accused of belonging to an anti-ISIS resistance faction. \\nIraqi News reported August 31 that nine youths were convicted in an Islamic State sharia court of being members of a resistance faction in the city. They were summarily sentenced to a public execution. The nine were then tied to a pole Wednesday and cut in two with a chainsaw by ISIS militants. \\nA source, who wished to remain anonymous, told Iraqi News , “The death sentence pronounced by ISIS sharia court stated that the men should be tied to an iron pole in the center of Tal Afar Square in Mosul and then sliced into two with an electric chainsaw.” \\nThe news outlet went on to note that ISIS has executed thousands of the city’s citizens since taking over Mosul in June 2014. Although allegations and charges have varied, most of those killed by the extremists were convicted of collaborating with enemy forces. \\nThe ISIS chainsaw killings come just a week after Islamic State extremists, after convicting six individuals of collaborating with the enemy in sharia court, killed the group by lowering the then still living men into boiling vats of tar . According to Inquisitr , the killings were also a public execution in Mosul, the carrying out of the sentence said to have been done to instill fear in the citizenry. \\nIt is doubtful that, given ISIS’ barbaric and often horrendous killing methods (not to mention the regularity with which killings are carried out), there was a need to instill fear in the local population. At best, the most that could have been accomplished was to reinforce the Islamic State’s willingness to kill any and all who oppose its authority. \\nAs Iraqi defense forces, supported by U.S. air power, and Peshmerga troops, with assistance from various militias and paramilitary factions, tighten'"}, "time": 1742561896.5373573}