{"duration": 0.10581350326538086, "input_args": {"text": "'BARCELONA  —   Imagine if streets were for strolling, intersections were for playing and cars were almost never allowed. While it sounds like a pedestrian’s daydream, and a driver’s nightmare, it is becoming a reality here in Spain’s   city, a densely packed metropolis of 1. 6 million on the Mediterranean. Ever since the 1992 Summer Olympics focused global attention here, this thriving center of tourism, culture and business  —   often viewed as a hipper, more easygoing cousin to Madrid, the Spanish capital  —   has seen its popularity soar along with congestion on its streets and sidewalks. So in an initiative that has drawn international attention and represents a transformative remaking of its streetscape, Barcelona has decided that many of its   streets and intersections will hardly have cars at all. Instead, they will be turned over to pedestrians. Beginning in September, city officials started creating a system of   superblocks across the city that will severely limit vehicles as a way to reduce traffic and air pollution, use public space more efficiently and essentially make neighborhoods more pleasant. “We like to call it ‘winning back the streets for the people,’” said Janet Sanz Cid, a deputy mayor of the city. “People from Barcelona want to use the streets, but right now they can’t because they are occupied by cars. ” Under the plan, the superblocks will be overlaid on the existing street grid, each one consisting of as many as nine contiguous blocks. Within each superblock, streets and intersections will be largely closed to traffic and used as community spaces such as plazas, playgrounds and gardens. Ms. Sanz said that at least five superblocks were expected to be designated by 2018. Barcelona’s system of superblocks  —   called “superilles” in Catalan  —   would go well beyond the pedestrian plazas that have sprouted up on the streets of New York City. While those spaces have carved out more room for pedestrians in busy corridors, the superblocks represent a more radical approach that fundamentally challenges the notion that streets even belong to cars. The strategy has propelled Barcelona, a city better known for its soccer team and its Gaudí architecture, to the forefront of   experiments and has attracted interest from transportation officials, urban planners and advocates in many other cities paralyzed by gridlock. Claire Weisz, an urban designer at WXY, a Manhattan firm that redesigned the streets around Astor Place, said Barcelona’s superblock plan could be applied in New York to redefine streets as public spaces. “The vast majority of people living in our neighborhoods don’t have cars,” Ms. Weisz said. “Yet our streets are primarily used by cars, and we have a huge need for safe places to walk and bike. ” Barcelona’s plan will redirect cars, buses and commercial vehicles to streets along the perimeter of each superblock, though local residents will still be able to drive their cars at reduced speeds and park in designated areas. Deliveries will be allowed at less congested times. But as Barcelona officials have acknowledged, introducing the superblocks will not be as easy as simply changing the rules. To be widely accepted, the plan will require a cultural shift in the way people view and use the streets. The first of the new superblocks received a mixed reaction when it was unveiled recently in El Poblenou, a former industrial area that has been redeveloped with   housing and offices for technology companies. Though many residents saw the benefits of the superblock, some complained that they were not given enough time or explanation before it was put in place. Businesses have also expressed concerns that it could interfere with their work by, among other things, restricting when they can load and unload goods. To inaugurate the superblock, architecture professors and students have worked with local associations of residents and businesses to come up with alternative uses for the street space. One intersection, using tires and recycled materials, was transformed into a playground with a soccer field and sandbox. Marta Louro, 40, a teacher who lives next to an intersection, said the superblock would make streets safer and reduce pollution. “It gives priority to the pedestrian,” she said. “I believe it’s very important that people have space. ” But others have expressed concerns that they will have to walk farther to a bus stop, or will have a harder time using their cars or finding parking. “It’s not a bad idea,” said Oriol Sanchez, 25, a waiter who drives to work. “But for me, it’s a problem for my car. ” Visitación Soria, 78, said the superblock would not be embraced by everyone. “People like their cars,” she said. “People are already saying there’s a problem finding parking, and this will make it worse. ” No matter the merits, the debate over what a modern urban streetscape should look like, how it should function and whom it should serve has grown increasingly clamorous around the world. In New York City, whose population is at a record high of 8. 5 million residents, conflicts among pedestrians, cyclists and motorists have drawn attention to busy corridors. Transportation officials have recently taken steps to expand the overtaxed promenade on the Brooklyn Bridge. Polly Trottenberg, the city’s transportation commissioner, said that 53 pedestrian plazas had been built, in Times Square and other parts of the city, since 2007, and that another 20 plazas were under construction. In all, these plazas will total 27 acres, roughly the equivalent of 20 football fields, Ms. Trottenberg said. “It’s not an insignificant amount of space that we’ve wrestled back from the automobile,” she said. Ms. Trottenberg said she was aware of Barcelona’s superblocks plan and would consider applying the concept in New York  —   if not the name. In urban planning circles, the term “superblock” has been used to refer to sprawling public housing projects in American cities. “We’re certainly formalizing things that are close to that concept,” she said. “There are a lot of different models, and there’s not a    . ” The city tried a   “Shared Streets” test in August that promoted recreational use of a   area of Lower Manhattan. The speed limit was reduced to 5 miles per hour, and people were encouraged to take to the streets alongside cars. The program was intended to expand on another initiative, “Summer Streets,” in which a section of Park Avenue south of 72nd Street and all of Lafayette Street were closed to vehicles on three August Saturdays. Hundreds of people participated, though not everyone got along. Pedestrians said the slower speed was not strictly enforced, while drivers complained about not being given enough warning and kept honking at people in their way. Still, Paul Steely White, the executive director of the nonprofit Transportation Alternatives, said, “It helps give people a taste of what their life could be like if that space was reapportioned for people rather just for automobiles. ” In recent weeks, the organization has called on the city to reconfigure 14th Street in Manhattan as a “PeopleWay” to accommodate more pedestrians and cyclists when a section of the L train shuts down for repairs. The proposal would limit car traffic, add bus and bike lanes and widen sidewalks. Ms. Trottenberg called it “an interesting idea,” noting that the city is working with the Metropolitan Transportation Authority, which operates the city’s subways and buses, to look at options. In Barcelona, the superblock is not a new idea. The first one was introduced in 1993 near a historic church, the Basílica de Santa Maria del Mar, in the El Born neighborhood in the center of the city. Two more superblocks followed in 2005 in Gràcia, a northern neighborhood known for its plazas and narrow streets. But superblocks did not become a priority until Ada Colau, a housing activist, was elected mayor last year. Ms. Sanz Cid, the deputy mayor, said that instead of focusing on the big commercial developments favored under previous   policies, the current administration was interested in “concrete, precise interventions” to directly benefit local residents. “We want to look back at the neighborhoods and rethink urban planning,” she said. The superblocks are part of a comprehensive program to improve the city’s transportation networks and reduce their environmental impact, Ms. Sanz Cid said. The effort, called the Urban Mobility Plan, includes increasing bus service, extending train lines to the suburbs and tripling the number of bike lanes. Josep Mateu, president of the Royal Automobile Club of Catalonia, which has about one million members, has called for more discussion of the superblocks plan. He described it as well intentioned and said he welcomed the city’s decision to test it in El Poblenou, a less trafficked area in Barcelona. But he added, “We cannot forget that the project does also have other, less positive effects. ” Mr. Mateu said that superblocks, if applied across the city, would significantly limit road capacity for vehicles without reducing the actual number of vehicles to the same extent. “There would be a considerable increase of congestion, which is the situation that produces more pollution,” he said. “It is true that there are areas that will lose vehicular traffic, but it is also true that this traffic would eventually move to other roads and other districts, leading to a strong division between winning roads and losing roads. ” He also noted difficulties some residents could have in gaining access to public transportation, a loss of parking spaces the program could create and negative effects it could have on businesses. “We should also take into account that the superblock project does not seem to be a priority” for Barcelona residents, he said, suggesting that issues like unemployment were more pressing. Salvador Rueda, the director of the Urban Ecology Agency, the agency that designed the superblock model, said a lesson learned from earlier superblocks was that initial opposition gave way to acceptance, in part because of a growing consensus about the benefits. No one has sued the city to remove a superblock, Mr. Rueda said. “Now we know that the main problem is the resistance to change that occurs at the beginning of the implementation of the superblocks. ” In Gràcia, where more than   of the streets were turned into public spaces, car traffic has dropped to 81, 514 trips annually from 95, 889 before the superblocks were established. Street life is thriving: Pedestrians now make 201, 843 trips annually through Gràcia, up 10 percent from before the superblocks. Cyclists make 10, 143 trips annually, a 30 percent increase. The transformation has been even more significant in El Born, which by the 1990s had become so   that many people avoided it. “It was very tough to walk because they used to park cars on top of the sidewalk,” recalled Isabel Ruiz, 53, a longtime resident of the neighborhood. On a recent afternoon, Jaime Batlle and Iñaki Baquero, who teach architecture at the International University of Catalonia, walked along El Born’s cobblestone streets pointing out changes the superblock had produced. Palm trees and benches were in the middle of streets. Trash was collected by an underground pneumatic system rather than trucks. There were no curbs or sidewalks, only a single lane that Mr. Batlle called a “common platform” for drivers and pedestrians so that no one felt more ownership. The lane also forced drivers, when allowed in the street, to drive cautiously. Where storefronts once stood empty, customers now flowed in and out of restaurants, wine shops, hair salons and boutiques. “It used to be full of cars, and now it’s not,” Mr. Batlle said. “Imagine that for the rest of the city. This is the kind of city we want everywhere. ”'"}, "time": 1742628504.2114825}