{"duration": 0.14066267013549805, "input_args": {"text": "'There were scores of men and women, some uninhibited by cares or much clothing, dancing to pulsing beats on a sunny Sunday afternoon along Fifth Avenue. Revving motorcycle engines and honking horns drowned out the cheers of the swelling crowds that lined a   route that started in Midtown Manhattan and reached down to the West Village. But soon, the jubilant procession gave way to what looked like an apparition: a shuffling contingent of figures dressed in all white, veiled in gauzy fabric and wearing placards with names and faces. They represented the 49 people gunned down this month at a gay nightclub in Orlando, Fla. The New York City gay pride march on Sunday reflected the event’s evolution over more than four decades from a defiant protest by a marginalized community into a freewheeling day that included a presidential candidate and other political leaders, floats from major corporations and a diverse crowd that extended beyond members of the city’s lesbian, gay, bisexual and transgender community. (The New York Police Department’s marching band was there, too, and played “Y. M. C. A.,” by the Village People.) But the numerous tributes to the shooting victims in Orlando, including a float at the front of the march carrying the owner of the club, served as a reminder of the parade’s history as a moment each year for the gay community to celebrate its identity in the face of violence and adversity. “It’s a much more emotional day for me than just a parade,” said Michael Leb, 76, who teared up as he reflected on a time, not that long ago, when there was less acceptance of gay people and some companies would not hire them, much less march with them. “It’s just that everybody is with us,” Mr. Leb said. “I remember when we were treated as less than   citizens. It’s a young world, and those who are young will bring even greater change. ” Officials believed the crowds surpassed the 1. 6 million who attended last year, and 30, 000 of them were marchers, making up 484 contingents. The Police Department also had stepped up its presence, with thousands of officers stationed at barricades and directing traffic, watching from the rooftops above and in plainclothes on the ground. “Whenever we talk about New York values, we’re talking about respect and inclusion of all people,” Mayor Bill de Blasio, a Democrat, told reporters before the parade. “This will not just be a celebration of love but a rejection of hatred. This is New York saying, ‘We believe in tolerance for everyone. ’” The theme this year was “Equality Needs You. ” The world now is different from the one in which the first march took place, in 1970, called Christopher Street Liberation Day and held a year after the rebellion prompted by police harassment at the Stonewall Inn. (In a signal of that evolution, President Obama declared the bar, in Greenwich Village, and the area surrounding it a national monument and, with it, created a unit of the National Park Service dedicated to the gay rights movement.) But advocates said that the gay, lesbian, bisexual and transgender community in the United States still faced discrimination and violence and that gay people in other countries faced far dire circumstances. “I am one of the few lucky ones who made it here to safety,” said Subhi Nahas, one of the march’s three grand marshals and a refugee from Syria who has testified at the United Nations about the Islamic State’s persecution of gay people. The march also included a group that called itself Gays Against Guns, whose members lay on the pavement at various points along the route for a    . The group urged stricter gun control laws and condemned the National Rifle Association, which, according to one poster, the group said should “sashay away,” borrowing a catchphrase from “RuPaul’s Drag Race. ” Poot Rojamasiri opted for an outfit more muted than what some others were wearing: a tan polo and green shorts, with a small rainbow sticker on his arm. He said he had considered dressing in drag, but decided against it. “I have fear to express myself,” said Mr. Rojamasiri, who is from Bangkok. “My mom back home told me, ‘Just do not go crazy. ” But others said the event was a rare place where they felt enveloped in acceptance. “Today, I feel just really proud of who I am,” said Logan, a    transgender man who has been transitioning for the past two years. (He declined to give his surname because his family was not supportive of his transitioning.) Katie Graubart, 17, and Helaina Ross, 16, stood on the corner of Fifth Avenue and East Ninth Street waving rainbow flags. ”Love overpowers all,” Helaina said. “Just look at the streets  —   they’re lined with people who all support love and being who you are. ” John Burris, 74, has attended about 30 Pride marches over the years. He came out at 18 and moved to New York around the time of the Stonewall uprising. “This acceptance may be too late for me,” Mr. Burris said. “But I’m so grateful that it’s available to all these young people. ” He became emotional as he recalled the turbulence that had to be endured before reaching the point where the community is now. He said he had lost 75 friends to AIDS. “After they died, we had to decide what to do with the bodies,” he said. “We’d call the parents, and some of them just hung up on us. I put their ashes in the Hudson River and the Grand Canyon. ” Mr. Burris used to come to the march with his partner, who died 12 years ago. He imagined that his partner could not have fathomed what the parade had become and how the world had changed. “We had no idea the beauty that would be here today,” Mr. Burris said, rubbing the goose bumps on his arms.'"}, "time": 1742562962.0185509}