{"duration": 0.1120145320892334, "input_args": {"text": "'Meet All The Pundits Pandering For A Trump Adminstration Job By: Aaron Bandler November 22, 2016 \\nWith Donald Trump set to take office in a couple of months, a number of his lackeys have reportedly been in talks about possibly serving in the administration. As of this writing, there are three pro-Trump pundits that might be in the Trump administration. \\nEric Bolling. Politico reported that Bolling was seen at Trump Tower and was reportedly discussed for a position in the Department of Commerce. What exactly that position that will be is not clear. Bolling told Politico that he \"can\\'t confirm anything.\" \\nGeraldo Rivera flat-out asked Bolling on The Five if he had been offered a job, and Bolling gave a non-answer . \\nBolling has been with Fox News since 2008, where he is the co-host of The Five and hosts the weekend show Cashin\\' In . Before then, he had been an analyst on CNBC and a New York Mercantile Exchange (NYMEX) trader. Bolling has been an ardent supporter of Trump from the get-go, to the point where he resorted to some loony ideas . \\nLaura Ingraham. According to CNN Money , Ingraham is being heavily considered for President Trump\\'s press secretary. Here is what Ingraham has said on the matter: \\n\"I am honored to be considered for that job and other jobs. So we\\'ll see what happens,\" Ingraham said on Fox News. \\nShe cautioned: \"I think people are getting a little far ahead of the narrative.\" But she strongly suggested that some sort of Trump administration post is in the works. \\n\"It\\'s a big decision, but I\\'m at the point where, if my country needs me, and if I can do something to actually, you know, advance the Trump agenda, which is stuff I have written about now for 15 years, with trade, immigration and just renewing America, then I obviously have to seriously consider that,\" she told Fox\\'s Tucker Carlson. \\nLike Bolling, Ingraham, who has been a nationally syndicated radio host since 2001 , has also been an early supporter of Trump, going as far as saying that #NeverTrump conservatives support partial birth abortion, and her website, LifeZette, attacked conservatives like Ben Shapiro for opposing the Alt-Right. (As usual, Shapiro punched back hard .) \\nJeanine Pirro. Pirro, accompanied by Rudy Giuliani, was seen headed inside Trump Tower, which has led to speculation that she is being considered for a job in the Trump administration, according to Page Six . What that job would be is not known. \\nPirro also has been an early Trump supporter, and she has claimed to have known him for 30 years . Pirro\\'s ex-husband, Al Pirro, has been described as \"a man Donald Trump keeps on retainer\" as a real-estate lawyer, and Trump once donated $20,000 to Pirro when she ran for New York state attorney general. \\nPirro has been with Fox News since 2006 and hosts Justice with Judge Jeanine on Saturdays. She also has an extensive legal career as a prosecutor in the state of New York and initially challenged Hillary Clinton when she ran for re-election in the Senate before dropping out to run for state attorney general. Tags '"}, "time": 1742562611.582554}