{"duration": 0.03157520294189453, "input_args": {"text": "'  Joy Villa was hit with a barrage of hate from leftists who wished for her death on social media after she walked the red carpet at the Grammys on Sunday proudly wearing a     dress emblazoned with President Donald Trump’s signature “Make American Great Again” slogan. [“Die,” was the message some Twitter users sent directly to Villa on the social media platform.  @PopCrave @Joy_Villa die,  —   ️ (@iggyoutsold) February 12, 2017,  @Joy_Villa die,  —   ㅤㅤㅤ (@grigiobey) February 12, 2017,  The tolerant Left call for #JoyVilla to be KILLED after she wears Make America Great Again dress to #Grammys, RT to show her your support! pic. twitter.   —   Tennessee (@TEN_GOP) February 13, 2017,  “Sometimes you just gotta be free to express yourself,” Villa wrote of her   dress. “Go big, or go home. You can either stand for what you believe or fall for what you don’t. Above all make a choice for tolerance and love,” the singer wrote on Instagram. “Agree to disagree. See the person over the politics, carry yourself with dignity, always. Life is made to be lived, so go boldly and give no offs!” While the    multiracial singer intended to send a message of “tolerance and love,”   leftists on social media called her “coon,” a “disgrace,” and a “dumb Uncle Tom. ” Fuck Donald Trump and fuck that Joy Villa coon ass bitch.  —   Freddie (@Benjamin_MCQ) February 12, 2017,  @ReignOfApril @Joy_Villa The Coon is strong in this one,  —   Michael Shepperd (@mashepperd) February 13, 2017,  Thank u kind sir for telling me this dumb Uncle Tom braud is named joy villa https:  .   —   Morris Yay do lines (@dances) February 12, 2017,  Andre Soriano, the gay Filipino immigrant and naturalized citizen who designed Villa’s dress, says the   hate from the left is “crazy. ” “It’s more so about love,” Soriano said of the gown he designed for Villa. “We all live on this planet. I’ve never been in the political area. However, it’s just so crazy that people are getting beat up because they voted for Trump, or this and that, someone wants to bomb the White House  …    .I am an American, I moved here from the Philippines and I highly believed in the trueness of what this country can bring. It’s about bringing people together, that’s the message. ” Soriano, who has designed red carpet gowns for singers Macy Gray and Courtney Love, says President Trump is “going to do the best thing” for America. “I always channel Joy’s music as a designer  —   we’re both artists and I love her so dearly,” Soriano said. “She is one of the people on this planet that really promotes love. We need to move this country forward, and we believe it’s time to promote love. We only live once, and we need to promote love. We have one president now who is going to do the best thing for planet America. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742628495.5151212}