{"duration": 0.07930874824523926, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump’s trio of   selections on Friday served notice that he intends not only to reverse eight years of liberal domestic policies but also to overturn decades of bipartisan consensus on the United States’ proper role in world affairs. Mr. Trump is moving quickly to realize his campaign’s promise of a nation that relentlessly enforces immigration and drug laws views Muslims with deep suspicion     War II alliances and sends suspected terrorists to Guantánamo Bay or C. I. A. secret prisons to be interrogated with methods that have been banned as torture. At a time when American cities have been inflamed by racial tensions, police shootings and fears over homegrown terrorism, Mr. Trump made no conciliatory gestures toward Muslims, Mexicans or residents of   neighborhoods, all of whom he disparaged during his campaign. In his first major national security selections so far  —   Senator Jeff Sessions, Republican of Alabama, for attorney general Representative Mike Pompeo, Republican of Kansas, for C. I. A. director and Lt. Gen. Michael T. Flynn for national security adviser  —   Mr. Trump sent a clear message that he does not intend to use these personnel choices to build bridges to Democrats or the moderate and traditionally conservative Republicans who opposed the nationalist overtones of his presidential campaign. The reaction from Democrats was swift and sulfurous. Senator Elizabeth Warren of Massachusetts demanded that Mr. Trump withdraw Mr. Sessions, while Senator Cory Booker of New Jersey charged that some of Mr. Trump’s choices had “degraded and demeaned Americans. ” “The   has created a White House leadership that embodies the most divisive rhetoric of his campaign,” Senator Ron Wyden of Oregon said. Mr. Trump swept into office promising to dispense with the political correctness of Washington’s establishment, and his choices reflect that. President George W. Bush assembled a Republican cabinet with a variety of shades of conservative ideology, including some members who challenged the president. Mr. Trump’s early decisions suggest he favors a cabinet that will echo his opinions. The choices also suggest that on the perennially vexing question of how the government should balance security and civil liberties, Mr. Trump will throw his weight firmly behind security, in matters of both counterterrorism and traditional law enforcement. Mr. Sessions, one of the Senate’s most conservative members, defended Mr. Bush’s authority to conduct wiretapping without a warrant after the Sept. 11 attacks. He has been a vocal supporter of military detention at Guantánamo Bay and sharply criticized the Obama administration for assigning lawyers to suspected terrorists and giving them the right to remain silent, even when arrested on American soil. He has said the United States should keep waterboarding  —   a banned technique that the Obama administration considered to be torture  —   as an interrogation option because it works. A former prosecutor with a history of racially tinged remarks, Mr. Sessions has voted against laws that protect gay people and guarantee equal pay for women. He has also supported efforts to roll back the Voting Rights Act. He has shown over two decades in the Senate that he believes the Justice Department should do more to crack down on illegal immigration. And he has supported strict enforcement of drug laws and opposed the détente that Washington reached with states that legalized marijuana. While the Obama administration has used the Justice Department to expand the definition of civil rights  —   to cover gays, lesbians and transgender people, for example  —   Mr. Sessions says the government should not be “a sword to assert inappropriate claims that have the effect of promoting political agendas. ” “Jeff Sessions has a   record  —   from his early days as a prosecutor to his present role as a senator  —   of opposing civil rights and equality,” Sherrilyn Ifill, the president and   of the N. A. A. C. P. ’s Legal Defense Fund, said in a statement. “It is unimaginable that he could be entrusted to serve as the chief law enforcement officer for this nation’s civil rights laws. ” As one of Mr. Trump’s earliest, most vocal supporters, Mr. Sessions has supported Mr. Trump’s call for a temporary ban on immigration from Muslim countries. As the nation’s chief law enforcement officer, Mr. Sessions would be in position to help put that ban into effect. “We have no duty to morally or legally admit people,” he said this year. “We need to use common sense with the    of the threat. It is the toxic ideology of Islam. ” Along with Mr. Pompeo and General Flynn, he will thrust the charged phrase “radical Islamic terrorism” to the center of American foreign policy in a way that blurs the lines between a war on terrorism and a war on Islam. General Flynn, in particular, has used   language that even the most strident Republicans have avoided. “Fear of Muslims is RATIONAL,” he posted on Twitter in February. He has described Islam as a political ideology that has turned into a “malignant cancer. ” Like Mr. Sessions, General Flynn favors an immigration ban and has expressed support for the idea of forcing Muslims in the United States to register with the government. He once erroneously wrote on Twitter that Shariah, or Islamic law, was in danger of taking over the country. Both Mr. Bush and President Obama believed that such assertions inflamed   sentiment, served as a recruiting tool for terrorists and antagonized countries in the Middle East that the United States needed as allies in the fight against violent extremism. Since Sept. 11, 2001, there has been bipartisan consensus that the best way to combat terrorism was to dismantle Al Qaeda and other networks while avoiding being seen as attacking Islam. Mr. Trump has shown no such qualms. Mr. Pompeo has said Muslim leaders contribute to the threat of terrorism by refusing to repudiate it, although Islamic leaders and advocacy groups have done so repeatedly, and often. “Silence has made these Islamic leaders across America potentially complicit in these acts and, more importantly still, in those that may well follow,” Mr. Pompeo said in 2013. William McCants, a senior fellow at the Brookings Institution and the author of “The ISIS Apocalypse,” said Mr. Pompeo and other Trump allies “are operating on the assumption that it’s something going on in the religion itself. ” “It is a sea change,” he said, “and it really changes the terms of the discussion about what to do. ” Should the Trump administration shape its counterterrorism strategy and broader foreign policy around these ideas, Mr. McCants predicted the United States would find itself at odds with its allies in Europe and the Middle East, which have long sought to separate violent extremists from the billions of peaceful mainstream Muslims. “This kind of rhetoric pushes them together and in a way creates a   prophecy,” he said. Some analysts said they believed that Friday’s selections were intended to reward loyalty and appeal to Mr. Trump’s base. They held out hope that the next set of selections  —   for secretary of state and secretary of defense  —   would go to more moderate figures, much as Mr. Trump balanced out the selection of Stephen K. Bannon at the White House by naming Reince Priebus as chief of staff. On Saturday, Mr. Trump will meet with Mitt Romney in Bedminster, N. J. to discuss, among other things, the top post at the State Department, according to people close to the transition. Last week, he held similar discussions with Gov. Nikki R. Haley of South Carolina. “From the beginning,” said Peter D. Feaver, a political science professor at Duke who served in Mr. Bush’s National Security Council, “the challenge for Trump is that he can’t do all the work he needs to do, with the caliber of people he needs, just from within his core of supporters. ”'"}, "time": 1742628573.0784104}