{"duration": 0.10674142837524414, "input_args": {"text": "'Last week I expounded the idea that we should take the time to ponder about emotions . These matter much in prompting us to take action or not to, to think about something or not to. Sustained emotional states can lead us to pedestalize girls, ignore our own needs, or refraining from caring about our own interests, whereas others push theirs every day. They can also allow said girls to go shamelessly after short-term pleasure, or be complacent to rapefugees while shrieking and finger-waving against men of their own kin.\\nPondering passions and emotions does not mean getting led by them at the expense of critical thinking. Rather, it is the exact opposite, as it allows us to spot the shrewd ones who want to push our emotional buttons, as well as being freer to take more thoughtful and actually less emotion-determined actions. Once we have gained awareness of passions, we can decide which ones we want to stimulate and why.\\nFollowing this idea, I made some suggestions of how and in whom we could stir positive emotions such empathy, hope, and love. Today I will do the same with four other passions or emotions: admiration, shame, humility, and fear.\\n1. Admiration \\nSociety, I think, should admit some victimhood to those who were raised as weaklings or acted cluelessly out of good intentions. Women in particular should be more empathetic and nurturing towards nice and beta males—as long as their empathy does not extent out of admitted boundaries—hence taking an opposite direction from the egotistical, uncaring orientation a lot of them currently harbor. Of course, this should not equate to validating too much the unhealthy, unmanly men: women should also be trained into validating more manlier men. And here admiration comes into play.\\nAs Nassim Taleb put it, we are living more and more in an “extremistan” where those at the highest level take the lion’s share while the resources diminish quickly down the ladder. Girls today tend to admire only the most famous or high-status people, which leads them to despise the ninety-nine per cent. This exasperated hypergamy should be tamed so that the average man, as long as he achieves the minimum and/or is upstanding and dutiful, gets his fair share. A more “democratic” but still conditional distribution of girls’ admiration would reward actual good behaviour for men and decrease the intramasculine competition .\\nGirls should also admire—and not mock—proper feminine role models. Upstanding mothers, females taking proper care of themselves and so on ought to be at least esteemed by the average girl.\\n2. Shame \\nShame arises from measuring our actions against moral standards and discovering that they fall short. If our actions fall short and we fail to notice, we can ‘be shamed’ or made to notice… Shame is normally accentuated if its object is exposed, but, unlike embarrassment, also attaches to a thought or action that remains undisclosed and undiscoverable to others. (Neel Burton, Heaven and Hell , chap.4, p.38)\\nA particularly strong emotion, shame usually comes as a blow, makes one lose face or composure, to eventually feel guilt or remorse. Just like other strong emotions, it has been used with consumed malignancy by the Left.\\nLeftists created a narrative where whites are held entirely responsible for dreadful historical phenomena such as slavery, the Holocaust, an oppression of “minority” groups, or “racism.” As these phenomena are constantly talked about and expanded, whites are also supposed to feel a correspondingly boundless guilt. The sheer power of guilt can explain why so many whites have been afraid to stand up: being shamed as a “racist” or “Nazi” can be enough to endure rejection from one’s family, lose reputation and employment.\\nShame can be aroused through two levers: the standards one agrees with, and one’s purported responsibility. Both levers have been skillfully used to un shame the liberal-favored groups. As for the standards, feminists attacked what they called slut-shaming while also shaming relentlessly manly behavior, and as for the responsibility, pretty much all those who claim to identify with a “minority” tend to deny all by slipping it over the majority’s shoulders.\\nThis is how you get persistent offenders or Jihadi families expressing neither shame nor remorse, whereas the productive, working, and normally sociable person gets nagged for being white. In the Current Year, better be a true rapist who can evade responsibility and shame by invading Europe than a young virgin of European descent.\\nWhat we should do here sounds pretty obvious in theory though it will be much harder to carry on in practice, as people evidently hate being shamed, especially when they have been accustomed of blaming everything on the others.\\nShame the fatties , shame the arrogant snowflakes whose unwillingness to respect is all too obvious, recall the self-determination of anti-white liberals and criminals. They all made free choices. They should carry all associated responsibility.\\nAs for us, we must keep our face straight, never make clueless concessions to skillful framers or hysterical SJWs. If they appeal to moral standards, put forth your own as legitimate. If they appeal to your purported actions or responsibility, emphasize theirs—and how it cannot be boiled down to external factors.\\nEven dogs and cats are considered responsible by their caretakers so they can be punished for bad behaviours and learn: likewise, granting certain people or groups a constant de-responsabilization amounts to give them a free pass for destroying everything. Criminals of said groups have agency, and the liberals who gave them a pass to plunder and kill whitey are responsible as well.\\nShame can also arise from being associated with something or someone deemed as despicable. The liberal policy of distinguishing sharply between terrorists and documented aliens, in spite of how much the latter to house the former, allows for the latter going without shame even when they are closely associated with terrorists—whereas every white is threatened with shame if he has a “-ist” or “-phobic” acquaintance.\\nTurn the table. Shake off the burden from the disenfranchised majority, and put it back on those who have been acting with impunity for too long.\\n3. Humility \\nCurrent Year girls’ overinflated ego is enough, notwithstanding economic or racial factors, to explain a host of social problems. Blinded by it, girls ignore how much they are determined by their own cravings, short-term desires, or by the latest fashions around. They drink loads of booze, fuck with random strangers, reframe their story as a “rape” later so they can blame it all on the guy . They never learn to cook, clean, take care of something else than their Instagram account and corporate career. (Speaking of corporate: isn’t it striking that so many men are badly in need of employment, sex, and have almost nothing, whereas spoiled corporate drones believe they can have—take—it all?)\\nEgo makes one lose any sense of proportion or balance. It leads to complacency, merciless exploitation of others, refusal to take responsibility, and open despise.\\nAugustine of Hippo wrote that humility was at the foundation of all other virtues. This makes sense. If one’s ego is inflated, one does not feel the need to practice virtues and feels entitled to never be ashamed of her shortcomings—that are easily denied or blamed on someone else. Ego also leads to wasting resources on luxury, parce que je le vaux bien , as says a famous brand of cosmetics, instead of focusing on self-improvement or caretaking.\\nThough girls should be the first to have their ego smashed, as the survival of basic family units depends on it, bloated ego is a general disease in our age. Men too can be sold the idea that, say, being a smug urban elf is a proof that one sides with progress and civilization whereas they are actually weak, dependent and unable to fix anything by themselves. It’s not all about our individual selves.\\n4. Fear \\nReaders asked for it, so, here it is. Fear is a very powerful emotion, to the point of prompting one to freeze, flee, abandon a previously planned course of action, or never even think to consider an idea or an action. The Left has been using it in two different, albeit complementary, ways.\\nFirst, it has constantly accused conservatives to “play on fears,” implying irrational or unjustified fears, when they dared to ask serious questions or making realistic assessment. When the 1965 Immigration Act was voted, democrat senators pretended that opening up the borders would not change the ethnic mix of America and that any suspicion it might happen was “highly emotional.” In France, the socialists and mainstream righters alike have been carrying the same accusations. Here the Left accused any doubt to be a hint of unjustified and intolerable “fear.”\\nWell, what happened since? Doesn’t it look like every “fear” from the right was justified—especially since the post-WW2 Right has always been incredibly wary, not to say coward, when it came to criticize the Left’s moral high ground?\\nSecond, the Left has also been keen on doing exactly what it accused the conservatives to do, namely, stirring fear about political bogeymen. Liberals invented “rape culture” or “patriarchal oppression” when men actually became weaker. They associated to “Nazism” any white person who assumes his race should basically survive. They shamelessly bludgeoned whom they could call “white supremacists” as if defending one’s right to live in peace against hordes of thugs and violent parasites was equal to being Hitler himself.\\nWhites were led to fear their own supposed “authoritarian” tendencies, as the shrewd Jews who intrigued through the Frankfurt school put it (see Kevin MacDonald, Culture of Critique , chap.5). Whites were led to fear some of their fears—better have one’s daughter killed by Muslims than expressing concerns about them to other whites, because racism is so evil, boo.\\nWhen I was younger, I noticed the local thugs had a huge advantage over us normal people: they were much more fearless. They had this devil-may-care, provocative attitude, which made them potentially dangerous to the bourgeois prude beta male and attractive to females. Not incidentally, the first movie of the French essayist Alain Soral Confessions d’un dragueur (“Confessions of a Womanizer”) shows a young Arab with decent pick-up experience taking a young middle-class white boy under his wing as to help him escape from virginity.\\nFeeling fear is a necessary step in life. Fear appears greatly useful when there is something to flee from or watch as a potential hazard, but being too fearful or afraid of the wrong things can be a serious liability. Never trust a liberal who either points finger at you for being “fearful” or tries to paint you as dangerous and justifying his own fear-mongering.\\nOn the flip side, being feared by others is not always a negative. Some people need to be afraid to respect you: if you try to treat them correctly or let free rein to your innate generosity, they will harm and exploit you. Such people, just as everyone around who may be tempted to disrespect, should be kept in check by a minimal fear. Better be feared and respected than getting tread upon.\\nConclusion Frame and un frame whatever matters when you have to, as you have to. The left cursed us by locking us into an always negative framing: when we fail, whatever the reason, we are despised as weak or “losers,” and when we succeed they say we are “privileged” and “oppressive.” In both cases, the chosen framing leads to negative emotions associated to us— no matter what we actually do .\\nFortunately, it is always possible to turn the tables, provided we keep a tight frame, and change these emotions as well. For example, when we are weak, we should elicit empathy, be noticed for our good intentions or noble infirmities, and when we are strong, we should elicit admiration and trust.\\nThink, frame, feel positive about us and about what we do. Get rid of those who won’t.\\nRead Next: 3 Emotions Men Should Master \\n'"}, "time": 1742628539.125332}