{"duration": 0.08564972877502441, "input_args": {"text": "'Police fired water cannons on peaceful protesters in freezing temperatures in North Dakota on November 20th. At least 17 protesters were taken to the hospital, and some were treated for hypothermia. \\n\\nPolice used tear gas, rubber bullets, and water hoses keep protesters from pushing past a blockaded bridge on a state highway on Sunday and early Monday morning. \\n\\nTemperatures in Cannon Ball, North Dakota dropped into the 20s while police in riot gear sprayed activists with a hose mounted on top of an armored vehicle. Protesters were also pelted with rubber bullets, tear gas, and concussion grenades during the standoff. \\n\\nPolice have set up wire and concrete barriers on the bridge, which is about a mile south of where the pipeline developer plans to drill. Protesters argue that this barricade prevents emergency services from reaching the Standing Rock Sioux Reservation and a nearby camp they have been using as a staging ground for demonstrations. \\n\\nProtest organizer, Dallas Goldtooth, claims that protesters started small fires in the area to help warm people who had been sprayed with water in freezing temperatures. Law enforcement officials claim to have used water to put out those waters, yet there is evidence they were using water to spray and disperse protesters. \\n\\nThe road itself is public, yet according to Tara Houska, another protest organizer, over 200 people were hit with tear gas, pepper spray, or water. \\n\\nProtesters and organizers are using the Cannon Ball gym as an emergency relief center with medics from the Standing Rock Sioux and Cheyenne River Sioux tribes. People who were injured in the standoff are being treated there. Physicians and tribal healers with the Standing Rock Medic and Healer Council are calling on authorities to stop using water cannons against the protesters, saying that below-freezing temperatures can cause hypothermia. They claim that the techniques used by militarized police are potentially lethal and controversial, especially since protesters have been peaceful. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She graduated The Evergreen State College with an undergraduate degree focusing on Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742561883.536964}