{"duration": 0.11537456512451172, "input_args": {"text": "'The media doesn’t even try to hide its shameless pro-Socialist bias these days. Since nobody really pays attention to them anymore, you might have missed some of the more entertaining butthurt spouted by shameless propagandists posing as journalists.\\n2016 election night coverage on the propaganda news channels is a lesson in hilarity when examining the reaction of lamestream media talking heads. What is most entertaining about Trump’s ascendancy to the Oval Office is that it was totally unexpected, catching cocksure Marxists at CNN and other alphabet channels completely off guard.\\nLet’s go over some of the more entertaining reactions last Tuesday.\\n5. Hillary Shill Martha Raddatz Breaks Down In Tears \\nOver at ABC, the wrinkled old Hillary shill Martha Raddatz was at a loss for words as she attempted to perform an off the cuff hamster rationalization to fellow Clinton operative George Staphylococcus, explaining why The Bitch lost the election.\\n\\nRaddatz looked like her mother just died as victory turned into defeat for the criminal Hillary Clinton. She’s sure to be moving from a pack of smokes a day to two packs a day as the reality of the election continues to settle into her pea brain over the next 4 years. Her tears say more than her boilerplate language ever could.\\n4. Bernstein Plays The Race Card \\nTo the mainstream media, white people voting in accordance with their own self-interest is racist. In fact, white people acting in any other manner than total subservience is racist to CNN. Washington Post “journalist” Carl Bernstein even went so far as to say Trump’s election is “tragic and dangerous” as despondent and quite possibly drugged CNN propagandists looked on. Bernstein seemed most upset about Trump’s immigration policy proposals, in which Mexico will no longer be able to flagrantly let its citizens violate U.S. immigration law.\\nBernstein completely forgot the racism white people have endured all year long at the hands of Black Lives Matter, La Raza and other black and brown supremacist groups.\\n3. Chris Matthews Goes Into Hamster Rationalization Mode \\nHamster rationalizations are usually reserved for women, but effeminate, low-T manlets like Chris Matthews also have them. His first spin of the hamster wheel makes him say Hillary won the debates. She didn’t. Then he says she had the best ad campaign. Nobody believes advertising or anything you say, anymore Chris. Then Matthews says she had the best ground game. She might have, but she was a terrible candidate. The half-man, half-alligator James Carville looked ready to give Chris a hug as the reality of Hillary’s defeat began to settle in on MSNBC.\\n2. The Racist Van Jones Whines About White People \\nVan Jones looked like he needed a change of underwear as he fell back on tired, old leftist talking points from the 1960s about the evil white male —especially white males that haven’t been turned into geldings. He then goes on with an emotional overreaction to say families will be afraid to have breakfast the next day because whitey got back into office. LMFAO. Really, dude?\\nHe then says immigrants are afraid now that Trump is going to be President. No Van, immigrants aren’t afraid. Illegal hordes who figuratively if not literally say “Fuck you!” to U.S. immigration law are afraid, as they should be.\\nJones then goes on to make a supremely ironic quote as he talks about a so-called white-lash: He says Trump’s campaign was based on “Throwing away some of us to appeal more deeply to others.” Umm, isn’t that what the entire platform of the Democratic party is, Van? Throwing away, nay, crucifying white men to appeal more deeply to others ? Your entire career is based on just that, Mr. Jones.\\n1. CBS Does A Mea Culpa CBS published an article admitting how badly the press is biased\\nCBS was so stunned it did a full mea culpa on the network’s shoddy coverage of the 2016 election. This stunning article entitled “The Unbearable Smugness of the Press” needed to be written 10 years ago. Better late than never. CBS actually echoed what we in the manosphere and alt-right have been saying since day one with the Op-Ed piece.\\nThis is all symptomatic of modern journalism’s great moral and intellectual failing: its unbearable smugness . Had Hillary Clinton won, there’d be a winking “we did it” feeling in the press, a sense that we were brave and called Trump a liar and saved the republic.\\nThe Eyeball network even admitted the contempt the network has for men like us.\\nSo much for that. The audience for our glib analysis and contempt for much of the electorate, it turned out, was rather limited. This was particularly true when it came to voters, the ones who turned out by the millions to deliver not only a rebuke to the political system but also the people who cover it. Trump knew what he was doing when he invited his crowds to jeer and hiss the reporters covering him. They hate us, and have for some time.\\nAnd can you blame them? Journalists love mocking Trump supporters. We insult their appearances. We dismiss them as racists and sexists. We emote on Twitter about how this or that comment or policy makes us feel one way or the other, and yet we reject their feelings as invalid.\\nDamn. At least some people over there know why we hate them. (That includes this former mainstream media news anchor who defected!)\\nShameless Activism Got Marxism? It’s the guiding philosophy of the alphabet channels\\nAnyone who has the capacity to perform an iota of critical thinking knows the mainstream media is NOT on the side of the average American. It hates and seethes at traditionalists and works to tear down every institution of Western civilization while attempting to impale the most hated of creatures on this planet, the Evil White Male.\\nThe rebuke of a sorry candidate like Hillary when the socialist shills thought she was a shoe-in caught the smug son of a bitches off guard. Their reactions are priceless, and need to be documented and remembered. These reactions are undeniable proof that blogs like Return Of Kings and web sites like Breitbart and Drudge are sorely needed, indispensable resources in this day and age.\\nWe have not been getting the truth from media for generations. And now, as alternative voices appear, the rift between the two versions of reality grows wider and deeper. The once mainstream media have become nothing but shameless activists for New World Order socialism. The election night “horror show” only solidifies this point.\\nWe should be proud to be activists pushing our own agenda, if nothing else to balance the scales. The media are NOT friends of the American public. Ultimately, the tired old Socialist media must be dismantled in order for freedom and traditionalism to survive .\\nRead More: Did The Anti-Donald Trump Riot In Chicago Help Trump Cruise To Victory On Tuesday? \\n'"}, "time": 1742561964.1731734}