{"duration": 1.3552577495574951, "input_args": {"text": "'President Donald Trump released his 2018 budget proposal on Thursday revealing that the U. S. Department of State funding could be cut by 31 percent, sparking outrage among mostly Democrats, who say the cuts could put the country at risk. [Wendy Sherman, under secretary of state for political affairs in the Obama administration, told MSNBC’s Rachel Maddow on Thursday that Trump’s proposal to cut the State Department’s budget by a third would have “implications” for  fighting terrorism and epidemics like Ebola. ”  But Rep. Louie Gohmert ( ) said on Thursday at the Conversations with Conservatives Press Conference on Capitol Hill that, given the agency’s priorities during the Obama administration, the cuts might fall short. Gohmert said the cuts  —   first reported as 28 percent but later clarified by the State Department as totaling 31 percent   —   “might not be enough. ” Gohmert cited the Obama administration’s priority at State of promoting homosexual rights around the world, including encouraging nation states to change their laws regarding homosexuality and   marriage. On Jan. 11, the   rights publication the Washington Blade published a story entitled, “10 ways Obama promoted LGBT rights abroad. ” Those moves by the Obama administration’s State Department included: Mark Toner, acting spokesman at State, clarified on Thursday the proposed percentage of cuts at State. “There’s a little bit of confusion about that, so let me try to clarify it,” Toner said. “The FY 2018 budget requests 25. 6 billion in base funding for the Department of State and USAID, and that’s a 10. 1 billion or 28 percent reduction from the FY 2017 continuing resolution level. ” “So that’s a 28 percent reduction without the overseas contingency operations funding,” Toner said. “So the budget also requests, obviously, 12 billion as overseas contingency operations funding for a total request of 37. 6 billion, which represents an overall reduction of 17. 3 billion. ” “That’s 31 percent from the annualized  —   or from the CR level, which is base and OCO funds,” Toner said. “So just to simplify it, the two variations there  —   the 28 percent is the amount of reduction without OCO, which is the overseas contingency operations funding. ” “The 31 percent number or figure is with that overseas contingency operations funding,” Toner said. The Los Angeles Times suggested in its reporting on Thursday that Secretary of State Rex Tillerson was not concerned with the budget cuts, rather than characterizing his remarks as compatible with President Trump’s assessment that the Department has been overfunded in the past. “But the head of the department, Secretary of State Rex Tillerson, seemed unconcerned Thursday,” the Times reported. “The level of spending that the State Department has been undertaking in the past  —   and particularly in this past year  —   is simply not sustainable,” Tillerson said at a brief news conference in Tokyo, the first stop on a     tour of Asia. “Tillerson, for most of his career a top executive at Exxon Mobil, said he expected more aid from other countries would help to cover the shortfall as the U. S. recedes, and he said he was ‘confident’ the State Department would continue to fulfill its mission,” the Times reported. “We are going to be undertaking a very comprehensive examination of how programs are executed, a very comprehensive examination of how we are structured, and I’m confident that with the input of the men and women of the State Department, we are going to construct a way forward that allows us to be much more effective, much more efficient and be able to do a lot with fewer dollars,” Tillerson said. “We understand the challenge,” Tillerson said. “I take the challenge that the president has given us on willingly and with great expectation that with everyone in the State Department’s assistance, we’re going to deliver a much better result for the American people in the future. ”'"}, "time": 1742562883.3986967}