{"duration": 0.07639503479003906, "input_args": {"text": "'Email \\nFlush with money from selling inexpensive goods (made by what is in effect slave labor) in the American market, the Chinese communists are continuing their shopping spree by buying up businesses connected with the U.S. entertainment industry. The New American recently reported on the Chinese purchase of AMC (which owns hundreds of movie theaters in the United States) and the desire of a high-ranking member of the Chinese Communist Party to buy an American movie studio. \\nNow, the Chinese firm Wanda, which is owned by the Chinese Communist government, has bought Dick Clark Productions for about $1 billion. \\nBegun in 1957 by the famed host of American Bandstand who died in 2012, Dick Clark Productions produces the Golden Globe Awards, the American Music Awards, and Billboard Music Awards. \\nWanda is run by Wang Jianlin, who is considered China’s wealthiest man and is a top figure in the ruling oligarchy of the Chinese Communist Party. \\nXiaoma Lu, the CEO of Wanda Investment, stated, “We are excited to partner with such an iconic company and look forward to supporting the management team as they continue to build the company and expand upon its enormous legacy.” \\nWang assured that after the purchase business will continue as usual, with the new owners retaining the current executives, including Chairman Peter Guber, CEO Allen Shapiro, and President Michael Mahan. Present owner Todd Boehly will remain as an advisor to Wanda. \\nAnother previous Wanda buy was $3.5 billion for Legendary Entertainment, the studio that produced Pacific Rim , Warcraft , and the soon-to-be released The Great Wall , starring Matt Damon. \\nThe moves by Wang and the Chinese government into the U.S. entertainment industry have raised some concern in Congress. In September, 16 members of the U.S. House of Representatives wrote a letter to the U.S. Government Accountability Office asking for them to scrutinize Chinese purchases of American entertainment companies as a national security concern. The letter mentioned recent Chinese efforts to “censor topics and exert propaganda controls on American media.” \\nBecause of the sheer size of the Chinese movie market, among other reasons, the U.S. industry has already shown extreme caution not to offend the communist giant. For example, when the 1980s movie Red Dawn was recently re-made, the new script originally called for the invaders to be Chinese communists (rather than Russian communists as in the original movie) attempting to take over America. After the film had already been made, MGM became concerned enough about the Chinese reaction to recast the invaders as North Koreans . One supposes there aren’t many moviegoers in North Korea. \\nAnd that was before Wanda took over AMC. \\nThe propaganda opportunities for Wanda and the Chinese communists in the motion picture and television industries far surpass any such possibilities to be advanced by growing wheat, making cars, or selling cheap goods at American retail stores. For many people, once they have viewed an event on the silver screen, or heard someone say something in a movie theater, or even on television, it becomes “reality” for them. \\nWriting in the communist newspaper The Daily Worker in 1925, Will Muezenberg explained the importance of the movie industry in advancing the goals of the communist world. Muezenberg, an agent of the Comintern (created to spread communist ideology and promote Soviet interests worldwide) stated, “One of the most pressing tasks confronting the Communist Party in the field of propaganda is the conquest of this extremely important propaganda unit [the movies], until now the monopoly of the ruling class. We must wrest it from them and turn it against them.” \\nAnd that is precisely what is involved in the Chinese move into Hollywood and television.  '"}, "time": 1742561778.7323666}