{"duration": 0.05000662803649902, "input_args": {"text": "'Email \\nMeditation is some pretty awesome stuff, and the practice is finding its way into more and more lives every day. Now a program at Cedar Creek Middle School in Portland, ME is proving that meditation can have a major impact. By meditating just 15 minutes a day, nearly all of the kids in the program have seen lower stress levels and higher test scores, and three of them have gone absolutely insane. \\nWhat a remarkable result! \\nThe program, called Mindful Kids, encourages students to sit silently in a darkened classroom for 15 minutes a day and listen to white noise. Six weeks in, the effects were already striking: Most of the students had noticeably improved behavior and were more engaged in their schoolwork, and three of them had pulled out all of their hair and created their own language that they speak through their nostrils. \\n“It’s astounding,” said Colin Creedman, the teacher who started the program. “We expected the meditation to cause some improvement, but we didn’t plan on it having such a big impact. ‘C’ students became ‘A’ students. There have been no fights. Three of them started worshipping a Bunsen burner as their god. And they’re much more focused in class. Anyone who’s skeptical of the effectiveness of meditation really needs to meet these kids.” \\nThe students in the program have noticed some big differences, too. “I feel more calm,” said 11-year-old Melissa Hogseth. “Not just during the meditation, but throughout the day. I think it’s great for kids to meditate.” \\nTen-year-old Jason Woodward says he also has benefited from meditating: “My blood has become pure mercury. I can absorb shadows now. Meditation has helped me focus my energy into a beam that can cut glass and, soon, flesh and bone.” \\nUnbelievable! The brain is an amazing thing, and these kids prove that meditation can unlock its full potential and sometimes make it go batshit insane. Way to go, Cedar Creek Middle School!'"}, "time": 1742561869.983458}