{"duration": 0.14829349517822266, "input_args": {"text": "'In an article that appeared online in The Mail on Sunday, a British tabloid, the journalist David Rose described “astonishing evidence” that the National Oceanic and Atmospheric Administration in the United States had “rushed to publish a landmark paper that exaggerated global warming and was timed to influence the historic Paris agreement on climate change. ” “Exposed: How world leaders were duped into investing billions over manipulated global warming data,” the article’s headline read. Mr. Rose, who has made   claims in the past that did not hold up to scrutiny, said a “  ” John J. Bates, a recently retired scientist at NOAA’s National Centers for Environmental Information, had told him that the agency “breached its own rules on scientific integrity” in publishing the study in June 2015. According to Mr. Rose, the study, which refuted earlier work that suggested global warming had slowed in the first decade of this century, “was aimed at making the maximum possible impact on world leaders” at the talks in Paris in December 2015 that led to the agreement by more than 190 nations to set limits on carbon emissions. After Mr. Rose’s article was published, the House Committee on Science, Space and Technology and its chairman, Representative Lamar Smith, Republican of Texas, wrote about it on Twitter. Beginning in 2013, scientists published papers showing that, according to land and sea surface temperature data, the rate of global warming had slowed since the late 1990s. This pause or hiatus, as it was often called, puzzled scientists because it came despite a continuing increase in emissions of carbon dioxide and other   gases. The findings also became a cause célèbre among climate change denialists, who cited the papers as evidence that concerns about global warming were at the least overblown. The 2015 paper, by Thomas R. Karl, who was then director of the National Centers for Environmental Information, and others, used improved data sets to show that the slowdown probably did not occur at all. Because temperature data was collected in different ways over the years  —   and some methods were more reliable than others  —   it is normal for the data to be refined and adjusted. Mr. Karl’s paper reflected the latest refinements, especially for ocean data. In the Mail on Sunday article, Dr. Bates, who at one point was in charge of archiving climate data at the centers, accused Mr. Karl of having used “unverified” data. In a long blog post published Saturday, Dr. Bates went into extensive detail  —   the kind that only true data geeks could love  —   about how data sets are or are not archived and verified at NOAA. But Dr. Bates also accused Mr. Karl of misusing the process. “We find Tom Karl’s thumb on the scale pushing for, and often insisting on, decisions that maximize warming and minimize documentation,” he wrote. Republicans on the House committee and Mr. Smith, in particular, have long attacked Mr. Karl’s paper and have focused on it as part of a lingering investigation of what Mr. Smith has described as the Obama administration’s “suspect climate agenda. ” The committee has demanded that NOAA researchers turn over emails related to the work the scientists have refused to do so. Climate scientists, some of whom had worked on the data sets, voiced support for the work of Mr. Karl and the other researchers. In a post on the blog of the Irish Climate Analysis and Research Units at Maynooth University, Peter Thorne, who worked on the data but left NOAA before work began on the paper itself, disputed much of what Dr. Bates said. Dr. Bates, Dr. Thorne wrote, was not involved in the data work and had misrepresented “the processes that actually occurred. ” Dr. Thorne also disputed the idea that Mr. Karl had his “thumb on the scale. ” Mr. Karl only used the data  —   he was not personally involved in the refinements, Dr. Thorne wrote. “At no point was any pressure brought to bear to make any scientific or technical choices. ” In a post at Carbon Brief, a British website that covers climate science and policy, Zeke Hausfather, a climate scientist at the University of California, Berkeley, disputed the contention that the data sets used in Mr. Karl’s paper were unverified or that the data had been manipulated. Dr. Hausfather was one of the authors of a review of the NOAA ocean data, which showed the most change. The paper, published in January, compared the old and new NOAA data with independent data from satellites, buoys and other sources and found that the new data matched the independent data more closely. The result, he wrote, “strongly suggests that NOAA got it right and that we have been underestimating ocean warming in recent years. ” In an interview on Monday with EE News, Dr. Bates appeared to distance himself from some of what he wrote in the blog post, and from the way his criticisms were portrayed in the Mail on Sunday article. “The issue here is not an issue of tampering with data,” he said, “but rather really of timing of a release of a paper that had not properly disclosed everything it was. ” Climate Home, a nonprofit site based in London that offers news and analysis, also weighed in on one of the central contentions of Mr. Rose’s article, that the publication of the NOAA paper had ”duped” policy makers into adopting the Paris accord. The site contacted representatives to the talks from 10 countries none said that the paper had any influence.'"}, "time": 1742562523.2219818}