{"duration": 0.04749250411987305, "input_args": {"text": "'The Bundy Verdict is Another Defeat for Obama October 28, 2016 Daniel Greenfield \\nObama Inc. has a lot more luck with the media than it does with trials. Its lynchings of police officers have not gotten very far. Baltimore was the biggest and most resounding defeat. But it wasn\\'t the only one. And the vastly differing treatment of the Bundy protesters and the Dakota pipeline protesters, from killing to government backing, have not had their intended effect. \\nInstead Obama lost at trial. Again. \\nThis time it\\'s the Bundy case. That was when the left realized it hated civil disobedience, just before rediscovering it again when it came to environmental protests. But big gov lost this one . Again. \\nA jury Thursday delivered a stunning across-the-board acquittal to the leaders and participants in the Malheur National Wildlife Refuge occupation and a remarkable blow to the federal government as it tries to tamp down a national movement led by a Nevada family to open public lands to ranchers, miners and loggers. \\nThe verdicts finding Ammon Bundy, older brother Ryan Bundy and five others not guilty of a federal conspiracy drew elation from defense attorneys who spent five weeks arguing that the armed takeover amounted to a time-honored tradition of First Amendment protest and civil disobedience. \\nThe high-profile case riveted the state and drew national and international attention to the isolated bird sanctuary in rural eastern Oregon. The jury\\'s decision proved no less dramatic and sets up a showdown in the next stage of the land-rights movement. \\nIt means that Big Green Gov will have to think twice next time around. Or do a much better job of picking a jury. \\nThe Oregon prosecutors sat silently in front of their boss, U.S Attorney Billy Williams, and the head of the FBI in Oregon, Greg Bretzing, as the judge announced the \"not guilty\\'\\' pleas one by one. \\nBut it was quickly back to more of the same. \\nut the trial fireworks weren\\'t quite over. A brawl broke out at the very end, when six to seven U.S. marshals surrounded Ammon Bundy\\'s lawyer as he stood before the judge, arguing and shouting for his client to walk out the door a free man. They tackled him and stunned him with a Taser gun. As Mumford yelled, \"What are you doing?,\\'\\' U.S. District Judge Anna J. Brown ordered, \"Everybody out of the courtroom!\\'\\' \\n\"All I was asking for was papers,\\'\\' Mumford said after emerging from federal custody nearly two hours later. \"Just show me you have the authority to take Mr. Bundy into custody.\\'\\''"}, "time": 1742563750.3977659}