{"duration": 0.09161925315856934, "input_args": {"text": "'Trump Catches What Sick Reporter Snuck In Interview, Has Priceless Response Posted on October 27, 2016 by Amanda Shea in Politics Share This CNN’s Dana Bash (left), Bash Interviewing Donald Trump (right) \\nDonald Trump stopped campaigning for just an hour-and-half to work in a brief appearance at the opening of his new hotel, whereÂ reporters awaited his arrival â\\x80\\x94 one of which had a nasty surprise hidden up her sleeve. When the Republican candidate caught it mid-interview on live television, he had a priceless response that the CNN crank won’t soon forget. \\nLiberal news host Dana Bash is evidently no fan of Donald Trump, which she’s not afraid to show in her biased reporting. Her arrogance backfired when she was in front of him at the grand opening of his hotel, thinking she could get away with a public attempt to insult him, but she got rightfully put in her place by the blunt candidate. \\nTrump’s schedule is jam packed with as many campaign stops as he can cram into these final weeks of the election, taking advantage of every waking moment to earn Americans’ votes. Somehow in the middle of his traveling to every corner of the country, he managed to squeeze in a stop at his hotel’s grand opening where he created countless jobs and a structure he should be proud of. However, Bash didn’t see it this way in her attempt to slam him for this 90-minute “time off” he was taking from campaigning. \\nDuring her live interview at the opening, the nasty CNN reporter had the audacity to sneak in this question: “For people who say youâ\\x80\\x99re taking time out of swing states to go do this, you say?” She painted this pit stop as an irresponsible thing to do while Hillary Clinton is working hard. Trump shuts down Dana Bash after questioning him for \"taking time off\" to attend his hotel\\'s grand opening. đ\\x9f\\x98\\x81 pic.twitter.com/LtLAu1jkbQ \\n— Deplorable AJ (@asamjulian) October 26, 2016 \\nTrump wasn’t going to allow her to get away with asking such a disgusting thing, given the vast difference in effort between him and his opponent and didn’t mince a single word in his priceless answer. \\n“I say the following. You have been covering me for the last, long time. I did yesterday 8 stops and 3 major speeches. And Iâ\\x80\\x99ve been doing this for weeks straight. I left for here for an hour-and-a-half. Iâ\\x80\\x99m leaving here and going to North Carolina, then Iâ\\x80\\x99m going to Florida, then Iâ\\x80\\x99m going up to New Hampshire. For you to ask me that question is actually very insulting because Hillary Clinton does one stop and then goes home and sleeps. And yet you ask me that question. I think itâ\\x80\\x99s a very rude question .” \\nBash didn’t see that coming, and Trump proved once again why America needs an unapologetic leader like him. He tells it how it is and backs up what he says with real action, unlike his competition who puts in a couple of days of campaigning and calls it good since it’s all for show anyway. \\nTrump is putting in ten times the effort with genuine work ethic on his own dime to honestly earn the votes, and if he wants to take a couple of minutes to make an appearance at an opening, he’s more than entitled to do it. It pales in comparison to the weeks Hillary has had off relaxing and recovering. Trump’s creating jobs as he’s campaigning, but Hillary’s just napping.'"}, "time": 1742561634.216675}