{"duration": 0.16381525993347168, "input_args": {"text": "'New Reports Link Russia With Donald Trump’s Campaign Posted on Nov 1, 2016 Donald Trump at a rally in Nevada. ( Gage Skidmore / CC 2.0 ) \\nA trove of new allegations has surfaced suggesting a relationship between Russia and the Donald Trump campaign. \\nIn this unprecedented election season, the Republican presidential nominee has been accused repeatedly of fostering a friendly relationship with forces within the Russian government, and an adviser to his Democratic rival, Hillary Clinton, recently suggested that Russia has participated in illicit cyberattacks to further Trump’s campaign. \\nOn Monday, Slate added fuel to the controversy by publishing an investigative piece in which journalist Franklin Foer alleged that a Trump computer server was communicating with an elite Russian bank. Foer wrote: \\nThe computer scientists posited a logical hypothesis, which they set out to rigorously test: If the Russians were worming their way into the DNC, they might very well be attacking other entities central to the presidential campaign, including Donald Trump’s many servers. … \\nThe researchers quickly dismissed their initial fear that the logs represented a malware attack. The communication wasn’t the work of bots. The irregular pattern of server lookups actually resembled the pattern of human conversation—conversations that began during office hours in New York and continued during office hours in Moscow. It dawned on the researchers that this wasn’t an attack, but a sustained relationship between a server registered to the Trump Organization and two servers registered to an entity called Alfa Bank. … \\nTea Leaves [a pseudonym for one of the researchers] and his colleagues plotted the data from the logs on a timeline. What it illustrated was suggestive: The conversation between the Trump and Alfa servers appeared to follow the contours of political happenings in the United States. \\nAnother article, written by David Corn at Mother Jones on the same day, alleged that a former intelligence officer provided the FBI with information on a Russian scheme to help Trump win the presidency. \\n“There’s no way to tell whether the FBI has confirmed or debunked any of the allegations contained in the former spy’s memos,” Corn wrote. “But a Russian intelligence attempt to co-opt or cultivate a presidential candidate would mark an even more serious operation than the hacking.” \\nIs there any way to substantiate these claims? Vox’s Zack Beauchamp argued that while the “stories are overblown,” Russian interference in the current U.S. election is a serious problem. Beauchamp explained: \\nThe problem with these stories isn’t just that they’re speculative. It’s that they obscure and even discredit the more sober evidence about Trump’s troubling attitude toward the Russian state. \\nThere is basically conclusive evidence that Russia is interfering in the US election, and that this interference has been designed to damage Hillary Clinton’s campaign. There is strong evidence linking Trump’s foreign policy advisers to Russia, and Trump’s stated policy ideas are extremely favorable to Russian interests. \\nBeauchamp listed various “confluence[s] of interest” between the Kremlin and Trump, pointing to WikiLeaks’ release of Democratic campaign emails, Trump’s pro-Russia pronouncements and economic ties to Russian interests. \\nAnd NBC reported Tuesday that the FBI has launched a “preliminary investigation” into former Trump campaign manager Paul Manafort’s possible “foreign ties” with Russia and Ukraine. The FBI has not commented and Manafort told NBC that “none of it is true.” \\nVox’s Matthew Yglesias also cautioned against getting too excited about the new influx of allegations, writing that “Trump’s policy views on matters related to Russia are a lot clearer than any of these cloak-and-dagger allegations.” \\nEric Lichtblau and Steven Lee Myers of The New York Times asserted, in an article published Monday, that the FBI has not “found any conclusive or direct link between Mr. Trump and the Russian government.” \\n“Intelligence officials have said in interviews over the last six weeks that apparent connections between some of Mr. Trump’s aides and Moscow originally compelled them to open a broad investigation ... ,” Lichtblau and Lee Meyers wrote. “[N]o evidence has emerged that would link him or anyone else in his business or political circle directly to Russia’s election operations.” \\nThe renewed focus on the Trump campaign’s relationship with Russia comes as Clinton is again making headlines for her potential misuse of a private email server. On Friday, FBI Director James Comey revealed that another round of emails related to the Clinton campaign is under review. \\nWhile the FBI investigation has not been formally reopened, many Clinton supporters are outraged at Comey’s timing, suggesting that his announcement so close to the election violated the Hatch Act . \\nWith only a week until Election Day, it is unlikely that the accusations on either side will be proven or refuted before voters head to the polls.'"}, "time": 1742562485.225007}