{"duration": 0.0832369327545166, "input_args": {"text": "'A few years ago, Richard Kahn, the   chief scientific and medical officer of the American Diabetes Association, was charged with organizing a committee to prescribe a diet plan for people with diabetes. He began by looking at the evidence for different diets, asking which, if any, best controlled diabetes. “When you look at the literature, whoa is it weak. It is so weak,” Dr. Kahn said in a recent interview. Studies tended to be short term, diets unsustainable, differences among them clinically insignificant. The only thing that really seemed to help people with diabetes was weight loss  —   and for weight loss, there is no magic diet. But people want diet advice, Dr. Kahn reasoned, and the association really should say something about diets. So it, like the National Institutes of Health, went with the Department of Agriculture’s food pyramid. Why? “It’s a diet for all America,” Dr. Kahn said. “It has lots of fruits and vegetables and a reasonable amount of fat. ” That advice, though, recently came under attack in a New York Times commentary written by Sarah Hallberg, an osteopath at a weight loss clinic in Indiana, and Osama Hamdy, the medical director of the obesity weight loss program at the Joslin Diabetes Center at Harvard Medical School. There is a diet that helps with diabetes, the two doctors said: one that restricts  —   or, according to Dr. Hallberg, severely restricts  —   carbohydrates. “If the goal is to get patients off their medications, including insulin, and resolve rather than just control their diabetes, significant carb restriction is by far the best nutrition plan,” Dr. Hallberg said in an email. “This would include elimination of grains, potatoes and sugars and all processed foods. There is a significant and ever growing body of literature that supports this method. ” She is in private practice at Indiana University Health Arnett Hospital and is medical director of a   developing   medical interventions. But there are no large and rigorous studies showing that   diets offer an advantage, and, in fact, there is not even a consensus on the definition of a   diet  —   it can vary from doctor to doctor. “There have been debates for literally the whole history of diabetes about which kind of diet is best,” said Dr. C. Ronald Kahn, chief academic officer at Joslin, and no relation to Dr. Richard Kahn. But, he said, “the answer isn’t so straightforward. ” In support of a diet like Dr. Hallberg’s, there is one recent   study, by Kevin Hall of the National Institute of Diabetes and Digestive and Kidney Diseases and his colleagues, involving 17 overweight and obese men, none of whom had diabetes. They stayed in a clinical center where they ate carefully controlled diets. The researchers asked what would happen if calories were kept constant but the carbohydrate composition of a diet varied from high to very low. The answer was that insulin secretion dropped 50 percent with the very low carbohydrate diet, meaning that much less insulin was required to maintain normal blood glucose levels. “Since diabetes results when the body can’t produce enough insulin, perhaps it is a good idea to reduce the amount of insulin it needs by eating    diets,” Dr. Hall said. Some   studies, though, failed to show that   diets benefited glucose control. Even if diets are effective in the short term, Dr. Hall said, “the difficulty is adhering to the diet over the long term. ” In an analysis of weight loss diets (not specifically for diabetics) published this summer, he and Yoni Freedhoff of the University of Ottawa wrote: “Diet adherence is so challenging that it is poor even in   studies where all food is provided. When diets are prescribed, adherence is likely to diminish over the long term despite   to the contrary. ” But   studies of just a few weeks, which constitute the bulk of the diet studies, can be misleading, said Dr. C. Ronald Kahn. “In the short term, the   diet sometimes does better on glycemic control,” he said. “But as time progresses, the difference mostly disappears. What counts is which diet helps most with   weight loss. ” The reason the advantage sometimes seen with a   diet tends to vanish, Dr. C. Ronald Kahn added, is probably a mix of people failing to adhere to the diets and their bodies’ adjusting to them. Another issue with   diets, researchers said, is the question of what will happen to overall health if diabetics actually follow the diet for years or decades. (Heart attacks are the major killer of people with diabetes.) Insulin levels may be better, but, said Dr. Rudolph Leibel, a director of Columbia University’s Naomi Berrie Diabetes Center, “effects of a   diet on lipoproteins and vascular biology could offset such a ‘benefit. ’” In other words, it is not clear if a lower insulin level would translate into fewer heart attacks. Dr. Hamdy, whose recommended   diet is less restrictive than the one Dr. Hallberg suggests, reports that many patients in his clinic have been able to stay with the diet for as long as five years, losing weight and keeping it off. He presented his study at the 2015 annual conference of the American Diabetes Association and has submitted it for publication. It involved 129 patients. Half were able to lose weight and keep it off, and those who did maintained an average weight loss of 9. 5 percent. Their diabetes was much improved. It is impossible, Dr. Hamdy said, to separate weight loss from the diet’s effects on diabetes because people following such a diet  —   which limits but does not forbid things like breads, pasta and rice  —   also lose weight. But multiple studies have found that when it comes to weight loss  —   the only proven way to help with blood sugar control over the long term  —   there is no difference among diets that restrict calories, fat or carbohydrates. Experts like Dr. David Nathan, the director of the diabetes center and clinical research center at Massachusetts General Hospital and a professor of medicine at Harvard Medical School, advise dieting for people with diabetes. But, he said, “when we advise people to be on diets, the major goal is to lose weight. ” What matters the most for controlling diabetes, Dr. Nathan said, “is how much weight you lose. ”'"}, "time": 1742628353.0464633}