{"duration": 0.34547972679138184, "input_args": {"text": "'As was predicted by opponents from the start, ObamaCare has begun to implode, owing to high costs brought on by government planners. Questions remain: Why, and what next? \\n\\nOn Monday, October 3, former President Bill Clinton, in a series of unexpected and perhaps unscripted comments while stumping on behalf of his wife’s presidential campaign in Flint, Michigan, took the political world by surprise when he singled out Obama\\xadCare for scathing criticism. “You’ve got this crazy system where all of a sudden, 25 million more people have health care, and then the people who are out there busting it, sometimes 60 hours a week, wind up with their premiums doubled and their coverage cut in half and it’s the craziest thing in the world,” Clinton told a crowd of supporters. \\nHe added that “the current system works fine if you’re eligible for Medicaid, if you’re a lower-income working person, if you’re already on Medicare or if you get enough subsidies on a modest income that you can afford your health care.” \\nBut overall, Clinton concluded, Obama\\xadCare is hurting the very people it was intended to help, pointing out that “the people getting killed in this deal are the small-business people and individuals who make just a little bit too much to get any of these subsidies.” \\nDuring Bill Clinton’s own presidency a generation ago, Hillary Clinton was put in charge of creating a system of socialized medicine (so-called Hillarycare), an effort that met with political failure. The Clintons have long been ardent public supporters of socialized medicine (and socialism in general). What would prompt Bill Clinton to attack ObamaCare during a heated presidential campaign? Have the failings of Obama’s disastrous experiment in socialized medicine become so obvious that even Democrats now want to distance themselves from it? \\nIn a word, yes. Since its full phase-in earlier in 2016, the Affordable Care Act has — as its many detractors have been predicting for years — inflicted critical damage on an already creaky healthcare system and ruined healthcare coverage for tens of millions of Americans. As Clinton noted correctly, the middle class, students, and small-business owners and their employees have borne the brunt of the damage, although no one but the few who can afford to pay out of pocket for healthcare have been unaffected by ObamaCare. Premiums have skyrocketed alongside deductibles and copays, while President Obama’s most quotable promise — that Americans who liked their pre-Obama\\xadCare health coverage could keep it — has been discarded, as millions promptly lost their coverage or endured deep cuts in benefits and soaring costs with their existing coverage. In a word, ObamaCare has been a scourge on the already troubled American economy, a monumental political and economic mistake that has been a major contributor to our continuing economic malaise, more than eight years after the onset of the Great Recession. \\nSticker Shock \\nOne of the concerns that ObamaCare was supposed to address was rising healthcare premiums, which had outpaced wage increases for years. During the five-year period from 2004 to 2009, for example, healthcare premiums rose an average of 30 percent, while wages increased by only 12.2 percent. Figures such as these buoyed President Obama and other supporters of socialized medicine, and were a crucial factor leading to the passage of ObamaCare in 2010. Yet in the first year after ObamaCare’s enactment, premium costs soared by an additional 9.4 percent, and by 2014, the increase over five years was a whopping additional 28 percent, while wages only grew by 7.8 percent during that same period. While some of the depressed wages were (and are) certainly attributable to the Great Recession and its seemingly never-ending aftermath, it has become embarrassingly clear that Obama\\xadCare has done nothing to halt the rise in healthcare premium costs. \\nWith open enrollment in ObamaCare slated to begin in November, another, politically far more damaging consequence has dominated the news in recent days: the soaring cost of ObamaCare premiums in many states. During the last week in October, the election season was roiled by news that the price of ObamaCare premiums will rise on average 25 percent in 2017, with many areas experiencing significantly greater price hikes. Arizona, which will be among the hardest-hit states, will experience a whopping 116 percent increase in its second-cheapest “silver plan,” for which a hypothetical 27-year-old paying $196 per month in 2016 will be paying $422 in 2017. The Obama administration has tried to downplay this latest round of healthcare sticker shock, with glib assurances that eight out of 10 ObamaCare beneficiaries will qualify for subsidies under the terms of the now-ironically named Affordable Care Act. Aviva Aron-Dine of the Department of Health and Human Services (HHS) rushed to assure ObamaCare customers that the government will cover the difference for most of them: Issuers were pricing for a completely new market, one where they could no longer exclude those with the most serious health needs; many set prices that turned out to be too low.... Not only do tax credits bring down the cost of coverage, they adjust dollar for dollar with the cost of the benchmark plan in your area. So even if the cost of benchmark coverage goes up, most consumers will not have to pay more. \\nIn other words, the market got pricing wrong at the outset, but now the government, in its omniscience, will fix everything. HHS has indicated that our hypothetical young Arizonan in a silver plan will qualify for government subsidies of about $280 per month — if his annual income is $25,000 or so. If he makes more than $30,000, the subsidy will be much less. Left unsaid in all the posturing and spin is how the government is going to pay for all the new healthcare subsidies that the disastrous rise in premium costs has made necessary. The answer, of course, will ultimately be higher taxes, fees, and public debt, coupled with further contractions of benefits. \\nAnother development unanticipated by the Obama administration has been the veritable stampede of healthcare providers and insurers out of ObamaCare. As early as 2013, insurance company Aetna announced that it was opting out of ObamaCare in a number of states, including Connecticut (where the corporation is headquartered), California, Georgia, and Maryland. Other major insurers, such as Blue Cross and United Health Group, have also pulled out of healthcare exchanges in California and elsewhere as the health insurance market continues to contract under centralized control. Meanwhile, many of the nation’s top hospitals and clinics are either opting out of ObamaCare or being very selective in the policies for which they will accept coverage. With the beginning of open enrollment in November, many markets, such as Philadelphia, will be left with only one or two insurance providers participating in ObamaCare, leaving consumers little or no choice. On average, the number of options available to customers will decline by about a third, with competition declining in all but four states that participate in Healthcare.gov’s exchange. Hard-beset Arizona is a fairly typical example of the dizzying decline of healthcare options: In the Grand Canyon State, the number of options available will fall from 65 in 2016 to just four in 2017. Overall, about 21 percent of customers seeking healthcare plans at Healthcare.gov will encounter only one option in 2017 — up from two percent in 2016. \\nMeanwhile, health insurance plans nationwide are plagued by ballooning deductibles — the amount the insured must pay out of pocket for healthcare before insurance benefits kick in. Once a nominal amount, the post-ObamaCare deductible has rapidly morphed into a severe financial threat in and of itself. The average deductible for a typical “Bronze” plan under ObamaCare is now $5,629, while the average deductible for a “Silver” plan is $2,994. The lowest deductibles belong to the “Gold” plans, which average only $1,105 — but feature premiums too expensive for most Americans to pay. As Nathan Nascimento recently pointed out in the National Review : Paying $3,000 or $5,600 before their insurance kicks in simply isn’t an option for most families in times of emergency. A December 2015 survey by Bankrate.com found that 63 percent of Americans don’t have enough savings to cover an unexpected emergency-room visit costing $1,000. A recent report from the New York Times put it bluntly: Rising out-of-pocket costs have rendered many exchange plans “all but useless” for those already struggling to make ends meet. \\nAnd participation in America’s Brave New World of healthcare isn’t optional; Obama\\xadCare also levies hefty tax penalties on Americans without health insurance, and has anointed the IRS its collection and enforcement arm. The federal government has — so far — been tentative in enforcing the tax penalties for the uninsured. As Joseph Thorndike, a tax policy analyst, told the New York Times , “It is highly unusual for the federal government to use tax penalties to encourage affirmative behavior. That’s a hard sell.” Even so, tax penalties assessed by the IRS have been rising steadily, in an attempt to browbeat Americans into the system. Many Americans, however, have done the math and prefer, even four years into the ObamaCare abyss, to pay the annual penalty. One Atlanta business consultant in his early fifties told the Times that he was seriously considering dropping his ObamaCare premium, which is costing him $1,400 a month this year to cover his family of four. Next year, his premiums will go up by 60 percent, whereas the IRS penalty will only amount to two months’ worth of premiums. And his story is far from unique. Millions of Americans are prepared to take the risk of a major medical setback and pay a tax penalty of hundreds or even thousands of dollars rather than be saddled with enormously expensive monthly premiums that pay for policies with deductibles so high that only a catastrophic event would be covered at all. Some consumers who buy insurance on the exchanges still feel vulnerable. “Deductibles are so high,” observes the Times , “that the insurance seems useless. So some think that whether they send hundreds of dollars to the I.R.S. or thousands to an insurance company, they are essentially paying something for nothing.” \\nFor ObamaCare to even appear to work, it must be able to attract large numbers of healthy, young, low-risk subscribers — yet that is the opposite of what has taken place so far. A large percentage of Obama\\xadCare subscribers are older and/or in poor health, precisely the customer base that would be most attracted to policies that, though expensive, are still preferable to the alternative of paying tens or hundreds of thousands annually for chronic illnesses and long-term disabilities. \\nFor those already insured via employer-based plans, rising premiums and deductibles alongside contracting benefits have become a fact of life. Healthcare providers and insurers, hard beset by ObamaCare’s many mandates, are trying to save money any way they can, which includes scaling back benefits for all payers. \\nIn a word, Americans now find themselves in a healthcare morass from which there appears to be no deliverance. If current projections are anywhere near the mark, Americans will soon be paying as much or more for government-run healthcare plans than they would have paid by choice before ObamaCare — except with the inefficiencies inherent to any government-run enterprise added on. Moreover, there is every indication that, sooner rather than later, in large swaths of America no insurance provider will participate in ObamaCare at all. \\nPrivate to Public \\nIt wasn’t supposed to turn out this way. In reassuring voters of the need for his reforms, President Obama famously promised tens of millions of Americans already satisfied with their healthcare coverage that they would be able to keep their plans if they liked them. We were also assured by a mob of Democrats and their media mouthpieces that ObamaCare could be done cheaply and efficiently, and that it would solve chronic problems with portability, rising costs, and lack of access to quality healthcare for millions of Americans. \\nYet not everybody was convinced. All the way back in 1993, when Bill Clinton was attempting to pass sweeping healthcare reforms, humorist P. J. O’Rourke famously quipped to a gathering at the Cato Institute: “If you think health care is expensive now, wait until you see what it costs when it’s free.” As events turned out then, Hillary Clinton and her team of high-paid experts were unable to ram socialized medicine down America’s collective throat. But President Obama was able to enact the long-standing goal of government-run healthcare, and the results have been precisely what O’Rourke and many others on the Right had warned us to expect. Perhaps the only surprise has been the speed of the implosion, but few sober observers doubt that ObamaCare is in a death spiral, courtesy of the implacable laws of economics. \\nThe federal government’s meddling in the healthcare system began during the Second World War, an indirect consequence of wage controls imposed by the federal government. Companies were unable to offer competitive wages thanks to FDR’s wartime socialist measures, but when the War Labor Board exempted fringe benefits from the wage controls, companies began offering competitive healthcare insurance benefits instead. When the war ended, the wage controls were lifted, but the expectation of employer-provided healthcare remained. President Truman tried to pass a voluntary government healthcare program, but the politics of the day did not allow him to make any progress. Labor unions, which in general favored programs such as socialist medicine, opted instead to support measures requiring big companies to offer health benefits packages. By 1960, most large public and private employers offered health insurance, whose benefits typically extended to routine care. And not surprisingly, once average Americans were offered government and union-backed benefits packages that incentivized frequent trips to the doctor for checkups, minor colds and injuries, and a range of other elective procedures, prices began to rise with increasing demand. \\nThe ObamaCare crisis is but the latest installment in the slow-motion deterioration of the American healthcare system, a trend that began in the mid-’60s after the passage of Lyndon Johnson’s Social Security Amendments of 1965 (a major component of President Johnson’s “Great Society” initiative), which created Medicare and Medicaid. Medicare and Medicaid were the first major interventions in the healthcare sector by the federal government, and were the outcome of decades of pressure by the Left to emulate countries such as Great Britain in instituting socialized medicine. With the passage of these two massive new federal programs, healthcare costs began to rise precipitously, and have been rising ever since, with each new government healthcare “fix” introducing new distortions and disincentives into the healthcare markets. From 1960 to 2013, healthcare spending rose from $147 per person to $9,255 per person, with an average annual increase of 8.1 percent. Per capita income over the same period grew by an average of only 5.7 percent. More tellingly, during this same period there was a massive shift in responsibility for coverage of healthcare costs. In 1960, 77 percent of healthcare costs were covered by private sponsors such as households and businesses, with the other 23 percent covered by government (a surprisingly high percentage pre-Great Society, but these figures include all levels of government). By 2013, private sponsors covered only 57 percent, and government the remaining 43 percent. More specifically, the federal government’s share of healthcare spending rose from 11 percent to 26 percent. \\nThe figures tell an interesting story. Over the last 50 years, healthcare has morphed from a mostly private to a mostly government enterprise, in terms of where and how the money is being spent, and the history of healthcare legislation since 1965 is a litany of greater and greater federal government involvement in the healthcare sector. \\nIn 1973, Congress passed the Health Maintenance Organization Act, which mandated that companies with 25 or more employees offer federally certified HMO coverage. HMOs were envisaged as a way to streamline and contain already rising healthcare costs, by incentivizing preventive care and healthy lifestyle choices, among other things. But while they were billed as private organizations, their economics were always driven by the federal government, which from the beginning has exercised oversight of HMOs via the use of mandates requiring them to produce particular products. But healthcare costs continued to soar, averaging annual increases well above 10 percent throughout the ’70s. And the barrage of new federal regulations continued. \\nThe year 1986 saw the passage of the Emergency Medical Treatment and Active Labor Act, whereby the federal government forced hospitals that accept Medicare payments to treat any individual seeking medical treatment, regardless of citizenship status or ability to pay. However, the government does not reimburse hospitals for this service, leaving the Emergency Medical Treatment requirements an unfunded mandate that hospitals must pay for by increasing costs elsewhere. \\nIn 1996, Congress passed the massive Health Insurance Portability and Accountability Act (HIPAA), which protected health insurance for families and individuals who change jobs or become unemployed. By the late ’90s, such legislation was deemed necessary because healthcare costs had risen so high that one major medical procedure not covered by insurance — let alone treatment for chronic, pre-existing conditions that traditional insurance would not cover — would spell financial ruin for most. But those conditions — a healthcare sector in which those outside the system of employer-provided benefits risked a lifetime of debt for injuries sustained in a car accident, for example — were wholly a creation of government interference in the healthcare sector in the first place, by first incentivizing higher consumer demand than the free market once warranted, and then by systematically mandating a broader range of services, at lower cost, than healthcare providers could possibly provide without taxpayer subsidies or much higher prices for other services. \\nIn 2003, Congress passed the Medicare Prescription Drug, Improvement, and Modernization Act (shortened to MMA), the largest overhaul of Medicare since its inception. And MMA did not streamline Medicare or defund any part of its provisions. Instead, it massively expanded Medicare coverage to include prescription drugs — paid for, of course, by government subsidies. The cost of new prescription drugs had been shooting up, due mostly to more and more stringent FDA controls and government red tape hindering pharmaceutical R&D. But as it routinely does, government was only too happy to provide a solution (government-subsidized prescription drug coverage) for a government-created problem (exorbitant prices for newer prescription drugs). And the consequences have been predictable: Prescription drug prices continued to soar, driving Medicare costs to Icarian altitudes. \\nUndeterred, the federal government continued its campaign to solve healthcare costs by creative legislation. The Patient Safety and Quality Improvement Act followed in 2005, and the Health Information Technology for Economic and Clinical Health Act in 2009, before President Obama’s mammoth Patient Protection and Affordable Care Act (ObamaCare) ushered in a new era of truly socialized medicine in the United States in 2010. \\n“Single Payer” \\nBut even the Affordable Care Act is not what left-wing radicals have been seeking for almost a century. The real goal is an innocuously named “single payer” system — in essence, a system in which the government pays for everybody’s healthcare, such as healthcare systems in Canada, Great Britain, and many other wealthy countries. Such a system converts healthcare into a wholly public enterprise — and gives the state total authority over matters of life and death, including abortion and euthanasia. Fully socialized medicine has always been near the top of every socialist’s wish list, because it gives the state full control over the health of its citizens. \\nIt has been suggested, with some plausibility, that ObamaCare was a ruse, programmed to fail so that Americans would more readily accept single-payer healthcare as a solution. Whether or not the spectacular failures of ObamaCare were anticipated by its creators, the Left is already touting a single-payer system as the solution. Robert Reich, ultra-liberal Harvard professor and secretary of labor under President Clinton, is strongly supportive of a single-payer system. In an August article entitled “Why a Single-Payer Health Care System Is Inevitable,” Reich caricatured the insurance industry, insisting that “the problem isn’t Obamacare per se. It lies in the structure of the private markets for health insurance — which creates powerful incentives to avoid sick people and attract healthy ones.” This, of course, is the only rational way that the health insurance industry can work. Insurance companies, like all businesses, need to turn a profit, which means attracting more people who will pay more into the insurance pool than the sick and injured will withdraw from it. But then Reich, and liberals in general, are viscerally opposed to profit-taking (which they usually style “profiteering”). They have no moral qualms, on the other hand, with using the power of the state to extract ever more taxpayer money to fund Utopian projects such as single-payer healthcare systems that, over time, drain treasuries and degrade the quality of the healthcare they are supposed to improve. \\nObamaCare’s chief architect, MIT professor Jonathan Gruber, has argued at various times that, whether the Affordable Care Act succeeds or fails, a single-payer system is the final goal. In a candid discussion aired on CSPAN, Gruber indicated that if the ACA “doesn’t work, then we’ll have to revisit single payer. This bill is the last, best hope for private insurance.” But at a forum at Harvard University, Gruber disingenuously tried to explode the “fallacy” that “if Obamacare fails, then next we’ll go to single payer.” Instead, he suggested, the eventuality of a single-payer system depends on the success of Obama\\xadCare, stating emphatically that “if you like single payer, then Obamacare has to succeed.” In other words, heads we win, tails you lose; no matter what happens with ObamaCare, America will have a single-payer system. \\nOne big surprise for the promoters of a single-payer system has been the speed with which ObamaCare has unraveled. Another surprise has been the election of GOP presidential candidate Donald Trump, who has promised to repeal ObamaCare, and the defeat of Hillary Clinton, who was expected to continue and build upon ObamaCare. Instead of having a decade or so to plan a smooth transition into fully centralized government-run healthcare, President Obama and his liberal backers in Washington not only face ferocious opposition to ObamaCare, but the Republicans — having retained majority control of both houses of Congress as well as capturing the White House — are now well positioned to scuttle ObamaCare, if that is what they truly intend to do. \\nBut will Trump as well as congressional Republicans who promised to get rid of ObamaCare actually do so? And will they work to replace it with free-market healthcare as opposed to a GOP variant of socialized medicine — ObamaCare-lite, perhaps? Of course, there is no doubt that proponents of single-payer healthcare are not going to give up, even if they are forced to take a temporary step back before advancing their agenda once again. They want full-blown socialized medicine in the United States, and they will eventually get it, unless principled opposition, coupled with a fuller understanding among the voting public of the folly of socialized medicine under any label , forces them into a complete rout. \\n\\n(A version of this article, written prior to the November 8 elections, appeared in the print edition of The New American .) Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742564529.4950988}