{"duration": 0.09576940536499023, "input_args": {"text": "'Fox News correspondent Adam Housley reported Friday that a   and “very senior” former official in the intelligence community, not associated with the FBI, directed the unmasking of private Americans working for or with President Donald Trump’s presidential transition team. [“Unmasking is not unprecedented, but unmasking for political purposes   …     specifically of Trump transition team members   …     is highly suspect and questionable,” an intelligence source told Fox News. “Opposition by some in the intelligence agencies who were very connected to the Obama and Clinton teams was strong. After Trump was elected, they decided they were going to ruin his presidency by picking them off one by one. ” Housley said his sources inside the intelligence community reached out to him after mainstream media reports Thursday flagged two White House aides as the sources bringing information to Rep. Devin Nunes (R. ) the chairman of the House Permanent Select Committee on Intelligence.  Thursday’s mainstream media narrative was that Ezra   and Michael Ellis called Nunes to the White House grounds March 21, where they passed classified information to Nunes that confirmed Obama administration surveillance of the Trump camp. Then, March 22, Nunes went to the White House to present classified information to the president. This narrative and the Nunes    with the White House was ridiculed as an elaborate ruse or proof that Nunes was acting in a bizarre way. The Housley report is that Thursday’s narrative was not true —  and that   and Ellis were not sources at all rather the two men came to the aid of Nunes, who had other sources but needed to use a Sensitive Compartmented Intelligence Facility (SCIF) that was not associated with the whistleblowers’ own agency. The sources told Fox News that surveillance of the Trump campaign began before Trump became the Republican presidential nominee July 19, and the surveillance had nothing to do with Russia, Housley said. Intelligence agencies are banned from collecting intelligence on Americans without permission from a judge, but in the course of authorized surveillance Americans are caught in the net. These names are supposed to be masked or disguised, so that their rights are preserved. What Fox News is reporting is that these names were either put in the clear or given flimsy masks, so that their identity was obvious. The sources also told Housley that Nunes learned about the surveillance and the unmasking in January, before Trump entered the White House, but members of the intelligence community have been uncooperative as the chairman searched for a SCIF, where he could conduct his own deep dive into their portent. Finally, he was able to secure use of the White House SCIF inside the Old Executive Office Building, on the White House grounds, but not in the “White House. ” Fox News investigative reporter Malia Zimmerman also worked on this report.'"}, "time": 1742564196.4195118}