{"duration": 0.03755688667297363, "input_args": {"text": "'A fake news article led to gunfire at a Washington pizzeria three weeks ago. Now it seems that another fake news story has prompted the defense minister of Pakistan to threaten to go nuclear. The defense minister, Khawaja Muhammad Asif, wrote a   Twitter post directed at Israel on Friday after a false report  —   which the minister apparently believed  —   that Israel had threatened Pakistan with nuclear weapons. Both countries have nuclear arsenals. “Israeli def min threatens nuclear retaliation presuming pak role in Syria against Daesh,” the minister wrote on his official Twitter account, using an Arabic acronym for the Islamic State. “Israel forgets Pakistan is a Nuclear state too. ” Mr. Asif appeared to be reacting to a fake news article published on awdnews. com. That story, with the   headline “Israeli Defense Minister: If Pakistan send ground troops to Syria on any pretext, we will destroy this country with a nuclear attack,” appeared on the website on Dec. 20, alongside articles with headlines like “Clinton is staging a military coup against Trump. ” The fake story about Israel even misidentified the country’s defense minister, attributing quotations to a former minister, Moshe Yaalon. Israel’s current minister of defense is Avigdor Lieberman. The Israeli Defense Ministry responded on Twitter to say the report was fictitious. “The statement attributed to fmr Def Min Yaalon re Pakistan was never said,” the ministry wrote in Twitter post directed at Mr. Asif. The Israeli ministry added in a second post: ”Reports referred to by the Pakistani Def Min are entirely false. ” Mr. Asif did not respond to the Israelis on Twitter, and as of Saturday his message had been reposted nearly 400 times. Many of the people reacting to Mr. Asif on Twitter mocked him for his mistake. The proliferation of fake news stories  —   spread on social networks and produced by a variety of sources including pranksters, foreign governments and enterprising individuals who hope to receive advertising revenue by driving traffic to their websites  —   has become an increasingly serious problem. A North Carolina man was arrested on Dec. 4 after firing a gun at a Washington pizza parlor, because investigators said he was investigating claims in fake news articles that the pizzeria was at the center of a child sex slave ring linked to Hillary Clinton.'"}, "time": 1742564426.2815394}