{"duration": 0.0553135871887207, "input_args": {"text": "'November 21, 2016 - Fort Russ News -  RIANovosti - translated by J. Arnoldski -  \\n\\n\\nIn response to the deployment of American missile defense systems in Europe, Russia is being forced to strengthen its aerospace defenses on its western borders, Viktor Ozerov, the chairman of the Federation Council’s Committee on Defense and Security, told RIA Novosti. \\n“As a responsive measure against such a type of threat, we will be compelled to strengthen our aerospace defense system in the western direction and put into operation additional forces and means for resolving the covering of relevant facilities and control points. This strengthening of forces will include the deployment of S-400 and Iskander complexes in Kaliningrad, as well as the creation of new formations in the Western and Southern Military Districts,” the senator said. \\nOzerov remarked that one of the arguments which Russia has put forward in relation to the deployment of American missile systems in Europe is the fear that this infrastructure could be promptly converted to accommodate strike weapons, particularly land-based cruise missiles. \\n“These fears are being confirmed today,” Ozerov stated. \\nAccording to the senator, along with motorized infantry and tank units, the divisions being created in the Western and Southern Military Districts will include troops and anti-air defense means. “In addition, we are not hiding this, we are improving our aerospace forces and developing new, modern missiles of both the “land-air” and “air-land” classes which would be capable of overwhelming the air defenses that the US has in Europe,” Ozerov explained. \\nSenator Ozerov added that the additional deployment of arms capable of neutralizing the US missile defense threat is a symmetrical response. According to him, Russia is constantly monitoring the situation and is “ready to respond.” \\nIn May of last year, the construction of the Aegis Ashore facility was completed which includes American missile systems in the vicinity of the Romanian town of Deveselu. Another such facility is to appear by 2018 in northern Poland. \\n\\nMoscow has repeatedly stated that the US and NATO’s actions in deploying anti-missile defense systems in Europe represent a threat to Russia’s national security and could undermine strategic stability in the region.  \\n\\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742563529.9339178}