{"duration": 0.16162347793579102, "input_args": {"text": "'LAS VEGAS  —   Steven J. Oshins, a Nevada lawyer who specializes in estate planning, has never met the wealthy software entrepreneur Dan Kloiber, but he is nonetheless intensely interested in Mr. Kloiber’s contentious divorce. “I have had a Google news alert on that for a couple years,” Mr. Oshins said as he discussed the case from his office in a squat pink complex about a   drive from the Las Vegas Strip. What animates Mr. Oshins is not the juicy marital feud, but the legal arcana governing a trust in Delaware where the Kloiber family parked assets worth hundreds of million of dollars, sheltered from estate taxes. Mr. Oshins, with a gleeful grin spreading across his face, relished the thought of the    Mrs. Kloiber busting through the trust and exposing a potential chink in  the formidable trust protection armor promised by Delaware  —   which just happens to fiercely compete with Nevada for the lucrative business of shielding assets owned by the superrich. Although most    visitors are drawn to the city’s roulette wheels and slot machines, Mr. Oshins and a battalion of tax lawyers, accountants, advisers, trust administrators and bankers cater to an elite clientele that insists on a much more reliable way to build a fortune. With their backing, Nevada has stoked an aggressive rivalry among a smattering of states to babysit the wealth of the nation’s top 1 percent, pressing public officials to pass laws, streamline regulations, lower fees and replace D. M. V.  service with concierge treatment. Yet even as more and more states seek ways to help the richest Americans protect their wealth from creditors, divorcing spouses and children, as well as some federal and state tax collectors, critics worry that the effort to attract the lucrative trust business is turning into a competitive game of giveaway. “There is no doubt that many, many jurisdictions are committed to being at the bottom,” said Edward McCaffrey, a professor at the University of Southern California Gould School of Law. “I think the real question now is: ‘Where is the bottom? ’” The federal government leaves it to each state to draw up its own trust laws, and several have tried to go as far as they can without inciting accusations that they are abetting tax evasion or hiding assets, he said. But in pushing the envelope, they can also run into challenges from courts in other states, including the Kloibers’ home of Kentucky, that have different statutes governing trusts. The clear leaders are Nevada, Delaware, South Dakota and Alaska, but other states have also joined the frenzy. New Hampshire, Wyoming, Tennessee and Ohio all hope to dip a spoon in the    pot of cream that had traditionally been preserved in offshore tax havens like the Cayman Islands. Over the last decade, for example, New Hampshire has passed nearly a dozen laws affecting trusts that expanded their life span, lowered taxes and made it easier to transfer assets. In 2013, the state created a special trust court subdivision to handle the complex litigation last year, an overhaul of state banking laws simplified regulations. Still, Nevada “is definitely the most aggressive in my experience in terms of asset protection,” Mr. McCaffrey said. Starting with the absence of any state income tax and resilient secrecy protections, Nevada has added a passel of laws and regulations intended to lure trust business. Individuals who establish   irrevocable trusts have more flexibility to transfer assets to a new trust with more favorable terms. Creditors are blocked from access to money held in trusts (making the arrangement also popular among doctors, who worry a malpractice case could bankrupt them). And what are known as dynasty trusts allow the wealthy to pass their fortunes from generation to generation for hundreds of years without paying estate taxes. Defenders of the industry won what was characterized as a “do or die” battle in 2013, fending off legislation that would have opened up Nevada trusts to future claims from spouses and domestic partners for property settlements, alimony or child support. And Nevada has only a narrow   window for creditors to make a claim against a trust’s assets. These sorts of loopholes have been criticized by some legal scholars as “not morally defensible,” but defenders dismissed the potential for abuse. “It’s against the law in this state to conceal assets from legitimate creditors,” said Mark A. Hutchison, Nevada’s Republican lieutenant governor, a lawyer himself. “We’ve got to be aware of phantom threats that could blow up our industry,” he added. Phantom threats, he said, include recent suspicions  —   after the leak of the Panama Papers  —   that citizens and foreigners are illegally hiding assets in the state. Private documents from the Panama law firm Mossack Fonseca revealed that the firm had incorporated more than a thousand shell companies in Nevada and Wyoming to hide the real owners’ identities. There are sometimes legitimate reasons individuals and businesses want to conceal their identities, but the papers suggested that evading taxes was often the purpose. Other documents tied the shell companies to corruption scandals in Brazil, Argentina and officials at FIFA, the soccer’s world governing body. If the revelations were a source of embarrassment, however, they were also a source of free worldwide publicity. “It’s actually helped us, believe it or not,” said Greg Crawford, president of the Alliance Trust Company in Reno, explaining that Nevada was not as well known internationally for its   policies as Delaware. “I’ve had more calls from people overseas, established families, who are interested in Nevada. ” Mr. Crawford disputed the idea that the state’s rules were abetting criminal activities. “The honest, ethical taxpaying people around the world who simply want privacy are happy to put assets in the United States,” he said. “Crooks know they can be confiscated, so it actually serves as a   process. ” Monitoring development in other states and bulking up asset protection laws, said Mr. Hutchison, the lieutenant governor, has dependable bipartisan support. “The trust business is a big business,” he added. “We’ve always viewed it as a way to stimulate the economy. ” Although trusts generate little public revenue or direct investment in the state, they do provide a steady stream of work for those in the industry. Supporters also say they generate indirect investment by drawing wealthy people who spend money and might invest later on. Robert H. Sitkoff, a Harvard Law School professor, said that in   states like Delaware, Nevada, South Dakota and Alaska, trust and estate lawyers “are an effective and important lobby in a way that would be much harder to replicate in a place like New York, a big state with lots going on. ” With the competition so intense, each state tries to exploit marginal advantages and highlight rivals’ weaknesses. The marketing pitch is not always about keeping up with the neighbors, however. Even as Nevada and Delaware blocked   with claims for child support, for example, New Hampshire decided not to follow suit. “We have reviewed that and said that’s not our policy,’” said William F. J. Ardinger, a lawyer at Rath, Young  Pignatelli who has lobbied for changes in New Hampshire’s trust laws. His state is making a different kind of appeal. “There’s a huge amount of wealth on the Eastern Seaboard, and New Hampshire fares well in the mind of those families,” Mr. Ardinger said. “They’ll say, ‘I went to prep school at Exeter,’ or, ‘I went to Camp Winaukee as a kid.’ “Reno is a beautiful place, but it’s not ‘On Golden Pond. ’” The Las Vegas lawyer Mr. Oshins, who almost makes the Kardashians look shy, is unfazed by such comparisons. “New Hampshire is a little bit of a wannabe,” he said. “They’re a   state. ”'"}, "time": 1742562860.7907524}