{"duration": 0.04890918731689453, "input_args": {"text": "'  DCG | 4 Comments \\nAnother Hollyweird Clinton supporter being trashy . Thank goodness this election is over soon. \\nFrom Daily Mail : She is no stranger to baring it all for her series Girls. But now Lena Dunham is stripping down to show support for her presidential hopeful. \\nThe 30-year-old comedienne released a rap video to help campaign for Hillary Clinton on comedy website Funny Or Die on Thursday. The three-minute clip was titled Sensual Pantsuit Anthem and featured Tony Award winning performer Cynthia Erivo and radio/television personality Charlamagne Tha God. \\nPerhaps the most eye-opening scene of the entire gag is when Lena decides to ditch her red pantsuit to reveal a matching two-piece bikini-like number. As she is ripping off her clothing she rhymes: ‘And now I’m going to take off my pantsuit to reveal a more sensual pantsuit cause that’s what you do for the candidate you love.’ \\nThe 36-year-old of Power 105.1’s The Breakfast Club replies: ‘Not sure I really understand the logic here. The rapping is trash and why are you wearing Hillary’s lingerie?’ Charlamagne presses her on the rationale behind the decision to rap and strip down and Lena hopes for some female solidarity as she says: ‘Dance with me Cynthia take your pantsuit off and show us your sensual pantsuit Cynthia.’ The 29-year-old actress and singer is not so keen as she sings: ‘No I’m good!’ \\nThis leaves Lena to question the entire video as she says: ‘I wonder if I’m actually hurting her chances of winning.’ The video concludes with Charlamagne reminding everyone to vote on Tuesday, November 8. \\nLena has been unafraid to show her allegiance to Hillary leading up to the election as she used her Halloween costume for a bit of political satire just a few days ago. \\nOn Monday, the Girls creator dressed up as a cat but had hands fastened to her body so that she was a ‘grabbed p***y’. \\nRead the rest of the story here . \\nDCG'"}, "time": 1742564607.3737698}