{"duration": 0.03762507438659668, "input_args": {"text": "'On Nov 1, 2016 2:13 PM, “Mimi Kennedy” wrote:\\nPlease circulate widely:\\nBev Harris of blackboxvoting.org finally put up Fraction Magic video. Appropriately, on Halloween. \\n98,000 views in less than 24 hours: https://youtu.be/Fob-AGgZn44 \\nDon’t be afraid. Watch. The capacity to commit fraud exists; stop arguing about who’s using it, get it out, and in the meantime for this election, pay attention to vote-counting any way you can. Find out if you have ballot images and make sure they’re preserved for public record. Many officials destroy them because they can’t be fixed to match digital vote-shifting.\\nAccounting software was built into Diebold’s original digital counting system (Global Election Management System, or GEMS.) It has since migrated to ES&S, Sequoia, and Dominion, tallying votes in their DREs and their optical scanners. To work with the accounting software and use it to apply desired percentages to outcomes you only have to\\n1) know it’s there\\n2) know how to use it\\n3) have access before or during an election\\n4) know how to cover your tracks\\nBennie Smith, the researcher who found the accounting program, was inspecting databases that Bev Harris had obtained in a court settlement some years back. (whole story at www.blackboxvoting.org)\\nHe found a few screens showing fractionalized election results and thought “this reeks.” He was familiar with accounting software, and found a menu feature that turned whole numbers into fractions and back again at the click of a key. You need this in accounting, where cents on the dollar require precise totals. But for one person one vote? \\nBennie, who can write code, went to work developing a little app that could attach to code Bev had found online, in the early 2000s, in a file named ROB GEORGIA (that story is on www.blackboxvoting.org and was part of the movie Hacking Democracy.) Bennie applied the app to an old race in one of the election database Bev had obtained in court. He changed the results of the race, using the fraction menu, then returned it to whole numbers. https://youtu.be/Fob-AGgZn44 shows it being done in real time. He says the app could be attached by someone who knew what they were doing, and it could run during a live election as results came in – IF you wanted to commit election fraud. \\nThe only evidence one might see, in such a case, would perhaps be an occasional shift downward (loss) of votes already obtained by some candidates, if the fraudster chose a percentage that “showed.” (That’s why “the latest polls” and “margin of error” and “gap is closing” and “momentum” are important considerations. ) Because the app might have to “steal” from one candidate to another to keep within the commanded percentage. \\nWow! Activists taking screen shots of live election results have seen exactly this – and it’s explained away as “ glitch”! Hm.\\nOk, so we know that hand-counted paper ballots, where there are opti-scan counts, are a necessity – either to a statistically-sufficient random audit or as fully redundant count. \\nWe also know that few paper ballot jurisdictions are set up with that infrastructure, in 2016, to do this. Some states have no audit laws. And what of DRE jurisdictions, with or without paper?\\nA SOLUTION HAS APPEARED IN THE COURT CASE JOHN BRAKEY JUST WON IN PIMA ARIZONA. \\nTurns out that many of our opt-scanners and DREs (even those without paper!) make ballot images of cast ballots – opt-scanners create the image as the ballots are scanned, touchscreen as the voted onscreen ballot is “Cast”. AND turns out that these images are nearly impossible, CURRENTLY, to make match a fraudulent digital count. Too many pixels!\\nAny count shifted by an intruding set percentage cannot currently simultaneously change the ballot images to match. \\nJohn Brakey found his Pima County officials destroying the ballot images and refusing to make them public record. Brakey got a court order from a judge that they must be preserved in November 2016 and made available for public inspection. \\nThe public could obtain a vote-count from these images even if officials refuse to hand-count. The ballot image vote count must match the”official” results or something has been manipulated in the “official” results. \\nBrakey found further suspicious activity around the ballot images. The ES&S optical scanner used in Pima County also has a printer that stamps, on the back of each paper ballot, a unique iD number that is also given to the ballot image. It cannot be traced to the voter. It only matches the paper ballot with its image, as a check and balance for transparent audit. \\nPima County officials did not use the printer. They removed its cartridge. Their paper ballots did not have ID numbers. So, impossible to match to the images, which they were destroying anyway. \\nThe ID printer was part of the sales package ES&S offered to jurisdictions to states like AZ that have audit laws. Disabling it was against the law. \\nThe judge ordered Pima County to enable the printer by using a damn cartridge and have it running for the November, 2016, election.\\nLet’s stand up and demand election integrity using the means at our disposal. We are not to be shamed for insisting that our votes be counted as cast. \\nThe post Very Easy to invisibly steal US elections appeared first on PaulCraigRoberts.org .'"}, "time": 1742628540.4536257}