{"duration": 0.043454647064208984, "input_args": {"text": "'By wmw_admin on November 2, 2016 henrymakow.com — Nov 1, 2016 Salman Hossein was forced to flee Canada in 2010 with police on his tail for antisemitic activities. From his exile in Dhaka, Bangladesh, he says Hillary will win and lead the US to world war. Masonic Jewish central bankers can’t allow Trump to win because he will turn on them. They are already losing world control and Trump would be the final nail in their coffin. CIA, Mossad, please phone. Salman Hossein is available for false flags, drug running, wet operations etc. by Salman Hossein — (henrymakow.com) After 9-11, there were eight regimes that had not submitted to the authority of the Jewish bankers. Four of them either got taken out or bullied/bribed/coerced into bowing down – Afghanistan, Iraq, Libya, and Sudan. The only problem is that recently China, Iran, North Korea, Russia, and Turkey have broken out of the sphere of control. Syria is still independent and fighting to maintain its sovereignty against Israeli expansionism and Banker domination. Putin recently put out an arrest warrant for George Soros for currency manipulation and has issued a decree banning the Rothschild clan from Russia. Russia is also causing problems for the Israelis and the West by defending the regime of Bashar Al Assad from Nusra and Da’esh/ISIS. Israeli expansionism has been kept in check by Russia. China has also more or less wrested free of control from the International Jewish oligarchy. As a pro-Israeli asset , Trump is not a threat to Israeli expansionism in Gaza and the West Bank. He has even opened up a campaign office in Israel. He is essentially aligning white gentile power with the Israeli-Jewish supremacist camp. He only cares about Israel and will facilitate even worse oppression of Arabs and Muslims not only in Palestine and the rest of the Greater Middle East but in the Western world as well. He consistently repeats the false “ Muslim terrorist “ narrative. He is even worse than George W. Bush Junior . As the alternative to the US Dollar, the new BRICS monetary system is also challenging Jewish control of international finance. The heavyweights in the BRICS alliance are Russia and China. There are those who claim that BRICS is also covertly run by the Jewish bankers. I don’t buy this. The Chinese are fully aware of the Jewish question . The Russians kicked out Jewish criminals . They won’t be able to penetrate the economy as well as they have done in the Western world. THE DILEMMA OF JEWISH SUPREMACISM'"}, "time": 1742562212.247055}