{"duration": 0.027631044387817383, "input_args": {"text": "'VIDEO : Trump Takes Michigan By STORM – Two YUGE Rallies in One Amazing Day! VIDEO : Trump Takes Michigan By STORM – Two YUGE Rallies in One Amazing Day! Videos By Amy Moreno November 1, 2016 \\nWOW! \\nDonald Trump took Michigan by storm today! \\nHe had a YUGE rally in Grand Rapids, where the crowd was literally SHAKING the rafters they were so pumped up! FEEL THE ENERGY IN MICHIGAN!? Get out & VOTE!! Time to #MAGA !! Lets go #TrumpTrain \\uf682\\uf4a8\\uf1fa\\uf1f8\\uf1fa\\uf1f8\\uf1fa\\uf1f8\\uf1fa\\uf1f8You ALL get out & VOTE – TRUMP WINS! pic.twitter.com/n5K9Ru3But \\n— Dan Scavino Jr. (@DanScavino) October 31, 2016 At the Trump rally today in Grand Rapids! Best mom ever for coming with me and for allowing me to go in the first place.\\uf44d\\uf3fc pic.twitter.com/To8WtGvPHR \\n— Joel Fritsma (@Joel_Fritsma) October 31, 2016 Looks like Hillary decided to show up to Trumps rally in Grand Rapids today. Even in uniform!!! #HillaryForPrison2016 pic.twitter.com/ZGxenmVQO2 \\n— Trump/Nugent ’16 (@TheBuckComander) October 31, 2016 HUGE turnout in Grand Rapids, Michigan. Vote Trump on November 8th! #MakeAmericaGreatAgain pic.twitter.com/9X3na5xkQU \\n— The Trump Train (@The_Trump_Train) October 31, 2016 From the Trump rally in Grand Rapids today. We ARE going to win this. Thanks @parrotgirl37 for sending this to me. #halloween #MAGA3X pic.twitter.com/r8RolZ0f16 \\n— Christian Hart (@RealChris_Hart) October 31, 2016 Donald Trump’s Grand Rapids, Michigan Rally: The Photos You Need to See https://t.co/w61dgq18QX pic.twitter.com/3OWDpmNrtp \\n— The Trump Today (@TheNewsDigital2) October 31, 2016 Trump crowd ahead of Grand Rapids, Michael rally. Usual playlist replaced by Halloween hits today. pic.twitter.com/Vn3e5N1wMS \\n— Jacob Rascon (@Jacobnbc) October 31, 2016 \\nAfter the Grand Rapids rally Trump made his way to Warren Michigan for a YUGE rally there! \\nThe crowd was chanting, “Lock Her Up!” and “Drain the Swamp!” \\nIt was amazing! \\n— Jared Wyand \\uf1fa\\uf1f8 (@JaredWyand) October 31, 2016 Sign in the crowd at Donald Trump’s rally in Warren, Michigan, says: “You’ve got mail.” pic.twitter.com/JJpUoRRsUU \\n— Jenna Johnson (@wpjenna) October 31, 2016 Second campaign stop of the day – Trump takes the stage in Warren, Michigan pic.twitter.com/h9aQLvGwIk \\n— Chris Snyder (@ChrisSnyderFox) October 31, 2016 Donald Trump campaigns in Warren, MI – LIVE online here: https://t.co/b3DoCYiszZ pic.twitter.com/psGpfZRK4w '"}, "time": 1742628546.5039167}