{"duration": 0.1493978500366211, "input_args": {"text": "'Prometheus Brings Fire To Man(image by Friedrich Fuger) License DMCA I have been \\'accused\\' by another contributor at OEN of advocating violent resistance against the US government. So I need to address this issue. In a comment on an anti-war article by David Swanson, I stated clearly that I am not a violent revolutionary because peace has to begin somewhere and the only place I have real control is with myself so I accept the principle that a peace and an anti-war position begins with me. But what does taking a serious peace-position mean? Many years ago, more than once, I protested and \\'marched\\' with Martin Luther King Jr. for peace and justice at home and abroad (Vietnam). I paid for this with threats on my life, a broken wrist, and a fractured occipital bone. A man I knew at the time told me that if I had cut my hair and stayed at home or just gone to a baseball game or some other proper American activity instead of walking the street and asking for trouble, I would never have suffered those threats and injuries. He said that I was the one who caused the violence. And in a way, he was right. When MLK decided to organize protests and marches, he was asking for trouble. And he knew it better than anyone. When he was talking and marching about racial equality and against war he was risking the possibility of injury or death, but when he moved to Chicago to live with the poor and began openly demanding changes in the economic system that risk possibility became a certainty. From that decision on there was a bullet with his name on it. Many people suffered threats, injury, and sometimes death because of MLK. He caused a great deal of violence because he was serious about radically changing the socio-economic system he lived in and knew the change would never come if he simply wrote letters to his congressman and restricted his activity to baseball games and other proper things. When Bobby Kennedy decided to begin dismantling the CIA, he was asking for big trouble. And he got it: Murder. Poor man should have just stuck to baseball games, flag waving, and ineffective idealistic speeches. Or he and King should have just dropped out of public view and retreated into an Eastern monastery, anonymously meditated for the rest of their lives, and let karma take care of everything. Because taking a serious position in the world (outside a monastery) is just asking for trouble, as in VIOLENCE. - Advertisement - When I was a teenager there was a huge popular wave of anti-Christian and pro-Hindu sentiment among mostly white young people in the US. India was endlessly referred to as the true Holy Land in which rose the true Holy Men. All Western \\'saints\\' were just shallow pretenders. I was always troubled and alienated by this partly because I had some knowledge of the history of India and was quite aware of its age-long atrocious poverty and class-discrimination reality. I was amazed at the fact that hip kids in the US would rant about poverty and injustice and class distinction in the US and simply ignore these realities in India because there were these bearded-beaded gurus in lotus-position Samadhi transcendence in India. Very strange reality-disconnect. I never bought it and it took me years of academic study and self-examination to see how deep this doubt on my part really went. I finally realized that I actually saw the transcendental Hindu philosophy of India as itself being ethically lacking in some essential way that I had difficulty articulating to myself. It wasn\\'t a matter of political activity. By this time I had already realized that I was an anarchist and rejected political structures on principle because they were inevitably hierarchical and therefore gave powers and rights to a few people and denied these powers and rights to the rest of the people. My rejection of India and its spiritual philosophy wasn\\'t political. It went deeper than that. Then it suddenly hit me that India\\'s poverty was a blazing symbol of India\\'s denial of the reality and value of the material world. It simply didn\\'t matter that masses of people lived in nightmare poverty. I was a child in the Roman Catholic Church and I took it very seriously. I took Jesus Christ very seriously. I took all of Christian mythology very seriously. I thought and felt and evaluated all things in life in terms of this mythology. Then something began to happen that caused some major cracks in the walls of my cathedral world. I began to get a sense, a tormenting sense, that there was some sort of core contradiction in the whole thing. I started becoming very uneasy about this unimaginably big guy called GOD. It wasn\\'t that I doubted that He was there (somewhere). It was more that I was profoundly troubled about what it was exactly that He was up to. I mean what was all this really about? I was a serious theology student even as a young man and this is the problem I ran into: If God was infinite, eternal, omniscient, omnipotent and perfect in every possible way, then what was the point of me? I was completely unnecessary because everything was already perfect. And me? I was unimaginably far away from perfect. So what was the point of me? I was like an infinitesimal stain on perfection. And I couldn\\'t erase myself. I could only hope that GOD would tolerate me. Forever. And the idea that I was loved by GOD precisely because I was a miserable and hopelessly imperfect little sinner was actually more disgusting and terrifying than it was affirming. I mean what the HELL was going on? Why was I created? I was sure that I knew exactly how Frankenstein\\'s monster felt. And I began to sense what I would later think of as the blind cruelty of the transcendent. Let me explain one more thing before I return to the original question of revolutionary violence. The story of the resurrection and ascension of Jesus Christ in Christian mythology is very peculiar if one looks at it very closely. I am not referring merely to the claim that someone actually rose from the dead. It goes beyond that. Please look at this with me. The mythology claims that Jesus rose from the dead physically and showed himself to his disciples who saw and heard and touched him physically. It was a physical body addressing them. Then this physical body began to do things that physical bodies can\\'t ordinarily do. It moved through physical walls without doing any damage to itself or the wall. Then it finally ascended. That is, it disappeared leaving absolutely nothing physical behind. The ordinary explanation for this in Christian teaching is that the body of Christ was spiritualized. But if that is the correct explanation then why was it ever physical or material to begin with? Why did Jesus bother to rise from the grave physically at all if he was only going to spiritualize in the end? For that matter, what was the point of \\'imperfect\\' material creation at all if its destiny is only to return into pure spirit in the end? It\\'s not only senseless, it is downright perverse. It\\'s a grotesquerie that has no point. The material world has a point in itself or it doesn\\'t and if it doesn\\'t then why is it even here? And if it does then we need to become conscious of what its point is. The frequently expressed opinion that we are really spiritual beings who are just here in the material world to learn is nonsense to which I say, \"Learn what? How to be spiritual? If we are meant to be learning how to be spiritual then we should have stayed spiritual. And if we are learning how to be material then material existence has a meaning in itself that is not just spiritual. And if material existence has meaning in itself then we need to learn how to guard the sanctity of material existence, which means that it is not acceptable that people force other people into poverty or into war or into any form of material deprivation or abuse . We material revolutionaries fight for the sanctity of material existence. To fight for this means to stand up physically and if standing up physically leads to violence then that is the price we pay for doing what is right. And to deny the sanctity of the material world is to render it absurd and therefore to render reality absurd.\" - Advertisement - I do not advocate any initiation of violence. But if violence comes to us for standing up for human material dignity then we accept it and we persist until we triumph or until death lays us down. \"To suffer woes which Hope thinks infinite; To forgive wrongs deeper than death or night; To defy Power, which seems omnipotent;'"}, "time": 1742564040.156237}