{"duration": 0.06503057479858398, "input_args": {"text": "'Subscribe \\nOne thing that seems to unite most Americans is the collective disgust for the members of the Westboro Baptist Church and their antics. Many organizations and individuals have shown action in addressing this nuisance and that includes the creation of online petitions to the White House. See the five petitions — which call for the removal of Westboro Baptist Church’s 501(c)(3) status and legal recognition as a hate group — in the screen-capture below: \\nIt took the White House a while to respond, but when they did, it was inspiring. In the Official White Response to Westboro Baptist Church petitions , the White House explained that their options are limited. \\nTo the extent that these petitions request a particular law enforcement or adjudicatory action, we cannot issue a comment. In addition, as a matter of practice, the federal government doesn’t maintain a list of hate groups. \\nHowever, as is characteristic of our president and his administration, they found another way to respond to the Westboro Baptist Church petitions — with a heartfelt message and visual. \\n[…] one of the remarkable things about this set of petitions is that it shows just how strong the bonds that unite us can be. Together, we’re more resilient than those who would try to drive us apart. \\nThe White House noted that the signers of the petitions were nationwide, but densely clustered in a couple of specific areas: \\nTake, for instance, this map of all the signers of the petition “Legally recognize Westboro Baptist Church as a hate group”— that we built with the zip codes that people chose to share with us when they signed. The darker color indicates a higher percentage of signers for that particular area’s population. While support for these petitions came from all over the country, it was densely clustered in two places that have unique insight into the actions of the Westboro Baptist Church — Kansas, the state the church calls home, and Newtown, Connecticut, where the church threatened to picket the funerals of those killed at Sandy Hook Elementary. \\n\\nThe Westboro Baptist Church makes a practice of picketing the funerals of activists, Jewish leaders, gay people, soldiers, and….well, just about everyone. Fred Phelps,the leader of the group, is an attorney and is reputed by many sources to be a con-man who engages in controversial activities so that he can subsequently sue when officials, in their attempts to protect the rights of other people, violate the church’s rights. He is careful to not actually break the law \\nThe White House response is amazing and correct. The disrespect that the Westboro Baptist Church shows our fallen soldiers serves to draw Americans together in unity and respect for that which we hold sacred. \\nThe graves of our veterans are hallowed ground, and when men and women die in the service of their country and are laid to rest, it should be done with the utmost honor and respect. – President Barack Obama \\nSilhouetted image by via Google Images by Life Magazine \\nAbout Tiffany Willis \\nTiffany Willis is a fifth-generation Texan, a proponent of voluntary simplicity, a single mom, and the founder and editor-in-chief of Liberal America. An unapologetic member of the Christian Left, she has spent most of her career actively working with “the least of these\" -- disadvantaged and oppressed populations, the elderly, people living in poverty, at-risk youth, and unemployed people. She is a Certified Workforce Expert with the National Workforce Institute , a NAWDP Certified Workforce Development Professional, and a certified instructor for Franklin Covey\\'s 7 Habits of Highly Effective Teens . Follow her on Twitter , Facebook , or LinkedIn . She also has a grossly neglected personal blog , a Time Travel blog , a site dedicated to encouraging people to read classic literature 15 minutes a day , and a literary quotes blog that is a labor of love . Find her somewhere and join the discussion. Click here to buy Tiff a mojito. Connect'"}, "time": 1742562247.3657968}