{"duration": 1.3858919143676758, "input_args": {"text": "'Email \\nNot all invasions are hot — not all invaders come with guns and bombs. And Barack Obama, German Chancellor Angela Merkel, and other Western leaders are “invading their own countries,” says radio host Michael Savage, using a foreign army introduced under the banner of “immigration,” “illegal migration” and “refugee status.” \\nWrites WND.com , “History isn’t about tolerance or peace or understanding. History is about war. History is about conflict. History is about invasions — and the most consequential invasion in human history is well underway.” WND isn’t talking about just an American problem, a German problem, a Swedish problem, or a French problem, but one that threatens to extinguish all of the greatest civilization ever to grace our planet: Western civilization. And this is effected via what’s euphemistically called “demographic change.” \\nConsider the United States. In 1965, close to 90 percent of Americans were of European descent, were of the Western tradition. That percentage now stands at 62 — and falls further each passing day. What happened? The Immigration and Naturalization Act of 1965 happened. Introduced by Congressman Emanuel Celler (D-N.Y.) and aggressively promoted in the Senate by Ted Kennedy (D-Mass.), it created a situation in which legal immigration would swell from an average of 250,000 immigrants a year to approximately one million, causing the rate of immigration to exceed the rate of assimilation. Moreover, 85 percent of these new immigrants would come from the Third World, leading to rapid demographic change. Note that this is something Kennedy had promised would not occur . \\nAnd now, though the United States is teeming with unassimilable foreigners, and citizens must press buttons to conduct business in their native language. Obama has accelerated the process by inviting waves of illegals into our nation and granting “refugee status” gratuitously. As WND tells us, quoting Savage and discussing his new book on the subject, Scorched Earth : “We’re being invaded from the south. We’re being invaded from the north, from the east and from the west. You might say, ‘Well, that’s the way of things,’ and you might get used to it. They’re here, they’re near, they’re everywhere. The question is, why are liberals so quick to embrace this invasion, and why are traditionalists and conservatives like myself so resistant to erasing the borders, language and culture of this great nation?” [said Savage][.] More than 3 million foreigners came to the United States in 2014 and 2015 according to a new report from the Center for Immigration Studies. The foreign-born population in the United States, now standing at 43.3 million people, is at an all-time high. Immigrants now make up almost 14 percent of the population, the highest percentage in 105 years. \\nOf course, liberals aren’t only quick to embrace this invasion, they’ve authored it. Why? \\nPower. \\nSeventy to 90 percent of the Third World and Muslim immigrants in the United States vote for leftists upon being naturalized. This pattern holds throughout the Western world. For instance, in France, where Islamic immigration has become a contentious issue, approximately 90 percent of Muslims voted for socialist president Francois Hollande in 2012. Leftists know this and joyfully import voters. As Andrew Neather, former advisor to ex-British Prime Minister Tony Blair, confessed in 2009, the massive immigration into the United Kingdom over the previous 15 years was designed by his Labour Party to “rub the Right\\'s nose in diversity and render their arguments out of date.” \\nBut it’s rendering Western civilization “out of date,” a fact that hasn’t escaped hostile foreign entities. As late Libyan leader Moammar Gadhafi said in 2006 while commenting on the “cold invasion,” “We have 50 million Muslims in Europe. There are signs that Allah will grant Islam victory in Europe — without swords, without guns, without conquest — will turn it into a Muslim continent within a few decades.” \\nAnd the “enemy within,” as Savage would put it, celebrates this rending of the West with a demonic hatred of what should be their own culture. Just consider that Swedish multiculturalist social engineer and Social Democrat politician Mona Sahlin actually said in 2001 that \"the Swedes must be integrated into the new Sweden; the old Sweden is never coming back.\" Of course, if a corresponding sentiment had been expressed by a backwoods tribesman about his own tribe, it would be viewed as most odd; many would call him a traitor. And when a rainforest-dwelling tribe is overwhelmed by outsiders — or when the Tibetans are inundated with ethnic Chinese, which has been happening — anthropologists will condemn it as demographic and cultural genocide. In the West, though, it’s marketed as “multiculturalism.” \\nAnd we’re told, “Our strength lies in our diversity.” \\nObama knows precisely what he’s doing, too, says Savage, and is purposely deconstructing our nation. “Obama is invading his own country. He’s destroying it from within, like a worm in an apple,” said the radio host. No doubt. In fact, Obama stated last year that over the long term he was “pretty optimistic” that conservatism would be extinguished “because this country just becomes more and more of a hodgepodge of folks.” \\nEven more damningly, it was alleged in 2015 that there’s a secret Obama administration plot to use the new illegal aliens as “seedlings” that will develop a “country within a country”; these foreigners will “navigate, not assimilate” as they eventually “take over the host,” coming “out of the shadows” and “pushing the citizens into the shadows,” the report informed . \\nIn this vein, WND mentions that at issue isn’t just the massive number of im/migrants, but also their nature. The site further points out that this creeping Third Worldism has already turned states such as California into socialist bastions that vote reliably Democrat. For sure. As I wrote in 2010, placing the matter in perspective: If we imported millions of Scandinavians — who have created the most liberal governments on Earth — would we expect them to magically change their ideology upon seeing American terra firma? If not, why would we expect otherwise with south-of-the-border socialists? If they choose Hugo Chavez and Evo Morales types below the Rio Grande, why wouldn’t they above it? Geography doesn’t change ideology. \\nIt doesn’t change jihadist zeal, either. Referring to the recent influx of Muslim migrants into the United States — Obama has welcomed more than 13,000 almost exclusively Muslim “Syrian refugees” already this year — Savage mentioned that these individuals cannot actually be vetted and thus are unknown quantities. Moreover, he points out that Obama is preventing border-patrol agents and the police from enforcing immigration law, as the president “invades his own country with a de facto army from other nations,” as the radio legend put it. He characterizes Obama as “dangerous” and as a “psychopath” bent on replacing the population of his own country. \\nOf course, Obama did telegraph his intentions in 2008, promising “fundamental change.” Note that “fundamental” means “ serving as, or being an essential part of, a foundation or basis .” If a man says his wife requires fundamental change, he doesn’t just mean she needs a new hairdo or wardrobe, or even cosmetic surgery. He means that he doesn’t like the very essence of what she is and wants her transformed into a completely different person. \\nAs for the Left’s destruction of the West, it will continue unless and until Western voters enforce fundamental change — and divorce leftism, permanently, from their cultures and governments. Photo of Michael Savage: AP Images Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742564615.2091897}