{"duration": 1.395829200744629, "input_args": {"text": "'After hours at the Brooklyn Museum on Friday night, hundreds of young people bopped along while a D. J. cycled through the summer’s hottest rap and RB songs. As the event reached its climax, the ubiquitous opening notes of a guaranteed crowd pleaser  —   “Work,” by Rihanna, featuring Drake  —   vibrated through the room. But when the vocals on the demo recording started, it was obvious that this wasn’t the version that spent nine weeks as the No. 1 song in the country. In place of Rihanna, the nimble, addictive patois was delivered by PartyNextDoor, 23, the Canadian producer and RB singer who wrote the song’s   melody and helped to usher in a pop moment deeply indebted to the Caribbean. PartyNextDoor, gliding through the crowd to the D. J. booth, was not there to celebrate his role in the song of the summer, however, nor was he touting his contributions to Drake’s latest album, “Views,” which spent 12 weeks atop the Billboard chart. “PartyNextDoor 3,” his own new album, had just been released, capping one of the more quietly influential runs of 2016. Now he was, somewhat reluctantly, the main attraction. As the first artist signed to Drake’s OVO Sound label, a partnership with Warner Bros. in 2013, PartyNextDoor has had his fingerprints on every Drake release since, in addition to the steady flow of slurry, nocturnal RB under his own name. But Drake casts a wide shadow, and PartyNextDoor (born Jahron Anthony Brathwaite) has thus far been comfortable in the shade. “You don’t really know anything about me, and that’s how I like it,” he said in a rare interview before the album release party. But with credits on a No. 1 song  —   as well as   friends and collaborators like Drake, Rihanna and Kylie Jenner  —   come more expectations. PartyNextDoor acknowledged that while his new album might not be his solo breakthrough to the pop mainstream, he hopes it is a step further. “More people’s eyes are on me now,” he said. “The people are literally watching me find my voice. ” So far, that voice has been malleable:   and full of bravado, slipping easily into   cadences (“Recognize”) or pure and sweet, leaning more toward soul (“Joy,” a highlight from the new album). Most often, it is carnal and   as on “High Hopes,” the decidedly noncommercial   intro to “PartyNextDoor 3,” which just sounds   (to say nothing of the lyrics). In daylight, PartyNextDoor was more   sitting at the kitchen table of a   Airbnb rental in Midtown Manhattan as he rolled a blunt on a takeout sushi container. He wore a     styled with safety pins, a   nose ring and a folded bandanna around his   skinny blond dreads. Prone to long pauses, as if avoiding verbal traps, he left more sentences dangling than he finished. Yet, after a string of niche projects that built his name and a dedicated online following, PartyNextDoor has become resigned to the fact that more visibility is a must for his career to progress. “From here on, I will try to do better at interacting with my fans,” he wrote in a note revealing the new album. Previous attempts at putting himself out there have been bumpy at best. This year, PartyNextDoor found himself drowning in internet drama after posting an   Instagram with a rumored ex, the singer Kehlani. (“No one knows the details, and I don’t care to defend myself,” he said.) Not long after, he was caught up with the Kardashians after a series of paparazzi photos and a subsequent music video surfaced, featuring him in the company of Ms. Jenner, the youngest sister. Asked if he had actively courted TMZ attention by casting a reality star as his love interest, PartyNextDoor would only say, “I’m grateful that really pretty girls like my music, and social media just happens to like really pretty girls. ” While flaunting a Kylie endorsement is one thing, he is less willing to chase what’s hot musically. Raised in what he called a “super Jamaican household” in the Toronto suburb of Mississauga, PartyNextDoor has long peppered his songs with dance hall sirens and slang. But recently, he has leaned into his Caribbean roots on “Work” and “Sex With Me,” another Rihanna track, along with Drake’s “With You,” a shimmering summer gem from “Views. ” “Not Nice,” a thumping single from “PartyNextDoor 3,” has a similar vibe, and given the album’s summer release and the trendiness of the sound, an entire record in that mold might have made sense. But a few songs aside, “PartyNextDoor 3” favors a grim,   palette. “I could make a PartyNextDoor album that’s clean, all hits,” he explained. “That’s not what I care about doing. ” The same goes for being a pop songwriter, he said. After dropping out of high school at 17, he signed a publishing deal to write for others, well aware that that wasn’t his ultimate goal. He met Rihanna last year, during a writing camp at her Malibu home. “The first feeling I got was, ‘Why am I here? ’” he recalled. “All these guys have made hits already. ” But he was determined to create streamlined songs for her, requiring a different process than his looser, more experimental   productions. Even “Work” was not an immediate fit. Despite Rihanna’s Bajan heritage, “her label didn’t care for Caribbean music at the time,” PartyNextDoor said. He and Drake considered keeping the track, or giving it to Alicia Keys, but Rihanna’s team came around “when it was all that she could sing around the house,” he said. “She fought for it,” he continued. “She said, ‘This is my family’s favorite song. ’” Collaborating with Drake may seem more fraught from the outside. During his chart dominance, Drake has been dogged by ghostwriting accusations, and observers have wondered whether OVO Sound, also home to Majid Jordan and Roy Woods, is just his “personal hit factory,” having not yet minted a star near the boss’s level. (Drake’s previous RB collaborator the Weeknd, by contrast, set out for  —   and achieved  —   pop stardom on his own.) PartyNextDoor insisted that their partnership was mutually beneficial. “I openly share music with Drake, especially when it’s time for him to have a project,” he said. At the same time, “I have an older brother I can text anytime, someone who’s super invested because my name is tied into his. “It’s just creatives cooking,” he continued of their work together. “If he sees something in a song of mine that he feels he can spin around and make better, who am I to say I’m going to selfishly keep it? As a fan of music, that’s wrong. ” He added, “Of course I want to be a superstar, but it doesn’t happen overnight, and I see that from having a mentor. ” The two work in harmony, not in lock step, each playing his role. “We have similar stories, but not the same story,” PartyNextDoor said. “Being a fan got me to him, but he needs me to be me. I need to be me. ”'"}, "time": 1742564077.2054186}