{"duration": 0.07823967933654785, "input_args": {"text": "'By Hrafnkell Haraldsson on Sat, Oct 29th, 2016 at 4:05 pm “You do know you just attacked a Gold Star family?” one adviser warned Trump. \"What\\'s that?\" he asked. Share on Twitter Print This Post \\nGabriel Sherman writes at New York Mag that when Donald Trump attacked the Khan family over Khizr Khan’s speech at the Democratic National Convention, he had no idea what a Gold Star family was. \\nYou will remember that Khizr Khan stood up in front of the entire world and said to Donald Trump, “Let me ask you, ‘Have you even read the United States Consitution?’ I will gladly lend you my copy. In this document, look for the words ‘liberty’ and ‘equal protection of the law.’” \\nThe fallout was predictable. Donald Trump, openly criticized, lost it. He attacked the Khan’s religious beliefs, saying “If you look at his wife, she was standing there. She had nothing to say. She probably, maybe she wasn’t allowed to have anything to say.” \\nNow it turns out that he had no idea what he was doing. Because he is ignorant, and because, as Mark Cuban has observed, he isn’t interested in learning anything. Gabriel Sherman explains: \\n“You do know you just attacked a Gold Star family?” one adviser warned Trump. Trump didn’t know what a Gold Star family was: “What’s that?” he asked. To Trump, Khizr Khan and his wife, Ghazala, were enemies who had said something mean about him, just like Rosie O’Donnell and any number of people who had gotten under his skin over the years. Wasn’t it his right to respond? “\\u2005‘The election is about the American people, it’s not about you,’\\u2005” Manafort told Trump, according to a person briefed on the conversation. Trump countered with Breitbart’s report on Khan’s purported belief in Sharia. “\\u2005‘He’s not running for president,’\\u2005” Manafort shot back. “\\u2005‘The Clintons did this to us to waste our time getting off message.’\\u2005” \\nOf course, Trump could not and would not admit his own ignorance and he certainly wasn’t prepared to take the blame. Instead, as Sherman reveals, he “took it out on Manafort in front of his senior advisors, including Ailes.” According to Trump, Manafort wasn’t “able to get the media to focus on the right stuff.” \\nNo wonder, when Trump refuses to take Manafort’s advice and focus on the right stuff. This is not to defend Manafort, who is at least as despicable as his boss, but it serves as an example of how Trump’s first reaction each and every time is to get back at his critic. \\nIt was one of Donald Trump’s most visible Joe McCarthy moments, and his response to Khizr Khan actually reinforced the point Khan was trying to make. \\nStopping and thinking are foreign to him. And if you are not astonished by the appalling ignorance on display here, you should not be. This is all in keeping with a party that prides itself on ignorance rather than facts.'"}, "time": 1742563713.3418283}