{"duration": 0.10971999168395996, "input_args": {"text": "'Print \\nJust in case anyone might be tempted to defend their denial by latching onto the now-laughable proposition that the US Army going with an openly lesbian general was a fluke or that the US Navy naming a new warship after famed gay rapist Harvey Milk was an anomaly or that Army Cadets being pressured into crossdressing was a weird little mistake that somehow slipped through the cracks of an otherwise honorable and good approach to reality, we keep getting wave after wave after tsunami after avalanche of crystal clear confirmation of the US military’s proud, headlong plunge into oblivion (and oblivion advocacy, of course). \\nThe latest example of God-given uber-clarity on the matter comes in the form of a lovely little article entitled First transgender soldiers seek formal Army recognition , wherein AP reports (with bold emphasis added): \\nWithin weeks of the Pentagon allowing transgender service members to serve openly, Army officials said 10 soldiers have formally asked to be recognized as their new, preferred gender. The small number represents only those who have publicly said they are transgender, and doesn’t include soldiers who may be considering or beginning gender transition or those who don’t yet want to make an official paperwork change. Gen. Mark Milley, chief of staff of the Army, said the key now is to educate the force, particularly commanders who will have to make decisions about soldiers in their units who request a gender change. “Is the army ready? Well, we are educating ourselves, and we are trying to get ready,” Milley said in an interview with The Associated Press. “We’re well-past the issue of debating and arguing about transgender. We are now into execution, to make sure the program is carried out with diligence, dignity, respect.” Dignity and respect, eh? Do tell. So the US military is now of a mind that the Christian worldview is inherently anti -dignity and anti -respect. Anti-kittens, anti-rainbows, and anti-love, too, I’m sure. That’s how anti-Christ perspectives roll: They tar the Christian worldview (and the God whose Nature it reflects) as mean and evil. They make good evil and evil good. At least they try to anyway. [insert “ U! S! A! ” chant here] Now back to the AP article: The Pentagon policy took effect Oct. 1, and Army Secretary Eric Fanning approved the service’s new transgender guidelines earlier this month. Defense Secretary Ash Carter announced in June that he was ending the ban on transgender individuals serving openly in the military. Transgender troops are now able to receive medical care and begin changing their gender identifications in the Pentagon’s personnel system. Next year, the military services will begin allowing transgender individuals to enlist, as long as they meet required standards and have been stable in their identified gender for 18 months. “We’re monitoring implementation closely, and everything we’ve seen so far points to a military organization fully committed to treating everyone equally and providing medically necessary care to all troops, not just some,” said Aaron Belkin, director of the California-based Palm Center, an independent research institute. “My conclusion, so far, is that implementation has proceeded smoothly and successfully.” . . . Milley said the Army numbers so far are low, but the service doesn’t track the number of soldiers who may be starting the gender transition process. “We may not know the full scope yet,” said Milley. “Others that may consider themselves as transgender but haven’t self-identified publicly may be holding back because they want to see how things progress.” \\nProgress. \\nThat’s the name of the game, isn’t it? \\nThe US Army is committed to progress. \\nExplicitly anti-Christian progress, of course. \\nThe US Army is at war. \\nWith God. \\nAnd His people. \\nThat’s how these fights always end in God’s cosmos. \\nThat’s how they always unfold in His creations of time and history. \\nSo take heart, Christian. \\nEither way – whether through the beauty of a repentant and restored America being spared judgment and finding life again in loving, willful subjugation to Christ as King, or by way of King Jesus breaking yet another in a long line of unrepentant, proud, God-hating cultures to pieces under the weight of His unbreakable Law , His people always win and His Kingdom always advances…all by His grace and all for His glory. \\nArticle reposted with permission from Fire Breathing Christian shares'"}, "time": 1742564064.5544734}