{"duration": 0.0873868465423584, "input_args": {"text": "'Financial Markets , Gold , Market Manipulation , U.S. Economy Banana Republic , Clinton Foundation , Hillary emails , Podesta emails , the rapture admin Must have been some kind of time/space warp while we slept last night… today Obama says if illegals vote they become a citizen and the NY Post headline is the Filipino maid who printed Hillary’s classified emails then Comey bails on 650,000 damning emails. F#%k me Dave, I feel like I’m on LSD. – email from a reader \\nAbout 12 years ago I was chatting with the friend who dragged me feet-first into the “dark side” and the world of precious metals in 2001. We were discussing Eastman Kodak’s likely demise a few years before the Company went into the tank. We knew a 2008-type event was going to happen at some point. At the time, we said that eventually we would see events occur in this country that would blow our minds. Mind you, this was a couple years after Enron, 9/11 (which we knew was a Government false-flag operation), Bernie Madoff and the U.S.’ illegal invasion based on admitted (eventually) lies propagated by Colin Powell. \\nI have to say, the way in which Hillary Clinton’s criminal organization has gained complete control over the political and justice system and the media in this country is truly mind-blowing. Hillary is a criminally insane sociopath. That point is unequivocally inarguable. But the true Devil in her organization is John Podesta, who’s persona has been made available to anyone willing to spend time reading just a portion of the “Podesta” emails given to us by Wikileaks. There are 691,200 seconds in 8 days. FBI Director Comey reviewed 650,000 emails in 8 days? An email per second? Americans aren’t stupid! – tweet from Bernard Kerik, ex-NYPD Commissioner \\nIf anyone knows about corrupt organizations, it’s an NYPD Commissioner – the NYPD being one of the most internally corrupt law enforcement organizations around. It’s great when ex-insiders blow the whistle on others when the agenda of those others do not fit that of the ex-insider’s “team.” \\nThe manner in which Jim Comey has folded is beyond stunning. I’m not sure there’s anyone who cares about this matter who believes that Comey was able to parse through over 650,000 emails in 8 days in order to determine that Hillary did not commit “intent” in her email escapades. \\nHillary’s email trail made available to the public is a fascinating trail of criminality. I doubt James Patterson, John Grisham and Robert Ludlum could combine resources and make up a crime tale as intriguing as Hillary’s. \\nThe evidence piling up against Hillary is breathtaking. According to the recently released Podesta emails, the Clinton Foundation has been used for everything except funding charitable causes, including paying for Chelsea’s wedding and funding Chelsea’s husband’s failed hedge fund. If I were not able to laugh at this insanity, I’d be suicidal… \\nI think most Americans who are being honest with themselves are fully aware of the fact that Hillary Clinton is likely the most corrupt politician in U.S. history. If anything, the election of Hillary Clinton is a symptom that the end is near for the United States. \\nI am convinced that we are at a pivotal moment in American history, and if the American people willingly choose Hillary Clinton it will be an indication that there is zero hope for the future of this nation. \\nThe above quote is an excerpt from a must-read essay written by Michael Snyder: I Just Lost All Faith In Our Deeply Corrupt Legal System… \\nI urge everyone to read Snyder’s commentary.'"}, "time": 1742563676.6665363}