{"duration": 0.03634953498840332, "input_args": {"text": "'Homeland Security Chairman, “Hillary’s Mishandling of Classified Information is Treason” Homeland Security Chairman, “Hillary’s Mishandling of Classified Information is Treason” Breaking News By Amy Moreno November 7, 2016 \\nPeople are rotting in prison for doing a FRACTION of what Hillary has done with our nation’s secrets. \\nFolks, she had her MAID printing off piles of classified emails. \\nHer server, which she kept in some bathroom closet, was HACKED by at least FIVE by foreign players. \\nHillary Clinton DESTROYED 33 THOUSAND emails AFTER receiving a congressional subpoena. \\nJust because she’s rich and powerful and has a rigged system saying “She’s INNOCENT” doesn’t make it so. \\nRight now there are GOOD Americans rotting away in prison for doing the smallest fraction of what Hillary did. \\nShe’s getting away with TREASON. \\nThose were the exact words expressed from the Chairman of Homeland Security said. \\nFrom the Washington Times: \\nMichael McCaul was among the first to call Hillary’s choice to carelessly have a personal server which she used for State Department business a treasonous act. \\nRep. Michael McCaul, chairman of the House Homeland Security Committee, on Thursday said Hillary Clinton’s exposing sensitive information to potentially multiple hacks from foreign actors amounts to treason. \\n“This is why you have security protocols — to protect classified information,” Mr. McCaul said on “Fox and Friends.” “She exposed it to our enemies, and now … our adversaries have this very sensitive information that not only jeopardizes her and national security at home, but the men and women serving overseas.” \\n“In my opinion, quite frankly, it’s treason,” said Mr. McCaul, Texas Republican. \\nThis needs to end. \\nOur system is rotten to the core. \\nThe ONLY way to fix it, is to vote for Trump and #DrainTheSwamp. This is a movement – we are the political OUTSIDERS fighting against the FAILED GLOBAL ESTABLISHMENT! Join the resistance and help us fight to put America First! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742564048.8211176}