{"duration": 0.04779171943664551, "input_args": {"text": "'Señal de Alerta\\nOSITRAN: PCM le baja el dedo a Benavente por Herbert Mujica Rojas Socios | 4 de noviembre de 2016 4-11-2016\\nPatricia Benavente Donayre, presidente de OSITRAN, aún, habría solicitado a la PCM autorización para participar en la Séptima Reunión de la Red de Reguladores Económicos de la Organización para la Cooperación y el desarrollo Económico–OCDE, que se llevó a cabo en París, Francia, entre el 2 y 4 del mes en curso. País amado por Benavente, pues en más de una oportunidad lo ha visitado excediéndose, una vez, el período sin que le fuera aplicada sanción alguna.\\nLe dijeron NO\\nEsta vez le fue negada la autorización requerida y, además, habría sido informada verbal pero formalmente, que su período vence en febrero 2017.\\nViajó Calle\\nA pesar que OSITRAN se declaró prácticamente en falencia económica, a mediados del ejercicio, pues su plana gerencial calculó equivocadamente el nivel de ingresos para el presente año fiscal, Benavente tomó la decisión de aprobar el viaje de Jean Paul Calle Casusol, su gerente favorito y que ha salido del país al menos en 8 oportunidades durante esta gestión que fenece en febrero próximo. Es decir, en estos 4 años viajó más que en toda su vida anterior.\\nConsejo directivo de adorno\\nA pocos días del nombramiento del nuevo director que ayudará a completar el quórum para sesionar legalmente, doña Patricia sacó la resolución sobre la excursión de Calle. Lo curioso es que se hizo un día antes de la sesión del consejo directivo.\\n¿Cuándo devuelve los S/ 16 mil?\\nEn artículo anterior dimos cuenta de la innecesaria, y posiblemente ilegal, contratación de un estudio de abogados para que analizara y determinara cuándo vencía el mandato de la actual presidente del regulador. Estaba claro, para todos, menos para Benavente, que fenecía en febrero 2017. Entonces, el Estado a través de OSITRAN, pagó S/. 16, 000 por el capricho de doña Patricia, y consiguió opinión a su medida, es decir, “debía” quedarse hasta septiembre 2017.\\nSin embargo, el jueves 20 de octubre salió publicada la resolución suprema que nombra como director de OSITRAN a Manuel Dammert Lira y en sus Considerandos puede leerse claramente: “ … dispone que el período del nuevo miembro del Consejo Directivo se computará desde el día siguiente a la fecha de vencimiento del período de designación del miembro anterior”.\\n¿Cumplirán su función los estamentos del regulador para cobrar esta acreencia de Benavente? Claro que no. Habrá que esperar al nuevo presidente para que ponga orden en OSITRAN.\\nTomado de http://senaldealerta.pe/noticias/os...\\nHerbert Mujica Rojas'"}, "time": 1742563054.367676}