{"duration": 0.04759693145751953, "input_args": {"text": "'A specialist bomb squad has been scrambled to the Swedish city of Gothenburg after an explosion, just 24 hours after a suspected car bomb rocked Stockholm. [The incident occurred in the stairwell of an apartment block just after 10 pm on Friday evening,   reports.  “I thought it was another country that has come to attack. I thought it was a war  …    ” said one witness. Authorities suspect the blast was caused by an “attack” involving some form of homemade device, and the National Guard and a police bomb squad were called to the scene. “We suspect that there are some kind of bomb attacks carried out here” said Pål Engebretsen, the police officer leading the investigation last night. “Some people were seen running from the scene in connection with a bang, but who these people are we do not know at present” added police press officer Thomas Fuxborg on Saturday morning. JUST NU: Explosion i Göteborg  —   dörr söndersprängd i Majorna https:  .  pic. twitter.   —     (@GoteborgsPosten) March 10, 2017,  “We will examine who lives near the stairwell and knock on doors to see if anyone saw or heard anything yesterday” he continued. By Saturday morning, the emergency services, National Guard and police bomb squad had left the scene. “We have not received the results of the technical investigation yet” added Mr. Fuxborg. “But bomb technicians found no metal residues which usually indicates a hand grenade was used, but something else has exploded there. What it is is still unclear”. He said it was possible the device was homemade and said motives could include scaring someone specific in the building or simply “mischief”. The number of grenade attacks and car fires in the relatively small nation has shot up in recent years  —   allegedly because of warring migrant gangs  —   and the number of fatal shootings has doubled in nine years. Since Mr. Trump made his intervention last month, there have been grenade attacks in Stockholm and Malmö, shootings and riots in the “No Go Zone” of Rinkeby in Stockholm, and ambulance workers demanding “military” defence so they can enter the area.'"}, "time": 1742562839.3942933}