{"duration": 0.0906672477722168, "input_args": {"text": "'It has been claimed that Nostradamus prophesied Donald Trump’s surprise victory as President of the United States five centuries ago, putting to shame modern pollsters. \\nVia YourNewsWire \\n\\nThe famous French medical practitioner and seer has been credited for predicting major world events and his followers claim he foresaw Donald Trump’s victory. However, the end is nigh…because as at the same time, Nostradamus also predicted that Trumps presidency would herald the the end of the world.\\nThe ancient prophet refers to president-elect Donald Trump as “the false trumpet” who will one day engage in military adventures to force “Byzantium to change its laws,” which in turn would lead to the Apocalypse. “The false trumpet concealing madness will cause Byzantium to change its laws,” Nostradamus predicted over four hundred years ago.\\nWhile many were surprised by the billionaire’s victory in the 2016 US election, followers of Nostradamus would not have been, claiming the prophesier predicted this in the 16th century.\\nIn Century III, Quatrain 81, Nostradamus wrote: “The great shameless, audacious bawler. He will be elected governor of the army: The boldness of his contention. “The bridge broken, the city faint from fear.”\\nMany believe that the “shameless, audacious bawler” part refers to Mr Trump’s loud communication, while “governor of the army” refers to being in charge of the world’s leading military force. In Century 1, 40, another prediction reads: “The false trumpet concealing madness will cause Byzantium to change its laws.”\\nByzantium was an Ancient Greek colony – some have connected this to the fact Greece is becoming a landing spot for immigrants and refugees, a topic that has been at the center of Mr Trump’s candidacy.\\nFinally, in Quatrain 50, Nostradamus writes “the Republic of the big city” will engage in costly military operations, ordered by the “trumpet”, which has led to fears of nuclear war. One user wrote on Facebook: “I pretty sure this is the start to Nostradamus’ prediction of the Apocalypse.”\\nAnother posted: “Nostradamus predicted this outcome. Nostradamus predicted after the trumpet wins, there will be a Great War! He predicted this 400 yrs ago! “His prediction have all come true! I’m afraid America is going fall, compare us to Roma, we have to much debt, and we import more than we export, we are in serious trouble.”\\n'"}, "time": 1742563111.3993304}