{"duration": 0.0630335807800293, "input_args": {"text": "'UNITED NATIONS  —   It was President Obama’s last appearance on the marble dais of the United Nations General Assembly hall, and his farewell speech on Tuesday revealed a man whose eye was fixed as much on the next seven weeks of the American political campaign as on his place in history. Mr. Obama delivered a stinging rebuke of those who would build walls, a message aimed at foreign leaders who he said had fueled rising nationalism, sectarian hatred and economic inequality  —   but, unmistakably, at Donald J. Trump, as well. “A nation ringed by walls would only imprison itself,” Mr. Obama said of the protectionist impulse to resist the forces of global integration. At another point, he declared to the packed chamber in New York, “the world is too small for us to simply be able to build a wall” to keep out extremists. Lest anyone miss the point, he said of the spreading Zika virus, “mosquitoes don’t respect walls. ” Mr. Obama has addressed the disruptive forces of globalism before, in speeches at Stanford University and before the Canadian Parliament. But this time, with his days in office ticking down, his legacy up for grabs and the global picture more unsettled than ever, there was a darker tone and a deeper urgency to his plea for international order. “At this moment, we all face a choice,” Mr. Obama said. “We can choose to press forward with a better model of cooperation and integration, or we can retreat into a world sharply divided and ultimately in conflict along   lines of nation and tribe and race and religion. ” That choice, Mr. Obama implied, was as sharply drawn in the race between Mr. Trump and the president’s preferred candidate, Hillary Clinton, as it was in the grinding sectarian war in Syria, the predations of President Vladimir V. Putin of Russia and the   of China. Mr. Obama spoke of a “crude populism” driving politics in the United States and Europe that fed on “uncertainty and unease and strife” around the world. Mr. Obama’s words underscored the distance he has traveled from the hopeful leader who first addressed the General Assembly on Sept. 23, 2009. On that day, he pledged to forswear the unilateralism of his predecessor, George W. Bush, heralded a new era for the United States’ relationship with the Muslim world and promised to revive peace negotiations between Israel and the Palestinians. On Tuesday, he dismissed the   peace process with a single sentence  —   not a fervent call for a   solution but the perfunctory observation that both sides would “be better off if Palestinians reject incitement and recognize the legitimacy of Israel, but Israel recognizes that it cannot permanently occupy and settle Palestinian land. ” Even more telling was Mr. Obama’s reference to Syria. On a morning when his secretary of state, John Kerry, was struggling to salvage a fragile   agreement there after a deadly airstrike on an aid convoy  —   which American officials said later in the day was probably carried out by Russian aircraft  —   the president said, “we have to be honest about the nature of these conflicts. ” No outside actor, he said, will ever be able to force people from different religious or ethnic groups to coexist peacefully. “In a place like Syria, where there’s no ultimate military victory to be won,” Mr. Obama said, “we’re going have to pursue the hard work of diplomacy that aims to stop the violence and deliver aid to those in need and support those who pursue a political settlement and can see those who are not like themselves as worthy of dignity and respect. ” There are a couple of explanations for Mr. Obama’s circumspect tone. The obvious one is that he has only four months left in office, which means that intractable problems like Syria are not going to be fixed on his watch. Mr. Obama also finds himself in a political bind: He does not want to saddle Mrs. Clinton with policies that could backfire with voters, like a new plan to push Israel and the Palestinians back to the bargaining table. Mr. Obama was reticent even about his diplomatic achievements. The nuclear agreement with Iran, for example, consumed him and Mr. Kerry for months, requiring a titanic battle against opponents on Capitol Hill and months of diplomatic repair work with allies in the Persian Gulf. Yet on Tuesday Mr. Obama described the deal’s benefits in the blandest terms, saying that it “enhances global security and enhances Iran’s ability to work with other nations. ” He coupled this unenthusiastic boast with a warning about another major proliferation threat, North Korea, which recently tested another bomb. Whatever its   risks and payoffs, the Iran nuclear deal remains a source of political static in the United States. To the extent that Mrs. Clinton refers to it on the campaign trail, which is not often, she mostly promotes her credentials to police Tehran aggressively. For his part, Mr. Obama saved his activism for what would otherwise be a less controversial issue: the plight of refugees. He led a meeting of fellow leaders to nail down commitments from countries to take in more displaced people, and to spend more to integrate them. But even here, in an election year in which fears of terrorism loom large, the constraints on Mr. Obama were clear. In noting that the United States had agreed to admit 110, 000 refugees in 2017, up from 85, 000 this year, he said that “refugees are subject to more vigorous screening than the average tourist. ” Mr. Obama’s annual speeches to the United Nations are a good way to track the evolution of his foreign policy. The soaring ambition of 2009 gave way to a more restrained tone in 2013, when Mr. Obama acknowledged the limits of American military force. A year later, however, the president struck a more hawkish tone, trying to enlist the world in the fight against the Islamic State and promising to resist Mr. Putin’s aggression in Central Europe with sanctions  —   and force, if necessary. Russia, Mr. Obama said on Tuesday, remains a threat to the international order. “In a world that left the age of empire behind,” he said, “we see Russia attempting to recover lost glory through force. ” But he left to his successor how best to resist that. And though Mr. Obama reiterated the need for a “united and relentless” effort to destroy the Islamic State, he lamented that “the   of sectarianism and extremism and bloodletting and retribution that has been taking place will not be quickly reversed. ” As he exits the world stage, Mr. Obama sometimes seems less determined to change the world than to come to terms with it.'"}, "time": 1742628572.1074631}