{"duration": 0.133256196975708, "input_args": {"text": "'LONDON  —   His voice sometimes close to cracking, his expression strained and grim, former Prime Minister Tony Blair spent much of the past two days responding to the damning judgment of an inquiry into how he led Britain into the Iraq war, engaging in an extraordinary public mix of soul searching, regret and defensiveness. Judging by much of the media reaction, he would have done better to save his breath. “A Monster of Delusion,” read the headline over a picture of Mr. Blair in The Daily Mail on Thursday. The Sun, another British tabloid, described him as a “Weapon of Mass Deception,” a reference to the incorrect assertions by Mr. Blair and President George W. Bush before the invasion that Iraq had an arsenal of unconventional weapons. Nine years after stepping down from office, Mr. Blair  —   the most successful politician of his generation, who led the Labour Party to three consecutive general election victories with a centrist message  —   is widely loathed in Britain, his legacy defined overwhelmingly by the Iraq war and its bloody aftermath. He has few defenders, especially within his own party, which was split at the time by his support for the war and has since shifted leftward again, repudiating much of what he stood for. Mr. Blair is such a pariah on the left, said Steven Fielding, director of the Center for British Politics at the University of Nottingham, that “if he says ‘black,’ almost everyone else will say ‘white.’ ” Mr. Fielding added, “In the party he once led, to be described as Blairite is the greatest insult that can be leveled. ” More broadly, Mr. Blair has failed to rehabilitate his image since leaving office, and in some ways has added to his problems. Though he set up the Tony Blair Faith Foundation, intended to counter religious conflict and extremism, its work has been overshadowed by his business interests. Mr. Blair’s wealth, and his willingness to advise nations with poor human rights records such as Kazakhstan, has fueled another strand of criticism: that he was always too impressed by those with power and money. And his diplomatic work, trying to bring peace to the Middle East, ran up against the intractability of the conflicts in that region. “There will not be a day of my life where I do not relive and rethink what happened,” Mr. Blair said, referring to the Iraq war. “People ask me why I spend so much time in the Middle East today. This is why. This is why I work on Middle East peace, on the dialogue between faiths on how we can prevent young people growing up with hatred in their hearts towards those who look, think or believe differently from them. ” The 2.   report released on Wednesday was a savage indictment of Britain’s involvement in Iraq, condemning it as ill prepared and poorly executed, and concluding that it was based on flawed and unchallenged intelligence. In confronting the charges against him, Mr. Blair spoke sometimes in confessional terms, acknowledging those failings with “more sorrow, regret and apology and in greater measure than you can know or may believe. ” But what he did not do was to accept the fundamental premise of many of his critics: that he had been wrong to sanction military action against Saddam Hussein. The view of many of the protesters who gathered on Wednesday waving placards reading “BLIAR,” and of relatives of some of those who died in the conflict, is that he is culpable for taking Britain into a disastrous war on false pretenses. There have been attempted citizens’ arrests of him on war crimes charges. As one of his Labour Party critics, Diane Abbott, said on Thursday, Mr. Blair’s reputation had “bled to death in the sands of Iraq. ” Mr. Blair was always unpopular among the left of the party, who felt he had gone too far in abandoning core principles for the center ground while embracing central elements of Thatcherism. Even they would admit that he was good at winning elections: He scored his third victory in 2005, after the invasion of Iraq. Mr. Blair presided over a generally healthy economy and helped build peace in Northern Ireland. But many Britons found it inexplicable that he chose to go to war alongside Mr. Bush. In 2003, Mr. Bush was unpopular in Britain, and so was going to war in Iraq. Mr. Blair has sought to address his critics previously, but not at such length and with such public emotion as he has since the publication of the new report on Wednesday. The gist of his response was that his job as prime minister was to make tough decisions and that while he regretted many of the consequences of this one, he stood by it as the best available option at the time. “The world is better off without Saddam,” Mr. Blair told reporters in London, adding that had the Iraqi leader been left alone, he would have remained a threat to peace. And, had Mr. Hussein survived until the Arab Spring of 2011, he would have clung to power “with the same deadly consequences as we see in the carnage of Syria,” Mr. Blair suggested. “I will never agree that those who died or who were injured made their sacrifice in vain,” said Mr. Blair, while acknowledging that some of the families of those casualties “cannot and do not accept this is so. ” In that he is correct. After the report’s publication, Sarah O’Connor, the relative of one victim, called Mr. Blair “the world’s worst terrorist. ” Reg Keys, another victim’s relative, described Mr. Blair as a “consummate actor” and said that his long public statement resembled “the ramblings of a madman. ” While the report, seven years in the making, provides a damning indictment of sloppy   cataloging a host of policy and other failings, it does not accuse Mr. Blair of lying  —   a point to which the former prime minister returned frequently. Over the years, Mr. Blair has been accused by critics of deceiving Parliament and the public, and on Wednesday he said accusations of “bad faith, of lying or deceit or deliberate misrepresentation” should be laid to rest. “I did not mislead this country,” Mr. Blair said. “I made the decision in good faith on the information that I had at the time. ” His unequivocal support for Mr. Bush was essential to prevent the United States from pursuing a unilateral foreign policy, Mr. Blair argued, rejecting the characterization of himself as the president’s “poodle. ” He defended a message sent to Mr. Bush, before the decision to invade, including the phrase: “I will be with you, whatever. ” That statement was, Mr. Blair said, “not a blank check. ” Yet 13 years after Mr. Blair ordered British troops into action, his response to the latest inquiry is unlikely to bring closure because he is not budging on one central point. “What I cannot do and will not do,” Mr. Blair said, “is say we took the wrong decision. ” Mr. Fielding said history’s judgment on Mr. Blair’s premiership may be more positive, but that Mr. Blair has refused to do the one thing that might soften the damning verdict of his contemporaries. “If he was ever going to, this was the moment for him to apologize and say, ‘We should not have done this,’ ” Mr. Fielding said. “If he isn’t going to say this now, he will take this to his grave. ”'"}, "time": 1742562261.6642644}