{"duration": 0.1271810531616211, "input_args": {"text": "'“O. K. Craig,” the father asks, “you ready?” “Yeah, Dad,” replies the son. A raw, emotional and searching conversation followed. In the latest episode of The   we brought together a young gay actor in California, who supported Hillary Clinton, and his father in Kentucky, who backed Donald J. Trump, to talk at length about how they feel about each other’s votes on Election Day. Their conversation is the third and final installment in our series of dialogues between different pairs of voters who are struggling with feelings of betrayal, mystification and fury over the Election Day decision of a person very close to them. In Part 1, we spoke with Kyle and Aaron, once close high school classmates from Illinois. In Part 2, we talked to Amy and Dawn, dear friends and   from Wyoming. All of them had avoided talking about the election, knowing just how difficult the discussion would be. Until now. They were guided by a set of questions, prepared with the advice of social psychologists, that were designed to encourage honest and civil conversation. Subscribe to The   on iTunes or Google Play Music to follow along as we release new episodes. Who they are: Craig, 26, and his father, who asked that we not use his name. The father lives in Louisville, Ky. where Craig grew up. Craig has since moved to California. Their relationship: They’ve grown more distant since Craig left home. Why it feels personal: Craig came out to his parents about a year ago. He grew up in a family where his father was openly derogatory toward gay people and other minority groups. His father has been struggling to accept Craig’s sexuality. The tension has heightened around the election, with Craig feeling betrayed by his father’s vote for Trump, and Craig’s father feeling pressured by his son to evolve in ways that are uncomfortable to him. “We’re from two different sides of the wall,” Craig’s father says. “This gay lifestyle and everything  —   I didn’t grow up with it. ” He describes once, when he was younger, being followed by a man who was trying to pick him up. “I just wanted to beat the hell out of him,” he tells Craig. And then he and his friends caught the guy to do just that. “I’ve come a long way as far as acceptance and tolerance,” he says, reflecting on that past. “I get that you have acceptance and tolerance,” Craig responds. “You accept me as your gay son. But to me that’s you being a good parent. And what I need  —   and what I’ve told you  —   is I need you to be more than accepting of me. I need you to be an ally. To support me is to just support me. I need you to support the ‘us. ’” When the conversation turns to the Confederate flag displayed in his garage, Craig’s father asks what is probably the hardest of the 19 questions: “Do you think I’m a sexist or racist?” After a pause, Craig answers. “Yeah. ” He brings up the derogatory language that his father used when he was a child, which his father acknowledges was a problem and says he’s working to change. “At the time I was ” the father says. “Now I’m maybe  . ” “  what?” Craig asks. “I guess 40 racist. And 60, you know, O. K. I feel like I’m progressing with it. I feel like I’m trying. ” Who they are: Amy, 43. Dawn, 42. Both live in Green River, Wyo. Their relationship:   and neighbors, the women and their families have grown extremely close. Why it feels personal: As the mother of a child with a disability, Amy was deeply offended by how Mr. Trump mocked a disabled reporter during the campaign. Dawn has her own personal stake in the election: Her husband works in the mining industry, a job she worried was threatened by Mrs. Clinton’s policies. “This election was different for me,” Amy tells Dawn. “If, say, John Kasich won, I would be like ‘Well, you win some you lose some.’ . .. I would not have been as upset as I have been, primarily because of some of the behavior that   Trump has exhibited throughout the campaign. ” She continues: “Trump was not my first choice for the candidacy for the presidency,” Dawn says, though she is a Republican and votes Republican. She says she was “disturbed” by “the way he acts and the way he thinks he can do and say these things, and can get away with it and it’s okay. ” But ultimately, she tells Amy, “I had to refocus and reprioritize the reasons I wanted to vote for him. Not that I condone his behaviors, but the other issues were huge for me. ” She explains: Who they are: Aaron Lee Ponce Landaverde is 26. Kyle Hill is 25. Both live in Peoria, Ill. Their relationship: Attended high school together and were teammates on the wrestling and football teams. Why it feels personal: As an   who supported Mrs. Clinton, Mr. Hill took offense at what Mr. Ponce Landaverde, a Trump supporter, posted on Facebook during the election. “I’ve heard race more than anything throughout this whole election, throughout this whole year,” Mr. Ponce Landaverde says. “This whole year is just race. I feel like there needs to be more unity in this country. ” He continues: Mr. Hill explained to his friend why, to him, race was a crucial factor in this election, and is a big part of why he is struggling to understand friends who voted for Mr. Trump. “A lot of what he has said, it’s disparaging for marginalized people in this country  —     Latinos, gay people, women  —   it’s disparaging,” Mr. Hill says. “To a certain extent, voting for Donald Trump after all he said, after all he’s done  —   you have to be somewhat comfortable with that in order to cast that vote for that man. ” He continues: From a desktop or laptop, you can listen by pressing play on the button above. Or if you’re on a mobile device, the instructions below will help you find and subscribe to the series. On your iPhone or iPad: 1. Open your podcast app. It’s a   app called “Podcasts” with a purple icon. (This link may help.) 2. Search for the series. Tap on the “search” magnifying glass icon at the bottom of the screen, type in “The  ” and select it from the list of results. 3. Subscribe. Once on the series page, tap on the “subscribe” button to have new episodes sent to your phone free. You may want to adjust your notifications to be alerted when a new episode arrives. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, tap on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode. On your Android phone or tablet: 1. Open your podcast app. It’s a   app called “Play Music” with an    icon. (This link may help.) 2. Search for the series. Click on the magnifying glass icon at the top of the screen, search for the name of the series and select it from the list of results. You may have to scroll down to find the “Podcasts” search results. 3. Subscribe. Once on the series page, click on the word “subscribe” to have new episodes sent to your phone free. 4. Or just sample. If you would rather listen to an episode or two before deciding to subscribe, click on the episode title from the list on the series page. If you have an internet connection, you’ll be able to stream the episode.'"}, "time": 1742561982.7598076}