{"duration": 0.03985095024108887, "input_args": {"text": "'A young British woman was stabbed to death on Jerusalem’s tram network on Good Friday, with her killer identified by local police as a Palestinian male “terrorist”. [The unidentified woman, who was in her early 20s and a student from Britain in Jerusalem on a tourist visa, was killed by “multiple stab wounds to her upper body” by a    “mentally ill man” identified by The Jerusalem Post as Jamil Tamimi. The suspect has been arrested.  Update to stabbing attack: Women in 20s dies In hospital few minutes ago. Arab Terrorist arrested who carried out attack is from Rasel Amud.  —   Micky Rosenfeld (@MickyRosenfeld) April 14, 2017,  The stabbing, which is the second time in weeks that a Palestinian individual has launched an attack in the city, comes as Jewish and Christian pilgrims congregate in the city for Holy Week, Good Friday, and Passover. According to reports, the attack took place on Jerusalem’s light rail tram system, and that the man pulled a kitchen knife from his bag and started stabbing other passengers as the train approached Kikar Tzahal, the ‘IDF Square’ near the old city. In addition to the young British citizen who was killed in the attack, a    man and a pregnant woman were also injured, and are receiving treatment in hospital  —   the pregnant woman having been stabbed in the belly. Britain’s Sky News reports the comments of a spokesman of the Israeli security services Shin Bet agency, who said: “This is one of many instances where a Palestinian suffering personal strife  …     chooses to carry out an attack in order to find release for his problem. ” Terrorist who carried out knife attack is from Rasal amud in his 50s. Arrested by police at the scene. Woman in 20s in critical condition. pic. twitter.   —   Micky Rosenfeld (@MickyRosenfeld) April 14, 2017, Police photo of  weapon, Police commander Yoram Halevi said of the attacker that he had a history of sexual and domestic violence and was “very mentally unstable”. It is reported he had attempted to take his own life in the past, and that he is now being interrogated by police to establish his motives and to discover whether he has any accomplices.  '"}, "time": 1742563121.4588544}