{"duration": 0.07599091529846191, "input_args": {"text": "'Apparently, Tom Brady’s missing Super Bowl jersey nearly caused an international incident. [The   international manhunt that ensued after Brady’s jersey went missing eventually brought authorities to the home of Martin Mauricio Ortega, a Mexican journalist and tabloid newspaper boss who, as it turns out, not only had Brady’s jersey from this past Super Bowl but also had Brady’s jersey from Super Bowl XLIX and Von Miller’s helmet from Super Bowl L.  Though, as reported by Robert Klemko and Jenny Vrentas in the Monday Morning Quarterback, this case was about a lot more than a missing jersey. It also had the potential to hurt U. S.  relations. In fact, so concerned were U. S. authorities that they didn’t even want to ask the Mexican police for help. According to the MMQB, “American officials were also cognizant of the charged atmosphere. ‘We had [Ortega] identified —  that wasn’t the point,’ says a U. S. investigator who worked on the case. ‘It was now the point of walking that political minefield as delicately as we could to appease everybody. We didn’t want to upset the Mexican authorities, we didn’t want to upset the Mexican people, we didn’t want to upset the U. S. embassy. ’” Though Ortega was in possession of more than $500, 000 dollars of property stolen from American citizens in the U. S. the   on the part of U. S. law enforcement over making Mexican authorities “upset,” resulted in American officials only seeking the return of the stolen Super Bowl hardware, as opposed to pressing any charges against Ortega. From the MMQB: Dressed in his pajamas, his stunned wife looking on, Ortega was    with armed federal agents. According to a source in the Mexican government, a deal was presented: Hand over the Super Bowl jerseys and whatever else you’ve stolen, and you will sleep in your own bed not only tonight, but for the foreseeable future. Ortega fished a black trash bag out of a dresser drawer and gave it to the police, who took photos of the transaction to prove Ortega’s cooperation. Agents didn’t tear up the floorboards, toss cabinets or pull kitchen appliances from their wall connections. They didn’t even search the lower floor. They simply asked, Do you have anything else? He did. He made a phone call to a friend who arrived shortly thereafter. (Mexican police on the scene dubbed the physically stout newcomer Gordito, “little fat one. ”) The friend brought with him an     helmet with   scuff marks on the crown: Von Miller’s Super Bowl 50 helmet. The rest is history: Brady got his jersey back, American citizen and   Rob Gronkowski attempted to steal it again, we all had a laugh, and all’s well that ends well. However, if you were wondering why Donald Trump got elected president, it’s pretty well laid out for you here. Here you have a Mexican citizen, in this country as a guest, robbing two U. S. citizens of merchandise totaling more than $500, 000, and American law enforcement seem more concerned over “appeasing” Mexico than they are with securing justice for the Americans who got robbed. Of course, the FBI didn’t have to arrest Ortega for stealing jerseys and a helmet. If the only people we had to worry about crossing the border to commit crimes were Mexican sports memorabilia thieves, then the world would be a far better place. However, the attitude displayed by U. S. law enforcement here, the attitude which prioritizes niceties and appeasement of foreign countries and foreign people over and above justice for Americans citizens, seems to only rear its ugly head when law enforcement is investigating NFL memorabilia thieves and not when they’re investigating murders, drug trafficking, and kidnapping. The wall just got ten feet taller. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742563807.5009906}