{"duration": 0.09331226348876953, "input_args": {"text": "'13 Herbal Teas With Highest Antioxidants http://blogs.naturalnews.com/13-herbal-teas-highest-antioxidants/ \\nBy Twain Yobra \\nPosted Thursday, October 27, 2016 at 11:14am EDT \\nHerbal teas are known to benefit our health, weight, longevity, and happiness. And most of these benefits are experienced due to their antioxidant properties. Antioxidants control free radicals that are produced during oxidation in the body. \\nGetting antioxidants from teas will prevent damage of cells, and lower risk of cancer, diabetes and heart disease. Use the herbal teas below to get enough antioxidants. \\n1. Echinacea Tea \\nThis tea will boost your immune system. A study conducted on people with early signs of cold and flu found that there was faster recovery in those who drank tea with Echinacea, compared to those who didn’t. Studies also show that this herbal tea reduces risk of colds by 58 percent. \\n2. Matcha Green Tea \\nGreen tea is among the most consumed herbal teas in the world. But matcha green tea (from japan) is the healthiest. It has 17 times more antioxidants than blueberries. \\n3. Fennel tea \\nFennel tea can reduce bloating and gas. Research also shows that it can even reduce menstrual pain. \\n4. Lavender tea \\nThis herb can keep you calm and reduce anxiety. It can also treat insomnia, arthritis, body aches, and stomach problems. \\n5. Chamomile Tea \\nThis herb is popularly known for increasing calmness and improving quality of sleep. But it can also regulate blood sugar levels , and consequently lower risk of diabetes. In this study researchers found that chamomile lowered mortality risk by 29 percent. \\n6. Lemongrass Tea \\nThis tea can lower blood pressure, aid digestion, and reduce anxiety. It also has antibacterial and antifungal properties that will improve skin health and reduce risk of developing colds and flus. \\n7. Nettle tea \\nThis tea will get rid of toxins in the urinary tract. Additionally, nettle is rich in iron which means it will reduce risk of anemia. \\n8. Hibiscus tea \\nResearchers say that hibiscus tea can lower blood pressure and reduce pain in the respiratory tract. \\n9. Oolong tea \\nThis tea is made using the same plants used to make black or green teas. But it ages at a duration longer than green tea but shorter than black tea. Studies show it can enhance weight loss and lower cholesterol. \\n10. Thyme tea \\nThyme tea is rich in antioxidants which reduce pain in the stomach and throat. In fact, it’s an excellent pain reliever for most body aches. \\n11. Rooibos tea \\nRooibos can eliminate allergies, asthma and high blood pressure. You can greatly benefit from drinking 2-3 cups a day. \\n12. Peppermint tea \\nResearchers say that this tea can improve digestion. It has also been said to increase satiety and promote weight loss. \\n13. Rosemary tea \\nAccording to research , rosemary can boost brain performance. And it can also improve eye health. \\nFor more information on eating healthy and staying fit, download your FREE 3 Weeks Flat Stomach Guide to help you improve your health and physique. And like our Facebook page . You might also like…'"}, "time": 1742561836.8051708}