{"duration": 0.03182840347290039, "input_args": {"text": "'Home › HEALTH | US NEWS › CONTROVERSIAL NEW ‘ANTI-FAMINE’ GMO POTATO STRAINS APPROVED CONTROVERSIAL NEW ‘ANTI-FAMINE’ GMO POTATO STRAINS APPROVED 0 SHARES [11/3/16] The US Department of Agriculture has given its seal of approval to two new strains of genetically engineered potatoes. By using double stranded RNA, the potatoes have been engineered to resist the pathogen responsible for the Irish potato famine. \\nThere could be two new potatoes hitting the soil next spring after the US Food and Drug Administration (FDA) signed off on two more genetically modified potatoes from Simplot, an agribusiness based in Idaho, on Monday. \\nThe only obstacle for the new potatoes becoming available on the market is a voluntary review process from the FDA, much to the chagrin of GMO skeptics. \\nJeffrey Smith, founder of the Institute for Responsible Technology, expressed concern for not only the FDA’s voluntary testing program but for the genetic modifying process the potatoes have undergone, in an interview with RT. \\n“ It makes sense on paper, ” he said of the potatoes that are purported to be resistant to blight – the pathogen responsible for the Great Famine. However, one of the issues is that the effects of modified these genomes are largely unknown. \\n“ When we tamper with the genome in the way that they’ve been doing with genetic engineering in our food supply, you end up increasing allergens, toxins, new diseases or other problems – causes massive collateral damage in the DNA” he said. \\nBut blocking the blight is not the only selling point of these scientific spuds. In addition, they are meant to be engineered to prevent bruising and black spots, have a reduction of a chemical that creates carcinogens when cooked at high temperatures and also ship better. \\nHowever, all of these benefits could be a curse in disguise. The method used for engineering these potatoes is called double stranded (ds) RNA, meaning the genes of an organism have been reprogrammed or silenced. Post navigation'"}, "time": 1742564424.89822}