{"duration": 0.06291794776916504, "input_args": {"text": "'The news media has been reporting on plans by a coalition of activist groups to hold a massive   Tax March in Washington and at least 60 other locations on April 15. [Unreported by the news media is that most of the listed partners and support organizers of the march are openly financed by George Soros or have close links to Soros financing.  The website for the march, which is slated for the deadline for Americans to file their tax returns, claims that its mission is to get Trump to release his tax returns and more. The site relates: President Trump needs to be straight with the American people. To whom does he owe favors? Who are his policies really intended to benefit? Who will he put first? Working families are struggling to make ends meet, but we pay our fair share in taxes  —   does Donald Trump pay any at all? Organizers of the march claim to be “ordinary Americans, community organizers, advocates, and people from all walks of life and all backgrounds joining together to raise our voices and send a bold message to this administration. ” Leaders from January’s Women’s March coalition are reportedly helping to organize the Tax March, which USA Today described as a “sequel” to the massive women’s march. Buzzfeed took note of the comparison to the women’s march in a piece titled, “Progressives Want Tax Day To Be The Next Women’s March Protest. ” Soros reportedly has ties to more than 50 “partners” of that march. Also, this journalist first reported on the march leaders’ close associations with Soros. In a section titled “Who is organizing it?” the website for the Tax March lists the following eight groups, six of which are either funded by Soros or tied to Soros financing. The Tax March is grateful to have the support of the following organizations: American Federation of Teachers, Americans for Tax Fairness, Center for Popular Democracy, Indivisible Project, MoveOn. Org, Our Revolution, and The Working Families Party. Americans for Tax Fairness is the recipient of a grant from Soros’s Open Society Foundations’ U. S. Programs. MoveOn. Org is financed by Soros. The American Federation of Teachers’ Educational Foundation, the nonprofit arm of the American Federation of Teachers, was financed by the Strategic Opportunities Fund of Soros’s Open Society Foundations, leaked Open Society documents show. The Center for Popular Democracy is led by   activists. In 2013, Marbre Stahly, a policy advocate at the Center, became a Soros Justice Fellow, which comes with a stipend of $58, 700 to $110, 250 to fund   activism projects that last between   months. The Center was listed as Stahly’s “host” for the grant. According to her bio, the Center’s research analyst, Maggie Corser, “spent four years at the Open Society Foundations where she conducted research on the future of work, conservative political infrastructure, and a range of economic justice issue. ” Shawn Sebastian, the Center’s field director for its Fed Up Campaign, was a fellow at the so called   Unit of the Open Society Foundations’ Justice Initiative. Another Tax March organizer is the   Indivisible Project. Earlier this week, Breitbart News extensively reported that Indivisible leaders are openly associated with groups financed by Soros. Politico last week profiled Indivisible in an article titled, “Inside the protest movement that has Republicans reeling. ”  The news agency not only left out the Soros links, but failed to note that the organizations cited in its article as helping to amplify Indivisible’s message are either financed directly by Soros or have close ties to groups funded by the billionaire, as Breitbart News documented. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. With research by Joshua Klein.'"}, "time": 1742628302.5325644}