{"duration": 0.030800580978393555, "input_args": {"text": "'BREAKING : List of States Allowing you to CHANGE YOUR VOTE in Light of Hillary’s Federal Investigation BREAKING : List of States Allowing you to CHANGE YOUR VOTE in Light of Hillary’s Federal Investigation Breaking News By Amy Moreno October 29, 2016 On Friday the FBI announced they were reopening the email investigation into Hillary’s mishandling of classified information. In a statement, the FBI said that they discovered “new emails” pertinent to the earlier investigation on “several devices.” Reports indicate that one phone device belongs to Anthony Weiner and the other phone device belongs to his estranged wife Huma Abedin. Many Hillary supporters are clamoring to change their early votes, so the media has provided a list of states that allow you to change your early vote. Here’s a list of States that will allow early voters to change their early vote following the reopening of the FBI probe. #HillarysEmails pic.twitter.com/ggPZDmgBNw \\n— Jared Wyand \\uf1fa\\uf1f8 (@JaredWyand) October 29, 2016 \\nFor those who have yet to vote, please do not add to the corruption inside of government by voting for a sleazy woman under federal investigation. \\nShe has too much baggage. \\nOur country will spend all it’s energy on her issues and scandals and once again, get NOTHING done for the American people. Looks like a lot of Hillary voters are regretting their choice. \\uf602 #VoteTrump #TrumpPence16 pic.twitter.com/tIyGbOHJGl \\n— Neil Turner \\uf438 (@NeilTurner_) October 29, 2016 This is a movement – we are the political OUTSIDERS fighting against the FAILED GLOBAL ESTABLISHMENT! Join the resistance and help us fight to put America First! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742562032.4407136}