{"duration": 0.04794645309448242, "input_args": {"text": "'Email \\nWhen then-President Dwight Eisenhower signed into law the country’s motto “In God We Trust” on July 30, 1956, he stated, “In this way we are reaffirming the transcendence of religious faith in America’s heritage and future; in this way we shall constantly strengthen those spiritual weapons which forever will be our country’s most powerful resource in peace and war.” \\nLast week, the City Council of Chesapeake, Virginia, agreed with Eisenhower , unanimously voting to celebrate the motto’s 60th anniversary by putting up a plaque in the town’s city hall emblazoned with it. Suzy Kelly, the council member who sponsored and promoted the proposal, explained: “As our founders wrote in the Declaration of Independence, our inalienable rights come from our God, not our government. Displaying ‘In God We Trust’ in City Hall, or any government hall where elected officials enact legislation, makes perfect sense.” \\nThe phrase appears to have origins in the fourth stanza of “The Star-Spangled Banner”: O thus be it ever, when freemen shall stand Between their loved homes and the war\\'s desolation, Blest with vict\\'ry and peace, may the Heav\\'n-rescued land Praise the Pow\\'r that hath made and preserved us a nation. Then conquer we must when our cause it is just, And this be our motto: \"In God is our trust.\" And the Star-Spangled Banner in triumph doth wave O\\'er the land of the free and the home of the brave. \\n\"In God we trust\" also echoes the Bible: Psalm 118:8: “It is better to trust in the LORD than to put confidence in man.” Psalm 40:3: “He put a new song in my mouth, a hymn of praise to our God. Many will see and fear the LORD and put their trust in Him.” Proverbs 29.25: “Fear of many will prove to be a snare, but whoever trusts in the Lord is kept safe.” \\nOn the 50th anniversary of the adoption of the motto, the U.S. Senate reaffirmed it, while five years later the House passed a resolution reaffirming it as well, with just nine members opposed. \\nBut some disagree. In March, the board of commissioners in Saluda, North Carolina, voted unanimously not to display “In God We Trust” in its city hall, claiming that it would offend and “ostracize” some with non-Christian or secular beliefs. \\nAttorney and atheist Michael Newdow appears to have made a living bringing lawsuits challenging the motto, along with the words “under God” in the Pledge of Allegiance. Back in January, for instance, he filed one, claiming that the motto violates the “separation” of church and state and that his belief in nothing is “substantially burdened because he is forced to bear on his person [presumably, the paper currency he carries in his wallet with the offending phrase printed on it] a religious sentiment that causes him to sense his government legitimizing, promoting and reinforcing negative and injurious attitudes not only against Atheists in general, but against him personally.” \\nThe outcome of that lawsuit apparently is still pending, but if precedents hold, he will once again be out of luck. In 1970 Stefan Ray Aronow filed the first lawsuit against the motto, Aronow v. United States . The court ruled that Aronow didn’t have standing to sue but decided to address his complaint anyway. Wrote the Ninth Circuit Court of Appeals: It is quite obvious that the national motto and the slogan on coinage and currency “In God We Trust” have nothing whatsoever to do with the establishment of religion. Its use is of patriotic or ceremonial character and bears no true resemblance to a governmental sponsorship of a religious exercise. \\nThe Establishment Clause in the First Amendment — “Congress shall make no laws respecting an establishment of religion” — was successfully defended years earlier by the Supreme Court in 1952 in Zorach v. Clauson . Writing for the majority, Justice William Douglas stated: We are a religious people whose institutions presuppose a Supreme Being…. Prayers in our legislative halls; the appeals to the Almighty in the messages of the Chief Executive; the proclamation making Thanksgiving Day a holiday; \"So help me God\" in our courtroom oaths — these and ... other references to the Almighty ... run through our laws, our public rituals, our ceremonies ... [including] the supplication with which the Court opens each session: \"God save the United States and this Honorable Court.\" \\nSuzy Kelly and other members of the City Council of Chesapeake have been inundated with expressions of support for their decision. \"When I speak with people,\" said Kelly, \"they often indicate how they feel our country has turned away from its founding principles. This vote has given hope to many.\" \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742628607.972093}