{"duration": 0.047461509704589844, "input_args": {"text": "'TORONTO  —   A week ago, most Oscar prognosticators and strategists had effectively written off Harvey Weinstein as a player in this year’s awards race. His movie company, troubled by executive departures and   misfires, had neither the money nor the manpower needed to sustain an awards campaign, Hollywood conventional wisdom held. And Mr. Weinstein’s primary contender this time around, “Lion,” an adoption drama set in India and based on an astonishing true story, was generating virtually no tastemaker buzz. What a difference the Toronto International Film Festival can make. The festival, which runs until Sunday, has shaken up the coming film season in multiple ways. “Jackie,” starring Natalie Portman as President John F. Kennedy’s traumatized widow, was thrust into the Oscar conversation on Tuesday, when Fox Searchlight  —   perhaps hedging its bet on “The Birth of a Nation,” now surrounded by controversy  —   bought the film after its screening here. The studio plans to release “Jackie” on Dec. 9. Footage from “Hidden Figures,” about black female mathematicians who helped NASA put Americans on the moon, made a boisterous debut. “Sing,” a coming animated movie about a   vocal competition, may have elbowed its way into the race for best   cartoon, an unusually competitive category this year. But few used the festival to better advantage than Mr. Weinstein, who is credited with inventing and perfecting the modern awards game, even if his Oscar entrant last season, “Carol,” came up short. “Lion,” which stars Dev Patel, Nicole Kidman and Rooney Mara, had its premiere here on Saturday  —   most major films, including “Jackie,” had already been seen elsewhere  —   and generated a stream of euphoric responses from entertainment reporters and some critics. “Harvey’s baaack,” Scott Feinberg, a longtime Academy Awards handicapper for The Hollywood Reporter, said on Twitter. In a subsequent article analyzing “Lion,” Mr. Feinberg wrote, “The nature of its story and reception suggests, to me, that embattled Harvey is headed back to the place where he’s most at home: the Oscars. ” “Lion” is based on Saroo Brierley’s   memoir (with Larry Buttrose) recounting his days on the streets as a boy, adoption and eventual quest to find his birth mother. Pundits are not critics, of course, and   from trade publications were mixed. Some saw a     crowd pleaser in “Lion,” which is set for release on Nov. 25 and directed by Garth Davis in his   debut. (Until now, Mr. Davis has been primarily known for commercials, including “Ninja Kittens” for Toyota.) But a few other critics were underwhelmed, with Peter Debruge of Variety especially cutting. Mr. Weinstein was not available for an interview, according to David Glasser, the Weinstein Company’s president and chief operating officer. For his part, Mr. Glasser, speaking by telephone on Monday night, said that his studio made a strategic decision to keep as much of a lid on “Lion” as possible ahead of the Toronto event. “Bring it in, and let the audience discover it  —   that was the goal,” Mr. Glasser said. “We’re thrilled that people responded so favorably. ” But a nagging question remains: Does the Weinstein Company have the resources required to make a real splash for “Lion” on the awards circuit? Oscar campaigns can cost millions of dollars. Although the studio found various levels of success last year with “Southpaw” and “Woman in Gold,” recent releases like “Hands of Stone,” a boxing drama, and the period musical “Sing Street” have failed to connect with ticket buyers. In July, the company rescheduled two releases virtually at the last minute, prompting speculation about its financial health. Executive departures have also raised eyebrows in Hollywood. Mr. Glasser grew indignant when asked whether the Weinstein Company could afford to mount a   awards campaign for “Lion. ” “It’s the most ridiculous comment I’ve ever heard,” he said. “Do we have the wherewithal? Yes. Absolutely. Unconditionally. ” Along with “Lion,” the Weinstein Company is gearing up for the    releases of “The Founder,” about Ray Kroc (Michael Keaton) and his creation of the McDonald’s   empire, and “Gold,” starring Matthew McConaughey as a prospector who runs into trouble in the jungles of Borneo. But “Lion” is the studio’s primary hope for an   hit. While it faces obstacles at the box office  —   a large portion of the film, for instance, is in Bengali with English subtitles  —   Mr. Glasser said he was confident that a strong campaign and positive word of mouth would help “Lion” strike a chord with ticket buyers, not to mention awards voters. (“Lion” comes from a producing team that includes Iain Canning and Emile Sherman, two of the forces behind “The King’s Speech,” which won best picture for Mr. Weinstein and his brother, Bob, at the 2011 Academy Awards.) And the Weinsteins may well have another “Lion” trick or two up their sleeves. Expect them, for instance, to connect the film to philanthropic efforts to help young Indian orphans. “Not only is this an amazing true story,” Mr. Glasser said, “but it also brings attention to an incredibly relevant social cause. ”'"}, "time": 1742628470.5689547}