{"duration": 0.21366357803344727, "input_args": {"text": "'HOUSTON  —   A federal appeals court on Wednesday ruled that Texas’ voter identification law, one of the strictest in the country, violated the Voting Rights Act and that the state must find ways to accommodate voters who face hardships in obtaining the necessary documents. Democrats and voting rights advocates hailed the ruling as a significant victory in one of the nation’s most closely watched voting rights cases. It was the fourth time in nearly four years that a federal court found that the Texas law discriminated against or disproportionately affected black and Hispanic voters. “The court got it right, recognizing the stink of discrimination,” said Trey Martinez Fischer, a state representative who is the chairman of the   Legislative Caucus, one of several minority groups, voters and Democratic lawmakers who sued Texas over the law. The United States Court of Appeals for the Fifth Circuit, in New Orleans, found that the law had a discriminatory effect on blacks and Latinos, who often lack the forms of identification required under the Texas law. But the ruling did not strike down the law entirely, ruling instead that new procedures must be found to assist potential voters lacking the required identification. The ruling also sent back for reconsideration the question of whether Texas legislators had acted with a discriminatory purpose in passing the law in 2011, a finding that would have forced new judicial oversight of any changes in Texas election rules. Gov. Greg Abbott, a Republican who defended the voter ID law against legal challenges when he was the state’s attorney general, said the court had come to the wrong conclusion. Republican lawmakers have long defended the law, saying it is needed to prevent voter fraud. “Voter fraud is real, and it undermines the integrity of the election process,” Mr. Abbott said in a statement. “Texas will continue to make sure there is no illegal voting at the ballot box. ” Passed by the   Legislature and signed by Gov. Rick Perry in 2011, the law took effect in 2013. It requires voters to present one of several forms of   identification, including a driver’s license, passport, military ID card or   license. A lower court judge found that about 608, 000 registered voters in Texas lacked the types of identification required by the law, and that a disproportionate number were black or Hispanic. The judge based that finding on testimony and data presented by experts during a 2014 trial in Corpus Christi. Texas’ lawyers disputed that figure. In its ruling, the Fifth Circuit asked a lower court judge to come up with a remedy that “disrupts voter identification rules for the 2016 election season as little as possible, yet eliminates” the law’s discriminatory effect on minority voters. One possible solution, the court noted, would be to allow   cards to be used as identification. The court also instructed the judge to   the evidence about whether the Texas Legislature intentionally discriminated against blacks and Hispanics, but encouraged the judge to wait until after the November election. The Texas attorney general, Ken Paxton, said in a statement that the state had a duty to safeguard elections. “Preventing voter fraud is essential to accurately reflecting the will of Texas voters during elections, and it is unfortunate that this   law, providing protections against fraud, was not upheld in its entirety,” Mr. Paxton said. Asked if the state would appeal the decision to the Supreme Court, a spokeswoman for Mr. Paxton, Kayleigh Lovvorn, replied, “We are evaluating all of our options right now. ” Richard L. Hasen, a law professor at the University of California, Irvine, called the decision on Wednesday “huge in a symbolic way” for voting rights across the country. Since the Supreme Court weakened the federal Voting Rights Act in 2013, he noted, several states have been “ratcheting up” their voter ID requirements. What the Fifth Circuit  —   known as perhaps the country’s most conservative appeals court  —   has ruled is that “you can go too far with a voter ID law,” he said. “If Texas had been allowed to do what it’s been trying to do, that would be a green light for other states to try something similar,” Professor Hasen said. But he added that the plaintiffs’ victory was not as great as it would have been if the court had struck down the law. Myrna Pérez, the deputy director of the democracy program at the Brennan Center for Justice at New York University, which helped argue the plaintiffs’ case, called the ruling a “big victory. ” “The court said the law is discriminatory and needs to be fixed,’’ she said.'"}, "time": 1742564609.942218}