{"duration": 0.03723502159118652, "input_args": {"text": "'BEIJING  —   President Trump may not be known for his diplomacy, but someone in his family appears to be picking up the slack. That would be Arabella, his    granddaughter. A video of her singing “Happy New Year” in Chinese has gone viral on social media in China. Arabella has been taking Chinese lessons. Arabella’s mother, Ivanka Trump, posted the song on her Instagram account on Thursday. “Arabella singing a song she learned for #ChineseNewYear. Wishing everyone an amazing year to come during these days of celebration,” Ms. Trump wrote on her account. Arabella appeared in a black cardigan with ornate pockets and skinny black pants, and she played with a Chinese marionette as she sang. On Weibo, China’s version of Twitter, more than 60, 000 people said they liked Arabella’s song. Some of them said they much preferred her to Mr. Trump, who has stirred the   relationship over Taiwan and the South China Sea, among other things. “The granddaughter is much more sensible,” said one. Another Weibo user noted, “Her Mandarin is perfect. ” Some people were more critical: “So you want to get the Chinese off your back with just this song?” However, this was not Arabella’s first diplomatic coup this week. On Wednesday evening, she and her mother turned up at a New Year’s reception at the Chinese Embassy in Washington. A beaming Chinese ambassador, Cui Tiankai, escorted the pair around the party, as Arabella, decked out in red dress with a big bow at her neck, played with Chinese traditional arts that were on display. China’s official broadcaster, CCTV, showed the    team at the reception on its   news broadcast on Thursday. The usually stern   newspaper Global Times almost gushed. “Her appearance at the Chinese Embassy, endowed with a certain political and diplomatic significance, could be invigorating to the  . S. relationship,” the paper said of Ms. Trump’s embassy visit, with Arabella in tow.'"}, "time": 1742562309.628216}