{"duration": 0.18197846412658691, "input_args": {"text": "'Half a century ago, Bob Dylan shocked the music world by plugging in an electric guitar and alienating folk purists. For decades he continued to confound expectations, selling millions of records with dense, enigmatic songwriting. Now, Mr. Dylan, the poet laureate of the rock era, has been rewarded with the Nobel Prize in Literature, an honor that elevates him into the company of T. S. Eliot, Gabriel García Márquez, Toni Morrison and Samuel Beckett. Mr. Dylan, 75, is the first musician to win the award, and his selection on Thursday is perhaps the most radical choice in a history stretching back to 1901. In choosing a popular musician for the literary world’s highest honor, the Swedish Academy, which awards the prize, dramatically redefined the boundaries of literature, setting off a debate about whether song lyrics have the same artistic value as poetry or novels. [ Our pop critic on Bob Dylan, the musician | Our book critic on Dylan, the writer ] Some prominent writers celebrated Mr. Dylan’s literary achievements, including Stephen King, Joyce Carol Oates and Salman Rushdie, who called Mr. Dylan “the brilliant inheritor of the bardic tradition,” adding, “Great choice. ” But others called the academy’s decision misguided and questioned whether songwriting, however brilliant, rises to the level of literature. “Bob Dylan winning a Nobel in Literature is like Mrs Fields being awarded 3 Michelin stars,” the novelist Rabih Alameddine wrote on Twitter. “This is almost as silly as Winston Churchill. ” Jodi Picoult, a   novelist, snarkily asked, “I’m happy for Bob Dylan, #ButDoesThisMeanICanWinAGrammy?” Many musicians praised the choice with a kind of awe. On Twitter, Rosanne Cash, the songwriter and daughter of Johnny Cash, wrote simply: “Holy mother of god. Bob Dylan wins the Nobel Prize. ” But some commentators bristled. Two   websites, Pitchfork and Vice, both ran columns questioning whether Mr. Dylan was an appropriate choice for the Nobel. As the writer of classic folk and protest songs like “Blowin’ in the Wind” and “The Times They Are  ’,” as well as Top 10 hits including “Like a Rolling Stone,” Mr. Dylan is an unusual Nobel winner. The first American to win the prize since Ms. Morrison in 1993, he is studied by Oxford dons and beloved by presidents. Yet instead of appearing at the standard staid news conference arranged by a publisher, Mr. Dylan was in Las Vegas on Thursday for a performance at a theater there. By late afternoon, Mr. Dylan had not commented on the honor. Mr. Dylan has often sprinkled literary allusions into his music and cited the influence of poetry on his lyrics, and has referenced Arthur Rimbaud, Paul Verlaine and Ezra Pound. He has also published poetry and prose, including his 1971 collection, “Tarantula,” and “Chronicles: Volume One,” a memoir published in 2004. His collected lyrics from   are due out on Nov. 1 from Simon  Schuster. Literary scholars have long debated whether Mr. Dylan’s lyrics can stand on their own as poetry, and an astonishing volume of academic work has been devoted to parsing his music. The Oxford Book of American Poetry included his song “Desolation Row,” in its 2006 edition, and Cambridge University Press released “The Cambridge Companion to Bob Dylan” in 2009, further cementing his reputation as a brilliant literary stylist. Billy Collins, the former United States poet laureate, argued that Mr. Dylan deserved to be recognized not merely as a songwriter, but as a poet. “Most song lyrics don’t really hold up without the music, and they aren’t supposed to,” Mr. Collins said in an interview. “Bob Dylan is in the 2 percent club of songwriters whose lyrics are interesting on the page even without the harmonica and the guitar and his very distinctive voice. I think he does qualify as poetry. ” In giving the literature prize to Mr. Dylan, the academy may also be recognizing that the gap has closed between high art and more commercial creative forms. “It’s literature, but it’s music, it’s performance, it’s art, it’s also highly commercial,” said David Hajdu, a music critic for The Nation who has written extensively about Mr. Dylan and his contemporaries. “The old categories of high and low art, they’ve been collapsing for a long time, but this is it being made official. ” In previous years, writers and publishers have grumbled that the prize often goes to obscure writers with clear political messages over more popular figures. But in choosing someone so well known, and so far outside of established literary traditions, the academy seems to have swung far into the other direction, bestowing prestige on a popular artist who already had plenty of it. It’s not the first time it has stretched the definition of literature. In 1953, Winston Churchill received the prize, in part as recognition of the literary qualities of his soaring political speeches and “brilliant oratory in defending exalted human values,” according to the academy. And many were surprised last year, when the prize went to the Belarussian journalist Svetlana Alexievich, whose deeply reported narratives draw on oral history. In its citation, the Swedish Academy credited Mr. Dylan with “having created new poetic expressions within the great American song tradition. ” Sara Danius, a literary scholar and the permanent secretary of the   academy, which called Mr. Dylan “a great poet in the   tradition” and compared him to Homer and Sappho, whose work was delivered orally. Asked if the decision to award the prize to a musician signaled a broadening in the definition of literature, Ms. Danius responded, “The times they are   perhaps. ” Mr. Dylan, whose original name is Robert Allen Zimmerman, was born on May 24, 1941, in Duluth, Minn. He emerged on the New York music scene in 1961 as an artist in the tradition of Woody Guthrie, singing protest songs and strumming an acoustic guitar in clubs and cafes in Greenwich Village. But from the start, Mr. Dylan stood out for dazzling lyrics and an oblique songwriting style that made him a source of fascination for artists and critics. In 1963, the folk group Peter, Paul and Mary reached No. 2 on the Billboard pop chart with a version of “Blowin’ in the Wind,” whose ambiguous refrains evoked Ecclesiastes. Within a few years, Mr. Dylan was confounding the very notion of folk music, with ever more complex songs and moves toward a more rock ’n’ roll sound. In 1965, he played with an electric rock band at the Newport Folk Festival, provoking a backlash from fans who accused him of selling out. After reports of a motorcycle accident in 1966 near his home in Woodstock, N. Y. Mr. Dylan withdrew further from public life but remained intensely fertile as a songwriter. His voluminous archives, showing his working process through thousands of pages of songwriting drafts, were acquired this year by institutions in Tulsa, Okla. His 1975 album “Blood on the Tracks” was interpreted as a supremely powerful account of the breakdown of a relationship, but just four years later the Christian themes of “Slow Train Coming” divided critics. His most recent two albums were chestnuts of traditional pop that had been associated with Frank Sinatra. Since 1988, Mr. Dylan has toured almost constantly, inspiring an unofficial name for his itinerary, the Never Ending Tour. Last weekend, he played the first of two performances at Desert Trip, a festival in Indio, Calif. that also featured the Rolling Stones, Paul McCartney and other stars of the 1960s. He is scheduled to return on Friday for the festival’s second weekend. “As the ’60s wore on,” Giles Harvey wrote in The New York Review of Books in 2010, “Dylan grew increasingly frustrated with what he came to regard as the pious sloganeering and doctrinaire leftist politics of the folk milieu. ” He “began writing a kind of visionary nonsense verse, in which the rough, ribald, lawless America of the country’s traditional folk music collided with a surreal ensemble of characters from history, literature, legend, the Bible, and many other places besides. ” Mr. Dylan’s many albums, which the Swedish Academy described as having “a tremendous impact on popular music,” include “Bringing It All Back Home” and “Highway 61 Revisited” (1965) “Blonde on Blonde” (1966) “Blood on the Tracks” (1975) “Oh Mercy” (1989) “Time Out Of Mind” (1997) “‘Love and Theft’” (2001) and “Modern Times” (2006). His 38 studio albums have sold 125 million copies around the world. The academy added: “Dylan has the status of an icon. His influence on contemporary music is profound, and he is the object of a steady stream of secondary literature. ” Mr. Dylan’s many honors include Grammy, Academy and Golden Globe awards. He was inducted into the Rock and Roll Hall of Fame in 1988, won a special Pulitzer Prize in 2008 and was awarded the Presidential Medal of Freedom in 2012. The Nobel comes with a prize of 8 million Swedish kronor, or just over $900, 000. The literature prize is given for a lifetime of writing rather than for a single work. “Today, everybody from Bruce Springsteen to U2 owes Bob a debt of gratitude,” President Obama said at the medal ceremony. “There is not a bigger giant in the history of American music. All these years later, he’s still chasing that sound, still searching for a little bit of truth. And I have to say that I am a really big fan. ” ■ Yoshinori Ohsumi, a Japanese cell biologist, was awarded the Nobel Prize in Physiology or Medicine on Oct. 3 for his discoveries on how cells recycle their content, a process known as autophagy, a Greek term for “ . ” ■ David J. Thouless, F. Duncan M. Haldane and J. Michael Kosterlitz shared the Nobel Prize in Physics on Oct. 4 for their research into the bizarre properties of matter in extreme states. ■   Sauvage, J. Fraser Stoddart and Bernard L. Feringa shared the Nobel Prize in Chemistry on Oct. 5 for development of molecular machines, the world’s smallest mechanical devices. ■ President Juan Manuel Santos of Colombia was awarded the Nobel Peace Prize on Friday for pursuing a deal to end 52 years of conflict with the Revolutionary Armed Forces of Colombia, or FARC, the   war in the Americas. ■ Oliver Hart and Bengt Holmstrom were awarded the Nobel Memorial Prize in Economic Science on Monday for their work on improving the design of contracts, the deals that bind together employers and their workers, or companies and their customers.'"}, "time": 1742564542.0836685}