{"duration": 0.1785874366760254, "input_args": {"text": "'The unraveling of Hillary\\'s corrupt sphere of influence. November 4, 2016 Michael Cutler \\nThe 2016 elections are in the final stretch and were shaken to the core by the latest revelations from FBI Director James Comey on Friday, October 28, 2016 as reported by NBC News on October 30 th , “ FBI Obtains Warrant for Newly Discovered Emails in Clinton Probe — as Reid Accuses Comey of Hatch Act Violation .” Once again the Clinton scandal is creating turmoil in a presidential election that has gone way beyond “unconventional.” Indeed, Tom Clancy could not have scripted this year\\'s presidential election and intrigues. \\nWhile Comey\\'s recent remarks regarding the Clinton investigation have been extremely vague, the issue to focus on is how Hillary\\'s use of a private computer server, private e-mail account and non-secure digital devices to store, send and receive classified materials may have drawn others into her tangled web of deception. \\nThe current focus of the Clinton quagmire is on whether or not the laptop computer shared by Weiner and his estranged wife contains sensitive information. If that laptop had been hacked both Weiner and Abedin could have been vulnerable to blackmail. This was an issue raised by Congressman Louie Gohmert, Texan Republican and former judge in a Fox News Business interview on October 31, 2016 in a segment that was posted under the title, “ Rep. Gohmert: Clinton is a potential victim of blackmail .” \\nAdditional individuals may also have been drawn into this web of deception through these e-mails as well. A chain is as strong as its weakest link. The weak links begin with Hillary Clinton and Huma Abedin and may now include Anthony Weiner and perhaps others. Meanwhile, there is no way to yet determine how many other weak links are “out there” petrified that WikiLeaks or perhaps, a hacker may yet disclose their improper dealings with the Clintons or their foundation. \\nCould not these additional individuals be subject to blackmail as well? \\nLet\\'s take a moment to understand how all of this began. \\nJust months earlier Hillary Clinton had been let off the hook by an FBI Director who, in his official statement on July 5, 2016 , included this excerpt: To be clear, this is not to suggest that in similar circumstances, a person who engaged in this activity would face no consequences. To the contrary, those individuals are often subject to security or administrative sanctions. But that is not what we are deciding now. \\nBy Comey\\'s own words, anyone else might have had their security clearance lifted permanently. This raises the issue about such an individual demonstrating fitness for duty as president and raises the question as to why Comey did not see fit to take comparable action with Ms Clinton. \\nComey\\'s ultimate decision to not present the case to a Grand Jury was frustrating to those who have had security clearances and fully understand just how profound an impact these transgressions might have on national security. \\nHowever, perhaps Comey\\'s hard to comprehend decision can be traced to a meeting between Bill Clinton and Attorney General Loretta Lynch less than one week before the FBI Director conducted that press conference. On June 29, 2015 ABC News-15 reported, “ US Attorney General Loretta Lynch, Bill Clinton meet privately in Phoenix before Benghazi report .” \\nThat article served as a predication for my article, “ Loretta Lynch\\'s Private Meeting With Bill Clinton Prior to Release of Benghazi Report : Why would the Attorney General, who sets the tone for law enforcement, do this?” \\nAs Attorney General, Lynch is FBI Director Comey\\'s boss. \\nAt the time of this meeting the Justice Department was not only investigating Hillary\\'s illegal use of a private e-mail server, non-secure personal digital devices but was also, conducting an investigation into the Clinton Foundation. \\nIn fact, on October 30, 2016 Breitbart reported, “ Clinton Foundation FBI Investigation Confirmed By Former Assistant FBI Director .” Therefore Bill Clinton, was likely the target of an ongoing criminal investigation yet he had a totally inappropriate private meeting with the Attorney General to supposedly discuss golfing and grandchildren. \\nHowever, just days after that meeting, news organizations reported that Hillary was contemplating keeping Lynch on as Attorney General if she won the election. \\nOn July 4, 2016 Newsmax reported, “ NY Times: Clinton Weighs Keeping Lynch as Attorney General if She Wins .” Hillary\\'s statement that she might keep Lynch on as Attorney General could have provided the incentive for Lynch to “Go along to get along.” \\nIndeed, Lynch did precisely that during her confirmation hearing as I described in my commentary, “ Loretta Lynch: Same as the Old Boss : The Attorney General nominee\\'s disturbing views on U.S. immigration law.” \\nMy article included an excerpt from a Yahoo/AP news report, \"Attorney General nominee defends Obama immigration changes.\" Here is the exchange in which Lynch discussed the administration\\'s immigration\\'s policies: Lynch said she had no involvement in drafting the measures but called them \"a reasonable way to marshal limited resources to deal with the problem\" of illegal immigration. She said the Homeland Security Department was focusing on removals of \"the most dangerous of the undocumented immigrants among us.\" Pressed by Sen. Jeff Sessions of Alabama, a leading immigration hard-liner, she said citizenship was not a right for people in the country illegally but rather a privilege that must be earned. However, when Sessions asked whether individuals in the country legally or those who are here unlawfully have more of a right to a job, Lynch replied, \"The right and the obligation to work is one that\\'s shared by everyone in this country regardless of how they came here.\" Sessions quickly issued a news release to highlight that response. Under later questioning by Democratic Sen. Chuck Schumer of New York, Lynch clarified it, stating there is no right to work for an immigrant who has no lawful status. \\nThis was disturbing and telling, clearly Ms Lynch\\'s views on immigration and likely, therefore on other issues are malleable and subject to revision if modifying her position is consistent with her personal goals. \\nAs Attorney General Lynch directs the operations of the entire Justice Department and all those who work for that department. Ms. Lynch must understand true democracy can only exist when justice is blind and totally objective. \\nHowever, Lynch and the others who have fallen under Hillary Clinton\\'s corrupt sphere of influence are trapped in Hillary\\'s web of deception, having fallen victim to the Hillary Virus. Throughout Clinton\\'s many decades in American politics, this highly contagious and virulent malady has proven to be virtually ineradicable. It is not likely to change no matter the outcome of the next election.'"}, "time": 1742564579.789247}