{"duration": 0.029999971389770508, "input_args": {"text": "'“This godless shrieking malcontent… This walking cadaver.” – Huma Abedin describing Hillary \\nSeptember 03, 2016 at 8:57 pm. Huma Abedin @ yahoo.Com wrote: \\nSorry for my late reply, Hassan. Yes, let me tell you about her. The woman is so odd, so starved for validation, so tormented and vain it is a constant surprise to me that anyone takes her seriously. \\nEveryone on the team knows how unwell she is, but they’re more determined than ever to see her win. This woman that has a dozen seizures a day. This godless shrieking malcontent passed out in her medical van. This walking cadaver. She’s nonfunctional. \\nHassan, nobody cares. We sober her up for speeches and indulge the press corps with cheap sentiment. The first female president. The last glass ceiling, etc. They trip over themselves lining up behind her. \\nSurely they know it is not her they’re getting. It’s the one in the corner, the quiet helper, your sister Huma. \\nYou asked me once how I did it. How did I take the castle? Hassan, I didn’t take it, they gave it to me. Yes, there was a cost. I will admit, subjecting myself to AW (Anthony Weiner) and WJC (William Jefferson Clinton) is mortal torture. But I do it gladly, brother, everything they ask of me, however sick and depraved. I do it, and I smile, rejoicing at the thought of whose glory I serve.” \\n“…whose glory I serve.” Folks, she’s not talking about serving the living God. She’s serving Alah, AKA the devil. Huma is revealing her motives, her long game, in her service to Hillary Clinton. She is crawling into power to hand us over to islam. \\nA friend who is deeply connected and has followed Huma closely for a number of years told me this morning that Huma is slated for a very powerful position in our government if Hillary wins. This makes sense when considering the Appointments Obama made during his presidency. \\n♞'"}, "time": 1742564510.5958097}