{"duration": 0.02401566505432129, "input_args": {"text": "'Topless, feminist activists have overrun the unveiling of a wax statue of   Donald J. Trump in Spain, screaming “grab patriarchy by the balls”. [The protestors, from the infamous Ukrainian group FEMEN, grabbed the statue in the crotch area at the event at the Wax Museum of Madrid on Tuesday.  The activist group claimed responsibility for the protest on Twitter, saying: “FEMEN just grabbed Trump’s statue by the balls in Madrid. ” According to Reuters, Museum staff spent several minutes trying to restrain the woman before eventually bundling her out through a back door. FEMEN describes their “ideology” as “Sextremism” “Atheism” and “Feminism” and have become renowned for holding provocative topless protests in churches and other places. Their “objectives” include “provok[ing] patriarchy into open conflict by forcing it to disclose its aggressive antihuman nature to fully discredit it in the eyes of history” and “promot[ing] new revolutionary female sexuality as opposed to the patriarchal erotic and pornography. Gonzalo Presa, head of communications at the museum, called the woman’s protest “unpleasant” and said he had hoped to give a “special welcome” to Donald Trump from Madrid. “If they want to do this they should do it directly to him. This is too easy,” he told a Reuters reporter. Explaining their “ideology” the group claim on their website: “Sextremism is female sexuality rebelling against patriarchy and embodied in the extremal political direct action events. “Sexist style of the actions is a way to destruct the patriarchal understanding of what is the destination of female sexuality to the benefit of the great revolutionary mission. “Extremal nature of sextremism demonstrates intellectual, psychological and physical superiority of female activists from FEMEN over the bandogs of patriarchy. “Unsanctioned format of the sextremism events represents the historical right of the woman to make her protest anywhere at any time and not to concert her action with the patriarchal   structures. “Sextremism is the woman’s mockery of vulgar male extremism and its bloody mayhems and a cult of terror. “Sextremism is a   but highly aggressive form of provocation it is an   demoralizing weapon undermining the foundations of the old political ethics and rotten patriarchal culture. ”'"}, "time": 1742628525.673074}