{"duration": 0.021851539611816406, "input_args": {"text": "'November 12, 2016 \\nHistorians were undertaking a frantic reassessment of the contribution of Mark Twain yesterday, after the surprise discovery of a box of jottings by the famous American author, known for his sparkling epigrams. The box, containing notes from his early life in Missouri was uncovered during a spring clean of the Twain family home in Connecticut, now a working museum dedicated to the literary legend. On one note, Twain wrote that ‘golf is a good wank spoiled’, casting considerable doubt on the commonly held view that he was comparing the sport unfavourably to a walk in the park. \\n‘Twain was a prodigious masturbator as a teenager, that much we know from published memoirs, and the extensive porn collection found under his mattress,’ indicated Cecile De Mornay, Professor of American Literature at Oxford University. ‘These new notes reveal much about the state of his mind – and his trousers – during his formative years. As he entered adolescence, it seems he struggled to find much privacy in the family home, so he would often sneak off to the local golf club to snap one out.’ \\n‘The local toilets at the club provided him with a nice quiet space for him to bash his bishop,’ continued De Mornay. ‘Frustratingly for him, sometimes, other members of the golf club would spot him before he reached the toilets, and, understandably, they would invite him to join them for 18 holes, thus spoiling his regular bouts of self-discovery. A round of fourballs, rather than his preference for a solitary game with two balls and a wood, if you like.’ \\nExperts suggest that this discovery will not be a long term stain on Twain’s reputation, although the impact on his bedsheets is a different matter. ‘Twain’s place in the spotlight will come again’, concluded De Mornay confidently. ‘Although, with this new discovery, it is actually his come that is being placed under the spotlight.’ Share this story... \\nPosted: Nov 12th, 2016 by chrisf Click for more article by chrisf .. More Stories about: Arts/Entertainment'"}, "time": 1742564168.368522}