{"duration": 0.08223795890808105, "input_args": {"text": "'WASHINGTON  —   Since President Obama named James B. Comey director of the F. B. I. in 2013, the    former prosecutor has spoken often of dark chapters in the bureau’s history, notably J. Edgar Hoover’s order to wiretap the Rev. Dr. Martin Luther King Jr. and use the tapes to try to drive the civil rights leader to suicide. “The reason I do those things,” Mr. Comey said in a talk at Georgetown University last year, “is to ensure that we remember our mistakes and that we learn from them. ” His point: The nation’s leading law enforcement agency must preserve investigations from any taint of political motive or extralegal influence. So it may be especially painful to Mr. Comey that today, after his second sensational public statement on the F. B. I. ’s investigation of Hillary Clinton’s email, some critics and historians are comparing him to Hoover. “I think this is sort of a flashback to the days of J. Edgar Hoover,” said Sanford J. Ungar, a Georgetown scholar, former journalist and author who has written about the F. B. I. ’s history. “I don’t mean to smear Comey, and it may be an unfair comparison. But Hoover would weigh in on issues without warning or expectation. I just wonder how Comey sees his role. ” The parallels to Hoover, who ran the F. B. I. and its predecessor from 1924 to 1972 as a fief that reflected his personal and political views, may be quite a stretch. People who know Mr. Comey well dismiss out of hand the notion that he acted to tip the election to either Mrs. Clinton or Donald J. Trump. If he is guilty of anything, they say, it may be a sort of moral hubris, a desire to put his rectitude and incorruptibility on public display. After all, Mr. Comey first came to wide public attention for his role in a 2004 drama at the hospital bedside of John Ashcroft, then the attorney general. Acting in place of the ailing Mr. Ashcroft, Mr. Comey had refused to sign off on the reauthorization of National Security Agency surveillance programs that he believed were legally flawed. When he heard two top aides to President George W. Bush planned to have Mr. Ashcroft sign the reauthorization, Mr. Comey sped to the hospital to head them off. It was a rare Washington drama that has often been recounted, usually with Mr. Comey as the heroic agent of justice. But before Mr. Comey, Hoover was the last F. B. I. director to be accused  —   at least by some historians  —   of trying to influence a presidential election, by feeding useful scraps of information on Harry S. Truman, a Democrat, to the campaign of Thomas E. Dewey, a Republican. To his critics, Mr. Comey has twice flagrantly violated the longstanding norms of law enforcement, politicizing the F. B. I. by injecting it into a   election. His defenders say the controversy may simply show the difficulty of running a law enforcement organization as a purely professional, apolitical endeavor in an election year awash in political passions, suspicions and accusations. (Just ask Loretta E. Lynch, Mr. Comey’s boss as attorney general, who said after an airport encounter with former President Bill Clinton that drew Republican criticism that she would accept whatever the F. B. I. recommended on the Clinton email inquiry.) Several F. B. I. directors have found themselves tangled in politicized disputes  —   Louis J. Freeh, the director from 1993 to 2001, had a contentious relationship with Mr. Clinton. But in the Hoover years, the bureau was a deeply political instrument. Hoover’s personal crusade against communists, real and imagined, his targeting of antiwar and civil rights activists, and his use of F. B. I. files to pressure or blackmail other officials  —   sometimes including presidents  —   defined the bureau for decades. “The bureau played a very important role behind the scenes in shaping American politics during the Cold War,” said Athan G. Theoharis, a professor emeritus at Marquette University and a historian of the F. B. I. “When you have a secret agency that uses its huge resources to influence politics, that’s a dangerous thing. ” The actions that have put Mr. Comey in the spotlight, however unusual, are starkly different from Hoover’s secret maneuverings. Indeed, it may be his determination to be the   transparent and above politics, that has gotten Mr. Comey in hot water, first with Republicans and now with Democrats. Unlike Hoover’s clandestine efforts for Dewey in the 1948 campaign, Mr. Comey’s actions have been very public and directly related to legitimate F. B. I. business. In July, at a news conference that some former prosecutors now characterize as a mistake, he announced that Mrs. Clinton would not be charged in connection with her use of a private email server, but added that he believed her conduct was “extremely careless. ” On Friday, he announced that agents had found additional emails that might be relevant to the investigation, raising the possibility that Mrs. Clinton’s exoneration had been premature. While Hoover acted to further the fortunes of one candidate, Mr. Comey has been accused, at different times, of seeking to help both sides. Overnight, the F. B. I. director went from being vilified by supporters of Mr. Trump for covering up Mrs. Clinton’s supposed wrongdoing, to coming under attack from backers of Mrs. Clinton for what they said was his improperly handing political ammunition to Mr. Trump. As F. B. I. director, Mr. Comey was faced with a rare phenomenon: a criminal investigation of a leading candidate for president. He responded in July with a rare display of openness about an investigation, saying, “I am going to include more detail about our process than I ordinarily would, because I think the American people deserve those details in a case of intense public interest. ” He even testified to Congress in September about the inquiry and was grilled by Republicans. Pressed by Representative Lamar Smith, Republican of Texas, Mr. Comey offered a seemingly obvious promise: “We would certainly look at any new and substantial information. ” Then an unrelated investigation of Anthony D. Weiner, a former congressman from New York and the estranged husband of Huma Abedin, a top Clinton aide, led to an archive of emails that agents thought might be relevant to the Clinton email matter. Mr. Comey, in an email of his own to the F. B. I. work force, made clear that he felt his July statement necessitated another public disclosure. “We don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed,” Mr. Comey wrote. Going public the first time, he suggested, forced him to go public a second time. By Justice Department convention, however, Mr. Comey’s repeated public statements may have been a mistake. Stephen Gillers, a professor at New York University School of Law who specializes in legal ethics, said Mr. Comey would have been justified had he simply announced that the Clinton investigation was over. But his first mistake, Mr. Gillers said, was to go further and criticize her sloppy handling of email. “If you decide not to go ahead with a case, you don’t say bad things about a person you have been investigating because there is no forum in which that person can defend themselves,” said Mr. Gillers, a Democrat. “He made a terrible, terrible error. ” With his recent statement, Mr. Gillers said, Mr. Comey again exceeded his authority and “got himself in deeper. ” He should have said nothing, Mr. Gillers said. Instead, “he injected himself into a political campaign. ” Michael Chertoff, a Republican who led the Justice Department’s criminal division under Mr. Bush but who supports Mrs. Clinton, said Mr. Comey violated longstanding department rules and practices in July and again Friday. In doing so, Mr. Chertoff said, he has provided “fodder for a lot of unsubstantiated allegations and   accusations. ”'"}, "time": 1742628361.131127}