{"duration": 0.03843426704406738, "input_args": {"text": "'Home › SOCIETY | US NEWS › TOO MANY MILLENNIALS ARE COOL WITH COMMUNISM TOO MANY MILLENNIALS ARE COOL WITH COMMUNISM 0 SHARES [10/27/16] “We learn from history that we do not learn from history,” observed German philosopher Georg Hegel. Perhaps nothing illustrates this better than a new survey showing that far too many “millennials” are not just cool to “capitalism,” but are actually cool with communism. As MarketWatch reports : \\nOf the 2,300 Americans polled by YouGov , 80% of baby boomers and 91% of the elderly agree with the statement that “communism was and still is a problem” in the world today. Millennials? Only 55%. \\nFurthermore, almost half of Americans between the ages of 16 and 20 said they would vote for a socialist, while 21% would go so far as to back a communist. \\nCapitalism, on the other hand, is viewed favorably by 64% of those over the age of 65, compared with only 42% of millennials. \\nCiting these results, the Victims of Communism Memorial Foundation’s Marion Smith stated, as quoted by MarketWatch , “One of the concerns [the foundation] has had since its establishment is that an emerging generation of Americans has little understanding of the collectivist system and its dark history.” For sure. This was evidenced when a teenager once naively asked me, “What’s so bad about communism?” Another registered a look of shock when I gave him part of the answer: During the 20th century, Marxist governments exterminated approximately 100 million people, making them history’s most murderous ideologues. \\nRelated to this, MarketWatch also tells us that “a third of millennials say they believe more people were killed under George W. Bush than Joseph Stalin,” clearly oblivious to Stalin’s psychopathic actions having accounted for upwards of 20 million of the above number. Of course, 82 percent of millennials at least knew who Stalin was. This cannot be said regarding Chinese leader Mao Tse-tung; 42 percent of millennials were unfamiliar with this mass murderer of approximately 60 million. Forty percent didn’t know who Argentine Marxist and major Cuban Revolution figure Che Guevara was. With respect to Vladimir Lenin and Karl Marx, the “unacquainted with” figures were, respectively, 33 and 32 percent. \\nNot surprisingly, this ignorance goes beyond history. While it’s troubling that almost half of those aged 16 to 20 would support a socialist, there’s good and bad news here. And they’re the same thing: \\nThese young people generally don’t know what socialism is. \\nAs I wrote in February, “People 18 to 29 just helped vault Senator Bernie Sanders to a resounding New Hampshire primary victory, not at all deterred by his socialist label. But while they view that positively, they don’t believe in socialist (in Sanders’) wealth redistribution. In fact, this research shows that they cotton to it little more than do average Americans and no more than their age group did 20 years ago. In other words, millennials may like the word socialism, but, as with so many others, they don’t understand well what it signifies or the nature of those for whom they vote.” \\nIn reality, the label “socialism” is applied loosely today, yet it has a firm definition. Note that socialism was popularized via Karl Marx’s and Friedrich Engels’ Communist Manifesto . And under Marxist doctrine, “socialism” — or the socialist revolution — is the transitional phase that extinguishes economic freedom and ushers in communism. Moreover, there are no communist governments because “communism” is the culmination of socialism, the stage where, the fanciful theory goes, the government has melted away and everyone lives happily and harmoniously in a state of economic equality-induced bliss. Post navigation'"}, "time": 1742628438.654269}