{"duration": 0.10834813117980957, "input_args": {"text": "'Nathan Glazer and Daniel Patrick Moynihan \\nBeyond the Melting Pot, 2nd Edition \\nCambridge: The MIT Press, 1970. \\nBeyond the Melting Pot: The Negroes, Puerto Ricans, Jews, Italians and Irish of New York City was written in 1963 and revised in 1970, but its critique of American assimilation mythology is as relevant as ever. Co-authors (((Nathan Glazer))) and Daniel Patrick Moynihan note that the term â\\x80\\x9cmelting potâ\\x80\\x9d itself was popularized by the London-born Russian Jew (((Israel Zangwill))), who in his play of the same name wrote: \\nâ\\x80\\x9cAmerica is Godâ\\x80\\x99s Crucible, the great Melting-Pot where all the races of Europe are melting and reformingâ\\x80Ś Germans and Frenchmen, Irishmen and Englishmen, Jews and Russians â\\x80\\x93 into the Crucible with you all! God is making the American.â\\x80\\x9d \\nWhat should surprise literally no one familiar with Hebrew duplicity is that (((Zangwill))) himself was a zionist, that is to say he wanted a territorial nation-state for Jewish people established somewhere in the world (and preferably with few extant inhabitants, which is why he opposed the choice of Palestine). It would appear then that (((Zangwill))) did not really believe in his melting pot in a universal sense. And neither do the authors of Beyond the Melting Pot, who describe 1960s New York as a very identitarian place, one of both conflicting and allied power-blocs rooted in ethnic affinities. One may be left wondering if any â\\x80\\x9cAmericansâ\\x80\\x9d even lived in New York apart from a trickle of WASP transplants, given how the co-authors slice what were the cityâ\\x80\\x99s five largest ethnic groups. They literally have an entire section dedicated to naming the Jew, who at the time populated a fourth of the city. Is that America? Will it become America? \\nAnd now to burst your bubble. (((Glazer))) and Moynihan were both liberals and sociologists, though contemporary liberals and sociologists would probably hate them. (((Glazer))) was a staunch anti-communist (and sometimes even labelled a neoconservative), while Moynihan was infamous for a report he put together while Assistant Secretary of Labor that criticized dindu family structure (high rates of bastardy) and was skeptical of providing welfare to single mothers (a toxic incentive). Critics accused the so-called Moynihan Report of â\\x80\\x9cblaming the victim,â\\x80\\x9d a leftist retort that has since become increasingly common. While he was the 12th American ambassador to the United Nations, Moynihan gave a speech before the General Assembly denouncing a resolution which had declared zionism to be a form of â\\x80\\x9cracism.â\\x80\\x9d Not very endearing for the current year. And while a senator in the 1980s, he predicted that ethnic nationalism and the slumping economy of the Soviet Union would become existential threats to communism in Eastern Europe, and criticized Reaganâ\\x80\\x99s overhyped fears of its expansion. The co-authors of Beyond the Melting Pot were clearly liberals of an older stock than one is used to reading. \\nAnd that more than anything else is what makes this book so fascinating. Beyond the Melting Pot tells us a lot of things we on the Alt-Right already know, but the writers are not on our side. It tells us about the alliance between elite WASPs, Jews, and blacks in politics. It tells us how Jews have been heavily involved in liberalism, socialism, labor movements, psychology, higher education, government and politics, and the civil rights movement relative to their size, and how almost all of American Jewry traces through New York. It tells us how Jews didnâ\\x80\\x99t want religion added to the US Census because they didnâ\\x80\\x99t want anti-semites to be able to track their numbers or influence. It tells us how liberals donâ\\x80\\x99t view â\\x80\\x9cWhite Americansâ\\x80\\x9d as an identity group but are willing to concede that, say, Irish, Italian, or Polish people exist. It tells us how earlier Northern European migrants such as Scots, Welsh, Dutch, Germans, and Scandinavians had a much easier time assimilating into an (Anglo) American identity and losing their old ethnic consciousness. It tells us that blacks and Hispanics use the most welfare per capita and are less industrious than Whites and Jews, in addition to having very different family structures. It tells us that White Catholics have produced very little intelligentsia in New York and the United States despite their large share of the population (though your author is part of an aspiring post-Catholic intelligentsia). \\nI am not deducing these or gleaning these points from the text. They are the text. This is what a sociology book on the ethnography of New York written by a pair of older school liberal academics has to say. \\nPerhaps most surprising is the co-authorsâ\\x80\\x99 stance that there are positive elements to the formation and existence of ethnic communities and neighborhoods, and that the government should not try to destroy such communities through aggressive integration programs. To some extent, this is just realism regarding the conditions of New York. It is purely descriptive, then and now, to say that ethnic neighborhoods exist where one group predominates. But even that is refreshing coming from authors of the left, for whom it is so often the case that race and ethnicity are social constructs and therefore neither real nor of value. It is further than that even, as (((Glazer))) and Moynihan do not merely recognize identity-based communities exist, but suggest they are beneficial in some ways and not necessarily products of â\\x80\\x9cracism.â\\x80\\x9d Can you imagine the Department of Housing and Urban Development suggesting that â\\x80\\x9csegregated communitiesâ\\x80\\x9d are not â\\x80\\x9cracist,â\\x80\\x9d and that the government doesnâ\\x80\\x99t need to break them up in the name of integration? What would Julian Castro do? \\n(((Glazer))) and Moynihan do believe in the false idols of equality and integration, but they arenâ\\x80\\x99t totally stupid about it. They know that building (implicitly Afro-Latino) public housing in a middle-class neighborhood always triggers White flight once the colored population hits critical mass, and results in ethnic succession rather than integration. They donâ\\x80\\x99t have radical solutions for tackling the structural problems of ethnic diversity in a society. They tend towards gradual economic improvement as the solution, but as we all know, the United States by and large for most people is not a land of social mobility anymore, nor is it one where you can magically uplift radically different biocultural groups by pouring money into them. \\nWhat you get from a book like Beyond the Melting Pot is a real Rorschach test of what you are already primed to find evidence for. If you already knew Americans voted in identitarian blocs, then you now know that it is nothing new. If you already knew some immigrants assimilate better than others into mainline American culture (or the regional culture of the area they move to), then you now know that it is nothing new. If youâ\\x80\\x99ve already read Culture of Critique and knew about the involvement of overseas Israelis in leftist agitation and the institutional long march, then you now know that it is nothing new (and moreover that when Jews write about it, it is considered non-controversial). \\nUltimately, I would recommend Beyond the Melting Pot as a companion text. On its own, it is really just a general interest book with no application beyond 1960s New York City. In conjunction with other literature , it becomes much more illuminating.'"}, "time": 1742562043.5393627}