{"duration": 0.0847628116607666, "input_args": {"text": "'  BleachBit Mocks Crooked Hillary With Brutal New Product Offering Called ‘Cloth Or Something’ The new product is a set of microfiber cloths featuring an image of Hillary Clinton holding the BleachBit logo with a quote from Clinton in response to being asked if she wiped her private email server: “Like with a cloth or something?”   BleachBit, the company responsible for the file deletion software utilised by Hillary Clinton’s team to delete her emails, recently released a new product called ‘Cloth or Something.’ \\nEDITOR’S NOTE: BleachBit, the company that makes the scorched earth software for people who really, really, REALLY need to delete emails about “grandkids and yoga classes” have expanded their product line. Need a hammer to destroy your BlackBerry? They can sell you one. Need to wipe your server clean…like with a CLOTH or something? You can now buy that, too, and just in time for the 2016 Presidential Election. If I had a liberal friend, I would celebrate Trump’s victory by sending them one. If only I had a liberal friend. Or not. \\nThe new product is a set of microfiber cloths featuring an image of Hillary Clinton holding the BleachBit logo with a quote from Clinton in response to being asked if she wiped her private email server: “Like with a cloth or something?” ‘Like With A Cloth or Something? – Hillary Clinton Jokes About Wiping Server: \\nFunny thing here, Crooked Hillary always brags about “how much smarter” she is than Donald Trump, right? So WHY, I ask you, does she now want us to believe that “wiping a server clean” happens by using a cloth? Soooo, either she is a LOT dumber than Donald Trump – or – she’s a liar. Pick one! Hillary Clinton Smashed Blackberry Phones With Hammers: \\nHmmm, let me see. The FBI asks me to “ preserve emails and devices “, so naturally the first thing I do is delete the emails and THEN smash the devices to smithereens with a hammer. Because that’s how honest people, with nothing to hide, act when contacted by the FBI in an investigation, right? \\nThe product description reads , “August 2015 Hillary Clinton was asked, ‘Did you wipe your email server?’ and she evasively replied, ‘Like with a cloth or something?’ A year later we found out that ‘cloth’ was BleachBit, a software application that deletes information ‘so even God can’t read it,’ as Congressman Trey Gowdy announced August 2016.” The page goes on to list many uses for the cloths while poking fun at Clinton’s actions during the investigation: After you have smashed your BlackBerry , don’t forget to wipe the fingerprints from your email server with this non-abrasive, soft microfiber Cloth or Something. Thin, foldable size makes it easy to stash the Cloth or Something in burn bags. 6″ x 6″ size quickly wipes even the biggest email servers with thousands of emails. Buy an extra cloth for your VIP (VERY VIP) client. Optionally autographed on the back by Andrew, creator of BleachBit. Printed in the USA! Guaranteed not to prove intent, or you will get a full refund paid when you are released from prison. First-class shipping and handling is a flat rate of $2 per order. Yes, this cloth is real , and you can really buy it. \\nFinally the page says , “Don’t wait for a subpoena: Order Now!”  '"}, "time": 1742564135.5307007}