{"duration": 0.03196907043457031, "input_args": {"text": "'“The Art of War”\\nHow to vote No to Nuclear Weapons by Manlio Dinucci The US has just discarded a proposal by its allies in the First Committee of the UN General Assembly seeking the total elimination of nuclear weapons. However States illegally harbouring US nuclear bombs may request their removal from their territory by virtue of art 2 of the Non-Proliferation Treaty.\\nVoltaire Network | Rome (Italy) | 2 November 2016 français italiano “Thank you, President Obama. Italy will pursue with great determination its commitment for nuclear security”: so wrote Prime Minister Renzi in a historic tweet. Six months later, at the United Nations, Renzi voted Yes to nuclear weapons. Towing the line to the USA, the Italian government sided against the Resolution approved by a large majority of the First Committee of the General Assembly, requesting that a United Nations Conference be called in 2017 to “negotiate a legally binding instrument to prohibit nuclear weapons leading towards their total elimination”.\\nThus the Italian government went back on what it had promised two years ago at the Vienna Convention, to the “petitioning”, anti-nuclear movements when it assured them that it was willing to work for nuclear disarmament by playing the “role of a mediator patiently and with diplomacy”. Thus into a void falls our appeal, “ We demand total nuclear disarmament ”, which pleads the government for “a coherent pursuit of the commitment and fight for wiping out nuclear weapons”, in a “humanitarian and legal journey towards nuclear disarmament” where Italy could play “a more active role, possibly [even] a driving role”.\\nThe parliamentary motions of this same tenor also fall as a consequence. It is easy enough to use the generic calls to nuclear disarmament: we only need to reflect on the fact that the US President has established nuclear rearmament to the tune of 1,000 billion dollars yet he has been honoured with the Nobel Prize for Peace for “his vision of a world free of nuclear weapons”.\\nThe specific way that Italy can contribute to the objective of nuclear disarmament, enunciated in the United Nations Resolution, is to free our country from US nuclear weapons. To achieve this, we need not appeal to the government, but [simply] to ask it to respect the Non-Proliferation Treaty (NPT), signed and ratified by Italy, art 2 of which provides:\\n“Each State that is militarily non-nuclear and which is a Party to this Treaty, undertakes not to receive from anyone else nuclear weapons or other explosive nuclear devices, nor to control such weapons and explosive devices, directly or indirectly”.\\nWe must ask Italy to stop violating the NPT and ask the United States to immediately remove all its nuclear weapons from our territory and not to install in it the new B61-12 bombs, a springboard for USA/Nato nuclear escalation against Russia, nor any other nuclear weapons. We must [also] ask that the training of Italian pilots, to use nuclear weapons under US command, be put to an end.\\nThis is the aim of the campaign launched by the Committee No War, No Nato and other organizations. The campaign obtained its first significant result: on 26 October, at the Regional Council of Tuscany, a motion of the group Sì Toscana a Sinistra was approved that “commits the Group to ask the Government to respect the Non Proliferation Treaty for Nuclear Weapons and to ensure that the Untied States immediately removes any nuclear weapon from the Italian territory and desists from installing [on Italian soil] the new B61-12 bombs and other nuclear weapons”. Through these and other initiatives, we can create a wide-reaching front that, with a strong mobilization, forces the government to respect the Non-Proliferation Treaty.\\nSix months ago, requests were made in the pages of Il Manifesto whether, on the basis of the NPT, someone in Parliament might be ready to request for US nuclear weapons to be immediately removed from Italy. We are still awaiting a response.\\nManlio Dinucci Translation\\nAnoosha Boralessa\\nSource\\nIl Manifesto (Italy)'"}, "time": 1742628542.8565118}