{"duration": 0.1392505168914795, "input_args": {"text": "'Is North Korea irrational? Or does it just pretend to be? North Korea has given the world ample reason to ask: threats of war, occasional attacks against South Korea, eccentric leaders and   propaganda. As its nuclear and missile programs have grown, this past week with a fifth nuclear test, that concern has grown more urgent. But political scientists have repeatedly investigated this question and, time and again, emerged with the same answer: North Korea’s behavior, far from crazy, is all too rational. Its belligerence, they conclude, appears calculated to maintain a weak, isolated government that would otherwise succumb to the forces of history. Its provocations introduce tremendous danger, but stave off what Pyongyang sees as the even greater threats of invasion or collapse. Denny Roy, a political scientist, wrote in a   1994 journal article that the country’s “reputation as a ‘crazy state’” and for “reckless violence” had “worked to North Korea’s advantage,” keeping more powerful enemies at bay. But this image, he concluded, was “largely a product of misunderstanding and propaganda. ” In some ways, this is more dangerous than irrationality. While the country does not want war, its calculus leads it to cultivate a permanent risk of one  —   and prepare to stave off defeat, should war happen, potentially with nuclear weapons. That is a subtler danger, but a grave one. When political scientists call a state rational, they are not saying its leaders always make the best or most moral choices, or that those leaders are paragons of mental fitness. Rather, they are saying the state behaves according to its perceived   first of which is  . When a state is rational, it will not always succeed in acting in its best interests, or in balancing   against   gains, but it will try. This lets the world shape a state’s incentives, steering it in the desired direction. States are irrational when they do not follow  . In the “strong” form of irrationality, leaders are so deranged that they are incapable of judging their own interests. In the “soft” version, domestic factors  —   like ideological zeal or internal power struggles  —   distort incentives, making states behave in ways that are counterproductive but at least predictable. North Korea’s actions, while abhorrent, appear well within its rational   according to a 2003 study by David C. Kang, a political scientist now at the University of Southern California. At home and abroad, he found, North Korean leaders shrewdly determined their interests and acted on them. (In an email, he said his conclusions still applied.) “All the evidence points to their ability to make sophisticated decisions and to manage palace, domestic and international politics with extreme precision,” Mr. Kang wrote. “It is not possible to argue these were irrational leaders, unable to make   calculations. ” Victor Cha, a Georgetown University professor who served as the Asian affairs director on George W. Bush’s National Security Council, has repeatedly argued that North Korea’s leadership is rational. Savage cruelty and cold calculation are not mutually exclusive, after all  —   and often go hand in hand. States are rarely irrational for the simple reason that irrational states can’t survive for long. The international system is too competitive and the drive for   too powerful. While the North Korean state really is unlike any other on earth, the behaviors that make it appear irrational are perhaps its most rational. North Korea’s seemingly unhinged behavior begins with the country’s attempt to solve two problems that it took on with the end of the Cold War and that it should have been unable to survive. One was military. The Korean Peninsula, still in a formal state of war, had gone from a   deadlock to an overwhelming tilt in the South’s favor. The North was exposed, protected only by a China that was more focused on improving ties with the West. The other problem was political. Both Koreas claimed to represent all Koreans, and for decades had enjoyed similar development levels. By the 1990s, the South was exponentially freer and more prosperous. The Pyongyang government had little reason to exist. The leadership solved both problems with something called the Songun, or “” policy. It put the country on a permanent war footing, justifying the state’s poverty as necessary to maintain its massive military, justifying its oppression as rooting out internal traitors and propping up its legitimacy with the     nationalism that often comes during wartime. Of course, there was no war. Foreign powers believed the government would, like other Soviet puppets, fall on its own, and barring that wanted peace. So North Korea created the appearance of permanently imminent war, issuing flamboyant threats, staging provocations and, sometimes, deadly attacks. Its nuclear and missile tests, though erratic and often failed, stirred up one crisis after another. This militarization kept the North Korean leadership internally stable. It also kept the country’s enemies at bay. North Korea may be weaker, but it is willing to tolerate far more risk. By keeping the peninsula on the edge of conflict, Pyongyang put the onus on South Korea and the United States to pull things back. From afar, North Korea’s actions look crazy. Its domestic propaganda describes a reality that does not exist, and it appears bent on almost provoking a war it would certainly lose. But from within North Korea, these actions make perfect sense. And over time, the government’s reputation for irrationality has become an asset as well. Scholars ascribe this behavior to the “madman theory”  —   a strategy, coined by no less a proponent than Richard M. Nixon, in which leaders cultivate an image of belligerence and unpredictability to force adversaries to tread more carefully. Dr. Roy, in an interview, said North Korea “intentionally employs a posture of seemingly   acceptance and willingness to go to war as a means of trying to intimidate its adversaries. ” But this strategy works only because, even if the belligerence is for show, the danger it creates is very real. In this way, it is North Korea’s rationality that makes it so dangerous. Because it believes it can survive only by keeping the Korean Peninsula near war, it creates a risk of sparking just that, perhaps through some accident or miscalculation. North Korea is aware of this risk but seems to believe it has no choice. For this reason, and perhaps because of the United   invasion of Iraq and the NATO intervention in Libya against Col. Muammar   it appears to earnestly fear an American invasion. And this is rational: Weak states that face more powerful enemies must either make peace  —   which North Korea cannot do without sacrificing its political legitimacy  —   or find a way to make any conflict survivable. North Korea’s nuclear program, some analysts believe, is designed to halt an American invasion by first striking nearby United States military bases and South Korean ports, then by threatening a missile launch against the American mainland. While North Korea does not yet have this ability, analysts believe it will within the next decade. This is the culmination of North Korea’s rationality, in something known as desperation theory. Under this theory, when states face two terrible choices, they will pick the least bad option  —   even if that choice would, under normal conditions, be too costly to consider. In North Korea’s case, that means creating the conditions for a war it would most likely lose. And it could mean preparing a   effort to survive that war by launching multiple nuclear strikes, chancing a nuclear retaliation for the slim chance to survive. North Korea’s leaders tolerate this danger because, in their calculus, they have no other choice. The rest of us share in that risk  —   vanishingly small, but nonzero  —   whether we want to or not.'"}, "time": 1742563166.966826}