{"duration": 0.04326128959655762, "input_args": {"text": "'GERMANY: Christian priest gets stoned by illegal alien Muslim children shouting “Allahu Akbar” The Ethiopian vicar was visiting the town of Raunheim on the outskirts of Frankfurt when the pre-teens started throwing stones at him. The three Muslim children, aged between 10 and 12-years-old, shouted “Allahu Akhbar” as they threw the stones, the other priest who was visiting from a nearby church said. UK Express Dressed in traditional priest’s gear and wearing a cross around his neck, the 47-year-old was walking to the Russian Orthodox chapel in Frankfurter Straße with a local priest, who wished to remain anonymous, when he was attacked. Both priests tried to take photos of the children with their mobile phones, but the youngsters were too quick and managed to escape. Raunheim social worker Dr Isack Majura said he was going to do everything possible to get hold of the children. He said: “What happened is absolutely unacceptable.” (Get used to it) There have been a number of news reports of Christians facing attacks by Muslims at German camps, such as a case from October 2015 where a convert to Christianity was reportedly beaten unconscious with a baton by Muslim refugees at a camp in Hamburg-Eidelstedt. For example, a report earlier this year revealed that there had been no less than 743 reported attacks by Muslims upon Christians in invader centers in Germany. Yesterday, Express.co.uk revealed pupils at a girl’s primary school in the German ski resort of Garmisch-Partenkirchen are being forced to chant “Allahu Akhbar” and “there is no God but Allah.” A father of a pupil claimed his daughter had been “forced” by teachers to memorize the Islamic chants. Weeks before, parents complained their children’s nursery was refusing to acknowledge “Christmas rituals” such as putting up a Christmas tree or singing carols to accommodate the “diverse (Muslim) cultures” of other pupils. In Germany, Christian refugees have to be separated from Muslim refugees because they are being peesecuted by the Muslims in the asylum centers.'"}, "time": 1742562563.1589105}