{"duration": 0.04780459403991699, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Two Russian intelligence agents directed a criminal conspiracy that broke into 500 million Yahoo accounts in 2014, the Justice Department said, in one of the largest known data breaches. The agents were supposed to be helping Americans hunt for hackers  —   but instead they were working against them. Prosecutors said the Russian government used the information to target foreign officials, business executives and journalists. _____ 2. President Trump lashed out over the leak of part of his 2005 tax return, which showed that he paid $38 million in federal income taxes after huge  . The release comes as critics of the Republican health care bill point out that it gives large tax breaks to wealthy Americans like the president. On Capitol Hill, above, the Republican leader of the House Intelligence Committee cast doubt on Mr. Trump’s claim that he was wiretapped. _____  3. The Federal Reserve raised its benchmark interest rate, a move intended to curb inflation and stabilize growth. Officials said the domestic economy was expanding at a “moderate pace. ” Mr. Trump has vowed to speed up growth, and to cut regulations to stimulate job growth. He headed to Detroit to announce a rollback of fuel economy standards that he says hurt the U. S. auto industry. The president’s first budget will be released Thursday. A blueprint to be released by the White House calls for deep cuts to the Environmental Protection Agency, the State Department and popular domestic programs. _____ 4. The Netherlands went to the polls to elect a   Parliament, in the first major electoral test for European populism since last year’s “Brexit” referendum. Turnout was the highest in decades. Geert Wilders’s   party gained seats, but a big majority of Dutch voters rejected his views. Fears of hacking and outside interference were rife, so all vote tallying was done by hand. _____ 5. In Damascus, a suicide bomber struck inside a historic judicial building, killing at least 30 people. It was the second attack in five days in the heart of the Syrian capital, coinciding with the sixth anniversary of the start of the uprising against President Bashar  . The war has now left more than 400, 000 people dead and displaced about half of the country’s population. _____ 6. A federal judge in Hawaii blocked Mr. Trump’s revised travel ban. Hours before the second attempt to ban travel from parts of the Muslim world was to take effect, Judge Derrick K. Watson froze it nationwide. The decision deals a political blow to the White House and signals that proponents of the ban face a long and risky legal battle ahead. Read the judge’s order here. Above, a protest against the ban in Washington. _____ 7. Hundreds of private clinics have sprung up in the U. S. and around the world offering   treatments for all manner of ailments, with little or no regulation because they fall into a legal gray zone. A disastrous outcome at one Florida clinic illustrates the dangers. Three women who underwent   procedures to treat macular degeneration, which slowly causes blindness, lost much or all of their sight. The cases expose gaps in the ability of government agencies to protect consumers from unproven treatments offered by entrepreneurs. The clinic is still operating, although not on eyes. _____ 8. Australia’s Great Barrier Reef is one of the world’s natural wonders. It’s so large that it can be seen from space, and so beautiful it can move visitors to tears. And it is dying. Huge sections of its most pristine parts were killed last year by overheated seawater, and now more southerly sections are bleaching, which is a potential precursor to another  . Scientists, who said climate change was warming seawaters, did not expect this level of damage for another 30 years. _____ 9. The   remake of Disney’s 1991 animated blockbuster “Beauty and the Beast” arrives in theaters this week. But not in Malaysia, where the government demanded that Disney cut a brief scene that shows two men dancing together in a ballroom, saying it promotes homosexuality. (Bill Condon, who directed the film, has called it “an exclusively gay moment. ”) The studio refused. Our critic gave the film a rave review, saying it “looks good, moves gracefully and leaves a clean and invigorating aftertaste. ” _____ 10. Finally, “This Is Us” is TV’s latest surprise hit. The NBC family drama, which just wrapped up its first season, uses   nonlinear storytelling. But it’s not a gimmick, our critic writes. “It represents the way we experience time with the people we love,” he says. “I couldn’t tell you why this family show became a hit where so many others haven’t. Maybe America just needs a good cry this year. ” And on the   shows, the comedian Seth Meyers took on Representative Steve King of Iowa for his remark about “somebody else’s babies. ” “You know you’ve really accomplished something when the guy who wrote ‘Cujo’ is no longer the scariest Stephen King,” he quipped. Have a great night. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742628551.43204}