{"duration": 0.1292736530303955, "input_args": {"text": "'BEIJING  —   They protest, picket and sing to defend Mao’s memory, yearning for the East to be red again. But lately some of China’s Maoists are finding inspiration in an unlikely insurgent in the West: Donald J. Trump. Mr. Trump “has torn up the old rules of the ruling elites, not just of the capitalist West,” said Zhang Hongliang, a polemicist who is the loudest proponent of what could be loosely called “Maoists for Trump. ” In a recent essay, Mr. Zhang lauded the American president as being alone among national leaders daring “to openly promote the political ideas of Chairman Mao. ” President Xi Jinping of China will be sizing up Mr. Trump during a visit to his    estate in Florida this week, in the leaders’ first summit meeting. Meanwhile, many ordinary Chinese people have also been taking the measure of the new American president and have been bewildered, incensed and yet, sometimes, inspired. The global wave of nationalist,   sentiment that Mr. Trump rode to power has washed ashore in China, encouraging a   fringe that is hostile to capitalism and Western influence, and that the Communist Party has long sought to cultivate  —   and contain. China’s Maoists are a small minority most Chinese have no desire to revive the ruthless, convulsive politics of the Mao era. But the Maoists’ growing assertiveness, echoed in their embrace of aspects of Mr. Trump’s agenda, could help push the country in a more authoritarian direction. They also complicate the efforts of  Mr. Xi to play both sides of an ideological divide: as a robust defender of Mao’s legacy, but also a proponent of market liberalization and even a champion of globalization in the Trump age. It is a paradox that these admirers of Mao Zedong, a Marxist revolutionary who railed against Western imperialism, have found things to like about this American president, a property tycoon with a cabinet crowded with millionaires. But they want Mr. Xi to take a page from Mr. Trump’s “America First” script and protect Chinese workers from layoffs, privatization and foreign competition. “Trump opposes globalization, and so should China,” said one article on Utopia, a popular Maoist website. “Trump’s ideology has oriented toward China, and he is learning from China,” said another   Chinese site. China’s   as they are sometimes called, are loosely united by demands for stringent economic equality, zealous nationalism and a loathing of the capitalist West and liberal democracy. “Many of the same ideas now animating the global populist movement have been the hallmarks of the   movement for over a decade,” said Jude Blanchette, a researcher in Beijing who is writing a book about the movement. “The   have also clearly benefited from the rise of Xi Jinping, as he has blasted a pretty large dog whistle in their direction,” Mr. Blanchette added. Many on China’s far left see Mr. Trump as a dangerous foe who has questioned established American policy on Taiwan, vowed to confront China’s hold on the disputed South China Sea and threatened to cut Chinese exports to America. But some Maoists say Mr. Trump also offers a model. They think he led a populist revolt that humbled a corrupt political establishment not unlike what they see in China. They cheer his incendiary tactics, sometimes likening them to Mao’s methods. And they hear in his remarks an echo of their own disgust with Western democracy, American interventionism and liberal political values. Maoist meetings and websites dwell on a clutch of enemies, including the C. I. A. and America in general, genetically modified crops and advocates of privatizing state companies. But they reserve a particular venom for liberal Chinese intellectuals and celebrities who have condemned Mao. In the West, Mr. Zhang argued, the nationalists are on the right while the left generally supports internationalism. “But China is the opposite,” he said. “Chinese rightists are the traitors, while Chinese leftists are the patriots. ” The Communist Party never repudiated Mao’s legacy after his death in 1976, but it condemned his excesses, including the violent Cultural Revolution, and for years he was ignored or discredited while Deng Xiaoping pursued economic liberalization. In the 1990s, though, the party refurbished Mao’s image and fostered a popular revival to bolster its authority and blunt calls for political liberalization. Officials started using Maoists to intimidate liberal academics, dissidents and other critics. Before Mr. Xi came to power in 2012, a political rival, Bo Xilai, openly encouraged “red” nostalgia for the Mao era as part of an effort to build a populist power base. Mr. Bo was purged in a scandal, but the Maoists regrouped as Mr. Xi associated himself more closely with Mao’s legacy than his predecessors and called for a return to Marxist purity. Under Mr. Xi, Maoists have become bolder in taking to the streets and organizing online campaigns. A court ruling last year and legislation adopted last month protecting Communist heroes buoyed them further. Nobody expects Maoists to seize power in Beijing. They are disdained by the middle class and kept on a tether by the party authorities. Across China, there are maybe a few thousand active supporters of Maoist groups and causes, and their petitions against liberal intellectuals have gathered tens of thousands of signatures online, according to Mr. Blanchette, the researcher. But the Chinese left’s broader message of muscular nationalism and its criticism of widening inequality have reverberated, especially among retirees,   workers and former party officials dismayed by extravagant wealth and corruption. Mr. Trump and the global surge of nationalism and populism have added to the political tinder. Dai Jianzhong, a sociologist in Beijing, said Maoists could gain a bigger following if an economic slowdown caused mass layoffs, or if tensions with the United States escalated into confrontation. “It was a big shock for China to see American   society overwhelmed by this tide of populism,” Mr. Dai said. “China is a different society, but if the economy stagnates and workers feel badly let down, populism will gain influence. The influence of Maoists and ultraleftists would spread. ” In January, about a hundred protesters gathered in Jinan, a provincial capital in eastern China, to condemn a professor of communications and advertising, Deng Xiangchao, who had dared criticize Mao online. They chanted and held banners near Mr. Deng’s home, reviling him as a “traitor” and “enemy of the people,” and roughed up a few people who came to show their support for him. “We love Chairman Mao because we’re poor, and the poor all love Chairman Mao,” Yang Jianguo, a retired worker who was among the protesters, said by telephone after the protest. The university swiftly dismissed Mr. Deng rather than engage in a prolonged battle with the Maoists. Later,   activists also successfully demanded the dismissal of a television station worker who had voiced support for Mr. Deng. It would be unthinkable for the party to be so obliging of protesters for free speech or other causes the party considers anathema. But while Mr. Xi has silenced the party’s liberal critics, the party has tolerated, even abetted, its   opponents, giving the Maoist populists room to grow stronger. “Their influence has clearly grown with the leftist turn in ideology, especially since 2015,” said Deng Yuwen, a current affairs writer in Beijing who has criticized the Maoists. “It’s not that the top level of the party directly controls them, but the Maoists are politically astute, and they have a good sense of what they can get away with,” he added. “They know the officials use them, but they also use the officials. ” While party leaders may find them useful for intimidating critics, the Maoists want to take China in a different direction and reverse market policies that have fueled decades of growth, by seizing the assets of the rich and strengthening state ownership of industry, for example. Most phrase their criticism of the party carefully, but some openly accuse it of betraying Mao. “China is a capitalist state under socialist guise,” said Mr. Yang, the retired worker. “Capitalists dominate the country. ” Asked about the American president, Mr. Yang was more generous: “Trump has socialist tendencies, because the way he won power in a way reflected the workers’ demands. ” Many Maoists see Mr. Xi as a fellow traveler who is taking China in the right direction by restoring respect for Mao and Marx. But others say privately that even Mr. Xi may not be a dependable ally. They point out that he has promoted himself abroad as a proponent of expanding global trade and a friend of multinational corporations, drawing an implicit contrast with Mr. Trump. He Weifang, a law professor at Peking University who is often reviled by China’s far left, said Mr. Xi was playing a dangerous game by allowing Maoist populists to silence liberal voices and risked igniting political fires that he cannot easily control. “If political currents in China increasingly converge with populism,” Mr. He added, “that would have a powerful effect on China’s future. ”'"}, "time": 1742563101.4683907}