{"duration": 0.035961151123046875, "input_args": {"text": "'CNN devoted not one, but two segments on how President Trump got two scoops of ice cream while his dinner guests only got one as the network tried to pass off a “scoop” about the president’s eating habits as news.[  In a segment titled, “Two scoops for Trump,” CNN’s Jeanne Moos talks about Trump’s “executive privilege” for receiving two scoops of ice cream while the three TIME magazine correspondents he had dinner with only got one. The TIME magazine correspondents made sure to take note of the disparity between the food given to the president and the food they were served in a profile called “Donald Trump After Hours,” the profile the segment was based on. “At the dessert course, he gets two scoops of vanilla ice cream with his chocolate cream pie, instead of the single scoop for everyone else,” TIME’s Michael Scherer and Zeke Miller wrote. “With the salad course, Trump is served what appears to be Thousand Island dressing instead of the creamy vinaigrette for his guests,” they added. But this was not the only segment CNN devoted to the subject. CNN also gave airtime to an interview between CNN’s Brooke Baldwin and CNN political reporter and    Chris Cillizza with the headline, “President Gets Two Scoops of Ice Cream, Everyone Else One. ” “The President gets two scoops, you know, everyone around the table gets one, and no word if there were sprinkles,” Baldwin commented. “Right, well, the broader point here is, the White House staff has adapted to Donald Trump’s case,” CNN political reporter and    Chris Cillizza responded. “So, when everyone else gets water, he gets a diet coke. When everybody gets one scoop of ice cream, he gets two. ” Fox News host Sean Hannity mocked CNN for its “  coverage. ” Thanks for the hard hitting news on your network @jaketapperhttps:  .  #Hannity,  —   Sean Hannity (@seanhannity) May 11, 2017,  “Thanks for the   news on your network,” Hannity wrote on Twitter. Others, however, thought Trump’s ice cream habits were worth mentioning. @davidfrum a man unable to restrain his urges,  —   Jennifer Rubin (@JRubinBlogger) May 11, 2017,  “This explains a lot,” the Atlantic’s David Frum wrote on Twitter, to which Jennifer Rubin of the Washington Post responded saying that Trump is “a man unable to restrain his urges. ”'"}, "time": 1742562970.5594854}