{"duration": 0.08411931991577148, "input_args": {"text": "'Water Protectors Begin Hunger Strike In Support of Standing Rock Nov 23, 2016 1 0 \\n“Either we die or this pipeline dies” is the message being sent from three water protectors in Iowa who are calling on the Iowa Utilities Board to shut down the construction of the Dakota Access Pipeline that is running through Iowa. \\nThe group of three began fasting on Monday morning and said they will continue until the Iowa Utilities Board shuts down the pipeline. Ed Fallon gives a speech to oppose the pipeline. \\nRuby Montoya, who is the group’s spokesperson, said that more people are expected to join the hunger strike and that will will go on until “they starve to death or until the IUB does their job.” \\nShe added that this is “a desperate act for a dire time.” \\nThe group continues to maintain that the IUB failed to protect Iowa farmland and that the consequences of when, not if, the pipeline breaks will be catastrophic. \\nOne of the hunger strikers, Jessica Reznicek, said: \\n“When the pipeline breaks, the whole state of Iowa will be fasting. It’s time the Iowa Utilities Board do the right thing and shut down the Dakota Access Pipeline.” George McCloskey meditates with other water protectors. \\nHunger strikes have been long known as peaceful ways to protest certain actions, as Mahatma Gandhi completed 17 hunger strikes in India’s freedom movement throughout his lifetime. This method of protesting was paramount to Gandhi’s philosophy of non-violence. \\n\\nAs many know, the protection of water at Standing Rock is intensifying though more help is soon to arrive with the announcement that former military veterans are organizing a movement from December 4th-7th to create an unarmed militia at Standing Rock to “defend the water protectors from assault and intimidation at the hands of militarized police force and DAPL security.” Veterans from the U.S. Army, United States Marine Corps, U.S. Navy, U.S. Air Force and U.S. Coast Guard will be present, as well as Representative Tulsi Gabbard from Hawaii, who is also a military veteran. The group has a Facebook page called Veterans Stand for Standing Rock and is encouraged to be shared with fellow veterans who want to go or who might be interested in going. So far, there is about 700 veterans confirmed to be in attendance. \\nAdditionally, hacktivists have joined in on the movement as Anonymous has taken down the company’s website who is selling tear gas canisters, concussion grenades and other weapons to the militarized police forces. \\nVeteran Wes Clark Jr. said that this resistance starting December 4th is “the most important event up to this time in human history. We’re not going to go out there and get in a fight with anyone. They can feel free to beat us up, but we’re 100% nonviolence.” \\nIndeed, that time will be incredibly important and momentous. Will militarized police continue the behavior they’ve been enacting to former military veterans? How will the police act when they see former veterans dressed in their uniforms marching peacefully? We approach a possible turning point for the ages. While we don’t know what will happen during those days just yet, we can put the intention out there that these police drop their weapons and side with the people’s voice: which is for this pipeline to not only be stopped, but removed from the Earth. \\nThe revolution is happening right before our eyes. \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.'"}, "time": 1742563261.3679955}