{"duration": 0.09165024757385254, "input_args": {"text": "'Woman awarded $70M after contracting cancer from Johnson & Johnson talcum powder \\nWednesday, November 02, 2016 by: David Gutierrez, staff writer Tags: talc , ovarian cancer , jury award (NaturalNews) Once again, a St. Louis jury has ruled that Johnson & Johnson damaged women\\'s health by engaging in a decades-long coverup about the potential risks of talcum powder (\"baby powder\") as a feminine hygiene product. On October 27, Johnson & Johnson was ordered to pay $70.1 million to Deborah Giannecchini of Modesto, California, who received an ovarian cancer diagnosis in 2012.For 40 years, Giannecchini had used Johnson & Johnson\\'s Baby Powder to keep her genital area dry, a use promoted by the company.The main ingredient in talcum powder is talc, a mineral widely used in paints and plastics as well as cosmetics, where it is used to absorb moisture. Some evidence suggests that regular exposure to talc, particularly in the genital area, can increase the risk of ovarian cancer.The jury found Johnson & Johnson guilty of negligence for failing to warn customers of this fact. Conspiracy to conceal risks Ovarian cancer is a rare but highly lethal disease. Well-established risk factors include obesity, not having children, estrogen therapy after menopause, and a family history of ovarian or breast cancer.The evidence linking talc to ovarian cancer is compelling but not yet conclusive. The International Agency for Research on Cancer lists talc as a \"possible\" carcinogen.Among the robust studies suggesting a connection are two meta-analyses that found a roughly one-third increase in ovarian cancer risk among women who were regularly exposed to talc . The first, published in 2003, found the connection in all cases. The second, published in 2013, found it only in women who applied talc directly to the genital area.The case marks the third guilty verdict against Johnson & Johnson over this issue. St. Louis juries have previously slapped the company with $55 million and $72 million judgments.The first case was filed by the family of Jackie Fox of Birmingham, Alabama, who had died of ovarian cancer after long-term use of talcum powder. In that case, the jury found the company guilty not just of negligence, but also of \"failure to warn and conspiracy to conceal the risks of its products.\"Another 2,000 lawsuits are pending. Thirty years of deception Even after the recent verdict, Johnson & Johnson continues to insist on the safety of its product, including for genital use. In its home state of New Jersey, the company has successfully gotten two lawsuits over the issue dismissed. It is appealing all three guilty verdicts from Missouri.Investors seem to believe the company will prevail. Its stock price seemed unaffected by the recent guilty verdict.Alexandra Scranton, director of science and research at Women\\'s Voices for the Earth, has characterized Johnson and Johnson\\'s behavior as typical of Big Pharma and other companies that go to extreme lengths to keep selling products even as evidence mounts of their dangers.Scranton said that documents uncovered during the Fox trial show that for decades, Johnson & Johnson sought to take advantage of the scientific uncertainty over the talc-ovarian cancer link, downplaying the potential risk rather than pursing a \"clearly more ethical role, to take a precautionary approach.\" Indeed, Scranton notes, the company \"poured money over years into defending talc.\"Among the documents revealed during the Fox case are internal memos showing that Johnson & Johnson had been preparing to be sued over the health risks of talc for 30 years. In one 1997 memo, a medical consultant warned that anyone who continued to deny a connection between ovarian cancer and genital talc use would eventually be seen as on par with tobacco companies denying a cancer link: \"denying the obvious in the face of all evidence to the contrary.\"Another memo laid out a strategy to counter falling talc sales caused by health concerns by more aggressive marketing to minority communities. Sources for this article include: http://www.naturalnews.com/053112_Johnson_&_talc_ovarian_cancer.html Health Ranger Approved AquaTru Water Filter Back in Stock \\nI\\'ve secured 500 units of the amazing AquaTru at $100 off for Natural News readers (while supplies last). \\nBreakthrough filter removes nearly 100% of hundreds of contaminants. No plumbing needed. SHIPS TODAY .'"}, "time": 1742562088.0342464}