{"duration": 0.19257020950317383, "input_args": {"text": "'US Hypocrisy Over Russian ‘War Crimes’ November 4, 2016 \\nAmid the sludge of propaganda, it’s hard to know what’s really happening in Syria, but the West’s outrage over Russian-inflicted civilian casualties is clearly hypocritical given the U.S.-Israeli slaughters elsewhere in the region, notes Gareth Porter. \\nBy Gareth Porter \\nThe Russian-Syrian bombing campaign in eastern Aleppo, which has ended at least for the time being, has been described in press reports and op-eds as though it were unique in modern military history in its indiscriminateness. In an unusual move for a senior U.S. official,   called for an investigation of war crimes in Aleppo. \\nThe discussion has been lacking in historical context, however. Certainly the civilian death toll from the bombing and shelling in Aleppo has been high, but many of the strikes may not be all that dissimilar from the major U.S. bombing campaign in Iraq in 2003, nor as indiscriminate as Israel’s recent campaigns in densely populated cities. At the start of the U.S. invasion of Iraq in 2003,   ordered the U.S. military to conduct a devastating aerial assault on Baghdad, known as “shock and awe.” \\nThe impression that the bombing in Aleppo was uniquely indiscriminate was a result of news reporting and commentary suggesting, by implication, that there are no real military targets in east Aleppo. \\nBut in fact, al-Nusra Front (Al Qaeda’s affiliate) turned Aleppo into the central hub of a massive system of conventional warfare in Aleppo province in late January 2016 when it sent an enormous convoy of at least 200 vehicles with troops and weaponry into eastern Aleppo. A dramatic three-minute al-Nusra video shows what appears to be hundreds of vehicles full of troops and trucks with weapons mounted on them. \\nThe Russian command in Syria has drones observing the routes in and out of Aleppo, so it certainly knew where many of those military sites were located. Syrian opposition sources also revealed that Nusra began immediately to put the military assets at its disposal underground, digging deep bunkers to protect troops, military equipment and tunnels through which troops and weapons could be moved unseen. \\nThe move underground explains the Russian use of bunker-buster bombs for the first time in the war. As the Guardian reported , Justin Bronk of the British defense think tank Royal United Service Institute concluded that the Russians “have high-grade intelligence of the whereabouts of Syrian opposition positions,” mainly because bunker buster bombs are too expensive to use simply to destroy buildings at random. \\nBut like Hamas fighters in Gaza in 2014, the Nusra Front-led command in Aleppo has moved its troops, weapons and command centers around in the tunnels that they have built. So many of the Russian and Syrian air strikes are almost certainly hitting targets that have already been abandoned. And in other cases, the wrong target has undoubtedly been hit. \\nThe Aleppo Health Directorate, a local monitoring group, estimated that 400 civilians had been killed in the first three weeks of bombing in east Aleppo. The United Nations put the death toll at 360 . \\nDrop the Superiority Act \\nAs terrible as that toll of civilian lives is, the United States should drop the stance of moral superiority. When the U.S. military invaded Iraq in 2003, it made no effort to keep track of how many civilians were killed in its bombing and artillery fire, claiming it had no way to tell who was civilian and who was not.   in a flight suit after landing on the USS Abraham Lincoln to give his “Mission Accomplished” speech about the Iraq War on May 1, 2003. \\nAnd the best estimates of civilians killed in U.S. and Israeli urban wars don’t provide any basis for moral superiority. A survey of Baghdad’s hospitals by the Los Angeles Times in May 2003 produced an estimate of at least 1,700 civilians killed in the first five weeks of American war. The estimate included those who had died in ground fighting and from unexploded ordnance, but even with those contributing factors subtracted from the total, it would still be far greater than those killed in the assault on east Aleppo on a weekly basis. \\nThe three-week Israeli war on Gaza City in 2009 and the seven-week war on Gaza in 2014 were also far deadlier than Aleppo. The former killed 773 civilians, according to an investigation by the Israeli human rights organization B’Tselem. The latter killed 1,473 Palestinian civilians, according to the UN Office of Coordination of Humanitarian Affairs . \\nThe one feature of the Russian-Syrian air offensive on east Aleppo that seems most clearly to violate the laws of war is the targeting of hospitals. Media accounts have referred to air strikes with barrel bombs that have hit two major hospitals in the rebel-held part of the city. \\nThe Syrian government has been acting as though it regards the hospitals in eastern Aleppo as serving the Nusra Front command, and the hospitals, which are under intense pressure from the militants who run that part of Aleppo, have fed the government’s suspicions. \\nAs a detailed report by Doctors Without Borders (MSF) on the air strikes that hit the Al Quds hospital on April 27 explains, the local organization that created a new system of hospitals in 2011 decided not to declare the hospitals openly but to keep them “underground” – meaning secret from the government. \\nIn fact, of course, the government knows perfectly well where all 10 hospitals in east Aleppo are located. The April 27 air strike that damaged the Al Quds hospital shows how the government has responded. It began with an air strike that destroyed a building across the street from the hospital. The building was a school, but former residents of east Aleppo who have gotten out have confirmed that organizations associated with the al-Qaeda-dominated command have located their offices in schools to try to hide their staff. \\nWithin a few minutes of the initial strike, according to the MSF account, Al Quds hospital staff were pulling survivors out of the rubble and taking them across the street to the emergency room, whereupon the Syrian air force dropped a barrel bomb at the entrance to the emergency room, killing several of the hospital staff, including one doctor. Then it dropped one close enough to the side of the hospital to hit the emergency room and, minutes later, hit a building down the block where hospital staff were staying. \\nSuch attacks on those who try to save the lives of survivors of bombing attacks – sometimes called “double tap” attacks” – are rightly condemned as violations of humanitarian law. And the belief that the staff at the hospital are operating in effect as medics for the adversary’s military does not justify attacking it and the wounded sheltered there. \\nBut such violations of the laws of war are hardly unique to Aleppo or Syria. \\nHardly Unique \\nU.S. drone strikes in Pakistan have hit rescuers or mourners after hitting their initial targets in numerous documented cases . In the 2009 Gaza attacks, the Israeli military argued that Hamas fighters were using hospitals to hide from Israeli bombing, but offered no valid evidence to support it, as the Goldstone Report showed . An Israeli strike caused a huge explosion in a residential area in Gaza during the Israeli assault on Gaza in 2008-2009. (Photo credit: Al Jazeera) \\nIn 2014, the Israelis completely destroyed the Al-Wafa hospital in an air strike recorded for public release after claiming falsely that it had been fired on by Palestinian gunmen. \\nIn its wars in Gaza and in Lebanon, the IDF has gone well beyond the Russian and Syrian Aleppo campaign in refusing to recognize any distinction between civilian targets. It not only targeted civilian offices in both Gaza wars, but treated entire areas of the city as a legitimate target, on the premise that all civilians had been ordered to leave. \\nAnd in both Gaza and in Beirut suburb of Dahiya , the IDF levelled several high-rise buildings where they believed Hezbollah had offices. The IDF called it the “Dahiya doctrine”, and threatened “great damage and destruction” on any adversary in any future war in the region. \\nHeavy bombing in a city is inherently fraught with moral risk, and attacks on genuine civilian targets can never be excused. But such practices have been carried out and legitimized in the past by the very government that is now claiming the role of moral and legal arbiter. That hypocrisy needs to be recognized and curbed as well. \\nGareth Porter is an independent investigative journalist and winner of the 2012 Gellhorn Prize for journalism. He is the author of the newly published Manufactured Crisis: The Untold Story of the Iran Nuclear Scare. [This article originally appeared at Middle East Eye.]'"}, "time": 1742561837.636391}