{"duration": 0.08897900581359863, "input_args": {"text": "'Leading a   coalition, the Texas attorney general filed a brief with the U. S. Supreme Court on Monday supporting President Donald Trump’s temporary travel stay. Attorneys general from 14 other states and the governor of Mississippi joined to urge the nation’s highest court to reinstate the executive order. [State officials urge that President Trump was acting within his lawful authority given to him by Congress when national security, foreign affairs, and immigration policy judgments require him to exercise it.  Last month the U. S. Court of Appeals for the Fourth Circuit affirmed a lower district court’s order blocking the executive action, as reported by Breitbart News. The   opinion of the court was issued on May 25. The   decision upheld the halt of the executive order by the federal district court in the District of Maryland. The U. S. Department of Justice filed a petition for writ of certiorari on June 1 asking the court to decide whether the president acted within his authority in issuing the   temporary travel ban from six   countries. The Supreme Court took the rare step on June 3, as reported by Breitbart News, in expediting review of the case. “The executive order is a tailored response to a very real threat to our national security,” Attorney General Ken Paxton said in a statement obtained by Breitbart Texas. “A temporary pause on entry from countries with heightened security concerns is necessary to shore up our nation’s vetting procedures. The president is fulfilling his solemn duty to protect Texans and all Americans. ” The states of Alabama, Arizona, Arkansas, Florida, Kansas, Louisiana, Montana, North Dakota, Ohio, Oklahoma, South Carolina, South Dakota, Tennessee, West Virginia, and Mississippi Governor Phil Bryant, have joined the state of Texas in filing the friend of the court brief (amicus curiae) in the U. S. Supreme Court. A summary of the arguments made in the brief are as follows: The district court’s injunction of the President’s temporary suspension of entry for specified classes of nonresident aliens is remarkable. The injunction was issued despite three longstanding doctrines limiting the availability of judicial remedies for disagreement with policy decisions like the Executive Order here. First, the Constitution does not apply extraterritorially to nonresident aliens abroad seeking entry. And this Court has specifically recognized that there is no “judicial remedy” to override the Executive’s use of its delegated 8 U. S. C. § 1182( f) power to deny classes of nonresident aliens entry into this country. Second, the Order must be accorded “the strongest of presumptions and the widest latitude of judicial interpretation,” because it is in [the U. S. Supreme Court opinion of] Youngstown’s first zone of executive action pursuant to congressionally delegated power. Third, the Court has long accorded facially neutral government actions a presumption of validity and good faith, so those actions can be invalidated under a   analysis only if there is the clearest proof of pretext. This longstanding, exacting standard for judicial scrutiny of government motives has been recognized by this Court in multiple types of constitutional challenges. This limit respects institutional roles by precluding courts from engaging in a tenuous “judicial psychoanalysis of a drafter’s heart of hearts. ” Moreover, they urge: Plaintiffs cannot satisfy this Court’s exacting standards for showing that the Executive Order is pretext masking a religious classification. The Order classifies aliens according to nationality based on concerns about the government’s ability to adequately vet nationals of six covered countries who seek entry. Not only that, but these six countries covered by the Order were previously identified by Congress and the Obama Administration, under the   program, as national security “countries of concern. ” The Order is therefore valid, as it provides a “facially legitimate and bona fide reason” for exercising 8 U. S. C. § 1182( f) national security and   powers to restrict entry. The states also argued that any “  statements regarding a potential future policy” are “far from the clearest proof” required to overcome the strong legal presumption of validity, especially as to a different policy adopted by the president after he took office after conferring with other   government officials. Lana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2. State of Texas et al. Brief at U. S. Supreme Court in Support of President’s Temporary Travel Halt, '"}, "time": 1742561823.198076}