{"duration": 0.1273949146270752, "input_args": {"text": "'Donald Trump Jr.  —   a close political adviser to his father, Donald J. Trump, the Republican nominee for president  —   posted on Twitter on Monday night an image of a white bowl full of   Skittles. The image came with this text: “If I had a bowl of skittles and I told you just three would kill you. Would you take a handful? That’s our Syrian refugee problem. ” Mr. Trump, 38, the candidate’s oldest child, then got an earful. Hillary Clinton’s campaign called the post “disgusting. ” A stream of social media users denounced it as both flippant and fearmongering, noting the infinitesimal odds of being killed in a terrorist attack by a refugee. Even the parent company of Skittles weighed in. But Mr. Trump’s comparison of men, women and children displaced by a horrific civil war to a chewy candy was hardly the first time he had been accused of poor taste. If his sister Ivanka Trump has become known for her polish and message discipline, he has distinguished himself by wading frequently into the shadowy waters of white supremacy,   incendiary language and conspiracy theories. Other political candidates and officeholders, including Hillary and Bill Clinton, have also had relatives attract unflattering attention. But rarely are those family members so central to a campaign. Donald Jr. Ivanka and Eric Trump  —   the children from the elder Mr. Trump’s first marriage, to Ivana Trump  —   all spoke at the Republican National Convention and have been key players in their father’s White House run. This month, Donald Trump Jr. invoked the Holocaust when he argued to a Philadelphia radio station that the news media gave Mrs. Clinton a pass on “every indiscrepancy. ” If Republicans had done what she had, he said, “they’d be warming up the gas chamber right now. ” (He later claimed this was a reference to capital punishment.) He recently shared a Twitter post by Kevin MacDonald, a psychologist who has written about “Jewish influence” for a website devoted to “white identity, interests and culture” and who has testified on behalf of a Holocaust denier. A few days before that, Mr. Trump shared on his Instagram account a picture showing the faces of his father, himself and several Trump supporters with Pepe the Frog, a cartoon character that has been   as a mascot by the “” an informal assembly of white nationalists,   conservatives and   internet provocateurs. “A friend sent me this,” Mr. Trump wrote of the image, adding that he was “honored” to have been included in it. The Trump campaign declined to make Donald Jr. available for comment, instead releasing a statement that echoed his derision of political correctness and applauded him for speaking “the truth. ” His allies and friends came to his defense. “It’s remarkable to me to see the level of outrage about a metaphor used by Don Jr. ,” the Republican   nominee, Gov. Mike Pence of Indiana, said in an interview with NBC News. Todd Silverman, a friend from the University of Pennsylvania, said Mr. Trump “is not  . ” Told about the Twitter accounts Mr. Trump had echoed and his “gas chamber” remark, Mr. Silverman, who is Jewish, said only, “That is not consistent with the person I know. ” Mr. Trump and his siblings have appeared at rallies and advised their father, who has generally eschewed traditional political consultants, on strategy. The elder Mr. Trump, a   supporter, often mentions that his sons are avid hunters. Donald Jr. and Eric invited journalists to watch them hunt pheasants in Iowa before the caucuses there, and Donald Jr. once posed holding the tail of a dead elephant and other animals killed during an African safari. The siblings have also taken out big game within their father’s campaign: They pushed successfully to oust his onetime campaign manager, Corey Lewandowski. Donald Jr. also has a big role in the family business, as an executive vice president whose portfolio includes expanding the company’s real estate, retail, hotel and golf interests. He has also had a taste of reality stardom, appearing as an adviser on “The Celebrity Apprentice,” an iteration of his father’s hit show “The Apprentice. ” He lives with his wife and five children in New York, where he has flirted with the notion of running for mayor. “I like to keep optionality,” he said when asked on CNN if he would consider a run. The Trump campaign has called the scrutiny of his Twitter posts unfair. “We’re truly living in remarkable times,” said Jason Miller, a spokesman for the campaign. “The media’s run out of things to attack Mr. Trump on, and so now they scour the social media accounts of his family looking for things to blow out of proportion. ” Appearing this month on “Good Morning America,” Donald Jr. was asked by George Stephanopoulos about his use of the frog picture, which Mr. Stephanopoulos called a “  symbol of the white supremacist movement. ” “I’ve never even heard of Pepe the Frog,” Mr. Trump said. “I mean, bet you 90 percent of your viewers have never heard of Pepe the Frog. ” He added: “I thought it was a frog in a wig. I thought it was funny. ” Mr. Trump’s father has also employed his Twitter feed in ways many have found offensive. He has reposted messages from white supremacists’ accounts, and in July he posted an image of Mrs. Clinton, a pile of cash and a   star in the shape of the Star of David. He quickly deleted the post and said it was not intended to be   but he later said it should not have been deleted. Around that time, his son was retweeting   social media users. In March, Donald Jr. appeared on a radio show where one of the interviewers had had David Duke, the former Ku Klux Klan leader now running for the Senate in Louisiana, as a guest on his affiliated show. The interviewer, James Edwards, is the host of “The Political Cesspool,” which has been described by the Southern Poverty Law Center as “racist and  . ” Mr. Trump’s Skittles post on Monday, which drew almost 24, 000 “likes” by Tuesday afternoon, seemed almost tame by comparison. Its argument is one that many have made, sometimes using MMs, against accepting Syrian refugees, and it is consistent with the Trump campaign’s talking point that Mrs. Clinton’s more inclusive stance toward refugees threatens Americans. In a year marked by anxiety over terrorist attacks, 53 percent of respondents in an Associated Press poll in July thought the United States should allow fewer refugees to enter the country, as opposed to 11 percent who believed more should be allowed in. The Wrigley company, which makes Skittles, was careful not to take a position on the matter, though it was clearly not on board with being seen as a symbol of it. “Skittles are candy,” a company official said in a statement. “Refugees are people. We don’t feel it is an appropriate analogy. ”'"}, "time": 1742561920.5785127}