{"duration": 0.0984799861907959, "input_args": {"text": "'By the time David Sweat spoke to investigators from the office of New York State’s inspector general last year, he had spent three weeks on the run, been shot by a state trooper, and was facing the prospect of spending the rest of his life in solitary confinement for pulling off a   prison break that riveted the country. But Mr. Sweat, a convicted murderer, was apparently eager to talk. And talk he did. In the   report on the escape by the inspector general’s office released on Monday, Mr. Sweat comes off as unrepentant and smug, describing prison guards as lazy and incompetent and his sidekick, Richard W. Matt, as a bumbling, overweight  . Mr. Matt was shot and killed by law enforcement authorities during the manhunt. Here, in Mr. Sweat’s own words quoted in the report, are five key factors that were crucial to the success of his plot to break out of the Clinton Correctional Facility, a   prison in the far northern part of the state. Mr. Sweat needed tools, and to get them he needed to find a willing accomplice among the prison’s employees. Enter Joyce E. Mitchell, the civilian supervisor in the prison tailor shop, whose loneliness Mr. Sweat said he exploited, writing “love lust” notes to “placate her. ” The plan worked. In the months before the escape, Ms. Mitchell gave Mr. Sweat and his partner at least eight hacksaw blades, two chisels, a steel punch and two concrete drill bits, often smuggled in frozen hamburger meat. Ms. Mitchell proved less reliable in the second phase of the plot when she was supposed to pick up the two inmates in her car after they emerged from a manhole outside the prison walls. Mr. Sweat described his final instructions to Ms. Mitchell before the escape: She never showed up, and the inmates had to flee on foot. It took Mr. Sweat 85 nights to cut, dig and hammer his way through the brick, steel and concrete blocking his path to freedom. He had no blueprints or maps of the tunnels behind and beneath the prison walls to guide him, so he had to rely on trial and error to plot his route. Mr. Sweat lost perhaps 30 pounds working on the escape route, “letting myself down and pulling myself back up, you know, three flights every night   …     crawling through all the pipes. ” By the time of the escape, Mr. Sweat said, he was “probably about the best physical shape I been in. ” “There was a couple of times   …     I got quite discouraged,” he said, but he understood that once he started there was no turning back. At times, Mr. Sweat had to get creative, both to avoid detection and to speed his progress. Breaking through a wall with a sledgehammer he found in the tunnels and a makeshift pry bar, he said he timed his blows to coincide with loud sounds that emanated from the surrounding pipes. “So I wait until they start banging, and then I would bang,” he said. After about two weeks, he said, “I knocked the wall out. ” To cool the sweltering air inside the steam pipe that ultimately led the two inmates to freedom, he devised a ventilation system out of a fan and a tube made of several plastic garbage bags. This allowed him to remain in the pipe, cutting for three hours at a time, he said, stopping only to “eat a candy bar, drink a little water. ” Mr. Sweat and Mr. Matt could never have pulled off their escape had corrections officers and their supervisors followed basic security protocols, the report said. Officers rarely if ever conducted rounds at night and almost never inspected the catwalks and tunnels where Mr. Sweat spent night after night working. In his testimony, Mr. Sweat said he had counted on guards’ not doing their jobs and had never worried about being found out. Of the guards, he said, “They’re lazy, to be honest. ” He said he studied the guards and got to know their habits. Even Mr. Sweat was surprised, though, when he first crawled out of his cell and discovered how easy it was to move around the catwalks and tunnels. There were no locking doors or gates, which he anticipated having to break through. He was free to roam. “Nothing ended up being anything like either one of us expected it to be,” he said. During his time in the tunnels, Mr. Sweat said he never encountered an officer, though there were a few close calls. He said he would occasionally see officers on the catwalks above him, and one night he was nearly struck by a lit cigarette tossed out by a guard. The biggest scare came when the two inmates first emerged from the manhole into a residential neighborhood. An approaching car spooked Mr. Matt, who ran into the backyard of a nearby home and attracted the attention of the driver. When confronted, Mr. Sweat had to talk their way out of the fix, explaining to the driver that they were just cutting through the yard. Mr. Matt’s jitters continued, according to Mr. Sweat. He “kept running in people’s yards when he would see a car. ” “I said, ‘Dude, nobody knows you’re out,’” he told investigators, cursing at his partner to “just walk like a normal person. ”'"}, "time": 1742563887.9235485}