{"duration": 0.11116814613342285, "input_args": {"text": "'by Thomas Sowell \\nThe good news is that we dodged a bullet in this election. The bad news is that we don’t know how many other bullets are coming, or from what direction. \\nA Hillary Clinton victory would have meant a third consecutive administration dedicated to dismantling the institutions that have kept America free, and imposing instead the social vision of the smug elites. That could have been the ultimate catastrophe — not just for our time, but for generations yet unborn. \\nIn one sense, Donald Trump’s victory was a unique American event. But, in a larger sense, it represents the biggest backlash among many elsewhere, against smug elites in Western nations, where increasing numbers of ordinary people are showing their anger at where those elites are leading their countries. \\nThere, as here, mindlessly flinging the doors open to peoples from societies whose fundamental values clash with those of the countries they enter, has been a hallmark of arrogant blindness and disregard of negative consequences suffered by ordinary people — consequences from which the elites themselves are insulated. \\nNor is this the only issue on which the blindness of elites has set the stage for a political backlash. The anti-law enforcement fetish among the insulated elites has even more tragically sacrificed the safety of the general public. This too has been common on both sides of the Atlantic. \\nRiots in London, Manchester and other cities in England in 2011 were incredibly similar to 2014 riots in Ferguson, Missouri, 2015 riots in Baltimore and similar riots in other American cities. \\nThe fact that the rioters in England were mostly white, while those in America were mostly black, gives the lie to the facile excuse that such riots are due to racial oppression, rather than being a result of appeasing mobs and restricting the police. \\nNor is the election of Donald Trump likely to lead the elites to having second thoughts about the prevailing dogmas of their groupthink. On the morning after Mr. Trump’s upset victory over Mrs. Clinton, a newswoman at CNN mentioned the disappointment of some women that “the glass ceiling” was not shattered as expected. \\nWhat an insult to everyone’s intelligence is that catch phrase, “glass ceiling.” What does “glass” mean, if not that you cannot see the ceiling, but somehow you just know that it is there? And how do you know? Because it has been repeated so often. \\nIt is like the fable of the emperor’s new clothes, but a fable for adults. \\nDemagogues like Hillary Clinton can point to the fact that women as a group do not receive as much income as men as a group. But, factual studies over the past 40 years have shown repeatedly that, when you compare women who work as many hours a year as men, and as many continuous years in the same occupations as men, the income differences shrink to the vanishing point, and sometimes even reverse. \\nBut how many politicians or media people care about facts, when the facts go against their preconceptions? \\nDonald Trump’s unexpected victory should send a lot of people back to the drawing board to rethink their assumptions about many things. That includes not only the political left but also the Republican establishment. But don’t count on it. \\nThe Republican establishment has been called many things, but introspective is not one of them. One thing they might reconsider is their assumption that they alone know just what kind of presidential candidate is needed to win elections. \\nBut the two most surprisingly successful Republican candidates of the past half century — Ronald Reagan and now Donald Trump — bore no resemblance to the candidates who epitomized the Republican establishment’s model, such as Bob Dole, John McCain and Mitt Romney. \\nAmong others who could also use some rethinking is Donald Trump himself. When he acted like a petulant adolescent, he may have gotten the adulation of his core constituents. But it was only toward the end, when he began to act like a responsible adult seeking the highest office in the land, that he began to overtake Hillary Clinton. \\nDonald Trump is a wild card. We don’t know whether he was play-acting when he carried on like a juvenile lout or when he played the role of a mature adult. But he and the country could both benefit from some serious introspection on his part. \\nThomas Sowell is a senior fellow at the Hoover Institution, Stanford University, Stanford, CA 94305. His website is www.tsowell.com. To find out more about Thomas Sowell and read features by other Creators Syndicate columnists and cartoonists, visit the Creators Syndicate webpage at www.creators.com. \\nCOPYRIGHT 2016 CREATORS.COM Identity Politics in America: a Post-Mortem 0'"}, "time": 1742563867.9085977}