{"duration": 0.08660721778869629, "input_args": {"text": "'10 Signs Western Society is a Satanic Cult Many Jews, Freemasons, liberals, socialists and feminists have unwittingly been inducted into a sata... Print Email http://humansarefree.com/2016/11/10-signs-western-society-is-satanic-cult.html Many Jews, Freemasons, liberals, socialists and feminists have unwittingly been inducted into a satanic cult based on the Jewish Cabala. Society increasingly resembles this ruling cult, the Illuminati. A satanic cult inverts healthy and unhealthy, natural and unnatural... it inverts beauty and ugliness, truth and lies, justice and injustice, making evil seem good. It controls its members by corrupting and making them sick (Pharmaceuticals alone are an annual $1.2 trillion industry ). Its members are dysfunctional and identify with their condition. The real occult meaning of \"revolution,\" is supplanting God with Lucifer, turning reality upside down. Christ depicted screwing God. Note the Illuminati pyramid and eye in Christ\\'s behind ( Charlie Hebdo ) Ten Signs Western Society is a Satanic Cult 1. There is a distinction between the \"initiated\" and the general population which is kept in the dark. They are not told the cult\\'s true objectives (to exploit and enslave them) but are deceived instead with noble sounding platitudes. Leaders (part of the \"initiated\") routinely lie to the people as in the case of false flags, assassinations and wars. False flags are a form of mass brainwashing, arousing mass sympathy for the alleged victim and hatred for the alleged perpetrator. 2. The symbols of the cult are everywhere and its monuments (obelisks) dot our cities. Illuminati motifs are also prominent in corporate logos . Illuminati bankers control most corporations. 3. They deny that humans have a divine soul that is connected with a spiritual and moral order. Mention of \"God\" and a universal design and intelligence are suppressed . \"God\" is a dirty word. Instead of God, (conscience) we are required to obey the cult leaders and their factotums. Believers in God are persecuted . By denying our Divine soul, they define us as simply animals who can be domesticated or culled. They encourage us to degrade ourselves by indulging our animal nature. 4. They attempt to overrule nature and encourage unnatural and perverse behavior. A prime example is the bizarre occult hatred of gender (masculine and feminine), and their encouragement of gender confusion, homosexuality, transgenderism and androgyny. They teach school children to experiment with sex toys and homosexuality . This is state-sanctioned child sex abuse. Homosexuality is a developmental disorder . Its official promotion is proof society has gone over to the dark side. 5. Western society is a sex cult i.e. it is besotted with sex and \"hot\" women. The Illuminati promote promiscuous and anonymous sex in order to degrade people to animals. Tongue Tied video Miley Cyrus — Cry for help? Bombshell: Obama, Clinton, Podesta, Soros, Epstein, Alefantis — All Connected to Pedophilia Claims by \\'Podesta Emails\\' They normalize sexual deviance to defy God and serve their god Lucifer. The sex cult\\'s sex obsession is surpassed only by its love of money. Millions are engaged in stock market gambling. The cult (society) encourages both addictions, and addictive behavior in general. The cult controls us by making us sick, physically and/or psychologically. The cult makes its members sick and then sells them a \"cure.\" Healthcare is a $1.7 trillion industry in the US, surpassing even \"Defence.\" One in 10 Americans now takes an antidepressant medication ; among women in their 40s and 50s, the figure is one in four. 6. They attempt to destroy the institutions of marriage and the nuclear family so that the cult (society) will be our first loyalty, and ultimately will take over procreation and child rearing. 7. They create a climate of fear and use this as an excuse to remove civil rights and create a police state capable of ensuring cult control. 8. There is extensive surveillance to control every individual by blackmail . Thought criminals are shamed and expelled. The CEO of Mozilla was forced to resign after giving a donation to a group that opposes gay marriage. This enforced conformity, which is becoming commonplace, is characteristic of Communism, which is Illuminati in origin and character. The term \" politically correct \" originated in the Communist Party. 9. They suppress the truth. True history, art,music and literature are suppressed. They even deny that objective truth exists and is knowable. They use entertainment as occult ritual . They degrade and distract us from reality by creating an alternate fantasy world. Entertainers are often mind-controlled agents of the cult . New \" Common Core \" school curriculum is turning people into widgets. 10. There\\'s also a relentless focus on dysfunctional people, minorities and \"underdogs\" rather than the strong, effective, happy and truly healthy. Deprived of family supports, more people can\\'t cope and resemble zombies, disheveled, eyes focused on smart phones, head phones in ears, nose rings and tattoos. Finally, a cult usually has a charismatic God-like leader whose judgment is never questioned. Think Hitler or Stalin. In the West, we are still waiting for this figure to emerge. When he (or she) does emerge, the cult will be complete. By Henry Makow Ph.D. — author of Illuminati3: Satanic Possession: There is only one Conspiracy Dear Friends, HumansAreFree is and will always be free to access and use. If you appreciate my work, please help me continue. \\nStay updated via Email Newsletter: Related'"}, "time": 1742561822.3552194}