{"duration": 0.04740023612976074, "input_args": {"text": "'The Department of Homeland Security announced Tuesday that Secretary John Kelly will formally unveil the Victims of Immigration Crime Engagement (VOICE) office at the ICE headquarters on Wednesday. [“There’s no intent to make a pun, but it really is to give a voice to the victims of crimes that have been committed by those who are in the country illegally,” said DHS spokesman David Lapan to reporters in Washington, D. C. in response to a skeptical question about why the government wants to launch a program helping Americans suffering from illegal alien crime. “There are a lot of offices and entities that do similar things for crime victims writ large, but nobody has the level of understanding of immigration that ICE does. And so it’s a way to keep victims and their families informed, and not just about the criminal justice aspects of their particular case, but the immigration aspects. ”  “That’s something that isn’t covered by other groups and offices who maintain contact with victims of crimes  …     So it’s a way to ensure that families and victims who have been affected by, again, those here illegally can understand where things are in the immigration process as well as in the criminal justice process,” he said. One month after President Donald Trump assumed office, Kelly instructed ICE to create a program to provide families devastated by illegal alien crime and share more information about the foreign perpetrators who committed the alleged crimes. “Criminal aliens routinely victimize Americans and other legal residents. Often, these victims are not provided adequate information about the offender, the offender’s immigration status, or any enforcement action taken by ICE against the offender,” Kelly said in a memo. Rallying to the sides of American families and legal immigrants was a critical part of Trump’s successful presidential campaign. Trump repeatedly brought families who lost loved ones at the hands of illegal aliens on stage at campaign rallies, and was the only candidate to respond to an open letter pleading for a campaign to acknowledge and deliver justice to victimized and suffering American families. The immediacy of his campaign’s reply and the spotlight he shone on their plight was praised by an advocacy group that had fought for attention to the pressing issue for years. “Donald Trump is the only candidate whose office has responded to their open letter and that the candidate will support a national program to assist families of victims of illegal aliens. Their response was immediate and they have stated they will support our efforts in assisting our families,” said Maria Espinoza, head of the Remembrance Project. Her organization plans to open an office in Washington, D. C. to support the program. A December report estimated that some 820, 000 illegals evaded deportation under the Obama administration —  including roughly 620, 000 convicted of terrible crimes such as murder and rape. Read more of Breitbart News’ coverage on crimes committed by illegals and other foreign nationals here.'"}, "time": 1742562031.3038309}