{"duration": 0.06662702560424805, "input_args": {"text": "'TORONTO  —   Step on board, and the subway car immediately feels different. With a clear view down the length of the train, commuters walk from car to car searching for a less crowded spot to stand. Others gather in the   passageway between cars, an area once separated by doors. Nearly five years after Canada’s largest city introduced the spacious new cars, subway riders here  —   usually quick to find fault with the transit system  —   have given the trains a ringing endorsement. “You can fit more people, especially during rush hour,” said Louis Molnar, 43, an accountant who stood in the shifting connector between two cars on a recent evening. “In the past, sometimes you’d have to wait for the next car, and this makes it so much better. ” Now, officials in New York City are embracing the car design to create more breathing room for subway riders as the system struggles with booming ridership and increasingly overstuffed trains. The new subway trains, which could start to appear in New York by 2020 or earlier, do not have doors between cars, creating up to 10 percent more space. These   open gangway trains are common in cities like London and Shanghai, but subway systems in the United States have not adopted them. Not far from New York on the other side of Lake Ontario, the trains have become popular in Toronto, a city that is also grappling with a growing population and an overtaxed transit system. Some riders even enjoy standing in the bouncing connector, comparing it to surfing or skateboarding. “It’s just kind of fun,” Chantal Wall, 33, a stylist, said as she balanced on a connector in heels. “It makes it a little bit more interesting. I feel like I get a little bit of a workout. ” In New York, officials plan to order up to 750 of the cars to run on the subway’s lettered lines. The higher capacity trains are part of a broader push to ease crowding. The authority is also updating the signal system so that trains can run closer together and expanding the system with projects like the Second Avenue subway line, which is scheduled to open on the Upper East Side in December. The   transportation authority had planned to buy only 10 open gangway cars, but moved to expand the order after Gov. Andrew M. Cuomo, a Democrat, asked it to look at ideas from around the world, said Veronique Hakim, president of New York City Transit, the authority division that runs city subways and buses. The agency plans to work with the builder to make sure the cars arrive “as soon as possible,” she said. “When you look at other large systems  —   Paris, London, Toronto  —   you can really see and appreciate that these   car designs provide additional space,” Ms. Hakim said in an interview. To make it easier for riders to enter the cars, the new trains will have   doorways, up from 50 inches, though Toronto’s doorways are 64 inches. (To be fair, Toronto’s system is far from perfect it still accepts tiny tokens while New York retired the coins more than a decade ago.) Toronto’s reputation as a livable city with good transit has helped it grow to more than 2. 8 million people, on par with the population of Chicago. Toronto’s transit system  —   the third largest in North America  —   has about 1. 7 million riders each weekday on its network of subways, streetcars and buses, but those figures are dwarfed by New York City’s nearly 6 million daily subway riders. Toronto’s transit system is facing major crowding challenges and uncertainty over funding. The city has three main subway lines, and its busiest, the   line, is regularly packed at rush hour, mirroring conditions on New York’s busiest lines. Steve Munro, a longtime transit advocate in Toronto, said that the new cars had helped with crowding, but that the city should have built new subway lines to handle the rising demand decades ago. “By the time you realize you need the new trains, you already have a crowding problem, and there is a backlog of demand that will immediately fill the new capacity,” Mr. Munro, 67, said at a cafe near the busy   station. Mr. Munro, Toronto’s version of Gene Russianoff, New York City’s prominent voice for subway riders, cautioned that even with the new cars, trains would still be very crowded. Some riders in New York have raised concerns that regular subway annoyances  —   from “showtime” dancers to misbehaving riders  —   might now become the whole train’s problem, instead of being contained to one car. Andy Byford, the chief executive of the Toronto Transit Commission and an enthusiastic evangelist for improving the system, dismissed those fears, saying riders could easily escape unpleasant situations in the new cars. “You’re not then trapped in a single carriage,” Mr. Byford said from his office atop the Davisville station north of downtown Toronto. “You can get up and move. ” If a rider urinates or vomits, someone could simply walk away, rather than waiting for a station and darting from one car to another. Shameen Miller, 33, said that was how she responded when she came across a man emitting a foul odor. “Think about it  —   their smell is not going to drift all the way down,” Ms. Miller said. One downside is that if a train has a technical problem, workers must remove the entire   train from service, Mr. Byford said, instead of separating a pair of cars and replacing them. But over all, he said, the benefits have outweighed the drawbacks. As major cities around the world have switched to open gangway subway cars, American cities have been reluctant to try them. Yonah Freemark, a transit blogger in Boston who created a map of all the cities where the trains are used, called the delay a case of “American exceptionalism in a really bad way. ” New York’s decision to buy the cars was a major step, especially because the authority has been slow to adapt to technology, like countdown clocks or a new fare payment system. “It exhibits that the agency is moving into the 21st century when it comes to trains,” Mr. Freemark said. American transit officials have had reservations about whether the design could work on the nation’s aging subways and whether ridership levels warrant the expense of switching to the new cars, said Randy Clarke, a safety and operations expert at the American Public Transportation Association. In Boston, subway officials considered the idea for new cars on two lines but decided against it. Officials in New York have worked with engineering consultants on the plans and are confident the design is feasible, even though the subway is an older system, Ms. Hakim said. In Toronto, the best sign of the cars’ popularity is that riders whose lines do not have the trains are pleading for them. Sygmund Gaskin, 45, said he wished the older trains on his   Line could be replaced with the new cars. “I don’t know why it takes so long to get them for this line,” he said. “How come we don’t have them here as well?”'"}, "time": 1742628447.0510855}