{"duration": 0.03761100769042969, "input_args": {"text": "'Dispatches from STEPHEN LENDMAN A ccording to Professor David Bosco , writing in Foreign Policy, “(t)he prosecutor’s office of the International Criminal Court (ICC) is ready to initiate a full investigation of a range of possible war crimes and crimes against humanity in Afghanistan, including some by US personnel, according to several knowledgeable sources.” MAIN PHOTO: Kissinger, international war criminal at large. He will die in his bed—like Pinochet and Franco—and totally escape justice. The American media can be counted on to eulogize him as a great and “tough-minded statesman.” Bet on it. “The ICC move would mark the first time that a formal ICC investigation has scrutinized US actions and sets up a possible collision with Washington. Established by the Rome Statute of the International Criminal Court (ICC) on July 1, 2002, it’s mandated to prosecute individuals for genocide and aggression, as well as crimes of war and against humanity. Instead, it functions solely as an imperial tool, supports powerful interests, targets independent states Washington and other Western nations oppose. It lets America, its NATO partners, Israel and their rogue allies get away with mass murder. .. Bosco cites unnamed sources, indicating chief ICC prosecutor Fatou Bensouda “will seek to initiate an investigation in the coming weeks, likely after the US presidential election but before the end of the year… US officials visited The Hague,” letting her know who’s boss. It’s unclear where she intends to go. On October 7, 2001, US-led NATO forces attacked Afghanistan without just cause – less than four weeks post-9/11, naked aggression planned months before that fateful day. .. Appalling war crimes followed, continuing daily. All post-WW II US wars were and continue being waged illegally against nonbelligerent countries reflecting over 70 years of unaccountability. No US government or military official ever faced charges for Nuremberg-level high crimes. It’s irrelevant what Bensouda does or doesn’t do. The 2002 American Service Members’ Protection Act (ASPA, aka The Hague Invasion Act) “protect(s) United States military personnel and other elected and appointed officials of the United States government against criminal prosecution by an international court to which the United States is not party.” .. CIA boss and notorious war criminal Richard Helms. This scoundrel died in 2002, so he definitely escaped justice. \\nIt authorizes the president to use “all means necessary and appropriate to bring about the release of any US or allied personnel being detained or imprisoned by, on behalf of, or at the request of the International Criminal Court.” It prohibits the extradition of anyone from America to the ICC. In a November 2000 open letter, Henry Kissinger, George Shultz, Zbigniew Brzezinki, former CIA director Richard Helms and other US signatories said Washington must put “our nation’s military personnel safely beyond the reach of an unaccountable international prosecutor operating under procedures inconsistent with our Constitution.” .. Kissinger’s high crimes are well-documented. Brzezinski got Jimmy Carter to sign a secret directive, authorizing aid for Mujahadeen fighters combating the pro-Soviet Russia government in Kabul, aiming to induce Moscow’s military intervention which followed, what Brzezinski called “the Afghan trap.” .. Helms at CIA orchestrated Operation Phoenix in Vietnam, an assassination program claiming thousands of lives. Hillary Clinton, as junior New York Senator, supported the Hague Invasion Act. America and Israel, among other countries, failed to ratify the Rome Statute of the International Criminal Court. .. They remain unaccountable for the highest of high crimes. Expect Bensouda’s investigation, if initiated, to accomplish nothing. Bosco admitted she’ll “be launching one of the most difficult investigations the court has undertaken, both practically and politically.” No internal or external judicial body ever tried holding America accountable for decades of Nuremberg-level high crimes. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS ABOUT THE AUTHOR STEPHEN LENDMAN lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net . His new book as editor and contributor is titled “Flashpoint in Ukraine: US Drive for Hegemony Risks WW III.” ( http://www.claritypress.com/LendmanIII.html ) Visit his blog site at sjlendman.blogspot.com . =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week. Print this post if you want. Share This:'"}, "time": 1742628569.827435}