{"duration": 0.20630240440368652, "input_args": {"text": "'Like hundreds of young dancers before her, Phoebe Pearl dropped everything to become a Rockette. Ms. Pearl was 19 when she quit the Boston Conservatory in 2009 to join the elite group of dancers  —   strong, athletic and poised  —   who are as emblematic of New York City as the Empire State Building and the yellow taxi cab. For eight years, she was proud to be a Rockette, and the company treated her well, with generous pay and health insurance. But in   when management announced that the dancers would perform at the inauguration of Donald J. Trump, Ms. Pearl did something that a Rockette is never supposed to do. She stepped out of line, breaking with the silent, smiling solidarity that defines the    institution, to denounce the idea of celebrating a man with a   history of objectifying women. In a rare collision of presidential politics and a venerable arts organization, current and former Rockettes find themselves in a new kind of spotlight  —   a position both painful and empowering  —   as they take sides over the inauguration, a split illustrating the cultural divide that   Trump has cleaved through the country. “We are a group of women that is encouraging young girls to be strong, independent women, to fulfill their dreams, to go for it,” Ms. Pearl, 27, said in her first interview since the inaugural uproar began. “It’s about women’s rights. ” But Patty DeCarlo Grantham, the president of the Rockette Alumnae Association, which has about 550 members, said that many of them are upset about the furor and support the Rockettes performing at the inauguration, as they did in 2001 and 2005. “So many people wrote to me and said, ‘I feel so ashamed about what’s going on,’” said Ms. Grantham, 76. “We feel like it’s a great honor to be asked to dance. ” Best known as a Christmastime tourist attraction at Radio City Music Hall, the Rockettes are also regarded in artistic circles as some of the finest dancers in New York City. But the controversy has reignited sensitivities within the corps that they are seen as beauty pageant contestants more than skilled performers and that they are easy to lampoon. On last weekend’s episode of “Saturday Night Live,” Alec Baldwin, portraying Mr. Trump, said of the inauguration lineup, “Best of all, we’ve got the one Rockette with the least money in her savings. ” Dottie   a    former Rockette, said, “Here you have the most sophisticated women that are so well respected in this country. ” She added, “To put them on the same stage as this man, to me, is reprehensible. ” The individual Rockettes had no say in the inauguration booking: It was ultimately the decision of James L. Dolan, the executive chairman of the Madison Square Garden Company, which manages the Rockettes. Mr. Dolan is a longtime friend of Mr. Trump and donated to his campaign he has supported both Democrats and Republicans in the past. A company spokesman, Barry Watkins, declined requests for interviews with Mr. Dolan and current leaders and members of the Rockettes. Mr. Watkins, in response to written questions about the Rockettes as well as the inauguration performance, wrote by email, “The New York Times has had an   Trump agenda for quite some time and now the Rockettes are on the receiving end of their bias. ” This article is based on interviews over the last three weeks with Ms. Pearl, who was a Rockette until this month, and nine former Rockettes, as well as others in the extended Rockette organization. Several people spoke anonymously for fear that if they were to speak publicly, the Madison Square Garden Company would take legal action against them. The backlash over the inauguration performance began on Twitter and Facebook after Ms. Pearl wrote a private Instagram post. “I am speaking for just myself, but please know that after we found out this news, we have been performing with tears in our eyes and heavy hearts,” Ms. Pearl wrote. She believes a friend of hers shared her photo with the celebrity gossip blog Perez Hilton. She and her fellow performers would later learn that their performance at the inauguration would not be mandatory, as some feared, but it was too late to stop criticism from strangers who took to social media to tell her to shut up and dance. Supporters wondered whether she and her fellow dancers were under a gag order. A news crew, Ms. Pearl said, showed up at her Harlem apartment. That sort of attention came as a shock within the world of the Rockettes, which is devoted to a particular kind of   synchronicity, where no one person dominates the stage. A Radio City Rockette is a specialist in precision dance technique, a rare, regimented and intricate style that requires both athleticism and artistry. Rockettes must stand between    and       and uphold a standard of elegance, along with an expertise in tap, modern dance, jazz and ballet. They must hit positions with military exactitude. It’s a style that requires a dancer to step into a line  —   not to take over and not to be left behind. It takes fortitude and humility. “You don’t realize how much individuality you have as a dancer until you’re asked to dance like 35 other women,” said Jessica McRoberts, 39, a former Rockette. “Things down to your pinkie finger. ” Under the leadership of Linda Haberman, who began directing and choreographing touring productions of the “Christmas Spectacular” in 1993, the Rockettes gained artistic respect and became modernized with more challenging choreography. Ms. Haberman left the organization in 2014 and declined a request for comment. Despite requests, the Madison Square Garden Company did not make the troupe’s current director, Karen Keeler, available for interviews. The rigors of performing and traveling as a company often allow dancers to form close and lasting bonds, according to Ms. Grantham, the alumnae president, who was a Rockette from 1959 until 1970. Ms. Grantham said that the Rockettes have a long history of performing for presidents and at events in New York City hosted by both Republicans and Democrats. “One time we did benefits for both parties in one night,” she said. “One was at the Sheraton, and the other was at the Hilton. ” This wouldn’t be the first time the Rockettes performed for a controversial president, but the volatile media climate surrounding Mr. Trump’s inauguration is unusual. Rhonda Malkin, a former Rockette who worked as a personal trainer to Ivanka Trump and Jared Kushner for two years, said that the Trump and Kushner families were supportive of her career as a Rockette. Once, they attended a performance to see her dance. “I think they would like to see the Rockettes perform at the inauguration,” she said of the Trump family. “Whether or not that causes a rift throughout the brand is yet to be seen. ” Ms. Malkin, 38, said that several of the current Rockettes she knows are upset that a crew of 13   Rockettes were initially told by their union, the American Guild of Variety Artists, that they would be forced to perform. “There are some career Rockettes who are very upset about this,” Ms. Malkin said of the inauguration plans. “I’ve also heard the women of color are very upset. From what I have heard, it has just caused a real rift in the company. ” Ms. Malkin, who was a Rockette for 12 years, said Ms. Pearl “took a real risk” for speaking out, but she doubts that the controversy surrounding the inauguration has caused any lasting damage to the brand. “I would honestly say that the majority of our audience members are white Christian conservative people,” Ms. Malkin said. “And those folks probably supported Trump. ” Of Mr. Dolan, the Madison Square Garden chairman, she added, “He knows those are the people who buy tickets to those shows. ” While the Rockettes are an American symbol  —   as much as Radio City Music Hall or Mr. Trump and his branded buildings  —   the group’s individual dancers remain fairly anonymous. They don’t speak unless deemed   by the Madison Square Garden Company, which has fiercely protected them against criticism surrounding the inauguration. “For a while we weren’t allowed to say, ‘I’m going to be on the ‘Today’ show with the Rockettes tomorrow morning,’” said Naomi Kakuk, 40, a former Rockette. “You’d say: ‘Watch the ‘Today’ show tomorrow  —   you might see a familiar face.’ We couldn’t even say we were on a show that was promoting the show. ” Mr. Dolan has been criticized for making the inauguration deal and guarding the Rockettes from media requests, but several former dancers praised his management style, which include generous benefits. Being a Rockette is among the most lucrative jobs a dancer can get in New York, complete with   health insurance even though the company performs on a seasonal basis. Ms. Kakuk, who loved her time as a Rockette, said, “You get six months of pay for three months of work, and it is six months’ worth of work in three months because it’s so incredibly intense. ” She added that some of the dancers live in New York during the Christmas show and then go home to Wisconsin or Florida to teach. “You have insurance for the year, you have a great paycheck, you do all these fun gigs and side things, and you’re doing the show and dancing on the great stage,” Ms. Kakuk said. “You’re skinny as hell when you get out. You’re bikini ready in January. It’s amazing. ” Cheryl Cutlip, who danced as a Rockette for 15 years and left the company in 2008, said that benefits were ushered in quickly after the TV company Cablevision bought Radio City Music Hall in 1997. Ms. Cutlip, 45, remembered Mr. Dolan meeting with the Rockettes to go over their basic needs. She said he gave them his personal email address. Soon, Rockettes no longer had to rush out of the door to find coffee and a bagel in the   space between performance preparations. “He started bringing food in,” Ms. Cutlip said of Mr. Dolan. “Once he saw the practical needs of the Rockettes, he started meeting them. ” For other former Rockettes, the current controversy reminded them of clashes between the dancers, their union and their corporate employer. Lora Pavilack, a former Rockette, said she had been locked out of the building twice, once for talking to the news media and, another time, during contentious negotiations over a union contract. “That’s the culture,” she said, “and that’s why they’ve lined up with the  . ” Ms. Malkin said that she was also locked out with Ms. Pavilack during contract negotiations in 2005. Madison Square Garden officials declined to comment for this article, but they have said in the past that no one had been locked out during contract negotiations. More than enough Rockettes wanted to perform at the inaugural, but Ms. Kakuk also knows some who are not participating. “I think some of them are done anyway,” she said, “and they were like, ‘This is the last straw, I’m out. ’” Ms. Pearl is one of them. On a recent evening, she ended weeks of silence by taking part in a toast to the First Amendment presented by the Bessies, or the New York Dance and Performance Awards. “People have been calling me courageous,” Ms. Pearl said at the toast, her voice cracking. “But I don’t see it that way. I’m just standing up for human rights. ” Many in the dance world, including Yvonne Rainer, the postmodern giant who was part of the toast, and several former Rockettes, including Ms. Kakuk, have voiced enthusiasm for Ms. Pearl’s action and her talent as a dancer. “When you see her onstage as a Rockette, you watch her,” Ms. Kakuk said. “She’s outspoken but less so than others. It was a bit of a surprise. ” With the latest holiday season behind her, Ms. Pearl has decided to leave the organization and forge a path in film and television. She found inspiration in the actress Meryl Streep, who spoke out against Mr. Trump at the Golden Globes. “She can speak freely,” Ms. Pearl said. “I wish to have the opportunity to speak as freely as I can, without any repercussion. ” But stepping out of the line is just not the Rockettes’ way. “Usually artists are more outspoken,” Ms. Kakuk said, “but Rockettes as a brand is not very outspoken. You work for a giant corporation, and a lot of girls don’t realize that. They just think they’re dancing. ”'"}, "time": 1742562630.0046837}