{"duration": 0.08948111534118652, "input_args": {"text": "'Rose Evansky, a British hairdresser who liberated women from the prison of the   domed dryer when she invented   styling at her London salon in the early 1960s, died on Nov. 21. She was 94. Her death was reported only recently by the British news media. There was no information on where she died. Mrs. Evansky, a Jewish refugee from Nazi Germany, set up as a hairstylist soon after World War II. She and her hairdresser husband, Albert, opened a small shop in Hendon, a London suburb, and did so well that, in 1954, they moved to Mayfair, where the city’s elite paid top money for    styling. One day in 1962, as she faced a tedious morning of chemical   and tight curling, tasks she disliked, inspiration struck. “I’d been wandering past a barbershop in Brook Street around the corner from our salon in North Audley Street, and I saw the barber drying the front of a man’s hair with a brush and a   dryer,” she told W magazine in 2012. “And this image  —   of the barber with the dryer  —   flashed through my mind and I thought, ‘Why not for women? ’” She experimented on one of her clients, a Mrs. Hay. “I picked up a spiky plastic hairbrush and a hand dryer and started rolling a wet section of her hair around the brush, followed by warm air from the hand dryer held in my left hand,” she wrote in a memoir, “In Paris We Sang” (2013). “The more sections of wet hair I rolled over the brush, the easier it became, and soon part of Mrs. Hay’s curly hair looked smooth, as if it had been brushed through from a set. Exciting!” One day by chance, Lady Clare Rendlesham, the editor of the British edition of Vogue, dropped by the salon and, witnessing a   in progress, stopped dead in her tracks. “What are you doing, Rose?” Mrs. Evansky recalled her shouting. Lady Clare immediately tipped off her friend Barbara Griggs, the fashion editor of The Evening Standard, who came in to behold the soft and flowing   style. That afternoon, the newspaper trumpeted the news of “the blow wave” to its readers. “This instantly earned her a reputation as one of the top hairdressers in London and went on to become the norm in hair drying,” Hairdressers Journal International wrote in 2012, celebrating the industry’s pioneers. Mrs. Evansky took quiet pride in getting women out from under the sizzling heat of the dome, and in the durability of her invention. “I always look at the prices of hairdressers now, and I say, my God, it’s still there: ‘’” she told an interviewer for the beauty brand Space NK in 2013. “How wonderful, 50 years later. ” She was born Rosel Lerner on May 30, 1922, in Worms, south of Frankfurt. Her parents were immigrants from Poland. In 1938, when the family was living in Ludwigshafen, her father was arrested and imprisoned in the Dachau concentration camp. Speaking only German and Yiddish, she was sent to Britain on one of the last Kindertransport trains that carried Jewish children out of Germany. She lived briefly with a family in Dudley, in the West Midlands, before moving to London, just in time for the Blitz. There, she apprenticed for a barber in Whitechapel, and distinguished herself with her zeal. “I worked and practiced till late at night on anyone who’d let me get at their hair,” she wrote in her memoir. As World War II raged, she embarked on her career, finding work at a salon near Regent Street. In 1943, she married Albert Evansky. When their marriage ended in divorce, her husband bought her share of the business. He sold it in the early 1980s. What Florence was to painting and sculpture during the Renaissance, Mayfair was to the art of hairstyling in the 1950s and ’60s. Mrs. Evansky sat atop the heap, the lone woman in a field monopolized by men. In “Vidal: The Autobiography,” Vidal Sassoon called her “without question the top female stylist in the country and the equal of any man. ” Her protégés included Leonard Lewis, known professionally as Leonard of Mayfair, who died on Nov. 30. Mrs. Evansky was in the forefront of the Mayfair style, which emphasized “freedom and movement, rather than contrived waves and curls,” Kim Smith of the University of East London wrote in her doctoral dissertation on West London hair salons. The Mayfair look led directly to the internationally celebrated styles associated with Swinging London and the likes of Jean Shrimpton, Julie Christie and Twiggy, who was a client of Mr. Lewis. In 1965, soon after leaving her husband, Mrs. Evansky married the playwright Denis Cannan, took his last name and moved with him to the countryside in East Sussex. He died in 2011. She is survived by two stepsons, Alexander and Nicholas Cannan a stepdaughter, Crescy Cannan and two  . Her own hair was naturally  . “My hair is best described as ‘windswept,’ as I live near the sea,” she told W magazine. “I’ve never colored it, and I cut it myself. Why would I let anyone else when I can do it myself?”'"}, "time": 1742561706.745302}