{"duration": 0.12842369079589844, "input_args": {"text": "'DALLAS  —   President Obama said on Tuesday that the nation mourned with Dallas for five police officers gunned down by a black Army veteran, but he implored Americans not to give in to despair or the fear that “the center might not hold. ” “I’m here to insist that we are not as divided as we seem,” Mr. Obama said at a memorial service for the officers in Dallas, where he quoted Scripture, alluded to Yeats and at times expressed a sense of powerlessness to stop the racial violence that has marked his presidency. But Mr. Obama also spoke hard truths to both sides. Addressing a crowd of 2, 000 at a concert hall, the president chided the police for not understanding what he called the legitimate grievances of   who he said were victims of systemic racial bias. “We cannot simply turn away and dismiss those in peaceful protest as troublemakers or paranoid,” Mr. Obama said to applause. “We can’t simply dismiss it as a symptom of political correctness or reverse racism. To have your experience denied like that, dismissed by those in authority, dismissed perhaps even by your white friends and   and fellow church members again and again and again  —   it hurts. ” But the president also turned to the protesters of the Black Lives Matter movement and said they were too quick to condemn the police. “Protesters, you know it,” Mr. Obama said. “You know how dangerous some of the communities where these police officers serve are, and you pretend as if there’s no context. These things we know to be true. ” It was the poignant speech of a man near the end of his patience about a scourge of violence that he said his own words had not been enough to stop. Mr. Obama spoke after a week in which the police killed two black men, in Minnesota and Louisiana, and Micah Johnson, the Army veteran, killed the five officers in Dallas. “I’ve spoken at too many memorials during the course of this presidency,” Mr. Obama said. “I’ve hugged too many families. I’ve seen how inadequate words can be in bringing about lasting change. I’ve seen how inadequate my own words have been. ” He acknowledged that the Dallas killings  —   “an act not just of demented violence but of racial hatred”  —   had exposed a “fault line” in American democracy. He said he understood if Americans questioned whether the racial divide would ever be bridged. “It’s as if the deepest fault lines of our democracy have suddenly been exposed, perhaps even widened,” Mr. Obama said. “And although we know that such divisions are not new, though they have surely been worse in even the recent past, that offers us little comfort. ” Americans, he said, “can turn on the TV or surf the internet, and we can watch positions harden and lines drawn, and people retreat to their respective corners, and politicians calculate how to grab attention or avoid the fallout. We see all this, and it’s hard not to think sometimes that the center won’t hold and that things might get worse. ” But Mr. Obama insisted on holding out hope. “Dallas, I’m here to say we must reject such despair,” Mr. Obama said, adding that he knew that because of “what I’ve experienced in my own life, what I’ve seen of this country and its people  —   their goodness and decency  —   as president of the United States. ” He cited both the Dallas police and protesters as part of that decency. “When the bullets started flying, the men and women of the Dallas police, they did not flinch and they did not react recklessly,” Mr. Obama said. “They showed incredible restraint. Helped in some cases by protesters, they evacuated the injured, isolated the shooter and saved more lives than we will ever know. We mourn fewer people today because of your brave actions. ‘Everyone was helping each other,’ one witness said. ‘It wasn’t about black or white. Everyone was picking each other up and moving them away. ’” Mr. Obama concluded: “See, that’s the America I know. ” A row of police officers behind Mr. Obama in the concert hall did not clap when Mr. Obama spoke of racial bias in the criminal justice system, saying that “when all this takes place more than 50 years after the passage of the Civil Rights Act, we cannot simply turn away and dismiss those in peaceful protest as troublemakers or paranoid. ” But when Mr. Obama added, “We ask the police to do too much, and we ask too little of ourselves,” the officers behind him applauded. Law enforcement officials who attended the service broadly welcomed Mr. Obama’s remarks. “To me, this is one of his best speeches I’ve ever heard,” said Chief Warren Asmus of the Los Angeles County Sheriff’s Department, who saw the speech as a milestone in the acrimonious national debate about policing and race. “He started to build that bridge that I think hasn’t been built for a long time,” Mr. Asmus said. “From what I heard today, I see it as a turning point. ” But Chief Terrence M. Cunningham of the Wellesley, Mass. police said that while he liked much of Mr. Obama’s speech, he was concerned about the president’s discussion of the shootings by the police in Louisiana and Minnesota, which remain under investigation. “It’s almost like he’s put his thumb on the scale a little bit,” he said. “Let’s let the facts come in. ” Some protesters responded positively to Mr. Obama’s remarks. “I liked his speech,” said Dominique Alexander, the founder of Next Generation Action Network, an activist group in Dallas that organized the protest the night of the shooting. The president, he said, “did a good job” in a situation where “both sides are mourning, both sides are hurting. ” Many conservatives were angry about a reference Mr. Obama made in his remarks to gun control, when he said that “we flood communities with so many guns that it is easier for a teenager to buy a Glock than get his hands on a computer or even a book. ” Three others spoke at the memorial, including former President George W. Bush, a Dallas resident who said his city was not prepared for the evil visited upon it on Thursday, nor could it have been. “Today the nation grieves, but those of us who love Dallas and call it home have had five deaths in the family,” Mr. Bush said. He said the forces pulling the country apart sometimes seemed greater than the ones bringing it together. “Too often we judge other groups by their worst examples while judging ourselves by our best intentions,” Mr. Bush said to applause. “And this has strained our bonds of understanding and common purpose. ” The memorial was held in the Morton H. Meyerson Symphony Center, a cavernous concert hall with a massive   organ dominating the back of the stage. Nearly all of the auditorium’s seats were filled, many with men and women wearing blue police uniforms from places like Massachusetts and South Carolina, and from towns throughout Texas, like League City, Huntsville, Robinson and La Marque. They walked into the hall under a giant American flag strung from fire trucks. On one side of the stage, five seats sat empty except for uniform hats and folded American flags to memorialize the five dead.'"}, "time": 1742564031.0573568}