{"duration": 0.13111448287963867, "input_args": {"text": "'We’re fresh over the Canadian border, in a supermarket on Vancouver Island gathering supplies for our first night on the road. There are three of us, and as we come together at checkout and pile our dinner ingredients onto the conveyor belt, the woman at the register doesn’t seem to know what to make of us. She watches our selections roll toward her: a rotisserie chicken, instant mashed potatoes, spinach, marshmallows, bottled water. We are three young women wearing motorcycle jackets and heavy boots, bandannas knotted around our necks. Lindsay asks her to add a bundle of firewood to the tally, and suddenly our presence here, just down the road from the Bamberton campground, clicks into place for her. “Did you leave your men at the campsite?” she asks. We laugh, not meaning to be rude, but the question strikes us as absurd. “Nope,” Lindsay tells her. “We left the men at home. ” She is confused and intrigued. Another woman comes to bag our purchases, and we chat with them both for a moment about the campground up the road, about our journey and about the fact that our men were not invited. The assumption that there are men waiting for us anywhere at all is a tangle for another day. They are excited for us, are thrilled to learn about our motorcycle adventure  —   from Seattle to Banff, then back across through Montana, Idaho and Washington. “Have the best time,” they say. We thank them, gather up our bags and head out to the parking lot, scooping up our firewood on the way. In the fading light, we pack up our two motorcycles with the purchases. We stash the bags and a   of bottled water in the leg space of the sidecar we have reserved for gear, then secure the firewood under a web of bungee cords. We’re quick about it, because we’re hungry and want to make camp before it gets dark. I get on one of the bikes and back it out of the parking spot. Jenny starts the other one while Lindsay climbs into the sidecar. “Hurry!” I yell over the engines, with mock urgency. “The men are waiting,” we shout together and gun it toward the   Highway. And it’s sort of true: There are men waiting. At every gas station and every diner and every campsite. They are waiting to ogle our   machines, to quiz us about our trip, to ask us about our experience as motorcycle riders. Women manage uninvited attention from men every day, but there’s something particularly alluring to the male   about a woman on a motorcycle. Two days in and we already know their lines of interrogation by heart. It’s not just the questions but the nonquestions that have begun to wear us down: “Let me give you directions [insert directions we don’t need]. ” “      friend rides motorcycles, too [insert random motorcycle story]. ” “Be careful [insert skeptical tone]. ” “I know things about sidecar motorcycles [insert inaccurate history lesson]. ” We take turns speaking with these interlopers, because there are just so many of them. Some are polite and curious and complimentary. Some are less so. As we wait for the ferry off Vancouver Island, a man with a neck tattoo ambles over and asks: “Did your fathers loan you these motorcycles? Or was it your uncles?” Jenny and I widen our eyes at each other in disbelief, and Lindsay tells him exactly what she thinks of his query. But we learn to put ridiculous moments like this behind us as we continue across British Columbia and Alberta. Near Whistler, we picnic on the shore of a lake. Outside Kamloops, we camp at the end of an abandoned dirt road, and in the morning we do doughnuts for so long the dust rises around us like a curtain. On our way to Banff, a tire blows out and, after struggling to change it by the side of the highway, we ride through the frigid, rainy night to make up the time I put on a midnight recital for Lindsay, who is huddled in the sidecar beside me, singing every Dolly Parton song I know. We look out on Banff’s lakes and pass through Calgary, and then, after days of rain, the weather becomes beautiful near the Montana border, where we stop for a field of yellow flowers. Along the way, every time we see a man on an expensive motorcycle, we nudge one another and whisper, “Did your mom loan you that?” After almost two weeks on the road, when we finally say goodbye, all I can think about is where I want to adventure next with these women.'"}, "time": 1742562036.9123478}