{"duration": 0.06738996505737305, "input_args": {"text": "'David Brock’s   media “watchdog” Media Matters for America is “engaging with Facebook behind the scenes” to shape the social network’s fight against “fake news,” according to a report by the Washington Free Beacon. [A document posted by the Washington Free Beacon outlines Media Matters’ plans to battle the “fake news” and “propaganda” that they believe led to the election of Donald Trump. Describing their relationship with Facebook, the documents states, “Media Matters will serve as their partner,” and that Media Matters’ goal is to help Facebook “adjust its model to stem the flow of damaging fake news on its platform’s pages. ”   “We’ve been engaging with Facebook leadership behind the scenes to share our expertise and offer input on developing meaningful solutions,” it continues. Media Matters pressured Facebook during the 2016 election to focus on the “fake news” they believed to be spreading across social media.  The document also claims, “After Facebook responded to our campaign by acknowledging the problem of fake news and agreeing to do something about it, we began a dialogue. It became clear from these conversations that Facebook needed our help in fully understanding the problem and identifying concrete solutions. ” The document also claims that Media Matters has been working with Google to identify sources of “fake news”: Similarly, after Google revised their terms of service in order to prohibit   fake news sites from using their advertising network, it was Media Matters that had the information necessary to identify 40 of the worst fake news sites to which this policy applied.  The document further claims that “Google will cut off these pages’ accompanying sites’ access to revenue by pulling their access to Google’s ad platform. ” Google has recently updated their AdSense policies leading to the banning of as many as 200 websites. David Brock stated in a speech at the retreat that “fake news” was one of the key issues that Media Matters must fight against, calling the organization “the top watchdog against fake news and propaganda. ”  Brock claimed that with the financial support of donors, Media Matters would ensure that “Internet and social media platforms, like Google and Facebook  …     no longer uncritically and without consequence host and enrich fake news sites and propagandists. ” Facebook has been accused in the past of censoring conservative news sites. In response, Facebook CEO Mark Zuckerberg held a meeting with conservatives to assure them of his dedication to free speech. Recently there have been rumors that the young tech billionaire is considering a movement into politics, a rumor backed up by close friends that say Zuckerberg “wants to be emperor. ” When asked for comment, a Facebook spokesperson told Breitbart, “We think it’s important to understand how people use and experience our platform, which is why we talk openly with groups, organizations and media outlets that span the political spectrum. ” Google declined to provide comment to the Washington Free Beacon. Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742561776.278624}