{"duration": 0.03180980682373047, "input_args": {"text": "'NTEB Ads Privacy Policy PLAY BALL! Both Mexico And Canada Say They’re Willing To Redo NAFTA With President Donald Trump Canadian Prime Minister Justin Trudeau said Thursday he is willing to renegotiate the North American Free Trade Agreement (NAFTA), which US President-elect Donald Trump has said he wants to change or scrap. by Geoffrey Grider November 10, 2016 How refreshing is it to have a president who actually wants America to succeed Donald Trump criticized the North American Free Trade Agreement as a U.S. job killer, saying he would be willing to scrap the pact if Canada and Mexico were unwilling to budge. But lo and behold, guess what? Turns out no threats needed as both Mexico and Canada are voluntarily coming to the table right now. Ahh, this is the America I know and love so much. Strong, compassionate and putting America and it’s people first. Thank you, president Trump, what an awesome 4 years it’s going to be. Canadian Prime Minister Justin Trudeau said Thursday he is willing to renegotiate the North American Free Trade Agreement (NAFTA), which US President-elect Donald Trump has said he wants to change or scrap. During the campaign, Trump called NAFTA the worst trade deal the United States has ever signed, while proposing protectionist measures to repatriate American jobs lost to free trade. Donald Trump’s 7-point trade plan: No TPP, renegotiate NAFTA: \\nWatch this video and see one of the many reasons Americans overwhelmingly chose Donald Trump to lead our nation. “I think it’s important that we be open to talking about trade deals,” Trudeau — a fierce defender of free trade, which helps bolster the Canadian economy — told reporters. “If the Americans want to talk about NAFTA, I’m more than happy to talk about it,” he said, adding that it was important to periodically reassess trade deals to ensure that they continue to be of benefit to Canadians. Trump wants to rip apart NAFTA: \\nWatch this video and see one of the many reasons Americans overwhelmingly chose Donald Trump to lead our nation. \\nMexico is willing to “modernize” the North American Free Trade Agreement with U.S. President-elect Donald Trump’s incoming administration and Canada, but will not renegotiate the pact, the foreign minister said. \\nForeign Minister Claudia Ruiz Massieu said NAFTA has “yielded great results” for the three nations, but that there is an opportunity to make it “more beneficial” to all. \\n“We are willing to talk about this with the new government and with Canada as well,” Ruiz Massieu told CNN late Wednesday . SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742563323.7600162}