{"duration": 0.03817296028137207, "input_args": {"text": "'Mon, 24 Oct 2016 00:00 UTC © drshel.com Researchers at Oregon State University have found that a specific detoxification compound, glutathione, helps resist the toxic stresses of everyday life -- but its levels decline with age and this sets the stage for a wide range of age-related health problems. A new study, published in the journal Redox Biology , also highlighted a compound -- N-acetyl-cysteine, or NAC -- that is already used in high doses in medical detoxification emergencies. But the researchers said that at much lower levels NAC might help maintain glutathione levels and prevent the routine metabolic declines associated with aging. In that context, the research not only offers some profound insights into why the health of animals declines with age, but specifically points to a compound that might help prevent some of the toxic processes involved. Decline of these detoxification pathways , scientists say, are causally linked to cardiovascular disease, diabetes and cancer , some of the primary causes of death in the developed world. \"We\\'ve known for some time of the importance of glutathione as a strong antioxidant,\" said Tory Hagen, lead author on the research and the Helen P. Rumbel Professor for Health Aging Research in the Linus Pauling Institute at OSU. \"What this study pointed out was the way that cells from younger animals are far more resistant to stress than those from older animals,\" said Hagen, also a professor of biochemistry in the OSU College of Science. \"In young animal cells, stress doesn\\'t cause such a rapid loss of glutathione. The cells from older animals, on the other hand, were quickly depleted of glutathione and died twice as fast when subjected to stress. \"But pretreatment with NAC increased glutathione levels in the older cells and largely helped offset that level of cell death.\" Glutathione, Hagen said, is such an important antioxidant that its existence appears to date back as far as oxygen-dependent, or aerobic life itself -- about 1.5 billion years. It\\'s a principal compound to detoxify environmental stresses, air pollutants, heavy metals, pharmaceuticals and many other toxic insults. In this study, scientists tried to identify the resistance to toxins of young cells, compared to those of older cells. They used a toxic compound called menadione to stress the cells, and in the face of that stress the younger cells lost significantly less of their glutathione than older cells did. The glutathione levels of young rat cells never decreased to less than 35 percent of its initial level, whereas in older rat cells glutathione levels plummeted to 10 percent of their original level. NAC, the researchers said, is known to boost the metabolic function of glutathione and increase its rate of synthesis. It\\'s already used in emergency medicine to help patients in a toxic crisis, such as ingestion of poisonous levels of heavy metals. It\\'s believed to be a very safe compound to use even at extremely high levels -- and the scientists are hypothesizing that it might have significant value at much lower doses to maintain glutathione levels and improve health. \"I\\'m optimistic there could be a role for this compound in preventing the increased toxicity we face with aging, as our abilities to deal with toxins decline,\" Hagen said. \"We might be able to improve the metabolic resilience that we\\'re naturally losing with age.\" Also of interest, Hagen said, is the wide range of apparent detoxification potential offered by glutathione. Higher levels of it -- boosted by NAC -- might help reduce the toxicity of some prescription drugs, cancer chemotherapies , and treat other health issues. \"Using NAC as a prophylactic, instead of an intervention, may allow glutathione levels to be maintained for detoxification in older adults,\" the researchers wrote in their conclusion. Journal Reference: Nicholas O. Thomas, Kate P. Shay, Amanda R. Kelley, Judy A. Butler, Tory M. Hagen. Glutathione maintenance mitigates age-related susceptibility to redox cycling agents. Redox Biology, 2016; 10: 45 DOI: 10.1016/j.redox.2016.09.010 Comment:'"}, "time": 1742628576.815439}