{"duration": 0.061795949935913086, "input_args": {"text": "\"Trump Jr. Suspiciously Helps Arizona Woman Push Stalled Car, Uses It As A Photo Op (VIDEO) By Stephanie Kuklish   \\nIt is amazing how Trump Jr., known for his rich boy attitude, would suddenly feel the need to get out and help push a stalled car while campaigning in, the now swing state, Arizona . \\nOf course, he didn’t leave without a photo op or video footage being recorded. Tyler Bower, the Maricopa County Republican Party Chairman, posted the footage on Twitter and told the Arizona Republic : “She was just stunned. She was taken aback.” This is why I'm voting Trump! @DonaldJTrumpJr helping push a ladies car off the road in 101 degree heat in Arizona after a rally today #MAGA pic.twitter.com/ngp1ZhS8Wm \\n— Tyler Bowyer (@conservatyler) October 27, 2016 \\nEven the woman who Trump Jr. helped was extremely surprised that any politician would stop to push a car to the side of the road. And seeing as Arizona has been stampeded by Republican rallies this season, it’s a little hard to believe this just happened to take place in Arizona. AZCentral talked about Trump’s presence in the swing state stating : “Donald Trump, whose grip on Arizona’s 11 electoral votes appears to be in jeopardy, will appear in downtown Phoenix for a Saturday rally, his seventh Arizona event this election season.” \\nArizona, a historically red state through and through, has now been determined as a swing state for the 2016 election season. Arizona residents began evening out their party preference when Republican presidential nominee, Donald Trump, started making insane remarks about building walls to keep out immigrants and having Mexico pay for it. We are sure his tasteless conversations and sexual assault allegations didn’t help the situation at all. \\nArizona being a border state is no stranger to immigrant issues, but even with Trump’s hardcore attack on border patrol, Arizona residents still think he is a little hard to swallow. A collaborated effort between The Arizona Republic , Morrison Institute For Public Policy , and The Cronkite School of Journalism and Mass Communication resulted in a poll showing Democratic presidential nominee, Hillary Clinton pulling ahead of Trump in the election. Data from Arizona Republic/Morrison/Cronkite News poll from Oct.10-15,2016 \\nIf Arizona votes for Hillary Clinton it will be the second non-red candidate that Arizona has ever voted for, the last being Mrs. Clinton’s husband, Bill Clinton in 1996. \\nThough Trump Jr. made an interesting choice when showing his caring side, we still don’t think it will help his dad win over, what should have been, one of the easiest states for the Trump campaign to snag. \\nFeatured Image Via Tyler Bowyer/Twitter About Stephanie Kuklish \\nI am a 30 something writer passionate about politics, the environment, human rights and pretty much everything that effects our everyday life. To stay on top of the topics I discuss, like and follow me at https://www.facebook.com/keeponwriting and https://facebook.com/progressivenomad . Connect\""}, "time": 1742561685.2735457}