{"duration": 0.05354475975036621, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / Anonymous Release Bone Chilling Video of Huma Abedin that Every American Needs to See Essential Reading The Crucifixion of Jews Must Stop! By wmw_admin on August 21, 2010 \\nThe sacrifice of “six million Jews” was being talked about before Hitler rose to power. A photocopy from the American Hebrew dated Oct. 1919, speaks openly about a holocaust of six million Jews before declaring “Israel is entitled to a place in the sun”!! Adam Weishaupt By wmw_admin on June 29, 2005 \\nThe founding of the Illuminati and one of the key players behind the genesis of the New World Order The Anglo-Saxon Mission Part II By wmw_admin on March 1, 2010 \\nFormer City of London insider reveals that the depopulation program would begin with a planned war between Israel and Iran. More importantly, he goes onto to describe how we can derail their plans for global dominance The 9/11 Solution: The Big Clue Everyone Missed By wmw_admin on July 21, 2008 \\nGoogle removed this video but a reader sent in a copy. Watch how the media carefully manipulates coverage of the events of 9/11, as they interview ‘experts’ who provide the cover story that has gone to make up the standard govt/media version of 9/11 Before and after the “Holocaust”: Jewish population numbers in 1933 and 1948 By wmw_admin on November 30, 2013 \\nDuring the time Hitler was supposed to have killed six million Jews — between 1933 and 1948 — the world’s Jewish population actually increased from 15,315,000 to 15,753,000 Who Are The Illuminati? By wmw_admin on April 24, 2004 \\nConspiracy theory is now an accepted turn of phrase but sometimes one hears the expression, sometimes whispered rather than spoken. “The Illuminati”. The Liberation of the Camps By wmw_admin on January 27, 2016 \\nIt is tantamount to virtual heresy to question the ‘Holocaust’ today. But did the extermination of 6 million really happen as we’ve been taught?\""}, "time": 1742561868.8944438}