{"duration": 0.18335485458374023, "input_args": {"text": "'Share This: Joseph Kishore and David North, wsws.org A s millions of Americans go to the polls today, a mood of anger and frustration prevails throughout the country. On Sunday, CBS News’ 60 Minutes featured a focus group discussion of the elections. When asked by pollster Frank Luntz for a word to describe how they felt about the more than a year-and-a-half election campaign, the participants responded: “terrified,” “exasperating,” “horrifying,” “disgusted” and “nightmare.” The fact that the two main candidates, Democrat Hillary Clinton and Republican Donald Trump, are the most widely despised in the history of presidential politics has been substantiated in innumerable polls. But the contempt felt toward the two candidates expresses a deeper alienation from the entire structure of official capitalist politics. The candidates and the media have ignored the social, economic and political issues that concern the overwhelming majority of the people. The official election “debates”—in which each candidate denounced the other’s criminality—embarrassed and disgusted the electorate. Both Clinton and Trump personify, each in their own way, the corrupt and reactionary character of the political system. What is the choice that has been given the American people? It is hard to say which of the candidates offered by the two parties is more right-wing, the difference being more a matter of style than substance. While the demagogue Trump is trying to direct social discontent along fascistic lines, Clinton is using the cynical narrative of race and gender to provide a “progressive” mask for an agenda of war and the continuation of economic policies that have guaranteed an endless flow of cash into the pockets of the super-rich. The verdict of Wall Street on its prospects under a Clinton presidency could be seen in the reaction of stock markets to the announcement by FBI Director James Comey that the agency is not pursuing criminal charges against Clinton over her emails. The Dow Jones Industrial Average soared 371 points. The Clinton campaign has marshaled behind it significant sections of the Republican Party establishment, including many of the neoconservative architects of the 2003 invasion of Iraq. The Democratic Party campaign, well aware of its candidate’s unpopularity, is relying on the oldest form of political blackmail to bring out the vote for Hillary Clinton. She is, the party and its apologists insist, the “lesser evil.” As bad as Clinton is, the argument goes, she must be supported to avert the disaster that would inevitably follow the election of Trump. The problem with the “lesser evil” argument is that it leads to results that are worse than what those who voted one way or the other were hoping to prevent. The “terrible Trump” theory of American politics explains nothing. The nomination of this absurd and obscene blowhard is itself an outcome of the deep crisis of American society. He is the political equivalent of the metastatic spread of a primary and deadly tumor. Trump is the product of a corporate-dominated political culture, which, for at least the last 40 years, has promoted social backwardness and reaction. However, it is too simple to blame Fox News, talk radio and campaign finance laws for the nomination of Trump. The popular response to his demagogic slogans reflects genuine social distress. Many workers who are planning on voting for him today previously backed the Democratic Party campaign of Vermont Senator Bernie Sanders. One of the main consequences of Sanders’ efforts to channel his “political revolution” behind Clinton was to guarantee that social anger and hostility to the status quo would be identified with the political right. In the final analysis, Trump’s rise is a product of the political bankruptcy of the Democratic Party. Unable to present a positive political message that can attract mass support, Clinton has waged her campaign against Trump on the lowest and most reactionary level. First, the Democrats and their media flacks have denounced Trump as an agent of the Russian president, asserting that Vladimir Putin is seeking to influence the elections by hacking Democratic Party emails. This claim has been endlessly repeated without any factual substantiation. The repackaging of McCarthyite red-baiting, with Russia replacing the Soviet Union, has been used to distract attention from the content of the emails released by WikiLeaks. The Democratic Party campaign, well aware of its candidate’s unpopularity, is relying on the oldest form of political blackmail to bring out the vote for Hillary Clinton. She is, the party and its apologists insist, the “lesser evil.” As bad as Clinton is, the argument goes, she must be supported to avert the disaster that would inevitably follow the election of Trump. More dangerously, the relentless anti-Putin propaganda has been employed by Clinton to legitimize a massive escalation of military operations in Syria and against Russia in the aftermath of the election. The extreme danger of world war, which has been ignored throughout the election, was underscored by the announcement Monday that NATO is placing 300,000 troops on high alert, supposedly in response to Russian aggression. Second, as the election reached its final stage, the Democrats escalated their hysterical slanders based on the claim that Trump’s support is coming from “privileged” white workers motivated by the racist desire to return to an era when they ruled the country. Clinton has centered her campaign on a racialist narrative that denies the deep social anger felt among workers of all races. In terms of social policy, Clinton is pledged to continue the policies of the Obama administration, which has overseen a massive transfer of wealth to the rich and the return of social inequality to the historic levels that prevailed in the first decades of the twentieth century. In the days leading up to the election, millions of workers were confronted with the news that their health insurance premiums will rise by double digits, the outcome of Obama’s signature domestic initiative, the misnamed Affordable Care Act. Regardless of the outcome, today’s vote will not solve anything. Nothing that happens on Election Day is going to lead to a rise in living standards, resolve any of the great social problems facing the working class, or put an end to the danger of world war. It will only establish the framework for the next stage of the political crisis in the United States. This political crisis will have far-reaching and global consequences. Media commentators internationally have followed what is happening in the United States with a mixture of shock and horror. Edward Luce, writing in the British Financial Times , sums up the prevailing anxiety in a comment published Sunday under the headline, “American democracy’s gravest trial.” The American political system, he writes, is “teetering, whatever the outcome of the US elections.” Luce asks his readers to “imagine two kinds of threat: one where a bear [Trump] breaks into your cabin, the other where termites eat it from within.” The good thing about a bear, he writes, “is that you can see it coming.” In contrast, “Termites are invisible. It is hard to pinpoint when they began to eat away at the foundation. When and why did Americans lose faith in their system?” The reactionary spectacle of the 2016 elections is the product of protracted decay. Twenty-five years ago, the ideologists of American capitalism proclaimed that the dissolution of the Soviet Union marked the “end of history,” with the United States, the dominant and unchallenged world power, guaranteeing liberal democracy the world over. If nothing else, this election will forever bury this reactionary fantasy. The crisis confronting the United States today is no less profound than the situation that faced the Stalinist regime in the Soviet Union a quarter-century ago. Four decades of declining living standards and growing social inequality, a quarter-century of unending war, fifteen years of the “war on terror” accompanied by a vast expansion of the power of the military-intelligence apparatus: These are the pressures that are tearing the democratic fabric apart. Nor is the crisis expressed in this election a uniquely American phenomenon. It is paralleled by global shocks such as the Brexit referendum in Britain, the rise of far-right and fascistic movements throughout Europe, and the general discrediting of political institutions throughout the world. Underlying everything is a crisis of world capitalism, manifested in an expanding imperialist war drive that threatens the entire planet, and the growth of the class struggle, which is the objective foundation for socialist revolution. The time for pragmatic “lesser evil” politics has long since passed. The pressing and urgent necessity is to build a party of the working class, uniting workers of every race, gender, nationality and ethnicity on a program that represents their class interests. NOTE: ALL IMAGE CAPTIONS, PULL QUOTES AND COMMENTARY BY THE EDITORS, NOT THE AUTHORS PLEASE COMMENT AND DEBATE DIRECTLY ON OUR FACEBOOK GROUP CLICK HERE \\nSELECT COMMENT (FROM ORIGINAL THREAD) WHICH POSES ONE OF THE MOST IMPORTANT QUESTIONS WE SHOULD BE CONFRONTING, AT THE PERSONAL AND SOCIAL LEVELS: The fact that tens of millions of civilians are participating at all at the polls — giving the ruling class the fig-leaf of legitimacy which it seeks and requires to cloak itself and to carry out its murderous agenda — illustrates the power of propaganda. Humans today in the US have access to more information than at any other time in history. Yet despite the knowledge that is available to us, despite the numerous examples of fascism, capitalist-imperialist aggression, and state violence and authoritarianism, people continue to obey, defer to, passively go along, and empower the ruling class criminals and this fascist system, stamping it with their seal of validation. You have courageous whistleblowers, journalists, and publishers risking their lives to enlighten the public about what the rulers would prefer to keep hidden–and the public fails to follow through. What exactly have people learned from our predecessors’ social movements and resistance? — Vivek Jain ABOUT THE AUTHOR Joseph Kishore and David North are editorial writers and geopolitical analysts with wsws.org, a socialist publication. Both authors, members of the Social Equality Party (Trotkyist) naturally recommend readers vote for their party in this election. As a rule, The Greanville Post, which uses Marxist analysis in its own interpretation of events, does not endorse any party or Marxian faction. Note to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. \\nWhat will it take to bring America to live according to its own propaganda? =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742563863.0674047}