{"duration": 1.1132123470306396, "input_args": {"text": "'USA Today’s Kelly Lawler falsely branded Breitbart Senior Editor MILO as a “white nationalist” and “racist,” while also claiming that he is a part of the “ ” movement, a claim MILO has repeatedly rebutted over the past few months. [In her article “Leslie Jones speaks out after harasser Yiannopoulos lands book deal,” Lawler branded MILO with numerous false labels, while also claiming that MILO sent “racist” abuse to actress Leslie Jones despite a complete lack of evidence to support these claims.  “After white nationalist and   poster boy Milo Yiannopoulos landed a massive book deal with a reported $250, 000 advance, publisher Simon  Schuster has come under harsh criticism from those concerned that a book will elevate the voice of the notorious Breitbart editor,” wrote Lawler. “Yiannopoulos made headlines earlier this year when he was permanently banned from Twitter for organizing a targeted racist and sexist harassment campaign against Ghostbusters [2016] and Saturday Night Live star Leslie Jones. ” Lawler, who previously worked for NPR and interned with Democratic congressman Patrick Murphy, is not the only journalist to have made false and unjust claims against MILO, with the New Yorker also falsely claiming that MILO led a “racist online harassment campaign against the comedian Leslie Jones. ” As previously reported by Breitbart News, Jones had already been engaging with Twitter trolls for hours before ever interacting with MILO. “If at first you don’t succeed (because you’re work is terrible) play the victim,” said MILO in reference to Jones on Twitter. “Everyone gets hate mail FFS. ” Breitbart’s Allum Bokhari also wrote on the issue, adding, “In other words, MILO has been permanently banned for little more than criticism, mild insults, and mockery. Meanwhile, [Breitbart’s] Jerome Hudson’s abuser, who repeatedly called the black reporter a ‘coon,‘ is still on the platform. ” MILO has also sparred with various white nationalist and fringe sections of the right, so much so that white supremacist site The Daily Stormer waged a “war” against him.   icon Richard Spencer has also dispelled claims that MILO is a part of the   stating simply that “Milo is not a part of the ” during a debate. Many white nationalists have also branded MILO a “  kike faggot,” declaring their distaste for him. Popular   outlet “The Right Stuff” also bluntly declared in an article that “Milo isn’t one of us,” while   “leading thought leader of ” Paul Town also rejected claims that MILO is anything close to a white nationalist or in a member of the   movement, branding him a “cultural libertarian. ” During numerous interviews, MILO has declared that he is not a member of the   nor a white nationalist —   a label, which he adds, many white nationalists are proud to associate with, however the media has frequently attempted to pin him to the movement.  Numerous celebrities and media figures have thrown public tantrums over MILO’s upcoming book release Dangerous, including Sarah Silverman, Judd Apatow, and Perez Hilton. Despite threats from the left to boycott publisher Simon and Schuster, the   version of Dangerous by MILO became the number one bestselling book on Amazon just a day after being announced and over two months before being released. DANGEROUS is available to   now via Amazon, in hardcover and Kindle editions. And yes, MILO is reading the audiobook version himself!  Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742562848.4355443}