{"duration": 0.07024812698364258, "input_args": {"text": "'Remnants of both vanquished American political empires, the Bushes and the Clintons, will attend   Donald J. Trump’s official swearing in as the next president of the United States, a major symbolic victory for the outsider and billionaire businessman who crushed both of them on his way to the White House. [Bill and Hillary Clinton —  the former president and first lady, the latter of whom was Trump’s general election opponent on Nov. 8 —  will attend the inauguration, according to a report in New York Magazine.  “Bill and Hillary Clinton have decided to attend the inauguration of Donald Trump as the 45th President of the United States, according to two sources with knowledge of their plans,” New York Magazine’s Yashar Ali wrote, adding later in his short piece on Tuesday afternoon: NEW: Pres. George W. Bush  wife will attend Donald Trump’s inauguration say they’re pleased to ”witness the peaceful transfer of power”  —   Hallie Jackson (@HallieJackson) January 3, 2017,  Former President Jimmy Carter, the failed Democratic president from the 1970s, will also be present —  as will outgoing President Barack Obama, who will officially transfer power to Trump on Jan. 20. It’s unclear whether former President George H. W. Bush, the elder Bush who succeeded the late former President Ronald Reagan, will attend. The elder Bush’s health has been an issue as of late. But the fact that both the Bushes and the Clintons will be present at Trump’s inauguration is a stunning development, as Trump’s meteoric rise to the White House went through both dynasties. Throughout the GOP primaries, Trump mocked and ridiculed George W. Bush’s younger brother former Florida Gov. Jeb Bush —  at the time the presumed GOP frontrunner who had millions upon millions of donor class dollars funneled into his campaign —  as “low energy. ” Trump ripped Jeb Bush apart, and blew past the other GOP candidates on his way to viciously winning the nomination to face off against Hillary Clinton in the general election. There, in the general election, Trump described Clinton as “Crooked Hillary” and even called “Heartless Hillary” at one point. He threatened to throw her in jail for her email scandal and her Clinton Foundation scandal —  something that still hasn’t been ruled out in the future —  as well as running one of the most vicious campaigns in American political history. He proved to be successful, winning a landslide 30 and a half states and 306 electoral votes on Nov. 8 —  officially closing the chapter of U. S. history where Americans had dynasties like the Bushes and the Clintons. Trump’s populist nationalist worldview once and for all defeated the globalist elitist Bushes and Clintons, and now they will witness him officially take power on Jan. 20 as Trump —  the   person to be elected to the highest office in the land without ever having served in government before —  takes the oath of office.'"}, "time": 1742561666.8908405}