{"duration": 0.06284570693969727, "input_args": {"text": "'PORTLAND, Ore. (KOIN) — The last person to surrender in the Malheur National Wildlife Refuge takeover was released from prison hours after being acquitted on federal conspiracy charges Thursday afternoon . \\nDavid Fry was found not guilty of conspiring to impede workers from doing their jobs at the refuge through threats, intimidation or force. He was also acquitted of a firearms charge. \\nThe Ohio resident spoke to KOIN 6 News before stepping onto the streets of downtown Portland for the first time in 9 months. \\nFry said he was excited to reunite with family and friends to celebrate the victory, adding that his plight to end corruption is far from over.“It’s a wonderful feeling… to be acquitted by the highest authority in this country,” Fry said. “I definitely feel this was divine intervention playing in this.” \\n“We’ve all got to work together and start making some changes because our governments worldwide aren’t for the people,” he said. “They’ve become the opposite.” \\nHe said guards at Multnomah County Jail treated him as if he were guilty, and that inmates are not often dealt with fairly or under the presumption of innocence. \\n“I guess this is the greatest example of why you don’t treat people as guilty because they can be acquitted,” Fry said. \\nFry was one of the last 4 holdouts at the refuge and helped broadcast the final days of the standoff through YouTube livestreams. He allegedly threatened to commit suicide while on the phone with FBI crisis negotiators before he surrendered. \\nDefense attorneys called his father, William Fry, to the witness stand to discuss his motives for joining the occupation. William said his son was “frustrated with corruption” and wanted to support Dwight and Steve Hammond, who he believed were falsely characterized as terrorists. \\nFry wanted to bring his computer equipment to Malheur, his father said, to broadcast what was going on and help people around the world understand the issue at hand.'"}, "time": 1742564190.2681675}