{"duration": 0.2485342025756836, "input_args": {"text": "'Posted on February 2, 2011 by Dr. Eowyn | 3 Comments \\nGeorge Washington said this in his first Inaugural Address in 1789: \\n“There exists in the economy and course of nature an indissoluble union between virtue and happiness … we ought to be no less persuaded that the propitious smiles of Heaven can never be expected on a nation that disregards the eternal rules of order and right which Heaven itself has ordained .” \\nThe Federal Bureau of Investigation (FBI) is supposed to be America’s elite police force, which upholds and is held to the highest moral-ethical standards. The FBI’s motto is “Fidelity, Bravery, Integrity”. \\nBut secret files reveal hundreds of FBI agents each year are disciplined for serious breaches of misconduct which include having sex with their sources and masturbating while watching porn at work. \\nAmerica’s first President weeps…. \\n~Eowyn \\nSex Files: FBI agents guilty of sleeping with sources, watching porn at work and searching files for addresses of ‘hot’ celebrities \\nBy Daniel Bates – Daily Mail – Feb 1, 2011 \\nIt is supposed to be the nation’s elite police force, working to the highest standards of all. But hundreds of FBI agents each year are in fact having to be disciplined for serious breaches of misconduct, secret files have revealed. \\nIn the past three years more than 1,000 FBI employees have been found guilty of inappropriate behaviour, including one agent who had a sexual relationship with a source. Another agent used FBI databases to get personal details about celebrities he thought were ‘hot’. And one male member of staff shared confidential information with his news reporter girlfriend, and then threatened to release a sex tape the two had made unless she kept it quiet. \\nThe litany of misconduct was detailed in confidential summaries of disciplinary rulings obtained by CNN. The disclosure threatens to undermine the FBI’s reputation for, as its own motto points out, ‘Fidelity, Bravery, Integrity’. The bureau could also face harsh criticism over its refusal to fire any of those caught out, even though the offences were of a grave nature. \\nAmong the toughest punishments was for the agent who had the seven-month sexual relationship with a source. He was suspended for 40 days. Another employee drunkenly ‘exploited his FBI employment’ at a strip club by falsely claiming he was conducting an official investigation. He was suspended for 30 days. In another case a supervisor who viewed pornography in his office during work hours, while ‘sexually satisfying himself’ (so the file states) got a 35-day suspension. And an employee in a ‘leadership position’ misused a government database to check on two friends who were exotic dancers and allowed them into an FBI office after hours was ordered to stay away from work for 23 days. \\nPresident of the FBI Agents’ Association Konrad Motyka said such behaviour was ‘never acceptable’. He added: ‘Demonstrable incorrect conduct or criminal conduct is not acceptable and never should be’. \\nFBI Assistant Director Candice Will defended the decision not to fire any of the employees caught out behaving inappropriately. She said that 500 cases of misconduct were referred to her in the bureau’s Office of Professional Responsibility each year. Of those around 70 per cent – or 350 – were disciplined, including 30 who were fired. \\nThe FBI employs 34,300 people, including 13,700 agents. \\nAssistant Director Will said: ‘We do have a no-tolerance policy. We don’t tolerate our employees engaging in misconduct. ‘We expect them to behave pursuant to the standards of conduct imposed on all FBI employees. It doesn’t mean that we fire everybody. You know, our employees are human, as we all are. We all make mistakes. So, our discipline is intended to reflect that. We understand that employees can make mistakes, will make mistakes. When appropriate, we will decide to remove an employee. When we believe that an employee can be rehabilitated and should be given a second chance, we do that.’ Rate this:'"}, "time": 1742564419.660891}