{"duration": 0.09445738792419434, "input_args": {"text": "'Leave a reply \\nDiane Canfield – Since there is only love – there is a separation with some that have not been loved and do not know what love is. This behavior when to the extreme can play out as what is termed sociopathic behavior. What is really- lack of love and separation from Source. \\nOne of the attributes of a sociopath is to accuse others of what they themselves are doing. This accomplishes two things for them, it takes the attention off of them and puts the victim in a defensive mode. \\nThe victim then has to try to explain themselves when it is actually the sociopath that should be doing the explaining. This is a common mechanism that is used by someone with no conscious and no connection to Source. \\nThey also feel they are above everyone else and untouchable. They may also be charming and likable by many. Yet few know the hidden secrets they carry and the way they manipulate others. \\nThey do not operate on the same code of ethics that most of us do. They operate on service to self, while making it look like they are service to others. \\nEmpaths are especially vulnerable to this because we have a tendency to “care too much”. We are the ultimate nurturers and support for others. This is the opposite of a sociopath that looks to use others for their own gain. \\nEnergetically they feel chaotic and not peaceful. They may seem to always be on edge waiting for someone to find them out. \\nWe can see this in all walks of life, in business, family and all places where there are high profile people. \\nThe answer to this is to love ourselves enough to be able to spot this immediately when we see it. We can not “care enough” to fix this person. They have to at some point learn to love themselves enough to work on themselves and learn how to genuinely care for others without expecting anything in return. \\nThe answer in the higher states is to have healing centers where they are shown what love is and how to love others – just for the sake of love. SF Source How To Exit The Matrix  '"}, "time": 1742563027.918542}