{"duration": 0.12091779708862305, "input_args": {"text": "'Students to Protest ‘Mikado’ for Lack of Engagement with Controversial Past Derek G. Xiao, Harvard Crimson, October 27, 2016 \\nA group of Asian American students is planning to protest the Harvard-Radcliffe Gilbert and Sullivan Players’ upcoming production of “The Mikado” for how it handles the racial stereotypes that characterize traditional performances of the opera. \\nOrganized by George S. Qiao ’18, the group of students had publicized their protest over various email lists, describing what they consider inadequate attempts to remove the Japanese stereotypes and appropriation of Japanese culture that remained latent in the adapted production’s storyline. But later Qiao said that he thought the tone of his initial concerns was unfair to the Players. \\n“I fully believe that members of the Gilbert and Sullivan Players put their blood, sweat, and tears into trying to improve this staging of the production,” Qiao said. “However, I believe that there is still insufficient critical engagement [with] this play’s history of Japanese cultural misrepresentation.” \\nPenned in 1884, “The Mikado” is a comical opera, set in the fictional Japanese town of Titipu and meant to satirically mask criticism of British political culture and bureaucracy with grossly exaggerated “Asian” names and stereotypical cultural caricatures. \\n{snip} Hoping to avoid these issues in their own production, the board of the Gilbert and Sullivan Players made some changes to the setting and script of the opera, characterizing their rendition as a “reimagining” of the original production. \\n“The board of the Harvard-Radcliffe Gilbert & Sullivan Players, whose mission is to produce the full canon of Gilbert and Sullivan’s shows, faced a dilemma this past January,” Kathleen C. Zhou ’17, the president of the Players, wrote in an op-ed for The Crimson Tuesday. “Strike ‘The Mikado’ from our season, and ignore one of the most problematic but well-known G&S; shows, or try to confront it by reimagining it and subverting authorial intent.” \\nThe setting of their show is no longer the 19th century town of Titipu, and instead is now 20th century “Las Vegas themed Oriental hotel.” And, the opening number “Gentlemen of Japan” has been rewritten as “Gentlemen of the Strip.” \\n{snip} \\nZhou said in an interview that in rethinking the comical opera’s script, the complete omission of all of the original production’s issues was “an erasure in itself in that it does not acknowledge how problematic the show has been to [Asians].” \\n{snip}'"}, "time": 1742564373.4239628}