{"duration": 0.15301251411437988, "input_args": {"text": "'George Michael, the   English songwriter who sold tens of millions of albums as a member of the duo Wham! and on his own, was found dead on Sunday at his home in Goring in Oxfordshire, England. He was 53. A police statement said: “Thames Valley Police were called to a property in    shortly before 2 p. m. Christmas Day. Sadly, a    man was confirmed deceased at the scene. At this stage the death is being treated as unexplained but not suspicious. ” Mr. Michael’s manager, Michael Lippman, told The Hollywood Reporter that Mr. Michael had died of heart failure “in bed, lying peacefully. ” “It is with great sadness that we can confirm our beloved son, brother and friend George passed away peacefully at home over the Christmas period,” his publicist Connie Filippello said in a statement. “The family would ask that their privacy be respected at this difficult and emotional time. There will be no further comment at this stage. ” Information on survivors was not immediately available. Mr. Michael was one of pop’s reigning stars in the 1980s and ’90s  —   first as a handsome, smiling   idol making lighthearted singles like “Wake Me Up Before You  ” with Wham! then arriving as a   pop sex symbol with his 1987 album “Faith. ” But Mr. Michael grew increasingly uncomfortable with the superficiality and relentless promotion of   pop stardom. He turned away from video clips and live shows he set out to make more mature statements in his songs, though he never completely abandoned singing about love and desire. [ Why George Michael mattered | Watch him perform live ] Mr. Michael wrote supple ballads, like “Careless Whisper” and “Father Figure,” as well as buoyant dance tracks like “Freedom ’90” and “I Want Your Sex. ” For much of his career, including his   albums “Faith” and “Listen Without Prejudice Vol. 1,” he was also his own producer and studio backup band. Much of his music drew on RB, old and new, but his melodic gift extended across genres. He won a Grammy Award in 1988 for “I Knew You Were Waiting (for Me),” a duet with Aretha Franklin, and “Faith” won the Grammy for album of the year. In Britain, he was showered with awards, and in 2004, Britain’s Radio Academy said he had been the   performer on British radio from 1984 to 2004. In 1998, Mr. Michael came out as gay after being arrested on charges of lewd conduct in a men’s room in Beverly Hills, Calif. He had long lent his name and music to support AIDS prevention and gay rights. During interviews in later years, he described himself as bisexual, and said that hiding his sexuality had made him feel “fraudulent. ” He also described long struggles with depression. During the 2000s, Mr. Michael’s output slowed his last studio album of new songs was “Patience” in 2004. In later years he put out individual songs as free downloads, encouraging listeners to contribute to charity. But in 2006, 25 years into his career, he could still headline stadiums worldwide. George Michael was born Georgios Kyriacos Panayiotou in East Finchley, London, on June 25, 1963, the son of a Greek Cypriot restaurateur and an English dancer. In 1979, he and a schoolmate, Andrew Ridgeley, played together for the first time in a ska band called the Executive. That didn’t last, but they continued to make music together  —   nearly all of it composed and sung by Mr. Michael  —   and began releasing singles as Wham! cultivating the image of carefree teenage rebels in songs like “Young Guns (Go for It! ). ” Their 1983 debut album, “Fantastic,” reached No. 1 in Britain in the United States, their 1984 single “Wake Me Up Before You  ” became ubiquitous on MTV and reached No. 1. In 1985, the duo became the first major Western pop group to perform in China as part of its world tour, and Mr. Michael appeared at the Live Aid charity concert, telecast worldwide, joining Elton John to sing Mr. John’s song “Don’t Let the Sun Go Down on Me. ” The worldwide 1984 hit “Careless Whisper,” credited in Britain to George Michael solo and to Wham! featuring George Michael in the United States, signaled a turn away from perky teenage fare. Mr. Michael’s status as a top British pop star was confirmed by his appearance on Band Aid’s “Do They Know It’s Christmas? ,” the 1984   benefit single for Ethiopian famine relief. In 1986, Wham! dissolved, with a farewell show at Wembley Stadium. Mr. Michael had a No. 1 hit with “I Knew You Were Waiting (for Me)” before releasing the album “Faith” in 1987. Its first single, “I Want Your Sex,” reached No. 2 in the United States, though it was seen as too risqué by some radio stations Mr. Michael made an introduction to its video clip stating, “This song is not about casual sex. ” “Faith,” which hinted at both gospel and rockabilly, reached No. 1, and the album included three more No. 1 hits: “Father Figure,” “Monkey” and “One More Try. ” It has sold more than 10 million copies in the United States. But for his next album, “Listen Without Prejudice Vol. 1,” released in 1990, Mr. Michael set out to jettison his pop persona. “I’m not stupid enough to think I can deal with another 10 or 15 years of major exposure,” he told an interviewer at the time. “I think that’s the ultimate tragedy of fame, people who are simply out of control, who are lost. I’ve seen so many of them, and I don’t want to be another cliché. ” The autobiographical “Freedom ’90” declared his independence from the pop machine he wasn’t in its video clip, which had supermodels   the lyrics. The album also included a No. 1 single, the ballad “Praying for Time,” and has sold two million copies in the United States, but after the blockbuster of “Faith” it was considered a commercial letdown. Mr. Michael entered a protracted legal battle with Sony Music over his contract, and was unable to release another album until 1996. Its title, “Older,” was an unmistakable signal that he was no longer directly courting the youth market he was 32 years old. The album was an instant hit in England and Europe  —   it had six hit singles in England  —   though it was less popular in the United States. After his 1998 arrest, Mr. Michael released a   album with two new songs one, “Outside,” set its video clip in a men’s restroom. He made a 1999 album of cover songs, “Songs of the Last Century. ” In the early 2000s, Mr. Michael released songs protesting the invasion of Iraq, including the 2002 “Shoot the Dog. ” His last full studio album, “Patience,” was released in 2004, full of introspective ballads. Mr. Michael returned to performing he joined Paul McCartney onstage during the 2005 Live 8 benefit concert. In 2006, he performed a world tour, paired with another collection of hits, “Twenty Five,” which included new duets with Mr. McCartney and Mary J. Blige. He continued to release individual songs sporadically, and in 2014, he released “Symphonica,” a collection of standards and his own songs recorded with an orchestra on a   tour. During that tour, he collapsed with nearly fatal pneumonia and was hospitalized for five weeks he wrote a single, “White Light,” about the experience. Mr. Michael had been planning an expanded reissue, due in 2017, of “Listen Without Prejudice Vol. 1,” paired with a documentary, “Freedom,” exploring his musical, personal and legal struggles. “I never minded being thought of as a pop star,” Mr. Michael told GQ in 2004. “People have always thought I wanted to be seen as a serious musician, but I didn’t, I just wanted people to know that I was absolutely serious about pop music. ”'"}, "time": 1742563121.9250998}