{"duration": 0.045371294021606445, "input_args": {"text": "'To be fair to Casey Affleck, he is not the biggest schlump in show business. Adam Sandler takes that prize. And let’s state upfront that we are talking here strictly in sartorial terms. There is plenty to be said about the more serious of Mr. Affleck’s shortcomings, the ones that have led him to settle two sexual harassment cases out of court and that some say may cost him the Oscar. For present purposes, however, what concerns us is Mr. Affleck’s bizarro style, a kind of slovenly and idiosyncratic take on normcore that conjures up images of every high school stoner you have ever met. Lately, the star has been seen in public a lot, picking up prize statuary and barnstorming the   circuit  —   from Jimmy Kimmel to Jimmy Fallon to “Saturday Night Live”  —   for “Manchester by the Sea. ” In this immaculately calibrated Kenneth Lonergan   Mr. Affleck plays a Boston handyman descended into a fugue of volatile,   depression after a tragic series of events. Making his strongest bid yet for an Oscar, the perennially underestimated actor gives a performance so tightly coiled that it threatens at times to crash projection software in theaters and plunge audiences into the dark. Slogging his way toward the biggest award show, in February, Mr. Affleck has so far picked up Golden Globe, Gotham, National Board of Review, New York Film Critics Circle and Critics’ Choice trophies. And he has become, for now, a regular presence in the press and on television, the thinking person’s Bill and Ted. “Thanks for dressing up,” Stephen Colbert said to Mr. Affleck last February, when he appeared on “The Late Show” to promote his previous movie, the crime thriller “Triple 9. ” Mr. Colbert was referring to Mr. Affleck’s hardly bothering  : a pair of roomy khakis, sneakers, a rumpled blazer and an untucked   shirt. His hair, as is customary, looked as though he had combed it with salad tongs. “I can’t tell whether this choice is the least celebrity thing to do or the most celebrity thing to do, because it’s very casual,” Mr. Colbert told the actor, whom he went on to liken, with some accuracy, to a “  Jesus. ” Mr. Affleck, of course, is far from the first star to use clothes to register his pointed indifference to the industry’s sports jacket or penguin suit conventions. Turning up on Jon Stewart’s Comedy Central show, Mr. Sandler once wore an oversize corduroy shirt jacket he termed a “shacket” while flogging a forgettable 2011 movie titled “Jack and Jill. ” At the time, Mr. Sandler said his wife had purchased the shacket in a bid to upgrade his wardrobe, though to the average viewer, the garment looked like something found on a Greyound bus. When compared with Mr. Sandler, with his customary Stu Pickles   Mr. Affleck is a   Cary Grant. He appears to own a blazer and a suit or two, and can seemingly knot a tie. True, those ties tend to migrate off the centerline, his shirt collars curl at the ends, and his hairstyles skew messianic. But at least he has not been seen in public wearing sweatpants featuring the dorsal cleavage often referred to as plumber’s   …     never mind. “Casey always looks vaguely unshowered anyway, in real life, as well,” said Melissa Toth, whose meticulous work on “Manchester by the Sea” is a master class in cinematic costume design. “He’s a scruffy boy. ” The   scruff on his chin is occupational, Mr. Affleck explained in   on “Saturday Night Live,” grown for a part. Yet the truth is, it has been some time since anyone has spotted the      actor without the chin whiskers that are the male version of the eyeglasses pretty girls sometimes wear to make themselves look smart. “Scraggly” was the term Mr. Affleck applied to his beard on “Saturday Night Live,” and “not in a Santa way, more of a ‘Duck Dynasty’ way. ” And if scraggly is the image he has cultivated in almost every appearance, it’s a look he may decide to polish when Oscar season rolls around in full. After years spent “banging on Hollywood’s door,” as Variety said in October, the time may have come, with “Manchester by the Sea,” for Mr. Affleck to break through to the big leagues. And when he does  —   as odds suggest is likely  —   he may want to spring for a   shave and a jacket that fits, and learn to tuck in his shirt, industry experts say. “As a sign of respect, it is better to err on the side of dressing too well than not dressing enough,” said Rob Burnett, the longtime executive producer of “Late Show With David Letterman. ” “You want to avoid the possibility of ever looking like you don’t care. ” What should never happen, Mr. Burnett added, is that a   host like Mr. Fallon, Mr. Colbert or Mr. Kimmel takes an appraising look at an actor dressed in clothes you might wear to clean out the attic and says, “Oh, thanks for dressing up. ”'"}, "time": 1742628485.8425217}