{"duration": 0.0631105899810791, "input_args": {"text": "'Vintage News Tue, 25 Oct 2016 Nasīr al-Dīn Tūsī was a Persian polymath and prolific writer: An architect, astronomer, biologist, chemist, mathematician, philosopher, physician, physicist, scientist, theologian and Marja Taqleed. He was of the Ismaili, and subsequently Twelver Shī’ah, Islamic belief. The Muslim scholar Ibn Khaldun (1332 – 1406) considered Tusi to be the greatest of the later Persian scholars.\\nTusi has about 150 works, of which 25 are in Persian and the remaining are in Arabic, and there is one treatise in Persian, Arabic and Turkish. \\nDuring his stay in Nishapur, Tusi established a reputation as an exceptional scholar. Tusi’s prose writings represent one of the largest collections by a single Islamic author. Writing in both Arabic and Persian, Nasir al-Din Tusi dealt with both religious (“Islamic”) topics and non-religious or secular subjects (“the ancient sciences”). His works include the definitive Arabic versions of the works of Euclid, Archimedes, Ptolemy, Autolycus, and Theodosius of Bithynia. ‘A Treatise on Astrolabe’ by Tusi, Isfahan, 1505. Source: Danieliness \\nIn his Akhlaq-i-Nasri , Tusi put forward a basic theory of the evolution of species almost 600 years before Charles Darwin was born. He begins his theory of evolution with the universe once consisting of equal and similar elements. According to Tusi, internal contradictions began appearing, and as a result, some substances began developing faster and differently from other substances. He then explains how the elements evolved into minerals, then plants, then animals, and then humans. Tusi then goes on to explain how hereditary variability was an important factor for biological evolution of living things: \\n“The organisms that can gain the new features faster are more variable. As a result, they gain advantages over other creatures. […] The bodies are changing as a result of the internal and external interactions.” The Astronomical Observatory of Nasir al-Dīn Tusi \\nTusi discusses how organisms are able to adapt to their environments: \\n“Look at the world of animals and birds. They have all that is necessary for defense, protection and daily life, including strengths, courage and appropriate tools [organs] […] Some of these organs are real weapons, […] For example, horns-spear, teeth and claws-knife and needle, feet and hoofs-cudgel. The thorns and needles of some animals are similar to arrows. […] Animals that have no other means of defense (as the gazelle and fox) protect themselves with the help of flight and cunning. […] Some of them, for example, bees, ants and some bird species, have united in communities in order to protect themselves and help each other.” Iranian stamp for the 700th anniversary of his death \\nTusi recognized three types of living things: plants, animals, and humans. He wrote: \\n“Animals are higher than plants, because they are able to move consciously, go after food, find and eat useful things. […] There are many differences between the animal and plant species, […] First of all, the animal kingdom is more complicated. Besides, reason is the most beneficial feature of animals. Owing to reason, they can learn new things and adopt new, non-inherent abilities. For example, the trained horse or hunting falcon is at a higher point of development in the animal world. The first steps of human perfection begin from here.” A stamp issued in the republic of Azerbaijan in 2009 honoring Tusi \\nTusi then explains how humans evolved from advanced animals: \\n“Such humans [probably anthropoid apes] live in the Western Sudan and other distant corners of the world. They are close to animals by their habits, deeds and behavior. […] The human has features that distinguish him from other creatures, but he has other features that unite him with the animal world, vegetable kingdom or even with the inanimate bodies. […] Before [the creation of humans], all differences between organisms were of the natural origin. The next step will be associated with spiritual perfection, will, observation and knowledge. […] All these facts prove that the human being is placed on the middle step of the evolutionary stairway. According to his inherent nature, the human is related to the lower beings, and only with the help of his will can he reach the higher development level .” SOTT Comment: Note that, unlike Darwin’s version of the theory , which resulted in a proliferation of ideas about the ‘survival of the fittest’ that encouraged man’s baser nature and justified European imperialism, Tusi’s theory of evolution apparently underpinned ideas about higher man’s spiritual development . Share:'"}, "time": 1742628419.4520488}