{"duration": 0.12087726593017578, "input_args": {"text": "'Can you imagine living in a world of darkness, a world you weren’t visually connected to? For many, this is the only reality they’ve ever known: for some, a new and terrifying experience. \\nVia CollectiveEvolution \\n\\nFortunately, scientists are on the brink of discovering how to use technology to restore sight to the blind. In fact, a group of surgeons from University of California, Los Angeles (UCLA) recently implanted the world’s first visual simulator chip into the brain of a 30-year-old blind woman. The patient, who wishes to remain anonymous, started losing her eyesight in 2008 as a result of a rare disease called Vogt-Koyanagi-Harada syndrome, which attacks the pigment in the eyes. After only a year, the disease took her eyesight from her; however, it did not take her hope. Eight years later, she can now see colours and shapes again thanks to a tiny simulator laid on the back of her brain.\\nHow the “Technology to Beat Blindness” Works The device implanted into the patient’s brain was developed as part of the Orion I program by Second Sight . It was inspired by a similar device called the Argus II, which was released at the Manchester Royal Eye Hospital in 2015 and involves a similar camera that sends images to an implant behind the eye. However, in order for the Argus II to be successful, it requires the patient to have at least some working retinal cells. The technology behind Orion I was specifically designed for those who cannot benefit from the Argus II, as it takes this concept even further by making it compatible with those who have complete blindness as well. Since the system sends signals directly to the brain, it could theoretically work to restore sight to anyone , including those who lost an eye or were blinded by cancer ( source ).\\nIn August 2016, Dr. Nader Pouratian implanted the simulator, an array of tiny electrodes, behind this woman’s brain. The surgery took only four hours to complete and involved opening a small hole in the back of her skull and inserting the simulator onto the surface of her brain. He then placed a tiny antenna receiver, which receives signals from a computer, into this hole. Following her procedure, the patient was tested for six weeks to determine the results of her new “bionic eye.” The results have been extremely positive so far, as the patient has seen the precise signals researchers sent to her visual cortex, the area of the brain that receives images from the optic nerve.\\nDr. Pouratian explained , “The moment she saw color for the first time was a very emotional experience. It touched us all very deeply as human beings. Based on these results, this system has the potential to restore sight to the blind.”\\nCheck out this UCLA video that explains how the technology works: \\nNext Steps Toward Restoring the Patient’s Eyesight The UCLA doctors are now awaiting approval from the U.S. Food and Drug Administration, anticipated to be granted in early 2017, to continue their experiments using the entire Orion I program. The tests would involve the patient wearing a pair of high-tech glasses with a camera on the bridge. Using the images captured from the glasses’ camera, Orion I would send those video signals to the brain, allowing the patient to see what’s directly in front of them ( source ).\\nHere’s a diagram that illustrates how the program works:\\n\\nDr Robert Greenberg, chairman of Second Sight, hopes this technology will improve all manner of eye injuries: “It is rare that technological development offers such stirring possibilities. By bypassing the optic nerve and directly stimulating the visual cortex, the Orion I has the potential to restore vision to patients blinded due to virtually any reason, including glaucoma, cancer, diabetic retinopathy, or trauma.”\\nFinal Thoughts In a world where being able to see is sometimes crucial for survival, Orion I could help transform the lives of many people suffering from blindness. This technology could provide a glimmer of hope to millions of people all over the world who never thought they’d see again. This patient’s story serves as a beautiful reminder that you can always find hope in the darkest of times and that literally anything is possible.\\n“I find hope in the darkest of days and focus in the brightest.” – Dalai Lama \\n'"}, "time": 1742563503.8245468}