{"duration": 0.07432937622070312, "input_args": {"text": "'  Bob Creamer Admits To Daily Calls With The Clinton Campaign And More… Bob Creamer Admits To Daily Calls With The Clinton Campaign And More… October 26, 2016, 3:20 pm by Terresa Monroe-Hamilton Leave a Comment 0 \\nNoisyRoom.net \\nDisgraced Robert Creamer is having even more of his dirty laundry aired by James O’Keefe and Project Veritas. Wonder how his commie wife, Congresswoman and fellow Marxist, Jan Schakowsky , feels about that. It would seem that Creamer was beyond cozy with the Clinton campaign. He has been on daily morning calls with the campaign with his input. He’s also, not surprisingly, worked directly with Obama to organize “issue campaigns.” \\nRobert Creamer has been a political organizer and strategist for almost four decades. He and his firm, the Strategic Consulting Group, work with many of the country’s most significant issue campaigns. He was one of the major architects and organizers of the successful campaign to defeat the privatization of Social Security. He worked to end the war in Iraq, pass universal healthcare, change America’s budget priorities and enact comprehensive immigration reform. He’s been a very busy little Marxist. \\nHis clients have included labor unions, public interest groups and advocacy organizations like MoveOn.org, Americans United for Change and USAction. He has also worked on hundreds of electoral campaigns at the local, state and national levels. \\nNow he is best known for getting caught up in a sting by Project Veritas. He also accepted a foreign donation for a Democratic Super PAC for $20,000. Then he returned it once he suspected he was being set up. A little too late, Bob. That donation was from Project Veritas themselves. \\nFrom Breitbart : \\nDisgraced Democratic operative Robert Creamer participated in daily calls with the Hillary Clinton campaign, and worked directly with President Barack Obama to organize “issue campaigns.” \\nCreamer makes the admissions in the latest undercover video release from James O’Keefe and Project Veritas, which captured Creamer describing his activities. \\nO’Keefe also reports that Creamer accepted a foreign donation for a Democratic super PAC. \\nIn this fourth video in the series, “Rigging the Election,” Creamer tells a journalist with Project Veritas that he does indeed work for the Clinton campaign and is in fact in charge of “overseeing” activities at the Trump rallies: “I mean frankly I spend most of my time overseeing the Trump event rallies, I mean that’s what I do for the Clinton campaign.” He has actively choreographed “bird dogging” at Trump’s rallies to gin up violence. He’s also placed infiltrators in Donald Duck costumes at Trump events. So lame. This has been going on for more than a year. \\nRobby Mook, Clinton’s campaign manager, flat out lied last week and said he never worked with Creamer. But O’Keefe’s videos expose that whopper of a lie. \\nIn this latest video, Creamer details some of his connections: “Every morning I am on a call at 10:30 that goes over the message being driven by the campaign headquarters … I am in this campaign mainly to deal with what earned media with television, radio, with earned media and social media, not with paid media, not with advertising.” Even more damning is a conference call mentioned where they discussed a woman potentially coming forward against Trump to accuse him of inappropriate behavior. \\nCreamer has known and worked with Obama since the 1980s, during his community organizing days. He goes on to add: “I do a lot of work with the White House on their issues, helping to run issue campaigns that they have been involved in. I mean, for immigration reform for the… the health care bill, for trying to make America more like Britain when it comes to gun violence issues.” \\nI assume there will be even more videos to come. Creamer has resigned from Americans United for Change over all this and his reputation is now trashed. This is what happens when you make your living scheming against others. Eventually you get caught up in it as well. Fresh out of sympathy for Creamer. 0'"}, "time": 1742562096.4452536}