{"duration": 0.05852937698364258, "input_args": {"text": "'The investigation into the 1964 murders of three civil rights volunteers by a group of Klansmen, an inquiry that became known as the “Mississippi Burning” case, has come to a close, the Mississippi attorney general announced Monday. The murders of Michael Schwerner, James Chaney and Andrew Goodman, committed on a remote Mississippi road 52 years ago on Tuesday, prompted an intense federal investigation. That investigation, plus a   in more recent years, led to eight trial convictions and one guilty plea over five decades. One of the masterminds of the murders, a Klansman named Edgar Ray Killen, was convicted by state prosecutors in 2005. “I am convinced that during the last 52 years, investigators have done everything possible under the law to find those responsible and hold them accountable,” said Jim Hood, the state attorney general, at a news conference. “However, we have determined that there is no likelihood of any additional convictions. Absent any new information presented to the F. B. I. or my office, this case will be closed. ” The most recent round of investigations  —   the third push by federal agents since 1964  —   began after the passage of the Emmett Till Unsolved Civil Rights Crime Act in 2008, which set up an office within the United States Justice Department to investigate unsolved murders from the civil rights era. “The department’s focus during this third investigation,” said Vanita Gupta, head of the Justice Department’s Civil Rights Division, “homed in on determining whether sufficient admissible evidence existed to support further state prosecution against any surviving person for involvement in the murders. ” A   report released by the Justice Department on Monday, which described the history of the case and recent investigative efforts, included the names of five people believed to have been involved in the killings who were still alive in 2010 when federal agents began   the case. Mr. Killen is serving a   sentence for the killings two others died shortly after the investigation began. The report describes two other men as “still potentially culpable for state offenses related to the murders. ” Neither is believed to have been at the scene, but are thought by authorities to have been involved in the conspiracy. Agents interviewed or attempted to interview old sources and tracked down new ones, including Klansmen who had been active in the 1960s, relatives of those involved, jailhouse confidants and Mr. Killen himself. But the deaths of so many original witnesses and sources, the inadmissibility in court of key testimony, the faulty memories of elderly men and an enduring reluctance among some to speak to the authorities made the likelihood of successful prosecutions remote. “Obviously, the willingness of surviving witnesses to cooperate fully rather than minimizing their knowledge with false denials or feigned memory problems is a factor to consider,” the report read. Still, it concluded that the deaths of the three young men “have been thoroughly and aggressively investigated and reinvestigated and have thus received some measure of vindication. ”'"}, "time": 1742561999.6945233}