{"duration": 0.047573089599609375, "input_args": {"text": "\"November 9, 2016 - Fort Russ -  RT - translated by J. Arnoldski -  \\n\\n\\nOn November 8th, Republican candidate Donald Trump was elected the 45th President of the United States. The results of the elections are still being summed up, but Trump has the undisputed advantage in electoral votes - 279 against Democratic candidate Hillary Clinton’s 218 - and has therefore practically won.  \\nRussian political circles are displaying a cautious attitude towards Donald Trump’s victory in the US presidential elections. Politicians interviewed by RT expect that Russia and America will build more constructive relations, but no warming should be counted on. Russian deputies and senators have noted that they are awaiting a “competent” reaction by Trump to Syria, Crimea, and Ukraine. \\nThe deputy chairman of the Federation Council’s Committee on International Affairs, Arsen Kanokov, expects Trump to find a common language with Vladimir Putin and Russia overall. The senator said: “There is great hope for a thaw. We all want to have friendly relations with America. The question is how these processes are happening. I think that we will sit at the negotiating table and Russia’s reasonable voice will be heard by America. We hope that they will understand the actions and aid that we are affording to Syria. The political vector will change in this regard.” \\nThe first deputy chairwoman of the State Duma Committee on International Affairs, Svetlana Zhurova, recalled that Donald Trump repeatedly spoke of the need for cooperation with Russia even during his election campaign.  \\nZhurova believes: “This does not mean that tomorrow Trump will rush to Russia to meet with Vladimir Putin or that our representatives will rush to America to negotiate with him. They will work out orderly, constructive relations. Trump will pay more attention to internal problems rather than the showdown between the two countries. He believes that America should pay attention to economic cooperation with Russia, political dialogue, and the joint struggle against global terrorism. In these spheres, our countries can truly be useful for each other. Trump spoke about all of this in his campaign speeches. He is not the kind of person who breaks his word. Yes, Trump will look to the opinion of the US population, which has some doubts concerning Russia, but there won’t be such aggression in policies towards Russia like the Obama administration did.” \\nDmitry Novikov, also a member of the State Duma’s international committee, suggests that no radical changes in the US' foreign policy course should be expected.  \\n“Trump has been elected president of his country, so he will undoubtedly defend the interests of the US and its ruling circles. If Trump will fulfill his promises on how the administration in Washington should focus on solving domestic problems, then maybe his foreign policy won’t be so aggressive. As for what concerns Russia, more common sense approaches to such issues as Syria, Crimea, and Ukraine might prevail in the White House’s policies. In these cases, the preconditions for the normalization of relations between Russia and the United States could be expressed,” Novikov posited. \\nNovikov also added that no warming of relations like in the days of Kennedy and Khrushchev should be expected, since Russia’s geopolitical position has dramatically changed.  \\n“The Soviet Union had much more formidable starting capabilities to be on an equal footing in the world arena. The country had economic weight and a system of alliances. In this sense, modern Russia has a somewhat weaker position. Nevertheless, the US has enough domestic problems, and if Trump really zeros in on solving them, then we could see more reasonable foreign policy,” he added. \\nIn turn, the first deputy chairman of the Federation Council’s Committee on International Affairs, Vladimir Dzhabarov, believes that Trump’s victory will positively impact Russian-American relations. According to him: “One shouldn't wait for any dramatic warming [in relations], or worsening, for that matter, which was expected if Hillary won.” Dzhabarov remarked that Trump, during his election campaign, behaved with dignity and did not spew out any negative statements towards Russia and the Russian president. \\n\\nThe politician also expressed hope that the billionaire’s victory would affect Europe’s position on relations with Russia: “No wonder they have taken a cautious position on sanctions. I hope that they will become more independent,” Dzhabarov said.  \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n\""}, "time": 1742628583.454469}