{"duration": 0.08857846260070801, "input_args": {"text": "'WASHINGTON  —   Senate Republicans, under increasing pressure to ensure that   Donald J. Trump’s nominees are fully vetted by federal authorities, have delayed the hearings of four potential cabinet members, three of whom have not been cleared by the agency charged with unraveling potential conflicts of interest. As frustrations over confirmations grow, a group that supports Republicans accused the ethics office and its leader  —   in a highly unusual attack on the nonpartisan agency  —   of politicizing a process long viewed by both parties as arduous but essential for anyone serving in government. Hearings for Betsy DeVos, Mr. Trump’s choice to lead the Department of Education Andrew Puzder, his labor secretary nominee and Representative Mike Pompeo, Republican of Kansas, Mr. Trump’s pick to lead the Central Intelligence Agency, have all been pushed back as Democrats clamor for more time to collect and review the standard background checks that nominees traditionally undergo before their hearings commence. Wilbur Ross, Mr. Trump’s pick for secretary of commerce, will also be delayed several days because his ethics agreement is not complete, according to the chairman and ranking Democrat of the commerce committee. The delays represent a stumble for the incoming Trump administration, which has vowed to run government with a businesslike efficiency, and highlights how in several respects its preparation to take office is behind that of predecessors. In the case of Ms. DeVos, a billionaire, a complex web of financial holdings may be slowing down the Office of Government Ethics, which helps federal officials address conflict of interest matters, while Mr. Puzder’s background documents are also not in order. Walter M. Shaub Jr. the director of the ethics office, said in a letter to Senator Patty Murray, Democrat of Washington, that he did not know when Ms. DeVos would be cleared by his agency as this was “dependent on the nominee to provide needed information, respond to questions and accept the terms of an ethics agreement. ” Republicans have vowed hearings for as many nominees as possible before Mr. Trump’s inauguration, so that they can be cleared to served immediately, particularly those posts associated with national security. “We will be in a position to confirm a significant number of the president’s nominees on day one,” said the Senate majority leader, Mitch McConnell, Republican of Kentucky. Senator Chuck Schumer of New York, the minority leader, said Tuesday on the Senate floor, “This new hearing schedule is a very good first step, but we still have a ways to go. ” Mr. Trump’s aides have been pressuring the ethics office to expedite its processes, even though it did not get the necessary paperwork from most of his nominees until recently, putting Republicans in a difficult position of either pushing forward with hearings without proper vetting  —   something most of the chairmen are loath to do  —   or delaying them in some cases indefinitely. “Trump is the latest   to begin the process in contemporary history,” said Paul C. Light, a professor of Public Service at New York University who worked on Capitol Hill as an adviser on transitions. “This puts the Republicans under pressure and sets up possible problems down the road. Mr. Trump is asking the Senate to make up for his own failures here. ” The conservative organization America Rising PAC took aim at Mr. Shaub on Monday, highlighting his “history as a Democrat and the double standard he employed as head” of the agency, highlighting his political donations to President Obama as well as his office’s “utter incompetence” in policing financial matters related to Hillary and Bill Clinton. The PAC chided Mr. Shaub for wading into the politics of the transitions, saying his public comments and criticisms had become fodder for “Congressional Democrats to try and score points. ” The PAC noted an informal  —   and    —   series of postings on Twitter from the office’s official account congratulating Mr. Trump on divesting from his real estate business  —   a move he had not made. “The head of President Obama’s ethics department has absolutely zero credibility to criticize others,” Scott Sloofman, a spokesman for America Rising PAC, said in an email, adding that Mr. Shaub’s “outburst over the weekend reeks of partisan politics from an embittered Democrat still reeling from November’s election result. ” In messages posted to Twitter on Tuesday, the office wrote that it is “Moving quickly!”  —   noting that it had   54 percent of the nominees it has received from the Trump transition team, compared with 29 percent at the same point in 2009. “OGE is expediting reviews of the financial disclosure reports of the  ’s nominees, without sacrificing quality,” the agency said on Twitter. An employment lawyer by trade, Mr. Shaub joined the Office of Government Ethics in 2006, during the administration of George W. Bush, working as a supervisory lawyer. In 2008, he became a deputy general counsel, and then President Obama in 2013 nominated Mr. Shaub as director of the office. Ethics experts who have worked closely with the office and Mr. Shaub said the criticisms of him seemed unfair. “For simply doing his job, director Shaub is now being unfairly attacked,” Norman L. Eisen, a former special counsel for ethics and government reform under Mr. Obama, and Richard W. Painter, the chief White House ethics lawyer to Mr. Bush, said in a joint statement. “It seems that it is open season on ethics in Washington, D. C. Last week the nonpartisan, independent Office of Congressional Ethics was attacked, and now the nonpartisan, independent Office of Government Ethics and its director are being targeted. ” They added, “This attempt to bully and intimidate a hardworking, understaffed agency like O. G. E. must not go unchecked. ” The compliance office work on the transition got off to a cordial and even enthusiastic start during the final months of the campaign, and continued after the election, according to a series of emails between ethics officials and Mr. Trump’s representatives obtained through public records requests by MSNBC and the James Madison Project. “Congratulations on the campaign’s victory,” Mr. Shaub wrote members of Mr. Trump’s transition team on the morning after Election Day, just hours after his victory, adding, “We’re really looking forward to getting down to work on this presidential transition  —   which we’re going to make one of the best in history!”'"}, "time": 1742562986.961169}