{"duration": 0.04173398017883301, "input_args": {"text": "'Pop star Miley Cyrus dug herself into a hole with famous Italian fashion designer Stefano Gabbana,   of the duo behind Dolce  Gabbana. [After Cyrus’ brother walked in the Dolce  Gabbana Spring 2018 Menswear runway show, the “Malibu” singer took to Instagram to criticize the designers for their    politics in a celebratory post about her brother’s modeling debut.  “PS DG, I STRONGLY disagree with your politics  …    . but I do support your company’s effort to celebrate young artists  give them the platform to shine their light for all to see,” Cyrus wrote in the post.  Congrats @braisonccyrus on walking in your 1st runway show  …    . It’s never been my little brothers dream to be a model as HE is one of the most talented musicians my ears have ever been given the gift of hearing  …    . BUT it is a Cyrus family trait to try everything once (within reason HA) and to embrace opportunities that encourage you to step out of your comfort zone! We believe in trying something new everyday! I love you Prince Suga Bear and seriously congratulations on your experience! I am so proud of you always  …    . From Nashville to Italy! 👑❤️👑❤️👑❤️ PS DG, I STRONGLY disagree with your politics  …    . but I do support your company’s effort to celebrate young artists  give them the platform to shine their light for all to see! A post shared by Miley Cyrus (@mileycyrus) on Jun 17, 2017 at 8:00am PDT,  The post was enough for Stefano Gabbana to hit back at Cyrus, telling the celebrity to not post on her Instagram about his fashion brand. “We are Italian and we don’t care about politics and mostly neither about the American one! We make dresses and if you think about doing politics with a post it’s simply ignorant. We don’t need your posts or comments so next time please ignore us!! #boycottdolcegabbana,” Gabbana wrote.  #Repost @mileycyrus Noi siamo italiani e della politica non ci interessiamo di quella Americana ancora meno ! !! Noi facciamo abiti e se tu pensi di fare politica con un post sei semplicemente un’ignorante. Non abbiamo bisogno dei tuoi post e dei tuoi commenti.  La prossima volta ignoraci x favore!! #boycottdolcegabbana 😂😂😂😂❤️ We are Italian and we don’t care about politics and mostly neither about the American one! We make dresses and if you think about doing politics with a post it’s simply ignorant. We don’t need your posts or comments so next time please ignore us!! #boycottdolcegabbana 😂😂😂😂❤️ A post shared by stefanogabbana (@stefanogabbana) on Jun 17, 2017 at 6:09pm PDT,  Dolce  Gabbana have become known for hitting back at their critics, who demand they adhere to the   ideology to which the vast majority of the fashion industry adheres. As Breitbart News reported, the Italian designers have created an ad campaign that proudly mocks their critics who demand they stop dressing First Lady Melania Trump.'"}, "time": 1742628552.6656833}