{"duration": 0.06847333908081055, "input_args": {"text": "'Supporters of President Hassan Rouhani of Iran have won more seats in parliamentary runoff elections, the Iranian state news media reported Saturday, but they failed to win enough of the 68 contested seats to secure a majority, limiting their ability to carry out significant political and social changes. The gains made by the moderates and reformists were not enough to decisively alter the balance of power in Iran, the president’s supporters acknowledged. They added that political clashes between their lawmakers and conservative   were bound to increase. “Expect a Parliament with a slightly friendlier tone, but also many political crises,” said Farshad Ghorbanpour, a political analyst close to the government. After Friday’s runoff elections for races that were not decided in the first round of voting in February, the reformists and moderate supporters of Mr. Rouhani hold 122 seats in the   Parliament, and the conservative   have 84, the state media reported. Independents  —   who are likely to side with Iran’s conservative clerical leaders, particularly the country’s supreme leader, Ayatollah Ali Khamenei, on crucial issues  —   have 82 seats, according to the results announced by the state media. Results in the contests for two seats were not available late Saturday. Because there is no party system in Iran  —   all factions have to support the ideology of the Islamic republic  —   candidates for Parliament run as individuals. That means alliances can shift because those who are elected are not bound by the constraints of party affiliation when they vote. Mr. Rouhani had some disagreements with the departing Parliament, but they were minor compared with the open battles between his predecessor, Mahmoud Ahmadinejad, and lawmakers, who impeached many of his ministers. Reformists and moderates are hoping that their increased influence will help Mr. Rouhani enact the modest political changes he has proposed, including fewer restraints on Internet use and more personal freedoms. Since he took office in 2013, he has faced resistance in Parliament, but even more opposition from unelected watchdog councils and the judiciary, which is dominated by conservatives. The judiciary and the police recently ordered 7, 000 undercover police officers to patrol the streets and enforce morality standards regarding the way many urban Iranians dress, which conservatives say is not Islamic enough. Mr. Rouhani complained about the move, but he lacks the legal authority to oppose it, his supporters say. Conservatives expect that many of the independent candidates will vote with them, one political analyst said. With no group controlling a majority, many decisions will be hotly contested. “There will be many, and intense, discussions,” said Hamidreza Taraghi, a political analyst close to Iran’s conservative leaders. “Making decisions will be more complicated. ”'"}, "time": 1742562028.0521035}