{"duration": 0.10769367218017578, "input_args": {"text": "'WASHINGTON, D. C.  —   Sen. Elizabeth Warren’s   tenure in public service is rife with contradictions, as an examination of her current positions juxtaposed with her past behavior reveals. [Warren’s latest book, “This Fight Is Our Fight: The Battle to Save America’s Middle Class” is her 11th. Rumors have been swirling that the progressive Democrat and Harvard law professor could be positioning herself for a run in the 2020 presidential elections.  When digging into her very near past though, Warren’s hypocritical position as a champion of “equal pay for equal work,” her phony war on big business, her   stance on a   health care system, and her hypocrisy on school choice quickly come into question. In her 2014 book “A Fighting Chance,” she criticized her 2012 opponent Scott Brown for voting against equal pay for equal work. In the book, she said of Brown, “He’s had exactly one chance to vote for equal pay for equal work, and he voted no.   …     Those were bad votes for women, and it felt right to say so. ” However, a Washington Free Beacon article titled “Elizabeth Warren’s Female Staffers Made 71% of Male Staffers’ Salaries in 2016” reported that the gender pay gap in Warren’s own Senate office is “nearly 10 percent wider than the national average. ” Warren has also contradicted herself with her claims that she fights against big business  —   failing to mention that she worked “on behalf of a big business” and got paid over $200, 000 in a matter of three years.  In 2012, the Boston Globe reported that Warren, in her sole appearance in the U. S. Supreme Court, helped represent Travelers Insurance in a case that involved dozens of lawyers and thousands of asbestos victims. “The 2009 appearance was the only time Warren helped represent a party before the nation’s highest court. And it provides a rare window into a   aspect of the Harvard Law professor’s career, her time as a working attorney in the courts,” wrote the Boston Globe. The publication adds that the case  —   Travelers v. Bailey  —   was particularly “notable because Warren, who has gained fame for defending consumers against big business, was in this case working on behalf of a big business. For her contribution, Warren was paid $212, 000 over three years by Travelers, the nation’s largest insurer. ” Warren’s contradictory reputation with fighting against big business is also brought to the fore when examining her support for Massachusetts defense contractors. “Elizabeth Warren’s standing as a liberal warrior immune to the influence of Big Business hasn’t stopped her from pushing the interests of major defense contractors back home,” Politico wrote in 2015.  Warren has fought to stop the Army from shifting funds away from a   communications network to pay for unanticipated costs associated with the war in Afghanistan. She’s lobbied for   General   tactical radios. And she’s pledged to protect Westover Air Reserve Base from the budget ax  —   all while saying she supports ‘targeted’ cuts elsewhere. In the same piece, Politico further notes that Warren’s potential presidential candidacy would subject her to “scrutiny over the way she’s balanced her populist views with her   for pursuing the   practice of   politics. ” Health care has proven to be one of the biggest obstacles in recent political history. In the 2008 book “Health At Risk,” edited by Jacob Hacker, Warren   an essay with Deborah Thorne, titled “Get Sick, Go Broke,” where she claimed that   health care was “the most obvious” solution to America’s healthcare problems.  “We approach the health care debates from a single perspective: maintaining the financial stability of families confronting illness or injury,” Warren wrote. “The most obvious solution would be universal   health care. This would allow people to get the care they need  —   without risking bankruptcy to pay for it. No more credit card debt at 29. 9 percent interest to pay for drugs no more second mortgages to pay for a hospital admission no more dealing with debt collectors who garnish wages and threaten to put liens on homes.   care would also free families from dependence on an employer’s plan and make certain that everyone is covered whether or not they are employed. ” However, in 2012, Warren told a local TV host that she did not support a   health care system. Asked by former NECN reporter Jim Braude if she supports   healthcare, Warren said, “No, [I support] what I’ve got right now  …    ” Braude went on to remind Warren that she “wrote repeatedly” that she does support it to which Warren responded, “Oh! I think you need to go back and take a look. ” Braude then referenced the paragraph Warren   with Thorne. “I have a paragraph: ‘The most obvious solution would be universal,   health care.   care would also free families from dependents on an employers’ plan and make certain that everyone is covered whether or not.’ You wrote that with a   from Ohio. ” Warren shot back, “I wrote that with two. Actually, with two [ ] I think. That’s exactly right. But the point is, what we’ve got to do is we’ve got to keep moving in the direction of getting more families covered and bringing down the costs of healthcare, and I think we’ve taken a big step in that direction. ” Just last month, during remarks she delivered at the New England Council, Warren said, “I think every option needs to be on the table, and single payer sure ought to be at the top of the list. ” Asked by a reporter to clarify where she stands on single payer, considering her past inconsistency on the matter, Warren said: It depends on where we want to go next and what we can do next. If the question is, ‘can we make the Affordable Care Act better, and we can find some Republicans colleagues to do that,’ then absolutely. We should do what we can to improve it. But I want to be clear. We built a whole health care system in the hopes that it was going to be bipartisan when we built the Affordable Care Act, right? It came out of the Heritage Foundation, it had Republican ideas in it, we built it off of what Mitt Romney had done here in Massachusetts, took amendments from Republicans  —   how much Republican support did we get for that? None. So if we’re talking about tearing down the health care system and starting over, then I think every option needs to be on the table, and single payer sure ought to be at the top of the list. As for school choice, Warren is also hypocritical. In her 2003 book, “The   Trap: Why   Parents are Going Broke,” which she   with her daughter Amelia Warren Tyagi, Warren endorsed and emphasized the importance of school vouchers.  “A   voucher program would fit the bill neatly,” Warren and Tyagi wrote. “A    voucher that paid the entire cost of educating a child (not just a partial subsidy) would open a range of opportunities to all children. With fully funded vouchers, parents of all income levels could send their children  —   and the accompanying financial support  —   to the schools of their choice. ” They added, “Fully funded vouchers would relieve parents from the terrible choice of leaving their kids in lousy schools or bankrupting themselves to escape those schools. ” However, this past January, Warren took a complete turn from her original statement when she wrote in a letter to   for Secretary of Education Betsy DeVos that private voucher programs “in many cases” are “expensive and dangerous failures. ” She also wrote that “These private voucher programs have a   history. Historically, private school vouchers have been used by some states to further racial and socioeconomic segregation. ” Warren added, “For decades, you have been one of the nation’s strongest advocates for radically transforming the public education system through the use of   vouchers that steer public dollars away from traditional public schools to private and religious schools.   …     But the actual evidence on how private voucher programs affect educational outcomes is mixed at best, and in many cases reveals these programs to be expensive and dangerous failures that cost taxpayers billions of dollars while destroying public education systems. ” Follow Adelle Nazarian on Facebook and Twitter.'"}, "time": 1742564353.2532053}