{"duration": 0.05247688293457031, "input_args": {"text": "'Good morning.  Here’s what you need to know: • In South Korea, the trial begins for Choi   above, the jailed presidential adviser accused of influence peddling. President Park   who is suspended while the Constitutional Court considers her fate, said over the weekend that parliament did not have the legal grounds to impeach her. Supporters said that the presumption of her innocence had been violated. _____ • The muted U. S. response to China’s capture of an American underwater drone has Washington’s regional allies worried about further exposure to an increasingly assertive Beijing. The audacious seizure, in international waters in the South China Sea, was also seen as a taunt to   Donald J. Trump’s hard line on Beijing. _____ • The American outcry over Russian intervention in the presidential election is growing, even as Mr. Trump continues his march into office. The next step toward his inauguration is Monday’s vote by the Electoral College, a body created early in the country’s history as a compromise between those who wanted Congress to choose the president and those who favored a popular vote. It may not be the usual rubber stamp: At least one elector has said he will buck his party and not vote for Mr. Trump. Mr. Trump trails in the popular vote by more than 2. 5 million votes, the   margin among winning candidates since 1824. _____ • The removal of residents in Aleppo and nearby villages proceeded tenuously after rebels set fire to several buses. Videos on social media show the harrowing journey of more than 8, 000 people evacuated in the past few days. A U. N. Security Council resolution calling for aid and monitors to enter Aleppo appears doomed by Russia’s promise of a veto. The resolution, drafted by France, was intended to prevent a blood bath. Syrian refugees have found a unique welcome in Canada, where ordinary citizens help Syrian families navigate their new world. But the challenges are many. One   ’s parents fear that she is adapting so quickly that her Syrian identity will be erased. _____ • Australia’s treasurer, Scott Morrison, forecast a $7. 3 billion deterioration in the country’s budget deficit over the next four years, but still hopes to prevent the downgrade of the country’s   AAA credit rating. Political fighting has hamstrung the government’s handling of deficits, corporate taxes and foreign debt. _____ • The clash at the top of India’s   Tata Group is worsening, as a prominent politician alleged wrongdoing involving valuable telecommunications licenses. Above, Tata’s Taj Mahal Palace Hotel in Mumbai. • Iran reduced a purchase from Airbus, dropping orders for 12 A380   passenger jets and six other planes and cutting the value from some $27 billion to $10 billion. • “The Great Wall,” an ambitious coproduction between China and the U. S. took in at least $66 million during its opening weekend in Chinese theaters. “Your Name” continued its strong run, becoming Japan’s biggest hit ever in China. • Zalando, Europe’s largest fashion retailer in the digital market, is using a    approach to take on Amazon. • Japan is producing   whiskeys that connoisseurs covet, even with prices that can hit four figures per bottle. A Times reporter toured the distilleries. • Here’s a snapshot of global markets. • In Jordan’s south, seven security personnel and three civilians, including a tourist, were killed in a series of attacks by gunmen, including at an ancient crusader castle. [The New York Times] • An Arctic village is swarming with polar bears because the sea ice they rely on for hunting seals is retreating so fast. [The New York Times] • Flights were canceled and some highways were closed in Tianjin as intense air pollution sparked alerts in more than 40 cities in China’s northeast. [Reuters] • “Withdraw Ospreys,”  hundreds of people chanted in Okinawa, in the latest protests over the troubled   U. S. aircraft. [Asahi Shimbun] • Larry Colburn, who intervened with two comrades to halt the My Lai massacre of unarmed Vietnamese civilians by United States soldiers in 1968, died at 67. [The New York Times] • In Japan, napping in the office, or inemuri, is not only culturally accepted but seen as a sign of diligence: You must be working yourself to exhaustion. (And that’s a good thing.) • Early next year, Finland will begin handing out cash to 2, 000 jobless people, free of bureaucracy or limits on side earnings, to see if they will pursue jobs, start businesses or just squander the money on vodka. It’s a test of an idea, universal basic income, that is gaining traction worldwide. • Women’s cricket is already big in Australia, but the sport is also booming in England, India, New Zealand, the West Indies and China, which already ranks 14th in the world. Let’s begin the week talking about holiday spirits. Dried hibiscus flowers steeped with ginger mean it’s Christmastime in Jamaica. Mulled wine with port and brandy make for a fine glögg in Scandinavia. Christmas by the beach comes via coquito, a Puerto Rican   cocktail. Recipes are like heirlooms for many families there and flavors include chocolate and banana. Flour derived from orchid bulbs binds sahlab, a creamy Middle Eastern beverage. In Lithuania, poppy milk, made from poppy seeds steeped in water and honey, is served on Christmas Eve as part of the Twelve Dishes feast. The British tradition of wassailing in exchange for a bowl of hot mulled cider dates back centuries, as does eggnog. Most historians agree that the egg, milk and bourbon concoction originated in medieval Britain and eventually made its way to North America in the 1700s. A recipe from 1958 ran in The Times as the beverage made a comeback. Its popularity had dimmed near the end of the previous century. Americans appeared unwilling “to sacrifice future   for the sake of a momentary gratification,” a writer lamented, “even though sanctioned by the precept and example of our ancestors. ” Whatever your drink of choice is, sharing is the key ingredient. Happy Holidays. Remy Tumin contributed reporting. _____ Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742628599.2769487}