{"duration": 0.04070448875427246, "input_args": {"text": "'International terrorism expert Peter Neumann has warned Europe to expect an increasing number of attacks, as Friday’s truck terror in Stockholm marked the third Islamist atrocity to hit the continent in just three weeks with other deadly assaults taking place in St. Petersburg and London. [“I believe that, more more more, ISIS will be using its supporters in Europe to carry out attacks” the head of the International Center for the Study of Radicalization (ICSR) at King’s College in London told ZDF on Monday.  Neumann said it’s important that people have a realistic assessment of the threat of Islamist attacks, but insisted “this doesn’t mean there are going to be acts of terrorism happening in Europe every day, or that people should be frightened to go out on the street”. According to the professor, authorities in Europe are generally   in the fight against Islamist attacks, but he stressed that security services need to keep a closer eye on people deemed to be a potential terror threat. As well as boosting the resources and capacity of   bodies, Neumann said it’s vital that intelligence agencies leave no threat file unprocessed. “You need to have a concrete, integrated, systematic approach to prevention,” he added. Speaking after the Westminster attack in March  —   in which Muslim convert Khalid Masood mowed down crowds with a vehicle and stabbed a police officer, killing five people and injuring more than fifty  —   the ICSR chief said that nations in Europe are going to have to learn to live with terror. “Just because nothing happens for two months doesn’t mean the risk of a terror attack being carried out has declined, and this is something we need to adapt to,” he said. Neumann pointed out that while   agencies in Britain are far superior to those in most of Europe, the problem is that they don’t currently have enough resources to deal with the huge number of threats.'"}, "time": 1742628422.934163}