{"duration": 0.03677487373352051, "input_args": {"text": "\"About Reality check media Recall the 'Kremlin Opponent' Putin Whacked in a Washington Hotel? American Investigators Find He Actually Drank Himself to Death \\nClear evidence that Washington Metropolitan Police Department, the FBI and the US Attorney for the District of Columbia are working for the Russians   Irrussianality \\nIn November last year, Mikhail Lesin was found dead in a hotel in Washington, DC. From 1999 to 2004, Lesin was Minister of Press, Broadcasting and Mass Communication of the Russian Federation, and from 2004 to 2009 he was adviser to the President of the Russian Federation for mass media relations. Thereafter, he occupied a number of other senior positions, including head of Gazprom Media from 2013 to 2015. \\nReports that Lesin had died of ‘blunt force trauma’ led many commentators to surmise that he had been murdered on the orders of Russian president Vladimir Putin. The Daily Beast, for instance, reported that the American authorities had been investigating Lesin for ‘corruption and human rights abuses in Russia’, and that : \\nThe mystery surrounding Lesin’s death had fueled speculation that Lesin was murdered after coming to Washington to cut a deal with the FBI. The conspiracy theories are arguably well-founded, because it wouldn’t be the first time someone who posed a political threat to Putin wound up dead under unusual circumstances. \\nSimilarly, in an article entitled ‘Another Defector Dead in Washington’, former NSA analyst John Schindler claimed that Lesin and the Kremlin had had a ‘major falling out’, and that Lesin was ‘believed to have been cooperating with the FBI’. Schindler compared Lesin’s death to those of Alexander Litvinenko, who was murdered in London in 2006, and Soviet defector Walter Krivitsky, who died in mysterious circumstances in Washington in 1941. Schinder concluded : \\nWhile he certainly may have taken his own life in despair, Mr. Krivitsky’s murder by Soviet agents appears at least equally plausible. It would be a terrible fate if the eerily similar death of Mikhail Lesin goes unsolved too. If Kremlin agents are conducting assassinations on American soil, brazenly in our capital, the public has a right to know. \\nRobert van Voren, Professor of Soviet and Post-Soviet Studies at Vytautas Magnus University in Kaunas (Lithuania) and Ilia State University in Tbilisi (Georgia), likewise remarked that, ‘an increasing number of people from Russia’ were ‘dying under rather suspicious circumstances’, and that the Lesin case was ‘rather suspicious, and one has increasingly the feeling that Putin is getting rid of people who know too much.’ Van Voren said, ‘It is not unusual behaviour: being the Al Capone of a gangster state, he [Putin] must be constantly worried about everything people know about him, his past and his corrupt businesses.’ \\nWithout directly accusing Putin of murder, various mainstream media outlets have implied it by including Lesin in lists of ‘opponents’ of the Russian ‘regime’ whom the Kremlin has allegedly ordered killed. In August of this year, for instance, the New York Times mentioned Lesin in an article entitled ‘More of Kremlin’s Opponents Are Ending Up Dead’. And National Public Radio (NPR) included Lesin in a broadcast called ‘The Curious Deaths of Kremlin Critics’. According to NPR: \\nEvelyn Farkas, who served until recently as the top Russia official at the Pentagon, says she’s never seen proof that the Kremlin is ordering hits on people. Still, she says, ‘The fact that someone like Mikhail Lesin all of a sudden shows up dead in a Dupont Circle hotel, to me, is fishy. The message is to all the other people who are Putin cronies, who are oligarchs, that these kinds of things could happen to you.’ \\nIt turns out, however, that Putin did not kill Lesin. On Friday, the US Attorney for the District of Columbia issued the results of a joint investigation with the FBI and Washington’s Metropolitan Police Department. Lesin died of a combination of ‘acute ethanol intoxication’ and falls caused by ‘days of excessive consumption of alcohol.’ The case is now considered closed.\""}, "time": 1742628604.8555944}