{"duration": 0.07167220115661621, "input_args": {"text": "'Get short URL 0 6 0 0 Secret surveillance software developed by US communication giant AT&T to track and spy on drug traffickers for the government appears to have been migrated to be used as a universal tool to surveil the company’s entire network, additionally bringing profits to the multinational conglomerate, new documents reveal. New Reality: Future Space Weapons Will Be Able to Destroy Enemy Satellites The quietly developed program, known as Project Hemisphere, was first detailed by the New York Times in 2013, but few know when the program was initially launched. In the 2000s, AT&T was said to have created software to dig through its databases, in an attempt to identify criminal activity. The communications company was revealed in 2007 to have handed over personal user data to law enforcement, causing public outcry.\\nIn the 2013 Times report, Project Hemisphere was branded as a cooperative effort between AT&T and the Federal Drug Administration. It was said that the communication corporation used its data-mining software to surveil its phone records, analyzing and handing over information to authorities. The data includes user locations, timing of conversations, as well as possible reasons for talks. © REUTERS/ Mike Blake Nevermind Transparency: White House Unlikely to Declassify Secret Yahoo Email Order AT&T is the second-largest communication provider in the US, after Verizon, and operates a large complement of cell towers and wireless infrastructure. It retains cellphone records of its customers, beginning in 2008.\\nOn Tuesday, the Daily Beast released AT&T documents detailing that the corporation has been quietly cooperating with law enforcement for years, providing huge amounts of data on customers without going through the legal channels required by US law. \\nEpisodes include the concealed facilitation by AT&T into far-reaching homicide and Medicaid fraud inquiries. The only condition that AT&T laid down on the federal surveillance agencies was that the phone company not be revealed to have freely participated in investigations. One paper details that the corporation sought to disallow law enforcement to use evidence obtained through Project Hemisphere in court. From Flying Start to Abrupt End: Sweden Bans Drone Photography “The Government agency agrees not to use the data as evidence in any judicial or administrative proceedings unless there is no other available and admissible probative evidence,” the 2014 statement reads.\\nAdam Schwartz, a lawyer for the Electronic Frontier Foundation, explained that the request pushed investigators to create false investigative narratives, that allowed for digging up evidence on suspects and keeping their sources hidden. In the meantime, AT&T enjoyed growing revenues from allowing authorities to use Project Hemisphere. According to documents, the spy-program earnings grew, from $77,924 in 2007, to $940,000 in 2011. \\nChristopher Soghoian, an ACLU analyst, sees Project Hemisphere as a natural evolution of AT&T’s cooperation with federal surveillance networks. \\n“They’ve developed this massive program and of course they’re going to sell it to as many people as possible,” he said to the Daily Beast. \\nThe revelation has stirred controversy in the US, especially in the wake of the recently-announced merger deal between AT&T and Time Warner, which still must undergo regulatory scrutiny before being closed. ...'"}, "time": 1742564558.9153316}