{"duration": 0.047059059143066406, "input_args": {"text": "'Support Us BBC’s Children Show ‘Just a Girl’ is About a Transgender Child Taking Hormone Blocking Drugs 0 \\nThe BBC series aimed at children as young a six describe how Ben became Amy by taking hormones to halt puberty. It is yet another example of the agenda promoting the blurring of the genders. And they are now aiming children. \\nLast year, I published an article entitled The Agenda Behind Bruce Jenner’s Transformation where I explained how Jenner’s sex change was intentionally publicized and celebrated because it was part of a larger agenda promoting the blurring of the genders. This agenda is even more obvious and insidious this year because there’s a conscious effort to reach children. A child with the word ‘Transgender’ stamped across the screen. This sums up what mass media has been about these past years. Although ‘Amy’ is played by an actress, the story claims that she used to be boy named Ben. \\n– Advertisement – \\nCBBC’s series Just a Girl is the latest baffling attempt at normalizing, trivializing and even celebrating the completely unnecessary process that is childhood sex change. Freely available online on CBBC’s website, the series even teaches children about taking hormones and puberty-halting drugs. Do we truly know the effects of such drugs on one’s developing body and brain chemistry. Of course not. Why is this radical and aberrant process promoted to children? Do children need to know about hormone blockers? AND WHERE ARE THE PARENTS?! \\nIn my humble opinion, parents who subject their children to radical treatments such as hormone blockers and sex change surgery should be trialed for child abuse. Instead, these things are actually encouraged in shows aimed at children and society is following suit. \\nSome NHS clinics (such as the Tavistock Centre in North London) have been prescribing hypothalamic blockers to children as young as nine. In another case, a seven-year-old boy was ordered to be removed from his mother’s care because ‘she was raising him as female’. This is what the elite wants to see: Confused children wondering about their gender. HOW ABOUT YOU GO OUTSIDE AND RIDE A BIKE OR SOMETHING? \\nHere are quotes taken from Just a Girl . In Just A Girl, Amy says: ‘When I was born, Mum said Dad was so pleased that he had a boy to take to the football. But Mum knew I was different. She realised early on that I was born in the wrong body.’ She adds: ‘My Mum supported me when I did a PowerPoint presentation to my class about transitioning and that I wasn’t going to come to school in boys’ clothes any more, but girls’ clothes. I wasn’t Ben, I was Amy.’ Later Amy is shown telling a friend, Josh – a boy who wants to be recognised as a girl – that she is on hormone blockers, saying it took ‘ages’ to get them after ‘loads of tests and talks at the clinic’. ‘Once they realised I was trans for real, [I] got them,’ she says. In another entry, Amy tells viewers she has developed a crush on a boy called Liam, but confides: ‘Liam thinks I’m just a girl, but I’m not. I’m trans. And what’s he going to say if he finds out? Stop being my friend? Why? I’m still me, aren’t I?’– Daily Mail, Does your child really need to know how ‘Ben’ became ‘Amy’? Furious parents slam ‘damaging’ BBC sex change show aimed at six-year-olds This last bit appears to be taken straight from a neuro-linguistic programming (NLP) handbook. The goal: To confuse young minds about sex and gender. Backlash \\nThe show was accused by several groups of ‘sowing the seeds of confusion’. Norman Wells, director of the Family Education Trust, said: \\n‘The more we promote the idea that a boy can be born into a girl’s body and a girl can be born into a boy’s body, and that drugs and surgery can put things right, the more children will become utterly confused. Respecting and preserving a child’s birth sex should be seen as a child protection issue. It is irresponsible of the BBC to introduce impressionable children as young as six to the idea that they can choose to be something other than their biological sex.’’– Ibid. \\nThe BBC defended its series, releasing a statement which claimed the program dealt with “universal themes that many children relate to”. \\n“Just a Girl is about a fictional transgender character trying to, make sense of the world, deal with bullying and work out how to keep her friends, which are universal themes that many children relate to, and which has had a positive response from our audience. \\n“CBBC aims to reflect true life to our audience, providing content that mirrors the lives of as many UK children as possible – you only have to look at programmes such as The Dumping Ground or our BAFTA winning and ground-breaking transgender story ‘I am Leo’ to see that is the case.” \\nThe BBC mentions I Am Leo which is another CBBC production. It is a documentary following a 13-year old teen’s process to become a boy. Leo (born Lily) is one of the youngest children in the UK to be given hormone therapy. \\nIn short, the BBC and the rest of mass media are fully committed in pushing the gender blurring agenda to children before they even reach puberty.'"}, "time": 1742628583.374972}