{"duration": 0.07747316360473633, "input_args": {"text": "'MOSCOW  —   First, two television reporters vanished. Then a waiter went missing. Over the past week, men ranging in age from 16 to 50 have disappeared from the streets of Chechnya. On Saturday, a leading Russian opposition newspaper confirmed a story already circulating among human rights activists: The Chechen authorities were arresting and killing gay men. While abuses by security services in the region, where Russia fought a   war against Islamic insurgents, have long been a stain on President Vladimir V. Putin’s human rights record, gay people had not previously been targeted on a wide scale. The men were detained “in connection with their nontraditional sexual orientation, or suspicion of such,” the newspaper, Novaya Gazeta, reported, citing Russian federal law enforcement officials, who blamed the local authorities. By Saturday, the paper reported, and an analyst of the region with her own sources confirmed, that more than 100 gay men had been detained. The newspaper had the names of three murder victims, and suspected many others had died in extrajudicial killings. A spokesman for Chechnya’s leader, Ramzan Kadyrov, denied the report in a statement to Interfax on Saturday, calling the article “absolute lies and disinformation. ” “You cannot arrest or repress people who just don’t exist in the republic,” the spokesman, Alvi Karimov, told the news agency. “If such people existed in Chechnya, law enforcement would not have to worry about them, as their own relatives would have sent them to where they could never return,” Mr. Karimov said. The sweep, like so much else in Russian politics today, was entangled in the country’s troubled politics of street activism. It began, Novaya Gazeta reported, after a   gay rights group, GayRussia. ru, applied for permits to stage gay pride parades in four cities in Russia’s predominantly Muslim North Caucasus region, of which Chechnya is a part. The group had not focused on the Muslim areas. It had been applying for permits for gay parades in provincial cities around Russia, and collecting the inevitable denials, in order to build a case about gay rights and freedom of assembly with the European Court of Human Rights, in Strasbourg, France. It had applied to more than 90 municipal governments. Nikolai Alekseev, a gay rights activist coordinating this effort, told Novaya Gazeta he had chosen this tactic rather than staging risky, unsanctioned gay parades. The group had not applied for a permit in Chechnya, but in another Muslim region in southern Russia,  . The mere application there  —   denied, as usual  —   had prompted an   counterdemonstration. In the restive Muslim regions, Mr. Putin has empowered local leaders to press agendas of traditional Muslim values, to   an Islamist underground. The gay pride parade applications became a galvanizing issue. “In Chechnya, the command was given for a ‘prophylactic sweep’ and it went as far as real murders,” Novaya Gazeta reported. According to the report, the authorities set to finding and arresting closeted gay men, partly by posing as men looking for dates on social networking sites. “Of course, none of these people in any way demonstrated their sexual orientation publicly  —   in the Caucasus, this is equal to a death sentence,” the newspaper wrote of those detained in the sweep. “I got numerous, numerous signals,” about the sweep of gay men, said Ekaterina L. Sokiryanskaya, Russia project coordinator for the International Crisis Group, and an authority on the North Caucasus. “It came from too many sources not to be true. ” Gay men have begun deleting online accounts, or fleeing the region. One user of Vkontakte, a Russian social networking site, wrote that a    boy had been detained in a village in Chechnya. He returned days later, according to the post, “all beaten, just a sack with bones. ” The newspaper published contact information to aid men wanting to leave Chechnya for relatively more tolerant parts of Russia. But reaching communities of closeted gay men in the remote mountain region poses challenges. “Even delivering the information is very difficult,” Ms. Sokiryanskaya, who is familiar with the aid effort, said. “They are just small islands, isolated. ”'"}, "time": 1742563677.1189835}