{"duration": 0.1601245403289795, "input_args": {"text": "'The deathbed confession of a former CIA operative once again confirms that aliens are a real presence on our planet, raising our hopes that 2016 will forever go down as the Disclosure Year. The former agent, who has chosen to maintain his anonymity, said that he was first introduced to the extraterrestrial quandary in the late 1950s.\\n“I was coming into the Army fresh off the farm, so I really didn’t have much knowledge of anything, so my boss filled me in on Project Blue Book and what they had found so far concerning Greys and aliens and the Roswell incident.” \\nThe secrecy of his mission was of the utmost importance, so the ex-CIA agent was forbidden from disclosing any details pertaining to his line of work, not even to his family. He claimed he was coerced into vowing he would not speak of this subject for a period of 50 years. That time interval ended in 2010, prompting the aging man to spill the beans. What he reveals is a complex mass of cover-ups leading all the way up to the highest governmental positions.\\nOn one occasion, he recalls his superior being instructed by president Eisenhower to fly over to Area 51, find whoever was in charge and demand that he reported to Washington. The activity over there was so anomalous that even the chief of state was in the dark.\\nThe information revealed by the former agent is on par with Bob Lazar’s disclosure of the S4 facility and the activities that took place at the base.\\n“They had different garage door openings and in these openings they had different saucer crafts. The very first one had the Roswell craft in. It was kind of crashed up but apparently every alien that was in it died except for a couple.” \\nHe describes the Roswell craft as a “really strange” UFO that looked like it was made up of “really heavy aluminum foil.” It only weighed around 150 to 300 pounds and the propulsion system was most likely antigravitic.\\nDuring the same visit, the CIA operatives witnessed a film showcasing the autopsy of one of the crash victims. But there were also live aliens being kept at S4 and his supervisor was allowed to participate in the interviewing of one such creature.\\nThe agent described the alien as looking ‘oriental’, with a small body, a disproportionately-large head, large eyes and with small slits instead of ears.\\n\\nThere’s no way the CIA agents confused the UFOs they saw with whatever secret aircraft was being developed at that time. Following their visit to the S4 facility, the CIA agents also traveled to Area 51, located several miles north. There they saw the U2 spy plane, which of course, they didn’t know existed, but it was more than obvious that this was man-made while the other crafts clearly weren’t.\\nAfterwards, the CIA agent and his superior officer flew back to Washington, where they debriefed President Eisenhower on the situation. Richard Nixon and J. Edgar Hoover were also present.\\n“He [Eisenhower] was totally shocked. He appeared for the first time to be worried.”\\nThe former agent’s admissions came at a cost, though. A short while after speaking with UFO investigator Linda Moulton Howe, he was apprehended by the Men in Black.\\n“I was going to a grocery store when two guys in black suits came out of a black Lincoln Town Car and came over to see me. They told me that I’d better not publish anything or talk to Linda about any more things.” \\nThey succeeded in intimidating him. But that was before the interview below took place. As an old man whose time is almost up, the former CIA operative felt he should ignore their warning and disclose what he knew.\\n\\n“I feel much better having talked about it,” he told Richard Dolan. “I kind of feel like there’s a load off my shoulders because I have an awful lot of secrets I’ve kept over the years.”\\nMore than 50 years have passed since the events described by the CIA agent took place. Nowadays, more and more people believe we’re on the brink of disclosure. Some even speculate that President Obama will take up this mission before leaving the White House or by the end of the year.\\nThat is also the opinion of U.S. lobbyist Steve Bassett, director of the Paradigm Research Group and the only official UFO disclosure lobbyist in the United States. He is convinced the White House has known about the existence of extraterrestrials for several decades now. It’s about time the rest of the world knew.\\n“ET is real, we have got beyond that,” Bassett said. “We are going to get disclosure this year. I am not sure who will win the election, but I think Obama will be the disclosure president. He will be looking at a Nobel Prize for making an announcement like that. I am 85 per cent sur Obama will make the announcement before he leaves office and within days the [United Kingdom’s] Prime Minister will follow. I am trying to force Obama to make the disclosure. I think we are going to get there,” he added.\\nLately, there’s been much talk of disclosure.\\nLeaked e-mails between former chief of staff John Podesta and astronaut Edgar Mitchell show that the two were planning to arrange a meeting with Obama to discuss releasing the truth from custody .\\n“Five decades of UFO information have dramatically shifted the public awareness of an extraterrestrial presence,” Mitchell wrote. “And yet, our government is still operating from outdated beliefs and policies. These are detrimental to trust in government transparency, science, religion and responsible citizenry embracing the next step in our country’s space travel and research.”\\nThe former astronaut was one of the biggest proponents of alien life and his death in February of 2016 was a blow for the pro-disclosure community. But it looks like we might have a chance at winning this.\\nIn an interview with CNN, Podesta let the world know that it’s high time the government “released any evidence” of alien life.\\n\\n“The U.S. government could do a much better job in answering the quite legitimate questions that people have about what’s going on with unidentified aerial phenomena.”\\nHeck, even the Vatican’s on board with disclosure . Huh, who would’ve thought it possible?\\nIn 2015, Father Jose Funes, the Pope’s chief astronomer said that the Vatican believed life on other planets is not only possible, but highly likely. Furthermore, he stated that the existence of aliens does not contradict the Bible or the Christian belief system.\\n“The Bible is not a scientific book,” Funes said. “If we look for scientific responses to our questions in the Bible, we are making a mistake. It answers great questions like ‘what is our role in the Universe?’”\\nStill don’t believe in the upcoming disclosure? Good, that means you’re prepared for anything.\\nSource: UFOholic \\n'"}, "time": 1742562805.1277745}