{"duration": 0.13006854057312012, "input_args": {"text": "'While the protest movement plotting to disrupt   Donald Trump’s inauguration is largely attempting to portray itself as grassroots, in actuality professional   activists are leading the charge. [A main protest coalition group calls itself DisruptJ20. The organization’s website does not say much about who is behind the group. DisruptJ20 “rejects all forms of domination and oppression, particularly those based on racism, poverty, gender and sexuality, organizes by consensus, and embraces a diversity of tactics,” the site reads.  Claiming it stands for the vast majority of Americans, the group calls itself the “start of the resistance. We must take to the streets and protest, blockade, disrupt, intervene, sit in, walk out, rise up, and make more noise and good trouble than the establishment can bear. The parade must be stopped. ” DisruptJ20 is planning a slew of actions aimed, as the group relates, at “disrupting the ceremonies. ” According to the website, those actions include “spontaneous, unpermitted events,” an “unpermitted, anticapitalist march,” civil disobedience and disruption plans. Lacy MacAuley has been one of the main public faces of DisruptJ20, conducting numerous interviews with the news media as an activist with the group. Her contact details are listed on DisruptJ20’s website. From 2011 until the end of 2013, MacCauley, who turned down a Breitbart News interview request, served as a media activist at the Institute for Policy Studies (IPS) which has received financing from George Soros’s Open Society Institute. IPS regularly partners with the   Center for American Progress to produce joint documents and reports on progressive issues. CAP was founded by John Podesta, the former chairman of Hillary Clinton’s presidential campaign. Podesta previously served as a counselor for President Obama’s White House and chief of staff to President Bill Clinton. IPS and CAP previously released a “Unified Security Budget,” a list of defense spending recommendations that were partially adapted by the Obama administration. MacAuley’s IPS bio evidences her ties to professional leftist groups, including the controversial, now defunct Association of Community Organizations for Reform Now (ACORN) Project Vote, and United for Peace and Justice. Her IPS bio reads: Lacy came to IPS after doing communications for a variety of progressive organizations through the progressive PR firm Massey Media LLC and as a single contractor. She has done media relations work with groups such as Project Vote and ACORN, United for Peace and Justice, Jubilee USA, Mountain Justice Summer, the IMF Resistance Network, and the Solidarity Center (international affiliate of the  ). The only other contact listed on DisruptJ20’s website is for organizer Legba Carrefour. Speaking to the Boston Herald, Carrefour made clear DisruptJ20’s intention is to cause “chaos” at the inauguration. “If the headline (on Jan. 21) is ‘Donald Trump inaugurated amid complete chaos and a cluster (expletive),’ then we won,” Carrefour said. “A lot of us are people who could be considered anarchists. None of us have respect for the office or the man. ” On his Twitter account, Carrefour describes himself as a “rather glam anarchist who lives, writes, and organizes a metric f*ckton of protests in Washington, DC. ” Another   protest organizer has been identified as Scott Green, a leader with the D. C.   Coalition. Green was captured allegedly plotting inauguration hijinks in an undercover video released yesterday by Project Veritas. “I was thinking of things that would ruin their evening, ruin their outfits and otherwise make it impossible to continue with their plans. So they get nothing accomplished,” Green says in the video. Green and his group were involved in violent protests in Sacramento in June. Local Fox40 reported: “I would use the word force.   and other fascists don’t back down, they can, and they ought to be made to back down,” said Scott Green, a supporter of the   Action group, also known as Antifa. Green, who used an alias while speaking to FOX40 for safety, did not attend the protest, but he says he has been present at similar ones that ended violently. Antifa itself isn’t new, but is an offshoot of the group   Action, which started in the late ’80s in Minneapolis. Anther activist caught allegedly plotting against the inauguration in the Project Veritas video is Luke Kuhn. “If you had a pint of butyric acid, I don’t care how big the building is, it is closing,” Kuhn says in the video during a conversation about setting off a chemical concoction to cause the evacuation of one of the planned inauguration balls. One Luke Kuhn protested President Bush’s inaugural in 2001 and was quoted at the time in the Baltimore Sun as a “veteran protester. ” Kuhn told the newspaper about his plans to bypass police checkpoints at Bush’s inauguration that year. “If people pass through the checkpoints and the police take their signs, the demonstrators will be made ineffective,” he said. “What I encourage people to do   …     have 30, 000 people march to one of the checkpoints and demand to get through. ” In February 2006, Kuhn led a   at a Minuteman Project rally on Capitol Hill against the U. S. guest worker program. Activist Dylan Petrohilos was also filmed by Project Veritas allegedly participating in the DisruptJ20 planning meeting. He doubles as a digital journalist for ThinkProgress, which is a media project of the     Center for American Progress. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. With research by Brenda J. Elliott.'"}, "time": 1742562030.0455186}