{"duration": 0.07288360595703125, "input_args": {"text": "'For the last 20 years, if you were in the bar business and knew one thing about the bartender Adam Seger, it was that he was the man behind the Seelbach cocktail. The Seelbach is named after the Seelbach Hotel (today the Seelbach Hilton) a storied   lodging in downtown Louisville, Ky. that is mentioned briefly in “The Great Gatsby. ” Shortly after being put in charge of the hotel’s bar and restaurant operations in 1995, Mr. Seger declared that he had discovered a recipe for a   cocktail that was once the hotel’s signature drink. He tested it, liked it and put it on the menu. The news media soon picked up on the tale, and within a few years, the Seelbach cocktail was regarded as a rescued classic. It’s a tantalizing back story, one that has charmed cocktail writers and aficionados for years, and there’s only one thing wrong with it: None of it is true. After two decades of   Mr. Seger, 47, who left the hotel in 2001 and recently helped open the Tuck Room in downtown Manhattan, has decided to come clean that he concocted not only the drink but also the story behind it. “I was nobody,” Mr. Seger said of his standing as a bartender then. “I had no previous accolades in the bar world. I knew I could make a great drink. I wanted it to be this promotion for the hotel, and I felt the hotel needed a signature cocktail. How could you have a place that F. Scott Fitzgerald hung out in that doesn’t have a damn cocktail?” Mr. Seger’s sin is hardly an original one bartenders have been telling   tales since there have been bars to tend. It is, however, an unusual instance of   legerdemain in an era when mixologists have made an effort to be more scrupulous about cocktail history. The Seelbach cocktail story began when Mr. Seger started digging into the hotel’s history. “We found old menus,” he said. “I was convinced there had to be a Seelbach cocktail. ” Except there wasn’t. So he created one, mixing bourbon, triple sec and Angostura and Peychaud’s bitters, and topping it all with sparkling white wine. He then came up with an elaborate origin story involving a couple from New Orleans who had honeymooned at the hotel in 1912. The man ordered a manhattan, the woman a Champagne cocktail. The clumsy bartender, spilling the bubbly into the manhattan, set the mess aside and made the drinks anew. But the accidental mélange got the barman thinking. Soon, the Seelbach cocktail was born. The Louisville   was the first to write about the   drink. Soon, it was included in “New Classic Cocktails,” a 1997 book by Gaz Regan and Mardee Haidin Regan. Later, it found its way into “Vintage Spirits and Forgotten Cocktails,” an influential book by the drinks historian Ted Haigh, known as Dr. Cocktail. To Mr. Seger’s amazement, no one ever asked him to produce an old menu with the drink on it. “When Ted’s book came out, I thought, ‘Oh, now this is getting too serious, because this is a history book,’” Mr. Seger said. Mr. Seger, who talked of how he had “carried this around” for years, recently confessed his transgression to Mr. Regan. “To be honest,” Mr. Regan said, “I always suspected that Adam had created the drink, but I really, really loved it, his story was almost plausible, and I needed recipes for ‘New Classic Cocktails. ’” When informed by a reporter of the drink’s new birth date, Matthew Willinger, the hotel’s director of public relations, replied that the cocktail “has certainly been a tradition of the hotel and will remain part of its future. ” Recipe: The Seelbach Cocktail'"}, "time": 1742561820.11143}