{"duration": 0.28971385955810547, "input_args": {"text": "'MONTAUK, N. Y.  —   On a sunny morning late this summer, Andrew E. Sabin was aboard his   yacht, “Above the Ground. ” He had begun the day in Amagansett, a   enclave near East Hampton where he maintains a lush   compound replete with a menagerie featuring peacocks and an enormous pig. Now, on the eastern tip of Long Island, Mr. Sabin pierced a clam with a hook and dropped his fishing line 120 feet to the ocean floor, hoping to land some cod. A wisecracking, boyish septuagenarian of seemingly unlimited energy, Mr. Sabin runs a privately held   recycling business that has made him enormously wealthy. The Sabin Metal Corporation processes about $1 billion worth of platinum, palladium and other metals each year. Annual revenue is less than that, but it clearly leaves plenty for a personal fortune. With that money, Mr. Sabin has emerged as a leading supporter of climate change initiatives. He has endowed the Sabin Center for Climate Change Law at Columbia University, funds climate change prizes and professors at Yale and the University of California, Los Angeles and is a major donor to Global Wildlife Conservation. He founded a local natural history museum where he leads nature walks, and, thanks to his generous support of environmental causes, he has four species named after him  —   two frogs, a chameleon and a lemur. But Mr. Sabin also sharply diverges from the environmentalist stereotype: He is a strident Republican donating big sums of money in an effort to elect Donald J. Trump president. His twin passions are at odds. Many of the Republican Party’s elected officials deny that humans are accelerating the warming of the planet, despite the overwhelming scientific evidence. Prominent environmental groups, including the Sierra Club and the Natural Resources Defense Council Action Fund, generally back Democrats, including Hillary Clinton. Yet Mr. Sabin has been a generous donor to the Republican Party for years, contributing more than $500, 000 to Republican candidates, committees and other political groups this election cycle. Even within his party, Mr. Sabin is an outlier: Many other Republicans who believe in climate change have declined to support Mr. Trump. But after backing Jeb Bush early in the primaries, Mr. Sabin threw his wallet behind Mr. Trump and never looked back. He recently donated $100, 000 to Trump Victory, the candidate’s joint   venture with the Republican Party. To hear Mr. Sabin tell it, a Trump presidency would not be such a threat to environmental concerns. Yes, Mr. Trump has routinely suggested that global warming is not real, has vowed to abolish the Environmental Protection Agency if elected president and said he would walk away from the landmark Paris accord approved last year, in which nearly 200 countries agreed to curb greenhouse gas emissions. Mr. Sabin, however, brushes that off as   bluster. “I don’t think he believes half the things he says,” he said. In meetings with Mr. Trump, he has come away convinced that the candidate is actually a reasonable,   man who is committed to clean air and clean water. As for Mr. Trump’s proclamations about the E. P. A. and the Paris agreement, Mr. Sabin is dismissive, arguing that such actions wouldn’t get through Congress. “There are good checks and balances,” Mr. Sabin said. “He won’t be able to do whatever he wants. ” The Trump campaign did not respond to a request for comment. As much as he supports the Republican ticket, Mr. Sabin is equally motivated by his loathing for Mrs. Clinton, whom he derides as untrustworthy, unethical and unfit for office. In front of his mansion, in an organic garden that features kale, blueberries and Swiss chard, Mr. Sabin has erected several “Hillary for Prison” yard signs. Last year, after the signs disappeared in the middle of the night, Mr. Sabin placed them on stilts and surrounded them with a   electrified fence. “You will have a fascinating journey down the rabbit hole in trying to understand the complexity of Andy Sabin,” said Susan Rockefeller, a prominent conservationist who has worked with Mr. Sabin and affectionately calls him “the   of the Hamptons. ” This summer, Mr. Sabin made several trips to Washington. His mission was to persuade Republican members of Congress to acknowledge climate change in the party platform that would shape the Republican National Convention in late July. In a flurry of meetings, Mr. Sabin, who wears a uniform of Hawaiian shirts, baggy khaki pants and sneakers, visited the offices of Republican representatives including Chris Gibson of New York, Joe Wilson of South Carolina and Virginia Foxx of North Carolina, as well as Senator John Barrasso of Wyoming. Mr. Sabin has no doubt that greenhouse gases from human activity are warming the planet, leading to rising oceans and more severe weather. “The science is clear,” he said, and inasmuch as he can, Mr. Sabin is working to minimize his own carbon dioxide emissions. At Sabin Metal Corporation’s processing plants in upstate New York, North Dakota and Ontario, he says he has invested in expensive equipment to reduce emissions and minimize pollution. “Not a drop of carbon comes out of my stacks,” he said. Yet on Capitol Hill, he measured his words. Instead of trying to persuade Republican lawmakers that climate science is real, he talked to them about the need to minimize pollution as a way to keep people healthy. He makes the case that worse air quality leads to premature deaths, an increase in illnesses, more stillbirths and higher hospital spending. “I don’t discuss climate change,” he says. “I discuss health. ” Mr. Sabin employs this rhetorical sleight of hand to reconcile what, to many, are inherently contradictory positions. “I came to the conclusion that I needed to come up with a way to get Republicans on board about cutting carbon,” he said. “Democrats aren’t going to convince Republicans that climate change is real, so I’m trying to get them to the same place. ” He has drafted a policy paper peppered with statistics from the RAND Corporation and Carnegie Mellon University that encourages lawmakers to invest in clean energy jobs and to pressure businesses to pollute less, simply for the good of public health. If embraced in earnest, Mr. Sabin says, this approach will result in reductions in greenhouse gas emissions  —   a goal of many Democrats. But he opposes many ideas from Democrats about how to reach that goal. He is vehemently opposed to new regulation and a carbon tax, and he says the E. P. A. is guilty of overreach. Instead, Mr. Sabin says that private investments in clean coal technology, new nuclear power and renewable energy will reduce greenhouse gas emissions sufficiently to check global warming. In the meantime, Mr. Sabin supports the use of cheap and abundant natural gas. It is a position that closely mirrors that of the broader Republican Party on energy production. And Mr. Sabin claims to have the Trump campaign’s ear on the issue. He says he is in regular contact with the campaign and took credit for shaping the response to a question in the second presidential debate, when Mr. Trump talked up clean coal, wind power and solar energy. “That came from me,” Mr. Sabin said. Many environmentalists, however, say the policies promoted by Mr. Sabin and Mr. Trump will not do nearly enough to curb emissions. “To put the fate of our climate on clean coal and     nuclear is about the riskiest proposition in the world,” said Michael Brune, executive director of the Sierra Club. “We might as well bet on leprechauns and the Easter bunny. ” Mr. Sabin’s positions baffle even some professors he supports. Michael Gerrard, director of the Sabin Center for Climate Change Law at Columbia University, said: “Andy and I agree about some things and agree to disagree on other things. The party has gone off the rails on that side. ” Many Republicans in Congress reject the idea that human activity is contributing to climate change. “I don’t think what we do as a race is going to be the deciding factor in what happens with our environment,” said Ms. Foxx, the North Carolina congresswoman. “Because I happen to believe that God is in charge. ” There are some prominent Republicans talking openly about climate change. George Pataki, the former New York governor, has been critical of climate change deniers in the party. Theodore Roosevelt IV, a Republican and the   of the former president, is an investment banker at Barclays who focuses on clean energy and an outspoken conservationist. And Jay Faison, a North Carolina businessman, has set up a “super PAC” to finance candidates who support renewable power. Yet none of these men are supporting Mr. Trump, largely because of his volatile personality. Shortly after Mr. Sabin’s visits to Washington, he had a private meeting with Mr. Trump at the Manhattan home of Steven Mnuchin, the candidate’s national finance chairman. Mr. Trump wore his usual dark suit with a white shirt and a red tie. Mr. Sabin attended the meeting in a bright green Hawaiian shirt, wearing Buddhist prayer beads on his wrist. Mr. Sabin came away impressed. “Trump knows in his heart that cutting carbon is the right thing to do,” Mr. Sabin said. “He’s very different in person. He listens. ” Mr. Sabin, 70, grew up in the Flatbush neighborhood of Brooklyn and still speaks with a thick New York accent reminiscent of Mr. Trump’s. As a boy, he would wander over to undeveloped areas in nearby Bensonhurst and collect frogs and snakes with his bare hands. “I started catching them and never grew up,” he said. He joined the Army reserve in the late 1960s, he said, and then joined his father’s business, which collected and sold scrap metal. In the early 1970s, Mr. Sabin started a trading house for metals and other commodities. As Wall Street went digital, Mr. Sabin left trading behind and built out his father’s company into Sabin Metal Corporation. He attributes his passion for the environment to his boyhood enthusiasm. “Since I started catching frogs, I’ve always been interested in nature,” he said. “As the years went on I realized the importance of preserving what I was enjoying. ” He has been a Republican for as long as he can remember, too, and has internalized the party’s talking points about Mrs. Clinton. “I see corruption with the Clintons only rivaled by Nigeria, Malaysia or Indonesia,” he said. “It starts right at the top, and it disgusts me. ” Perhaps one way to makes sense of Mr. Sabin is to recognize that he is much like Mr. Trump himself. Impassioned and at times charismatic, he is also quick to ignore facts, brimming with conspiracy theories, and prone to objectifying women. His girlfriend is several decades his junior. “You’re only as young as the woman you’re touching,” he said. While watching Fox News, he complimented the appearance of the daytime host Jenna Lee. (“I think she’s so hot,” he said.) Aboard his yacht, he openly viewed pornography on an iPad. Over the course of several months, he sent a reporter numerous emails containing   images. On Thursday, Mr. Sabin said he was repulsed by Mr. Trump’s recently unearthed comments about sexually assaulting women  —   though not enough to withdraw his support. And he is unashamed of his own libido. “I’m proud that at 70 years old I still have a healthy sex drive,” he said. He also talks of radical transformation to the economy, while rejecting regulation as a tool to facilitate change. And on his Facebook page, Mr. Sabin traffics in the conspiracy theories of the   Alt Right. Stories such as “Michelle Obama Vows to Confiscate All Firearms Before Leaving the White House” and “United Nations to Investigate Hillary Clinton for Election Fraud” are posted alongside pictures of Mr. Sabin searching for salamanders. This complex personality is on constant display. Tooling around the Hamptons, he drives a Jeep Wrangler with his nickname, the Salamander Commander, emblazoned on the doors. On the back of the jeep are bumper stickers that say “Hillary for Prison” and “Trump 2016. ” At a separate property that he owns in the Hamptons, away from his mansion, Tibetan prayer flags form a canopy over the driveway. In front of the house is a small sanctuary for injured turtles. Buddha statues are placed around the grounds and throughout the house. Inside, a piano once owned by the abstract expressionist painter Lee Krasner sits in the living room. And all around the property are National Rifle Association signs, warning trespassers that they will be shot. In his personal gym at home, the wall is crowded with framed pictures of Mr. Sabin with Republican luminaries, reflecting years of support for the Republican Party. But while Mr. Sabin supports Mr. Trump today, he was not always so enthusiastic. “Donald’s a bird brain, all right?” he told the website Grist last fall, adding: “He’s, like, on a TV show! I have to laugh. ” These days, Mr. Sabin acknowledges his candidate’s shortcomings. And he said he disliked the hobbies of some of Mr. Trump’s children. (“I don’t like hunting,” he said. “That’s what I don’t like about Trump’s kids: these pictures of them holding leopards and elephant tails. ”) And yet, Mr. Sabin is still supporting Mr. Trump for lack of what he sees as a better option. “I’d like to keep a Republican House, and Republican Senate and a conservative Supreme Court,” he said. “Trump comes with the package to do that. ” It is a combustible, contradictory mix, reflecting the tensions roiling the Republican Party  —   and the nation  —   in this bizarre election season. In the   to the Republican National Convention in Cleveland, the party’s official platform was unveiled. “Climate change is far from this nation’s most pressing national security issue,” it read. “This is the triumph of extremism over common sense, and Congress must stop it. ” Mr. Sabin was unruffled by the snub. “It was a disappointment,” Mr. Sabin said. “But if you don’t try it can’t happen. ” Motoring back to the Long Island shore on his yacht, Mr. Sabin was satisfied with his haul. A dozen meaty fish were in the hold, including several cod and a handful of black sea bass. On the horizon, five towering wind turbines rose from the ocean. The first offshore wind farm in the United States, the turbines have stirred up predictable controversy in this area. But Mr. Sabin rejects the Nimbyism that has turned some wealthy locals against the project. “I’m a big proponent of wind energy,” he said. “Some people worry about the views, but it’s better than more carbon. ” In the cabin of the boat, Fox News played on a large   TV. It was midday, and Mr. Trump was holding forth at a news conference at his new Washington hotel, where he finally admitted that President Obama was born in the United States, after years promoting the birther conspiracy. “Trump is doing really well,” Mr. Sabin said enthusiastically. “Hillary’s in trouble. ”'"}, "time": 1742562077.0147738}