{"duration": 0.11024808883666992, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Reaction to President Trump’s address tended to focus on its sober style. His seriousness of purpose and calls for unity reassured  —   and surprised  —   many listeners. “I think it sounded great, like a utopia,” one voter said, adding, “I don’t think it’s that simple. ” Indeed, Mr. Trump, who met with congressional Republican leaders on Wednesday, faces not only a committed Democratic opposition but a divided Republican Party. Today’s episode of The Daily podcast examines the president’s speech to Congress, his call for unity and his promise to protect America. Listen from a computer, on an iOS device or on an Android device. _____ 2. Emboldened by encouraging signals from the Trump administration, populist leaders across Central and Eastern Europe are cracking on nongovernmental organizations once protected by Washington. Groups that promote open government, aid refugees and often serve as checks on authoritarian governments are being targeted. Organizations funded by George Soros, the liberal American billionaire, are facing particular ire, accused of working to flood Europe with Muslim refugees and transform “Christian” nations into multicultural stews of   globalism. _____ 3. Developments in Syria this week: Russia mistakenly bombed Syrian fighters being trained by the U. S. another unintended clash among the myriad forces operating on the battlefield. And U. N. investigators released a report detailing war crimes, calling the Syrian government’s bombing of a humanitarian convoy in September, which killed 14 aid workers, “one of the most egregious. ” Next door in Iraq, the battle for Mosul continues. Our reporter met a family fleeing the   portion of the city. _____ 4. Tornadoes lashed the Midwest, killing at least three people and leaving a trail of splintered homes, razed businesses and power outages. The severe weather isn’t over yet. Forecasters said the   and Deep South were also at risk. _____ 5. Snap Inc. is losing money, but its valuation was set at $24 billion on the eve of its arrival on the New York Stock Exchange, one of the biggest market debuts in years. Shares of the Snapchat parent company were priced at $17, higher than expected in an indication of strong demand. _____ 6. Scientists may have found the oldest signs of life on Earth. Or not. Some researchers say ancient rocks in a remote geological outpost in Canada yielded bacteria fossils that could be up to 4. 2 billion years old, relatively soon after the planet’s birth. Others are dubious  —   and vocal. Such battles, an optimist observed, are “how science progresses. ” _____ 7. In a sign that the era of the starchitect may be over, a modest team of three architects won their profession’s highest honor: the Pritzker Prize. Rafael Aranda, Carme Pigem and Ramon Vilalta set up shop in their hometown in Spain 30 years ago and are not   outside the country. Their major works include the Soulages Museum, in Rodez, France, and the Sant Antoni  —   Joan Oliver Library in Barcelona. The award cited “their intensely collaborative way of working together, where the creative process, commitment to vision and all responsibilities are shared equally. ” _____ 8. Los Angeles votes for mayor next Tuesday. The incumbent, Eric Garcetti, a Democrat, faces some criticism for being “bureaucratic bland” but seems assured of beating 10 challengers for a second term  —   and possibly a bigger role in an embattled national party. We caught up with him at an outdoor cafe downtown, where he sipped green tea, fielded requests for money from a homeless man, and said: “I think people mistake bloody noses for big accomplishments. Maybe because I don’t draw blood, but we actually work well with people, that that is seen as cautious. ” _____ 9. Our tech writer says the sexism scandal at Uber feels like a watershed moment for Silicon Valley. “This could be the start of a deep,   and thorough effort to remake a culture that has long sidelined women  —   not just at Uber but across the tech business, too,” he writes. _____ 10. Spring is almost here. Here’s a guide to the season’s most promising live events, from Bette Midler’s star turn in “Hello, Dolly!” to Chris Rock’s first standup tour in nearly a decade to The Weeknd’s new North American jaunt. And don’t forget “Groundhog Day,” a new musical based on the hit film, coming to Broadway this spring after a London run. Above, Punxsutawney Phil, aka Raymond J. Lee, in transit. _____ 11. Finally, we’ve been surfing the web for you. And we found lots of great stories that have nothing to do with politics. For instance, Ruth Bader Ginsburg’s fitness routine,  ’s special scent, the world’s worst skier and a trip to infinity. Have a great night. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563338.6453302}