{"duration": 0.05499553680419922, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / U.S. Elections “November Chaos”: What You’re Not Being Told Essential Reading The Advent of the Anti-Christ II By Rixon Stewart on August 6, 2010 \\nIf or more likely when war erupts with Iran it will herald the appearance of an ominous figure long foretold. And guess what? We think we’ve spotted him One Day in Birmingham By Nick Kollerstrom on February 12, 2010 \\nThe terror outrages in Britain last year may not have been the work of “Muslim extremists”. A series of virtually unreported events in a Birmingham hotel suggest the covert involvement of Britain’s intelligence agencies in orchestrating events Before and after the “Holocaust”: Jewish population numbers in 1933 and 1948 By wmw_admin on November 30, 2013 \\nDuring the time Hitler was supposed to have killed six million Jews — between 1933 and 1948 — the world’s Jewish population actually increased from 15,315,000 to 15,753,000 Scallywag Magazine article on Lord McAlpine and Derek Laud By wmw_admin on November 15, 2012 \\nWe repost this original 1990s article as it marks the beginning of an ongoing saga of depravity in British politics Dimensional Shift and the New Earth- Has Jesus Christ Spoken? By wmw_admin on April 24, 2011 \\nIs this the most important book written since the original Gospels 2,000 years ago? We leave you to decide The Liberation of the Camps By wmw_admin on January 27, 2016 \\nIt is tantamount to virtual heresy to question the ‘Holocaust’ today. But did the extermination of 6 million really happen as we’ve been taught? The Illuminati Chronicles Part II By wmw_admin on November 28, 2007 \\nA Short History of the New World Order Part II By cyberpatriot@hotmail.com Aug. 10, 1973 – David Rockefeller writes an article for the “New York Times” describing his recent visit to Red China: “Whatever the price of the Chinese Revolution, it has obviously succeeded not only in producing more efficient and dedicated administration, but also […] Bloody Bill Clinton – American Caligula By wmw_admin on September 1, 2006 \\nThe real legacy of Clinton’s term of office: the chilling body count of those connected with him, who died in unusual or suspicious circumstances Who Really Murdered Holly Wells and Jessica Chapman? By wmw_admin on February 28, 2015 \\nRevelations that a US soldier was the killer would have jeopardised public support for the “War on Terror”. Hence a frame-up was required. A Joe Vialls classic recovered.\""}, "time": 1742561851.3355615}