{"duration": 0.0899057388305664, "input_args": {"text": "'Karl Denninger – There are some “five figures” of emails on a laptop that was seized from Weiner as part of a sexting minors across state lines investigation (which, I remind you, if it happened is a felony.) \\nHuma is married to (but now estranged from) Weiner. \\nThe laptop belonged to Weiner. \\nHuma claims “she doesn’t know” how the emails got there and that she wasn’t a “regular user” of said laptop. \\nAll of this is very important for several reasons: \\n1. Everyone involved in the original email investigation said that no other devices on which such material would be found existed. That is, they all stated under penalty of perjury and under oath that they had turned over all such devices they had possession of and access to. \\n2. If any of those emails are classified then there is a separate and distinct offense involved from any original offense because said device was not in any way authorized to have such material on it, was not under control of the State Department (either directly or by proxy), was not managed under same and in fact it was claimed to not exist by everyone who testified they had turned over all devices on which such material did exist. \\n3. At no time had Weiner been given classified access by the State Department or any agency clearing people to work with Hillary’s information; while he was at one point a Congressman (until 2011) since that time he has been a private citizen and, it appears, had no legitimate clearance of any sort whatsoever. While he probably can’t be prosecuted for that anyone involved in placing it there sure as hell can be and ought to be! \\n4. Making the issue far more serious Weiner has been involved in multiple sexual escapades and the current investigation involves potential federal criminal sexual conduct. This makes the presence of such material even more troublesome because one of the primary reasons to restrict classified information and why persons who receive clearances are vetted before clearances are granted is that conduct such as this exposes the person who commits such acts to blackmail as a means of compelling them to release said information to our nation’s enemies! \\nThere are people raising hell about the FBI “releasing” this information 10 days before an election. The better question is why the people who clearly lied about turning over everything in the original investigation are not at this instant under arrest for both perjury and obstruction of justice, including but not limited to Huma and Hillary herself! \\nThat Lynch apparently tried to run interference and block release of this information and so far has refused to issue a warrant for the data, if reports are to be believed, is even more outrageous as that refusal implicates not only herself in attempting to cover up a criminal act but probably implicates Obama as well. Oh by the way, if the device was seized pursuant to a lawful warrant (and it almost certainly either was or was voluntarily turned over by Weiner) and the original search was for “evidence related to sexting” then anything in a place or device that could reasonably hold evidence of said sexting is fair game if found by accident, so Lynch is out of luck here. \\nYes, it is outrageous that the FBI was basically backed into a corner and forced to put this out in the public, but consider their position. There are probably a whole bunch of people in both the FBI and the NYPD who know about this; they were investigating what they believed was nothing more than a pervert trading dick pics with a 15 year old girl in North Carolina and none of them were in any way expecting to find, nor were they cleared to investigate and have access to classified information generated from the Secretary of State . \\nYet that’s what they found and it didn’t happen by random chance — it happened due to the intentional acts of concealment of those in the Hillary camp including her top personal aide . \\nWhat are the odds this stays quiet? Zero ! \\nAnd before you get on the FBI for this realize that this is almost-exactly like them looking at William Jefferson a number of years ago and stumbling on nearly $100,000 of “cold hard cash” — literally — in his freezer. \\nThat stayed “secret” for about an hour and so would have this. \\nHILLARY AND HUMA FOR HANDCUFFS — NOW!'"}, "time": 1742563810.9456234}