{"duration": 0.11874270439147949, "input_args": {"text": "'A lawyer wearing a military uniform with a Nazi emblem and armed with two guns and nearly 2, 600 rounds of ammunition opened fire on random   in Houston early Monday, injuring nine before he was killed by the police, the authorities said. Six of the victims were taken to hospitals, one in critical condition and another in serious condition, the police said. Three others were treated at the scene. At a news conference on Monday afternoon, Capt. Dwayne W. Ready of the Houston Police Department described a tense episode that began about 6:30 a. m. local time. The first reports of gunfire began to trickle in when children were being driven to school, workers were setting off for their jobs and it was still dark on Law Street, where the shooting took place. The street is part of West University Place, an upscale area in southwest Houston. Police officers from several departments converged on the neighborhood, engaging the gunman while trying to protect people in the neighborhood and keep others away. The suspect exchanged gunfire with officers from about 25 yards, Captain Ready said, and was forced to take cover behind a tree close to his parked car. One officer went to the aid of a person who had been shot in a vehicle while other officers provided cover. “One of the more complex issues was tending to both the injured citizens who were still in the line of fire while engaging the suspect,” Captain Ready said. The police would not identify the suspect at the afternoon news conference or speculate on his motive. But earlier in the day, the department’s interim chief, Martha Montalvo, “He is a lawyer, and there were issues concerning his law firm. ” The authorities believe the suspect acted alone, and at the news conference, Mark Webster, an assistant special agent in charge of F. B. I. special operations, said they were not aware of any connection to a terrorist organization. He said the investigation was still preliminary. Captain Ready said that the gunman was wearing   apparel, and that there were “some old Nazi emblems about his personal effects” and where he lived, along with “vintage military stuff” dating to the Civil War. He would not speculate on whether it was Nazi apparel, but Chief Montalvo said later that “an old Nazi emblem” was on his uniform. The gunman also carried an “edged weapon,” something like a knife, which was in a sheath, Captain Ready said. The suspect had a .  Tommy gun and a .  semiautomatic handgun. Both were purchased legally, a spokesman for the Bureau of Alcohol, Tobacco, Firearms and Explosives said. The local TV station ABC 13 showed images of a Porsche Boxster parked on the street and being searched. Jennifer Molleda, whose husband’s car was struck while he was driving, told ABC 13, “The shooter was literally pointing the gun at windshields. ” She said her husband had spoken to her by telephone after he pulled into the parking lot of a Petco store at a strip mall nearby. “He was screaming: ‘I am shot. I am shot,’ ” she said. The mayor of Houston, Sylvester Turner, who was in Cuba on a trade trip, told ABC 13 by telephone that the investigation was looking into whether a relationship at the lawyer’s workplace had gone “awry. ” Witnesses told local television stations that they had heard several gunshots. “Steady shooting back and forth  —   it was a lot,” said Antoine Wilson, who told ABC 13 that he was driving in the area and heard multiple gunshots. An unidentified woman told the TV station that she had been driving to work when she heard the gunfire. Her car was struck from the front and side, she said, but she kept driving, pulling around a corner until she came to a stop. “I could still hear shots being fired on the streets,” she said, her arm bloody from broken glass. Lee Williams, who said he lives near the site of the gunfire, told ABC 13 that he was outside and tried to direct traffic away. “Once the police got here, they made me go back to my house,” he said. “I heard a lot of back and forth,” he said, adding that he had counted about 50 shots. Mr. Williams retreated to his front porch but was close enough to hear the police radios say, “He is down. ”'"}, "time": 1742564218.294752}