{"duration": 0.031764984130859375, "input_args": {"text": "'Five people were reportedly shot and killed around 8 a. m. in a Florida business, with the attack being viewed as a scene of workplace violence rather than terrorism. [The gunman is also dead and law enforcement officials report the situation is contained.  According to WFTV, the business where the shooting occurred is located in a manufacturing where businesses include “Gerber Collision  Glass and Fiamma Inc. a manufacturer of RV awnings. ” The Orange County Sheriff’s Office (OCSO) tweeted: OCSO on shooting scene   multiple fatalities. Situation contained, Now investigating tragic incident  will soon have accurate information,  —   OCSO FL News (@OrangeCoSheriff) June 5, 2017,  The FBI is on scene with the OCSO. CNN reports that “Orange County Mayor Teresa Jacobs and Sheriff Jerry Demings are also on the scene. ” WKMG 6 reports that the gunman was a “disgruntled employee. ” According to the Associated Press, Orange County Sheriff Jerry Demings says that gunman in the Orlando workplace attack was a former employee who “had been involved in a previous workplace violence incident. ” He said the suspect had also been “accused of battering another employee inside the business. ” UPDATE 3:17 pm ET: Law enforcement identified the suspect in Monday morning’s shooting as John Robert Neumann, Jr. saying he killed five individuals at Fiamma Inc —  a manufacturing company in Orlando —  then turned the gun on himself. CNN quotes Orange County Sheriff Jerry Demings describing an attack where certain people were targeted. The sheriff said, “He was certainly singling out the individuals he shot. ” At some point during the incident the gunman came across a temporary employee and “told her to leave. ” He killed    Robert Snyder,    Brenda      Kevin Clark,    Kevin Lawson, and    Jeffrey Roberts. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of “Bullets with AWR Hawkins,” a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.  '"}, "time": 1742562206.008225}