{"duration": 0.09973621368408203, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Hillary Clinton and Donald Trump returned to the campaign trail, but their first debate on Monday night dominated headlines. The ratings alone were newsworthy: 84 million viewers, possibly the most for a debate ever. Mrs. Clinton reveled in largely positive reviews, while Mr. Trump’s main strength was on trade issues. Mr. Trump has raised a host of complaints about the debate, including about his microphone and Lester Holt, the moderator. An unexpectedly powerful issue: his derision of a Latina beauty queen for gaining weight after winning the 1996 Miss Universe pageant. Above, Mrs. Clinton at a rally in North Carolina. _____ 2. Syrian government troops pushed into the ravaged city of Aleppo, backed by the fifth day of aerial bombardments by allied Syrian and Russian forces. Rebel forces disputed the government’s claim of a major advance, but the city suffered possibly the most ferocious assaults in five years of civil war. “Every day is worse than the last,” one desperate resident said. “Every day I leave my house, I keep in mind that I might not be back. ” _____ 3. Shimon Peres, one of the last pillars of Israel’s founding generation, died two weeks after suffering a massive stroke. He was 93. In a statement, former President Bill Clinton and Hillary Clinton said, “He was a genius with a big heart who used his gifts to imagine a future of reconciliation not conflict, economic and social empowerment not anger and frustration, and a nation, a region, and a world enhanced by caring and sharing, not torn asunder by the illusions of permanent dominance and perfect truth. ” 4. “It’s just a   funding bill,” the Senate majority leader, Mitch McConnell, groused. He was exasperated after a mix of Democrats and Republicans blocked his effort to advance a temporary spending bill that would head off a government shutdown this weekend. The vote fell 15 votes short of the 60 needed for passage. The issue: Democrats refuse to pass a bill that includes flood relief for Louisiana unless it also includes help for the   crisis bedeviling Flint, Mich. _____ 5. The man who has admitted responsibility for the 2013 Bridgegate scandal in New Jersey directly tied Gov. Chris Christie to the events. David Wildstein, who worked at the Port Authority of New York and New Jersey, said he told Mr. Christie during a Sept. 11 memorial service about organizing the closing of lanes leading to the George Washington Bridge. The point was to snarl traffic in Fort Lee, N. J. as a punishment for the town’s mayor. Mr. Christie, he said, laughed. _____ 6. One of our   stories today is about Alton Brown’s eighth cookbook, “EveryDayCook: This Time It’s Personal. ” Or rather, it’s about a glimpse of the person behind the food TV showman: supersmart, politically conservative, divorced, in a midlife crisis. “It’s ‘Who the heck am I?’ time,” he said. “I’ve spent years projecting and presenting this thing, but in the end, what am I? I thought it was important to put something on paper. ” _____ 7. Judges in the Hague sentenced this radical Islamist, Ahmad     to nine years in prison for his role in demolishing historic Muslim shrines in Timbuktu, Mali. It was the International Criminal Court’s first prosecution for the destruction of cultural heritage as a war crime. _____ 8. The W. H. O. ’s most comprehensive analysis so far of outdoor air quality worldwide revealed that 92 percent of the world’s people breathe unhealthy air. The report linked about three million deaths a year to outdoor air pollution, mostly from cardiovascular, pulmonary and other disease. The   areas are Southeast Asia and the Western Pacific region. _____ 9. The tech billionaire Elon Musk laid out the details of his plan to get people to Mars. In fact, to colonize Mars. His plans for his SpaceX company don’t stop there  —   he spoke of an Interplanetary Transit System capable of ferrying scores of passengers at a time to other planets. “It’s something we can do in our lifetimes,” he said, in a presentation to the International Astronautical Congress. More than 100, 000 people watched the  . _____ 10. A bill awaiting President Obama’s signature gives most Olympic and Paralympic medalists a tax break. For those who earn less than $1 million a year, the measure designates the value of their medals and their bonuses  —   $25, 000 for every gold, $15, 000 for every silver and $10, 000 for every bronze  —    . The one representative who voted against the bill, Jim Himes, Democrat of Connecticut, said Congress should be dealing with more urgent matters. “We’ve got a Zika crisis, an opium epidemic and gun violence in the news every day,” he said. _____ 11. Finally, Leonard Nimoy died last year, but his Spock lives on and prospers in the minds of many fans. The actor’s son, Adam Nimoy, pictured with him above, discovered one crucial reason in the course of making his documentary “For the Love of Spock. ” The character was not just an outsider and a principal in the   bromance he was also a rare multiracial role model on American television. A   Los Angeles artist said: “Every time McCoy would say, you’re   and Spock would say, I’m also   I was like, ‘Yeah, I get that.’ ” _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563665.7344723}