{"duration": 0.17324042320251465, "input_args": {"text": "'PIKEVILLE, Ky.  —   Here in the heart of central Appalachian coal country, an economic experiment is underway inside an airy renovated   bottling plant. Most days, Michael Harrison, a former mine electrician and “buggy man” who once drove trucks 700 feet underground, can be found hunched over a silver laptop, designing websites for clients like the Pikeville tourism board. Mr. Harrison, 36, is one of 10 former mine workers employed at BitSource, an internet   founded by two Pikeville businessmen determined to prove a point: that with training and encouragement, Kentucky miners can learn to code. “We told them, ‘Quit thinking of yourselves as unemployed coal workers you’re technology workers,’” said Rusty Justice, a founder of BitSource. He called his pep talks “reimagination training. ” Nearly 13, 000 coal jobs  —   and countless more in related industries  —   have disappeared in Kentucky since President Obama took office coal employment is at its lowest level since 1898. In Washington, Democrats and Republicans remain locked in a feud over whether Mr. Obama’s aggressive environmental regulations amount to a “war on coal. ” On the presidential campaign trail, Donald J. Trump is vowing to “put our miners back to work. ” But across central Appalachia, and especially here in eastern Kentucky, elected officials, business leaders, environmentalists and community advocates are looking beyond politics to wrestle with a question essential to the region’s survival: What comes after coal? The founders of BitSource are not the only ones thinking creatively there are nascent efforts in craft agriculture and energy efficiency as well. These initiatives will not cure central Appalachia’s economic woes at BitSource, Mr. Harrison was among 1, 000   miners who applied for 10 jobs. Rather, said Lora Smith, who oversees grants in central Appalachia for the Mary Reynolds Babcock Foundation, they represent lurching steps into what one local writer called “a terrifying liberation” for a region rich in natural resources whose people have deep ties to the land. It is “terrifying,” Ms. Smith said, “because people are out of work, but it’s also this liberation, to reimagine what this place can be. ” If Pikeville, population 6, 900, offers a glimpse into coal country’s uncertain future, Benham, Ky. with 500 mostly elderly residents, is a window into its past. Benham was built a century ago as a coal mining camp by a subsidiary of International Harvester, which mined the nearby hillsides, extracting coal to make steel. Today, the signs of coal’s decline are everywhere. The old company store is a mining museum. The brick schoolhouse, on a hillside overlooking the historic town, is an inn, said to be haunted. Abandoned houses lay crumbling in the hollows. Yet on a spring afternoon, something unusual  —   construction work  —   was going on. It was part of a project to retrofit old company houses like one owned by Pearl Cope, 83, a retired mine company receptionist whose home is so energy inefficient she pays up to $650 a month for heat during the winter. Carl Shoupe, 69, a retired miner and member of the local power board, organized the project with help from Kentuckians for the Commonwealth, a progressive advocacy group. Mr. Shoupe, a onetime union organizer, is no fan of the coal industry. Badly injured in the mines, he sports a goatee to cover scars on his chin and wears an orthopedic shoe with a   lift to compensate for a mangled left leg. He got into environmental advocacy about a decade ago, after giving up alcohol and finding God. “I got to looking around, when all this mountaintop removal and strip mining and tearing up of our beautiful mountains was going on, and I started praying about it,” he said. To Mr. Shoupe, the retrofitting is a small step on the daunting path toward what environmentalists call a “just transition”  —   economic growth that does not harm people’s health or the land. To Joshua Bates, 21, who spent the afternoon blowing insulation into Mrs. Cope’s basement, it means a job in the region he calls home. “A lot of people have left,” Mr. Bates said sadly. “Eighty percent of my friends are gone. ” The road to Hippo, Ky. snakes through a hollow in Floyd County that runs across Brush Creek, not far from where Todd Howard’s ancestors settled after the Revolutionary War. Mr. Howard, 36, a   Kentuckian, grew up here, dodging coal trucks on his bike and watching miners tromp off to work toting their lunch buckets. When he was 19, he joined his father’s business, helping mining companies navigate the cumbersome permit bureaucracy. But by 2009, with fewer permits being handed out, the company closed. “That sort of catapulted me into this farming thing,” he said. His path into farming began in February 2010, when he persuaded his wife that they should put a greenhouse in their backyard, and planted 42 varieties of heirloom tomatoes.    Kentuckians are increasingly turning to farming “out of necessity,” said Martin Richards, who runs Kentucky’s Community Farm Alliance. His group works with eight farmers’ markets in eastern Kentucky, including one Mr. Howard helped found with another   Kentuckian, Nathan Hall Mr. Richards says twice as many farmers participate as did five years ago. In 2014, Congress allowed certain states, including Kentucky, to begin farming industrial hemp after a ban of 60 years. Mr. Hall, 33, a Yale M. B. A. student who also studies environmental management (and briefly worked as a miner) was already exploring the idea of growing hemp, first cultivated in Kentucky in 1775. Today, with grants from companies like Patagonia, the clothing manufacturer, he and Mr. Howard are growing hemp on six sites in four counties  —   including five acres of reclaimed surface mine  —   and have big dreams to scale up. People here often say there will be no silver bullets, but rather “one thousand silver BBs” to replace lost coal jobs. Mr. Hall offers a variation: “We want to be a part of the silver buckshot,” he said, “that’s going to hopefully transform this region. ” Reimagining central Appalachia will take more than putting unemployed miners back to work. It will also require giving young people a reason to stay. In 2013, Representative Harold Rogers, a Republican who has been eastern Kentucky’s congressman for 35 years, and Steve Beshear, the governor at the time and a Democrat, became founders of SOAR, Shaping Our Appalachian Region, an initiative intended to promote innovation. They were tired of solutions that came from Washington. “We decided that whatever we did would have to be sprung from within,” Mr. Rogers said. SOAR convened its first Innovation Summit here in December 2013, in the middle of a blizzard 1, 700 people showed up. That inspired Mr. Justice of BitSource and his business partner, M. Lynn Parrish, whose engineering and excavation company has lost 70 percent of its customers in the coal downturn. They founded BitSource, with help from a federal grant, in an effort to diversify. About an hour away in Whitesburg, the leaders of Appalshop, an arts organization that grew out of President Lyndon B. Johnson’s War on Poverty, were also rethinking the group’s future in a   economy. Ada Smith, 29, is among a new generation taking over she is the daughter of an Appalshop founder, Herb E. Smith, 64, a filmmaker and miner’s son who has spent the past   documenting union fights, mine disasters, polluted land and water, and wrenching cycles of boom and bust. “What’s needed in this transition,” said Ms. Smith, who returned home after college, “are people in the region who want to stay  —   and figure it out. ” That rethinking led Appalshop to create a   digital marketing venture, Mountain Tech Media. It was unveiled in March at a party where a gourmet moonshiner, an early client, served   drinks. The company, a   cooperative, has two   employees on a team of 12, its chief executive, Jeremy McQueen, 30, said. The hope is to hire local young people over time. On a bright Monday in June, SOAR held its third Innovation Summit here. It looked like a convention of   and suits. Lunch was served outside while a bluegrass band played. There were two sandwich options: pulled pork and vegan wraps. Old coal country tensions flared. While Mr. Rogers was speaking, Ada and Herb Smith helped unfurl a banner opposing the construction of a $444 million prison. Mr. Rogers says it will bring 300 jobs, but Mr. Smith calls it “the wrong answer to the region’s economic problems. ” Mr. Parrish, who has known Mr. Smith for decades (their wives were college sorority sisters) was furious. “We’re all there trying to do solutions,” he said. “This was not the venue to do that in. ” Even so, Mr. Justice and Mr. McQueen made plans to get together, to talk about ways their fledgling tech companies might collaborate. The encounter spoke volumes about the current political moment here. As Mr. Justice said: “Cats and dogs are sleeping together in the mountains now. ”'"}, "time": 1742562718.7431872}