{"duration": 0.0456240177154541, "input_args": {"text": "'Rep. Lamar Smith ( ) spoke with Breitbart News’ Washington Political Editor Matt Boyle on Breitbart News Saturday on SiriusXM Patriot Channel 125 on Saturday about the media bias that’s reached unprecedented levels since President Donald Trump was elected and poses a risk to the democracy it is tasked to protect. [“I think the media bias today is a threat to our democracy for this reason,” said Smith, who is the chairman of the House Media Fairness Caucus. “If the American people don’t get the facts then they can’t make good decisions.  “And if the American people can’t make good decisions because they’re not getting the facts then I think that is a threat to democracy,” Smith said. Smith said the “  mainstream media” is not only replacing facts with opinion but “invective and venomous opinions” when it comes to reporting on Trump. During the interview, Smith cited a number of polls that show clear media bias, including a   poll conducted in May that shows the majority of Americans  —   or 65 percent  —   believe the media publishes “fake news. ” Smith also said that the media has an “incredible responsibility” to provide accurate news and that the “constant barrage of personal attacks” on the president and Republicans can contribute to individuals acting irrationally as was the case this past week when a shooter opened fire on GOP lawmakers and staff at a baseball practice in Alexandria, VA. The gunman,    James T. Hodgkinson of Illinois who supported Sen. Bernie Sanders’ presidential campaign and posted   messages on social media, died from his injuries after Capitol Police on security detail for House Majority Whip Steve Scalise ( ) engaged him in a gun battle. Scalise remains in critical condition following multiple surgeries for his injuries. “I’ve never seen before in my 35 years of involvement in politics, and quite frankly this amount of venom contributes to  —   I’m not saying it’s the only reason  —   but it does contribute to an environment of hatred and violence and we shouldn’t be surprised I think if it does have an impact,” Smith said. Smith also said that the media clearly did not expect Trump to win the presidency and that it was a “shock to their system. ” “But that’s still no excuse for the amount of bias we’re seeing,” Smith said. When Boyle asked Smith what Americans should do to fight media bias, he said people should speak out. “The most important thing that we can do to counter the media’s bias, quite frankly, is to speak out against it,” Smith said, adding that he is not advocating censorship but encouraging people to write to their representatives in Congress and to write letters to the editors of their local newspaper. “The mistake we make overall is letting the media tell us what to think,” Smith said. “We’ve got make sure that we warn the American people to not let the liberal media tell them what to think. ”'"}, "time": 1742562124.0004928}