{"duration": 0.13272333145141602, "input_args": {"text": "'7 Things You Need To Know About Trump Attorney General Pick Jeff Sessions By: Aaron Bandler November 18, 2016 \\nPresident-elect Donald Trump has announced that his selection for attorney general is Sen. Jeff Sessions (R-AL), who has long been a favorite of conservatives. The Democrats already have the long knives out for Sessions, spit-balling their usual accusations of racism–which should indicate that Sessions will be an effective attorney general. \\nHere are seven things you need to know about Sessions. \\n1. Sessions has a 78 percent liberty score on Conservative Review . Sessions has been in the Senate for 20 years, and has been described by the Washington Times as \"a tea partier before the tea party was cool,\" per Conservative Review \\'s biography . \\n2. Sessions has been one of the leaders in the Senate in fighting against amnesty. For instance, Sessions was among the most prominent members of the Senate leading the opposition to the Gang of Eight Bill. National Review , which dubbed Sessions \"amnesty\\'s worst enemy,\" explained how Sessions would reveal \"true facts\" about the bill in an attempt to persuade some senators that hadn\\'t decided how to vote on the legislation. Sessions and Sen. David Vitter (R-LA) would find other clever ways to oppose the bill, such as \"an amendment to a resolution honoring the late Latino union organizer Cesar Chavez\" in which Vitter noted Chavez\\'s opposition to illegal immigration, putting Sen. Bob Menendez (D-NJ) in \"an awkward position.\" \\nIn 2015, Sessions introduced a bill that would overhaul the immigration system, according to Conservative Review : Overturned the Zadvydas v. Davis Supreme Court case that Obama is using as an excuse to release criminal aliens after six months of detention Explicitly deputized the states to enforce federal immigration law Eliminated sanctuary cities by cutting off DHS and DOJ law enforcement grants Expedited deportation of gang members Applied the ramifications of treating illegal aliens as criminal aliens to those convicted of drunk driving Clamped down on loopholes that allow legal immigrants who commit crimes to continue on the path to citizenship instead of getting deported (this would address cases like the legal immigrant who murdered the family in the Washington, D.C. “mansion murders”) \\nSessions has also fought efforts to increase legal immigration, as he has railed against it as \"the primary source of low-wage immigration into the United States.\" \\n\"What we need now is immigration moderation: slowing the pace of new arrivals so that wages can rise, welfare rolls can shrink and the forces of assimilation can knit us all more closely together,\" Sessions wrote in a 2015 op-ed in the Washington Post . \\n3. Sessions has also spearheaded efforts to crack down on budgetary issues. According to Conservative Review \\'s biography of Sessions: \\nIn January 2011, he was named Ranking Member of the Senate Budget Committee. In this capacity, he led the Republican charge against Majority Leader Harry Reid and Barack Obama for not offering a serious budget proposal, given that the Senate had not passed a budget since April 2009. He has fought guerilla warfare, often a lonely battle, against Democrats spending by raising budget point of orders against the breach of budget caps. He has even fought his own party when his office put out devastating research against the Ryan-Murray budget deal. Sessions has also been a strong leader on welfare reform and publishing studies and data on the extent of the welfare state. \\nSessions has voted against the TARP bailout, stimulus bills, and increases to the debt limit and has traveled through his state \"with charts warning of the United States\\' \\'crippling\\' debt,\" per the Washington Post . \\n4. Sessions endorsed Trump early on. To the surprise of many in the establishment, Sessions endorsed Trump in February, declaring , \"I believe we are on a movement that must not fade away. This is a campaign, this is a movement. The American people are not happy with their government.\" \\nIt shouldn\\'t have come as a surprise though, given Session\\'s record on immigration and that Sessions tends to be more protectionist on trade. \\n5. Sessions is well-liked by his Senate colleagues on a personal level. According to the Washington Post : \\n\"Say what you will about him,\" former longtime Senate Democratic communications aide Jim Manley told the Almanac of American Politics. \"He was always nice to [the late Ted] Kennedy and other Democrats as well.\" \\nEven people who have run against him have nice things to say about him. Stanley-Becker talked to Susan Parker, a Democrat who tried to unseat Sessions in 2002. During a debate, she asked for a tissue and Sessions handed her one. She joked she would use it to dry her eyes when Sessions made her cry, and he responded: \"Please don’t say that. That’s my nightmare. I promise I’ll be nice.\" \\nIt\\'s no wonder then that Sessions will likely be confirmed by the Senate. \\n6. Accusations of racism against Sessions are absurd. When President Ronald Reagan nominated Sessions, who at the time was a U.S. attorney, to a federal judge, the Democrats smeared Sessions with accusations of racism, which included: Calling a black attorney \"boy.\" Quipping about the Ku Klux Klan: \"I used to think they were OK, but they are pot smokers.\" Joking that a white attorney was \"a traitor to his race\" because he was collaborating with civil rights groups. Calling the NAACP and ACLU \"un-American.\" Prosecuting a civil rights organization for voter fraud. \\nThe last point isn\\'t racist at all. The jokes, as Ben Shapiro has written , were made \"in front of the black lawyer; even the lawyer accusing Sessions of racism acknowledged that Sessions was joking.\" Clearly Sessions meant them as harmless jokes. Sessions has also denied calling the lawyer \"boy.\" The civil rights group Sessions prosecuted has faced accusations of voter fraud for many years. \\nSessions\\' record on race actually shows that he has consistently fought against racism, as The Weekly Standard \\'s Mark Hemingway writes: \\nAs a U.S. Attorney he filed several cases to desegregate schools in Alabama. And he also prosecuted the head of the state Klan, Henry Francis Hays, for abducting and killing Michael Donald, a black teenager selected at random. Sessions insisted on the death penalty for Hays. When he was later elected the state Attorney General, Sessions followed through and made sure the Hays executed. The successful prosecution of Hays also led to a $7 million civil judgment against the Klan, effectively breaking the back of the KKK in Alabama. \\n7. As attorney general, Sessions would uphold the rule of law. The reason why Sessions has been such an immigration hawk is that he supports the rule of law. He has also fought against judicial activist nominees and is a strong supporter of the death penalty. Between that and his legal background as a U.S. attorney and Alabama attorney general, there is every reason to believe that Sessions will follow the law and not politicize the Justice Department. \\n\"His interpretation of the law will not please everyone, but I predict it will be fairly applied without fear or favor,\" Robert Driscoll , former deputy assistant attorney general, wrote in National Review . \"Clear cases will be prosecuted with vigor. Creative interpretations of the law may cease, but the meat-and-potatoes work of the division (intentional discrimination, police misconduct, disability law) will continue apace, conducted without impropriety or political favoritism. That alone will be a breath of fresh air.\" Tags '"}, "time": 1742563467.4121897}