{"duration": 0.40462803840637207, "input_args": {"text": "'We Are Change \\nIntelligence agencies are running al-Qaeda camps in North Africa?— UN consultant (EXCLUSIVE) New evidence points to a Western cover-up of Algerian state sponsorship of Islamist jihadists, to protect oil and gas interests By Nafeez Ahmed \\nAn unpublished report by a government advisor and UN consultant, obtained exclusively by INSURGE intelligence , accuses Western and Algerian security services of complicity in al-Qaeda terrorist activity across North Africa.\\nThe academic report focuses on damning evidence that a devastating al-Qaeda terrorist attack on the Tigantourine gas plant near In Amenas, Algeria, was orchestrated by Algeria’s secret services, with the knowledge of US, French and British intelligence.\\nA draft copy of the report, due to be published later this month, has been seen exclusively by INSURGE intelligence . \\nEscalating instability in North Africa is being blamed on the re-emergence of an offshoot of al-Qaeda?—?al-Qaeda in the Islamic Maghreb (AQIM). Despite French military efforts, the group is re-consolidated in northern Mali, and has orchestrated terror strikes from Burkino Faso to the Ivory Coast.\\nYet the new draft report by a UN consultant, prepared by the International State Crime Initiative (ISCI) at Queen Mary University of London, uncovers remarkable evidence that the Phoenix-like return of AQIM is thanks to the unwavering covert support the terror group receives from one of the West’s staunch allies in the ‘war on terror’: Algeria.\\n\\nTerror ties The as-yet unpublished report highlights evidence of such support from the In Amenas attack between 16 and 20 January 2013, which resulted in the deaths of 39 foreign nationals, including three Americans, six Britons, five Norwegians, and one French.\\nThe Tigantourine gas plant is operated jointly by BP, Norway’s Statoil and the Algerian state-owned Sonatrach, producing 12% of Algeria’s natural gas.\\nAlgeria’s In Amenas gas plant (Reuters) The attack was the single largest terrorist killing of ‘Westerners’ since the London bombings of 7 July 2005.\\nThe Queen Mary University of London report is authored by social anthropologist Professor Jeremy Keenan of the School of Oriental and African Studies (SOAS), University of London.\\nKeenan, who has authored over 200 peer-reviewed scholarly articles and six books on the Sahara-Sahel region, is an advisor on regional security issues to NATO, the US State Department, the EU, the UN, the British Foreign Office, and international oil companies.\\nThe report reveals startling evidence that the attack was secretly organised by the DRS, Algeria’s notorious secret intelligence service. The idea was to convince Algeria’s Western allies to continue supporting the regime’s domestic and regional counter-terrorism programmes, amidst growing international scepticism about their success.\\nAlgeria’s DRS maintained intimate ties with the terrorists behind the In Amenas attack, many of whom have been longstanding agents of the Algerian security services, the report says.\\nUS, British and French intelligence services are aware of these connections, but are covering them up to protect their considerable oil and gas interests in the country.\\nAmong the report’s most alarming revelations is that over the last decade, Algeria’s DRS has run a secret al-Qaeda training camp in the Tamouret region, with the knowledge of Western government security agencies.\\nAl-Qaeda camp?—?run by Algeria’s secret state Over several years, Prof Keenan obtained direct eyewitness evidence from locals about the secret al-Qaeda camp in Tamouret, including from an AQIM member who trained there.\\nIts purpose is to recruit, indoctrinate and train marginalised youth from across North Africa into committing atrocities in Algerian communities?—?after which they would usually be executed.\\nAl-Qaeda in the Islamic Maghreb (AQIM) fighters in a propaganda video filmed in the Sahara (Wikipedia Commons) According to Keenan’s eyewitness sources, the camp was visited almost daily “by high-ranking army and DRS officers… including General Rachid ‘Attafi’ Lallali, the head of the DRS’ External Security Directorate (DDSE).”\\nThe camp was also directly supplied with arms and ammunition from Algerian army depots.\\nDetailed information on the identities of camp recruits, including DNA data, was routinely shared with Western intelligence agencies according to sources familiar with the camp.\\nTrainee terrorists at Tamouret were schooled in sniping and throat-slitting. The camp was provided with a continual supply of prisoners?—?mostly criminals and dissenting soldiers?—?purely for the purpose of being killed during training.\\nOver a seven month period, one eyewitness said, about 180 murders had taken place at the camp during such routine practice sessions.\\nIn Amenas?—?a DRS operation Keenan’s report for the International State Crime Initiative points to disturbing evidence of Algerian intelligence services’ direct sponsorship of al-Qaeda terror.\\nOn 27 August 2015, senior DRS commander General “Hassan” Abdelkader Aït Ouarabi was arrested by Algerian authorities. The arrest was based on allegations from three terrorists captured at the In Amenas gas facility, who claimed they had received arms from General Hassan.\\nOn the same day as Gen Hassan’s arrest, the US Director of National Intelligence (DNI), James Clapper, flew into Algiers for high-level government meetings.\\nThe FBI had also been given access to the three terrorists making these allegations before July 2013.\\nCorroborating this information, the report refers to the testimony of former DRS captain, H. Haroune, and a former captain and instructor in the Special Forces under DRS command at the time, A. Chouchan. The two former DRS operatives have claimed that “General Mediène [then DRS chief] ordered the attack on In Amenas (presumably planned to be a hostage-taking mission that the army would resolve as it did at Gharis in 2003).”\\nWhat did BP know? Astonishingly, the report reveals that before the attack, BP and Statoil had a three year contract with a transport services company, BAAT SARL, owned by Mohamed Ghadir, the brother of al-Qaeda terrorist Abdelhamid Abou Zaïd?—?the head of AQIM in the Sahara, and chief of the DRS-run AQIM training camp at Tamouret.\\nAt the London inquest last year, BP was never questioned about this contract, despite it involving a company tied to the very al-Qaeda group that attacked the gas plant.\\nIn the years preceding the attack, Keenan himself?—?in his capacity as a security consultant?—?repeatedly warned BP that the facility would be attacked by Islamist terrorists with the covert support of the Algerian government.\\nKeenan suggests that BP’s inexplicable lack of concern about the matter was because the firm had been given security assurances from Algerian or Western authorities that AQIM would not attack the plant.\\nBP did not respond to request for comment. \\nGary Rose, an emergency response advisor who worked at the In Amenas facility, said that BP’s onsite security “was incredibly poor and relied totally on the untested and unknown capabilities of the Algerian military.” Rose narrowly avoided the attack having left the site two days earlier.\\nRose, who gave evidence at the London Inquest, was especially damning about BP’s approach. The firm “did nowhere near enough to protect the facility, even with the most basic and credible scenarios in their own emergency response plans…\\n“The risk assessment process was flawed, inadequate and done from a view of process safety not human safety. Physical security was constantly breached by the local staff and was out of direct expatriate control, the physical barriers and warning/protection systems were wholly inadequate. I know exactly what systems we did and did not have, and management on site were aware of all the failings too. After the fall of Libya there should have been a massive review of security, but instead we handed over more control to poorly trained Algerian security guards. We were all aware of bandits and arms trafficking in the desert regions but were just relying on the Algerian military to manage this, maybe by force or maybe by negotiation?” \\nAccording to Rose, the most appropriate way of dealing with the risk would have required abandoning the site to conduct a full review and reinforcement.\\nBut shutting down and abandoning the facility, or any other such facilities, “was never an option due to the huge amount of revenue and European reliance on external hydrocarbons: it’s economy over safety and that’s how the petroleum industry works.”\\nComplicity in Algeria’s reign of terror The draft report by Queen Mary University’s ISCI refers to recent revelations from Habib Souaïdia, a former Algerian army officer.\\nAccording to Souaïdia:\\n“… he had been informed by many of his former colleagues [in the Algerian Special Forces] that the leaders of some of the jihadist groups sowing terror in Tunisia ‘take their orders from Algiers.’” \\nIn 2015, Tunisia experienced two major terrorist attacks, in which a total of 61 civilians were killed by gunmen with ties to Algeria.\\nSouaïdia reported that mobile phones and SIM cards of AQIM jihadists killed in Tunisia’s Mount Chaambi border area, obtained by the Tunisian army, “revealed their communications with DRS officials in Algiers, including their phone numbers and even their nicknames.”\\nIn late 2013, the information about the SIM cards was handed over to US intelligence, which demanded Algeria’s army chiefs put a stop to the support for jihadists in Tunisia. But, Keenan says, a related US concern was to prevent information on the DRS’ dealings with terrorists falling into the public domain:\\n“The reason for that was because US intelligence services and the DRS had been working together as close allies in the so-called war on terror since 2002 and would inevitably, and quite correctly, be seen as having been complicit in whatever ‘false-flag’ and other such questionable operations had been conducted by the DRS since 2002.” \\nThe AQIM-backed insurgency in Mali was also being supported by Algeria’s intelligence services. A Nigerian military officer told Keenan that AQIM forces in Mali were being supplied food and fuel by the DRS.\\nThroughout the DRS’ sponsorship of regional al-Qaeda terrorist activity, the US, Britain and France have worked closely with the very same DRS on regional ‘counter-terrorism’?—?despite being privy to damning intelligence on Algeria’s double-game.\\nAlgerian soldiers The Clinton files Direct confirmation of high-level US knowledge of the Algerian regime’s relationship with the terrorists behind the In Amenas attack came from emails leaked from Hillary Clinton’s private server, published by Wikileaks in March 2016.\\nAn email dated 17 January 2013 to Clinton from her aide Sidney Blumenthal, noted that the alleged leader of the In Amenas attack, AQIM terrorist Mokhtar Belmokhtar [MBM], had a secret agreement with Algerian intelligence. Under the agreement, Belmokhtar would pursue al-Qaeda destabilisation operations in Mali and the Western Sahara:\\n“According to sources with access to the Algerian DGSE [the DRS], the Bouteflika government reached a highly secret understanding with Belmokhtar after the kidnapping in April 2012 of the Algerian consul in Gao (Mali). Under this agreement Belmokhtar concentrated his operations in Mali, and occasionally, with the encouragement of the Algerian DGSE, attack Moroccan interests in Western Sahara, where the Algerians have territorial claims.” \\nMokhtar Belmokhtar was also, according to Keenan’s eyewitness sources, in charge of logistics for the al-Qaeda training camp in Tamouret, which he visited every two weeks.\\nHillary Clinton A further email dated 19 January 2013 from Blumenthal to Clinton reported that French intelligence had learnt from a source “with access to the highest levels of the Algerian army” that:\\n“… officers of the Algerian DGSE [DRS] are looking to secretly meet Belmokhtar or one of his lieutenants in northern Mauritania in the immediate future. They have been ordered to find out why Belmokhtar violated their two-year-old secret agreement and launched attacks inside Algeria.” \\nThere is no evidence that such a meeting actually took place, suggesting that the DRS was not really interested in finding the answer.\\nIn any case, Clinton forwarded Blumenthal’s email to Robert Russo, her assistant in the US Department of State?—?which means the US government was aware of the agreement between AQIM’s Belmokhtar and Algerian intelligence.\\nKeenan points out that these emails must be placed in context with the evidence that the DRS itself had sponsored the In Amenas attack in the first place:\\n“We therefore had a situation in which the presidency, the army high command and, most likely, western oil companies, knew there was a secret agreement with MBM not to attack installations within Algeria. The DRS, which would have been the agency that made the deal with MBM, would have assured the presidency and army command that such an agreement had been made. What neither the presidency, army nor foreign oil companies knew, although they may have suspected, was that they had effectively been double-crossed by the DRS.” \\nIn either case, it seems that the State Department was aware that Algerian intelligence was sponsoring Islamist terror across North Africa.\\nWhen asked what the State Department did with the information it had received via Hillary Clinton, a spokesperson, Pooja Jhunjhunwala said:\\n“As a matter of policy, the Department of State does not comment on materials, including classified documents, which may have been leaked.” \\nHowever, when asked about the State Department’s position on public record evidence of Algerian intelligence support to jihadists supplied by Prof Keenan?—?who has previously consulted on regional security issues for the State Department?—?she simply declined to comment.\\nCover-up? Much of this information was passed on by Keenan to the London Inquest into the attack on the Tigantourine gas plant. Yet the Inquest, which delivered its verdict in February 2015, excluded this evidence from the proceedings. Keenan himself was blocked from giving evidence at the Inquest.\\nThe Addendum to the Queen Mary University report includes the full text of a letter dated 30 April 2015 sent by Prof Keenan to Detective Constable William Wixey of the SO15 Counter Terrorism Command, summarising his available evidence.\\nKeenan’s letter offered to provide access to multiple witnesses, two of whom would be non-Algerian citizens, who would expose the leader of the In Amenas attack as an “agent” of Algeria’s secret intelligence service.\\nOn 13 May, DC Wixey replied to Keenan’s letter to explain that the Coroner’s office was “of the view that they do not wish to take this matter further at this stage.”\\nThe Metropolitan Police failed to respond to a request for comment on the decision to block Keenan’s evidence from the Inquest.\\nIn addition to blocking Keenan’s evidence, the British government used Public Interest Immunity?—?the withdrawal of information on grounds of ‘national security’?—?to suppress the disclosure of key documents at the Inquest on what the government knew, and when.\\nThe use of Public Interest Immunity was “very suspicious,” London Inquest witness Gary Rose said:\\n“Now we are not able to know what is being withheld and there is little that can be done about that.” \\nIn his report for Queen Mary University, Prof Keenan concludes that the government had sought not only to cover up “its own incompetency with regard to the FCO”, but also to avoid questions about the government’s “possible complicity in [Algerian] state crimes.”\\nThe government’s goal was to withhold any information alluding to British intelligence collusion with the DRS, including evidence that MI6 had been “complicit in activity that could be construed as criminal.”\\nIn the absence of a further inquiry, there seems little prospect that the questions Keenan raises will be answered by officialdom. Yet his forthcoming report goes some way toward uncovering the real reasons that the threat of terrorism is escalating in North Africa.\\nDr. Nafeez Mosaddeq Ahmed is an award-winning 15-year investigative journalist, international security scholar, bestselling author, and film-maker. \\nHe is the creator of INSURGE intelligence , a crowdfunded public interest investigative journalism project, ‘System Shift’ columnist at VICE, and a weekly columnist at Middle East Eye. He is Global Editor at The Canary . Previously, Nafeez wrote The Guardian’s ‘Earth insight’ blog. \\nHis work has been published in The Guardian, VICE, Independent on Sunday, The Independent, The Scotsman, Sydney Morning Herald, The Age, Foreign Policy, The Atlantic, Quartz, The New Statesman, Prospect, Le Monde diplomatique, Raw Story, New Internationalist, Huffington Post UK, Al-Arabiya English, AlterNet, The Ecologist, and Asia Times, among other places. \\nExclusive stories broken by Nafeez via INSURGEintelligence have been covered by USA Today, Global Post, The Guardian, The Independent, Washington Post, The Metro, The Week, News Corp’s news.com.au, Discovery News, Channel 4 News, Forbes, Columbia Journalism Review, Gigaom, FutureZone, among others. \\nIn 2015, Nafeez won the Project Censored Award for Outstanding Investigative Journalism for his Guardian story on the energy politics of the Ukraine crisis. The previous year he won another Project Censored Award, known popularly as the ‘Alternative Pulitzer’, for his Guardian article on climate-induced food crises and civil unrest. \\nIn 2010, Nafeez won the Routledge-GCPS Essay Prize for his academic paper on the ‘Crisis of Civilisation’ published in the journal Global Change, Peace and Security. He also won the Premio Napoli (Naples Prize) in 2003, Italy’s most prestigious literary award created by decree of the President of the Republic. \\nNafeez has twice been featured in the Evening Standard’s ‘Top 1,000’ list of most influential people in London, in 2014 and 2015. \\nNafeez is the author of A User’s Guide to the Crisis of Civilization: And How to Save It (2010), and the scifi thriller novel ZERO POINT , among other books. His work on the root causes and covert operations linked to international terrorism officially contributed to the 9/11 Commission and the 7/7 Coroner’s Inquest. \\nThis story is being released for free in the public interest, and was enabled by crowdfunding. I’d like to thank my amazing community of patrons for their support, which gave me the opportunity to work on this story. Please support independent, investigative journalism for the global commons via www.patreon.com/nafeez , where you can donate as much or as little as you like. \\nAl Qaeda Africa Military Foreign Policy Terrorism Further Source Material – Insurge-intelligence Follow WE ARE CHANGE on SOCIAL MEDIA SnapChat: LukeWeAreChange \\nfbook: https://facebook.com/LukeWeAreChange \\nTwitter: https://twitter.com/Lukewearechange I nstagram: http://instagram.com/lukewearechange Sign up become a patron and Show your support for alternative news for Just 1$ a month you can help Grow We are change We use Bitcoin Too ! 12HdLgeeuA87t2JU8m4tbRo247Yj5u2TVP Join and Up Vote Our STEEMIT The post Western Intelligence Agencies are Running al-Qaeda Camps in North Africa appeared first on We Are Change .\\n'"}, "time": 1742561740.7101753}