{"duration": 0.0693361759185791, "input_args": {"text": "'Anthem, the nation’s second largest health insurance company, backed the Republican leadership’s plan to repeal and replace Obamacare. [Anthem addressed House Republicans in a letter, saying  the “time to act is now” to address the faltering individual insurance market. The health insurance giant urged Republicans to move “as quickly as possible. ”  Anthem CEO Joseph Swedish wrote to the chairmen of the House Energy and Commerce and Ways and Means committees that the leadership’s bill “addresses the challenges immediately facing the individual market and will ensure more affordable health plan choices for consumers in the short term. ” The health insurance company supports the Ryan plan’s provisions to repeal Obamacare’s health insurance tax, temporarily continuing Obamacare’s   subsidies, and doling out tax credits for those on the Obamacare exchanges. Anthem CEO Swedish explained, “These provisions are essential and must be finalized quickly to have the intended impact on products and prices to benefit consumers. ” The Blues Association asked the Republican leadership to drop a   30 percent premium surcharge on individuals who fail to maintain their health insurance throughout the entire year, warning that it could destabilize the market. Republicans added the provision to the bill. Senator Rand Paul ( ) told Breitbart News in an exclusive interview that the insurance companies stand to benefit from Paul Ryan’s Obamacare repeal plan. Paul said that “They actually subsidize the insurance companies. Right now, insurance companies are losing money and Obamacare has this rescue thing called ‘risk corridors’ to bail out the insurance companies. Paul Ryan has got the same thing, he just calls it reinsurance and it’s $100 million worth. I predict that might not even be enough. So I don’t like any of it. ”'"}, "time": 1742564415.294598}