{"duration": 0.052947282791137695, "input_args": {"text": "'Breitbart News’ Washington political editor Matthew Boyle joined One America News Network (OANN) to discuss the future of repealing and replacing Obamacare in the wake of House Speaker Paul Ryan’s failure to pass the American Health Care Act (AHCA) last month. Boyle made the point that the way House Republicans can succeed in passing any health care legislation is to keep Ryan on the sidelines, and continue forward with negotiations directly between House Freedom Caucus chairman Rep. Mark Meadows ( ) and House Tuesday Group   Rep. Tom MacArthur ( ) since Ryan’s unpopularity jeopardizes the Republican Party’s chance at success.  “Mark Meadows and Tom MacArthur have gotten together and negotiated out a fix, a new bill, a series of compromises from both sides that likely could pass the House of Representatives,” Boyle said. Boyle noted that the House Freedom Caucus has been trying to get legislation that would lower Americans’ healthcare premiums, something Ryan’s original bill did not do. “The number one goal of House Republicans, especially conservatives, is to lower people’s premiums so that they’re paying less for health insurance but they still have health insurance,” Boyle said. “That’s the impetus here. That’s the key thing these guys are negotiating on. The reason why there’s a chance for success right now is because of the fact that the chairman of the House Freedom Caucus Mark Meadows as well as the   of the Tuesday Group, Tom MacArthur, have gotten together. ”  “Paul Ryan, the Speaker of the House who is very, very unpopular across the country right now, has taken a step back,” he continued. “He’s not been really involved in this. He was out in Hollywood, he was over in Europe, while this whole thing has been going on, so as long as Paul Ryan stays out of the picture here they have a chance at passing an Obamacare repeal and replace and following through on President Trump’s campaign promise to repeal and replace Obamacare and they might even be able to do it in the first 100 days. ” Follow Breitbart News on Twitter @BreitbartNews'"}, "time": 1742562084.0438018}