{"duration": 0.06583333015441895, "input_args": {"text": "'This post was originally published on this site \\nOn November, 8, 2016, every pissed off white guy and, as it turns out, plenty of pissed off white women, showed up to the polls and voted for the now President-elect of the United States, Donald J. Trump. \\nThat’s right: The Donald – sexual predator, sociopath, disgraced businessman, reality TV star and all around huckster – is now the most powerful man in the world (insofar as any individual can wield power within extremely complex systems and institutions). \\nNevertheless, President Trump now presides over the largest military empire and the richest nation in the history of the world. \\n*** \\nI was wrong. Hell, almost everyone was wrong, except my Mom, whose street smarts outperformed Nate Silver’s algorithms. Looking back, I should’ve known better and trusted my instincts. After all, I live in Michigan City, Indiana, located in the heart of America’s Rust Belt – the region that gave the world President Trump. \\nI grew up with Trump supporters. Many of my neighbors are Trump supporters. Most of my father’s friends are Trump supporters. And half of my extended family voted for Trump. In many ways, I should be a Trump supporter: I’m White, male, a high school graduate (never finished college) and a Marine Corps veteran. \\nThankfully, I found good books, good music and good drugs at 19 years old. Otherwise, who knows? I could’ve ended up at a Trump rally, punching protesters and acting like a jackbooted thug. Instead, I find myself firmly planted on the left, wondering how we can reach out to portions of Trump’s base. \\n*** \\nIn the age of social media, conspiracy theories and outright falsehoods often drown out rational debate and facts. FoxNews, AM Radio and the Alt-Right media have poisoned the well. In the process, they’ve bamboozled large segments of White America – both young and old. \\nThanks to alternative news sources such as Breitbart and Alex Jones, tens of millions of Americans are being exposed to a quasi-Libertarian/Alt-Right ideology at a staggering pace. Breaking this web of propaganda will be an enormous task, but a necessary one. Here, existing alternative media outlets will be essential. \\nIf we’re interested in exposing more working class and poor white Americans to leftwing ideas and radical politics, we’ll need to write and speak in a way that regular people can understand. In the real world, no one gives a fuck how smart you sound. In fact, I would argue that’s one of the reasons some of Trump’s supporters resent the MSNBC-Yuppie-Liberal-types: they come off as smug assholes. \\n*** \\nSpeaking of smug assholes, we can thank Rachel Maddow, the New York Times, Washington Post and CNN for Trump’s victory. The only thing more precious than their hubris and utter lack of journalistic integrity is their willingness to normalize a sexual predator and neofascist as president. If there’s any silver lining to this election, it’s that the liberal media has been exposed as the propaganda wing of the DNC. \\nNot only did they destroy Bernie’s chances (if he ever had any to begin with), they then tried to shove a neoliberal-hawk down our throats. But people didn’t buy it, especially black and brown people. \\n*** \\nAs we speak, tends of thousands of Americans are taking to the street to protest Trump and White Supremacy. While I wholeheartedly encourage and support those who are protesting, would Hillary have enjoyed such a reception from the left? Doubtful. \\nAnd where have the protests been for the last eight years of Obama’s drone wars and capitulation to Wall Street? Where was the outrage as Obama deported more immigrants in his first four years than Bush deported in his entire eight? \\nYes, let’s protest. But let’s be more principled and sophisticated than we were during the Bush years. If 2020 or 2024 ends with another Obama, we’ve failed. In order for this not to happen, we’ll need to constantly reexamine what we’re doing, and why. \\n*** \\nAnd this brings us to Veterans Day, one of the most hollow and absurd holidays in American society. Unless you have stock in Lockheed Martin or Goldman Sachs, there’s really no reason to thank me for my “service.” We destroyed Iraq and killed innocent people. We mutilated dead bodies and tortured prisoners. And we did it all for geopolitical and corporate interests. \\nSome studies suggest over 1,000,000 Iraqis have died as a result of America’s illegal and immoral war. The war in Iraq has also given the world ISIS. The war in Iraq destabilized an entire region of the planet (something conveniently forgotten by most Americans as they contemplate No Fly Zones in Syria). The war in Iraq has resulted in thousands of veterans suicides (22 a day). More marines from my platoon have killed themselves since returning home than died overseas. \\nBut vets get to go home, at least most of them. The Iraqis have to live with the legacy of Uncle Sam’s madness for the rest of their lives. Everyone had better think about what all of this means as President-Elect Donald J. Trump, a man who openly mocked a Purple Heart recipient and joked about using nuclear weapons, takes office. Related '"}, "time": 1742562094.621323}