{"duration": 0.031677961349487305, "input_args": {"text": "\"Share on Twitter \\nAnyone who has ever watched HGTV has surely come across real estate agents-turned-house flippers Tarek and Christina El Moussa: A photo posted by Flip or Flop ???? (@tarekandchristina) on Apr 13, 2016 at 11:23am PDT \\nThe stars of “Flip or Flop” have created a lucrative business, bringing in $10,000 for each episode, not to mention the money they make on the actual flip. \\nBut now the couple is now being accused of scamming people. \\nFor those unfamiliar with the show, it features the couple buying foreclosed homes in Orange County, CA, renovating them, and then putting them back on the market for a premium. \\nWell, according to The Daily Mail, hopeful real estate investors attended a pricey series of seminars endorsed by the El Moussas, where they were told they would be learning the tricks of the trade that made the HGTV hosts rich. A photo posted by Flip or Flop ???? (@tarekandchristina) on Apr 15, 2016 at 3:49pm PDT \\nBefore enrolling, instructors enticed potential attendees by telling them that if they paid $1,997 for three days of classes and $1,000 for real estate software , they would learn how the star couple flips homes. \\nThey also would supposedly gain access to investors who could offer them cash to purchase their first investment. \\nInstructors told people with poor credit scores and a weak job history that they were eligible candidates. \\nPeople were even told that if they weren't able to sell their flipped home in a certain amount of time, they would receive a refund. A photo posted by Flip or Flop ???? (@tarekandchristina) on Apr 13, 2016 at 11:18am PDT \\nBut when people finally showed up to the costly seminar, neither of the hosts was anywhere to be found. \\nInstead, the would-be real estate investors got a cheesy pre-recorded video of the El Moussas, followed by a sales pitch urging attendees to buy additional courses. \\nDoug Stephens, a pastor and teacher from Havana, Florida, who paid and attended the course, was left extremely disappointed. He stated that attendees were not taught anything and were just given sales pitch after sales pitch: \\n“They weren't really teaching at all.” A photo posted by Flip or Flop ???? (@tarekandchristina) on Apr 7, 2016 at 11:14am PDT \\nStephens wasn't the only person who felt this way. Numerous other attendees felt bamboozled as well. A photo posted by Christina El Moussa (@christinaelmoussa) on Jan 14, 2016 at 1:23pm PST \\nStephens said it was so bad that not only did instructors avoid answering his questions, but they asked the attendees to call their credit card companies and increase their credit limits. \\nBut that's not the worst part. \\nOn the final day, instructors allegedly tried to persuade them to buy more sessions—some of which cost nearly $30,000. A photo posted by Christina El Moussa (@christinaelmoussa) on May 11, 2016 at 4:45pm PDT \\nSince the seminar, Zurixx LLC , the Utah-based company that runs the El Moussa educational seminars ( Success Path Education ), have received dozens of complaints. \\nMore and more people are calling the classes a ripoff. A photo posted by Christina El Moussa (@christinaelmoussa) on May 3, 2016 at 2:42pm PDT \\nIn response, Zurixx LLC has insisted that the complaints only represent a small portion of their attendees. \\nThe company showed over 2,300 letters where people praised them for the “life-changing experience.” \\nThe HGTV stars have yet to respond. \""}, "time": 1742628437.296168}