{"duration": 0.12380790710449219, "input_args": {"text": "'JERUSALEM  —   He is friends with the mayor and once tried to buy an Israeli insurance company. His parents’ names are emblazoned across a hospital campus, a tribute to generous donors. But to many Israelis and Palestinians, Jared Kushner is a mystery. Suddenly, Mr. Kushner, 35, the    of   Donald J. Trump and a business mogul in his own right, has emerged as a potentially important figure in the future of this troubled region. Mr. Trump said this week that Mr. Kushner could play a key, if undefined, role in efforts to bring peace to the Middle East. Few of the Israelis and Palestinians who have been immersed for years in the fitful and frustrating peace process, such as it is, could recall ever meeting Mr. Kushner, and many were hurrying to learn more. But then again, time spent at the peace table has not exactly yielded peace, and some of those who do know Mr. Kushner said his freshness and close ties to the incoming president could make him a valuable new player. Israeli officials, especially those close to Prime Minister Benjamin Netanyahu, were most optimistic, seeing Mr. Kushner as an ally. “There’s no question that he feels a strong commitment to Israel’s security and Israel’s future,” said Ron Dermer, the Israeli ambassador to the United States, who has forged a close relationship with Mr. Kushner. Palestinian leaders were more wary. “I don’t personally know Jared Kushner and have never met him, but welcome the idea of having him assist in breaking the deadlock in the negotiations of the conflict,” said Amin Maqboul, secretary general of the revolutionary council of Fatah, the party that controls the Palestinian Authority. The extent of Mr. Kushner’s relationship with Israel is unclear. He is not a frequent visitor in the corridors of Jerusalem’s fancy hotels or the trendy restaurants of Tel Aviv, nor has he established deep ties with Israel’s booming business sector. He has known Mr. Netanyahu casually since childhood through his father, Charles Kushner, a real estate tycoon who has been active in business and philanthropy in Israel. And he is friends with Nir Barkat, the mayor of Jerusalem. But they get together mainly in New York, not here. In an interview with The New York Times this week, Mr. Trump pointed to Mr. Kushner as an influential player in future Middle East peace efforts. “I mean, he knows it so well,” Mr. Trump said. “He knows the region, knows the people, knows the players. ” But that seems to be a bit of fatherly exaggeration. Certainly, Mr. Kushner knows the region and players better than Mr. Trump, who has little experience here. But phone calls and emails to dozens of politicians, diplomats and journalists in Israel and the Palestinian territories yielded few who had actually encountered him. “I’ve never met Jared Kushner,” said Dore Gold, a longtime adviser to Mr. Netanyahu who recently stepped down as director general of the Foreign Ministry. Neither had Sallai Meridor, a former ambassador to the United States Yaakov Amidror, a former national security adviser to Mr. Netanyahu or Avinoam   president of the Jewish People Policy Institute, a   group that researches   relations. Nor had the main opposition leaders Isaac Herzog and Yair Lapid. Still, Mr. Kushner has been Mr. Trump’s intermediary with a variety of important Israeli and Jewish American players, including Mr. Netanyahu, Mr. Dermer and wealthy donors like Sheldon Adelson, the Nevada casino magnate. He brokered a meeting between Mr. Trump and Mr. Netanyahu in September and sat in on it. “He follows the issue. He’s a strategic thinker,” said Martin Peretz, the former owner and editor in chief of The New Republic, who met Mr. Kushner at Harvard University and now splits his time between Israel and the United States. “Does he know enough? Does he know more than Aaron David Miller? Probably not. Does he know more than Dennis Ross? Probably not,” Mr. Peretz said, naming two longtime American negotiators. But “he certainly knows more about the area than Barack Obama, and more than John Kerry. ” The grandson of Holocaust survivors, Mr. Kushner was raised in an Orthodox Jewish household in New Jersey and graduated from a Jewish day school before attending Harvard. He observes the Sabbath, and his wife  —   Mr. Trump’s daughter Ivanka  —   converted to Judaism before their marriage. Mr. Trump’s transition team would not say how often Mr. Kushner visited Israel or whether he had any Palestinian connections. But an aide to the   emphasized that Mr. Kushner would be just one of many advisers on the Middle East. Mr. Kushner, who took over his family’s real estate empire in his 20s and bought The New York Observer, visited Israel in 2014 when he was trying to acquire a controlling stake in Phoenix Holdings, an insurer. He signed a nonbinding memorandum of understanding to buy 47 percent of the firm from the Delek Group, an Israeli conglomerate, for about $434 million. But the deal fell apart, partly because of regulatory requirements. Mr. Kushner was in Israel during the war with Gaza that summer, which seemed to unnerve his wife. “We have small children, and Ivanka didn’t like the idea of me being here,” he told the Israeli newspaper Yedioth Ahronoth. “As an American who listens to the news every hour, and hearing about 90 missiles hitting Israel on a daily basis, she asked me, ‘What the hell are you doing? ’” Later that year, as the Phoenix deal was unraveling, his parents traveled to Jerusalem to dedicate a new 11.  campus for the Shaare Zedek Medical Center opposite Mount Herzl, named the Seryl and Charles Kushner Campus. The Kushners committed $20 million to the hospital and Seryl Kushner served on the national board of an American committee supporting Shaare Zedek. Charles Kushner has been a participant in the Faire Fund, an   real estate investment fund, for more than a decade. “The family has been involved very much in all sorts of activities with regard to Israel,” said Zalman Shoval, a former ambassador to the United States and one of the founders of the fund. His partner, Shlomo Grofman, a real estate developer and friend of the elder Mr. Kushner’s, said he had tried to involve Jared in Israel as well. “I brought Jared and Ivanka to Israel,” he said. “I invited them and they came. ” Now, it seems possible that Mr. Kushner will be a more regular visitor, gathering information and perhaps more for his   . To those who have talked with Mr. Trump, there is little doubt that Mr. Kushner is a powerful voice on issues involving Israel. Boaz Bismuth, the foreign editor for Israel Hayom, a newspaper owned by Mr. Adelson, recalled interviewing Mr. Trump in December. “The first thing he mentioned was Jared  —   he spoke of him as someone he counts on,” Mr. Bismuth said. “He told me then that Jared knows Israel, follows what’s going on here. ” Now, instead of just following it, Mr. Kushner may have a chance to lead.'"}, "time": 1742562156.838732}