{"duration": 0.12213897705078125, "input_args": {"text": "'The elite Shadowmasters need a scapegoat for the world catastrophe they have been planning for a long time . . . and Trump will be the man to blame when the house of cards comes crashing down. THE COMING STORM Economic Armageddon is on its way ! While many of us in the alternative media and especially those researchers of Clinton crimes are breathing a big fat sigh of relief that anybody but Hillary is headed to the White House in 2017, Brandon Smith of Alt Market is warning us all not to get too comfortable… and with history on his side here, we should listen to him. \\nDespite what looked like a rigged, fraudulent Hillary win orchestrated from the top down with the entire establishment machine behind her, Trump won the election. In an election year that would have otherwise seen record low voter turnout, the specter of Hillary that led to Trump’s victory has now given the people a reason to believe their vote actually matters again, an extra boon to further relegitimize the corrupt system running things in this country. \\nBut Brandon Smith reminds us that if Trump is walking into the Oval Office in January, it is only because the elites decided to put him there in advance — and for a reason. \\nFirst it should be noted that Smith accurately predicted that Brexit would pass , even when the majority of the alt media was reporting that there was no way it possibly could. Was it another victory for the people? \\nNo, it was predetermined well in advance: “The mainstream media has been consistently comparing Trump supporters to Brexit supporters, and Trump himself has hitched his political wagon to the Brexit. This fits perfectly with the globalist narrative that populists and conservatives are killing the global economy and placing everyone at risk. “ \\nThen he accurately predicted a Trump win … but not because voting actually matters: “U.S. elections are indeed controlled, and have been for decades, primarily through the false left/right paradigm. However, as I have been pointing out since I correctly predicted the success of the Brexit referendum, I don’t think that Clinton is the choice of the elites.” “To be clear, my position is that Trump is slated to take the White House and that this is by design. This has been my position since before Trump won the Republican Primaries, it was my position when the election cycle began, it has never changed, nor have my views on the reasons for this outcome ever changed…” \\nSmith says regardless of whether or not Trump is a legitimate anti-establishment candidate, his win means the global economic collapse the system has been holding off on will finally come to pass — as planned — under Trump’s watch: “…Even if Trump is a legitimate anti-establishment conservative, his entry into the Oval Office will seal the deal on the economic collapse, and will serve the globalists well. The international banks need only pull the plug on any remaining life support to the existing market system and allow it to fully implode, all while blaming Trump and his conservative supporters…” \\nHe will be the perfect scapegoat for something the alternative media have known is coming for a long, long time. \\nNow Smith is spelling it out : The bottom line is, Trump is on the way to the White House because the elites WANT HIM THERE. Now, many liberty proponents, currently in a state of elation, will either ignore or dismiss the primary reason why I was able to predict the Brexit and a Trump win. These will probably be some of the same people that were arguing with me only weeks ago that the elites would NEVER allow Trump in office. So, to clarify: Trump may or may not be aware that he and his conservative followers have been positioned into a a trap. We will have to wait and see how he behaves in office (and he WILL be in office, despite the claims of some that the elites will try to “stop him” before January). My primary point is THAT IT DOES NOT MATTER, at least not at this stage. The elites will initiate a final collapse of the global economy under Trump’s watch (this will probably escalate over the course of the next six months), and they WILL blame him and conservatives in general. This IS going to happen. The elites play the long game, and so must we. \\nAnd there you have it. \\nIt’s not much of a secret that the economy is being artificially propped up. The Fed’s QE stimulus programs are no longer working. We know it can’t remain this way forever. \\nAnd even though everyone just feels so much relief that we’ve all been spared the nightmare of Hillary Clinton climbing into yet another seat of even more power, we can’t just assume we’re all going to skip off into happy magical fairy sprinkle land unscathed. \\nSure, the people have spoken, but it’s only the illusion of power that we’re seeing play out now. The Powers That Shouldn’t Be running this insanity circus always have a plan… how else have they gotten away with controlling the globe for at least the past century? \\nWhile millions of Americans are celebrating Trump’s win today, I will remain even more vigilant. The party is just getting started, folks. Don’t get too comfortable. Sadly, we can’t ignore decades of New World Order history here just because we’re relieved a psychopath like Hillary lost the election. \\n2017 is going to be a bumpy ride . DISCLAIMER. All articles published on this website reflect the views of their original authors; publication here in no way implies automatic agreement or approval of its contents. “If you have tears, prepare to shed them now.” — Shakespeare, Julius Caesar'"}, "time": 1742564467.4403682}