{"duration": 0.06117677688598633, "input_args": {"text": "'November 9, 2016 \\nCanada is becoming more appealing to millions of Americans as Donald Trump closes in on the presidency. \\nAccording to Independent UK, the website for Canada’s official immigration agency is crashing under heavy traffic , with Americans researching how to immigrate to Canada in the wake of Donald Trump’s looming electoral college majority. When attempting to access the Citizenship and Immigration Canada website, an error message shows on the screen after waiting several minutes for the site to load. The Canada Citizenship and Immigration site has crashed — pic.twitter.com/DISgFSB3Q1 \\n— Ryan Parker (@TheRyanParker) November 9, 2016 \\nThe immigration rules for Canada are fairly strict, as Americans seeking refuge there will be unable to relocate there without first securing a job, a graduate study course, or another professional niche that meets Canadian work residency requirements. A thread on Quora explained the rigorous standards the Canadian government has for Americans relocating to their Northern neighbor. Tax rules are also complex for American expats seeking refuge from a Trump presidency. \\nOne viral phenomenon that spread earlier in the election season eerily predicted the rise in interest of American immigration to Canada if Donald Trump were to win the presidency. In July, a website promoted Cape Breton Island , on the Eastern shore of Canada, as a possible refuge for Americans fleeing a President Trump. \\nDestination Cape Breton had to hire extra staff to field 5,000 questions from Americans who were either seriously interested in moving to the island or adjusting their summer travel plans to include a visit. Questions ranged from “What is the process to immigrate to your beautiful island?” to “What are real estate prices like?” \\nAs of 11:51 PM Eastern, Donald Trump currently has 232 electoral college votes to Hillary Clinton’s 209. The GOP nominee has won Florida, and is still leading in Michigan and Wisconsin, which were previously thought to be solidly Democratic. \\n\\nTom Cahill is a writer for US Uncut based in the Pacific Northwest. He specializes in coverage of political, economic, and environmental news. You can contact him via email at [email protected] '"}, "time": 1742564374.2154653}