{"duration": 0.10231399536132812, "input_args": {"text": "'  Donald J. Trump may have leapt from   success to the highest echelons of political power. But that does not mean he is ready to give up the   part just yet. Although Mr. Trump is not starring in NBC’s coming season of “The New Celebrity Apprentice,” the   is still involved: Mr. Trump will be credited as one of the show’s executive producers, a spokeswoman for Mark Burnett, the creator of the “Apprentice” franchise, said on Thursday. MGM, Mr. Burnett’s studio, declined to comment on what the   would be paid for his participation in the new season, which will feature Arnold Schwarzenegger as the show’s   businessman. But in the past, Mr. Trump has held as much as a 50 percent stake in “The Apprentice,” and received payments from the show’s international editions and a   version that starred Martha Stewart. “Mr. Trump has a big stake in the show and conceived of it with Mark Burnett,” Hope Hicks, the  ’s spokeswoman, said on Thursday. Ms. Hicks confirmed that she was referring to a financial stake. For an incoming president whose business holdings have already drawn ethical scrutiny, Mr. Trump’s continuing involvement with “The Apprentice” could spawn a new round of questions about conflicts of interest. For NBC, which nurtured Mr. Trump’s celebrity until he left the show in 2015 to pursue a presidential bid, the fact that the   stands to profit from the program could raise concerns about how a politically polarized audience may react to one of its biggest   shows. Mr. Schwarzenegger’s first episode airs on Jan. 2, and major companies, including Trident gum, Welch’s, and Carnival Cruise Line, have signed on as sponsors. NBC declined to comment on Mr. Trump’s producing credit, which was first reported by Variety. Mr. Trump, for months, has shown a keen interest in how Mr. Schwarzenegger, a former governor of California, bodybuilder and actor, might perform as host, asking friends and even campaign crowds, “How do you think Arnold’s going to do?” During an interview in May about his history with “The Apprentice,” Mr. Trump made clear that he remained invested in the program, emotionally and otherwise. “You know I have a big chunk of that show, going forever,” Mr. Trump said. “Mark and I did it together. We were   partners. ” The   and Mr. Burnett are on good terms, even though the producer issued a statement in October denouncing Mr. Trump’s candidacy, referring to “the hatred, division and misogyny that has been a very unfortunate part of his campaign. ” This week, Mr. Burnett met privately with Mr. Trump and suggested ideas for his inauguration, including a helicopter ride from New York to Washington and a parade on Fifth Avenue in Manhattan. During the interview in May, Mr. Trump said that he had not spoken to Mr. Schwarzenegger about the program. “I don’t know how he is going to do,” Mr. Trump said, “but I hope he does well. ” “We tried to do it with Martha Stewart,” Mr. Trump added, “and that didn’t get the ratings, to put it mildly. ”'"}, "time": 1742563397.6247687}