{"duration": 0.14589309692382812, "input_args": {"text": "'The 59th annual Grammy Awards on Sunday will feature perhaps the show’s most electric contest in years: Adele versus Beyoncé. Both are megaselling queens of pop whose every move reverberates throughout the culture. The fact that they will face off in each of the top three categories  —   album, record and song of the year  —   gives the Grammys a rare tension that can only be good for ratings. Yet their competition is also fraught in ways that have long dogged the awards. One concerns race, a subject the Grammys have a tangled history with  —   especially this year, when one of the most acclaimed young black artists, Frank Ocean, has boycotted the process altogether. Another sensitive area is the Grammys’ spotty record in recognizing the vanguards of contemporary pop. Added to the mix is a heightened political climate in which issues of race and identity are front and center, raising the question of whether the music industry will use this year’s Grammys as a soapbox. Many longtime Grammy watchers say that a sweep by Adele  —   and therefore a Beyoncé snub  —   could feed into   complaints that the awards too often fail to recognize black performers in the most prestigious categories. Ebro Darden, a disc jockey on the New York   station Hot 97 and on Apple’s Beats 1, said that a big Beyoncé win would be “the best move” for the Grammys “if they want to get the most attention and keep people interested. ” Should Adele dominate, he added, some music fans “would come for them and say #OscarsSoWhite. ” With the news media closely focused on diversity at awards shows  —   and the public relations nightmares that result from an absence of it  —   that would be an unwelcome response for the Recording Academy, the organization behind the Grammys. (A representative for the academy declined to comment.) Adele and Beyoncé are both hailed in music circles as supremely deserving talents. But for voters, the singers also represent a choice between two strains of modern pop: Adele’s album “25” and her hit ballad “Hello” are examples of the finely   traditional style that is Grammy catnip. Beyoncé’s “Lemonade,” with its dynamic single “Formation” and accompanying politically and racially charged hourlong art film, represents an edgier    sound that rarely takes the top prize  —   Exhibit A for those who contend that the Grammys are perennially out of touch. Beyoncé’s own example is telling: She may already have 20 Grammys on her shelf, but only one is in the   big four categories (album, record and song of the year, or best new artist). She has also been passed over twice for album of the year, losing to Taylor Swift in 2010 and Beck in 2015 (much to the consternation of Kanye West, a frequent Grammy critic). “The #OscarsSoWhite controversy really shook the motion picture academy, and I think the Grammys are saying, ‘There but for the grace of God go we, so let’s make sure this doesn’t happen to us,’” said Paul Grein, a former Billboard columnist who performs detailed Grammy analysis for the industry magazine Hits. The Grammys may be more diverse than most shows this year, Beyoncé is the top nominee, with nine nods, while the newcomer Chance the Rapper has seven. But the show’s record in recognizing black talent has come under plenty of fire. Mr. Ocean declined to submit his work for consideration in this year’s Grammys at all, saying that the institution “just doesn’t seem to be representing very well for people who come from where I come from,” and calling the boycott his “Colin Kaepernick moment. ” Rap fans were outraged when Kendrick Lamar lost best rap album to the white rapper Macklemore in 2014, though Mr. Lamar took all four rap trophies last year. (Eminem has won best rap album six times.) The last black artists to win album of the year were legacy picks: Ray Charles in 2005, and Herbie Hancock, covering Joni Mitchell, in 2008 a black woman hasn’t won since Lauryn Hill did nearly two decades ago. Russell Simmons, the entertainment mogul who is a founder of Def Jam Recordings, said that Beyoncé “is overdue for being accepted by the mainstream in the way she deserves. ” “She’s obviously the most mainstream thing on the planet,” Mr. Simmons said. He added: “When they define her, her color has something to do with the way she’s viewed and the amount of awards she wins and the accolades she gets. I would venture to say were she white and blond from Texas, she would be recognized differently. ” Some, however, reject the idea of the   contest as a referendum on race. “I don’t think it’s a black and white thing it’s a quality thing,” said Joel Peresman, the chief executive of the Rock and Roll Hall of Fame Foundation. Kevin Liles, a veteran record executive now with 300 Entertainment, said that the Grammys had evolved in recent years: “If it was truly a dormant or stagnant association, then Beyoncé wouldn’t be there. All shapes, sizes, colors and genres are represented. ” The odds on Adele and Beyoncé are hard to read, even among industry insiders. Adele may be a safe choice, but she also swept all three top prizes five years ago, making a repeat seem unlikely. No   or contemporary RB album has won the top prize since Outkast’s “  Love Below” in 2004, a tough precedent for Beyoncé on the other hand, there is a wide sense in the industry that it may simply be her turn. At the Grammys, however, anything is possible: Contenders for an upset album of the year winner are streaming hits like Drake’s “Views” and Justin Bieber’s “Purpose,” and this year’s darkest horse, “A Sailor’s Guide to Earth” by the country outsider Sturgill Simpson. The awards   also comes at a cultural crossroads, following a divisive presidential election. Now, even the most mainstream events are weighted with ideological expectations. “The gloves are off: It is absolutely in style to have a political opinion right now,” the D. J. Mr. Darden said, predicting that the Grammys would “absolutely have that moment” where current events come up, such as with Meryl Streep’s Golden Globes speech aimed at President Trump. Lady Gaga, a vocal Hillary Clinton supporter, did not make a grand political statement, as some had hoped, at the Super Bowl, but she will have another platform when she performs with Metallica at the Grammys. Among the other performers scheduled on Sunday are Katy Perry, who was a dedicated surrogate for Mrs. Clinton, and Chance the Rapper, a frequent guest of President Obama’s White House. Beyoncé and Adele, who is British, both expressed support for Mrs. Clinton last year. “We want to be a place where artists can feel they can come and express themselves,” Ken Ehrlich, the Grammys producer, said of the possibility that performances or speeches could become political. “Our guidelines are taste and the F. C. C. The F. C. C. is more concerned with profanity than it is with political discourse. ” Mr. Simmons said that no matter who comes away the night’s big winner, a foray by a major artist into politics would be a boon for the show. “If Trump says the Grammys are overrated on Monday morning, people will go looking for what he’s talking about,” Mr. Simmons said. “I hope he does. ”'"}, "time": 1742562298.9456592}