{"duration": 0.05585622787475586, "input_args": {"text": "'A Lot of People in the US Are Suddenly Identifying as “White” Eric D. Knowles and Linda R. Tropp, Quartz, October 25, 2016 \\nMany political commentators credit Donald Trump’s rise to white voters’ antipathy toward racial and ethnic minorities. However, we believe this focus on racial resentment obscures another important aspect of racial thinking. \\nIn a study of white Americans’ attitudes and candidate preferences, we found that Trump’s success reflects the rise of “white identity politics”–an attempt to protect the collective interests of white voters via the ballot box. Whereas racial prejudice refers to animosity toward other racial groups, white identity reflects a sense of connection to fellow white Americans. \\nWe’re not the first to tie Trump’s candidacy to white identity politics . But our data provide some of the clearest evidence that ongoing demographic changes in the United States are increasing white racial identity. White identity, in turn, is pushing white Americans to support Trump. \\nWhite identity \\nWhen we talk about white identity, we’re not referring to the alt-right fringe, the white nationalist movement, or others who espouse racist beliefs. Rather, we’re talking about everyday white Americans who, perhaps for the first time, are racially conscious. \\n{snip} \\nNon-Hispanic whites are projected to become a minority in the year 2044. This increasing diversity across the country is making whites’ own race harder and harder to ignore. {snip} \\nTrump and white identity politics \\nAs whites increasingly sense that their status in society is falling , white racial identity is becoming politicized. Trump’s promise to “make America great again” speaks to these anxieties by recalling a past in which white people dominated every aspect of politics and society. {snip} \\n{snip} \\nTo test our ideas about Trump and white identity politics, we surveyed a nationally representative sample of about 1,700 white Americans. The survey covered racial identities, attitudes, and political preferences. In examining the relationship between white identity and ethnic diversity, we chose to focus on an ethnic minority of particular salience in contemporary politics: Hispanics. {snip} \\nDo whites from heavily Hispanic neighborhoods show stronger white racial identity? To measure identity, we used a widely-used questionnaire . On a five-point scale, participants rated their agreement with items such as “Being a white person is an important part of how I see myself” and “I feel solidarity with other white people.” As shown in the graph below, there is a positive relationship between exposure to Hispanics and white respondents’ sense of racial identity. \\nAnd does white identity lead to support for Donald Trump? We examined the relationship between white identity and respondents’ likelihood of supporting Trump for the presidency versus Hillary Clinton or several Republican primary challengers. Consistent with others’ analyses , white identity strongly predicts a preference for Trump. \\nWhites at the high end of the racial identity scale are more than four times as likely to support Trump than those at the low end of the scale. Perhaps that’s because whites highest in racial identity are also the ones most likely to harbor negative attitudes against Latinos. Indeed, we found white identity was significantly correlated with another characteristic–prejudice. \\nHowever, differences in prejudice don’t explain the relationship between white identity and Trump support. The pattern in the figure above was tested while statistically controlling for levels of anti-Hispanic prejudice. Because the relationship between identity and support for Trump remains strong, we are confident that white identity independently predicts greater Trump support. \\nWe’ve seen that living close to Hispanics leads whites to develop a strong sense of racial identity and that strong racial identity is associated with support for Donald Trump. We should therefore expect that whites in heavily Hispanic neighborhoods support Trump more often than those in neighborhoods with fewer Hispanics. This prediction gains credence from work by political scientist Ryan Enos, who finds that everyday exposure to Latinos can increase support for restrictive immigration policies. \\nWhites’ support for Donald Trump is, in fact, greatest in areas with a large Hispanic population. \\n{snip}'"}, "time": 1742562976.2867737}