{"duration": 0.09358572959899902, "input_args": {"text": "'American rapper Bow Wow posted images of a private jet on his Instagram account, claiming to be taking a glamorous trip to NYC, but was soon caught out when one fan spotted him flying coach on a commercial flight. [Variety reports that Bow Wow  —   real name Shad Gregory Moss  —   has been ridiculed across social media after he posted a photo of a private car and plane on Instagram, bragging about a glamorous promo trip to New York City. But the    rapper and actor appeared to have not used that plane he instead took a flight on a commercial airline to the city and was noticed by a fan.  Lmfaooooo who’s mans is this @smoss?! pic. twitter.   —   Osama Bin Drinkin’ (@Al_Khee) May 9, 2017,  “Travel day,” Bow Wow captioned the photo posted on Monday. “NYC press run for Growing Up Hip Hop. Lets gooo. I promise to bring yall the hottest show EVER. May 25th on @wetv. ” A reverse image search of the photo the rapper posted shows that the image was taken from the MIA VIP Transportation website, an executive group transportation company from Florida. The rapper’s social media faux pas has led to a new meme called “#bowwowchallenge” in which users post two photos, one displaying s supposed lavish lifestyle and another showing how the user faked the image. One user posted a closeup photo of hotel   liquor bottles with the caption “BBB: Big Bottle Boyz,” then posted a wide angle photo displaying the tiny bottles sitting on a table. BBB: Big Bottle Boyz 💯💯💯#bowwowchallenge pic. twitter.   —   Dub (@DubOnDaBeatz) May 10, 2017,  Another user posted a photo of a sunset on a beach titled “Another day in paradise,” only to zoom out showing that the beach was in fact a photo on a computer screen. Another day in paradise  …    . #bowwowchallenge pic. twitter.   —   Max Sorensen (@MAXinOUT7) May 10, 2017,  Bow Wow has yet to respond to the controversy and is laying low on social media for the time being.   Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742562986.6994493}