{"duration": 0.12264585494995117, "input_args": {"text": "'When Americans Shall Say ‘Peace And Safety’… By Michael Snyder, on November 21st, 2016 \\nMillions of Americans are expecting a new “golden age” for America under Donald Trump, but is that what they are going to get? There is always optimism when a new president is elected, but I don’t know if I have ever seen anything like the euphoria that many Trump supporters are expressing right now. Look, I voted for Donald Trump and I want him to be as successful as possible. But when Donald Trump becomes our next president on January 20th , that does not mean that all of the great problems that our nation is facing will somehow magically disappear. If you listen to some people, they make it sound like America is going to experience nothing but peace, prosperity and blessing for decades to come. I would love it if that was indeed going to be the case, but unfortunately that is simply not the truth. \\nWe are currently on a path that leads to national suicide, and unless we change our ways it isn’t going to matter who is in the White House. \\nI keep hearing about how our new president is going to “unify” the nation, but that is going to be extremely difficult to do considering the fact that we are now more divided than ever. In fact, a brand new Gallup survey found that an all-time record high 77 percent of all Americans believe that we are “greatly divided when it comes to the most important values” . \\nI keep hearing about how we are now entering a golden age of peace and prosperity, but how is that supposed to happen while we are still butchering millions of innocent children in our abortion mills? \\nI keep hearing about how the economy is about to take off like a rocket, but how is that possible when we have already been on the greatest debt binge in world history ? The only way we have been able to maintain our massively inflated debt-fueled standard of living is by piling up debt at a faster pace than any generation in history. Today we have accumulated 12 trillion dollars in consumer debt, corporate debt has doubled since the last financial crisis, and the national debt is rapidly approaching 20 trillion dollars. How can Trump possibly pump up our standard of living with debt more than Obama has already done? \\nI keep hearing about how we are “going to make America great again”, but how can we be great when we are producing more pornography than the rest of the world combined? \\nI keep hearing about how “law and order is going to restored”, but meanwhile chaos has already been erupting in cities all over the nation and the far left is planning to turn Inauguration Day into a major riot . \\nI keep hearing about how “things are going to go back to the way they used to be”, but as I discussed in a previous article , “sexually-transmitted diseases are spreading at the fastest pace in decades, the percentage of births out of wedlock is more than 10 times higher than in 1940, and approximately two out of every three Christian men watch pornography on a regular basis.” \\nI keep hearing about how we are going “to drain the swamp”, and yet there are no plans to even reform the Federal Reserve system which is at the very heart of our financial problems as a nation . \\nI keep hearing about how good judges are going to be put on the Supreme Court, but how can we trust that when our new president just said that he is “fine with” the Supreme Court decision that forced all 50 states to redefine the institution of marriage? \\nI keep hearing about how we are going to be “an example” for the rest of the world, but how can we be “an example” when just about every form of evil imaginable is exploding in popularity inside our own country? \\nI keep hearing about how our government is going to be “blessed”, but how can a government that gives hundreds of millions of dollars a year to Planned Parenthood be “blessed”? Now that the Republicans have control of the White House, the Senate and the House of Representatives, this is their golden opportunity to defund Planned Parenthood. If it doesn’t happen now, it probably will never happen, and it will show what a complete and utter failure the Republican Party has become. Remember, Planned Parenthood is an organization that has been caught on camera admitting that they harvest organs from the babies that they kill and that they sell those organs off to the highest bidder. \\nSome would argue that America is already “great” at a lot of things. After all, the United States is number one in the world in television watching, legal drug use and illegal drug use. \\nWe lead the world in plastic surgery, eating disorder deaths, teen pregnancy and lawyers per capita. \\nWe have the highest STD infection rate in the industrialized world, the highest divorce rate in the industrialized world, and the largest prison population on the entire planet. \\nWe also have the most complicated tax system in the entire world, the largest trade deficit in the entire world, and the largest national debt in the entire world. \\nSo if we want to make America great again, we sure have a lot of work to do. \\nThe complacency that I am seeing out there right now really alarms me. So many people seem to think that the battle is won because Donald Trump was victorious on election night. But that is not even close to reality. \\nIf we do not fundamentally change course as a nation we will not survive. Tinkering with tax rates, regulations and trade agreements is not going to get the job done. So many people are acting as if we just have a few cuts and scratches, when the reality is what our country really needs is major heart surgery. \\nDonald Trump is not some sort of a messiah, and even if he is able to accomplish every single thing that he is promising right now it will not nearly be enough. \\nBut for the moment millions of Americans are proclaiming “peace and safety” now that Donald Trump has won the election, and we shall see how it all turns out… November 21st, 2016 | Tags: Americans , Anxiety , Blessing , Donald Trump , National Suicide , Peace , Safety , Successful , Suicide , Trump | Category: Commentary We Are Being Set Up For Higher Interest Rates, A Major Recession And A Giant Stock Market Crash »'"}, "time": 1742564118.6804254}