{"duration": 0.04485058784484863, "input_args": {"text": "'That was Marco Gutierrez, founder of the group Latinos for Trump, issuing a dire warning to the United States in an interview with Joy Reid on MSNBC on Thursday night. America’s response? Mmm, tacos! Though some sympathized with the message, Mr. Gutierrez’s comments elicited a largely sarcastic backlash on social media. #TacosOnEveryCorner surged to the top of Twitter’s list of trending topics, where it remained on Friday morning. The comment came at a sensitive time for Donald J. Trump’s presidential campaign. Several members of his Hispanic advisory council withdrew their support this week, saying they had been led to believe that Mr. Trump was shifting his   tone on immigration. “He used us as props,” said Jacob Monty, who resigned after Mr. Trump reverted to his fiery language on immigration Wednesday night after returning from Mexico, where he had struck a more measured, even subdued, tone. During the interview with Mr. Gutierrez, Ms. Reid quickly interjected, saying, “I don’t even know what that means, and I’m almost afraid to ask. ” Mr. Gutierrez explained: Mr. Gutierrez might have spared himself some of the ridicule had he recognized America’s longstanding love affair with Mexican food. Nearly 25 years ago, salsa surpassed ketchup in retail store sales, and some would argue that Mexican food has already conquered American cuisine. Mr. Trump, for his part, has long been accused of being   in his Hispanic outreach, including, for example, in his posting of a photo of himself and a taco bowl on May 5, proclaiming, “I love Hispanics!” From the start, his   approach to immigration has alienated Hispanics, and his accusation that Mexico was sending rapists across the border did nothing to tame the controversy. “When Mexico sends its people, they’re not sending their best,” Mr. Trump said in announcing his campaign in June 2015. “They’re not sending you. They’re not sending you. They’re sending people that have lots of problems, and they’re bringing those problems with us. They’re bringing drugs. They’re bringing crime. They’re rapists. And some, I assume, are good people. ” Later that day, he added that, to keep out undocumented immigrants, he would “build a great wall, and nobody builds walls better than me,” a promise repeated numerous times since, including in Phoenix on Wednesday. As a Trump surrogate, Mr. Gutierrez is not the first to offend. The   pastor Mark Burns has said that Hillary Clinton, the Democratic nominee, panders to   and endorses black genocide. He also apologized for retweeting images of Mrs. Clinton in blackface. Some observers saw the taco truck remarks as code words to mine the racial resentments of white Americans. Others reacted with humor:'"}, "time": 1742563654.475729}