{"duration": 0.19370436668395996, "input_args": {"text": "'For sisters in the public eye, Beyoncé and Solange Knowles have managed to resist the siren call to overshare the minutiae of their personal lives. But there is one topic they are happy to gush about: their mother, Tina Knowles Lawson. In the January issue of Interview magazine, Solange is interviewed by Beyoncé and waxes lyrical about how their mother “always taught us to be in control of our voice and our bodies and our work. ” Last June, when accepting the fashion icon award from the Council of Fashion Designers of America, Beyoncé dedicated it to her “fabulous and beautiful” mother. And in November, when Solange appeared on “Saturday Night Live,” a backstage video posted on Instagram, showing the singer carried by Mom and Big Sis, caused the internet to let out a collective “aww. ” Ms. Lawson, 63, now finds herself in a newfound role as an artistic bridge between two of 2016’s most critically lauded albums: “Lemonade,” Beyoncé’s fiery visual album that is up for nine nods at the Grammy Awards next month, and “A Seat at the Table,” Solange’s spare and poetic RB record, which topped Pitchfork’s   list last year. In October, her daughters made history when they became the first sisters to reach No. 1 on the Billboard 200 chart in the same year. The shadow of Ms. Lawson, a former Southern beautician who is a lifelong collector of black contemporary art, hovers over the artsy allusions in “Lemonade” to intergenerational   motherhood, marital strife and their family’s deep Creole roots. On the agitpop single “Formation,” Beyoncé shouts out her “Momma Louisiana. ” The   Beyoncé broke her silence to talk about her mother’s creative influence (though on email, coordinated through a publicist). “I think it was important to my mother to surround us with positive, powerful, strong images of African and   art so that we could reflect and see ourselves in them,” Beyoncé said. “My mother has always been invested in making women feel beautiful,” she added, “whether it was through someone sitting in her hair chair or making a prom dress for one of the girls at church. And her art collection always told the stories of women wanting to do the same. ” Ms. Lawson’s appearance on “A Seat at the Table” is more explicit. In “Tina Taught Me,” a cerebral     interlude, she sermonizes about black cultural pride, saying: “I’ve always been proud to be black. Never wanted to be nothing else. ” She also says it “saddens” her when people considers that to be “antiwhite. ” Solange said: “She says things in that interlude that I had been trying to say for the last four years. But my mother has a very special way of communicating, a very special channel that she speaks through that has always felt bigger than her. ” “If my sister and my project feels like an ‘awakening’ to some,” she added, “I am constantly saying that we both grew up in a home with two words: Tina Knowles. ” The matriarch of pop music’s reigning family resides (rather fittingly for a woman who once posed on the cover of Ebony wearing a gold crown) in a gated, castlelike home atop the winding Hollywood Hills in Los Angeles. On a warm evening in late November, Ms. Lawson sat in her brightly colored living room, filled with postimpressionist and abstract works, mostly by African and   artists. Dressed casually in an   ensemble, “Miss Tina”  —   as she likes to be called  —   is all natural warmth and poise. She may have nurtured two supernatural superstar daughters, but she comes across as a sage retiree supremely at ease in her dewy, flawless skin. She offered a tour of works by Henry Ossawa Tanner and Elizabeth Catlett that hang   on her walls, saying that her children “grew up surrounded by art and feeling proud about who they are. ” She is also a goofball in person. Stepping out to her large outdoor balcony overlooking the twinkling skyline, she said her two favorite places to shop were Home Depot and Costco. “I meet people every day that are like, ‘You come here? ’” she said. “And I’m like, ‘Of course, I do. ’” Her irreverent side is familiar to her nearly one million followers on Instagram, a platform hardly known as welcoming to   women in their 60s. She cracks dorky mom jokes  —   “I told my assistant to have a really great day, and you know what she did? She went home!”  —   impersonates Tina Turner and generally clowns around with her friends and family. “I want to show people the regularity of my life, and that not everything is so fancy,” she said. Her fans can’t get enough. “If you’re not following Beyoncé’s mom on Instagram, here’s what you’re missing,” declared an article from Harper’s Bazaar in August. “She’s basically everybody’s auntie who is a sweetheart, but still keeps it real when necessary,” said Crissle West, a   of “The Read,” a popular podcast on   and pop culture. Ms. Lawson, nee Celestine Ann Beyincé, grew up in the 1950s in “a real small town” in Galveston, Tex. The last of seven siblings, her father was a longshoreman and her mother was a seamstress. She picked up dressmaking at a young age, creating sparkly stage outfits for her   singing group while in high school. At 19, she moved to California to work as a makeup artist for Shiseido Cosmetics (she learned styling tricks from drag queens, she said) but returned to Texas a year later when her parents fell ill. With help from her   Matthew Knowles, a former Xerox executive, she opened a   hair salon in Houston called Headliners. The salon, which had more than a   run, helped the Knowles family afford an   lifestyle. It was also an impromptu stage for her young brood, while women under dryers acted as judges. When Destiny’s Child, the girl group whose most famous lineup consisted of Beyoncé, Kelly Rowland (“my other daughter”) and Michelle Williams, began to break out in the late 1990s, Ms. Lawson returned to dressmaking and whipped up matching cutaway Boy Scout uniforms,   camouflage hot pants and   fur sheaths for the group to wear onstage. As Beyoncé put it in her Council of Fashion Designers of America speech last year, designers were reluctant to dress “black country curvy girls,” so her mother stepped in. “They looked a little crazy sometimes,” Ms. Lawson said, “but people always wondered what they were going to wear next. ” The “Bootylicious” touch helped the group stand out. Destiny’s Child went on to sell over 60 million records worldwide, and Destiny’s mother became a fashion force. In 2004, she and Beyoncé started the House of Deréon, a trendy,   clothing brand named after Ms. Lawson’s mother. A juniors collection, bedding and a clothing line aimed at older women called Miss Tina soon followed. When the group disbanded in 2005, Ms. Lawson continued to create showstoppers for Beyoncé as a solo artist, including the black brocade ball gown she wore for the 2005 Academy Awards. But in 2009, just when her professional life seemed to be at its peak, Ms. Lawson said her “world completely stopped. ” After 33 years of marriage, she filed for divorce from Mr. Knowles, who had been a talent manager for their daughters. Citing a “conflict of personalities” in court papers, the divorce was made final in 2011. “I kind of lost myself,” she said. “All these things that I love  —   going to art shows, reading art books, going out dancing  —   I had stopped. That’s not really loving yourself, if you’re not taking care of yourself in terms of your needs and what makes you happy. ” The split raised existential questions. “What kind of life was I going to have now?” Ms. Lawson said. “I thought it was too late for me to try something new. You have all these doubts in your mind. ” In search of answers, she closed all her fashion businesses and, at 59, left Houston for Los Angeles for what she jokingly said was “a new house, a new car, a new man and a new life. ” In 2013, she reconnected with an old friend, Richard Lawson, a TV actor known for his roles in “Dynasty” and “All My Children. ” The couple tied the knot two years later. “I just feel so liberated now, I really do,” she said. Ms. Lawson now focuses much of her time on black female empowerment issues and philanthropy (she was honored at the Essence Festival in New Orleans last year) and she is writing an autobiography she says is a “      book. ” She and her husband plan to open in March an acting workshop for underserved youth in Los Angeles, called the WACO Theater Center (short for “Where Art Can Occur”). And after her   break from fashion, she designed the gold fringe outfit that Solange wore in her music video “Cranes in the Sky,” as well as the white dress Solange wore for her performance at former President Barack Obama’s farewell party at the White House on Jan. 6. “The day I had kids, I thought, ‘I might screw everything else up, but not this,’” Ms. Lawson said, flashing a knowing smile as she sat, regally postured, on her sofa. “Now that they’re grown women, it’s like, ‘It’s my turn. ’”'"}, "time": 1742563472.8291464}