{"duration": 0.05313277244567871, "input_args": {"text": "'Thank the god atop the thing, the 2016 election is almost over. It has been a grueling, often excruciating, process but here we are. I repeat, it’s almost over.\\nSo on the eve of election day, let’s take a look at the four major campaign’s closing arguments—what their candidacies represent and their visions for America.\\nHillary Clinton \\nFormer Secretary of State Hillary Clinton makes her final case for the establishment in “The Story of Us.” The ad, much like the campaign itself, is a highly misleading and sanitized presentation.\\nClinton, the eternal triangulator, celebrates progressive victories she had next to nothing to do with like marriage equality, while positioning herself as a champion for combating Islamophobia (something she has actually contributed to). The only honest argument made is that she will be the first female president.\\nNo mention is made of her own pro-corporate and pro-war policies, or really any of her policies, which is no accident. Hillary Clinton has not so much run for office in the general election as run against Donald Trump taking office, a cynical strategy that appears likely to work if current polling is to be believed.\\nFor more information on what our likely next president will be up to, check out Shadowproof’s series on the Podesta Emails. \\nDonald Trump \\nDonald Trump closed out his unorthodox and largely chaotic campaign with “Donald Trump’s Argument For America.” The ad is explicitly anti-establishment and targets “global special interests” with references to Wall Street, the Federal Reserve, and free trade and their corrupting influence on the political system in Washington DC.\\nTrump is never more popular than when he is attacking globalism, especially when considering that Hillary Clinton told Brazilian bankers in a private paid speech she dreams of a “hemispheric union” with open borders and transnational governance. Many people already fear power has slipped out of their hands and those that govern them are accountable to more powerful distant interests.\\nBut Donald Trump has managed to constantly get in the way of his own populist message on the campaign trail. Trump’s crude and ignorant statements—including ad hoc policy proposals that were straight up racist and bigoted—are well out of step with American history and norms. While most mainstream outlets opposed Trump from day one, they still took advantage of such statements as a business opportunity.\\nTrump made his name in the Republican primaries going hard on illegal immigration, which is a genuine concern for many Americans. But while many Americans want to do something about immigration, few supported Trump’s incendiary rhetoric . No one was more offended by this than Hispanic-Americans, who are likely to respond by voting for Clinton to such a degree that, if Trump loses, they will have made the difference.\\nGary Johnson \\nFormer New Mexico Governor Gary Johnson, running for president on the Libertarian ticket, has positioned himself as the most viable alternative to the two party system given he is on the ballot in all 50 states and that the Libertarian Party is the third largest party in the country. His ad, “This Is The Year,” emphasizes his independence and honesty.\\nJohnson’s actual libertarian agenda , however, is not necessarily populist. While his opposition to the War on Drugs has earned him many supporters on the left, his free market ideology is pretty extreme. Johnson is pro-TPP, pro-Citizens United/unrestricted money in politics, and against raising the minimum wage and paid family leave. He also opposes free college or really most government social programs.\\nGary Johnson’s campaign strategy appeared to rest mostly on ballot access and getting into the presidential debates. While he got on the ballot in all 50 states, thanks in large part to libertarian party organizing, he never polled well enough to qualify for the presidential debates and was not included. He has gotten a considerable amount of press exposure, but most of it has been negative due to the press’ intractable allegiance and support for Hillary Clinton as well as Johnson’s own missteps, which included yelling at reporters and conceding in an interview he did not know what the city of Aleppo, a major battleground in the Syrian Civil War was.\\nWhile Johnson was pilloried by the Clinton-backing mainstream corporate media, the New York Times had to issue two corrections about its own smug story lambasting Johnson for his ignorance.\\nJill Stein \\nDr. Jill Stein, running for president on the Green Party ticket, appears content that her chances of winning the presidency are non-existent and has set her sights on getting 5% of the national vote. Getting 5% of the vote would qualify the Green Party for presidential matching funds and help the party get automatic balloting in a number of states for the 2020 presidential election.\\nStein is, in truth, the only progressive candidate among those polling in the top four and further to the left than Senator Bernie Sanders. She is running on a platform that includes 100% renewable energy by 2030, supporting Black Lives Matter, and making criminal justice reforms, full employment (with government employer as last resort), and a guaranteed living wage, universal single-payer or “Medicare for all” healthcare, curtailing government electronic surveillance, and ending the American empire.\\nStein’s plan to pay for it all is as simple as it is radical: massive cuts to the Pentagon budget combined with major tax increases on the rich. While these ideas are pretty standard for a social democratic party in Western Europe, such a program is revolutionary in the United States.\\nBut every revolution has to start somewhere, doesn’t it?\\nSo there are your candidates, the election is tomorrow and the day after that, hopefully, is the end of the 2016 cycle. We made it.\\nThe post Election 2016: The Candidates Make Their Closing Arguments appeared first on Shadowproof .\\n'"}, "time": 1742628577.4735641}