{"duration": 0.055846214294433594, "input_args": {"text": "'Via Yournewswire \\nLet the swamp draining begin. And when the murky stench begins to clear we all know what we will see – a bloated, slimy creature called Hillary Clinton shivering in the shallows. SPONSORED LINKS \\nRemoved from the corridors of power, she won’t be able to say “I don’t recall” 357 times to FBI investigators and get away with it. Her people won’t be able to plead the fifth every time they are asked an incriminating question. Hillary is going down, and a lot of her cronies are going with her. \\nThe arrogance of the Democratic establishment in thinking the country would endorse these people is staggering. Podesta, essentially a foreign agent for Saudi Arabia – with a brother, Tony, a Spirit Cooker who is actually on Saudi books as an agent. You can’t make this stuff up. \\nAnd don’t forget Huma Abedin, thrown off the the campaign in a disastrous, scandal-riddled final week, exposed as being lax with national security – and having close ties to the Muslim Brotherhood. Her only experience prior to employment as a Hillary State Dept aide? 10 years working at a radical Islamic journal with links to jihad. The Democrat campaign was a dumpster fire. Burn, baby, burn. \\nThe Democratic establishment should never have nominated such a liability for president. The people wanted Bernie Sanders. The DNC should have let the primary election play out democratically, as their name suggests they would. But no, they interfered, suppressed the voice of their people, and forced a flawed, roundly disliked and distrusted candidate into the full glare of a brutal election season. \\nOn election night the Democratic establishment got the pounding they deserve. \\nNever let the mainstream media’s disgraceful collusion with the Clinton campaign be forgotten. May the ignominy live forever. Funneling questions to Clinton so she could defeat her primary rival in debates, colluding with Clinton’s campaign manager John Podesta – at his house – to “frame the message” and “frame the race,” lying to the American people about their first amendment rights, attempting to scare the population away from being informed. \\nCNN is a PR firm, the propaganda arm of the establishment, not a member of the fourth estate. They have been thoroughly exposed by WikiLeaks in 2016. RIP Clinton News Network. Go to hell. \\nDon’t forget about the ongoing FBI investigation into the corrupt Clinton Foundation. When Comey cleared her of wrongdoing this week, he was referring to her email scandal. The less publicized Clinton Foundation investigation is still ongoing. The probe was going to hound her into the White House, but now it’s going to throw her in the jailhouse.'"}, "time": 1742628296.5129826}