{"duration": 0.11958527565002441, "input_args": {"text": "'Almost seven out 10 Democrats believe Islam “encourages violence  …     about the same as other religions,” according to a new CBS poll. [The trusting attitude towards Islam is revealed in the February 2017 poll follows 17 tumultuous years of attacks against Americans motivated or shaped by Islamic ideology throughout the United States —  from the   atrocity to the Pulse nightclub attack in Florida committed by an observant, orthodox Muslim man from a Muslim family.  Merely    Democrats believe that Islam is more violent than other religions, such as Christianity, Mormonism, Judaism, and Buddhism.    Democrats believe that Islam is less violent that other religions, according to the poll of 1, 019 adults, which was taken Feb. 1 and Feb. 2. In contrast, Republicans have a far colder view of Islam.   percent of Republicans view Islam as  aggressive compared to other religions, and only two percent view Islam as more pacific than other faiths.  Still, 25 percent of Republican voters believe Islam’s encouragement of violence is level with Christianity’s doctrines, including the Beatitudes passage, reported by Matthew: “Blessed are the peacemakers, for they will be called children of God. ” The Koran, in contrast, is deemed by Islam’s adherents to be a direct transcript of Allah’s many commands, including these belligerent commandments: I will cast terror into the hearts of those who have disbelieved, so strike them over the necks, and smite over all their fingers and toes. Fight in the way of Allah those who fight you but do not transgress. Indeed. Allah does not like transgressors.  So when you meet those who disbelieve [in battle] strike [their] necks until, when you have inflicted slaughter upon them, then secure their bonds, and either [confer] favor afterwards or ransom [them] until the war lays down its burdens.  Former President Barack Obama and other leaders in the Democratic Party have repeatedly suggested that Islam is not more violent than other religions. Obama told Muslims in February 2016 that Islam means “peace,” although it actually means “submission. ” Similarly, a Feb. 3 letter signed by three senior Democratic legislators in the House argued that “there are other three million Americans who practice Islam peacefully. The specter that there would be a Federal program that —  in name and action —  singles out people of a particular faith warrants immediate [critical] consideration by the Department of Justice. ” Progressive and   activists say much violence is caused by Christians, although few make the argument that the violence is motivated Christian doctrines. “However, and this will probably shock many, so you might want to take a breath: Overwhelmingly, those who have committed terrorist attacks in the United States and Europe aren’t Muslims,” according to a Daily Beast column emphasizing the role of European nationalist groups in terrorism rates. “Conservatives claim that all terrorists are Muslim, but most violent attacks in the U. S. are carried out by white men,” claims an article at Salon. com, which emphasizes the murders of abortionists. Similarly, establishment media sites have played up the     views of White House officials without even trying to address the truth or falsity of the views. In contrast,   critics of Islam routinely argue that Islam’s mixture of religion and political ideology has a harmful impact on adherents and on societies. They argue that Islam is far more aggressive and harmful to societies that what they describe as the beneficial impact of Christianity’s mix of faith and reason, freedom and law.'"}, "time": 1742563650.4643958}