{"duration": 0.24698424339294434, "input_args": {"text": "'Theresa Crouse November 2, 2016 Senior Preparedness: What Types Of Food To Store? \\nThe great thing about modern technology and food industrialization is that there are now all types of food commercially available. \\nThat’s great news for those of us who aren’t exactly spring chickens anymore because it makes building a diverse stockpile extremely simple. \\nWhat to Stock? \\nWhen you’re making your list, be sure that you include the following groups in order to have a full supply of foods that will meet your dietary needs: Vegetables: These are most easily bought canned. If you have high blood pressure, watch out for the sodium content because salt is often used as a preservative. Be sure to get a variety of colors because each one offers different nutrients. For example, oranges and reds are high in vitamins A and C and greens offer iron, vitamin C and, often, the B vitamins. Veggies also offer protein as well as fiber that will keep your digestive tract healthy. Fruits: Fruits can be purchased canned, freeze-dried or dehydrated. All forms of preservation maintain high levels of the nutritional value of the fresh fruits. Be sure to buy ones canned in juice instead of ones canned in syrup. Again, go for different colors for the nutritional range that the offer. Fibrous fruits such as peaches are great for long-term energy because the fiber slows the absorption of the natural sugars in the fruit. Meats: Thanks to modern technology, well-preserved meat can be purchased dehydrated, smoked, or canned. Each way is nutritious and delicious. Again, watch the sodium levels if you have blood pressure issues and shoot for nutritious meats such as jerky and canned tuna and chicken instead of fatty, processed meats such as Spam or potted meat. Beans: You can purchase beans canned or dry. They’re a great source of protein and B-vitamins as well as carbohydrates. If you have digestive problems with beans, try soaking them first and cooking them with an onion. That sometimes helps get rid of the “gassy” properties. Dry Goods: Flour, sugar, pastas, rice and other dried goods will be good for two reasons: they’ll help round out your meals with delicious, filling sides and sauces and they’ll make great barter items. Spices: Dried spices last for years and are easy to store. You can also opt to grow your own indoor herb garden, which we’ll discuss in a bit. Spices will make a great barter item as well as help you add flavor to meals. Desserts and Treats: Sometimes eating is about more than nutrition. A nice piece of apple pie can boost morale and give people the mental boost that they need to get through tough times. Adding some pie filling or some chocolate chips to your stockpile will add a welcome burst of comfort to life if SHTF. Don’t depend on treats for nutrition, but storing some for treats or trading is a good idea if you have the room. Fats and Oils: Healthy fats such as olive oil and coconut oil deliver nutrition and a good backup source of energy. They also help flavor meats and are necessary if you want to make such dishes as biscuits or sauces. Your body needs omega-3’s in order to function and since it can’t make them on its own, you need to eat them. Fish and olive oil are both good sources but olive oil doesn’t have the risk of mercury poisoning that you may encounter by eating too much canned fish. Energy Bars: Because they’re portable and often contain all of the nutrition that you need for an entire day, energy or protein bars make great additions to your stockpile. Since they’re lightweight and take up very little space, you should toss a few into your bug-out bag so that you have some quick energy and nutrition should you need to evacuate. \\nStocking Up with Store-Bought Foods \\nThough growing your own food and being completely independent of outside food sources is great, it’s also extremely difficult to do if you live in an urban area or have physical limitations. There are numerous reasons why purchasing your food supplies from the store may be your best option, especially as you get older. Here are just a few: The food is safely preserved. You can buy a wide variety all at the same place. There’s no manual labor involved. You don’t have to learn any special food growing or preservation techniques (though we recommend that you learn how to do it in case you need to in a long-term survival situation!) You don’t need garden space or special equipment. Purchasing your food is by far the easiest way to build your stockpile. If you watch for sales and use coupons, it’s extremely affordable as well. Even just taking advantage of BOGO sales will save you a tremendous amount of money. \\nNot only can store-bought foods save you time, many of us don’t have the space or the physical strength to manage a large garden anymore. Growing a small one for fresh foods is fabulous but growing one large enough to produce extra for canning can be taxing when you get older. Heat stroke is no fun at all, and picking beans sure is hard on the back muscles. \\nIf you’re nodding your head in understanding and agreement, store-bought supplies may be the way to go. \\nA Bit About the Types of Foods Available Commercially \\nYou’ve been buying commercially prepared foods all of your life but you probably haven’t ventured far beyond the standard canned foods aisle in your local supermarket. A trip to a hunting goods store or a military surplus store will open up the doors to a few more options. Here’s a brief rundown on the major preservation methods available to you: Canned Food: This one doesn’t need much of a description because unless you’ve been living under a rock, you’ve eaten it in mass quantities throughout your life. Food is sealed in plastic or glass jars or in steel or aluminum cans in such a way that air can’t get in to cause spoilage. Dehydrated Food: Again, this one doesn’t need much of an explanation because you’ve surely had jerky or dried fruits. Food is seasoned and cooked in an oven or a dehydrator to remove the liquid. It’s then typically sealed in a bag or jar in order to keep out moisture that will cause spoilage. With the moisture removed, dehydrated food is lightweight, takes up very little space, retains nearly all of its nutritional value and is good practically indefinitely as long as no moisture gets to it. Great for your bug-out bag. You can add water to dehydrated foods to rehydrate them and cook with them. Freeze-Dried Foods: This is a method that you may not be so familiar with. Freeze-drying is a 3-step process sort of similar to dehydrating, except the food is first frozen. Then it goes into a warm vacuum chamber where it remains for several hours. Instead of turning to liquid, the vacuum causes the liquid to leave the food in a frozen form that vaporizes. Finally, the food is dried to remove the rest of the water and sealed to keep moisture out. Most freeze-dried foods have a recommended shelf-life of 25 years. It’s also extremely light and can be eaten as-is or rehydrated and cooked. You can buy single products such as fruits or complete freeze-dried meals. Meals Ready to Eat (MREs): These are meals created originally by the military to provide nutrition to soldiers in the field. Nowadays, they’re available from military surplus stores if you want the real thing. Companies also produce them for the private sector and you can buy them at sporting goods stores. As with freeze-dried or dehydrated foods, MREs are available as single foods or entire meals. Dried Foods: Spices and beans are great examples of foods preserved by drying. It simply involves allowing the product to hang and dry naturally. Unlike dehydrated foods, the process doesn’t involve heat. Otherwise, it’s the same idea; remove the water and bacteria can’t grow. \\nWith all of these options available, there’s no reason why you can’t stock your pantry and eat well even if disaster strikes. \\nHere are a few tips for buying supplies that will help you store what you need while getting the most mileage for your buck: \\nBuy foods that you eat. Yes, canned asparagus may be on sale but if you hate it, don’t buy it. There’s a reason that you still have 2 cans of it in your pantry from 1972 – you think it’s gross and would rather go hungry than open that can and ingest the contents. Not a great way to stay in good spirits in a tough situation. \\nBuy in bulk. Food is often cheaper if you buy large quantities of it. For instance, a 50lb bag of flour is going to cost much less per pound than a 5lb bag will. You can always separate it out into manageable proportions. Since a bag that large is difficult to handle, check to see if any of your local grocers deliver. Many of them do today and that will make it easier and safer for you to buy items that are difficult to handle. \\nBuy extra when you can. This is a great way to build your stockpile with foods that you enjoy. If you’re buying a can of clam chowder, buy two instead. If they’re BOGO, buy four! You’re accomplishing two things here; you’re building your stockpile and you’re ensuring that what you stock is what you like. Plus, you’ll have an extra can of soup on hand if you feel like sharing or if you forget to get it the next time. \\nSeal your dried goods. Just because your flour may be good for a year or more, it’s not going to be that appealing with bugs in it. When you get it home, store it in plastic containers or bags that bugs can’t get into so easily. This will keep it fresh longer, too. \\nDon’t buy damaged cans. If a can has a dent, don’t buy it. It’s entirely probable that the safety of the food has been compromised because if the can’s damaged, air could get in. Also, cans have a protective lining that keeps the steel or aluminum from seeping into your foods but if they’re dented, that protective lining could be damaged. Don’t risk it even if you’re going to eat it that night . \\nBuilding your stockpile with purchased food offers a safe, simple way to ensure that you’ll have what you need to get you through a survival situation. \\nIt’s time to go back in time and learn valuable survival secrets and skills from our ancestors. \\nThis article has been written by Theresa Crouse for Survivopedia. 6 total views, 6 views today'"}, "time": 1742562765.5955806}