{"duration": 1.4113926887512207, "input_args": {"text": "'Pop songs in the modern era are the products of collaboration  —   singers, writers, producers, engineers and many more all have a part to play. That arrangement engenders a perennial   anxiety: Is it the songs that have fans, or the singer? And can the singer go it alone detached from the ecosystem that laid the foundation for her success? Kesha tested these questions in real time on Thursday night, when she played a show at Warsaw, in Greenpoint, Brooklyn, as part of her first proper tour in three years. That time has been tumultuous: In lawsuits seeking release from her contracts, she accused the producer Dr. Luke, her longtime collaborator and the chief of the label imprint to which she is signed, of sexual improprieties, including rape. He countersued, asserting defamation and breach of contract. As a result, she has released no original music since 2013 and has only recently begun performing her old songs live. But old songs are old memories, and as was clear at this show, Kesha was hoping to perform them in the most distanced manner possible, by completely reworking the arrangements from   pop to, well, unfriendly rock. Throughout the night, she dismantled her old hits  —   “We R Who We R,” “Take It Off,” “Your Love Is My Drug”  —   and rebuilt them, backed by her band (the Creepies) as blowzy   with light touches of psychedelia. Kesha was dressed in rockabilly chic  —   a   outfit, including a   jacket with rainbow fringe dangling from the sleeves  —   and the title of the tour, which includes an expletive, was spelled out in huge   letters at the back of the stage. She sprinkled   theatrics throughout the show, fighting off a pair of comrades in dinosaur masks during “Dinosaur” and attacking one on the floor of the stage during “Cannibal,” coming up for air with blood dripping from her mouth. The effect was carnivalesque, a presentation indebted to the Dr. Demento era of stylistic novelty and excessive quirk. Though it was awkward and rarely effective, Kesha’s taste for the outré wasn’t unexpected. For a time in the early part of the decade, she promised to be a different sort of pop star  —   stylistically limber,   as comfortable rapping as singing, seemingly uninterested in the seamlessness megapop typically promises. Back then, it was never clear just how seriously Kesha took herself, or her music, an attitude that played well against the indestructibility of her records. Both of her albums  —   “Animal,” from 2010,” and “Warrior,” from 2012  —   were excellent. But those songs, while still the currency that gained her entry into the pop stratosphere, have become albatrosses. Her performances of them here felt like rejections. When Kesha delivered her breakout hit “Tik Tok” at the end of her main set using essentially its original arrangement, it was like a sunbeam breaking through clouds. It was also a needling reminder of what made her songs so effective in the first place  —   the interplay of Kesha’s salacious abandon and the ecstatic drive of the production, by Dr. Luke and others. In recent months, Kesha’s battles have made her a cause célèbre countless other performers have offered their public support, and Taylor Swift said she would give her $250, 000 (“to help with any of her financial needs during this trying time,” a representative for Ms. Swift said in a statement). After “Dinosaur,” Kesha addressed the eager crowd of about 1, 000. “It’s been way, way, way too long,” she said, meeting a roar of nourishing cheers. “I honestly don’t know if I would have made it the past three years without you guys. ” The audience replied with encouraging chants. When they screamed “Free Kesha” over and again, she went to the side of the stage and retrieved a phone, so that she could film the moment. Though most of her claims against Dr. Luke have been  rejected by a judge, her legal situation remains complicated. She played no new music here. In addition to the   hits of her own, she filled out her set with covers, a necessary strategy but also a problematic one. Performing someone else’s music lays you bare and reveals what you can add to a conversation that’s long been settled. There was a lumpy cover of Iggy Pop’s “Nightclubbing” and a disjointed take on Britney Spears’s “Till The World Ends” (a song written in part by Kesha). During her unwelcome encore, she gnawed at the chorus of Dolly Parton’s “Jolene” for a few melancholy minutes, then sang “Old Flames Can’t Hold a Candle to You,” a country standard written in part by her mother, closing out the tepid rendition by asserting, “I’m sick and tired of hearing people say I can’t sing, so there!” She was better when using songs to make statements: Lesley Gore’s defiant “You Don’t Own Me,” or Bob Dylan’s “I Shall Be Released,” which closed the show. “Always have hope in your heart,” Kesha told the crowd, before shouting her way through the song, using it as a diary and a cudgel.'"}, "time": 1742564020.2996888}