{"duration": 0.05673694610595703, "input_args": {"text": "'Home This Month Popular 16 Tips For Having Sex With Croatian Girls 16 Tips For Having Sex With Croatian Girls February 6, 2013 78 Comments Travel Day Game \\n1. Croatian girls are extremely receptive to day game. They want to be opened. Even if she has headphones and seems focused on her music, it can still go well. Same goes for girls on rollerblades (“Excuse me, where can I buy rollerblades like yours?”). \\n2. Croatia is one of those places where both indirect and direct game work. Pick one that suits the venue and your personality. What I did was open indirect, chat for a couple minutes, and then hit her with a compliment about her “positive energy” to see how she’d respond. If she smiled, I knew I was in. \\n3. Girls will give you their number even if they have a boyfriend. It may not come out until the first meeting. To avoid this, when I was getting a number I’d jokingly say, “You’re not married, right?” If she had a boyfriend, she would then announce it with a guilty look on her face. \\n4. Always go for the insta-date, especially if you’re doing street game. Not only will this weed out flakey girls, but it gives you an opportunity to find out what she wants in life. Croatia has a lot of “good” girls who don’t drink at all and want a serious relationship. You want to dump those prospects if you’re not staying long. \\n5. A common issue you’ll find on the first date is girls who want to bring their friends along. Don’t let them or you’ll get stuck in a hellish group chat. It’s either a 1-on-1 date or nothing. Night Game \\n6. You need to push the interaction as far as you can go. If you don’t at least get a kiss, the odds that number will lead to a date is 25% or less. If you get a passionate kiss with some hand-holding at the end, over 50%. It’s easy to get a number from a Croatian girl but you should resist: push for the kiss. It’s similar to what you should do in America. \\n7. Absolutely do not add a Croatian girl to Facebook. They are accomplished attention whores and will string you along. If you didn’t at least get a phone number, you got nothing. \\n8. Cockblocking is a huge problem. The best way to fight it is to be more selective about the venues you choose. Large clubs have the hottest girls, but they are harder to approach and you will end up getting cockblocked incessantly. Hipster bars have the ugliest girls, but you’ll rarely get cockblocked. Experiment in the city to find something in the middle that has the best balance between beauty and attitude. So much of a successful Croatian experience will be based on the venue. Going from the best venue to the worst, you may even feel like you’re in a different country. As a general rule, if you’re in a club where the girls aren’t genuinely excited you’re a foreigner, you should go somewhere else. \\n9. Since so many girls go out in pairs, it’s better to roll with a wingman than solo dolo. A problem you’ll face if you ‘re going out solo is that a girl doesn’t want to leave her friend alone. What I did was approach girls whose friend was already getting hit on by another guy. \\n10. Don’t compliment at night . Croatian girls already have an elevated perception of themselves and get compliments all the time. They are not insecure as girls from the Baltics or Ukraine . \\n11. Don’t call a girl before you bang her. They rarely answer. Text instead. \\n12. Croatia is slowly embracing one-night stands. With the right logistics, you should be able to get them. They are far easier than a place like Ukraine. The key here is having tight logistics. It should be so tight that you can “take a walk” with her and be at your place to hop in for a quick drink. The girls who are most likely to go for this will be 18-23 and who want a taste of the American sexual culture. Older women will be able to resist your logistical game. \\n13. Similar to the above point, all your dates should be close to your apartment. If your date venue is more than half a mile away, you’re already shooting yourself in the foot. Even if a Croatian girl is playing aloof, she can turn on a dime once in a private room. \\n14. The less snobby the club, the more acceptable it is to buy a girl a drink without getting “punished” for it. Croatia isn’t like other Eastern European countries where girls are generally upfront and honest with their intentions—they will play you if you give them the opportunity, especially the higher end venues. Generally speaking, as long as she didn’t have a bitch face when you first approached her, you should be in the clear to buy a drink . \\n15. The best game for Zagreb, the capital, is to have the best logistics possible. Sadly, Croatian girls flake more than average so you want the proximity of your apartment to act as bait for casual hangouts that turn into bangs. Unless you’re dealing with an older Croatian girl who is into you, you’ll have to play the numbers game and not get hung up on any one girl. Get ready to meet some hardcore female players. \\n16. If you put X hours a day into day game and X hours into night game, you’ll be rewarded with night game first. You can get surprisingly fast bangs at night that day game doesn’t provide, mostly because aggressive night game easily screens out day girls who are simply bored but not really hankering for dick. If I go back to Croatia, I’ll just move right next to a good bar.'"}, "time": 1742628410.3104215}