{"duration": 0.046212196350097656, "input_args": {"text": "'Cyrus Mistry speaks out, says TATA removal didn’t hurt as much as punny headlines on it Posted on Tweet \\nOusted TATA group chairman Cyrus Mistry finally spoke out regarding the development, terming that while getting the boot did hurt , it was nowhere in comparison to what he felt after reading dozens of pun-filled headlines over his name and ouster. \\n“What the hell, yaar ? Whatever I pick up, all I read is: Mystery over Mistry’s ouster; Che-Mistry no more, TATA group sacks chairman; Mist yet to clear on why Mistry was ousted, TATA says tata to Mistry. I can’t take this anymore! Please stop. I can always find another job or even become a chairman of some other company if lady luck favors me, but will these Mistry puns ever end? I’ve had enough of this pun-ishment!” the ex-chairman cried out to The UnReal Times . The businessman was soon supported by Sixth Sense scientist Pranav Mistry, who tweeted, “I feel you, bro!” \\nThe mainstream media, however, shot back at Mistry, asking him to take a chill pill. “Sigh-rus Mistry clearly not happy over some witty puns, eh? ;)” tweeted Times Group chairman Vineet Jain. Jain’s tweet was soon followed by rival newspaper The Hindu publisher, N Ram’s tweet: “About time Cyrus gulps in some Citrus juice to calm himself. Ratan Tata’s right about the intolerance part – it’s coming from his own ex-chairman!” \\nAn upset Mistry mentioned that sooner or later, he would have to change his name if things continue this way. “The last thing I want now is Cyrus Broacha meeting me and the media saying ‘Cyrus broaches Mistry!’ AAARGH!” an angry Mistry cried. He was, however, consoled by actor Neil Nitin Mukesh. “Be happy you have a popular 2-word name and not a 3-word one. That’s much, much, much better! Seriously, seriously, seriously!” Neil Nitin Mukesh reportedly told him. \\nMedia-appointed BJP MP, the VHP’s Sadhvi Prachi, who usually asks people to go to Pakistan, got into a bit of a lighthearted mood herself. “If Cyrus doesn’t like what happened, he can go to Cyprus!” the Sadhvi exclaimed. The ex-chairman was also approached by Sports Minister Vijay Goel, who told him, “I can never get a selfie with Miley Cyrus. So let me at least get one with Mistry Cyrus.” \\nMistry’s biggest consolation and shoulder to cry on, though, came all the way from South Africa, from the quarters of wicket keeper Quinton De Kock. “I can’t tell you how it feels each time I trend on Twitter and see the tweets about me. Trust me, you’re much better off. You just can’t imagine how cocky some tweeters can get. Oops!” the keeper is supposed to have said. Tweet About Ashwin Kumar \\n1 of the proud columnists of URT, former co-editor of URT Tamil, amateur musician, Real Harris Jayaraj devotee, UnReal T. Rajendar fanatic, passionate about stopping female foeticide.'"}, "time": 1742628376.05551}