{"duration": 0.06349515914916992, "input_args": {"text": "'Before North Carolina passed its controversial bathroom law, before Caitlyn Jenner transitioned and before “Transparent” became a hit TV series, a little kid in rural Colorado was told she couldn’t use the girls’ restroom at school anymore. The story of Coy Mathis, a transgender girl who was born a boy, garnered international attention in 2013 when her parents, Jeremy and Kathryn Mathis, filed a complaint accusing the school district of violating the state’s   law. The Mathises went on to win their case, but not before coming under heavy criticism for putting Coy, then a    first grader, in front of reporters and camera crews and on television with Katie Couric. Now, they’re poised to be foisted back into the spotlight with the documentary “Growing Up Coy,” which has its premiere on June 16 in New York at the Human Rights Watch Film Festival. Directed by Eric Juhola and produced by his husband, Jeremy Stulberg, “Growing Up Coy” picks up with the Mathis family in early 2013, about six weeks before they went public with their case. Together with their lawyer, the Mathises believed that speaking openly was necessary to sway the public in Coy’s favor and to help win her case. But, as the documentary shows, the move unleashed a media feeding frenzy that previewed the fights that would roil America in 2016, fraying the couple’s relationship, drawing excoriations from talking heads and internet trolls, at times alienating their four other children and indelibly etching Coy’s name into cyberspace’s inexhaustible memory bank. “I think they didn’t know what they were getting into when they started. I don’t think they knew how big it was going to get,” Mr. Juhola said. “I can’t speak for them, but I hope that over time they realize the difference that they made. I think the world is a better place because of them and what they did. ” In the course of the documentary, the Mathises moved from Fountain, Colo. a small town near the headquarters of the conservative organization Focus on the Family, to Aurora, Colo. and have since moved elsewhere in the state. They retreated from public view and are unlikely to participate in the promotion of the documentary. The film could not be timelier, with transgender issues at the fore and 11 states suing the Obama administration over its directive telling schools to allow students to use whichever bathroom matches their gender identities. But, Mr. Juhola noted that he and Mr. Stulberg embarked on the project before, in his words, “trans was, quote, trending. ” Wanting to document a transgender person’s fight for rights, the filmmakers were equally intrigued by the Mathises’ staunch support of their child. “They’re really the first generation of parents letting their young kids express themselves as whatever gender they identify with,” Mr. Juhola said. “A lot of older transgender people who we met, who just transitioned in their 40s, 50s and 60s, said, ‘Oh my God, I can’t even imagine how different my life would be if I’d had parents like them. ’” The Mathises’ troubles with Eagleside Elementary School began in late 2012, when the principal told them that Coy, who began identifying as a girl when she was 18 months old, could no longer use the girls’ bathroom. At that point Coy, who as a triplet has a brother and sister, along with two other sisters, had been living as a girl for a while, wearing sparkly, flouncy dresses and long hair, and had been identified as a girl in medical and legal records. In the documentary, the Mathises describe Coy’s misery in her earliest years when the couple  —   Jeremy is a former Marine and Kathryn is a freelance portrait photographer  —   dressed her as a boy. Deeply anxious, Coy refused to go outside, rarely smiled, had meltdowns when told to line up with the boys at school, and asked her parents when they would take her to the doctor to remove her penis. (No such operation was or is being planned.) “It was just what it was,” Mr. Mathis said in the film. “This wasn’t a phase. ” After hearing from the principal, the Mathises contacted Michael D. Silverman, executive director of the Transgender Legal Defense  Education Fund, who wrote to the school board, hoping for a resolution. The board’s response  —   they cited concerns for other students sharing the bathroom with Coy as she grew older  —   prompted the Mathises to withdraw their children from the school. After some   discussions, Mr. Silverman said, the family agreed that the best action was to take the case public. By showing how achingly normal Coy and her family were, they could put a face  —   an adorable, impish face  —   on an issue that many people at the time were not just unfamiliar with but also stigmatized and feared. “The motivating factor was, how can we create the conditions where we can win for Coy?” Mr. Silverman said in an interview. “It wasn’t clear without speaking publicly that anyone would understand what was at stake. ” The same reasoning probably prompted the Mathises, who did not respond to interview requests for this article, to also agree to the documentary, Mr. Juhola said. “It’s really about making the world a better place for Coy by putting images out of transgender people that are positive,” Mr. Juhola said. Just as public controversy raged about Coy’s name and image being made public  —   the public editor of The New York Times weighed in, while, in Colorado and elsewhere, the Mathises were accused of being child abusers and setting Coy up for harassment  —   the documentarians also asked themselves about their own responsibility to protect Coy. In the end, Mr. Juhola said, they deferred to the Mathises’ judgment, which Ms. Mathis addressed in the film. “We weren’t the ones who stigmatized her to begin with,” Ms. Mathis said. “Sending a little girl into a boys bathroom, that’s setting her up to being hurt. ” As the couple, in the film, wrestled with whether to agree to yet another interview (they would turn down offers to be in ads and to star in a reality show) Ms. Mathis also mused, on camera, about the duress of living under the microscope. “Where should we draw the line?” she asked. “We don’t want her to look back and see that we didn’t stand up for her. ” While the news media pressure depicted in the film seems acute, the worst of it largely ended after about six months, in the summer of 2013, when Colorado’s civil rights board ruled in the Mathises’ favor, chastising the school for its “severe and pervasive treatment” and for creating an environment that was “hostile, intimidating or offensive. ” Mr. Juhola said that as far as he knew, the Mathises remain settled, and welcome, in their new community, where Coy, who will turn 10 this year, is living happily as a girl. “She doesn’t want to have to explain who she is, and talk about how she’s different,” Ms. Mathis says, in the film. “She just wants to be. ”'"}, "time": 1742628511.867186}