{"duration": 0.10517287254333496, "input_args": {"text": "'ELECTION CHANGES POLITICAL LANDSCAPE INSIDE MARRIAGE Nov 14, 2016 \\nRICHMOND, VA (SatireWire.com) – Donald Trump’s shock election has dramatically shifted the political landscape in the home of Deirdre and Scott Taylor of Richmond, Va., as Scott’s vote for Trump has caused Deirdre to redraw the physical and emotional boundaries of their relationship, in lieu of just killing him. \\n“Due to the incomprehensible votes cast by certain members of this household electorate, I am shifting policy to address the very real threat that my husband Scott is an idiot,” said Deirdre Taylor of Richmond, Va. “As a result, I am today redistricting our house such that Scott resides only his areas, specifically the basement, the garage, the couch – every night – and the yard, although not in areas of the yard where I can see him or hear him or smell him.” \\nThe bedroom, she added, is now the equivalent of the post-industrial Midwestern states that went for Trump. \\n“It’s a place of anger and sadness that was once a thriving hub of activity but now that’s gone and it’s never coming back,” she said. \\nThe Taylors, who have been married for 12 years, are among thousands of couples in the U.S. that are struggling to adapt to the seismic shift in their once-united states, a shift brought on by a vote in which the women voted for Hillary Clinton and the men chose Trump. \\nIronically, many of these white, suburban males now find themselves holding the status of the women and minorities Trump often railed against. \\n“I’ve talked it over with Deirdre and our friends, and my husband Kirk and his buddies will now be marginalized, under-served and, politically and in all other ways, impotent,” said Kora Ann Snelling, a neighbor of Deirdre’s. “Using terms Mr. Trump and my husband can understand, they’ll be vaginally bankrupt.” \\nFor the Taylors, the shift became apparent late on election night as they watched the results come in. \\n“I asked Scott if he voted for Hillary, and he said, ‘Um…’ Deirdre recalled. \\n“That’s all I said! ‘Um,’ Scott explained. \\n“Because you couldn’t bring yourself to admit you voted for a race-baiting, misogynistic pathological liar who draws support from white nationalists and boasts of sexual assault!” Deirdre countered. \\n“But I just… wanted to make American great again,” Scott protested. \\n“Why don’t you make the doghouse great again instead?” Deirdre replied. \\n“We don’t have a dog,” Scott pointed out. \\n“Well get Mexico to build you one!” she said. \\nWhile Trump doesn’t take office until January, Deirdre has already taken steps to institute a core tenet of her new policy. \\n“I have completed a virtual border wall between myself and the father of our children – our two daughters ! – and if he so much as attempts to approach he will be treated as an enemy combatant,” she said. \\nAt press time, Deirdre was reading the children a book about tolerance while Scott was trapped in a hell of his own making. \\n '"}, "time": 1742564457.4038146}