{"duration": 0.14422082901000977, "input_args": {"text": "'Tweet Widget by BAR executive editor Glen Ford \\nSo-called “fake news” has Obama shook up – probably because he and other presidents want to keep their monopoly on false narratives. “The ruling class, which Obama so faithfully serves, has lost control of the social and political narrative, without which it cannot ‘protect’ its wealth, privilege and power. It is a crisis of legitimacy, rooted in the crisis of capitalism, itself.” Obama’s Musings on False Narratives and Fake Stories by BAR executive editor Glen Ford \\n“ People no longer believe the fake “news” and bogus narratives issued by the ruling class and its corporate and military misinformation specialists.” \\nPresident Obama traveled to Berlin last week to browbeat Europeans on why they should continue to play junior partners in Washington’s quest for full spectrum global domination, but kept returning to his post-election obsession: the existential threat posed by “fake news” on social media. It was as if the realization had just dawned on the lame duck president, that his own powers to create “facts” and manufacture “news” out of thin air would soon be gone. Without the Clintons in the White House to continue the neoliberal project, history might conclude that the First Black President’s only enduring legacy was...that he was the first Black president. \\nIt’s a question of who gets to decide what’s “fake” or not. Obama fears that what he calls “fake” news begets fake history, which begets the fall of western civilization as the rulers would like people to imagine it. Fake news is a grave danger “in an age where there’s so much active misinformation and its packaged very well and it looks the same when you see it on a Facebook page or you turn on your television,” according to Obama . “If everything seems to be the same and no distinctions are made, then we won’t know what to protect,” he told the Germans. \\nIt was a magic kind of moment. The legendarily cool and collected Obama had just let out the secret: the ruling class, which he so faithfully serves, has lost control of the social and political narrative, without which it cannot “protect” its wealth, privilege and power. \\n“ When the people come to believe that the president’s narrative is a bunch of ‘propaganda,’ then future Obamas will no longer be able to protect the Lords of Capital from the pitchforkers.” \\nWas the world’s most powerful individual (until January 20) in despair over Facebook’s failure to erase three or four fictitious, yet ultimately inconsequential, stories from its pages? Of course not. Obama’s problem -- and capitalism’s crisis-- is that people no longer believe the fake “news” and bogus narratives issued by the ruling class and its corporate and military misinformation specialists. “If we are not serious about facts and what’s true and what’s not, and particularly in an age of social media when so many people are getting their information in sound bites and off their phones, if we can’t discriminate between serious arguments and propaganda, then we have problems,” said Obama. \\nThis is the man that told the nation’s assembled bankers, a year after the Greet Meltdown of 2008, “My administration is the only thing between you and the pitchforks.\" When the people come to believe that the president and the corporate media’s narrative -- that the system can be fixed with a little tinkering -- is a bunch of “propaganda,” rather than “serious argument,” then future Obamas will no longer be able to protect the Lords of Capital from the pitchforkers. \\nLosing control of the narrative is what happened after Michael Brown’s murder in Ferguson, Missouri, when Black youth stopped listening to Obama’s fictitious sermon that racism is not endemic in America, a fake history that candidate Obama had successfully dispensed in his “A More Perfect Union” speech in Philadelphia, in 2008. \\nObama’s targeted handful of phony social media articles generally favored Donald Trump. But the \\nbiggest “fake news” of the recent campaign, promulgated by virtually the entirety of the ruling class ensconced in Hillary Clinton’s Supersized Tent, was that the Russians were scheming to despoil and disrupt the U.S. elections -- crimes Americans commit all by themselves every cycle through massive voter purges and other racist conspiracies. To Clinton and Obama’s horror, this McCarthyite deluge of fake anti-Russian news failed to sway the very “Middle Americans” that were thought to be the most belligerent, warlike constituency of all. \\n“The root of the crisis lies in the inability of late stage capitalism to offer anything that will stem the steady decline in the mass of people’s living standards and economic security.” \\nThe Big Tent -- Wall Street, the national security establishment, and their media – have lost all credibility with the public, and Obama was still shaken by the realization when he traveled to Berlin. Donald Trump and his crowd’s credibility – their ability to weave a believable narrative – was nonexistent from the start among half the country, and will shrink even more over time. \\nThe root of the crisis of credibility, which is really a systemic crisis of legitimacy, lies in the inability of late stage capitalism to offer anything that will stem the steady decline in the mass of people’s living standards and economic security. So deep is the decay, every amelioration of public pain would require the dismantling of capitalist structures of power, which is unacceptable to the rulers. \\nOn the most basic level, the U.S. does not have universal health care because capital has entrenched itself in all aspects of health care delivery. The rulers cannot provide affordable housing because Wall Street has financialized the nation’s land and dwellings. Good jobs at living wages are impossible, as long as corporations are empowered to maintain their carefully crafted international supply chain for manufactured goods – the foundation of corporate globalization. Black America cannot break free of the Mass Black Incarceration State until Black people eject the police, as presently constituted, from their communities, which will also require ejecting the corporate collaborators of the Black Misleadership Class from positions of power. There can be no peace -- and no peace “dividend” for Americans – while predatory corporations and cartels dictate U.S. foreign policy. The cycle of decline and repression will continue until corporate power is broken and the banks are nationalized. \\nThe rulers offer nothing, because the system is no longer capable of providing relief to the working and “superfluous” classes (that means most Black folks). They can only spin tales of fantasy and distraction – fake stories and phony narratives. \\nAmerican “Exceptionalism” is “Manifest Destiny” with Native American genocide and Black slavery blotted out. It is the falsest narrative of all, tailored for imperial conquest and an “end of history” — meaning, the end of everyone’s narrative except the imperialist. BAR executive editor Glen Ford can be contacted at [email protected] .'"}, "time": 1742562256.972736}