{"duration": 0.10840153694152832, "input_args": {"text": "'Lindsay Lohan’s Strange Accent: Another Telling Sign of a Mind Control Slave November 3, 2016 94 \\nA video of Lindsay Lohan giving an interview with a strange accent has lead to wild speculation from fans and media. However, to those in the know, this is yet another telling symptom of MK programming, from someone who has already displayed many other symptoms. \\nThere’s a difference between speaking with a funny accent as a joke and speaking with a completely different speech pattern in all seriousness. One is the result of goofing around and the other is the result an alter-persona. - Advertisement - \\nLohan’s new accent was noticed while giving an interview to a reporter in Greece. Here’s the video. \\nLindsay, who is mainly based in England and Greece and was recently in a relationship with a Russian billionaire (MK handler?), was explaining to the journalist about why she has opened up a Nightclub in Athens called Lohan. After a Daily Mail article on the subject, Lohan “joked” and gave her accent (and alter-persona) a name: Lilohan. \\nAs stated in previous articles, victims of Mind Control are programmed with alter personas that have their own history, identity and accent (read my full article on Monarch Programming here ). The programming is so pervasive that the same person can speak different languages with different accents effortlessly – while the core persona cannot. For this reason, the spontaneous yet constant usage of a different accent is one of the main tell-tale signs of MK programming. And Lindsay Lohan has been identified her, on Vigilant Citizen, to be a Beta Kitten slave a long time ago. The entertainment industry has been very keen on proving this fact through symbolic pictures. Lindsay posed countless times as Marilyn Monroe who is the prototype of Beta Kitten Programming. In this photo by Tyler Shields, Lindsay lays on a bed while men get undressed. One cannot come up with a more graphic way of portraying the life of Beta Kitten slaves. Industry slaves must work with creepy photographers such as Terry Richardson. Bonus industry slave sign: One Eye sign. In another shoot with Terry Richardson, Lohan appears genuinely traumatized. \\nIn past years, Lohan has floated in and out of rehab (aka re-programming) while increasingly appearing to be “out of it”. \\nAnother famous person who has been displaying the same Beta Kitten symptoms is Britney Spears. Here’s an article about her speaking with a different accent in 2008 – around the time of her infamous head-shaving meltdown. Britney Spears Lapses Into a British Accent \\nBritney Spears has a new accessory to go with her pink wig: a British accent. \\nIn the last several weeks, Spears, 26, has been videotaped numerous times trading her Louisiana twang for U.K. inflections. \\n“She had the English accent thing going the whole time” while shopping at Kitson last Thursday, according to a source. “It didn’t stop.” \\nEven when angry, the accent appears. On an L.A. shopping trip to Macy’s on Jan. 13, she screamed at the paparazzi, “Get out of my G—— face!” – in a British accent. \\nSo is it all in fun or has she flipped her pink wig? \\n“When someone has dissociative identity disorder” – formerly known as multiple personality disorder – “each identity is split off from the other,” says L.A. psychologist Renee A. Cohen, who is not treating Spears. “Each identity would have its own name, memories, behavioral traits and emotional characteristics.” \\nCohen says the critical question is: “When Britney uses the British accent, or appears to take on another identity, does she know she’s Britney Spears?” \\n“Otherwise, she could simply be behaving this way for attention, for sympathy, or any other reason,” adds Cohen. “It’s foolish to attempt to diagnose her without a formal evaluation.” \\nOne possible influence could be Spears’s maternal grandmother, Lilian Bridges, who was originally from England. \\nAlso, Spears’s new beau, photographer Adnan Ghalib, grew up in Birmingham, England. \\nAccording to paparazzi who trail the singer around the clock, one thing is for sure: the pink wig means something’s changing. \\n“When she puts on the pink wig, you just know something crazy is about to happen,” said one paparazzo. \\n– Source: People.com \\nWhile media is wondering what kind of accent Lindsay was speaking with (sounds Greek to me), we should rather wonder: Why would a 30 year old woman speak, in all seriousness, with a strange accent and a completely different speech pattern? Most of the time it is the result of a multiple-personality disorder (MPD) – which is a symptom of Monarch mind control. It is there, right in our face, but very few are actually seeing it. TAGS'"}, "time": 1742563701.5771124}