{"duration": 0.07151317596435547, "input_args": {"text": "\"By Jameson Parker Election 2016 , Politicians Behaving Badly , Politics November 4, 2016 ‘Is He Having A Stroke?’: Huckabee Calls Trump A ‘Car Wreck,’ Freaks Out When People Laugh At Him   \\nIt was a good morning for Ben Carson. No longer can it be said that he is Donald Trump’s very worst campaign surrogate. The title now belongs to Mike Huckabee – a very dim bulb in a low wattage room. \\nIn a turn that had people seriously questioning his mental health, the former Arkansas governor decided to use his patented ability to make lousy metaphors to compare Donald Trump to a car wreck. A strong endorsement if there ever was one. Trump may be a car wreck, but at least his car is pointed in right direction. Hillary is a drunk-driver going the wrong way on the freeway. \\n— Gov. Mike Huckabee (@GovMikeHuckabee) November 4, 2016 \\nTo break down the comparison, Huckabee is saying Donald Trump may be dead on arrival, but at least he isn’t Hillary Clinton, a woman he thinks is taking the country in the wrong direction. In Huckabee’s tortured brain, the fact that his own candidate is a total mess – the one he plans on voting for and is enthusiastically flying around the country supporting – is less bad than a woman who would back liberal policies he disagrees with. So… vote for Donald Trump, the car wreck! \\nHilariously, Huckabee seemed legitimately shocked and outraged that people took his analogy to mean he thought Donald Trump was a bad candidate. But instead of clarifying, Huckabee’s follow-up made everything so much worse. Low IQ media don't get my earlier tweet about car wreck. @realdonaldTrump will bend fenders but is a vehicle going right way. \\n— Gov. Mike Huckabee (@GovMikeHuckabee) November 4, 2016 \\nTo break down his new comparison: Donald Trump will hurt other people but in a conservative, Republican-style way. The “right” way. Uh… not helping, Mike. Is he having a stroke? https://t.co/OMFaLuROxC \\n— lyz lenz (@lyzl) November 4, 2016 Deep thoughts this morning from Huckabee (his daughter works for the guy he just called a car wreck) https://t.co/UP2rpf9q68 \\n— Eliza Collins (@elizacollins1) November 4, 2016 Just to be clear: Huckabee is a Trump surrogate… Who calls his candidate a car wreck. #WithSurrogatesLikeThat https://t.co/wflfPpTd2v \\n— Elizabeth Kricfalusi (@EKricfalusi) November 4, 2016 \\nLongtime fans of Huckabee’s peculiar brand of stupidity may recall that this isn’t the first time he seemed to suggest his candidate was in for an untimely demise. Last month, Huckabee got dismantled by Megyn Kelly after suggesting Trump was like Quint fighting the shark from the movie Jaws. Kelly was forced to point out that Quint actually gets eaten by the shark. And they wonder why Hollywood hates them pic.twitter.com/7YJxixbzVf \\n— JORDAN OKUN (@Jzokun) October 11, 2016 \\nYikes. \\nFeatured image via Scott Olson/Getty Images Share this Article!\""}, "time": 1742561777.0683088}