{"duration": 1.5864300727844238, "input_args": {"text": "'Pinterest \\nThe 2008 Democrat presidential primary got ugly between then-Sens. Barack Obama and Hillary Clinton, but you’d never know it given the ridiculous display by the Obamas on the campaign trail. Fortunately, a pro-Donald Trump super PAC decided to remind America… and Hillary Clinton is not too happy about it. \\nBuzzfeed reported : \\nThe Clinton campaign has sent cease and desist letters to at least four local television stations in Florida demanding they stop running an ad paid for by a pro-Trump Super PAC featuring First Lady Michelle Obama — even as the PAC is expanding its ad campaign in North Carolina. \\nThe ad, titled “Can’t Run Her House,” is being run through the Defeat Crooked Hillary PAC, a subsidiary of the Make America Number 1 PAC, which is backing Trump’s campaign. \\nDuring the 2008 presidential primary campaign, Michelle Obama said: \\nOne of the important aspects of this race is role-modeling what good families should look like. And my view is, if you can’t run your own house, you certainly can’t run the White House. You can’t do it. \\nBarack Obama laughably claimed that the comment wasn’t about Clinton, but who else would it have been about? That’s what liberals do, though; they just deny something ever happened or wasn’t what it obviously was — and thanks to the biased mainstream media, they get away with it. \\nHogan Gidley, the PAC’s spokesperson, said of the legal move by the Clinton campaign: \\nHillary’s just angry because the ad is impactful, it’s working and it speaks directly to the women she’s been trying to con for years. Hillary’s own campaign said when Michelle Obama speaks out, “it has a real impact,” and indeed, we agree – because it was Mrs. Obama who correctly pointed out Hillary Clinton “certainly can’t run the White House.” \\nTake a look at the ad below: \\nYou know, it really seems as if most Democrats are unable to just tell the truth. It looks pretty ridiculous for the Obamas to glowingly support Clinton and for Clinton to speak glowingly about the Obamas after the things they all said back in 2008. \\nPart of the problem with Democrats is that they have the media in the tank for them, so they don’t have to own up to anything. Besides, it’s not like their moral compass, the ones that actually have one, would force them to do so. \\nFor the Clinton camp to resort to legal action over an ad that simply points out their hypocrisy is the height of absurdity. If you can’t stand the heat, don’t make deals with the devil … '"}, "time": 1742564550.0370493}