{"duration": 0.09479570388793945, "input_args": {"text": "'Are The Polls Rigged Against Trump? All Of These Wildly Divergent Surveys Cannot Possibly Be Correct Michael On Television Half Of The Population Of The World Is Dirt Poor – And The Global Elite Want To Keep It That Way   22nd, 2016 \\nCould you survive on just $2.50 a day? According to Compassion International , approximately half of the population of the entire planet currently lives on $2.50 a day or less. Meanwhile, those hoarding wealth at the very top of the global pyramid are rapidly becoming a lot wealthier. Don’t get me wrong – I am a very big believer in working hard and contributing something of value to society, and those that work the hardest and contribute the most should be able to reap the rewards. In this article I am in no way, shape or form criticizing true capitalism, because if true capitalism were actually being practiced all over the planet we would have far, far less poverty today. Instead, our planet is dominated by a heavily socialized debt-based central banking system that systematically transfers wealth from hard working ordinary citizens to the global elite. Those at the very top of the pyramid know that they are impoverishing everyone else, and they very much intend to keep it that way. \\nLet’s start with some of the hard numbers. According to Zero Hedge , Credit Suisse had just released their yearly report on global wealth, and it shows that 45.6 percent of all the wealth in the world is controlled by just 0.7 percent of the people… \\nAs Credit Suisse tantalizingly shows year after year, the number of people who control just shy of a majority of global net worth, or 45.6% of the roughly $255 trillion in household wealth, is declining progressively relative to the total population of the world, and in 2016 the number of people who are worth more than $1 million was just 33 million, roughly 0.7% of the world’s population of adults. On the other end of the pyramid, some 3.5 billion adults had a net worth of less than $10,000, accounting for just about $6 trillion in household wealth. \\nAnd since this is a yearly report, we can go back and see how things have changed over time. When Zero Hedge did this, it was discovered that the wealth of those at the very top “has nearly doubled” over the past six years, and meanwhile the poor have gotten even poorer… \\nIncidentally, we tracked down the first Credit Suisse report we found in this series from 2010 , where the total wealth of the top “layer” in the pyramid was a modest $69.2 trillion for the world’s millionaires. It has nearly doubled in the 6 years since then. Meanwhile, the world’s poorest have gotten, you got it, poorer, as those adults who were worth less than $10,000 in 2010 had a combined net worth of $8.2 trillion, a number which has since declined to $6.1 trillion in 2016 despite a half a billion increase in the sample size. \\nIf these trends continue at this pace, it won’t be too long before the global elite have virtually all of the wealth and the rest of us have virtually nothing. \\nPerhaps you are fortunate enough to still have a good job, and you live in a large home and you will sleep in a warm bed tonight. \\nWell, you should consider yourself to be very blessed, because that is definitely not the case for most of the rest of the world. The following 11 facts about global poverty come from dosomething.com , and I want you to really let these numbers sink in for a moment… Nearly 1/2 of the world’s population — more than 3 billion people — live on less than $2.50 a day. More than 1.3 billion live in extreme poverty — less than $1.25 a day. 1 billion children worldwide are living in poverty. According to UNICEF, 22,000 children die each day due to poverty. 805 million people worldwide do not have enough food to eat . Food banks are especially important in providing food for people that can’t afford it themselves. Run a food drive outside your local grocery store so people in your community have enough to eat. Sign up for Supermarket Stakeout . More than 750 million people lack adequate access to clean drinking water . Diarrhea caused by inadequate drinking water, sanitation, and hand hygiene kills an estimated 842,000 people every year globally, or approximately 2,300 people per day. In 2011, 165 million children under the age 5 were stunted (reduced rate of growth and development) due to chronic malnutrition. Preventable diseases like diarrhea and pneumonia take the lives of 2 million children a year who are too poor to afford proper treatment. As of 2013, 21.8 million children under 1 year of age worldwide had not received the three recommended doses of vaccine against diphtheria, tetanus and pertussis. 1/4 of all humans live without electricity — approximately 1.6 billion people. 80% of the world population lives on less than $10 a day . Oxfam estimates that it would take $60 billion annually to end extreme global poverty–that’s less than 1/4 the income of the top 100 richest billionaires. The World Food Programme says, “The poor are hungry and their hunger traps them in poverty.” Hunger is the number one cause of death in the world, killing more than HIV/AIDS, malaria, and tuberculosis combined. \\nSo how did we get here? \\nDebt is the primary mechanism that takes wealth from ordinary people like you and me and puts it into the hands of the global elite. \\nIn my recent article entitled “ Why Donald Trump Must Shut Down The Federal Reserve And Start Issuing Debt-Free Money “, I discussed how the Federal Reserve was designed to entrap the U.S. government in an endless debt spiral from which it could never possibly escape. And that is precisely what has happened, as the U.S. national debt has gotten more than 5000 times larger since the Federal Reserve was created in 1913. \\nIn that very same year, the federal income tax was instituted, and that is a key part of the program for the global elite. You see, the income tax is how wealth is transferred from us to the government. And then a continuously growing national debt is how that wealth is transferred from the government to the elite. \\nIt is a very complicated system, but at the end of the day it is all about taking money from us and getting it into their pockets. \\nAnd at this point more than 99.9 percent of the population of the world lives in a country with a central bank, and almost every nation on the planet has some form of income tax. \\nIt is a global system that is designed to create as much debt as possible, and I recently shared with my readers that the total amount of debt in the world has hit a staggering   of 152 trillion dollars . \\nInterestingly, the Bible actually foretells of a time when rich men would hoard wealth in the last days. The following are the first five verses of the Book of James in the Modern English Version … \\nCome now, you rich men, weep and howl for your miseries that shall come upon you. 2 Your riches are corrupted and your garments are moth-eaten. 3 Your gold and silver are corroded, and their corrosion will be a witness against you and will eat your flesh like fire. You have stored up treasures for the last days. 4 Indeed the wages that you kept back by fraud from the laborers who harvested your fields are crying, and the cries of those who harvested have entered into the ears of the Lord of Hosts. 5 You have lived in pleasure on the earth and have been wayward. You have nourished your hearts as in a day of slaughter. \\nSo much of the time we focus on the other great sins that we see all around us, but the truth is that one of the greatest sins of all in our world today is the sin of greed. \\nThe borrower is the servant of the lender, and the global elite have used various forms of debt to turn the rest of the planet into their debt slaves. \\nAs debt levels race higher and higher all over the planet, the elite are using the magic of compound interest to grab a bigger and bigger share of the pie. \\nGiven enough time, those at the very top would have virtually everything and the rest of us would have virtually nothing. The middle class is shrinking all over the globe, and the gap between the wealthy and the poor continues to grow at an astounding pace. \\nBut the vast majority of people out there have no idea how money, debt, taxes and central banks really work, and so they have no idea that this is purposely being done to them. \\nSo please share this article with as many people as you can. The truth is that we don’t have to have this much global poverty, and if we correctly identify the root causes of this poverty we can start working on some real solutions.'"}, "time": 1742628476.6107278}