{"duration": 0.015970468521118164, "input_args": {"text": "'\\nThis article was written by SGT Report and originally published at SGTReport.com . \\nEditor’s Comment: The web connecting the Clinton’s to professional provocateurs who’ve been fueling violence and riots via BlackLivesMatter and through anti-Trump campaigns runs back to a central core. These are agents of change for life, and they are willing to use any means necessary to tips the scales into something they can work with. There is every indication that the agenda is to stir social unrest and further division, and with enough fake riots and manufactured anger, things might lead to a full-fledged civil war in America. Problem. Reaction. Solution. \\nLou Dobbs called for Soros to be investigated and held liable for inciting riots that are causing property damage and personal harm:\\nShould DOJ investigate Soros & his links to non-profits for their role in inciting riots that have caused property damage & personal injury?\\n— Lou Dobbs (@LouDobbs) November 12, 2016 \\n\\nOne has to wonder how man degrees away this network is from those that appear to be involved in staging tragedies (such as shootings and terrorist events) for media exploit. Can we believe anything that we see on the national stage? The defeat of Hillary hits a nerve deep into the shadow network that runs the Deep State, because the message of rejection of the establishment speaks to deep-set resentment and anger among the population. To make an educated guess, with the world swinging towards Trump as an attempt to dump the globalist oligarchy, the powers that be will see the need for some big events to occur in response – in other words, they need a new crisis. If they were planning a false flag event of some kind, what would stop them from going all the way? \\nCLINTON CAMPAIGN INSIDER’S CONFESSION: Trump Protests Sponsored By Soros-Clinton Cabal \\nby SGT Report\\nAs Wayne Madsen is reporting, Hilary Clinton and George Soros have launched the «Purple Revolution» in America. Madsen writes, “The Purple Revolution will resist all efforts by the Trump administration to push back against the globalist policies of the Clintons and soon-to-be ex-President Barack Obama. The Purple Revolution will also seek to make the Trump administration a short one through Soros-style street protests and political disruption.”\\nWe KNOW who is behind this, and we are putting them on notice, there will be a changing of the guard on January 20th, 2017. Who will protect you from the long arm of the law then? \\n\\nThis article was written by SGT Report and originally published at SGTReport.com . '"}, "time": 1742628441.3413131}