{"duration": 0.10029339790344238, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. Markets shook, the pound and euro dropped, and European leaders called emergency meetings after Britons unnerved the Continent by voting to leave the European Union. Exactly how the “Brexit” will unfold is unclear, but Prime Minister David Cameron said he was not the man to lead the country through it and will step down. Here’s a short rundown of the basics. _____ 2. Young people had made up one of the strongest blocs against leaving. “Truly gutted that our grandparents have effectively decided that they hate foreigners more than they love us and our futures,” one tweeted. Some Britons appeared confused about what they had done. Google reported a spike in searches for “What happens if we leave the E. U.?” as well as “What is the E. U.?”  Thousands of readers posted comments. One wrote: “I’m British, but I’m not sure what that means anymore. ” _____ 3. President Obama said Britain’s “special relationship” with the U. S. would endure. Donald Trump, whose political base voices the same kind of populist anger heard in Britain, forecast benefits to British business. He included his own Scottish golf resort, which he happened to be visiting. “When the pound goes down, more people are coming to Turnberry, frankly,” he said. _____ 4. Bernie Sanders commands a fearsome digital army, adept in social media, that captured more than $200 million in donations. Now he appears to be ready to drop his candidacy and shift his focus. “I’m going to do everything I can do to defeat Donald Trump,” he told MSNBC’s “Morning Joe”  —   including vote for Hillary Clinton. _____ 5. Our movie reviewers have this to say about the this weekend’s big openings: “Independence Day: Resurgence” is a good bet only for those with an overwhelming love of    . “Swiss Army Man,” with Daniel Radcliffe as a corpse who makes Paul Dano’s life worth living, is “weird and wonderful, disgusting and demented. ” And “Free State of Jones” reconstructs a fascinating bit of Civil War history, with Matthew McConaughey leading a guerrilla army of white deserters and escaped slaves against the Confederacy. _____ 6. Mementos of Whitey Bulger’s gruesome career as a Boston mobster went up for auction, five years after he was convicted of 11 murder charges. There was his prized replica of a 1986 Stanley Cup championship ring and a   cup that he used as a pencil holder. The ring marked “1103” above is a sterling silver “Psycho Killer Skull” that he left in a London safe deposit box, along with $50, 000 cash, during his early years as a fugitive. _____ 7. More distress for the deeply troubled Summer Olympics in Rio de Janeiro. The Brazilian laboratory set to handle drug testing was suspended for “nonconformity” with international standards. The lab can appeal, but for the moment, the World   Agency said it would send samples outside Brazil for testing. _____ 8. The swimmer Michael Phelps, now 30 and the most decorated athlete in Olympic history, is aiming for five Olympic berths in trials that begin Sunday. One of our   stories today traces his fall and his resurrection, starting at a treatment center in Arizona. His coach said: “He hid everything that makes him human for 12 years. The rehab is what opened him up. ” _____ 9. West Virginia deployed hundreds of National Guard members and struggled to restore power to thousands of people after storms pounded the state with as much as nine inches of rain over eight hours. At least 14 people were killed in what the National Weather Service called a “     event. ” _____ 10. Finally, as schools start their summer breaks, classroom animals are heading out too. Our reporter followed an exodus of gerbils, mice, corn snakes, turtles, rabbits, guinea pigs, geckos, and frogs  —   not to mention Lucy the chinchilla, above  —   in New York City alone. “You learn new things here,” one girl said of her teacher’s vanishing menagerie. “Like, you have to put vitamins on the mouse before you feed it to the snake. ” Have a great weekend! _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742563361.8515143}