{"duration": 0.08570241928100586, "input_args": {"text": "'Libertarian Party VP insults Trump, practically endorses Clinton Published time: 26 Oct, 2016 21:09 Get short URL Libertarian vice presidential candidate Bill Weld (L) and Republican U.S. presidential nominee Donald Trump. © Reuters Calling Trump “unhinged” and “not stable” and accusing him of stirring up “envy, resentment, and group hatred,” the Libertarian Party VP nominee Bill Weld said he would continue through the election but practically endorsed Clinton without naming her. \\nWeld, Gary Johnson’s running mate, said he would remain on the Libertarian Party ticket through the election but emphasized that “Trump should not, cannot, and must not be elected President of the United States.” \\n“A President of the United States operates every day under a great deal of pressure — from all sides, and in furtherance of many different agendas. With that pressure comes constant criticism,” Weld said in a statement issued Wednesday in Boston. \\n“After careful observation and reflection, I have come to believe that Donald Trump, if elected President of the United States, would not be able to stand up to this pressure and this criticism without becoming unhinged and unable to perform competently the duties of his office.” Libertarian VP nominee Bill Weld on MSNBC wishes Clinton a happy birthday, as he discusses issuing his statement against Trump pic.twitter.com/uOrqCpwDyy — Eli Watkins (@EliBWatkins) October 26, 2016 \\nWeld said the Libertarian Party had made strides “t oward breaking the two party monopoly,” and that America would be stronger when it did, but “given the Commission on Presidential Debates, the deck is stacked against a credible third party ticket.” \\nThe Libertarian Party, led by former New Mexico governor Gary Johnson, was polling under 10 percent nationally, not enough for the party to be included in the presidential debates. 2+2= #ImWithHer . Weld praises Clinton: https://t.co/EHCRZfmBu8 + Weld denegrates Trump: https://t.co/nUCBhYwSQj — Jeff Jarvis (@jeffjarvis) October 26, 2016 \\nA former Republican governor of Massachusetts, Weld said he “stepped out of the swirl of the campaign” to alert voters to Trump’s failings as a potential presidential nominee. He stopped short of endorsing Democratic presidential nominee Hillary Clinton by name. \\n“Mr. Trump has some charisma and panache, and intellectual quickness. These qualities can be entertaining. Yet more than charisma, more even than intellectual ability, is required of a serious candidate for this country’s highest office. A serious candidate for the Presidency of the United States must be stable, and Donald Trump is not stable.” — RT America (@RT_America) September 27, 2016 \\nWeld said Trump had demonstrated his inability to handle criticism or blame and that his first instinct was to lash out and when challenged “he often responds as a child might.” \\n“He makes a sour face, he calls people by insulting names, he waves his arms, he impatiently interrupts. Most families would not allow their children to remain at the dinner table if they behaved as Mr. Trump does. He has not exhibited self-control, the discipline, or the emotional depth necessary to function credibly as a President of the United States,” Weld said. Gary Johnson secures #Libertarian Party nomination - FishTank [VIDEO] @LindsayFrance https://t.co/Uu9ev2dBa1 — RT America (@RT_America) June 1, 2016 \\nWeld said Trump “conjured up enemies” from 11 million immigrants to America’s trading partners and that “his ideas of America’s enemies includes almost anyone who talks or looks different from him.” \\n“This is not the time to cast a jocular or feel-good vote for a man whom you may have briefly found entertaining. Donald Trump should not, cannot, and must not be elected President of the United States,” the Libertarian VP candidate concluded.'"}, "time": 1742563574.3894186}