{"duration": 0.0650489330291748, "input_args": {"text": "'The French aerospace giant Airbus recently unveiled its secret flying-car project dubbed Vahana — a single-manned, autonomously piloted aircraft that can take off and land vertically. Cue the Jetsons references! The concept drawing of Vahana should look familiar to anyone who follows the tiny-but-passionate flying car movement. The aircraft has eight rotors on two sets of wings, both of which tilt depending on whether the car’s flying vertically or horizontally. There’s room for a single passenger under a canopy that retracts like a visor. The aircraft will be deployed like a taxi, making it the air-taxi version of Uber, according to CNN Money . The project launched in early 2016 as one of the first pursuits of A³ (pronounced A-cubed), the Silicon Valley arm of Airbus, according to the startup’s CEO Rodin Lyasoff. Vahana is a Sanskrit word that refers to the vehicle or mount of a god, but Lyasoff says his feet are firmly rooted in reality when it comes to the project.\\n\\n“Beyond developing the vehicle itself,” Lyasoff wrote in a Medium post quietly published last month, “we’re seeking to move key technology categories forward, foster development of the regulatory regime for the certification and operation of automated aircraft, and to otherwise nurture an ecosystem that will help enable the vertical cities of the future.”\\nAirbus, which competes with the US-based Boeing, is best known for large jetliners like the double-decker A380. However, the flying car project shows that the French company is not above dabbling in some high-concept, and perhaps unrealistic, aviation ideas.\\nLyasoff says his team of engineers, designers, and robotics experts are aiming to fly a full-size prototype before the end of 2017, and to have a “productizable demonstrator” by 2020.\\nFlying cars have lurked in collective imaginations for decades, but the idea of personal, roadable aircraft took on renewed emphasis this summer when it was revealed that Google co-founder Larry Page was funding a pair of flying car startups, Kitty Hawk and Zee.Aero. Dozens of other companies are working on their own prototypes, though some probably don’t qualify as flying cars. Some are just tiny personal aircrafts, while others look like drones on steroids.\\nThere are many things about flying cars that make them impractical The fact that flying cars act as a stand-in for some distant, unattainable future isn’t a mistake. There are many things about flying cars that make them impractical, unworkable, and even wrongheaded. Airspace in North America and Europe is tightly regulated, making it extremely difficult for any company to gain permission for commercial flight, especially in dense urban environments. And the idea of autonomous aircraft would probably strike most passengers as a recipe for disaster.\\nLyasoff insists that pilotless flying cars are an attainable dream, if only because the rules governing the skies are bound to change in the future. Plus robot aircraft are cheaper to produce. “Full automation also enables us to make our aircraft as small and light as possible, and will significantly reduce manufacturing costs,” Lyasoff says.\\nAnd if something goes wrong, the Vahana will come equipped with “a ballistic parachute that works even at low altitudes.” Because what commute is complete without a little unexpected sky-diving thrown in the mix?\\nSource: The Verge \\nVia: Earth Mystery News \\n'"}, "time": 1742564399.520917}