{"duration": 0.08043694496154785, "input_args": {"text": "'The family of Terence Crutcher, an unarmed black man whose fatal confrontation with the Tulsa, Okla. police was recorded on video, said Tuesday that Mr. Crutcher had posed no threat and that his hands were in the air when he was shot. “We watch the video and it’s clear to see that Terence did not have a weapon in his hand,” a lawyer for the family, Damario   said at a news conference Tuesday. “It’s clear to see that Terence was not being belligerent. ” The shooting, the family and its lawyers said, was a clear case of excessive force. Mr. Crutcher, 40, was killed Friday evening on a Tulsa street by an officer identified as Betty Jo Shelby, a   veteran of the city’s Police Department. Officer Shelby, who is white, was responding to reports of a tan S. U. V. abandoned in the middle of the road  —   its motor running, the driver’s door open and the driver nowhere in sight. The family’s news conference came as the Tulsa police promised a thorough investigation and as a lawyer for Officer Shelby, Scott Wood, defended her actions. The case is the latest in a series of deaths across the country at the hands of the police that have raised questions about officers’ use of force, particularly against   men. Mr. Wood said Mr. Crutcher had behaved erratically and refused to comply with police commands. He said that Mr. Crutcher had been reaching through the vehicle’s window when he was shot, and that Officer Shelby believed he had a weapon. “She is extremely distraught over what has happened,” Mr. Wood said. “She has never used deadly force in her   career. She is a pretty seasoned officer and has worked in a lot of different areas. She is viewed by everyone as someone who is really squared away. ” The family’s lawyers, who include Benjamin L. Crump, who represented the relatives of Michael Brown, the unarmed black teenager who was killed in 2014 by a white police officer in Ferguson, Mo. challenged Mr. Wood’s account. Mr. Crump displayed photos at the news conference showing that the window of the S. U. V. had been rolled up. On Tuesday, the Tulsa police declined to comment on whether Mr. Crutcher had been reaching inside the car. “This investigation is ongoing, and the U. S. attorney and the district attorney has requested no additional information be released,” a police spokesman, Officer Leland Ashley, said. Protesters gathered in Tulsa on Monday and Tuesday, calling for an unbiased investigation. At a prayer vigil Tuesday afternoon, a pastor, Jeremiah Hale, called for prayers for the family. Adrian Colbert, who is   said the shooting occurred near his house, and he referred to the riots in the 1920s, in which white residents killed up to an estimated 300   in the city. “He had his hands up, and they popped him,” Mr. Colbert said. “But that’s something we’re used to. It goes back to 1921. What happens here usually gets swept under the rug. ” The Tulsa police have opened a criminal investigation into the shooting, and the Justice Department has started a civil rights inquiry. A police video of the shooting from a department helicopter shows Mr. Crutcher slowly walking away from Officer Shelby and toward his vehicle. Moments after Mr. Crutcher is seen reaching the driver’s side of the vehicle, one officer fired a Taser and Officer Shelby fired a single round, killing Mr. Crutcher. Videos from the police helicopter and dashboard cameras did not capture the shooting itself. The helicopter video appears to show that at least one of Mr. Crutcher’s hands was raised when he was shot. The police said Officer Shelby did not have any disciplinary actions against her that resulted in a suspension or loss of pay since she joined the department in 2011. Before that, she worked for the Tulsa County sheriff’s office. Deputy Justin Green, a spokesman for the sheriff’s office, said she joined the department in June 2007 and was a member of the agency’s dive team. Mr. Wood, the officer’s lawyer, said that when Officer Shelby arrived at the scene Friday, she found Mr. Crutcher walking nearby. He did not respond to her questions, Mr. Wood said, but instead “locks his eyes on her,” which the officer described as “a   stare. ” Mr. Wood said Officer Shelby was “a drug recognition expert,” who had received specialized training in 2014. Officer Shelby, the lawyer said, believed Mr. Crutcher was “under the influence of something. ” When Mr. Crutcher ignored the officer’s order to get on his knees, she drew her gun, the lawyer said. But Mr. Crutcher continued to keep his hands in the air. He was shot about 30 seconds after other officers arrived. On Tuesday, referring to reports that Mr. Crutcher had been using drugs, David Riggs, one of the Crutcher family’s lawyers, said: “We do not know if that’s true or not. We are looking into that. ” He added: “Let’s assume that it was. You have to ask yourself again, what is the proper way to handle a situation where someone is acting in a strange way and perhaps not entirely in control of his emotions or his mental state at that time? This is a textbook case of how not to treat someone in that condition. ” Mr. Crump said the Tulsa police needed sensitivity training, a reference to comments heard on the videos by two officers in a helicopter. One was Officer Shelby’s husband, David H. Shelby. The other officer in the helicopter, whom the department did not identify, can be heard saying, “Time for a Taser, I think,” as they watched the confrontation “I got a feeling that’s about to happen,” David Shelby said. “That looks like a bad dude, too,” the second officer said. Mr. Crutcher was shot moments later “They should not look at citizens like that,” Mr. Crump said of the officer’s comment. “Because if every big black man is going to be looked at as a criminal and taken down with lethal force, then our society is in a lot of trouble. ”'"}, "time": 1742564106.0074053}