{"duration": 0.043662309646606445, "input_args": {"text": "'in: General Health , Medical & Health , Preparedness\\\\Survival The topic of using expired prescription drugs comes up frequently in survival and preparedness circles. Although there are many articles detailing with the efficacy of outdated meds, one question I get over and over again is “what do I do when the meds run out?” Whereas there is no single clear answer, one thing we can all start to do now is hang on to our old, unused meds. For the most part and with very few exceptions, they will be viable for two to twelve years beyond their expiration date. The secret is to keep them in a cool, dark, location that is not too dissimilar from your food storage. In another exclusive article for Backdoor Survival, Dr. Joe Alton, a medical doctor who is well versed in survival medicine, is here today to give us an update on the use of expired drugs in a survival setting. In addition, for those of you that have asked, he is providing us with links you can use to initiate your own research on this important topic. Of course, as with anything preparedness related, let your own good judgement prevail. An Update on Expired Drugs in Survival Settings By Joe Alton, MD In normal times, replacing expired medicines isn’t a major issue. You call your physician and get a refill for “fresh” meds. Medicine bottle descriptions and those in print and online sources tell you to discard any drug that has gone expired, a recommendation so common that it’s considered standard. You might be surprised to know, however, that expiration dates have only been government-mandated since 1979. The expiration date is simply the last day that the pharmaceutical company will guarantee 100% potency of the product. In other words, you won’t grow a horn in the middle of your forehead or other ill effect if you take the drug the week after it expires. Indeed, it is rare for expired drugs, especially in pill or capsule form, to be any more risky than the non-expired versions. This is an important issue to those preparing medically for survival scenarios. If you believe that some disaster will take society to the brink, then you should also understand that such a scenario also means that it’s unlikely that pharmaceutical companies will be functioning to manufacture drugs. Therefore, at one point or another, a well-supplied survival medic will have to make a decision regarding the use of an expired medication. This is a decision that also must be made by government agencies such as FEMA and the Department of Defense. Federal warehouses store tens of millions of dollars’ worth of drugs meant for use in peacetime disasters. When these drugs expired, the forklifts came out and huge quantities of life-saving medicines were discarded. Over time, even the government began to think, “Wow. This is getting expensive. I wonder if these drugs are still good?”. And with that thought, the Shelf Life Extension Program (SLEP) was developed. The SLEP tested over a hundred drugs in their possession and found that the vast majority were 100% potent 2 to 12 years beyond their listed expiration dates. These findings led the government to put out extensions of expiration dates for certain drugs as needed, such as the 5 year extension given the anti-viral drug Tamiflu (oseltamivir) during the 2009 swine flu epidemic. These are referred to as “emergency use authorizations”. Despite this research, you’ll see opinions from those in academia or elsewhere that state all medications are dangerous when expired and should be discarded. These opinions are fine in normal times, but members of the preparedness community should at least consider holding on to medications that might no longer be available in times of trouble. Think about this situation: Let’s say that a true catastrophe has occurred that has taken out the grid and modern medical facilities for the foreseeable future. Your daughter is fading from a bacterial infection. You have an expired bottle of antibiotics. She’s dying. Are you going to use the expired drug or not. You decide. Medicines, expired or not, should be stored in cool, dry, dark conditions. Their potency will fade twice as fast if stored at 90 degrees than if stored at 50 degrees. Freezing them, however, is rarely necessary. Even if stored in suboptimal conditions, a capsule or tablet that hasn’t changed color, smell, or consistency is probably still worth keeping for austere settings. Of course, in normal times, seek out qualified medical professionals whenever and wherever they are available. Note: You may have read about kidney and liver toxicity in expired tetracycline products. The majority of these occurred before the formulation was changed some years ago. Having said that, Tetracycline is not on my list of top ten antibiotics to have in your medical storage. It is a first generation drug with reports of widespread resistance, and I would prefer you have doxycycline instead. It’s important to know that all drugs have side effects or restrictions in children, pregnant women, and patients with certain medical conditions. Take time to learn indications, dosage, and side effects of all medicines you keep in your medical supplies. For more information on the Shelf Life Extension Program, click the links below:'"}, "time": 1742628526.618501}