{"duration": 0.05872631072998047, "input_args": {"text": "'Share This \\nHillary Clinton’s campaign is struggling after receiving blow after blow recently, even though the mainstream media would have us believe otherwise. As if the WikiLeaks dumps and Project Veritas videos weren’t doing enough damage, private photos have begun circling the internet, and once you see them, it’s easy to understand why they are destroying Hillary’s presidential dreams. \\nUnlike other leaks and sting operations, the private photos cropping up all across social media impact all voters in a way they can’t deny. Contrary to what you may be thinking, the images aren’t Hillary’s private photographs, but rather, private snapshots her voters have taken that now have the   looking incredibly foolish. \\nNews was recently released that Obamacare premiums will soar in the coming year, just as many conservatives predicted and warned. The 2017 increase is reported to be an average of 25% for the most popular plans, as the “Affordable” Care Act continues to rely on older, sicker customers than its architects and backers had anticipated, IJR explains. However, it’s not just the Obamacare plans that are seeing a hike in premium costs. It seems to be happening to everyone, and many social media users took to Facebook to give a glimpse of the crippling damage being done to their finances. \\nWith a quick search of the social media site, I was able to find more than a handful of photos that upset Americans have posted, showing their premium increases for 2017, and in many cases, it was much more than the already dreaded 25%. Have a look at the prices Americans will be paying next year: \\nThis is what Hillary Clinton believes she can “fix.” My question is, how many families will be broke, bankrupt, or even homeless because of these crippling premiums before that ever happens if it ever happens? Maybe families who can’t afford it could just skip having health insurance — except that results in a financially devastating fine and, God forbid, should they need medical care, they are out of luck. \\nEven Hillary’s own husband, former President Bill Clinton, bashes Obamacare as a disaster while campaigning for his wife . While Bill was campaigning for Hillary in Goldsboro, North Carolina, on Tuesday, he listed all the problems with Obamacare. “One of the problems with a law, we can all tick them off, right?” Bill began. “ The copays, deductibles, and premiums are too high, and the drug prices are too high. So, what does she say we should do? We should bargain for lower drug prices, the way that government can’t now with Medicare and Medicaid for everybody.” Bill Clinton says Obamacare has a \"list\" of problems: \"The copays, deductibles, and premiums are too high.\" https://t.co/jyvhYS4zXr \\n— Republican Policy (@SenateRPC) October 26, 2016 \\nUnlike Bill, Hillary has not only defended but praised Obamacare , refusing to admit that it needs to be repealed. She’s even gone as far as to tout it as Hillycare . Obamacare — or Hillarycare, if she prefers — has been a disaster for millions of Americans as their premiums, deductibles, and copays all increase while less and less of their health care needs seem to be covered. \\nBut, don’t take my word for it. Before casting your vote on November 8 for someone calling Obamacare a “success,” I encourage you to check with your insurance company to see what your premiums, deductibles, and copays will be in 2017. Hillary has already warned us, “I’ve fought for quality, affordable healthcare my entire career. As president, I’ll defend the Affordable Care Act , build on its successes, and go even further to reduce costs.” The problems she’s ignoring is that it’s not affordable, it’s far from a success, and it hasn’t reduced costs. \\nThat statement alone should be enough to have the majority of Americans unwilling to cast a vote in her direction, and if they find out their premiums for 2017 before November 8, that’s going to ring even truer. So, the next time you hear a Hillary supporter excitedly ready to vote, tell them to make that one call. Find out what their insurance will look like under a Hillary presidency. As they say, money talks, bullshit walks. When her supporters find out how much Hillary will cost them, hopefully, they’ll walk too.'"}, "time": 1742563851.955843}