{"duration": 0.05014443397521973, "input_args": {"text": "'Physicians urging     health care say House Speaker Paul Ryan’s newly released proposal to repeal Obamacare does not actually repeal the Affordable Care Act (ACA) and, therefore, is “doomed for failure. ”[“Since this does not completely repeal the ACA, we are still left with thousands of pages of regulations that will have unknown consequences in the future,” Dr. Gerard Gianoli, of the   Ear and Balance Institute, tells Breitbart News. “The GOP plan is worse than a repeal with no replacement plan at all. ”  Gianoli explains: It will not prevent the death spiral of the insurance industry, which will be now blamed on Republicans, and the march toward a     system will continue. The GOP plan is doomed for failure. Instead of returning the insurance market to the vigor of a free market, the government will be supporting it with tax credits  —   the flip side of the ACA insurance penalty. Gianoli says the difference between Obama’s health insurance plan and Ryan’s proposal amounts to semantics: The difference is considering whether the bottle is half full or half empty. In other words, there really isn’t any difference. Further, the stipulation of preventing the insurance industry from   premiums from initial policy inception will lead to continued gaming of the system that will not be adequately adjusted by the “30% penalty” for interrupted coverage. Hopefully, this plan will not be passed. Dr. Jane Orient, executive director of the Association of American Physicians and Surgeons, also observes to Breitbart News that the new proposal  —   kept secret by Ryan until its release  —   “is 57 pages with a number of ‘repeal this’ and ‘repeal that’ clauses, but no ‘repeal ACA. ’” “So to paraphrase Nancy Pelosi, what is still in it?” Orient asks. “Was that the subject of secret meetings with special interests?” Orient continues: “Refundable” tax credits  —   for those who don’t owe taxes  —   are still a subsidy. It is still redistribution of wealth, with winners (those who get the subsidy) and losers (those who pay for it). And the chief winner is the “health plan. ” It gets money the supposed beneficiary may get nothing, or only rationed care from a narrow network. “The problem is comprehensive   payment,” Orient adds. “The bill perpetuates this disastrous concept. A true   bill  —   “there shall be a free market in health insurance”  —   would remove all federal mandates, subsidies, barriers to competition, or protections or advantages for cartels. ” Conservatives such as former House Freedom Caucus chairman Jim Jordan and Virginia Rep. Dave Brat also object to Ryan’s proposed Obamacare repeal plan, asserting it is still Obamacare in a different form. “The bill maintains many of the federal features including a new entitlement program as well as most of the insurance regulations,” Brat said. “Now [they] are saying we’re going to do repeal and replace but the bill does nothing of the sort. [Speaker] Paul Ryan has always said the entire rationale for this bill is to bend the cost curve down, and so far I have seen no evidence that this bill will bring the cost curve down. ”'"}, "time": 1742628325.4409413}