{"duration": 0.04618358612060547, "input_args": {"text": "'Email \\nOne week ago today, Don Kates (shown), a scholar with the Independent Institute in Oakland, California, passed away at the age of 75. He leaves a remarkable legacy of influence in the long war on guns, single-handedly igniting the renaissance of today’s pro-gun movement with his scholarly work. \\nDuring the iron age of gun control — the decade prior to the passage of the Brady Bill in 1994 during the Clinton administration — Kates’ voice was the only one heard that supported an individual’s right to keep and bear arms. So carefully crafted was his work that his article “Handgun and the Original Meaning of the Second Amendment” was published in 1983 by the Michigan Law Review . \\nAt the time, claims that the Second Amendment protected an individual right to keep and bear arms were considered heresy. But the ripple effect kicked in when Sanford Levinson, the Garwood chair in law at the University of Texas Law School, read it, studied it (along with its sources), and followed it with his own work, “The Embarrassing Second Amendment,” which was published shortly thereafter by the Y ale Law Journal . As C.D. Michel, a Second Amendment lawyer and author of the CalGunLaws.com blog, put it: [Levinson’s article] echoed Kates’ conclusions concerning the individual rights theory of the Second Amendment, but by appearing in one of the [nation’s] top law journals, it attracted the attention of everyone, and launched an avalanche of academic digging into the origins of the Second Amendment…. All the scholarship that Kates indirectly ignited eventually fueled legal briefs filed before the Supreme Court in District of Columbia v. Heller , the 2008 case that reaffirmed [the individual citizen’s] right to arms. \\nA prolific writer, Kates predated works by researchers such as John Lott whose first book, More Guns, Less Crime , appeared in 2000 based on work he did in 1997. For instance, Kates’ Restricting Handguns: The Liberal Skeptics Speak Out first appeared in 1979, followed by his Firearms and Violence: Issues of Public Policy , which was published in 1984. \\nHis recent works include Would Banning Firearms Reduce Murder and Suicide? A Review of International Evidence , published by the Social Science Resource Network in May 2006 and then republished a year later by the Harvard Journal of Law and Public Policy . \\nHis Heller, McDonald and Murder: Testing the More Guns, More Murder Thesis was first published by the Social Science Resource Network in April 2010 but then picked up and republished by Fordham University two years later. One of his last works before his death was Murder, Self-Defense, and the Right to Arms , which was published by the Connecticut Law Review in 2013. \\nThe eulogy written by C.D. Michel, a close friend and associate of Kates, expressed Kates’ impact on the long war against guns: The gun control movement lost their constitutional argument largely due to Kates’ initial work which, like many moments in history, started with one man telling the truth. \\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . \\nPlease review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742562252.7028477}