{"duration": 0.06154155731201172, "input_args": {"text": "'Russia’s Most Potent Weapon: “Hoarding Gold” 11/02/2016 \\nSHTFPLAN.COM \\nThis article was written by Jay Syrmopoulos and originally published at The Free Thought Project . \\nEditor’s Comment: He who holds the gold makes the rules? Fresh attempts at containing Russia and continuing the empire have been met with countermoves. Russia appears to be building strength in every way. Putin and his country have no intention of being under the American thumb, and are developing rapid resistance as the U.S. petrodollar loses its grip and China, Russia and the East shift into new currencies and shifting world order. \\nWhat lies ahead? It will be a strong hand for the countries that have the most significant backing in gold and hard assets; and China and Russia have positioned themselves very well. Prepare for a changing economic landscape, and one in which self-reliance might be all we have. \\nRussia is Hoarding Gold at an Alarming Rate — The Next World War Will Be Fought with Currencies \\nby Jay Syrmopoulos \\nWith all eyes on Russia’s unveiling their latest nuclear intercontinental ballistic missile (ICBM), which NATO has dubbed the “SATAN” missile , as tensions with the U.S. increase, Moscow’s most potent “weapon” may be something drastically different. \\nThe rapidly evolving geopolitical “weapon” brandished by Russia is an ever increasing stockpile of gold, as well as Russia’s native currency, the ruble. \\nTake a look at the symbol below, as it could soon come to change the entire hierarchy of the international order – potentially ushering in a complete international paradigm shift – and much sooner than you might think. \\nimage: http://thefreethoughtproject.com/wp-content/uploads/2016/10/bankofrussia-e1475520013798.png \\nThe symbol is the new designation of the Russian ruble, Russia’s national currency. \\nSimilar to how the U.S. uses the dollar sign ($), the U.K. uses the pound sign (£), and the European Union uses the euro symbol (€), Russia is about to begin exporting its symbol internationally. \\nAfter the failed “reset” in U.S./Russian relations by the Obama administration, and the continued deterioration of the countries relationship, Washington began targeting entire sectors of the Russian economy, as well as specific individuals, meant to impose an economic burden so severe that it would force Moscow into compliance. \\nInstead of decimating Russia, what it precipitated was a Russian response of gradually weaning themselves off of the hegemony of the U.S. petrodollar, and working with China to create an alternative to the SWIFT payment system that isn’t solely controlled by Western interests (see Asian Infrastructure Investment Bank , New Development Bank). \\nAccording to the Corbett Report : \\nNew reports indicate that China is ready to launch its SWIFT alternative, and for those who have their ear to the ground this is the most significant move yet in the unfolding process of de-dollarization that is seeing the BRICS-led “resistance bloc” breaking away from the financial stranglehold of the US-led “Washington Consensus.” \\nFor those who don’t know, SWIFT stands for the Society for Worldwide Interbank Financial Telecommunication and is shorthand for the SWIFTNet Network that is used by over 10,500 financial institutions in 215 countries and territories to transmit financial transaction data around the world. SWIFT does not do any of the clearing or processing for these transactions itself, but instead sends the payment orders that are then settled by correspondent banks of the member institutions. Still, given the system’s near universality in the financial system, it means that virtually every international transaction between banking institutions goes through the SWIFT network. \\nThis is why de-listing from the SWIFT network remains one of the primary financial weapons wielded by the US and its allies in their increasingly important financial warfare campaigns. \\nRecently, financial guru Jim Rickards, author of the book “Currency Wars,” wrote that “Russia is poised for a major comeback in its economy. Russian bonds and stocks and the Russian currency, the ruble, will all benefit.” Rickards believes a “strong turnaround” is coming within Russia, and that this comeback will benefit the ruble. \\nWhile still suffering from the economic warfare being waged by the U.S., Russia has realized that as long they are subservient to the petrodollar, there remains a clear and present danger of the Russian economy being devastated by the whims of Washington. \\nThe Bank of Russia, that nation’s central bank, is extremely clear about its mission, and monetary policy declaring on its website: \\nMonetary policy constitutes an integral part of the state policy and is aimed at enhancing well-being of Russian citizens. The Bank of Russia implements monetary policy in the framework of inflation-targeting regime, and sees price stability, albeit sustainably low inflation, as its priority. Given structural peculiarities of the Russian economy, the target is to reduce inflation to 4% by 2017 and maintain it within that range in the medium run. \\nIn layman’s terms, that means that monetary policy, similar to nuclear weapons and the military, are “an integral part of the state policy” in Russia. While many analysts have noted the increased build-up in Russia’s military arsenal, seemingly few have highlighted the massive build-up of Russian gold reserves over the past decade. \\nBelow is a chart showing Russian gold reserves between 1994 and last year, 2015: \\nSince 2006, there has been a year-on-year increase that reveals a significant upward trend. The chart clearly reveals that Russia’s state policy of increasing state monetary assets, in the form of gold. Additionally, the Russian government has been converting state rubles into gold assets. From 2006 to 2015, Russia’s state holdings of gold tripled. \\nWithin just the past year Russia has substantially increased its gold holdings \\nAccording to the Business Insider : \\nIn July of this year, the central bank of Russia added 200,000 ounces of gold to its reserves. The one-month uptick in Russian gold reserves — 200,000 ounces — is approximately equal to the entire annual output of Barrick Gold’s Turquoise Ridge gold mine in Nevada. \\nAt that same rate — 200,000 ounces per month — in a mere five months, Russia would add to state gold reserves the equivalent of the entire annual output of Barrick’s massive Goldstrike mine in Nevada. \\nCurrently, Russian gold reserves rank seventh in the world. It’s clear that there is a concerted effort by Russian authorities to build up the country’s gold reserves as part of a national strategy to negate the effects of economic warfare waged by the United States. \\nRickards, in his 2011 book “Currency Wars,” theorized that Russia and China could combine their gold reserves to form a global gold-backed currency to compete against the U.S. dollar. Currently, Russian reserves stand at roughly 1,500 tonnes, with Chinese reserves totaling over 1,800 tonnes (according to China — it’s likely more), which would amount to a combined total of roughly 3,300 tonnes of gold. \\nThe U.S. is about to lose overarching control of policymaking within the International Monetary Fund (IMF), thus the U.S. lockup on global gold is about to vanish, according to Business Insider. \\nImagine for a moment the distinctly real possibility that Russian-Chinese alliance could exercise indirect (or even direct) control over the IMF’s gold reserve of over 2,800 tonnes. Russian, Chinese and IMF gold combined would equal roughly 6,100 tonnes, and would allow for direct competition with the U.S. gold reserves, estimated at 8,100 tonnes. \\nRussia and China have realized that the petrodollar is wielded by Washington as it’s weapon of choice when opposing a well-armed state, and clearly see the writing on the wall – thus working together to create a new global financial paradigm. \\nThe reality is that the United States is $20 trillion dollars in debt, and eventually the time will come when the U.S. economy begins to implode — and all the fiat currency people are stuck holding will essentially be worth nothing more than the paper it’s printed on. Hard assets, such as gold and silver, should be bought and taken custody of while there is still an opportunity to do so, as a means of hedging against the potentially disastrous results of the U.S. using the petrodollar as a “weapon.” \\nUltimately, the United States, Russia and China are all controlled by centralized power-hungry tyrants attempting to command powerful global bureaucracies like the IMF, the World Bank, SWIFT, New Development Bank and the Asian Infrastructure Investment Bank. \\nIt’s not Russian nuclear weapons that people should fear, as the policy of mutually assured destruction essentially voids any benefit of a state launching a first-strike nuclear attack. The true threat to America is our economic house of cards, built upon the back of a neoliberal trade policy that puts the “rights” of corporations over that of people . \\nThis article was written by Jay Syrmopoulos and originally published at The Free Thought Project .'"}, "time": 1742628595.2130525}