{"duration": 0.044358253479003906, "input_args": {"text": "'Hillary Screwed by a Jew Weiner \\nAndrew Anglin Daily Stormer October 29, 2016 \\nSo the story is that the Jew Weiner was actually having Skype jerk-off sessions with a jailbait on the same laptop his wife uses for work, and after the Daily Mail did a report on this (which contains some really raunchy quotes, including “I would bust that tight pussy”), the FBI seized the computer. I’m not sure why the FBI is dealing with jailbait Skype camgirls, but I guess it’s because they were in different states. \\nOn that computer we have the documents which the FBI is now claiming are of some import to the Clinton email scandal. No one knows what the documents are, or why they are relevant, and officials who have made statements on it have been pretty cagey. One said that it had something to do with collusion between the State Department and the FBI. \\nThe thing here is, I don’t really see how there could be anything on the laptop that wasn’t already reviewed by the FBI. Unless I guess it’s some of those 33,000 that are missing (though I personally have a hard time believing they never recovered those). \\nSo the official story is that they found something on this laptop so damning that they had to immediately reopen the investigation. Something that couldn’t wait 11 days. \\nHowever, much more likely in my opinion is the “FBI revolt” theory. That theory would be that the FBI agents were freaking out about the miscarriage of justice, and in some way forced the hand of Comey. Because it seems to me that the guy already totally buried so much criminality, that there is no way, whatever it was, that he wouldn’t personally be willing to bury it. \\nOverall, details are very scarce at this present hour. \\nBut something is going to come out in the next couple of days. You can be certain of that. If the agents themselves pressured Comey into doing this, then they believe in justice, meaning they are on the TRUMP TRAIN. So one of them is probably waiting to leak it to the media himself – just at the right time. \\nBut get this: if Hillary goes down, Obama is going down with her. I can guarantee it. \\nIf Hillary goes down, the entire system comes down. \\nDonald Trump has blown the whole thing up. \\nThere is swamp juicy everywhere, and everyone is seeing just how sickening the whole thing is. \\nThe only thing left to do is drain it.'"}, "time": 1742561864.9231372}