{"duration": 0.25269150733947754, "input_args": {"text": "'MIAMI  —   Behind a locked door aboard Norwegian Cruise Line’s newest ship is a world most of the vessel’s 4, 200 passengers will never see. And that is exactly the point. In the Haven, as this ship within a ship is called, about 275 elite guests enjoy not only a concierge and   butler service, but also a private pool, sun deck and restaurant, creating an oasis free from the crowds elsewhere on the Norwegian Escape. If Haven passengers venture out of their aerie to see a show, a flash of their gold key card gets them the best seats in the house. When the ship returns to port, they disembark before everyone else. “It was always the intention to make the Haven somewhat obscure so it wasn’t in the face of the masses,” said Kevin Sheehan, Norwegian’s former chief executive, who helped design the Escape with the hope of attracting a richer clientele. “That segment of the population wants to be surrounded by people with similar characteristics. ” With disparities in wealth greater than at any time since the Gilded Age, the gap is widening between the highly affluent  —   who find themselves behind the velvet ropes of today’s economy  —   and everyone else. It represents a degree of economic and social stratification unseen in America since the days of Teddy Roosevelt, J. P. Morgan and the rigidly separated classes on the Titanic a century ago. What is different today, though, is that companies have become much more adept at identifying their top customers and knowing which psychological buttons to push. The goal is to create extravagance and exclusivity for the select few, even if it stirs up resentment elsewhere. In fact, research has shown, a little envy can be good for the bottom line. When   travelers switch planes in Atlanta, New York and other cities, Delta ferries them between terminals in a Porsche, what the airline calls a “   service. ” Last month, Walt Disney World began offering   access to visitors who want to avoid the crowds. In other words, you basically get the Magic Kingdom to yourself. When Royal Caribbean ships call at Labadee, the cruise line’s private resort in Haiti, elite guests get their own special beach club away from fellow travelers  —   an enclave within an enclave. “We are living much more cloistered lives in terms of class,” said Thomas Sander, who directs a project on civic engagement at the Kennedy School at Harvard. “We are doing a much worse job of living out the egalitarian dream that has been our hallmark. ” Emmanuel Saez, a professor of economics at the University of California, Berkeley, estimates that the top 1 percent of American households now controls 42 percent of the nation’s wealth, up from less than 30 percent two decades ago. The top 0. 1 percent accounts for 22 percent, nearly double the 1995 proportion. But even as income inequality and the wealth gap stoke the discontent that has emerged as a powerful force in this year’s presidential election, for American business it represents something else entirely. From cruise ship operators and casinos to amusement parks and airlines, the rise of the 1 percent spells opportunity and profit. Today, ever greater resources are being invested in winning market share at the very top of the pyramid, sometimes at the cost of diminished service for the rest of the public. While   incomes are stagnating, the period since the end of the Great Recession has been a boom time for the very rich and the businesses that cater to them. From 2010 to 2014, the number of American households with at least $1 million in financial assets jumped by nearly   to just under seven million, according to a study by the Boston Consulting Group. For the $1   cohort, estimated wealth grew by 7. 2 percent annually from 2010 to 2014, eight times the pace of gains for families with less than $1 million. “You go where the money is,” said Steven Fazzari, a professor of economics at Washington University in St. Louis. “This is where companies are innovating and where there is demand. ” In many ways, the rise of the velvet rope reverses the great democratization of travel and leisure, and other elements of American life, in the   War II era. As the Jet Set gave way to budget airlines, in places like airports and theme parks even the wealthiest often rubbed shoulders with hoi polloi. These days, whether the provider is a private company or a public agency, special treatment for the very rich isn’t personal, it’s business. Late last year, public officials in Los Angeles agreed to lease a separate facility at LAX to a private firm that would serve celebrities or anyone else willing to pay $1, 800 to skip the traffic jams and lines at the main terminals. Of course, it could be more extreme, and in the past it was. The Titanic, in the early 20th century, separated the different classes of travelers with metal gates. In the 19th century, French railways refrained from putting roofs on   wagons so that passengers who could afford more expensive   seats would not hesitate to spend a few extra francs. What is new is just how far big American companies are now willing to go to pamper the biggest spenders. For example, as   guests boarded Norwegian’s Breakaway ship in New York recently, cramming into a handful of elevators, there was ample room in one bank. But it was   to anyone but Haven guests going to the top decks. Not far away, in the ship’s theater, red velvet ropes cordoned off a section up front for Haven passengers. At SeaWorld, a family of four can jump to the front of the line and score the best seats for rides and shows for an extra $80, in addition to the basic $320 admission. For people in the market for something more exclusive, there is Discovery Cove, next door to SeaWorld’s traditional park in Orlando. Forget merely swimming with the dolphins. Today, parents can relax at a cabana and beach of their own, while their budding marine biologists spend the day with a trainer, feed the park’s birds, otters, nurse sharks and other creatures and, of course, frolic with the dolphins as well. There are no lines to cut here: Daily attendance is capped at 1, 300. A day at Discovery Cove can easily cost $1, 000 for a family of four. Next year, Crystal Cruises will begin an airborne version of one of its luxury ships: a customized Boeing 777 that ferries passengers on   or   trips around the world. In theory, according to Steve Tadelis, a professor of economics at the Haas School of Business at Berkeley, “when an industry is able to create a richer line of products for people looking to spend their money, that makes everybody happier. But getting it right in reality is very, very hard. ” As companies separate their clientele, a debate has developed over just how obvious the distinctions should be. Some experts, like David Clarke, who works with leisure industry giants as a principal at PricewaterhouseCoopers, say that it is best to be open about what amounts to a   caste system. “It’s about transparency,” he said. “What customers hate is when you’re trying to hide stuff and are not being honest with them. ” Many companies, though, have discovered that offering ordinary customers just a whiff of the rarefied air can actually enhance the bottom line, even if it stirs a certain amount of envy and resentment. As coach passengers pile into giant 747s and A380s, for example, “a glimpse of a shower or private suite creates a marker in people’s minds,” said Alex Dichter, a director at McKinsey who works with major airlines. “A lot of brands use products like these as an aspirational tool, and class segregation can create something to which people can aspire. ” While choices for the rich are expanding, poorer Americans are benefiting less from product innovation, according to new research by Xavier Jaravel, a graduate student in economics at Harvard. Whether they are selling fancy cookware, natural cheeses or single malt Scotch, purveyors of goods aimed at the wealthy are competing more and offering new products. Downscale items like canned meat or tobacco aren’t drawing as many new entrants into the market. There is also increasing demand from the most affluent shoppers. Spending by the top 5 percent of earners rose nearly 35 percent from 2003 to 2012 after adjusting for inflation, according to a study by Mr. Fazzari and Barry Z. Cynamon of the Federal Reserve Bank of St. Louis. For everyone else, spending grew less than 10 percent. And with the rise of the Internet and big data, companies can pinpoint and favor these wealthiest customers in ways unimaginable even a decade ago. “At the high end, we can get into real psychographics and know who spends more time at the concierge or goes skiing in February,” said Bjorn Hanson, who teaches courses on tourism and hospitality management at New York University. For companies trying to entice moneyed customers, that means identifying and anticipating what they want. “The premium customer doesn’t want to be asked questions,” said Mr. Clarke of PricewaterhouseCoopers. “They don’t want friction. They want things to happen through osmosis. ” But for people at the lower end of the market, as well as in the middle, plenty of friction remains. The   is that the amount of hassle is precisely calibrated to just how much you are willing to pay. “At the low end, people’s expectations have fundamentally changed,” Mr. Clarke said. “Because it’s a fraction of the cost, people say, ‘I’m willing to take some discomfort because my wallet is staying full. ’” Executives describe the virtues of elite segmentation with a directness that might well serve as fodder for supporters of Occupy Wall Street or Senator Bernie Sanders. At its debut in 2006, the Haven was swamped by tourists from regular quarters who paid $200 to upgrade to one of its 40 or so rooms, Mr. Sheehan recalled. So he ordered an immediate halt to the upgrades, which undercut profit margins and undermined the Haven’s main selling point, exclusivity. “We needed to fill the Haven by getting the right people on the ship,” said Mr. Sheehan, who stepped down as chief executive last year. “When the masses overwhelmed the group in the Haven, they didn’t have the experience they were looking for. ” Mr. Sheehan’s focus on wealthier travelers proved prescient. Norwegian’s stock has surged. And as the company designed new vessels in recent years, the Haven became more defined  —   with its own pool, lounge, bar and restaurant  —   and more isolated from the rest of the ship. With the launch of the   Epic in 2010, “a guest could enter the key card for access, and never leave,” said Andy Stuart, Norwegian’s president. And by last year, when the even newer Escape sailed on its maiden voyage, the Haven’s 95 staterooms were located so high up in the forward part of the ship that even guests in comparatively expensive staterooms might remain unaware of its existence. Depending on the season, a room in the Haven might cost a couple $10, 000 for a weeklong cruise vs. $3, 000 for an ordinary stateroom elsewhere on the ship. While the Haven is hidden, or at least camouflaged, on Norwegian’s cruise ships, its archrival Royal Caribbean, by contrast, makes no secret of what is available to passengers who pay the most. Its Royal Suite class isn’t a ship within a ship, but it serves much the same function with one significant difference: Regular passengers can push their noses up against the glass, literally. On Royal Caribbean’s new ship Anthem, diners must first walk past the frosted glass windows of Coastal Kitchen, reserved for suite occupants, before they can crowd around the buffet tables of the    Windjammer Café. There are no chafing dishes in sight at the Coastal Kitchen, where the order of the day is white table cloths and   service. The atmosphere is as calm and leisurely as Windjammer is hectic, although suite guests are free to dine at the latter if they like. Royal Caribbean’s business approach contrasts strikingly with Norwegian’s. While Norwegian executives decided to mostly hide the Haven from view, Royal Caribbean went with transparency. “It’s the American way,” said Michael Bayley, president of Royal Caribbean. “I think society is prepared to accept that if you pay more for certain elements, then you deserve them. ” Mr. Bayley and Royal Caribbean’s chairman, Richard Fain, say they ultimately decided against the     concept after studying the Haven. “That’s not the mojo or the culture of Royal Caribbean,” Mr. Bayley said. “The idea of segregating people into a class system is  . But if you live on Central Park, you are going to pay more. That’s how the system works. ” As has been the case elsewhere in the leisure industry in recent years, Royal Caribbean has become more comfortable with heightening the contrast between the treatment meted out to ordinary passengers and the level of service reserved for the top tier. Royal Caribbean has always considered the psychology of its guests when it designs new ships or introduces new amenities, said Adam Goldstein, the company’s chief operating officer, but there has been a shift in passenger expectations in recent years. “For a long time there was an acceptance that outside the door of your room, you were on an equal footing,” he said. “We didn’t attempt to have any differentiation in how services were delivered. ” Since the late 1990s, however, “there has been a huge evolution, maybe a revolution in attitudes,” Mr. Goldstein said. In addition to larger rooms or softer sheets, big spenders want to be coddled nowadays. “They are looking for constant validation that they are a   customer,” he said. For example, room service requests from Royal Suite occupants are automatically routed to a number different from the one used by regular passengers, who get slower, less personalized service. With a week in a top Royal Suite costing upward of $30, 000, compared with $4, 000 for an ordinary cabin, the focus is on “very affluent travelers, and we have no trouble filling these rooms,” Mr. Bayley said. In May, the company will roll out its Royal Genie program  —   essentially a personal servant for the highest spenders on board. Royal Genies will research their guests’ preferences even before they come aboard and come up with surprises like   drinks with their favorite vodka or Scotch. Even though this kind of pampering might be good for business, and delight those on the right side of the velvet rope, the gap between the privileged and the rest may ultimately leave everyone feeling uneasy, said Barry J. Nalebuff, a professor of management at Yale. “If I’m in the back of the plane, I want to hiss at the people in first class,” said Mr. Nalebuff, who has advised many Fortune 100 companies. “If I’m up front, I cringe as people walk by. ”'"}, "time": 1742564332.1224275}