{"duration": 0.047527313232421875, "input_args": {"text": "'Posted on November 1, 2016 by Dr. Eowyn | 2 Comments \\nFor Hillary Clinton and her accomplice and protector, the Obama administration, Russia is the new, all-purpose bogeyman. \\nThey say the Russian government is the hacker of those revealing and embarrassing DNC, Hillary and Podesta emails that WikiLeaks has been releasing. \\nHillary even accused Donald Trump of being in cahoots with Moscow. The latest accuser is longtime Democratic strategist James Carville. \\nAs reported by Edund Kozak for PoliZette , in an appearance on MSNBC yesterday, Oct. 31, 2016, Carville attacked the FBI for reopening its criminal investigation into Hillary Clinton’s emails, calling it part of a vast conspiracy to subvert American democracy. (See “ Weinered: FBI reopens investigation into Hillary Clinton’s emails ”) \\nCarville raged: \\n“This is in effect an attempt to hijack an election. It’s unprecedented … the House Republicans and the KGB are trying to influence our democracy! [FBI Director James] Comey was acting in concert and coordination with the House Republicans. We also have the extraordinary case of the KGB being involved in this race and selectively leaking things from the Clinton campaign that they hacked.” \\nAs noted by Kozak, “Apparently the fact that the Soviet security agency [KGB] was disbanded in 1991 does not preclude its involvement in this vast, anti-Clinton, FBI-organized conspiracy.” \\nNow, the New York Times reports (via ZeroHedge ) that in an investigation into Russia’s possible involvement in the 2016 presidential election, the FBI concludes that there’s no evidence that Trump is connected with the Russian government: \\n“For much of the summer, the F.B.I. pursued a widening investigation into a Russian role in the American presidential campaign. Agents scrutinized advisers close to Donald J. Trump, looked for financial connections with Russian financial figures, searched for those involved in hacking the computers of Democrats, and even chased a lead — which they ultimately came to doubt — about a possible secret channel of email communication from the Trump Organization to a Russian bank. \\nLaw enforcement officials say that none of the investigations so far have found any link between Mr. Trump and the Russian government. And even the hacking into Democratic emails, F.B.I. and intelligence officials now believe, was aimed at disrupting the presidential election rather than electing Mr. Trump.” \\nHey, James Carville, you conniving POS. This message is for you! \\n~Eowyn'"}, "time": 1742562122.597874}