{"duration": 0.06531381607055664, "input_args": {"text": "'On Thursday Oct. 27, 2016, a Bloomberg Businessweek report was published with the aid of an anonymous, accredited source from Donald Trump’s campaign. This informant announced a three-part voter suppression plan to intimidate Americans to win the election. The GOP presidential nominee felt Hillary Clinton could not win with out the votes of African-Americans, radical white liberals, or women. According to a recent poll, on Wednesday Nov. 2, Clinton was leading Trump by either a little or a lot in most states.\\nThe report in BusinessWeek was initiated by several weeks of a Trump tirade inquiring about the honesty of the U.S. election process. Ranting that the system was rigged against him.\\nAn official source inside the Trump campaign, announced there were three large-scale voter suppression plans. Each was aimed at one of three select groups. They believed Clinton could not win without support from these groups.\\nVoter intimidation is used to describe an action or actions taken by a person or group, directed at eligible voters to keep them from voting. This is usually done by putting up signs with false dates or passing out phony fliers to mislead citizens.\\nHowever, the BusinessWeek article described a plan that was designed to discourage people from casting their ballot for Clinton. The Trump campaign planned on reminding black voters of a comment made by the Democratic presidential nominee, in 1994, while Bill Clinton was promoting a crime bill for the metropolitan areas. It was then, she referred to certain African-Americans as “Superpreditors.”\\nTrump repetedly asked his supporters to go out with everyone they know, and watch the voting booths for signs of it being rigged against him. This begs two questions; Was this to intimidate Clinton Voters? and Was it legal to watch people so closely attempting to do their patriotic duty?\\nWhen Trump told everyone at a rally, in Pennsylvania, he could not lose because of “you know what I mean,” he stepped onto an awkward line that leaned dangerously toward illegal. According to an expert on election law, Rick Hansen, having a group of people organized at polling stations, watching people, and causing them to feel distressed could cross that line into illegal voter intimidation.\\nA good example of this would be Roger Stone, who is Trump’s former advisor, who planned to have over a thousand volunteers, in several major cities in swing states that usually vote Democrat, set up monitoring stations at polling booths. How the volunteers watched people would determine if their voter intimidation tactics were illegal.\\nThere are four federal laws, along with each state’s individual laws, on voter intimidation. The federal rules are as follows; no one is allowed to make any abusive remarks at the balloters, or have any direct confrontation with them, there cannot be any raising of voices or casting insults at people entering the station to do their civic duty. These laws are the line a Republican clerk once crossed and was suspended from duty for this violation. Intimidating people to influence the outcome of an event or situation can easily backfire and end with severe consequences.\\nBy Katherine Miller\\nEdited by Jeanette Smith\\nSources:\\nThe NY Times : Donald Trump campaign seeks ‘voter suppression’ sources says, but it’s legal\\nCNN : Donald Trump spokesman denies voter suppression claim\\nTime.com : Why Donald Trump Ballot Watchers ‘Might Be’ Illegal\\nTop and Feature Image Courtesy of Stephan Melkisethian’s Flickr Page – Creative Commons License vote'"}, "time": 1742563811.9353967}