{"duration": 0.15940117835998535, "input_args": {"text": "'The readers of Elena Ferrante are devoted  —   and fiercely protective  —   of that anonymous Italian author. That much was clear from the swift and unforgiving backlash after an investigative journalist used financial documents to suggest in an article  published on Sunday that Anita Raja, an Italian translator, was behind Ms. Ferrante’s books. Many readers saw the story  —   which appeared simultaneously on the website of The New York Review of Books and in an Italian, a German and a French publication  —   not only as a violation of privacy but as an unprovoked aggression against an author known for female protagonists who use radical   to exert power over their lives and fates. In his article, Claudio Gatti, a reporter for Il Sole 24 Ore, an Italian financial daily, did not definitively name Ms. Raja as Ms. Ferrante, but he described financial records indicating that payments from Ms. Ferrante’s publishing house, Edizioni   to Ms. Raja, a consultant there, had risen dramatically since 2014, when Ms. Ferrante’s four Neapolitan novels became an international publishing phenomenon. His report drew broad condemnation in the literary world, with writers for The New Yorker, The New Republic, The Times Literary Supplement and elsewhere questioning whether an intriguing literary mystery needed to be resolved through tough investigative journalism techniques. “You do an investigation into property for tax evaders, not for those who want to preserve their anonymity,” the Italian novelist Erri De Luca wrote in an email. “It’s a serious violation of the right to privacy. I’m sorry for Anita Raja, who will now be forced into celebrity. ” Running through the conversation was the notion that Mr. Gatti’s exposé was a sexist violation  —   yet another example, critics said, at a moment of intense debate over gender inequality, of how successful women find themselves bullied and demeaned by men. “People really went there very quickly,” Elaine Showalter, a retired professor at Princeton University and the author of numerous works of feminist criticism, said of the charge of sexism against Mr. Gatti. “Here’s a woman who is not only extremely successful but explores women’s lives in a way that doesn’t depict men very favorably,” Ms. Showalter continued. People may be seeing Mr. Gatti’s unmasking of the author, she added, “as a kind of revenge. ” Mr. Gatti said in an interview that he did not understand the strong reactions. “I wasn’t going after a woman, I was going after a mystery,” he said. “I would like to ask the people who didn’t want to know, ‘Explain what work of art in the history of art has been ruined or damaged by knowing who the artist is?’ I can name many, many cases where the art is enhanced. ” Hugh Eakin, editor of The New York Review’s blog, which published the   version of Mr. Gatti’s report, said the occasion for the piece was the forthcoming   release of an expanded version of a book of Ms. Ferrante’s nonfiction writings, in which the author says she grew up in Naples as the daughter of a seamstress. “Now that an expanded version is about to be published in English, it seemed there was a legitimate occasion to inquire about the relation between the book and its author,” Mr. Eakin wrote. Ms. Raja was born in Naples, but grew up in Rome, the daughter of an Italian father and, as Mr. Gatti said in a deeply reported sidebar, a Polish Jewish mother who fled Nazi Germany for Italy. Ms. Raja’s husband, the novelist Domenico Starnone, has said in interviews that he grew up in Naples and that his mother was a seamstress. He has spent years saying that he is not Ms. Ferrante. Ms. Raja has also denied authorship of Ms. Ferrante’s books. Mr. Eakin added of Mr. Gatti’s reporting, “Though it amasses considerable evidence it’s also worth noting the article does not make a conclusive statement. ” (Mr. Gatti had approached The New York Times several weeks ago about possibly publishing his research, but the newspaper decided not to pursue the arrangement, which would have involved coordinating with multiple journalistic partners.) Over the years, there have been other attempts to unmask authors, such as Joe Klein, who wrote “Primary Colors,” a roman à clef about Bill Clinton’s 1992 campaign, or Anne Desclos, who used a pseudonym when she wrote the 1954 erotic classic “The Story of O. ” But the effort to unveil Ms. Ferrante seemed to hit a deeper chord, perhaps because she has said in interviews that anonymity was crucial to her writing process. And it seemed to reveal a clash of sensibilities  —   between the journalistic and the literary, between those who believe anyone who publishes is fair game and those who believe some secrets should be kept. In short, a clash between the world of   reporting and the emotional truths of fiction. The publication in four languages simultaneously was “very aggressive  —   more appropriate to the capture of a criminal,” the novelist Alexander Chee wrote in an email. “She seems to have offended him by keeping herself private  —   it’s like the literary version of ‘How to Talk to a Woman Wearing Headphones,’” he added, referring to recent controversy over a blog post. Even some readers who admit they were curious to know say that they somehow didn’t want Ms. Ferrante’s identity to be made public. The editor of The Times Literary Supplement, Stig Abell, wrote a piece called “Why the TLS Would Not Have Named Elena Ferrante,” citing the author’s right to privacy. Salman Rushdie took to Facebook. “I am Elena Ferrante,” he wrote. “In the spirit of ‘I am Spartacus,’ in the wake of the New York Review of Books’ tawdry ‘exposé’ of her identity, every writer in the world should do this now. ” Not all writers shared that position. The critic Marco Roth said that Mr. Gatti’s reporting was valuable, even inevitable. “Conditions change for all writers once they’ve been published and it’s naïve to assume that Ferrante’s pseudonymity (had it been protected) would have allowed her to flower forever in the brilliant vein of ‘My Brilliant Friend,’” Mr. Roth wrote on Facebook, referring to the first of Ms. Ferrante’s Neapolitan novels. “Anita Raja will now have to work this new twist in her life into the next stage of her work, whatever that may be. No writer can control or really has the right to control the conditions of her reception,” Mr. Roth added. Some writers invoked the rhetoric of sexual assault in condemning Mr. Gatti’s approach. Alexandra Schwartz, on the website of The New Yorker, blasted Mr. Gatti’s justifications for his unmasking  —   that Ms. Ferrante is a public figure and the public who buys her books has a right to know. “Certainly Gatti does not explain why he feels so free to interpret Ferrante’s ‘no’ as his ‘yes,’” Ms. Schwartz wrote. Some critics speculated on why readers were so protective of Ms. Ferrante’s anonymity. “By protecting her privacy, she protected ours,” the critic Dayna Tortorici wrote in a post on N+1. “More than Ferrante herself, her readers have benefited from her choice. ” “We are as invested in her anonymity  —   and her autonomy  —   as she is,” she added. “It is a compact: she won’t tell us, we won’t ask, and she won’t change her mind and tell us anyway. In exchange, she’ll write books and we’ll read them. ” Ann Goldstein, who translated Ms. Ferrante’s novels into English, said in an interview that she hoped the latest revelations, however inconclusive, would not change how readers approached Ms. Ferrante’s books. “I think people will read them the same way they’ve always read them,” she said. “I don’t know how important the author is. I’d take her position the books are in the world. They are what they are. ”'"}, "time": 1742564561.1816883}