{"duration": 0.047353267669677734, "input_args": {"text": "'Look! Up on the screen! It’s a mystery! It’s a sitcom! Oh, and it’s a superhero show! As the   titans Marvel and DC, having already colonized movie theaters, take over ever larger chunks of television and streaming video, they’ve wisely started to mix things up. A new series set in one of their superhero universes just might be capeless, or bring in costumed crime fighters as window dressing. Marvel’s “Jessica Jones” on Netflix largely takes the form of a noirish mystery, while its “Legion” on FX (beginning next week) looks like a surrealist psychological thriller. “Powers” on the PlayStation Network is essentially “Law  Order: Superhumans. ” Perhaps the least superheroish superhero show, though, is NBC’s new “Powerless” (beginning Thursday). It’s a comedy, for one thing, part of a small tradition that includes “The Tick” and the campy,   1960s “Batman. ” (A promo for the show is narrated by that   Batman, Adam West.) And it’s set in a particularly nonheroic corner of the DC universe: the drab offices of Wayne Security, where a cousin of Batman oversees a motley crew designing products that keep civilians from becoming collateral damage in superhero battles. It’s a nifty, layered premise. For one thing, it’s a dig at the big, soulless tentpole movies in which teams of heroes lay waste to cities full of screaming little humans, particularly the “Avengers” films from DC’s rival, Marvel. Seen from another angle  —   as a traditional workplace sitcom  —   the       angle works just as well. What office doesn’t make people feel powerless? It’s hard to judge how that premise will be developed, though, because NBC made only one episode available for review. (The pilot was originally commissioned in 2015, and since then the show’s creator, Ben Queen, has left.) It’s quirky and pleasant but not terribly funny, and the comic situations are standard office sitcom: The new supervisor is hazed the disgruntled workers sort out into nice, mean and wacky stereotypes the boss spends all his time trying to get his cousin Bruce on the phone. Vanessa Hudgens (“Spring Breakers”) stars as the company’s relentlessly perky new head of RD, but if the show succeeds it will be because of an ensemble that includes distinctive performers like Alan Tudyk as the feckless Van Wayne and Danny Pudi, Ron Funches and Christina Kirk as the cranky workers waiting to be whipped into shape. In the pilot, costumed heroes appear only in the amusing credits sequence and in an opening on an elevated train that plays like an  ’    scene from a Hollywood musical. Add a few songs, and it could be from “Meet Me in St. Louis,” except for the supervillain tearing up the train tracks and the superhero  —   an actual DC character, Crimson Fox  —   who saves the day. It’s clever and invigorating, and about the only thing in the pilot that actually makes the connection between office workers and superheroes. “Powerless” is a cute idea for a show, but it will need a lot more scenes like that to turn into a worthwhile series.'"}, "time": 1742562332.6206708}