{"duration": 0.05569601058959961, "input_args": {"text": "'Comments \\nThe Democratic fury at FBI Director James Comey’s frustratingly decision to throw a wrench into election with his obviously partisan decision to reignite the “email” non-scandal keeps growing by the day. \\nIt’s becoming clear that Republican Congressmen, horrified at the way their candidate slides lower and lower in the polls, put undue pressure on Comey to give them an official, public, and entirely unnecessary “update” on the new emails that are – let’s reiterate – not to or from Hillary Clinton, are not related to her private email server, and were found on a cellphone belonging to Anthony Wiener, as part of a separate investigation into his illicit sexually-charged chats with a minor. \\nIn light of that, the Democratic Coalition Against Trump has filed an ethics complaint against Rep. Jason Chaffetz (R-UT) with the Office of Congressional Ethics: \\n“Representative Chaffetz, in an ill-planned partisan attempt, released information that compromised the integrity of the FBI, when he irresponsibly tweeted out that the case investigating Secretary Clinton’s emails had been reopened, when in fact it had not been. \\nMembers of Congress are elected to make our country a safer, better place- not to use their power to work with leaders such as Comey in a partisan fashion. I hope that both are held accountable for their actions.” \\nThe complaint refers to this extremely misleading tweet, which fundamentally misrepresents what actually occurred. FBI Dir just informed me, “The FBI has learned of the existence of emails that appear to be pertinent to the investigation.” Case reopened \\n— Jason Chaffetz (@jasoninthehouse) October 28, 2016 \\nJason Chaffetz and the rest of the self-appointed inquisitors on the House Oversight Committee have wasted millions of dollars in taxpayer funds and Congressional time prosecuting fruitless investigations against the character of Democratic nominee Hillary Clinton. It’s high time we held them all accountable for abusing their power for undemocratic hit-jobs against their political opponents.'"}, "time": 1742562754.1405644}