{"duration": 0.08200478553771973, "input_args": {"text": "'WASHINGTON  —   In the seventh hour of questioning this week  —   after a practiced bit from “The Hitchhiker’s Guide to the Galaxy” but before the meditation on   horses  —   the Supreme Court confirmation hearing of Judge Neil M. Gorsuch veered, somehow, to the matter of mutton busting. Senator Ted Cruz, Republican of Texas, wanted to hear about the Denver rodeo. And Judge Gorsuch, elusive all week as Democrats have strained to pinpoint his judicial leanings, turned instantly expansive. “Mutton busting, as you know, comes sort of like bronco busting for adults,” he began on Tuesday. “You take a poor little kid, you find a sheep and you attach the one to the other and see how long they can hold on. ” He went on. “  …    You know, it usually works fine when the sheep has got a lot of wool and you tell them to hold on  —   I tell my kids hold on   you know? Really get in there, right? Get around it  …    ” The Democrats stared blankly. “  …    Because if you sit upright, you go flying right off, right? So, you want to get in. But the problem when you get in is that you’re so locked in that you don’t want to let go, right? And so, then the poor clown has to come and knock you off the sheep. ” Judge Gorsuch smiled. “We can talk mutton busting all day,” he said. They may as well have. As Judge Gorsuch glided through the third day of his hearings on Wednesday, suffering few slips and answering no question he did not wish to, Senate Republicans were eager to assist. There is a rich tradition of Republicans and Democrats making life easier on their preferred nominees, tossing congressional pool noodles to a judge who might flounder, at least somewhat, under questioning from the other party. But this year, Republicans have elevated the practice to high art  —   supplying extra cushioning for a nominee who does not appear to need it and adding a measure of   levity to a process that virtually all inside the Capitol agree will end with a confirmation. On matters fraught and frivolous, Senate allies have coaxed Judge Gorsuch to the safest of verbal    eager to defuse Democratic lines of attack with whimsy and digressions. “Do you think your writings reflect a   attitude against   regulations?” Senator Orrin Hatch of Utah asked on Wednesday. “No, Senator,” the judge said. “I don’t either. ” In other moments, they have urged Judge Gorsuch to remind the public that no one, even the president, is above the law, or to make clear that his rulings in workers’ rights cases  —   an area of concern for Democrats  —   were rendered only in service of the law. More memorable were the flourishes that strayed far from judicial doctrine: “Would you tell me where your favorite fishing stream is?” “Is it true that you have been endorsed by John Elway?” “Jury duty. Have you ever been called up?” That question, from Senator Jeff Flake of Arizona, earned an audible laugh from Senator Al Franken, Democrat of Minnesota. “No, I just thought it was very odd questions for this, but it’s great,” Mr. Franken said, as eyes turned his way. “I’m sorry I laughed. I just  —   it caught me. ” Moments later, after Judge Gorsuch’s answer (he has served) Mr. Franken chimed in again. “That was a great question,” he said flatly. “Thanks, Al,” Mr. Flake said. “Appreciate it. ” Yet it was Mr. Flake’s earlier curiosity  —   sparked by his teenage son, he said, and a   internet meme  —   that attracted more attention: Would Judge Gorsuch rather fight “100   horses or one   duck?” Judge Gorsuch took no position on Horse v. Duck, demonstrating his unflinching commitment to avoiding declarative statements about matters that could one day come before the court. But he did not hesitate during another exchange, with Mr. Cruz, who seemed to revel in inside jokes and winking asides during his allotted 30 minutes of questioning. “What is the answer to the ultimate question of life, the universe and everything?” Mr. Cruz asked at the top of his allotted time. “” Judge Gorsuch said. (The pair explained at some length that this was a reference from “The Hitchhiker’s Guide to the Galaxy. ”) Mr. Cruz later asked about the jump shot of Justice Byron R. White, Judge Gorsuch’s legal mentor, a former football star who was also known to swing elbows on the basketball court. Then there was the rodeo. “As a Texan,” Mr. Cruz said, gazing admiringly at Judge Gorsuch for much of his testimony, “I think everyone’s life can be rendered richer by going to the rodeo. ” Mr. Franken, the next lawmaker up after the nominee’s explanation of mutton busting, wondered aloud about animal abuse laws in Colorado. But most Democrats seemed to accept their colleagues’ gambit during the proceedings, at least grudgingly. Beginning his second round of questioning on Wednesday, Senator Richard J. Durbin, Democrat of Illinois, summarized what the Judiciary Committee had learned from Republicans’ questions so far: “We know your love of   and rodeos and family. ” “I know that senatorial assignment,” he added. “I’ve been there myself. ”'"}, "time": 1742563561.883828}