{"duration": 0.05286693572998047, "input_args": {"text": "\"Behind the headlines - conspiracies, cover-ups, ancient mysteries and more. Real news and perspectives that you won't find in the mainstream media. Browse: Home / Six Million Jews 1915-1938 Essential Reading US ‘backed plan to launch chemical weapon attack on Syria, blame it on Assad govt': Report By wmw_admin on June 15, 2013 \\nThis report appeared in January, 2013, but was subsequently removed from the Mail’s website. Fortunately some observers copied extracts, which we repost here An oldie White Zimbabwean has her say By wmw_admin on January 7, 2009 \\nA human story from the hellhole Zimbabwe has become – with the West’s acquiescence of course. For although Western leaders may criticise him publicly, they opened the way for Mugabe’s ascent to power, just as they did with Saddam Fake Terrorism: The Road to Dictatorship By wmw_admin on October 10, 2008 \\nThroughout history “terrorist” acts have been carefully staged and used to further the power of the ruling elite. In the light of the latest “terror” plot we repost an old favourite as a reminder The Crucifixion of Jews Must Stop! By wmw_admin on August 21, 2010 \\nThe sacrifice of “six million Jews” was being talked about before Hitler rose to power. A photocopy from the American Hebrew dated Oct. 1919, speaks openly about a holocaust of six million Jews before declaring “Israel is entitled to a place in the sun”!! David Icke Debunked By wmw_admin on September 10, 2012 \\nThis website shares Les Visible’s doubts about David Icke. Others do too and as the linked video here explains, with good reason Evidence: Syria Gas Attack Work of U.S. Allies By wmw_admin on August 28, 2013 \\nClear and conclusive evidence that ‘Syrian rebels’ were behind the chemical weapons attack — not the Syrian Army — using toxins supplied by Saudi Arabia. Includes videos David Cole at Auschwitz By wmw_admin on October 7, 2006 \\nNow directly linked, a must see video. Watch as a young Jew demolishes the standard notion of the Holocaust, highlighting its contradictions and flaws with logic and clarity. An hour long video of absolutely essential viewing London Beheading Hoax Confirmed? By wmw_admin on May 24, 2013 \\nWas the London beheading a hoax? After Sandy Hook anything is possible and the authors present a very convincing case that it was. Judge for yourself Back to the Future!!! Part 2 By Rixon Stewart on May 21, 2007 \\nGiven Einstein’s endorsement of Hapgood’s ideas it is reasonable to ask whether his hypothesis could actually happen again and if so when\""}, "time": 1742561982.1291716}