{"duration": 1.407423734664917, "input_args": {"text": "'When Jaap van Zweden was announced in January as the next music director of the New York Philharmonic, I was at sea. I’d heard reports, and my colleagues at The New York Times and elsewhere had been generally impressed by his appearances. But I had never heard him conduct live. As he’s only visited the Philharmonic for four programs, you might have missed him, too. Time for due diligence. Mr. van Zweden has been a prolific recording artist, churning out an average of three albums a year for more than a decade. Many have flown under the radar, emerging from his longtime association with the Netherlands Radio Philharmonic Orchestra on relatively obscure labels. Others, particularly with one of his current ensembles, the Dallas Symphony Orchestra, come in less than ideal sound. A significant number are out of print. But over the past month, I listened to all of them, more than three dozen, a total of 52 hours. What did I learn? An obsession with detail, as if Mr. van Zweden is holding the music tight in a vise, tends to result in an abrupt way with phrasing and, with scarce exceptions for lyrical flights, a style that drives relentlessly hard when the opportunity is there. Sometimes this pays dividends. In Beethoven’s Fifth and Seventh symphonies, released on the Dallas Symphony’s own label, DSO Live, the musicianship is electric, the players urged forward with unstoppable force and responding with unbridled aggression. They are fully committed in Tchaikovsky’s Fourth and Fifth (DSO Live) too, facing down the fates in the Fifth with brisk nonchalance. Once a Dutch “The Rite of Spring” (Exton) shakes off its lugubrious beginning, the violence that ensues is notable for the control with which it is dispatched. Its coupling, Stravinsky’s “Apollon Musagète,” shows that Mr. van Zweden can do tenderness, too. Often, though, his method comes across as heavy handed. A Brahms Second (Brilliant Classics) is square and enervating, and though the rest of that Brahms cycle with the Netherlands players has more oomph, the other three symphonies threaten to go the same way. Accompanying David Fray in a pair of Mozart piano concertos (Erato) the Philharmonia Orchestra sounds worryingly out of breath. And Elgar’s “The Music Makers” (QuattroLive) is pushed to the breaking point. Without the crackle of    performances, I was rarely moved to profound emotion. Hardly ever did a smile creep across my face at the turn of a phrase. Goose bumps didn’t flare. I was not confronted with interpretations that shocked or challenged or enthralled or enraged me. While Mr. van Zweden’s catalog runs from Andriessen to Wagner, there is no sustained reckoning with a largely unfamiliar composer from the past as, say, Manfred Honeck of the Pittsburgh Symphony has explored Walter Braunfels, or the National Symphony’s future director, Gianandrea Noseda, has delved into Alfredo Casella. Perhaps most frustrating is a pervasive lack of charm or humor. Any spontaneity tends to sound, paradoxically, thoroughly rehearsed. Take two discs of Haydn (Exton) or one of his first recordings, a Beethoven cycle (Philips) with The Hague Residentie Orchestra. Everything is in its place, tightly clipped and fussily manicured, with strong accents and prominent timpani: The unkempt, the rude and the radical have been pruned away. For a predominantly symphonic conductor, there’s a remarkable amount of Wagner. A “Lohengrin” and “Die Meistersinger von Nürnberg” (both on QuattroLive) are satisfying. More interesting is a “Parsifal” (Challenge Classics) in which the conducting is unusually unassuming, serenely pious and quietly effective. Then there’s Mr. van Zweden’s most recent recording, a clean and tidy “Das Rheingold” that’s the start of a “Ring” cycle on the Naxos label, with the conductor at the helm of the Hong Kong Philharmonic, his “other” orchestra and one he intends to keep even after he takes over at the Philharmonic. It has considerable orchestral glories, not least the veiled hints of “Götterdämmerung” that hail Erda’s warning to Wotan, yet his work modestly eschews grandeur in favor of exposing the voices. Look out for “Die Walküre,” due later this year. Wagner leads us to Bruckner, and here Mr. van Zweden has come to shine. His earliest efforts with the Netherlands Radio Philharmonic (Exton) are routine, though a slow, simmering Seventh is worth hearing because it’s one of this conductor’s most refreshingly interventionist readings. Far better are the later recordings on the Challenge label: a vibrant First, a fine Eighth, a soaring Sixth and an enthralling Third. While judicious, to my ears his Mahler  —   a “Das Klagende Lied” from Amsterdam, the Third and Sixth symphonies from Dallas, and a Fifth with the London Philharmonic  —   never quite hits the same heights. Many commentators have feared that Mr. van Zweden’s commitment to new music will be shaky, or at least shakier than that of Alan Gilbert, the man he’s succeeding. But Mr. van Zweden’s recordings don’t shy away from modern and contemporary work. By far the weightiest contribution is Steven Stucky’s “August 4, 1964” (DSO Live) a calling card for him and his Dallas orchestra. The care and attention lavished on the score is heartwarming, particularly in the wrenching central elegy, which provocatively conflates the war dead of Vietnam with the murder of civil rights activists. Unsurprising, given both Mr. van Zweden’s nationality and the social function of the Netherlands Radio Philharmonic, Dutch composers figure strongly. On separate composer portraits released by Etcetera, works by Louis Andriessen, Theo Verbey and Otto Ketting benefit from the conductor’s fastidious approach, as does Tristan Keuris’s Symphony in D. Most bracing is the Norwegian Rolf Wallin’s enormously powerful “Act” (Ondine) a   battering ram recorded with the Oslo Philharmonic that rumbles along with pounding ferocity. Mr. van Zweden’s recordings are properly prepared and intensely executed, always energetic and always direct. There is no grandstanding. There is nothing that is not deliberate. There is no let up. This is a conductor who knows his way around an orchestra, and a comparison of his earliest and latest recordings with his Dutch and Texan forces is strong evidence that he knows how to make one better. Several of his recordings are very good, including that Stravinsky and the dose of Wagner. None are terrible. A couple  —   Bruckner’s Third and Sixth, especially  —   are outstanding. Listening to his work over the past 13 years, it’s clear that he is improving fast. One hears discipline. One hears strong musical values. One hears an insistence on high standards. Perhaps this is what the Philharmonic needs and wants at an uncertain time, as it contemplates an extended absence from its home base as David Geffen Hall is renovated. Undertaking this same immersive exercise with the other candidates rumored for the Philharmonic position would result in a more fulsome endorsement. Direct comparisons in works they, too, have recorded are not flattering for Mr. van Zweden: Mr. Honeck’s Beethoven Fifth and Seventh, his Mahler Third and his Tchaikovsky Fifth (all with Pittsburgh) all display a far broader musical imagination.   Salonen’s “Rite” (with the Los Angeles Philharmonic) has more intensity and greater shock value, his Mahler Sixth (with the Philharmonia) a surer sense of structure. Let’s not forget: The New York Philharmonic is the orchestra of Bernstein and Boulez, of Mitropoulos and Mengelberg, of Toscanini and Mahler. Its storied past demands future vision. Its heritage deserves the very best. Is Mr. van Zweden of that class? On this evidence, no  —   but now he has the chance to prove otherwise. Below are five samples from his discography. Listen to them on Spotify: HAYDN: SYMPHONIES NOS. 92, 94, 97 Netherlands Radio Chamber Philharmonic (Exton). Often astringent and deliberately metronomic, these are not the prettiest Haydn recordings, but they are full of sly touches and offbeat choices. Take the famous fortissimo surprise in the “Surprise”: Here, where it’s more of an arched eyebrow than a whoopee cushion, you’re so busy taking in the quality of quiet playing around it that you miss the effect entirely. BEETHOVEN: SYMPHONIES NOS. 5, 7 Dallas Symphony Orchestra (DSO Live). Faster, more confident and with a firmer sense of direction than his earlier recordings with the Residentie Orchestra of The Hague, here we have vigorous Beethoven. Parts of the lithe Fifth are misjudged, but the Seventh is typical Jaap: unyielding, with a darkly thrilling finale. BRUCKNER: SYMPHONY NO. 3 Netherlands Radio Philharmonic Orchestra (Challenge Classics). Skip the Bruckner taped for the Exton label in favor of the releases on Challenge. The Eighth is a bit safe, the Sixth magnificent, and this Third is the finest of all. It feels as if there is something at stake, with genuine depth and cultivation in the slow movement, and overwhelming energy in a dash for the finish. WAGNER: “DAS RHEINGOLD” Hong Kong Philharmonic Orchestra (Naxos). Of the “Ring” dramas, Mr. van Zweden is most likely to convince in “Das Rheingold,” where overt emotionality and architectural vision are least vital. This first recording with his Hong Kong orchestra, and a solid cast proves it. Intimate, light, almost chatty, it’s as if nobody (even Matthias Goerne’s desperate Wotan) quite realizes that this is a drama of philosophical, historical import  —   until it’s too late. STRAVINSKY: “PETRUSHKA” “PULCINELLA” “SYMPHONIES OF WIND INSTRUMENTS” Netherlands Radio Philharmonic Orchestra Netherlands Radio Chamber Philharmonic (Exton). You might think that an often crushing, thumping style would suit Stravinsky’s “Rite,” but Mr. van Zweden’s is uncertain. Instead, he shines in Stravinsky’s   works: the “Apollon musagète” paired with his “Rite” and a suave, restrained “Pulcinella. ” The “Symphonies of Wind Instruments” is perky and pristine, and the “Petrushka” is full of subtle pleasures.'"}, "time": 1742564027.824864}