{"duration": 0.13646364212036133, "input_args": {"text": "'at 12:46 pm Leave a comment \\nWe are not here to gain power, we are here to distribute power. \\n– Ásta Guthrún Helgadóttir Pirate member of Iceland’s Parliament \\nWhile there are all sorts of populist political movements gaining traction across the West, the only one I find genuinely revolutionary and distinctly interesting and productive is Iceland’s Pirate Party. \\nI’ve covered the upstart party in the past, most recently earlier this year in the post, “The Pirates Are Coming” – Iceland’s Pirate Party Polls at 43% Following the PM’s Resignation . Now, with the Icelandic election just days away (October 29th), the party is back in the news due to an expected strong performance. \\nThe Washington Post explains: \\nREYKJAVIK, ICELAND — The party that could be on the cusp of winning Iceland’s national elections on Saturday didn’t exist four years ago. \\nIts members are a collection of anarchists, hackers, libertarians and Web geeks. It sets policy through online polls — and thinks the government should do the same. It wants to make Iceland “a Switzerland of bits,” free of digital snooping. It has offered Edward Snowden a new place to call home. \\nAnd then there’s the name: In this land of Vikings, the Pirate Party may soon be king. \\nTo Jónsdóttir and other Pirate true believers — who define their party as neither left nor right, but a radical movement that combines the best of both — the election here could also be the start of the reboot that Western democracy so desperately needs. \\n“People want real changes and they understand that we have to change the systems, we have to modernize how we make laws,” said Jónsdóttir, whose jet-black hair and matching nail polish cut a distinctive profile in a country where politics has long been dominated by paunchy blond men. \\nThe sticker affixed to the back of her chrome-finish laptop stands out, too: an imitation seal of the U.S. government, the familiar arrow-bearing eagle encircled by the words “National Security Agency Monitored Device.” At the Pirates’ tech-start-up-esque office in an industrial area of Reykjavik’s seafront, a Guy Fawkes mask hangs from the wall and a skull-and-crossbones flag peeks out from a ceramic vase. \\nThe Pirates have spelled out their positions on issues from fishing quotas to online pornography to Snowden. (Party leaders offered him Icelandic citizenship if he can find a way to get here.) But on some of the biggest questions facing the country, the official party position is to punt to the voters. \\nTo party devotees, that’s fine. The Pirates, they say, are less about any specific ideology than they are about a belief that the West’s creaking political systems can be hacked to give citizens a greater say in their democracy. \\n“We are not here to gain power,” said Ásta Guthrún Helgadóttir, a 26-year-old Pirate member of Parliament. “We are here to distribute power.” \\nLike everything else, the Pirate Party cannot be seen in a vacuum. A total implosion of the Icelandic economy was necessary to clear the path. \\nAs The Nation notes: \\nIceland’s political status quo—a Nordic-style parliamentary democracy, dominated for decades by pro-NATO conservatives—was shattered when the country went bust in the 2008 financial crisis, pitching Iceland into its deepest crisis since full independence and the republic were declared in 1944. This year, Iceland was rocked again when the Panama Papers leak exposed corruption among top politicos, including the prime minister, who resigned under fire. “People here are angry and frustrated,” says Karl Blöndal, deputy editor of the center-right Morgunbladid. “In the minds of many voters, the Pirates are the only untainted party, and with them Birgitta carries authority. She’s been the face of the opposition since the crash.” \\nIceland’s Pirates, though they currently hold only three spots in the 64-seat parliament, are among the highest-profile of Europe’s Pirate parties. The anarchic hacker-led movement, global in scope, focuses on privacy rights and freedom of expression in the digital age. Born a decade ago in Sweden, and since turbo-charged by WikiLeaks’ and Edward Snowden’s disclosures about NSA surveillance, the Pirates have dozens of chapters worldwide, from Australia to Canada, and a headquarters in Geneva. Iceland’s Pirates were the first in the world voted into a national legislature. \\nIndeed, Jónsdóttir and Iceland’s Pirates see themselves as part of something greater than the direct-democracy uprising they’re leading in the chill North Atlantic. They understand Iceland as the “test grounds for radical progressive changes,” and they stand for an international legalization of WikiLeaks, asylum for Edward Snowden, and legalizing drugs across Europe. They say they’ll turn diminutive Iceland (a country so small its citizens are listed in the phone book by first names) into an international digital safe haven where data, such as whistle-blower revelations, can be securely transmitted and stored. \\nIn contrast to Europe and the United States, however, Iceland refused to rescue the banks with taxpayer money; instead, the failed banks were renationalized. Iceland chose instead to protect its citizens, first by imposing capital controls so that money couldn’t leave the country and, second, by expanding the social safety net. “Iceland did the right thing…creditors, not the taxpayers, shouldered the losses of banks,” said economist and Nobel laureate Joseph Stiglitz in 2011. The bankers were eventually sent to jail: 26 financiers received sentences totaling 74 years. \\nThe possibilities are endless once you start jailing bankers. \\nFor related articles, see:'"}, "time": 1742563422.1507819}