{"duration": 1.1855478286743164, "input_args": {"text": "\"By Jason Easley on Thu, Oct 27th, 2016 at 12:16 pm Rep. Paul Ryan could be out of a job after the election, as divided House Republicans are already plotting to fire their Speaker if Trump's defeat triggers a big enough loss of House seats. Share on Twitter Print This Post \\nRep. Paul Ryan could be out of a job after the election, as divided House Republicans are already plotting to fire their Speaker if Trump’s defeat triggers a big enough loss of House seats. \\nIf Democrats pick up 15 House seats or more, Speaker Ryan is going to have a major problem because his job will be in jeopardy. Politico reported that Ryan’s enemies in the House Freedom Caucus are divided over whether or not to support him. \\nConservative House Republicans are plotting with one another and openly pining for Ryan’s ouster because he refuses to change the House rules to all more conservative legislation to be passed. The Hill is also reporting that conservativeHouse Republicans are deeply divided on keeping Ryan, but Donald Trump could be the wild card that mobilizing an opposition effort to the Speaker, “The businessman has repeatedly criticized Ryan’s leadership and was stung after the Speaker said he would not longer defend Trump after a 2005 tape emerged in which the GOP nominee speaks lewdly about groping and kissing women. Win or lose on Nov. 8, Trump could put pressure on House Republicans to oppose Ryan in a speakership contest.” \\nRyan is certain to be leading a smaller House majority in January. The size of Trump’s defeat on election day will help decide how many seats Republicans lose. \\nEight of the nine House Republicans who cast votes against Ryan for Speaker initially will still be around to vote against him again in January. \\nThose close to Ryan say that he would step down as Speaker before getting into a protracted fight with his own party, but the walls are closing in on Speaker Ryan. \\nThe damage Trump is causing isn’t limited to their White House dreams. Trump may also cost Paul Ryan his job as Speaker of the House.\""}, "time": 1742563896.7478452}