{"duration": 0.10750770568847656, "input_args": {"text": "'How much do Inaugural Addresses matter? Many are memorable and continue to be quoted, while most others are forgotten almost immediately. Donald J. Trump will get his chance shortly after noon Friday. “They are a touching, almost naïve attempt to set a tone for what is to come,” Jon Meacham, the presidential biographer, said. “But as we know, and as is often remarked, events are in the saddle. We are not. ” Some of history’s most notable inaugural speeches, including the first of Abraham Lincoln, in 1861, demonstrated that presidents cannot control the tides of history. But even so, the most memorable ones stand as worthy introductions to the presidents who delivered them, their values and their goals. George Washington | Thursday, April 30, 1789 The first Inaugural Address was characterized by the first president’s impressive humility. Professing himself to feel unworthy of the task, and praising God, George Washington used the speech, which James Madison helped him to draft, to declare his faith in Congress’s ability to govern. “The magnitude and difficulty of the trust to which the voice of my country called me, being sufficient to awaken in the wisest and most experienced of her citizens a distrustful scrutiny into his qualifications, could not but overwhelm with despondence one who (inheriting inferior endowments from nature and unpracticed in the duties of civil administration) ought to be peculiarly conscious of his own deficiencies,” he said, essentially announcing his skepticism and fear at not living up to the task. But while he declined to offer any specific legislation to Congress, as was his right under the new Constitution, he did subtly remind the legislative body of its duty toward the new country, asking “that the foundation of our national policy will be laid in the pure and immutable principles of private morality, and the   of free government be exemplified by all the attributes which can win the affections of its citizens and command the respect of the world. ” Then, before praising God at length for a final time, Washington announced that he would decline any financial compensation for taking on the role of president. Andrew Jackson | Wednesday, March 4, 1829 President Jackson was one of the originators of American populism and, fittingly, his Inaugural Address paid tribute to his supporters, the people. “While the magnitude of their interests convinces me that no thanks can be adequate to the honor they have conferred, it admonishes me that the best return I can make is the zealous dedication of my humble abilities to their service and their good,” he said. Jackson’s speech stands as a notable example of the gulf that can exist between rhetoric and action. He pledged to respect the limits of executive power (which he ended up expanding) and expressed his “sincere and constant desire” to be humane and considerate regarding Native American rights. He signed the Indian Removal Act, which expelled tens of thousands of Native Americans from their native homes, into law the following May. Jackson, who had been elected during a time of economic anxiety, had far more to say about policy than did Washington. He discussed “the extinguishment of the national debt,” and devoted many words to the maintenance of military might. But he too, ended his speech on a humble note, looking to God and his fellow elected officials for support as well as his fellow citizens. Abraham Lincoln | Monday, March 4, 1861 Though he promised at the outset that it would be brief, Abraham Lincoln used his first Inaugural Address, one of the more momentous and memorable of all such speeches, to speak at length about the grievances between North and South that would erupt into Civil War a month later. Lincoln attempted to soothe southern states, saying that he had no intention of interfering with the institution of slavery, and that he believed not only that states should be in charge of their own institutions, but also that “it is essential to that balance of power on which the perfection and endurance of our political fabric depend” that they do so. After addressing the question of fugitive slaves at length, he went on to prosecute those who would see the country split, saying that the South had no right to rend the country in half, and cautioning patience. “Before entering upon so grave a matter as the destruction of our national fabric, with all its benefits, its memories, and its hopes, would it not be wise to ascertain precisely why we do it? Will you hazard so desperate a step while there is any possibility that any portion of the ills you fly from have no real existence?” Of course, his plea was futile, and the country plunged into war in April, when Confederate troops fired on Fort Sumter in South Carolina. Four years later, about a month before the Confederate general Robert E. Lee surrendered, Lincoln gave his second inaugural. It was far shorter. John F. Kennedy | Friday, Jan. 20, 1961 John F. Kennedy’s Inaugural Address contains his most memorable spoken sentence: “My fellow Americans: Ask not what your country can do for you  —   ask what you can do for your country. ” But the speech is more than a simple call to duty. As the United States was facing a rival superpower in the Soviet Union, Kennedy used the speech to address a newly interconnected global community, pledging that his country was committed to human rights “today at home and around the world. ” And seeming to address the Soviet Union and its allies directly, Kennedy delivered a call for harmony and a warning against nuclear apocalypse: “To those nations who would make themselves our adversary, we offer not a pledge but a request,” he said. “That both sides begin anew the quest for peace, before the dark powers of destruction unleashed by science engulf all humanity in planned or accidental  . ” Ronald Reagan, Tuesday, Jan. 20, 1981 In contrast to Kennedy, Ronald Reagan was firmly fixated on the domestic problems plaguing the nation. After acknowledging the routine transfer of power as “nothing less than a miracle” he went on to bemoan the economic ills affecting the United States, saying that “government is the problem” and announcing his aim to “curb the size and influence of the federal establishment. ” “Government can and must provide opportunity, not smother it foster productivity, not stifle it,” he said. Only after declaiming the steps he sought to take to to reduce government, did he look outward, saying that once America regained strength at home it could project that strength abroad. And then, toward the end of his speech, Reagan continued a tradition that stretched back to Washington. He said he believed that “God intended for us to be free” and declared that Inauguration Days in the future should be observed as days of prayer. He ended his speech uniting the themes of economic ills and providential help, saying that the crisis the United States faced required Americans’ best effort. He said that what was required was belief, “our willingness to believe in ourselves and to believe in our capacity to perform great deeds to believe that together, with God’s help, we can and will resolve the problems which now confront us. ”'"}, "time": 1742562136.0119054}