{"duration": 0.023381471633911133, "input_args": {"text": "'You are here: Home / US / The BRUTAL Truth About Islamic Law The Left Wants to Hide The BRUTAL Truth About Islamic Law The Left Wants to Hide October 27, 2016 \\nRobert Gehl reports that the terrorist behind the massacre at the Orlando gay bar is the child of Afghan migrants. \\nThat particular group – Afghan migrants – are among the most committed to sharia law, according to . \\nIn fact, almost all Muslims from Afghanistan support the Islamic code -99 percent. Of all the majority-Muslim countries surveyed, Afghanistan had the most pro-sharia. \\nImmigration from the Middle East is on the rise, but nothing can match the immigration from Afghanistan. While the number of green cards issued to residents of Middle Eastern countries rose by 32 percent, the number issued to Afghan migrants rose a whopping 379 percent, Breitbart is reporting . \\nHillary Clinton has made clear that under a Clinton Presidency, these numbers will grow substantially higher. Based on the minimum numbers Clinton has put forth thus far, the U.S. will resettle 730,000 permanent migrants from the Muslim world during her first term alone. \\nAccording to NBC, the suspect’s family says the terror attack may have been motivated by Mateen’s hatred for the LGBT community. Mateen’s father says his son was angry over the sight of two men kissing. \\nAt his Friday speech at the Faith and Freedom Summit, Donald Trump addressed Clinton’s plan to import migrants that hold beliefs that are antithetical to Western liberal values. \\n“Hillary will bring hundreds of thousands of refugees, many of whom have hostile beliefs about people of different faiths and values, and some of whom absolutely and openly support terrorism in our country,” he said. “We don’t need that. We have enough problems.” \\nFlorida now leads the state in resettling refugees. In 2013, 43,184 were accepted by that state. While most of these refugees settling in Florida arrive from Cuba, many arrive from Middle Eastern countries. According to the U.S. Office of Refugee Resettlement, the next largest countries to resettle in Florida are (in order) Iraq, Myanmar (Burma), the Democratic Republic of Congo, Sudan, Somalia, Colombia, Afghanistan, Jordan, Pakistan, Syria, and Palestine. \\nAccording to data from the Office of Refugee Resettlement (ORR) in the U.S. Department of Health and Human Services, 91.4 percent of recent refugees from the Middle East are on food stamps and 68.3 percent of recent refugees from the Middle East are on cash welfare.'"}, "time": 1742561985.2260578}