{"duration": 0.1567244529724121, "input_args": {"text": "'Home » Headlines » World News » Electronic Voting Machines Caught Switching Trump Votes To Hillary: “Trying to Steal Texas” \\nIf TEXAS goes Blue, you know something is seriously, seriously wrong… \\n\\nFrom Michael Snyder : \\nIs the 2016 election in the process of being stolen? Just a few weeks ago I issued a major alert warning that this exact sort of thing might happen. Early voting has already begun in many states, and a number of voters in Texas are reporting that the voting machines switched their votes from Donald Trump to Hillary Clinton. The odd thing is that none of the other choices were affected when these individuals attempted to vote for a straight Republican ticket. If Hillary Clinton is declared the winner of the state of Texas on election night, a full investigation of these voting machines should be conducted, because there is no way that Donald Trump should lose that state. I have said that it will be the greatest miracle in U.S. political history if Donald Trump wins this election, but without the state of Texas Donald Trump has exactly zero chance of winning. So those living down in Texas need to keep reporting anything unusual that they see or hear when they go to vote. \\nMost Americans don’t realize this, but the exact same thing was happening during the last presidential election. The state of Ohio was considered to be the key to Mitt Romney’s chances of winning in 2012, and right up to election day the Romney campaign actually believed that they were going to win the state. \\nUnfortunately for Romney, something funny was going on with the voting machines. In a previous article, I included a quote from an Ohio voter that had her vote switched from Mitt Romney to Barack Obama three times… \\n“I don’t know if it happened to anybody else or not, but this is the first time in all the years that we voted that this has ever happened to me,” said Marion, Ohio, voter Joan Stevens. \\nStevens said that when she voted, it took her three tries before the machine accepted her choice to vote for Romney . \\n“I went to vote and I got right in the middle of Romney’s name,” Stevens told Fox News, saying that she was certain to put her finger directly on her choice for the White House. \\nShe said that the first time she pushed “Romney,” the machine marked “Obama.” \\nSo she pushed Romney again. Obama came up again. Then it happened a third time. \\n“Maybe you make a mistake once, but not three times,” she told Fox News. \\nAnd we did see some very, very strange numbers come out of certain areas of Ohio four years ago. \\nFor example, there were more than 100 precincts in Cuyahoga County in which Barack Obama got at least 99 percent of the vote in 2012. \\nIf that happened in just one precinct that would be odd enough. But the odds of it happening in more than 100 precincts in just one county by random chance are so low that they aren’t even worth mentioning. \\nAnd of course this didn’t just happen in Ohio. Similar things were happening all over the country. \\nThe reason why I bring all of this up is to show that there is a pattern. If a fair vote had been conducted, Romney may have indeed won in 2012, and now it appears that voting machines are being rigged again. \\nIn Wichita County, Texas so many people were reporting that their votes were being switched from Trump to Clinton that it made the local newspaper… \\nShortly after early voting booths opened Monday in Wichita County, rumors swirled online about possible errors in the process. Several online posts claimed a friend or family member had attempted to vote straight party Republican ticket, but their presidential nomination was switched to the Democratic nominee, Hilary Clinton. None of the local reports were from people who experienced the situation first hand. A Bowie woman posted that a relative who lives in Arlington saw her votes “switched.” The post was shared more than 100,000 times Monday. \\nAnd Paul Joseph Watson has written about some specific individuals that are making allegations that their votes for president were switched by the machines. One of the examples that he cited was a Facebook post by Lisa Houlette of Amarillo, Texas… \\nGary and I went to early vote today…I voted a straight Republican ticket and as I scrolled to submit my ballot I noticed that the Republican Straight ticket was highlighted, however, the clinton/kaine box was also highlighted! I tried to go back and change and could not get it to work. I asked for help from one of the workers and she couldn’t get it to go back either. It took a second election person to get the machine to where I could correct the vote to a straight ticket. Be careful and double check your selections before you cast your vote! Don’t hesitate to ask for help. I had to have help to get mine changed. \\nI don’t know about you, but major alarm bells went off in my head when I read that. \\nA similar incident was reported on Facebook by Shandy Clark of Arlington, Texas… \\nHey everyone, just a heads up! I had a family member that voted this morning and she voted straight Republican. She checked before she submitted and the vote had changed to Clinton! She reported it and made sure her vote was changed back. They commented that It had been happening. She is trying to get the word out and asked that we post and share. Just want everyone’s vote to be accurate and count. Check your vote before you submit! \\nAnd of course they weren’t the only ones reporting vote switching. It turns out that lots of other Texans have also experienced this phenomenon… \\nSo is there a serious problem with the voting machines? \\nAccording to Breitbart, one county in Texas has already removed all electronic voting machines and has made an emergency switch to paper ballots… \\nChambers County election officials have executed an emergency protocol to remove all electronic voting machines available during early voting until a software update can be completed to correct problems experienced by straight-ticket voters . \\nChambers County Clerk Heather Hawthorne told Breitbart Texas Tuesday morning that all electronic voting was temporarily halted until her office completes a “software update” on ES&S machines that otherwise “omit one race” when a straight ticket option is selected for either major party. The Texas 14 th Court of Appeals race was reported to be the contest in which voters commonly experienced the glitch. \\nLet’s keep a very close eye on this. If the state of Texas ends up in Trump’s column on election night, perhaps no harm has been done. \\nBut if Trump loses Texas there is no possible way that he will be able to make up those 38 electoral votes somewhere else. \\nDespite what the mainstream media is saying, the truth is that election fraud is very real. Just the other day, WND published an article that contained a list of documented cases of election fraud in 23 different states. And Devvy Kidd just authored a piece that pointed out that there are 24 million voter registrations in this country that are “no longer valid or are significantly inaccurate“… In 2012 the highly respected Pew Research Center exposed the sickening state of voter rolls in this country: Nearly 2 million deceased registered to vote Close to 3 million registered in multiples states Approximately 24 million—one of every eight—voter registrations in the United States are no longer valid or are significantly inaccurate More than 1.8 million deceased individuals are listed as voters Approximately 2.75 million people have registrations in more than one state \\nBut despite everything you just read, the mainstream media is trying very hard to prop up faith in the integrity of the process. In fact, just today CNN came out with an article entitled “Poll: Most see a Hillary Clinton victory and a fair count ahead“… \\nAlmost 7 in 10 voters nationwide say they think Hillary Clinton will win the presidency next month, but most say that if that happens, Donald Trump will not accept the results and concede, according to a new CNN/ORC poll. \\nAmericans overall are more confident that the nation’s votes for president will be cast and counted accurately this year than they were in 2008. Whatever the outcome, however, nearly 8 in 10 say that once all the states have certified their vote counts, the losing candidate has an obligation to accept the results and concede to the winner. \\nUnfortunately, CNN does not have much credibility left at this point, and it is gettingharder and harder to believe the polls that are being put out by the mainstream media. \\nAnd the mainstream media would also have us believe that if evidence of election fraud does emerge that it will be because the Russians have made it up… \\nU.S. intelligence and law enforcement officials are warning that hackers with ties to Russia’s intelligence services could try to undermine the credibility of the presidential election by posting documents online purporting to show evidence of voter fraud. \\nThe officials, who spoke on condition of anonymity, said however, that the U.S. election system is so large, diffuse and antiquated that hackers would not be able to change the outcome of the Nov. 8 election. \\nBut hackers could post documents, some of which might be falsified, that are designed to create public perceptions of widespread voter fraud, the officials said. \\nNow that is a real “conspiracy theory”, and it would be incredibly funny if all of this wasn’t so serious. \\nDuring this election season, if you see or hear anything unusual about voting in your area, please report it. \\nThe American people should be allowed to make a free and fair choice, and anyone that attempts to alter an election is committing a crime against all of us. \\nAnd let’s watch the state of Texas very carefully. If it goes blue, you will know that something has gone terribly, terribly wrong. On Sale At SD Bullion… This Week Only…'"}, "time": 1742562272.833989}