{"duration": 0.1257617473602295, "input_args": {"text": "'posted by Eddie We’ve been exploring the surface of Mars since the mid ’70s. Since then, roving vehicles have sent back thousands of fascinating images, all of which are helping scientists to understand whether the Red Planet could have once supported life. But could these 20 images be the only clues they need? From strange skulls to abandoned space stations, these photos have certainly got UFO hunters and conspiracy theorists talking nonstop. 19. Face of an ancient god The Mars Opportunity rover was just going about its business; it didn’t expect to be greeted by the face of the divine. But that’s what happened, or so it seems, with the image it captured bearing more than a passing resemblance to the 2,800-year old Neo-Assyrian god on the right. 18. Lady in the distance This landscape is about as Martian as it gets, but standing on one of those rocks is what appears to be the figure of a woman. “She” was captured by NASA’s Curiosity rover, and website UFO Sightings Daily reckons that the image is proof that there’s life on Mars. 17. A perfect pyramid It looks like something straight from the Libyan Desert, but this isn’t one of the pyramids of Giza. No, this image was taken by NASA’s Curiosity rover, with the “pyramid” being roughly as big as a car. Paranormal investigators say it’s proof of alien life; scientists say it’s simply a quirky rock formation. 16. A huge human face This large Martian rock in the planet’s Cydonia region looks like a person’s face – there’s just no denying it. It was captured during the Viking 1 mission way back in 1976, but NASA scientists were quick to explain that, unfortunately, the “face” was merely a light-and-shadows induced mirage. 15. A thigh bone There’s no getting around this one: it’s obviously a thigh bone, right? Well, when it was captured by the Curiosity rover in 2014, NASA swiftly pointed out that, actually, this was the image of a rock that had been eroded by water. That’ s still quite exciting, as it’s a sign of life; less exciting, though, is the fact that it could equally well have been shaped by wind. 14. Alien skeleton Conspiracy theorists reckon that this shot is proof that aliens once roamed Mars. Their case, on the surface, appears to be strong – a head and torso can be clearly made out, as can a pair of arms. But who knows what happened to the “skeleton”’s legs? 13. Star Wars spaceship This photo appears to have captured a downed Destroyer in the desolate Martian landscape, which seems crazy given that Star Wars is fictional – but hey, the camera never lies, right? The image was taken by NASA’s Curiosity rover, and UFO experts have been totally captivated by it. 12. Jelly donut Apparently aliens are partial to sweet treats, too. But the weirdest thing about this apparent image of a jelly donut is that one day, it wasn’t there, and then 12 days later, it was. Did NASA’s Opportunity rover miss a careless alien dropping it as it passed by? One concerned citizen even launched a lawsuit against NASA, claiming that they were not investigating this donut-shaped proof of life properly. 11. Alien scorpion Scott C. Waring, a self-titled “alien expert” from Taiwan, believes that this image depicts a giant scorpion scuttling across the surface of Mars. The intriguing image was taken by the Curiosity rover in September 2015, and it’s left quite the sting in the tail. 10. Alien peering from a cave Is this a shy alien peering out from its cave? Well, Scott C. Waring certainly believes so. In his YouTube video analysis of NASA coverage, he says, “Right inside this little cave area there is a pink face or a red face sticking out. Is it a living being? Possibly.” 9. Female statue In 2007 the Mars Spirit rover captured this strange image of what appears to be a female statue, though at first glance it also looks remarkably like Bigfoot. The Planetary Society, however, believe that the image is nothing more than a trick of the eye. 8. “Marshenge” Anything Earth can do, in an ancient unexplained monument sense, Mars can do too. This is “Marshenge,” and a YouTuber by the name of Mr. Enigma – who calls himself an alien hunter – has said that it looks “eerily similar” to the stone circle in Wiltshire, England. “I’m just saying there is something strange about this area,” he concluded. 7. Crab monster This image, captured by the Curiosity rover, appears to show a crab-like monster emerging from a gap in the rocks. Sadly, however, it’s nothing more than an optical illusion caused by our brains’ habit of recognizing familiar shapes in unfamiliar objects. It’s called pareidolia, and it’s why we often see things that aren’t there. 6. A giant waffle Towards the end of 2014 the Mars Reconnaissance Orbiter took this photo of an island on Mars’ exterior. What was so interesting about it? Well, it looks like a giant waffle – one that is 1.2 miles across, in fact. Yet rather than being delicious and edible, it’s believed to have been formed from lava flows breaking out from beneath the planet’s surface. 5. Bigfoot skull If that was Bigfoot earlier, then this may be the skull of one its descendants. It was captured by the Curiosity rover in 2016, and while it got people talking, the “skull” – which is, somewhat predictably, just a rock – is really just another example of pareidolia. 4. Mystery dome This strange dome, according to conspiracy theorists, was constructed by an ancient civilization. “Is it possible,” questioned the Unsilent Majority website, “that we are looking at some sort of building left behind by ancient inhabitants on Mars?” Its existence was uncovered by the Opportunity rover in 2015. 3. The Mars monolith In 2009 the Mars Reconnaissance Orbiter captured what appeared to be a monolith on the surface of Mars. The remarkable image was published to the Lunar Explorer Italia website, which is how people started talking about it. Scientists, however, later said that the monolith was nothing more than a typical Martian boulder. 2. Something shiny In 2012 the Curiosity rover captured a small shiny object somewhere on Mars’ surface. Was it a fragment of alien spacecraft, or a piece of leftover currency? Well, according to NASA scientists the object is merely a part of the Red Planet’s typical geological make-up. It’s no doubt worth a few dollars on eBay, though. 1. Hunk of metal What’s this hunk of metal doing on Mars? It was unearthed by the Curiosity rover in 2013, and when it was published Flickr users tried to enhance it to discover what it was. It’s suggested however, that the object could merely be a fragment of a meteorite or – even more disappointingly – a trick of the light. source:'"}, "time": 1742563932.9694602}