{"duration": 0.03174924850463867, "input_args": {"text": "'Rick Perry has accused administrators at Texas AM of disqualifying a student who was elected to serve as student body president “in the name of ‘diversity. ’”[Robert McIntosh, the son of a prominent Republican fundraiser who supported President Trump in his bid for the White House, was disqualified after winning an election for Texas AM’s student body president by over 700 votes. The position of student body president was awarded to the   finisher, Bobby Brooks, a junior who became Texas AM’s first openly gay student body president.  McIntosh was initially disqualified over claims that he may have engaged in voter intimidation tactics. The concern was quickly dismissed by Texas AM’s Judicial Court, which The Washington Post calls “the university’s version of a student supreme court. ” But McIntosh’s disqualification was upheld, with the reason given that he “failed to disclose financial information for glow sticks briefly featured in a campaign video. ” Secretary of Energy and former Governor of Texas Rick Perry, who is an alumnus of Texas AM, wrote a column for The Houston Chronicle citing his concerns over the decision to take the position away from McIntosh over the purchase of glow sticks that appeared in his campaign video. “As Texas’ first Aggie governor and as someone who was twice elected Yell Leader of Texas AM University, I am deeply troubled by the recent conduct of AM’s administration and Student Government Association (SGA) during the Aggie   president elections for ” he began. Mainstream media outlets like The Washington Post were quick to question the motivations behind Secretary Perry’s criticisms, running the headline “Rick Perry accuses Texas AM’s first gay student body president of stealing election” on their Facebook page. ”I viewed it as a testament to the Aggie character”  —   Rick Perry on election of gay student. Does this headline suggest that? pic. twitter.   —   Tommy (@tciccotta) March 23, 2017,  Perry argued that the student body’s support of Brooks as an openly gay student was a “testament to the Aggie character. ” “When I first read that our student body had elected an openly gay man, Bobby Brooks, for president of the student body, I viewed it as a testament to the Aggie character. I was proud of our students because the election appeared to demonstrate a commitment to treating every student equally, judging on character rather than on personal characteristics,” he wrote. Despite The Washington Post‘s suggestion, Perry’s criticism wasn’t pointed at Brooks it was pointed at the administrators responsible for disqualifying McIntosh on a technicality. “In its opinion, the Judicial Court admitted that the charges were minor and technical, but, incredibly, chose to uphold the disqualification, with no consideration given to whether the punishment fit the crime. The desire of the electorate is overturned, and thousands of student votes are disqualified because of free glow sticks that appeared for 11 seconds of a   campaign. Apparently, glow sticks merit the same punishment as voter intimidation,” he argued. Perry claimed that McIntosh received the glow sticks for participating in a charity event before the campaign and also that the other candidates weren’t asked to itemize the expenses of props used in their campaign videos. “Now, Brooks’ presidency is being treated as a victory for ‘diversity.’ It is difficult to escape the perception that this quest for ‘diversity’ is the real reason the election outcome was overturned,” Perry argued. “Does the principle of ‘diversity’ override and supersede all other values of our Aggie Honor Code? “Honestly, we were just surprised to see that the secretary of energy would take the time to weigh in in detail,” Amy Smith, the school’s senior vice president of marketing and communications, told the Texas Tribune, “and we respectfully disagree with his assessment of what happened. ” Tom Ciccotta is a libertarian who writes about education and social justice for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742628555.1299922}