{"duration": 0.16266274452209473, "input_args": {"text": "'LOS ANGELES  —   It’s one of Hollywood’s most secretive and unusual jobs: Brian Cullinan, a partner at the accounting firm PwC, and a colleague are tasked with making sure the statuettes at the annual Academy Awards are correctly distributed. He stands in the wings of the Dolby Theater here in a tuxedo and pulls sealed envelopes out of a briefcase, giving the correct one to presenters as they walk onto the stage. This is the one night a year when the   PwC really gets to shine. The firm’s chief executive sits with stars in the audience. Mr. Cullinan walks the red carpet, where reporters often say he resembles Matt Damon. He told one TV crew that he had no nerves. “We’ve done this a few times,” he said before Sunday night’s show, “and we prepare a lot. ” He was so at ease, he even found time to tweet from backstage about Emma Stone as the show neared its climax. Whoops. In an epic bungle before 33 million viewers  —   one that could get his company fired as the Academy of Motion Picture Arts and Sciences’ accountant after 83 years and which robbed “Moonlight,” an     film, of its proper moment of celebration  —   Mr. Cullinan caused the   musical “La La Land” to be mistakenly named best picture at the 89th Academy Awards. PwC’s chief executive watched the scene from the third row. At the climactic moment backstage, a crew member shouted “Oh my God” as the jubilant producers of “La La Land” thanked their families. “He got the wrong envelope!” “He” was Warren Beatty, who, along with Faye Dunaway, presented the final award of the night. Mr. Beatty opened the envelope and, after some hesitation, handed it to Ms. Dunaway. She said that “La La Land,” about young California dreamers, was the winner. The crowd erupted in applause, and the “La La Land” team rushed the stage. Why did it take minutes to fix the error? “PwC sounded the alarm, but not right away,” Gary Natoli, the telecast’s stage manager, said in a text message. “It wasn’t until just before I jumped onstage that it was confirmed by both Brian and Martha as the winner being incorrect. ” Martha L. Ruiz, a PwC colleague of Mr. Cullinan’s who stood on the opposite side of the stage, and Mr. Cullinan apparently needed to find each other backstage to confer before speaking up. It was one of the most surprising reversals in Oscar history, as human error combined with live television to powerful,   effect. It also warped and dampened the euphoria of film executives and artists who had spent years working on the two movies. And for the academy, which had been criticized last year for failing to nominate any minority actors for the second consecutive year, there was a missed moment: Instead of a proper celebration of “Moonlight,” there was a televised scene of confusion, disbelief and astonishment. Backstage, Michael De Luca and Jennifer Todd, the telecast’s producers, were sitting at their monitors, Diet Cokes in hand. They were under the impression that the show was a wrap. But the scene quickly became chaotic, as it emerged that the winner was, in fact, “Moonlight,” a tender drama about a young, black man coming to terms with his homosexuality. “I’m holding the envelope and the award, and I had just given my speech, and there are people on the stage with headsets and I thought, ‘That doesn’t seem right,’” Jordan Horowitz, a “La La Land” producer, recalled. Exactly what happened in the moments leading up to the mistaken announcement was still being sorted out on Monday, but pieces of the story began falling into place. Mr. Cullinan  —   perhaps distracted by his Twitter feed  —   handed Mr. Beatty an envelope containing the name of the best actress winner, an award that had already been given to Ms. Stone of “La La Land. ” The next seven humiliating minutes would find Ms. Dunaway blurting out the wrong best picture winner, the   audience gasping and   and a dance onstage as “La La Land” producers gracefully made way for the “Moonlight” team. “I haven’t received any formal explanation,” Marc Platt, another member of the “La La Land” producing team, said on Monday afternoon. “There may have been disappointment in the moment, tremendous disappointment, but the good news is that I feel a unity in our community today. ‘Moonlight’ won best picture. But many voices in many kinds of films were honored. ” This account of the awards show’s frantic final moments was based on interviews with producers of both “La La Land” and “Moonlight” academy officials crew members for the telecast and PwC executives. Some provided information on the condition of anonymity because they were not authorized to speak publicly. An academy spokeswoman directed queries to PwC. Another academy official said the organization had initiated a review of the backstage process and of the group’s association going forward with the accounting firm, which extends beyond balloting for the Oscars. “I read the card that was in the envelope,” Mr. Beatty told reporters on his way to the Governors Ball, a   party. “I thought, ‘This is very strange because it says best actress on the card.’ And I felt that maybe there was some sort of misprint. ” Pressed further, he said, “That’s all I have to say on the subject. ” Ms. Dunaway declined to comment. For its part, PwC expressed remorse. “We are owning this mistake,” said Tim Ryan, the United States chairman of PwC. “I’ve reached out to the academy. I’ve shared my personal apology, the firm’s apology, and I’ve begun to talk to them about things we can do to make it right. ” The firm declined to make Mr. Cullinan available for an interview, but it later said that once he mistakenly handed out the wrong envelope, “protocols for correcting it were not followed through quickly enough by Mr. Cullinan or his partner. ” In keeping with past practice, PwC prepared two identical sets of sealed envelopes before the Oscars show. Ms. Ruiz kept a complete set on one side of the stage, while Mr. Cullinan had another set on the other. It was Ms. Ruiz who handed the best actress envelope to Leonardo DiCaprio, who presented the award to Ms. Stone. (As they walked off the stage, Mr. DiCaprio handed her the envelope and said, “Make sure you keep this. ”) Next up: Mr. Beatty and Ms. Dunaway, reuniting to mark the 50th anniversary of “Bonnie and Clyde” and announce the best picture winner. It was then that Mr. Cullinan handed Mr. Beatty the spare   envelope instead of the   envelope. What led to the mistake by Mr. Cullinan was not known, but it could have to do with the envelope’s design. The academy used a new envelope this year, featuring red paper with gold outside lettering that specifies the award inside. That may have made the outside of the envelopes more difficult to read than last year’s, which featured gold paper and red lettering. Mr. Natoli, the stage manager, was the one who approached Mr. Horowitz, the “La La Land” producer, to see that the envelope he was holding was the spare announcing Ms. Stone’s acting win. “The guys in headsets were going around with urgency looking for the other envelope,” Mr. Horowitz said. “One of the guys opens it, and it says ‘Moonlight,’ and I took it onstage and went to the microphone and said what I said. ” Mr. Horowitz reacted quickly. “You guys, I’m sorry, no,” he said from the stage. “There’s a mistake. ‘Moonlight,’ you guys won best picture. ” For the filmmakers and actors in “Moonlight,” those final minutes were no less stunning. “We all looked at each other and were like, ‘Is this a joke? ’” the actor Andre Holland said later. “We waited and kept watching. We didn’t want to celebrate until we knew if it was a joke and whether this was really happening. ” As soon as the show ended, Dawn Hudson, the academy’s chief executive, jumped from her seat in the theater and marched backstage. Ms. Hudson and Cheryl Boone Isaacs, the academy’s president, gathered Ms. Dunaway, Mr. Beatty, the PwC accountants and other crew members into the theater’s green room. “I’ve never seen Dawn look that mad,” a crew member said.'"}, "time": 1742562090.7071671}