{"duration": 0.03653311729431152, "input_args": {"text": "'Obsessing over Europe’s Refugee Crisis While Ignoring Africa’s Is White Privilege at Work Mehdi Hasan, Washington Post, November 3, 2016 \\nHave you not heard? Europe is in the throes of a refugee crisis. Hosting asylum-seekers from Syria is a “historic test of Europe,” says Germany’s Angela Merkel. “The most responsibility [for refugees] is and will continue to be placed on Europe,” adds European Council President Donald Tusk. \\nFor President Obama, “uncontrolled migration into Europe” is a “major national security issue” for the United States. Even the Dalai Lama agrees that there are “too many” refugees inside the European Union. \\nReally? “Too many”? “Historic”? Consider these facts: More than 65 million people were forced from their homes by conflict or persecution in 2015, according to the United Nations High Commissioner for Refugees (UNHCR) , including 21.3 million people classified as refugees living outside the borders of their own countries. \\nAdmittedly, a record 1.3 million refugees sought asylum within the European Union last year, with thousands more applying for asylum every month. Yet what of Sub-Saharan Africa, home to 4.4 million refugees and a whopping 19.5 million “people of concern” to the UN High Commissioner for Refugees? \\nWe don’t often hear about these particular refugees or asylum-seekers, do we? They are, to borrow a term from British historian Mark Curtis, “unpeople,” the poor, nonwhite residents of the developing world who tend to be ignored by the Western media. \\nWhere is the rolling coverage of Kenya’s Dadaab camp, for example? Dadaab is the largest refugee camp in the world, but in a move that could displace as many as 300,000 people , Kenyan authorities are in the process of closing it down. It puts the recent British media frenzy over the so-called “Jungle” camp in Calais, France, with its 10,000 migrants, into some perspective, doesn’t it? \\n{snip} \\nYet Europe’s refugee crisis continues to suck up all the oxygen of global publicity. The UNHCR fundraises for a whole host of “special situations” involving refugees. As of the end of October, the “ Central African Republic situation ” was 17 percent funded; the “ Somalia situation ” 21 percent funded and the “ South Sudan situation ” 25 percent funded. The “ crisis in Europe ,” however? Fifty-six percent funded. \\nThe double standard is as brazen as it is shameful. Remember: The European Union accounts for 17 percent of global GDP ; Sub-Saharan Africa accounts for a little more than 3 percent . \\n{snip} \\nThis is not just navel-gazing hyperbole but white privilege, plain and simple. How else to describe a collective tendency to obsess over a refugee crisis in (rich, white) Europe, rather than in (poor, black) Africa? In what warped world are thousands of penniless and homeless refugees considered to constitute a crisis only when they wash up on the shores of western Europe?'"}, "time": 1742563864.1270626}