{"duration": 0.1936800479888916, "input_args": {"text": "'WASHINGTON  —   The Obama administration said on Friday that despite Russian attempts to undermine the presidential election, it has concluded that the results “accurately reflect the will of the American people. ” The statement came as liberal opponents of Donald J. Trump, some citing fears of vote hacking, are seeking recounts in three states  —   Wisconsin, Michigan and Pennsylvania  —   where his margin of victory was extremely thin. A drive by Jill Stein, the Green Party candidate, for recounts in those states had brought in more than $5 million by midday on Friday, her campaign said, and had increased its goal to $7 million. She filed for a recount in Wisconsin on Friday, about an hour before the deadline. In its statement, the administration said, “The Kremlin probably expected that publicity surrounding the disclosures that followed the Russian   compromises of emails from U. S. persons and institutions, including from U. S. political organizations, would raise questions about the integrity of the election process that could have undermined the legitimacy of the  . ” That was a reference to the breach of the Democratic National Committee’s email system, and the leak of emails from figures like John D. Podesta, Hillary Clinton’s campaign chairman. “Nevertheless, we stand behind our election results, which accurately reflect the will of the American people,” it added. Supporters of Mrs. Clinton have enthusiastically backed the notion of challenging the results in the three states as a   effort to reverse Mr. Trump’s clear majority in the Electoral College. They have seized on suggestions by some computer scientists that the states, which were crucial to Mr. Trump’s victory, need to manually review paper ballots to ensure the election was not hacked. The campaign, uniting around the hashtag #AuditTheVote, has picked up momentum among   activists still mourning Mr. Trump’s victory. But the pleas for recounts have gained no support from the Clinton campaign, which has concluded that it is highly unlikely to change the outcome. In Michigan, Ms. Stein must wait for a Monday meeting of the state’s Board of Canvassers to certify the results of the Nov. 8 balloting before filing for a recount. In Pennsylvania, where paper ballots are used only in some areas, election officials said that the deadline to petition for a recount had passed, but that a candidate could challenge the result in court before a Monday deadline. The recount efforts have generated pushback by experts who said it would be enormously difficult to hack voting machines on a large scale. The administration, in its statement, confirmed reports from the Department of Homeland Security and intelligence officials that they did not see “any increased level of malicious cyberactivity aimed at disrupting our electoral process on Election Day. ” The administration said it remained “confident in the overall integrity of electoral infrastructure, a confidence that was borne out. ” It added: “As a result, we believe our elections were free and fair from a cybersecurity perspective. ” However, intelligence officials are still investigating the impact of a broader Russian “information warfare” campaign, in which fake news about Mrs. Clinton, and about United   relations, appeared intended to influence voters. Many of those false reports originated from RT News and Sputnik, two   Russian sites. Those   reports were widely circulated on social media, independent studies, including one set for release soon, have shown, sometimes in an organized fashion by groups that appear to have had common ownership. Individuals, conservative   hosts and activists recirculated them, often not knowing, or apparently not caring, about the accuracy of the reports. A study published just before the election on War on the Rocks, written by Andrew Weisburd, Clinton Watts and J. M. Berger, documented efforts by “trolls” to attack the reputations of those who challenged Russia’s activities in Syria, and to spread rumors about Mrs. Clinton’s health. The study said that an effort to track 7, 000 social media accounts over two and a half years indicated that support for Mr. Trump “isn’t the end of Russia’s social media and hacking campaign in America, but merely the beginning. ” But the misinformation effort is far from   . Many people who spread false news have no connections to any foreign power, including a man in Austin, Tex. who posted a Twitter message saying that paid protesters were being bused to an   demonstration there. Though the report quickly went viral, the buses, it turned out, were there for a corporate conference. Other examples, including one studied by a group called Propaganda or Not and first cited by The Washington Post, appear to have more concrete connections to Russia. In late August, stories suggesting that Mrs. Clinton might have Parkinson’s disease were circulated on trupundit. com, which often runs   material. It clearly twisted an email sent by one of Mrs. Clinton’s top aides about a drug called Provigil that is used to treat sleepiness. It has also been prescribed to patients with sleepiness as a side effect from several different ailments, the email added, including “Parkinson’s, Alzheimer’s and multiple sclerosis. ” That single reference was enough to create a fake story suggesting that Mrs. Clinton was being treated for Parkinson’s. The allegation was quickly shot down by several news organizations. It made little difference: Propaganda or Not, made up of former national security, intelligence and other professionals, and some workers at Google and other technology firms, concluded that it was reproduced tens of thousands of times, sometimes by botnets, and viewed millions of times. But it is not known whether that news was circulated under Russian government direction, or simply by Russian sympathizers, or Mrs. Clinton’s opponents. The barrage of online efforts to influence the election this year has prompted broader concerns that similar attempts, directed by the Kremlin or its surrogates, could now be focused on elections next year in Germany and France. The goal, intelligence officials and outside experts fear, is to undermine the cohesiveness of the Western alliance, particularly NATO members, by calling into question the validity of democratic elections. “We simply don’t know what the effects of the ‘fake news’ and other disinformation was,” said Jason Healey, an expert on cyberconflict at Columbia University. “If they were able to influence in favor of Trump by one or two percentage points in some places, they will be encouraged to try again for the French and the Germans. ” The efforts have also prompted debate inside Facebook and other social media firms about their responsibility to filter out false news. But doing so is a complex task, akin to editing a news operation, and it comes with complex political calculations: Once social media firms begin editing here to American standards, they will be under pressure from authoritarian regimes to do the same to their standards. In its statement, the administration focused chiefly on the threat of Russian manipulation of the vote on Election Day, not on the proliferation of propaganda and fake news. Ms. Stein, of the Green Party, acknowledged on Thursday in an interview with the PBS “NewsHour” that it was unlikely that recounts could change the results. Still, she said that “this was an election in which we saw hacking all over the place,” and that “at the same time, we have a voting system which has been proven to basically be wide open to hackers. ”'"}, "time": 1742562165.1951556}