{"duration": 0.04046368598937988, "input_args": {"text": "'Ya hay más reencuentros de “Operación Triunfo” que ediciones de “Operación Triunfo” SE ESTÁN REENCONTRANDO COMPAÑEROS QUE AÚN NO SE CONOCEN Televisión Española \\nLa fiebre de los reencuentros de antiguos concursantes de “Operación Triunfo” ha llevado a Televisión Española a apostar por el formato de la nostalgia hasta el punto de que, según confirmaba el propio canal esta mañana, ya hay más ediciones de “OT: El reencuentro” que de “Operación Triunfo”. Un portavoz de la productora Gestmusic reconocía que “se están reencontrando cantantes que sólo se conocen desde hace dos días”. \\n“El concierto de ayer fue mítico, hay que repetirlo. ¿Cómo lo tenéis mañana?”, preguntó ayer un ejecutivo del Ente público a Chenoa y David Bisbal, que confesaron estar hartos de reencontrarse tras 16 reencuentros consecutivos. “Yo necesito no reencontrarme con la misma gente tantas veces”, apuntó la cantante. Bisbal confesó tras las cámaras que, a estas alturas, los reencuentros merecen la pena no tanto por la ilusión “como por lo que se cobra”. \\n“No sé quién es Julio Rojas porque me perdí el programa de ayer, pero dicen que esta noche se reencuentra con Vero, que tampoco sé quién es, y va a ser la bomba porque parece que hubo algo entre ellos casi desde que se conocieron hace menos de dos días”, comenta un seguidor acérrimo de este formato. \\nTVE ha firmado ya la producción de doce ediciones de “Operación Triunfo” con doce reencuentros cada una. La imposibilidad de cuadrar la parrilla de programación ha llevado a celebrar el reencuentro de concursantes de una edición que aún no se había grabado. “Es muy emocionante reencontrarte con los compañeros a los que vas a conocer dentro de un mes”, explicaba Yuri Sedasso, ganador de la edición de OT de 2023.'"}, "time": 1742561651.050893}