{"duration": 0.046354055404663086, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. We’ll get to the major stories of the day in a second, but first, as you head into your weekend, we wanted to bring you a reminder that we still live in a world of wonders. We asked our science reporters to share the most memorable stories they reported on this year. Here’s what they told us. _____ 2. President Obama warned that the American government would respond to Russia’s efforts to influence the presidential election with “a clear message. ” At a news conference, before leaving for vacation in Hawaii, he defended his restrained response to the hacking and said that he told Vladimir Putin to “cut it out” months ago. Hillary Clinton spoke out on Thursday, accusing Mr. Putin of ordering the hack “because he has a personal beef against me. ” _____ 3. The reaction to   Donald Trump’s nominee for ambassador to Israel, David Friedman, above, has been highly polarized. Mr. Friedman, a bankruptcy lawyer with no diplomatic experience, has long espoused     views that are often at odds with United States policy. Mr. Trump has filled most top positions in his cabinet, but still has not named a Democrat. He is continuing his victory tour with a rally in Florida tonight. _____ 4. The process of evacuating residents from the last   section of Aleppo broke down on Friday amid confusion and concerns over reports of summary killings. More than 8, 000 people have been taken out of the Syrian city, but many thousands are said to remain. Videos shared on social media showed the harrowing evacuation journey. _____ 5. The war in Syria has garnered international attention, but in Yemen, another conflict has been largely forgotten by the world. Our journalists went there last month to report on the devastating effects of the fighting, which has displaced more than 2. 5 million people. The United States has publicly kept its distance from the war, but Saudi pilots  —   who have been bombing rebels in the capital, Sana  —   often fly   fighter jets and drop   munitions. _____ 6. The United States is demanding the return of an underwater drone that has been seized by a Chinese warship in the South China Sea. The drone was carrying out scientific research when it went missing, a Defense Department official said. On Thursday, China signaled that it had installed weapons on disputed islands in the waterway. American officials are trying to determine whether the seizure was a   action taken by Chinese sailors, or if it was more strategic. _____ 7. In North Carolina, the   state legislature approved a sweeping package of restrictions to curb the powers   Roy Cooper, a Democrat, above. One of them was quickly signed by the outgoing   Gov. Pat McCrory, a Republican. Protesters were removed from the House and Senate galleries after yelling and chanting, and a number of people were arrested throughout the day in acts of civil disobedience. _____ 8. There’s a special resonance to tonight’s broadcast of ”Jeopardy!” It features Cindy Stowell, who was on a winning streak, even as she battled Stage 4 colon cancer. Ms. Stowell died on Dec. 5, before her episodes began airing. Her fan base is now enormous. _____ 9. Frigid temperatures continue to hang over the northern half of the United States, and some areas are expecting snow, sleet and freezing rain. And it doesn’t look like it’s going to warm up this weekend. If you’re planning to stay inside, here’s a guide to streaming the best movies of 2016. Above, a    boy in Maine. _____ 10. On the topic of being cold, here’s a look at the sport of ice swimming. Competitions take place in water that is 41 degrees or less, and the risk to the body is real. Still, the races seem to attract interest in spite of the dangers, or perhaps because of them. “I’m being honest, when it’s over, the euphoria is incredible,” said one swimmer. _____ 11. Finally, we bring you a story of good intentions  —   which, as we all know, sometimes fall short (specifically, in this case, six feet short). In Montreal, there was an idea to celebrate the city’s upcoming 375th anniversary by putting up a Christmas tree bigger and grander than the famous one in New York. Then everything went wrong. The tree is skinny, misshapen and widely unloved, but let’s not forget: Charlie Brown’s Christmas tree was, too. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742628521.5052545}