{"duration": 1.5940477848052979, "input_args": {"text": "'HOUSTON, Texas  —   A video shot by a Houston man while riding his blonde horse in a Walmart store is going viral. The video, posted to Facebook on Sunday, received nearly 2 million views. At least two mounted horses are shown coming from inside the store. [Woody Fields posted his video stating he was in “Walmart on a horse grocery shopping. ” The   video shows him riding his horse up and down the aisles of the store while people looked at him with shocked expressions.  (function( d, s, id)  (document, ’script  ’))   Walmart on a horse grocery shopping, Posted by Woody Fields on Sunday, March 19, 2017, Since posting the video Sunday, Facebook users viewed the trail ride 1, 735, 903 times as of this publication. Users shared the post nearly 32, 000 times, and 8, 400 people commented on the horse adventure. Following the short tour through the store, Fields exits the store through the front door and joins a fellow rider waiting outside. A short time later, a second mounted Walmart shopper can be seen exiting the same door. It is not known if the rider waiting outside had also ventured through the store with his horse. Several small children could be seen in proximity to Fields and his horse as they rode through the store. No groceries or other items were purchased, despite his claim of “grocery shopping. ” Fields made a second post that appeared to mock the store’s greeter as he entered the building. “We were just riding, and a buddy of mines was, like, ‘Let’s go to Walmart,’ and I was, like, ‘Man, I’m not going to Walmart,’ Fields told Click2Houston. “He was, like, ‘Come on, let’s go! ’” “I wasn’t trying to hurt nobody, or do anything destructive. It was just, like, you only live once, you know? That’s all,” Fields said. KTRK ABC13 reported one of the horses relieve itself inside the store. They did not say if Fields and his companion offered to clean up the mess. Walmart officials did not appear pleased as they responded, “We in no way condone yesterday’s reckless stunt inside our store and are thankful no one was hurt by these actions. ” The Houston Humane Society also appeared to not approve of the behavior. The group posted this statement: At minimum, riding a horse inside a store is incredibly irresponsible. This would be extremely stressful on any horse. Horses can easily become spooked, endangering not only themselves, but also any shoppers they might encounter. The Houston Humane Society urges all pet owners to think and act responsibly when it comes to the lives of animals in their care. Houston is currently in the middle of the Houston Livestock Show and Rodeo. It is not known if Fields and his companion were riding in connection to this or if they were simply out having fun during the   conditions on the last official day of winter. He posted a group of photos showing his horse buddies riding in other areas of Houston, including the Galleria area. It appears everyone was having a good time and many children were able to experience the horses first hand. Bob Price serves as associate editor and senior political news contributor for Breitbart Texas. He is a founding member of the Breitbart Texas team. Follow him on Twitter @BobPriceBBTX and Facebook.'"}, "time": 1742564340.4910913}