{"duration": 0.08511829376220703, "input_args": {"text": "'WASHINGTON  —   Democrats continue their rigorous questioning of President Trump’s nominees for cabinet positions and other important posts. Here are key moments from today: ■ Representative Tom Price of Georgia, nominated to be health and human services secretary, defended his investments in an Australian pharmaceutical company during his time in Congress. “The reality is that everything that I did was ethical, above board, legal and transparent,” he said. ■ Senator Orrin G. Hatch, Republican of Utah, lamented “the   of the nomination process. ” ■ Representative Mick Mulvaney of South Carolina, the nominee for budget director, said that tackling government waste and reducing debt would be his top priorities. ■ The toughest questions that Mr. Mulvaney faced on Tuesday came from Senator John McCain, Republican of Arizona. He asked Mr. Mulvaney about his record of voting for cuts to military spending and appeared to be shocked when Mr. Mulvaney could not remember those votes. ■ Linda E. McMahon, the former chief executive of World Wrestling Entertainment and Mr. Trump’s choice to lead the Small Business Administration, said her entrepreneurial background suited her for the job. ■ Ms. McMahon assured senators that she would be a vigilant opponent of restrictive government regulations. A background investigation of Mr. Price says he understated the value of his investments in an Australian pharmaceutical company, Innate Immunotherapeutics, and claimed income tax deductions that he could not substantiate. The findings emerged from a review of Mr. Price’s tax returns and other official documents by committee staff members from both parties. In a questionnaire in December, the committee staff said, Mr. Price understated the value of 400, 613 shares of the Australian company that he purchased in August 2016 through “a private placement offering. ” The value of the shares was listed on the questionnaire as $50, 000 to $100, 000, but that reflected the purchase price, the staff reported. At the request of the committee, Mr. Price recalculated the value of his holdings to reflect their market price. The revised value was $100, 000 to $250, 000. In addition, the committee staff said, Mr. Price “took improper deductions on his 2016 tax returns” for the depreciation of land associated with condominiums that he owns in Washington and Nashville. Moreover, the staff said, Mr. Price and his wife, both physicians, claimed “miscellaneous employment deductions totaling $19, 034” for various expenses in 2013, 2014 and 2015. Neither Mr. Price nor his wife work as a physician, the staff report said, and “proper documentation could not be located,” so Mr. Price’s tax returns will be amended to remove the $19, 034 in deductions. Senator Ron Wyden of Oregon, the senior Democrat on the Finance Committee, questioned Mr. Price over his trades of health care stocks during his time in Congress. “It is hard to see this as anything but a conflict of interest and an abuse of position,” Mr. Wyden said. In particular, Mr. Wyden pressed Mr. Price over his investments in Innate Immunotherapeutics, which the senator said could be affected by legislation that comes before Congress. Mr. Price said he had done nothing wrong. “The reality is that everything that I did was ethical, above board, legal and transparent,” he said. Just how involved is Mr. Price as the Trump administration plots how it will replace the Affordable Care Act? Senator Sherrod Brown, Democrat of Ohio, tried to find out. “President Trump said he’s working with you on a replacement plan for the A. C. A. which is nearly finished and will be revealed after your confirmation,” Mr. Brown said. “Is that true?” “It’s true that he said that, yes,” Mr. Price responded, drawing laughter in the hearing room. “Not that he’s ever done this before, but did the president lie?” Mr. Brown asked. He added: “I know we don’t use the word lie here, because we’re polite, when presidents say statements that aren’t true. But did he lie to the public about working with you?” “I’ve had conversations with the president about health care, yes,” Mr. Price replied. Senator Hatch lamented “the   of the nomination process. ” He said Democrats’ attacks on Mr. Price’s ethics were “specious and distorted. ” He said lawmakers should not “invent new standards for finances, ethics and disclosure that are different from those that have generally applied in the past. ” “None of those who say they oppose Dr. Price’s nomination seem to be talking about whether he is qualified,” Mr. Hatch said. Senator Johnny Isakson, Republican of Georgia, also came to Mr. Price’s defense. “I feel like I’ve been asked to be a character witness in a felony trial in the sentencing phase of a conviction,” he said. He called Mr. Price “an honorable man. ” Mr. Mulvaney said that tackling government waste and reducing debt would be his top priorities if he were confirmed as Mr. Trump’s budget director. “I believe, as a matter of principle, that the debt is a problem that must be addressed sooner rather than later,” Mr. Mulvaney said in prepared remarks to be delivered to the Senate Budget Committee. “I also know that fundamental changes are needed in the way Washington spends and taxes if we truly want a healthy economy. ” While Mr. Mulvaney is a big believer in spending cuts, he made it clear that he wanted to protect America’s social safety nets. “A strong, healthy economy allows us to protect our most vulnerable,” he said. Mr. Mulvaney was asked about his failure to pay nanny taxes in his opening question, and said that it had been an innocent mistake. “In 2000, we had triplets. When we came home, we hired someone to help my wife, to help take care of the children,” Mr. Mulvaney said. “In my mind, she was a babysitter. ” He added, “I did not consider her a household employee for purposes of withholding. ” Mr. Mulvaney said he had realized his error when filling out a questionnaire related to his nomination to be Mr. Trump’s budget director. He said that he had quickly notified his accountant, the president and his colleagues so that he could correct the mistake. The toughest questions Mr. Mulvaney faced on Tuesday came not from a Democrat but from Senator McCain. He asked Mr. Mulvaney about his record of voting for cuts to military spending, and appeared shocked when he could not remember those votes. “Boy, I’ll tell you, I would remember if I voted to cut our defenses the way you did, congressman,” Mr. McCain said. “Maybe you don’t take it with the seriousness that it deserves. ” Mr. McCain was also unimpressed with Mr. Mulvaney’s explanation for wanting to withdraw all troops from Afghanistan. After giving the congressman a history lesson on the roots of the Sept. 11 attacks, he offered a final note of disapproval. “I am deeply concerned about your lack of support for our military,” he said. Mr. Mulvaney was forced to address suggestions he had made in the past that Social Security was akin to a Ponzi scheme, and he played down that characterization. “I wouldn’t read too much into it, as describing it as a Ponzi scheme,” he said, explaining that he had merely been referring to the fact that the program takes money from people and gives it to other people. As for keeping the program solvent, Mr. Mulvaney said he would not recommend cuts that would cause current retirees to lose benefits. However, he said that he could see raising the age for receiving benefits in the future. Ms. McMahon reassured senators that she would be a vigilant opponent of restrictive government regulations, promising to work to put in place “the right regulations” to spur economic growth if she is confirmed as head of the Small Business Administration. Senator Jim Risch, the Idaho Republican who leads the Committee on Small Business and Entrepreneurship, said the regulatory structure of government today was “strangling businesses. ” Ms. McMahon presented herself not as the billionaire former chief executive of W. W. E. but instead as an entrepreneur who had weathered the most difficult moments of building a business from the ground up. “Small businesses want to feel they can take a risk on expansion or a new hire without fearing onerous new regulations or unexpected taxes, fees and fines that will make such growth unaffordable,” she said. “We want to renew optimism in our economy. ” Ms. McMahon described how she and her husband, Vince, built their global business enterprise from an operation so small they shared a desk. She spoke of how they fought back from an early bankruptcy filing  —   a stark contrast to the wealthy former executive she is today. The McMahons were among Mr. Trump’s biggest campaign donors, having given $6 million to a “super PAC” supporting him last August and September. Ms. McMahon and Mr. Trump go back decades, bound by their shared background in entertainment. The Trump Plaza in Atlantic City hosted the W. W. E. ’s WrestleMania twice in the late 1980s, according to Mr. Trump’s W. W. E. “Superstars” bio, and Mr. Trump became a frequent attendee at the entertainment empire’s events. In 2007, he shaved Mr. McMahon’s head in the wrestling ring after winning a   Battle of the Billionaires wager. Introduced and endorsed by the two Democrats who defeated her in her failed Senate bids in Connecticut  —   Senators Richard Blumenthal and Christopher S. Murphy  —   Ms. McMahon seems likely to sail to confirmation, with the committee expected to approve her next week. The introduction and endorsement of a Republican nominee by two Democratic senators is unusual at the outset of a confirmation hearing. Mr. Murphy, who defeated Ms. McMahon in 2012, expressed “confidence that she is going to give good, sound counsel to President Trump. ” “I saw firsthand the fight that Linda brings to any endeavor she takes on,” he said.'"}, "time": 1742628590.9939106}