{"duration": 0.07060813903808594, "input_args": {"text": "'posted by Eddie Hillary Clinton proposed rigging a foreign election in a 2006 meeting with Jewish Press editors, and now the leaked audio has been posted on the web to prove it. Speaking to the editorial board of the Jewish Press at their office in Brooklyn, Clinton also said it was a mistake to allow Palestinians to hold a democratic election. “ I do not think we should have pushed for an election in the Palestinian territories. I think that was a big mistake ,” said Senator Clinton. “ And if we were going to push for an election, then we should have made sure that we did something to determine who was going to win. ” \\nThe audio tape was never released and has only been heard by the small handful of Jewish Press staffers in the room. According to Eli Chomsky, an editor and writer, his audio cassette is the only recording of the meeting. Nobody had heard it since 2006 – until today when he released it to the world. However mainstream media have attempted to blacklist the story, and Control The Record employees have been actively working to remove it from internet forums and social media. The tape is 45 minutes and contains much that is no longer relevant, but Clinton’s casually delivered comments about denying Palestinians democratic elections – stating that if they must have them, they should be rigged – has taken on new relevance in the midst of persistent allegations from Republicans that the Clinton camp is attempting to rig the Nov. 8 election. Fixing foreign elections Recalling the 2006 meeting, Chomsky says he was taken aback that “ anyone could support the idea—offered by a national political leader, no less—that the U.S. should be in the business of fixing foreign elections .” Clinton also discussed the problem of global terror, and articulated phrases that Trump has accused her being reluctant to use publicly. “ I think you can make the case that whether you call it ‘Islamic terrorism’ or ‘Islamo-fascism,’ whatever the label is we’re going to give to this phenomenon, it’s a threat. It’s a global threat. To Europe, to Israel, to the United States…Therefore we need a global response. It’s a global threat and it needs a global response. Chomsky is then heard asking Clinton a question about potential conflict in Syria – and Clinton gives him an entirely different answer to the public position she is pushing now. In fact, she sounds just like Donald Trump does in 2016. “ Do you think it’s worth talking to Syria—both from the U.S. point [of view] and Israel’s point [of view]? ” Clinton replied, “ You know, I’m pretty much of the mind that I don’t see what it hurts to talk to people. As long as you’re not stupid and giving things away. I mean, we talked to the Soviet Union for 40 years. They invaded Hungary, they invaded Czechoslovakia, they persecuted the Jews, they invaded Afghanistan, they destabilized governments, they put missiles 90 miles from our shores, we never stopped talking to them.” The conversation moves on, but then Clinton returns to the topic. “ But if you say, ‘they’re evil, we’re good, [and] we’re never dealing with them,’ I think you give up a lot of the tools that you need to have in order to defeat them…So I would like to talk to you [the enemy] because I want to know more about you. Because if I want to defeat you, I’ve got to know something more about you. I need different tools to use in my campaign against you. That’s my take on it. ” Chomsky said that he held onto the tapes for all of these years due the Jewish Press’s reluctance to “ say anything offensive about anybody, ” but in the current election rigging climate he considered the contents of the tape to be in the national interest. “ I went to my bosses at the time, ” Chomsky said. “ The Jewish Press had this mindset that they would not want to say anything offensive about anybody—even a direct quote from anyone—in a position of influence because they might need them down the road. My bosses didn’t think it was newsworthy at the time. I was convinced that it was and I held onto it all these years .” source:'"}, "time": 1742628315.4799733}