{"duration": 0.2484574317932129, "input_args": {"text": "'DISPATCHES FROM DANIEL ESPINOSA working to defeat the Big Lie in all its forms In the Manichean universe of US propaganda, the “bad guys” seem to be fond of killing children and bombing hospitals. Having clearly identified the bad guys, the US, its allies and mainstream media ask patiently for a hesitant international community to act on its “Responsibility to Protect”. By now it would seem mainstream media are tired of calling for humanitarian intervention in Eastern Aleppo to stop the Syrian Arab Army and Russian jets, tired of trotting out statistics and quotes from the terrorist/rebel-infested White Helmets (WHs) and the opposition-supporting Syrian Observatory of Human Rights, a one-man operation located in a London suburb, while completely ignoring civilian victims of a rebel force said to be composed of 50% al-Nusra (AKA al Qaeda terrorists. (1) Confident of their media cover, the WHs haven’t been smart enough to hide their ties with the notorious al-Nusra and other terrorist factions and are now in danger of being fairly discredited. (2) At the same time, the SOHR, probably designed as a short-term propaganda asset at a time when rebel/terrorist funding was still obscure and the world didn’t know it was actually Al-Nusra calling the shots in the ´moderate´ opposition side, is also losing credibility. But before the media is no longer able to sustain the lie even among their most uninformed victims, the chant of “the international community must act’ grows louder by the minute. But this time it’s not just client states, lapdog allies and some weak third world ‘regime’, subject to easy de-stabilization, otherwise it would be business as usual: subvert, demonize, invade, set up a facade regime and get ready for the next target. This time there’s Russia to reckon with. And Russia has her own independent reasons to be in Syria, ground zero for world terrorism. Gaddafi murdered by Washington-controlled jihadists. A mafia hit pure and simple, ordered by the biggest mafia outfit on earth. UK’s Daily Mirror, a typical media shill for the imperialists, whitewashing the ugliness of what its masters did. In all these sanctimonious exercises favored by the Western media, in reality little but a Ministry of Disinformation for global capitalism, we should notice the rigid script followed by the press, the lack of options when demanding interventions, as well as a complete lack of any kind of explanation of how their proposed intervention is supposed to take place, as if ‘humanitarian intervention’ meant some sort of magical way to end conflicts and save civilians, all of which shows their complete disregard for the recent past. Many journalists—who by dint of sheer ignorance (they too are subject to the brainwash afflicting most Americans, plus the pressures of careerism) are now lining up behind the ‘no-fly zone’ banner, some of them clearly not knowing exactly what it means, especially its sinister and extremely dangerous implications, but they know something better: Power (and their paychecks) demand it (again). As it did in 2003 when the official initial pretext to rally the country for war, Iraq´s Weapons of Mass Destruction narrative, was losing steam, the people of Iraq —according to our brave media—suddenly started to need ‘freedom’ and ‘protection’, to quote the usual doublespeak. Needles to say the very same same Powers which had ruthlessly imposed a brutal regime of sanctions that killed hundreds of thousands of children and women between 1991 and 2003, were now eager to deliver humanitarian aid. (3) T hose children passed unnoticed by our deeply concerned journalists while the tragedy of their slow-motion death was taking place; their pictures not used to call for any kind of humanitarian relief or intervention, as the corporate media attention to the suffering of civilians tends to be very selective, as Ed Herman and David Peterson explain with typical lucidity in The Politics of Genocide: “When we ourselves commit mass-atrocity crimes, the atrocities are Constructive , our victims are unworthy of our attention and indignation, and never suffer ‘genocide’ at our hands –like the Iraqi untermenschen who have died in such grotesque numbers over the past two decades. But when the perpetrator of mass-atrocity crimes is our enemy or a state targeted by us for destabilization and attack, the converse is true. Then the atrocities are Nefarious and their victims worthy of our focus, sympathy, public displays of solidarity, and calls for inquiry and punishment”. Eight years after Iraq’s 2003 invasion, history repeated itself in Libya, where another putative tyrant was ‘about to commit an atrocity against his own people’, as was suggested by European leaders and a deafening mainstream media chorus. Eventually, the Great Hegemon, with headquarters in Washington, also heard the call for action, and joined the crusade. (Actually, the whole ruse had been plotted in close coordination in the true axis of evil of our time, the Washington-London-Paris triad of international gangsterism, with Obama’s regime this time playing the coy, reluctant imperialist furnishing largely logistical and intel support). According to the British House of Commons Foreign Affairs Committee, which was “unable to visit Tripoli, Benghazi, Tobruk or anywhere else in Libya due to the collapse of internal security and the rule of law” in 2016, “…out of a total Libyan population of 6.3 million people, 3 million people have been impacted by the armed conflict, and 2.4 million people require protection and some form of humanitarian assistance”. (4) For its part, the Human Rights Watch stated, also in 2016, that “…Forces engaged in the conflict continued with impunity to arbitrarily detain, torture, unlawfully kill, indiscriminately attack, abduct and disappear, and forcefully displace people from their homes. The domestic criminal justice system collapsed in most parts of the country, exacerbating the human rights crisis”. (5) This seems to be the paradoxical result of a recent ‘humanitarian intervention’ from which the mainstream media is not morally prepared to take any valuable lessons. Of course, the paradox is nothing of the sort when you understand the real reasons behind the intervention, regarding the French government, and particularly its ex-president Nicolas Sarkozy, as stated by a US State Department intelligence advisor: “A desire to gain a greater share of Libya oil production; Improve his internal political situation in France”, among other supposedly deeply humanitarian causes. The US State Department, as expected, went along with the farce. B ut what is exactly a no-fly zone? According to US Army General Martin Dempsey in a letter to the US Congress in 2013: “This option uses lethal force to prevent the regime from using its military aircraft to bomb and resupply. It would extend air superiority over Syria by neutralizing the regime’s advanced, defense integrated air defense system. It would also shoot down adversary aircraft and strike airfields, aircraft on the ground, and supporting infrastructure… Risks include the loss of U.S. aircraft, which would require us to insert personnel recovery forces. It may also fail to reduce the violence…” And going back to the House of Commons assessments of 2016, when “…France and UK argued that the international community should simply impose a no-fly zone… former US Ambassador to NATO, Ivo Daalder, pointed out: ´Cameron was pushing for a no-fly zone, but in the US there was great skepticism. A no-fly zone wasn´t effective in Bosnia, it wasn’t effective in Iraq, and probably wasn’t going to be effective in Libya… Gaddafi was attacking people. A no-fly zone wasn’t going to stop him. Instead, to stop him we would need to bomb his forces attacking people.’” Of course, Daalder was describing the ineffectiveness of a NFZ while pushing for stronger measures. The crime of “optional imperialist war” remained the same, regardless of the methods eventually used. Similarities with the Syrian ‘civilian’ uprising of 2011 abound, as UK Former Chief of Defense Staff Lord Richards of Herstmonceux later confirmed, intelligence on the composition of the rebel militias was not ‘as good as one would wish’, and when these rebels with affiliations to Al-Qaeda finally got their hands on the “tyrant”—a man who had on numerous occasions been feted in Italy and France’s capitals, and who had built one of the most advanced social safety nets for his people—they simply do what jackals do, they tortured and murdered him, with the mainstream media, particularly in England and the US, reacting in a fashion that would make hyenas look like sheep: under headlines like “Mad Dog Put Down” most front pages showed gruesome pictures of Gaddafi’s last moments, the word ’murdered’ nowhere to be found. Demonized “tyrants” aren´t murdered, they are executed or, as the New York Post stated: “Killed by a Yankee Fan”, in a humorous reference to a boy wearing a New York Yankees cap among the killers. (6) The New York Times’ Kareem Fahim refers to the “trophies of war”, in an article filled with pictures of Gaddafi’s and one of his sons’ dead bodies surrounded by cheering men, where any other “trophy”, as his golden gun, is only mentioned briefly to give the idea he isn´t referring to the corpses. (7) Andrew Gilligan wrote in the Telegraph: “the one thing Gaddafi retained to the very end was his ability to put on a show…” (8). Ability shared by many journalists when cheering for interventions known for causing worse catastrophes than those that supposedly caused the intervention in the first place. Many rationales are given for the explicit, openly celebratory content. As Chris Elliot, The Guardian’s reader’s editor explains: “ On reflection – and having read the complaints – I feel less convinced about the way we used these photographs, although I still feel strongly that they are an important part of this story and should have been used. The scale of the photo on the newspaper front page of 21 October and prominent picture use on the website took us too close to appearing to revel in the killing rather than reporting it”. (Emphasis added). This reveling over Gaddafi’s corpse reflects the celebration of an establishment victory by its subservient propaganda media, but it also served to focus attention away from the unlawful killing of many others, and the exact details of how the killing took place. As Media Lens observed: “…but there was more than the lonely killing of a “tyrant” that went unreported. Human Rights Watch reported that between six and ten people appeared to have been executed at the scene of the Libyan leader’s capture. Around 95 bodies were found in the immediate vicinity, many of them victims of NATO airstrikes. In fact, it is clear that NATO, with the assistance of Special Forces (although ground troops were strictly forbidden by UN resolution 1973), had maintained a no-drive zone around Sirte: a crucial factor facilitating the murder of Gaddafi. CBS reported 572 bodies ‘and counting’ in Sirte, including 300, ‘many of them with their hands tied behind their backs and shot in the head’, collected and buried in a mass grave”. (9) (Emphasis added) There should be little doubt regarding the reasons behind the selective use of pictures of bloodied children by mainstream media (and many NGOs), especially when they endorse calls for ‘humanitarian intervention’ against governments previously targeted for regime change, as it has already been clearly established in the case of Syria long before the 2011 uprising, via many US secret documents revealed by WikiLeaks. Propaganda is particularly transparent in this case: create a sense of guilt and impotence, prepare public opinion to demand what has already been planned elsewhere, in the darker councils of unaccountable power. The scandalous double-standard that selectively shows the suffering of “worthy” children while hiding the pain and death of those victimized for sordid reasons by the “Exceptional Nation” and its equally murderous accomplices dressed in civilized garb, is the great hypocrisy of our time, flowing smoothly from its deeply corrupt DNA. The obvious options such as putting an end to the funding of ‘moderates’ by the US, in reality the open funding of terrorists, is never considered, as important facts contradicting the official imperialist narrative are systematically omitted by the “Free Press.” Notes: Ruptly Tv. LIVE: UN Security Council meets to discuss situation in Syria. ( Online Video clip) Youtube, published on 09/25/16. [Recoverd: 10/13/16 (CHECK min. 28) at: https://www.youtube.com/watch?v=dx3XbFYqOoo] RT. ‘Intl. community still financing & protecting terrorists’ –Mother Agnes . (Online video clip) Youtube, published 10/25/16 [recovered 10/28/16 from: https://www.youtube.com/watch?v=qbUTnSsNbfc ] Shah, Anup. Effects on Iraq Sanctions . (Global Issues, 10/02/05) [http://www.globalissues.org/article/105/effects-of-sanctions] House of Commons Foreign Affairs Committee. Libya: Examination of intervention and collapse and the UK’s future policy options. Third Report of Session 2016-17 (UK Parliament, 09/14/16) [http://www.publications.parliament.uk/pa/cm201617/cmselect/cmfaff/119/119.pdf] Quoted in HCFAC (note 4). The Guardian. Gaddafi dead: the front pages – In pictures . (The Guardian, 10/21/11) [https://www.theguardian.com/media/gallery/2011/oct/21/gaddafi-dead-front-pages] Fahim, Kareem. After Making Capture in Pipe, Displaying the Trophies of War . (New York Times, 10/20/11) [ http://www.nytimes.com/2011/10/21/world/africa/brutalized-libyan-city-rejoices-with-gruesome-trophies-of-war.html ] Quoted in: Media Lens. Killing Gaddafi . (Media Lens, 10/27/11) [http://www.medialens.org/index.php/alerts/alert-archive/2011/653-killing-gaddafi.html] Ibid. ABOUT THE AUTHOR Associate Editor Daniel Espinosa Winder (34) lives in Caraz, a small city in the Andes of Peru. He graduated in Communication Sciences in Lima and started researching mainstream media and more specifically, propaganda. His writings are a often a critique of the role of mass media in our society. Daniel also serves as Editorial Director for TGP’s Spanish Language edition. =SUBSCRIBE TODAY! NOTHING TO LOSE, EVERYTHING TO GAIN.= free • safe • invaluable If you appreciate our articles, do the right thing and let us know by subscribing. It’s free and it implies no obligation to you— ever. We just want to have a way to reach our most loyal readers on important occasions when their input is necessary. In return you get our email newsletter compiling the best of The Greanville Post several times a week.'"}, "time": 1742564480.2926686}