{"duration": 0.02656841278076172, "input_args": {"text": "'The uproar at the University of Notre Dame over Vice President Mike Pence’s upcoming commencement address has escalated, as students are now claiming that his presence on campus will make them feel “unsafe. ”[Seniors Imanne Mondane and Jourdyhn Williams have started a whiteboard message campaign to express their concern over the selection of Mike Pence as the university’s commencement speaker. Over the past week, Mondane and Williams have taken photographs of students with quotations from Pence that the two seniors feel are “racist, sexist, homophobic, xenophobic. ”  “For me personally, [Pence] represents the larger Trump administration,” Senior Immane Mondane told The Observer, the   newspaper of the University of Notre Dame and the nearby St. Mary’s College.  “His administration represents something, and for many people on our campus, it makes them feel unsafe to have someone who openly is offensive but also demeaning of their humanity and of their life and of their identity. ” “I know that during his time as governor of Indiana and also during his campaign trail, along with Trump, he has made offensive statements towards minority groups that affect me, like women and ” Williams claimed. Williams argues that the selection of Pence as the university’s commencement speaker contradicts with the school’s Catholic mission. “I feel that is offensive to such a large population here at Notre Dame, and I also believe it goes against certain Catholic Social Teaching, which is something the University likes to broadcast that it stands behind, but it picks and chooses when it wants to stand behind them,” Williams complained. Encouragingly, Mondane has organized a discussion on her concerns and has invited students of all political persuasions to attend and voice their opinions. “We’re going to have a   discussion in the weeks to come,” Mondane said. “Everyone is welcome to the discussion, and we’re going to have an event and advertise, but we really want to get the voices there who may not agree with us and who may take issue with what we’re doing. We both have an equal platform, and we’re on an equal playing field where one narrative isn’t totally dominant of the other. ” Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742563273.5003686}