{"duration": 0.085906982421875, "input_args": {"text": "'The arrival of new media, like The Duran and so many others, are helping to educate a public increasingly sick and tired of illegal war. By Adam Garrie The Duran October 28, 2016 \\nIn many ways, George Bush and Tony Blair’s war on Iraq feels like yesterday. Colin Powell’s jewel case of lies before the UN, Tony Blair’s Parliamentary debate during which he listened neither to reason nor to warnings, the ‘shock, and awe’ of bombs being dropped on Iraq’s great cities, Bush’s ‘mission accomplished’ farce and the war which continued for years after, one which still is ongoing; all of it feels surreally fresh. \\nAlmost 14 years later, the lessons of Iraq are well known: illegally invade a sovereign country which threatens no one and expect hell, instability, blood, torture and terror as a consequence. The lessons were not remembered by Hillary Clinton who along with David Cameron and Nicholas Sarkozy dragged a hesitant Barack Obama into a war in Libya, a war whose outcome is even more disastrous than the war in Iraq. \\nThe wider public, however, have learned the lessons. Both in Europe and in America, the general public are fed up of war. Some are too naïve or too arrogant to openly associate themselves with those of us who warned of the dangers a war on Iraq would unleash. But they too have learned the lessons. It is one of the reasons Donald Trump continually states his opposition to the war in Iraq which then Senator Hillary Clinton voted for. \\nThis is why the mainstream media are in fits of hysterics trying to do the bidding of their war monger masters in attempting to convince the public to support doing to Assad what was illegally done to Saddam and Gaddafi.Since 2003 not only have the lessons of Iraq been instructive to erstwhile war supporters in the west, the media landscape has also changed significantly. Television channels like RT did not exist in 2003 but now they present rational claims from not just the west but around the world, against the calls for war. \\nIn hindsight, the internet had not fully blossomed by 2003, much though it felt that it had done at the time. Today many news and analysis websites put the failing newspapers to shame. They are an instantaneous source of valuable information. \\nWikileaks did not exist in 2003, but since its inception in 2006, it has blown the lid on the sadistic things governments do, how they do them and the sinister motives behind them. One cannot dismiss oppositional viewpoints as conspiratorial when one reads the documents which speak the truth in black and white. \\nBut most importantly yet surprisingly least talked about, is the fact that Syrians have the internet, they have cameras, they have websites and they are using them. In 2003, the western media attempted to demonize the proud and highly educated Iraqi people either as gangs of Saddamite stooges or as opposed unpatriotic invalids without minds. Because of the poor education system in countries like America, many believed this without ‘questioning more’. \\nToday, though, no matter what the mainstream media say, the voices of the Syrian people cannot be drowned out. \\nIndeed, The Duran frequently publishes pieces by Afra’a Dagher , an actual Syrian as opposed to Samantha Power who pretends to speak for Syrians against their wishes. There are videos on youtube, statements in English from Syrian journalists, experts, and the legitimate government. This are being read and circulated on social media. The mainstream media monopoly is over. \\nIt is often viewed as a platitude to say that ideas and the dissemination of ideas can change the world. But the aggregate effect of opposition media like RT, Wikileaks, online expert opinion and analysis and the power of social media may well have saved Syria from the fate of Yugoslavia, Iraq, and Libya. Tags:'"}, "time": 1742561875.8226335}