{"duration": 0.07880949974060059, "input_args": {"text": "'Gefilte fish, of course. Potato kugel, sure. But sushi? Yes, sushi, which you won’t find in most   Jewish cookbooks, let alone the Torah, has become a runaway hit in the city’s Hasidic and other Orthodox Jewish precincts. Orthodox Jews are eating dragon rolls, rainbow rolls, tsunami rolls and California rolls (using imitation crab) in sushi bars like Sushi Meshuga in Brooklyn or in more eclectic kosher restaurants and supermarkets. Weddings and bar mitzvahs aren’t complete without a sushi station, and a sushi platter has become the gift of choice for Hanukkah and Purim, or to congratulate parents who are marrying off a child. Pincus Yoel Freund, a managing partner of the firm that runs a leading sushi distributor, Sushi Maven, estimates that there are over 50 sushi bars in restaurants and grocery stores just in Borough Park, the city’s largest Hasidic neighborhood, with at least another 50 in other parts of Brooklyn like Williamsburg, Crown Heights and Midwood. He says most have cropped up in the past five to 10 years. Rabbi Moshe Elefant, chief operating officer of the kosher division of the Orthodox Union, the world’s largest kosher certifier, said 80 to 90 percent of the city’s 100 kosher restaurants now serve sushi. “It used to be that what defined a Jewish community was a synagogue and a kosher butcher,” he said. “Then it was a kosher pizza shop. Now it’s a kosher sushi shop. ” Rabbi Elefant said he recently visited the family of his daughter Malkie in Waterbury, Conn. for a traditional Friday night meal. For appetizers she paired gefilte fish with a platter of sushi that she rolled herself. Those were eaten with gusto, as were the Sabbath standards like chicken soup, roast chicken and potato kugel. (“It’s Friday night, it’s a mitzvah to eat,” Rabbi Elefant said, defending the size of the meal.) The reasons for the sudden explosion are not certain. “I can tell you the when and the what,” Rabbi Elefant said, “but not the why. ” Interviews with sushi customers and purveyors suggest that a major motivation is that sushi offers a relatively quick meal that is pareve  —   neither meat nor dairy, according to ancient Jewish laws that keep those categories of foods strictly separate. Most Orthodox Jews in New York will not eat a dairy product like ice cream for six hours after eating meat, nor eat a meat product for a   after consuming dairy. But fish can be eaten with both meat and dairy, as long as it is a kosher species like tuna, salmon and yellowtail, which meet the biblical requirement in Leviticus 11:9 that consumable aquatic creatures have fins and scales. Eel and catfish do not qualify, and all manner of shellfish are verboten. Its dietary flexibility gives sushi a distinct advantage over such fast foods as hamburger or cheesy pizza. “You can eat it anytime,” Chiya Yosopov, owner of the snug Noribar at the corner of 13th Avenue and 54th Street in Borough Park, said as he scribbled down takeout orders through a telephone headset and from groups of bewigged Hasidic women and bearded Hasidic men with ritual fringes hanging below their shirts. All the while, Tony Zhang, a   sushi chef, was expertly slicing those orders. Mealtime at Noribar is a phenomenon to behold. At one table, Diane Weinberger, 18, was wielding wooden chopsticks on a salmon avocado roll and chatting with Leah Heiman, also 18. The friends had decided to take a coffee break from classes at Bnos Yaakov High School and to stop in Noribar for a snack. “You don’t have to be hungry to eat it,” Ms. Weinberger said. “It’s very easy you have your protein, carbohydrates and vegetables all in one. ” Another diner, Elliot Schreiber, a vice president of a travel agency in Borough Park, said his office periodically ordered in a lunch for its staff of about 30, and where once a plate of bagels, lox and cream cheese was the pièce de résistance, now it is a sushi platter. His    daughter, Ilana, he said, prefers sushi to pizza and French fries. While the Orthodox have grown more fastidious about making sure the products they consume are rigorously kosher, they also increasingly take notice of foods popular in the wider culture, adapting French, Indian, Italian and steakhouse dishes to kosher specifications. Now it’s sushi. “It takes us time to catch up,” said Rabbi Elefant. According to Elan Kornblum, publisher of the trade magazine Great Kosher Restaurants, three kosher restaurants started offering sushi in the  . Others slowly added sushi to their menu, but it took many years to assure that all the ingredients used in sushi meals, like rice paper, wasabi and sesame seeds, could be manufactured in volume to kosher standards, said Mr. Freund, of Sushi Maven. His firm, Freund’s, also operates a traditional fish market and a restaurant. Rabbis are sent to inspect the products and practices of suppliers in distant lands like Vietnam, where Freund’s rice paper originates. So passionate are some connoisseurs for their sushi that on Passover  —   the   holiday when grain products are forbidden and Ashkenazi Jews will not eat rice as well because it is seen as too similar to grains  —   they will use quinoa, a botanical relative of spinach and beets, to satisfy their craving for salmon and tuna rolls. The varieties of sushi eaten in kosher restaurants are not quite the same as those found elsewhere. Sushi restaurant owners acknowledge that many Orthodox Jews have not quite cottoned to raw salmon, tuna or yellowtail. So the restaurants offer smoked salmon or cooked tuna in various combinations with seasoned rice as well as the raw form. “People are still apprehensive,” said Mr. Kornblum, the   publisher. “Raw fish was something we’re not used to. We eat herring, but it’s pickled. But people watch the Food Network and you kind of fantasize, ‘If only I could ever have that. ’” There remains much about sushi to make a kosher Jew uncomfortable. Using the word “crab” on a menu has proved controversial even if the substitute is actually shredded Alaskan pollock. So some restaurants refer to mock crab by the Japanese name, kani. Sushi Meshuga even had to change the name of its Borough Park branch to Sushi Meshuna (which means “strange” in Hebrew) because local rabbis did not like the association of kosher food with the Yiddish word for crazy. “Borough Park politics,” Nathan Etgar, manager of the    store on 13th Avenue, said with a cynical chuckle. Some restaurants won’t even use the word dragon for their rolls, even though the dragon is a mythical reptile. That’s because actual reptiles are not kosher. Sushi still has the power to surprise. Sushi Maven has been wholesaling fish and sushi supplies for 10 years, with   bags of special rice, boxes of ginger and sesame seeds piled high in its warehouse, all certified by rabbis as kosher. “It’s a business now,” said Moshe Stern, the warehouse manager as he looked over the heaping shelves. “Sushi! Who would have imagined years ago?”'"}, "time": 1742628529.202337}