{"duration": 0.15193867683410645, "input_args": {"text": "'Michael Eisen, an evolutionary biologist, is among the elite of American scientists, with a tenured position at the University of California, Berkeley, and generous funding from the Howard Hughes Medical Institute for his research on fruit flies. But late last month, dismayed over the Trump administration’s apparent disdain for evidence on climate change and other issues, Dr. Eisen registered the Twitter handle @SenatorPhD and declared his intention to run in the 2018 election for a seat in the United States Senate from California. His campaign slogan: “Liberty, Equality, Reality. ” “I’m not sure I’m the best vehicle for this,” said Dr. Eisen, whose professional attire consists of shorts and   bearing mottos supporting open access to scientific literature, a cause he has championed. “But if we want to defend the role of science in policy making, scientists need to run for office. ” Since Mr. Trump’s election, many other scientists have expressed concern about rumors and public statements on the new administration’s views on science, climate change and the role of federal offices like the Environmental Protection Agency. Mr. Trump has called climate change a hoax (although more recently said he would have an “open mind” about it) and appointed some officials to his transition team who dispute mainstream climate science. But there is much that is still unclear about his administration’s attitudes toward science. The president has yet to appoint a science adviser and has not responded to open letters calling on him to do so from science policy groups including the American Association for the Advancement of Science (whose president, Rush D. Holt, is a physicist and former congressman). Few scientists have gone as far as Dr. Eisen, but other researchers are now undergoing a political awakening, contemplating what their role should be for at least the next few years. “There are many conversations going on right now,” said Naomi Oreskes, a historian of science at Harvard who spoke at one of the first     protests, a rally in San Francisco during the annual meeting of the American Geophysical Union in December. “Many scientists do feel that the time for sitting on the sidelines is past. ” A political action committee that seeks to get more scientists and engineers to run for elective office, 314 Action, has seen a surge of interest in its programs, with more than 2, 000 people registering at its website. The group is planning a training program for   whether they want to run for local or state offices or Congress. Other scientists have organized demonstrations  —   including a march now set for Earth Day, April 22  —   submitted letters or opinion articles to news organizations or joined efforts to preserve government data that they fear may otherwise disappear. Individuals and groups have also spoken out against Mr. Trump’s executive order restricting travel for citizens of Iran, Iraq and five other countries, an action that has affected some researchers. But an activist role is not an easy fit for many scientists. “I have plenty of colleagues who say, ‘Leave me alone in my lab,’” said Jonathan Overpeck, director of the Institute for the Environment at the University of Arizona. Still, he has seen more scientists take at least the first steps toward mobilization. “Right now it’s mostly talking about what to do,” he said. “We’re scientists  —   we tend to plan very carefully what we do and then we try to do it well. But certainly there’s an elevated sense that this is very real. ” That sense has motivated hundreds of student and faculty volunteers at nearly a dozen universities to participate in “data rescue” events over the last two months, the most recent of which was held this weekend at New York University. After a brief training session, participants spent six hours archiving environmental data from government websites, including those of the National Oceanic and Atmospheric Administration and the Interior Department. An anonymous donor has provided storage on Amazon servers, and the information can be searched from a website at the University of Pennsylvania called Data Refuge. Though the Federal Records Act theoretically protects government data from deletion, scientists who rely on it say would rather be safe than sorry. “For a problem like climate change, you can’t understand it if you don’t have data,” said Jerome Whitington, an environmental anthropologist and member of the   group Environmental Data Governance Initiative, which sponsored the N. Y. U. event. Much of the concern among scientists has been centered on the E. P. A. which was a favorite target of Mr. Trump during the campaign. Comments by members of his transition team have led to speculation that the new administration would gut the agency’s science staff. Although he said he was speaking only for himself, Myron Ebell, who headed the E. P. A. transition but left on Jan. 19, said in a recent interview that science within the agency had become too politicized. “I’m a great believer in science,” Mr. Ebell said, “but I’m not a great believer in politicized science. ” Many scientists would argue that it is climate deniers and others who are politicized. The question of whether scientists should take sides politically is an old one, with the widespread and   view among many researchers that they should be quiet and let their data speak for itself. Some scientists have objected to plans for the Washington march, arguing that the event will feed the view among many conservatives that scientists have a political agenda. But the idea that they should be above the fray has been slowly unraveling as researchers realize that their own aloofness may largely be to blame for public disregard for the evidence on issues like climate change or vaccine safety. And in the era of Trump, some say it could finally come completely apart. “I think that many people have moved well beyond that,” said Andrew Rosenberg, director of the Center for Science and Democracy at the Union of Concerned Scientists, which is enlisting scientists to monitor what is occurring in federal agencies. “It’s nonsense  —   you need to follow your own heart. You can do science and still be a good citizen. ” Youth is leading the way in rejecting the old view, Mr. Rosenberg said. “Early career scientists, younger scientists  —   that’s not an answer for them,” he said. Chanda   a cosmologist and particle physicist at the University of Washington, is one of those younger researchers. She has long been politically active  —   she comes from a family of organizers and attended her first demonstration when she was 2 months old  —   but for her the talk and actions of the Trump administration have led to a new level of concern. Dr.   said she was especially incensed by what she and others viewed as efforts by some science organizations to reach out to the Trump administration. Immediately after the election, she took to social media to criticize a news release from the American Physical Society that urged President Trump to strengthen scientific leadership and quoted his campaign slogan, “Make America Great Again. ” “What history has taught us is that collaboration doesn’t work for science,” Dr.   said. “When we work with extremist, racist, Islamophobic or nationalist governments, it doesn’t work for science. ” The news release was quickly withdrawn and the society apologized for any “offense it might have caused. ” Michael Lubell, a physics professor who was director of public affairs for the society but who was terminated without explanation, said that “initially people were very worried that if anybody criticized Donald Trump there would be retribution. ” “People are now getting to the point where they are understanding that this is a guy in the White House who doesn’t have a firm grasp on science policy at all,” Dr. Lubell said. “Now they are mobilizing. But there’s absolutely no strategy. ” Dr. Eisen, the Berkeley biologist, would seem to have slim chances of winning a race for the Senate, since it is sure to be joined by several prominent Democrats if Dianne Feinstein, the longtime incumbent, decides not to run. But Jacquelyn Gill, a   at the University of Maine’s Climate Change Institute, has been actively recruited to  —   eventually  —   make a bid for a congressional seat by 314 Action, ever since she was quoted in the journal Nature urging her fellow scientists to “do more than write letters. ” Staff members at 314 Action (which takes its name from the number pi) liked her attitude, and she happens to live in a swing district. Like many academic scientists, Dr. Gill employs several graduate students in her laboratory and has received grant funds for research that is still in progress. But the idea of public service, at what she considers an urgent time for climate science, is tugging at her. “I came into this career wanting to do science that’s in the public good,” she said. “And maybe now that means something different than it did before. ”'"}, "time": 1742563409.0848787}