{"duration": 0.0479581356048584, "input_args": {"text": "'S Korea coast guard opens fire on China boats 11/02/2016 \\nPRESS TV \\nSouth Korean coast guard vessels have opened fire on Chinese trawlers allegedly fishing illegally off South Korea’s coast, prompting Beijing to censure Seoul. \\nOn Wednesday, senior coast guard official Kim Jung-shik said the order to fire machine guns had been given during a confrontation with some 30 Chinese fishing boats. \\nThe Chinese vessels had been allegedly operating illegally near South Korea’s Yellow Sea border with North Korea on Tuesday. \\n“They tried to ram our ships although we repeatedly warned them,” Yonhap news agency quoted Kim as saying. \\nThe South Korean coast guard forces initially fired into the air but were later ordered to fire on the bows of the trawlers. \\n“I thought our officers would be in danger if I allowed any more resistance so we ended up using the crew service weapon,” Kim said. \\nTwo Chinese boats were seized in the incident, which reportedly caused no casualties. \\nThe machine gun shootout is the first of its kind since the South Korean coast guard declared in September that it would apply a “more aggressive” firearms policy with Chinese boats. \\nThe shooting left Beijing “strongly dissatisfied” with China’s Foreign Ministry calling on Seoul to “discipline” its coast guard. \\n“Using destructive weapons can easily hurt fishermen and we urge the ROK (South Korea) side to … avoid using any excessive or extreme tools in their law enforcement activities,” said China’s Foreign Ministry spokeswoman Hua Chunying. \\nNumerous incidents have occurred in recent years between South Korea’s coast guard and Chinese fishing boats venturing across international waters in search of fish. \\nOn October 10, Seoul said it had lodged a formal complaint with Beijing over the alleged sinking of a South Korean coast guard vessel by Chinese fishermen on October 7. \\nOn September 29, three Chinese fishermen died after their fishing boat was set on fire by South Korean coast guard members who threw grenades into their vessel.'"}, "time": 1742564063.9991715}