{"duration": 0.07638788223266602, "input_args": {"text": "'Prime Minister Justin Trudeau of Canada would like the world to know that he was rather fond of Fidel Castro. Or at least, that is the message that many people took from his unusually warm statement on the death of the Cuban dictator, whom he hailed on Saturday as “a remarkable leader. ” “Fidel Castro was a larger than life leader who served his people for almost half a century,” Mr. Trudeau said in the statement, which was issued while he attended a summit meeting in Madagascar. He described Mr. Castro, who ruled as a Communist autocrat for almost 50 years, as “Cuba’s longest serving President. ” “While a controversial figure, both Mr. Castro’s supporters and detractors recognized his tremendous dedication and love for the Cuban people who had a deep and lasting affection for ‘el Comandante,’” Mr. Trudeau continued. He added that Mr. Castro was “a legendary revolutionary and orator” whose death had brought him “deep sorrow. ” “I know my father was very proud to call him a friend and I had the opportunity to meet Fidel when my father passed away,” Mr. Trudeau said. (His father, Pierre Trudeau, served as prime minister for over 15 years.) “It was also a real honour to meet his three sons and his brother President Raúl Castro during my recent visit to Cuba. ” Justin Trudeau’s affectionate comments were a radical departure from American reactions to Mr. Castro’s death  —   the White House diplomatically said it hoped for warmer relations with Cuba, while   Donald J. Trump gleefully posted on Twitter, “Fidel Castro is dead!”  —   and his statement was quickly condemned by political observers in both the United States and Canada. Senator Marco Rubio of Florida, who is   called the Canadian leader’s remarks “shameful and embarrassing. ” Senator Ted Cruz of Texas, another   said Mr. Trudeau’s statement was “disgraceful” and accused him of “slobbering adulation” of Mr. Castro. In Canada, several members of the opposition Conservative Party condemned Mr. Trudeau’s statement. Kellie Leitch, a lawmaker running for the party’s leadership, criticized the prime minister for his “fawning characterization” of Mr. Castro. Maxime Bernier, another Conservative leadership candidate, called Mr. Trudeau’s praise “repugnant” and rebuked him for suggesting that the Cuban leader’s decades in power had amounted to a form of public service. Mr. Trudeau’s statement also generated a tidal wave of agitated online mockery, the kind of social media blowback to which the telegenic and infinitely   prime minister is rarely subjected. In a wink to the moment that brought Mr. Trudeau to national prominence  —   his televised eulogy for his father in 2000  —   jokes about his statement were organized under the hashtag #trudeaueulogies, where critics imagined him waxing poetic about some of history’s great villains. The United States broke off diplomatic relations with Cuba in 1961 and imposed an embargo on the island for decades, but Canada never pursued similar policies. It began formal diplomatic relations with Cuba in 1945 and maintained them throughout the Cold War, when Mr. Trudeau’s father developed a warm relationship with Mr. Castro. Pierre Trudeau was the first leader of a NATO member state to visit communist Cuba in 1976, and Mr. Castro served as an honorary pallbearer at his funeral, according to the Canadian Broadcasting Corporation.'"}, "time": 1742628335.8409836}