{"duration": 0.03470611572265625, "input_args": {"text": "'Amazon announced on Wednesday that it would build a homeless shelter inside of its Seattle HQ, donating nearly 50, 000 square feet to the project. [65 rooms will be built for the shelter, which is being planned in partnership with nonprofit organization Mary’s Place, providing space for more than 200 homeless people every night.  “Mary’s Place does incredible,   work every day for women, children, and families experiencing homelessness in the Seattle community,” said Amazon CEO Jeff Bezos in a statement. “We are lucky to count them as neighbors and thrilled to offer them a permanent home within our downtown Seattle headquarters. ” According to CNN, “The new Mary’s Place shelter will open in early 2020. It will also have a resource center like those the nonprofit offers in North Seattle and White Center, where   local nonprofits and volunteers work with staff to help families obtain employment and permanent housing. ” In 2016, Amazon partnered with Mary’s Place to temporarily house 200 homeless people in an empty building on its Seattle campus. Since last year, Amazon customers have also been able to order items from the Mary’s Place wishlist, “such as diapers and socks. ” “To have a permanent downtown Seattle location within Amazon is a   for Mary’s Place and the families we serve,” declared Marty Hartman, Executive Director of Mary’s Place. “We’ve loved being Amazon’s neighbor, and now the opportunity to move into their headquarters permanently is truly a dream come true. This unique,     shelter will remind families that they matter and that their community wants to help them succeed. ” “Amazon employees are frequent visitors and volunteers at the existing shelter  —   bringing meals, organizing arts and crafts projects, throwing parties for the families, and more,” claimed the nonprofit group in a blog post. “By sharing permanent space with Mary’s Place, Amazon employees will now have even more opportunities to volunteer and support the organization and the families they serve. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742564169.7395577}