{"duration": 0.17209172248840332, "input_args": {"text": "'In the escalating rhetoric of public shaming, being embarrassed online is tantamount to being wiped from the face of the earth. Whenever a   host upbraids a public figure in a monologue or a pundit bests another in a Twitter fight, onlookers crowd around to declare the loser DESTROYED! or EVISCERATED! or ETHERED! or ANNIHILATED! But alongside these symbols of destruction has risen another, more apt metaphor for the dynamics of the modern media power play. In this one, the defeated party wasn’t killed, but possessed: They got OWNED. When the white nationalist Richard Spencer approvingly posted a song from “Cabaret” on Twitter in March, former Missouri Secretary of State Jason Kander swooped in to say: “Hey, buddy, that song you love was written by my uncle. He’s been married to my other uncle for 40 years. And he’s a Jew. ” A Twitter bystander waded into Spencer’s mentions and observed: “You get publicly owned with astonishing frequency, it’s really wonderful. ” Ownage can be politically urgent or purely irreverent. When the Slate editor Gabriel Roth complained about  ’u200bWebster Dictionary’s overly   attitude toward changes in usage  —   “I feel like @MerriamWebster is turning into the ‘chill’ parent who lets your friends come over and get high,” he wrote on Twitter  —   the account replied: “No one cares how you feel. ” Dozens piled on to rub it in: “You got owned by the dictionary. ” On the internet, where rhetorical victories are so fleeting, the phrase is oddly satisfying: It’s a passing but dramatic staking of argumentative ground. “Owned” is borrowed from hacker slang. If you got owned, that meant some hacker jimmied the lock on a virtual back door, snooped around your property and rifled through your stuff. The word speaks of a literal possession: annexing another person’s virtual space and stealing private information. But “you got owned” also animates a simple theft with a violent spark. Owning someone isn’t just about taking his things it’s about diminishing him as a person. With enough specialized technical knowledge, you can actually seize control of another human being, or at least the person’s virtual presence. Among hackers, ownage often works as a form of community discipline. In the early aughts, underground online zines like Zero for Owned  —   ZF0 for short  —   emerged as sites for hackers to detail how they broke into the systems of prominent security professionals and fellow hackers to shame them for overstating their skills. “We believe actions speak louder than words,” the first issue of Zero for Owned announced. “While you were talking trash, we were sifting through your files, reading your conversations, owning more boxes”  —   computers  —   “on your networks, and you had no idea. ” The zines spread around their targets’ website code and personal communications as punishment. By finding gaps in the technological skill of famous hackers, the creators of these zines justified the release of the private information the hackers had failed to protect. Now, as information security has become increasingly central to both global politics and personal relationships, “owned” has migrated from the online underground to the mainstream. There has never been a stronger relationship between who we are perceived to be and what kind of information we have. Recent concerns over “filter bubbles,” “fake news” and political memes churned out by Russian trolls lay bare the fact that our beliefs are controlled by the data we consume. Information silos make us vulnerable to being owned not only because of our ignorance  —   the things we don’t know  —   but also because of how little control we have over the things we do know. We’re constantly open to exposure. The hacking and release of emails from Hillary Clinton’s campaign chairman, John Podesta, and from the Democratic National Committee didn’t reveal any bombshells, but they succeeded in scandalizing through the simple act of making the private public. Now President Trump tweets conspiratorially about “leaks” and “wiretapping,” fixated on the idea that his political rivals have acquired or released his secrets  —   and obsessed with the suggestion that he is somehow an illegitimate president. The threat of getting owned  —   being revealed as oblivious, uninformed or incompetent  —   works like a virtual Panopticon to keep people in a state of anxiety, keen to guard their own insecurities as they poke at other people’s flaws. For thinkers throughout history, owning things was seen not just as useful and pleasant, but also as a source of human virtue. Aristotle argued that “the meaner sort of workman,” by virtue of his lack of possessions, was “too degraded” to participate in politics and contribute to society. Hegel thought that owning things was a way for people to externalize their personal freedom. “It is in possession first of all that the person becomes rational,” he wrote in “Philosophy of Right. ” And of course there is the obvious strangeness in talking about people “owning” one another online in a nation where, for a very long time, people did own other people  —   and where many of them argued that this was an ennobling endeavor for everyone involved. The antebellum statesman John Calhoun defended owning slaves as a “positive good. ” More recently, our celebration of ownership has pointed inward. We speak approvingly of “coming into one’s own” or “being one’s own person. ” To be “ ” is to be confident and poised. Ownage just turns that   back outward: Now we wield our superior knowledge and skills over our rivals. In the hacking context, owning someone is all about a display of superior technological abilities. When the word migrated from hacking to gaming, “owned” became a mantra for those who had mastered the game play or bested opponents. Now it extends to rhetorical force  —   a   and withering joke or an irrefutable debate line. After the “Saturday Night Live” comedian Leslie Jones was hacked  —   her private photographs were stolen and spread across the web  —   Complex magazine’s Daniel Barna said that she “owned her hackers” in an “S. N. L. ” monologue. Ownage radiates power. “Owned” and its derivative, “pwned” (pronounced any number of ways, but mostly “poned”) are bits of leetspeak  —   “leet” as in “elite. ” If pidgin languages create a simplified slang to foster   communication, leetspeak deliberately complicates the root language, replacing letters with numbers and symbols and swapping characters. It’s an ideal code for people who believe their mastery of the internet has raised them to a higher plane of existence. “Pwnage” creates an   and an   and furthers the fetishization of specialized knowledge down to the level of casual conversation. The mainstreaming of “owned” has always come with a bit of a wink, an acknowledgment that those most eager to lord their superior knowledge over others often have the biggest blind spots. That was the dynamic that fueled the hacker zines, in which the owners got owned. As the usage of “owned” spread, it also was mixed with stereotypes of hackers and gamers as being socially awkward. That underlying paradox of the gamer persona fueled the   web series “Pure Pwnage,” which followed a kid named Jeremy who was highly skilled at video games but a failure at real life. Now ownage communicates dominance, but it also belies an underlying impotence. All of this has set the stage for ownage’s latest twist: the rise of the  . If an own exposes another person’s ignorance, a   reveals your own obliviousness. During the campaign, Bobby Jindal tried to insult President Trump on Twitter but ended up suggesting that only fools would donate to Jindal’s campaign: “We have met. You wrote a check. A fool  his money are soon parted. A fool  his dad’s money are parted sooner. ” Jindal owned himself. Recently Trump’s White House communications team circulated a flattering Washington Post article about how great the president’s budget was  —   headlined “Trump’s Budget Makes Perfect Sense and Will Fix America, and I Will Tell You Why”  —   except the article was satirical. That was a presidential  . The most successful ownage finds hubristic targets, people who think they know more than they do. But ownage is itself a hubristic act  —   it turns knowledge into a tool for exploiting another person’s lack thereof. Owning someone sets you up to be owned yourself, sometimes in the same breath. The    —   and a related concept, “You played yourself,” the refrain of the motivational Snapchat user DJ Khaled  —   is a double entendre. In the   you let yourself down by being so nakedly yourself. You fail, in the end, by being you.'"}, "time": 1742562113.6821895}