{"duration": 0.04027891159057617, "input_args": {"text": "'Rep. Roger Williams ( ) has become the ninth   of a bill that would terminate the U. S. Department of Education. [“I have said from day one that the federal government should focus on three things: defend our borders, maintain our infrastructure, collect our taxes  —   and then get out of the way,” Williams tells Breitbart News. “A long history of Washington bureaucrats inserting their failed policies into our children’s classrooms has resulted in a   and often failing educational system. ”  Kentucky Rep. Thomas Massie (R) introduced the bill, H. R. 899, in February. The measure consists of only one sentence: “The Department of Education Shall Terminate on December 31, 2018. ” Let’s return control of education and educational spending to parents, teachers,  school boards, where it belongs: https:  .   —   Thomas Massie (@RepThomasMassie) February 21, 2017,  In an exclusive interview with Breitbart News, Massie said his bill is getting significant attention and that it could easily get support from both sides of the political aisle. “I think right now is a wonderful opportunity for us to get some people on the left side of the aisle in favor of reducing big government,” he said, continuing: Because, oftentimes, they’ve been proponents of a centralized government that’s not just powerful, but which has placed all of its power in the executive branch. And for the last four years  —   I have been arguing  —   number one, we need to devolve that power back to the states, but number two, to the extent it exists at the federal level, it needs to go back to Congress instead of sitting in the White House. And, now, I think the liberals are more receptive to that argument. And, if nothing else, they’re certainly apathetic about the Department of Education right now. “I do seem to remember that Trump was in favor of this,” Massie added. “I’m going to pursue the bill here in Congress with the assumption that if we can get it to them, they would sign it. In the meantime, a lot of congressmen are hearing from their constituents in support of this bill. ” Williams echoes the assertion that local control of education benefits all children. “It is long past time for big government Democrats to realize that local jurisdictions know what’s best for our youth and that a quality education is the right of all children, not just the Washington elite,” Williams says. Williams joins Rep. Justin Amash ( ) Rep. Andy Biggs ( ) Rep. Jason Chaffetz ( ) Rep. Matt Gaetz ( ) Rep. Jody Hice ( ) Rep. Walter Jones ( ) Rep. Raul Labrador ( ) and Rep. Ralph Abraham ( ) as   of the legislation.'"}, "time": 1742562161.5072374}