{"duration": 0.11214447021484375, "input_args": {"text": "'November 11, 2016 Nusra On The Run - Trump Induces First Major Policy Change On Syria \\nThe people loyal to the Syrian government are happy with Donald Trump winning the U.S. election: At the passport counter, a Syrian officer’s face lit up when he saw an American traveler. \\n“Congratulations on your new president!” he exclaimed, giving an energetic thumbs up. Mr. Trump, he said, would be “good for Syria.” \\nThe first significant step of the new administration comes while Trump is not even in offices. Obama, selfishly concerned with his historic legacy, suddenly makes a 180 degree turn and starts to implement Trump polices. Lets consider the initial position : Asked about Aleppo in an October debate with Clinton, Trump said it was a humanitarian disaster but the city had \"basically\" fallen. Clinton, he said, was talking in favor of rebels without knowing who they were. \\nThe rebels fighting Assad in western Syria include nationalists fighting under the Free Syrian Army banner, some of them trained in a CIA-backed program, and jihadists such as the group formerly known as the al Qaeda-linked Nusra Front. \\nThe Obama administration, through the CIA led by Saudi asset John Brennan, fed weapons, training and billions of dollars to \"moderate rebels\". These then turned around and either gave the CIA gifts to al-Qaeda in Syria (aka Jabhat al Nusra) or joined it themselves. The scheme was no secret at all and Russia as well as Syria pointed this out several times. The Russian foreign Minister Lavrov negotiated with the U.S. secretary of State Kerry who promised to separate the \"moderate rebels\" from al-Qaeda. But Kerry never delivered. Instead he falsely accuse Russia of committing atrocities that never happened. The CIA kept the upper hand within the Obama administration and continued its nefarious plans. \\nThat changed the day the president-elect Trump set foot into the White House. While Obama met Trump in the oval office, new policies, prepared beforehand, were launched. The policies were held back until after the election and would likely not have been revealed or implemented if Clinton had won. \\nThe U.S. declared that from now on it will fight against al-Qaeda in Syria: President Obama has ordered the Pentagon to find and kill the leaders of an al-Qaeda-linked group in Syria that the administration had largely ignored until now and that has been at the vanguard of the fight against the Syrian government, U.S. officials said. \\nThat shift is likely to accelerate once President-elect Donald Trump takes office. ... possibly in direct cooperation with Moscow . ...U.S. officials who opposed the decision to go after al-Nusra’s wider leadership warned that the United States would effectively be doing the Assad government\\'s bidding by weakening a group on the front line of the counter-Assad fight. ... Defense Secretary Ashton B. Carter and other Pentagon leaders initially resisted the idea of devoting more Pentagon surveillance aircraft and armed drones against al-Nusra. \\nAsh Carter is, together with John Brennan, the major anti-Russian force in the Obama administration. He is a U.S. weapon industry promoter and the anti-Russia campaign, which helps to sell U.S. weapons to NATO allies in Europe, is largely of his doing. He saw al-Qaeda in Syria as a welcome proxy force against Russia. \\nBut Obama has now shut down that policy. We are not yet sure that this is for good but the above Washington Post account is not the only signal : The U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) took action today to disrupt al-Nusrah Front’s military, recruitment, and financing operations. Specifically, OFAC designated four key al-Nusrah Front leaders – Abdallah Muhammad Bin-Sulayman al-Muhaysini , Jamal Husayn Zayniyah, Abdul Jashari, and Ashraf Ahmad Fari al-Allak – pursuant to Executive Order (E.O.) 13224, which targets terrorists and those providing support to terrorists or acts of terrorism. ... These designations were taken in coordination with the U.S. Department of State, which today named Jabhat Fath al Sham as an alias of al-Nusrah Front – al-Qa’ida’s affiliate in Syria. ... Abdallah Muhammad Bin-Sulayman al-Muhaysini was designated for acting for or on behalf of, and providing support and services to or in support of, al-Nusrah Front. \\nThis is a major change in U.S. policy. Nusra will from now on be on the run not only from Russian and Syrian attacks but also from the intelligence and military capabilities of the United States. \\nThe newly designated Al-Muhaysini, a Saudi cleric, is Nusra\\'s chief ideologue in Syria. Some considered him the new Osama Bin-Laden. Here he is, on the left, arm in arm with chief al-Qaeda in Syria propagandist and \"journalist\" Hadi Abdullah. bigger \\nHadi Abdullah, friend of the designated al-Qaeda terrorist Muhaysini, just received the 2016 Press Freedom Price from the CIA/Soros financed \"regime change\" influence operation Reporters Without Borders. Might this mean that Hadi Abdullah is himself a CIA assets? He would not be the first such \"journalist\" in Syria. \\nObama, obviously as a direct consequence of the Trump election, now ordered the Pentagon to wage war on al-Qaeda in Syria just as the Russians do. This after five years of nearly unlimited U.S. support for al-Qaeda and its \"moderate\" Syrian affiliates. It is not yet know what new orders, if any, Obama gave to the CIA. Will the CIA follow these policies or will it (again) try to counter the Pentagon policies in Syria? It is unusual that the WaPo report above about this new direction includes no commenting voice from the CIA. Why is such missing? \\nRussia and Syria will welcome the new Obama policies should they come to fruit on the ground. Hillary Clinton had planned and announced to widen the conflict in Syria and with Russia and Iran. Obama would surely not have acted against such policies if she had been elected. But with Trump winning and thereby a new policy on the horizon he now changed course to a direction that will provide \"continuity\" when Trump takes over. \\nNot only is Trump kicking a black family out of its longtime limewashed home, he also ends U.S. government support for the disenfranchised Jihadis in Syria and elsewhere. This even months before taking office. He really is the menace we have all been warned about. Posted by b on November 11, 2016 at 10:13 AM | Permalink'"}, "time": 1742563201.5678017}