{"duration": 0.11659812927246094, "input_args": {"text": "'This year, the political conventions pulled off an amazing feat: They rebooted a familiar figure, someone who spent years in the public eye going through   shifts, and who emerged from the quadrennial partisan ritual reintroduced and reinvigorated. I’m referring, of course, to Stephen Colbert. When “The Late Show With Stephen Colbert” began on CBS in September 2015, it came with enormous expectations and risks. Mr. Colbert was following in David Letterman’s footsteps as well as his own, having created a satirical performance piece for the ages on Comedy Central’s “The Colbert Report. ” His move to a   late night show might have been a reinvention of the form it might have been a bust. Instead, for most of the year, it just   …     was. There was the occasional newsworthy interview, like his emotional September talk with Vice President Joe Biden, grieving the recent loss of his son. There were a few experiments, like letting the director Spike Jonze shoot a   video in which Mr. Colbert shared an existential moment with Grover from “Sesame Street. ” Night by night, “Late Show” was fine but inessential. Even as a flabbergasting election unfolded, you were less likely to think, “What is Stephen Colbert going to say about this?” than “I wonder what Stephen Colbert would have said about this. ” Then, for the two weeks of the conventions, “Late Show” aired live, and it came back to life. Mr. Colbert brought his old buffoonish conservative commentator character back, bearing a Captain America shield, with guest appearances by his old compadre Jon Stewart. He brought out Laura Benanti to spoof Melania Trump’s plagiarism scandal. He ambushed the stages of both conventions in character as the “Hunger Games” host Caesar Flickerman. The combination of live TV and   politics was like a comedy speedball that “Late Show” injected straight into its heart. Where had CBS been keeping this guy? And how can we keep him on the air? Obviously, only so much of this   special is reproducible  . Mr. Colbert isn’t likely to start doing a live show every night, nor to band together with Mr. Stewart to   the old Comedy Central   lineup on CBS. But the convention weeks showed off strengths that “Late Show” can and should keep playing to. The most important: Don’t waste Mr. Colbert’s time and ours on topics and guests he’s not engaged in. When he’s had to host stars plugging movies or read off questions to the 2016 Super Bowl’s most valuable player, Von Miller (in his live special after the big game) it felt like the job was defining Mr. Colbert instead of him defining the job. For the last two weeks, Mr. Colbert was focused almost entirely on the most important thing going on in the country and the culture, and his interest and energy showed. That doesn’t necessarily mean doing nothing but politics. Mr. Colbert is not that boring. His interview with Mr. Biden had political overtones  —   the vice president was still considering a presidential run. But what made it great was how Mr. Colbert drew on his humanity and Catholic faith to dive deep to the stuff that mattered. He can pull off celebrity interviews, too, when there’s a real shared interest, as when he and   Key recently geeked out on their love of improv. Speaking of which: Mr. Colbert’s revival of his Comedy Central character and his zany turn as Flickerman reminded us that he’s TV’s best performance artist not currently running for president. “Late Show” might want to let him try on more characters. It could also cultivate a stable of other performers  —   Mr. Colbert also worked well as ringmaster and hype man for Mr. Stewart and Ms. Benanti. But letting Mr. Colbert be Mr. Colbert will definitely mean politics, and these days, that’s inevitably going to mean alienating viewers. After the Orlando, Fla. terrorist shooting in June, Mr. Colbert took apart Donald J. Trump’s response by diagraming a word cloud of the candidate’s insinuations  —   “Obama,” “something going on,” “radical Islam”  —   and the connecting lines formed a swastika. It was savage and hilarious and guaranteed to turn off a sizable chunk of the electorate. Mr. Colbert has tried to spread his fire around. When the House minority leader, Nancy Pelosi, decried big money in politics at the Democratic convention, he snarked that her outcry “resounded throughout every corner of the Wells Fargo Arena, from the CNN Grill to the Comcast Xfinity Live complex!” But clearly nothing fires his satirical synapses right now like Mr. Trump. That’s the guy CBS hired, though. He couldn’t be a Johnny Carson or Jay Leno, amiably poking at the nonpartisan foibles of both sides for a   audience, even if that were still possible today. And it isn’t. That sort of comedy was a product of a less polarized political era, one with less niche programming and more swing voters, with liberal Republicans and conservative Democrats, with some consensus on the basic functions of government.     comedy doesn’t work when the road no longer has a middle wide enough to ride a bicycle down. That’s why, where past “Tonight” hosts made light fun of politics, today Jimmy Fallon is most effective when he avoids politics altogether. He’s good at it, and the ratings are great. It’s a familiar coping mechanism for people burned out by apocalyptic news and vitriolic social media feeds: Please, let’s just not talk about it for an hour. But the cerebral Mr. Colbert is not a    kind of guy that is his bug and his feature. I don’t pretend to know whether his show’s   drift was driven by CBS, Mr. Colbert’s artistic desire to grow and move on, or both. His convention shows suggested, though, a way to change without renouncing his past works  —   just as Mr. Letterman eventually found a distinctive voice on his “Late Show” while hanging on to signature features like the   list. On Wednesday night of the second week, Mr. Colbert announced some bad news: Because of an   complaint, he could never use the original “Stephen Colbert” character, or his commentary segment “The Wørd,” again. Instead, he was bringing on “Stephen Colbert,” the original character’s “identical twin cousin,” and introducing a new commentary feature, “The Werd. ” “I cannot reasonably argue,” Mr. Colbert deadpanned, “that I own my face or my name. ” But in so doing, he very much did own it: He is who he is. And there’s no reason for his show to fight it.'"}, "time": 1742628340.0749424}