{"duration": 0.07814955711364746, "input_args": {"text": "'Region: USA in the World Even though The American Spectator has claimed that “Obama and his crew will soon be swept into the dustbin of history”, the future of “America’s lame duck” still draws a lot of media attention. Some commentators, especially those that have been handsomely paid by the White House, are trying to somehow improve the public image of the still sitting US president who has discredited himself in a number of ways over the last 8 years, especially in such fields as “ combating ” racism in the United States and Washington’s military interventions across the globe. The New York Times would note that with less than three months left for his presidency, Barack Obama is preparing for a life after the White House that would most likely include a close relationship with Silicon Valley. As an explanation for such a statement, the newspaper provides the report on how interested President Obama was in the Dragon spacecraft built by SpaceX. President Obama even tested a program that stimulates docking the spacecraft with the International Space Station. This area of Obama’s possible interests is cited by a great many commentators as his future occupation, which seems logical since Obama’s “contribution” to US military contractors regarding profits has been paramount all throughout his years in office. However, there’s reports that Obama has diverse musical interests as well. Reportedly, his favorite music genre is soul. He listens to various artists that developed this genre, but his absolute favorite is Stevie Wonder and his “My Cherie Amour”, “All In Love Is Fair”, “For Once in My Life”, and “I Just Called to Say I Love You”. These songs can always be found in the playlist of the current American leader. Barack Obama is also found of Al Green and his vocal prowess. He tends to enjoy such saxophonists as Lester Young, John Coltrane, and Coleman Hawkins. As for rock legends, Obama prefers to listen to the legendary The Rolling Stones and The Beatles. As for the latest hits, Barack Obama has been enjoying the Canadian indie rockers Arcade Fire with their “We Used to Wait”, and the British indie-pop band Florence & The Machine with their hit “You’ve Got The Love”. As a real American president, Barack Obama just can not help but love country music as well, as he frequently listens to such bands as Zac Brown and Montgomery Gentry. So some musicians, especially in the US, have been advising Obama to switch to musical activities, perhaps playing in a banjo in a band. – It seems that it might be a good pastime for Obama after his “toying with soldiers” in the Middle East and other regions of the world. A lot of comments in various media can be found about Obama’s ties with hospitals, and Doctors Without Borders in particular. Tens of hospital have been wiped off the face of the earth and hundreds of doctors and their patients died as a result of the strikes in Afghanistan, Yemen, Iraq, and elsewhere in the world authorized by Obama. Therefore, it seems unlikely that any hospital run by Doctors Without Borders will have the courage to turn Obama’s application down after the termination of his presidential mandate. Especially when you consider that the risk of dying under US bombs will diminish for most of its employees after January 2017. However, if the White House is then occupied by Hillary Clinton, Obama may be running the risk of coming under friendly fire if working in one of such hospitals, an irony considering his endorsement of Clinton. But the most important thing by far is that Obama will no longer be making America’s decisions, since during his time doing so, he has got the US mired in five overseas wars simultaneously , subjecting millions of innocent civilians in the Middle East, Africa, and Asia to intolerable suffering, loss of shelter and families, and forced refuge in foreign lands. Therefore, the choice of a decent successor to the current lame duck president should be way more important than supporting the war party and Obama’s spiritual successor – Hillary Clinton. Martin Berger is a freelance journalist and geopolitical analyst, exclusively for the online magazine “New Eastern Outlook.” Popular Articles '"}, "time": 1742562960.5056417}