{"duration": 0.0858004093170166, "input_args": {"text": "'There is no one right way to be an activist. There is no one right way to change the world. There is no one right philosophy of leftist politics. There is no one right reaction to the election. There is no one right solution to the massive problems we\\'re facing. \\nThat list is just for us, because this toxic \"one right way\" meme is burrowed deep into the left subconscious as much as the \"one right way\" meme has burrowed into the rest of our culture, and those we call our enemies. The left\\'s version is far less destructive than the way it manifests in the right, but it is there nonetheless, causing all sorts of suffering among ourselves, and scaring away many who might join our cause. \\nVery few people are aware that our entire culture is guided by this invisible cultural meme, but make no mistake - the idea that there is \"one right way and my way is it\" is perhaps the most deadly and toxic meme in our entire culture, and if we ever want to stop reproducing the systems of oppression we are fighting against, we must weed out this idea within ourselves. \\nFortunately, once you see it, you can\\'t unsee it, so let me give just a handful of examples. \\nIn our, the dominant, culture (which began 10,000 years ago and grew to dominate the entire planet, save for the few indigenous societies which have managed to survive thousands of years of colonialism, assimilation, and destruction): \\nThere is one right economic system. There is one right religion. There is one right country. There is one right political party. There is one right sexual orientation. There is one superior gender. There is one superior race. There is one superior language. There is one superior form of civilization. \\nAll of these are subsets of the one meta-meme to rule them all: \\nThere is one right way to live, and our way is it. \\nNo doubt we can trace the vast majority of death, colonialization, conquest, war, genocide, discrimination and suffering in the entire history of our culture (which began roughly 10,000 years ago) to this belief in the \"one right way.\" \\nCapitalism, religious persecution, white supremacy, patriarchy - they are all symptoms of a dominating way of life that seeks to homogenize the great diversity of the world, creating a planet where one way of life reigns supreme. \\nTrump and the authoritarian right, in the coming years, will be doing their best to force their way onto the rest of the world. We must resist this homogenization, but while we are doing it, we must not also do this to each other, on a smaller scale. \\nThe \"one right way\" meme is a killer, that much should be clear. If we strive to be more than the mirror reflection of those we are fighting against, let us agree to not bring the \"one right way\" meme into our own discussions, politics, and organizing. \\nThe antidote to a toxic, deadly meme is a more compelling and truthful meme, which is rooted in the natural laws of the universe. \\nDaniel Quinn, to which I owe the inspiration for all of the above, said it best. \\nThat alternative meme is this: \\nThere is no one right way to live. There never has, and never will be. \\nThere are thousands of ways to live that work well for its members, and there are many ways that don\\'t work (we\\'ve been trying one that doesn\\'t work for 10,000 years, which has almost brought our species to extinction in the blink of a geological eye). \\nLet\\'s fight for a world where thousands of diverse ways of living and being can co-exist. This work is licensed under an Attribution-NonCommercial-ShareAlike 4.0 International License 0.0 ·'"}, "time": 1742562314.244413}