{"duration": 0.2755753993988037, "input_args": {"text": "'During a discussion of BuzzFeed’s story on a dossier regarding Russia and   Donald Trump on Wednesday’s broadcast of MSNBC’s “MTP Daily,” host Chuck Todd told BuzzFeed    Ben Smith “you just published fake news. ”  Todd said BuzzFeed’s decision to publish the dossier was an instance where they “would not have made the same decision in the   era. ” Smith stated that it was more “the   era. ” And that there was a time “where we could act as gatekeepers. Where we could say, you know what, crazy people are claiming that Barack Obama’s birth certificate is forged, but we’re not going to write about that, that’s crazy. ” He continued that this era doesn’t exist, and that while they had reporters trying to confirm or deny specific details, the dossier was “in play,” and “having consequences for the way our elected leaders are acting. The  —   you do have to ask the question of, why should I suppress that? There are then good reasons, right? Once though, it emerges, as it did last night in the public conversation that there is this secret document floating around, full of dark allegations that we will not repeat to you. That I feel like in this era, you really have to share [with] your readers what that is in an appropriate context. And our original report, I mean, if you read what we wrote, it stressed that there were real solid reasons to distrust this. It noted two specific errors. ” Todd then asked if BuzzFeed had a responsibility to not spread false information. Smith responded that, like with the Obama birth certificate issue, it’s a “difficult balance that everybody in our business navigates every day. ” Todd then asked if BuzzFeed would publish a false birth certificate. Smith answered, “We certainly quoted the   of the United States making false claims about it, and years ago we debated whether we should quote regular citizens in Iowa saying, I don’t believe his birth certificate. And I remember us thinking at first, we probably shouldn’t. That we we shouldn’t pass that on and then saying, you know what, this has become a force that is impacting the conversation. ” Todd countered, “I know this was not your intent. I’ve known you a long time, but you just published fake news. ” Smith countered that people throw the term “fake news” around to diminish things they don’t like, and that “this was a real story about a real document that was really being passed around between the very top officials of this country. And then the question you say is, okay, it’s okay for you  —   to Chuck Todd see this document. It’s okay for me to see it. Okay for Senator John McCain ( ). Okay for the CIA. What’s  —   why is it not okay for your audience?” Todd then countered that BuzzFeed could have published a redacted version of the document. Smith answered that there was fair disagreement, but didn’t think you could defend acknowledging the dossier’s existence but then not say what was in it and that this was saying it was okay to summarize false claims. Smith further stated that if there wasn’t a “public conversation” about the dossier, they would have just continued to report the story out. (  Mediaite) Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742561623.8439908}