{"duration": 0.047597408294677734, "input_args": {"text": "'Some migrants coming into Western states as Syrian asylum seekers are “definitely” terrorists, the Syrian President Bashar   has said. [Terrorists pictured on the internet “holding machine guns or killing people” have since turned up in photographs of “peaceful refugees in Europe or the West” President Assad told Yahoo News, adding: “That’s true. ”  But he declined to put a figure on how many of the 4. 8 million asylum seekers might be terrorists, saying “nobody has any number. Nobody knows. Because nobody knows all the terrorists. ” He also declined to say whether the figure might be “significant” highlighting that it took only 15 people to bring down the Twin Towers on  . “It’s not about significant because you don’t need a significant number to commit atrocities,” he said. “It’s not about the number, it’s about the quality  —   it’s about the intentions. ” Speaking in his presidential office in Damascus, Syria, Assad would not take a view on whether the U. S. was right to halt the immigration of migrants from seven countries which posed a security threat, Syria included, but said that his priority was rather to ensure that Syrian asylum seekers return home. “For me, the priority is to bring those citizens to their country, not to help them immigrate,” he said. The interview was released as the British prime minister, Theresa May, defended government schemes to resettle 20, 000 Syrians in the UK over five years. At a Downing Street press conference, May told reporters: ‘We have been seeing quite a number of children and families being resettled here in the United Kingdom. “I think what we are doing in terms of refugees is absolutely right, on top of course of the significant financial support and humanitarian aid we are giving to refugees in the region of Syria  —   a commitment of £2. 3 billion, the second biggest bilateral donor. ” In the last few days, the government has come under fire for ending a scheme to bring child migrants from Calais into Britain. Announcing the decision, immigration minister Robert Goodwill told MPs that 200 children had been placed around the country and that councils had indicated they had the capacity for only 150 more. But the Archbishop of Canterbury slammed the move, calling on the government to take in nearly ten times as many children. He added: “I fear that this week’s decision does not meet the spirit of commitment that was given during the passage of the Immigration Act last year. ”'"}, "time": 1742562747.780313}