{"duration": 0.18337035179138184, "input_args": {"text": "\"Here's something interesting from The Unz Review... Recipient Name => Street Scene Near Temple University, 2016 \\nOver three days last week, at least 150 blacks attacked whites at random around TempleUniversity. Victims were surrounded, punched and kicked. Wallets and phones were stolen. Rocks were thrown at passing cars. When cops showed up, one was knocked from her bike and a police horse was even punched twice in the muzzle. \\nMost of the assaults took place on Friday. On Saturday, Joe Lauletta, a father of one victim, reported on FaceBook : \\nI spent last night in the ER at St. Mary’s HospitaI. I received a call from my daughter Christina after my sons football game. She was crying, I couldn’t understand her, my heart dropped, I became scared, I said what is the matter? Dad, I was jumped, I’m beat up pretty bad. Where r u? Temple, they stole my phone. We’re heading to the police station. I do not hear from her until she gets to her apartment. Rage is running through my mind the whole time. She said she is getting a ride home and wants to go to St. Mary’s. I find out that her and her 2 male friends where badly beaten by a group of 30-40 black teenagers on their way home from the Temple football game. This happened after they got off the subway at Broad and Cecil B Moore. These sick animals held her down and kicked and stomped on her repeatedly. Thank god, the people from the pizza place intervened. They arrested 2 people at the scene. I have not let Christina out of my sight, she is resting. Every part of her body is badly bruised, it makes me cry just thinking about it. No broken bones. If you have children at Temple, tell them to be careful. Please keep Christina Lauletta in your thoughts. \\nCBS Philadelphia describes another victim’s ordeal: \\nHe says around 9:30 Friday night he was leaving work when he saw what looked to be at least 200 juveniles walking in large groups.He said he overheard police saying the kids were playing the knockout game. \\nHe says a juvenile around 10 years old started shouting obscenities at him and grabbed his phone out of his hand. The student says the juvenile then came back and threw the phone at him, striking him in the face. \\nAround 15 minutes later, the student says he was walking with his girlfriend when they were approached by at least seven juveniles. The student says he went to hit the TemplePolice alert button when his girlfriend was struck by one of the juveniles. \\nAs the student was chasing them away, he says he was struck in the face by a someone he estimates to be eight years old. \\nThis is not new. In 2014, five black girls, aged 17, 15, 15, 15 and 14, committed three separate attacks on random white people at TempleUniversity. Struck across the face with a brick, a 19-year-old white student suffered a fractured jaw and nearly had her teeth knocked out. Her 15-year-old assailant, Zaria Estes , was given a 2 ½-6 year sentence. \\nAcross America, gangs of blacks have beaten random people for decades, just for the sport of it. This cathartic recreation has been dubbed wilding, catch and wreck , knock out game or flash mob, and it can happen at parks, shopping malls, state fairs or even your living room. \\nIn 2012, a mentally-handicapped woman was relaxing on her stoop in Chester, just outside Philadelphia, when she was attacked by six black teenaged girls. When the terrified woman tried to flee inside, they rushed into her living room to continue the savage beating . Had these girls not posted their exhilarating workout on FaceBook, they might never have been caught. \\nA white bartender at my neighborhood dive was attacked, just outside her front door, by a group of black kids around 12 years old. After throwing a rock at her head and knocking her down, they kicked her a few times as she curled up on the ground, then they scattered. “Just like that, it was over. All I could do was go inside and cry.” \\nNot surprisingly, the latest incident at TempleUniversity has received scant media attention. Though AP did cover it, it never pointed out that these were racial crimes. As usual, only “teens” are fingered, with their race not mentioned. Had mobs of whites attacked random blacks, the entire world would have known about it by now. \\nLocally, a black writer editorializes in the Philadelphia Inquirer that gentrification is ultimately responsible. In “BehindTemple attacks, rage often comes with exclusion,” Solomon Jones explains : ORDER IT NOW \\nIn a city where poverty is concentrated outside the universities, we can’t truly expect the poor to watch jobs and wealth and excess pass them by without any reaction at all. \\nTo be sure, violence is the wrong response. And the kids who engaged in it will surely be prosecuted, as they should be. \\nBut I believe those teens are expressing something that has long simmered beneath the surface. They are expressing the rage that comes with exclusion. They are expressing the hurt that comes with invisibility. They are engaged in the inevitable push and pull of change. \\nTempleUniversity, my alma mater, has reached out to the community with scholarships for local youth, according to spokesman Ray Betzner. They’ve put reading programs in place, tutored high schoolers and even talked to their own students about respecting longtime community residents. But Temple would be wise to reach out into the community with an eye toward creating stronger relationships and greater opportunities for the young people who’ve been pushed aside by a generation of exclusionary development. \\nThe community would be wise to reach back. \\nSo these attackers are among “people who’ve been pushed aside by a generation of exclusionary development.” Like many urban universities, Temple is surrounded by black ghettos , but these are being gentrified thanks to a steady influx of white suburbanites and immigrants. \\nIf you’re barely treading water, and your rent jacks up because of gentrification, you’ll be pissed too. Who wants to be evicted? Blacks, though, are always the victims, and never agents, of any neighborhood’s improvement. Why is that? \\nIn Detroit, a post-apocalypse ghetto of burnt out houses, gutted factories and urban raccoons, Mexicans revived a section near downtown. Unlike the rest of Detroit, there are plenty of restaurants and shops in Mexicantown, and it’s perfectly safe to walk around. \\nIf there were fewer Mexicans, blacks would have more jobs, obviously, so why are our borders wide open? In “ Race and Crime in America,” Ron Unz suggests that Hispanics are being imported to replace blacks. They can do the same jobs, sans mayhem. In 1992, East Palto had the highest murder rate in all of America. Then a transformation happened as Hispanics flooded in. Ron Unz: \\nOver the last twenty years, the homicide rate in that small city dropped by 85%, with similar huge declines in other crime categories as well, thereby transforming a miserable ghetto into a pleasant working-class community, now featuring new office complexes, luxury hotels, and large regional shopping centers. Multi-billionaire Facebook CEO Mark Zuckerberg and his wife recently purchased a large $9 million home just a few hundred feet from the East Palo Alto border, a decision that would have been unthinkable during the early 1990s. \\nThe more blacks there are in a neighborhood, the more crimes, the lower the housing values and the more dysfunctional the public schools, and everyone knows this, including, say, a fresh-off-the-boat immigrant from Mali or Bangladesh. Black maladaptation is only getting worse. \\nWhat you have, then, is a group that will largely be excluded from better jobs, universities and housing. As long as the United States shall last, blacks will be an underclass. Their symbolic successes, as in having a half-black president, can’t gloss over the fact that the majority of them are barely afloat. \\nThe in-state tuition for TempleUniversity is $15,688, and the school accepts 56% of its applicants. It’s reasonably priced and easy to get in. Only 13.1% of Temple students are black, however, in a city with 44.1% blacks. Before you charge racism, do consider what Walter Williams has to say : \\nAmong high-school students who graduated in 2014 and took the ACT college readiness exam, here’s how various racial/ethnic groups fared when it came to meeting the ACT’s college readiness benchmarks in at least three of the four subjects: Asians, 57 percent; whites, 49 percent; Hispanics, 23 percent; and blacks, 11 percent. However, the college rates of enrollment of these groups were: Asians, 80 percent; whites, 69 percent; Hispanics, 60 percent; and blacks, 57 percent. \\nThough all races are being admitted to college too liberally, blacks benefit the most, for only 1/5th of blacks in universities should even be there. Feeling out of place, blacks across the country are demanding separate dormitories. ORDER IT NOW \\nBlacks are also given preferred treatment when it comes to government jobs and contracts, so the academy, state and media are all in their favor, yet their failures have only increased. \\nIn Ethnic America , Thomas Sowell observes, “The [black] race as a whole has moved from a position of utter destitution—in money, knowledge, and rights—to a place alongside other groups emerging in the great struggles of life. None have had to come from so far back to join their fellow Americans.” \\nHaving achieved not just civic equality but, at times, even favored treatment, blacks still often find themselves on the losing end of life’s struggles. If you dare to suggest that individual blacks should bear at least some responsibilities for their failures, however, you will be branded a racist. \\nSo I’m a racist for writing this, Walter Williams is a racist for pointing out that most blacks attending college shouldn’t be there, and Joe Lauletta is a racist for calling his daughter’s attackers “sick animals.” Everyone is a racist except those 150+ blacks who attacked whites unprovoked. \\nTo many black apologists, blacks can’t be guilty of anything, be it murder, rape, a brick across your face or even racism, because everything they do is just a response to relentless white racism. I’ll insist, though, that these black apologists are the worst racists of all, because to deny someone of moral agency is to reduce him to an animal. \\nAs for the media, their steady suppression or excuse of black misbehavior is an encouragement of even worse. This has to be intentional. They’re enabling more riots, more catch and wrecks, more knock out games. \\nTeaching in Germany, I showed my students the Philadelphia Police Department’s YouTube channel, without comments. One video after another had a black person assaulting or robbing somebody. When a Hispanic criminal suddenly appeared in the 9th video or so, some students couldn’t help but grin, for they were fleetingly spared of the monotony. \\nSince the students wanted to learn about the US, I gave them an authentic, unedited glimpse. At their local cinema, Straight Out of Compton was playing. It’s very cool to act black in Germany . \\nOf course, black apologists will claim that American blacks only rob because they’re oppressed and poor, though I don’t see how this explains the 22,000+ black-on-white rapes/sexual assaults reported yearly, as compared to zero white-on-black sexual attacks. (See table 42 of the Department of Justice’s Criminal Victimization in the United States reports for 2003 , 2004 , 2005 , 2006 , 2007 and 2008 , the last year available.) Oh yes, white women are so fetishized, blacks can’t help but rape them. None of them can help doing anything, I get it. What a gross insult this is to decent blacks. \\nAgain, to deny someone of moral agency is to reduce him to an animal. \\nLinh Dinh is the author of two books of stories, five of poems, and a novel, Love Like Hate . He’s tracking our deteriorating socialscape through his frequently updated photo blog, Postcards from the End of America .\""}, "time": 1742562172.6063497}