{"duration": 0.201002836227417, "input_args": {"text": "'SEATTLE  —   Part of Jillian Boshart’s life plays out in tidy, ordered lines of JavaScript computer code, and part in a flamboyant whirl of corsets and crinoline. She’s a tech student by day, an enthusiastic burlesque artist and producer by night. “ ” and “” she calls those different guises. “My mother got stage fright for me,” she said on a recent night while talking about her childhood performances and dreams. She looked like a 1940s starlet in a tight black sequined dress, a red rose pinned into her red hair. “I like to be prepared,” she said. “I like to be in control. ” At age 31, she seems to be. This year she won a coveted spot here at a nonprofit tech school for women, whose recent graduates have found jobs with starting salaries averaging more than $90, 000 a year. Seattle, where she came after college in Utah to study musical theater, is booming with culture and youthful energy. But again and again, life has taught Ms. Boshart, and others in her generation, that control can be elusive. In the   crash of the early 2000s, her family lost the college savings they had been putting aside for her. Her father, a nurse, was laid off after 35 years on the job. Her sister and    lost their house during the Great Recession. And very little in the world around Ms. Boshart has led her to feel a sense of comfort and ease: not the soaring costs of living in Seattle, not the whirlwind roar of reinvention in the tech world, certainly not the barbed clamor of national politics. Even for someone who seems to have drawn one of her generation’s winning hands, it feels like a daunting time to be coming of age in America. “I don’t just expect things to unfold, or think, ‘Well, now I’ve got it made,’ because there’s always a turn just ahead of you and you don’t know what’s around that corner,” she said. On the 10th floor of a downtown office building here on a rainy morning in June, a software development instructor stood in a darkened classroom, the images and words from a screen projection branding his white shirt with the fractured   language of computer code. In the classroom, at Ada Developers Academy, the tech school Ms. Boshart attends, were a former motorcycle   a former college counselor, a waitress, a teacher  —   all women, most in their 20s and 30s, and all there to change careers. It was the day after the mass shooting at a nightclub in Orlando, Fla. where the victims, as no one needed reminding, were about the same age as everyone in the room. The students at Ada  —   Adies, as they affectionately call one other  —   are in many ways representative of Seattle’s churning, anxious arc of growth and change. The 61 women who have graduated since the school’s founding in 2013 have been drawn here from across the nation and several other countries. Tuition is free for applicants who pass the rigorous admissions process, with costs underwritten by Seattle tech giants like Amazon. Of the 13 most populous counties in the nation, King County in the Seattle metro area is second only to Brooklyn in the highest percentage of residents age 25 to 34, part of the biggest demographic wave since the baby boom, according to census data. And Seattle is luring those millennials from all over, with King ranking second among big counties in the percentage of people who moved here within the past year from another state. But even in a place of alluring opportunity, the Adies, like Ms. Boshart, mirror their generation’s anxieties. Many are terrified of debt and deeply worried about their economic future. Student loan burdens sharply increased nationally during the recession, according to a report by the Federal Reserve Bank of Atlanta, more than tripling to $1 trillion from 2004 to 2012. Unemployment for people under 25 is more than twice the national rate, which has made many of those loans harder to pay off. Millennials have postponed marriage and decisions about where to live and what careers to pursue, the Federal Reserve study said, far longer than previous generations, often out of economic necessity. Hailey Willis, for example, was accepted to Ada and arrived here last year from Chicago with six months of savings to her name. In Seattle, markedly more expensive, the money was gone in 90 days. Asked about her financial future, Ms. Willis, 31, said she saw no chance that anything like Social Security would be there for her or anyone her age. Elsa Moluf, 26, an Ada graduate, said the terrorist attacks of Sept. 11, 2001, still resonated when she thought about personal safety  —   a feeling compounded recently by a shooting on a Seattle street in broad daylight only a few feet from her. “In the era of terrorism, I think about stuff like, ‘If I go to this crowded festival, what are the chances,’ ” she said. Baby boomers, to whom millennials are often compared  —   if only by the force of their numbers  —   also reached adulthood amid tumult and angst, during the Vietnam War and the struggle for civil rights. But people now in their 20s and 30s say that the 1960s were different, that there seemed to be a clearer goal then  —   to end racial segregation, poverty or the war. The economy seemed better and the nation’s future more assured. Now, from niche anxieties like genetically modified crops to defining ones like climate change, questions feel   and unprecedented: Is the food we eat still food? How do you get your head around a threat to the entire planet? Contradictions and paradoxes, millennials say, come with the territory. Ms. Boshart, for example, would love to own a house someday. But at the same time, debt to her feels perilous. “I don’t want to be beholden to any bank, ever,” she said with quiet vehemence. She counts the months until the tech job she hopes to get after Ada can help pay off the $22, 000 student debt she has left. And then there are presidential politics, with one candidate, Donald J. Trump, who scares her to death and another, Hillary Clinton, whom she admires but is sometimes hesitant to praise too loudly in an area where most people she knew supported Senator Bernie Sanders. She sees politics through a feminist lens and believes that women’s rights would be undermined by a Trump presidency and a   Supreme Court. And even though recent polls and surveys show Sanders supporters largely rallying to Mrs. Clinton, it is not enough to create any sense of security, Ms. Boshart said, that an October surprise of hacked data or a hidden pool of misogyny and rage do not still lie in wait. “There are just so many things you can be anxious about  —   it’s an anxious time,” she said. “My biggest fear is that America hates women more than they hate Donald Trump. ” Riley Spicer, 26, said she cannot help buying food on sale and socking it away. She arrived in Seattle last year from rural Oregon to start classes at Ada, and she and her boyfriend, Jakob Lundy, 27, a fireman, have planted a garden and started a beehive to harvest honey. “I had the radishes today in my salad at work,” Ms. Spicer said on a recent evening, as she carefully exposed the leaves to reveal   bulbs. “When I go to the store and I get three bags of mushrooms, they’re like, ‘What are you doing?’ I’m stuffing mushrooms and freezing them  —   doesn’t everyone do that?” Ms. Spicer, who studied philosophy and the history of science at St. John’s College in Annapolis, Md. has had jobs as a barista, a taxi dispatcher and a deli worker. She has $72, 000 of student debt and has never been paid an annual wage, she said, of more than $17, 000. Based on the track record of Ada graduates, she could soon be making five times as much. So on one level, she and Mr. Lundy  —   young, in love and employed or soon to be  —   might look as if they are living the American dream. But neither one is buying it. “I look out there and it just seems completely hopeless to me,” she said as their    mutt, Cordelia, wandered through their apartment. “The political system seems so overwhelmingly broken that I have no idea what to do about it. ” Her views are echoed in national polls, where young people are consistently, deeply downbeat about the future and the political system. A recent poll of people 18 to 29 years old by Harvard’s Institute of Politics found nearly half agreed with the statement that “politics today are no longer able to meet the challenges our country is facing. ” More than   said the country is “on the wrong track,” and a majority rejected both capitalism and socialism as models for the future. The poll, of 3, 183 American citizens, had a margin of error of plus or minus 2. 4 percentage points. Mr. Lundy rejects the   political system entirely and has voted mostly for   candidates, if only as a statement of opposition to the choice of a Republican or a Democrat. He is not sure what he will do this year. “I don’t want to support the false dichotomy,” he said. He said he liked Mr. Sanders partly because a Sanders insurgency “would be best at reforming the party, or tearing it apart from the inside. ” He also applauded Mr. Trump’s antics, which Mr. Lundy believes will shatter the Republican Party, too. Either way, he added, a   is coming. “Things are going to have to burn before they get better,” he said. Technology is the sea that millennials swim in  —   a kind of second nature, especially to Adies. But many of them feel a deep ambivalence. Tech, they say, means military drones, loss of privacy and cyberbullying. Social media, the new town square, often feels more like a combat zone than a place to share ideas. Tech companies are driving up rent in places like Seattle, forcing out   people, even while creating excellent jobs that Adies are likely to get. “The tech industry is a huge part of the problem,” said Jessica Weeber, 31, who is studying at Ada alongside Ms. Boshart. “As people get paid more and work in tech jobs, rents and housing go up and gentrification happens,” she said. “I don’t know how to solve it. ” But tech is also an unquestionably powerful tool. “Tech gives us the power to change  —   that’s why I’m here,” said Mindy Carson, 31, an Ada student and strong supporter of Mr. Sanders. She wants to start a nonprofit after graduation, using technology to work on social justice issues. “We don’t have to take what they’re saying on TV for face value, we don’t have to take limited information for face value, because we see the truth, we are connected,” she added. Ms. Boshart used technology in a recent burlesque performance, including a recorded   appearance by the astronomer Carl Sagan, to make a point about humanity’s intertwined role with science. She walked on stage wearing a glamorous evening gown, opera gloves, and a corset underneath with 160 LED lights and a tiny computer to run them. Mr. Sagan’s voice came on, talking about the cosmos. As her clothing came off, she said, “I became more and more human. And that was kind of the point: We are artifice to the world, what we present, but as we get deeper and deeper into the human element we are atoms and star dust. ” Ms. Boshart gravitated to burlesque, she said, partly to make such statements. But after her mother died last summer, things became more profound and personal. The women of the Seattle Burlesque Society showed up at the apartment she shares with her fiancé. They brought food. They cleaned. They carved out a quiet corner for grieving and meditation. They became, in their embrace, her sisters. Like many people in her generation, Ms. Boshart does not expect to find those connections in political parties. She no longer goes to church. The workplace doesn’t seem to offer much hope either. “My dad was laid off after 35 years, and that was supposed to be his community, right? That was supposed to be the group of people that understood,” she said before a recent Monday night performance that she was producing at a brewpub north of downtown. “He worked for years and years for you and he’s just out? It was appalling to me. ’’ What should be tossed out, or clung to, is the question of the moment, she said. And for her, a big part of her answer lies in the proud and quirky universe of burlesque, her anchor of belonging in a world that can feel fragmented and frayed. As she got up from the table for a final chat with the cast, music pounded out as performers  —   various ages and body types in heavy eye shadow and feathered boas  —   got ready to go on. They hugged, and she cautioned them about a low table with sharp corners that would be hard to see in the dark. One small peril avoided, it was time for  .'"}, "time": 1742563972.4500382}