{"duration": 1.3714723587036133, "input_args": {"text": "'Donald J. Trump tried out several lines of attack against Hillary Clinton, at one point calling her “unfit to be president,” as he delivered an otherwise noticeably restrained speech to an audience of evangelical activists here Friday. Appearing before the Faith and Freedom Coalition’s Road to Majority conference, Mr. Trump promised to “uphold the sanctity and dignity of life” and to “restore respect for people of faith. ” But he also used the opportunity to press his case against Mrs. Clinton, portraying her as arrogant, attacking her economic policies and willingness to admit Syrian refugees into the country and questioning her judgment as secretary of state. “She’ll appoint radical judges who will legislate from the bench, overriding Congress, and I’ll tell you, the will of the people will mean nothing  —   nothing,” Mr. Trump said. “She will undermine the wages of working people with uncontrolled immigration, creating poverty and income insecurity. Hillary Clinton’s Wall Street agenda will crush working families. She’ll put bureaucrats, not parents, in charge of our lives, and our children’s education. ” Referring to Mrs. Clinton’s call for Mr. Obama to take in 65, 000 Syrian refugees, Mr. Trump also challenged her to instead “replace her support for increased refugee admissions” with “a new jobs program for our inner cities. ” “We have to temporarily stop this whole thing with what’s going on with refugees where we don’t know where they come from,” he said, adding: “We have to take a timeout. We have to use the money to take care of our poorest Americans and work with them so they can come out of this horrible situation that they’re in. ” Mrs. Clinton has been calling Mr. Trump temperamentally unsuited for the White House, and he tried to turn the tables. Mrs. Clinton “refuses to even say the words radical Islam  —   refuses to say it,” Mr. Trump said. “This alone makes her unfit to be president. ” He has vowed to deliver a major speech Monday attacking both Mrs. Clinton and her husband as personally corrupt, and on Friday Mr. Trump asserted that the email scandal that has overshadowed Mrs. Clinton’s campaign for months had its origins in such venality. “Hillary Clinton has jeopardized  —   totally jeopardized  —   national security by putting her emails on a private server, all to hide her corrupt dealings,” he said. The claim appeared to refer to concerns that the private server Mrs. Clinton used as secretary of state may have been more vulnerable to being hacked by foreign adversaries than the State Department’s email system. (Although the emails were supposed to contain only unclassified information, the department has retroactively withheld some of their contents as classified when reviewing them for release in response to a Freedom of Information Act lawsuit.) But Mr. Trump offered no backup for his claim that the private server was used to hide “corrupt dealings. ” Noting that President Obama had officially endorsed Mrs. Clinton on Thursday, Mr. Trump added, “First time ever, by the way, a president of the United States endorsed somebody under criminal investigation. ” But that assertion also goes beyond the known facts. The FBI is investigating Mrs. Clinton’s use of a private server, but agents have not yet interviewed her and it is not clear if she herself is a target of a criminal inquiry. A few young protesters interrupted Mr. Trump’s remarks, shouting “Dump Trump” and other slogans. After they were muscled out by security guards, Mr. Trump called them “professional agitators” who were “sent in by the other party  —   believe me. ” Mr. Trump’s speech Friday came as he is battling to regain his footing after weeks of missteps, none more damaging than his questioning whether a federal judge could preside fairly over a case against Trump University because the judge is of Mexican heritage. With party leaders expressing outrage and voicing doubts that he can unify Republicans and defeat Mrs. Clinton in November, Mr. Trump noticeably curbed his impulsiveness Tuesday night, promising in a prepared speech not to let his supporters down. Still, in a Bloomberg Politics podcast published Friday morning, Senate Majority Leader Mitch McConnell raised the possibility of rescinding his endorsement if Mr. Trump did not “change directions. ” Alluding to what he called Mr. Trump’s “obvious shortcomings,” Mr. McConnell said, “It’s pretty obvious he doesn’t know a lot about the issues. ” Before the Faith and Freedom Coalition Friday afternoon, Mr. Trump again stuck mainly to a script, reading from teleprompter screens. But he still   in his characteristically clipped syntax. “We want to uphold the sanctity and dignity of life, marriage and family as the building block of happiness and success,” he said. “And by the way, I know many, many very successful people. The happiest people are the people that have had great religious feel and that  —   incredible marriage, children. It’s more important than the money, folks. Believe me. ” Mr. Trump  —   who has been married three times  —   does not hew to traditional conservative orthodoxy. He previously supported abortion rights, and he said earlier this year that Planned Parenthood has done “some very good work” for millions of women. And in response to North Carolina’s controversial new bathroom law, Mr. Trump said that transgender people should be able to use whatever bathroom where they feel most comfortable. But he nonetheless won the early endorsement of leaders like Jerry Falwell Jr. president of Liberty University, and successfully wooed evangelical voters during the primary, exit polls showed. Hogan Gidley, a former aide to Gov. Mike Huckabee of Arkansas, said that while evangelicals “would love to have a true evangelical in the White House,” they understood that Republicans required a broader coalition to win in November. “Republicans cannot win without getting evangelicals, and they can’t win only getting evangelicals,” Mr. Gidley said. “They have to expand the voter universe and so far, Trump has done an amazing job with that. ”'"}, "time": 1742564579.3830013}