{"duration": 0.0638573169708252, "input_args": {"text": "'Pinterest \\nAn internal letter to FBI employees from Director James Comey has just been leaked. \\nThe memo reveals some startling information that Democrats, and the liberal media, certainly would have preferred to keep hidden from the public. \\nAmong other things, we’ve learned that Comey believed the election required full disclosure regarding the ongoing investigation into Hillary Clinton’s email scandal. \\nHere is the full text: \\nTo all: \\nThis morning I sent a letter to Congress in connection with the Secretary Clinton email investigation. Yesterday, the investigative team briefed me on their recommendation with respect to seeking access to emails that have recently been found in an unrelated case. Because those emails appear to be pertinent to our investigation, I agreed that we should take appropriate steps to obtain and review them. \\nOf course, we don’t ordinarily tell Congress about ongoing investigations, but here I feel an obligation to do so given that I testified repeatedly in recent months that our investigation was completed. I also think it would be misleading to the American people were we not to supplement the record. At the same time, however, given that we don’t know the significance of this newly discovered collection of emails, I don’t want to create a misleading impression. In trying to strike that balance, in a brief letter and in the middle of an election season, there is significant risk of being misunderstood, but I wanted you to hear directly from me about it. \\nJim Comey \\n\\n\\nWe’ve really got to hand it to Comey in this case. By all appearances, he decided to move quickly on this matter not in spite of , but because of the election. \\nNow, the truth might turn out to be quite different from this take on things, but for right now, our judgments should be based on the reliable information at hand. \\nAnd as it stands, Comey seems by all appearances to be genuinely interested in getting to the bottom of this Hillary email mess BEFORE the election, if at all possible. \\nThat’s admirable, especially coming from a public official. \\nWe’ll just have to wait to see what comes from it, and if Director Comey will stick with his guns. \\nThe survival of American democracy may depend on it.'"}, "time": 1742562296.6072593}