{"duration": 0.037041664123535156, "input_args": {"text": "'This is unbelievable! Donald Trump must be the next Nostradamus! One year ago, Donald Trump said something so profound that it is almost unbelievable. Take a look: #TRUMP was right again! \\n— Trump Super PAC (@TrumpSuperPAC) October 28, 2016 \\nOn August 29th, 2015, just after news broke that Huma Abedin’s husband, Anthony Weiner, had been sexting young women, again, Trump said something that has turned out to be both profound and prophetic. \\n“I only worry in that Hillary Clinton was careless and negligent in allowing Weiner to have close proximity to highly classified information.” \\nHe has also said: \\n“Her No. 1 person, Huma Abedin, is married to Anthony Weiner, who’s a sleazeball and pervert,” Trump said, referring to the former New York congressman’s repeated scandals over lewd texts and direct Twitter messages he sent to other women. “I’m not saying that, that’s recorded history,” Trump continued. “I don’t like Huma going home at night and telling Anthony Weiner all of these secrets.” \\nTrump intuitively knew that Hillary’s top aide, Huma Abedin, was a massive liability. \\nNow look at what just happened today! \\nThe New York Times reports: \\nThe FBI is investigating illicit text messages that Mr. Weiner sent to a 15-year-old girl in North Carolina. The Bureau told Congress on Friday that it had uncovered new emails related to the Clinton case – one federal official said they numbered in the thousands – potentially reigniting an issue that has weighed on the Presidential Campaign and offering a lifeline to Donald J. Trump less than two weeks before the Election.” \\nLet that sink in. \\nThe FBI had closed the Hillary Clinton email investigation, and now has reopened it after finding emails on Anthony Wieners devices as part of a sexting scandal and investigation. \\nTrump was right about Huma and Wiener! \\nThere are other scandals that intersect with this one, as well. \\nThe pay-for-play questions that have been raised about the Clinton Foundation are in play, as Huma Abedin worked daily with the Clintons on countless issues. \\nIs this the issue that will take Hillary down for good? \\nTime will tell.'"}, "time": 1742561699.7860184}