{"duration": 0.05160999298095703, "input_args": {"text": "'Pinterest \\nDespite being acquitted by a federal jury Tuesday, Bundy brothers Ammon and Randy still remain in jail. \\nThe brothers, as well as a number of other co-defendants, were acquitted in the case involving the occupation of the Malheur National Wildlife Refuge. \\nThe band of ranchers and farmers had commandeered the refuge at the start of the year to protest what they felt was the illegal seizure of land by the federal government. \\nAfter the standoff eventually ended in late January, federal prosecutors charged them with “conspiring to impede federal workers from their jobs,” as reported by Fox News , but as Tuesday’s news demonstrates, the charges did not stick. \\nSadly for the Bundy brothers, however, the story is far from over. \\nIt turned out that the Bundys still face charges in Nevada stemming from a previous standoff, this one at their father’s ranch in 2014. Ergo, U.S. District Judge Anna Brown could not release them; instead she approved the U.S. Marshals’ request to take them into custody. \\nWhen the marshals attempted that, however, a scuffle broke out between them and Ammon Bundy’s lead attorney, Marcus Mumford: \\nAfter the verdicts were read, an attorney for group leader Ammon Bundy demanded his client be immediately released and repeatedly yelled at the judge. U.S. marshals tackled attorney Marcus Mumford to the ground, used a stun gun on him several times and arrested him. \\nMumford later explained to reporters what exactly had transpired: \\nAlso speaking with reporters, another one of Ammon’s attorneys reportedly shared his belief that an acquittal would be achieved in the Nevada case as well. \\n“When the jury here hears the whole story, I expect the same result,” attorney Daniel Hill reportedly told the Associated Press, adding that he intended to ask for “client’s release from federal custody pending trial in Nevada.” \\nAccording to The Oregonian , the Bundy brothers’ trial is set to begin Feb. 6, 2017. Their notorious father, Cliven Bundy, is slated to go on trial that day as well.'"}, "time": 1742562103.9271398}