{"duration": 0.21905779838562012, "input_args": {"text": "'posted by Eddie F or centuries people have been looking into their teacups to find answers in the tea leaves. These brews and herbs have always held a spiritual energy . When you take time to make yourself a soothing cup of herbal tea, you are allowing yourself to go within. You soften your thoughts and begin to hear the voice of your intuition. The Art of Spiritual Tea Making In our current convenience-focused age, many just grab a tea bag and pop it into a cup of hot water. This instant tea is really just flavored water. If you want to gain all the spiritual benefits that a healing herbal infusion has to offer, you need to take some time in preparing it. Tea is best made in a closed vessel—either a teapot or a cup with a small saucer placed on top to serve as a lid. When you brew tea this way, you allow the beautiful aromatic qualities to recirculate back into the liquid. You know that uplifting fragrance emanating from peppermint tea? Well, that represents most of the spiritually healing herbal oils floating off into the atmosphere. If you brew it in a teapot or cup with a lid, the steam condenses back into the infusion. For most herbal teas and for maximum spiritual benefit to be had, you’ll want to brew it for at least five minutes in boiling water. You can allow your tea to brew longer and get an even more potent spiritually activating herbal infusion . A general rule is one teaspoon of herb per cup of water, plus one extra for the teapot. So if your teapot holds two cups of water, you would add three teaspoons of herb. Spiritual Properties of Various Herbs, Plants and Teas Calendula Calendula is a powerful spiritual herb that will bring healing as well as activate your innate healing abilities. When you drink calendula, you stand tall as a powerful healer. This tea repairs your aura and brings energetic protection. Chamomile Chamomile helps attract abundance. This pleasant tasting spiritual herb relaxes your energy, which allows you to become receptive. The Universe and God always have your best interests in mind. When things seem challenging, it can be for one of two reasons: You are trying to go in a different direction than where you are truly being guided, or you are unwilling to receive help and support along the way. When you drink chamomile, you let down your guard and let in the healing love of God and your angels. Fennel Fennel tea (made from the seeds) can help reduce sugar cravings. On an energetic level it gives you a “pat on the back.” As a healer or reader, you may focus on helping others rather than devoting time to yourself. By drinking this herbal, spiritually enhancing infusion, you remember that it’s okay to have a rest every now and then. You can relax, take a day off, and just enjoy life. Ginger Ginger tea releases anger and frustration. It helps you let go of resentment and jealousy, bringing you to a place of contentment and balance. Hibiscus Hibiscus tea makes a wonderful ruby-colored infusion. It allows you to accept your sensitive side. Know that being sensitive isn’t a weakness; it’s an asset! By picking up on the subtle energies around you, you will know much more easily when you should move on. The spiritual plant hibiscus brings you and your loved ones together. It heals past wounds and promotes forgiveness. Lavender Lavender is a legendary spiritually rejuvenating herb that relaxes your mind and quiets the ego voice. It is beautiful before a meditation, as it resonates with the third-eye chakra—your center of clairvoyance. This summons psychic visions and intuitive insights. Lavender brings a deeper spiritual understanding . This herb helps cast away any fears about embracing your spiritual gifts. Lemongrass Lemongrass is a lesser known spiritual herb that wards off distractions and procrastination. If you are struggling to get something done and finding many excuses not to do it, then you need lemongrass tea! It brings you clarity of purpose so you can get to work. It also shows you the tremendous benefit that completing this task will serve both you and others. Lemongrass sharpens your focus and stops people from interrupting your important job. Nettle tea Nettle tea is great for when you feel worn-out and drained. It is a highly nutritious infusion that supports your body physically. It provides energetic protection , giving you time to recharge. As your body and mind reset, you learn new ways to handle situations. Understand the lessons involved in your current situation and you won’t have to repeat them. Peppermint Peppermint is a common yet still powerful spiritual plant that helps motivate and inspire you, bringing you new creative ideas on how to achieve your dreams . It clears and balances the sacral and solar-plexus chakras, lending you confidence and self-esteem. Rose Rose tea is an ancient, sacred spiritual herb that opens your heart. It attracts compassion; understanding; healing; and, of course, love. When drinking this tea, you become very aware of your language. Every word you speak will have the essence of love attached to it. All your communications will be uplifting and centered around healing. You’ll find that you have no time for gossip or negativity. Instead, you will become an inspiration to those around you—who will wonder why you are so peaceful and then will want to join you on that path of tranquility. Rosemary Rosemary may not be an herb you’d commonly think of for tea. It tastes exactly like you’d expect, but the energy is beautiful! Rosemary has an affinity for the head area. It clears away unwanted thoughts, lifts negative thinking in favor of a positive attitude, and assists with concentration. Rosemary resonates with the third-eye chakra and releases pressure surrounding your spiritual path, making it a great spiritual herb to keep on hand. Allow yourself to enjoy this wonderful journey, and don’t put unnecessary deadlines in place. Saffron Saffron tea sounds so indulgent and somewhat royal. And saffron is the most expensive herb in the world. Thankfully, you only need the smallest amount to make a very powerful spiritually activating tea. Add five to ten good quality saffron threads (parts of the pistil of a crocus) to a cup of boiling water. Allow to steep for a minimum of ten minutes so the saffron can fully give itself to the water. Research trials have shown that saffron helps ease symptoms of premenstrual syndrome and feelings of depression. Spiritually, saffron unlocks the mysteries of the Universe, allowing you to learn deep, esoteric concepts. It awakens and clears all your energy centers and connects you to God, making it an essential spiritual herb for the seeker. Thyme Thyme is another spiritual herb you might not have considered brewing. This tea opens up your centers of communication and resonates with the throat chakra to help you speak and write with passion and purpose. If you’re finding it difficult to express yourself, try thyme tea. How to Take Herbal Medicines As a sensitive and spiritual person, you may not need high doses of herbal supplements, as your body is receptive to these healing compounds and will immediately begin to utilize them. Where it may take others three to four weeks to observe a change, you might see improvements in just a matter of days. You understand that what you eat changes your entire energy. You’ve noticed that you can’t handle certain foods or drinks because they just don’t agree with your delicate body. So, before you dive into high doses of spiritual herbs , check in with your intuitive feelings. Herbal medicines come in a variety of forms, including tablets, capsules, teas, liquid extracts, and tinctures. Whichever form you choose, please ensure it’s sourced from a reliable company, sustainably harvested, and organic or wild-crafted. This will give you the best results, as well as the highest energy and spiritual activation. Any form of spiritual herb will have a healing influence, yet there is something especially powerful about a liquid. When you take a tincture, it brings through the energy and vibration of the spiritual plant. Add the appropriate dose to a small glass of water. The amount of water isn’t important as long as you drink the entirety. If you are on any other medications or have preexisting health concerns, please always check with your health-care practitioner before starting any herbal medicines. Elder (Sambucus nigra) Elder (Sambucus nigra) is available in two forms—the berry and the flower. Elderberry is an excellent antiviral. In this case, though, we are more interested in the elder flowers, as they help promote sweating. The elder tree has a long history connected to ancient mysticism. Even farmers would refer to the spirit of this tree as the “Elder Mother.” This spiritual herb has a powerful energy that awakens your intuition and opens your chakras . Elder flowers have a connection to the head and are excellent for people with constant colds, runny noses, or hay fever. Ginger (Zingiber officinale) Ginger (Zingiber officinale) is a warming herb that stimulates your circulation. As your blood spreads through the superficial layers of your skin, it clears the eccrine glands. The ginger carries with it the nutrition that’s available to your body. Think of it like a courier transporting your vitamins and minerals to the locations that need them most. Along with this nutrition, your energy also flows through the same path. According to traditional Chinese medicine, the blood and energy/vital force follow one another. So if your circulation is stimulated, so too is your energy, and therefore your intuition. Peppermint (Mentha x piperita) Peppermint (Mentha x piperita) helps stimulate the eccrine glands and soothe an upset stomach. You may have noticed that when you have a cup of spiritually activating peppermint tea, your hands sometimes feel warmer. This doesn’t happen all the time, but when it does, it shows that the energy in your palm chakras has been awakened. Your hands are now more sensitive to energy, and you can use them as a natural divination tool. When you meet someone for the first time and shake hands, trust the impression that you receive. Peppermint tea will help you have more confidence in these intuitive messages . Heart-Healthy Herbs Herbal medicines have both physical and energetic properties. These heart-healthy spiritual herbs nourish and protect your physical heart, stimulate your heart chakra, and also heal you emotionally. Astragalus (Astragalus membranaceus) Astragalus (Astragalus membranaceus) is a legendary tonic spiritual herb that nourishes the heart. It may balance blood pressure, as well as help you better cope with stress. Astragalus is a wonderful regulator for the body. It corrects imbalances and helps you overcome any obstacles. Dan Shen (Salvia miltiorrhiza) Dan Shen (Salvia miltiorrhiza) is a spiritual herb that has a strong connection to the heart. It balances blood pressure and prevents your blood from becoming too thick. Dan Shen protects the heart and can reduce palpitations. This herb can be helpful when people have a fiery energy about them, seeming angry and aggressive. A red face that comes from anger or high blood pressure can be a sign that this herb is needed. Hawthorn (Crataegus monogyna) Hawthorn (Crataegus monogyna) is one of my favorite heart-healing spiritual herbs. I use it for both the physical and emotional heart. On a physical level, it protects the heart muscle. It nourishes this precious organ, helping strengthen and regulate it. Emotionally and energetically, it soothes a broken heart. I’ve used it for healing grief; difficult relationships; and feelings of being taken advantage of by friends, family, or partners. Hawthorn has a gentle energy, like a comforting friend giving you support. Korean Ginseng (Panax ginseng) Korean ginseng (Panax ginseng) is a powerful, tonic spiritual herb that deserves a great deal of respect. It stimulates and awakens the whole body. In contrast to the way caffeine stimulates, Korean ginseng heals and restores. It nourishes the heart and clears feelings of debility. Korean ginseng allows you to cope with stressful situations in a healthy way, and has even shown an ability to increase mental alertness and memory. Taking a dose just before an exam can help you remember more information—an effect made even more powerful when you combine it with ginkgo. Source: by Doreen Virtue and Robert Reeves, N.D. From Around the Web Founder of WorldTruth.Tv and WomansVibe.com Eddie ( 8988 Posts ) \\nEddie L. is the founder and owner of www.WorldTruth.TV. and www.Womansvibe.com. Both website are dedicated to educating and informing people with articles on powerful and concealed information from around the world. I have spent the last 36+ years researching Bible, History, Alternative Health, Secret Societies, Symbolism and many other topics that are not reported by mainstream media.'"}, "time": 1742564191.2337844}