{"duration": 0.08269071578979492, "input_args": {"text": "'WASHINGTON  —   President Trump ordered a cruise missile strike against a Syrian regime military airbase, in response to a chemical weapons attack carried out by the regime earlier this week. [At 8:40 p. m. EDT, the U. S. launched 59 Tomahawk land attack missiles at the Shayrat Airfield located in the Homs Governorate in Western Syria, according to Pentagon officials. The strike lasted minutes.  “This was in response to the Syrian chemical weapons attack April 4th in Khan Sheikhoun  …     That attack killed and injured hundreds of innocent Syrian people, including women and children,” said Pentagon spokesman Navy Capt. Jeff Davis. “The strikes were intended to deter the regime from using chemical weapons again,” he said. The missiles were launched from U. S. destroyers USS Porter and Ross, which were in the Eastern Mediterranean Sea at the time, he said. The missiles hit aircraft, hardened aircraft shelters, petroleum and logistical storage areas, ammunition supply bunkers, air defense systems and radars, he said. Davis said the U. S. military took care to avoid any human casualties. It notified Russia  —   and “many countries”  —   of the planned strikes ahead of time. There were Russian troops at the airbase, although it’ is not clear if they were still there during the strikes. Davis said the U. S. struck an area where Russian and Syrian troops were not located. “In this case in particular, every precaution was taken to execute these strikes with minimal risk to personnel at the airfield,” Davis said. The strike was aimed at deterring another chemical weapons attack by the regime. The airbase was the same one the regime used to carry out the chemical weapons attack, Davis said. The U. S. military said it tracked the two aircraft that the regime used to conduct the attacks. The airbase also housed one of Syria’s main chemical weapons storage facility prior to 2013, he said. Trump had hinted on Wednesday during a Rose Garden briefing with the King of Jordan that he would take action against the regime. He said the attack had crossed “many, many lines, beyond a red line  —   many, many lines. ” “That attack on children yesterday had a big impact on me. Big impact,” Trump had said. “That was a horrible, horrible thing, and I’ve been watching it and seeing it, and it doesn’t get any worse than that. ” Trump reportedly spoke with lawmakers before the strike. Sen. Rand Paul ( ) called on the president to come to Congress to seek congressional authorization for military action in Syria. “While we all condemn the atrocities in Syria, the US was not attacked,” he said in a statement. “The President needs congressional authorization for military action and I call on him to come to Congress for a proper debate on our role. Our prior interventions in this region have done nothing to make us safer and Syria will be no different. ” Sen. Ted Cruz ( ) called Syrian President Bashar   a “monster” and a “puppet of Russia and Iran” but said he looked forward to the president “making the case to Congress and the American people” in the days ahead. Meanwhile, Republican and Democratic defense hawks praised the airstrikes. “Unlike the previous administration, President Trump confronted a pivotal moment in Syria and took action,” said Sens. John McCain ( ) and Lindsey Graham ( ). “I think it was an important step,” Sen. Marco Rubio ( ) said on CNN. “This was not some symbolic measure. ” “I support the admin’s strike on the air base that launched the chemical attack. I hope this teaches Assad not to use chemical weapons again,” said Sen. Bill Nelson ( ). In a statement, President Trump explained the urgency behind the strikes: My fellow Americans, on Tuesday, Syrian dictator Bashar   launched a horrible chemical weapons attack on innocent civilians. Using a deadly nerve agent, Assad choked out the lives of helpless men, women and children. It was a slow and brutal death for so many, even beautiful babies were cruelly murdered in this very barbaric attack. No child of God should ever suffer such horror. Tonight, I ordered a targeted military strike on the airfield in Syria from where a chemical attack was launched. It is in the vital, national security interest of the United States to prevent and deter the spread and use of deadly chemical weapons. There can be no dispute that Syria used banned chemical weapons, violated its obligations under the chemical weapons convention and ignored the urging of the U. N. Security Council. Years of previous attempts at changing Assad’s behavior have all failed, and failed very dramatically. As a result, the refugee crisis continues to deepen and the region continues to destabilize, threatening the United States and its allies. Tonight I call on all civilized nations to join us in seeking to end the slaughter and bloodshed in Syria and also to end terrorism of all kinds and all types. We ask for God’s wisdom as we face the challenge of our very troubled world. We pray for the lives of the wounded and for the souls of those who have passed and we hope that as long as America stands for justice, that peace and harmony will, in the end, prevail. Good night and God bless America and the entire world. Thank you.  '"}, "time": 1742561847.6065326}