{"duration": 0.04259347915649414, "input_args": {"text": "'You are here: Home / US / CA Dem Make Massive Move to DESTROY Rule of Law… Spread This EVERYWHERE CA Dem Make Massive Move to DESTROY Rule of Law… Spread This EVERYWHERE October 29, 2016 \\nMediaite reported : \\nCalifornia Democratic Attorney General Kamala Harris told a group of Hispanic supporters earlier this week that someone who has engaged in illegal immigration “is not a criminal.” \\nHarris is favored by a wide margin in Senate race in the deep blue state, but her Democratic opponent Loretta Sanchez has been polling better with Hispanics. Accordingly, The Sacremento Bee reports that Harris has been making a full-court press for the Latino vote in the final days of the election. \\nThe Bee reports that Harris’ comment was not a one-off pronouncement, but has become a standard campaign line. Harris is also citing her work defending sanctuary cities and her work “organizing legal services for unaccompanied minors during the Central American refugee crises.” \\nThe Left has been working feverishly for years to make the public believe that illegally entering this country isn’t a crime, hence the word “undocumented.” \\nLiberals love to use the word “undocumented” instead of the correct word, “illegal.” But someone that doesn’t go through the legal system to immigrate to this country isn’t simply “undocumented,” they are a criminal. \\nUsing the term “undocumented” makes it seem as if it’s just a simple oversight and not criminal activity. That argument wouldn’t fly if you didn’t file your taxes, and it shouldn’t fly here either. \\nI doubt it would go over too well if someone who didn’t file their taxes for years claimed that they weren’t tax evaders, but simply “undocumented tax filers.” \\nThere’s another claim also made by the anti-rule of law folks. Illegal immigrants can’t be held responsible because the system is super hard! \\nWell guess what, the tax system is all kinds of messed up, takes far too much money from Americans, and is extremely complicated — so can you use that same excuse applied to illegal immigrants for why you didn’t file your taxes? \\nNope, legal Americans are held to a different standard. We’re expected to pay for people who break our laws to come here and get welfare, food stamps, social security, Medicare/Medicaid, etc. \\nWe need the rule of law restored in this country, and we need a president that is going to put the interests of American citizens first. That’s precisely what Donald Trump has proposed to do — and is the opposite of what Hillary Clinton has proposed. \\nLet’s hope that Americans see that on Nov. 8.'"}, "time": 1742628425.1804218}