{"duration": 0.1479203701019287, "input_args": {"text": "'MIAMI  —   Alexis K. Manigo closes her eyes to sleep and sees images of her mother. She recalls the doting mom who took her to zoos, aquariums and SeaWorld, and marvels at how fortunate she was to have a parent who loved her unconditionally. But those memories are now complicated by an extraordinary drama that has played out over the week since Ms. Manigo, 18, found out that she had been spirited away as a newborn from a hospital in Jacksonville, Fla. that her real name is Kamiyah Mobley, and that the woman she still thinks of as her mother has been charged with her abduction. She is still trying to make sense of it all. She met with her birth parents, Craig Aiken and Shanara Mobley, last weekend. But in her first newspaper interview since the case made headlines on Friday, she said she did not have a cross word for Gloria Williams, the woman who now stands accused of lurking for more than a dozen hours around a Jacksonville hospital on the July 1998 day Ms. Manigo was born, looking for a newborn to snatch. “I feel like I was blessed,” Ms. Manigo said in a telephone interview. “I never had a reason to question a blessing like that, someone loving you so much. ” Ms. Manigo said she never had cause to doubt her mother in the rural South Carolina community where she grew up. But the police say someone else clearly did. At least two tips were called in late last year to the Jacksonville Sheriff’s Office, some 200 miles away, where the police still had an open   case. “A woman posing as a health care worker approached a young mother, then 16, with a newborn, and walked out of what was then University Medical Center with a baby and disappeared,” Sheriff Mike Williams recounted at a news conference on Friday. The woman wore flowered hospital scrubs and carried a purse, which seemed odd. “What’s she doing with a pocketbook?” the baby’s grandmother, Velma Aiken, recalled thinking in a report on the 10th anniversary of the case. “That lady could be stealing your baby. ” She thought, “I’m picking up a bad spirit. ” The woman spent hours with the family and then left with the baby, saying the girl had a fever and needed some tests. They never came back. “In the 18 years since that child’s abduction, we have received and followed up on more than 2, 500 investigative leads,” Sheriff Williams said, recalling an “intense, lengthy, detailed, multiagency investigation. ” The family reached a legal settlement with the hospital two years later. And every year, the baby’s mother would wrap a slice of birthday cake in tinfoil and freeze it. The case also went cold. Late last year, two fresh tips came in, and they led   detectives to Walterboro, S. C. a town of just 5, 000 people an hour west of Charleston. There, the investigators found a young woman who had been born on July 10, 1998, just like Kamiyah, but with a different name. Her documents were fraudulent, Sheriff Williams said, and “interviews with people” supported the idea that the two women were one and the same. The detectives asked Ms. Manigo for a DNA sample. “And of course, like someone who understands their rights, she said: ‘What is this about? Do you have a warrant? ’” said her lawyer, Justin Bamberg. The investigators returned with one. Ms. Manigo gave her DNA and in short order found out the truth: She was someone else’s child. Conscious of the fact that the woman she knew as her mother will now face trial for kidnapping, Ms. Manigo is unwilling to discuss a lot about the case, including how her family life finally unraveled. She does not want to say which name she plans to use in the future, and she insisted that she was never suspicious  —   although the police said otherwise at a news conference on Friday. “I never had any ID or a driver’s license, but other than that, everything was totally normal,” she said. She did acknowledge being stymied a few months ago when she applied for work at Shoney’s but lacked the Social Security card she needed to get the job. “She took care of everything I ever needed,” Ms. Manigo said. “I never wanted for anything. I always trusted her with it. ” She said that Ms. Williams was not mentally ill and that she had not been overprotective. Ms. Williams worked at a Navy yard handling medical records and was set to receive her master’s degree this year. “She was a very smart woman,” Ms. Manigo said. Ms. Manigo met her biological parents on Saturday, at a teary reunion followed by a   trip to the mall. She called them Mom and Dad, because she figured those were words they had been waiting a long time to hear. “You can tell she has a lot of love for me as well,” Ms. Manigo said about her biological mother, who could not be reached for comment. “They don’t feel like  . They feel like distant family. ” She said she felt an innate trust toward them. Her father, Craig Aiken, told   in Jacksonville the meeting was “beautiful. ” “It’s a feeling that you can’t explain,” he said. Mr. Bamberg, Ms. Manigo’s lawyer, said there were now practical matters to attend to. She needs identification and a Social Security card. A large financial settlement was won on her behalf, and now that she is 18, it has to be determined whether any money was set aside for her. “You have incidents where people’s lives were turned upside down, and then you have this: a life that was essentially erased,” he said. Among the few people who can really relate to what Ms. Mobley is experiencing is Sarah Cecilie Finkelstein Waters. When she was a preschooler living with her mother, her father took her, and it was not until she was a teenager and saw her picture on a milk carton that she realized that she had been abducted. Ms. Waters eventually reconnected with her mother, distanced herself from her father and, as an adult, befriended other survivors of abduction. “It turns reality upside down and forces you to question every core thing you ever believed to be true,” said Ms. Waters, now 46, married and a mother herself, living on Long Island. “You have to really struggle to come to terms with all these shades of gray, make sense of them, and hopefully some sort of peace with them: What is reality? Who is wrong and who’s right? Who really loves me? Who is telling the truth?” Since Ms. Mobley seems devoted to the woman she believed was her mother, Ms. Waters said, “She needs to feel like she can embrace her new family without giving up on her old one. ” Geoffrey Greif, a professor at the University of Maryland School of Social Work who has studied abduction cases, said some psychological effects were common. “As you connect the dots over a period of time, it’s a pretty normal reaction to become upset with the abductor, and a child who was abducted may have trouble developing intimacy and trust with other people,” he said. “We often see a degree of anger at the parents who were left behind, even if that’s not really justified, like ‘Why didn’t you look harder for me? ’” But cases like Ms. Mobley’s are quite rare. Thousands of children are abducted each year, but usually the abductor is a family member, most often a parent. And abduction by a stranger often has a tragic end  —   sexual abuse, death or both. A spokesman for the hospital, which is now called UF Health Jacksonville, said the medical center was thrilled that the young woman had been found. “We share in the joy of this discovery with her family, the northeast Florida community, and law enforcement as they celebrate this news,” the spokesman, Dan Leveton, said in a statement. “Like most hospitals, we currently have specialized,     security measures in place, both   and electronic, to protect newborns and their mothers. ” Ms. Manigo, somehow, has taken it all in stride so far. And for her, Mom still means Ms. Williams, who is being held at the Jacksonville jail without bond. “When I close my eyes, I see my mother,” she said. “I like that. I love that. ”'"}, "time": 1742562983.5971725}