{"duration": 0.031423330307006836, "input_args": {"text": "'Videos Hundreds of Armed Police Descend On Water Protectors Trying To Reach DAPL Site Amidst the standoff one peaceful demonstrator said she was telling officers that she \"Loved them\" when they began shooting her in the face with mace. | November 3, 2016 Be Sociable, Share! \\nPolice descended on water protectors in North Dakota on Wednesday, as images on social media showed a dramatic standoff along a creek that borders a construction site for the long-opposed Dakota Access Pipeline (DAPL) . \\nJordan Chariton, a political reporter with The Young Turks network, posted this video dispatch after covering events just east of the main camp, where Standing Rock Sioux tribal members and their allies were set upon by law enforcement officers in full military gear: \\nAmidst the standoff one peaceful demonstrator said she was telling officers that she “Loved them” when they began shooting her in the face with mace. \\nAnd filmmaker and journalist Josh Fox, also on the scene, decried the violence by authorities, telling Chariton, “These people from the North Dakota police force and the United States government has lost legitimacy in every respect today.” \\nAccording to independent media outlet Unicorn Riot , which was also on the ground in the town of Cannon Ball, hundreds of water protectors attempted to cross footbridges built over Cantapeta Creek to reach the DAPL construction area on the other shore, but the police in riot gear reportedly pulled the bridges apart and forcibly kept people from crossing onto the opposite bank. \\nOne protector said the walkways had been built to help elders reach the construction area to pray for sacred sites. \\nThe Bismarck Tribune writes that the U.S. Army Corps of Engineers, which lays claim to the land along the shoreline, gave Morton County the orders to arrest protesters and break down the bridge. \\nAccording to Grand Forks Herald , law enforcement officers used a boat to pull the bridge apart, and many protectors proceeded to swim across the river. \\nPeople on the ground said women and children were being evacuated from the protest camps, multiple people had already been maced, and police had fired rubber bullets, injuring at least one person. \\nNative American tribes and activists from all over the country have been resisting DAPL’s construction for months, saying it threatens their access to clean water and violates treaty rights. \\nWhite residue floating on top of water is from the variety of chemical weapons used against #NoDAPL water protectors. pic.twitter.com/HObv9xlPCV \\n— Unicorn Riot (@UR_Ninja) November 2, 2016 \\nJust coverered disturbing standoff bw ND police and protectors-police pepper sprayed, shot rubber bullets @ point blank range #NoDAPl'"}, "time": 1742628468.2221515}