{"duration": 0.0896148681640625, "input_args": {"text": "'Re: the nonsense she says : it’s best not to take ideological disagreements too personally imo 11:17 PM; I don’t. I don’t give a shit. Dao 11:19 PM: you seem a bit off to me is all. just looking out for you. I do care. 11:20 PM; as opposed to what? you only know me starting from a period where I experienced many of the worst things in my life, to be honest you don’t have a strong baseline in knowing me yet, and it takes years for most 11:22 PM: just an intuition 11:22 PM; there’s a difference between life is hard now and life is hard 11:23 PM; if you want to know what I meant, not expecting that she did. I see the same potential and value in all forms of life. I don’t see humanity as any better or worse than any other species and if I were to attribute \"genius\" to anything it would be to the spirit that binds with the human body. I don’t think she took it that way but her response was emotive as it was, no point in adding to it. She feels how she feels, I do how I do. An argument changes neither of our views and how we act in real life. Hence adding about practicality and empirical occurrence. If things don’t change in real life, I don’t see the point in arguing. 11:32 PM; out and about 11:34 PM: there is a value in exchanging ideas even if you don’t mutually change your original opinion, it offers perspective 11:34 PM; I’ve been over that same notion with others before, I lean away from that 12:16 AM: why? 12:16 AM; start with why not? 12:17 AM: didn’t I just say my opinion though? that would be my reason 12:17 AM; for me, cost benefit analysis is usually such that discussions carry more risk than potential benefit 12:18 AM: see, I don’t feel that way at all. I feel exactly the opposite. I always feel that if you are open to learning about others, there’s never a wasted discussion 12:19 AM; one can’t give equal weight to all relationships, one can’t be open to everyone yet give whole focus on who counts most in their life 12:21 AM: well, yeah you prioritize the people who count the most to you, but that doesn’t have to exclude others you talk to either 12:21 AM; I mean things quite more broadly, taken in principle and in turn down to the minute. If I spent so much time engaging in random discussions with random people I’d hardly have the time and energy for discussions and people that are not so random to my life, let alone those not random at all. 12:23 AM: I disagree. I think there is plenty of time for discussions with random strangers and important people. We spend a lot of time online anyway, we might as well make the time we do spend meaningful. Plenty just browse social media or don’t interact at all. We may be strangers but we are a real social circle. It may be far less important then the face to face interactions for you, but is there no time for it and is it meaningless? IMO no. 12:28 AM; You misunderstand. Before I speak for myself more, take a look at the fueds of the people you know. You can’t choose equanimity for all of them even if you wanted to. 12:31 AM: sure, but that doesn’t mean those people don’t mean anything to me, or that I’d write them off 12:32 AM; It’s not about that, especially if you’re focusing on discussion/interaction in this case. If anything to opt out represents greater sense of caring for others. 12:33 AM: how? 12:33 AM; by sparing people hardship through disagreement for one 12:34 AM: disagreement is enlightening. as sun tzu says, those we disagree with often teach as the most. I think it’s important to understand the perspective of others. it’s not a hardship, discussion and disagreement is how the truth is found. if you avoid those who disagree with you you easily fall prey to a cognitive fallacy known as confirmation bias 12:35 AM; note I said cost benefit analysis before. the risks comes too great and people get heated and even friendships break. I say that from observation including of your own friends, and I say that from experience regarding mine. I spared ___ an argument just now that wouldn’t have changed her view on anything if it happened, nor would it have changed mine. It’s the same now, I won’t change your view and you won’t change mine. 12:37 AM: well that’s silly imo ___. I think intellectual peers need to learn how to dissociate their ideas from their feelings and friendships and the people in this room are more then capable of that. are you? 12:38 AM Page 1'"}, "time": 1742561770.6065674}