{"duration": 0.06343460083007812, "input_args": {"text": "'KARACHI, Pakistan  —   It was a weekday afternoon in an upscale neighborhood of Karachi, but the hall was packed for the lecture on Islam and marriage. Laughter burst forth as the speaker asked how husbands change over the years. They’re terrible listeners, one woman said. Inattentive, offered another. Other women, apparently without husbands, offered more charitable attributes: They’re rational, and able to take risks. “I was expecting the unmarried lot would have more unrealistic expectations for men,” the speaker said to more laughter. Most religious events in Karachi are dominated by men and addressed by older,   clerics, but the participants at this recent lecture were all women. Drawn largely from the city’s affluent neighborhoods, they sat in rapt attention, dressed in bright patterned tunics, listening to the lecturer, Sara Asif, instruct them on Islamic strictures. Ms. Asif talked about the strengths of women, and how a man’s life  —   and home  —   would be joyless without a wife. “Allah has given us beauty,” she said. “All of us are beautiful. ” Such lectures by instructors like Ms. Asif are part of a growing religious ecosystem for women in Pakistan that eschews politics and traditional clerics in favor of female preachers and an   consumer lifestyle. This new culture has attracted a diverse mix of homemakers and socialites, bankers and doctors, who incorporate religion into their lives, but also into their lifestyles, buying everything from sequined abayas to custom prayer mats. The   in Karachi have been turning to Islam since the 1990s, when a female preacher called Farhat Hashmi began preaching the faith at the palatial homes that are a feature of Karachi’s wealthy neighborhoods. Soon after, women in those communities could be seen wearing burqas and attending Quran classes with the zeal of the newly converted. Ms. Hashmi also set up a controversial Islamic education network known as   which gained notoriety when it was revealed that former students included Tashfeen Malik, one half of the couple that killed 14 people in San Bernardino, Calif. in 2015. Ms. Hashmi’s success helped spawn a string of religious businesses by people inspired by her, encompassing everything from educational institutions to burqa boutiques. But in recent years, a new generation of women  —   like her former student Huma Najmul Hassan, whose   Institute is a popular fixture on Karachi’s religious circuit  —   has helped take things to a new level. The number of women attending their classes is inspiring the growth of even more   businesses for women. The commercial boom can be seen on the street across from the Baitussalam Mosque in the upmarket Defence area, which has turned into a veritable religious shopping strip. Islamic bookstores selling titles like “300 Questions for Husbands and Wives” are sandwiched between boutiques stocking $35 abayas with embossed palm tree borders, and banks offering   services. At Habitt, a home décor store in the Dolmen Mall on Karachi’s seafront, $4 sandalwood prayer beads are displayed against an invocation to prayer in stylized English script. Online, there are artisanal Islamic brands like Little Ummati, which sells customized $20 prayer mats. Mahjabeen Umar, a Pakistani graphic designer who lives in Sharjah, United Arab Emirates, said Little Ummati had been born out of her desire to make religious practices appealing for her children. Since other products and books for children are colorful and well made, she asked, “why should an Islamic product not be well designed?” There has also been a boom in services. One woman runs a “ ” aerobics class out of a residence in the Defence neighborhood. On a recent Friday afternoon, a dozen teenage girls in skinny jeans took notes as a woman demonstrated how to make skin cream at a Muslim youth club meeting. In January, a group associated with the Baitussalam Mosque organized a workshop on halal food. Over a hundred   women gathered to hear about Muhammad’s favorite foods and the risks of diets. In Karachi’s affluent neighborhoods, women meet at Quran classes and at private talks by female preachers, in residences and institutes watched over by guards. They gather for religious conferences in   hotels. Institutes offer a range of Islamic courses in English and Urdu: on understanding the Quran, Arabic pronunciations and Islamic practices through presentations like “My WhatsApp to Allah. ” Islamic events  —   from prayer meetings to conferences  —   have long been a mainstay of life in Pakistan. Islam is constitutionally and culturally enshrined here and taught at school Muslims make up 96 percent of the population. But Islam has historically been perceived as the domain of the poor, and mainstream   groups that constitute clerics’ and conservatives’ support consider themselves authorities on faith, and promise to make Pakistan a    state. In recent years, however, the country’s elite have tried to seize that mantle, convinced that they are better placed as the guardians of Islam because of their education, experiences and resources. That view is echoed by Humaira Iqbal, a doctor who is a former student of the female lecturer Safiya Khan. “Our elite didn’t have any religion, and so religion was literally preserved by the clerics,” she said. “They led funerals and prayers, and taught kids to read the Quran. But unfortunately, because they were illiterate, they could not understand Islam like an educated person. ” Dr. Iqbal, 34, runs a workshop called Lustre that teaches women to embrace their sexuality within marriage using Islamic dictates and anecdotes from religious teachings. “The concept of this workshop is that people realize that as far as religion is concerned, it is really, really encouraged,” she said, referring to sex, albeit in heterosexual and marital relationships. She laughingly described herself as a “hijabi pervert,” referring to the Islamic headdress worn by women outside the home. She said she had become a guru of sorts to people with questions about sex, Islam and marriage  —   like whether anal sex is acceptable. (It isn’t, she said.) Much of the discussion at women’s lectures revolves around relationships, families and the demands of urban life. Women from affluent communities who discover Islam anew and opt to wear the hijab or adopt religious practices risk social ostracism and criticism  —   particularly from their families, friends and husbands  —   who are often aghast at a loved one’s transformation into a   devout person who will not attend parties that feature singing and dancing. Many of these women say Islam has given them a sense of purpose and direction that had been missing from their lives. Kulsoom Umar, who studied at the London School of Economics and consulted on development projects in Pakistan, lectures at  . She walked into her first Quran class in a sheer shirt, and now wears a cloak and covers her face and hair. “I was always a fiercely independent person, but the thing that Islam and God gave me was emancipation,” she said. This conservative  —   and independent  —   strain of elite women does not necessarily fit a stereotype of submissive religious women. “The ‘empowerment’ that so many   women speak about doesn’t make much sense from a liberal feminist perspective, especially to those who can’t come to terms with these women’s full    covering,” said Faiza Mushtaq, a sociologist at Karachi’s Institute of Business Administration who wrote her doctoral dissertation on  . “Yet in many ways,   has given these women access to new forms of community and new positions of authority,” she said, like studying the Quran collectively without the need for men and becoming leaders and organizers.'"}, "time": 1742628487.5020769}