{"duration": 0.06441664695739746, "input_args": {"text": "'President Trump warned former FBI Director James Comey Friday morning, after accounts surfaced in the press about a dinner they had in January, attributed to Comey associates. [“James Comey better hope that there are no ‘tapes of our conversations before he starts leaking to the press!” Trump tweeted.  James Comey better hope that there are no ”tapes” of our conversations before he starts leaking to the press!  —   Donald J. Trump (@realDonaldTrump) May 12, 2017,  Trump fired Comey on Wednesday, setting off a slew of speculation and leaks over why the former FBI director  —   who had been disliked on both sides of the aisle  —   was fired. On Thursday, the New York Times published an account of a dinner, sourced to two Comey associates, that differed from the president’s account. It’s not clear yet whether Trump has any recordings of the conversation that took place. Trump told NBC’s Lester Holt on Thursday Comey had requested the dinner on January 27, because the wanted to stay on as FBI director. He said at that dinner, Comey told him he was not under investigation. But according to Comey’s associates, Trump requested the dinner, and pressed him to pledge his loyalty. “Mr. Comey declined to make that pledge. Instead, Mr. Comey has recounted to others, he told Mr. Trump that he would always be honest with him, but that he was not ‘reliable’ in the conventional political sense. ” Comey’s people added that Comey was wary about dining with the president, but believed he couldn’t turn him down. The White House disputed the account. “We don’t believe this to be an accurate account,” said Sarah Huckabee Sanders, the deputy press secretary. “The integrity of our law enforcement agencies and their leadership is of the utmost importance to President Trump. He would never even suggest the expectation of personal loyalty, only loyalty to our country and its great people. ” According to the White House, one of the many reasons Comey was fired was because he failed to stop sensitive leaks of information to the media.'"}, "time": 1742562206.9605138}