{"duration": 0.06441760063171387, "input_args": {"text": "'Keywords: medical equipment , Stethoscope facts , stethoscopes history \\nWhen we hear the word “Doctor,” the first image comes in our mind is a person in a white coat with a stethoscope hanging around his neck. The stethoscope has become a very common name amongst people thanks to its display in various T.V shows, movies and frequent use of it by doctors. But still, there are many fun facts which other people might not know about stethoscope. So here they are – \\n200 years old history – Yes! Stethoscopes are one of the oldest inventions which are still being used across the world by millions of doctors. Rene Laennec in 1819 had invented the stethoscope. It was a wooden instrument and looked quite different from what we see it as now. \\nI see your chest – Stethoscope is a Greek word which roughly translates into “I see the chest,” stethos means chest and scope mean examination. \\nAn Interesting story behind its Invention – When Stethoscope was not invented, doctors would put their ears around the chest of patients and gently tap the chest with fingers. This technique would make female patients little uncomfortable. Rene Laennec was a very shy person. Once he was examining an overweight woman. He found it difficult to hear her hear sounds. To hear heartbeats of that lady, he rolled a quire paper into a tube and placed it on her chest. This inspired him to make the device which we all are familiar with and called stethoscope. \\nGoogle Doodle For Rene Laennec – On February 17th, 2016, Rene Laennec would have celebrated his 235th birthday. To commemorate this day, Google doodle marked his 235th birthday. \\nUsed To Identify If A Person Is Dead Or Not \\nNowadays stethoscope is used to hear heart sounds and to determine symbols of other diseases. But initially, stethoscope was designed to find out if the person in the hospital is dead or alive. \\nIt Might Be Replaced Very Soon \\nAs mentioned, stethoscopes were invented almost 200 years ago and being in use for such a long time shows that how useful and efficient stethoscopes are. However, as the technology is getting advanced every passing day, stethoscopes might be replaced very soon by pocket-sized ultrasonic devices which can perform multiple measurements on patients. \\nSource –'"}, "time": 1742561729.3118396}