{"duration": 0.04143977165222168, "input_args": {"text": "'\\nThis article was written by Tyler Durden and originally published at Zero Hedge . \\nEditor’s Comment: President Obama poured on the spigot of debt for eight years, at a faster rate than all his predecessors, with the cup running over. \\nThis massive pile of debt was accumulated at zero percent interest rates, but that certainly isn’t where rates will stay. \\nFailed policies and a very harsh turning of the screw against the population has made raising interest rates at the Federal Reserve inevitable… for a couple of years now, Janet Yellen has been merely waiting for the right time, which many have speculated was waiting on the results of the election. \\nNow, the enormous cost of the national debt will be further inflated by the steeper price at which it must be repaid, despite the fact that the money was lent by the very central bank institution that is supposed to serve this country. Misunderstanding the relationship has only made things more difficult, and hopelessly uphill.. \\nNassim ‘Black Swan’ Taleb Sums Up Obama’s Legacy In 3 Painfully “Real” Tweets \\nby Tyler Durden\\nHaving previously exposed the “intellectual-yet-idiot” class , Nassim Taleb unleashes his acerbic tone in 3 painfully “real news” tweets on President Obama’s legacy…\\nObama:\\nProtected banksters (largest bonus pool in 2010)\\n“Helped” Libya\\nServed AlQaeda/SaudiBarbaria(Syria & Yemen) https://t.co/bcNMhDgmuo \\n— NassimNicholasTaleb (@nntaleb) November 19, 2016 \\n\\n2) (Cont) But in the end what Obama did that is unforgivable is increasing centralization in a complex system.\\n— NassimNicholasTaleb (@nntaleb) November 19, 2016 \\n\\n3) Don’t fughet Obama is leaving us a Ponzi scheme, added ~8 trillions in debt with rates at 0. If they rise, costs of deficit explode…\\n— NassimNicholasTaleb (@nntaleb) November 20, 2016 \\n\\nHow long before Taleb is banned from Twitter for such ‘hate-speak’?\\nThis article was written by Tyler Durden and originally published at Zero Hedge . '"}, "time": 1742563538.8583484}