{"duration": 0.057625770568847656, "input_args": {"text": "'Email \\n\\nFormer President Bill Clinton can be heard telling his former mistress, Gennifer Flowers, to deny that he helped her get a state job in a series of recorded phone conversation from 1991. \\n“If they ever asked if you’d talked to me about it, you can say no,” Clinton is heard saying in the recording. \\nAt the time, the media was making inquiries about Flowers’ alleged affair with Clinton, and she was concerned that they may question how she got a job as administrative assistant for the Arkansas Appeal Tribunal. \\nClinton can also be heard telling Flowers how to handle a grievance filed by soemone else who applied for the same positioned and claimed she was more qualified than Flowers. \\nFlowers famously recorded a series of conversation she had with Clinton from December 1990 to December 1991, while he was still Governor of Arkansas. The audio segments about the state job were widely reported in the 1990’s, however, as other pay-for-play financial scandals have surfaced, the details may warrant revisiting. \\n\\nHere is a transcript of part of the recording: \\nGF – But anyway, then Wednesday, there was a grievance filed in my office when I got the job by a girl who felt like she should have gotten it, a black girl named (deleted). And they called me as a witness. So I go in and uh, nothing big came of it. It’s just that they were questioning me about how I found out about the job. And I said, “Well, that personnel said it that it was a possibility there would be a position,” and then uh, “they told me that it would be advertised in the newspaper. And it was and I pursued it from there. \\nBC – Good for you. \\nGF: Yeah. We had a little bit of a scare recently because she had a spot on an X-ray. And she went and had it checked again and it wasn’t cancer. And it’s been almost, it’ll be two years in May that she’s now diagnosed cancer free. My stepfather has been through two angioplasties, but he’s doing good. And I am, I’m really, Bill what I’m afraid of is that if somebody in the press finds out that I’m working for the state. \\nBC – Yeah. \\nGF – They’re going to make a big deal of it. \\nBC – Yeah. \\nGF – Well the only thing that concerns me, where I’m, where I’m concerned at this point is the state job. \\nBC – Yeah. I never thought about that, but as long as you say you’ve just been looking for one, you’d uh, check on it. If they ever asked if you’d talked to me about it, you can say no.'"}, "time": 1742561678.9196756}