{"duration": 0.04393911361694336, "input_args": {"text": "'Charles Goyette https://www.lewrockwell.com/%3Fpost_type%3Dlrc-blog%26p%3D610232 \\nMuch of the news here in Arizona is about Obamacare. And it is big news. The Drudge Report today features a Wall Street Journal story, Inside the Affordable Care Act’s Arizona Meltdown , that explains: When Affordable Care Act insurance marketplaces launched in fall 2013, Arizona seemed like a success. Eight insurers competed to sign up consumers, offering a wide variety of plans and some of the lowest premiums in the country. Today, with ACA enrollment starting Nov. 1, Arizonans will find in most counties only one insurer selling exchange plans for 2017. Premiums for some plans will be more than double this year, some of the biggest increases in the nation. \\nSix major health insurers are leaving the Arizona market altogether in the new year. \\nThe Arizona Republic story on the fiasco today quotes a Phoenix resident, Ken Hoag, who understands what’s going on. “There are no choices, really, for anybody in Maricopa County,” Hoag said. “The lack of choice is like having empty shelves (and) no food in a third world country.” \\n“Do I live in Cuba?” he asked. \\nIt’s too bad this had to happen, but fortunately there is an upside. You see, during the debate on Obamacare, the Republicans warned that this was inevitable in a State-run, Soviet-style health care system. They warned of deteriorating service, fewer options, and higher prices. Instead, they extolled the virtues of a free market in health care, one free of government that would constantly improve service, increase options, and lower prices. Just like it does with government-free elective medical procedures like vision correction and cosmetic surgeries. \\nNow they are able to say, “We tried to warn you,” and their clarity being rewarded, we can hurry past this destructive socialist detour and restore a free-market in health care. \\nOh. \\nWait a minute. \\nThat’s not what Republicans did during the national debate on Obamacare. With the legislation before Congress in 2010, the Republicans were reduced to accepting the statist presuppositions of government interventionism. Instead of standing firm, they wobbled about on their spindly little legs, as the Republican National Committee ran TV ads calling for a “responsible plan” and a “bipartisan plan.” With only the occasional exception like Ron Paul, Republicans were incapable of articulating an argument against accelerating American healthcare’s Soviet-style trajectory. \\nAnd one more thing. There was also Chief Justice John Roberts, the “conservative” whose lawyerly casuistry tipped the balance in favor of Obamacare at the Supreme Court. In voting to uphold Obamacare, Justice Ruth Ginsburg thought to remind us, as well, of Mitt Romney’s role in fathering this hideous creature. \\nSo how do you like living in Cuba? 10:49 am on November 1, 2016'"}, "time": 1742561781.3602204}