{"duration": 0.09472179412841797, "input_args": {"text": "'Other Writers “Racist, misogynist bully.” \\n“For Jews, these are worrying times . . . History shows that when bullies take charge, they turn on the Jews.” — The JC Leader, Trump Triumphant. So what now? \\nIt is not an accusation, merely a statement of fact, to describe Donald Trump as a racist, misogynist bully. That such a man can be elected as President of the United States is deeply chilling. \\nFor Jews, there is one specific aspect of his ascendency that is so worrying. His campaign was self-consciously antisemitic. \\nOne of his main themes was that a global elite was conspiring against ordinary Americans. This is not only a classic antisemitic meme; the examples cited by Mr Trump were all – every one of them – Jewish, such as George Soros and the President of the Federal Reserve. Anyone who denies this element to Mr Trump’s campaign is living in a self-deluded fantasy. \\nFantasy may be an apposite word. Perhaps the past few decades, when the US preserved a global order that destroyed prejudice rather than cementing it, was merely a short-lived fantasy. \\nWith our history, that is a desperate prospect. \\nMany of us have always looked to the US as a beacon of freedom. When the Third Reich looked unstoppable and Britain stood alone, it was the US that then sacrificed so many of its sons to defeat the Nazis. \\nIn the Cold War it was the US, through Nato, that ensured the Soviet Union was held in check. \\nAnd in recent years Nato has helped preserve the long-delayed freedom of Eastern Europe from the Warsaw Pact. \\nAll that is now threatened. \\nMr Trump cites Vladimir Putin as a role model and believes Nato no longer has a purpose. \\nThe message is clear: far from standing up to an aggressive tyrant, he will willingly acquiesce in that aggression. \\nFor Jews, these are worrying times. \\nWe have already been scapegoated by Mr Trump, so it is no supposition to suggest that worse may be to come. \\nHistory shows that when bullies take charge, they turn on the Jews.   One thought on “ Oi veh! — New Hitler gets elected ” Sardonicus says: November 12, 2016 at 4:44 pm \\nYes, very sad. I am still drying my tears. That Americans should elect such a monster makes me want to renounce my citizenship and emigrate to Israel. \\nOnly trouble is, they don’t want me. My race as a non-Jewish White person is unacceptable to them. I was actually told by a nice Jew at Ben-Gurion airport: “We don’t like White people and are doing our best to genocide them. That’s why we’re flooding your White homelands with millions of Third Word migrants.” \\nYes, it’s a sad situation.'"}, "time": 1742562754.5891228}