{"duration": 0.1309819221496582, "input_args": {"text": "'Alexandre Douguine \\n« Le Marais » c’est le nouveau nom de la secte globaliste, des adeptes de la société ouverte, des pervers LGBT, de l\\'armée de Soros, des post-humanistes et ainsi de suite. Il est absolument impératif de dessécher le Marais non seulement pour les États-Unis: c’est un défi global pour nous tous. A nos jours, chaque peuple est prisonnier de son propre Marais. Nous, tous ensemble, devons commencer la lutte contre le Marais russe, le Marais français, le Marais allemand etc. Nous avons besoin de purger nos sociétés de l\\'influence du Marais. Au lieu de nous battre entre nous, desséchons-le ensemble. Assécheurs de Marais du monde entier, unissez-vous ! \\nL\\'autre point c’est que l\\'anti-américanisme est fini. Non pas parce que c\\'était faux, mais exactement le contraire : parce que le peuple américain lui-même a commencé la révolution justement contre ce côté des États-Unis que nous avons tous haï. Maintenant l\\'élite dirigeante européenne, ainsi qu\\'une partie de l\\'élite russe (qui est encore libérale), ne peuvent pas être blâmées comme avant pour être trop pro-américaines. Ils doivent désormais être blâmées pour être ce qu\\'ils sont : une bande corrompue, pervertie, avare de banksters et destructeurs des cultures, des traditions et des identités. Alors, laissez-nous égoutter le Marais européen. Assez avec Hollande, Merkel et Bruxelles ! L’Europe pour les européens. Soros et sa secte doivent être publiquement condamnés ! \\nDorénavant, le Marais est un phénomène extraterritorial, exactement comme un réseau terroriste international. Le Marais est partout et nulle part. Hier, le centre du Marais, son noyau, était situé aux États-Unis, mais plus maintenant. C\\'est une chance pour nous tous de commencer à les chasser. Le Marais ne se manifeste plus sous une forme fixée au niveau régional. Néanmoins, il existe et a toujours une puissance extrêmement grande. Mais son caractère antinational est maintenant explicitement évident. Le Marais ne peut plus se cacher derrière l\\'Amérique. Il est parti en exil. Mais où ? Au Canada ? En Europe ? En Ukraine ? Pour d\\'autres planètes où divers acteurs et actrices dopés promettaient d\\'émigrer dans le cas de la victoire de Trump ? Maintenant, il est temps pour eux de tenir leur promesse. Tout cela semble être l\\'ascension des globalistes. Ils sont maintenant absorbés dans un non-lieu, une utopie, dans la terre de l\\'utopie libérale - un « no man\\'s land ». Nous sommes maintenant témoins de la déterritorialisation du Marais, de l\\'élite mondialiste et du gouvernement mondial. \\nQuelle est la structure du Marais ? \\nPremièrement, le Marais est une idéologie - le libéralisme. Nous avons besoin d\\'un procès de Nuremberg pour le libéralisme, la dernière idéologie politique totalitaire de la Modernité. Fermons cette page d\\'histoire. \\nDeuxièmement, le Marais est une culture spéciale postmoderniste. Elle est basée sur la décomposition de toute entité par digitalisation, schizomorphisme obligatoire, et ainsi de suite. Le drainer signifie de rétablir l\\'unité de l\\'art apollinien. L\\'art doit revenir au holisme. \\nTroisièmement, c’est le capitalisme mondial transnational. Ceci est le moteur matériel du Marais. C’est des emprunts et la Réserve fédérale qui imprime des billets verts virulents. Nous devons mettre fin à tout cela et revenir au secteur productif réel et à l’approche mercantiliste. \\nJe propose de redécouvrir les idées de Pitirim Sorokin. Il a noté que la dynamique sociale de l\\'histoire est une chaîne de paradigmes sociaux qu\\'il appelait idéationnelle, idéaliste, et sensualiste. L\\'idéation est la domination absolue de l\\'esprit sur la matière, l\\'ascétisme et la soumission vigoureuse du monde matériel à l\\'aspiration spirituelle et religieuse. Le type idéaliste est équilibré et fondé sur la coexistence harmonieuse de l\\'esprit et de la matière, où la partie spirituelle est légèrement dominante, mais non exclusive (comme dans le type idéationnel). Le type sensualiste de la société est la domination de la matière sur l\\'esprit, le corps sur l\\'âme. Le Marais est le type sensualiste de la société. Jusqu\\'à récemment, il semblait que « sensualiste » et « américain » étaient synonymes. Mais après le triomphe de Trump, tout est différent. Maintenant sensualiste signifie global et excentrique. Il y a une sorte de \"translatio imperii\" nulle part et partout. \\nSorokin a souligné que la nature cyclique de la société suit l’unique chaîne de succession : de l\\'idéationnel à l\\'idéaliste, puis sensualiste. L\\'idéaliste ne peut pas succéder au sensualiste, comme il est impossible pour le Marais de se retransformer en semi-Marais. Après le Marais vient le Soleil, c\\'est-à-dire le Feu, l\\'Esprit - l\\'Esprit dans sa forme radicale et idéationnelle. Pour dessécher le Marais, nous avons besoin du Feu Solaire, un Grand Feu qui devrait être en abondance. \\nLe Marais et le Feu sont deux éléments opposés répartis à travers la terre. La géopolitique devient alors verticale. Les deux peuvent être trouvés à tout endroit. Le sens du lieu maintenant est l\\'élan du processus de drainage du Marais. Où ? Ici et maintenant. \\nLe Marais n\\'est plus l\\'hégémonie américaine car le Président de l\\'Amérique lui-même rejette une telle hégémonie. C\\'est donc l\\'hégémonie « tout court », l\\'hégémonie comme telle avec un vide purement postmoderniste au centre. \\nLes Etats-Unis sont l\\'Extrême Occident du monde. C\\'est l\\'espace de Minuit. Et là, le dernier point de la Chute est atteint. Le moment qui se déroule est celui du changement de pôles. L\\'Occident se transforme en Orient. Poutine et Trump sont dans les deux coins opposés de la planète. Au XXème siècle, ces deux extrêmes étaient incarnés par les formes les plus radicales de la Modernité - le capitalisme et le communisme - deux monstres apocalyptiques - le Léviathan et l’Hippopotame. Maintenant, ils se sont transformés en deux promesses eschatologiques : la Grande Russie de Poutine et l\\'Amérique qui se libére sous Trump. Le XXIème siècle a enfin commencé. \\nDonc tout ce dont nous avons besoin maintenant, c\\'est le Feu. \\n'"}, "time": 1742563700.9984474}