{"duration": 0.015946149826049805, "input_args": {"text": "'Millions of Lives Endangered by 55,000 Gallon Pipeline Spill report this ad \\nA pipeline owned by the same company behind the Dakota Access Pipeline has endangered the lives of six million people by leaking 55,000 gallons of gasoline into a major river in Pennsylvania. report this ad \\n\\nAfter heavy rainfall, the pipeline, owned by Sunoco Logistics, burst on Thursday, October 20th. The spill leaked 55,000 gallons of gas into Wallis Run, a tributary of the Loyalsock Creek that drains into the Susquehanna River. Once the leak was detected, the pipeline was shut down but as stormy weather continued, the actual break in the pipeline remained unidentified for almost a week. After the spill, Pennsylvania water authorities warned customers to refrain from using water from the river. More than half of Lancaster City’s water comes from this river. Although officials are now declaring the water safe to drink, residents affected by the leak are wary. \\n\\nPreviously, the Susquehanna was declared the third most endangered river in the U.S. by the NGO American Rivers. The river has come under threat because of development of the natural gas industry, particularly fracking. Fracking has endangered many U.S. rivers because of the “Cheney’s loophole” which exempts natural gas companies from the vast majority of U.S. environmental regulations. American Rivers believes that fracking poses one of the greatest dangers to U.S. rivers and could have a detrimental effect on our country’s clean drinking water. report this ad \\n\\nThough the spill has been blamed on recent floods, many are bringing into question Sunoco’s extensive history of poor pipeline management. Pipelines managed by Sunoco Logistics spill far more frequently than others, with more than 200 recorded leaks since 2010. In 2008, an improperly installed valve “blew out” a pipeline in Murrysville, Pennsylvania. The Department of Environmental Protection stated that the area affected by the spill may never completely recover. \\n\\nSunoco is also a subsidary of Energy Transfer Partners Limited. This is the company that owns the controversial Dakota Access pipeline . This access pipeline has become a major protest site due to the controversial placement of the pipeline right by the Standing Rock Sioux Tribe’s water supply and sacred sites. \\n\\nWhile Hillary Clinton and Donald Trump are major advocated for fracking and pipeline construction, the public is standing up to this construction because of the major environmental and social damage it could have. \\n\\nThis recent spill is just another example of the many things that can go wrong when pipelines are built so close to water supplies and communities. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She graduated The Evergreen State College with an undergraduate degree focusing on Sustainable Design and Environmental Science. Follow her adventures on Instagram.'"}, "time": 1742628547.2455034}