{"duration": 0.08580350875854492, "input_args": {"text": "'Sen. Joe Manchin  —   who has claimed in the past to be    —   appears now to be supporting abortion industry giant Planned Parenthood. [Thank you for standing with Planned Parenthood, @Sen_JoeManchin! #StandWithPP pic. twitter.   —   PP South Atlantic WV (@PPSATWV) April 19, 2017,   The West Virginia Democrat appeared in a photo, tweeted by Planned Parenthood South Atlantic West Virginia, standing behind a poster that states, “I stand with Planned Parenthood. ” The tweet immediately drew the ire of national   leaders who in the past have counted Manchin among members of Congress who support the rights of the unborn. “Sen. Manchin used to call himself   but this is the last straw,” said Susan B. Anthony List President Marjorie Dannenfelser, adding that her organization “will work tirelessly in the months ahead to make sure West Virginians know of this profound betrayal of the unborn and their mothers. ” The national director of Priests for Life, Father Frank Pavone, also reacted, telling Breitbart News: “Would that Sen. Manchin spoke plainly about what ‘standing by Planned Parenthood’ means! Instead of following the bad example of his Democratic colleagues, who want to support abortion without talking about abortion, Sen. Manchin should stay on the   path and tell his constituents what Planned Parenthood actually does and doesn’t do. ” Pavone added that his organization’s StopAbortionNow. org campaign would inform West Virginians of Manchin’s change in position. “West Virginians supported President Trump last November and will face a choice next year as to whether to   Sen. Manchin,” Pavone continued. “We have already communicated through Priests for Life to all the churches of West Virginia that Planned Parenthood needs to be defunded and that they need to let Sen. Manchin know where they stand on this before they make their voting decisions in the midterm elections. ” As a candidate for the presidency, Republican Donald Trump outlined four policy commitments in a letter to   leaders: As the Charleston   reported, Manchin has raised about $235, 000 for his 2018   campaign in the first quarter of the year, but only $7, 900 is derived from sources within his home state. “Sen. Joe Manchin,  . Va. has received more money from individual donors in Texas ($95, 600) Washington D. C. ($33, 000) New York ($32, 300) Massachusetts ($22, 500) Virginia ($19, 700) Maryland ($10, 700) and Connecticut ($10, 400) than West Virginia,” states the report. Dannenfelser observed that Planned Parenthood is “the nation’s largest abortion business. ” “It is an enormous mistake both morally and politically for Sen. Manchin to side with Planned Parenthood,” she added, continuing, “In more than nine times out of ten, Planned Parenthood resolves pregnancy with abortion. They are clearly an     business  —   yet taxpayers are forced to fork over nearly $554 million each year to their coffers. Where does Sen. Manchin stand on this injustice? Last month, he voted to force states to fund the abortion giant through Title X grants. That was only a day after new footage was released showing a former Planned Parenthood abortionist describe the force needed to dismember a    unborn child struggling to survive in the womb. ” Planned Parenthood performs at least 300, 000 abortions every year. The group has been using political muscle to bolster its image in the wake of videos released that led to allegations it sells the body parts of aborted babies for a profit. The allegations led to multiple congressional investigations. Ultimately, the Senate Judiciary Committee and the House Select Investigative Panel have referred Planned Parenthood Federation of America, several of the largest Planned Parenthood affiliates in the country, and three of their business associates in the fetal tissue procurement industry, to the FBI and U. S. Department of Justice for criminal prosecution. “The Democratic Party is, no doubt, putting pressure here on a senator who has in many instances been an exception to the rule and has taken   positions,” Pavone said. “I urge him to resist this pressure, to be honest with himself and his constituents,” he added, “and to let the people of West Virginia know the facts about Planned Parenthood so that they, in turn, can let him know whether they think he should support this criminal,   enterprise, which is more a political machine than a health organization. ” A recent Marist poll found that 61 percent of Americans oppose taxpayer funding of abortion, including 40 percent of those who say they are “ ” and 41 percent of Democrats.'"}, "time": 1742561767.8432226}