{"duration": 0.07327651977539062, "input_args": {"text": "'The president of the American Pastors Network said that many U. S. citizens are in denial over the true nature of Islam by refusing to acknowledge its inherent ties to violent jihad. [Responding to a recent CBS poll that found that the majority of Democrats believe that Islam is no more violent than Christianity, Sam Rohrer said that many Americans are confused about the Muslim faith and the teachings of the Qur’an.  “The view for a long time has been that jihadists, wherever they are, are not at all reflective of Islam, and these are only a small number, who don’t speak for Islam,” Rohrer said in an interview with the Christian Post. “The unfortunate thing about that is that those involved in jihad are the only ones who are really practicing what the Qur’an says,” he said. Last week’s CBS poll found that only 33 percent of respondents believe that the Muslim religion encourages violence more so than other religions, a view that Rohrer described as a “purposeful denial of facts. ” Those who do not recognize that Islam is more prone to terrorism and violence either haven’t “done their homework,” or are ignoring the truth, he said. Rohrer argued that public opinion on Islam is tied to a religious relativism that assumes that “all people worship the same God, or there is no God, or all gods are equal. ” It is a “great mistake” to believe that Islam is first and foremost a religion, like Christianity or Judaism, he suggested. “That is totally wrong, because Islam is primarily a political, legal system. It has religious tenets, but it is a political system accompanied by Sharia law,” he said. “By its very commandments,” he said, Sharia prohibits Islam from peacefully coexisting with others. Rohrer’s remarks echoed statements from the Islamic State terror group itself, which has publicly rejected claims that its war on the   West is not religiously motivated. In an issue of its online propaganda magazine, Dabiq, ISIS criticized Pope Francis last summer for his naïveté in clinging to the conviction that Muslims want peace and that acts of Islamic terror are economically rather than religiously motivated. “This is a   war between the Muslim nation and the nations of disbelief,” the authors stated in an article titled “By the Sword. ” The Islamic State attacked Francis for claiming that “authentic Islam and the proper reading of the Quran are opposed to every form of violence. ” Pope Francis “has struggled against reality” in his efforts to portray Islam as a religion of peace, the article insists, before going on to urge all Muslims to take up the sword of jihad, the “greatest obligation” of a true Muslim. Last spring, noted Georgetown University scholar Father James V. Schall SJ published an essay arguing that Islam has consistently advocated violence “from its seventh century beginning,” and that the purpose of violent jihad is “ultimately, religious and pious. ” In his article, Schall contended that Islam has been “violent throughout its entire history,” and that the motivation for its violence “is obedience to the Law of Allah. ” “What we see now is little different from what has been seen throughout the centuries wherever Islam is found,” he wrote. Many Westerners mistakenly assume that Islam is not violent, because all religions should be peaceful by their nature, Schall stated. Yet just because Islam is a “religion,” he argued, does not mean that it is therefore not “violent. ” Schall said that “while it may be politically incorrect to state these things, they need to be stated and are in fact the truth. ” “The designated and determined goal of the conquest of the world for Allah has been reinvigorated again and again in world history from the time of Mohammed in the seventh century,” he wrote. “These revivals and expansions, which have only been temporarily halted by superior counterforce, have roots in the Qur’an itself and in its commentaries,” he said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742561834.1897538}