{"duration": 0.22387981414794922, "input_args": {"text": "'Alex Jones leaked the audio of a phone conversation Thursday night revealing Megyn Kelly promising him a fair,  “gotcha” interview as she invited him to appear on her new NBC News program. [“I don’t double cross,” Kelly tells Jones, repeatedly assuring him that her interview would not dwell on “conspiracy theories” or familiar   attacks against the independent broadcast host. Rather, Kelly says that the focus of the news profile would be to humanize Jones and explore his personal life.   Jones himself appears in the video, revealing the private phone conversation on his website InfoWars in advance of Kelly’s Sunday broadcast. He annotates the audio clips with his own commentary, NBC’s preview snippet of the   interview, and news clips about the ensuing uproar  —   where a besieged Kelly has denounced Jones’ coverage of the 2012 Sandy Hook mass shooting as “revolting. ” The video puts Kelly in a precarious position. As her fledgling weekend news magazine show fights for viability,   agitators have attacked her for interviewing Jones. A boycott sprang up before the broadcast ever aired, pressuring sponsors and reportedly convincing major brands to pull their . In response, she gave a statement contradicting nearly everything she promised in this phone call. “The very question that prompted this interview,” she claimed, is: “How does Jones, who traffics in these outrageous conspiracy theories, have the respect of the president of the United States and a growing audience of millions?” However, Jones has revealed, her pitch was the exact opposite: “I promise you that’s not what this will be [a hit piece],” she says. “It really will be about, who is this guy?” Later on, she expresses her hope that some liberal viewers would come out of the segment saying, “I see the guy who loves those kids and who is more complex than I’ve been led to believe. ” So, which statement is true? That conclusion is not as easy as one would assume. Kelly now finds herself in the unenviable position of appeasing corporate sponsors spooked by   outrage while also trying to establish herself as a trustworthy interviewer. bShe has nothing to lose if Alex Jones feels betrayed and never talks to her again, but she does express fear during their conversation that if he calls her out for a “hit piece,” she will have trouble getting any more controversial,   subjects to appear on her show. And, based on the preview clips, Kelly will have to square that broken promise with this fervent declaration about her character: She has nothing to lose if Alex Jones feels betrayed and never talks to her again, but she does express fear during their conversation that if he calls her out for a “hit piece,” she will have trouble getting any more controversial,   subjects to appear on her show. And, based on the preview clips, Kelly will have to square that broken promise with this fervent declaration about her character: All I can do is give you my word and tell you  —   if there’s one thing about me, I do what I say I’m gonna do. And I  —   I don’t double cross, so I promise you when it’s over you’ll say, “Absolutely. She did what she said she was gonna do. ” Jones states that he has only released “a few clips” of his full phone conversation with Kelly and that InfoWars taped the entire NBC interview “so that we can document   how she edited, how she manipulated. ” He concludes: “It shows the arrogance of Megyn Kelly that she didn’t think we’d record her to document what she really said and did. ” Read selected transcripts of the Alex   Kelly phone conversation below: KELLY: It’s sort of a good opportunity just for   storytelling. You know, it’s like  —   it’s not like the   interview, it’s like the   profiles of people. And at the top of my list was you. JONES: So it’s like an investigative report into “fake news”? KELLY: No. No, what we’re doing? JONES: Yeah. Come on. KELLY: No no no. Hell no. The reason you  —   I mean, I know you guys, you know, [inaudible]  —   The reason you are interesting to me is because I followed your custody case. And I think you had a very good point about the way the media was covering it and for some reason treated you and your family and what was going on as fair game when they never would have done that to, if you will, a mainstream media figure. And I saw a different side of you in that whole thing and I just  —   here, you know, you became very fascinating to me. I just sort of thought you were this maybe, you know,   guy  —   like, this is your thing  —   and the comments I heard from you during the course of that trial and your plea to the media to be respectful of you and your kids just reminded me that you’re just like anybody. You’re a dad, you go through the same things we go through, and I thought, “now, that would be an interesting story to tell. ”   …     JONES: Wouldn’t the argument be, then, in the show, ’cause I’ve seen that as a standard Democrat talking point  —   I’m not saying that’s what you’re doing  —   “Well, he asked for privacy in his family, but he didn’t do that for Sandy Hook and he didn’t do that for the pizzeria. ” KELLY: No, I mean, I can ask you about that, you know, but this is not gonna be a contentious, you know, sort of “gotcha” exchange. I  —   That’s not what this show is and that’s really not what I want to do. I want to do   profiles on people, just interesting people. So I can ask you that  —   “this is what the critics say”  —   but this isn’t gonna be a “ ! Let’s play a clip. ”   …     JONES: I don’t mind questions. What I don’t like is, did you know or did your producers do that you, where I said Hillary Clinton personally  —   and it was    so I could get the satire out. You guys, took it out of context, but  —   did personally kill kids by the Iraq war and Syria war or the Libya situation, and you guys cut the back off of that   —   it was in the same 30 seconds, where I said I’m not talking about the pizza place, I’m talking about in the Middle East. KELLY: No, this is completely unfamiliar to me. JONES: Remember you had James Alefantis on Fox News, you’re talking about fake news. KELLY: The guy from Comet Pizza? JONES: Yes, and then you played a clip of me saying Hillary personally kills children. KELLY: I, forgive me, Alex, but I don’t remember the clip. I remember him [pause] and, you know, the nature of that exchange, which I think is the only time I’ve ever said  —   um, [inaudible] anything. [In that Fox News segment, Kelly says to Alefantis: “And someone could have been killed inside of your restaurant for no good reason other than people like Alex Jones fanned a conspiracy theory that even the DC police say has no basis in fact. ”] JONES: Sure, sure, sure. I mean, all I’m saying is, I can send you the Right Wing Watch clip where first reported it, and they said, “Jones  ” you know, “said that Hillary killed all these kids but then said it in Syria and Libya. ” So, I mean I’m just telling you, that’s the kind of stuff that scares me, because I can stand for what I’ve said, and I can even say, yeah I probably shouldn’t [crosstalk] Sure, sure. KELLY: Listen, I’ll take a look at that. That’s very unfamiliar to me. All I can tell you is that I bend over backwards to make sure that doesn’t happen.   …     KELLY: I’m sort of  —   you know, for lack of a better term, I’m trying to create a different kind of program. And it’s fine. You know, I’ll ask you about some of the controversies, of course. And you’ll say whatever you want to say. But it’s not going to be some gotcha hit piece, I promise you that. I  —   it doesn’t do me any good. If I do that to you, then you go out there and you say, “She did a hit piece on me. This is what she said, and this is what she did. ” And then the next time I want to get somebody, they’re gonna say, “Look what you did to Alex Jones,” you know. “Screw you. ” So I promise you that’s not what this will be. It really will be about, who is this guy? And we’ll talk about some of the controversy, and I’ll ask you, and you can respond, and we’ll get into the whole, you know, what you’ve been through this past year. And my goal is for your listeners and the left, you know, who will be watching some on NBC, to say, “Wow, that was really interesting. ” [Note: At this point, the audio quality of Kelly’s phone call abruptly changes  —   All I can do is give you my word and tell you  —   if there’s one thing about me, I do what I say I’m gonna do. And I  —   I don’t double cross, so I promise you when it’s over you’ll say, “Absolutely. She did what she said she was gonna do. ” And you’ll be fine with it. I’m not looking to portray you as some boogeyman or, you know, do any sort of a gotcha moment. I just want to talk about you. I want people to get to know you. And the craziest thing of all would be if some of the people who have this insane version of you in their heads walk away saying, “You know what? I see, like, the dad in him. I see the guy who loves those kids and who is more complex than I’ve been led to believe. ” JONES: Sure, but just so you know,  like, on all the Sandy Hook things, I’ve had debates where I’ve shown both sides where I go back and forth, but I believe people died there. And then they never show me really saying that, over the years, you know, you can look where the people that think nobody died are the ones all that hate me on the other side of it. And so what I’m saying is, people take clips out of context  —   and I know I’ve done a lot of stuff, some of which I’m not proud of. So if people want to do a real piece or something, I mean, obviously, I don’t want to sit here and, like, dodge all these interviews. Like, I told  —   they wanted me to tape something for Charlie Rose’s show, they wanted me to tape something for The View. I’m not saying, oh, I’m such a big, you know, famous guy, it’s just that  —   KELLY: No no, I understand. JONES: These taping things really just lends itself to be, you know, to ask yourself to be run over. But I understand, obviously, this is a magazine show, so it’s highly produced.   …     KELLY: It’s like a whole new world over there [at NBC]. They deeply care about this kind of thing [fact checking]. And it’s not that we didn’t care on cable, it’s just a different game on cable. You know, you move faster, and it’s more real time and, you know, that’s just the fact that more mistakes get made. But I will promise you to personally look at any clips we want to use of you and have a producer run by you whether we are taking it in context and what you are saying about  —   JONES: Well, I say some pretty wild stuff, and I’ll admit to a lot of it’s satire, but also, I’m not trying to be, I’m not being fake about what I’m saying.   …     JONES: So this is like a reboot, relaunch for you  —   that you’re not the, you know,   or   pundit from Fox. You’re an investigative journalist that does magazine, you know, investigations, or  —   KELLY: Exactly. So it’s like an entirely different set of muscles. And trust me when I tell you, my goal is not to go out there and be like, “Oh my god, if I sit with her, she’s gonna kill me!” Like  —   but of course I’m gonna do a fair interview. I’m still me! You know, I’m not gonna go out there and be Barbara Walters. You know. You just trust me. It’s  —   I will ask you about the controversies. I will ask you in a non  —   you know, I’ll be fair about it. I’ll give you the chance to respond. And I really just want to talk about you, you know. You.   …     KELLY: I have not enjoyed being, in any way, on the pointy end of the political spear, you know. It was never anything I wanted to do. And so it’s not  —   you know, I would say that I’m a combination of Mike Wallace, Oprah Winfrey, and Larry the Cable Guy. JONES: [Laughter] I know the Larry the Cable Guy. He’s a good guy. KELLY: I love him! And, so, like, that’s what you’ll get in the interview. [Laughter] That’s  —   that’s what you’ll get in the interview. [Laughter] Get, you know, a little bit of all three of those. And hopefully, everybody will walk away feeling like they had a good dinner. You know, nutritious, some red meat, with some dessert at the end.'"}, "time": 1742563872.1342194}