{"duration": 0.15221476554870605, "input_args": {"text": "'BEIJING  —   The finances of religious groups will come under greater scrutiny. Theology students who go overseas could be monitored more closely. And people who rent or provide space to illegal churches may face heavy fines. These are among the measures expected to be adopted when the Chinese government enacts regulations tightening its oversight of religion in the coming days, the latest move by President Xi Jinping to strengthen the Communist Party’s control over society and combat foreign influences it considers subversive. The rules, the first changes in more than a decade to regulations on religion, also include restrictions on religious schools and limits on access to foreign religious writings, including on the internet. They were expected to be adopted as early as Friday, at the end of a public comment period, though there was no immediate announcement by the government. Religion has blossomed in China despite the Communist Party’s efforts to control and sometimes suppress it, with hundreds of millions embracing the nation’s major faiths  —   Buddhism, Christianity, Islam and Taoism  —   over the past few decades. But many Chinese worship outside the government’s official churches, mosques and temples, in unauthorized congregations that the party worries could challenge its authority. A draft of the new regulations was published in September, several months after Mr. Xi convened a rare leadership conference on religious policy and urged the party to be on guard against foreign efforts to infiltrate China using religion. “It could mean that if you are not part of the government church, then you won’t exist anymore,” said Xiao Yunyang, one of 24 prominent pastors and lawyers who signed a public statement last month criticizing the regulations as vague and potentially harmful. The regulations follow the enactment of a law on nongovernmental organizations that increased financial scrutiny of civil society groups and restricted their contact with foreign organizations in a similar way, as well as an aggressive campaign to limit the visibility of churches by tearing down crosses in one eastern province where Christianity has a wide following. But the rules on religion also pledge to protect holy sites from commercialization, allow spiritual groups to engage in charitable work and make government oversight more transparent. That suggests Mr. Xi wants closer government supervision of religious life in China but is willing to accept its existence. “There’s been a recognition that religion can be of use, even in a socialist society,” said Thomas Dubois, a professor at the Australian National University in Canberra. “There is an attempt, yes, to carve out the boundaries, but to leave a particular protected space for religion. ” Although the governing Communist Party requires its 85 million members to be atheist, its leaders have lauded some aspects of religious life for instilling morality in the broader population and have issued directives ratcheting back the   attacks on religion that characterized the Mao era. Over the past decades this has permitted a striking religious renaissance in China, including a construction boom in temples, mosques and churches. Christianity is widely considered the   faith there are as many as 67 million adherents now, at least half of whom worship in unregistered churches that have proliferated across China, sometimes called underground or house churches. The new regulations are more explicit about the party’s longstanding requirement that all religious groups register with the government, and the most vocal opposition so far has come from Protestant leaders unwilling to do so. “These regulations effectively push house churches into taking on an illegal character,” said Yang Xingquan, a lawyer who is one of the signatories of the public statement. “This is very clear. ” Many Christians contend that   churches are tools of the state, as sermons are vetted to avoid contentious political and social issues and clergy are appointed by the party rather than congregants or, in the case of the Catholic Church, the Vatican. The new rules call for more stringent accounting practices at religious institutions, threaten “those who provide the conditions for illegal religious activities” with fines and confiscation of property, and require the many privately run seminaries in China to submit to state control. Other articles in the regulations restrict contact with religious institutions overseas, which could affect Chinese Catholics studying theology in the Philippines, Protestants attending seminaries in the United States, or Muslims learning at madrasas in Malaysia or Pakistan. Overseas churches and activists with ties to Chinese Christians have been scathing in their attacks on the new regulations. In its annual report on religious persecution released on Wednesday, China Aid, a group based in Texas, said they violated the Constitution, which guarantees freedom of religious belief. The regulations also say for the first time that religion must not harm national security, which could give security services in China greater authority to target spiritual groups with ties overseas. Chinese officials have already banned residents from attending some religious conferences in Hong Kong and increased oversight of mainland programs run by Hong Kong pastors, raising fears within the city’s vibrant Christian community. For traditional Chinese religions such as Buddhism and Taoism  —   which are practiced by 300 million to 400 million people and which the party views more favorably  —   the regulations appear intended to address a different problem: crass commercialization. Temples are often forced by local governments to charge entrance fees, which mostly go to the state and not the place of worship. About 600 people were recently detained at Mount Wutai, a Buddhist pilgrimage site in a northeastern city, for posing as monks to hustle money by fortunetelling, begging for alms and performing street shows, the state news media reported. The new regulations say spiritual sites should be “safeguarded” from tourism and development. The rules also require local governments to decide on applications to build houses of worship within 30 days and to explain denials in writing. Scholars caution that it is unclear how strictly the regulations will be enforced, noting that local officials have often tolerated and sometimes encouraged religious activity that is formally illegal, including house churches. “Past regulations have not harmed the growth of religion in China,” said James Tong, a   professor at the University of California, Los Angeles, who has written extensively about religious regulation in China, “and I don’t think these will, either. ”'"}, "time": 1742564433.709257}