{"duration": 0.05565786361694336, "input_args": {"text": "'Outsourcing firms, which supply major U. S. companies with thousands of foreign workers, are being   by the Trump White House. [During a White House briefing on the issue of the   visa, where some 650, 000 foreign workers are in the U. S. at any given moment, specifically mentioned three outsourcing firms that are working to replace Americans with foreign labor: Tata Consultancy Services, Infosys, and Cognizant.  “Just to illustrate a little bit more how the lottery works   —   so some companies oftentimes are called outsourcing firms,” the White House briefing statement reads. “You may know their names well, but like the top recipients of the   visa are companies like Tata, Infosys, Cognizant  —   they will apply for a very large number of visas, more than they get, by putting extra tickets in the lottery raffle, if you will, and then they’ll get the lion’s share of visas” the statement continues. “Which is very different than I think how most people think of the   program  —   they imagine it for more  —   being for  —   again, they would think of it as being for skilled domestic work, rather than contract work. ” “And those three companies are companies that have an average wage for H1B visas between $60, 000 and $65, 000,” the statement read. “By contrast, the median Silicon Valley software engineer’s wage is probably around $150, 000. ” The White House briefing went on to call out the abuses associated with the   visa program, where companies like MassMutual Insurance hires Cognizant to fire hundreds of their American employees to hire cheaper, foreign workers to do their jobs. “And you’ve seen some of these   examples where you have career employees at a company who have been working there for 10, 20 years, and then they get laid off and they hire a contracting firm using H1B workers at much less pay,” the statement said. “And again, this is an issue that labor unions have called attention to for a long time. ” The White House also mentioned that reforms of the   visa and other foreign guest worker visa programs must be accomplished through rulemaking, executive orders, and Congress. Attorney John Miano, who   the   exposé Sold Out with Michelle Malkin, told Breitbart Texas that the move by the Trump Administration is a step in the right direction, but said it was not the     to reform. “It’s a step in the right direction that they’re calling attention to problems in the program. You can’t criticize them for doing that,” Miano said. This year alone, Infosys, Tata Consulting Service, and Cognizant asked for a combined total of almost 44, 000   visas, something Miano says is a misuse of what the program was intended for. “One of the things is that we have this whole business of importing labor to fill jobs,” Miano told Breitbart Texas. “If this was supposed to be for jobs that Americans can’t fill, then this whole system of contract labor should not exist in  . A lot of companies are doing this. It’s becoming labor brokerage. ” While the Trump Administration issued an executive order demanding a legal review by the Department of Justice, the Department of Homeland Security and the Labor Department into abuses by   visa program, as Breitbart News reported, Miano says more must be done. “In reality, you have to tackle them by going through the regulations. They’re hundreds of pages long. It takes an army of lawyers,” Miano said. “The big problems in this program, the President doesn’t have the power to fix, a lot of this has to be done by Congress. ” John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742562945.638604}