{"duration": 0.07498359680175781, "input_args": {"text": "\"NTEB Ads Privacy Policy Naval Air Forces ‘Doomsday Plane’ Circled Over Denver For Hours, Spraying Chemtrails Over Metro Area The 'doomsday plane' aircraft – usually launched at the outbreak of a nuclear attack - was spotted circling by thousands of US citizens on the ground. The unbranded plane travelled across several states and changed directions numerous times, prompting a Twitter frenzy of conspiracy theories. by Geoffrey Grider November 19, 2016 A TOP-SECRET United States aircraft known as the ‘Doomsday Plane’ was spotted in the skies over America circling the Denver metro area \\nThe aircraft – usually launched at the outbreak of a nuclear attack – was spotted circling by thousands of US citizens on the ground. The unbranded plane travelled across several states and changed directions numerous times, prompting a Twitter frenzy of conspiracy theories . \\nThese were only intensified after a spokeswoman for the Naval Air Forces confirmed the plane was in fact their own E-6B Mercury, also known as the Doomsday Plane. Mysterious U.S.A.F ‘Doomsday Plane’ Circling Over Denver Metro Area: \\nNot only was the mysterious ‘Doomsday Plane’ circling over the Denver metro area for hours, it also seemed to be spraying chemtrails out the back as it circled. \\nLocal news outlet Denver7 tracked flight IRON99 as it traveled from the west coast to Oklahoma. The plane eventually landed at Tinker Air Force Base in Oklahoma city after an hour loitering above Denver. \\nThe news station’s initial attempts to find where the plane originated proved fruitless as officials from the Federal Aviation Administration (FAA), U.S. Northern Command (NORTHCOM), U.S. Strategic Command (STRATCOM), North American Aerospace Defense Command (NORAD) and a dozen Air Force Bases could not confirm the flight. \\nThe next day, however, the Navy confirmed that the mysterious aircraft was in fact one of its E-6B Mercury planes, known as the ‘Doomsday plane’ , and was simply returning to its homebase. These planes, created by Boeing at a cost of $141.7 million per unit, have the capability to launch nuclear missiles and communicate with nuclear submarines. \\nThe overall mission of the E-6B is to provide “command, control and communications abilities between the National Command Authority (NCA) and U.S. strategic and non-strategic forces.” \\nA nd if you think all that is creepy , which it is, just remember what it was circling over… The Secrets of the Denver International Airport \\nThe most amazing thing about the Denver International Airport (DIA) is not that it is filled to the brim with very freaky occultic symbols everywhere you look, it’s that it is everywhere you look. Instead of trying to hide them, or be clever about it, these works of darkness are on bold display, daring you to figure them out. And there is no question of any kind that all these symbols do indeed tell a story that is yet to be realized. The story of an evil, tragic holocaust. Do I have your attention? \\nThe satanic nature of the Masons is well-known , and we shall not go into that here in this article. (if you would like to learn about Freemasonry, click here for an excellent introduction.) But what I would like to call your attention to is what is written right under the Masons logo. It reads “New World Airport Commission.” Not only does it sound like a name created by conspiracy theorists, the other startling fact is that the ‘New World Airport Commission’ doesn’t seem to exist. Anywhere. \\n \""}, "time": 1742561998.0146832}