{"duration": 0.08541011810302734, "input_args": {"text": "'Hillary Clinton Is DEFINITELY Going To Win. Here’s How We Know (DETAILS) By Carrie MacDonald   \\nThe famous electoral prognosticator Larry Sabato recently shocked a CNN host when he boldly proclaimed that he believed Democratic presidential nominee Hillary Clinton would win the presidency with 352 electoral votes. Looking at the math, though 352 may be a stretch, we WILL inaugurate the first woman president on January 20, 2017. The Road To 270 \\nAs I discussed in detail in my Electoral College 101 piece for Liberal America , a presidential candidate must win 270 of the 538 total electoral college votes in order to win the presidency. It is possible for this to happen even when a candidate does not win the popular vote, as we saw in the election of 2000. \\nAs it stands now, with fewer than two weeks to go, Republican presidential nominee Donald Trump could win all the states that are expected to vote red, including the ones that just “lean” Republican, AND every single swing state, and he still will not win the election. All those states would give him just 245 votes. That’s 25 short of a win. \\nOn the other hand, if Clinton wins every state that is expected to vote blue, as she is expected to do, she will have 293 electoral votes. The Cook Political Scorecard And FiveThirtyEight \\nThe Cook Political Report , a non-partisan newsletter, published the following scorecard on October 27, 2016: Screenshot via The Cook Political Report \\nAs you can see, the math looks grim for the Donald. If he wins the 179 votes he’s expected to win PLUS the 66 that are the tossup votes, he’s still short. \\nThe Cook report still has Florida as a tossup (swing) state. However, Nate Silver’s current projection for that state — the most coveted of all swing states in any presidential race — has Clinton winning. Screenshot via Fivethirtyeight.com \\nThe New York Times has a great interactive tool on The Upshot portion of their website as well. The tool assumes certain electoral votes going to each candidate, and you can try different scenarios to see how many paths to victory each candidate has. As the math goes, if you give every blue state shown above to Clinton, she wins. The Upshot puts Clinton’s chances of winning at 92 percent. \\nBasically, only something monumentally catastrophic will cause her to lose this election. You Still Have To VOTE \\nOf course, despite our headline here, everyone still has to vote to make this a reality. If Democrats get complacent, then that map could get a lot redder. That’s what tends to happen in “off-year” elections, since the Republicans are a lot more likely to get out and vote. It’s why we have a House of Representatives that has been gerrymandered to the point that it’s nearly impossible for the Democrats to regain control of it. \\nIn 2012, House Democrats received more votes than Republicans, yet the Republicans retained control. Why? Redistricting. Had more Democrats voted in 2010, we may not be in such a predicament. Districts are redrawn at least once every 10 years, and the party that controls each state’s legislature generally tends to redraw them to their party’s favor. While some (myself included) may argue that districts should be drawn in a much more equitable manner, the fact remains that, currently, the party in power draws the district to their favor. \\nSo go out and vote. Not just this year, but in every election. Every time. Vote in your local elections. Vote in primaries and general elections. Make your voice heard. \\nAnd let’s make this map even more blue.'"}, "time": 1742563695.9957244}