{"duration": 0.02904534339904785, "input_args": {"text": "'Todd Rundgren isn’t bothered that some of his fans might avoid his concerts due to his politics. [The    musician and record producer conceded as much in an interview with Variety when asked about an incident in which a couple walked out of a concert in Los Angeles due to comments he made about President Donald Trump.  “No,” Rundgren said when asked if it bothered him. “If I had the power, I’d say: If you’re a Trump supporter, don’t come to my show, because you won’t have a good time. And also, I don’t understand your frickin’ values. Because I’m not singing about that. If you don’t understand that basic thing, you’re just fooling yourself. ” The “Hello It’s Me” singer was talking to the magazine to promote his latest album, White Knight, which is filled with collaborations with artists such as Nine Inch Nails’ Trent Reznor and Joe Walsh. One song on the album, “Tin Foil Hat,” is a direct jab at Trump, written and performed with Steely Dan   Donald Fagen. The lyrics reference Trump’s   descent down an escalator at Trump Tower to announce his presidential run, and add that Trump tweets “like a teenage girl” and “puts the ‘pluto’ in ‘plutocrat. ’” Rundgren is currently on a   tour, with multiple dates in Florida and Texas, states that Trump won during the 2016 campaign. But the musician told Variety that Trump supporters “will likely be offended” if they attend his concerts. “Let the buyer beware! I mean, if you can’t take a joke, or you can’t admit that you’ve made a mistake, you don’t belong with the rest of us,” he said with a laugh. Elsewhere in the interview, Rundgren explained that music is the most “plagiaristic” art when compared with other forms, because there are only so many ways musicians can arrange a limited amount of notes together. “You’ve got the western   scale. That’s essentially 11 notes. So you’re eventually going to run out of melodies, just by the pure mathematics of it,” he said. “So the whole art of making music is trying to obscure the fact that this is a melody from another song and has just been changed in subtle enough ways that you don’t recognize it. ” Read Rundgren’s full interview with Variety here.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564505.5224082}