{"duration": 0.09792280197143555, "input_args": {"text": "'What we all should be doing first thing in the morning A simple, cheap and effective way to jump start your metabolism, weight loss and improve your health \\nWhat if I told you that by doing this every day, making it part of your morning routine just like brushing your teeth, would help you to lose weight, flush out toxins, hydrate your body and skin, improve brain function, give you more energy and decrease your appetite, would you do it? \\nDrinking water upon rising in the morning can have huge health benefits! Some people call it water therapy and has its origination in Ayurvedic medicine. It is purported to help with numerous diseases such as cancer, asthma, high blood pressure, arthritis, diabetes and migraines. \\nTo reap the benefits, drink the water upon waking (ideally 45 minutes before you eat) and make it part of your morning routine. Most us are walking around in a dehydrated state. So, start your day off the right way! \\nIdeally filtered water that is void of chemicals and fluoride is best. I personally like the Berkey filter system as this is affordable for many instead of a whole house system. Most water pitchers are ineffective for removing most of the chemicals in our water but there are a couple good ones out there such as the “Clearly Filtered” pitcher. But even if you don’t have a water filter system, it does not mean you should not drink up. \\nFor most people 16 oz. of water in the morning is the right amount. Others say to drink double this amount. This may be a lot of water to consume for most people first thing in the morning. My suggestion would be to start out with 8 oz. and slowly work your way up to the higher amount and see how you feel. Moderation is key as too little or too much water is never a good thing. \\nThe 8 glasses filled with 8 oz. of water is a myth and no science behind this reasoning. Another simple rule is to divide your body weight in half and drink this amount in ounces. But if you are a large person, this may feel like you are spending your day drinking water! \\nInstead focus on getting that glass of water first thing in the day and then add in water, herbal teas, fruits and vegetables during the day. If your urine is very pale yellow throughout the day, then you are hydrated. If it is a bright yellow to orange, drink up! Riboflavin, a B vitamin can make your urine a bright yellow. Benefits to drinking water first thing in the morning It can jump start your metabolism \\nIt can increase your metabolism by 24% for the first 90 minutes after consuming that glass of water. Another study showed that it can increase your metabolic rate by 30% for the next 40 minutes after the water is consumed. Hydration This is more important that you think. When dehydrated, we may experience brain fog, lack of energy and metal clarity. Hydrating in the morning can increase the flow of oxygen which is energizing. Hydrating will also help the skin to look younger. Flushes out toxins \\nSupport your kidneys by helping them to flush out toxins and give your body the water it needs first thing in the a.m. Speed up the detox process by adding a tablespoon of lemon juice to your morning water. This is best done prior to brushing your teeth in the morning as the film on your teeth will protect the enamel from the acidity in the lemon juice. Support brain health \\nYour brain tissue is 75% water. Not having enough water can make you feel tired, drained and can cause mood swings. Prevent you from overeating Just by drinking water you feel full. Studies show that those who consume water before every meal lost an average of 4.5 pounds over a three-month period. That’s with no dieting, not changing your eating habits-just adding in water. Less colds and Flu \\nStaying hydrated helps to maintain the health of your lymphatic system which also affects how your body fights off infection. \\nIf you are looking for a simple, cheap and effective way to improve your health and stimulate weight loss, then this is it! \\nSources \\nBauman, E. & Friedlander, J. (2014) Therapeutic Nutrition. CA: Bauman College. \\nCarroll, A. (8/24/15) No, you do not have to drink 8 glasses of water a day. http://www.nytimes.com/2015/08/25/upshot/no-you-do-not-have-to-drink-8-glasses-of-water-a-day.html'"}, "time": 1742563614.9135392}