{"duration": 1.293745517730713, "input_args": {"text": "'  Watch: Police Viciously Attack, Arrest Peaceful Protesters at DAPL Including Children and the Elderly Watch: Police Viciously Attack, Arrest Peaceful Protesters at DAPL Including Children and the Elderly Matt Agorist October 26, 2016 1 Comment \\nStanding Rock, ND — Dramatic video from Intercept reporter, Jihan Hafiz , was released this week from the Dakota Access Pipeline protests showing a full on assault by militarized police on peaceful people. The video is from Saturday but took several days to be released as cops confiscated the camera used to film it. \\nThe video was taken as water protectors and reporters covering the protests marched toward the construction site. However, their peaceful walk was swiftly interrupted by militarized shock troops armed with massive cans of pepper spray, batons, rubber bullets, and assault rifles. \\nAccording to Hafiz, the march was undertaken in solidarity with several protesters who had chained themselves to bulldozers and pipeline machinery at the construction site. But the marchers never made it to their destination. Instead, they were attacked by police forces who used pepper spray and beat protesters with batons. Dozens of officers, backed by military trucks, police vans, machine guns, and nonlethal weapons, violently approached the group without warning. \\n“Don’t move, everyone is under arrest,” a voice says from the military vehicle that appears to be equipped with a Long Range Acoustic Hailing Device, or LRAD. \\nAs protesters attempted to leave, the police surrounded them and began their attack. According to Hafiz, several women were targeted for leading the march and dragged from the crowd to be arrested. Police body slammed one man and another woman’s ankle was broken as she ran. \\nThe militarized police then circled the protesters in an apparent move to ‘kettle’ them — a tactic usually reserved for urban protests in which riot police force large crowds into corners to seemingly provoke them. However, the protesters stayed entirely peaceful. \\nPolice continued their mass arrests even though the people were trying to leave. Some natives were seen running for the hills as the assault began. \\nOne officer is seen in military camouflage with a ski mask and a tear gas grenade launcher — as if he were going to war. In total, reports Hafiz, more than 140 people were detained in half an hour. It was the largest roundup of protesters since the movement against the pipelines intensified two months ago. A majority of those arrested were charged with rioting and criminal trespass. Overall, close to 300 people have been arrested since protests against the pipeline kicked off over the summer. \\nAmong those arrested were journalists, a teen child who was also pregnant, and an elderly woman. \\nThey were all brought to the jail where protesters were forced to sit in the jail’s common area as police had no other place to put them. According to Hafiz, women were strip searched, protesters were refused phone calls, and no one received food or water. One woman even had her medication confiscated by police, causing her to shake and sweat profusely. \\nWhen Hafiz was finally released, she attempted to get back her camera and was told that she could not have it back. “Your camera is being held as evidence in a crime,” they said. \\nIn the land of the free, filming cops assault peaceful men, women, and children is considered a ‘crime.’ \\nOver the past several weeks, the police state has come out in full force as Native Americans fight to protect their water sources from the threat of the Dakota Access Pipeline. Mainstream media has remained largely silent as federal, state and local authorities worked on behalf of Energy Transfer Partners to squash dissent. \\nEven prominent journalists, like Hafiz, have found themselves targets of the State, charged with dubious “crimes” such as “ inciting a riot ” and “ conspiracy to theft of services ” – for doing nothing more than filming protests and the ensuing violent crackdowns. As the video below shows, the First Amendment is no obstacle when it comes to advancing the interests of the corporatocracy. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Follow @MattAgorist on Twitter and now on Steemit Share'"}, "time": 1742564377.749046}