{"duration": 0.1023550033569336, "input_args": {"text": "'Times reporters provided   analysis and fact checks of   Donald J. Trump’s news conference.   Donald J. Trump made an important concession about Russia. He criticized American intelligence officials. He sparred with reporters and denounced “fake news. ” And that was all before he arrived at the ostensible reason for holding his first formal news conference since July: his plans to extricate himself from the operations of his vast business holdings. Here are the highlights from the whirling, hourlong news conference inside Trump Tower. ■ Mr. Trump said that after his briefing on Friday with American intelligence officials, he now thought Russia was behind the effort to hack his election opponents. “As far as hacking, I think it was Russia,” Mr. Trump said. ■ However, later in the news conference, Mr. Trump wavered slightly when pressed on the matter. “But you know what, it could have been others also,” he said when asked why he had been so critical of American intelligence officials. ■ He harshly criticized the publication of unverified reports that claimed Russia has salacious information about his behavior and finances. “I think it was disgraceful, disgraceful that the intelligence agencies let any information that turned out to be so false and fake out,” he said. Explaining his Twitter post comparing the United States to Nazi Germany, he said of the leaks: “That’s something that Nazi Germany would have done and did do. ” Mr. Trump added that BuzzFeed, which published the memos in their entirety, is “a failing pile of garbage” that would suffer the consequences for publishing the uncorroborated report. ■ Mr. Trump said he was untroubled by other intelligence reports that have been made public, which said Russia preferred him over Hillary Clinton and that President Vladimir V. Putin ordered the election meddling to benefit him. “If Putin likes Donald Trump, guess what, folks: That is called an asset, not a liability,” he said. He added that a strong relationship could allow the two nations to work together on difficult international issues. ■ When asked whether he had a message for Mr. Putin, Mr. Trump said: “He shouldn’t be doing it. He won’t be doing it. Russia will have much greater respect for our country when I am leading it. ” He added: “There’s no reset button. We’re either going to get along or we’re not. ” But he did not address a question about whether he or anyone on his campaign staff had had contact with Russia during the campaign. ■ Mr. Trump swatted away allegations included in the uncorroborated reports. He said that, when traveling, he warns his aides and bodyguards, “Be very careful, because in your hotel rooms and no matter where you go, you’re gonna probably have cameras. ” He also added, apparently referring to a detail in the report about supposed sex videos with prostitutes, “I’m also very much of a germaphobe, believe me. ” ■ Discussing the topic the news conference was intended to address, Mr. Trump said he would not divest from his vast business holdings as he takes office. Instead, the   will turn over the operations and control of those holdings to a trust controlled by his eldest sons, Eric Trump and Donald Trump Jr. ■ The   said that he had considered letting the Affordable Care Act “implode” on its own and letting Democrats take the political hit he said would follow. But he said he had decided on a more forthright strategy: repeal and replace “almost simultaneously. ” Mr. Trump was short on details but clearer in his intention to try to keep Democrats responsible. “We don’t want to own it politically,” he said. ■ Mr. Trump said that he had asked David J. Shulkin, a current under secretary at the Department of Veterans Affairs, to lead that agency after his team had interviewed “at least 100 people” in the search for a secretary. ■ Near the end of the news conference, Mr. Trump got into a shouting match with Jim Acosta of CNN, who tried to press the   into taking a question. “Since you were attacking our news organization, can you give us a chance?” Mr. Acosta asked. To which Mr. Trump replied: “Your organization’s terrible,” and “don’t be rude,” before dismissing the request once and for all: “You are fake news. ” (CNN was the first to report that Mr. Trump and President Obama had been briefed by intelligence officials on the uncorroborated documents, but the network did not publish them.) ■ Sean Spicer, the incoming White House press secretary, spoke first to address the publication of the unverified reports by BuzzFeed on Tuesday. Mr. Spicer called the reports a “frankly outrageous and highly irresponsible” attack on Mr. Trump and a “sad, pathetic attempt to get clicks. ” Mr. Spicer said the documents were not an intelligence report and were categorically false. ■ Vice   Mike Pence followed Mr. Spicer and amplified his condemnation of news reports by BuzzFeed and other news outlets, which he said were “irresponsible” and aimed at discrediting Mr. Trump’s legitimate election victory. ■ Mr. Trump began by thanking news organizations that did not report what he called “the nonsense that was released. ” He said he has “great respect for freedom of the press, and all of that. ” ■ Mr. Trump said that the document “was released by maybe the intelligence agencies, who knows, which would be a tremendous blot on their record. ” ■ He went on to cast blame on the Democratic National Committee for the hacking. He praised the Republican National Committee for having better defenses and commended Reince Priebus, his incoming chief of staff, who was the committee chairman. ■ Mr. Trump reiterated his description of the report printed by BuzzFeed as “fake news,” saying he did not think Mr. Putin had compromising information about him or the Republican Party. “I’ll be honest, if he did have something, he would have released it,” he said. ■ He denied that he has any business dealings in Russia: “I tweeted out that I have no dealings with Russia. I have no deals in Russia. I have no deals that could happen in Russia because we’ve stayed away. And I have no loans with Russia. As a real estate developer, I have very, very little debt. ” ■ Mr. Trump said he had requested that the intelligence agencies produce a “major report” on “hacking defense” to be delivered 90 days after he takes office, including an examination of “this situation” with Russia and other incidents of hacking. ■ Sheri A. Dillon, a lawyer for Mr. Trump, took the stage to describe how her client would turn over his business assets to a trust. “  Trump wants there to be no doubt in the minds of the American public that he is completely isolating himself from his business interests,” she said, adding that Mr. Trump’s sons will make all decisions for the company “without any involvement whatsoever” from Mr. Trump. She said Mr. Trump would resign from all positions he holds with the Trump Organization, as would his daughter Ivanka. ■ Ms. Dillon said that the Trump Organization would be allowed to make no new foreign deals during the presidency and that any new domestic deals would be subject to strict restrictions. “He will only know of a deal if he reads about it in the paper or sees it on TV,” Ms. Dillon said, referring to Mr. Trump. She also said an ethics adviser would be appointed to the management team of the Trump Organization. ■ Ms. Dillon argued that selling Mr. Trump’s business would prove more difficult and create more ethical quandaries than the plan that the Trump Organization had chosen. A totally blind trust, she said, would likewise be impossible under the circumstances. And, she added, “  Trump should not be expected to destroy the company he built. ” ■ Ms. Dillon laid out what amounts to the Trump administration’s interpretation of the Constitution’s Emoluments Clause, which prohibits government officials from taking payments or gifts from a foreign government. “No one would have thought when the Constitution was written, that paying your hotel bill was an emolument,” she said. To avoid any appearances of violations, Ms. Dillon said Mr. Trump had pledged to donate to the United States government all profits made by his hotels from payments by foreign governments. ■ Mr. Trump was flanked by a table piled high with manila folders that he said contained paperwork that he had signed turning over control of the Trump Organization to his sons. ■ Mr. Trump joked that if his sons failed to do a good job managing the company during his time in office, he would turn to them and say, “You’re fired. ” ■ In other comments about his businesses, Mr. Trump said he had been offered deals worth $2 billion worth in Dubai, in the United Arab Emirates, “over the weekend” but had turned them down. ■ Asked about his tax returns, Mr. Trump said he was still not releasing them “because they are under audit. ” He said that the American people did not care about the documents anyway. “The only one that cares about my tax returns are the reporters,” Mr. Trump said. ■ Mr. Trump said he was looking forward to his inauguration. “It’s going to be a beautiful event,” he said. “We have great talent, tremendous talent. ” And, he added, “massive crowds” as well. ■ Asked to address criticism that his cabinet choices have presented an abundance of conflicts of interest, Mr. Trump simply praised his appointments. “I think we have one of the great cabinets ever put together,” he said. ■ Mr. Trump said he expected to announce “big news” in the next few weeks about companies that would build factories in the Midwest. ■ Mr. Trump said Carrier’s decision to keep jobs in Indiana sent a clear signal to other companies thinking of moving production overseas. “The word is now out,” he said, repeating a call for a “major border tax on these companies that are leaving. ” ■ About that wall: “I don’t feel like waiting a year, a year and a half I want to start building,” he said. He reiterated that Mexico would reimburse the cost, but he added cryptically that it probably wouldn’t be in the form of “a payment. ” ■ Turning to the Supreme Court, Mr. Trump said he expected to announce a nominee to fill the court’s vacant seat two weeks or so after he takes office. ■ Mr. Trump was asked how he would reform the news media he criticizes frequently. “I don’t recommend reforms,” he said. “I recommend people that have some moral compass. ” He added, “I will tell you, some of the media outlets that I deal with are fake news, more so than anybody. ”'"}, "time": 1742628444.761413}