{"duration": 0.09917283058166504, "input_args": {"text": "'Comments \\nNumerous FBI officials, both current and former, say the Bureau is intentionally attempting to influence the presidential election in favor of Republican presidential nominee Donald Trump by damaging the candidacy of Democratic presidential nominee Hillary Clinton. \\nThe interworkings of the FBI have been generously described as “chaotic” since Director James Comey declined not to recommend Hillary Clinton face criminal charges over her private email server, and this is because, as one current FBI agent described, “the FBI is Trumpland.” \\nThis is a view shared by numerous other agents , none of which would speak directly on the record for fear of both professional and personal reprisal. \\nComey then turned about-face and wrote a vague letter to Congress to announce the FBI would soon begin the process of combing through new emails which it had recently discovered that were tied to Clinton by way of Anthony Weiner , a disgraced Democratic congressman and failed New York City mayoral candidate who happens to be married to Clinton’s top aid, Huma Abedin. \\nThe FBI looked at Weiner because of accusations that he had been having illicit sexual conversations with an underage g irl. Comey’s letter was almost immediately leaked by Congressman and self-appointed Clinton inquisitor Jason Chaffetz (R-UT) and the dominoes began to fall in Trump’s favor. Clinton’s polling numbers began to sink, and the negativity surrounding the allegations of various sex crimes committed by Trump began to dissipate as the nation’s perpetually wandering attention returned to the ersatz email “controversy’. \\nOne FBI agent said that Clinton is viewed as “the antichrist personified to a large swath of FBI personnel” which is why the information about Clinton has been timed to coincide with the election, “they’re pro-Trump.” \\nHowever, not all of the information coming out of the FBI is entirely anti-Clinton. Trump’s former campaign manager and former Putinist operative Paul Manafort, is also said to have an active investigation open against him and that the investigation is in its early stages. \\nA former FBI official has a different take on the matter and said, “There are lots of people who don’t think Trump is qualified, but also believe Clinton is corrupt. What you hear a lot is that it’s a bad choice, between an incompetent and a corrupt politician.” \\nThe content of the newly discovered emails, if they even exist at all, are unknown as Comey wrote his letter to Congress before the FBI acquired a warrant to read the emails. This is further evidence of the FBI’s bias against Clinton as the FBI exists to investigate facts rather than spreading propagandistic rumor — particularly weeks before a presidential election which many have said is a clear violation of the Hatch Act which was enacted to prevent individuals like Comey from using the power of their office to engage in partisan political activities. \\nRudy Giuliani, the former Mayor of New York City, hinted towards these actions by the FBI against Clinton two days before they transpired . He said, “I think he’s (Trump) got a surprise or two that you’re going to hear about in the next few days. I mean, I’m talking about some pretty big surprises.” Now would Giuliani know the FBI was going to write a vague letter which would shake up the presidential election unless the FBI had already decided to take the action and time the release of the letter specifically to damage Clinton? \\nThe Director of the FBI is a position that can only be appointed by a sitting president, and the director is given a 10-year term. The concern is due to the FBI’s bias against Clinton, and the likelihood of her victory, it would appear all but impossible that James Comey would be capable of fulfilling his duties. The president has the discretion to unilaterally fire an FBI Director. The Congressional Research Service found “there are no statutory conditions on the President’s authority to remove the FBI director.” If Clinton is able to beat back the FBI’s last-minute attempts to influence the election, it is all but assured that she will fire Comey on her first day in the Oval Office. Related Items:'"}, "time": 1742561851.7897246}