{"duration": 0.09786200523376465, "input_args": {"text": "'Chinese spies steal from USA $100 billion a year 31.10.2016 Print version Font Size The Chinese intelligence has challenged the US national security system. China recruits senior military officials and conducts cyber attacks against the United States. What is worse, the Chinese intelligence has stolen Pentagon\\'s plans for the future conflict with China, a recent report to US Congress said. The annual report from the US-China Economic and Security Review Commission has sounded the alarm with regard to the activities of Chinese security forces. The report said that despite extensive ties between Beijing and Washington, the US-China relations have remained tense during the current year, the Washington Free Beacon said. The relations between China and the United States have worsened primarily because of China\\'s territorial claims in the South China Sea, permission from the United States to sell weapons to Taiwan, the deployment of the missile defense system in South Korea, Chinese cyber attacks and the US-led policy to \"restore balance\" in Asia.As for most serious threats, the report highlights cybercrime and the \"involvement of the human factor\" to gain access to objects of national security. The activities of the Chinese intelligence have increased significantly over the past 15 years. The work is carried out through the Ministry of State Security, the People\\'s Liberation Army of China and military departments of the Communist Party, the report said. As for the \"human factor\", the report refers to the story of the recruitment of US Pacific Command Lieutenant Colonel Benjamin Pierce Bishop. The man was in an intimate relationship with a Chinese woman, who eventually recruited him. Thus, the information about US military secrets in the field of nuclear weapons, secrets of the Reaper MQ-9 UAV and the secret US report about the Strategy of the Ministry of Defense of China was compromised. The report also mentions a few other recruited gentlemen: another senior official of the Pacific Command - James Fondren, who delivered \"The National Defense Strategy of the USA\" to China in 2010. Another man, Greg Bergerssen, delivered state secrets to China before he was arrested in 2008. US naval officer Edward Lin was caught for selling secrets of the US Navy to China. All this information may undermine the military superiority of the United States by promoting China\\'s military modernization and providing China with understanding of the tactics of military operations and other operational approaches of the United States to potential developments in the region, the report said. Noteworthy, China spies even on members of government delegations. For example, British officials, before going to the G20 summit in Hangzhou, were instructed to avoid contacts with \"Chinese spies who offer sex\", The Irish Times said. The officials were instructed not to take any gifts, especially electronic devices containing memory cards, SIM-cards or chargers as they could serve as a basis for video and audio surveillance. All the members of the British delegation were given temporary mobile phones and e-mail addresses. The officials were even recommended to change their clothes under blankets to avoid any chance of taking their nude pictures. \"Chinese intelligence has repeatedly infiltrated U.S. national security entities and extracted information with serious consequences for U.S. national security, including information on the plans and operations of U.S. military forces and the designs of U.S. weapons and weapons systems,\" the report said. \"Among the information extracted were 5.6 million fingerprints, some of which could be used to identify undercover U.S. government agents or to create duplicates of biometric data to obtain access to classified areas,\" it continued. China uses a variety of \"actors\" for its cyber espionage - from \"government contractor\" to independent \"patriotic hackers\" and \"criminal entities.\" These groups often interact with each other. The US Department of Justice paid attention to the arrest of US citizen Allen Ho, who was accused of stealing nuclear technology for China General Group. Ho enlisted as many as six American engineers for the purpose. In addition, the DoJ and the FBI accused Chinese nationals of the theft of know-how technology for the production of carbon fiber for submarines and compounds for bleaching materials.The FBI evaluated losses from industrial espionage at 19 billion dollars a year. In one outstanding incidence, former Secretary of Commerce Carlos Gutierrez had his laptop hacked into and copied in Beijing, even though Gutierrez was one of the key figures in international trade negotiations. The information from his laptop was subsequently used to break into US government computers.James Andrew Lewis of the Center for Strategic and International Studies in Washington said that the stolen intellectual property of the USA brings China the profit of up to 100 billion a year. Interestingly, only a few Chinese spies have been arrested so far, John R. Schindler wrote for The Observer. The potential of the Chinese intelligence is high: 300,000 Chinese students studying in American universities. Lyuba Lulko Read article on the Russian version of Pravda.Ru USA watches China building new capitalism'"}, "time": 1742562768.760755}