{"duration": 0.04049348831176758, "input_args": {"text": "'Iran to resume gas exports to Turkey soon Fri Oct 28, 2016 12:10PM Energy Iran says it will resume exports of natural gas to Turkey by Monday after an explosion in the Turkish territory halted the supplies on Thursday night. \\nIran says its exports of natural gas to Turkey that have been halted reportedly as a result of an explosion inside the Turkish territory will resume within the next few days. \\nSadeq Akbarpour, the head of Gas Exports Measurement Facilities at Iran-Turkey Border, told the domestic media that the required coordination is being carried out with the Turkish Botas company to resume Iran’s exports by next Monday. \\nAkbarpour emphasized that Iran is ready to supply Turkey with its required gas whenever it voices its readiness. \\nMajid Bojarzadeh, the spokesman of the National Iranian Gas Company (NIGC), also told Iran’s Shana news agency that Ankara had informed Tehran of a problem in the pipeline that carried Iranian gas into Turkey on Thursday night. \\nFurthermore, Majid Aqababaei, the director general for border affairs of Iran’s Interior Ministry, acknowledged, as reported by Shana, that an explosion near Iran’s border had caused the problem. \\nIran is Turkey’s second supplier of gas after Russia, providing one-fifth of the country’s consumption. The current volume of natural gas that Iran is piping to its northwestern neighbor is 30 million cubic meters per day (mcm/d). Officials in Tehran had already emphasized that the Islamic Republic is ready to increase its gas exports to Turkey by 6 mcm/d. \\nIran has also for long been working on a plan to export its natural gas to Europe through Turkey. The plan – that was to be carried out though the Nabucco scheme – was eventually put on hold due to a series of technicalities. Nevertheless, officials in Tehran announced last month that the possibility that gas exports to Europe would return to the agenda exist “if the requited agreements with Europeans countries over the plan are reached”. Loading ...'"}, "time": 1742628397.4388678}