{"duration": 0.01714181900024414, "input_args": {"text": "'The NFL and the City of St. Louis have tried and failed three times to make a football marriage work. Now, they’re going to court to finalize the divorce. [The City and County of St. Louis have filed a lawsuit against the NFL, claiming that the league violated the law when they approved the relocation of the Rams from St. Louis to Los Angeles. The lawsuit claims that the league ignored its own bylaws when approving the Rams move, specifically that the move, “was not supported by the required statement of reasons or the adopted relocation standards. ”  According to Yahoo! Sports, “The lawsuit claims that the City of St. Louis has lost an estimated $1. 85 million to $3. 5 million per year in ticket tax revenue, an additional $7. 5 million in property tax and $1. 4 million in sales tax revenue, as well as “millions” in earning taxes. “The suit alleges that the parties ignored the NFL’s relocation bylaws, which were established in 1984 following a rash of teams relocating and after a court told the league it might want to do so to prevent antitrust liability. In essence, the relocation rules state that teams must work in good faith to try to keep the franchises at home first before seeking to move them elsewhere. They must first satisfy all the relocation requirements and exhaust all opportunities at home first before moving. The suit claims the Rams and owner Stan Kroenke “made false statements regarding the team’s intent to engage in good faith negotiations” with St. Louis. ” On one hand, the NFL and their terrible, awful, no good commissioner getting smoked in a courtroom would definitely be more than satisfying. On the other hand, if the league loses a ton of money in court, they’ll hike ticket prices in order to pay it off. In any event, given the fact that they lost teams as well, you can bet that the cities of San Diego and Oakland will keep a very close eye on how this case plays out. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742563409.114078}