{"duration": 1.277456521987915, "input_args": {"text": "'Let us have a look at the data for today \\n. \\n\\nIn silver, the total open interest ROSE by 318 contracts UP to 193,975. The open interest ROSE AS the silver price was UP 8 cents in yesterday’s trading .In ounces, the OI is still represented by just less THAN 1 BILLION oz i.e. .970 BILLION TO BE EXACT or 139% of annual global silver production (ex Russia &ex China). \\nIn silver for October we finished with 39 notices served upon for 195,000 oz. Thus the final standings for silver in October is 555 notices served upon for 2,775,000 oz. An excellent showing for silver in a non delivery month. \\nIn November, in silver, on first day notice filings: 875 notices were served upon for 1,690,000 oz \\nI \\nIn gold, the total comex gold ROSE by 2,919 contracts WITH THE RISE in price of gold ($4.30 ON FRIDAY ) . The total gold OI stands at 510,070 contracts. \\nIn gold for October we had 341 notices served upon for 341,000 oz. This should finalize gold as the total number of notices filed for the month totals 9,776 for 977,600 oz or 30.407 tonnes. \\nIn gold for November: we had on first day notice filings: 875 notices served upon for 87500 oz \\n\\nWith respect to our two criminal funds, the GLD and the SLV : \\nGLD \\nTODAY WE HAD NO CHANGES AT THE GLD OUT OF THE GLD \\nTotal gold inventory rests tonight at: 942.59 tonnes of gold \\nSLV \\nwe had NO CHANGES at the SLV/ \\nTHE SLV Inventory rests at: 360.673 million oz \\n. \\nFirst, here is an outline of what will be discussed tonight: \\n1. Today, we had the open interest in silver ROSE by 318 contracts up to 193,975 as the price of silver rose by 8 cents with Friday’s trading.The gold open interest ROSE by 2,919 contracts UP to 510,070 as the price of gold ROSE $4.30 IN FRIDAY’S TRADING. \\n(report Harvey). \\n2.a) The Shanghai and London gold fix report \\n(Harvey) \\n2 b) Gold/silver trading overnight Europe, Goldcore \\n(Mark O’Byrne/zerohedge \\n3c FRBNY gold movement report \\n(Harvey)   3. ASIAN AFFAIRS \\ni) Late SUNDAY night/MONDAY morning: Shanghai closed DOWN 3.78 POINTS OR 0.12%/ /Hang Sang closed DOWN 20.27 OR 0.09%. The Nikkei closed DOWN 21.39 POINTS OR 0.09% Australia’s all ordinaires CLOSED UP 0.59% /Chinese yuan (ONSHORE) closed UP at 6.7728/Oil FELL to 48.43 dollars per barrel for WTI and 50.42 for Brent. Stocks in Europe: ALL IN THE MIXED Offshore yuan trades 6.7847 yuan to the dollar vs 6.7728 for onshore yuan. THE SPREAD BETWEEN ONSHORE AND OFFSHORE NARROWS A LITTLE BIT AS MORE USA DOLLARS ATTEMPT TO LEAVE CHINA’S SHORES / CHINA SENDS A MESSAGE TO THE USA TO NOT RAISE RATES IN DECEMBER. REPORT ON JAPAN SOUTH KOREA NORTH KOREA AND CHINA 3a)THAILAND/SOUTH KOREA \\nSouth Korea`s is rocked this morning by an influence peddling scandal similar to the USA charitable foundation scandal \\n( zero hedge) b) REPORT ON JAPAN \\nA preview of what to expect from Japan`s decision this week. In essence continue what they have been doing: printing money and buying assets \\n( zero hedge) c) REPORT ON CHINA \\ni)This is now alarming: China`s TED spreads are blowing out as banks are now afraid to lend to one another and a huge dollar shortage. \\n( zero hedge) \\n\\nii)Another alarming commentary. China`s debt this year has grown by 4.5 trillion uSA. This growth has basically kept the world`s global economy moving somewhat. When this stops all hell with break loose: a huge deflationary spiral \\n( zero hedge)'"}, "time": 1742563447.5841663}