{"duration": 1.1419951915740967, "input_args": {"text": "'\\nCNN asked the Democratic National Committee to prepare questions for Wolf Blitzer’s interview with Donald Trump, according to emails released by Wikileaks.\\nIn an April 25 email entitled “Trump Questions for CNN,” the DNC’s Lauren Dillon asked fellow Democrats for questions Blitzer could ask Trump.\\n“Wolf Blitzer is interviewing Trump on Tues ahead of his foreign policy address on Wed,” she wrote. “Please send me thoughts by 10:30 AM tomorrow. Thanks!”\\nThe DNC came up with a lengthy set of questions for CNN :\\n– Who helped you write the foreign policy speech you’re giving tomorrow? Which advisors specifically did you talk to? What advice did they give you? Did they give you any advice that you chose not to take?\\n– CIA Director Brennan and former CIA Director Hayden have both said that our military and intelligence officers might refuse to follow some of your orders if you were president. What would you do if the military refused to listen to you? Should they be court-martialed if they refuse to follow orders?\\n– You’ve said you look to Ambassador John Bolton for military advice and called him “terrific,” but he was one of the architects of the Iraq war. How do you explain your praise for Bolton if you also claim the war was a mistake? What advice have you taken from him?\\nYou can read the rest here , but there’s a few other gems:\\n– Do you think American victims of 9/11 should be able to sue Saudi Arabia in court? What role, if any, do you think Saudi Arabia had in the 9/11 attacks?\\n– You’ve said we should have bombed the “right people” after 9/11 and have suggested that the government has evidence Saudi Arabia was involved. Do you think we should have instead bombed Saudi Arabia?\\nThis is smoking gun, undeniable proof that CNN is in the tank for Hillary Clinton – and the rest of the mainstream media is no different.\\nIn fact, the Clinton campaign is acting as an assignment editor for the establishment media by telling reporters what to cover – and what to bury from public view that would otherwise hurt Hillary.\\nPrevious Wikileaks emails revealed that campaign staffers are directly working with mainstream “journalists” to develop news stories favorable to the campaign – before they’re published!\\n“Huffington Post is doing a piece on our treasurer Jose Villareal — will likely focus at least partially on him sitting on the Walmart board,” said campaign communications staffer Jesse Lehrich in a 2015 email , which reads like a reporter assignment list at a major newspaper. “Other outstanding stories include: [Buzzfeed correspondent] Ruby Cramer on our grassroots organizing, Anita Kumar (McClatchy) on where we have organizers and how we’ve spent our money during Q2, and [Washington Post reporter] Phil Rucker on HRC talking about gun violence prevention.”\\nSource \\n'"}, "time": 1742562414.2688415}