{"duration": 0.09631919860839844, "input_args": {"text": "'LONDON  —   Freed from the shackles of the European Union, Britain’s economy would prosper and its security would increase. Britain would “take back control” of immigration, reducing the number of arrivals. And it would be able to spend about 350 million pounds, or about $470 million, a week more on health care instead of sending the money to Brussels. Before Thursday’s referendum on the country’s membership in the   bloc, campaigners for British withdrawal, known as Brexit, tossed out promises of a better future while dismissing concerns raised by a host of scholars and experts as “Project Fear. ” But that was before they won. With financial markets in turmoil, a big drop in the pound and the prospect of further chaos, some supporters of Brexit are backpedaling on bold pronouncements they made just a few days earlier. “A lot of things were said in advance of this referendum that we might want to think about again,” Liam Fox, a former cabinet minister, told the BBC, including when and how Article 50  —   the formal process for leaving the European Union  —   should be invoked. Perhaps no promise was more audacious  —   and mendacious, critics say  —   than the £    claim. Boris Johnson, the former mayor of London who was the frontman of the Brexit campaign, toured Britain in a bus emblazoned with the slogan: “We send the E. U. £350 million a week, let’s fund our N. H. S. instead,” a reference to the country’s widely revered National Health Service. Hours after proclaiming “independence day” for Britain, Nigel Farage, the leader of the fiercely   U. K. Independence Party, conceded that the £350 million figure was a “mistake. ” Asked by the BBC on Sunday about the spending pledge, Iain Duncan Smith, a former Conservative Party leader who campaigned for Brexit, said the Leave side had merely promised “to spend the lion’s share of that money” on the health service. The shift was perhaps unsurprising, since the £350 million “independence dividend” never stood up to scrutiny. It excluded money returned to Britain through rebates and money that Britain spent to subsidize its farmers and poorer regions, according to the respected Institute for Fiscal Studies. The institute put the true figure at about £150 million. Supporters of the “Remain” side have angrily attributed the victory for “Leave” to a campaign of misinformation and even deception. In Cornwall, in the southwest corner of England, where a majority voted to leave, the leader of the county council, John Pollard, demanded that the government provide “investment equal to that provided by the E. U. program. ” (The county has gotten about $1. 3 billion in European Union assistance over the past 15 years, and was counting on about $550 million more by 2020.) A Financial Times chart showing that the Leave vote was strongest in the parts of Britain that are the most economically dependent on the European Union was widely circulated online. Promises to quickly reduce immigration levels are also being played down. Migration was the cornerstone of the Leave campaign, which objected to the European Union’s insistence on the free movement of labor, capital, goods and services. Since 2004, when 10 more countries joined the European Union, large numbers of eastern and southern Europeans have moved to Britain for work. Mr. Johnson argued that it was impossible for the government to reduce immigration while in the European Union. His ally Michael Gove, the justice secretary, said a leave vote would “bring down the numbers” by 2020. Experts have long said that would be very hard to pull off. The European Union has demanded from nonmember states  —   Norway, for example  —   free movement of workers in exchange for access to the bloc’s single market. On Friday, the day after the referendum, Daniel Hannan, a member of the European Parliament and one of the most knowledgeable advocates of Brexit, stunned some viewers of the BBC by saying: “Frankly, if people watching think that they have voted and there is now going to be zero immigration from the E. U. they are going to be disappointed. ” Mr. Hannan wrote on Twitter, “I was for more control, not for minimal immigration. ” Facing a backlash, he observed that a lot of Remain voters “are now raging at me because I *don’t* want to cut immigration sharply,” adding, “There really is no pleasing some people. ” He then announced that he would “take a month off Twitter. ” Mr. Farage took the most   position on immigration, unveiling a poster depicting a long stream of refugees under the headline “Breaking Point” and raising the prospect of Turkey’s joining the European Union (even though any of the 28 member states has veto power over accepting new members). Many Brexit campaigners expected to lose  —   even Mr. Farage said on the night of the referendum that he did not think his side had won  —   and for some the fight was as much about internal Conservative Party politics as the future of the country. Having now ousted Prime Minister David Cameron, they face a political vacuum, with their base demanding that promises be kept. Mr. Johnson, the   to replace Mr. Cameron, has not made any further pronouncements since a subdued statement on Friday that was restricted to generalities. If he does become prime minister, Mr. Johnson will face the task of carrying out a British withdrawal without provoking a backlash from those who believed campaign slogans or sentiments that he certainly appeared to endorse. “In voting to leave the E. U. it is vital to stress that there is now no need for haste,” Mr. Johnson told reporters. Standing alongside him, Mr. Gove promised, “We can have democratic consent for an immigration policy that is fairer and more humane. ” He did not explain how.'"}, "time": 1742562302.2320588}