{"duration": 0.05964851379394531, "input_args": {"text": "'The BBC has run a series of online and radio segments claiming the “great meme war has travelled to France” implying Internet jokes could swing the French election for the Front National as the broadcaster alleges they did for Trump and Brexit in the UK and U. S.[“A group of anonymous keyboard warriors who claim they helped Donald Trump win his presidency have moved their fight to Europe and are trying to help elect a   leader for France,” the radio programme’s description reads.  “In 2016 politically and racially charged memes and symbols started spreading from U. S. and UK accounts,” opens the accompanying video on BBC Trending’s Facebook page. “Far right activists claim the results of the U. S. presidential elections demonstrated their influence,” the film says. Front National denies any role in ‘Great Meme War’ A glass of half full milk is code for white supremacy  …     and other shocking racially charged memes, Posted by BBC Trending on Monday, 10 April 2017, The BBC presenter says meme “activities” miraculously “stopped” in November 2016, after the election of President Donald J. Trump, with the “same accounts” becoming active again in January 2017, “this time targeting France”. According to the BBC, the “operation” has generated 50, 000 tweets so far, with right wing activists organising in online gaming chat rooms “like their U. S. counterparts”. The prospect that memes are merely the result of unorganised and unlinked individuals amusing themselves online is not seriously considered. “The ‘Great Meme War’ symbols and memes have travelled to France. But their influence cannot yet be quantified,” concludes the film. The BBC does little to explain how such memes could influence elections, other than implying right wing politicians use them to “connect” with young voters. The example of Florian Philippot is given, a   of the Front National and advisor to Marine Le Pen, who used a meme on his YouTube channel. He flashed the ‘Risitas’ or ‘Spanish laughing guy’ meme at the end of a video, which has been used by both left and right wing activists. Mr. Philippot’s spokesman responded to the BBC’s insinuation that using the meme might be racist. “El Risitas is not a symbol with a racist connotation that echoes the ideology of the far right. It is just funny,” he said.'"}, "time": 1742563101.1071742}