{"duration": 0.05193185806274414, "input_args": {"text": "'ABC Poll Oversamples Dems by 9%, Claims Hillary Leading Mainstream media oversampling Democrats to create fake Hillary lead Kit Daniels - October 27, 2016 Comments \\nIn another example of poll rigging, an ABC presidential poll surveyed 9% more Democrats than Republicans and showed Hillary Clinton leading by 12% – with a 3% sampling error! \\nABC claims it’s a “12-point race” with Clinton ahead after polling a “random” national sample of 1,155 likely voters, but the poll’s methodology reveals the poll was heavily biased in favor of Hillary. \\n“Results have a margin of sampling error of 3 points, including the design effect. Partisan divisions are 36-27-31 percent, Democrats-Republicans-independents,” ABC said near the bottom of the poll. \\nOf course Hillary will be ahead in polls dominated by Democrats, but ABC and other mainstream media outlets are betting that voters won’t bother to look at a poll’s methodology to find the bias. \\nEven if there’s more registered Democrats than Republicans nationally, they don’t outnumber them by nearly 10% because otherwise Republicans wouldn’t be winning national races. \\n“These kind of misleading polls really strike at their credibility as pollsters,” wrote media analyst Aaron Rossiter. “They seem to want the big Hillary lead, probably to throw off the poll averages and suppress Republican voter turnout.” \\nAnd if the fact that mainstream polls are “adjusted” to manufacture a Hillary lead still sounds doubtful to you, just read this leaked email from Democratic consultant Tom Matzzie: \\n“I also want to get your Atlas folks to recommend oversamples for our polling before we start in February. By market, regions, etc. I want to get this all compiled into one set of recommendations so we can maximize what we get out of our media polling.” \\nThe email also includes this report from The Atlas Project on how to rig polls to get the desired result: \\nFor example, in Florida, a key battleground state, Democratic consultants recommended oversampling African-American and Hispanic voters who lean Democratic so the polls favor Democrat candidates: \\n– General election benchmark, 800 sample, with potential over samples in key districts/regions \\n– Benchmark polling in targeted races, with ethnic over samples as needed \\n– Targeting tracking polls in key races, with ethnic over samples as needed'"}, "time": 1742562016.871073}