{"duration": 0.13138341903686523, "input_args": {"text": "'www.stankovuniversallaw.com \\nEnergetic Report from October 24th, 2016 Yesterday evening after I had recovered somewhat from the steady, heavy blast of energy, and my headache, dizziness and nausea had subsided, Georgi called me to come look out of the window and there we saw a beautiful rainbow in the north-east. It was a vertical pillar of rainbow stripes that rose up into the sky before melding into a sea of deep grey cloud cover – a storm had just rolled through. We were both happy to see this rainbow but at the same time we noticed there was something in the air that was very unusual. We felt a palpable change in the energy all around, and within the space of a couple of minutes it was as if everything was bathed in a blanket of soft, gentle golden light. Two more minutes and everything radiated a deep luminescent golden glow! It continued to deepen in intensity and suddenly the entire sky and every solid object was illuminated. White clouds had formed and were absorbing this luminosity from somewhere. This light did not come from our Sun; it was as though light was radiating out from the prana molecules themselves. Gold prana everywhere! The Sun was hidden behind a heavy bank of grey clouds to the west and it’s light was just not present. And the glow intensified even further! Everything was covered in a deep and luminous gold and emanated an energy that was soft, gentle, peaceful and yet powerful, warm and loving. It was as though everything reflected a reality made of pure divine presence. It was heaven-sent and we witnessed it all unfold in its magnificent and stunning beauty. We were both in awe of this vision before us and it wasn’t until we received this message from the Elohim that we realized that this light was the magnificent Resurrection Flame . We are certain others among you have seen or will see this light this week. We are with you all. Much love, Carla and Georgi Clarification The proton stream that is now flowing from the Central Sun via the massive coronal hole of our sun since October 24th, 2016 is different from the Resurrection Flame that is also coming from the Central Sun/Source. This is very important to observe. The latter consists of highest frequencies of light beyond the 5D, actually from the 12th dimension, while the protons are conscious God’s particles that are the building elements of space-time and of all forms in 3D, 4D and lower 5D. This includes the creation of matter, all elements and substances, in 3D as we know it from the current holographic model on the earth. In order to illustrate how important the protons are for life, I must make you aware of a well-known fact in bio-sciences that has not been fully understood by most scientists before I explained its paramount importance in my pivotal book Volume III on bio-science and medicine. The entire metabolism in the cell and in the human organism that keeps the biological bodies alive represents a complex redox-cascade of biochemical reactions and cycles which are the major topic of biochemistry. The final product of these chemical processes is the degradation of the three major food classes – carbohydrates, proteins and fatty acids – and the separation of protons from water and the food chain in the mitochondria. These protons are then expelled on the outer side of the mitochondrial membrane and build a powerful proton gradient of more than one million voltmeters across this membrane. In fact, such electromagnetic (EM) gradients are built around all cellular and intra-cellular membranes and these gradients are the driving force – the vis vitalis – of organic matter, organic life. As I have written a lot in the past, I am the first scientist who has grasped the importance of the electromagnetic gradients in the cell and the organism and how they operate as powerful spherical capacitors . The entire chemical energy stored in the food (minus the heat (thermodynamic energy) that is emitted to the environment) is utilized in the body via the cell metabolism and is then transformed into electromagnetic energy of transmembrane EM gradients . The latter drive the entire cell regulation and body metabolism by releasing their energy in form of action potentials which can be easily measured, for instance, as ECG and EEG. Organic life, including the human body, is thus an energetic system based on a constant energy exchange between the chemical energy stored in the food and the electromagnetic energy stored as membrane potentials (gradients) across all biological membranes. In other words, our body is a very complex and fine-tuned electromagnetic system and not a biochemical system as present-day science wrongly assumes and exclusively describes. This is the greatest theoretical breakthrough in the history of bio-sciences that transforms them into a true biophysics based on the Universal Law and explains how the biological body is actually regulated. This includes the acceptance of higher dimensional operational systems beyond the electromagnetic spectrum and builds the scientific foundation and explanation of the Light Body Process (LBP) and how the human carbon-based body is transformed into crystalline light body in the course of the ascension process. Hence this message from the Elohim has a profound theoretical background rooted in the new Science of the Universal Law. In fact, we have published a few messages from the Elohim in the past that have announced similar powerful proton streams on this planet but the latest one is unique insofar as it is combined with the all-pervading Flame of Resurrection that has now triggered the long-awaited Reset of this 3D holographic model and its transfiguration to a higher dimensional multi-reality. As the End Time has always been described as the Time of Revelations , also known as Apocalypse in Greek as first mentioned in the Bible, we are very happy to announce the final stage of the End Time that will very soon lead to the final ID shift and our ascension. George The Elohim Message We are the Elohim and we greet you with the loving warmth of great love. There is a proton flow greeting all of humanity, and all of Gaia, coming from the Great Central Sun and moving through the space-time portal that is your Sun. This and every proton stream has a profound impact on each aspect of creation and it is no exception here within your third dimensional reality. Streams upon streams of charged consciousness flood space-time and this energy reaches all elements at the quantum level. This is an expanded consciousness, the conscious awareness of Creation itself. It is the time of the Revelations and this proton stream is the fuel for this sacred moment in time that is rightly called a re-set and that is the projected expansion of awareness proclaimed through the millenia. Bring forth now new confidence in the living intelligence of the Light! There was great all-pervasive golden light today (October 24th) – flooding, penetrating and balancing energetic systems that are founded in light principle – this was magnificent was it not? The golden light is the light of the resurrection. It moves to re-empower your body-mind-spirit system through the power chakra, the solar plexus and it does so at the quantum level. This is why you and many others felt extreme nausea this day and this is why the proton stream is the fuel for the reactivation action of the Resurrection of Life . Your reality is changing, one proton at a time. The proton is the conscious God particle, the God-energy if you prefer, that is needed to re-instill the divine blueprint in each and every expression. Restoration of the divine blueprint precedes balancing, and healing, in all life forms. This cherished moment is a gift for you to experience in full consciousness; the healing power of God’s light, the light of Creation, the light which is founded in eternal love. Remember, you are created from these elements and therefore your highest expressions and grandest achievements are founded in love. We are the Elohim and we love you for ever. Share:'"}, "time": 1742563563.3103728}