{"duration": 0.04561328887939453, "input_args": {"text": "'Caitlyn Jenner, formerly known as Bruce Jenner, has undergone successful sex reassignment surgery, according to a book of memoirs set to be released later this month. [According to excerpts published by Radar Online, the    Jenner went under the knife for a “final surgery” in January of this year, just over two years after coming out as transgender in a blockbuster interview with Diane Sawyer in 2015.  “The surgery was a success, and I feel not only wonderful but liberated,” Jenner reportedly writes in Secrets of My Life, a book of memoirs due out April 25. “I am telling you because I believe in candor,” Jenner reportedly writes in the book. “So all of you can stop staring. You want to know, so now you know. Which is why this is the first time, and the last time, I will ever speak of it. ” In April 2015, Jenner  —   who earned a gold medal in the decathlon at the 1976 Olympic games in Montreal  —   told Diane Sawyer in a   interview that he had always been confused about his gender identity. “I am a woman,” Jenner said at the time. “It’s not like I’ve been dressing up like a woman, it’s like I’ve spent my whole life dressing like a man. ” Following the reveal, Jenner appeared on the cover of Vanity Fair, was named Glamour magazine’s “Woman of the Year” and was awarded the Arthur Ashe Courage Award at the 2015 ESPY Awards. Jenner also starred in the reality series I Am Cait, which ran for two seasons on E!. In the upcoming memoir, Jenner reportedly writes that the decision to go under the knife was “complex,” but ultimately, “it’s just a penis. ” “I just want to have all the right parts,” Jenner reportedly writes. “I am also tired of tucking the damn thing in all the time. ” Jenner still appears regularly on the E! series Keeping Up with the Kardashians. Secrets of My Life is due out April 25.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563908.8708682}