{"duration": 0.10196614265441895, "input_args": {"text": "'\\n\\nWe have eight days until America meets her ultimate fate and this is what we are about to inherit as a leader.\\n \\nHillary’s Epitaph By hook, or crook, this is who we are about to elect into the White House. This is what she’s accomplished:\\nWhite Water Sitting on the Board of LaFarge when the first payments were given to fund ISIS The first failed version of Obamacare when she was first lady Vince Foster The Travelgate scandal when she was the First Lady Selling 20% of America’s uranium to the Russian (NY Times) TREASON Stealing $2 billion of Haitian relief money. Posting Ambassador Stevens travel plans prior to Benghazi ACCOMPLICE TO MURDER Benghazi The drug and money laundering of the Clinton Foundation Paying out 5% of the total proceeds of the Clinton Foundation to charity while pocketing the rest Using foreign money in Presidential campaign Pay for play- Perpetuating arms arms deals with nations that sponsor terrorism in exchange for payments to the Clinton Foundation Preparing to run to a country who has no extradition agreement with the United States in order to escape the justice that is coming her way (eg Qatar). The ongoing email scandal in which she obstructed justice by deleting 33,000 emails that were under investigation by Congress The ongoing email scandal in which she sent out emails with security designations as “ABOVE TOP SECRET” and she did so 22 times ESPIONAGE Refusing to step down and creating a constitutional crisis in a nation that is hopelessly divided already Hillary’s new administration will consist of the following goals and this is not even being kept secret.\\nEnacting the largest tax increase on Americans at $1.3 trillion dollars. The elimination of the family structure as we know it though increased power given to CPS’ around the country though Health and Human Services. Remember? It take a Village to Raise a Child? Or, was it the Village Idiot? The elimination of inheritance. The elimination of Christianity. The elimination of free speech and she has made this one abundantly clear with her comments toward the alt. media. The elimination of free speech. The creation of a borderless nation. Increasing the importation of possible terrorists with national security vetting. The elimination of the Second Amendment. A President who will never leave office until she dies. We are witnessing the possible installation of the modern day version of Stalin as the President of the United States.\\nI could go on and on, but fortunately, I still have a life that is worth living.\\nThe big question is this: Why aren’t Americans from every race, color and religion in the streets demanding an end to her candidacy?\\nI have written about this before, perhaps America is now ready to look at herself in the mirror.\\nThe following represents why America has not had enough of the criminality. The following 3 psychological principles have manifested in the form of a self-created prison that over half the country finds itself in.\\nThe CNN Effect-Group Think The world of psychological research provides the definitive answer as to whether we should fear our military in the coming storm ahead in the form of a phenomenon called group think . Group think is often described as a decision-making process whereby the group members go along with what they believe is the consensus. Group think has also been used to describe individual acquiescence to authority even when the authority has limited power to enforce compliance. Group think often causes groups to make hasty, irrational decisions, where individual doubts are set aside, for fear of upsetting the group’s leadership and balance.\\nThe Migram Experiment\\nThe controversial 1963 experiment, known as the Milgram Experiment demonstrated that with very minimal verbal pressure, and nothing else, approximately 65% of the population will put someone to death based upon the orders of a perceived authority figure. And this occurs when the authority figure, in the Milgram experiment was not allowed to apply any REAL threats. For a complete description of the Milgram Experiment, please click here .\\n\\nThe MSM tells America Trump cannot win, Hillary is good and Donald is bad. The political leaders, owned by the corporations who have been raping this country for 40 years tell us to vote for the criminal Clinton. And like good little sheep, we follow orders of the elite, just like the Nazis.\\n \\nIF the Media Tells the Lie Often Enough, the People Will Come to Believe It: Confirmation Bias “We’ll know our disinformation program is complete when everything the public believes is false.” \\nWilliam Casey, former CIA Director\\nConfirmation bias is the same in any tyrannical form of government.\\nThe social psychological term, confirmation bias, refers to the fact that the masses will believe even the biggest of lies, if they hear it often enough. Confirmation bias and group think work hand in hand to enslave Americans into believing in and accepting a self-destructive paradigm. Television MSM news has a filtering impact on the perception of reality . The psychological concept of confirmation bias means that when we hear a message often enough, we come to unquestionably accept the message as authentic and real. And the message is amazingly consistent because only six globalist corporate entities control over 95% of the media. \\nDonald Trump is racist! You have heard it before and you will keep hearing it until every nonwhite person in America believes that if he elected, America will see a race war.\\n\\n \\n \\nRacist and sexist, that’s Donald Trump and we hear this over and over and over and the unaware masses in this country come to believe as the real facts fade into the background.\\nTrump Cannot Win According to the Polls, Says the MSM and It Doesn’t Matter What You Do- Learned Helplessness \\nWhy won’t America stand up for herself? Why is the country, once a country which possessed courage and conviction, now sitting idly while allowing itself to be taken to the slaughter without so much as a whimper?\\nThe answer to the above question lies in the psychological concept known as “Learned Helplessness” as discovered by Martin Seligman in the 1960’s.\\n“Learned helplessness” occurs when an animal, or a person, is repeatedly subjected to an aversive stimulus that it cannot escape from. Eventually, the animal will stop trying to avoid the stimulus and behave as if it is utterly helpless to change the situation. Even when opportunities to escape are presented, this learned helplessness will prevent any action ”.\\n \\n\\n \\nPhase One \\nIn the first phase of the learned helplessness experiment, Seligman placed a dog on an electrical grid, shocked the dog and noted that the dog would demonstrate the ability to escape the aversive stimulus.\\nPhase Two \\nIn the second phase, the dog was barricaded on the grid and was unable to escape the painful shocks. Eventually the dog laid down and passively accepted the shock.\\nPhase Three \\nSeligman then removed the barricades and the dog could have easily escaped the shocks. However, the dog, conditioned by the prior set of events, simply laid down and accepted the shocks, without mounting any resistance whatsoever. This, in large part, is where America is at today.\\nTrump has removed the barrier (phase three) and America has a chance to redeem herself in the eyes of God. We have a chance to reclaim a measure of respectability from the criminal enterprise system that we presently under.\\nThe research shows us that one factor, and only one factor, can move the masses to action. When people see their loved ones in danger (ie cannot feed their children), they will act with purpose. This is the angle that the awake must use to awaken the sleeping sheep in this country. Do I think it is going to happen, I don’t think so. However, if we all get on our knees and pray to God for forgiveness and deliverance, we might be surprised at what happens.\\nThere are only 8 days to America’s Armageddon  \\n \\nP lease Donate to The Common Sense Show \\n \\nPLEASE SUBSCRIBE TO OUR YOUTUBE CHANNEL AND DON’T FORGET TO “LIKE” US \\n\\n \\n\\nThis is the absolute best in food storage. Dave Hodges is a satisfied customer. Don’t wait until it is too late. Click Here for more information.\\n \\n\\n\\nClick here for more information \\n \\nThe sane alternative to Facebook \\nSeen.Life-The Facebook alternative- no censorship, no spying– Sign up here \\n'"}, "time": 1742628453.6669583}