{"duration": 0.034195899963378906, "input_args": {"text": "'STD infection rates reach all-time high in the United States \\nThursday, October 27, 2016 by: Isabelle Z. Tags: STDs , infection rates , disease pandemics (NaturalNews) The news keeps getting worse for a nation that is already known for embracing unhealthy habits, as the CDC reveals that the U.S. saw more reported cases of sexually transmitted diseases (STDs) last year than in any year in the country\\'s history.According to the CDC\\'s annual report, the nation\\'s three most common STDs – gonorrhea, chlamydia and syphilis – rose between 2014 and 2015 to reach an all-time high.The number of primary and secondary syphilis cases that were reported increased by an alarming 19 percent, while gonorrhea rose by 12.8 percent and cases of chlamydia climbed by 5.9 percent. While all three of these diseases can be cured by antibiotics, the CDC says that most of these infections end up going undiagnosed and therefore untreated.More than 1.5 million new cases of chlamydia were reported last year, and two thirds of these were young people aged between 15 and 24. This disease can harm a woman\\'s reproductive system, and if left untreated, can adversely affect her fertility.Meanwhile, 395,216 new cases of gonorrhea were reported last year. This number might be lower than that of chlamydia, but this STD is particularly concerning, as it\\'s becoming increasingly difficult to treat. This summer, CDC scientists warned that the bacteria responsible for gonorrhea is developing resistance to the antibiotics that are normally used to treat it.Syphilis cases, which noted the biggest rise of the three main STDs, numbered 23,872 last year, with men who have sex with other men making up the majority of the new cases. Syphilis can have devastating effects, including blindness, stroke and stillbirth. There has also been a surge in newborns being born with syphilis after being infected by their mothers. Concerning lack of testing The director of the CDC\\'s Division of STD Prevention, Dr. Gail Bolan, expressed concern that Americans are simply not getting the preventive services that they need. She believes that every pregnant woman needs to be routinely tested for syphilis, and bisexual and gay men who are sexually active should also get annual tests.Dr. Jonathan Mermin, director of the CDC\\'s National Center for HIV/AIDS, Viral Hepatitis, STD and TB Prevention, pointed out that half of all STDs are occurring in young people under the age of 25. Part of the problem among young people could be the mistaken belief that the better HIV treatment that is now available means condoms aren\\'t necessary.While so-called \"hook-up apps\" have been shouldering a lot of blame for facilitating casual sex, experts believe that the surge in STDs is largely down to budget cuts to STD prevention and care programs at the local and state levels. More than half of such programs have been subjected to budget cuts in recent years, with a number of health departments closing STD clinics altogether.Dr. Bolan pointed out that more than 40 percent of health departments have reduced their clinic hours, screening and tracing of people who might have been infected with STDs. This means people could be living with STDs for a longer period, during which time they could potentially transmit them to even more people. These diseases all tend to have no obvious symptoms in their early stages, which means testing is vital to prevent their spread. The CDC reports that the economic burden this is causing the American healthcare system is almost $16 billion per year. Unhealthy habits destroying Americans\\' health This uptick in STD cases is very concerning in a nation that is already noting unprecedented obesity rates. All of these statistics show an increasing inclination toward risky behavior – whether it\\'s eating an unhealthy diet or having unprotected sex – without any regard for the potential health repercussions. It\\'s not just what Americans are doing that is so problematic; it\\'s also what they are not doing, like exercising and eating a diet rich in organic fruits and vegetables .America is quickly gaining a reputation for being one of the unhealthiest nations in the world, and the government looking the other way on GMO dangers and cutting funding for STD clinics is only going to create even more of a health crisis. Sources include:'"}, "time": 1742628553.209323}