{"duration": 0.049492597579956055, "input_args": {"text": "'  \\nRepublican nominee Donald J. Trump has been very vocal about his creepy sexual fetishization of his daughter Ivanka – and yet another deeply uncomfortable video has surfaced of him hitting on his daughter. \\nDuring a 2013 tapping of the “ Wendy Williams Show ,” Donald Trump and daughter Ivanka appeared together as guests. \\nWendy asked each to name what they have in common, during a reoccurring segment called “Fave Five.” While Ivanka safely and logically responded, “real estate” and “golf.” Trump, however, gave the game an incestual twist, replying “Sex.” \\nConsidering Donald J. Trump’s record at subjecting Ivanka to his perversion, this shouldn’t even be surprising, but it is absolutely disgusting. It is shocking and just plain gross. In 2006, Trump allowed Howard Stern the go-ahead to call Ivanka a “ piece of ass ,” and agreed with this assessment (no pun intended) of his daughter. \\nThat same year he went on “ The View ,” telling the ladies that he wouldn’t disparage he posing for “Playboy” and that if she wasn’t his daughter he would be dating her. In 2003, he appeared with buddy Howard Stern, bragging about how his daughter’s has the “ best body ,” saying: “You know who’s one of the great beauties of the world, according to everybody? And I helped create her. Ivanka. My daughter, Ivanka. She’s 6 feet tall, she’s got the best body. She made a lot money as a model—a tremendous amount.” \\nTrump’s lack of discretion when referring to Ivanka is very, very weird and further proves that Trump is only capable of putting the women he interacts with into two camps: those he would have sex with and those he wouldn’t. That Ivanka is his daughter does not change this. She is a woman he would have sex with, and nothing more. He pitifully can’t even name anything they have in common. All that comes to mind is, as admitted by him, is sex. \\nMaybe Republicans should spend their time investigating Trump possibly molesting members of his own family instead of trying to needlessly take down Clinton, before her term (inevitably) starts. \\nWatch it here:'"}, "time": 1742562807.0702817}