{"duration": 0.06690812110900879, "input_args": {"text": "'Hillary Clinton’un elektronik postaları ve cemaat yazan Thierry Meyssan FBI’nin Hillary Clinton’un özel elektronik postalarına yönelik yürüttüğü soruşturma, güvenlik kurallarının ihlaline değil ama Federal Devletin sunucularında arşivlendiği düşünülen yazışmalarının tüm izlerinden dikkatleri başka yöne çekmeyi hedefleyen bir komploya yönelik. Elektronik postaların bir bölümünün yasadışı finansmanlar ya da rüşvete ilişkin, bazılarının ise Clinton çiftinin Müslüman Kardeşler ve cihatçılarla bağlantılarına ilişki yazışmaları içermesi muhtemel.\\nVoltaire İletişim Ağı | Şam (Suriye) | 1. Kasım 2016 ελληνικά English Español français русский Deutsch Hillary Clinton ve Özel Kalem Müdiresi Huma Abedin. FBI’nin Hillary Clinton’un özel elektronik postalarına ilişkin soruşturmayı yeniden başlatması, güvenlik sorunlarına değil ama vatana ihanete kadar varabilecek entrikalara yönelik.\\nTeknik olarak, Dışişleri Bakanı, Federal Devletin güvenlikli bir sunucusunu kullanmak yerine, Federal Devlete ait bir makinede iz bırakmadan interneti kullanabilmek için evine özel bir sunucu yerleştirdi. Bayan Clinton’un özel teknisyeni, bu düzeneğin neden kurulduğunun anlaşılmasının önüne geçmek için FBI gelmeden sunucuyu temizlemişti.\\nFBI ilk olarak, özel sunucunun Dışişleri Bakanlığı sunucusunun güvenliğine sahip olmadığını gözlemledi. Dolayısıyla da Bayan Clinton sadece bir güvenlik ihlali yapmıştı. İkinci adım olarak FBI, eski Kongre üyesi Anthony Weiner’in bilgisayarına el koydu. Weiner, Hillary’nin Özel Kalem Müdiresi Huma Abedin’in eski eşi. Bilgisayarda Dışişleri Bakanı’ndan gönderilmiş elektronik postalar bulundu.\\nClinton’a çok yakın bir isim olan Anthony Weiner, New York Valisi heveslisi olmuş bir Yahudi siyasetçi. Çok püriten bir skandal sonrasında istifa etmek zorunda kaldı: eşi dışında bir başka genç kadına erotik SMS mesajları göndermişti. Bu sarsıntılı günler boyunca Huma Abedin ondan resmi olarak ayrıldı ama gerçekte onu terk etmedi.\\nHuma Abedin, Suudi Arabistan’da eğitim görmüş bir ABD vatandaşıdır. Babası, düzenli olarak Müslüman Kardeşlerin görüşlerini üreten akademik bir dergiyi –Huma’nın yıllar boyunca yazı işleri sekreterliğini yaptığı- yönetiyor. Annesi, cemaate üye Suudi kadınların derneğini yönetiyor ve Mısır Cumhurbaşkanı Muhammet Mursi’nin eşiyle birlikte çalışıyordu. Kardeşi Hasan, Müslüman Kardeşlerin vaizi ve El-Cezire’nin manevi danışmanı Şeyh Yusuf el-Karadavi’nin hesabına çalışmaktadır.\\nDışişleri Bakanı, Suudi Arabistan’a yaptığı resmi bir ziyaret dolayısıyla, cemaat üyesi kadınlar derneği başkanı Saliha Abedin ile birlikte (özel kalem müdiresinin annesi) Dar el-Hekma Kolejini ziyaret ediyor. Huma Abedin bugün, Clinton’un seçim kampanyasında, kampanya müdürü Bill Clinton’un başkanlık döneminde Beyaz Saray’ın eski genel sekreteri John Podesta’nın yanında, merkezi önemi olan bir kişilik. Podesta öte yandan 200 000 dolarlık mütevazı aylığıyla Suudi Arabistan Krallığının Kongredeki yetkili lobicisidir. 12 Haziran 2016’da, Ürdün’ün resmi haber ajansı Petra, Arabistan’ın veliaht prensi Muhammet bin Salman’ın, bir kadın olmasına rağmen Hillary Clinton’un seçim kampanyasının %20’sini yasadışı olarak finanse eden ailesinin modernliğini vurgulayan bir röportajını yayınladı. Yayının ertesi günü, ajans bu haberi iptal etmiş ve internet sitesinin bilgisayar korsanlarının saldırısına uğradığını iddia etmişti.\\nÜrdün’ün resmi haber ajansı Petra’nın 12 Haziran 2016 tarihli yayınına göre, Suudi Kraliyet ailesi, Hillary Clinton’un başkanlık kampanyasının %20’sini yasadışı olarak finanse etti. Bayan Abedin, Obama yönetiminin Müslüman Kardeşler cemaatiyle bağlantılı olan tek üyesi değil. Başkanın üvey kardeşi Abon’go Malik Obama, Müslüman Kardeşlerin Sudan’da misyoner işleri veznedarı ve Barack H. Obama Vakfının Başkanıdır. Doğrudan Sudan Devlet Başkanı Ömer el-Beşir’in emri altındadır. Bir başka Müslüman Kardeş, ABD’nin en büyük uygulama makamı olan Ulusal Güvenlik Konseyi üyesidir. Bu durum 2009 ile 2012 yılları arasında, Mehdi K. Elhassani için geçerliydi. Yerine kimin geçtiğini bilmiyoruz ama kanıt ortaya çıkıncaya kadar, Beyaz Saray bir Müslüman Kardeşler üyesinin Konsey üyesi olduğunu inkar ediyordu. Yine aynı şekilde İslam Konferansı nezdinde ABD Büyükelçisi olan Raşit Hüseyin de bir Müslüman Kardeşler üyesidir. Kimlikleri belirlenen diğer cemaat üyeleri daha az önemde mevkileri işgal etmektedir. Bu arada, halen Suriye Ulusal Koalisyonu üyesi ve Pentagon’un eski danışmanı Luay M. Safi’yi de saymamız gerekir.\\nBaşkan Obama ve üvey kardeşi Abon’go Malik oval ofiste. Abon’go Malik Sudan’da Müslüman Kardeşlerin Misyoner işlerinin veznedarıdır. Nisan 2009’da, Kahire konuşmasından iki ay önce, Başkan Obama oval ofiste bir Müslüman Kardeşler cemaati heyetiyle gizlice görüşmüştü. Daha önce de, görevi yeni devraldığı günlerde, ABD Müslüman Kardeşleri Derneğinin Başkanı İngrid Mattson’u da davet etmişti.\\nÖte yandan Clinton Vakfı, « İklim » projesinin sorumlusu olarak, o ana kadar Kuranla ilgili yayın yapan bir televizyon programının sorumluluğunu üstlenen, Cemaatin küresel yöneticilerinden Cihat el-Haddad’ı kullandı. Babası, 1951 yılında CİA ve Mİ6 tarafından yeniden kuruluşu sırasında Cemaatin kurucu ortaklarından biri olmuştu. Cihat, Kahire’de aday Muhammet Mursi’nin, ardından da Müslüman Kardeşler’in küresel ölçekte sözcülüğü görevini üstlendiği tarih olan 2012’de vakıftan ayrıldı.\\nDünyadaki cihatçı önderlerin tamamı ya Cemaatten ya da Sufi Nakşibendi tarikatından –Suudilerin Arap milliyetçiliği karşıtı örgütü Dünya İslam Birliği’nin iki bileşeni- geldiklerini bilerek, Bayan Clinton’un Suudi Arabistan ve Müslüman Kardeşler ile ilişkilerine dair daha çok şey bilmek istiyoruz.\\nRakibi Donald Trump’ın ekibinde, Halifeliğin Beyaz Saray eliyle kurulmasına muhalefet eden ve kınanmasının önüne geçmek için Defense Intelligence Agency (Askeri İstihbarat Ajansı)’den istifa eden General Michael T. Flynn de yer alıyor. Federal Devlet içerisindeki Müslüman Kardeşlerin varlığını ihbar ettiği için « komploculukla » suçlanan, tarihi bir « soğuk savaşçı » Frank Gaffney’le çok yakın ilişki içerisinde.\\nPek doğaldır ki FBI’in bakış açısıyla, CİA’nin politikası ne olursa olsun, cihatçı örgütlere verilen her türlü destek suçtur. 1991 yılında, polisler –ve senatör John Kerry- CİA’nin Latin esrar kartelleriyle olduğu kadar Müslüman Kardeşlerle yaptığı her türlü gizli operasyonlarda kullandığı Pakistanlı (her ne kadar Kayman Adalarında kayıtlı olsa da) BCCI Bankasının iflasına neden olmuştu.\\nThierry Meyssan Çeviri\\nOsman Soysal'"}, "time": 1742628474.852227}