{"duration": 0.11151957511901855, "input_args": {"text": "'in: Preparedness\\\\Survival , US News Darned if we do and darned if we don’t. That basically sums up the current election cycle. I’d go so far as to say that everybody loses during this election, especially if the promised chaos erupts when the winner is announced. Regardless of which candidate “wins” the presidential election, I have a bad feeling about the aftermath. I think we could be on the cusp of the most widespread civil unrest since the Civil War. If you are interested in getting prepared for it but don’t want to read over all of the frightening possibilities, go here and sign up for a Prepping Crash Course that will help you be ready for impending chaos in a mere 24 hours. For those who are wondering how things might go down, let’s look at some scenarios. If Trump wins… There is so much anti-Trump wrath among Progressives that violence has already erupted at campaign rallies. Trump supporters had eggs and bottles thrown at them in San Jose , a police car was smashed and nearly 20 were arrested at a violent protest in Orange County, and a man was even arrested for trying to grab a police officer’s gun to assassinate Trump . And look at what Clintonites did to this homeless woman who was trying to protect Donald Trump’s star from being further defaced on the Hollywood Walk of Fame. YouTube Notice how many of these mob-minded cowards it took to terrorise one homeless woman…Classy, right? Now, think about how these people will react if Trump is somehow elected. If you have a sign in your yard, you will be a target for their rage. Got a Trump/Pence sticker on your car? Expect that it could be defaced. Even more recently, Penn State students were “triggered” by a pro-Trump rally and began tearing down signs, swearing at the pro-Trump kids, and disrupting their event. What’s more, it isn’t just Social Justice Warriors and Progressives folks would need to worry about. A top activist in the group, Black Lives Matter, took to Twitter to inform everyone exactly what would happen if Trump were to win the presidency. This was deleted but is archived here . The tweet was followed by this one, which is still u p… Don’t delude yourself. With a Trump victory, trouble is coming. And don’t think living in a small town keeps you safe. The population of Ferguson, Missouri is barely over 20,000 people – hardly a metropolis. If Clinton wins… With the newly intensified investigation into her corruptio n, it hardly seems possible that she could still win this election, but her supporters seem blind to the crimes she has committed. Instead of looking at the facts, they’re saying “First woman president YA !!!” With all of the collusion , it seems like the FBI is fighting a tough battle to see her indicted. There once was a day that this suspicion would be enough to keep the American people from voting for a person who is blatantly in it for she can personally gain. The Wikileaks email scandal continues, with new revelations about our government leading to possible criminal proceedings, impeachment and heaven only knows what else. As well, there’s a very, very good chance that the election will be rigged . Somehow, despite all that is going on, Clinton’s campaign is still planning her celebratory fireworks party , scheduled to start several hours before all the votes could even be counted. If this happens, Trump supporters will be enraged – and justifiably so. Joe Walsh, a former congressman, has already tweeted he’s “grabbing his musket.” And Walsh is not alone. Many Americans are sick and tired of the blatant, in-our-faces corruption. There is talk of revolution and even a quiet counter-coup going on behind the scenes. Others concur that unrest is coming. I’m not the only blogger out here in Bloggerland who thinks all hell will break loose regardless of who becomes presidents. Mike Adams of Natural News wrote , “My ANALYSIS of possible outcomes from the upcoming presidential election reveals that America only has a 5% chance of remaining peaceful after November 8. This does not mean the violence will occur on November 9th, but rather that events will be set into motion on that day which will lead to an escalation of violence (95% chance…) Check out his predictions of the possible scenarios . And from the more liberal side of the unrest coin, an essayist for Cracked.com still comes to a similar conclusion. “Over the last few weeks a growing number of people have started wondering, “Is it possible the United States is heading for a new civil war?”…Every time I wanted to dismiss those headlines I thought about my visit to Ukraine last year, to cover their ongoing civil war . The most common sentence I heard was, “It’s like a bad dream.” Up to the minute the shooting started, almost no one thought civil war was a serious possibility.” You need to get prepped. Immediately. What it all boils down to is that we need to be prepared. We need to be ready for any unrest that comes about as a direct result of the election – and I really believe that there will be some form of uprising against the result. I hope it will be nothing more than a few minor, isolated incidents, but I can’t get past the niggling feeling that all hell is just about to break loose. November 7 could be the last day of normalcy for quite some time. The governments of Germany and the Czech Republic have told their citizens to stock up on food, water and basic survival supplies in case of a national emergency. We need to be doing the same. If you would like to take a class to help you prepare for this, you can learn more here. If you don’t want to invest in a class, use this FREE handy checklist to make sure you’ll have everything you need. Post-Election Chaos Checklist Make sure everything is in order. While it’s unlikely that services like internet, electricity, and municipal water will be affected, it doesn’t hurt to be ready for that possibility. The key here is to make certain you don’t have to leave your home for the duration of the unrest, should it come your way. Check your pantry and fill any gaps in your food preps. Order emergency food buckets – if you order right away there is still time to get them before the election.'"}, "time": 1742564190.8683097}