{"duration": 0.03825116157531738, "input_args": {"text": "'LONDON  —   There are no longer any golf clubs on the British Open rotation that do not allow female members. Members of Royal Troon Golf Club voted overwhelmingly on Friday to end the club’s   membership policy, paving the way for the club to remain an Open site. “I think this means that Royal Troon Golf Club is reflecting the society in which we exist in the 21st century,” said Martin Cheyne, the club’s captain and top official, in a telephone interview from Troon on Friday night. “We are not insular, and I’m proud to say that we have made this decision. ” Royal Troon, which will host the British Open from July 14 to 17, was the only club in the tournament’s rotation that still did not allow female members. In a statement, the RA, which organizes the British Open, expressed strong support for the change: “We welcome the decision by Royal Troon Golf Club to admit women as members and look forward to the 145th Open and many great championships to come. ” Muirfield, the site of 16 British Opens, was stripped of the right to stage the event in the future after a vote by members of the Honourable Company of Edinburgh Golfers, which owns and operates the club, on allowing female members fell just short of the   majority required to pass.   percent of the club’s members voted in favor of admitting women. Royal Troon’s constitution required only a simple majority. The club did not release a vote total, in part because it did not take a precise count, Cheyne said. “Our custom and practice in the golf club is a straight show of hands,” he said. “We don’t do a count. It was overwhelming. ” Royal Troon’s constitution mandates that only members who are present may take part in such votes, and Cheyne said 360 of the club’s 861 members had been in attendance on Friday night. Royal Troon, which is on the west coast of Scotland, has hosted the British Open on eight previous occasions, most recently in 2004. But Cheyne said the club had reviewed more than the issue of women’s membership in recent months. “The focus was on all categories of membership and how we could become more involved in promoting golf, a sport which is currently declining: declining in male, female and junior membership,” he said. “What we did tonight was focus on the single issue of women’s members, but we need to focus on how we can encourage young people to play this game. ” In 2014, the Royal and Ancient Golf Club of St. Andrews voted to end its   membership policy, which had been in place for 260 years. In 2015, another Open venue  —   Royal St. George’s Golf Club in Kent, England  —   also voted to allow female members. And on Monday, the Honourable Company of Edinburgh Golfers announced that it had called a special meeting to seek approval to organize a second vote later this year on Muirfield’s   membership policy It was unclear when Royal Troon would welcome its first female member. “I think what will happen is that when applications come in, they will be treated the same way as men,” Cheyne said. “There will be no   women as members. Equality does mean equality. ” That is in part because Royal Troon already has an affiliated women’s club: Ladies Golf Club, Troon. Its clubhouse is a short walk from Royal Troon’s clubhouse, and the two clubs will work together to stage the British Open. “We were a mixed club until the 1890s, when the ladies elected to leave and build their own clubhouse,” Cheyne said. “We have had a very harmonious relationship for 138 years, and the ladies have always been able to come play the Old Course free of charge any day of the week and enjoy our clubhouse. ” Some members of the women’s club had expressed a desire to maintain the status quo, along with concern about the potential cost of applying for membership in Royal Troon. But the vote to admit women had been expected, with the prestige and economic benefits of hosting the Open at stake. “The importance of being in the international world of golf was recognized by the members,” Cheyne said.'"}, "time": 1742628455.7702007}