{"duration": 0.037097930908203125, "input_args": {"text": "'Comedian Rosie O’Donnell made a surprise appearance at Saturday night’s GLAAD Media Awards in New York City, where she jokingly “texted” President Donald Trump with a defiant, profane message on behalf of the LGBT community. [While honoring Tony   actor Billy Porter with the evening’s Vitto Russo Award on behalf of his LGBT advocacy, O’Donnell, who was not previously announced as a presenter at the event, pulled out a cell phone and  “texted” Trump, according to Variety.  “F*ck you. Donald. From, the gays,” O’Donnell said. “Sent. ” The 28th annual GLAAD Media Awards at the New York Hilton Midtown in Manhattan honored individuals and media properties that best represented acceptance and inclusivity of the LGBT community over the past year. The night’s big honorees included Porter, Daily Show host Trevor Noah, and actress Debra Messing, who was honored with the organization’s Excellence in Media award. O’Donnell also pledged $100, 000 to fight   legislation at the event, according to a GLAAD press release. The actress and comedian has feuded with Trump for years. The award show’s host, television personality Ross Matthews, also took aim at Trump during the event. “We have big stars here tonight. We have more stars than a Trump inauguration,” Mathews said, according to Variety. “To be fair, my Yelp review of the Burger King in Times Square has more stars than Trump’s inauguration. ” Matthews also reportedly noted that the ballroom in which the awards show was being held was the same one used by Trump to deliver his victory speech after winning the presidential election in November. “Since this is the room where Trump won, we’re going to sage the room,” he joked, pulling a stick of incense and a lighter from his pocket. But Matthews and O’Donnell weren’t the only two stars to slam the president during the show. Will and Grace star Messing criticized Ivanka Trump, the president’s daughter, while accepting the Excellence in Media award. “It’s not enough to simply say that women’s issues are important to you. It’s time to do something. You can change the lives of millions of women and children just by telling your dad stories about real people who are suffering,” Messing addressed Trump’s eldest daughter.  “Please stop blindly defending your father and start defending what you say you believe in,” the actress added. Other big winners on the night included MSNBC’s Rachel Maddow (Outstanding TV Journalism Segment, “Gay Community in U. S. ‘Forged in Fire’”) Tegan  Sara (Outstanding Music Artist) Teen Vogue (Outstanding Magazine Overall Coverage) and the Oxygen network program Strut (Outstanding Reality Program). View the full list of winners from GLAAD’s Media Awards here.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628400.0208583}