{"duration": 0.06727433204650879, "input_args": {"text": "'Washington D.C. Insider Says Obama Might Disclose UFO Truth Before January 2017 Nov 18, 2016 6 0 \\nSteven Basset is the only registered UFO disclosure lobbyist in Washington D.C. and just yesterday, he made a public announcement that is very timely indeed. Steven runs the Paradigm Research Group , which lobbies for the official political announcement disclosing the truth about the UFO/extraterrestrial phenomenon that the U.S. government has been covering up for decades. Steven Basset has pushed for disclosure for over 20 years in Washington D.C. \\nIn a press release from November 17th, 2016, Basset said the Paradigm Research Group was contacted by a source within the military/intelligence community and that the basis of the message was that the “persons who are directly involved in the management of the extraterrestrial issues want Disclosure to take place under President Obama and are ready to work with the Secretary of Defense if approached.” \\nBasset goes on to explain that the Paradigm Research Group has publicly stated before that the Clinton team has had an agenda to disclose to the world the existence of extraterrestrial beings if she became president. Since she lost the presidential race, that is no longer an option, but instead, may force the issue to happen quicker and while Barack Obama is still president: \\n“The Clintons now have a choice to make of historic proportions. Should they immediately take interviews with top journalists and discuss in greater detail what they know about the ET issue and what transpired during the Rockefeller Initiative from 1993-1996 , the resulting media storm will force the Pentagon and the White House to reach the necessary understanding allowing Barack Obama to be the Disclosure president. Or should they remain silent and allow the truth embargo to continue on into the next administration.” When will the truth be announced? \\nWhile the amount of information and steps needed for the Secretary of Defense to brief the White House is immense, Steven says the pressure is building quickly for Obama to be the one to make the historic announcement: \\nIn order for the Secretary of Defense to approach the White House regarding Disclosure, he must reach down into the military/intelligence complex for the needed information to proceed. Although the managers of the ET issues are constrained by the highest level of classification, Paradigm Research Group is convinced they are ready to provide that information because there is a growing internal consensus Disclosure must take place under President Obama. \\nThis process is time sensitive. Disclosure would need to happen early enough for the nation [and world] to absorb such extraordinary information and settle down prior to the inauguration. There would also be time to prepare various government agencies for the engagement of the media and the public going forward. Then the new president would be stepping into a relatively stable and organized post-Disclosure status. \\nWith this in mind, Paradigm Research Group would assert Disclosure after January 6th, 2017 would not be a responsible option. The means the Clintons have a choice to make and a few weeks to reach a decision.” \\nWhile some may still be skeptics of the notion that there are other beings in our universe, we must keep in mind the number of insiders who have revealed what they know as well as the positions they’ve held to acquire such knowledge. As we reported earlier today , full UFO disclosure is inevitable. With former NASA astronauts, physicists, scientists, engineers and high ranking military personnel blowing the whistle for several decades now, we see that the world is getting closer to learning the truth. \\nWith respect to this announcement from Paradigm Research Group just yesterday, we must keep a couple things in mind. First, in the grand scheme of the disclosure process, it is not crucially important if this announcement takes place under Obama before Trump’s inauguration in late January of 2017. If such an announcement is not made before then, we mustn’t believe the push for disclosure is or has been a failure. We must keep in mind the bigger picture and specifically the words from the press release, “there is a growing internal consensus Disclosure must take place…” That is what is important. It’s the fact that there is such momentum and pressure building within the political and military/intelligence community for this announcement to be made public. \\nWhat are your thoughts about this latest announcement? Will Obama be the disclosing president? Or will Trump? Or will some other world leader make the announcement? When do you think it will happen? \\nLance Schuttler graduated from the University of Iowa with a degree in Health Science and does health coaching through his website Orgonlight Health . You can follow the Orgonlight Health facebook page or visit the website for more information and other inspiring articles.'"}, "time": 1742628338.535001}