{"duration": 0.10483860969543457, "input_args": {"text": "'CALÇOENE, Brazil  —   As the foreman for a cattle ranch in the far reaches of the Brazilian Amazon, Lailson Camelo da Silva was razing trees to convert rain forest into pasture when he stumbled across a bizarre arrangement of towering granite blocks. “I had no idea that I was discovering the Amazon’s own Stonehenge,” said Mr. da Silva, 65, on a scorching October day as he gazed at the archaeological site located just north of the Equator. “It makes me wonder: What other secrets about our past are still hidden in Brazil’s jungles?” After conducting radiocarbon testing and carrying out measurements during the winter solstice, scholars in the field of archaeoastronomy determined that an indigenous culture arranged the megaliths into an astronomical observatory about 1, 000 years ago, or five centuries before the European conquest of the Americas began. Their findings, along with other archaeological discoveries in Brazil in recent years  —   including giant land carvings, remains of fortified settlements and even complex road networks  —   are upending earlier views of archaeologists who argued that the Amazon had been relatively untouched by humans except for small, nomadic tribes. Instead, some scholars now assert that the world’s largest tropical rain forest was far less “Edenic” than previously imagined, and that the Amazon supported a population of as many as 10 million people before the epidemics and   slaughter put into motion by European colonizers. In what is now the sparsely populated state of Amapá in northern Brazil, the sun stones found by Mr. da Silva near a stream called the Rego Grande are yielding clues about how indigenous peoples in the Amazon may have been far more sophisticated than assumed by archaeologists in the 20th century. “We’re starting to piece together the puzzle of the Amazon Basin’s human history, and what we’re finding in Amapá is absolutely fascinating,” said Mariana Cabral, an archaeologist at the Federal University of Minas Gerais, who together with her husband, João Saldanha, also an archaeologist, has studied the Rego Grande site for the last decade. Back in the late 19th century, the Swiss zoologist Emílio Goeldi had spotted megaliths  —   large monumental stones  —   on an expedition through Brazil’s frontier with French Guiana. Other scholars, including the pioneering American archaeologist Betty Meggers, also came across such sites, but argued that the Amazon was inhospitable to complex human settlements. It was not until Mr. da Silva, the former ranch foreman, came across the stones at Rego Grande while deforesting surrounding jungle in the 1990s that scholars focused greater attention on the findings. Mr. da Silva said he first stumbled on the site while hunting wild boar as a teenager in the 1960s, but had subsequently avoided the area. “The place initially felt sacred, like we didn’t belong here,” said Mr. da Silva, who now guards the Rego Grande site as its custodian. “But it was impossible to miss it during the deforestation drive of the ’90s, when the priority was to burn down trees. ” About 10 years ago, after securing public funds to cordon off the stones, Brazilian archaeologists led by Ms. Cabral and Mr. Saldanha began excavating the site, which is shaped roughly like a circle. They soon identified a portion of a river about two miles away where the granite blocks may have been quarried. They also found ceramic burial urns, suggesting that at least part of the Rego Grande site may have been a cemetery, while colleagues from Amapá’s Institute of Scientific and Technological Research discovered that one of the tall stones seemed to be aligned with the sun’s path during the winter solstice. After identifying other points in the site where stones could be associated with the sun’s movement on the solstice, the researchers began piecing together a theory that Rego Grande could have served various ceremonial and astronomical functions connected to agricultural or hunting cycles. Ms. Cabral said that Rego Grande and a series of other less elaborate megalithic sites found in Amapá may have also served as markers for hunters or fishermen on a landscape that was being transformed by Amazonian peoples a millennium ago. Still, other scholars say that more information may be needed about Rego Grande to lift it into the realm of prehistoric places clearly conceived for astronomical observations. “We’ve seen a lot of similar claims, but it takes more than a circle of standing stones to get to a Stonehenge,” said Jarita Holbrook, a scholar of physics and cultural astronomy at the University of the Western Cape in South Africa, citing the need for more findings about Rego Grande’s characteristics and how the site was used by the people who built it. For now, Rego Grande, which local people already call the Amazonian Stonehenge, remains enigmatic. Pottery shards jut through the soil as if offering tantalizing clues around the place, which has the feel of a contemporary conceptual art piece. Researchers are still trying to determine how Rego Grande fits into the evolving views on the Amazon’s human history. Representatives of the Palikur, an indigenous people living in Amapá and French Guiana, have recently stepped forward to say that their ancestors had frequented Rego Grande. Still, archaeologists express caution about establishing such links, emphasizing how much can change in human societies over the span of a thousand years. Ms. Cabral, the archaeologist who has spent years studying Rego Grande, said that evidence of large settlements remains elusive, in contrast with other sites in the Amazon like Kuhikugu, at the headwaters of the Xingu River, where researchers have drawn parallels to the legends surrounding the mythical Lost City of Z, long an irresistible lure for explorers and adventurers. Either way, John McKim Malville, a solar physicist at the University of Colorado who writes extensively on archaeoastronomy, emphasized how the field is moving away from focusing exclusively on astronomical functions to interpretations that are more holistic, by including the ceremonies and rituals of ancient cultures. In that sense, the site in Calçoene offers a beguiling if cryptic glimpse into Amazonia’s past. “The stones of Rego Grande are quite extraordinary and in their irregularity may have their own unique meaning, different from other megalithic sites around the world,” Mr. Malville said, raising the possibility that Rego Grande reflects the importance in Amazonian cultures of animism, the attribution of a soul to entities in nature and even inanimate objects. He added, “We can only speculate what its stones mean. ”'"}, "time": 1742564338.3279579}