{"duration": 0.1510334014892578, "input_args": {"text": "'For Hillary Clinton, Britain’s emotionally charged uprising against the European Union is the sort of populist victory over establishment politics that she fears in the coming presidential election. Mrs. Clinton shares more with the defeated “Remain” campaign than a similar slogan  —   her “Stronger Together” echoing its “Stronger In. ” Her fundamental argument, much akin to Prime Minister David Cameron’s against British withdrawal from the European Union, is that Americans should value stability and incremental change over the risks entailed in radical change and the possibility of chaos if Donald J. Trump wins the presidency. She offers reasonableness instead of resentment, urging voters to see the big picture and promising to manage economic and immigration upheaval, just as Mr. Cameron did. She, too, is a pragmatic internationalist battling against nationalist anger, cautioning that the turmoil after the   Brexit vote underscores a need for “calm, steady, experienced leadership in the White House. ” But prudence is cold comfort to people fed up with    . According to their friends and advisers, Mrs. Clinton and former President Bill Clinton have worried for months that she was out of sync with the mood of the electorate, and that her politically safe messages  —   like “I’m a progressive who gets results”  —   were far less compelling to frustrated voters than the “political revolution” of Senator Bernie Sanders or Mr. Trump’s   promise to “Make America Great Again. ” Mr. Sanders and Mr. Trump won a combined 25 million votes during the primary season, compared with 16 million for Mrs. Clinton. And while many of Mr. Sanders’s supporters are expected to support her in November, she has not recalibrated her message to try to tap into the anger that he and Mr. Trump channeled. Nor does Mrs. Clinton have any plans, advisers say, to take cues from the Brexit campaign and start   her support for globalized markets, or denouncing porous borders, illegal immigrants and the lack of job protections in   agreements. Much distinguishes the presidential contest from the British fight, of course, including a    matchup between   candidates, a sharply different economic context, and a long and proud history of immigration. Yet in addition to worrying that she is out of step, Mrs. Clinton is somewhat hemmed in by her record: She supported her husband’s North American Free Trade Agreement, which caused significant economic pain in the industrial Midwest after it went into effect in 1994. And her nuanced views about free trade are a harder sell to many voters than Mr. Trump’s   vows to trash bad trade deals and use tariffs as economic weapons of national defense. While Mrs. Clinton is counting on Mr. Trump’s history of racist and sexist remarks to doom his candidacy, Thursday’s Brexit referendum was an unnerving reminder that voter anger is deeper and broader than many elite politicians and veteran pollsters realize. In swing states like Ohio, many Democrats and Republicans yearn for an economic comeback and are not confident that Mrs. Clinton understands their frustrations or has the ideas and wherewithal to deliver the sort of change that could satisfy them. “Brexit is clearly a cautionary tale for the Clinton campaign not to get too complacent with a potential victory,” said David B. Cohen, a professor of political science at the University of Akron. “Trump, Sanders and those in Great Britain who ran the Leave campaign are tapping into an anger and anxiety that is clearly festering.   folks in the United States are similar to   folks in Europe. And a lot of those   people feel as if the international economic system is not working for them and strangling the middle class. ” Mike DuHaime, a Republican strategist, said the British vote was the clearest sign yet that “the intensity against the status quo is far more real than many are still willing to acknowledge. ” “If the Trump victory in the primary wasn’t enough of one, the Brexit vote serves as a major   call indicating just how frustrated average voters are with those in power,” Mr. DuHaime said. Several Democrats cautioned against drawing too many lessons from the Brexit vote, saying mass immigration and economic malaise were bigger problems in Britain and the European Union than in the United States. They also said many British voters were revolting against a bureaucracy in Brussels that they regarded as bloated, overpaid and prone to interfering in the affairs of sovereign countries. Yet the Democrats acknowledged that the worldview held by Mrs. Clinton and many of the party’s elites was not as attractive to many voters as it once was. “Liberal internationalism seems to have been dying for a while,” said Mark S. Mellman, a Democratic pollster who is not involved with the Clinton campaign. “But while that may be the animating philosophy of foreign policy intellectuals the world over, it is not the animating philosophy of America, nor of our domestic politics. ” For Sean Harrington, a husband and father of three who owns the Town Pump Tavern in downtown Detroit, the support for   deals and international markets cannot die fast enough. Taking a break from his bookkeeping duties on Friday, he said President Clinton’s economic policies were still “ruining the economy” by giving benefits to large corporations that move jobs overseas, while in states like Michigan, “the average work force loses. ” “If my fellow Americans were doing better, there would be more money around and traded in and out of my pockets,” said Mr. Harrington, a registered independent who is undecided between Mrs. Clinton and Mr. Trump. On the campaign trail, Mrs. Clinton regularly pledges to “make sure our economy works for everyone, not just those at the top,” as she put it on Wednesday in Raleigh, N. C. where she also promised to reject “bad trade deals and unfair trade practices. ” She also argued in favor of Britain’s remaining in the European Union. But she was not surprised that the “Leave” campaign won, her advisers said Friday, because she understands the extent of voter anger. Her advisers said they were confident the referendum in Britain did not mirror the presidential election in the United States. “These are two different countries, with very different circumstances and demographics, facing different choices,” said Jennifer Palmieri, Mrs. Clinton’s communications director. “We believe American voters are looking for concrete solutions to address their economic frustrations and unlikely to find the turmoil, economic uncertainty and roiling of markets caused by the Brexit vote particularly appealing. ” Frank Luntz, a Republican expert on political messaging, said Mr. Cameron and the “Remain” camp had failed to “personalize, individualize or humanize their campaign. ” The “Stronger Together” slogan shared by the “Remain” campaign and Mrs. Clinton feels bloodless and overly intellectual compared with the more emotional,   appeals of Mr. Trump and the “Leave” movement, he said. “The problem with the concept of ‘together’ is that it promotes groupthink rather than individual pursuits,” Mr. Luntz said. “We are in an age of individual action, not collective responsibility. ” Mrs. Clinton’s arguments against Mr. Trump often require a great deal of explanation to voters, which can sometimes turn them off. While Mr. Trump thrills his audiences with big promises  —   without saying much about how he would fulfill them  —   Mrs. Clinton can get caught in the gears of policy. One recent exception was a foreign policy speech in early June, when she hit a rhythm and ripped into Mr. Trump with memorable lines like “He says he has foreign policy experience because he ran the Miss Universe pageant in Russia. ” But when Mrs. Clinton takes pains to explain why Mr. Trump’s promises and policies do not add up, or are too risky, she runs a risk of her own: that she will sound as though she is instructing or talking down to her audience. Not many voters want a lecturer as president. “A slogan and a message must be aspirational  —   either give people hope things will get better or that the bad stuff will stop  —   both,” said Ruth Sherman, a political communications analyst who is not affiliated with any campaign. Referring to one of Mrs. Clinton’s taglines, she said: “Hillary’s ‘I’m with her’  —   I remember thinking when I first saw it, ‘Really?’ It’s not my job to be with her. She should be with me. ” If Mr. Trump’s “Make America Great Again” is resonant  —   “by far the best slogan of all the candidates,” Ms. Sherman said  —   Mrs. Clinton is counting on voters to appreciate policy ideas that are more strategic than  . She argued in Raleigh, for instance, that markets like the European Union “work best when all the stakeholders share in the benefits. ” While that statement was hardly in the aspirational vein that Ms. Sherman recommends, it set a clear goal and was less divisive than Mr. Trump’s comments on the British referendum. The American electorate has tilted this year toward presidential candidates who make them feel as much as think, but Mrs. Clinton and her allies hope that voters will reflect on the vote in Britain and opt for the steadiness and predictability that she promises. “I don’t think the average American who has a retirement account right now is thrilled about Donald Trump’s support of Brexit,” said Thomas R. Nides, who was a deputy secretary of state under Mrs. Clinton. “Hillary Clinton understands we always need to change  —   but change that doesn’t cause unintended consequences for the average American. ”'"}, "time": 1742563395.9591134}