{"duration": 0.09674715995788574, "input_args": {"text": "'Written by Melkulangara Bhadrakumar   The Russian President Vladimir Putin made the long-expected phone call to the US president-elect Donald Trump on Monday. It stands to reason that the presidential spokesman in the Kremlin, Dmitry Peskov, one of Putin’s closest aides, travelled to New York last week ostensibly to attend a world chess event, but principally to prepare the ground for the phone conversation on Monday. The agenda of such Russian-American conversations is usually agreed upon beforehand. The Kremlin readout (and the brief statement by Trump’s transition team in New York) gave a positive account of the phone conversation. From available details, it was a substantive conversation, which focused on reviving the Russian-American relationship, and, most important, also took up the Syrian conflict in some detail, including “issues related to solving the crisis”. So, what emerges is that Putin and Trump have begun discussing Syria in their very first conversation as statesmen, hardly 6 days after the latter got elected, even before his key cabinet posts have been filled, and with 8 weeks still to go to before the new presidency commences. Clearly, Syria is right on top of Trump’s mind – and the need to engage with Russia. Again, Trump had touched on Syria during his weekend interview with Wall Street Journal (when he made it clear that the US should dump Syrian rebels.) Quite obviously, Monday’s phone conversation underscored that Trump was not at all fanciful or a maverick when he repeatedly stuck out his neck on the campaign trail and took much flak, including wild allegations of him being a Russian poodle, when he kept insisting on the imperative need of constructively dealing with Putin, as a collaborator rather than as adversary. As could have been expected, Putin said to Trump that Moscow is ready “to develop a dialogue of partnership” with the US based on the “principles of equality, mutual respect and non-interference in each other’s domestic affairs” – in short, a principled relationship that could be the core of a US-Russia reset . From the Kremlin point of view, what Putin articulated is a minimalist agenda. Putin has not spoken of any balancing of interests or the desirability of the two countries showing sensitivity to each other’s interests – although they discussed the fight against the “common enemy” – international terrorism and extremism. Trump’s transition headquarters quoted the president-elect as saying to Putin that “he is very much looking forward to having a strong and enduring relationship with Russia and the people of Russia.” With Monday’s conversation, one controversial part of Trump’s foreign-policy plank is gaining transparency. Both Trump and Putin “expressed support for active joint efforts to normalise relations and pursue constructive cooperation on the broadest possible range of issues. They emphasised the importance of establishing a reliable foundation for bilateral ties by developing the trade and economic component,” which in turn “would help “stimulate a return to pragmatic, mutually beneficial cooperation.” The twitter from New York said Trump and Putin discussed “strategic economic issues.” Energy issues? Western sanctions against Russia? We should know in a near future. Something seems to be brewing here. At any rate, it is a terrific forward- looking signal. For, how can the “trade and economic component” be developed so long as the sanctions continue, or when New Cold War clouds are hanging so low? Yet, the Kremlin readout omitted any reference to Ukraine. However, both Putin and Trump noted that at the leadership level, they “should encourage a return to pragmatic, mutually beneficial cooperation in the interests of both countries, as well as global stability and security.” By the way, on Monday, Trump also spoke with Chinese President Xi Jinping. The Xinhua news agency reported that Trump paid fulsome compliments to China as “a great and important country with eye-catching development prospects”. Trump added that Sino-American relations “will witness even greater development” during his presidency. Trump and Xi agreed to meet “at an early date”. Interestingly, Putin and Trump also agreed to not only keep in touch by telephone but also begin planning for an in-person meeting. Would such a meeting take place before or after Trump’s inauguration in January? Conceivably, these could be the first signs of a new type of big-power relationship. Trump may seek a US-Russia-China entente cordiale to carry forward the US’ global leadership while America attends to the repair and reconstruction of its economy and society. Such an approach dovetails with Trump’s agenda of ‘America First’. No doubt, Trump has started running no sooner than he hit the ground. This seems to confirm the general impression of him as a man in a hurry. And Putin seemed to expect it. The Kremlin aide Peskov’s prognosis has been that Putin and Trump are two men “very much alike… in their basic approach towards international relations”, and there’s good reason “to believe that they will manage to establish good relations.” However, this sort of extraordinary ‘pro-active’ diplomacy by the president-elect, as he has shown on Monday, may not go down well with the American foreign policy and security establishment. Some of the irritation may even have welled up to the surface when the Obama administration chose Monday itself to announce even more sanctions against Russia – against six Russian parliamentarians representing Crimea and Sevastopol in the Duma. At any rate, Moscow too bid farewell on Monday to the Obama administration. Reacting to the reported advice by US Defence Secretary Ashton Carter to Trump not to cooperate with Russia over Syria, Russian Deputy Foreign Minister Sergey Ryabkov said in Moscow on Monday that Moscow is no more interested than the United States (read Obama administration) in such cooperation and will proceed on that basis. Ryabkov said derisively that in any case, Moscow does not intend to “persuade the Pentagon leadership to change something in this regard.” To be sure, things have touched a nadir in Russian-American relations, and from this point things can only get better. Having said that, a genuine Russian-American reset depends on the balancing of mutual interests on a number of fronts where progress will be slow and needs to be hard-won. It is the Eurasian theatre that poses formidable challenges. Issues such a NATO expansion, Crimea, US missile defence, forward deployments of NATO along Russia’s borders, ‘colour revolutions’ — these are difficult topics. Maybe, the experience in working together on Syria — and an easing of western sanctions against Russia, which is entirely conceivable sometime through 2017 — would have a positive effect on the overall climate of trust and mutual confidence. What Monday’s phone conversation testifies is that Russia definitely sees a window of opportunity in the incoming Trump presidency; a reset in the troubled relationship is possible; and, that Putin and Trump could strike personal chemistry of a kind that was never found possible for the Russian leader with Obama. Reprinted with permission from Indian Punchline . Related'"}, "time": 1742564100.7727053}