{"duration": 0.09534144401550293, "input_args": {"text": "'on November 13, 2016 3:09 pm · \\nAs predicted, Donald Trump’s victory on Election Day has emboldened racist conservatives to start harassing and attacking minorities. \\nAnd it’s even happening in the deep blue state of California, where a woman spotted a sign hanging on the side of a building in the town of Pittsburg and snapped a photo of it. \\nTwitter user James Thompson posted the image of the sign on the social media platform after his sister sent it to him. This picture was taken in Pittsburgh California. My sister texted this to me 10 minutes ago.Our democracy is being tested even in California pic.twitter.com/gDLKw54Lox \\n— James Thompson (@JETBallin) November 13, 2016 \\nThe sign clearly promotes lynching to prevent African-Americans from getting equal rights. \\n“You can hang a n****r from a tree / Equal rights he will never see!” it says. \\nThe FBI has been notified and local police have filed a lawsuit in an effort to force the owners of the sign to remove it. \\nIn the wake of Trump’s surprising and depressing victory there has been a rise in the number of racist incidents in this country. In fact, there have been 139 reports of people being bullied by Trump supporters since the election night results. \\nThese incidents include the harassment of a Muslim teacher by a student in Georgia, and students designating water fountains “white” or “colored” at a Florida high school. \\nFrankly, there are so many incidents that it’s difficult to list them all. You can find a somewhat comprehensive tally here . \\nThis is what Trump’s America looks like and it’s scary. And this has all happend in the course of a few days as Melania Trump continues to tell the media that her focus will be on ending bullying. What exactly does she mean by that? Is she going to call out all bullying, including the racist bullying being perpetrated by her husband’s own supporters? Or is she going to ignore those incidents and merely whine about people who criticize her husband. Because right now, she isn’t even First Lady yet and her “effort” has failed miserably. And she only has her husband to blame.'"}, "time": 1742563407.436138}