{"duration": 0.04453706741333008, "input_args": {"text": "'Modern   in Germany is increasingly being found to include criticism of the modern state of Israel in general and Jews in particular, according to a new report. [The Independent Expert Group on   published its findings in Germany at the end of last month. It found Jews are “increasingly concerned for their safety due to everyday experiences of  ” as the number surveyed who agreed with   statements rose from 28 per cent in 2014 to 40 per cent in 2016.  It added: “While the   majority does not see current manifestations of   as a relevant problem, Jews in Germany feel they are facing a growing threat  …     there is concern about   among Muslims, these days especially in refugee and migrant populations. ” German broadcaster Deutsche Welle (DW) reports the   study has the support of politicians from across the political spectrum, observing that more needs to be done to fight modern forms of   in the country. The Expert Group said that while traditional forms of   had declined somewhat, modern   for example, criticism of Israel being transferred to Jews in general, remained “alarmingly popular”. About 200, 000 Jews live in Germany, Europe’s third largest community after Britain and France, up from only about 15, 000 who survivied after the end of the Nazi Third Reich. “Forty percent agree with   ” Green Party member of the Bundestag Volker Beck told DW. “That’s almost half of the society. It says a lot about the intellectual environment in which Jews have to live. ” “New forms of   have arisen, and unfortunately the end of the Holocaust and the Second World War didn’t mean the end of ” conservative MP Barbara Woltmann said. “It does worry me that around 20 percent latent   still exists within the populace. ” The parliamentary panel report said rising Jewish fears were partly due to “the growing importance of social media” which was “key to the spread of hate speech and   agitation”. The experts issued five “key demands” to fight  . They include appointing an   ombudsman, establishing a national data base for   crimes and providing   support for groups researching and trying to combat  . As Breitbart Jerusalem reported, in Germany at the end of 2016 there were 2, 083 reported cases of attacks on Jews, Jewish property, and hate speech in 2015, up from just 691 cases in 2014. Previous analysis of crime figures had put the number of   cases in 2015 at 1, 366, but closer analysis revealed that crimes such as the smashing of headstones in Jewish ceremonies, or starting fires at synagogues had been incorrectly classified as criminal damage or attempted arson in some states, with no mention made of the   nature of the crimes.  '"}, "time": 1742564191.0129838}