{"duration": 0.05009937286376953, "input_args": {"text": "'Proving that it has not learned that its customers tire of   politics forced into sports reporting, on the same day that sports cable network ESPN fired 100   employees and reporters, ESPN Women devoted its webpages to extreme   social justice, resistance, and feminism. [Indeed, ESPNW used a claimed “honoring” of National Poetry Month as an excuse to “reflect on resistance, redefining feminism and movement. ”  What followed were poems from five professors, writers, and activists filled with revolution, resistance,   and race baiting. The first piece, penned by Dr. DaMaris B. Hill, a professor of African American and Africana Studies at the University of Kentucky, is titled simply “Revolution. ” It celebrates the violence and force of revolution, and is specifically dedicated to black power icon Asatta Shakur, who murdered a police officer in 1977. In 1979 Shakur escaped from prison and sought asylum in Cuba, where she remains to this day. Shakur was also the first woman named to the FBI’s Most Wanted Terrorist List, and there is currently a $1 million reward leading to her arrest. Amusingly, Dr. Hill seems to admit that the liberals “revolution” has nothing to do with “facts” by writing, “Revolution ain’t got sh —   to do with facts. It is all faith!” That sounds about right, since liberals have no facts or truth on hand with their “revolution. ” It’s all just a religion  —   or a replacement thereof  —   to them. After Dr. Hill, ESPNW moved on to a piece titled, “What Leaps from a Storm’s Throat,” by   of Staten Island professor Patricia Smith. This second poem contains a line that slams capitalism, reading, “beneath vendors who heartlessly hawk the stupid slap of sugar, spirit and salt. ” Next, Wisconsin writer Carrie Ann Welsh’s “Start Here,” seemed to posit that only minority women play sports, with a line saying, “Their bodies are too dark, too wiry, too big, too fast. ” Finally, New York arts and culture administrator DéLana R. A. Dameron, made her entire piece about whites oppressing blacks. In Dameron’s poem, entitled “My Struggle with Feminism is Black,” black women are presented as having no freedom. Daeron insists black women are “in the service of white folks. ” Dameron even poked her poetic finger in the eyes of liberal, white women who think they support the liberation of black women by noting that   white women found it easy to stomp around advocating for free black women when black women weren’t teachers or even living in the same neighborhoods as those white women. “Don’t let those white girls turn you into a mammy. You are not there to take care of them, get yours,” Dameron’s screed said. So, as these “poets” are pushing   race hatred, and resistance, ESPN is once again seen pushing far left,   liberalism onto its sports fans. Will they ever learn? Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628332.6035428}