{"duration": 0.6201267242431641, "input_args": {"text": "'The FBI, the DHS’s Customs and Border Protection, the Secret Service, and the Israelis are in cahoots ‹ › Jonas E. Alexis graduated from Avon Park High School, studied mathematics and philosophy as an undergraduate at Palm Beach Atlantic University, and has a master\\'s degree in education from Grand Canyon University. Some of his main interests include the history of Christianity, U.S. foreign policy, the history of the Israel/Palestine conflict, and the history of ideas. He is the author of the new book , Christianity & Rabbinic Judaism: A History of Conflict Between Christianity and Rabbinic Judaism from the first Century to the Twenty-first Century. He is currently teaching mathematics in South Korea. He plays soccer and basketball in his spare time. He is also a cyclist. He is currently writing a book tentatively titled Zionism and the West. Alexis welcomes comments, letters, and queries in order to advance, explain, and expound rational and logical discussion on issues such as the Israel/Palestine conflict, the history of Christianity, and the history of ideas. In the interest of maintaining a civil forum, Alexis asks that all queries be appropriately respectful and maintain a level of civility. As the saying goes, “iron sharpens iron,” and the best way to sharpen one’s mind is through constructive criticism, good and bad. However, Alexis has no patience with name-calling and ad hominem attack. He has deliberately ignored many queries and irrational individuals in the past for this specific reason—and he will continue to abide by this policy. By Jonas E. Alexis on November 4, 2016 \"Over the last decade, the NSA has significantly increased the surveillance assistance it provides to its Israeli counterpart, the Israeli SIGINT National Unit (ISNU; also known as Unit 8200), including data used to monitor and target Palestinians.\" …by Jonas E. Alexis \\n\\nMy dear friend Mark Dankof has recently sent me an article which documents that a 17-year-old Israeli firm named Cellebrite Mobile Synchronization has been working with the FBI, the Drug Enforcement Administration, the Secret Service, and DHS’s Customs and Border Protection since 2009. There is more: \\n“U.S. state and local law enforcement agencies use Cellebrite’s researchers and tools as well, as does the U.S. military, to extract data from phones seized from suspected terrorists and others in battle zones. \\n“In July, months after the unknown third party provided the FBI with a method for getting into the San Bernardino phone — an iPhone 5C running iOS 9 — Cellebrite announced that it had developed its own technique for bypassing the phone’s password/encryption lock. And the company is confident that it will be able to deal successfully with future security changes Apple may make to its phones in the wake of the San Bernardino case… \\n“Data extracted from phones has eclipsed data extracted from desktop and laptop computers in recent years, since the former can yield not only detailed logs about a user’s activities, interests, and communications, but also, in many cases, map the user’s whereabouts over weeks and months to produce a pattern of life.” [1] \\nBloomberg itself confirmed that Cellebrite Mobile Synchronization has indeed been working with the FBI. [2] CNN calls Cellebrite “the mysterious ‘outside party’…” [3] \\nThis shouldn’t be a surprise at all, for we know that the NSA and the Israelis are almost two sides of the same coin. The New York Times itself agrees with the prevailing view that “the N.S.A. was routinely passing along the private communications of Americans to a large and very secretive Israeli military organization known as Unit 8200.” [4] One can reasonably say that Israel has a way in which the NSA is loused up: “Over the last decade, the NSA has significantly increased the surveillance assistance it provides to its Israeli counterpart, the Israeli SIGINT National Unit (ISNU; also known as Unit 8200), including data used to monitor and target Palestinians. In many cases, the NSA and ISNU work cooperatively with the British and Canadian spy agencies, the GCHQ and CSEC. The relationship has, on at least one occasion, entailed the covert payment of a large amount of cash to Israeli operatives.” [5] \\nSolomon Ehrmann, a Viennese Jew, would have been pleased with what Israel has been doing. In a speech delivered at the B’nai B’rith in 1902, Ehrmann envisioned a future in which “all of mankind will have been jewified and joined in union with the B’nai B’rith.” When that happens, “not only the B’nai B’rith but all of Judaism will have fulfilled its task.” [6] \\nBaruch Levy, one of Karl Marx’s correspondents, would have agreed. He declared: “The Jewish people taken collectively shall be its own Messias…In this new organization of humanity, the sons of Israel now scattered over the whole surface of the globe…shall everywhere become the ruling element without opposition…. “The governments of the nations forming the Universal or World-Republic shall all thus pass, without any effort, into Jewish hands thanks to the victory of the proletariat…Thus shall the promise of the Talmud be fulfilled, that, when the Messianic epoch shall have arrived, the Jews will control the wealth of all the nations of the earth.” [7] \\nWell, Judaism is seeking to fulfill “its task” through the state of Israel, which we all know by now is based on the Talmud. [8] But Solomon, Levy, and others could not understand that no force is strong enough to impede the triumph of Logos in history. Julian the Apostate tried but failed miserably. Voltaire, Helvitius, d’Holbach, D’Alembert, Lametrie, Diderot, and nearly all the leading lights of the French Revolution tried. Not a single one of them succeeded because they were essentially fighting against the moral and political order, which is based on reason. \\nIf Hegel is right, that reason will triumph in the end, then Solomon, Levy and their minions cannot win. Their evil work is actually drawing them closer and closer to destruction. These people will continue to fail because they are blind to higher realities. They cannot not see that ultimate reason is the beginning and end of human history. They should have at least read Hegel’s position on the philosophy of history. \\nWorld history, Hegel tells us, “is governed by an ultimate design…whose rationality is not that of a particular subject, but a divine and absolute reason,” [9] and sometimes this divine and absolute reason has a cunning way of working itself out in history, irrespective of what evil men intend to do. This “divine and absolute reason,” says Hegel will “realize its end” in due time. [10] \\nThe carnal man simply cannot understand this “cunning of reason” because he is again blind to higher metaphysics. Higher realities goes back to Heraclitus, Plato and Aristotle and was refined by people like Aquinas. It states that there is a mathematical, philosophical, moral, and political order in the universe and it is bigger than human beings. \\nHeraclitus wrote: “Listening not to me but to the Logos…” [11] According to scholar Eva Brann, Heraclitus “directs us not to intellectual self-reliance, not to seek some truth, but to comprehend and follow this truth: that said b the Logos.” [12] This Logos, according to Heraclitus, is both “a maxim and Wisdom Inarnate.” According to Brann’s interpretation of Heraclitus, “This great Logos has a wisdom, or rather it is the Wise thing, and this Wise Thing has a maxim, or rather it is that practical principle which guides everything through everything, relates all things to all things…” [13] \\nWhat Heraclitus and others of that era were trying to establish is that there is an order in this universe, which is undeniable. There is a mathematical, philosophical, esthetic, political and moral order. Any deviation from that order has serious consequences, including intellectual death. And anyone who studies the universe from a rational and truthful standpoint can recognize that order. \\nEven physicists and mathematicians like P. C. W. Davis, Sir Fred Hoyle, John D. Barrow, Frank J. Tipler, Sir Martin Rees, among others, have come to realized that the mathematical order in the universe demands an explanation. [14] That explanation cannot be attributed to chance at all. [15] \\nRees himself argues that there are basically six numbers that sustain the physical properties of the entire universe. If you change any one of those six numbers (such as the strong nuclear force, gravitational force, etc.) “even to the tiniest degree, there would be no stars, no complex elements, no life.” Rees adds, “Had these numbers not been ‘well tuned,’ the gradual unfolding of layer upon layer of complexity would have been quenched.” [16] \\nWell, these numbers are “well tuned” because they were based on what the Greeks and St. John call the Logos, which the carnal mind ultimately rejects. This “absolute reason,” says Hegel, will bring about the end of history. \\nBut looking at all the evil and chaos in this world, obviously the carnal man would think that there cannot be an “infinite power, which realizes its ends.” But Hegel would respond by saying that this is why this “infinite power” is “cunning” and is more powerful than human beings. \\nThis “infinite power,” according to scholar Robert C. Tucker’s interpretation of Hegel, “fulfill its ulterior rational designs in an indirect and sly manner. It does so by calling into play the irrational element in human nature, the passions.” [17] \\nThe carnal mind simply lacks vision and insight to understand all this because he limits himself only to the primitive idea that the material universe, as Karl Sagan hubristically propounded, “is all that is or was or ever will be.” [18] \\nThe carnal mind cannot see that the materialist position lacks intellectual rigor to explain simple things like love, hate, justice, truth, hatred, etc. The best that the carnal mind can offer here is to posit that those things are simply illusions. As Nobel Laureate Francis Crick put it years ago in his book The Astonishing Hypothesis : “The Astonishing Hypothesis is that ‘You,’ your joys and your sorrows, your memories and your ambitions, your sense of personal identity and free will, are in fact no more than the behavior of a vast assembly of nerve cells and their associated molecules.” [19] \\nRichard Dawkins makes the same assumption when he argues that the universe is “just electrons and selfish genes,” therefore “meaningless tragedies…are exactly what we should expect, along with equally meaningless good fortune.” [20] \\nThe word “meaningless” itself implicitly assumes something called “meaningful.” And both words again assume that there is a “law” by which to differentiate what is “meaningful” and “meaningless.” And a law assumes a “lawgiver.” That’s what the carnal mind like Dawkins is promiscuously trying to deny! Perhaps people like Dawkins need to think goodness that they have never met people like Kant. \\n[1] Kim Zetter, “When the FBI Has a Phone It Can’t Crack, It Calls These Israeli Crackers,” The Intercept , November 1, 2016. \\n[2] Yaacov Benmeleh, “FBI Worked With Israel’s Cellebrite to Crack iPhone,” Bloomberg , March 30, 2016. \\n[3] Jose Pagliery, “Cellebrite is the FBI’s go-to phone hacker,” CNN , April 1, 2016. \\n[4] See James Bamford, “Israel’s N.S.A. Scandal,” NY Times , September 16, 2014. \\n[5] Glenn Greenwald, “Cash, Weapons, and Surveillance: The U.S. Is a Key Party to Every Israeli Attack,” The Intercept , August 4, 2014. \\n[6] Quoted in Albert S. Lindemann, Esau’s Tears: Anti-Semitism and the Rise of the Jews (Cambridge: Cambridge University Press, 1997), 331. \\n[7] Quoted in E. Michael Jones, The Jewish Revolutionary Spirit and Its Impact on World History (South Bend: Fidelity Press, 2008), 1066. \\n[8] Marissa Newman, “Netanyahu reported to say legal system based on Talmud,” Times of Israel , May 8, 2014. \\n[9] George Wilhelm Friedrich Hegel, Lectures on the Philosophy of World History (Cambridge: Cambridge University Press, 1975), 28. \\n[10] Ibid., 35. \\n[11] Quoted in Eva Brann, The Logos of Heraclitus: the First Philosopher of the West on Its Most Interesting Term (Philadelphia: Paul Dry Books, 2011), 15. \\n[13] Ibid., 21. \\n[14] See for example John D. Barrow and Frank J. Tipler, The Anthropic Cosmological Principle (New York: Oxford University Press, 1988); Martin Rees, Just Six Numbers: The Deep Forces That Shape The Universe (New York: Basic Books, 2000); Paul Davis, The Goldilocks Enigma: Why Is the Universe Just Right for Life? (New York: Mariner Books, 2006); Fred Hoyle, Evolution from Space (New York: Touchtone, 1984); Fred Hoyle, The Intelligent Universe (New York: Rinehart, 1988). \\n[15] See Dean L. Overman, A Case Against Accident and Self-Organization (Lanham: Rowman & Littlefield Publishers, 1997). \\n[16] Martin Rees, Just Six Numbers: The Deep Forces That Shape The Universe (New York: Basic Books, 2000), 161. \\n[17] Robert C. Tucker, “The Cunning of Reason in Hegel and Marx,” The Review of Politics , Vol. 18, NO 3, July 1956: 269-295. \\n[18] Carl Sagan, Cosmos (New York: Ballantine Book, 1980 and 1013), xxii. \\n[19] Francis Crick, The Astonishing Hypothesis: The Scientific Search for the Soul (New York: Simon & Schuster, 1994), 3. \\n[20] Richard Dawkins, River Out of Eden: A Darwinian View of Life (New York: Basic Books, 1995), 132. Related Posts:'"}, "time": 1742628413.8257992}