{"duration": 0.13147878646850586, "input_args": {"text": "'Public Faith in Elections Falls as the State Grows Out-of-control state power Ryan McMaken | Mises.org - October 27, 2016 Comments \\nIn the wake of the final presidential election debate last week, the mainstream media was appalled that Donald Trump would not pre-emptively agree to not contest the outcome of the election . \\nTrump’s position reflects a growing faction of Americans who doubt the integrity and honesty of the American electoral system. In response, mainstream media sources have responded by vehemently insisting that “rigged” elections are “ a myth .” \\nWhile rarely stated explicitly, the way American electoral politics is supposed to work is this: the population spends several months listening to the candidates accuse each other of terrible crimes, horrible ideas, and gross incompetence. Each candidate lists the ways he or she will use the power of government to force the winner’s policy preferences on the losers. Then, once the votes are cast, everyone is supposed to quickly accept the results, ignore everything that was said during the campaign, and immediately accept the winner as having an indisputable mandate to rule over everyone, including the sizable minority — or even the majority, in many cases — who either voted against the winner, or abstained. If there appears to be any “irregularities” in the vote, well, those should just be ignored because it would “tear the country apart” to “drag out” the election. If half the country feels it’s been cheated, well, tough luck and better luck next time. Democracy Breaks Down As (Perceived) Interventionism Increases \\nThis model can only work indefinitely under certain specific conditions. It can be workable when there is a perception that government is limited in its power, and extensive or abrupt change to government institutions are thought to be rare. It can also work in a small, culturally uniform society where there is a relatively small divide between socio-economic and ethnic groups. \\nIn the case of the United States, however, it appears that neither of these conditions apply. \\nIn the age of presidential executive orders, militarized police, uncountable federal laws, and a myriad of spy agencies empowered to watch Americans’ every move, gone is the perception that a loss in an electoral contest should simply be accepted without question. The president says he can issue laws with “ a pen and … a phone ” without any need to consult Congress. The Libya war proved presidents can invade any country without so much as a debate in Congress. Meanwhile, the untouchable Supreme Court hands down decisions that are equivalent to Constitutional amendments, some of which can have enormous effects on the daily lives of ordinary citizens. \\nIn other words, the stakes are now reaching the point where an attitude of “better luck next time” doesn’t cut it. Whether or not these fears are at times overstated is irrelevant. The fact is the perception of democratic lawlessness is growing. \\nThis situation is further complicated by the fact that the United States is an enormous conglomeration of different cultural and socio-economic groups spread out over a vast and varied geography. Many of these different groups distrust each other, and in a country where the president and the judiciary now rule largely by proclamation, there is reason to be fearful when “the other guy’s” candidate wins and yours loses. Democracy Can Work When the Stakes Are Low \\nContrary to the naive musings of some nostalgic conservatives, the United States was never united into a single cultural, linguistic, or socio-economic group. Those differences may have reached a low point during the twentieth century, but they were far larger in the 19th century than they are today. \\nWhen you have a diverse population, however, the problem of who controls the government becomes far more important, and this concern grows as the state becomes more powerful. Writing on the topic of immigration and nationalism in Australia , Ludwig von Mises noted how powerful states exacerbate the problem of cultural divides. Could a laissez-faire regime be guaranteed to all residents of Australia, Mises notes, it would not matter at all if there were cultural mistrust between English-descended Australians and Asian newcomers. However, since laissez-faire liberalism has not been embraced, a familiar problem presented itself: \\nThe present inhabitants of [Australia] fear that some day they could be reduced to a minority in their own country and that they would then have to suffer all the horrors of national persecution to which, for instance, the Germans are today [i.e., the early 1920s] exposed in Czechoslovakia, Italy, and Poland. \\nIt cannot be denied that these fears are justified. Because of the enormous power that today stands at the command of the state, a national minority must expect the worst from a majority of a different nationality. As long as the state is granted the vast powers which it has today and which public opinion considers to be its right, the thought of having to live in a state whose government is in the hands of members of a foreign nationality is positively terrifying. It is frightful to live in a state in which at every turn one is exposed to persecution — masquerading under the guise of justice — by a ruling majority. It is dreadful to be handicapped even as a child in school on account of one’s nationality and to be in the wrong before every judicial and administrative authority because one belongs to a national minority… \\nIt is clear that no solution of the problem of immigration is possible if one adheres to the ideal of the interventionist state, which meddles in every field of human activity, or to that of the socialist state. Only the adoption of the liberal program could make the problem of immigration, which today seems insoluble, completely disappear. In an Australia governed according to liberal principles, what difficulties could arise from the fact that in some parts of the continent Japanese and in other parts Englishmen were in the majority? \\nThese same principles can be applied outside the subject of immigration as well. The existence of an interventionist state means any country composed of diverse ethnic and socioeconomic groups faces the same problem of one group being exploited by another group, with the help of state power. Change the term “nationality” to “political party” or “interest groups,” and one has a fair approximation of the problem of democracy in any interventionist state. \\nIn the presence of a relatively weak government, however, these concerns are often overstated. At the turn of the 20th century in the US, for example, the fact that Spanish-speakers were in the majority in New Mexico and many areas of the American West was irrelevant to the lives of the vast majority of Americans. The fact that Japanese immigrants and their descendant were out-competing white businessmen in California was simply not a matter of national importance. The fact that Oregon attempted to outlaw Catholic Schools was not a matter for presidential executive orders. Thanks to widespread suspicion of federal power at the time, the lack of a strong federal judiciary and a relatively weak presidency meant these issues remained largely local while public policy was haphazard. \\nVoters have always feared losses in elections, but now more than ever, the voters may be justified in refusing to simply accept the outcomes of elections under “an interventionist state, which meddles in every field of human activity.” When that is the case, elections are not something to be taken lightly. Trump’s remarks about rigged elections — and public fears over the outcome — are to be expected from voters with an immense fear of out-of-control state power. \\nIn response to all of this, the pundits and government class will tell us that everyone must double down on democracy, and that elections — specifically federal ones —are sacred rituals never to be questioned. There will be a double standard, of course. A Trump victory will be questioned by the media and powerful politicians. But, in that case it will be the fault of the Russians , and not anything wrong with the system itself. The solution for the feds, of course, will be a federal takeover of the election system. If Clinton wins, then no questioning of the system will be tolerated at all. To question the outcome or the wisdom of these presidential contests will be denounced as scarcely less than sacrilege. \\nThe true solution to the problem remains far more practical, however. To paraphrase Mises, it is clear that no solution of the problem of elections is possible if one adheres to the ideal of the interventionist state. So long as elections are increasingly perceived to be referenda on which side shall use the power of the state to crush the other side, faith in the electoral system will erode, and the potential for real violence will increase. NEWSLETTER SIGN UP Get the latest breaking news & specials from Alex Jones and the Infowars Crew. Related Articles'"}, "time": 1742562973.572603}