{"duration": 0.047788381576538086, "input_args": {"text": "'Bruce Springsteen blasts President Donald Trump as a “con man” and calls his administration “crooks” in a new protest song released this week. [“That’s What Makes Us Great” is a joint effort between The Boss and frequent collaborator Joe Grushecky and the Houserockers.  “Don’t tell me a   And sell it as a   I’ve been down that road   And I ain’t going back,” Springsteen sings on the track, which was released Wednesday morning on Grushecky’s website. “Don’t you brag to   That you never read a   I never put my   In a con man and his crooks,” the song continues. Grushecky  —   whose 1995 album American Babylon was produced by Springsteen  —   told the Pittsburgh   that he’d written the song before the Boss got involved. Springsteen reportedly sent his part to the   musician over the Internet. “I had this song, and Bruce and I had been talking. I sent it to him and he liked it,” Grushecky told the paper. “I said, ‘What do you think about singing on it?’ He gave it the Bruce treatment. ” Springsteen was vocal supporter of former Democratic presidential candidate Hillary Clinton and a fierce critic of Trump during the 2016 campaign. In September, the    E Street Band leader called Trump a “moron” in an interview with Rolling Stone. “The republic is under siege by a moron, basically. The whole thing is tragic,” he said. “Without overstating it, it’s a tragedy for our democracy. When you start talking about elections being rigged, you’re pushing people beyond democratic governance. And it’s a very, very dangerous thing to do. ” On the eve of the election, Springsteen performed at a   campaign rally for Clinton in Philadelphia, where he predicted Trump and his campaign were “going down. ” “Let’s all do our part so that we can look back on 2016 and say, ‘We stood with Hillary Clinton on the right side of history,’” he said then.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563939.9621196}