{"duration": 0.08521294593811035, "input_args": {"text": "'“The cameras are over,” Garth Brooks said late Friday night, speaking conspiratorially to the tens of thousands of people who had come to Yankee Stadium to see him. “Now it’s just you and me. ” He had just performed a rousing hour and a half full of   anthems, aching ballads, and lots and lots of running. This was his second encore. He asked for a capo, and someone hustled on stage to give him one. Then he played four acoustic killers  —   a Bob Dylan cover, a Billy Joel cover and two of his own  —   while, on either side of him, cameras were rolling, taking in the scene. Which is not to say that Mr. Brooks is a liar, per se  —   only that he is an outstanding salesman, one of the greatest in pop music history, a man who vacillates seamlessly between the performance of intimacy and the performance of exuberance, and often does not distinguish between the two. That skill made him the signature country star of the 1990s, and also the decade’s signature country disrupter. He infused the genre with classic rock gestures,   scale and pop ceremony long before doing so became the norm. And that made him staggeringly popular: The last time Mr. Brooks played New York City, it was to almost a million people in Central Park in 1997. This show in the Bronx was the first of two nights here, and the first country music concert at Yankee Stadium. And yet, Mr. Brooks was always a resolutely average singer. His greatest accomplishments were never technical or aesthetic, they were logistical  —   he turned country songs into   community soundtracks. (As if to prove the point, Friday’s show opened with a   video of the assembly of the stage, which was impressive, like a tiered cake with a huge circular loop that extended out into the center of the field.) He built the big tent under which country music now unthinkingly parades. He has done so with sleights of performance. Instead of singing with vibrato, he makes eye contact. Instead of vocal depth, he boasts a megawatt grin. Instead of flawless pitch, he has rugged athleticism. What he does have in common with more gifted vocalists, though, is his commitment to feeling. From that encore  —   especially on the tender “She’s Every Woman”  —   to “The Thunder Rolls” to “The Dance,” Mr. Brooks continually showed how to hush a room, even one with no roof. His wife, the country star Trisha Yearwood, joined him on the ballad “In Another’s Eyes,” then stuck around for three songs on her own  —   an energetic cover of “When Will I Be Loved? ,” the peak schmaltz of “How Do I Live” and the slightly tepid “She’s in Love With the Boy”  —   before giving Mr. Brooks a lingering kiss on the mouth, then leaving. So it was a family affair, too, this Yankee Stadium party. That jovial attitude extended to Mr. Brooks’s band and backup singers, perhaps the most excited and positive group of performers on any stage, anywhere. They smiled and laughed through “Ain’t Goin’ Down (‘Til the Sun Comes Up),” “Two Piña Coladas” and the rowdy “Papa Loved Mama. ” Even when Mr. Brooks turned serious, for just a fleeting second, he turned the moment into an inclusive jam. Before singing the gimmicky “People Loving People,” he said he had been asked to comment on the shooting in Dallas that killed five police officers and injured seven more. He said his answer had always been the same: “We’ve got to love one another  —   that’s what it’s all about. It’s our only hope. ” In that same breath he mentioned Orlando, Fla. where a gunman killed 49 people at a gay nightclub last month, and Paris, where 89 were killed at a concert last November. Mr. Brooks did not, however, mention the fatal police shootings of black men in Falcon Heights, Minn. and in Baton Rouge, La. And that omission only became more awkward when, later in the show, Mr. Brooks played the   joyful “Callin’ Baton Rouge,” a song that felt out of step with the current political moment. Even though Mr. Brooks only recently made a public return to music after several years of semiretirement  —   he said he will be releasing a new album in the fall  —   he remains extremely popular. He recently announced a partnership with SiriusXM satellite radio, in which he will have a dedicated channel. And this show was being filmed, which was hard to overlook. Before Mr. Brooks took the stage, a functionary came out and   a blanket waiver. Another person said the number of cameras being used was 23. At one point during the show, Mr. Brooks ran around the circular stage twice, encouraging fans to do the wave. Afterward, breathing heavily, Mr. Brooks said that his producer was making “the old, fat guy” do it once more. And so he did. At the end of the night, fireworks shot into the sky from behind the stage, but they were upstaged by the rain, which began during “Friends in Low Places” and really took hold during “The Dance,” one of Mr. Brooks’s most scarred ballads. It was so apt as to seem   it was studied sincerity and spontaneity all rolled into one. As Mr. Brooks sang, with eyes closed, about the trauma of failed love, raindrops were exploding at his feet.'"}, "time": 1742561730.889205}