{"duration": 0.12820959091186523, "input_args": {"text": "'Good morning.  Here’s what you need to know: • Reaction to President Trump’s address tended to focus on its “presidential” style. His sobriety, seriousness of purpose, and calls for unity reassured  —   and surprised  —   many listeners. “I think it sounded great, like a utopia,” one voter said, adding, “I don’t think it’s that simple. ” Indeed, Mr. Trump, who met with congressional Republican leaders on Wednesday, above, faces not only a committed Democratic opposition but a divided Republican Party. Today’s episode of The Daily podcast examines the president’s speech, especially his promises to protect Americans. Listen from a computer, on an iOS device or on an Android device. _____ • As Chinese officials gather this weekend for the start of the annual National People’s Congress, China’s weak currency is likely to be a major topic behind closed doors. The momentum appears to be turning against keeping the renminbi weak, not only because it risks worsening relations with the U. S. but also because it may hurt Chinese companies more than it helps. _____ • Russia mistakenly bombed Syrian fighters being trained by the U. S. another unintended clash among the myriad forces on the fluid battlefield. Separately, United Nations investigators released a report detailing war crimes committed by various forces in the Syrian conflict. The Syrian government’s deliberate bombing of a U. N. aid convoy in September, which killed 14 aid workers, was “one of the most egregious. ” Also in Syria, a senior Qaeda leader who was a    of Osama bin Laden was killed Sunday in a U. S. drone strike. _____ • The Malaysian investigation into the Feb. 13 assassination of Kim   the half brother of North Korea’s leader, has been halted at the doors to the North Korean Embassy in Kuala Lumpur. Two North Korean suspects in the case have taken refuge inside, adding to tensions between the former close allies. _____ • The Philippines appears set to reinstate the death penalty, after a crucial vote by the House of Representatives that demonstrated the popularity of President Rodrigo Duterte’s bloody antidrug campaign. A few last steps to enactment are unlikely to be difficult, despite opposition from some lawmakers and the politically influential Catholic Church. The church has had more success in preventing the distribution of condoms to high school juniors and seniors, despite the country’s   H. I. V. infection rate, one of Asia’s highest. _____ • Are the microtubes and filaments magnified above the oldest fossils on Earth? Some researchers identify them as bacterial remains that offer evidence that life emerged not long, geologically speaking, after the birth of the planet 4. 5 billion years ago. Others are, in the words of one scientist, “frankly dubious. ” Such battles, an optimist observed, are ”how science progresses. ” • Snap Inc. Snapchat’s parent company, makes its   market debut with a valuation set at $24 billion, an extraordinary starting point for a trajectory that could rise like Facebook  —   or fall like Twitter. • India’s rivers are paying the price for the country’s runaway construction boom. Ruthless “sand mafias” are devastating waterways to feed demand for concrete. • Women  on the boards of   companies on average earn 43 percent less than their male counterparts. • Former President Barack Obama and Michelle Obama have signed a publishing deal. Penguin Random House won the fierce auction  —   an insider said the opening offers for Mr. Obama’s book alone were as high as $20 million. • ResearchGate, a   social network for scientists, is growing in influence and funding, linking academics worldwide and providing   research feedback. • U. S. markets were up. Here’s a snapshot of global markets. •  Iraqi forces, backed by U. S. air power, recaptured the last major road out of western Mosul, trapping Islamic State militants inside the city. [Reuters] • The Afghan Taliban carried out twin bombings in Kabul that killed 15 people and wounded 50. Most of the victims were believed to be civilians. [The New York Times] • China has unveiled its latest combat drone, the Wing Loong II. The aircraft can fly for 20 hours and carry 12   bombs or missiles. [China Daily] • Trade associations in India’s Tamil Nadu State have proposed a ban on   and Pepsi, citing environmental concerns. More than a million shopkeepers are expected to comply. [BBC] • Vandalism at Jewish cemeteries and threatening calls to community centers and schools has left American Jews on edge. [The New York Times] • U. S. scientists report an increase in the risk of colorectal cancers in adults in their 20s and 30s, though the reasons are unclear. [The New York Times] • The Kiwis are back. Four years after squandering an   lead in San Francisco, Team New Zealand heads to Bermuda for the America’s Cup, yachting’s most prestigious prize. [The New York Times] • If you feel your productivity flagging at work today, try putting on some music. • Recipe of the day: For a different take on dinner, try roasted fish with sweet peppers. • France’s perennial obsession with  “Frenchness” is colored with fears that its essence is being lost with the decline of provincial towns  —   dense hubs of tradition where Balzac set his novels. • Be nice to your doctor or nurse. A study of an Israeli neonatal unit suggests that quality of care suffers if a parent is rude, or even just unpleasant, to the medical staff. • Finally, what to pack for a monthlong trip to Asia? King Salman of Saudi Arabia arrived in Indonesia, his first stop, with an entourage of 1, 500 people, six Boeing jets and a cargo plane carrying two Mercedes limos and 506 tons of luggage. When the movie “King Kong” was first screened, 84 years ago today in New York City, it was widely anticipated for its technological feats and a challenging narrative that had a “monstrous ape 50 feet tall” climbing the   Empire State Building. “The film will show prehistoric monsters fighting one another and making weird sounds,” The Times reported before the release, calling it a “fantastic film. ” It also helped define the career of Bruce Cabot, who played Jack Driscoll, the hero who rescues Fay Wray from the giant ape. Mr. Cabot’s career didn’t start in acting school. At 14, he scavenged cattle remains on the prairies of New Mexico for bone meal. Work in construction “gave him a democratic outlook on life,” The Times wrote in 1933. As a ship deckhand, he worked his way to Europe and meandered through   War I France and Spain. After “King Kong,” a series of supporting roles followed, often alongside John Wayne. World War II military service took him back to Europe, where he worked in intelligence. That may have prepared him for one of his last roles: Fighting a fictitious spy named James Bond in “Diamonds Are Forever. ” Patrick Boehler contributed reporting. _____ Your Morning Briefing is published weekday mornings and updated online.  What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742562158.9716375}