{"duration": 0.049628257751464844, "input_args": {"text": "'BANGKOK  —   Thailand’s crown prince ascended to the throne on Thursday, seven weeks after the death of his father, King Bhumibol Adulyadej, who died after reigning for seven decades. In a formal ceremony at the Dusit Palace in Bangkok, the prince, crowned as King Maha Vajiralongkorn Bodindradebayavarangkun, 64, accepted the invitation to take the throne offered by the National Assembly president. Afterward, Prime Minister Prayuth   said in a televised speech that the new monarch would be declared king retroactively to the day his father passed away. He also will be known as King Rama X of the Chakri dynasty. “The heir to the throne graciously accepted the invitation,” the prime minister said. “A kingdom should not be without a monarch on the throne. The commencement of the new reign is therefore effective as of 13 October 2016. ” The crown prince had declined to take the throne immediately after his father’s death, saying he needed time to grieve. Thailand’s royal succession is an elaborate process that can extend for many months. King Bhumibol’s cremation will take place about a year after his death. King Vajiralongkorn’s coronation will take place at some point after that. King Bhumibol was revered by many Thais who saw him as an advocate of the common people and a promoter of economic development. The official   mourning period for the public has ended, but even now many people still wear black clothing or a black ribbon to honor him. The country is sharply divided but the military, which has held power since a 2014 coup, remains firmly in control. King Bhumibol was a unifying figure and many Thais have been anxious about what kind of leadership they can expect from King Vajiralongkorn, who has lived primarily in Germany for years. “Although we all know that to be parted from the person we love and respect is suffering,” the prime minister said, “although the loss and sadness are an undeniable crisis, we should turn this crisis into an opportunity and turn grief into the strength of the land. ”'"}, "time": 1742562083.0397723}