{"duration": 0.04987454414367676, "input_args": {"text": "\"  CALL HIM MR. 306: Michigan Finishes It’s Vote Counting And Certifies Donald Trump As The Winner Across the nation, Donald Trump won 306 electoral votes -- including Michigan's 16 -- to 232 for Clinton. Trump is the first Republican presidential candidate since 1988 to win Michigan.   24, 2016 In the closest race for president in Michigan’s history, Republican Donald Trump hangs on to a 10,704 vote win over Democrat Hillary Clinton. \\nThe Michigan Secretary of State posted results Wednesday that were submitted by the state’s 83 county clerks on Tuesday after the votes were reviewed and certified by each county. \\nBefore that compiled count , Trump held a 13,107 lead over Clinton. But after each county certified its results, the lead shrunk to 10,704, with the biggest chunk coming from Wayne County, which showed that Clinton had gotten 565 more votes than originally tallied by the county. Donald Trump FINAL CAMPAIGN Rally in Grand Rapids, Michigan: \\nThe state’s Board of Canvassers will officially certify the results on Nov. 28. The electoral college in all the states, including Michigan’s 16 electors, will cast their votes on Dec. 19. Electoral College and the National Archives: \\n“Many people have asked about Michigan’s process for counting ballots and certifying election results. Please be aware that all 1,521 Michigan cities and townships completed ballot counting and reported unofficial results by the morning of Wednesday, Nov. 9,” according to a statement on the Secretary of State’s website. “The county canvassing boards, as they do after every election, then began their work to review and certify the results from each precinct.” \\nAcross the nation , Donald Trump won 306 electoral votes — including Michigan’s 16 — to 232 for Clinton. In the popular vote, Clinton holds a lead of more than 2 million votes. \\nTrump is the first Republican presidential candidate since 1988 to win Michigan. The vote totals that will be submitted to the state Canvassers Board on Nov. 28 are: Donald J. Trump, Republican: 2,279,543 Hillary Clinton, Democratic: 2,268,839\""}, "time": 1742562252.2650337}