{"duration": 0.06319093704223633, "input_args": {"text": "\"Sky News: Kay Burley, 55 interviews Nigel Farage \\nNigel Farage: \\nThe Labour Party, historically, was there to look after working communities in this country, and it's given all of that up in favor of an open door to southern and eastern Europe. \\nSky News Female: \\nBut isn't that racist? \\nNigel Farage: \\nI don't think it is. No. I don't think it can be deemed as such in any way. \\nBut we've never in our history had a complete open door, and now we have one to 485 million people. \\nI don't think, in terms of common sense, that really adds up. \\nSky News Female: \\nBut if you're a 'racist', according to the Oxford English dictionary, it means that you have or are showing the belief that a particular race is superior to another. \\nPresumably, if you're saying that British people should have jobs above east Europeans, you're suggesting that they're superior and, as a result, that's racist. \\nNigel Farage: \\nWell, actually, this is a big argument in London amongst the Afro-Caribbean community, fifty percent of whose youngsters haven't got jobs. \\nAnd that same survey that was done recently showed over 60% of the settled ethnic minorities in this country also believe that we have got to have some degree of control. So this crosses all boundaries within this country. \\nSky News Female: \\nOK, you're getting bogged down in the figures, again. \\nAnd, as I said, remember to what happened to Mr Clegg when he did that. [hand gesture] \\nI've given you the definition of 'racist'. [hand gesture] \\nYou've told me what you thought about the fact that British workers should have a superior chance of getting a job above European workers, whether they're from eastern Europe or whatever, and that is quite simply a 'racist' comment. \\nNigel Farage: \\nNo, it isn't. It is a job of the British government, firstly, to defend the realm and, secondly, to put the interests of the people that live in this country, first. \\nThat's what we should be doing, and I'm afraid we've turned out backs on that over the course of the last few years, which has led to much, much unhappiness among millions of families. \\n... \\nHow can anyone take more of this ludicrous 'racist' propaganda any longer? \\nWhat they refer to as 'racism' is protection of the vital interests of oneself and of one's own kind, in one's own land. \\nAs if an Afro-Caribbean settlement belongs in any normal European society? \\nAs if European interests may only be defended using the shield of the interests of the non-European invaders themselves? \\nHow can European man not see this for what it is, and how can European man allow himself to be subjugated to this degree?\""}, "time": 1742564135.1256998}