{"duration": 0.030723094940185547, "input_args": {"text": "'Editor’s Note: Is it any wonder that Hillary Clinton is being hit from all sides? The tens of thousands of leaked emails, the re-opening of the FBI investigation, and overwhelming support by military officers for Donald Trump suggest that those working for the military, law enforcement and the intelligence community will do whatever they can to keep Hillary Clinton from becoming their new boss. \\n\\nFormer United States Department of State official Dr. Steve Pieczenik is a psychiatrist who has over 20 years experience in resolving international crises for four U.S. administrations.\\nPieczenik was Deputy Assistant Secretary of State under Henry Kissinger, Cyrus Vance, and James Baker. His expertise includes foreign policy, international crisis management, and psychological warfare. He served the presidential administrations of Gerald Ford, Jimmy Carter, Ronald Reagan and George H.W. Bush in the capacity of deputy assistant secretary.\\nHe has come forward with a series of videos that expose the Clintons, explains that they co-opted many central facets of our government including the White House, the judiciary, the CIA, and the FBI. and claims that the corrupt couple belongs to a high-level pedophile ring.\\nPieczenik explains that it was not the Russians who provided information to WikiLeaks – US intelligence offered the data to Julian Assange. This counter-coup is working against Hillary Clinton and her campaign.\\n\\nHere, Pieczenik discusses the Clintons’ connections to Anthony Weiner , Jeffrey Esptein’s Lolita Express, and more.\\n\\nIn this video, Pieczenik reveals the details regarding Democratic Party ‘Fixer,” Jeff Rovin.\\n\\nDr. Pieczenik tells us “the second American revolution” is happening.\\nI hope he’s correct, because we certainly need it.\\nDelivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). '"}, "time": 1742628338.6360583}