{"duration": 0.1058802604675293, "input_args": {"text": "'Swaminomics writes for URT on Demonetization, US elections and other things Posted on \\nIn this guest post for The UnReal Times, Swaminathan S. Anklesaria Aiyar gives his views about the US elections and demonetization: (Image via youtube.com) \\nMany people are asking me about my past predictions. Let me clarify that first. I agree that I had predicted that Modi will never become PM because he will find it difficult to get allies. The entire country reads my articles and when they read this article of mine, all of them became convinced that Modi cannot lead a coalition. So they voted massively in his favor to give him a majority on his own. \\nI had also predicted that “Trump will not just lose, he’ll be thrashed” and also that “Women are saving US from Prez Trump”. However shockingly, he won. I am still looking for the reasons but in the meantime just read my article “Donald Trump no solution to civilization crisis facing the West” where I sum up the crudity, misogyny and contempt for civic values and political correctness that has propelled Donald Trump into the White House. And just look at the first line in this article to see how lost I still am. \\nNow, let’s come back to Narendra Modi and his demonetization. Modi is known to hold grudges and can go to any length for them. We all know how he holds grudges against India’s first family and dropped their name from many schemes. \\nPoor Raghuram Rajan met the same fate. First Modi denied Raghuram Rajan another term. Secondly, as soon as Rajan left, Modi demonetized the currency notes which had Rajan’s signature thereby trying to obliterate his legacy. \\nI know for a fact that Raghuram Rajan keeps several 1000 rupee notes with him. This is not to hoard money but because his signature on the bank notes brings him fond memories and he wants to charm his grandchildren and great grandchildren by showing him notes with his signature. Imagine how grandkids would feel if grandpa gave them a note signed by him and said “Take this, go buy anything you want. I have authorized it.” But Modi does not want Rajan to even enjoy the small joys of life. The entire country has to pay the price for Modi’s vendetta. \\nBut all is not lost. Here is my advice to Raghuram Rajan and Narendra Modi. Guys, bury the past, come together and work for the future of India. After the US elections, America is without doubt more intolerant than India and Rajan will be delighted to work with Modi for the betterment of India. \\nI remember that I had predicted that “If Rajan is asked to leave, India will suffer a mass exodus of foreign portfolio investment. Tens of billions of dollars will flow out, maybe as much as 100 billion (if this coincides with some other bad news like a further Chinese slowdown or British exit from the European Union).” \\nBut both Rajan and Britain left and the market kept going up. This shows the resilience of the Indian economy. Imagine what Modi and Rajan can together do. \\nOf course the global markets have crashed after Trump became president and so I was not completely wrong. Actually I knew that global markets would crash if Trump became president but I never predicted it because the possibility of Trump becoming President never occurred to me. \\nFinally, I would also like to give the Tatas some advice. Close down Tata Steel UK. The British are brave people. Anyone who tries to colonize them bleeds financially.'"}, "time": 1742563464.3314955}