{"duration": 0.06623530387878418, "input_args": {"text": "'BREAKING: Smoking Gun! Shock “Clean Up” Order White House Gave When Hillary Emails Broke \\nSept. 26, St. Peter, Minnesota \\nAs the first presidential debate was about to begin, a woman wearing Trump campaign apparel was assaulted on her way to a debate viewing event. \\nAug. 19, Minneapolis, Minnesota \\nTrump supporters had to face an angry leftist mob when they were leaving a Trump fundraiser at the Minneapolis Convention Center. They were hit, pushed and spat on. \\nAug. 13, Oak Ridge, Tennessee \\nVester Bullock, a 68-year-old cancer survivor, was beaten at a garage sale because he wore a Trump pin on his hat. He was assaulted and punched so hard that he lost a tooth. \\nAug. 12, West Hollywood, California \\nTwo women assaulted pro-Trump activist Tim Treadstone after a Trump rally. They broke his phone, punched him and clawed at his face. They were formally charged with assault and battery. \\nAround Aug. 12, West Hollywood, California \\nOn the night of a rally, Tim Treadstone and other Trump supporters were denied access at a popular Mexican restaurant. Other customers began throwing food and screaming at the group. \\nDuring the rally, “a can of Monster energy drink, eggs and dog feces were also thrown at pro-Trump demonstrators.” \\nAug. 3, Bloomfield, New Jersey \\nAn assailant attacked a 62-year-old man wearing a pro-Trump T-shirt. \\n“The motorist inquired why (the man) was wearing the shirt, directing profanities at him,” a police spokesman stated. “The (victim) continued to walk away as (the) motorist followed him.” \\nThe motorist hit the man several times with a crowbar, causing injuries to his arms, hands, and thighs. \\nJune 18, Las Vegas, Nevada \\nBritish national Michael Sandford , 19, tried to take a gun from a local police officer during a Trump rally. He was arrested and reportedly said he intended to use the gun to kill Trump. (The media had no choice but to report this one.) \\nJune 2, San Jose, California \\nRioters assaulted Trump rally attendees as they left the event while local policed just watched. Since then, 14 of those attacked have filed a class-action lawsuit against the city and Mayor Sam Liccardo. \\nApril 28, Costa Mesa, California \\nAnti-Trump demonstrators threw rocks at moving cars. One bloodied the face of a Trump supporter who was driving away after the rally. \\nMarch 12, Dayton, Ohio \\nAt the airport, Black Lives Matter supporter Thomas Dimassimo rushed the small stage when Trump was speaking. He was tackled by Secret Service agents before he could reach the GOP candidate and was later charged with disorderly conduct and inducing panic. \\nBefore the attack, he had tweeted: “I’ve had about all I can take from the violent trump ralliers. Saturday im (sic) going to check my people and spit on their false king.” \\nAfter his release from jail hours later, he tweeted: “F*** you b**** @realDonaldTrump[.]” \\nThe attack did receive widespread media attention. \\nMarch 11, Chicago, Illinois \\nViolent left-wing demonstrators forced a cancellation of Trump’s rally then celebrated shutting it down, which led to the arrest of four people. \\nThis is by no means a complete list. Other stories continually show that Trump supporters — not Clinton supporters — have been repeatedly denied service, targeted and beaten, chased out of events, and insulted by being cornered and spit on. \\nThis is nobody’s idea of tolerant. \\nH/T Lifezette.com \\nShare this story on Facebook and Twitter and be sure to add your thoughts to the comments below: What other reports of violence toward Trump supporters have you heard? Scroll down to comment below! Advertisement Popular Right Now'"}, "time": 1742561794.6884701}