{"duration": 0.1433429718017578, "input_args": {"text": "'Posted on November 6, 2016 by Carl Herman \\n(Satire) : In an extraordinarily high-tech conference room, a wall of high-definition screens show four faces: George Bush, Sr., George W. Bush, Bill Clinton, Barack Obama; each about 4 feet by 3 feet in a large connected rectangle going clockwise from the top-left position. The room is dark. A male is alone in the conference room; a “Black Hat handler.” (full adult language) \\nBlack Hat: I recommend your closest attention and obedience, because we are quite willing to sacrifice all of you. \\nSr.: Fuck you. We all have dead-man switches to expose you if we go down. We’re in this together. \\nW: Yeah! And we’re not talking about our “switches” being dead no matter how cute and young the boys and girls are at Epstein and pedophile parties ! (and here ) \\nBlack: Fools, silence! We’re trying to help you! \\nBill: “Help” isn’t in your DNA. You play our addictions, and sacrifice us if we’re not of use. But, Bush-Daddy is right: we can take y’all down just as easy as you take us down. \\nBlack: I see. Then you’re all agreeable to end this communication now and scramble in this shit-storm without us? \\nBarack: No. These guys are too old, and one too stupid to care… \\nW: I’m not that old… \\nBarack: … but I’m young enough to want a future. What’s your proposal, sir? \\nBlack: Anyone want to leave this call? \\nSr.: We’re listening. We’ve kept our end of our bargain, and expect you to keep yours. Don’t threaten us. We’re all vulnerable. \\nBlack: You all will continue your roles as former US Presidents, acting as window dressing when called. We have a minor situation to bitch-slap some Boy Scouts leaking e-mails, and will respond as appropriate. \\nOne response is to “select” Hillary in a close “election” with our controlled voting software . We’ll monitor blow-back, and might have her “die” like Enron’s Kenny Lay with Bill following shortly of a “broken heart.” \\n(Black pauses the required moment as all loudly laugh at that ridiculous contradiction) \\nWe will then control events through the cleaner puppet. Another response is to select Trump, have him play ball , or “heart attack” him. \\nBill: So you’re telling us you’ve got this all under control. \\nBlack: As usual. Nothing has changed. \\nW: How do we know you’ve got this managed? \\nBlack: If you can be caught 200 times with a gay male prostitute in the White House pretending to be the highest professional media, and we can make that story “go away” down the sheeple’s memory-hole, we can manage a “few e-mails from Russia” or whatever we end up calling them. \\nW: (whining) And when can we stop pretending to care about these sheeple? (all 4 others roll their eyes) \\nSr.: Junior, our part of the deal is to keep pretending until the population is culled to about a half-billion through conditioning water , food , air , healthcare , vaccines , war , debt , etc. Our Masters’ part of the deal is to use developing clone technology for our class to be young and live forever. We’ll alternate with ongoing sheeple-management roles as demi-Gods, while they work as our servant class. \\nW: Oh, yeah. So stay the course. \\n3 other Presidents: Stay the course. \\nBarack: (lighting a cigarette) You fellas have a lot less to worry about than me. As the current President, I’m the one getting heat. And if those e-mails aren’t silenced, it could get a lot hotter. \\nBill: We all have blood on our hands, Barack. Hundreds of millions dead by Crimes Against Humanity . And it’ll be hotter for me than you if the billions we looted through the Clinton Foundation is exposed. \\nSr.: We’re all rogue state pimps. We all get lynched if one of us goes down. \\nBlack: If you ladies are through chatting… (pauses. The Presidents give their attention) \\nWhat you all have to do is stay on script. Go where you’re told, say what we tell you. If you fuck-up, we’ll kill you and do it without you. \\nYour choice has never changed, and never will: cooperate and have the riches of material existence. When we have full cloning technology, your consciousness can live in a perfect body forever. \\nOr, fuck with us and die. \\nWe need a few more steps to clean this planet of 90% of the sheeple . You “Presidents” (sneers) are the principle puppets of our agents to keep the sheep waddling to the slaughter house. \\nAre we all in agreement for your cooperation? \\n4 Presidents: Yes, Sir. \\n4 Presidents: Hail Satan ! \\nScene dissolves into a modern newsroom’s broadcast: \\nAnchor 1: And that captured and leaked Skype call was the latest in the ongoing disclosure of how captured humanity was to total evil. \\nAnchor 2: Next: How public education is catching-up from their capture to graduate for Truth, Love, and Technology ! Stay tuned. \\n** \\nSimilar to Emperor’s New Clothes satire, the real-world crimes are easy to explain, document, and prove: The Crimes The US is a literal rogue state empire led by neocolonial looting liars. The history is uncontested and taught to anyone taking comprehensive courses. If anyone has any refutations of this professional academic factual claim for any of this easy-to-read and documented content , please provide it. US ongoing lie-started and Orwellian-illegal Wars of Aggression require all US military and government to refuse all war orders because there are no lawful orders for obviously unlawful wars. Officers are required to arrest those who issue obviously unlawful orders. And again, those of us working for this area of justice are aware of zero attempts to refute this with, “War law states (a, b, c), so the wars are legal because (d, e, f).” All we receive is easy-to-reveal bullshit . When Americans are told an election is defined by touching a computer screen without a countable receipt that can be verified, they are being told a criminal lie to allow election fraud . This is self-evident, but Princeton , Stanford , and the President of the American Statistical Association are among the leaders pointing to the obvious (and here , here , here , here , here , here , here , here , here , here , here , here , here , here , here , here , here , here ). Again, no professional would/can argue an election is legitimate when there is nothing for anyone to count. And, duh, corporate media are criminally complicit through constant lies of omission and commission to “cover” all these crimes. Historic tragic-comic empire is only possible through such straight-face lying, making our Emperor’s New Clothes analogy perfectly chosen. The top three benefits each of monetary reform and public banking total ~$1,000,000 for the average American household, and would be received nearly instantly. Please read that twice. Now look to verify for yourself . Demanding arrests as the required and obvious public response rather than ‘voting’ for more disaster: \\nThe categories of crime include: Wars of Aggression (the worst crime a nation can commit). Likely treason for lying to US military, ordering unlawful attack and invasions of foreign lands, and causing thousands of US military deaths. Crimes Against Humanity for ongoing intentional policy of poverty that’s killed over 400 million human beings just since 1995 (~75% children; more deaths than from all wars in Earth’s recorded history). \\nUS military, law enforcement, and all with Oaths to support and defend the US Constitution against all enemies, foreign and domestic, face an endgame choice: Demand arrests , with those with lawful authority to enact it. An arrest is the lawful action to stop apparent crimes , with the most serious crimes documented here meaning the most serious need for arrests. Watch the US escalate its rogue state crimes that annually kill millions, harm billions, and loot trillions. \\nIn just 90 seconds , former US Marine Ken O’Keefe powerfully states how you may choose to voice “very obvious solutions”: arrest the criminal leaders (video starts at 20:51, then finishes this episode of Cross Talk ): Solutions worth literal tens of trillions to ‘We the People’: \\nAgain: The top three benefits each of monetary reform and public banking total ~$1,000,000 for the average American household, and would be received nearly instantly. Please read that twice. Now look to verify for yourself . We can quantify the end of the lie-started and illegal Wars of Aggression quickly into the trillions, and that said, it’s worth a lot more than what we quantify. Truth : a world in which education is expressed in its full potential to only and always begin with good-faith effort for objective, comprehensive, and verifiable data. \\n“Interview” series:'"}, "time": 1742561976.676571}