{"duration": 0.08501529693603516, "input_args": {"text": "'According to The New York Times, the vice chairwoman of the Democratic National Committee has been disinvited from the Democratic debates. Representative Tulsi Gabbard did confirm this. \\nThe New York Times reported : “Ms. Gabbard confirmed on Sunday that her chief of staff received a message last Tuesday from the chief of staff to Representative Debbie Wasserman Schultz, the chairwoman of the national committee, about her attendance at the debate.” \\nSo why? \\nThe day before receiving the email Gabbard called for more debates on MSNBC. “More and more people on the ground from states all across the country are calling for more debates, are wanting to have this transparency and greater engagement in our democratic process at a critical time, as they make the decision of who should be the next person to lead our country.” \\nSunday night, Gabbard spoke with The New York Times: “When I first came to Washington, one of the things that I was disappointed about was there’s a lot of immaturity and petty gamesmanship that goes on, and it kind of reminds me of how high school teenagers act… It’s very dangerous when we have people in positions of leadership who use their power to try to quiet those who disagree with them. When I signed up to be vice chair of the D.N.C., no one told me I would be relinquishing my freedom of speech and checking it at the door.” \\nWow. \\nAn anonymous source with ties to the committee disagrees and according to The New York Times: “… an aide to Ms. Wasserman Schultz expressed a desire to keep the focus on the candidates as the debate approached, rather than on a ‘distraction’ that could divide the party, and suggested that if Ms. Gabbard could not do that, she should reconsider going. She was not uninvited. The D.N.C. team wanted this first debate to have all the focus on the candidates. Gabbard’s people were told that if they couldn’t commit to that since Tulsi was trying to publicly divide the D.N.C. leadership last week, then they should consider not coming. The fact that she is still making this about her and not our great candidates by talking to The New York Times says something unfortunate.” \\nYou know, I love how the Wasserman Schultz camp is trying to spin this and make Tulsi look like the villain wanting attention. Tulsi is a bad person for voicing an opinion that the majority of Democrats have? If that’s the case, I applaud her for being the villain. Even if she wasn’t disinvited, the fact that it was suggested is remarkably disgusting. \\nThe fact is many Americans want more debates. Several of the few candidates have called for more debates. What’s the f**king hold up here? What’s the problem? Does Wasserman Schultz have her head so far up someone’s colon that she can’t hear what the American people are screaming at her? \\nLet me speak a little louder. Can you hear me now Debbie? We are not happy. We want more debates. We are not the ones dividing the party. You and the leadership put in place to serve Democrats nationwide are dividing the party. You are not listening to us. That’s the dividing factor. Not us. It’s not dividing a party when you’re speaking up for the ignored majority. \\nThis isn’t about wanting Bernie to annihilate Hillary. This is about listening to a majority of American citizens who put you in your chair. I can only hope there will be audience members holding signs up calling for more debates to show that it’s not just attention-seeking. \\nFeatured image by DonkeyHotey via Flickr under a Creative Commons Attribution Generic license. About Liz'"}, "time": 1742564136.1710575}