{"duration": 0.017753124237060547, "input_args": {"text": "\"  CALEXIT 2019: Powerful California To Become New Independent Country   40 million Economically Powerful Californians Sickened by White Nationalism & KKK Confederate Racists Don't Want Trump's Racist Bigoted America! Time to Say Goodbye! \\nLast nights horrific devastating Presidential election results have sparked a fire that Trump’s Racist USA will NOT be able to put out! The 2019 #Calexit Independence Referendum movement has has caught fire! \\nIn the Spring of 2019, Californians will go to the polls in a historic vote to decide by referendum if California should exit the Union, a #Calexit vote. \\nYou will have this historic opportunity because the Yes California Independence Campaign will qualify a citizen’s initiative for the 2018 ballot that if passed would call for a special election for Californians to vote for or against the independence of California from the United States. Sign Up Now To Support Calexit 2019 >>> \\nThis is a very important question. It is the responsibility of this campaign to explain what a yes vote will mean for you, your family, your community, our state, our country, and our world. We have designed this website to answer many of these questions and look to you to ask more. \\n“As the sixth largest economy in the world, California is more economically powerful than France and has a population larger than Poland. Point by point, California compares and competes with countries, not just the 49 other states.” \\nIn our view, the United States of America represents so many things that conflict with Californian values, and our continued statehood means California will continue subsidizing the other states to our own detriment, and to the detriment of our children. \\nAlthough charity is part of our culture, when you consider that California’s infrastructure is falling apart, our public schools are ranked among the worst in the entire country, we have the highest number of homeless persons living without shelter and other basic necessities, poverty rates remain high, income inequality continues to expand, and we must often borrow money from the future to provide services for today, now is not the time for charity. \\nHowever, this independence referendum is about more than California subsidizing other states of this country. It is about the right to self-determination and the concept of voluntary association, both of which are supported by constitutional and international law. \\nIt is about California taking its place in the world, standing as an equal among nations. We believe in two fundamental truths: (1) California exerts a positive influence on the rest of the world, and (2) California could do more good as an independent country than it is able to do as a just a U.S. state. \\nIn 2016, the United Kingdom voted to leave the international community with their “Brexit” vote. Our “Calexit” referendum is about California joining the international community. You have a big decision to make. Related Posts:\""}, "time": 1742628585.701385}