{"duration": 0.0356450080871582, "input_args": {"text": "'Politico reports Sunday: “The push to block, rewrite and delay scores of   rules may be the [Trump] administration’s biggest untold success. ”[That declaration comes just one month after Politico mocked President Donald Trump’s efforts to use the Congressional Review Act (CRA) to reverse his predecessor’s rules: none of it, Politco declared, “evoke[d] the      populism that Trump rode to the presidency. ”  “Trump’s ardent supporters and detractors alike tend to exaggerate the impact of the 13 rules he’s rescinding, out of more than 20, 000 approved under President Obama,” Politico’s Michael Grunwald wrote on April 10, adding: “For the most part   …     Republicans won’t score many political points with their CRA victories. ” He also argued that the deadline for repealing   regulations on the CRA had tolled (though others would argue it extended all the way back to the beginning of Obama’s presidency, covering any regulation that was not reported to Congress). At the time, Breitbart News called Trump’s use of the CRA a “legislative milestone,” arguing that Trump’s “use of the CRA to repeal regulations has put future administrations on notice that there is a limit to government’s regulatory reach, and that given the opportunity by the voters, conservatives will enforce those limits. ” Now, Politico’s Andrew Restuccia and Nancy Cook seem to agree  —   and they fill in the rest of the picture, noting that Trump’s executive orders and executive actions amount to “a series of actions that could reshape American life for decades  —   efforts to rewrite or wipe out regulations affecting everything from student loans and restaurant menus to internet privacy, workplace injuries and climate change. ” They add: Trump is   …     setting bureaucratic wheels in motion that could eventually ax or revise hundreds of regulations as agencies reorient themselves toward unwinding red tape and granting speedier approvals to projects   …     If successful, these efforts could represent the most   rollback of federal regulations since Ronald Reagan’s presidency, especially if Trump’s proposed budget cuts make it hard for a future Democratic president to reaccelerate the   apparatus. Trump’s assault on regulations represent a fulfillment of a core campaign promise, and the execution of what adviser Steve Bannon called in February the “deconstruction of the administrative state. ” Read the full Politico article here. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742562620.659182}