{"duration": 0.22749972343444824, "input_args": {"text": "'Email \\nA few weeks ago the Metropolitan Opera at Lincoln Center celebrated its 50 th anniversary. It was back on September 16, 1966 that the Met opened its doors at the newly built Lincoln Center (its previous home was a few blocks away) with the premiere of Samuel Barber’s Anthony and Cleopatra. Recent years have seen the Met in financial trouble. If the National Endowment for the Arts is to be believed the audience for opera is in decline- back in 2002 the percentage of American adults that see their annual opera was 3.2; by 2012 it dropped to 2.1 percent. Given its gigantic 3800 seat structure the company is forced season after season to stage grand operas, i.e. operas that even occasional viewers have seen at least once, at the expense of newer smaller scale pieces. A couple of decades ago the Met earned 90 percent of its potential box office revenue, a number that has dropped to 66 percent last season. Prices are up to on average about $160 per head (besting the average Broadway ticket by over $50). The company’s plan to have performances screened in movie theaters and libraries has generated some revenue but seemingly not enough. A couple of years ago the start of the opera season was almost derailed by a strike by its unionized set artists and camera operators over company calls for a pay cut. \\nIt’s an ironic fate for a grandly built structure that was billed as a Cold War asset whose purpose was to elevate the cultural taste of the masses. Designed by a group of then prestigious architects coordinated by Wallace Harrison of the firm Harrison and Abramovitz, who had a similar role in designing the UN, Lincoln Center’s imposing blend of classicism and modernism has few architectural defenders. Missing from any promotions about the 50th Anniversary Gala is a reference to another musical with roots that go back to Lincoln Center’s origin. West Side Story opened on Broadway in 1957. By the time the Jets and Sharks met on the big screen in 1961, their Lincoln Square neighborhood was bulldozed to make way for Lincoln Center. The local working class population and a mosaic of small businesses, there were over 600 in the project footprint, were displaced. \\nBy no means was the clearing out of 48 acres for Lincoln Center the only such West Side initiative. This was the era of Robert Moses and slum clearance and the West Side was a prime target. Further uptown the Morningside Heights-Manhattanville neighborhoods, which like Lincoln Square were working class with a growing Puerto Rican population, saw their share of destruction and displacement, mostly to make way for new housing its residents couldn’t afford. \\nIn the present day West Side the beat goes on. Recently Thomas Heatherwick’s centerpiece design for Hudson Yards was unveiled. Named ‘Vessel’, the $150 million structure will stand 15 stories and feature 154 interconnecting staircases with 2500 climbable stairs. Hudson Yards, which its developers bill as ‘the largest private real estate deal in the history of the United States’ (the main developer is Related Companies, probably the biggest developer in the city), is slated to be the city’s next great commercial district, a 21 st century Rockefeller Center, with over a dozen skyscrapers, millions of square feet of office space, and luxury housing (with the requisite small percentage labeled ‘affordable’). Built on 26 acres own by the MTA, the public corporation that runs the city’s buses and subways and the Long Island Railroad (the land has served as a storage facility for trains from nearby Penn Station), the neighborhood has long been in the sites of politicians and urban planners- full of truck stops and warehouses it has been almost universally declared the ‘last undeveloped land’. The ultimate vision has been to move Midtown’s CBD across 8 th Ave into Hell’s Kitchen which, while gentrifying in recent times, still retains some of its historic working and middle class, the last such place in the middle of Manhattan. The beauty of the acreage belonging to the MTA is that technically as a state agency plans for their use are somewhat exempted from the normal city review process. The tragedy is as an agency whose leadership is appointed by the state and city, and is subsidized heavily by both, it isn’t hard to imagine property it owns becoming, with only a bit of political maneuvering, in some way public. Instead the subsidies are again flowing to a developer: a $3 billion bond offering, a promise to pick up any debt service shortfall, and one to cover any over budget costs for the subway expansion to the development. By the end of 2014 the city paid out $650 million. Even city officials acknowledge such subsidies will be needed until 2019. \\nThe backdrop to Hudson Yards is the High Line. A much lauded 1.45 mile elevated park built on the leftover tracks from New York Central Railroad’s West Side Freight Line, the High Line draws millions of visitors a year. Targeted to be torn down at several instances, its preservation was spearheaded by a grassroots effort (the Friends of the Line now maintain and operate the park, a public-private arrangement that characterizes many of the city’s parks going back to the early 1980s). The High Line draws raves from planners worldwide; however absent other reform the practical effect of the High Line has been to send property values soaring. It was soon surrounded by a stream of starchitect designs including Norman Foster, Rem Koulhass, and the late Zara Hadid. Hadid, renowned for being the first female recipient of the Pritzker Prize, also became somewhat infamous for an August 2014 answer to an interview question about working conditions in Dubai where she designed the Al Wakrah stadium for the 2022 World Cup. When questioned about the fatal conditions for construction workers Hadid coldly replied ‘I have nothing to do with the workers. I think that’s an issue the government – if there’s a problem – should pick up. Hopefully, these things will be resolved.’ While there have been no worker fatalities building 520 West 28 th , the social effect for New York can be inferred from the prices that range from just under $5 million up to $50 million per unit. 520 W 28 th by Zara Hadid. \\nEarlier this year downtown saw the opening of Santiago Calatrava’s Oculus. Built at the foot of the rebuilt World Trade Center (the original version, a product of the Rockefeller family’s desire to rescue their real estate investments in what was then a depressed downtown, itself was a destroyer of tens of thousands of jobs along Radio Row, and another project that was built on land owned by a public corporation- The Port Authority of New York and New Jersey) Conceived in post 9/11 narcissism The Oculus came in a decade late it for a price tag of over $4 billion, about triple its initial cost estimate. This boondoggle of a train station will serve less than 50,000 riders a day. \\nA short walk from there up Broadway and one will catch sight of Frank Gehry’s 8 Spruce St with an average rent of $5500 a month. Meanwhile over on the Lower East Side, the corner of Delancy and Essex Streets display a close-up view of Bernard Tschumi’s Blue Condominium. The average sale price there is $1.5 million. A little further uptown, the American Cooper Buildings will soon open on First Avenue. Designed by SHoP Architects, these twin towers feature a copper facade with a three story sky bridge connecting them- the bridge is equipped with a gym and 75 foot lap pool (SHoP also designed the hideous Barclays Center in Brooklyn for the Nets-another eminent domain inspired effort). If height is your thing, Billionaire’s Row on West 57 th Street features Rafael Viñoly’s 432 Park Avenue, currently the tallest residential building in the world. At 93 feet wide and 1396 feet tall, it’s 15 times as tall as wide. The penthouse went for $95 million, just below the $100.5 million penthouse sale at the Christian de Portzamparc designed One57 right down the street. 432 Park by Rafael Viñoly. \\nIt wasn’t all that long ago when architecture represented something besides extreme global inequality and cultural homogeneity. In a 2007 essay titled ‘What Happened to the Social Agenda’, sociologist Nathan Glazer wrote: \\nModernist architects and city planners believed they could do better than the profit-inspired builders of housing for the working classes who crowded as much building as they could onto the land available. It seemed to make sense, and indeed it made some sense. \\nThe public housing Glazer referred to here has for decades been reviled. Its rational architecture came to be seen as isolating and plain. From a theoretical standpoint it was said to be given the coup de grâce by Jane Jacobs in her book The Death and Life of Great American Cities (though this is simplistic, Jacobs supported the building of the modernist West Village Houses, not public housing but originally part of the Mitchell-Lama program, a state housing program aimed at the working class). Surely Robert Moses was more interested in ‘slum clearance’ than housing the working class. That doesn’t change the fact that public housing, at least at first, improved housing conditions for working poor. Nor can architecture’s interest in the issue be denied. Politically public housing was left to rot by federal withdrawal, poor (often racist) placement, subsidized suburbs, and ideology. St Louis was the first city to demolish its public housing: the Pruitt Igoe complex was dynamited live on TV in 1972. By the time the destruction came Pruitt Igoe was so run down its occupancy was less than 35 percent. More recently Chicago took its turn. However in New York, for all its flaws and debt, public housing is functioning well enough to have a waiting list. The decline of public housing in most cities was a failure of politics; still architecture also took the blame. \\nFor modernism’s failures real and perceived, Glazer wrote of architects: \\nThe architect could then conclude that if modernism could do nothing for social problems, if the expectations of architectural determinism were naïve, why bother: Let us devote ourselves to architecture alone- to building design and form -instead of to architecture and city planning \\nIn other words status quo, political neutral buildings that reflect the excess of the global elite while demonstrating no purpose beyond their own genius. It goes without saying that architects can’t determine city planning policy on their own, yet there is no reason, given the housing crisis ravaging many cities, for the profession not to push the envelope in a more inclusive direction. And there is no inherent reason such a movement would have to return to the bland bricks of modernism’s housing projects. Earlier this year 2016 Pritzker Prize winner, Chilean architect Alejandro Aravena , posted a number of his designs for low-cost housing for free on his firm Elemental’s webpage. In an interview with Dezeen, Aravena said of architects and social housing: ‘But the constraints are not just budget constraints – the building logic, the political framework, and the policies, are part of the equation and we’re not well trained for that. We’re never taught the right thing at university.’ \\nOne can only hope that changes. Architects can be valuable allies to progressive city planning. For that to happen though the word ‘starchitect’ would have to take on different, and grander, meaning.'"}, "time": 1742562536.3161325}