{"duration": 0.10875344276428223, "input_args": {"text": "'WASHINGTON  —   Representative Kevin McCarthy, the House majority leader, said Tuesday that Democrats who essentially seized the House floor last month to protest the lack of votes on gun legislation might be punished for breaking House rules. The behavior was not “becoming of the U. S. Congress,” Mr. McCarthy told reporters. He said he had been told that Democrats had mistreated House staff members and had perhaps even damaged congressional furniture during their    protest. Mr. McCarthy said that he and the House speaker, Paul D. Ryan, would soon meet with the House    to discuss investigative paths and possible ramifications for the Democrats. “This is not the way the House should work,” Mr. McCarthy said. “You first have to know all the facts. Action has to be taken on behavior taken toward professional staff. ” But Mr. McCarthy’s comments seemed more indicative of the gulf between the parties than of any real likelihood of punishment for Democrats. Censure of individuals seems very unlikely, given how many participated, and any attempts to penalize them could backfire, with Democrats wielding any such penalty as a badge of honor for their willingness to take on the majority. Filming and streaming video in the House  —   which the Democrats did after the regular television feed ended when Republicans gaveled the House into recess  —   are violations of the chamber’s rules. Other potential violations include standing in the well of the House floor and cutting off debate. An outside group has made a referral to the Office of Congressional Ethics regarding   solicitations issued during the  . As Democrats considered their next steps on gun legislation, Mr. Ryan was to meet Tuesday evening with Representatives John Lewis of Georgia and John B. Larson of Connecticut, the organizers of the  . But the outcome seemed predetermined: Mr. Ryan, who has dismissed the protest as “a political stunt,” suggested in an interview on a Wisconsin radio program  earlier Tuesday that he would not bring up Democratic proposals for a vote. Representative Nancy Pelosi of California, the minority leader, scheduled a news conference with advocates for Wednesday morning to keep pushing Republicans, who could face significant risks in voting on gun legislation in a contentious election year. Republicans said they intended to hold a vote this week on a measure to prevent terrorists from obtaining guns. Under the bill, the government could block the sale or transfer of a gun if it demonstrated to a judge within a few days that an individual may have links to terrorism. Similar legislation recently failed in the Senate after Democrats panned it as toothless. “The lengths the House Republican leadership will go to follow the N. R. A. ’s marching orders know no bounds,” said Drew Hammill, Ms. Pelosi’s spokesman. House Democrats made it clear that they would not stand down and were keeping their options open as they returned from the Fourth of July recess. Last week, more than 60 Democrats participated in rallies, news conferences and other events around the country on a declared “national day of action,” trying to energize supporters and keep up pressure on Republican leaders. Speaking from the House floor before their meeting, Mr. Larson called on Mr. Ryan to hold votes on measures that would restrict access to guns for those on the government’s   list and expand background checks. Urging him to remember that “he is, indeed, speaker of the entire House,” Mr. Larson said that “we’re prevailing upon the decency of the other side, their understanding of the Constitution, their understanding of the rules of the House. ” Representative Tom McClintock, Republican of California, said Democrats had engaged in “one of the most disgraceful and childish breaches of the institution” by seizing the House floor on June 22. “They certainly have a right to their opinions,” he said. “They have a right to express those opinions on the House floor, and they have a right to use all of the procedures of the House to act on their opinions. What they do not have is the right to prevent those with different views from exercising the same rights, and yet that is precisely what they did. ”'"}, "time": 1742564562.8592932}