{"duration": 0.13320565223693848, "input_args": {"text": "'Home » Gold » Gold News » How Will Clinton – Comey Affect Gold Prices? \\nWhat happens to gold and silver prices when the markets suddenly and violently un-price a Hillary Clinton Presidential Victory? \\n\\nFrom Keith Weiner : \\nTwice this past week, the prices of the metals spiked. Once on early Monday due to a cause unclear to us. The second on Friday late morning (Arizona time) due to, get this, additional problems for Democrat Hillary Clinton. The stock market dropped at the same time that the prices of the metals surged. Call it the confidence speculation. \\nThe price of gold ended the week +$10, and that of silver +$0.18. \\nWas it speculation? Or was it, this time for once, stackers going bananas buying up metal along with dried food, barrels of water, prime bunker real estate, and lead (ammo)? \\nBefore we get to that, we want to tackle a fallacy that comes up over and over again. How do you define or measure the value of money? \\nThe same school of thought that gives us the Quantity Theory of Money — which Keith has debunked decisively , and which we have spent so many words in this Report addressing its implications for the price of gold — offers a simple answer. Tempting, because it sounds so simple, it’s utter rubbish. What’s the idea? \\nYou measure the money by its purchasing power . Prices are measured in money. So why not reverse it, and measure the money by … prices?! Well, for one thing, it’s circular. Self-referential. Infinite recursion , in the terminology of computer science. \\nBut more importantly, this view lumps taxes, regulations, labor law, lawsuits, compliance and you name it, all together. If the government adds a costly new tax which wipes out half an industry, you can bet (literally!) that the product of the remaining companies will sell at higher prices. Maybe much higher prices. \\nBut does this mean that the money has gone down in value? That it is on the path to hyperinflation, even? No. \\nTaxation is not a monetary phenomenon. \\nFurther, suppose you look at prices in different cities. For example, things are cheaper in Yuma Arizona, than in New York City. Can we compare the Yuma dollar purchasing power to the New York City dollar? Of course not. It’s the same US dollar! \\nWe contend that there is only one way to measure the value of the dollar. Look at its price in gold. As of Friday, that is 24.4 milligrams. \\nAnd how do you measure the value of an ounce of gold? Let’s make an analogy to gold’s abundance. We content that gold is the most abundant commodity (with the exceptions of air and water). How is that? We measure abundance, not by absolute quantity, but by a ratio of stocks to flows. It would take all the gold mines in the world many decades to produce the amount of gold now known to be held in human hands (which number we believe is underestimated substantially). No other commodity (except silver) comes remotely close to this. \\nThe approach to measuring gold’s value is similar. The value of the next ounce (N+1) is measured relative to the prior (N). Let’s look at water to contrast with gold. \\nSuppose you’re walking through the Arizona desert in July. The temperature might be 120 degrees Fahrenheit (49C). You get so thirsty that you could die very quickly. You walk up to someone selling gallon jugs of water. What would you pay for the first? \\nIt’s worth nothing less than your life. \\nHow about the second? You will need it to walk back to civilization. The third? A spare. The fourth? Zero, zilch, nil. \\nValue(1) = ∞ Value(3) = 1 Value(4) = 0 \\nThe value of each unit of water is not merely lower than the previous unit, but massively lower. \\nFor gold (you knew this was coming) the value is flat. That is, anyone will happily accept the fourth gold coin just as the first. And the 104 th the same as the 101 st . \\nThis is an important feature for money, is it not? It means that any business, no matter how large, can keep its books using gold. Even as the balance sheet grows, the value of the unit of account — the numeraire — remains constant. \\nKind of like how engineers rely on the constant length of the meter stick, no matter how tall the building. Imagine if they used some sort of rubber band to measure length and the higher the skyscraper, the shorter the rubber band shrank! Construction above one story would be impossible. \\nWell, if the unit of account varied in value as water does, economic calculation beyond a simple subsistence farm would be impossible. \\nRead on for the only true picture of the fundamentals of the monetary metals. But first, here’s the graph of the metals’ prices. \\nThe Prices of Gold and Silver \\nNext, this is a graph of the gold price measured in silver, otherwise known as the gold to silver ratio. It didn’t move this week. \\nThe Ratio of the Gold Price to the Silver Price \\nFor each metal, we will look at a graph of the basis and cobasis overlaid with the price of the dollar in terms of the respective metal. It will make it easier to provide brief commentary. The dollar will be represented in green, the basis in blue and cobasis in red. \\nHere is the gold graph. \\nThe Gold Basis and Cobasis and the Dollar Price \\nCould the scarcity (i.e. cobasis, the red line) be rolling over? It’s too early to tell, but bears watching. \\nThe fundamental price of gold barely budged, though it’s about twenty bucks below the market price. \\nNow let’s look at silver. \\nThe Silver Basis and Cobasis and the Dollar Price \\nLast week, we asked: \\nThe big question this week: does the buying of metal remain strong, or is this just another flash in the pan? \\nSo far, the buying has held up. The fundamental price is up just about as much as the market price. \\nLet’s put this in perspective. Below is a graph showing not the prices of the metals, but premium vs discount. The green region at the bottom represents discount, and thus a safe place to buy. The red region at the top represents danger, as you’re overpaying. \\nNote that silver has not been offered at a discount in quite some time. This does not mean that the price has to crash tomorrow morning. But it does mean you’re paying a speculative premium. Maybe you will get a chance to unload to the next speculator at an even higher price, but maybe not. \\nGold was in discount through around the end of April. It tipped into discount at the end of August. It’s now selling at a premium, though not a large one. \\nThe Premium on gold and silver \\n\\nBuy 2017 Gold Pandas and Buy 2017 Silver Panda Coins On Pre-Sale Now! Secure Your 2017 Panda Coins Today at SD Bullion!'"}, "time": 1742563977.767145}