{"duration": 0.08038854598999023, "input_args": {"text": "'As Republican lawmakers prepare to leave Washington for a weeklong congressional recess, liberal groups and Democratic Party organizers are hoping to make their homecoming as noisy and uncomfortable as possible. But national organizers concede they are playing   to a “  level” of   activism that has bubbled up from street protests and the small groups that have swelled into crowds outside local congressional offices. Protests against the Republican agenda have become routine since President Trump took office, with momentum building through widely shared videos of lawmakers being confronted by constituents angry over efforts to repeal the Affordable Care Act. Now, national groups see the recess as the chance to capitalize on that local activism, with a show of might aimed at declaring the arrival of a new, and sustainable, political force  —   barely three months after their humiliating defeat in November. In email alerts, MoveOn. org is mobilizing members to attend    meetings across the country, and it has set up a website, ResistanceRecess. com, to help people find them. The site includes a guide to “health care recess messaging. ” (“The best and most impactful questions are ones where someone shares their story about what the Affordable Care Act has meant to them or their family,” it instructs.) Organizing for Action, the political nonprofit group that grew out of former President Barack Obama’s election campaign, has created a “Recess Toolkit” with suggestions on how to effectively ask questions at the events. Last week, the group held an online seminar with members of Indivisible, the most prominent activist organization to emerge in response to Mr. Trump’s election, to coach supporters on how to challenge lawmakers  —   in a “civil and respectful way” advised one strategist, according to a recording of the session. Planned Parenthood is hoping to flood the sessions with members in pink   urging Congress to keep in place the health care law and the organization’s funding. “It’s going to be intense,” said Emily Tisch Sussman, who leads the political arm of the Center for American Progress, a liberal think tank in Washington. “All every group wants to know is how to find out where the town halls are going to be. ” The recess, traditionally a time for lawmakers to take the temperature of their constituents, comes at a surprisingly vulnerable moment for Republicans. They are struggling to gain traction on a legislative agenda despite controlling both congressional chambers and the White House, as the new administration remains mired in controversy over its targeted travel ban and   contact with Russia, among other issues. While complaints about the health care act  —   high premiums in particular  —   helped elect Mr. Trump, polls show it has become more popular as voters realize that repealing it would mean that an estimated 30 million people lose health insurance. There are few indications at this point that the conservative base of the Republican Party is mobilizing for action on a large scale during the recess. FreedomWorks, the   libertarian group that in 2009 nurtured Tea Party groups to rally against the legislation that became the health care act, said it was planning a Washington rally next month to let lawmakers know that there remained significant opposition to the Affordable Care Act. But just as the energy after Mr. Obama’s inauguration seemed to be on the right, this year it seems to be on the left.   demonstrations in some cities this month were met with much larger crowds of abortion rights supporters. At a widely viewed    meeting held by Representative Gus Bilirakis in Florida, a local Republican Party chairman who declared that the health care act set up “death panels” was shouted down by supporters of the law. Several Republicans, including Mr. Trump, have dismissed the   care act crowds as “paid protesters,” not constituents. Sean Spicer, the White House press secretary, without offering evidence, called the protests a “very paid,   movement,” unlike the Tea Party demonstrations against the drafting of the health care law in 2009, which he characterized as “very organic. ” In fact, some of the most formidable and   organizing groups on the left have found themselves scrambling to track all of the local groups sprouting up through social media channels like Facebook and Slack, or in local “huddles” that grew out of the women’s marches across the country the day after the inauguration. “We’re just constantly being flooded with people asking us, ‘What can we do, where can we go? ’” said Ben Wikler, the Washington director of MoveOn. org, who coined the “  level” description. “For politicians to imagine that it’s something that any group could turn on and off like a light switch is a critical miscalculation. ” Ms. Sussman spent much of one morning this week communicating with 1, 600    activist groups on a Slack channel that one of them organized. “It doesn’t work for organizations to bigfoot strategy it’s not the way organizing happens now,” said Kelley Robinson, the deputy national organizing director for Planned Parenthood, which is fighting the defunding of its health clinics. “There are bigger ideas coming out of the grass roots than the traditional organizations. ” Established groups in Washington are running more traditional campaigns. The Alliance for Healthcare Security, a coalition of health care worker unions and other groups, is running television and online ads during the recess in five states where it believes Republican senators are either inclined to vote against a repeal of the Affordable Care Act, or vulnerable to defeat in   bids if they vote for repeal. The ads  —   in Alaska, Arizona, Maine, Nevada and West Virginia  —   feature constituents with   diseases telling emotional stories about how the health care law saved their lives. The Democratic Congressional Campaign Committee is keeping track of Republican lawmakers who do not hold    meetings. Some events have been canceled. Representative Tom MacArthur of New Jersey told voters who pressed for town halls that he was not scheduling them because they had been “hijacked” by groups hostile to Mr. Trump. The committee plans to run internet ads trying to shame lawmakers for not facing their constituents in public since voting last month on a procedural motion aimed at repealing the health law. Some of the most creative activity is coming from people who are new to political activism. In Plymouth, Minn. Kelly Guncheon, a financial planner who described himself as an independent, has organized a “With Him or Without Him” meeting for Representative Erik Paulsen, a Republican who has not scheduled any of his own. A volunteer offered to make 400 cupcakes decorated with a “Where’s Waldo?” picture of Mr. Paulsen’s face, and Mr. Guncheon said he planned to project onto screens legislation that Mr. Paulsen had supported. Participants will be asked to write down questions, which will be delivered, along with a recording of the event, to Mr. Paulsen’s congressional office after the recess. Mr. Guncheon, like other new activists, said he was not looking to traditional political groups for guidance. “In this new culture, this new era, we have to figure out new ways to do things,” he said. “There’s certainly no leadership at the head of the Democratic Party, or the state party. Not that I’m a Democrat anyway, but that seems to be the opposition party. ” Other new groups organizing on Facebook have arranged similar events, calling them “ ” or “ ” meetings, for Senators Cory Gardner of Colorado and Patrick J. Toomey of Pennsylvania, as well as for Republican lawmakers from California, New Jersey and New York. In response to Mr. Gardner’s complaints that the people showing up at his office to request    meetings were paid protesters from other states, one group showed up at his office with a banner on which members had written their Colorado ZIP codes. National groups are looking past the recess, to try to keep up the momentum for the local efforts. Ms. Sussman, at the Center for American Progress, said her group planned a training and planning session in April for new activist leaders. Save My Care, another Washington group, is to begin an online campaign on Monday where people can register to have a hospital wristband sent to their congressional representative. The wristbands, which read “I will lose my health care if you vote to repeal,” will be delivered to Congress after the recess. Planned Parenthood is signing up “defenders” and holding   training sessions to help teach new activists how to tell reporters and lawmakers their personal experiences with the group’s health services, and what it would mean to lose them. The group is planning a rally in Milwaukee on Feb. 25, the last weekend of the recess week, with Planned Parenthood patients from Speaker Paul D. Ryan’s district expected to testify how they would be affected if clinics lost funding. Mr. Ryan has said he would defund Planned Parenthood in any repeal of the Affordable Care Act. Still, said Nicole Safar, the group’s director of government relations in Wisconsin, “This is more about   than targeting Paul Ryan. ” “This is a marathon, not a sprint,” she said. “We’re going to put as much pressure as we can on Paul Ryan during the recess, for sure, but this isn’t going to end any time soon. ”'"}, "time": 1742628510.7092116}