{"duration": 0.09816217422485352, "input_args": {"text": "'Russian Scientist Says Newest Ice Age is Happening Now November 02, 2016 Russian Scientist Says Newest Ice Age is Underway \\nA new study by a prominent Russian astrophysicist claims the “new Little Ice Age” started at the end of 2015 due to low solar activity, kicking off decades of “deep cooling” in the latter half of the 21st Century. “As a result, the Earth has, and will continue to have, a negative average annual energy balance and a long-term adverse thermal condition,” Dr. Habibullo Abdussamatov , who is the head of space research for the Pulkovo Observatory at the Russian Academy of Sciences, wrote in a recent study. “The quasi-centennial epoch of the new Little Ice Age has started at the end 2015 after the maximum phase of solar cycle 24,” Abdussamatov wrote. “The start of a solar grand minimum is anticipated in solar cycle 27 in 2043 and the beginning of phase of deep cooling in the new Little Ice Age in 2060.” Abdussamatov’s latest work was translated into English and featured in a new book by geologist Don Easterbrook on evidence opposing the mainstream view that carbon dioxide is the main source of recent global warming. \\nAbdussamatov argues that declining solar activity will cause a gradual cooling over North America and Europe, which could recreate the conditions experienced during the “Little Ice Age”— cooler periods from Middle Ages to the mid-19th Century that coincided with a lull in sunspots. \\n“The gradual weakening of the Gulf Stream leads to stronger cooling in the zone of its action in western Europe and the eastern parts of the United States and Canada,” Abdussamatov wrote. \\n“Quasi-bicentennial cyclic variations of [total solar irradiance] together with successive very important influences of the causal feedback effects are the main fundamental causes of corresponding alterations in climate variation from warming to the Little Ice Age,” he wrote. \\nAbdussamatov previously predicted declining solar activity would lead to a new “Little Ice Age” in the next 30 years. \\nREAD MORE: \"SUN\\'S HEARTBEAT\" INDICATES A SOON-COMING GLOBAL ICE AGE \\nFor years, some scientists have warned that declining solar activity could bring cooler global temperatures in the coming years, but this view has been contested by many scientists who see greenhouse gases, like CO2, as the primary warming agent. \\nA 2015 study led by Met Office scientist Sarah Ineson found the overall cooling effect of a “grand solar minimum” would be marginal — only offsetting 0.1 degree Celsius of greenhouse gas warming. \\nThough regional impacts could be more pronounced, Inseon found. Her study found northern Europe could see 0.4 to 0.8 degrees of cooling if solar activity hits record low levels. \\n“This research shows that the regional impacts of a grand solar minimum are likely to be larger than the global effect, but it’s still nowhere near big enough to override the expected global warming trend due to man-made change,” Ineson said in a statement. \\n“This means that even if we were to see a return to levels of solar activity not seen since the Maunder Minimum, our winters would likely still be getting milder overall,” she said. \\nBut sunspot aficionados argue the “pause” in global average temperature since the late 1990s coincides with decreasing solar activity. Most scientists say the “pause” in global warming was caused by ocean oscillation cycles. \\n“Since 1990, the Sun has been in the declining phase of the quasi-bicentennial variation in total solar irradiance,” Abdussamatov wrote. “The decrease in the portion of TSI absorbed by the Earth since 1990 has remained uncompensated by the Earth’s long-wave radiation into space at the previous high level because of the thermal inertia of the world’s oceans.” \\nOriginal content provided by The Daily Caller ; additional commentary and insight provided by TRUNEWS Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742563103.1208072}