{"duration": 0.07281613349914551, "input_args": {"text": "'TVE \\nLa 1 de Televisión Española redondeó ayer un mes fantástico y volvió a ser la cadena más vista. “Cruz y Raya: el Reencuentro” congregó a millones de espectadores que disfrutaron como nunca de las mejores actuaciones de José Mota y el otro señor. El minuto de oro se produjo cuando el otro señor intentó besar a José Mota pero éste se abstuvo. \\nAntena 3 rozó la gloria al situarse como la segunda opción elegida por los españoles. La cadena de Atresmedia apostó por un formato nuevo consistente en emitir durante horas vídeos cortos donde diferentes marcas presentaban sus últimos productos a través de pequeñas recreaciones de la vida cotidiana. La apuesta surtió efecto consiguiendo un 17% de cuota de pantalla. \\nTelecinco también obtuvo cifras muy buenas atrayendo al 15% de la audiencia gracias al plano fijo de la barra de un bar español con risas enlatadas y una gorda chillándole a su esposo. \\nCuatro se quedó lejos de las cifras esperadas en su nueva versión de Primeras Citas . En esta ocasión, los participantes del programa eran enfermos que acudían a su primera visita con el médico en búsqueda de un diagnóstico. Aburrido, por lo general, salvo el momento final de la colonoscopia. \\nEquipo de Investigación de La Sexta ya investiga cuáles han sido las causas de sus bajos números en su emisión de ayer. La audiencia no acompañó a pesar de que el programa ofreció imágenes exclusivas de un portal cualquiera del centro de Madrid y subtituló y tapó la cara a una señora que no tenía absolutamente nada que decir sobre el tema que se estaba investigando. Ni siquiera remontó cuando Gloria Serra relató dramáticamente cómo un Honda Civic aparcaba en doble fila sin poner los intermitentes. \\nLa 2 de TVE apostó por la película Le film subvencioné avec des immigrants qui souffrent , tan independiente que todavía no se ha terminado de rodar. \\nCanal Sur fue la opción preferida de los andaluces tanto por la tarde, con su tercera edición de Con ese de Siesta , como en el prime time con su ya legendaria Noche de Siesta . La posibilidad de ver a algunos andaluces durmiendo siempre es muy atractiva para el resto de andaluces que se están durmiendo. \\nLa Televisión de Galicia emitió fuego para calentar los hogares del 14% de los gallegos que ya tiene televisor. \\nNetflix no pasó datos de audiencia, lo que es una mala señal. La cadena estadounidense emite muchas cosas a la vez , obligando a la gente a elegir y haciendo que todo sea muy confuso. Si quieren ser competitivos en el panorama televisivo español, deberían empezar por centrarse y elegir un único programa cada hora.'"}, "time": 1742564357.1863353}