{"duration": 0.11704063415527344, "input_args": {"text": "'Steve Harvey, the comedian and television host, became the latest celebrity to ascend Trump Tower on Friday to discuss federal policy with   Donald Trump, in this case housing issues. But before Mr. Harvey was off the premises, he unexpectedly revived a recent controversy over his comments about Asian men. After the meeting, Mr. Trump and Mr. Harvey briefly appeared together in the lobby. When Mr. Trump left, Mr. Harvey said they had discussed ways he could work with Ben Carson, Mr. Trump’s nominee to run the Department of Housing and Urban Development. Mr. Harvey has spoken openly in the past of being homeless as an adult while struggling to start his comedy career, though he gave no reason on Friday for why he was consulted on housing affairs. Mr. Harvey said he was invited a week ago by “both transition teams,” referring to representatives of President Obama and Mr. Trump, and emphasized that the visit was informal. “Well, you know it’s not my jump into politics,” Mr. Harvey said. “I ain’t gonna pass a background check. It’s just me following orders from my friend President Obama who said, ‘Steve, you gotta,’ as he told everybody, ‘get out from behind your computer, stop tweeting and texting and get out there and sit down and talk. ’” The Trump team confirmed the invitation. The White House did not comment. Mr. Harvey announced his support for Mr. Trump’s opponent, Hillary Clinton, last March in the presidential primaries. In September, during an interview with her on “The Steve Harvey Morning Show” on iHeartRadio, he said: “She’s a mother, she’s a grandmother, and we’re going to put her back in the White House, just flat out. Simply put. ” This was just the latest     crossover for Mr. Trump during his transition. Last month the   surprised reporters at Trump Tower by posing for photographs in the lobby with Kanye West. For Mr. Harvey’s part, he said that the incoming president was “a great guy” and “genuine. ” He deflected questions about Mr. Trump’s history of questionable comments regarding race from the campaign trail, and was diplomatic about his doubts about Mr. Trump. “You don’t kill it with one conversation, but you can start it with the conversation,” Mr. Harvey said. “So, you know, a lot about what people say, ‘Now, well, it’s time to see what you do.’ And he said he wanted to do something. ” Mr. Harvey also mentioned a controversy in which, during his television show last week, he mocked the dating skills of Asian men. At Trump Tower, Mr. Harvey said, unprompted, that he hadn’t laughed recently as a result of the controversy. “I ain’t been laughing that much over the past few days,” Mr. Harvey said. “They’re kinda beating me up on the internet right now for no reason. But, you know, that’s life, ain’t it?” After the meeting, Mr. Harvey put out a message on Twitter, saying that he found Mr. Trump “congenial and sincere” and that he would “sit with him anytime. ” Here are some edited excerpts from Mr. Harvey’s conversation with reporters in Trump Tower: REPORTER: There have been a lot of doubts about this administration about race. Jeff Sessions, his record in Alabama, some of the things the   said during the campaign about the inner cities. Are your doubts fully gone or are you going to still try and work them out? STEVE HARVEY: Well, I mean, you know, look, you don’t kill it with one conversation, but you can start it with the conversation. So, you know, a lot about what people say, now, well, it’s time to see what you do. And he said he wanted to do something. You can’t beat better than that. You know, and so, we’re gonna see. I’ve been put in contact with Ben Carson, which was great, I spoke with him. And so, we’re gonna get some things started, and they have a plan for the inner cities but they need help. And so, that’s why they called me. So we’ll see what I can do. REPORTER: Do you have any lingering things you still want to talk further about, that you’re still concerned about, you haven’t heard quite what you wanted to hear yet? HARVEY: Well, I mean for this, we got off to a great start. I think it could be the beginning of something. For them to invite me here to talk about a specific problem and thought that I might be able to help  —   I know I got a big radio show, I got a lot of people listening every morning. So I’ve always been concerned about inner city problems because they’re huge. My mentoring problem, excuse me, my mentoring program has been a part of this type of  —   and that’s what I want to see happen. And they were spot on with it. And Ben Carson got on the phone. I met with him over the phone today, but I sat with   Trump and we laughed a little bit. I ain’t been laughing that much over the past few days. They’re kinda beating me up on the internet right now for no reason. But, you know, that’s life, ain’t it? REPORTER: What did you laugh over? HARVEY: Well we talked about golf. We laughed about my score in golf, his score in golf, we talked about some of the friends that we have in common. Mark Burnett. Talked about TV shows. Things like that. He’s a fan. So he’s seen it. I met his daughter, she was very sweet. So I think we’re off to a good start.'"}, "time": 1742561642.7507212}