{"duration": 0.11083197593688965, "input_args": {"text": "'What are the options? \\nIs Assange “still” alive (as WikiLeaks, perhaps tellingly, asserts), and if so, where is he? There are several possible permutations. Either: Assange is alive and well in the Ecuadorian Embassy in Hans Crescent, London, and simply keeping his head down (possibly in an attempt to create a news story and give more publicity to WikiLeaks). Assange is alive and has miraculously managed to escape from the Embassy without being picked up the UK police or CIA who were monitoring the building, and has reached or is making his way to, a safe haven (eg Russia). [Edit: It is also possible that Assange has been a spook all along, working for US/UK interests, and it was expedient to allow him to leave in secret – a face-saving solution for all concerned. He may yet re-emerge to continue his operation from somewhere slightly larger than a shoebox with access to sunlight and fresh air]. Assange is still alive, but now in captivity. This could be inside the Embassy, but far more likely, he has been removed and handed to the US authorities who have him in custody on “US controlled territory” (and where it is quite likely he is being tortured, like the thousands of nameless other “enemy combatants” before him). Assange has been murdered (possibly by poisoning). Either his body is being stored in a freezer at the Embassy building until the “appropriate” time to announce his death, or it may have already been removed. It is also possible that Assange was removed (or left) the Embassy alive, but has since been killed (ie a combination of 3 and 4). An option I did not initially consider is that Assange could have realised his arrest was imminent and taken an extreme, but logical step to ensure that he wasn’t captured. When faced with the prospect of torture, suicide would be the rational choice. Of course suicide may yet be presented as the official cause of death, and ironically, many people will not believe it. \\nWhat does the evidence point to? \\nThe best “evidence” we have at the moment is several testimonials which purport that Assange is alive and well, inside the Ecuadorian Embassy in London, or news stories which are designed to make people infer that this is the case. However, these stories are either inconclusive, suspect or have been proven to be false, in other words they may just be distractions and misdirection. There have been other posts covering this subject , but these distraction stories include: the Pamela Anderson vegan sandwich visit on 15 October (somewhat compromised by her cryptic “torture” reference). Update: Pamela Anderson has tweeted this “gift” of two mice for Assange’s cat on 25 October the statement by Ecuador that they were cutting off Assange’s internet on October 16 (a cover story to obscure the fact Assange was already incapable of communicating?) the Wikileaks employee visit/tweet on 17 October (since disavowed) the Craig Murray whisky visit on October 18. the pointless Metropolitan police vehicle story the numerous old Assange videos being re-posted as “news” the idiotic red herring story involving images of Assange’s “escape” (which were actually Google StreetView images from two years ago) the 4-month old Michael Moore video being touted as current by WikiLeaks. the Wikileaks promises to provide hard evidence of Assange’s situation which have been reneged on. Weird tweets from WikiLeaks generally, including a ridiculous accusation that a major US ddos was the work of WikiLeaks supporters. \\nConversely, whilst there is an “absence of positive evidence” that Assange has been harmed or abducted from the Ecuadorian Embassy, there are numerous reasons to suggest this might the case. Final tweet from account known to be controlled by Julian Assange (Embassy Cat) on 15 October. the release of Wikileaks codes on 16 October there have been at least 9 days of non-communication by Assange, no proof of life provided, and no PGP signed document, despite repeated requests no rational explanation for this silence the sudden death of Gavin MacFadyen, the third (known) senior member of Wikileaks to die suddenly this year this redditor who visited Hans Crescent on 22 October, to find there was no police presence guarding the Embassy. Assange was under siege for over four years, with a permanent police detail outside the Embassy, with orders to arrest him if he tried to leave. Why were they removed? Mark Halperin of Politico attempted to meet with Assange on Friday 21, but was refused by a goon: “Assange too busy”- video. \\nBearing in mind the above, and the highly suspicious nature of the so-called “evidence” asserting that he is in good health, I think it is reasonable at this point to suspect that Assange has either been killed and/or is no longer inside the Ecuadorian Embassy, so either options 3 or 4, or probably both (option 5) bearing in mind that the US elite will not want to give Assange a trial where he could reveal any more information. \\nFinally, if Assange has been subjected to extraordinary rendition and/or killed, we must assume that the UK, the US and the Ecuadorian governments are all complicit. It would mean that Ecuador’s President Rafael Correa was somehow turned by the US authorities (be it via money or threats, or both concerning Ecuador’s gold reserves being held in the US ) into secretly revoking Assange’s asylum. It would also mean that the UK authorities have illegally handed over Assange to the Americans without due legal process, knowing that Assange would be tortured and probably killed. \\nBut…let’s hope this has all been a bad dream. \\nAt this point, however, I think the best we can hope for is that Assange is fine and still in the Ecuadorian Embassy, because I think the escape option is by far the least likely of all these scenarios. \\nTLDR: There has been no proof of life of Julian Assange for at least 9 days. Instead we have seen a raft of distraction stories (even from WikiLeaks itself) which are clearly designed to give the impression that Assange is alive and well. Some of these stories have been shown to be old footage or otherwise bogus. So it appears that WikiLeaks is compromised and that probably means Assange is no longer in the safety of the Ecuadorian Embassy. I supect the US authorities probably have the most information about Assange, and his current whereabouts, and we should probably fear the worst. \\nAs mentioned briefly above, Julian Assange was due to be interviewed by Swedish prosecutors last week – on 17th October, at a meeting inside the Embassy. However, this meeting was called off just five days beforehand, on Wednesday 12 October, ostensibly because the lawyers “couldn’t make it”. This made me wonder whether it was perhaps Assange who was not available – in other words, could Assange have been out of commission earlier than we realised? Unlikely, perhaps. \\nNot knowing when the Assange disappearance timeline truly begins is making it harder to discover what has happened to him.That said, the publication of WikiLeaks codes on twitter shortly after the Pamela Anderson “vegan torture” visit on 15 October is the most obvious starting point in the chronology. \\nNOTE (26 October): I am updating this page as new information comes in. If you think there is something I have missed out, please notify me in the comments.'"}, "time": 1742563522.0477452}