{"duration": 0.10365080833435059, "input_args": {"text": "'Outrage over President Donald Trump’s executive order prioritizing refugee claims by persecuted religious minorities has puzzled activists from Iraq’s Yazidi community, who note the lack of major protests against the brutal massacre of thousands of Yazidis and Christians by the Islamic State. [Former President Barack Obama’s administration and the United Nations recognized that Yazidis, Christians, and other ethnoreligious minorities in the Middle East have been victims of genocide at the hands of the Islamic State ( ).  Nevertheless, opponents of the executive order (EO) have lambasted the religious minority exception, denouncing President Trump for giving preferential treatment to persecuted minority groups. The order bars the entry into the United States of visa travelers from seven   countries (Iran, Iraq, Libya, Somalia, Sudan, Syria, Yemen) for at least 90 days and orders the U. S. government to prioritize refugee claims by persecuted religious minorities. The order, which has sparked protests and outcry across the nation, does not identify religious minority groups by name. However, Michael Short, a White House spokesman, told Breitbart News,“Yazidis would be covered under the EO as they are a persecuted religious minority. ” U. S. District Court Judge James Robart in Seattle has issued a ruling that temporarily blocks Trump’s order, which the Trump administration argues is primarily intended to strengthen U. S. national security. Breitbart News spoke to several Yazidi activists who expressed support for the executive order and argued that it does not amount to a Muslim ban, as critics argue. Echoing Iraqi Catholic Archbishop Bashar Warda, Mizra Ismail  —   a Yazidi activist with the Yazidi Human Rights    —   told Breitbart News, referring to opponents of Trump’s executive order: My first question for those protesters is: where were they when ISIS was committing genocide against the Yezidis and Christians in Iraq and Syria? ISIS killed and kidnapped thousands of Yezidis, mostly young women, girls and children. The ISIS jihadists also beheaded many Yezidis and Christians openly in the most brutal way and posted their videos on social media. What were those protesters doing then? I believe when ISIS committed all those crimes against the Yezidis and Christians, those protesters were blind. Another Yazidi activist expressed support for Trump’s order, saying it is necessary to keep the U. S. safe. “As a Yezidi, I am supportive of any genuine effort and precaution meant to keep this country safe and prosperous,” Gulie Khalaf from Yezidis International, told Breitbart News. “If a   ban on all refugees, including Yezidis, is what it will take to ensure that this country does not become full of residents who neither care for the values of this society nor its constitution, then let us have the   ban. Hopefully, that time will be spent to figure out who is deserving of the opportunities and the rights this country offers. ” The activist argued that the persecuted minority exception is necessary and does not subject Muslims to “discrimination” as many opponents of the order have claimed. “It is not breaking laws or going against any kind of values if Trump and his administration decide that endangered groups should be an exception to the ban,” declared Khalaf. A different Yazidi activist, Haji Hameka, stressed that the executive order is not a Muslim ban but rather an effort to keep America safe. “It is not a ban against bringing Muslim refugees to the United States. It is a security check to avoid the entry of terrorists from groups such as   and ISIS,” he told Breitbart News. “Trump is a real American Patriot who is putting America and Americans first,” noted the activist. “He has to protect, support, and save the United States. He was elected by Americans to put America first. ” Trump’s measure dictates that once refugee admissions resume after a   suspension aimed at improving the vetting process, the U. S. government, “to the extent permitted by law,” is expected to “prioritize claims made by individuals on the basis of   persecution, provided that the religion of the individual is a minority religion in the individual’s country of nationality. ” In other words, persecuted minorities in Iraq in Syria, such as the Christians and Yazidis, may go to the front of the line after the refugee program suspension is over. During the   suspension, the Secretaries of the State and Homeland Security have the discretion “on a    basis” to allow the entry of members of persecuted religious minority groups. “Identifying specific countries with Muslim majorities and carving out exceptions for minority religions flies in the face of the constitutional principle that bans the government from either favoring or discriminating against particular religions,” argued American Civil Liberties Union Executive Director Anthony Romero in a statement. The Trump administration and Republican lawmakers, including House Speaker Paul Ryan ( ) have defended the religious minority exception. Meanwhile, Democrats like Sen. Diane Feinstein from California have denounced the directive, arguing that granting priority to persecuted minorities is unfair to Muslims.'"}, "time": 1742562930.7685928}