{"duration": 0.09614300727844238, "input_args": {"text": "'This article is part of a series aimed at helping you navigate life’s opportunities and challenges. What else should we write about? Contact us: smarterliving@nytimes. com. Friendships are important throughout life, but especially so in the stage between school and marriage, when our friends often stand in for family. What do you do when you need to end a friendship that’s turned sour? First, give it some serious thought. Once you initiate a breakup, there may be no turning back. Depending on the type of friendship, a formal ending may not be necessary. “There are typically four types of friendships: friends you have because of shared history friends you’ve made due to forced togetherness your surface social friends and growth friends, meaning the people you want by your side as you go through life wherever you are,” said Melissa S. Cohen, a psychotherapist and relationship coach in Westfield, N. J. “Unless there has been a serious betrayal of trust, you can usually let all but your most important friendships fade away simply by spending less time with each other. ” If, however, your friend asks why you are not texting her or never available to get together, offer an explanation. “Think about what you say and how you say it very carefully. It’s likely that your   will never forget those words,” said Irene S. Levine, a psychologist and producer of TheFriendshipBlog. com. Then, talk to your friend in private. “Don’t involve mutual friends. Remember that although you have been giving a lot of thought to the breakup, it might hit your friend without warning,” Dr. Levine said. If you no longer have much in common or simply don’t enjoy your time together anymore, take responsibility for ending the friendship rather than blaming the other person. (Related: How to have more engaging conversations in everyday life) “It’s O. K. to say, ‘I truly care about you and the relationship we’ve had, but I don’t have the bandwidth or time to devote to our friendship anymore,’ or ‘I can’t be the friend that you want me to be right now,’” Ms. Cohen said. “Even if you feel it’s your friend who is sucking you dry, or stuck in college partying mode, or not being considerate, you can compassionately and authentically say, ‘We don’t seem to share the same goals and perspectives. ’” That allows you both to be cordial if you see each other again, and leaves the door open to a reconciliation if circumstances change. “No matter what, it’s always important to be careful with other people’s feelings. That just makes you a good person,” Ms. Cohen added. When a friend betrays you by, say, blabbing your secrets or being consistently cruel, you can and should stand up for yourself. And if this is not one of your closest friends, a breakup is most likely in order. The goal in these instances is to be honest and plainly explain why you can’t be friends with someone you don’t trust. And have the conversation live  —   either in person or over the phone  —   because anything you write online could be shared or used against you in a way you may regret. But when you have a major conflict with a best friend, these scenarios don’t apply. It’s ideal to have an open discussion about your feelings. “For those friends, it’s worth it to try harder and give the person the benefit of the doubt because those relationships are rare,” Ms. Cohen said. “Be really honest about what’s going on. ” If after that, the relationship still feels unsustainable to you, let your friend go as gently as you can. “These relationships need to be mutually satisfying to both people,” Dr. Levine said. Be clear that you wish your friend well but resist the urge to explain every detail of your thought process. “It isn’t necessarily kind and won’t necessarily provide the other person with closure. Your friend will still need to achieve that on her own,” Dr. Levine added. And remember that friendship breakups can hurt just as much as romantic breakups, especially if you’ve been close with a friend for a long time. And sadly, noted Dr. Levine, “when you break up with a boyfriend, you can turn to your best friends for support. When you break up with a best friend, you’ve lost the person who might be able to help you get over the loss. ” Want to read more? You might also be interested in: • Think it’s cathartic to run angry? Think again. • How to form healthy habits • The art of making (and not making) plans'"}, "time": 1742562128.806865}