{"duration": 0.1931307315826416, "input_args": {"text": "'If you were an alien and had just beamed down to Doral, Fla. the gold letters on a Spanish   building amid 800 acres of golf courses would leave no doubt as to who owns the resort: TRUMP. You might, however, find yourself wondering if this Trump fellow is a reality television star, a titan of industry or a vintner. Trump chardonnay and Trump sauvignon blanc (about $25 each) line the shelves of the Marketplace Cafe at Trump National Doral Miami. Trump nail polish sets ($25) glittery Trump pouches ($30) and Empire by Trump eau de toilette ($62) are sold in a gift shop. A lounge area is replete with framed magazine covers of Donald J. Trump. There he is on Newsweek, mouth agape, pointing at the viewer, beside the words, “You’re Fired!” There he is in a tuxedo on the cover of Playboy with Brandi Brandt, a former Playmate, who appears to be clad in nothing more than his suit jacket. And there he is gazing at the camera, chin in hand, on the cover of GQ in an issue about “men who take risks and make millions. ” But it is the 2011 cover of a golf magazine, Fairways and Greens, that really grabs the viewer. Mr. Trump, with a golf club at his side, is shown next to the words: “President Trump?” Turns out, it was a prescient question. Mr. Trump’s candidacy has drawn attention not only to his policy positions, but also to everything that bears the Trump name, including about a dozen   hotels and resorts from Waikiki, Honolulu, Hawaii, to Turnberry Ayrshire, Scotland. This year, Trump Hotels  —   the hotel company founded in 2007 by Mr. Trump and three of his children (Donald Jr. Ivanka and Eric)  —   is planning to open Trump International Hotel  Tower Vancouver, Trump Hotel Rio de Janeiro and Trump International Hotel, Washington, D. C. In coming years, the company said it will expand to Asia. And next year, it will introduce a lifestyle hotel brand. While the Trump name is ubiquitous, Trump Hotels may not be as familiar to travelers as larger brands with longer histories like Marriott and Hilton. Are Trump Hotels as big, brash and over the top as the man for whom they’re named? In visits to Trump properties in and around New York, Miami and Las Vegas, I set out to see how it feels to be a guest of the man who would be president. As you roll across the paths of Trump National Doral Miami in a golf cart emblazoned with a Trump crest, bird calls alternate with the thwack of golf balls, and every staff members offers a friendly nod or hello. Acre after acre is manicured with   flower beds, orderly rows of palm trees and clipped greens where golf luminaries like Jack Nicklaus and Tiger Woods have trod. A fallen palm frond the size of a surfboard hadn’t been on the ground more than a few minutes before an employee pulled up in a golf cart, lifted it onto the roof and drove off, trailing an electric whir, and then, silence. It was a muggy spring afternoon, and the quietude belied the news that had broken days earlier. A staff member said the PGA Tour, which has held an annual tournament at Doral for more than half a century (the Trumps bought the property in 2012) was planning to move it  —   to Mexico. Mr. Trump, who last year had choice words for Mexican immigrants, broke the news on May 31 that the Tour is moving: “They’re moving it to Mexico City which, by the way, I hope they have kidnapping insurance,” he told Fox News. The PGA Tour commissioner said the move was  not a political statement. The next day, however, Ricardo Salinas, the chief executive of the Mexican conglomerate that’s moving the tournament, tweeted at Mr. Trump: “You’re welcome to join us at the WGC,” he wrote, referring to the World Golf Championships. “Only good things can turn out, if you know the real Mexico. ” Though the PGA Tour may be a thing of the past, Mr. Trump has poured some $250 million into the resort’s future. In April, nearly 50 “spa suites” were opened near the Trump Spa, part of the property’s extensive renovation. The suites, decorated in rich blues with abstract art that evokes the ocean, include soaking tubs use of the Trump Spa lounge areas and, in the evening, Trump wine. Inside the suites (a night in a   in June was $425) one finds Trump Hotel Collection products like bath crystals and a Trump yoga mat bag, one of several amenities to encourage “wellness. ” Gold is used sparingly: Objets d’art and glass boxes for storing jewelry or sunglasses lend an understated glamour. Perhaps it’s not surprising then that the spa suites were overseen not by Mr. Trump, whose aesthetic is more aligned with opulent hotels in the Middle East and Asia, but by Ivanka Trump, an executive vice president of development and acquisitions for the Trump Organization. Admiring a decorative gold sphere, I turned over a nearby vase to see if it had a mark from a designer like Kelly Wearstler or Jonathan Adler. It had a sticker: West Elm. Maybe someone ought to have peeled it off. But I’m glad they didn’t: Design trends today mix high and low with abandon one can picture young décor buffs sharing photos of the suites on Pinterest. The gold sphere was $29 to $39 on WestElm. com cream and gold coasters on the coffee table were $31 for four. A charming bud vase had a CB2 sticker ($10. 95 on CB2. com). Generally speaking, the hallways and rooms of Trump Hotels are surprisingly subdued, save for the occasional Trumpian flourish: a gold toilet handle, or chandeliers that appear to have been sized for the “Game of Thrones” giant Wun Wun. Beyond the gold and glossy exteriors and marble lobbies, the private spaces are   decorated in grays, cream and chocolates. That restraint extends to other aspects of the properties. Music at the pools and restaurants is often, refreshingly, not at full volume. And the hotels are nonsmoking, even in Las Vegas, a city where you can burn your paycheck at any number of hotel casinos. Yet Trump International Hotel Las Vegas doesn’t have a casino. Rather, it sells Trump piggy banks for $10. The facade of the Las Vegas property is another matter it’s the hotel with the unrepentant Midas touch. The building looks like a bar of gold bullion but, after all, it’s Vegas Mandalay Bay is equally blinding. “Make America Great Again” baseball caps are proffered in the Trump Store ($30) and adorn the bar at the poolside cafe, H2 Eau, amid bottles of vodka. “As long as you’re going to be thinking anyway,” reads a quote from Mr. Trump splashed across a   mirror at H2 Eau, “think big. ” The maxim applies to the rooms. My room in Las Vegas, upgraded to a suite at    —   possibly because the staff is attentive and it was the third time I booked a hotel as a Trump Card member (the brand’s free loyalty program) or because the hotel figured out where I work (I didn’t book using a New York Times email or phone number, though I used my name)  —   included a   refrigerator, a Wolf stove and a Bosch dishwasher. Even at Trump SoHo New York, the smallest rooms are an impressive 420 square feet. The price of admission befits a luxury hotel. The cheapest available room on a July weekend at Trump International Hotel  Tower New York was $563 a night, according to a recent online search. At Trump International Hotel  Tower Chicago, it was $420 a night. That said, rooms are not always out of reach. For instance, one search turned up rooms at Trump International Hotel Las Vegas for $165 a night. Restaurant prices are what one expects at   hotels. At BLT Prime at Trump National Doral Miami, ahi tuna was $37 a   New York strip steak was $51. The hotels also tend to have cafes and shops with affordable sandwiches and snacks. If, however, you get a yen for, say, the bag of gold Trump chocolate bullions in your room at Trump SoHo, it will set you back $35. Sitting at a table in the Trump Bar at Trump Tower New York, the skyscraper used as Wayne Enterprises in the film “The Dark Knight Rises,” Ivanka Trump said the Trump Hotels customer can’t be pigeonholed. “We have millennials,” she said one spring evening during a reception in conjunction with the N. Y. U. International Hospitality Industry Investment Conference, “people from the entertainment business, entrepreneurs, titans of industry and those at the beginning of their careers. ” During recent visits to Trump Hotels, I met men and women on vacation or traveling on business, some with families. Guests spoke English, French, Chinese, Hebrew and more. The Trump Hotels website is available in several languages, including Chinese and Arabic, even as Mr. Trump proposes to squeeze China and bar Muslims from entering the United States. Asked to describe their guests, staffers at Trump SoHo said they are chief executives, athletes and actors. The Kardashians have been frequent visitors, though that doesn’t necessarily reflect their politics. “I know you like the Trump hotel, but honestly how do you feel about Trump running for president? ,” Khloé Kardashian’s friend, Malika Haqq, asked her in November on their vlog, Ebony  Ivory. Ms. Kardashian replied: “Wha —   how does that have to do with the Trump hotel?” “Well, no,” she continued, “I don’t think he should be president. ” Other celebrity guests have chimed in, too. After Mr. Trump said that he would bar Muslims from entering the United States, Lucy Lawless, who played the title role in the television series “Xena: Warrior Princess,” tweeted: “I used to stay in Trump hotels. Can never again,” and urged her more than 140, 000 Twitter followers to boycott the brand. Recently, “Jimmy Kimmel Live!” created a fake commercial for Trump Hotels with the tagline “We’re not to blame!” and apologies to groups Mr. Trump may have offended. Indeed, some companies think Mr. Trump’s campaign has hurt his hotel business. Hipmunk, the travel comparison site, said in May that “while overall Hipmunk hotel bookings have been on the rise    that has not been the case with bookings of Trump Hotels. ” The share of Trump bookings on Hipmunk as a percent of total bookings was down 59 percent year over year. In New York City and Las Vegas, Trump Hotels’ share as a percentage of each city’s total hotel bookings tumbled more than 70 percent. But Trump Hotels executives say the brand has never been stronger. Four of its hotels were among the 0. 4 percent of hotels that made AAA’s Five Diamond list this year. Asked at Trump Tower if Mr. Trump’s presidential campaign has helped or hurt the hotels, Ivanka Trump said “it’s been an upward trajectory,” adding that it may have been the case without the campaign. Behind the    sheets, there has been controversy, from the bankruptcy of Mr. Trump’s hotels and casinos in Atlantic City, N. J. to a lawsuit involving Trump SoHo from buyers who alleged they had been defrauded. More recently, Mr. Trump is suing the chefs José Andrés and Geoffrey Zakarian, both of whom canceled plans to open restaurants in the Trump International Hotel, Washington, D. C. because of Mr. Trump’s comments about Mexican immigrants. Still, the family business rolls on. In the fall the company plans to share details about its new lifestyle hotel brand, as yet unnamed. One name it won’t have is Trump. Is that because the name isn’t good for business? Ivanka Trump said it’s because some properties simply aren’t right for the Trump brand. It’s common, in fact, for hotel companies to spawn brands that don’t use their name. Marriott, for instance, has nearly 20 brands, including the  . So, are Trump Hotels as splashy as the man for whom they’re named? Only on the surface. Beyond the facades and lobbies there’s a feeling of calm and comfort. No smoking. No gaudy colors. Even the service is what one employee called “ghost service”  —   omnipresent but silent. Mr. Trump, too, is omnipresent. Just not silent. In guest rooms he appears in videos about Trump Hotels on a television channel in a seemingly   loop. “The thing I do best is build,” says Mr. Trump during one featuring the forthcoming Trump hotel in the nation’s capital, set to open weeks before the United States presidential election. “Better than ‘The Apprentice,’ ” he says. “Better than politics. ”'"}, "time": 1742562328.5116632}