{"duration": 0.05628013610839844, "input_args": {"text": "'KABUL, Afghanistan  —   A   Afghan police chief with deep experience in Afghanistan’s long conflict with the Taliban was killed in a blast on Sunday in the country’s eastern Nangarhar Province, which has been under threat from the Taliban and affiliates of the Islamic State. The police chief, Gen. Zarawar Zahid, was visiting an outpost in the Hisarak district when explosives placed near the outpost detonated, according to Attaullah Khogyani, a spokesman for the governor of Nangarhar. One of General Zahid’s bodyguards was wounded, Mr. Khogyani said. The Taliban claimed responsibility for the killing, according to a statement by the insurgency’s spokesman, Zabiullah Mujahid. The attack came a week after twin bombings outside Afghanistan’s Ministry of Defense killed at least 40 people, including several senior security officials. Nangarhar, which borders Pakistan, has faced mounting security perils over the past couple of years, with new Islamic State affiliates complicating the threat from the Taliban. Zabihullah Zmarai, a member of the provincial council, said the Islamic State posed a danger in five districts, despite repeated operations by the Afghan Army. “Out of the 22 districts, only six are secure,” he said. The Taliban’s presence across nearly a dozen districts varies, Mr. Zmarai said. But the Hisarak district faced a collapse in recent weeks. That drew the attention of General Zahid, who had gone there to supervise a counterattack. Over the past decade, he rose from a bodyguard to a   police chief of several volatile provinces. His postings included two stints as the police chief of southeastern Ghazni Province, and one term each in Zabul and Paktika Provinces. General Zahid was seen as a   commander, often arriving at the front lines unannounced. When a major cultural event drew world leaders to the ancient city of Ghazni, the general was photographed riding around the city on the back of a motorcycle to check on security measures. He had been wounded twice and had lost two brothers during the decades of war in Afghanistan. In June, he took part in clashes with Pakistani forces that erupted on the border. In a Facebook video that he posted, he appeared beside two mortars and shouted to his men, “Strike hard enough to blow up Nawaz Sharif’s home,” referring to the prime minister of Pakistan. Sediq Sediqqi, the spokesman for Afghanistan’s Ministry of Interior Affairs, called General Zahid “one of the bravest commanders of Afghan police. ” “He lost his life on the front line of duty in the fight against terrorism,” Mr. Sediqqi said.'"}, "time": 1742563879.8306003}