{"duration": 0.052834272384643555, "input_args": {"text": "'Follow on Facebook Print This Post \\nCLANCY OVERELL | Editor | CONTACT \\nThe nationwide boycott of all Carlton United Brewery products reached new heights over the weekend, after it was revealed that a camp of ringers in Queensland’s Channel Country have only been drinking Sauvignon Blanc for the last five weeks. \\nThey join a growing political movement of punters that are abstaining from drinking any of Australia’s highest-selling beer brands, in a showing of support for 55 workers who lost their jobs at Carlton & United Breweries (CUB) in June. These men and women are also known as the #CUB55. \\nThe maintenance workers lost their jobs after CUB terminated a machine maintenance contract with employer Quant, they were then offered their jobs back again at a 65% lower wage, after penalty rates and other entitlements. \\nE.H Pearson Cattle Company ‘s head stockman, Ronnie Austin says although he and his mates often punch on with the unionised Betoota shearing contractors, joining the CUB Boycott was a “no fucking brainer”. \\n“I’m usually not a big supporter of the Unions, but you can’t carry on the way these blokes have been” \\n“It’s fucking crook, mate” \\nAustin says it’s been hard work trying to avoid getting stuck into a few green demons at knock off after pushing cattle all day, but it’s their duty as fellow workers to support the CUB 55. \\n“It’s been tough. But we are all starting to get around the lively fruit flavours of the Jacob’s Creek Sauvignon Blanc” \\n“The passionfruit and citrus prevail across the palate, which is pretty much enhanced by the fresh natural acidity which provides vibrancy and length on the finish” \\nWith the Mount Isa New Years Eve Rodeo as the next big event pencilled in on their calendars, Austin says the Betoota boys are prepared to throw down with anyone who questions their choice of drink. \\n“If CUB haven’t sorted this mess out by then, well yes of course we will still be drinking white wine on New Years Eve” \\n“If anyone has problem with it then they can come and talk to me and Rocko. It won’t be the first time we’ve had to bust heads in the Isa” \\n“In fact anyone who wants to drink VB around me better have a note from their doctor because It’s just bloody unaustralian” \\nIt seems the CUB boycott has travelled across all cultures and state borders in Australia, with workers unions in Brisbane marching as well as hipster musicians now being forced to choose between supported the workers and drinking Melbourne Bitter ironically. \\n'"}, "time": 1742561650.5096962}