{"duration": 0.04451751708984375, "input_args": {"text": "'Uber is currently under criminal investigation over the company’s “Greyball” software, which allegedly allowed them to hide cars from regulators and law enforcement. [“Uber used the software tool to hide cars from regulators who were attempting to conduct sting operations on drivers in areas the company was not yet licensed to operate, such as Portland, Oregon,” reported The Verge. “The company claims it was developed as a way to cut down on fraud and protect drivers from violent taxi union protestors, and it claimed at the time that it still uses Greyball primarily for this purpose. ”  “The program worked by identifying suspicious users either based on credit card information, location, or the type of device being used to access the Uber app,” they explained. “The company went so far as to check credit card data against popular credit unions used by law enforcement and mining public social media data to determine the suspected person’s employment. Once a user was ‘Greyballed,’ so to speak, Uber would show a different version of the its app with fake cars that would not respond to call requests. ” The software was first revealed by The New York Times in March, prompting the investigation. In April, The New York Times also reported that Uber was nearly kicked off of the Apple App Store after they were caught breaking privacy rules. “For months, [Uber CEO Travis] Kalanick had pulled a fast one on Apple by directing his employees to help camouflage the   app from Apple’s engineers,” reported The Times. “The reason? So Apple would not find out that Uber had been secretly identifying and tagging iPhones even after its app had been deleted and the devices erased  —   a fraud detection maneuver that violated Apple’s privacy guidelines. ” The article painted Kalanick as a serial   who would frequently push the lines in an effort to advance his company. “In a quest to build Uber into the world’s dominant   entity, Mr. Kalanick has openly disregarded many rules and norms, backing down only when caught or cornered,” The New York Times claimed. “He has flouted transportation and safety regulations, bucked against entrenched competitors and capitalized on legal loopholes and gray areas to gain a business advantage. In the process, Mr. Kalanick has helped create a new transportation industry, with Uber spreading to more than 70 countries and gaining a valuation of nearly $70 billion, and its business continues to grow. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742564443.8212762}