{"duration": 0.09532618522644043, "input_args": {"text": "'WASHINGTON  —   President Obama is on pace to be the first president in decades to leave office with a federal prison population that is smaller than when he was sworn in, a reflection of eight years of liberal criminal justice policies, historically low crime rates and an aggressive use of presidential commutations. Mr. Obama granted clemency to 79 federal prisoners on Tuesday, bringing his total to more than 1, 000 inmates, most of whom were serving lengthy prison terms under strict sentences imposed at the height of the war on drugs. An additional 13, 000 people have been released early by the courts, the Justice Department said. But looming over the announcement was the fact that   Donald J. Trump’s nominee for attorney general, Senator Jeff Sessions of Alabama, strongly opposed Mr. Obama’s liberal approach to criminal justice. Mr. Sessions favors vigorous enforcement of drug laws and the use of mandatory minimum sentences. Some of Mr. Obama’s criminal justice legacy is easily undone. Justice Department policies that discourage seeking mandatory minimum sentences by default, for instance, can be torn up. But other changes, such as new sentencing guidelines, will have a lasting effect and will be difficult to reverse, regardless of the administration. “I can’t speak to what the next president is going to do,” W. Neil Eggleston, the White House counsel, told reporters. “I can’t speak to whether the next administration will have a similar level of enthusiasm. ” Mr. Obama’s announcement highlights a fundamental disagreement between the departing and incoming administrations about the role that stiff penalties should play in the criminal justice system. Mr. Obama and those who have led his Justice Department regard long mandatory prison sentences for drug crimes to be an outdated legacy of the war on drugs, and one that disproportionately hurt minorities. Mr. Sessions, a former federal prosecutor, credits strict enforcement for today’s low crime rates. “I was there when we had the revolving doors in the ’60s and ’70s,” he said in 2015. “We, as a nation, turned against that. We’ve created a system that requires certainty and punishment, swifter trials. And the result is a very great drop in the crime rate. ” President Jimmy Carter was the last president to leave office with a smaller federal prison population than he inherited, according to Justice Department figures. Since then, the prison population has ballooned into the world’s largest, with about one in every 100 adults locked up in local, state or federal prisons or jails. In 2010, Congress unanimously voted to reduce the sentencing disparity between crimes involving crack cocaine and those involving powder cocaine. Crack cocaine was disproportionately prevalent in   neighborhoods, while powder cocaine was favored by more affluent white users, leading to a sentencing imbalance that cut along lines of race and class. Mr. Sessions was an early supporter of legislation to correct that difference. But he adamantly opposed a subsequent bill, which died, that would have reduced mandatory minimum sentences for some drug crimes. In 2013, Attorney General Eric H. Holder Jr. wrote a memo to federal prosecutors, telling them not to bring charges involving mandatory minimum sentences in cases pertaining to   nonviolent drug crimes. Prosecutors have responded by reducing the frequency of those charges by about 25 percent, the Justice Department said. “You don’t just try to hammer everybody for as long as you can because you can,” Sally Q. Yates, the deputy attorney general, said on Tuesday. “Your obligation as a prosecutor is to look at the individual’s conduct. ” Inside the Justice Department, there is wide speculation that the next attorney general will withdraw Mr. Holder’s memo. Mr. Obama has taken an interest in the issue and has used his clemency power to free people jailed for drug crimes. Typically, those prisoners would be eligible for release if sentenced under today’s standards. Mr. Obama has written personal letters to the inmates, telling them he believed they could turn their lives around. “He is committed to using his clemency power in ways not seen in the modern era,” Mr. Eggleston said. “Our nation is a nation of second chances. ” While Mr. Obama’s commutations are the most   examples of people getting out of prison early, they represent only a small fraction of those who have been freed under changes made by the Sentencing Commission, which in 2014 voted to retroactively reduce sentences for people convicted of certain drug crimes. That move, which the Obama administration supported, made thousands of people eligible for early release. In the nation’s courtrooms, judges have been freeing prisoners, often with the Justice Department’s consent. More than 13, 000 people have been freed so far, according to the Justice Department, and 29, 000 others have been resentenced. “We want sentences that are just and proportional,” Ms. Yates said. “That means we should sentence people in ways that will be fair, that will punish people for their crimes and that will serve as a deterrent. But we shouldn’t keep people in prison longer than is necessary. ” Taken together, the push for clemency and resentencing sends a message that the government is willing to address unfairness in the criminal justice system, said Caroline Platt, a federal public defender in Virginia. “It says the system can recognize its own excesses and try to correct them,” she said. Neither Mr. Trump nor Mr. Sessions has said which policies they will continue. But in two decades in the Senate, Mr. Sessions has made it clear repeatedly that he sees mandatory minimum sentences and tough enforcement as critical to reducing crime. “There still remains in this country a limited number of people who will rob, rape, shoot and kill you. There’s not that many,” Mr. Sessions said in 2004. “You identify those, and they serve longer periods of time, you’ll have a reduction in crime in America. And that’s what happened. The federal government adopted a tough mandatory sentencing policy without parole. ”'"}, "time": 1742562034.3007417}