{"duration": 0.07158255577087402, "input_args": {"text": "'A joint   militia has begun a new phase in the operation to dislodge the Islamic State from its stronghold in Raqqa, Syria, moving to encircle the city and largely cut off the resupply of arms, supplies and fighters, American military officials confirmed on Sunday. Defense Secretary Ashton B. Carter said on Sunday that he welcomed the start of the militia’s operation. “The effort to isolate, and ultimately liberate, Raqqa marks the next step in our coalition campaign plan,” Mr. Carter said in a statement. American warplanes are flying bombing missions against the Islamic State’s “leadership, command and control, and resources” in Raqqa and outside the city in support of the militia, the Syrian Democratic Forces, said Col. John Dorrian, a military spokesman in Baghdad. Colonel Dorrian said in an email that it might be some time before the   to   force reached Raqqa, and that the   coalition would continue to train and recruit more forces  —   especially Arab troops  —   for an eventual attack on the city. By supporting the advance on Raqqa, American officials are sweeping aside objections from Turkey and moving forward with plans to rely on a ground fighting force that includes Kurdish militia fighters in Syria. The Turkish government, which has become a complicated ally in the fight against the Islamic State, fears that aspirations for autonomy will spread among its own Kurdish population. In a move to assuage Turkish concerns, Gen. Joseph F. Dunford Jr. the chairman of the Joint Chiefs of Staff, made a previously unannounced visit to Ankara, the Turkish capital, on Sunday for talks with his Turkish counterpart, Hulusi Akar, in part to consult on battle plans for Raqqa, according to General Dunford’s spokesman, Capt. Greg Hicks. The Turkish Ministry of Foreign Affairs could not be reached for comment on Sunday, but last month Ankara asked Washington to exclude the Syrian Kurdish militias from the operation to liberate Raqqa, saying Turkey was ready to provide military support. Last month, President Recep Tayyip Erdogan said he had told President Obama in a phone call that Turkey was capable of ridding Raqqa of the Islamic State by itself. Turkey wants to start the push on Raqqa after operations in Iraq, including the offensive against Mosul, have been completed, the deputy prime minister, Numan Kurtulmus, said at a news conference last week. France on Sunday supported the decision to begin the battle against the Islamic State’s headquarters in Raqqa while the   offensive on Mosul is underway. “I believe it will be necessary,” the defense minister,   Le Drian, said on Europe 1 radio. United States military officials said the Raqqa operation was being undertaken in roughly three phases. Phase 1 is what the   coalition has been doing for months: conducting scores of preparatory airstrikes in and around Raqqa to knock out    and fighting positions and other assets of the Islamic State, also known as ISIS or ISIL. “They don’t have the ability to move large troop formations, large convoys, but they do have the ability to move into and out of the area,” Colonel Dorrian told reporters in Washington last week. “What we’ve done to try to limit that is we’ve conducted a lot of strikes on their favored supply routes and infiltration routes. ” Phase 2, which the Syrian Democratic Forces announced on Sunday, is the campaign to isolate Raqqa. The aim is to cut it off from resupply with the available forces  —   about   of them Syrian Kurds and   Syrian Arabs, Pentagon officials say. “The intent, though, is to intensify that effort, to move closer to the city, to envelop the city and then once everything is in place, to liberate it,” Colonel Dorrian said last week. Phase 3 will be a fight for Raqqa itself, which American officials say they hope will be conducted mostly by Syrian Arabs, given that the city is majority Sunni Arab. But Colonel Dorrian said that might not happen for some time. “Right now, I don’t think that all the forces that’ll be involved in that liberation campaign for Raqqa are yet trained,” he said. Colonel Dorrian said that providing additional training to militia members who had already been involved in the fighting would take about two weeks. “We’ll let that play out, and we’ll see how long that takes, and we’ll see how many forces will be generated,” he said. More than 300 members of the United States Special Operations Forces are in Syria advising the   coalition forces, but Colonel Dorrian said the Syrian opposition forces would dictate the timing of the ground operations and training, and the recruitment of additional Arab troops for the recapture of Raqqa. “There is an intent to enlarge the force, and in particular the Arab contingent of the force, because we do understand that Raqqa is primarily an Arab city,” Colonel Dorrian said. “We do understand that there is a political dimension and a local acceptance dimension to this fight. ” Senior Pentagon officials have stressed for weeks that the fight to retake Raqqa should begin soon  —   within weeks  —   to disrupt planning believed to be underway there to stage terrorist attacks on the West. Lt. Gen. Stephen Townsend, the top American military commander in Iraq, has declined to name a specific threat emanating from Raqqa against Western targets but described a general “sense of urgency. ” He told reporters at the Pentagon two weeks ago that it was imperative that operations to isolate the city began soon to prevent attacks on the West that could be launched or planned from the militants’ capital. General Townsend stressed that Kurdish militia fighters would be a major part of the ground force used to isolate Raqqa, despite Turkish objections. “We’re going to go with who can go, who’s willing to go soon,” he told reporters during a video news briefing from Baghdad. “And then, once we get the initial isolation in position, we’ll look at how we prosecute the operation further. ” While the Kurdish militia will make up the bulk of the operation, General Townsend said, many of the United States Special Forces troops in Syria would help recruit, train and equip local forces in and around Raqqa, predominantly Syrian Arabs. Gen. Joseph L. Votel, the commander of American forces in the Middle East, has acknowledged the challenges of dealing with two pivotal allies in the fight against the Islamic State in Syria who essentially loathe each other  —   the Turks and the Syrian Kurds. One of his main goals now, he said recently, is to maintain momentum and “to keep everyone moving in the right direction. ”'"}, "time": 1742628293.3674204}