{"duration": 0.13018250465393066, "input_args": {"text": "'The hardest thing about the          decision may be when parents have to make the call: It’s usually during the family’s tightly orchestrated morning routine. “It’s kind of hard to make that judgment in the morning,” said Dr. Timothy Shope, an associate professor of pediatrics at Children’s Hospital of Pittsburgh, who is the   of the American Academy of Pediatrics book “Managing Infectious Diseases in Child Care and Schools: A Quick Reference Guide. ” “Sometimes very   parents have only a short window to make a judgment before they have to activate their day, get the child on the bus,” he said. And those parents may be feeling pressure to get to their own jobs. In a poll of parents conducted by C. S. Mott Children’s Hospital in Michigan and released last month, parents were asked about how they make that decision. Concern about the illness getting worse if the child went to school was very important to 60 percent of the parents, followed by concern that the child’s classmates might get sick (47 percent). This was especially true for parents of younger   children, 6 to 9 years old. Parents of older children, not surprisingly, tended to worry more about children falling behind or missing a test. Parents also worried about logistics 11 percent cited not wanting to miss work as very important in the decision, and parents worried about finding someone to stay home with a sick child, especially those with younger children. “The most important thing to parents in the decision was the health of their child and the health of other children,” said Dr. Gary L. Freed, the   of the poll. “That took precedence over the proportion of parents who were concerned about missing work. ” In terms of specific symptoms, parents said they would keep kids home for diarrhea (80 percent) or vomiting (58 percent would keep a child home for having thrown up once, even if there were no other symptoms) or for having a slight fever, even if acting normal (49 percent). But worrying too much about what may evolve over the course of the day, or even about other children getting sick, should not get in the way of assessing how your own child is looking right now, in the morning. “I think there are more overprotective parents than there are parents who send their kids to school too easily,” Dr. Shope said. “The primary concern I have as a pediatrician is that the parent make a decision about whether the child can effectively participate in the school day. ” That would rule out a child who is vomiting, of course, or a child who is miserable and feverish, and many school districts do have specific illness policies about symptoms like these. As far as spreading infection, the bad news is that many infectious illnesses are infectious well before symptoms appear, and continue to be transmitted after the child has recovered, while some children don’t get sick at all, but do continue to carry  —   and spread  —   viruses and bacteria that can make other children sick. Children should get their flu shots every fall that can prevent a great deal of misery and school absence. But there are a lot of other viruses out there, and infections can be spread by children who aren’t sick, or aren’t yet sick, or aren’t still sick. So we have to prevent transmission by emphasizing habits that improve hygiene and interrupt possible transmission, or, as we would say in the medical setting, infection control. And the good news is that as children get older, they can learn these techniques, which make even a symptomatic child much less dangerous to others. It is not, as we say, rocket science. Respiratory etiquette means coughing or sneezing into a sleeve or an elbow. And after immunizations, the single most important way to prevent transmission of infections in schools is the same as it is in hospitals (where you don’t have the option of excluding the sick people) good hand hygiene:   when possible, hand sanitizer as a backup. “Encourage families to understand the importance of   in both keeping their children healthier and also the children their children encounter,” Dr. Freed said. One suggestion is to teach children to lather for long enough to sing “Row, Row, Row Your Boat” or “Happy Birthday” twice. Hand hygiene is important for respiratory illnesses, which are most likely to be transmitted by viruses that get (mysteriously) from the mouth and nose onto the hands, and from there to other objects, from doorknobs to papers to pencils. But it’s also very important to prevent the spread of stomach problems a child who has diarrhea but practices good hand hygiene is much less likely to cause problems for anyone else, while an asymptomatic child could be incubating and spreading a GI infection. So we have to focus on what happens at the sink. The other good news, I suppose, though it can be hard for parents to appreciate this when they’re in the throes of negotiating who stays home and skips work, is that the infections that children get do build up their immune system capacity and make it less likely that they will get sick later on. It’s also important for parents to remember that if you make the   decision to send a child to school, and then get that dreaded call from the school nurse, you haven’t made a terrible mistake or shown yourself to be a bad or uncaring parent. “You can’t beat yourself up for not knowing the course a condition is going to take,” Dr. Freed said. As a pediatrician, I am very familiar with the sinking feeling that comes when you hear that a child you thought was doing fine has in fact gotten sicker. As a parent, you have to make the best assessment you can in the window you have. Dr. Shope said: “It’s not really a doctor decision, it’s a parent decision. ”'"}, "time": 1742561859.706941}