{"duration": 0.1431596279144287, "input_args": {"text": "'At least 5, 300 Wells Fargo employees have been fired for ethics violations like setting up illicit accounts without customers’ knowledge to meet sales targets. Now there’s another group of aggrieved Wells Fargo workers: people who say they were fired or demoted for staying honest and falling short of sales goals they say were unrealistic. That second group of workers, who claim that they played by the rules and were punished for it, are starting to coalesce around two lawsuits that were just filed and that seek   status. The first was filed in Los Angeles last week by former Wells Fargo workers who say that while their colleagues created unauthorized accounts to meet   quotas, they were penalized or terminated for refusing to do the same. The bank’s chief executive, John Stumpf, has often stated his goal that each Wells customer should have at least eight accounts with the company. That aggressive target has made the bank’s stock a darling on Wall Street, the lawsuit notes. On Monday, a federal lawsuit with analogous claims was filed in the United States District Court for the Central District of California, seeking to create a class of current and former Wells employees across the country who had similar experiences. “These are the people who have been left holding the bag,” said Jonathan Delshad, the lawyer representing the workers in both suits. “It was a revolving door. If you weren’t willing to engage in these types of illegal practices, they just booted you out the door and replaced you. ” In a statement on Monday, Wells Fargo said: “We disagree with the allegations in the complaint and will vigorously defend against the misrepresentations it contains about Wells Fargo and all of the Wells Fargo team members whose careers have been built on doing the right thing by our customers every day. ” One former employee planning to join the lawsuit is Dennis Russell, 62, who said he was fired in 2010 after a   career as a telephone banker at Wells Fargo’s call center in Orange County, Calif. Mr. Russell handled incoming customer service calls and was expected to refer 23 percent of his callers to a sales representative for additional product sales, he said. But the customers Mr. Russell spoke with were usually in dire financial shape, he said in a telephone interview on Monday. Looking at their accounts, he could see mortgages in foreclosure, credit cards in collections and cars being repossessed for overdue loan payments. “The people calling didn’t have assets to speak of,” Mr. Russell said. “What products could you possibly offer them in a legitimate way?” The two fresh lawsuits echo many of the allegations in a 2015 lawsuit filed by the Los Angeles city attorney’s office. Wells Fargo settled the case this month, agreeing to pay $185 million in fines, including a $100 million penalty levied by the Consumer Financial Protection Bureau, the federal watchdog agency that conducted its own investigation. But some Wells Fargo employees tried, years earlier, to sound the alarm  —   with personally disastrous results. Yesenia Guitron, a former banker, sued Wells Fargo in 2010  —   three years earlier than the bank has admitted it knew about the sham accounts. Ms. Guitron became alarmed when, two months into her job at Wells Fargo, she noticed that a fellow banker at the company’s St. Helena, Calif. branch was opening and closing customers’ accounts without their permission. Intense sales pressure and unrealistic quotas drove employees to falsify documents and game the system to meet their sales goals, she wrote in her legal filing. Ms. Guitron said she did everything the company had taught employees to do to report such misconduct internally. She told her manager about her concerns. She called Wells Fargo’s ethics hotline. When those steps yielded no results, she went up the chain, contacting a human resources representative and the bank’s regional manager. Wells Fargo’s response? After months of what Ms. Guitron described as retaliatory harassment, she was called into a meeting and told she was being fired for insubordination. In 2012, the United States District Court for the Northern District of California sided with Wells Fargo and ruled that even if its sales targets were unreasonable, the bank had the right to use them as an employment yardstick. Ms. Guitron appealed the decision and lost again  —   leaving her with a bill for more than $18, 000 in court costs. “She put her neck on the line” and they punished her,  said Yosef Peretz, the lawyer who represented Ms. Guitron. “She’s a single mom with two kids, barely making it, and her reputation was poisoned. No one would hire her. ” Ms. Guitron left the banking industry and now works in property management, he said. Christopher Johnson, 38, a plaintiff in the lawsuit filed on Monday, said he hesitated to get involved in the legal case because it brought back memories of “a very dark time in my life. ” He was fired in 2008 after working for Wells Fargo for five months. In trainings, the company repeatedly emphasized the importance of its ethics code and urged employees to call its confidential hotline if they observed anything inappropriate, Mr. Johnson said. But just two weeks after he started working as a business banker in a Wells Fargo branch in Malibu, Calif. his manager began pressuring him to open accounts for his friends and family  —   with or without their knowledge. When he refused, he was criticized for not being a team player. Mr. Johnson soon learned that his colleagues routinely opened unauthorized accounts for customers who they thought wouldn’t notice, like elderly clients or those who didn’t speak English well. Disturbed by this practice, he did as he was instructed during training and called the company’s ethics hotline. Three days later, he was fired for “not meeting expectations,” he said. Broke, Mr. Johnson was evicted from his house and spent the next seven months living out of his truck. He put all of his possessions in a storage unit, then lost them to auction when he was unable to pay the storage bill. Mr. Johnson, who now works as a writer, said he had stepped forward at his mother’s urging: “She was like, ‘Your story needs to be told. You got fired because you tried to do the right thing. ’” Mr. Russell also lost his home after he lost his Wells Fargo job. Unable to find a new position in the industry, he now works part time for a church in Costa Mesa, Calif. helping with its outreach programs for the homeless. Last week, he watched  —   in disbelief, he says  —   as Mr. Stumpf was grilled by the Senate Banking Committee and insisted that Wells Fargo never wanted its employees to do anything unethical to meet their sales goals. “It’s a crock,” Mr. Russell said. “They established the culture that made this happen  —   it comes down from the top. ” During the hearing, Mr. Russell said, “I was sitting there in a rage. The people who had a conscience, the employees who refused to go along, they deserve vindication. ” Workers’ efforts to band together to litigate cases against employers are often derailed by mandatory arbitration clauses that require them to address disputes privately and individually. Wells Fargo has such a clause in some of its employment agreements, but it was added only recently, in December 2015, according to Mark Folk, a spokesman for the bank. Mr. Delshad, the lawyer pursuing the workers’ cases, said he thought the covered class could grow to “tens of thousands of people” nationwide. “We’ve had former workers, and some current ones, calling our office all weekend,” he said. “We have a whole bunch of new plaintiffs to be added to the suit. It’s just unbelievable, the amount and scope of this fraud. ” Although Wells Fargo settled the civil cases with Los Angeles and its federal regulators, more fallout could be coming. Richard Cordray, the director of the Consumer Financial Protection Bureau, strongly hinted that the agency had referred the case on to other federal bureaus for criminal investigation, and multiple federal prosecutors have sent subpoenas to Wells Fargo seeking information on the misconduct. On Thursday, the House Financial Services Committee will hold its own hearing on the scandal. Mr. Stumpf, who has been invited to speak, plans to appear, Wells Fargo said.'"}, "time": 1742561826.1241229}