{"duration": 0.16472387313842773, "input_args": {"text": "'ISTANBUL  —   When Aynur Barkin became one of roughly 40, 000 teachers purged from Turkey’s education system after last year’s attempted coup against President Recep Tayyip Erdogan, she was not immediately replaced. As a result, her   students were forced to join the third grade, tripling their original class size. “I could pay attention to each of them one by one,” said Ms. Barkin, 37, who was fired in February from a school west of Istanbul. “But their new teacher can’t do that. ” That is one example of the administrative upheaval and chaos caused by the government’s vast purge of Turkish institutions since the failed coup in  July  —   the backdrop for a referendum on Sunday to expand the president’s powers. Mr. Erdogan’s government has sought to root out any remaining dissent by targeting nearly every segment of society. It has also used the purge as cover for a crackdown on dissidents of all stripes, including leftists like Ms. Barkin. The numbers are extraordinary. The government has fired or suspended about 130, 000 people suspected of being dissidents from the public and private sectors. Most are accused of affiliations with the Gulen movement, the Islamic followers of Fethullah Gulen, the cleric accused of orchestrating the putsch. More than 8, 000 army officers, 8, 000 police officers, 5, 000 academics and 4, 000 judges and prosecutors have been forced out, according to estimates. The social cost has been significant. Watchdogs say that around 1, 200 schools, 50 hospitals and 15 universities have been closed. Affected schoolchildren have usually been able to find places in local state schools  —   but their purged parents have mostly been frozen out of the job market. Turkey has become “like an   prison,” said Sezgin Yurdakul, 40, who was fired from the Istanbul ferry system because his daughter attended a   school on a scholarship. Mr. Yurdakul’s name is blacklisted on a national database, so no employer has yet dared to give him a new job. He, like thousands of other purged employees of the state, is now living off his savings. The vacuum left by people like Mr. Yurdakul has prompted many Turks to question which individuals are permitted to fill the void  —   and which factions, if any, have benefited. Mr. Erdogan’s allies argue that a wide range of groups has filled the void. But some claim that the gaps have been largely plugged by members of other Islamic orders, or loyalists from the president’s Justice and Development Party, known as the A. K. P. “The A. K. P. ’s own cadres are filling the void,” said Kemal Kilicdaroglu, leader of the largest opposition party. “They want to establish a bureaucratic structure that accepts whatever the politicians say. ” Mustafa Karadag, the head of the judges’ union, says that gaps in the judiciary have often been filled by novices who can provide letters of accreditation from a legal guild with links to the A. K. P. “This has allowed access to the judicial and prosecutorial professions to those who receive lower marks but who have a closer relationship to the government, or who are able to procure references from them,” Mr. Karadag said. The government denies this. Ibrahim Kalin, the president’s official spokesman, said in a recent briefing with reporters that those let go had been “replaced by ordinary people” who had “all gone through very transparent, open examinations. ” But even some of the president’s critics say the situation is too chaotic, and the purges too widespread, for one faction alone to have benefited. To fill the holes in the bureaucracy and the political sphere, some say, Mr. Erdogan has had to rely on   nationalists,   nationalists, novices and recalled retirees, as well as party loyalists and Islamists. “The perception among Turks is that Erdogan rules everything, but that’s not the case,” said Orhan Gazi Ertekin, a judge who heads the Democratic Judicial Association, a liberal legal watchdog. “There are various groups, all different to each other, that previously plotted against each other, but are now in alliance” against the Gulenists. The most striking example may be that of Dogu Perincek, the leader of the tiny   Patriotic Party. He was jailed for plotting to overthrow Mr. Erdogan before his conviction was quashed in 2014. Upon his release, Mr. Perincek pledged to “demolish” Mr. Erdogan’s government, which he accuses of undermining Turkey’s secular system. Yet, in a recent interview, Mr. Perincek offered qualified approval of some of Mr. Erdogan’s recent policies. “There’s no reason for us to fight. We became side by side. They are now following our program,” he said, referring to Mr. Erdogan’s government. Mr. Erdogan also has the unlikely support of the Nationalist Movement Party, also known as the M. H. P. a   nationalist group whose votes helped him secure parliamentary backing for the referendum. In return, senior officials with the nationalist group privately say, they expect cabinet seats after the referendum. If they get what they want, it would constitute an unlikely   for a party whose leader once called Mr. Erdogan a “political disaster. ” In the military, the firings of thousands of officers have led to no obvious ideological victor. Mr. Erdogan raised eyebrows with the appointment last August of Adnan Tanriverdi, a former   general, as his new military adviser. Mr. Tanriverdi was expelled from the army in 1996 because of concerns over his religiosity. He has since run a group for other soldiers fired for similar reasons in the late 1990s, known as the Association of Justice Defenders. His appointment as Mr. Erdogan’s adviser prompted claims that the president had enlisted Mr. Tanriverdi to help install loyalists in the army. But Mr. Tanriverdi’s allies said that no other members of his association had been appointed to positions of significance. Other observers have concluded that a mix of factions has benefited from the purge of the military.   ultranationalists  —   known as Eurasianists and sometimes associated with Mr. Perincek  —   have profited at the expense of   officers, according to two military experts at Sabanci University in Istanbul. “It seems for now that the Eurasianists will hold on to their influence and ranks, but for how long remains a question,” Megan Gisclon and Metin Gurcan, a former officer in the Turkish special forces, wrote in a briefing last year. One former military prosecutor says such was the scale of undercover Gulenists’ infiltration over the last two decades that they are still the largest faction in the armed forces. “In the Turkish armed forces,” said Ahmet Zeki Ucok, who once led investigations into Gulenists in the military, “if there is a group that currently is influential, it’s still the Gulenists. ” In some parts of higher education, the vacuum has not been filled. At Ankara University, half of the 14 professors in the university’s human rights law department have been let go, and it has had to scrap more than half its courses. It will not admit new students during the next academic year. The remaining professors have had to triple the number of students in their care, and they have no ability to supervise new arrivals. “How can we write our dissertations?” asked Emine Ay, a master’s student who has been left without a supervisor. Her department head, Prof. Kerem Altiparmak, said: “If our professors are not reinstated, this program will end. These are the last students we will see in this program. ” Some wonder if this, in fact, is the goal: to dismantle one of the country’s liberal strongholds. In the judiciary, the number purged is   of Turkey’s 12, 000 judges and prosecutors. “If you purge 30 to 40 percent of the judiciary, in a sense you purge it all,” Judge Ertekin said. “There’s no tradition left and no knowledge left. ” Mr. Karadag, the head of the judges’ union, said the government was filling the vacancies with loyalists. Some say the situation is dangerous for Mr. Erdogan because it leaves him vulnerable to groups beyond his control, just as his relationship with the Gulenist network once did. “As long as he depends on these alliances,” Judge Ertekin said, “a new betrayal may be on the horizon, too. ” Mr. Erdogan’s newfound allies in Parliament, the M. H. P. offer a glimpse of this vulnerability. While the party’s leadership supports expanding the president’s powers, several of its lawmakers do not. Many in the party’s ultranationalist rank and file also have yet to be convinced. In the case of Mr. Perincek, the leader of the   party, his support for Mr. Erdogan goes only so far. While he applauds the president’s recent     policies, he says the president has eroded the country’s secular character. Significantly, he also vehemently opposes the expansion of Mr. Erdogan’s powers, and therefore opposes the referendum. “Turkey,” Mr. Perincek said, “is not going to carry Tayyip Erdogan on its shoulders. ”'"}, "time": 1742562409.4605331}