{"duration": 0.3327829837799072, "input_args": {"text": "\"Moshen Abdelmoumen Interviews Ann Garrison Editor's Note Mohsen Abdelmoumen is a journalist who writes for The American Herald Tribune, and has his own blog, Algérie Résistance. In this interview he queries Ann Garrison about American democracy, and Hillary Clinton. \\nMohsen Abdelmoumen: Do you think the United States can claim to be democratic simply by electing a woman president? Also, what are your thoughts about the status of democracy in the USA with a candidate like Hillary Clinton who caters to the financial lobbies and AIPAC? \\nAnn Garrison: In response to the first question, no, of course not. No more than we could claim to be a democracy because we elected a Black president. These two elections signify nothing more than the inclusion of previously excluded classes of people in the super elite. The United States is an oligarchy of the .01%, 1% of the 1%. Any president who is not already among the .01%, like Bill Clinton, becomes part of the .01% by serving its interests and then peddling influence after leaving office. No one has developed an influence peddling machine as well-oiled as the Clintons, with Bill working the Clinton Foundation and the Clinton Global Initiative while Hillary was Secretary of State. Just imagine the new depths of corruption that the next eight years and beyond could bring. Obama has said he’s now considering a move from the White House to venture capitalism that has Silicon Valley slathering at the opportunity. \\nEvery four years Americans are given the illusion of choice between oligarchs and/or aspiring oligarchs who will serve the interests of oligarchy. Candidates who aspire to actually represent the interests of the people are marginalized by the corporate media and the pay-to-play campaign contributions of the oligarchs. \\nIn municipal and county elections and ballot measures, Americans often do have real choices, but the higher and more powerful the office, the greater the corruption and oligarchic control. Nevertheless, only a small minority of Americans actually vote n local elections; The Atlantic’s CityLab reporting project recently concluded that fewer than 20% vote in mayoral elections in 15 of the 30 most populous cites. Disengagement is one of the most fundamental facts of American political life. \\nRegarding federal elections, this concept of democracy within the largest, most lethal military power the world has ever seen is bogus to begin with. When U.S. citizens cast ballots to elect a new commander-in-chief who will continue the project of perpetual war, military industrial profits, and global hegemony, how democratic is that? The vast majority of those who will suffer and die don’t get to vote; the only exceptions are members of the U.S. Armed Services who die in U.S. wars. If those on the other side of the Pentagon’s crosshairs were able to vote, I’m sure they would elect our Green Party presidential candidate Jill Stein, who said, “We say to Trump, we don’t need no friggin’ wall! We just need to stop invading other countries.” Her running mate, vice presidential candidate Ajamu Baraka has called the humanitarian interventionist argument a new version of the white man’s burden and said, “You have to ask yourself, when was the last time the U.S. has been on the side of the people? And the answer is: NEVER. ” \\nHow do you explain the dynastic governance of the Clintons? Is this the American dream in all its glory? \\nI’m not sure I can explain the Clinton dynasty except to agree that it is one. Chelsea has been very involved in the Clinton Foundation and is quite likely to enter political life and even run for president one day. We have had other political dynasties, most notably the Roosevelts, the Kennedys and the Bushes, and there are many lower level dynasties, like the Browns in California. Jerry Brown, the current governor of California, is the son of former California governor Pat Brown. New York State has the Cuomos; Governor Andrew Cuomo is the son of former Governor Mario Cuomo, and his brother Chris Cuomo is a prominent corporate television host. \\nRegarding the American dream, I assume you’re referring to the dream that if you work hard and play by the rules, you can achieve some proportionate degree of status, security and prosperity. If so, the Clintons certainly aren’t living the American dream because, although they did well in school, they’ve hardly played by the rules. They’ve enriched themselves with that well-oiled influence peddling operation I mentioned earlier, the Clinton Foundation and the Clinton Global Initiative. We’re all wondering whether Hillary Clinton, and maybe even Bill Clinton, might finally be indicted now that the FBI has reopened its investigation of Clinton e-mail because more of it was discovered on the laptop that Anthony Weiner – a former Congressman under FBI investigation for sex offense – shared with his wife, Clinton aide Huma Abedin. If Hillary Clinton is elected, she’ll have to be impeached, convicted and removed from office, but that’s extremely unlikely – no matter what’s in the newly discovered e-mail – if her party, the Democrats, win a majority in the House and more than a one- third minority in the Senate. It takes a majority in the House to impeach a president and a two-thirds majority in the Senate to then convict and remove a president. So Hillary Clinton is at a Berlusconi moment in her sordid career; her best chance of avoiding indictment is getting elected. Getting back to the American dream that you can get ahead by working hard and playing by the rules, Bill Clinton was impeached by the House of Representatives, for perjury and obstruction of justice regarding his affair with a 19-year-old White House intern and his testimony in a sexual harassment lawsuit brought by another former employee. However, his own party held a majority in the Senate and they acquitted him. This was all legal, according to the U.S. Constitution, but does it really sound like he was “playing by the rules”? During the final days of his presidency, Clinton acquitted Glencore International founder Mark Rich, an international fugitive who had fled to Switzerland. His ex-wife had donated to the Democratic National Committee, the Clinton Presidential Library and Hillary Clinton’s New York Senate campaign. \\nAccording to the law, President Clinton had the authority to acquit Rich, but how would any rational person consider that anything but bribery and corruption? \\nIn 2006, Clinton polished the reputation of President Nursultan Nazarbayev, Kazakhstan’s autocratic leader and human rights offender, who then gave a uranium mining lease to Canadian businessman Frank Giustra’s Shell Company, making it worth tens of millions of dollars overnight. Giustra then made a big contribution to the Clinton Foundation. No one has claimed that this was illegal, but is it “playing by the rules”? \\nWhen Guistra sold a majority stake in his company, Uranium One, to Rosatom, the Russian atomic energy agency, it was approved by Secretary of State Hillary Clinton. Giustra then contributed $2.35 million to the Clinton Foundation and Bill Clinton was offered a $500,000 speaking engagement with a Russian investment bank with links to the Kremlin. Does that sound like playing by the rules? And now Hillary’s trying to make us believe that Russia’s meddling in our elections and threatening confrontation with Russia over Syria. I don’t think she’s kidding about the confrontation, but the Clinton Foundation rarely passes up the chance to make another million dollars or more in any circumstances. \\nMeanwhile, most of the rest of us are not living the American dream. Sixty-three percent of Americans are living on the edge of financial catastrophe, unable to handle a $500 car repair or a $1000 emergency room bill . The Clintons, as I said, serve the oligarchy they have also managed to join. When Bill Clinton was on his way out, in the last months of his presidency, he worked with Republicans in the lame duck Congress to deregulate the banking industry. By 2008, its dishonest, excessive and abusive financialization scams had crashed the economy, costing millions of Americans their jobs and/or homes. Then, as a New York Senator, Hillary Clinton voted to bail out the big banks who committed the crime while many of the rest of us struggled in the crash’s wake. \\nHow do you explain that candidate Clinton, with all the negative baggage she brings (the death of the US Ambassador in Libya, her rumored health problems, the scandal of emails, etc) is the Democratic candidate? \\nAgain, Clinton serves the interests of the oligarchy that she herself has joined. Many people believe that the nomination was stolen from Bernie Sanders, the Democratic candidate who spoke out against oligarchy, growing income inequality, and even the Israeli lobby’s dominance in American politics. \\nBut there’s one other important element to this. Americans who identify as liberals, supporters of women’s rights, and/or anti-racists have such a longstanding allegiance to the Democratic Party that supporting its nominee every four years is their knee-jerk reaction. Ever escalating foreign wars don’t seem to penetrate their consciousness or conscience, especially when those wars are waged primarily with drones and proxy armies instead of U.S. troops. And once the Republicans nominated the openly racist and misogynistic Donald Trump, defeating Trump became a liberal crusade. \\nThere are, of course, glimmers of rationality and hope. Yesterday I was out canvassing for an Oakland, California ballot measure with a young Black man, a college sophomore. Despite Trump’s overt racism, he told me that he considers Clinton even more dangerous because he understands that she has essentially promised confrontation with Russia over Syria. He understands that such escalation increases the chance of a nuclear war, accidental or not, and that Trump, for all his faults, says that the Cold War is over, that NATO is largely obsolete, and that Clinton is recklessly risking confrontation with Russia by promising to remove Bashar Al-Assad. \\nOur Green Party presidential candidate Jill Stein is reported to be polling at 16% among voters under 35, and much of Bernie Sanders’s support was quite visibly from the same age group. Local, grassroots organizing is also empowering people to create institutions free of oligarchic and corporate control. They include community gardens, renewable energy buyers’ co-operatives, and GMO-free zones. If a ballot initiative to make California’s Sonoma County GMO-free passes, the whole northwest coast of California will be a GMO-free zone, from Santa Cruz to Humboldt Counties and including one inland county, Trinity. \\nDon’t you think that the two-party American system, with the candidates of two traditional parties, Democratic and Republican, is out of breath? \\nI wouldn’t say it’s out of breath because it’s still very much in control. However, Trump has left the Republican Party in disarray, with many Republican luminaries and funders defecting to Clinton, who is welcoming them with open arms. As Black Agenda Report Editor Glen Ford has written : \\n(the Clintons) “have succeeded in assembling under one party roof nearly the whole of the U.S. ruling class and their hordes of attendants and goons. The scam that undergirded the duopoly system that has served the Lords of Capital so well for so long, has come undone. Thanks to a white nationalist billionaire who was too spoiled to play by the corporate rules, the two parties of the ruling class have become one.” \\nIt’s hard to say whether or not the Republican Party will survive this election or what it will be in another four years if it does. \\nOne possibility could significantly change this. If Green Party presidential candidate Dr. Jill Stein wins 5% in this election, the Green Party will become an official national party eligible for 5% of the federal funds made available to official national parties to host their presidential nominating conventions and support their nominee. This year all federal funds went to the two official national parties, Republicans and Democrats, who also have access to huge amounts of plutocratic and corporate money. The Greens take no corporate money. \\nFive percent of the vote and five percent of the federal funding for elections may not sound like much, but it would be a huge watershed for the U.S. Greens. It would be a big psychological and visibility boost, and it would mean starting the next presidential campaign year with more than twice the funds that Jill Stein’s campaign has been able to raise. \\nWinning 5% would also ensure ballot access for the Greens in most states, not only in federal elections but also in down ballot races. As it is, Greens are required to spend much of their time and money just gathering enough signatures to satisfy all the byzantine ballot access requirements that vary in each of the 50 states. \\nEveryone knows that Clinton is the future president of the USA. In your opinion, who has facilitated her task and who has interest in seeing Clinton in the Oval Office? \\nShe is backed by the oligarchy, corporate and dynastic, particularly the investment bankers, the oil industry, and the weapons manufacturers who not only profit but also lobby for foreign wars. They are advancing their own interests by promoting a candidate who will serve them. Liberals have been conditioned to function as unpaid Clinton operatives in this election, and the corporate media, like the cops, serve as protectors of the oligarchy. And again, the majority of Americans are politically disengaged. \\nYou are close to Jill Stein, head of the Green party, who emerged late in the campaign. Why was this alternative sabotaged? \\nWell, I wouldn’t say I’m close to Jill personally, but she knows who I am and I, of course, know who she is. I’ve reported on her campaign and on the U.S. Greens for the past year, on radio and in print and online outlets, and I’m always honored when she shares those reports on her social media pages. I write for the Black Agenda Report and feel politically and intellectually close to its editors, who have given their full support to the Green Party this year, even as Bernie Sanders surged in the polls and many imagined he might actually win the Democratic nomination. In these times that are so easy to see as the end times, shared rationality and humanity are the closest bonds that many of us have, regardless of the geographic distance between us. \\nJill’s campaign could hardly compete with the Republicans’ and Democrats’ because neither she nor any other Greens solicit or accept corporate money. We stand behind the slogan, “People and Planet before Profits.” And we call for a halt to the death march led by the weapons manufacturers, fossil fuel giants, and agro-chemical companies who profit from it. Jill calls for immediately cutting the military budget by half, closing all the U.S. military bases in foreign countries and launching a “peace offensive.” She proposes free public education from kindergarten through college, the abolition of student debt, national health insurance and a “Green New Deal” that would reinvest the resources now squandered on weapons manufacture and all the illegal, immoral, lethal and environmentally catastrophic U.S. wars. The Green New Deal would create a renewable energy infrastructure and sustainable agriculture before it’s too late to stop the climate meltdown – if it isn’t too late already. And it would fully employ Americans in meaningful, dignified and cooperative work for the common good. \\nOf course that all makes far too much sense and threatens the highly concentrated wealth and power of the death-march industries. I would not be surprised if there were voter fraud to prevent Jill Stein and Ajamu Baraka from winning the 5% that would make us an official national party. \\nI have also seen enormous oligarchic determination to stop Greens at the local level. In 2003, Matt Gonzalez, the Green Party’s mayoral candidate in San Francisco, seemed to have a good chance of winning. That so alarmed the Democratic Party that it sent all its best known, most powerful names and faces to San Francisco to campaign for the Democratic candidate. They sent Hillary and Bill. They sent Jesse Jackson. They sent many Democratic Party superstars more than once. They seemed to be more concerned about defeating Matt Gonzalez and the Greens in San Francisco than they were about defeating George Bush and the Republicans in the following year’s presidential election. \\nOne of the founders of the San Francisco Green Party was elected to the City and County Board of Supervisors twice, but when he ran for Sheriff, an executive office, Democrats pulled him aside and said they could not allow his election unless he left the Greens and joined the Democratic Party, which he did. They still got rid of him after his first term, with a really ugly campaign, but that’s another complicated story in itself. The City and County of San Francisco once had more elected Greens than any city or county in the country, but many of those that Greens worked so hard to elect have since defected to the Democratic Party for the sake of their political careers. \\nIs Hillary Clinton a danger for humanity? \\nHell yes. I agree with Congolese author and political activist Patrick Mbeko, who said she’s more dangerous than ISIS, for all the reasons I’ve already mentioned. Like her dark alliance with the death-march industries, and her seeming eagerness to confront Russia over Syria and/or on Russia’s borders in the interest of global hegemony. Russian uranium deal aside, I think that Diana Johnstone was most likely right when she wrote that “her strategic ambition in a nutshell is regime change in Russia ”. \\nAnd I have to mention my friends from the African Great Lakes Region – particularly Uganda, Rwanda, Burundi and the Democratic Republic of the Congo – which became the killing grounds of the 1990s, as the U.S., using African proxies, established itself as the dominant power there. Most of my friends from that part of the world are horrified by the Clintons’ all but certain return to the White House. The Clintons are deeply committed to the false history of the Rwandan war and massacres that was used to justify the First and Second Congo Wars and later the “humanitarian” interventions in Libya, Syria, and Iraq. If the truth about Rwanda and DR Congo were known, Bill Clinton would be implicated in mass murder, but that’s true of every U.S. president in office in my lifetime and probably long before that. No one’s going to try to refer the most lethal military power in history to an international criminal court with more than symbolic authority. \\n\\nLibya lives total chaos. How do you analyze the situation in Libya and Clinton’s role in it? \\nIt’s horrible. Like so much else, it makes me deeply ashamed to be an American. If you read Hillary Clinton’s e-mail, it’s easy to see that the U.S.-NATO war on Libya was, for one, another Western war against another defiant resource nationalist, Muammar Gaddafi. Regardless of whatever human rights offenses Gaddafi or Saddam Hussein were guilty of, both were resource nationalists, as was Mohammed Mossadegh, the secular, democratically elected prime minister of Iran who nationalized Iranian oil before our CIA and the UK’s M16 ousted him in the 1953 coup. I wrote about how this played out in Libya in “ Clinton E-Mail: We came, we saw, we got oil .” \\nObama says that failing to prepare for the aftermath of the Libyan War was the greatest mistake of his presidency, but I’d say his greatest mistake was waging the Libyan War in the first place. Like the Iraq War, it has created chaos and perpetual war that continues to spread through the Middle East and North Africa. \\n\\nAnn Garrison is an independent journalist who contributes to the San Francisco Bay View, Global Research, the Black Agenda Report and the Black Star News, and produces radio for KPFA-Berkeley and WBAI-New York City. In 2014, she was awarded the Victoire Ingabire Umuhoza Democracy and Peace Prize by the Womens International Network for Democracy and Peace . She can be reached through twitter @AnnGarrison . \\nNote to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?\""}, "time": 1742563664.837514}