{"duration": 0.25927162170410156, "input_args": {"text": "'By Rmuse   10:03 am \"The archdiocese holds the matter among its highest priorities. If passed, the law would have significantly detrimental impacts on our parishes, our ministries\"   *The following is an opinion column by R Muse* \\nFor almost all secular humanists, organized religion is nothing more than an easy means of controlling people through fear and intimidation. Throughout recorded history, the Catholic Church has been responsible for all manner of devious machinations to control not just its adherents, but any humans it comes in contact with. That lust to control human beings has continued unabated into the 21st Century and in America like the rest of the Earth the Catholics number one focus has been on controlling women. Apparently, the Catholic Church in Massachusetts wants to expand its control over the population. \\nOn Friday the Boston Globe reported that the Archdiocese of Boston dropped about a million dollars in a last-ditch effort to exert Church control over Massachusetts law and citizens to stop marijuana from being legalized for recreational use. Other reports reveal that the tax-exempt political spending is meant to help defeat a Massachusetts ballot measure, Question 4 . Question 4 simply legalizes cannabis for recreational use for people over 21 and creates a commission to regulate marijuana in the state of Massachusetts. Question 4 contains no references to the Catholic, or any other church, and makes no claim of trying to “ impact ministries .” \\nA spokesman for the Boston Archdiocese, Terrence Donilon, made a truly pathetic attempt at justifying the Catholic church’s political donation to the campaign against Massachusetts’ version of legalized recreational marijuana saying : \\n“ It reflects the fact that the archdiocese holds the matter among its highest priorities. It’s a recognition that, if passed, the law would have significantly detrimental impacts on our parishes, our ministries .” \\nSeriously, that has to be one of the most monumental piles of bovine excrement of a reason to use tax-free congregants’ donations to interfere in an election ever offered. Nowhere in Massachusetts’ or any state’s decriminalization statutes is any church mentioned, much less affected by the outcome of an election. Catholic priests will still be free to sexually abuse little boys if adults can legally purchase and consume cannabis. And despite residents having a toke in the privacy of their homes, the Church will still frighten its members into increasing their tithes, and the USCCB will still attempt to control and dominate all American women. No reefer decriminalization will impact the Catholic ministry, but it will drastically reduce the number of people being arrested and imprisoned for marijuana possession, free up law enforcement to pursue nasty pedophile priests, and relieve America’s over-burdened judicial system. \\nNow, the Catholics claim that people using cannabis legally, whether they inhale or eat it, will have “ significantly detrimental impacts on their ministries .” That is an odd assertion on yet another point; Surely part of “Catholic ministries” is teaching according to their god’s word in the Christian bible. It is nearly certain that every Catholic priest on the planet, including those in Massachusetts, are aware of god’s word in Genesis where in chapter 2, verse 9 the Catholics’ “ almighty god ” said: \\n“ Out of the ground the LORD God caused to grow every tree that is pleasing to the sight and good for food. ” And he continues in verses 15-17 , “ Then the LORD God took the man and put him into the garden of Eden to cultivate it and keep it. The LORD God commanded the man, saying, “From any tree of the garden you may eat freely, but from the tree of the knowledge of good and evil you shall not eat, for in the day that you eat from it you will surely die .” \\nAlthough there is recorded evidence that cannabis was first discovered to be used for its medicinal qualities 10,000 years ago , there is no record of reefer ever being confused with “ The tree of the knowledge of good and evil; ” weed is not and will not affect the Catholic ministries if it is decriminalized today any more than it has over the past two-thousand years the Catholic Church has existed and cannabis was either unknown to the clergy or illegal. \\nIn a reaction to the news the archdiocese was interfering with politics with tax-exempt money, an advocate and spokesman for the Yes on Question 4, Jim Borghesani, said : \\n“ The archdiocese has come up with a position that, frankly, we think is based on unfounded assumptions and junk science. What I think the archdiocese is missing is the terrible harm that (marijuana) prohibition has done to people of color, to people who have chosen a substance that is less dangerous than alcohol and have had their lives ruined because they’ve been arrested .” \\nOne wonders if part of the Boston archdiocese’s ministry entails increasing the number of Americans, mainly Americans of color, sent to prison for possessing or using a plant that “ god caused to grow ” and was “ pleasing to the sight and good to eat .” Obviously, that is the case and according to a new set of data, keeping marijuana illegal means keeping Americans arrested for drug possession at a rate of every 25 seconds of every day of the year. \\nWhy is the Catholic Church so interested in perpetuating the failed “War on Drugs in general, and the criminalization of marijuana in particular?” As noted by Michael Stone over at Patheos, what the Massachusetts Catholics, and Mormons, are actually helping to sustain is “ in reality a war on poor people and people of color .” Mr. Stone really nails it when he said that by spending tax-exempt donations on a political agenda to “ defend the unjust prohibition on marijuana; the Catholic church is guilty of perpetuating the failed War on Drugs and the New Jim Crow .” \\nThe archdiocese is also guilty of hypocrisy, besides implicit racism. Because any religious organization that condones and even promotes the use of alcohol while using tax-exempt donations to maintain the ridiculous prohibition on cannabis is “ morally indefensible .” Mormons are also busy instructing LDS members to vote against all state initiatives that seek to decriminalize and regulate recreational marijuana use as if it has any affect whatsoever on either their private Mormon lives or their LDS ministry, but they allegedly don’t condone or enjoy alcohol so they just have control issues and are not blatant hypocrites; at least where cannabis decriminalization is concerned. \\nThe Massachusetts Catholics may not be violating the law by “ acting as an anti-marijuana super PAC ,” but they are using tax-exempt member donations to politically influence an election and control other Americans’ lives; the church is all about wielding ultimate control over all facets of American society. However, if the Church is so flush with money; why not use that money to compensate the thousands of victims of the Church’s pedophile priests? Or, dog forbid, use that tax-exempt donors’ money to help the people of Massachusetts in need. \\nThe Catholic Church is guilty of using fear and intimidation to control its own adherents, and that is down to frightened people needing a ‘ daddy’ figure in the Church to tell them what is right, what is wrong, and how to stay out of the proverbial Hell; that is all well and good for people that willingly cry out for a controlling organization speaking for a deity. But for people that are not “ in the church ” it is an affront to use donated tax-exempt money to impact (read control) their private lives. The only good news out of this abominable story is that it looks like Question 4 will pass with relative ease informing that the archdiocese wasted about a million dollars of its congregation’s hard-earned money. \\nThis is yet another example of why all churches should be taxed like every other business and American citizen, except Donald Trump. It is “ morally obnoxious ” that the archdiocese is using the congregations’ donations for political purposes to influence an election and yet another sign that there is no area the church considers as out of bounds in attempting to control every aspect of society with tax-exempt funds wrung out of hardworking Americans, many of whom use recreational cannabis. \\nh/t Patheos'"}, "time": 1742563791.2827969}