{"duration": 0.05667471885681152, "input_args": {"text": "'Freitag, 28. Oktober 2016 Alle machen Jagd auf ihn! Horror-Clown traut sich nicht mehr vor die Tür Mönchengladbach (dpo) - Sind Leute wie er die wahren Opfer des aktuellen Hypes? Horror-Clown Zimbo Wiegmann aus Mönchengladbach traut sich schon seit Tagen nicht mehr vor seine Wohnungstür. Zu viel Angst hat der 33-Jährige, auf der Straße von kreischenden Fremden angegriffen zu werden. An der Tür empfängt uns der sichtlich nervöse Horror-Clown. \"AHAHAHAHAHAHAHAHA! Oh, Entschuldigung. Alte Angewohnheit. Kommen Sie rein. Hoffentlich hat mich keiner gesehen\", begrüßt uns Wiegmann in seiner Zweizimmerwohnung, wo das Interview aus Sicherheitsgründen stattfinden muss. \"Sie dürfen mich gern Zimbo nennen. Ich würde Ihnen ja die Hand geben, aber Sie haben sicher keine Lust auf einen Stromstoß.\" Was er in den letzten Wochen erlebt hat, kann man sich kaum vorstellen: \"Seit dieser Hype begonnen hat, kann ich kein normales Leben mehr führen\", berichtet er. \"Anfangs rannten die Leute einfach nur vor mir weg, aber inzwischen greifen sie mich an. Ich habe Angst, traue mich nicht einmal mehr mit Kettensäge vor die Tür.\" Die nackte Angst steht Zimbo ins Gesicht geschrieben. Selbst seine Vorhänge hält er ständig geschlossen, damit kein Nachbar die Polizei ruft, wenn er regungslos am Fenster steht. \"So kann es einfach nicht weitergehen.\" Auch seinen Job in einer Geisterbahn hat der 33-Jährige inzwischen verloren, nachdem er seit über eine Woche nicht mehr bei der Arbeit erschien. \"Ich kann ja momentan nicht einmal Zigaretten holen gehen, ohne dass mich gleich ein paar Jugendliche verfolgen.\" Er kratzt sich nervös an seiner roten Nase, steckt dann eine Zigarette in seinen riesigen, von langen krummen Zähnen gespickten Mund. \"Die hat mir ein Bekannter gegeben, der mir auch hin und wieder etwas rohes Fleisch mitbringt, damit ich hier genug Essen habe.\" Am Mittwoch habe er erstmals seit fünf Tagen versucht, seine Wohnung zu verlassen. \"Ich habe mich extra mit Hautfarbe geschminkt, meine am wenigsten blutverschmierten Sachen angezogen, eine falsche Menschennase getragen und meine Glatze unter einem Hut versteckt\", berichtet Wiegmann. \"Ich sah aus wie ein normaler Mann mit Schuhgröße 93. Aber so nach einer Viertelstunde gab es ein Gewitter und meine Tarnung löste sich auf.\" Er schaffte es gerade noch rechtzeitig nach Hause, bevor ihn ein wütender Mob einholen konnte. Was ihn noch trauriger stimmt: \"Bald ist Halloween. Normalerweise freue ich mich darüber, weil das der einzige Tag im Jahr ist, an dem ich völlig ungestört Party machen kann. Aber diesmal bleibe ich zu Hause und hoffe darauf, dass danach dieser Hype endlich aufhört und ich wieder ein ganz normales böses Clown-Leben führen kann.\" Aus Zimbos Augen laufen bittere Bluttränen, als wir ihn und unseren inzwischen mit einer Axt ermordeten Fotografen in seiner Wohnung zurücklassen. ssi, dan; Fotos [M]: Shutterstock Artikel teilen:'"}, "time": 1742561848.1758025}