{"duration": 0.09887075424194336, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Asia and Australia: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at asiabriefing@nytimes. com. Here’s what you need to know: • The polls have closed in much of the United States. Donald J. Trump has won the crucial battleground states of Florida and Ohio along with more than 20 other states, leaving Hillary Clinton only a narrow path to the presidency. Check here for the latest numbers. Our reporters are providing   election analysis, and we’re offering unlimited access to The Times through Thursday morning. _____ • Markets in Asia were trading lower  —   Japan’s stocks plunged  —   and the prospect of a Wall Street   rose after Mr. Trump’s unexpectedly strong showing. For the first time in modern memory, both candidates are watching the results in Midtown Manhattan  —   though across town from one another. • The Philippines’ highest court ruled that Ferdinand E. Marcos, the former dictator ousted by his people after a brutal   rule, can be reburied in a heroes cemetery, as planned by President Rodrigo Duterte. The Marcos family welcomed the ruling and so did supporters, above, but many Filipinos expressed hurt and anger. A senator said the court had “miserably failed the test of history and broken our hearts. ” • Hundreds of lawyers marched through Hong Kong’s central business district in a silent show of opposition to China’s assertion of power over the city’s judiciary. Some noted that local courts, which operate on common law, could still soften or even stymie the implementation of Beijing’s decision to block two   politicians from taking office. _____ • South Korea’s president, Park   is allowing her rivals in Parliament to pick a new prime minister in place of her own nominee, her latest attempt to defuse an   scandal. Prosecutors also raided the offices of Samsung, South Korea’s largest conglomerate, to investigate possible links to the scandal. Corruption has become a pressing issue for the country amid slowing economic growth. _____ • Ferocious battles have turned parts of the Syrian city of Aleppo into a moonscape of shattered buildings. Our reporter made a recent bus tour of the western,   part of the city, documenting scenes of stark destruction as well as the almost surreal contrast of seemingly normal life. _____ • India’s   notes are now worthless. Prime Minister Narendra Modi devalued the   and   bills because they are frequently counterfeited or used for graft. • Iran signed its first major deal with a Western oil company since international sanctions were removed in the nuclear agreement. The preliminary $4. 8 billion deal with Total calls for the production of 1. 8 billion cubic feet of natural gas per day. • American environmental groups protesting the Dakota Access pipeline near the Standing Rock Sioux Reservation are targeting a new group: banks that have helped finance the project. • Adjoining apartments in Hong Kong sold for an Asian record of more than $13, 500 per square foot. •  Here’s a snapshot of global markets, which have been shaken by the American election. • A British banker was found guilty of murdering two Indonesian women at his luxury Hong Kong apartment, a case that exposed the underbelly of the city’s financial sector. [The New York Times] • Singapore’s prime minister said only Malay candidates would be allowed to run in next year’s presidential race, to ensure there would be a president from the minority group for the first time in more than 46 years. [The Straits Times] • Hungary’s Parliament rejected a proposal to bar refugees being relocated from the rest of Europe. [The New York Times] • Iraqi troops advancing on Mosul discovered a mass grave containing about 100 bodies, many of them decapitated. [The Associated Press] • A manhunt is on for two inmates who made an   escape from a London prison. [The New York Times] • Take a glimpse of Yarchen Gar, China, a wonder of the Tibetan highlands populated by Buddhist nuns. [The New York Times] • Two hundred mahouts and 11 elephants, powdered an auspicious white, paid respects to King Bhumibol, who died last month, at the Grand Palace in Bangkok. [Bangkok Post] • Prince Harry has had enough. The    grandson of Queen Elizabeth II blasted British news coverage and social media trolls for the “outright sexism and racism” unleashed on his biracial American girlfriend, Meghan Markle, above. • Russia’s Kontinental Hockey League is trying to make ice hockey popular in China, where the sport’s traditional rowdiness seems not to have translated. • Iran, after years of isolation, global sanctions and bad press, is blossoming as a tourist destination for travelers from Europe, and even the United States, looking to explore the unknown. • Toblerone, the Swiss chocolate bar, has altered the   shape of two of its products. The redesign, which shrinks weight to avoid raising the price, has outraged some fans. “It is one of the most extraordinary works of art to come to the market in the last 10 to 15 years. ” That comment by Sotheby’s chairman for Chinese art was reserved for an   musket made for the Qianlong emperor, who presided over what became China’s last imperial dynasty. The gun is set to be auctioned today in London at an estimated price of roughly $1. 2 million to $1. 8 million. “We’ve never had an imperial firearm,” the Sotheby’s executive, Nicolas Chow, said. Handcrafted out of wood, with components made of gold, silver and copper, the gun is over five and a half feet long. An inscription reads, “Supreme Number One. ” Sales of Chinese art accounted for nearly a third of the global art auction market last year, according to a recent analysis. Mr. Chow said that many treasures were taken from the palace after the dynasty ended. Their return is viewed as a matter of national pride. The emperor’s fondness for the weapon can be seen in a poem attributed to him, but a jade seal he used during his abdication might be the emperor’s most valuable possession. Last month, an anonymous buyer paid nearly $12 million for the item. Patrick Boehler contributed reporting. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help.  Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742561874.956825}