{"duration": 0.07042455673217773, "input_args": {"text": "'Headlined to H3 10/27/16 - Advertisement - A vivid example of benefits from decriminalization of possessing small amounts of marijuana occurred at the Philadelphia airport recently, a few days after the release of a report from two prominent organizations that called for the national decriminalization of personal use/possession of marijuana and other illicit drugs. This example, interestingly, occurred on the day of the second anniversary of Philadelphia\\'s implementation of decriminalization, the enforcement practice that replaces possession arrests with issuance of traffic-ticket like citations. That enforcement change has saved the City of Philadelphia at least $9-million in costs related to arrests and adjudications for marijuana possession, analysts calculate. However, a few days after that decriminalization anniversary in Philadelphia, a news media report detailed the ordeal experienced by a Philadelphia resident arrested in a suburban county adjacent to Philadelphia for a small amount of marijuana. That chance arrest ultimately led to weeks of needless incarceration in New Jersey, the state where Republican Chris Christie, an avowed opponent of decriminalization, serves as governor. Philly pot arrests drop after decriminalization.(image by LBW Photo) License DMCA The Philadelphia airport discovery of a small amount of marijuana in the luggage of three-time Philadelphia GOP mayoral candidate Sam Katz resulted in embarrassment for Katz but not his arrest and subsequent court proceedings. At the airport, Philadelphia police issued a $25 citation to Katz. Receipt of that citation allowed Katz, a nationally respected municipal finance expert turned award winning documentary filmmaker, to continue to Florida for a planned fishing trip instead of a trip to jail. The 2015 discovery of a similar small amount of marijuana at the then suburban Philadelphia home of Ivan Haynes produced a chain of events dramatically different from what happened to Katz. - Advertisement - Police in the suburban Philadelphia community of Bensalem, Bucks County found a few grams of marijuana when serving a warrant on Haynes for a minor offense. Haynes missed court dates for that marijuana possession arrest because Bucks County authorities sent court date notices to the wrong address. Bucks County authorities issued a bench warrant for the arrest of Haynes when he did not appear in court despite his lack of awareness of those court proceedings. In July 2016, when Haynes was in an automobile that had a minor accident on the New Jersey turnpike, State Police detained him on that bench warrant. That detention led to Haynes\\' imprisonment in NJ for 41-days before his extradition to Bucks County. Upon return to Pennsylvania Haynes was quickly released by Bucks County authorities and subsequently sentenced to time served (in NJ) for that 2015 marijuana possession arrest. That NJ incarceration robbed the self-employed Haynes of jobs and cost him good-will of some clients. In 2015, Bucks County registered the third highest number of marijuana possession arrests in Pennsylvania at 1,010. Bucks County, Pa -- like the entire state of New Jersey -- has not decriminalized possession of small amounts of marijuana. Over half of the nearly 25,000 marijuana possession arrests in New Jersey during 2014 were for amounts of 50-grams or less. Marijuana prohibition has cost NJ taxpayers between $150-200-million since 2010 when Christie took office, experts estimate. - Advertisement - Before Philadelphia became the largest city in America to implement decriminalization of simple possession of marijuana on October 20, 2014 thousands endured arrest annually. Those arrests produced the stain of a criminal record and often incarceration. During the years 2012-2013 before decriminalization in Philadelpia police arrested 8,580 adults and juveniles. Philadelphia possession arrest figures for 2015 and part of 2016 after implementation of decriminalization, around 1,500 Philadelphians experienced arrest for marijuana possession -- a marked decrease. \"Decriminalization has been a resounding success for the municipal government and for cannabis consumers in Philadelphia,\" PhillyNORML official Chris Goldstein said. Goldstein, an expert on cannabis policy, writes a weekly column on cannabis issue for philly.com, the news website for Philadelphia\\'s two daily newspapers. Days before the decriminalization of marijuana possession anniversary in Philadelphia a report issued jointly by Human Rights Watch and the American Civil Liberties Union called on federal and state authorities to decriminalize personal use and possession of drugs due to the documented failures of the War on Drugs. The two organizations recommended a shift from shift enforcement to prevention and harm reductions.'"}, "time": 1742562141.0462732}