{"duration": 0.14368319511413574, "input_args": {"text": "'There’s a moment in the   rapper A Boogie Wit Da Hoodie’s single “Friend Zone” that encapsulates the conundrum  —   and also opportunity  —   facing New York  . In the song, after meeting a girl, he tries talking her up. “I’m from New York,” he tells her. “She like my accent. ” That the tongue of New York  —   the birthplace of    —   would be anything but the genre’s normative voice is a reality that local rappers have been ignoring for years now, even as rap’s center abandoned this city for ones far away: Atlanta, Miami, Toronto and beyond. New York is rap’s ancestral home, and also, it turns out, home to its greatest stylistic conservatives, stubbornly standing their ground while the crowds disperse. And yet New York retains a sort of mystique: To become the sound of the city still feels like a    goal. But for more than a decade, such consensus has been tough to come by  —   every attempt at a new New York style was greeted with skepticism and reluctance. A Boogie may have cracked the code. “I think about it a lot every day,” he said one evening last week. “I’m responsible for things right now in my city. It’s a lot of pressure. ” The    rapper was in the back seat of a black S. U. V. slowly making its way around Highbridge, a geographically isolated corner of the southwest Bronx where he was born and largely raised. Every now and again, he would open up the window to call out to an old friend or point to a personal landmark and tell a story. Over there, an apartment building where he used to record in a closet. A couple of blocks away, a stoop on which he wrote the lyrics for “Bando,” one of his hits. When the driver tried to turn onto one busy block, A Boogie stopped him: “This is the bad block right here,” he said. At the beginning of this year, A Boogie  —   born Artist Dubose  —   was still a fixture in this neighborhood. But on Valentine’s Day, he released his debut mixtape, “Artist,” full of songs that merged sensitivity and bluster delivered in strident,   melodies. By this summer, a handful of his tracks  —   “Friend Zone,” the tough “Bando,” the breezy “My ______”  —   had become fixtures on New York radio and made A Boogie the most promising young rapper the city has produced in some time. He has found a way to make a New York rap sound that’s modern, not preoccupied with the formalist bullies of the 1990s (the L. O. X. DMX) that still define the city to so many. A few times in recent years, new New York sounds arrived and threatened upheaval: ASAP Rocky’s polyregionalism, French Montana’s morbid celebrations, the occasional “Chicken Noodle Soup” novelty. But A Boogie’s sound acknowledges the youthful power of the internet and the   inclusion of melody in   while still being rooted in   New York roughneck business. “There’s so few New York movements  —   we’ve got to be a part of this one,” said Craig Kallman, the chairman and chief executive of Atlantic Records, who signed Highbridge the Label, A Boogie’s label, to a joint venture. Several of the songs on “Artist” were inspired by a rocky situation with a girlfriend, including a pregnancy scare. While writing about that experience, A Boogie began experimenting with how to best manipulate his voice, landing on a creaky, sweet, melodic style delivered with a bruiser’s cadence. “I was always scared to use that around people,” he said. “Even to this day, I’m still developing my voice. I used it again in a different type of mood song, like a hood song, and it sounded crazy again and I was like, ‘Damn, this is the voice right here.’ It made me want to do mad music in different moods. ” That’s meant flexibility in approach: sometimes his most rugged subject matter  —   on “Artist,” and also “Highbridge the Label: The Takeover Vol. 1,” the mixtape he released in May with his labelmate Don Q  —   comes in the softest voice, and vice versa. If there is a New York legacy A Boogie belongs to, it is perhaps the long tail of the era of   gangsters, from Biggie Smalls and the Bad Boy label to the days of 50 Cent and Ja Rule. Still, Mr. Kallman noted, “I don’t think necessarily the focus on the history is essential. ” Besides, it is a promising moment for young New York rappers, from A Boogie and Don Q to sly ruffians like Young M. A. to sharp lyricists like Dave East. Indeed, A Boogie’s rise has been almost completely    —   reminiscent of Bobby Shmurda’s rapid ascent in 2014, but without a dance to encourage virality. He began by posting songs on Soundcloud, and also Facebook, where he would ask fans who liked samples of his songs if he could tag them when the full version was released. That became a sort of street marketing team. Soon after he released “Artist,” he first heard one of his songs on Hot 97, the venerated New York radio station, while he happened to be streaming on Facebook Live. By April, he performed a   show at B. B. King Blues Club  Grill. Around that time, he began a string of club performances alongside the Hot 97   D. J. and longtime New York rap agitator Funkmaster Flex, who first learned about A Boogie from the bloggers on his website, and from requests in Bronx nightclubs. “For the first time in a while, that New York sound, people are looking to put in their clubs up and down the East Coast,” Funkmaster Flex said, before adding, “I don’t want to rush anything and say we’re back. I don’t want to jinx it. ” When A Boogie was young, he said, he sold marijuana “to get the money to get to the studio. ” After getting in trouble as a teenager, he and his family relocated to Florida, where he was arrested at least five times, on charges including burglary and drug possession. (“I didn’t hurt nobody,” he said.) His last year there, he was on house arrest, though he would sneak out to work with a local producer. He returned to Highbridge last summer, but a few months ago moved to a house in Westchester, and more recently, to one in New Jersey, which he shares with Don Q and the label’s owners, QP and Bubba. “There’s a lot of hate,” he said. “Not in the neighborhood, but outside the neighborhood, and people bring that over here. I don’t never know who’s out here no more. ” A few weeks ago, one of his friends was shot and killed in the neighborhood. “I felt like it could have been me,” he said. Around the same time, he performed onstage with Drake during three consecutive shows at Madison Square Garden. After the visit to Highbridge, A Boogie’s S. U. V. made its way to Blast Off Productions near Times Square, a tiny hotbox of a studio with Drake platinum plaques on the lobby wall and speakers strong enough to shake the doors. Even though he was feeling under the weather, he bought a box of Raw rolling papers in the smoke shop downstairs, then headed upstairs for a recording session. After a quick meal from Steak ’n Shake, A Boogie began rolling up some weed in the lobby while in the background, a surly beat throbbed. Soon he began singing in that appealingly cracked voice: He mumbled a few musical phrases to himself, then tried a couplet: “Right when you thought that I was so  ’s when you turned me into a savage,” lingering over the vowel sounds and pushing his voice even further into scratched territory. “I ain’t wanna make that type of song just now,” he said. “I’m happy today. ” But the beat was putting him in a different head space, and squeezing out a different voice. “I’m gonna get back in that bag, talk about my feelings,” he said, then closed his eyes and found the melody.'"}, "time": 1742563363.7243164}