{"duration": 0.050324440002441406, "input_args": {"text": "'    Barbra Streisand says she could have had a shot at even more awards glory if not for the sexism of Academy voters. [In an interview Saturday at the Tribeca Film Festival, the    singer and actress said she was snubbed by Academy voters for her directorial efforts on Yentl and The Prince of Tides because   Academy voters did not want to see a “woman director. ”  “There were a lot of older people. They don’t want to see a woman director,” Streisand told director Robert Rodriguez at the festival on Saturday, according to Variety. “I don’t know how many women wanted to see a woman director. ” 1983’s Yentl, about a Jewish woman (Streisand) who dresses as a man so she can study Torah in a yeshiva  —   was nominated for five Oscars and won one, for Best Original Score. 1991’s The Prince of Tides  —   in which she also starred as a New York therapist who becomes unwillingly involved in a client’s messy personal life  —   was nominated for seven Oscars, including Best Picture for Streisand, but came away  . According to Variety, Streisand appeared to still be bothered by a 1983 review of Yentl by New York Times critic Janet Maslin, who wrote, among other things, that the film used a “  designer yarmulke. ” “None of [the female critics] talked about what the movie was trying to say,” Streisand told Rodriguez, according to the outlet. “It was not about what the movie was about  —   a celebration of women and all they could be. ” When Rodriguez told Streisand that she had paved the way for contemporary female directors, including The Hurt Locker and Zero Dark Thirty helmer Kathryn Bigelow, Streisand disagreed. “Not enough women are directing now,” she said. “I love when I see a woman’s name on the film, and then I want to see it be good. ” Streisand  —   who has also won ten Grammys, nine Golden Globes, five Emmys, a Tony award, and the Presidential Medal of Freedom  —   spoke out against rampant sexism in an interview with WNYC Wednesday, telling the outlet’s Leonard Lopate that misogyny cost former Democratic presidential hopeful Hillary Clinton the White House. “Women are still so underestimated it’s incredible to watch even this last election with Hillary, the kind of strong woman, the powerful woman, the educated woman, the experienced woman, being thought of as the other, or too elite, or too educated,” Streisand said then, adding: “Strong women have always been suspect in this country. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563687.1893704}