{"duration": 0.11436104774475098, "input_args": {"text": "'Email \\nYouTube videos of interviews with college students showing their often abysmal ignorance on even basic issues have recently surfaced. This YouTube video , for instance, asks students, “Who won the Civil War?” Those quizzed didn’t know, or they didn’t know there was one, or if it occurred in 1965. As another example, this YouTube video asks students attending George Mason University to identify a photograph of Vice President Joe Biden. None of them could, including one student majoring in political science. \\nWalter Williams added to the dismay by noting that a recent study by the American Institutes for Research showed that half of four-year college students couldn’t perform simple tasks such as balancing a checkbook. Williams also cited NBC News , which reported that Fortune 500 companies spend about $3 billion a year to train their new employees basic English. \\nWilliams went on to quote reports from the Pentagon that between two-thirds and three-quarters of young people between the ages of 17 and 24 were not qualified for military service because of 1) weak educational skills, 2) poor physical fitness, 3) a history of illegal drug use, 4) medical conditions, or 5) criminal records. \\nSelwyn Duke, writing at The New American , revealed that almost half of American young people between 16 and 20 would vote for a socialist while one out of five would vote for a communist. \\nEach of these statistics can be challenged on one basis or another, no doubt, but using these disparate examples as proof that the \"dumbing down\" of America is complete greatly exaggerates the situation. Just one brief look at what’s happening with homeschooling is sufficient to challenge such a conclusion. \\nBeginning at essentially zero in the 1970s, there are now, according to careful research done by Ann Zeise at A2ZHomeschooling.com, 1.5 million students being homeschooled in the United States. That is 2.7 percent of the 55.7 million youngsters between the age of five and 17 in the country. \\nNot all of of those remaining 54.2 million are in public schools, however, as Zeise doesn’t include private schools, charter schools, Catholic schools, or other options. \\nFor those involved in the freedom fight, how can this possibly be interpreted as good news? In order to “win” — to reverse the ravages of socialist infiltrations into the culture — doesn’t that number have to be 50.1 percent or higher? \\nNot according to Rensselaer Polytechnic Institute (RPI). Its Social Cognitive Networks Academic Research Center published a remarkable yet still unheralded study in July 2011 asking, and then answering, the question: What percentage of a given population needs to adopt a specific point of view before that viewpoint becomes accepted by the population at large? Here is the answer presented in language that only a social scientist could love: We show how the prevailing majority opinion in a population can be rapidly reversed by a small fraction p of randomly distributed committed agents who consistently proselytize the opposing opinion and are immune to influence. Specifically, we show that when the committed fraction grows beyond a critical value pc≈10%, there is a dramatic decrease in the time Tc taken for the entire population to adopt the committed opinion. \\nGabrielle DeMarco, writing two months later, helped readers to understand what RPI had just discovered: Take the see-saw as an example. One side is up. One side is down. Put the biggest kid on the playground on one side. That see-saw is going nowhere. Put a little kindergartner on the other end. Nothing happens. Keep adding on the kindergartners. The see-saw wiggles a bit, gives a little. But, when the pile of 5-year-olds reaches a certain point, that next tiny, seemingly insignificant kindergartener changes the entire schoolyard dynamic.The see-saw squeaks. The big kid is quickly hoisted into the air. The kindergartners stand triumphant. \\nMargaret Mead said the same thing but differently: “Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it’s the only thing that ever has.” \\nAccording to RPI, the operative percentage is 10 percent. \\nThat’s why what one parent who is homeschooling her children at The Freedom Project Academy says is so important, and encouraging: NO Common Core, NO Government funding, NO worries about our children being taught revisionist history.… This begins the list of things for which we thank Freedom Project Education. Our home school family became an FPE family in 2012. We tried one class for our eldest child. He loved it. So did we. Our two eldest are now enjoying their second year as full-time FPE students. Next year, two more siblings will join them. We plan to have all eight of our children graduate from FPE. \\nEach of those eight students is much more likely to participate in politics than are those who haven’t been educated in such an environment. According to the U.S. Census Bureau, young people ages 18 to 24 in general vote far less than their older peers, yet homeschoolers are far more active. According to a study done as the homeschooling movement was spooling up, the National Home Education Research Institute found that 71 percent of adults who had been homeschooled participate in an ongoing community service activity compared with just 37 percent of adults with a public-school background. The study went on: Homeschool graduates are more involved in civic affairs and vote in much higher percentages than their peers. 76% of those surveyed between the ages of 18 and 24 voted within the last five years, compared with only 29% of the corresponding U.S. populace. The numbers are even greater in older age groups, with voting levels not falling below 95%, compared with a high of 53% for the corresponding U.S. populace. \\nThe passage of time hasn’t changed those numbers very much, nor has the motivation of parents homeschooling their children. Jennifer Courtney, writing at ClassicalConversations.com, did an informal survey of some 70 homeschool families, asking them why they homeschooled their children. The top three reasons were: religion, safety, and the quality of their education. Wrote Courtney: “Parents who homeschool often want to set higher standards for their children, choose quality curriculum, or have the flexibility to work at a faster pace in the subjects in which their students excel.” \\nAs those increasing numbers enter the culture, the closer comes that “tipping point” where real restoration of the savaged American Republic can begin, YouTube videos to the contrary notwithstanding. \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. .'"}, "time": 1742563676.4859812}