{"duration": 1.215691328048706, "input_args": {"text": "'By wmw_admin on October 30, 2016 Introduction — Oct 30, 2016 It begins to look like Americans don’t have a real choice in the presidential election. On the one hand Hillary Clinton seems ready to adopt a much more aggressive stance with Russia, which could well escalate into open military conflict between the two powers. While on the other hand Donald Trump has pledged to scrap the nuclear accord reached with Tehran and to stand up to Israel’s enemies, “like Iran”. In other words Trump seems ready to adopt the same belligerent stance over Iran as the Bush administration. Such a policy could easily escalate into military conflict and given Tehran’s growing ties to Moscow that could also lead to military conflict with Russia too. So the choice faced by American voters boils down to six of one, or half-a-dozen of the other. Both candidates have outlined foreign policies that could inevitably lead to war with Russia. It’s just that Clinton has chosen a more direct path while Trump has opted for a more roundabout route. Either way American voters seem to have little REAL choice in the matter. Ed. Trump to Israelis: together we’ll stand up to Iran The Jewish Press.com — Oct 27, 2016 \\nA taped one-minute address by Republican presidential candidate Donald Trump, screened at an election rally organized by Republicans Overseas Israel in Jerusalem Wednesday, left no room for doubt: should he be elected, Trump would be the biggest friend Israel has ever had — huge. \\n“My administration will stand side by side with the Jewish people and Israel’s leaders to continue strengthening the bridges that connect not only Jewish Americans and Israelis but also all Americans and Israelis,” Trump told the 200 or so in attendance at the event and the few dozens watching the rally live on Facebook. “Together, we will stand up to enemies like Iran bent on destroying Israel and her people. Together, we will make America and Israel safe again.” \\nIt was a small crowd, admittedly, but the folks, many in Trump T-shirts and “Make America Great Again” baseball caps, made up for their number with enthusiasm, booing and crying “Lock her up” each time the name Hillary Clinton was mentioned. \\n“I love Israel and honor and respect the Jewish faith and tradition,” Trump told his Israeli-American voters. “For me, respect and reverence for Judaism is personal. My daughter Ivanka and my son-in-law Jared are raising their children in the Jewish faith.” \\nTrump’s VP, Gov. Mike Pence, told the Jerusalem rally: “Israel’s fight is our fight, Israel’s cause is our cause,” noting that Israel is “not just our strongest ally in the Middle East, it is our most cherished ally in the world.” Also, Pence said, Israel is “hated by too many progressives, because she is successful and her people are free,” and so, “Let the word go forth that Donald Trump and I are proud to stand with Israel.” \\nLocal speakers included Caroline Glick, Trump’s adviser on Israel David Friedman, and David Peyman, Trump’s head of Jewish outreach, who told the gathering that he had delivered a note from Trump to God at the Kotel. Friedman promised that “a Trump administration will never pressure Israel into a two-state solution or any other solution that is against the will of the Israeli people.” Friedman warned against the seductive messages Trump’s opponent had given the AIPAC conference in March, saying “Hillary Clinton’s words are the cheapest currency on the political marker.” \\nAccording to media reports over the summer, Friedman and Trump’s other adviser on Israel, Jason Greenblatt, suggested the candidate stop elaborating on his vision of two states for two peoples living peacefully side by side. This after Trump had told Maggie Haberman and David E. Sanger of the NY Times in March: “Basically I support a two-state solution on Israel. But the Palestinian Authority has to recognize Israel’s right to exist as a Jewish state. Have to do that. And they have to stop the terror, stop the attacks, stop the teaching of hatred, you know? The children, I sort of talked about it pretty much in the speech, but the children are aspiring to grow up to be terrorists. They are taught to grow up to be terrorists. And they have to stop. They have to stop the terror. They have to stop the stabbings and all of the things going on. And they have to recognize that Israel’s right to exist as a Jewish state. … And if they can’t, you’re never going to make a deal. One state, two states, it doesn’t matter: you’re never going to be able to make a deal.” \\nTrump concluded: “Now whether or not the Palestinians can live with that? You would think they could. It shouldn’t be hard except that the ingrained hatred is tremendous.”'"}, "time": 1742562516.4353113}