{"duration": 0.12222695350646973, "input_args": {"text": "'WASHINGTON  —   Senate Democrats on Friday relented in their flirtation with a government shutdown over a dispute about health care benefits for coal miners, and with less than an hour before the midnight deadline, the Senate approved a measure to fund the government through April. The party’s willingness to take the nation to the brink of a government shutdown signaled its intention, just weeks after its election drubbing in Rust Belt states, to quickly leverage the sorts of issues that propelled Donald J. Trump to victory. The House on Thursday passed a   spending bill that would keep the government open through late April and extend through that month health care benefits for retired miners who were set to lose them at the end of the year. But Democrats wanted those benefits to last for a year, and slowed down voting on the measure with the threat of rejecting the bill. “We never intended to shut down the government,” Senator Chuck Schumer, Democrat of New York, the incoming minority leader, said on the Senate floor Friday evening. He added, “I think we’ve made our point. ” Senator Joe Manchin III, Democrat of West Virginia, who led the charge on behalf of the miners, said that at the very least, he and his colleagues had drawn attention to “what coal miners have done for this country. ” It was unclear what Mr. Manchin and other Democrats had gained from the process. There was no legislative compromise, nor any promise of more money for miners in the future. “There’s no guarantee,” Mr. Manchin conceded, before suggesting that he and other Democrats may hold up legislation over the issue next year. “We’re going to use every tactic we can. ” Mr. Manchin faces   in 2018 in a   state. Asked if he thought the fight over the miners’ health care would help his chances, he said, “Well, I sure don’t think it hurts. ” On Friday morning, the Senate majority leader, Mitch McConnell, Republican of Kentucky, urged his Democratic colleagues to approve the spending bill, warning that without it, the miners would lose their health care at the end of the month. “This is a good time to take yes for an answer,” Mr. McConnell said. He pledged to work to prevent the expiration of the miners’ health care coverage next year and blamed Senate Democrats for contributing to the coal industry’s plight in the first place. Late Friday, senators voted, 61 to 38, on a procedural measure to advance the spending bill, barely pulling it over the line. Many Republicans joined Democrats in rejecting it, though for various reasons. Senator Rob Portman, Republican of Ohio, waited until the 60 votes needed had been cast before voting no. Soon after, about 45 minutes before the government would have shut down, the Senate approved the spending bill, 63 to 36. Democrats’ threat to shut down the government  —   the sort of intransigence adopted by Republicans in the recent past  —   indicates their willingness to use the few tools available to them to block legislation next year, when possible, and to bludgeon Republicans with populist issues on which they share common ground with Mr. Trump. Pressing his case on Thursday, Mr. Manchin said that senators from both parties had campaigned on giving a “fair shake” to working people. “It’s either put up or shut up,” he said. “You’ve asked them to vote for you because of this reason. Now you have a chance to show them that’s why you’re here. ” Mr. Manchin had furiously worked the phones on Friday to see how many senators would join him in voting against a procedural measure to advance the   spending bill. But he found that many senators, like House representatives, wanted to avoid a shutdown. Senators from coal states did want to use the threat of a shutdown to bring renewed attention to the retired miners, and set up a push for a longer extension and a more lasting solution in January. While Democrats now have the opposition party mantle that Republicans held through much of the Obama presidency, the dynamics are different. For instance, while Mr. McConnell distanced himself in the past from Republicans like Senator Ted Cruz of Texas when they sought to disrupt bills, Mr. Schumer stood with Mr. Manchin on Thursday night to call for a better deal for the miners. Mr. McConnell did not prevent the government shutdown of 2013, but in later years, he worked harder to stem disputes before they got that far. “We’re going to win this fight,” Mr. Schumer said on Thursday. “We can’t predict the exact path, but we are going to win this fight, because we’re right. ” The coal industry has been decimated in recent years, with a string of bankruptcies. Lawmakers from   states, as well as the United Mine Workers of America, have pushed for legislation that would protect the health care and pensions of retirees. Democrats argued that a   extension of miners’ health care benefits would leave them in limbo. “I’ve tweeted   Trump,” Senator Sherrod Brown, Democrat of Ohio, said on Thursday, adding that the dispute over the miners’ health care was an early test for Mr. Trump. “In those communities they live in, Trump often got 70 percent of the vote,” Mr. Brown said. “I would think he’d want to help them, but so far, he hasn’t. ” Mr. Trump has not spoken publicly about the Senate dispute, and his transition team did not respond to requests for comment, but he voiced frequent praise for coal miners during his campaign. “We’re going to put our miners back to work,” Mr. Trump said on Friday night at a rally in Michigan. “Miners, we love our miners. ” In a twist, Mr. Manchin had been scheduled to meet with Mr. Trump on Friday the meeting was postponed until Monday. In addition to the fight over the miners, Senate Democrats spoke out this week on another issue that seemed right out of Mr. Trump’s playbook, pushing to write into law a permanent requirement that   steel and iron be used in water projects. Such a requirement had been removed from a water projects bill that the House approved on Thursday, and Democrats insisted, without success, that it be put back into the legislation. “The time is now for Donald Trump to take a stand in support of American workers,” said Senator Tammy Baldwin, Democrat of Wisconsin. Wrapping up its work for the year, the Senate approved the water projects bill early Saturday morning. The fate of that bill was important to Michigan’s senators, as was the approval of the spending bill. Together, the two measures provide funding to Flint, Mich. and other communities dealing with   drinking water.'"}, "time": 1742562960.4106233}