{"duration": 0.08463907241821289, "input_args": {"text": "\"Here's   \\nIn the half-burned church of St Mary al-Tahira in Qaraqosh, several dozen Syriac Catholics are holding a mass in Aramaic amid the wreckage left by Isis . The upper part of the stone columns and the nave are scorched black by fire and the only artificial light comes from three or four candles flickering on an improvised altar. Isis fighters used the courtyard outside as a firing range and metal targets set at one end of it are riddled with bullets. \\nIn his sermon, the Syriac Catholic Bishop of Baghdad Yusuf Abba calls for the congregation to show cooperation and goodwill to all. But the people of Qaraqosh, an overwhelmingly Christian town 20 miles south east of Mosul , wonder just how much goodwill and cooperation they can expect in return. . \\nThe Christians are still traumatised by the disasters of the last two-and-a-half years. When Isis took Qaraqosh on 8 August 2014 it had a population of 44,000, almost all Syriac Catholics, who fled for their lives to Irbil, the capital of the Kurdistan Regional Government. Some 40 per cent of these have since migrated further to countries like Australia and France or, within the Middle East, to Istanbul and Lebanon. \\nBut the 28,000 people from Qaraqosh who stayed inside Iraq have understandable doubts about going home, even if Isis is fully defeated and loses Mosul. “There is no security while Isis is still in Mosul,” says Yohanna Towara, a farmer, teacher and community leader in the town, but even when Isis is gone the Christians will be vulnerable. He says that “the priority is for us to control our local affairs and to know who will rule the area in which we live.” He adds that the need for permanent security outweighs the need to repair the destruction wrought primarily by Isis but also by US-led air strikes. \\nThis destruction is bad enough, though it is not total. Isis fighters set fire to many ordinary houses in addition to the churches in the days before they left, but – possibly because there was no furniture left to burn since it all had been looted – most of these houses look as if they could be made habitable after extensive repairs. It will take time because not only has the furniture gone, but cookers and fridges so, even if light fittings or taps are still in place, there is no water or electricity. \\nIsis did not fight for Qaraqosh and there are no booby traps or improvised explosive devices. But they must at one time have thought of doing so because they dug networks of tunnels in the nearby Christian village of Karemlash as if they intended to wage an underground guerrilla war against the Iraqi army. In the event, there are few signs of Isis resistance, except the rather pathetic remains of burned out tyres which they set fire to in order to create a smoke haze to impede the visibility of the aircraft of the US-led coalition. There were not many air strikes, but where they did take place the results devastated whole buildings reducing them to heaps of rubble. \\nVisiting Qaraqosh from Irbil 40 miles away, it is easy to understand why people displaced from Qaraqosh and in the rest of the Nineveh Plain feel insecure and dubious about returning to their old homes, even where they are still standing. They know that if they do they will be at the mercy of Arab and Kurdish authorities eager to fill the vacuum left by the fall of Isis and wishing to stake new claims to territory and power. \\nArriving at a Kurdish Peshmerga checkpoint on the main road from the Kurdish region to Mosul at 9am, we make our way through crowds of people originally from Qaraqosh waiting to pass through. “See how they are treating people,” says a critical Christian observer. “People have been waiting here since 5 or 6am, but the Peshmerga say they need a senior officer to give permission for them to pass.” \\nAfter another two Peshmerga checkpoints, we reach an Iraqi army checkpoint with whom the Christians have better relations. The Nineveh Plain east of Mosul was home to a mosaic of minorities and its abandoned villages show various levels of destruction, depending on their sectarian and ethnic complexion. For instance, some had once contained Sunni and Shia Shabak (a heterodox sect speaking a dialect of Kurdish), but Isis had destroyed the houses of the Shia but left the Sunni. \\nCloser to Qaraqosh the checkpoints are manned by soldiers of the Iraqi Army and local Christian members of the Nineveh Protection Units (NPU) with their multi-coloured red, white and blue flags. Relations between the NPU and the army appear good, but the soldiers are Shia and at one checkpoint they had laid out a table and were serving sweet tea and biscuits as part of the Shia Arbaeen commemoration. The diversity of officially-sanctioned armed groups appears never-ending: at some checkpoints there were also visible the dark uniforms of federal police, whom locals say are recruited from the Shabak and Turkmen communities. \\nFear of Isis had united diverse groupings and communities, but that unity is showing signs of fraying. The Peshmerga are excluded from fighting inside Mosul city, but are building a rampart and ditch to denote their front line. The Kurds may be pleased to see Isis defeated in Mosul, but if it is defeated by a reconstituted and effective Iraqi army – very different from the large but ill-commanded and corrupt army that fled from Isis in 2014 – then the balance of power in northern Iraq will change against the Kurds. \\nThe outcome of the war all over Iraq and Syria has ensured that minorities that were once spread throughout the two countries, now only feel secure if they can rule their own territory. But in Iraq the Christians do not have the numbers to defend themselves. (Reprinted from The Independent by permission of author or representative)\""}, "time": 1742562293.9896374}