{"duration": 0.10379171371459961, "input_args": {"text": "'posted by Eddie At an Italian port in the Bay of Naples, construction on a wider dock is underway. But as workers build on the shores of the Mediterranean Sea, they begin to discover something incredible buried beneath the waves… The first evidence of a lost underwater city off the western coast of Italy emerged in the 1920s. Fishermen from Naples began discovering strange, ancient artifacts caught up in their fishing nets. They alerted archaeologists to their finds. Later, workers widening docks at nearby Porto Venero discovered a haul of treasures languishing on the seabed. Statues, architectural remains and mechanisms featuring imperial insignias were all recovered. During the 1940s, pilot Raimondo Baucher snapped some aerial photographs of the region. The images revealed extensive archaeological ruins submerged beneath the surface. However, it wasn’t until the 1960s that researchers began properly investigating the site. Surveys revealed that the ruins and artifacts belonged to what once would’ve been a grand and extensive city. A paved road was discovered with buildings either side, and cement jetties were seen to stretch out into the sea. A few years later, in 1969, a scuba diver made a startling discovery. Some 1,500 feet from the spot that had been previously identified as the sunken city’s center, a Roman sculpture was pulled from the water. Experts deduced it was part of the decor for a grand villa. Over the years, many more objects, such as marble statues and household items, have been recovered from the site. One by one, they’ve allowed archaeologists to construct a vivid picture of what life was like in the city, before it disappeared beneath the waves. Back in the days of the Roman Republic, Baiae was a lively, popular seaside resort. Its main draw was its bathhouses filled with warm mineral water from underground springs. The Romans believed the water had therapeutic powers, and many physicians would advise their patients to visit the area. Apparently, Baiae served a similar role in Roman society as Las Vegas does today. Brimming with glitzy facilities like casinos and swimming pools, it became known as a hedonistic hideaway for the Republic’s elite. In Baiae, wine-fuelled beach parties and loose sexual morals were considered the norm. Apparently, Roman dictator Julius Caesar once owned a villa in the city. Several celebrities of the day – Nero and Cicero, for example – were believed to make visits, too. The city also played an important role in some of the most celebrated events in Roman history. When the astrologer Thrasyllus predicted that Caligula had as much chance of becoming emperor as he did of riding a horse across the Gulf of Baiae, Caligula is said to have ordered the building of a three-mile bridge across the water here. He then proceeded to cross it on his favorite horse, proving the astrologer wrong. For centuries Baiae remained the resort of choice among the upper echelons of Roman society. Then, in the first millennia AD, its fortunes began to change. The widespread migration known to Romans as the Barbarian Invasions had begun, and the city was attacked and looted for the first time. Later, in the 8th century, Saracen invaders wreaked further havoc on the streets of Baiae. Then, in 1500, the city’s remaining inhabitants abandoned it after malaria became prevalent in the region. Finally, later that century, the very geological features that had made Baiae such a hit led to its ultimate demise. The volcanic activity that had fed Baiae’s popular bathhouses with warm water eventually caused a seismic shift in the land. The result? It sent the city and all of its buildings straight into the Mediterranean Sea. By the time the dust had settled, the coastline had receded by up to 200 feet. Now under around 16 feet of water, Baiae seemed destined to be forever lost to the annals of history. However, all that changed in the 20th century, when one by one the city started to give up its treasures to the outside world. In 1980 the first official dig took place in the sea. Underwater archaeologists were able to identify a nymphaeum – a type of shrine dedicated to the nymphs or nature spirits – believed to belong to Emperor Claudius. Archaeologists were also able to build a clear picture of the city’s imperial palace, a vast structure filled with many statues and works of art. Some of the artifacts, including the nymphaeum, were brought to shore and displayed in the Phlegraean Fields Archaeological Museum in modern-day Baia, Italy. In the year 2000, a ferry ran aground and seriously damaged the underwater ruins. Because of this, all commercial ships were barred from sailing in the area. Then, two years later, the Baia Archaeological Park was formed. Designated a protected marine area, the park exists to preserve the ruined city for future generations to enjoy. Today, those keen to catch a glimpse of this lost underwater civilization are in luck. A company called BaiaSommersa runs regular sightseeing trips from Naples aboard a glass-bottomed boat. Braver souls can also don scuba diving gear and explore the ruins at their own pace. Source:'"}, "time": 1742563662.501636}