{"duration": 0.09246706962585449, "input_args": {"text": "'televisión \\nLa fórmula de emitir capítulos de Los Simpson en cualquier momento parece que le sigue funcionando a Antena 3, que ayer fue líder de audiencia con un especial de esta serie de animación. La continua repetición de sus capítulos hizo que la cadena ni siquiera los emitiera. En su lugar, aparecía Matías Prats recordando sus momentos preferidos. “Me gusta cuando Bart vende su alma a Milhouse. ¿Y el del Tenacitas? Ese me gustó mucho”, explicó Prats. \\nTelecinco también consiguió un excelente resultado. Aprovechando el estreno de la película “Animales fantásticos”, la cadena de Mediaset quiso subirse al carro de la “Harrypottermanía” y emitió “ Live at Hogwarth’s “, un especial de dos horas en el que Belén Esteban, con una chistera, enseña a la audiencia cómo se usa el juego Magia Borrás. \\nLa nostalgia vende, y eso lo sabe bien La 1 de Televisión Española. Tras anunciar que adaptará a la pequeña pantalla el best seller “ Yo también fui a EGB .”, protagonizado por Dani Rovira en el papel de bote de Tipp-ex, la cadena pública decidió exprimir la fórmula de la nostalgia emitiendo íntegramente la programación de anteayer. \\nCuatro, por su parte, parece que no acaba de encontrar un formato que le funcione en el “prime time”. Fría acogida del estreno de su nuevo docureality “ Callejeros Condescendientes “, en el que diversos imbéciles recorren el mundo diciendo frases como “son tan felices con tan poco” o “lo mejor de esta ciudad son sus gentes”. \\nTampoco fue la noche de La Sexta. El show de Chicote centrado en las reuniones de vecinos, “ Pesadilla en el rellano “, no está obteniendo los números esperados. Ayer, Chicote se presentó para mediar en un conflicto relacionado con el posible cambio de los buzones. El cocinero utilizó su táctica de irse muy enfadado y volver poco después, para que los concursantes recapaciten. Pero esta vez no le funcionó: a su regreso, Virginia del sexto le había abierto la cabeza a la Puri, del bajo, golpeándosela contra los buzones. Ni por esas la audiencia mostró interés. \\nEn clave autonómica, la catalana TV3 consiguió su máximo histórico con la “ Telemarató” , un espacio solidario que este año ha conseguido 20 mil millones de euros para pagar la multa de Messi a Hacienda. \\nEn Galicia, TvG sorprendió con su formato “ Al filo de la mayoría “, un experimento en el que un alcalde del Partido Popular hacía cosas terribles: hundir un petrolero, pellizcar los testículos a gatos de la calle, pedir pizza con piña… El objetivo: comprobar cuál es el límite que hay que superar para que le dejen de votar. \\nY en Televisión de Castilla La Mancha se vivió una noche especial. Isabel Gemio inició una nueva edición de su clásico “ Sorpresa, sorpresa ” visiblemente emocionada. Tras una pausa publicitaria, Gemio descubrió ser víctima de su propio equipo y la sorpresa se la llevó ella. En el plató aparecieron Jaime Bores, Alicia Senovilla y Agustín Bravo para gritarle al unísono “¡Bienvenida a Televisión de Castilla La Mancha! ¡Bienvenida al ocaso de tu carrera!”. Habían hecho creer a la presentadora que estaba trabajando de nuevo para Telecinco. Gemio rompió a llorar de pura ilusión. \\nLa 2 de Televisión Española volvió a ser la última opción de los espectadores. Quizá no ayudó el controvertido título del documental que emitió: “ Todos los que tienen audímetro son unos hijos de puta “.'"}, "time": 1742562299.1069357}