{"duration": 0.0628519058227539, "input_args": {"text": "'Home › SOCIETY | US NEWS › SCHOOLS ALL OVER AMERICA ARE CLOSING ON ELECTION DAY DUE TO FEARS OF VIOLENCE SCHOOLS ALL OVER AMERICA ARE CLOSING ON ELECTION DAY DUE TO FEARS OF VIOLENCE 0 SHARES \\n[10/28/16] Will this be the most chaotic election day in modern American history? All across the nation, schools are being closed on election day due to safety fears. Traditionally, schools have been very popular as voting locations because they can accommodate a lot of people, they usually have lots of parking, and everyone in the community knows where they are and can usually get to them fairly easily. But now there is a big movement to remove voting from schools or to shut schools down on election day so that children are not present when voting takes place. According to Fox News , “voting has been removed or classes have been canceled on Election Day at schools in Illinois, Maine, Nebraska, New Hampshire, Ohio, Pennsylvania, Wisconsin and elsewhere.” Just a couple days ago , I shared with you a survey that found that 51 percent of all Americans are concerned about violence happening on election day, and all of these schools closing is just another sign of how on edge much of the population is as we approach November 8th. \\nMany officials are being very honest about the fact that schools are being shut down on election day because they are afraid of election violence. The following comes from Fox News … \\nSeveral schools across the nation have decided to close on Election Day over fears of possible violence in the hallways stemming from the fallout from the heated rhetoric that consumed the campaign trail. \\nThe fear is the ugliness of the election season could escalate into confrontations and even violence in the school hallways, endangering students. \\n“If anybody can sit there and say they don’t think this is a contentious election, then they aren’t paying much attention,” Ed Tolan, the Falmouth, Maine police chief, said Tuesday. His community has already called off classes on Nov. 8 and an increased police presence will be felt around town. \\nAnd without a doubt, voting locations are “soft targets” that often have little or no security. We have been blessed to have had such peaceful elections in the past, but we also need to realize that times have changed. I believe that there is wisdom in what Georgia Secretary of State Brian Kemp told reporters … \\n“There is a concern, just like at a concert, sporting event or other public gathering that we didn’t have 15 or 20 years ago,” said Georgia Secretary of State Brian Kemp, co-chairman of the National Association of Secretaries of State election committee. “ What if someone walks in a polling location with a backpack bomb or something? If that happens at a school, then that’s certainly concerning.” \\nAll it is going to take is a single incident to change everything. \\nLet us hope that it is not this election day when we see something like that. \\nAnother reason why polling locations are under increased scrutiny this election season is because of concerns about election fraud. This is something that Donald Trump has alluded to repeatedly on the campaign trail. For instance, just consider what he told a rally in Pennsylvania … Post navigation'"}, "time": 1742562690.5312133}