{"duration": 0.13768863677978516, "input_args": {"text": "'México, ante la CIDH (otra vez) El Estado mexicano hoy está de nueva cuenta en el banquillo ante la Comisión Interamericana de Derechos Humanos (CIDH). Ahora, por la tortura y masacre de 10 indígenas na’saavi y un estudiante universitario en una paupérrima localidad de la Costa Chica de Guerrero. A pesar de las evidencias que claramente pesan sobre el Ejército Mexicano, el gobierno ha solicitado al organismo internacional que declare “inadmisible” el caso y lo archive.\\nSocios | 7 de noviembre de 2016 Zósimo Camacho @zosimo_contra\\nEsta “respuesta” del Estado mexicano a la CIDH ocurrió la semana pasada, 13 meses después de que venciera el plazo fijado para pronunciarse al respecto. La mera demora refleja el menosprecio que al gobierno mexicano le merecen las acusaciones ante la comunidad internacional.\\nLa madrugada del domingo 7 de junio de 1998, unos 300 efectivos del Ejército Mexicano rodearon una humilde escuela en la comunidad na’saavi de El Charco, municipio de Ayutla. Al frente del operativo iba nada menos que el general Juan Manuel Oropeza Guernica, entonces comandante de la 27 Zona Militar.\\nSabían los militares que en dos aulas de la escuela Caritino Maldonado Pérez pernoctaban representantes comunitarios de la región y algunos integrantes de la guerrilla guerrerense. Los primeros habían asistido a una asamblea para organizarse en torno a la demanda de apoyos para el campo. Los segundos habían acudido a solicitar que fueran escuchados para exponer ante los campesinos sus motivos de lucha. Como puede suponerse, una delación tuvo que haber ocurrido para que se movilizara tal cantidad de tropa del Ejército Mexicano y llegara al lugar de la reunión. “El error de los compañeros fue que pernoctaran en ese lugar”, me comentaron varios años después algunos integrantes y exintegrantes del Ejército Revolucionario del Pueblo Insurgente (ERPI) con los que Contralínea ha sostenido entrevistas periodísticas.\\nY pues las armas nacionales se vistieron de gloria: actuaron como sabemos que lo han hecho en 1962 (con Rubén Jaramillo y familia); en 1968 y 1971 (incluso a plena luz del día y en la Ciudad de México); en 1972 en la sierra de Guerrero… y para no enlistar todos los casos (conocidos), llegamos a Tlatlaya (¿e Iguala?) en 2014.\\nLos cientos de efectivos del Ejército Mexicano dispararon a mansalva contra un puñado de indígenas indefensos y cuatro guerrilleros. De estos últimos, dos cayeron en combate y dos más, que se habían rendido para no exponer a la población, fueron vejados y ejecutados extrajudicialmente por los soldados en la misma escuela. En el lugar torturaron y ejecutaron fríamente tanto a los integrantes de la guerrilla como a pobladores que no tenían relación alguna con el movimiento armado. Los militares quisieron sembrar el terror para contrarrestar el entonces impresionante crecimiento del ERPI por todo Guerrero.\\nLos indígenas asesinados aquella madrugada fueron Honorio García Lorenzo y Mauro González Castro, de la comunidad Ahuacachahue; Fidencio Morales Castro y Daniel Crisóforo Jiménez, de Coyul; Fernando Félix Guadalupe, de Ocote Amarillo; Apolonio Jiménez García, de Potrero; Manuel Francisco Prisciliano, de Mesón Zapote; Ceferino Damián Marco, de Coxcatlán, quién fue confundido con Juan García de los Santos; José Rivera Morales, de La Palma; Mario Chávez García, de El Charco, y el estudiante de la Facultad de Ciencias Políticas y Sociales de la Universidad Nacional Autónoma de México Ricardo Zavala Tapia. El reporte militar señaló al estudiante como el comandante Daniel del ERPI.\\nOtros siete indígenas sufrieron torturas y heridas por parte de los militares. Además, a los detenidos aquella madrugada se les trasladó a un cuartel militar, donde bajo tortura fueron obligados a declarar ante autoridades castrenses. Entre los detenidos iban cuatro menores de edad: Bernabé García de Jesús y Melitón Castro Morales, quienes contaban con 14 y 15 años de edad, respectivamente, no hablaban español y no sabían leer ni escribir; Pedro Esteban Ávila y Adrián Patriarca Agustina, entonces de 17 y 16 años de edad, respectivamente; estaban aprendiendo a escribir, leer y hablar español.\\nLos testimonios de los mayores de edad trasladados a las instalaciones militares dan cuenta de los métodos inhumanos (¿debemos decir “de investigación”?) de los militares.\\nÉrika Zamora Pardo declaró que le esposaron las manos, le amarraron un cable y la tiraron con agua en el piso. Sintió entonces descargas eléctricas. Los soldados le decían que tenía que decir lo que ellos querían, porque si no lo hacía la matarían y agredirían a su familia. Le hicieron firmar unos documentos que ellos habían escrito y que nunca le permitieron leer.\\nEfrén Cortés Chávez declaró que le decían que aceptara todo lo que ellos estaban escribiendo, porque, como quiera, de ahí no iba a salir. Le vendaron los ojos y los trasladaron a un lugar donde, con un aparato que le colocaron en la garganta, le oprimieron el cuello hasta casi estrangularlo. Lo desnudaron y le ataron manos y pies a una plancha; con una esponja le mojaron el cuerpo y le aplicaron descargas eléctricas en las tibias de los pies, genitales y en la cabeza.\\nMientras, en la comunidad de El Charco, los soldados entraron a las casas a robar enseres domésticos y alimentos. Las chozas fueron allanadas y saqueadas. Lavaron, pintaron y resanaron la escuela, para eliminar la sangre salpicada en las paredes, pisos y patio, y para disimular los impactos de bala.\\nHe tenido la oportunidad de visitar en varias ocasiones la comunidad de El Charco: su tierra colorada, casi roja; sus milpas húmedas y generosas, donde el maíz, la calabaza y el frijol crecen junto con los niños descalzos; sus sembradíos de flor de jamaica, que pintan de guinda laderas enteras; sus cañas de azúcar cultivadas junto a los arroyos; sus trapiches en los solares de las casas. Y su escuela Caritino Maldonado: conservada como un sencillo memorial de las víctimas.\\nHoy el Estado Mexicano pide a la CIDH archivar este caso y declararlo inadmisible… Lo que es inadmisible es que no haya la menor intención de reconocer el hecho y, por lo tanto, se garantice que situaciones como ésta se sigan ocurriendo. Los cobardes asesinatos contra personas indefensas –hayan o no cometido delitos– tienen que ser castigados. Campañas publicitarias que se pagan con dinero público buscan instalar en la población la idea de que las Fuerzas Armadas respetan los derechos humanos. Si fuera verdad; si el Ejército ha incorporado en sus protocolos de actuación el respeto a la vida y dignidad humanas, ¿por qué no permitir que se sepa la verdad de un pasado que ha quedado atrás? Hasta la fecha (y ahí están los reportes de la Comisión Nacional de los Derechos Humanos) es común que quienes son detenidos por efectivos militares sean trasladados a instalaciones castrenses y no sean entregados a autoridades civiles sino hasta que son torturados. Muchos han muerto en el tormento. ¿Cuándo se va a acabar con esta práctica?\\nFragmentos\\nEl promotor de la Coordinadora Regional de Autoridades Comunitarias-Policía Comunitaria (CRAC-PC) en Tixtla, Guerrero, Gonzalo Molina González, se encuentra preso en el Centro Regional de Readaptación Social de Chilpancingo, Guerrero. Padece enfermedades que requieren atención quirúrgica: litiasis renal y ureteral obstructiva que está afectando al riñón y uréter derechos; litiasis ureteral izquierda, y hernia inguinal derecha. El Colectivo contra la Tortura y la Impunidad demanda atención médica inmediata para Molina González, toda vez que los daños a su salud pueden ser irreversibles en un corto plazo.\\nZósimo Camacho\\n[BLOQUE: OPINIÓN][SECCIÓN: ZONA CERO]\\nContralínea 513 /del 07 al 12 de Noviembre 2016'"}, "time": 1742563394.937563}