{"duration": 0.08289742469787598, "input_args": {"text": "'Lena Dunham claims (claims!) she is losing weight because Donald Trump has convinced her not to eat. The Catholic church won’t declare a person a saint until after their death, but if this extraordinary statement is true, maybe a miracle of this magnitude deserves an exception? [Dunham revealed the news on the Howard Stern Show, during which the actress went through her tired   routine of explaining that promising to move to Canada was “just a joke. ” She also said Hillary Clinton was “the best qualified candidate we’ve ever had. ”  But in the middle of her schtick, an amazing revelation emerged. Lena said “Donald Trump became president and I stopped being able to eat food  …    Everyone’s been asking like, ‘What have you been doing?’ And I’m like, try   pain and devastation and hopelessness and you, too, will lose weight. ” Now that we’ve collectively pulled ourselves together, stopped guffawing and picked the sick out of our keyboards, let’s unpack that statement for a moment. None of us really believes that Lena Dunham can stay off cheeseburgers for long. But if it is true, Trump’s achievement is on par with curing the sick and returning sight to the blind. You’ll recall that when Lena made disgusting comments about abortion, her excuse was that they were said as part of a “delusional girl persona” she “often inhabits. ” Perhaps these weight loss comments were made as part of another persona, one that doesn’t want to die lonely and far too young due to obesity and feminism  …     but I repeat myself. I’ve had my   with Dunham. Without a doubt she is one of the best examples of how feminism attracts ugly women. I even offered to buy her ticket to Canada before she explained it was all of course just a joke. Before the election, I used my Dangerous Faggot college tour stop at Ohio University to point out something Dunham was serious about  —   the extinction of white men. Maybe the real reason she’s lost her appetite is that she realized her antics directly contributed to Daddy’s election! A reasonable person at this point would say, “Why should we pay any attention to Lena Dunham at all?” And it is a fair question. Her HBO series Girls is long gone, and her lack of comedic chops and acting skill ensures she won’t have a serious career outside of small parts given to her out of pity and ideological sisterhood by   producers and directors. As President Donald Trump correctly put it,”Well, she’s a  . You know, she has no  —   you know, no mojo. ” One could argue she has no mojo because that would be cultural appropriation from indigenous tribes, but either way, she certainly lacks the elusive star factor needed in Hollywood. But I’d argue Lena Dunham is an important person to keep an eye on, even now, because she represents the continued lunacy of the left and the progressive march off the cliff. They’ve doubled down on stupidity, and little lost Lena is a perfect case study of the terrible  . (I say “keep an eye on,” but I mean this metaphorically. Even a few Lena Dunham photos can cause irreparable mental scarring and random malfunctions in the optic nerve.) Dunham has also revealed herself to be something of a chameleon, which is another reason we ought not count her out just yet. Consider the drastic changes she has undergone since the election. In the past she was content to be a typical feminist    and an ugly poster child for the body positivity movement. But since the election she has vomited forth a steady stream of hysteria and worse. Her immediate reaction to the election was to blame her fellow white women for the loss, inventing a new privilege called violent privilege to do so. It is certainly instructive that the sisterhood falls apart at the first sign of trouble. Dunham then posted a selfie while sitting on a toilet in December. It was a torrid cry for help from a frightened little girl  —   not a brave move from an empowered woman. She had no clue why people didn’t applaud her for it, either. Just a few weeks into the Trump presidency and the porcine princess of progressive politics is on hunger strike. What’s not to love? And what could be coming next? It’s all just so exciting. Because the deterioration of Lena’s piddling reserves of sanity is speeding up. Will she next be spotted “punching a Nazi” (i. e. anyone to the right of Jane Fonda)?  Will she run for the Senate against Al Franken, because he isn’t unfunny enough to be the left’s former star in Washington? Who can say! I guess there’s a chance she will calm down and moderate her politics instead of attempting to further divide America. But realistically, there is a higher chance of me doing a photoshoot naked in a public bathroom eating cake. Not that such a shoot wouldn’t be, like, super hot. DANGEROUS is available to   now via Amazon, in hardcover and Kindle editions. And yes, MILO is reading the audiobook version himself!  Follow Milo Yiannopoulos (@Nero) on Facebook, Instagram and Snapchat. Hear him every Friday on The Milo Yiannopoulos Show. Write to Milo at milo@breitbart. com.'"}, "time": 1742564539.583332}