{"duration": 0.016006946563720703, "input_args": {"text": "'Eli Lake writes in Bloomberg View that the leaks leading to the resignation of National Security Advisor Mike Flynn are an alarming, weaponized use of “tightly held government secrets. ” He likens the intelligence community’s actions to that of a police state. [From Bloomberg:  The point here is that for a White House that has such a casual and opportunistic relationship with the truth, it’s strange that Flynn’s “lie” to Pence would get him fired. It doesn’t add up. It’s not even clear that Flynn lied. He says in his resignation letter that he did not deliberately leave out elements of his conversations with Ambassador Sergey Kislyak when he recounted them to Vice President Mike Pence. The New York Times and Washington Post reported that the transcript of the phone call reviewed over the weekend by the White House could be read different ways. One White House official with knowledge of the conversations told me that the Russian ambassador raised the sanctions to Flynn and that Flynn responded that the Trump team would be taking office in a few weeks and would review Russia policy and sanctions. That’s neither illegal nor improper.   …     There is another component to this story as well  —   as Trump himself just tweeted. It’s very rare that reporters are ever told about   communications of U. S. citizens, let alone senior U. S. officials. The last story like this to hit Washington was in 2009 when Jeff Stein, then of CQ, reported on intercepted phone calls between a senior Aipac lobbyist and Jane Harman, who at the time was a Democratic member of Congress. Normally intercepts of U. S. officials and citizens are some of the most tightly held government secrets. This is for good reason. Selectively disclosing details of private conversations monitored by the FBI or NSA gives the permanent state the power to destroy reputations from the cloak of anonymity. This is what police states do. Read the rest of the article here.'"}, "time": 1742628492.7316918}