{"duration": 0.10308837890625, "input_args": {"text": "'Senior Vice President for Policy and Programs at the Center for Security Policy and former CIA analyst, Fred Fleitz, joined Breitbart News Daily SiriusXM host Alex Marlow on Tuesday to discuss the death of Otto Warmbier just days after returning from North Korea and the possibility of Loretta Lynch testifying before the Senate Judiciary Committee. [Fleitz said he’s still hopeful that there could be an investigation into Loretta Lynch, “I really hope so,” he said, “because that was the criminal activity of the 2016 campaign. Why was the law not enforced concerning the Clinton email server, the mishandling of classified information, the Clinton Foundation, and what I think are numerous instances of foreign governments trying to buy influence with a prospective president?”  “There are clear instances of    with the Clinton Foundation,” he continued. “The email server broke so many laws. If I had done a small fraction of the things connected with that incident I’d have lost my job, I’d have enormous legal bills and frankly, I think I’d be serving prison time. ” Fleitz added that he hopes Lynch and other Obama officials are questioned by the Senate. Said Fleitz of the Democrats, “If they’re going to pursue this route, this relentless series of pointless and false investigations of President Trump, let’s investigate Hillary Clinton and all the criminal activity that she is clearly responsible for. ” As regards American college student Otto Warmbier, Fleitz Said, “This is just such a terrible story. The North Korean government murdered this young man. They murdered him. And we know that North Korea is a criminal regime. But what I’m very angry about is how the Obama administration did almost nothing to get him back. ” “There were no consular visits,” Fleitz continued, “which are required under international law by the state representing us, Sweden, to check on him while he was in prison. There were none. ” Fleitz continued to blast the Obama administration for dropping the ball. “A young man who was his hotel roommate before he was arrested, he’s a British citizen, says the Obama administration never contacted him to find out the particulars of why he was arrested. The Obama administration said to the Warmbier family, stay silent, do nothing, and the Obama administration pursued their idiotic policy of strategic patience, which we now know was an utter failure. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563628.5345507}