{"duration": 0.06043219566345215, "input_args": {"text": "'Capital Press – by Tom Mallams \\nOnce again, our federal government is “proposing” yet another attempt to lock up more “public” land — this time, by expanding the Cascade-Siskiyou National Monument in Southern Oregon and Northern California. \\nAs a citizen and as a Klamath County commissioner, I have consistently opposed locking up more and more public land and not having the ability to use natural resources in a responsible way. These efforts seem to have no end in sight. \\nYes, at this point this is still “only a proposal.” But just look at the recent attempts such as the 2.1 million-acre Owyhee Canyon Lands, and the 500,000-acre Crater Lake wilderness area. \\nIf this recent attempt moves ahead, it will have devastating effects on the local communities. Also keep in mind that over 50,000 of these acres are O&C timber lands. The loss of timber harvests will also have a major effect on all 18 of the O&C counties. With no timber sales, there will also be little if any meaningful timber management that will increase the amount of major wildfires. \\nThe supporters claim there is “strong backing from elected officials, citizens and chambers of commerce.” That actually equates to the cities of Ashland and Talent along with their chambers of commerce. \\nNot exactly a mandate. \\nIn reality, very few in opposition even knew about the recent public meeting in Ashland. Local Bureau of Land Management offices in Klamath Falls and Redding hadn’t even been notified. If the expansion is approved the talk is that the Klamath office would likely be closed — a loss of 60 jobs. The supporters’ sea of blue T-shirts and professional campaign signs that were present show they had plenty of advance knowledge. Well-rehearsed, scripted comments by the supporters often mentioned moving forward on the Owyhee effort as well. The unfolding scenario certainly has the smell of “the fix is in.” \\nI have requested an additional public comment meeting/hearing be held in Klamath Falls. \\nThese lands belong to the public. The government is supposed to manage them, not lock them up. \\nThese proposals need to die, and the quicker the better. \\nTom Mallams is a Klamath County commissioner and a rancher. He lives near Beatty, Ore.'"}, "time": 1742561873.570639}