{"duration": 0.06305575370788574, "input_args": {"text": "'An Ohio prosecutor said Monday that no charges would be brought against Michelle Gregg, the mother of a    boy whose foray into an exhibit at the Cincinnati Zoo led to the killing of a gorilla and set off a frenzy of condemnation online. The Hamilton County prosecutor, Joseph T. Deters, made the announcement at a news conference in Cincinnati after an investigation that relied on the recollections of four witnesses. “She was being attentive to her children by all witness accounts,” he said. “And the    just scampered off. ” Ms. Gregg, 32, who was also accompanied on the trip by three of the boy’s sisters on May 28, had turned her back for a matter of “seconds” when the child made a beeline for the Gorilla World enclosure, Mr. Deters said. “If anyone doesn’t believe a    can scamper off very quickly,” he said, “they’ve never had kids because they can, and they do. ” In a statement, the Gregg family said it was pleased with the decision. “This is one more step in allowing us to put this tragic episode behind us and return to our normal family life,” the statement said. “We extend thanks to all of those who have been praying for us and who have supported us through this trying ordeal and praise to God for his mercy and grace. ” Ms. Gregg had faced intense public scrutiny, as well as unrelenting invective on social media, over what some saw as her failure to block the boy from the pen. After breaching a   fence, the boy fell about 15 feet into a shallow moat and was then dragged around by Harambe, a western lowland gorilla weighing more than 420 pounds. Zoo workers, fearing for the child’s safety, shot and killed the animal. By early Monday, a petition demanding that Ms. Gregg be investigated for evidence of child neglect had nearly half a million signatures from people who called her attention to the boy “unacceptable” and “grossly negligent. ” Ms. Gregg has declined to give interviews, but in statements released through a spokeswoman, Gail Myers, the family said it had cooperated with the police investigation. The family had no plans to sue the zoo, Ms. Myers said. Witnesses at the zoo described panicked moments as Harambe at times seemed to take a protective posture with the child, but would then yank him violently by the ankle. Thane Maynard, the zoo’s director, said the boy’s head was “banging on concrete. ” In Ms. Gregg’s 911 call, she sounds frantic: “He’s dragging my son,” she says. “I can’t watch this. I can’t. I can’t. ” The screams of the crowd added another volatile element, causing Harambe to become agitated and disoriented, zoo officials said. After about 10 minutes, zoo officials made the fraught decision to kill the endangered animal, firing a single rifle shot to Harambe’s head as he stood over the boy. The boy ended up with scrapes and bruises, but no serious injuries. “This is a beautiful little boy,” Mr. Deters said on Monday, “and had they not acted and this animal behaved sometimes like animals behave, we could have had a genuine tragedy here. ” The zoo faced harsh questions over its decision to use live rounds rather than a tranquilizer dart, and was criticized for erecting a security barrier that could be so easily breached by a small boy. Mr. Maynard, the zoo director, said that the drug would not have acted quickly enough in a situation that at any second could have turned deadly for the boy. The pierce of a dart also presented a risk of startling the powerful animal, he said. The zoo has also defended the barrier around the gorilla enclosure as adequate, noting that until May it had not once been breached since the exhibit opened in 1978. Still, last week the zoo unveiled a reinforced version, raised to 42 inches and secured by wooden beams and knotted rope netting. The exhibit is scheduled to reopen on Tuesday. The Department of Agriculture and the Association of Zoos and Aquariums have both opened investigations into the episode. During his news conference, Mr. Deters defended the zoo’s decision to kill the animal: “The one thing I will say, the zoo lost a beautiful animal, one that many people in this area have enjoyed watching for a long time, but it’s still an animal. “It does not equate human life,” he added. “And they felt that this boy’s life was in jeopardy, and they made the painful choice to do what they did. ” Western lowland gorillas are considered critically endangered, with fewer than 175, 000 left in the wild in Africa. The zoo said Harambe, who was born in captivity and turned 17 the day before he was killed, was an intelligent and curious animal on his way to becoming a group leader. Last week, the Gregg family asked that people offering to send money direct it instead to the Cincinnati Zoo in Harambe’s name.'"}, "time": 1742564134.434596}