{"duration": 0.09787154197692871, "input_args": {"text": "'Turkey Targets Christians – World leaders, the media, and human rights groups remain SILENT Oct 27, 2016 Previous post In the last four years, more than 100 Christian pastors and other religious officials have been deported from Turkey, and banned from reentering. “When Jesus reached 30 years of age, Allah gave him the duty of being a prophet. He then began inviting people to believe in Allah.” — Turkish textbook on Christianity. “[R]eligious minority students are faced with the option of taking the class or sitting alone somewhere else on the school premises during the classes, thus separating them from their peers and singling out their religious differences.” — U.S. Commission on International Religious Freedom, Turkey Textbook Report. It is high time that the activists of the global “human rights community” condemned or at least publicly discussed this “culture of hate” in the Muslim communities — and particularly the Christianophobia. \\nAmerican pastors in Turkey are being arrested hand over fist. \\nAmerican Pastor Andrew Brunson, of the Resurrection Protestant Church, was arrested in Izmir (Smyrna)on October 7 alongside his wife, Norine Lyn Brunson, for “threatening the national security of Turkey.” Brunson is expected to be deported in 15 days. The couple is still being held in detention. \\nTurkish authorities also seized the residence permit of Ryan D. Keating, an American student pursuing a PhD in the philosophy of religion at Ankara University. Keating is a Christian who heads the Ankara Refugee Ministry for the Kurtulus Church. While he was leaving Turkey for work purposes, he was told at the airport that his residence permit in Turkey had been cancelled in September for “national security”, meaning that he will not be able to reenter the country. His wife and children are still in Ankara. \\nYet another American Protestant pastor, Patrick Jansen, was not allowed to reenter Gaziantep, where he served. And still another American Protestant was ordered to leave Turkey upon landing at the airport. \\nThey are not the first. In the last four years, more than 100 Christian pastors and other religious officials have been deported from Turkey — the visas of some of them were not renewed or were completely cancelled. They have been banned from reentering. \\nPastor Brunson had also been exposed to an armed attack in front of the church in 2011, by a Turkish Muslim from the city of Manisa who shouted: “Al-Qaeda will bring you to account”, called members of the congregation “traitors” and threatened them with “bombing the church in Manisa.” \\nIn the meantime, the Protestant Life Bridge Church, in the southern city of Antakya (Antioch), has been closed and sealed upon a complaint of the National Education Directorate and the order of the governor’s office for “giving education illegally.” The church, officials of which are also American citizens, was giving Bible lessons to its members. \\nThe congregation has started looking for a new place to hold their Sunday services, the Turkish Christian news channel SAT-7 TURK reported on October 8. \\nThe Protestant community in Turkey has been exposed to discrimination and persecution for a long time. \\nAccording to a global report by the organization Open Doors, \\n“Persecution of Christians is more than just physical violence. It is a complex, multifaceted phenomenon that involves many aspects such as various forms of cultural marginalization, government \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742563493.8804135}