{"duration": 0.07416343688964844, "input_args": {"text": "'by Lambert Strether \\nLambert here: Howard Dean, back in 2003 and before he lost his mind, said : “I still want to be the candidate for guys with Confederate flags in their pickup trucks. We can’t beat George Bush unless we appeal to a broad cross-section of Democrats.” Of course, such a gross violation of liberal class and cultural markers could not be permitted, and Dean was forced to grovel and apologize by the dominant identitarian wing of the Democrat Party and then, when his fifty-state strategy won Democrats control of Congress in 2006, instantly defenestrated by Rahm Emanuel, among others, and his organization gutted by Tim Kaine . When Chomsky asks “Why are we failing to organize these people?” he’s asking a question to which Dean already gave the answer. \\nClinton, of course, thinks that organizing “these people” is a bad idea, which is why she called them “deplorable” and “irredeemable” (and if you’re a Christian, as Clinton purports to be, “irredeemable” means irredeemable). So do many of her supporters, who seem to labor under the twin delusions that (a) “these people” will go away on the morning of November 9, and that (b) calling them, in various ways, stupid is, as a strategy, full of #win. If Clinton wishes to fail during a legitimacy crisis, she and her supporters should go on exactly as they have begun. Personally, I’m not a “worse is better” guy (too much suffering), but I confess I see little prospect of the dominant faction in the Democrat Party changing its ways, Dean, Chomsky, or no. \\nBy Alexandra Rosenmann, AlterNet associate editor. Originally published in Alternet . \\nIn the past 15 months, Noam Chomsky has weighed in on the U.S. presidential race often. \\n“There are differences in the parties,” he said in February, when asked if he’d even consider a Republican over Hillary Clinton. “Small differences [coupled with] great power can have enormous consequences.” \\nChomsky initally favored Sanders over Clinton, but insisted Democrats must win at all costs. Because according to Chomsky , if Trump wins “the human species is in very deep trouble. \\nBut as for Trump’s supporters, Chomsky’s not counting them out just yet. \\n“I’m basically judging by what I see and read about them listening to talk radio and so on,” Chomsky admitted of the protests on the right. “But my strong impression is that these [right-wing protesters] are people with very real grievances.” \\n“They give the impression of being a hard-working serious people who think they’ve been doing everything right. They’ve been doing what they’re ‘supposed’ to do [as] god-fearing hard-working, gun-carrying, you know patriotic, Americans,” Chomsky continued. \\n“What are they doing wrong and how come their lives are so crummy?” Chomsky asked. \\nIt’s a question that has plagued the election. \\n“They’re not getting answers,” Chomsky insisted. “The answers they are getting are not only crazy, but extremely dangerous, so the right response is to ask ourselves, why are we failing to organize these people?” \\nThere’s nothing partisan about losing money to Wall Street or lacking health insurance; issues at the forefront of protests from both sides for nearly a decade. \\n“We have not succeeded in unifying people,” Chomsky noted. “It’s our fault.” \\nWatch:'"}, "time": 1742564283.7738266}