{"duration": 0.14559459686279297, "input_args": {"text": "'By now, even most of us over 35  —   old age, by Snapchat standards  —   are aware of the photo sharing and messaging app sweeping teenage and millennial America. Even if you have no interest in sending nude photos of yourself that   or in video lenses that enable you to vomit a rainbow, turn your head into a taco or make your eyes into glittering hearts, you may be wondering how such groundbreaking technology could be worth $34 billion. That was the value of Snapchat’s parent company, Snap Inc. after its first day of trading on Thursday. Its closing price of $24. 48 was 44 percent above the $17 offering price set late Wednesday. It’s the biggest initial public offering since Alibaba’s in 2014. At that price, Snap makes its much bigger rival Facebook  —   not to mention such internet stalwarts as Google, Amazon and even Netflix  —   look like   “value” stocks. Snap “looks tremendously overvalued to me,” said Brian Hamilton, a   of Sageworks, a financial analysis and valuation firm. Michael Nathanson, senior research analyst at MoffettNathanson, described Snap as a “field of dreams. ” Even with rosy growth forecasts, “at $22 billion, we’re looking at a stock trading at five to eight times estimated revenues in 2020,” he said before the valuation rose even higher. “The only companies in that domain are Facebook and Alibaba, and they have massive scale. And both of them are profitable. ” There’s no point in comparing Snap’s profits to any of those companies, since Snap doesn’t have any. The company lost $514. 6 million in 2016 and $372. 9 million the year before, according to the prospectus it filed in February. It has lost money every year since it began commercial operation in 2011 and has warned it may never earn a profit. The only comparable social media company that continues to lose money is Twitter, and no one at Snap wants anyone to compare it to Twitter. Twitter has struggled to add users and generate advertising revenue, even though it claims a user base of 319 million. It went public in 2013 at $26 a share. This week it was trading below $16 a share. So let’s be generous and ignore profit. How about revenue? Snap said it generated $404 million in sales in 2016. A valuation of $34 billion is about 84 times revenue. That’s six times as high as Facebook’s    ratio, which is 14. It’s 14 times as high as Google’s parent, Alphabet, which trades at just over six times revenue. Amazon trades at a mere three times. Even   Netflix trades at seven times. Compared with Snap, however, those are mature companies, whose growth rates have slowed somewhat as they’ve aged. As Mr. Nathanson and his fellow research analyst Perry Gold put it in a recent note to clients: “There is something brilliant about going public after only a few years of generating any revenue at all. The sky’s the limit and history is not a guide. ” To justify a valuation of even $25 billion, “you have to make some very lofty assumptions,” Mr. Hamilton said. “They would need to grow for the next 10 years at more than 50 percent every year with a profit margin of 25 percent, which is extremely high given that they are now losing money rapidly. ” He noted that very few companies had achieved such growth rates in the history of American business. But let’s ignore revenue, too. This is social media, after all, where “daily active users” and “engagement” are the coins of the realm. By the end of 2016, Snapchat had 158 million daily active users. By comparison, Instagram, probably the closest comparison and a formidable competitor to Snapchat, had about 30 million users when Facebook bought it in 2012 for what was then considered an   price of $1 billion. (Facebook had earlier tried to buy Snapchat for $3 billion, which its founders rejected  —   wisely, it now appears.) And $1 billion now looks like a bargain compared to what investors are paying for Snap. At $34 billion, each of Snap’s daily active users is worth $215, six and a half times per user what Facebook paid for Instagram. As of January, Instagram reported 300 million daily active users. At $215 each, the Instagram app alone would be valued today at $64. 5 billion. These are static numbers, and what Snap is selling investors is growth. According to Snap’s prospectus, Snapchat user growth was 48 percent in 2016, about the same as the year before. If it can pull that off again next year, it would reach an impressive 234 million users, though still short of Instagram. The Snapchat story “is all about growth,” Mr. Nathanson said. “It’s not about economics. ” But Snapchat’s growth slowed sharply in last year’s fourth quarter  —   just about the time Instagram started its own version of Stories, a popular Snapchat feature where users post a sequence of photos or videos. It added just five million new users after adding an average of 15 million in the first three quarters. By comparison, 150 million Instagram users are now using its Stories feature. That’s already nearly as many as Snapchat’s entire user base. How much more can Snapchat grow? Unless it can break out of its youthful demographic, it may already be reaching an upper limit. The Kaiser Foundation estimates that adults age 19 to 34 made up 22 percent of the United States population in 2015. That’s a little over 70 million. Snapchat already has nearly that many users in the United States. Maybe Snap can squeeze more revenue per user, even if its user base doesn’t grow all that much. It’s currently generating an average of $5. 83 a year per user in the United States compared with Facebook’s North American average of $12. 81, the MoffettNathanson analysis notes, suggesting plenty of room to grow. But even doubling revenue doesn’t get Snap close to a Facebook valuation. There are, of course, superhigh revenue and   assumptions that put Snap in the ballpark of successful and more established social media companies in valuation. Still, very few analysts have publicly said they believe Snap is undervalued at these levels (and I looked for some). The most bullish report I came across estimated that Snap could be worth as much as $30 billion. But that’s based on an extremely aggressive revenue estimate of $3. 8 billion in 2018. Mr. Gold said some investors were buying into the I. P. O. but not to hold Snap for the long term. “People are saying they’ll wait for a valuation that’s truly astronomical, and then take the other side of the bet,” he said. “They feel Snap will be richly valued out of the gate but possibly run into trouble over the next few quarters. ” Despite many of its somewhat juvenile features, at a more profound level Snapchat is changing the way young people communicate, substituting images for language. “Snapchat has built a better mousetrap,” Mr. Nathanson said. “It’s engaging, and it’s fun, especially for young people. ” That’s a story that obviously appealed to investors starving for the next hot social media company. Whether they’ll want to cash in quickly or hold their shares for the long term remains to be seen. “This looks and smells like Twitter to me,” Mr. Hamilton said. “I’m concerned that investors will have to wait a very long time, if ever, before they see any meaningful appreciation. ” About the best Mr. Nathanson and Mr. Gold could come up with: Snap’s valuation isn’t “patently crazy. ”'"}, "time": 1742564578.0065045}