{"duration": 0.06079387664794922, "input_args": {"text": "'Election: “Today, a kingdom will be toppled.” November 08, 2016 President Obama aboard Marine One departs on the last day of campaigning from the White House. \\nOn Election Day Eve, Senior Editor of Charisma Magazine releases an Election Day dream, \"Today, a kingdom will be toppled.\" \\nJennifer LeClaire describes the dream as \"spiritually disturbing\". She shares of the many people that have contacted her with dreams they have had as well. The claims of prophetic messages range from declaring Donald J. Trump as the next commander-in-chief to Obama not handing over the keys to the White House. The visions of chaotic turmoil disrupting in the streets of America have also been very vividly shared. LeClaire like many of us admits that she has never seen such prophetic whirlwind over an election in her lifetime. \\nThe night before Election Day she had a dream about the number of prophetic voices and among them she saw some with selfish agendas either for monetary gain or seeking accolades from man. During LeClarie’s time of reflection after this powerful dream she assures to have heard these words clearly: “Today, a kingdom will be toppled”. Although she is still praying over what she believes to have been divinely revealed, the urgency to share the dream was clear. \\nIn an interview with TRUNEWS last week LeClaire clearly shared her position as one with a focus on intense prayer. She talked about the importance for the Church to be lead by the spirit and keep their faith on Christ. \\nOriginal article by Charisma News / TRUNEWS analysis. \\nArticle by , Correspondent for TRUNEWS Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742563687.710981}