{"duration": 0.11597943305969238, "input_args": {"text": "'When the leader of the United Nations apologized to Haitians for the cholera epidemic that has ravaged their country for more than six years  —   caused by infected peacekeepers sent to protect them  —   he proclaimed a “moral responsibility” to make things right. The apology, announced in December along with a $400 million strategy to combat the epidemic and “provide material assistance and support” for victims, amounted to a rare public act of contrition by the United Nations. Under its secretary general at the time, Ban   the organization had resisted any acceptance of blame for the epidemic, one of the worst cholera outbreaks in modern times. Since then, however, the United Nations’ strategy to fight the epidemic, which it calls the “New Approach,” has failed to gain traction. A trust fund created to help finance the strategy has only about $2 million, according to the latest data on its website. Just six of the 193 member states  —   Britain, Chile, France, India, Liechtenstein and South Korea  —   have donated. Other countries have provided additional sources of   funding for Haiti outside the trust fund, most notably Canada, at about $4. 6 million, and Japan, at $2. 6 million, according to the United Nations. Nonetheless, the totals received are a fraction of what Mr. Ban envisioned. In a letter sent to member states last month, Mr. Ban’s successor, António Guterres, asked for financial commitments to the trust fund by March 6. He also appeared to raise the possibility of a mandatory dues assessment if there were no significant pledges. The deadline came and went without much response. Mr. Guterres has not stated publicly whether he intends to push for a mandatory assessment in the budget negotiations now underway at the United Nations. Privately, however, diplomats and United Nations officials said he had shelved the idea, partly because of strong resistance by some powerful members, including the United States. Diplomats said part of the problem could be traced to simple donor fatigue, as well as to many countries’ reluctance to make financial commitments without certainty that the money will be used effectively. The donor challenge was acknowledged by Dr. David Nabarro, a United Nations special adviser who rose to prominence running its mobilization to fight the Ebola crisis in West Africa, and who has been leading its   efforts for Haiti as he seeks to become the next director general of the World Health Organization. “Donors will respond, but they need to be convinced that they’re going to be given a good proposition for what’s done with their money,” he said in January at the World Economic Forum. “The Haiti cholera story is not actually a very good one, in that it’s taken us a rather long time to get on top of it, and still the problem is persisting. ” The   effort has been further complicated by the Trump administration’s intention to cut spending on foreign aid. The United States, historically a leading source of Haiti’s foreign aid, is also the biggest single financing source for the United Nations, which may now confront painful choices over how to allocate reduced revenue. Ross Mountain, a veteran United Nations aid official who is its senior adviser on cholera in Haiti, said that a number of ideas concerning the financing were under discussion. And, he said, while “$400 million is not a very large sum, considering the circumstances, we are all very aware about the competing demands. ” Mr. Mountain also conceded that “on the financial side, we have not moved further ahead. ” Mr. Trump’s new United Nations ambassador, Nikki R. Haley, who has called the cholera crisis “nothing short of devastating,” did not respond to requests for comment about the funding problem. But in her Senate confirmation testimony in January, Ms. Haley said, “We’re going to have to make this right with Haiti, without question, and the U. N. is going to have to take responsibility. ” Cholera, a waterborne bacterial scourge that can cause acute diarrhea and fatal dehydration if not treated quickly, has killed nearly 10, 000 people and sickened nearly 800, 000 in Haiti, the Western Hemisphere’s poorest country, since it was introduced there in 2010 by infected Nepalese members of a United Nations peacekeeping force. This year, as of late February, nearly 2, 000 new cases had been reported, amounting to hundreds a week. Studies have traced the highly contagious disease to sloppy sanitation that had leached fecal waste laced with cholera germs from latrines used by the Nepalese peacekeepers into the water supply. “We still have the biggest outbreak of cholera of any country anywhere,” said Dr. Louise Ivers, a senior policy adviser at Partners in Health, an international medical aid organization that has long worked in Haiti. “Here we are, nearly seven years later, and it’s still a big problem. ” Compared with other disasters confronting the United Nations, like the Syria refugee crisis and famines threatening 20 million people in Yemen and parts of Africa, the Haiti crisis may not loom as large. But unlike the others, the direct cause in Haiti was traced to the United Nations. This fact weighed on Mr. Ban until near the end of his tenure. He finally acted after the organization’s independent investigator on extreme poverty and human rights, Philip Alston, said in a scathing report that the United Nations’ failure to take responsibility for the cholera crisis was “morally unconscionable, legally indefensible and politically  . ” But Mr. Ban’s apology for Haiti’s cholera epidemic also clearly reflected an assumption that all members were responsible for the success of the new strategy to defeat it. “For the sake of the Haitian people, but also for the sake of the United Nations itself, we have a moral responsibility to act,” he told the General Assembly on Dec. 1. “And we have a collective responsibility to deliver. ” Advocacy groups that had been somewhat heartened by Mr. Ban’s words have grown increasingly anxious not only about the lack of money, but also about the lack of clarity in how the “material assistance and support” part of the plan, which represents half of the $400 million goal, will be used. Two leading advocacy groups for Haitian cholera victims, the Bureau des Avocats Internationaux and the Institute for Justice and Democracy in Haiti, sent a letter on Thursday to Mr. Guterres, requesting a meeting and expressing concern that “the current trajectory of   and elaboration of the New Approach is betraying the U. N.’s promises of a meaningful and accountable response in Haiti. ” Lawmakers in the United States critical of the United Nations’ response in Haiti have also put pressure on the organization. “While the U. N. has admitted to wrongdoing and promised to create a fund to provide restitution to the people of Haiti victimized by cholera,” Representative John Conyers Jr. Democrat of Michigan, said in a statement last week, “they have failed to make good on these promises. ”'"}, "time": 1742564265.696664}