{"duration": 0.15819001197814941, "input_args": {"text": "'OLATHE, Kan.  —   “The Jameson guys,” as some on the staff at Austins Bar and Grill knew the pair, were on the patio on Wednesday evening. It was hardly unusual: Srinivas Kuchibhotla and Alok Madasani, two immigrants from India, often enjoyed an   whiskey at the bar they had adopted as a hangout. Adam W. Purinton was also there, tossing ethnic slurs at the two men and suggesting they did not belong in the United States, other customers said. Patrons complained, and Mr. Purinton was thrown out. But a short time later, he came back in a rage and fired on the two men, the authorities said. Mr. Kuchibhotla was killed, and Mr. Madasani was wounded, along with a    man who had tried to apprehend the gunman, who fled. Mr. Purinton, 51, was extradited to Kansas from Missouri on Friday, and he is charged with premeditated   murder and two counts of attempted premeditated   murder. The attack, which the federal and local authorities are investigating as a possible hate crime, reverberated far beyond both states. It raised new alarms about a climate of hostility toward foreigners in the United States, where President Trump has made clamping down on immigration a central plank of his “America first” agenda. The White House strongly rejected the notion that there might be any connection between the shooting and the new administration’s sharp language about immigration. “People are devastated,” said Somil Chandwani, a friend of the two victims who lives in Overland Park, Kan. “I wouldn’t say they are angry. They have a sense of insecurity at the moment. People are trying to find answers. ” A charging document released on Friday gave no details about the motive for the shooting. Law enforcement officials in Kansas, citing the continuing investigation and judicial ethics standards, said little about the episode. Still, the F. B. I. ’s role in the inquiry suggested that officials had found some evidence that could eventually lead to civil rights charges in connection with the shooting, which occurred around 7:15 p. m. Wednesday. “He snapped, and this is not his typical self,” the suspect’s mother, Marsha Purinton, said before declining further comment. In a brief phone interview on Friday night, Mr. Madasani described the remarks made Wednesday by the man sitting near him and Mr. Kuchibhotla at the restaurant. “He asked us what visa are we currently on and whether we are staying here illegally,” Mr. Madasani said. (Both men were educated in the United States and were working here legally.) “We didn’t react,” Mr. Madasani said. “People do stupid things all the time. This guy took it to the next level. ” Mr. Madasani said he went in to get a manager, and by the time he returned to the patio, the man was being escorted out. After Mr. Purinton was thrown out, Jeremy Luby, 41, a software developer, said he offered to pick up the tab for the two men, who thanked him during a brief conversation about work and cultural differences. “It was wrong what happened to them,” Mr. Luby said. “I thought it was a nice gesture to say, ‘I’m sorry someone was being rude to you like that. ’” After the shooting began, another patron, Ian Grillot, 24, said he tried to count the shots while he hid under a table. Thinking the gunman had run out of ammunition, Mr. Grillot said, he confronted him, only to be shot in the hand and the chest. “It wasn’t right, and I didn’t want the gentleman to potentially go after somebody else,” Mr. Grillot said in a video released by the hospital where he received treatment. “He did it once. What would stop him from doing it again?” The shots echoed around the area, and Chris Lacross soon emerged from a store a few doors down to an unimaginable scene: an emergency medical technician performing CPR on a man lying in the doorway of the bar’s front patio, where tables and chairs had been flipped over, and someone was shouting that they needed towels. Another man took off his shirt and applied pressure to the wound of another victim, who was writhing in pain, said Mr. Lacross, who allowed some people to use a store restroom to wash away spattered blood. Within minutes, an emergency dispatcher, in a transmission archived by the Broadcastify website, told officers, “We’re being advised the suspect’s name is Adam, and he’s a white male wearing a white shirt with military medals. ” Capt. Sonny Lynch, the deputy chief of police in Clinton, Mo. where Mr. Purinton was arrested at an Applebee’s restaurant, said a bartender there called the police after a customer confessed to his involvement in a shooting hours earlier. “He was talking to her  —   ‘I’m on the run I’m hiding out from the law’  —   so she stuck around,” Captain Lynch said of the bartender. “She just hung out there talking to the guy until he said, ‘I shot those guys, and that’s why I’m hiding out from the police. ’” Mr. Purinton was arrested without incident, Captain Lynch said, and invoked his constitutional rights. It was not clear whether he had a lawyer. Mr. Purinton spent time in the Navy and, according to a website where veterans can list their military records, was deployed aboard the Long Beach, a missile cruiser, from 1988 to 1990. He later worked for the Federal Aviation Administration but left the agency in 2000, a spokeswoman said. In Johnson County, Kan. at least, he has had few   with law enforcement. Court records showed a limited history: a speeding ticket in 2008, as well as a 1999   charge that was dismissed. A neighbor, Lisa Puckett, said that Mr. Purinton was frequently intoxicated but that news of a shooting was stunning. “We always wondered if he might hurt himself, but we didn’t think he would hurt someone else,” she said. The dead man, Mr. Kuchibhotla, worked for Garmin, a GPS navigation and communications device company. One of the wounded men, Mr. Madasani, like Mr. Kuchibhotla in his early 30s, also worked for Garmin, according to the Indian government. On Friday, counselors were at the company’s campus in Olathe, a hub of South Asian immigrants where 84 languages are spoken in the local school district. Speaking to reporters on Friday at the Garmin headquarters, Mr. Kuchibhotla’s widow, Sunayana Dumala, said she had long been worried by shootings she read about in the newspaper. “I, especially, I was always concerned, are we doing the right thing of staying in the United States of America?” she said. “But he always assured me that only good things happen to good people. ” Now, Ms. Dumala said, she needed “an answer from the government” about what “they’re going to do to stop this hate crime. ” Mr. Madasani’s father, Jagan Mohan Reddy, a government engineer in Hyderabad, India, said his family was in shock. He said he did not know whether he would ask Mr. Madasani, who received a graduate degree from the University of   City, and another son living in the United States to leave the country. “We have to think it over,” he said. “My sons are not new to America. They have been staying there for the last 10 to 12 years. This is a new situation, and they are the best judges. ” Mr. Madasani, who has been released from the hospital, said he was recovering physically and mentally. “I’m definitely doing much better, but it’s not over yet,” he said. On Friday, Mr. Kuchibhotla’s killing and the wounding of Mr. Madasani led to a chorus of fury in India, where the attack dominated the news media to such an extent that the top American diplomat in the country was compelled to issue a statement condemning what she described as a “tragic and senseless act. ” In Washington, the White House press secretary, Sean Spicer, rejected any link between Mr. Trump’s policy agenda and the shooting, which many Indians believed might have been inspired by the president’s harsh tone on immigration. The Justice Department is under pressure to bring federal charges in the case. Moussa Elbayoumy, the board chairman for the Kansas chapter of the Council on   Relations, said the government should “consider filing hate crime charges in order to send a strong message that violence targeting religious or ethnic minorities will not be tolerated. ” On Friday night, a diverse crowd of more than 400 gathered to grieve at First Baptist Church down the street from the bar. They offered their prayers to the Kuchibhotlas and the Madasanis, characterized the shooting as an anomaly in an otherwise peaceful, tolerant suburb and vowed they would not let that change. “As a community, we are still shocked, devastated, and angry,”  Mayor Michael Copeland said. “But this is not how this ends. This is not our Olathe. ” He added, “One evil act does not divide a united community. ” Mr. Purinton was scheduled to appear in court on Monday. Austins, meanwhile, planned to reopen on Saturday.'"}, "time": 1742563916.6521175}