{"duration": 0.0738668441772461, "input_args": {"text": "'Officials at the National September 11 Memorial Museum in Manhattan said on Monday that one of their security guards should not have stopped a North Carolina middle school choir from singing the national anthem on the plaza last week. “The guard did not respond appropriately,” Kaylee Skaar, a museum spokeswoman, said. “We are working with our security staff to ensure that this does not happen again with future student performances. ” About 50 students from Waynesville Middle School in western North Carolina were at the memorial on Wednesday and had just started singing “The   Banner” when a guard told them to stop. Martha Brown, a teacher from the school, said on Monday that a different security guard had given permission for her students to sing. But the second guard said, “You just can’t do this you’ve got to stop now,” Ms. Brown said. “So we very reverently and quietly stopped what we were doing and complied with his request and quietly exited the park. ” Video posted afterward by an adult on the school field trip had prompted outrage and led to an invitation for the students to sing the anthem live on Fox News. Ms. Brown and Trevor Putnam, the school’s principal, joined the students for their performance at the school on Monday. Ms. Brown said her students learned from the experience. “We turned it into a teaching moment and taught them that even if you don’t agree with it, or understand it, you must respect authority,” she said. Mr. Putnam echoed the sentiment. “The lesson learned here is always to respect authority,” the principal said in a telephone interview. “And I’m so proud of our kids for conducting themselves the way they did. ” Crystal Mulvey, a parent who accompanied her daughter on the trip, said she was shocked that the guard interrupted the national anthem because “it’s kind of a sacred song to us. ” But, she added, “On the flip side, I completely understand following rules. ” Striking a balance between remembering those killed by terrorists and rebuilding a bustling commercial district has been a challenge since the attack in 2001. Tourists paying their respects to the dead now share the memorial plaza with neighborhood residents and office workers from the new World Trade Center towers eating lunch under the trees. Officials at the memorial said groups wishing to perform on the crowded plaza are supposed to pay $35 to apply for a permit and obey a list of rules that includes not using amplified sound and not interfering with the flow of traffic. Ms. Brown said she was not aware of the permit requirement.'"}, "time": 1742563591.491921}