{"duration": 0.12784051895141602, "input_args": {"text": "'Breitbart News Senior    Peter Schweizer addressed reports that President Trump’s    Jared Kushner had an undisclosed business relationship with Goldman Sachs and billionaire   financier George Soros on Wednesday’s Breitbart News Daily. [“This is a company that not only is Jared Kushner an investor in, he   in 2014,” Schweizer noted. “So this is not some passive investment that one of his advisers said to put money into, and was forgotten about. He   it. It’s a real estate tech startup. Obviously it has a lot of ambitions. He’s got a lot of money in it, and he failed to disclose it on his financial forms. ”   LISTEN: “That’s a massive, massive problem. The whole purpose of disclosures  —   whether you are asking the Clintons to do it, Barack Obama to do it, Jared Kushner to do it, or Mitch McConnell to do it  —   is so the American people can know: who are they financially dependent on, who do they have ties to, who might have leverage over them?” Schweizer explained.  “The problem is that Jared Kushner’s position in the White House, he is essentially the liaison with the business community. He’s not in charge of protocol. He’s not in charge of public outreach. He is basically the   with the business community, so he is ground zero for precisely the kinds of concerns and issues that one might have about very, very troubling financial transactions,” he said. Schweizer conceded that “it’s always hard to look into somebody’s head” and judge whether such a filing omission was a mistake, or an intentional act of deception. “People that defend Jared Kushner could say, ‘Well, look, he’s got a lot of assets, a lot of companies.’ Here’s the problem: it’s hard even with Jared Kushner’s wealth to hide your stake, your involvement, with one billion dollars in loans. So I think this is a massive problem,” he contended.  “I think a couple of things need to happen,” Schweizer suggested. “Number One, Jared Kushner needs to look at who filled out the disclosure forms for him. If he’s saying he had no involvement with lacking this disclosure, somebody needs to be fired. ”  “I think the second question needs to be: what other investments could be out there lurking that we’re not aware of?” he asked. “To be clear, it is a federal penalty, it is a crime, to fail to disclose things on your financial forms. I’m not a lawyer, so I couldn’t speak to this particular case, but these rules and laws have real teeth because they present real problems. ”  “On a scale from 1 to 10, I would put this at a 7,” he concluded, responding to SiriusXM host Alex Marlow’s request to rank the severity of this transparency issue. Marlow referred back to a recent interview he gave to New York Magazine, in which he observed that Kushner rarely grants interviews or issues public statements, so it is difficult to draw conclusions about his agenda, or measure how much influence he truly wields in the Trump White House. “Every president has advisers that have input, that offer insight, but those advisers  —   whether it’s Trump or Obama  —   generally there’s a good public knowledge about them, because they serve them during the campaign. They’ve been public officials, or outspoken on issues in one way or the other,” Schweizer noted. “Jared Kushner has not. During the campaign, he said very, very little publicly. Before that, in terms of his politics or his policy views, very, very hard to discern. And he, in a sense, kind of emerges out of nowhere to become this very powerful figure in the Trump White House. ”  “Now, President Trump certainly has a right to do that,” he allowed. “But I think with that elevation of Jared Kushner needs to come, in a sense, allowing us to lift the hood up from the car and see what kind of engine is underneath there  —   to see really what his views are, have him do some public interviews about what his positions are. ”  Schweizer reiterated that Kushner should expect heightened scrutiny because he is “a liaison with the business community. ”  “He is now the sort of   between President Trump and people like Goldman Sachs   George Soros that might have business in the White House,” he elaborated. “These are people he does business with, and has commingled assets with. The American people need to know, and for a campaign that I think ‘draining the swamp’ and transparency were such important issues, this circumstance I think demands that kind of response. ” Schweizer called for “some sort of an independent audit,” a term he disliked using but found closest to what he envisions. “There needs to be somebody independently that goes in and looks through his assets to make sure that there aren’t other big conflicts that are undisclosed lurking,” he said. “The problem is, you really can’t have confidence in whoever prepared these forms for Jared Kushner because you’ve got these gaps. I would be surprised if there aren’t more of these kinds of mistakes or omissions, because it just seems to me this one is so big and so glaring, it’s hard for me to believe that it was just an oversight, and it’s hard for me to believe that this is the only one that exists. ” Marlow asked if Kushner specifically having ties with Goldman Sachs and George Soros would cause problems with Trump voters, of if such dealings should simply be understood as inescapable aspects of New York City high finance. “I think from the policy standpoint I would have less concern about this, precisely for what you said,” Schweizer replied. “Look, when you’re looking at these large investments where you have very wealthy people or their offices investing,   you find this a fair amount. So I don’t think this necessarily says anything about Jared Kushner’s politics or policy views, the fact that he’s   with George Soros. ” “But I do think, as we talked about earlier, there is this mystery. What actually are his views about crony capitalism?” he continued. “What are his views about the tax rate? What are his views about the   Bank, and those other issues that have been lurking out there for so long?”  “He obviously has an important voice and is going to be a player at the table. People know what everybody else around the table is thinking. People basically know what Gary Cohn thinks. They know what Steve Bannon thinks. People don’t know what Jared Kushner thinks, and I think the American people, particularly the people that have supported him, would expect to know and want to know what those views are,” Schweizer said. He pointed out that Kushner appears to have an extraordinarily broad portfolio in the Trump administration, having turned up in Iraq last month. “Is he a diplomat? Is he a liaison with the business community? Is he doing both of those things? If so, what are his views? Does he have any background or any qualifications in those areas?” Schweizer asked. “I think these are all legitimate questions that people have a right to ask, and to want to know. And yet, it’s kind of shrouded with mystery. ” “I can tell you, if you look through American history, any time there have been family members sort of intermingled with an American presidency  —   whether that’s a Kennedy administration, and Bobby Kennedy is Attorney General, or going back to Woodrow Wilson where he was basically disabled and his wife ran the country  —   this is the lurking concern and fear that people have,” he recalled. “That is, who is actually making the decisions? You really can’t fire a family member per se. They’re going to remain your family member. So it creates a different kind of dynamic and environment, that somebody can’t just be told to go away if they make a massive mistake or engage in destructive behaviors. It presents a unique challenge. ”  “I think that’s why it’s important for the Trump White House to get out in front of his, and this issue of disclosure. This is sort of Clean Government 101,” he said. Schweizer recalled calling out Hillary Clinton’s campaign manager John Podesta for “his failure to disclose his ties to this company that was funded in part by a Russian fund that Vladimir Putin ran. ” “We were right to call him out,” he maintained. “The same thing needs to occur here. This is basic stuff that needs to be done, and the fact that it’s not being done at this point, a hundred days in, is extremely troubling. ” Peter Schweizer is a Breitbart News Senior    president of the Government Accountability Institute, and author of the   book Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full audio of the interview above. '"}, "time": 1742561781.488061}