{"duration": 1.5925912857055664, "input_args": {"text": "\"espace , ioukos , justice Crédit : Reuters \\nL’Agence spatiale russe (Roscosmos) a menacé de bloquer la livraison des lanceurs Soyouz à ses partenaires français d’Arianespace tant qu’elle n’aura pas récupéré les 300 millions d’euros gelés par la Cour d’arbitrage de la Haye dans le cadre de l’affaire des anciens actionnaires de Ioukos, a informé vendredi l’agence AFP , citant le service de presse du groupe public russe. Ioukos : la justice française refuse de suspendre la saisie des biens de l’État \\n« Nous ne recevons actuellement pas l'argent dû par Arianespace pour notre travail. Pas d'argent, pas de produit. Nous ne pouvons travailler gratuitement. Nous ne livrerons donc rien » , indique la source citée par l'agence AFP . \\nEn juillet 2014, le tribunal arbitral de la Haye a jugé que la Russie devait verser 46 milliards d’euros aux anciens actionnaires du groupe pétrolier Ioukos . En vertu de cette décision, plusieurs actifs russes ont été bloqués par les tribunaux en France en juin 2015. Cela concerne également les actifs de Roscosmos et de Russian Satellite Communications Company pour un montant total de 642 millions d’euros. \\nEn 2016, un tribunal français a établi que Roscosmos était juridiquement indépendant de l’État russe et que les actifs bloqués n’appartenaient donc pas au gouvernement russe et devaient être débloqués. Cependant, les anciens actionnaires de Ioukos ont fait appel de cette décision et l’argent reste toujours sous séquestre. \\nRappelons qu’Arianespace utilise les lanceurs russes de classe intermédiaire pour envoyer les satellites en orbite depuis le cosmodrome de Kourou en Guyane française . Depuis 2011, Arianespace a déjà lancé 15 Soyouz, le dernier lancement en date a eu lieu en mai. Lire aussi :\""}, "time": 1742563435.8456926}