{"duration": 0.11250710487365723, "input_args": {"text": "'Good morning.  (Want to get California Today by email? Here’s the  .) Let’s turn it over to Thomas Fuller, our San Francisco bureau chief, for today’s introduction. The titans of Silicon Valley like to claim that they’re inventing technology to change the world, and their philanthropic efforts often mirror those big global goals and dreams, with initiatives to end hunger and fight diseases. But the arts in San Francisco haven’t always felt their generosity. Even as total philanthropic spending in the Bay Area has more than doubled over the past decade to around $5 billion, according to the Foundation Center, it’s been difficult for some arts groups to find support with so many organizations competing for attention and funding. Last year, for example, with social inequality such a   issue, one heavyweight charitable organization, the James Irvine Foundation, chose to stop spending on the arts and switch all of its future giving toward addressing poverty. The move has important repercussions: In 2015 the Irvine Foundation gave $15. 45 million to the arts, more than a fifth of the foundation’s total grants. So on Tuesday culture fans were given a reason to cheer when the William and Flora Hewlett Foundation announced a plan to spend $8 million on performing arts projects in the Bay Area over the next five years. A panel of experts convened by the foundation will help select 50 works from artists in the Bay Area. The performances will include dance, theater, music and performance art. “There’s much more of a demand for arts than we can hope to fulfill,” said Larry Kramer, the president of the foundation, which gets its funding from the fortune made from one of the founders of   the pioneering computer company. “It’s hard to raise money for the arts,” said Ben Mangan, the executive director of the Center for Social Sector Leadership at the University of California, Berkeley’s Haas School of Business. “The arts don’t fall neatly into a category of a problem to solve. ” Giving money away is fraught with difficult choices, Mr. Kramer said. “The thing about philanthropy is that there are a million problems that are worth addressing and you can’t address all of them,” he said. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • Another round of rain began rolling through Northern California after a powerful weekend storm. [San Francisco Chronicle] • Hundreds of homes along the overflowing Russian River in Sonoma County faced flooding Monday. [The Press Democrat] • The investor Thomas J. Barrack Jr. is among the most influential Californians in   Donald J. Trump’s inner circle. [Los Angeles Times] • A United States representative from San Diego yanked a controversial artwork from a Capitol wall. Now he’s being accused of theft. [San Diego  ] • San Diego’s ambitious public transit push is slipping further from reach. [KPBS] • “Near historic”: The   Nuna has built a   database of the nation’s 74 million Medicaid patients. [The New York Times] • Yahoo said it would rename itself “Altaba” after selling its internet business. Why Altaba? [The New York Times] • The average “ ” in San Francisco is now $920, 000. [SFGate. com] • “Diabolical scheme”: A Southern California woman was accused of framing her husband’s  . [Los Angeles Times] • The “Hollyweed” prankster surrendered to the police. He said the stunt was for the sake of “art. ” [Hollywood Reporter] • Nobody was quite expecting Meryl Streep to lay down the gauntlet for a new kind of culture war. [The New York Times] • West Hollywood’s historic Formosa Cafe closed. But preservation rules mean its exterior cannot be easily altered. [Curbed Los Angeles] • Photo: A dead whale washed up near the Oakland waterfront. [East Bay Times] Hundreds of outdoor walls across Sacramento serve as canvasses for colorful murals. To find them, people have had to rely largely on word of mouth or serendipity. But now, a richly detailed Google map has been published that includes not just their locations, but also images of the works and the names of the artists behind them. The project is the brainchild of Nathaniel Miller, an interactivity editor at The Sacramento Bee. In an interview, Mr. Miller said he used his free time outside of work to research the murals over much of 2016. He portrayed himself as an art novice who was simply in the mood for a project that he thought would be of use. The murals range from the handiwork of elementary school children to interpretations by established artists. All told, Mr. Miller cataloged 420 murals, but he expects that number to grow. Sacramento officials have been embracing public art as a way to enliven the city. During the Sacramento Mural Festival last August, artists were invited to bring blank walls to life at about a dozen places across the city center. Some of the works stretched several stories high. California Today goes live at 6 a. m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes. com. The California Today columnist, Mike McPhate, is a   Californian  —   born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and attended U. C. Berkeley.'"}, "time": 1742561943.46877}