{"duration": 0.05148720741271973, "input_args": {"text": "'Soap opera star and Donald Trump supporter Antonio Sabato Jr. is set to make his own foray into politics with a run for Congress in California. [According to the Los Angeles Times, the    General Hospital and Melrose Place star will challenge Democratic Rep. Julia Brownley in California’s 26th Congressional district, which encompasses a large portion of Ventura County and part of the central coast.  The actor  —   who has competed on Dancing with the Stars and worked as a model  —   spoke at the Republican National Convention in support of Trump in July. Sabato strategist and fundraiser Charles Moran told the Times that the actor’s experience at the convention sparked his own desire to affect change in Washington. “Being a Republican and with proximity to the White House and Republican leadership, he’s going to be able to get more done  —   being in the majority, with his notoriety, for the residents of the 26th [Congressional] District,” Moran told the paper. Sabato was a vocal supporter of Trump throughout the 2016 presidential campaign. At the Republican convention in July, the actor  —   who immigrated from Italy to the United States in 1985  —   said he had never considered himself to be a political person before, but expressed concern about the direction of the United States, and said those wishing to enter the country should follow the same procedures he did nearly thirty years ago. “Having secure borders, protecting our citizens, none of this is hateful,” Sabato said at the time. “This is the responsibility of the government. And it’s the right thing to do. ” The candidate will reportedly campaign with a focus on veterans and substance abuse issues. In August, Sabato said in an interview that he had been blacklisted from Hollywood due to his political beliefs. “t’s not just me. I know a lot of people in the industry who are in the same boat,” he told Variety. “The reality is if you’re associated with the Republican Party, the casting directors and producers already blacklist you based on that. ”   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564245.552352}