{"duration": 0.08187079429626465, "input_args": {"text": "'How to Spot a Sociopath \\nSociopath – Learn how to spot one by knowing their characteristics! by Mike Adams – NaturalNews.com Sociopaths are masters at influence and deception. Very little of what they say actually checks out in terms of facts or reality, but they’re extremely skillful at making the things they say sound believable, even if they’re just making them up out of […] New study reveals major cause for autism \\nby Sima Ash – NaturalHealth365 Most studies on autism focus on genetics and while there have been a great number of studies identifying specific genes involved in the disorder, many experts have made it clear that there is no such thing as a ‘genetic epidemic.’ This has spurred studies on environmental factors that could cause autism […] Sweet victory for Mexico beekeepers as Monsanto loses GM permit \\nby Nina Lakhani – The Guardian A small group of beekeepers in Mexico has inflicted a blow on biotech giant Monsanto, which has halted the company’s ambitions to plant thousands of hectares of soybeans genetically modified to resist the company’s pesticide Roundup. A district judge in the state of Yucatán last month overturned a permit issued to Monsanto […] 10 Simple Home Remedies For Dry, Cracked Feet \\nHow to heal cracked feet and cracked heels! by Debolina – Stylecraze.com Here is our list of 10 simple home remedies that will help soothe and makeover your cracked heels, and let you step out in style 1. Lemon, salt, glycerine, rose water foot mask: One of the first steps towards having a pair of beautiful […] Revive Your Relationships With These Outdoor Activities \\nOutdoor activities this summer can help to revive and enhance your relationships! by Elizabeth Seward – Staff Writer Every relationship – whether it’s a relationship between lovers, roommates, friends, or colleagues – could use the occasional revamping. Enhancing our relationships should be an ongoing endeavor that strengthens our bond with others every step of the […] Signs you are an empath and sensitive to energy around you \\nby Spirt Science An empath, or, someone who is highly sensitive to other people’s feelings, intentions, motivations, and the general the energy that surrounds them, often don’t realize that they are until they’re in such emotional/mental turmoil, they go looking for the cause. The difference, of course, between simply being “empathetic” and what one would […] Sea cucumber kills cancer cells with amazing efficiency \\nSea Cucumber has been proven to kill cancer cells with ease! by Cindy Murdoch – Staff Writer Sea cucumber can be beneficial in the battle against cancer by killing cancer cells and stimulating the immune system. What is a sea cucumber? Consider the lowly sea cucumber. No it is not a vegetable although its name […] Shocked scientists discover the skin communicates with the liver \\nSkin communicates with the liver! by Ethan Huff – Natural News Skin: It is your body’s largest organ, and groundbreaking new research out of Denmark has found that the proper function of your other vital organs is dependent upon its integrity. A collaborative research project out of the University of Southern Denmark (USD) recently discovered that […] GMO Corn versus NON GMO: The Shocking Corn Comparison \\nThe claims that “There is no difference between GMO corn and NON GMO corn” are false. (See the photo below) A 2012 study, called the Corn Comparison Report, was recently released by Profit Pro and published on the website for Moms Across America March to Label GMOs – a group dedicated to raising awareness about […] 12 Symptoms of Kidney Disease You Shouldn’t Ignore \\nIt is important to identify kidney disease early because in most cases the damage in the kidneys can’t be undone. by Dr. Anitha Anchan Most people are not aware of the fact that kidney diseases can be silent killers. They may not show any symptoms for a long time till the situation becomes critical. (Why […] Permaculture Gurus Share Secrets of Dramatic Land Transformations \\nTraci Knight – Staff Writer Permaculture is a movement whereby permanent agriculture is incorporated into personal landscapes through careful designs that mimic patterns in nature. A minimalist approach to land management is adopted, after the implementation of careful planning – usually with mass plantings of fruit and nut trees where land and space allow. The […] Chief Seattle’s Prophecy for America: The End of Living and the Beginning of Survival \\nby Richard Cassaro – RichardCassaro.com Chief Seattle (1780 – 1866) was a prominent native American chief who pursued a path of peace with colonial white settlers in what is now the state of Washington. During treaty negotiations in 1852, he gave a famous speech in response to an offer by the U.S. Government to buy two […] Six powerful ways to use lavender during the cold and flu season \\nby Carolanne Wright | Natural News Hidden beneath the pleasing scent of lavender is a fierce natural medicine and formidable protector. Used since antiquity, lavender was a significant guardian against some of the most deadly infectious diseases of all time – the great epidemics of plague sweeping across Europe throughout the Middle Ages and into the […] Man says raw food diet has made him ‘almost superhuman’ \\nby Antonia – Natural News For fruitarian and endurance athlete Michael Arnstein, his 15-mile commute to work isn’t by car, bus or train. Instead, he runs to the office, jogging through residential neighborhoods and eventually New York’s Central Park, pausing only to enjoy fruit along the way. Before his run, he may enjoy a breakfast of […] Join For Free! Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name '"}, "time": 1742563395.0960147}