{"duration": 0.031713008880615234, "input_args": {"text": "'In his most extensive remarks about feminism, President Obama wrote an essay for Glamour magazine in which he reflected on American women’s long fight for equality and called on men to fight sexism and create equal relationships. In the   essay, which was published online Thursday and will appear in the September print magazine, the president argued that “when everybody is equal, we are all more free. ” He praised the progress of American women over the past century while pledging to work on securing equal pay and reproductive rights. The president also warned against “dated assumptions about gender roles. ” The president said that it was important to his daughters that he be a feminist, “because now that’s what they expect of all men. ” “We need to keep changing the attitude that raises our girls to be demure and our boys to be assertive, that criticizes our daughters for speaking out and our sons for shedding a tear,” he wrote. “We need to keep changing the attitude that punishes women for their sexuality and rewards men for theirs. “We need to keep changing the attitude that permits the routine harassment of women, whether they’re walking down the street or daring to go online. We need to keep changing the attitude that teaches men to feel threatened by the presence and success of women. ” Brenda Weber, the professor and the chairwoman of the gender studies department at Indiana University, said she was “delighted” by the essay, which she said showed a nuanced sense of women’s issues. It is unusual for a man to write such an essay, let alone a president, she said. To claim the identity of feminism and discuss why it is personally important to him and his daughters is a meaningful gesture coming from someone with the cultural authority of the president, she said. “Those are all pretty radical statements in terms of a politician at that level of influence,” she said. It is not the first time that the president has declared himself a feminist. In June, while speaking at a White House summit meeting on women, he declared: “This is what a feminist looks like. ” Cindi Leive, the editor of Glamour, said on “CBS This Morning” that she thought the essay went “beyond the kind of boilerplate ‘I believe in strong women’ that at this point anybody can mouth pretty effectively. ” “It did strike me as this very modern moment, something that we wouldn’t have heard probably from any other president, but honestly we would not have heard before this year,” she said. “I do think the embrace of the term feminism by men as well as women has really been on the rise. ”'"}, "time": 1742562242.742202}