{"duration": 0.10895657539367676, "input_args": {"text": "'Email \\n“Yes, I listen when I first wake up, maybe while getting the children ready for school; sometimes in the car too.” They’re talking about radio. Radio was supposed to become a marginal medium, surpassed first by TV and then, surviving that, it would be buried by the internet. Yet radio is still with us. More than surviving, radio has introduced new ways of speaking, conversing and telling stories. A whole new sound has been created for example by Atlantic Public Media ( www.atlantic.org ). Meanwhile some traditions continue. \\nExcept that my very favorite radio show for almost three decades fits no tradition:—it’s part comedy, part advice column, part phone call-ins. (Listener call-ins gave radio a tremendous boost in the 1960s.) \\nI continue to be a radio addict. As a critic of government policies, an aficionado of literary readings, and a producer of “RadioTahrir” ( www.RadioTahrir.org ) for 23 years on the avant-garde and activist Pacifica Network ( www.Pacifica.org ) you’d expect my favorite to be a show related to political or literary enterprise. Actually, the program I listen to most faithfully is one that’s impossibly dissimilar. It’s CarTalk . This, though I’m not even a car enthusiast. \\nCarTalk is a hilarious, practical advice call-in show. It originated in Boston 30 plus years ago by two feisty Italian brothers Tom and Ray Magliozzi, both garage mechanics (the do-it-yourself-sort; but to figure out their degree qualifications see www.cartalk.com/content/tom-and-rays-bios-photos-2), a perfectly paired team with a shared irrepressible sense of humor. \\nThink about it. How often while listening to a non-comedy radio broadcast do you find yourself chuckling? Not only this: these hosts engage in banter and howls of laughter while dispensing serious counsel –all having to do with cars! Threaded though the humor is lots of useful (and reliable) car advice. (They really have to be good because of safety liability, the reputations both of cars they discuss and garage mechanics their guests already consulted.) The stimulus for Tom’s and Ray’s comments are calls from listeners challenging the brothers with simple, complex and silly car problems: mechanical problems, disputes with their local mechanic, family predicaments around co-ownership, repair costs, holiday motoring anxieties, and inheritance problems (cars often pass from parents to children). The issues are actual problems which cars, especially older models, experience. And Americans keep their cars for a long time. \\nCarTalk , in my view, is the most engaging program on US radio, on radio anywhere. A weekly one hour show, it’s been airing every Saturday morning as long as I can remember. With the passing of Tom the older member of the team in 2014, the live broadcast ended. Today the program continues as The Best of Car Talk , edited from their archives. Meanwhile www.cartalk.com carries a full show, highlighted moments of fun (or guidance), automotive news, and abundant free car advice. \\nPart of the success of the program, in addition to the spirited character and compatibility of the brothers, lies what cars symbolize in American history and culture. People grow very fond of their cars and are reluctant to part with them, thus the need for repairs to keep them functioning well past their dump-yard date. (We think we can fix our car ourselves—with a little advice.) An owner feels proud that her car’s odometer registers 200,000 miles, or if it approaches 170,000 (as my 1985 Toyota did) we’re determined to keep it running (as I did), whatever the cost, until it cracks 200,000. No car owner likes to spend money on repairs either, so Tom and Ray’s advice mustn’t require a lot of expense. Then there are the mechanical mysteries that emit from a car: you know, those rattles under the hood or the scraping below the passenger seat. So we turn to CarTalk to address our doubts or after our own local mechanic hasn’t performed a cure for our ailing 1968 Chevy pickup, or our limping 1992 Honda Civic.. \\nThe brothers seem to know every car model ever made, from 1950s vintage Fords to the latest Swedish, Chinese and Indian brands. After IDing their location a caller starts with: “I have a 1978 Volkswagen bus whose windshield wipers don’t work…..”, or “I and my husband are going to take cross country trip with our 3 dogs, two rabbits and a parrot; we can’t pay more than $3000. and plan to dump the vehicle once we arrive; what should we buy?” Tom and Ray try to diagnose the issue and dispense advice, injecting guidance with abundant hilarity, while never, never reproaching or ridiculing a caller. The hour is upbeat, always hilarious, and the advice is highly reliable and, it seems, mostly spot-on. \\nThe personalities of the brothers and the chemistry between them explain much of CarTalk ’s popularity. But this program taps into our American romance with cars and our attachment to these celebrities of manufacturing history. Cars enjoy an unparalleled place in American life. Desoto, Mustang, Studebaker, Roadster, Impala:– these names are deeply embedded in the American lexicon. Each represents an image fixed in our memory, in the brains even of young people born long after a model ceased being manufactured. Cars represent key points in millions of Americans’ lives, in the latter 20 th century if not now. Famous songs eulogize cars; cars are the subject of poems; “Motown” is the trope for Detroit city, center of auto manufacturing for decades, and the music genre that emerged there. \\nA driving license, not a pair of Nike trainers or the latest iphone edition, was and still is for many, the primary goal of a US teenager. We started saving for our first car even before we had our driver’s license; cars compete with sports to occupy 90% of young men’s conversations. We concocted quiz games about cars and car models. There is an entire industry in the U.S. devoted to auto museums, small scale car models, and road functional antique cars. Cars parked in residential driveways are part of American architecture. In my town, I recognize my neighbor by the color and model of their passing car. We can usually gauge a person’s income by the model of their car. \\nWhatever the caller’s car model, one of the brother’s recognizes it—1972 El-Camino, 1959 Ford Torino, 1990 Dodge Viper, 1980 Desoto Adventurer, or 1966 Volkswagen bus. (Most callers seek advice for only 20 plus year-old vehicles.) These radio hosts seem to know any car’s mechanics and particularities that could cause problems. Instead of saying “Take it to the junk yard; it’s past 250,000 miles”, they do their utmost to help extend its life. They treat the car like it’s a family pet. Only occasionally Tom would advise an owner—“It’s only a car!”'"}, "time": 1742561792.231803}