{"duration": 0.08023715019226074, "input_args": {"text": "'Email \\nBev Harris, elections expert and founder of Black Box Voting, believes our elections are vulnerable to wholesale fraud via manipulation of vote totals in the centralized computer databases. She recently appeared on the Alex Jones Show, where she demonstrated a computer script named Fraction Magic that can alter vote totals all the way down to the precinct level and make the final vote totals add up to a desired result. \\nFraction Magic was written by Bennie Smith, a computer professional from Memphis, Tennessee. He demonstrated how it works by entering a desired outcome in an overlay and then he and Bev Harris watched as Fraction Magic altered all the precinct totals and recalculated all the subtotals up to the final totals Bennie Smith had specified. He added, “You can create plausible results that really pass off as the real thing.” \\nHarris reported that she tested Fraction Magic on her copy of the database of all votes cast in the general election in Alaska in 2004. She fed in desired outcomes and Fraction Magic performed the necessary vote count alterations all the way down to the precinct level in four seconds. \\nBoth Harris and Smith expressed concern about the number of people who have the necessary access level to the vote totals databases. They would include numerous IT people, vendors, consultants, technicians, and others. Election officials rarely, if ever, make public lists of names of people who have privileged access to the election databases. \\nAn extremely disturbing trend in American elections is the recent use of encryption to keep precinct totals secret until after they are in the hands of centralized elections offices. The American people are being told this is secure transmission and modernization. The spin in the news media has been to marvel at the skillful technology. But not enough people are asking what benefit we are achieving by concealing public information from the public . \\nConcealing precinct vote totals from the public until reviewed centrally was one of the tactics used by Hitler and Stalin. That’s how they had the ability to alter vote totals without being caught. No one but a few insiders had any election totals until the centralized authority had the ability to rework the numbers if necessary to achieve their desired results and then release election results. \\nThe term \"wholesale election fraud\" refers to one act by a fraudster that changes a large number of votes, such as in a computer, or alters the vote totals hoping no one will audit the results and verify the totals. \"Retail election fraud\" refers to cheating one vote at a time, such as when people cast multiple absentee ballots or vote multiple times in person in an election. These people are known in the trade as \"repeaters,\" and their ability to repeat vote is greatly enhanced both by early voting and by either lax enforcement of voter ID laws or no voter ID requirement. \\nSpecifying a vote total or percentage and then working it down is not a new form of corruption in American politics. Tracy Campbell described how political boss George Parr operated in his book Deliver the Vote : Parr’s aide and feared enforcer, Luis Salas, later related how the Parr machine ruled: “Parr was the Godfather. He had life or death control. We could tell any election judge, ‘Give us 80 percent of the vote and the other guy 20 percent.\\' We had it made in every election.” \\nCampbell also described how another 200 votes appeared after Lyndon Johnson issued the order to “find the votes” when he needed them to win the senate runoff election in Texas in 1948. \\nIn Precinct Number 13, the precinct of Luis Salas, where he had manufactured a vote for Johnson of 765 to 60, the tally was now different. When one of the committee members read the totals for the precinct of Salas, the new total was 965 to 60. In the interim, obviously, one of Parr’s men had simply taken a pen and closed the top loop of the “7” to create a “9”. \\nBecause the precinct totals were public information, were reported immediately, and were obtained by Governor Coke Stevenson right away, he was able to identify the precinct where the extra 200 votes were added. Unfortunately, too many people in positions of power were on Johnson’s side. \\nThe concept behind Fraction Magic is not new to politics. What is different is the scale to which it can enable specifying an election result and make the subtotals match. \\nThe fact that a program such as Fraction Magic can do what it does should be a wake-up call for the way we conduct our elections. We need to return to our traditional constitutionally correct decentralized counting of votes at the precinct level. We need a paper trail in the voting equipment. We must allow public access to any member of the public who wishes to observe the vote counts. And we must make precinct totals public immediately after the votes are counted, including posting them on the door of the voting site building. \\nIf we do not, we run the risk of having our election results altered by the very people we hire to ensure that our elections are honest and accurate.  '"}, "time": 1742563784.6593335}