{"duration": 0.263477087020874, "input_args": {"text": "\"“Political Airpower, Part I: Say No to the No-Fly Zone” [ War on the Rocks ]. \\nThe Voters \\n“This market barometer says Trump still has a chance at the White House” [ MarketWatch ]. “The slump [of the Mexican peso, a] key barometer of Trump’s chances represents ‘recognition that the election may be closer than polls suggest and growing fears U.S. political uncertainty may be on the rise,’ [Colin] Cieszynski says.” \\nDownballot \\n“‘There’s a danger the dike could break for Republicans,’ says Tim Storey, who analyzes politics for the National Conference of State Legislatures. He found that there has been a sea change in expectations on both sides since Oct. 7 when The Washington Post reported on the existence of the ‘Access Hollywood’ tapes… Republicans have become increasingly concerned that they could lose statehouse majorities in as many as 10 states, Storey said” [ RealClearPolitics ]. \\nThe Trail \\n“Clinton lead shrinks, even as nearly 6 in 10 expect her to win, Post-ABC tracking poll finds” [ WaPo ]. Only one poll, so FWIW. “Trump saw his biggest gains among political independents, favoring Trump by a 12-point margin in the latest tracking poll, 49 to 37 percent, after giving Clinton a narrow edge in late last week.” Now that’s volatile! \\nFunny: \\n“Clinton campaign manager John Podesta apparently thinks Eric Garner’s death was justified” [ Mic ]. \\nErica Garner reacts: I&#39;m troubled by the revelation that you and this campaign actually discussed &quot;using&quot; Eric Garner … Why would you want to &quot;use&quot; my dad? \\n&mdash; officialERICA GARNER (@es_snipes) October 27, 2016 \\nCheck the responses… \\nAnd then this happened: Clinton staff wanted to use #EricGarner in oped about gun violence. But he wasn&#39;t shot — as @es_snipes points out https://t.co/SBqDV4eXEm pic.twitter.com/SdIm8p2H4F \\n&mdash; Julia Craven (@juliacraven) October 28, 2016 \\nOopsie. \\nUPDATES Good heavens! \\n“FBI to take new ‘investigative steps’ on Clinton emails” [ WaPo ]. “The FBI will investigate whether additional classified material is contained in emails sent using Hillary Clinton’s private email server while she was secretary of state, FBI Director James B. Comey informed congressional leaders Friday. The announcement appears to restart the FBI’s probe of Clinton’s server, which previously ended in July with no charges…” \\n“New Emails in Clinton Case Came From Anthony Weiner’s Electronic Devices” [ New York Times ]. “Federal law enforcement officials said Friday that the new emails uncovered in the closed investigation into Hillary Clinton’s use of a private email server were discovered after the F.B.I. seized electronic devices belonging to Huma Abedin, a top aide to Mrs. Clinton, and her husband, Anthony Weiner… The bureau told Congress on Friday that it had uncovered new emails related to the Clinton case — one federal official said they numbered in the thousands.” Then again, if Weiner runs true to form, classification won’t be an issue. But that most definitely does not mean Clinton’s home free . \\nQuite the Friday afternoon news dump. And not a good week for the Clinton campaign, despite the triumphalism. \\nStats Watch \\nGDP, Q3 2016 (Advance Estimate): “The consumer and the nation’s exports are the headliners in third-quarter GDP which topped expectations at an annualized 2.9 percent. Personal consumption expenditures rose at a solid 2.1 percent annualized rate led by the all important durables component which surged at a 9.5 percent rate. Personal consumption was the largest contributor in the quarter, adding 1.5 percentage points to the quarter’s rate.” [ Econoday ]. “Another important positive in the report is a second straight quarter of improvement in what has been the long lagging business investment component. Contributing 0.2 percentage points to GDP, nonresidential fixed investment rose at a 1.2 percent rate on top of the second-quarter’s 1.0 percent rate.” But: “Yes of course, this is an improvement. But the consumer went limp [?], and GDP is gamed with inventory hocus-pocus and export-import adjustments. I am not a fan of quarter-over-quarter exaggerated method of measuring GDP – but my year-over-year preferred method showed moderate improvement from last quarter” [ Econintersect ]. And: “The Federal Reserve has been notably uneasy surrounding investment levels in the economy with a prolonged series of weak releases, although the second-quarter data was revised higher. The third-quarter data will offer some limited relief over investment trends” [ Economic Calendar ]. \\nConsumer Sentiment, October 2016: “[W]eakened substantially” [ Econoday ]. “[I]t was one year further back, September 2014, that the expectations component, at 76.8 this month, was this weak. Weakness here points to lack of confidence in the jobs outlook.” \\nEmployment Cost Index, Q3 2016: “Year-on-year, total costs held steady at a moderate plus 2.3 percent with wages & salaries dipping 1 tenth to 2.4 percent and benefits up 3 tenths to 2.3 percent” Econoday ]. “This report, which isn’t raising any red flags, is closely watched by Federal Reserve policy makers who, given the strength of the labor market, are on the look out for early signs of wage-related inflation.” \\nHotels: “On the one hand, plenty data from STR , HNN’s parent company, shows that things in the United States hotel industry are slowing down. Other the other hand, we have a report that September RevPAR  ;was up 5.6%. And, yes, both are true” [ Hotel News Notes ]. “The great performance—this was the highest RevPAR growth this year—really reminded me of the better days we have seen in the past few up cycles. Of course, the results are not actually a sign of anything but a calendar shift of the Jewish holidays Rosh Hashanah and Yom Kippur out of September into October. So I would strongly caution against reading anything, good or bad, into these monthly numbers.” \\nRail: “This week the one year rolling average did not worsen – but it remains in contraction” [ Econintersect ]. \\nRail: “Two [CSX] trains collided head-on on a stretch of track south of Philadelphia around 8:25 a.m. Friday, leaving four people injured, according to officials” (with classic photo) [ NBC Philadelphia ]. “It was not immediately clear what caused the trains to be on the same track.” \\nShipping: “Shippers, Consignees, Exporters, Importers must take heed to the packing and container transport requirements at both ends of the supply chain” [ Shipping and Freight Resource ]. “[I]t is clear that in this case, no one considered or was aware of the road weight limitation at the [Point of Departure] or along the route to the final destination… There would have been 2 containers that doesn’t subscribe to the country’s road weight limitation loose on the road.. Such instances could even result in loss of lives. this is ONE OF THE MAIN REASONS a lot of the big importers employ the services of a local freight forwarder who are au fait with these transport and documentary requirements, rules, regulations etc etc in each of their countries.” \\nShipping: “United Parcel Service Inc. is forecasting record holiday shipments after traffic surged in the third quarter, spurred by rising e-commerce in the U.S. and robust growth in Asia and Europe” [ Wall Street Journal , “Package-delivery company expects record shipments during holiday season as it boosts capital spending, orders new Boeing jumbo jets”]. And: ” United Parcel Service Inc. is placing a big bet on growth in shipping demand” [ Wall Street Journal ]. “UPS is backing up its bullish outlook by buying 14 Boeing Co. 747-8 freighters, the company’s first aircraft order since 2008. The deal pushes UPS more deeply into jumbo-jet operations at a time when international shipping demand has been soft for many companies and populist anti-trade currents seem to present new barriers to global goods movement. The company is pressing lawmakers to support new trade agreements that are drawing scorn in the presidential campaign but would bring new freight volume for its new, bigger planes. In the meantime, UPS says cross-border e-commerce is surging six times faster than the broader economy, growth that helped the company show big gains across its business lines in the third quarter.” \\nShipping: “The tale of two canals – game theory in action” [ Splash 247 ]. Panama and Suez canals play tit-for-tat on infrastructure and pricing. \\nIT: “The latest data breach count from the Identity Theft Resource Center (ITRC) reports that there have been 809 data breaches recorded this year through October 25, 2016, and that nearly 30 million records have been exposed since the beginning of the year” [ 247 Wall Street ]. ” The 809 data breaches reported so far for 2016 are nearly 22% above the number reported (666) for the same period last year.” Won’t be a problem when we go cashless, though. \\nIT: “Apple demolished by Microsoft at their respective PC events” [ MarketWatch ]. Among other minor changes, Apple introduced a programmable “Touch Bar” which replaced the row of function keys at the top of the keyboard — including the ESC key. Fortunately, there’s a solution. For only $69.95 : \\nIT: “New MacBook Pro is not a Laptop for Developers Anymore” [ DevTeamSpace Blog ].“[D]evelopers are drawn towards Apple products primarily for software reasons: the Unix-like operating system and the proprietary development ecosystem. But developers need to have a functional keyboard to make use of that software and now they don’t. Why Tim Cook, why?” And: “The 2016 MacBook Pro ships with RAM and processor specs that are nearly identical to the 2010 model. Deja vu?” \\nIT: “Apple, it seems, is angling for the ‘amateur creative’ and isn’t interested in anything else anymore. It wants the market that sits in coffee shops with its brand and only buys Apple, but doesn’t mind so much if the core demographic disappears. Maybe that’s OK\\u200a—\\u200athere’s probably good money in it\\u200a—\\u200abut it’s a real shame” [ Medium ]. Massive takedown, and fun to read. \\nThe Bezzle: “A grown-up Airbnb now has to face regulation” and “New bill could further delay Airbnb IPO, strategist says” [ MarketWatch ]. “In a sense, recently passed New York regulations on Airbnb Inc. return it to its community roots of sharing homes. The regulation, signed into law Friday, levies a fine of up to $7,500 on advertising short-term rentals of less than 30 days. This means users can still list a room in their home, but cannot advertise entire apartments.” \\nThe Bezzle: “Ruling finds U.K. Uber drivers are workers, not self-employed” [ MarketWatch ]. “The ruling by the London Central Tribunal will affect tens of thousands of drivers for the ride-sharing company, said law firm Leigh Day, which represented drivers from the GMB Union, in a statement. ‘This judgment acknowledges the central contribution that Uber’s drivers have made to Uber’s success by confirming that its drivers are not self-employed but that they work for Uber as part of the company’s business,’ the law firm said.” \\nThe Bezzle: “Soylent halts sales of its powder as customers keep getting sick” [ Los Angeles Times ]. “Backed by more than $20 million in venture capital, Soylent has emerged as one of several popular start-ups hoping to change what and how people eat…. People looking for a quick fix, such as software programmers in Silicon Valley, have become devotees.” \\nCorruption: “The DOJ’s Pilot Program to encourage companies to self report bribery and cooperate with prosecutors doesn’t fix some problems with FCPA investigations and enforcement actions, [vice chair of Covington & Burling] Lanny Breuer said Wednesday” [ FCPA Blog ]. Lanny Breuer. That’s almost too rich. For readers who may not have savored this: \\nThe Fed: “The next FOMC meeting is next week, on November 1st and 2nd and it seems very unlikely there will be a change in policy at this meeting” [ Calculated Risk ]. \\nToday’s Fear & Greed Index: 39 Neutral (previous close: 46, Fear) [ CNN ]. One week ago: 43 (Neutral). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Oct 28 at 11:23am. Big swing to fear! \\nBig Brother Is Watching You Watch \\n“Say goodbye to the fingerprint. It’s your digital footprint the FBI wants” [ McClatchy ]. \\nMilitia Watch \\n“Jury acquits Ammon Bundy, six others for standoff at Oregon wildlife refuge” [ WaPo ]. \\nGaia \\n“Almost exactly 20 years ago, President Bill Clinton signed into law a bill creating an interstate agreement for emergency management. That inconspicuous law has opened the door for the current flood of out-of-state law enforcement agents present at the continuing protests against the Dakota Access Pipeline (DAPL) in North Dakota” [ DeSmogBlog ]. \\nClass Warfare \\n“Uber unveiled the IDG in New York this spring in partnership with the International Association of Machinists and Aerospace Workers (IAM), a union that has organized other black-car drivers” [ Bloomberg ]. “The IDG isn’t a traditional union. Drivers didn’t vote for it. It has no formal collective-bargaining rights…. The guild has helped bring Uber management to the table, says driver and IDG organizer Muhammad Barlas. “When they are more comfortable, it’s easier to try and negotiate with them,” he says. In return, the IDG won’t instigate strikes or try to get the government to treat drivers as employees with the right to unionize.” Novel theory. \\n“[N]ot all anticompetitive behavior shows up as monopoly—a seller that utilizes its dominant market position to raise prices to customers. Sometimes, it shows up as ‘monopsony,’ when a buyer uses its dominance to underpay suppliers, such as employees. The classic example is a town where most of the residents work for a single factory or mine. The lack of competition from other employers enables the factory or mine owner to pay workers less than otherwise” [ Wall Street Journal , “How Noncompete Agreements Recreate the ‘Company Town'”]. “Actual company towns are dying off, but virtual company towns are on the rise as shifts in the labor market may have given companies more leverage over their workers. One such factor is the rise of the noncompete agreement.” \\n“Why do we hear so much about the racism of the white working class and so little about the racism of the ruling class?” [ Stumbling and Mumbling ]. \\nNews of the Wired \\n“The history of emoji” [ Vice ]. Wonderful, especially if your a fan of fonts, but also worrying: How sustainable is an iconic language? Will text gradually become a thing for the 10% only? \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (Philip Pitha): \\nPhilip writes: “Mulching the black raspberries with spent coffee grounds. Reusing the plastic bags the grounds come in, but I don’t think they’re recyclable.” 0 0 0 0 0 0 This entry was posted in Water Cooler on by Lambert Strether . About Lambert Strether \\nLambert Strether has been blogging, managing online communities, and doing system administration 24/7 since 2003, in Drupal and WordPress. Besides political economy and the political scene, he blogs about rhetoric, software engineering, permaculture, history, literature, local politics, international travel, food, and fixing stuff around the house. The nom de plume “Lambert Strether” comes from Henry James’s The Ambassadors: “Live all you can. It’s a mistake not to.” You can follow him on Twitter at @lambertstrether. http://www.correntewire.com\""}, "time": 1742562294.65413}