{"duration": 0.16307330131530762, "input_args": {"text": "'You Are Here: Home » Health & Wellness » 4 Motivation-Zapping Thoughts To Identify and Eliminate 4 Motivation-Zapping Thoughts To Identify and Eliminate Prev post Next post \\nby Elizabeth Seward – Staff Writer \\nI often tell myself that the only difference between an idea and an accomplishment is action. I repeat this to myself regularly because I believe it; I believe in the power of action. Most people fully understand the importance of action, no matter how unproductive they might be. \\nThe difficulty is often in finding the motivation to initiate action. Not everyone is born naturally motivated, but we all need this driving force behind us if we’re going to succeed in doing just about anything we dream of doing. In fact, much of our life trajectory depends on our ability to harness motivation so that it yields action. Are you killing your own motivation? \\nIf you catch yourself entertaining any of the motivation-zapping thoughts below, stop that unhelpful voice in your head dead in its tracks and reset! What I Want Is For Other People, Not Me. I’ve been an artist all of my life. Ever since I was a child, I wanted to make “a living” out of creating, and thus, all of my life, I occasionally come across people who try to convince me that the life of an artist is one for rich folks or crazy people or beautiful elites or some other kind of person that just isn’t me. Luckily, I haven’t spent much time listening to those people. However, every once in a while, especially if I’m already feeling down, that thought pattern will make its way into my head. Learn this now: no matter your background, you are entitled to the opportunity to work toward what you want. I Don’t Have The Resources. Maybe you think you don’t have the time, the energy, the right space, the money, or any other type of resource or support you need to put your ideas into action. And maybe you’re right. But be honest with yourself: it’s more likely that you’re just making excuses. There are solutions to most problems like these, so find them and embrace them. Improve your time management skills, get some help with your other tasks (delegate!), secure the space and equipment you need – even if you have to borrow it, pinch pennies, find financing, look for a new job, exercise daily for an energy boost – just do whatever it takes. If the idea is important enough to you, you’ll find a way to uplift it with action. I’ll Do It Eventually. There is no eventually. There is no guarantee that you will be here tomorrow. If you can begin today, get the show on the road! Meet this motivation-zapping thought with rebellion and give your idea the green light today. I’m Not Good Enough. Maybe you think you don’t have the talent, intelligence, or charisma it takes to bring your idea into fruition? Think again. The biggest thing standing between you and your goal is not your raw skill, but your willingness to actively participate in your own idea. As they say, showing up is half of the battle (I think it’s most of the battle). Most people who are good at something didn’t get that way without practice. You have to begin cutting your teeth somewhere! The main reason others might be more skilled than you are at something specific is because they do it regularly and you do not. There are exceptions, of course, but this is usually the case. 3 Common Vegetable Garden Planning Mistakes \\nAre you planning a vegetable garden? You might not be aware of several common mistakes people make when they are planning out their vegetable gardens. When planning a vegetable garden it’s easy to ignore problems that can occur when plants are in the ground. In this video we look at 3 common mistakes gardeners make […] 8 Herbs That Can Help Reduce Stress and Anxiety \\nAre you feeling stressed or suffering from feelings of anxiety? You may find that certain herbs are a fast, easy and effective way to reduce stress and anxiety. Before going into detail about the herbs that can help you to manage your stress and anxiety, I do want to point out that diet and lifestyle still need to […] Chemtrails Killing Organic Crops and Monsanto’s GMO Seeds Thrive \\nOrganic farmers and our food supply have a huge environmental hazard to contend with compliments of the U.S. government – chemtrails. Chemtrails are chemical or biological agents deliberately sprayed at high altitudes for purposes undisclosed to the general public in programs directed by various government officials. These sprays pollute the soil, water and air while […] The Horrific True Story of How Pringles Chips are Made \\nThe Pringles Company (in an effort to avoid taxes levied against “luxury foods” like chips in the UK) once even argued that the potato content of their chips was so low that they are technically not even potato chips. by Dr. Mercola – Mercola.com To understand the nature of Pringles and other stackable chips, forget the […] Top 20 Energy Boosting Foods \\nCheck out these 20 Super Energy Boosting Foods! by Matt Hall – staff writer If you’re finding your energy lacking, you may be tempted to reach for a chemical-laden energy drink or yet another double-shot espresso. Don’t! Instead of your 10th cup of coffee for the day, reach for one or more of the following […] China Incinerates 3 US Shipments of Genetically Modified Corn \\nChina has destroyed a total of at least three genetically modified corn shipments with origins from the United States in a move that echoes the way in which the nation of Hungary actually went and destroyed acres upon acres of Monsanto’s GMO corn fields. This move by China represents a direct stand against Monsanto — […] Top chefs meet with lawmakers to urge GMO labeling \\nby Rachael Nania – WTOP News Chef José Andrés address lawmakers and chefs who met on Capitol Hill to urge members of Congress to support legislation mandating the labeling of genetically modified foods. (WTOP/Rachel Nania) WASHINGTON — The discussion surrounding labeling foods that contain genetically modified organisms is reaching a boiling point, and chefs are adding […] Shoulder Pain: Natural Remedies For Joint Pain Relief \\nYou can provide your own shoulder joint pain relief, in most cases. The pain relief is usually right at your fingertips……once you know a few very basic techniques. Learn the self-treatments that will get rid of your pain. The results can occur quite rapidly once you release the right tissue. Just follow along with the videos. Step 1 – […] How Roundup Ready GMO Corn Is Made \\nHave you ever wondered how GMO corn is made? Roundup Ready Corn is genetically engineered corn that has had its DNA modified to withstand the herbicide glyphosate (the active ingredient in Monsanto’s herbicide Roundup). It is also known as “glyphosate tolerant corn.” Roundup Ready corn was first deregulated in the U.S. in 1997 and first […] Eight foods that help fight allergies \\nby Sandeep Godiyal – Naturalnews.com Allergies are indeed bothersome. But instead of reaching out to the usual medications, individuals can now seek relief from various foods. Among the known foods that help fight off spring allergies are citrus fruits, red grapes, broccoli, collard greens, nuts, apples, fish, onions and garlic. With a diet enriched with these […] Costco Going All Out for Organic \\nAs originally reported by The Seattle Times, Costco is finding new and creative ways to meet its customers’ growing demand for organic produce. Article by Sarah Landers – Natural News Costco can be a little unpredictable when it comes to embracing natural, healthy foods. In 2015, there was a petition against the company to urge it not […] Attachment And Separation: What Everyone Should Know \\nby Dr. Peter Cook – The Natural Child Project Many human troubles would be lessened if the emotional needs of infants and young children were better understood in our society. This applies particularly to attachment needs and the effects of separating infants from their parents. Can you imagine how you might feel if you were happily […] Kellogg’s Loves GMO Contamination of Organic Food \\nOrganic Consumers Association and allies warned Kellogg’s, if they used sugar from genetically engineered sugar beets in their foods, they would face a consumer boycott. Kellogg’s responded, claiming that, even though they don’t use genetically engineered ingredients in Europe, in the U.S., “consumer concerns about the usage of biotech ingredients in food production are low.”Does that […] 6 Diet Tips to Prevent Cancer \\nEven though there isn’t a food out there that is going to prevent cancer completely, there are certain things that you can do to avoid getting one of the major cancers. For starters, how about sticking with more of a plant-based diet? Eating more vegetables and fruits, while consuming less dairy, processed meats and alcohol can […] Join For Free! Discover Little Known Health Secrets and Useful Tips For Healthy Living! First Name '"}, "time": 1742563103.0175805}