{"duration": 0.05908775329589844, "input_args": {"text": "'by Cassandra Fairbanks | Nov 3, 2016 \\nA New York elementary school has cancelled their mock presidential election after some of the students began to chant the Republican nominee’s name. \\nMock debates and elections have long been a staple of children’s schooling. I personally have fond memories of “campaigning” for Ross Perot in second grade. The free exchange of ideas, and arguing your beliefs, has traditionally been an important, and fun, part of growing up. \\nSadly, that tradition appears to be coming to an end, at least at Jericho Elementary School in Centereach, where students will now be holding a mock election to choose their “favorite school lunch” instead. \\nThe cancellation of the mock election came after some students were reportedly chanting “Trump,” and repeating “negative rhetoric about minorities.” Some of the students had reportedly stated that they did not want Muslims here. \\nWhile some may find that offensive, this is an issue in the world, and in the news. Perhaps a better way to handle it would have been to have a discussion or a debate and allowed students to argue their feelings on the issue — instead of shutting down discussions entirely. \\nThe school’s principal said in a statement that he decided to toss the learning experience aside to prevent minority students “from feeling uncomfortable.” \\n“I mean, kids often repeat what they hear on the TV or the news, but it doesn’t mean it’s OK,” school principal Glen Rogers said. “We have a diverse community here. We want all our students to feel valued.” \\nComfortable or not, immigration is an issue in this election, which students should be free to explore and discuss. \\n“Some people were getting angry because some people like Trump and some people like Clinton,” Miranda Waters, a fifth-grader at the school told ABC News. “Some people think Clinton’s not good. Some think Trump’s not good. So there’s a lot of arguments going on, and I don’t like that.” \\nThe discouragement and shaming for discussing political beliefs, and attempting to silence voices which may stray away from what the left deems acceptable, has lead to a generation of college students who believe that they have a right to never be offended — and who are willing to trade free speech to ensure it. Cassandra Fairbanks is a DC-based writer and political commentator who has been published in a range of outlets including Sputnik News, Teen Vogue, TeleSUR, and Bipartisan Report. Join We Are Change!'"}, "time": 1742561854.547515}