{"duration": 1.7064881324768066, "input_args": {"text": "'Bret Baier: FBI Indictment ALMOST certain in Hillary case November 03, 2016 \\nFox News’ Bret Baier says his sources claim that an indictment is almost certain in the new FBI investigation into Hillary Clinton’s private email server. Baier made the claim Wednesday night during a broadcast of “On the Record” with Brit Hume. Baier: “Lot of evidence” had been recovered from Anthony Wiener’s laptop. “I pressed, again and again, on this very issue. These sources said, yes, the investigations will continues [sic], there’s a lot of evidence, and barring some obstruction in some way, they believe they’ll continue to, likely, an indictment.” Baier didn’t say exactly who would be the most most likely target of an indictment, nor the timeline. Baiser sources: Greater than 99 percent confidence that Clinton’s private email server had been hacked by at least five foreign intelligence agencies. \\n(WASHINGTON, DC) Citing sources at the FBI, Fox News anchor Bret Baier said the FBI’s renewed investigation of Hillary Clinton’s email server will almost certainly end in an indictment, unless some sort of “obstruction” arises. \\nBaier made the claim Wednesday night during a broadcast of “On the Record” with Brit Hume. He said that a “lot of evidence” had been recovered from Anthony Wiener’s laptop, and made an eventual indictment appear very likely, even if it came months after the election. \\n“I pressed, again and again, on this very issue,” Baier told Hume. “These sources said, yes, the investigations will continues [sic], there’s a lot of evidence, and barring some obstruction in some way, they believe they’ll continue to, likely, an indictment.” \\nBaier didn’t say exactly who would be the most most likely target of an indictment, and what the timeline on such an indictment would be. \\nBaier also said that his sources had greater than 99 percent confidence that Clinton’s private email server had been hacked by at least five foreign intelligence agencies. When FBI Director James Comey first announced last summer that no charges would be recommended regarding Clinton’s server, he said the FBI had no way of knowing whether the server had been hacked. \\nClinton’s presidential campaign aggressively downplayed the severity of the renewed investigation into her private email server, and criticized the judgment of Comey for publicly announcing it. \\nDaily Caller copy, TRUNEWS analysis Please contact TRUNEWS correspondent Edward Szall with any news tips related to this story. Email: | Twitter: @EdwardSzall | Facebook: Ed Szall DOWNLOAD THE TRUNEWS MOBILE APP on Apple and Google Play ! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742563511.292655}