{"duration": 0.22340846061706543, "input_args": {"text": "\"Carey Wedler | ANTIMEDIA \\nOver the course of the 2016 presidential election, Americans who rail against Hillary Clinton have condemned the media’s bias in her favor — and rightfully so. Clinton has effectively infiltrated the corporate news media — whose parent companies often donate to her — with the deliberate intent of bolstering her own chances at the presidency. \\nBut as this nefarious behavior continues to come to light through hacks and leaks, another powerful sphere of media influence has quietly placed its resources behind Hillary Clinton – and hardly anyone is talking about it. \\nThough outrage over Clinton’s corporate sponsors usually focuses on her support from banking giants like Goldman Sachs , Citibank, JP Morgan, and other reviled companies, corporate Hollywood has collectively supplied her campaign with far more cash than these banks. \\nWhen people think of Hollywood’s support for a political campaign, their minds tend to focus on the entertainment industry’s most visible figures — celebrities. From George Clooney , Katy Perry, and Leonardo DiCaprio to Justin Timberlake, Reese Witherspoon, Steven Spielberg, Beyonce, and Jay-Z, the celebrity consensus this year has settled on Clinton. \\nBut underneath the stars’ ‘progressive’ choice is an intentional, systematic machine working in Hillary’s favor, and it mirrors other conglomerated industries that have aligned behind her. Moguls with Millions (and Billions) Back Hillary and the Clinton Family \\nThe first layer of Clinton’s corporate Hollywood allegiance is rather simple to peel back, simply because Hillary’s top industry donors make no secret of their support. \\nEarlier this year, George Clooney held a $100,000-a-plate fundraiser for Clinton, one that earned $15 million dollars — far more than Goldman Sachs has collectively donated to her campaign. The actor’s event raised money for the Hillary Victory Fund, which was recently revealed to be an avenue for maxed out donors to contribute more than the allowable amount. The Victory Fund has also been criticized for hoarding money for Hillary that was supposed to go to state Democratic parties. \\nClooney teamed up with one of corporate Hollywood’s most powerful executives, Jeffrey Katzenberg, for this fundraiser. Katzenberg rose to prominence at Walt Disney in the 1990s, where he helmed some of the millennial generation’s favorite childhood films: Beauty and the Beast , Aladdin , the Lion King , and the Little Mermaid were all products of Katzenberg’s leadership. \\nSeveral years later, he partnered with Steven Spielberg (also a longtime Clinton supporter) and David Geffen, a music mogul, to create Dreamworks Animation. Katzenberg was the top bundler for Barack Obama in 2012 and also funded him in 2008, so it’s unsurprising the president takes his phone calls. Further, Katzenberg’s right-hand man, Andy Spahn, visited the White House almost 50 times during Obama’s first term, Mother Jones reported at the time, enjoying a close relationship with the president — and some economic benefits. \\nKatzenberg, who recently earned $391 million on the sale of Dreamworks to Comcast, has donated at least $1 million to Clinton’s campaign this election season. \\nThen there’s billionaire Haim Saban, the staunchly pro-Israel entertainment mogul behind the original Power Rangers series. He is Clinton’s top individual donor, besting Katzenberg, with at least $6.4 million in donations to her campaign. He has contributed $15 million to the Clinton Foundation, and his wife, Cheryl, serves on the board. \\nSaban has supported the Clintons since the 1990s, and during Bill’s time in office, he enjoyed the business perks of being friends with the president of the United States, as Mother Jones has detailed . His investments are tied to Wall Street, and he has also enjoyed Clinton’s condemnation of Boycott, Sanction, Divest, a nonviolent, market-based global protest movement challenging Israel’s occupation of Palestine. \\nBoth men, therefore, know well the perks of having friends in high places — and both are some of the top donors of any candidate in the 2016 race. But their very public— and lavish — support barely scratches the surface of the real machinations taking place between Hollywood’s corporate underbelly and its stake in American politics. The Studio Lobby \\nMost people, if they’ve heard of the Motion Picture Association of America (MPAA) at all, know it as the organization that rates films. It’s the familiar, almost comforting disclaimer that appears before a trailer or film, ranking it G, PG, PG-13, R, or in some cases, NC-17. \\nThough the organization has its roots in the 20th century, founded as an effort to self-regulate their content, more than anything, it is corporate Hollywood’s lobby. The MPAA represents 20th Century Fox (owned by Rupert Murdoch’s News Corp.), Warner Brothers (owned by Time Warner), Disney, Universal (owned in part by Comcast), Sony Pictures, and Paramount Pictures (News Corp, Time Warner, and Comcast have all contributed to the Clinton Foundation). \\nFor some, it’s difficult to place corporate Hollywood in the same category as more reviled industries like banking, weapons manufacturing, or pharmaceuticals . This is likely, at least in part, because they deliver one of America’s favorite pastimes — entertainment. Yet the revolving door is strong, as is the MPAA’s political foundation. \\nIn fact, the MPAA’s longest running chairman was Jack Valenti , who served as an advisor to Lyndon B. Johnson before taking over the lobbying group. By 2011, former senator and presidential candidate, Chris Dodd, had taken the reins. \\nDodd, who makes $3 million a year working as the organization’s top lobbyist, takes his job seriously. As the Los Angeles Times reported , Dodd has increased lobbying funds and efforts in Congress. “ We’ve had a hundred meetings with new members of Congress since November ,” he told the publication last year. \\nDodd is a Clinton supporter. He officially endorsed her earlier this year. \\nDisney chairman Bob Iger is also a huge Clinton supporter and member of the MPAA. Alongside Saban, Iger hosted a Hollywood fundraiser for her in August and held a meeting with Tim Kaine, Clinton’s running mate, in September. \\nOn that same trip, Kaine met with Warner Brothers executive Kevin Tsujihara, who donated to Hillary Clinton’s Victory Fund this year. He met with Fox Television executive Dana Walden, who also donated to Clinton. He also met with Kevin Reilly, an executive at Turner, which is owned by Time Warner, which owns Warner Brothers and CNN , an outlet condemned for heavily favoring Clinton this election cycle. Perhaps these private meetings were about gun control and equal rights. Or, perhaps, Kaine and the executives discussed business interests. \\nEither way, the paper trail gets more decisive — and more revealing. What is the MPAA Hoping to Achieve? \\nMPAA members Disney and Sony have independently advocated for the Trans-Pacific Partnership deal , the globally loathed trade agreement criticized for granting carte blanche to corporations and stripping nations of their sovereignty. Disney has even prodded its employees to contribute lobbying funds in support of the agreement. Fox, Disney, Time Warner, Comcast, and other media companies have lobbied in favor of TPP . \\nOne of TPP’s most dangerous provisions is its intent to regulate copyright and intellectual property in favor of corporations – one of corporate Hollywood’s main objectives. \\nDodd is, unsurprisingly, a proponent of internet censorship legislation, which corporate Hollywood invariably backs in its attempts to preserve its copyright profits. Hollywood studios have been some of the biggest proponents of heavy internet regulation (with regard to copyright) and have waged campaigns against online piracy. The MPAA’s website claims “the most serious threat” to the film industry is online copyright theft. \\nIt makes sense, then, that the MPAA would be a member of the U.S. Business Coalition for TPP . This massive trade group spent $658 billion dollars on lobbying in 2014, according to Common Cause, a left-leaning nonprofit lobbying organization. The coalition includes members like Goldman Sachs, Citigroup, JP Morgan, Dow Chemical , Pfizer , GlaxoSmithKline , Boeing , and Viacom (another media behemoth). Interestingly, the coalition’s website no longer lists its members, though Anti-Media easily accessed an archived version of that information. \\nThese corporations, or their employees, have also donated funds to Hillary Clinton in one way or another, often via the Clinton Foundation, which has been documented to issue favors to entities that contribute funds. Dozens of media corporations have donated to the foundation. \\nAnd — surprise, surprise — the only presidential candidate the MPAA has contributed to in 2016 is … Hillary Clinton. \\nWhile it’s certainly the case that Hollywood executives lean liberal and many undoubtedly support Clinton due to a misguided moral imperative to stop Donald Trump, it would be naive to presume this is the only dynamic at play. \\nThis dynamic is evident in a letter from MPAA chief counsel Steven Fabrizio to Disney’s Alan Braverman, among others, assuring them of his efforts to pass the bill. “ Finally, in regard to trade ,” he wrote , “ the MPAA/MPA with the strong support of your studios, continue to advocate to governments around the world about the pressing need for strong pro-IP trade policies such as TPP and the proposed EU/US trade agreement (TTIP). ” \\nBraverman donated to Clinton this year. Infiltrating the DNC Platform Drafting Committee \\nMost damning is the fact that one MPAA lobbyist, former California congressman Howard Berman, ended up on the drafting committee for the Democratic platform this year (throughout the course of his political career, some of his top donors were Hollywood studios). \\nAccording to an email released by Wikileaks, Berman met with now-disgraced former DNC Chairwoman Debbie Wasserman Schultz in May of this year — two months before he helped draft the platform. She appointed him to the platform drafting committee. \\nThat platform was widely criticized for refusing to condemn and reject TPP outright, as Bernie Sanders and his camp attempted to do. Berman helped vote down language against TPP. \\n“But Hillary opposes TPP!” some might argue. Indeed, after claiming it was set to be the “gold standard” of trade agreements, she changed her mind and said she opposed it. But a leak from the recently released John Podesta batch showed there is a very strong chance she will change her mind, again, once elected. And considering Donald Trump’s anti-trade deal rhetoric against both NAFTA and TPP (not to mention his incendiary rhetoric), it makes little sense for corporate Hollywood to back Trump — even if they’re partly responsible for his meteoric rise via the Apprentice . \\nIn a vein similar to Berman’s, a former MPAA (and Disney, and Dow, and Citigroup) lobbyist, Jose Villareal, now serves as the Clinton campaign’s treasurer. \\nThough there is no smoking gun proving corporate Hollywood is backing Clinton with the express intent of ensuring passage of the Trans-Pacific Partnership, it’s telling that the MPAA’s homepage is a tribute to TPP (and, naturally, themselves). It’s telling that the organization donated to only one presidential candidate. It’s telling that executives within these corporations are supporting Clinton while the companies they represent heavily back TPP — and in many cases, Clinton. It’s telling that their parent corporations, like News Corp and Time Warner , are backing her — and the TPP. \\nConsidering six corporations control 90% of media in the United States and Clinton continually proves her loyalties to big business, it’s hardly surprising she’s the choice of corporate Hollywood. And it’s likely they’ll expect favors in return. \\nAs Dodd said following President Obama’s rejection of SOPA and PIPA following public outcry in 2012: \\n“Candidly, those who count on quote ‘Hollywood’ for support need to understand that this industry is watching very carefully who’s going to stand up for them when their job is at stake…Don’t ask me to write a check for you when you think your job is at risk and then don’t pay any attention to me when my job is at stake.” Don't forget to follow the D.C. Clothesline on Facebook and Twitter. PLEASE help spread the word by sharing our articles on your favorite social networks. Share this:\""}, "time": 1742561641.797461}