{"duration": 0.09276318550109863, "input_args": {"text": "'By Bill Sardi October 29, 2016 The movement toward recreational and not just medical marijuana use at the State level is inevitably going to change the fabric of America. There were lines of hundreds of people outside pot shops in Colorado when just one herbal product was legalized there in 2012. In my years in the natural health industry, there have been swells of public interest over DMSO, coral calcium, Echinacea, resveratrol, even vitamin C with the publication of Linus Pauling’s book VITAMIN C AND THE COMMON COLD (which by the way resulted in a 300% in mortality from coronary heart disease). But there have never been lines of customers waiting to buy any dietary supplement as there has been for a single herb — recreational marijuana. There are less than 100 health food stores in the State of Colorado There are reportedly over 800 marijuana shops. [ Pot Guide Aug 14, 2015] Just a single herb is going to be a major focus of the economy of some small States as taxes raised from the sale of marijuana will be considerable. Nine States will put legalization of marijuana up for a vote in November 2016. In these States, marijuana would be locally legal but federally illegal. [ Fortune June 29, 2016] About 57% of Americans believe marijuana should be legalized. [ Pew Research Oct 12, 2016] No one can say Americans aren’t entrepreneurial. Over 2000 medical marijuana shops initially opened in Washington State before they were shut down and forced to enter a lottery for new business licenses. Then the State issued 222 new licenses. [ Quartz.com Oct 25, 2016] Passage of Proposition 64 in California to legalize marijuana is expected to generate $1 billion in State revenue. [ San Diego Tribune Oct 27, 2016] In the State of Colorado, marijuana sales in the first year of legal adult-use in 2014 totaled $699.2 million and generated $76.2 million in taxes. In the first 8 months of 2016 sales in Colorado totaled $846.5 million and generated $124.9 million in taxes. [ The Cannabist ] Passage of Prop. 64 in California is projected to grow a $22 billion marijuana business. [ New York Times Oct 24, 2016] Legalization of marijuana is expected to be larger than the wine industry if legalization is nationwide. In fact, marijuana-infused wine is now available. [ AOL.com Oct 14, 2016] There were more arrests for possession of marijuana than for all violent crimes combined last year (2015). [ New York Times Oct 12, 2016] Passage of Proposition 64 in California would reduce the number of arrests for misdemeanor and felony marijuana crimes. About 15,000 to 20,000 people have arrested in California annually for such crimes. Nationwide, FBI numbers indicate arrests for marijuana use in 2015 totaled 643,121, down from 82,720 in 2007. [ Forbes.com Sept 29. 2016] The incarceration of so many young black Americans for use of marijuana (3.7 times greater chance of being imprisoned despite equal usage) has become unconscionable. [ NY Times June 3, 2013] At one point there were 75 individuals serving life sentences (or de facto life) for peddling marijuana. [ The Daily Beast Sept 3, 2015] Infuriatingly, private prisons, police unions, pharmaceutical companies and alcohol brands have been among the top industries lobbying against legalization of marijuana. [ Leafly.com ] It is no wonder the pharmaceutical industry opposes marijuana legalization. One recent study revealed over 80% of marijuana users reported replacement of prescription drugs such as painkillers, anti-anxiety medications, stimulants, sleep aids and antidepressants) with cannabis. [ Drug & Alcohol Review May 2016] What kind of country will we have after the complete penetration of pot shops throughout America? Here is how one source explains the marijuana experience: “ The ‘high’ produced by marijuana causes physical changes such as reddening of the eyes, fast heartbeat, increased blood pressure, dry mouth, dizziness, and increased appetite. Despite its high intoxication potential, it has a low dependency (or addictive) potential and low risk of organ damage or death. Cannabis use causes the release of the brain chemical dopamine, which induces a feeling of euphoria on the user. Marijuana users report elevated feelings of happiness, relaxation, relief from pain and anxiety, as well as other potential remedies to physical ailments. However, there are also a number of adverse effects as well. It may disrupt the storage of short-term memories and it may have negative effects on long-term memory for heavy users.” [ Sex Info UC Santa Barbara] Will America be any healthier with the availability of recreational marijuana? Medical marijuana has been prescribed for chronic unremitting migraine headaches, joint pain, glaucoma, nausea during pregnancy, after chemotherapy; for seizure disorders; for nerve pain; for weight loss caused by chronic illness; post-traumatic stress disorder; Alzheimer’s disease. Except for seizure disorders and nausea during pregnancy, it doesn’t get very high grades. [ Prevention ] Marijuana is less addictive than tobacco but more than alcohol. [ Journal Clinical Psychiatry April 2016] Stanton Glantz, a professor at the School of Medicine, University of California, San Francisco, says legalization of marijuana “is exchanging a criminal justice crisis for a public health crisis.” [ New York Times Oct 24, 2016] I have maintained that marijuana was ushered into use by young adults in America in the 1960s in order to market birth control pills. Marijuana is known to have aphrodisiac properties and increases arousal and sexual activity. It reduces sexual inhibitions. [ Journal Sex Research Aug 1974] Generally, young females are modest and birth control pills were confined to use by women who already had 2 or 3 children and didn’t want more. The proliferation of marijuana ushered in an era of uninhibited sex outside of marriage. The hippy girls of the 1960s were on “the pill” to prevent pregnancy. The hippy generation was anti-establishment but was lining the pockets of the pharmaceutical companies. The first birth control pill was approved for use in 1960. Despite its claim of preventing unwanted births especially among adolescent females, a decade later the number of abortions skyrocketed. Marijuana + birth control pills led to “safe sex” which actually increased many health risks for females. [ The Pill Kills ] I read recently where the incidence of schizophrenia rises 520% among marijuana users (largely those who over-use). [ Knowridge Science Report Oct 24, 2016] Though it should be added that tobacco use, which often accompanies smoking pot, also increases the risk for schizophrenia and is a co-occurring cause. [ Schizophrenia Research Aug 30, 2016] Some people are more genetically sensitive to develop psychosis from marijuana use. One study shows 44 out of 121 people (36%) with diagnosed schizophrenia developed symptoms of psychosis within 1 month of beginning to smoke marijuana. [ International Journal Neuropsychopharmacology Oct 2010] But that doesn’t mean 36% of marijuana users would become psychotic. According to one study, about 3000 young people would have to be dissuaded from using marijuana to prevent one case of psychosis (schizophrenia). [ Addiction Nov 2009] Marijuana raises brain levels of homocysteine — an undesirable blood protein. [ Metabolic Brain Disease Sept 2014] Mental depression can result. The use of marijuana has been linked with memory problems. [ Journal Clinical Experimental Neuropsychology Oct 16, 2016] Babies born to mothers who use marijuana for morning sickness during pregnancy are more likely in young adulthood to have problems with executive functioning. [ Neurotoxicology Teratology June 1, 2016] Cannabis dependency results in the lower release of dopamine from brain cells and this is associated with inattention and poorer working memory. [ Molecular Psychiatry March 22, 2016] Doctors seeing patients who regularly use cannabis are likely to see a pattern among these patients of acute memory impairment, lack of coordination and judgment, social dysfunction and chronic bronchitis. [ Annals Medicine 2016] The common side effects produced by habitual marijuana users are well known: dry mouth (and accompanies cavities in teeth), dizziness upon standing up from a chair, increased appetite, memory impairment, lassitude (lack of motivation), mental depression, paranoia/anxiety, addiction, and because marijuana is smoked, lung problems may develop. [ Leaf Science ] For those who choose to use marijuana regularly, the following dietary supplements may be useful: N-acetyl cysteine (NAC) is an available sulfur-based dietary supplement that is often successfully used for young marijuana users who experience negative mental and emotional symptoms. [ Expert Opinion Drug Metabolism Toxicology Oct 21, 2016] NAC is helpful for problems with addiction. [ American Journal Psychiatry Aug 2012] Zinc supplements may also be used to calm addiction. [ Journal Annals Toxicology July 2011] Since resveratrol binds to the cannabinoid receptors on the surface of brain cells, it may be helpful marijuana dependence. [ Journal Pharmacology Experimental Therapeutics July 2009] Citicoline, to improve mental performance. [ International Journal Neurology & Neurotherapy Sept 30, 2015] Other supplements: magnesium, B vitamins (to reduce homocysteine), extra vitamin B12 (to avert short-term memory loss), vitamins C and D. As a final note, legislators were duped into drafting legislation to block the use of food stamps (electronic benefit cards) for the purchase of marijuana edibles (cookies) based upon a satirical news report that mistook fiction for fact. [ Think Progress ] However, apparently one convenience store operator was indicted for accepting food stamps as payment for marijuana. [ The Examiner ] The best news regarding marijuana is that States are electing to butts heads with the federal Supremacy clause in article VI of the Constitution and predominate over federal prohibitions against marijuana. [ Huffington Post March 30, 2014] The Best of Bill Sardi Tags: Bill Sardi [ ] is a frequent writer on health and political topics. His health writings can be found at www.naturalhealthlibrarian.com . His latest book is Downsizing Your Body . Copyright © 2016 Bill Sardi Word of Knowledge Agency, San Dimas, California. This article has been written exclusively for www.LewRockwell.com and other parties who wish to refer to it should link rather than post at other URLs.'"}, "time": 1742628548.3706796}