{"duration": 0.1349632740020752, "input_args": {"text": "'DAVOS, Switzerland  —     Donald Trump has never been invited here. Neither has Nigel Farage, the British politician who led the Brexit campaign. The World Economic Forum  —   an annual gathering of global policy and business leaders, who come to debate the world’s great challenges  —   gets underway here Monday night as the shifting political trends toward nationalism and against a sense of globalism are raising renewed questions about the relevance of the elites known as the “Davos class. ” It is this group of   plutocrats that largely failed to anticipate  —   and may have even unconsciously generated  —   the seeping   movement across the globe. Every January, a glittering array of the cognoscenti descend on the Alps: the     Bill Gates, the   of Microsoft the billionaire investor George Soros Jack Ma, the founder of China’s   giant, Alibaba and  —   until recently  —   Angela Merkel, the chancellor of Germany. An assortment of Hollywood actors including Angelina Jolie, Leonardo DiCaprio and Matt Damon have made the pilgrimage over the years to promote their nonprofit work. And the conversations tend to be dominated by issues like inequality, climate change and the economic challenges facing developed and emerging countries. This year, the guest list includes names like President Xi Jinping of China Vice President Joseph Biden JPMorgan Chase’s chief executive, Jamie Dimon the head of the International Monetary Fund, Christine Lagarde and former Vice President Al Gore. And yet missing from these   conversations have been meaningful challengers or critics of the underlying theme that was seemingly stipulated from the birth of this event 46 years ago: Globalization has the potential to benefit everyone. “Trump’s election victory is a clear indication that the majority of people are not interested in a world government, but want to return to a classical, local democracy,” John Mauldin, an economic researcher and author, recently wrote. “Strange as it may seem to the Davos men, most people tend to love their ‘patria,’ the land of their fathers. ” Dissenting voices like those of Mr. Trump and Mr. Farage have rarely been part of the discussion  —   though perhaps that will change. Theresa May, Britain’s new prime minister, will attend this year, as will some of Mr. Trump’s advisers. But the victories of Mr. Trump and the Brexit campaign can be viewed as a rebuke of “Davos Man,” a name that Samuel Huntington, the Harvard political scientist, gave attendees in 2004, describing them as “transnationalists” who “have little need for national loyalty, view national boundaries as obstacles that thankfully are vanishing, and see national governments as residues from the past whose only useful function is to facilitate the elite’s global operations. ” The middle class in the United States and Britain  —   and perhaps in France if Marine Le Pen, the   presidential candidate who has also never been invited to Davos, wins this spring  —   clearly haven’t felt the benefits of the   world encouraged by multinational corporations that allows both immigration and commerce to take place without friction. “They have witnessed the rise of the Davos class, a   network of banking and tech billionaires, elected leaders who are awfully cozy with those interests, and Hollywood celebrities who make the whole thing seem unbearably glamorous,” Naomi Klein, a columnist for The Guardian, wrote in a searing analysis of the American election in November. She described the failure of “elite neoliberalism” to address the economic challenges of the masses. “Success,” she wrote, continuing to describe the middle class, “is a party to which they were not invited, and they know in their hearts that this rising wealth and power is somehow directly connected to their growing debts and powerlessness. ” The Davos Man has either failed to properly articulate the benefits of open trade  —   or the reality of open trade is more complicated than previously imagined. In a nod to this new reality, the World Economic Forum has put together an index of what it calls inclusive growth and development, which measures 109 countries according to their progress on economic growth and reducing income inequality and breaks out subsets of those countries to compare with different data sets. According to the index, median income actually declined by 2. 4 percent between 2008 and 2013 across the 26 advanced economies where data is available, which may help explain the shifting political winds. “It’s our response to how capitalism has failed us  —   and how we need to fix it,” said Adrian Monck, a member of the forum’s executive committee. The United States ranked 23rd out of 30 advanced economies. In terms of wage and nonwage compensation, it ranked last in social protection, it came in 25th. It also came in 25th on “intermediation of business investment”  —   in other words, the amount of money that goes into productive investments, such as research and development and infrastructure as opposed to share buybacks. (Norway ranked No. 1. Living standards there rose by 10. 6 percent from 2008 to 2013 while the economy grew only 0. 5 percent.) Mr. Monck defended the idea of a globalist approach. “The benefits of globalization are there to see, in jobs in China, India and many emerging markets,” he said. “Billions of people owe better lives to it. ” He invoked Klaus Schwab, the founder of the World Economic Forum. “What hasn’t been listened to in Davos is persistent warnings from people like Klaus that the benefits need to be shared, and that you can’t have    capitalism,” Mr. Monck said. Still, he acknowledged that the invitation list of insiders is by design. “We always want the most comprehensive political attendance in Davos, to help support   cooperation, which is what we do,” he said. “That inevitably means current, serving political figures. There are politicians in office now  —   and coming to Davos  —   who reflect this emergent agenda that you’ve seen in the U. S. ” For example, he said, leaders from Poland, Finland, Portugal and even Switzerland  —   where the Swiss People’s Party was an early example of the shift in the political landscape  —   will be on hand this week. A bevy of Mr. Trump’s advisers and members of his business council are expected to attend, including Anthony Scaramucci, who joined the  ’s White House staff as an adviser and public liaison to government agencies and businesses. He will be joined by Stephen Schwarzman, chairman of the Blackstone Group and also of Mr. Trump’s President’s Strategic and Policy Forum. Four Trump cabinet nominees have been to Davos in years past: Rick Perry (energy) once Rex Tillerson (state) three times Robert Lighthizer (trade) 15 times and Elaine Chao (transportation) four times. A few people who were once   crusaders  —   like Ms. May of Britain  —   are now insiders. And, depending how the political winds shift, more people of her ideological ilk may join the Davos class in 2018. This is not the first time that the World Economic Forum has come under fire from critics about its globalist,   message. In 2000, a group of more than 1, 000 demonstrators carrying signs that said “Against the New World Order” smashed the windows of a McDonald’s franchise here in Davos just down the road from the conference, protesting open trade policies espoused by   Bill Clinton, who was speaking at the event. Many of today’s policy makers and executives gathering here are expected to speak about the rise of populism and the need to adjust economic incentives. Hamdi Ulukaya, the chief executive of Chobani, the yogurt company, is expected to encourage business leaders to do more to address wealth building among employees he provided shares in his company to every   employee, making many of them millionaires. The question, of course, is whether those discussions can ever get beyond the theoretical for a group that is seen by many   voters as out of touch with the real economic challenges that people face. Conversations about income inequality, for example, have long had a tinge of class envy as opposed to a real appreciation for the basic jobs and wages that people are seeking. Still, with the word “Davos” being tossed around as an epithet, some politicians are staying away from the Alps this year. Ms. Merkel, for example, has passed on attending now for two years in a row, in the face of continued criticism among German voters that she is too much of a globalist. So why do so many policy makers and executives still covet an invitation? Because Davos remains the world’s   shop to meet leaders from all corners of the globe. And despite the critiques of the gathering, a remarkable amount of business  —   both political and corporate  —   takes place behind the scenes. One thing is sure: The predictions made here  —   known as the Davos consensus  —   have a tendency to be wrong. Mr. Trump, with very few exceptions, was largely written off last year as a bad joke. “If you bother to read some of the serious analysis of Trump’s support, you realize that it’s a very fragile thing and highly unlikely to deliver what he needs in the crucial first phase of the primaries,” Niall Ferguson, the historian, predicted at Davos in 2016, according to Bloomberg News. “By the time we get to   it’s all over. I think there’s going to be a wonderful catharsis, I’m really looking forward to it: Trump’s humiliation. Bring it on. ”'"}, "time": 1742562181.074457}