{"duration": 0.06808257102966309, "input_args": {"text": "'Rosneft baut ehemalige Romanow-Residenz wieder auf 28. Oktober 2016 TASS Der Ropschinski-Palast ist Teil des Unesco-Weltkulturerbes, aber in einem schlechten Zustand. Nun soll der Ölkonzern Rosneft das Gelände mieten und die Anlagen restaurieren. Facebook romanows , öl und gas Trotz der Tatsache, dass das Palast-Park-Ensemble in Ropscha seit 1990 auf der Liste des Unesco-Weltkulturerbes steht und ein Denkmal von föderaler Bedeutung ist, handelt es sich bei einem Großteil der Objekte um Ruinen. Quelle:Lori/Legion-Media \\nAm Dienstag teilte Russlands Kulturminister Wladimir Medinski mit, dass der Ropschinski-Palast bei Sankt Petersburg für 99 Jahre an den Ölkonzern Rosneft vermietet werden könnte. Das Unternehmen wolle das zerstörte Denkmal restaurieren und Touristen Zutritt zur Hofanlage gewähren. Der Palast hat eine bewegte Geschichte \\nDas Park-Palast-Ensemble Ropschinski ist eine ehemalige Romanow-Residenz. Foto: Archivbild \\nDas Park-Palast-Ensemble Ropschinski ist ein architektonisches Denkmal aus dem 18. Jahrhundert und eine ehemalige Romanow-Residenz. Die Hofanlage wurde auf Anordnung Peters des Großen erbaut und sollte an den Erholungsort Karlsbad (Karlovy Vary, Tschechische Republik) erinnern. Unter Kaiserin Elisabeth und nach Entwürfen des italienischen Architekten Bartolomeo Rastrelli wurde schließlich ein zweistöckiger Palast mit einer großen Parkanlage gebaut. \\nNach der Palastrevolution wurde der gestürzte Peter III. in die Anlage gebracht. Er verstarb unter ungeklärten Umständen. Nach der Oktoberrevolution wurde der Palast schließlich verstaatlicht. Das Hofgelände diente als Standort für die Fisch-, Vieh- und Vogelzucht sowie weitere Betriebe. \\nIm Jahr 1944 wurde der Palast von den sich zurückziehenden deutschen Truppen in Brand gesetzt. Nach dem Krieg wurde das Anwesen restauriert. Es beherbergte eine Flugeinheit und später ein Bataillon der chemischen Abwehr des Militärbezirks Leningrad. \\nIn den 1960er-Jahren wurde der Palast unter staatlichen Schutz gestellt, Ende der 1970er-Jahre wurde er stillgelegt. Welche Summen sind für den Wiederaufbau nötig? Kommersant'"}, "time": 1742562123.6263993}