{"duration": 0.01615619659423828, "input_args": {"text": "'TEL AVIV  —   Moving the U. S. embassy from Tel Aviv to Jerusalem would end the peace process between Israel and the Palestinians, senior Palestinian negotiator Saeb Erekat warned on Saturday. [“We believe that moving the U. S. embassy to Jerusalem would mean the end of the peace process,” said Erekat, who is also   of the Palestine Liberation Organisation (PLO) during a World Economic Forum meeting at the Dead Sea in Jordan on Saturday.  Erekat’s warning is the latest of a series of similar declarations from Arab and Muslim leaders. Palestinian Authority President Mahmoud Abbas, who is slated to meet with Trump in Bethlehem on Tuesday, said in January that if Trump moves the embassy, it will “destroy the peace process. ” Abbas’ senior aide and the PA’s supreme Sharia judge Mahmoud   stated that an embassy transfer would be a “declaration of war. ” And earlier this month, Turkish President Recep Erdogan said it would be “extremely  ” for Trump to move the embassy. Erekat said a Palestinian state without eastern Jerusalem as its capital would have “no meaning. ” He also expressed his hope that “President Trump would give us a chance. ” “He said   …     he will not impose solutions on us or on the Israelis,” Erekat said. “(But) the fact that he is going to move the embassy is imposition, is dictation. ” Erekat also met with opposition member Tzipi Livni (Zionist Union)  —   his counterpart in   negotiations  —   and the two expressed their hope that Trump would be successful in his efforts to jumpstart the moribund peace process. The new U. S. ambassador to Israel, David Friedman, welcomed the notion of an embassy relocation but said the decision was ultimately Trump’s. The president’s   visit to Israel will coincide with Jerusalem Day, marking the 50th anniversary of the reunification of Jerusalem since the 1967 defensive war and speculation has been rife that the president will use the opportunity to announce an embassy relocation. However, on Wednesday a senior administration official told the Times of Israel that the decision “wouldn’t be immediate” and “a final decision hadn’t been made. ” Earlier in the day, a White House official told Bloomberg that considering the upcoming attempts to restart the peace talks, moving the embassy would be  . “We don’t think it would be wise to do it at this time,” he said. “We’ve been very clear what our position is and what we would like to see done, but we’re not looking to provoke anyone when everyone’s playing really nice. ” A waiver for the congressional mandate on an embassy transfer has been signed every six months by consecutive U. S. presidents since 1995. The next date for that waiver is June 1.'"}, "time": 1742628499.4209547}