{"duration": 0.08836793899536133, "input_args": {"text": "'“Drama. ” “ . ” “Thriller. ” “ . ” If you’re searching for a movie to watch on a streaming site, and you filter by genre, those are among the words you’ll see right away. Pretty straightforward, yes. Intrepid or surprising, not in the least. The Fandor experience is quite different. Based in San Francisco, Fandor combines breathtaking eclecticism with an   platform that’s an exemplary example of the digitization of   culture. Search for a film in the “ ” genre, and you’ll get 18 pages with 18 choices on each, but there are even more options: The top of the page has links to 10 other very specific subgenres, including “Martial Arts,” “Sword and Sandal,” “Wilderness” and “Treasure Hunting. ” You can also refine your search by checking off from a list of about 30 countries, or toggle between film durations (shortest to longest) and years of release (oldest to most recent). Going down the Fandor rabbit hole is the most fun I’ve had with a streaming website in a while. While “Documentary” isn’t the first place I look when exploring movies on streaming sites, one recent afternoon two of the many documentaries the service offers jumped out at me. The first was “Komeda: A Soundtrack for a Life. ” This 2010 short feature directed by Claudia   tells the life story of Krzysztof Komeda, the Polish jazz musician and film score composer whose life came to a freakishly tragic end not too long after he went to Hollywood to work on his friend Roman Polanski’s first American film, “Rosemary’s Baby. ” The next documentary was Mark Rappaport’s “Debra Paget, for Example,” from 2015, a study of the onetime 20th Century Fox contract bombshell best known for her work with Elvis Presley and Fritz Lang. Not all of the documentaries are so   but this is a site that rewards buffs capable of appreciating the tendrils of its library and how it’s organized. Returning to “” the selection under that rubric reflects a wide and arguably generous interpretation of the category. There’s the searing 1980 military saga “Breaker Morant” and the 2001   cult item “Ichi the Killer. ” There’s John Ford’s seminal “Stagecoach” Ted V. Mikels’s    evergreen, “Ten Violent Women” and “The Wild Geese,” a  ’70s mercenary (in every sense of the term)   action picture in which Richard Harris and Richard Burton phone it in while Roger Moore does his usual level best. According to Gail Gendler, the head of programming at Fandor, the site’s goal is to maintain access to 6, 000 titles (more or less) at any given time, even as titles come and go. “We want to present a canon for film fanatics and millennial movie lovers,” Ms. Gendler said in a phone interview. She was quick to point out that the site, which started in 2011, functions as a vital bridge between cult and mainstream. “We have the first film by Damien Chazelle and the first film by Barry Jenkins,” she said, citing two filmmakers who had good showings at this year’s Academy Awards. (Those are “Guy and Madeline on a Park Bench” by Mr. Chazelle, the “La La Land” director, and “My Josephine” by Mr. Jenkins, the “Moonlight” director both are well worth checking out.) “We have early work by Kelly Reichardt, one of the most vital indie filmmakers in the United States. ” Speaking to Ms. Gendler about the site’s remarkable menus, I mentioned that while looking through Fandor’s L. G. B. T. Q. page, I found “Out 1,” French director Jacques Rivette’s   experimental drama from 1971, a picture that I never considered as thematically L. G. B. T. Q. But thinking about how one of that film’s characters, a street hustler played by Juliet Berto, struggles with identity questions throughout her story line, it occurred to me that perhaps I had been looking at the film narrowly. “We’re always having interesting arguments internally about genre and tagging systems. ” she said. “Does one category contain too many films or not enough films is one aspect of the discussion. But often times where we place a given film offers an opportunity for conversation with the film community of both subscribers and nonsubscribers who look at the editorial and social part of the site, or on the Facebook page. We want to make the experience not just about viewing, but connecting with other film lovers. ” To that end, the editorial side of the site, Keyframe, has a great asset in the correspondent David Hudson, who deftly aggregates film news, connecting readers to outside material while maintaining a reliable and witty voice and displaying a   sensibility. Keyframe itself offers a lot of video essays, with topics recently ranging from a profile of the silent film pioneer Alice   to a primer on the “chopped and screwed” genre of   featured on the soundtrack of “Moonlight. ” Also contributing to what Ms. Gendler calls a “once you get there, it’s hard to leave” aim, the site features monthly “Spotlights,” which gather library films under occasionally timely topics. February, for instance, featured 2017 Oscar nominees, with work by Mr. Jenkins Mr. Chazelle and Maren Ade, whose “Toni Erdmann” was a nominee for best foreign language film. Sometimes the topics are just topics, as in last month’s “Twenty Something,” with titles from Bertrand Blier’s corrosive      “Going Places” (  a young and hunky Gérard Depardieu in 1974) to Sean Baker’s “Starlet” (2012) about an aimless young woman in the fringes of California’s porn industry (a very fringy place to be). This month, a nod to the Tribeca Film Festival comes in the form of a “New York films” spotlight. The company is expanding into the funding and production of original documentary shorts  —   one of which, “Gut Hack,” is having a premiere as a New York Times   on Monday, April 10  —   and anticipating more good things from a deal with Amazon, offering the service at a slightly reduced rate for Amazon Video subscribers. (Fandor’s   monthly fee is $10.) “That’s wonderful for us,” Ms Gendler said. “Any platform wants more growth. And we’re hungry to build our subscription base. ” I’d say the site deserves that.'"}, "time": 1742562455.9913306}