{"duration": 0.6087641716003418, "input_args": {"text": "'Before the United States permitted a terrifying way of interrogating prisoners, government lawyers and intelligence officials assured themselves of one crucial outcome. They knew that the methods inflicted on terrorism suspects would be painful, shocking and far beyond what the country had ever accepted. But none of it, they concluded, would cause long lasting psychological harm. Fifteen years later, it is clear they were wrong. Today in Slovakia, Hussein   describes permanent headaches and disturbed sleep, plagued by memories of dogs inside a blackened jail. In Kazakhstan, Lutfi bin Ali is haunted by nightmares of suffocating at the bottom of a well. In Libya, the radio from a passing car spurs rage in Majid Mokhtar Sasy   reminding him of the C. I. A. prison where earsplitting music was just one assault to his senses. And then there is the despair of men who say they are no longer themselves. “I am living this kind of depression,” said Younous Chekkouri, a Moroccan, who fears going outside because he sees faces in crowds as Guantánamo Bay guards. “I’m not normal anymore. ” After enduring agonizing treatment in secret C. I. A. prisons around the world or coercive practices at the military detention camp at Guantánamo Bay, Cuba, dozens of detainees developed persistent mental health problems, according to previously undisclosed medical records, government documents and interviews with former prisoners and military and civilian doctors. Some emerged with the same symptoms as American prisoners of war who were brutalized decades earlier by some of the world’s cruelest regimes. Those subjected to the tactics included victims of mistaken identity or flimsy evidence that the United States later disavowed. Others were foot soldiers for the Taliban or Al Qaeda who were later deemed to pose little threat. Some were hardened terrorists, including those accused of plotting the Sept. 11 attacks or the 2000 bombing of the American destroyer Cole. In several cases, their mental status has complicated the nation’s long effort to bring them to justice. Americans have long debated the legacy of  . 11 interrogation methods, asking whether they amounted to torture or succeeded in extracting intelligence. But even as President Obama continues transferring people from Guantánamo and Donald J. Trump, the Republican presidential nominee, promises to bring back techniques, now banned, such as waterboarding, the human toll has gone largely uncalculated. At least half of the 39 people who went through the C. I. A. ’s “enhanced interrogation” program, which included depriving them of sleep, dousing them with ice water, slamming them into walls and locking them in   boxes, have since shown psychiatric problems, The New York Times found. Some have been diagnosed with   stress disorder, paranoia, depression or psychosis. Hundreds more detainees moved through C. I. A. “black sites” or Guantánamo, where the military inflicted sensory deprivation, isolation, menacing with dogs and other tactics on men who now show serious damage. Nearly all have been released. “There is no question that these tactics were entirely inconsistent with our values as Americans, and their consequences present lasting challenges for us as a country and for the individuals involved,” said Ben Rhodes, the deputy national security adviser. The United States government has never studied the   psychological effects of the extraordinary interrogation practices it embraced. A Defense Department spokeswoman, asked about   mental harm, responded that prisoners were treated humanely and had access to excellent care. A C. I. A. spokesman declined to comment. This article is based on a broad sampling of cases and an examination of hundreds of documents, including court records, military commission transcripts and medical assessments. The Times interviewed more than 100 people, including former detainees in a dozen countries. A full accounting is all but impossible because many former prisoners never had access to outside doctors or lawyers, and any records about their interrogation treatment and health status remain classified. Researchers caution that it can be difficult to determine cause and effect with mental illness. Some prisoners of the C. I. A. and the military had underlying psychological problems that may have made them more susceptible to   difficulties others appeared to have been remarkably resilient. Incarceration, particularly the indefinite detention without charges that the United States devised, is inherently stressful. Still, outside medical consultants and former government officials said they saw a pattern connecting the harsh practices to psychiatric issues. Those treating prisoners at Guantánamo for mental health issues typically did not ask their patients what had happened during their questioning. Some physicians, though, saw evidence of mental harm almost immediately. “My staff was dealing with the consequences of the interrogations without knowing what was going on,” said Albert J. Shimkus, a retired Navy captain who served as the commanding officer of the Guantánamo hospital in the prison’s early years. Back then, still reeling from the Sept. 11 attacks, the government was desperate to stave off more. But Captain Shimkus now regrets not making more inquiries. “There was a conflict,” he said, “between our medical duty to our patients and our duty to the mission, as soldiers. ” After prisoners were released from American custody, some found neither help nor relief. Mohammed Abdullah Saleh   a businessman in Tanzania, and others were snatched, interrogated and imprisoned, then sent home without explanation. They returned to their families deeply scarred from interrogations, isolation and the shame of sexual taunts, forced nudity, aggressive body cavity searches and being kept in diapers. Mr. Asad, who died in May, was held for more than a year in several secret C. I. A. prisons. “Sometimes, between husband and wife, he would admit to how awful he felt,” his widow, Zahra Mohamed, wrote in a statement prepared for the African Commission on Human and Peoples’ Rights. “He was humiliated, and that feeling never went away. ” In a cold room once used for interrogations at Guantánamo, Stephen N. Xenakis, a former military psychiatrist, faced a onetime Qaeda child soldier, Omar Khadr. It was December 2008, and this evaluation had been two years in the making. The doctor, a retired brigadier general who had overseen several military hospitals, had not sought the assignment. The son of an Air Force combat veteran, he debated even accepting it. “I’m still a soldier,” General Xenakis recalls thinking. Was this good for the country? When he finally agreed, he told Mr. Khadr’s lawyers that they were paying for an independent medical opinion, not a hired gun. Mr. Khadr, a Canadian citizen, had been wounded and captured in a firefight at age 15 at a suspected terrorist compound in Afghanistan, where he said he had been sent to translate for foreign fighters by his father, a Qaeda member. Years later, he would plead guilty to war crimes, including throwing a grenade that killed an Army medic. At the time, though, he was the youngest prisoner at Guantánamo. He told his lawyers that the American soldiers had kept him from sleeping, spit in his face and threatened him with rape. In one meeting with the psychiatrist, Mr. Khadr, then 22, began to sweat and fan himself, despite the   chill. He tugged his shirt off, and General Xenakis realized that he was witnessing an anxiety attack. When it happened again, Mr. Khadr explained that he had once urinated during an interrogation and soldiers had dragged him through the mess. “This is the room where they used me as a human mop,” he said. General Xenakis had seen such anxiety before, decades earlier, as a young psychiatrist at Letterman Army Medical Center in California. It was often the first stop for American prisoners of war after they left Vietnam. The doctor recalled the men, who had endured horrific abuses, suffering panic attacks, headaches and psychotic episodes. That session with Mr. Khadr was the beginning of General Xenakis’s immersion into the treatment of detainees. He has reviewed medical and interrogation records of about 50 current and former prisoners and examined about 15 of the detainees, more than any other outside psychiatrist, colleagues say. General Xenakis found that Mr. Khadr had   stress disorder, a conclusion the military contested. Many of General Xenakis’s diagnoses in other cases remain classified or sealed by court order, but he said he consistently found links between harsh American interrogation methods and psychiatric disorders. Back home in Virginia, General Xenakis delved into research on the effects of abusive practices. He found decades of papers on the issue  —   science that had not been considered when the government began crafting new interrogation policies after Sept. 11. At the end of the Vietnam War, military doctors noticed that former prisoners of war developed psychiatric disorders far more often than other soldiers, an observation also made of former P. O. W.s from World War II and the Korean War. The data could not be explained by imprisonment alone, researchers found. Former soldiers who suffered torture or mistreatment were more likely than others to develop   problems. By the   the Veterans Administration had linked such treatment to memory loss, an exaggerated startle reflex, horrific nightmares, headaches and an inability to concentrate. Studies noted similar symptoms among torture survivors in South Africa, Turkey and Chile. Such research helped lay the groundwork for how American doctors now treat combat veterans. “In hindsight, that should have come to the fore” in the  . 11 interrogation debate, said John Rizzo, the C. I. A. ’s top lawyer at the time. “I don’t think the   effects were ever explored in any real depth. ” Instead, the government relied on data from a training program to resist enemy interrogators, called SERE, for Survival, Evasion, Resistance and Escape. The military concluded there was little evidence that disrupted sleep,   nudity and extreme temperatures harmed military trainees in controlled scenarios. Two veteran SERE psychologists, James Mitchell and Bruce Jessen, worked with the C. I. A. and the Pentagon to help develop interrogation tactics. They based their strategies in part on the theory of “learned helplessness,” a phrase coined by the American psychologist Martin E. P. Seligman in the late 1960s. He gave electric shocks to dogs and discovered that they stopped resisting once they learned they could not stop the shocks. If the United States could make men helpless, the thinking went, they would give up their secrets. In the end, Justice Department lawyers concluded that the methods did not constitute torture, which is illegal under American and international law. In a series of memos, they wrote that no evidence existed that “significant psychological harm of significant duration, e. g. lasting for months or even years” would result. With fear of another terrorist attack, there was little incentive or time to find contrary evidence, Mr. Rizzo said. “The government wanted a solution,” he recalled. “It wanted a path to get these guys to talk. ” The question of what ultimately happened to Dr. Seligman’s dogs never arose in the legal debate. They were strays, and once the studies were over, they were euthanized. Mohamed Ben Soud cannot say for certain when the Americans began using ice water to torment him. The C. I. A. prison in Afghanistan, known as the Salt Pit, was perpetually dark, so the days passed imperceptibly. The United States called the treatment “water dousing,” but the term belies the grisly details. Mr. Ben Soud, in court documents and interviews, described being forced onto a plastic tarp while naked, his hands shackled above his head. Sometimes he was hooded. One C. I. A. official poured buckets of ice water on him as others lifted the tarp’s corners, sending water splashing over him and causing a choking or drowning sensation. He said he endured the treatment multiple times. Mr. Ben Soud was among the early captives in the C. I. A. ’s network of prisons in Afghanistan, Thailand, Poland, Romania and Lithuania. Again and again, he said, he told the American interrogators that he was not their enemy. A Libyan, he said he had fled to Pakistan in 1991 and joined an armed Islamist movement aimed at toppling Col. Muammar  ’s dictatorship. Pakistani and United States officials stormed his home and arrested him in 2003. Under interrogation, he said, he denied knowing or fighting with Osama bin Laden or two senior Qaeda operatives. In 2004, the C. I. A. turned Mr. Ben Soud over to Libya, which imprisoned him until the United States helped topple the Qaddafi government seven years later. In interviews, he and other Libyans said they were treated better by Colonel Qaddafi’s jailers than by the C. I. A. Today, Mr. Ben Soud, 47, is a free man, but said he is in constant fear of tomorrow. He is racked with   and struggles to make simple decisions. His moods swing dramatically. “‘Dad, why did you suddenly get angry?’ ‘Why did you suddenly snap? ’” Mr. Ben Soud said his children ask. “‘Did we do anything that made you angry? ’” Explaining would mean saying that the Americans kept him shackled in painful contortions, or that they locked him in boxes  —   one the size of a coffin, the other even smaller, he said in a phone interview from his home in Misurata, Libya. They slammed him against the wall and chained him from the ceiling as the prison echoed with the sounds of rock music. “How can you explain such things to children?” he asked. Mr. Ben Soud, along with a second former C. I. A. prisoner and the estate of a third, is suing Dr. Mitchell and Dr. Jessen in federal court, accusing them of violating his rights by torturing him. In court documents, Dr. Mitchell and Dr. Jessen argue, among other things, that they played no role in the interrogations. Mr. Ben Soud was one of the men identified in a 2014 Senate Intelligence Committee report as having been subjected to the C. I. A. ’s “enhanced interrogation techniques. ” Condemning the methods as brutal and ineffective in extracting intelligence, the report noted that interrogators also used unapproved tactics such as mock executions, threats to harm prisoners’ children or rape their family members, and “rectal feeding,” which involved inserting liquid food supplements or purées into the rectum. Senate investigators did not set out to study the psychological consequences of the harsh treatment, but their unclassified summary revealed several cases of men suffering hallucinations, depression, paranoia and other symptoms. The full   classified report offers many more examples, said Daniel Jones, a former F. B. I. analyst who led the Senate investigation. “The records we reviewed clearly indicate a connection between their treatment in C. I. A. custody and their mental state,” Mr. Jones said in an interview. At least 119 men moved through the C. I. A. jails, where the interrogations were designed to disrupt the senses and increase helplessness  —   factors that researchers decades earlier had said could make people more susceptible to psychological harm. Forced nudity, sensory deprivation and endless light or dark were considered routine. Many of those men were later released without charges, unsure of why they were held. About one in four prisoners should never have been captured, or turned out to have been misidentified by the C. I. A. Senate investigators concluded. Khaled   a German citizen, is the best known case. Macedonian authorities arrested him while he was on vacation in December 2003 and turned him over to the C. I. A. Mr. Masri said officials beat him, stripped him, forced a suppository into him and flew him to a black site in Afghanistan. He was held for months, he said, in a concrete cell with no bed, and endured more beatings and interrogations. Years later, Mr. Masri’s nightmares are accompanied by a paralyzing tightness in his chest, he said. “I have been suffering from   amnesia, inability to memorize, depression, helplessness, apathy, loss of interest in the future, slow thinking, and anxiety,” Mr. Masri wrote in an email. Ms. Mohamed, the widow of Mr. Asad, the Tanzanian businessman, said he returned home paranoid and anxious. “He used to forget things that he never would have forgotten before,” she wrote recently. “For example, he would talk with someone on the phone and later forget to whom he had been talking. ” Mr. Asad believed the C. I. A. seized him because he once rented space in a building he owned to Al Haramain Foundation, a Saudi charity later linked to financing terrorism. Interrogators questioned him repeatedly about the charity, he said in legal papers, then released him with no explanation. “Mohammed’s personality changed after his detention,” his wife wrote. “Something tiny would happen and he would blow up  —   he would be so angry  —   I had never ever seen him like this before. At these times, he would come close to crying, and he would withdraw to be alone. ” Today at Guantánamo Bay, the Caribbean landscape is reclaiming the relics of the American detention system. Weeds overtake fences in abandoned areas of the prison complex. Guard towers sit empty. It is eerily quiet. President Obama banned coercive questioning on his second day in office and his administration has whittled the prison population to 61, down from nearly 700 at its peak. Interrogations ended long ago. Except for the     detainees, kept in a building hidden in the hills, most of the remaining prisoners share a concrete jail called Camp 6. Asked about their psychological   Rear Adm. Peter J. Clarke, the commander at Guantánamo, said in an interview: “What I observe are detainees who are well adjusted, and I see no indications of ill effects of anything that may have happened in the past. ” In the early years of Guantánamo, interrogators used variations on some of the C. I. A. ’s tactics. The result was a combination of psychological and physical pressure that the International Committee of the Red Cross found was “tantamount to torture. ” Capt. Richard Quattrone of the Navy, who left his post as the prison’s chief medical officer in September, said his staff mostly dealt with detainees’ anxiety over whether they would be released. “I’ve talked to some of my predecessors,” he said in an interview, “and from what they say, it’s vastly different today. ” About 20 detainees are cleared for release. Another 10 are being prosecuted or have already been convicted in military commissions. The fate of the remaining men, including some of the   prisoners, is unclear. For now they are considered too dangerous to release, but have not been charged. For some men who have been released, Guantánamo is not easily left behind. Mr. Chekkouri, a Moroccan living in Afghanistan in 2001, was held for years as a suspected member of a group linked to Al Qaeda. He said he was beaten repeatedly at a United States military jail in Kandahar and forced to watch soldiers do the same to his younger brother. Mr. Chekkouri is a Sufi, a member of a mystical Islamic sect that has been oppressed by Al Qaeda and others. At Guantánamo, he was kept in isolation. When he asserted his innocence, he said, interrogators threatened to turn him over to the Moroccan authorities, who have a history of torture. The Americans warned that his family in Morocco could be jailed and abused, he said, and showed him execution photos. Interrogators repeatedly made him believe his transfer was imminent, he said. “It’s time to say goodbye,” interrogation files cited in court documents say. “Morocco wants you back. ” After he was released last year, the United States gave him a letter saying it no longer stood by information that he was a member of a   group in Morocco. Despite diplomatic assurances that he would face no charges, Morocco jailed him for several months late last year and he continues to fight allegations that he thought were behind him. Now, he is under a psychiatrist’s care and takes antidepressants and   drugs. He complains of flashbacks, persistent nightmares and panic attacks. He also suffers an embarrassing inability to urinate until it becomes painful. It started, he said, when he was left chained for hours during interrogations and soiled himself. His doctors say there is nothing they can treat. “They tell me everything is normal,” he said. “Your brain is playing games. It is something mental. You’re still living in Gitmo. It’s fear. ” Mr. Chekkouri saw psychiatrists at Guantánamo, but he said he did not trust them. He and others believed the doctors shared information about medical problems with interrogators. In one case, a psychiatrist prescribed the antipsychotic medication olanzapine to a prisoner. He then suggested that interrogators exploit a side effect, food cravings, according to another military doctor who later reviewed the records. Normally, such information would be confidential, but Guantánamo’s dual missions of caring for prisoners and extracting information created conflicts. Over time, the military created two mental health teams. One, led by psychiatrists, was there to heal. The other, called the Behavioral Science Consultation Team, was led by psychologists with a very different mission. On Sept. 3, 2003, after a teenager named Mohammed Jawad was seen talking to a poster on the wall, an interrogator called for a consultation with a BSCT (pronounced “Biscuit”) psychologist. Mohammed’s age at the time is in dispute. The military says it captured him at 17 his lawyer says he was more likely 14 or younger. However old, he was pleading for his mother. When the psychologist arrived, the goal was not to ease the young man’s distress, but to exploit it. “The detainee comes across as a very immature, dependent individual, claiming to miss his mother and his young siblings, but his demeanor looks like it is a resistance technique,” the psychologist wrote, according to notes seen by The Times. “He tries to look as if he is so sad that he is depressed. During today’s interrogation, he appeared to be rather frightened, and it looks as if he could easily break. ” The psychologist, who was not identified in the notes, recommended that Mr. Jawad be kept away from anyone who spoke his language. “Make him as uncomfortable as possible,” the psychologist advised. “Work him as hard as possible. ” The guards placed him in isolation for 30 days. They then subjected him to the “frequent flier program,” a method of sleep deprivation. Guards yanked Mr. Jawad from cell to cell 112 times, waking him an average of every three hours, day and night, for two weeks straight, according to court records. After being held for years, Mr. Jawad was charged in 2007 with throwing a grenade that wounded American soldiers. But the evidence collapsed. The military prosecutor, Lt. Col. Darrel Vandeveld, withdrew from the case and declared that there was no evidence to justify charges. “There is, however, reliable evidence that he was badly mistreated by U. S. authorities, both in Afghanistan and at Guantánamo, and he has suffered, and continues to suffer, great psychological harm,” he wrote in a letter to the court. Katherine Porterfield, a New York University psychologist, found Mr. Jawad to have PTSD after examining him in 2009. Seven years after his capture, she said, he suffered from flashbacks and anxiety attacks. A panel of military doctors disagreed. Medical records from Guantánamo include repeated notes such as “no psych issues at this time,” or the prisoner “denied any psych problem. ” The military dropped all charges against Mr. Jawad, who is now living in Pakistan. He declined to discuss his mental health. But in a series of text messages, he wrote: “They tortured us in jails, gave us severe physical and mental pain, bombarded our villages, cities, mosques, schools. ” He added, “Of course we have” flashbacks, panic attacks and nightmares. It has been difficult to determine the scale of mental health problems at Guantánamo, much less how many cases are linked to the treatment the prisoners endured. Most medical records remain classified. Anecdotal accounts, though, have emerged over the years. Andy Davidson, a retired Navy captain who served as the chief psychologist treating prisoners at Guantánamo from July to October 2003, said most appeared to be in good health, but he still saw “an awful lot” of mental health issues there. “There were definitely guys who had PTSD symptoms,” he said in an interview. “There were definitely guys who had poor sleeping, nightmares. There were guys who were definitely shell shocked with a   stare. There were guys who were depressed, avoidant. ” One of the few official glimpses into the population came in a 2006 medical journal article. Two military psychologists and a psychiatrist at Guantánamo wrote that about 11 percent of detainees were then receiving mental health services, a rate lower than that in civilian jails or among former American prisoners of war. The authors acknowledged, however, that Guantánamo doctors faced significant challenges in diagnosing mental illness, most notably the difficulty in building trust. Many prisoners, including some with serious mental health conditions, refused evaluation and treatment, the study noted, which would have lowered the count. Five years later, General Xenakis and Vincent Iacopino, the medical director for Physicians for Human Rights, published research about nine prisoners who exhibited psychological symptoms after undergoing interrogation tactics  —   a hose forced into a mouth, a head held in a toilet, death threats  —   by American jailers. The two based their study on the medical records and interrogation files of the prisoners, all of whom had arrived at Guantánamo in its first year, had never been in C. I. A. custody, and were never charged with any crimes. In none of those cases, the study said, did Guantánamo doctors document any inquiries into whether the symptoms were tied to interrogation tactics. Today in Tangier, Morocco, Ahmed Errachidi runs two restaurants, has a wife and five children and has been free for nearly a decade. The United States military once asserted that he trained at a Qaeda camp in early 2001, but the human rights group Reprieve later produced pay stubs showing that he had been working at the time as a cook in London. Mr. Errachidi had a history of bipolar disorder before arriving at Guantánamo, and after being held in isolation there, he said, he suffered a psychotic breakdown. He told interrogators that he had been Bin Laden’s superior officer and warned that a giant snowball would overtake the world. Guantánamo still lurks around corners. Recently, at a market in Tangier, the clink of a chain caused a paralyzing flashback to the prison, where Mr. Errachidi was forced into painful stress positions, deprived of sleep and isolated. On chilly nights, when the blanket slips off, he is once again lying naked in a frigid cell, waiting for his next interrogation. “All I can think of is when are they going to take me back,” Mr. Errachidi said in an interview. He compared his treatment by the Americans to being mugged by a trusted friend. “It is very, very scary when you are tortured by someone who doesn’t believe in torture,” he said. “You lose faith in everything. ” Guantánamo, particularly during its early years, operated on a system of rewards and punishments to exploit prisoners’ vulnerabilities. That manipulation, taken to extremes, could have dangerous effects, as in the peculiar case of Tarek El Sawah. An Egyptian who said he was a Taliban soldier, Mr. Sawah was captured while fleeing bombing in Afghanistan in 2001 and turned over to the United States. He arrived at Guantánamo in May 2002. Though his brother, Jamal, said he had no history of mental problems, Mr. Sawah began shrieking at night, terrified by hallucinations. When he began defecating and urinating on himself, soldiers would hose him down in front of other detainees, a nearby prisoner stated in court documents. Mr. Sawah said he was given antipsychotic drugs, sometimes forcibly. After his breakdown, interrogators found Mr. Sawah eager to talk. “‘Bring me good things to eat,’” he told them. They delivered McDonald’s hamburgers or Subway sandwiches, multiple servings at a time. Mr. Sawah became a prized informant, though the value of what he offered is disputed, and he says he fabricated stories, including that he was a Qaeda member. He ballooned from about 215 pounds to well over 400 pounds, records show. When the interrogations ended and he was placed in a special hut for cooperators, the food kept coming. His jailers had to install a   door for him. Mr. Sawah called it a competition between the interrogators, who used food as an incentive, and the doctors, who told him to lose weight. He developed coronary artery disease, diabetes, breathing disorders and other health problems, court records show. In 2013, General Xenakis examined him and, in a plea for better medical treatment, told a judge that “Mr. El Sawah’s mental state has worsened and he appears apathetic with diminished will to live. ” The military responded that he was offered excellent medical care but refused it. Today in Bosnia, Mr. Sawah, 58, complains of frequent headaches and begs a doctor for antidepressants. His mood fluctuates wildly. Though he has lost weight, his eating remains compulsive. Over dinner with a reporter after a daily Ramadan fast, he ate a steak, French fries, a plate of dates and figs, a bowl of chicken soup, spinach pie, slices of bread, the uneaten portion of another steak, another bowl of soup, two lemonades, a Coke and nearly an entire cheese plate, six or seven slices at a time. “He’s unbalanced,” said his brother, who lives in New York. “He needs care. Mental care. Physical care. ” Mr. Sawah does not blame American soldiers for his treatment. “They were afraid of me, afraid for their life,” he said. “Guantánamo on both sides was just very scared people who want to live. ” In a   courtroom at Guantánamo Bay in January 2009, five men sat accused of plotting the Sept. 11 attacks. They were avowed enemies of the United States, who had admitted to grievous bloodshed. They had also been subjected to the most horrific of the government’s interrogation tactics. During a courtroom break, one of the men, Ammar   asked to speak with a doctor. Xavier Amador, a New York psychologist who was consulting for another defendant, met with him. As they talked, Mr. Baluchi’s eyes darted around the room, according to a summary of Dr. Amador’s notes obtained by The Times. Mr. Baluchi said he struggled to focus, described “terrifying anxiety” and reported difficulty sleeping. Dr. Amador noted that Mr. Baluchi seemed to meet the criteria for PTSD, anxiety disorder and major depression. “No one can live like this,” Mr. Baluchi told him. Mr. Baluchi, 39, was captured by Pakistani officers in April 2003. Though he was described as willing to talk, the C. I. A. moved him to a secret prison and immediately applied interrogation methods reserved for recalcitrant prisoners. In court documents and Mr. Baluchi’s handwritten letters, he described being naked and dehydrated, chained to the ceiling so only his toes touched the floor. He endured   dousing and said he was beaten until he saw flashes of light and lost consciousness. He recalls punches from his guards whenever he drifted asleep. Today, his lawyer said, Mr. Baluchi associates sleep with imminent pain. “Not only did they not let me sleep,” Mr. Baluchi wrote in a letter provided by the lawyer, “they trained me to keep myself awake. ” Guantánamo physicians have prescribed Mr. Baluchi antidepressants,   drugs and sleeping pills, according to his lawyer, James G. Connell III, who sends him deodorants and colognes to keep flashbacks at bay. “The whole time he was in C. I. A. custody, you’re sitting there, smelling your own stink,” Mr. Connell said. “Now, whenever he catches a whiff of his own body odor, it sets him off. ” General Xenakis, who is consulting on the case, found that Mr. Baluchi had PTSD and that he showed possible signs of a brain injury that may be linked to his beatings. He said Mr. Baluchi needed a brain scan, which the military opposes. The test would likely prompt more hearings, which could further complicate a trial. “Having caused these problems in the first place, now the United States has to deal with them at the military commissions,” Mr. Connell said. “And that takes time. ” The compromised mental status of several other prisoners, like Mr. Baluchi, has affected the military proceedings against them. Ramzi bin   who admits helping plan the Sept. 11 attacks, has said he believes the military is tormenting him with vibrations, smells and sounds at Guantánamo. Military doctors there have found him to be delusional, and records indicate that his symptoms began in C. I. A. custody, after brutal tactics and years of solitary confinement. But Mr. bin   refused to meet with doctors to assess his competency and insists he is sane, so the case continues. Lawyers have similarly raised questions about Abd  ’s psychological state. Accused in the U. S. S. Cole bombing, he was subjected to waterboarding, mock execution, rectal feeding and other techniques  —   some approved, some not  —   at C. I. A. sites. Even after internal warnings that Mr. Nashiri was about to go “over the edge psychologically,” the C. I. A. pressed forward. Over the years, government doctors have diagnosed Mr. Nashiri with anxiety, major depression and PTSD. His lawyers do not dispute his competency to stand trial, though no such trial is imminent. His torture and mental decline, though, could make it harder for prosecutors to win a death sentence. When the Walter Reed doctors evaluated Mr. Nashiri, “they concluded that he suffers from chronic, complex, untreated PTSD,” his lawyer told a military judge in 2014. “And they attributed it to his time in C. I. A. custody. ” In Libya today, a former C. I. A. prisoner named Salih Hadeeyah   struggles to focus, and his memory fails him. He finds himself confusing the names of his children. Sometimes, he withdraws from his family to be alone. A survivor of the C. I. A. interrogation in the Salt Pit, Mr. Daeiki says he was kept naked, humiliated and chained to the wall as loud music blared. Sleep is difficult now, but when it comes, his interrogators haunt him there. “Something is strangling me or I’m falling from high,” he said in an interview. “Or sometimes I see ghosts following me, chasing me. ” Last year, a video surfaced showing Colonel Qaddafi’s son, Saadi, being blindfolded and forced to listen to what sounded like the screams of other prisoners inside Al Hadba, a prison holding members of the former regime  —   Libya’s own   detainees. Someone beat the soles of his feet with a stick. As the scene unfolded, Mr. Daeiki appeared on the screen. The beating was a mistake, he later acknowledged, but he did nothing to stop it. The goal was to collect intelligence to prevent bloodshed, he said. He was an interrogator now.'"}, "time": 1742563366.7927668}