{"duration": 0.23767542839050293, "input_args": {"text": "'J.K. Rowling is best known for her magical world of Harry Potter, filled with ghostly Dementors, tricky house-elves, butter beer, and spells that enchant or dispel an opponent. Her spellbound books do not stop there. Rowling has written other books, which are geared toward adults, such as her crime novel, “The Cuckoo Calling,” currently being filmed for BBC adaptation. Rowling also wrote “The Casual Vacancy,” a drama novel that has already made its debut on the BBC network.\\nJ.K. Rowling’s Bookcase of Magic Rowling went on to expand her extraordinary world of magic with “Fantastic Beasts and Where to Find Them,” which is her next installment into a magical place young adults, children, and adults alike want to be in. The book was originally meant to be a textbook in the wizarding world of Hogwarts and centers around Newt Scamander.\\nIn the year 1926, he has completed a global excursion to find and document all of the world’s magical creatures. Unfortunately, after Scamander decides to make a brief stop in New York, he misplaces his magical case of fantastic beasts. (Yes, the world of magic has come to America.) He also meets a No-Maj named Jacob Kowalski, who discovers the world of magic after meeting Scamander and causes a bit of mischief.\\nThe immersive world of magic continues in Rowling’s “Quidditch Through the Ages.” Even though the book is not as magical as previous ones, it is still essential to the wizarding world. It is about Quidditch and was written by Kennilworthy Whisp, a renowned player of the sport. This book was read by Potter in the movie, “Harry Potter and the Sorcerer’s Stone.” Severus Snape caught him reading it outside the school, and makes a bogus rule that library books are no longer allowed outside the school, before he takes from Potter.\\nA Collection of Wizarding Tales for Children Who can forget Rowling’s collection of the popular wizarding fairy tales for children called, “The Tales of Beedle the Bard?” This book is featured in “Harry Potter and the Deathly Hallows.” Hermione Granger is bequeathed the book by Albus Dumbledore. It is a series of five stories:\\n“The Warlock’s Hairy Heart,” is a story about a young warlock who has been jilted by love and vows to never fall in love again. In order to do this, he uses The Dark Arts, which saddens his family. Consequently, servants start to whisper about him not having a wife. He decides he will find the most beautiful and talented woman to gain the envy of everyone. Soon, he meets a girl and invites her to dinner. She is fascinated and repulsed by him. She wants to know if he has a heart. The warlock shows her the crystal casket that holds his beating hairy heart. She then asks him to put the heart back in his chest, and he does so. However, his heart had been out of his body too long and developed savage tastes. It causes him to forcefully take her human heart. Unfortunately, he cannot magically remove the hairy heart from his chest, so he cuts it out with a knife. Thus, he and his love die, as he stands with both hearts in his hands. “The Wizard and the Hopping Pot,” is about an old man that is generous. He uses his pot to brew magical potions and antidotes for people in need. After his death, he leaves his son the pot. Unfortunately, he does not have his fathers virtues. Bitter from only receiving a pot, his son closes the door in the faces of those who need help. However, he feels awful for turning away those in need. Eventually, he starts to help the townspeople. “The Fountain of Fair Fortune,” is about a fountain, which a person can bathe in once a year. Doing so, helps that person gain answers to their problems. This is where three witches meet. Asha, who suffers from an incurable decease; Altheda, who is poor and powerless because she was robbed; and Amata is beside herself after her lover leaves her. On their journey to the fountain, they are joined by a knight named Sir Luckless, and they continue the journey together. Along the way, they face three challenges. The first is a giant worm who demands proof of pain. The second, a steep slope where they must bring the fruit of their labors. The third involves crossing a river, which requires them to pay with the treasures of their pasts. Amata passes all three challenges by using magic to withdrawl memories of her lover and dropping them into the water. Asha collapses at the fountain. Altheda saves her by brewing an invigorating potion, which also cures Asha of her disease. Altheda realizes she can use her skills to make money. Amata learns that removing the memory of her lover has removed her regrets. Thier need for the fountain was no more. Sir Luckless bathes in the water. After doing so, he falls at Amata’s feet and asks her to marry him. The moral of the story is the fountain never actually had magical powers. To solve one’s troubles in life, one must do so for themselves. “Babbitty Rabbitty and Her Cackling Stump,” is about a king who wants to keep all the magic for himself. In order to do so, he has to capture all the sorcerers in the kingdom. Then, he has to learn magic. He creates an army of witch hunters. Then calls for an instructor of magic. Unbeknownst to him, the instructor is a charlatan. The instructor is called to perform, with the king, in front of people. He is told if he cannot so this, he will be beheaded. The charlatan blackmails Babbitty, who is magical, into helping him. The charlatan is asked, by a brigade captain, to bring his dog back to life. Babbitty, however, is unable to fulfill the request and is exposed by the charlatan. “The Tale of the Three Brothers,” is about brothers traveling together. Upon their journey, they reach a treacherous river. To cross it, they make a magical bridge. Halfway across they meet Death, who is angry from the loss of the three potential victims. Death tricks them into believing he is impressed with them and grants them three wishes. The oldest brother asks for an unbeatable dueling wand, known as the Elder Wand. The middle brother requests the ability to resurrect the dead and is given the Resurrection Stone. The youngest does not trust Death, so he asks Death to stop following him. With reluctance, Death hands him his Cloak of Invisibility. The brothers leave, in different directions. The oldest brags about the powerful wand he possesses and is murdered in his sleep. The middle brother brings back his lover, who died before they could marry. Regretably, she is not herself and is full of sadness. Inevitably, the brother kills himself to be with his beloved. The youngest brother can not be found by Death, due to the cloak he hides under. After many years of evading Death, he decides to take the cloak off and give it to his son. Pleased with all he has achieved, he willfully greets Death, and they leave together as equals. The Magical and Interactive World of Pottermore Rowling launched Pottermore, in April of 2012. In the immersive world, players can enter Hogwarts as though they are students, acceptance letter and all. Just like the books and movies, players are sorted into a house, before they can go any further. A series of questions are asked by the Sorting Hat. Then, players are placed into, Slytherin, Hufflepuff, Gryffindor, or Raven Claw. Once a house has been selected, the player must go virtual shopping to obtain the items on the list, in the acceptance letter. First years must bring:\\nA Uniform:\\nThree sets of plain black robes. \\nOne pointed black hat, for day wear.\\nOne pair of protective gloves.\\nOne black winter cloak.\\nAll clothing must adorn name tags. Books:\\n“The Standard Book of Spells,” grade 1, by Miranda Goshawk.\\n“A History of Magic,” by Bathilda Bagshot.\\n“Magical Theory,” by Adalbert Waffling.\\n“A beginner’s Guide toTransfigurationn,” by Emeric Switch.\\n“One Thousand Magical Herbs and Fungi,” by Phyllida Spore.\\n“Magical Drafts and Potions,” by Aresnius Jigger.\\n“Fantastic Beasts and Where to Find Them,” by Newt Scamander.\\n“The Dark Forces: A Guide to Self-Protection,” by Quentin Trimble. Other equipment:\\n1 Wand\\na pewter, size 2, Cauldron\\na set of glass or crystal vials\\n1 telescope\\n1 set of brass scales\\nStudents can also bring an owl, cat or toad. After obtaining what is needed for classes, players were able to attend a potions class, duel with other students in the great hall, and interact in the common rooms. The journey also gives players exclusive information, not previously revealed by Rowling, that includes over 18,000 words of additional content.\\nHowever, as of 2015, players on the website were shut out, so it could be overhauled. Unfortunately, most of the fun features were removed. Now, the site is for informational purposes and interaction with class peers. However, visitors are still sorted into houses and matched with a wand.\\nThe Magical Giving Side of J.K. Rowling Rowling dropped off the Forbes billionaire list in 2012, for two reasons; she donated an estimated $160 million to charity and Britain’s high tax rates. Moreover, Rowling’s reputation for bestowing her wealth is insurmountable and causes fans to wonder why she has given so much of her earnings to those in need. Her answer was simple and heartfelt:\\nI think you have a moral responsibility when you’ve been given far more than you need, to do wise things with it and give intelligently.\\nRowling donated to the Multiple Sclerosis Society, the Children’s High-Level Group, now known as Lumos, after the spell of light from her Harry Potter series. She has also helped finance the building of a regenerative neurology clinic, in Scotland. These are a few charities Rowling has helped financially.\\nThrough her books, Rowling brought magical beings and creatures to the imaginations of children and adults, which in turn, allowed her to bring help to those in need through the proceeds. She is the light of inspiration to all of those around her.\\nBy Tracy Blake\\nSources:\\nPottermore: Pottermore\\nMirror: Filming begins on J.K. Rowling’s crime novel The Cuckoo Calling for BBC adaptation\\nIMDb: J.K. Rowling\\nFandom: Supply List\\nSnopes.com: A popular Internet meme says ‘Harry Potter’ author J.K. Rowling dropped off the Forbes billionaires list because she gave so much money to charity.\\nFeatured and   Jeff Krause’ Flickr Page – Creative Commons License\\nFirst Inline Image Courtesy of groundpig.geo’s Flickr Page – Creative Common License\\nSecond Inline Image Courtesy of pammielou’s Flickr Page – Creative Commons License\\nThird Inline Image Courtesy of until_fullmoon’s Flickr Page – Creative Commons License    Fantastic Beasts , Harry Potter , rowling , spot'"}, "time": 1742563331.8495986}