{"duration": 0.21756291389465332, "input_args": {"text": "'Old masters, new world. At Christie’s over the last few weeks, two experts in old master paintings and drawings quietly left the auction house. Their departures followed a year of spotty sales, in which the values of works by old masters  —   a pantheon of European painters working before around 1800  —   fell by 33 percent, according to the 2016 Tefaf Art Market Report. At a time when contemporary art is all the rage among collectors, viewers and donors, many experts are questioning whether old master artwork  —   once the most coveted  —   can stay relevant at auction houses, galleries and museums. Having struggled with shrinking inventory and elusive profits, auction houses appear to be devoting most of their attention and resources to contemporary art, the most popular area of their business. “They want to be associated with the new and the now,” said Edward Dolman, chairman and chief executive of Phillips auction house, who spent much of his career at Christie’s chasing works by old masters but now focuses on contemporary art. “We have no intention of selling old masters pictures or     pictures, because these markets are now so small and dwindling,” he added. “The new client base at the auction houses  —   and the collecting tastes of those clients  —   have moved away from this veneration of the past. ” A shortage of old master treasures, fewer    old master specialists and public attention on the   pictures (which are in the contemporary market) are partly responsible for the shift in emphasis. The London dealer Guy Sainty, who has long specialized in old masters, said that he is mystified and frustrated. “I’ve been an art dealer for nearly 40 years, and I just don’t get it  —   I don’t understand where the collectors have gone, the people with knowledge,” he said. ”There’s a sense somewhere that the American collector has simply lost interest in European culture. ” The old masters category generally denotes the period after the Renaissance and mostly describes European artists  —   including Leonardo da Vinci, Raphael, Goya and El Greco  —   who were known for their highly detailed, realistic paintings and drawings, along with the floral still lifes of Flemishmasters like Jan Brueghel the Elder. To be sure, there is still a public appetite for viewing old masters. The Metropolitan Museum of Art’s show “Vigée Le Brun: Woman Artist in Revolutionary France,” for example, drew more than 165, 000 visitors. The Getty and the Frick Collection, which focus on historic works, say attendance remains strong. When prime masterworks do come up for auction, they perform well, as evidenced by the $58 million paid in July for Peter Paul Rubens’s “Lot and His Daughters” at Christie’s London’s old masters sale, the   expensive work ever sold at auction by the artist. But masterpieces surface only rarely private owners tend to hold onto them, as do museums. “It’s a real supply problem,” Mr. Dolman said. An appreciation for old masters, experts say, also requires a deeper history of collecting and an educated eye. Christie’s, for example, trains its old master specialists for six to seven years, whereas its contemporary experts get three to four years. And new collectors tend to find contemporary art more accessible. “People who buy into the old master field have more connoisseurship  —   maybe more passion,” said Christophe Van de Weghe, a Madison Avenue dealer specializing in   work by modern masters from Matisse to Basquiat. Some attribute the increasing interest in contemporary art to the rising popularity of contemporary architecture. “People who come into the contemporary field like colors that go well with their couches,” Mr. Van de Weghe said. “All these new buildings  —   with high ceilings, big windows,” he added, “they scream for contemporary art. ” Old master curators are also increasingly hard to come by. In university art history programs in the United States, contemporary art is “by far, the most popular,” reports Richard Meyer, an art history professor at Stanford University, in his book “What Was Contemporary Art?” (MIT Press, 2013). “We’re losing a sense of the value of the past, including the value of past art,” Mr. Meyer said in an interview, “not just the aesthetic value, but the ways in which it can teach us about the cultures and the people who came before us. ” To fill curatorial positions, museums are having to look to Europe. The Getty, for example, recently hired Davide Gasparotto  —   the former director of the Galleria Estense in Modena, Italy  —   as its senior curator of paintings. “You can’t find curators with the right training and knowledge of European art in American art graduate programs anymore,” Mr. Sainty said. “They want to do contemporary art. ” While acknowledging that the old masters market can be “very spiky,” Alexander Bell, the worldwide   of Sotheby’s old master paintings department, said: “We still very much believe in old masters,” adding that “we’ve all got to evolve in the way we present our material and engage with our clients. ” The art world is making adjustments, juxtaposing old masters alongside contemporary artists in exhibitions, galleries, art fairs and auction sales. The Metropolitan Museum of Art is planning a $600 million wing for contemporary and modern art in March, it filled its temporary satellite, the Met Breuer, with unfinished works from the 15th century to the present, presenting Renaissance masters like Titian and Rembrandt alongside contemporary artists like Brice Marden and Kerry James Marshall. Last year, the museum started an online series called “The Artist Project,” in which contemporary artists talk about historical works at the Met that inspired them  —   like John Currin on Ludovico Carracci’s 1582 oil on canvas, “The Lamentation. ” “When you hear contemporary artists talking with passion about the genius of old masters  —   that, we assume, will help open up the historical fields to new audiences,” Thomas P. Campbell, the director and chief executive of the Met, said, “to understand that all art was once contemporary. ” Similarly, the Art Institute of Chicago’s recent show of old master portrait prints explored how artists like van Dyck influenced contemporary artists like Chuck Close. “We brought printmaking into the present,” said James Rondeau, the museum’s president and director. This mixing of genres has been prominently tested at Christie’s themed sales, which include works from many different time periods. “Perhaps they would rather put their resources into other, potentially more profitable departments,” said Nicholas Hall, the former   of old master paintings at Christie’s, who left in July, along with Benjamin Peronnet, Christie’s head of old master and   drawings. While the Frick is eager to reach today’s audience, the museum is also wary of straying from its mission of showing classic European art and sculpture. “A lot of museums are focused on a false dichotomy  —   if they get young people in through contemporary exhibitions they’ll stay and get interested in old masters,” said Ian Wardropper, the Frick’s director. “I just don’t believe it. The point is to try to reach them in an intelligent way on their own terms and make it interesting  —   and that’s not easy we’re all struggling with that. ” In light of these developments, old masters have become a collecting opportunity. Printings and engravings can go for $4, 000 to $5, 000. While Orazio Gentileschi’s   “Danae” sold at Sotheby’s in January for $30. 5 million, “that is less than a Christopher Wool and half the price of a Warhol,” Mr. Sainty said. “You can buy a really good Rembrandt for $40 to $50 million. That’s not a lot of money when you think about how many Rembrandts there are  —   and how many Jeff Koons. ” Even as the collecting world continues to obsess over contemporary art, there are bargains to be had in the category of old masters, both at auction and in galleries, particularly if you’d be happy with a print or engraving. A few examples follow of old master works, currently  —   or coming up  —   for sale. Sotheby’s Prints  Multiples Sale in London, Sept. 27 Pieter van der Heyden, “Nemo Non: Everyman Looks for His Own Profit,” Engraving, circa 1558, £ £6, 000 ($5, 000 to $8, 000) Jacopo de’ Barbari, “Victory Reclining Amid Trophies,” Engraving, circa 1498, £ £4, 000 ($ $5, 200)   Desprez, “La Chimère de Monsieur Desprez,” Etching, circa   £ £30, 000 ($26, 000 to $39, 000) Nicoletto da Modena, “Ornament Panel With Bound Slaves and a Birdcage,” Engraving, late 15th century to early 16th century, £ £4, 000 ($3, 900 to $5, 200) Jusepe de Ribera, “The Poet,” Etching, circa   £ £8, 000 ($7, 800 to $10, 500) George Stubbs, “A Sleeping Cheetah,” Mezzotint, 1788, £ £5, 000 ($3, 900 to $6, 500) Sotheby’s Exhibition, “Glazed: A Legacy of The Della Robbia,” New York, Oct. 21  —   Nov. 12, $100, 000 to $3 million Marco (Fra Mattia) della Robbia, “Coat of Arms of the Bonsi della Ruota Family” Giovanni della Robbia, Decorative amphora vase with dolphin handles, circa   Andrea della Robbia, “The Annunciate Virgin,” circa   Andrea della Robbiam “Two Sleeping Soldiers From a Lunette Representing the Resurrection,” circa   An artist known as the Master of the David and Saint John Statuettes and Giovanni della Robbia, “Saint Michael the Archangel,” circa   Sotheby’s Old Master Paintings, Jan. 2017 Ridolfo del Ghirlandaio, “The Holy Family With the Annunciation to the Shepherds Beyond, Italian Renaissance” oil on panel, circa 1500, $ $120, 000 Christie’s Old Master Paintings sale, Oct. 26 in New York Jan Brueghel the Elder and Hans Rottenhammer I, “Winter Landscape,” oil on copper, $ $250, 000   Pater, “Soldiers and Vivandières Around a Campfire,” oil on canvas, $ $150, 000 Ippolito Caffi, “The Grand Canal, Venice,” oil on canvas, $ $90, 000 Stair Sainty Gallery in London Elizabeth Louise Vigée Lebrun, “Portrait of Countess Yekaterina Skavronskaia,” oil on canvas, 1790, $660, 000 Jean Baptiste Greuze, “L’Attention,” oil on canvas, 1780, $80, 000 Pierre Subleyras, “The Duke of Saint Aignan Investing Girolamo Vaini, Prince of Cantalupe and Duke of Selci, With the Insignia of a Knight of the Holy Spirit,” oil on canvas, 1737, $350, 000 Pierre   two landscape paintings, each titled “View of Corsica,” $15, 000 and $20, 000 Pierre   “Salomé,” four paintings, three on canvas, one on wood, priced individually, $45, 000, $55, 000, $65, 000 and $85, 000. Albert   “Barges on the Seine,” oil on canvas,   $48, 000 Simon Dickinson Gallery in London Jakob Marrel, “Roses, Tulips, Iris,” oil on panel, 1644, $500, 000 Pier Leone Ghezzi, “Susannah and the Elders,” oil on canvas, late   1730s, £330, 000 ($434, 500) Jan Brueghel the Elder, “Landscape,” oil on copper, 1606, $591, 000 Francesco Zuccarelli, “View of the River Thames From Richmond Hill,” oil on canvas, 1752, $525, 000'"}, "time": 1742562309.4756072}