{"duration": 0.06282687187194824, "input_args": {"text": "'Former U. N. Ambassador John Bolton joined SiriusXM host Alex Marlow live from the Conservative Political Action Conference (CPAC) on Thursday’s Breitbart News Daily. [“I’ve had the privilege to speak at CPAC for as long as I can remember,” said Bolton. “What I consistently try to talk about is the importance of a conservative foreign policy, through the vagaries of elections. The last eight years, I’ve been able to describe what’s wrong with Obama, which is very difficult in the time allotted for the main floor speeches. ”   “This year, obviously, I’ll be following both Vice President Pence, who will be there tonight, and President Trump himself will be there tomorrow morning. So what I’m going to try and do is lay out some of the principles I think we have to continue to operate on  —   whatever people on the Hill say, whatever people in the executive branch say,” he declared.  “One of the bedrock principles of conservatism  —   and I think they start with the belief in American exceptionalism and the notion that our national security policy has to be based on American interests. I just think it’s important to keep focused, and although I’m not in the Trump administration, I will be doing whatever I can from the outside to try and keep their attention focused as the days go forward,” he said. Marlow asked why a foreign policy that puts America first is so widely seen as a “revolutionary idea. ” “It’s because the establishment doesn’t see it that way,” Bolton replied. “You can already, in the mainstream media commentary about the president’s emerging team and the direction he’s going in, some of the themes that show how the press, the mainstream press in Washington, tries to manipulate new Republican administrations. ” “They’re filled with commentary about how wonderful it is that many of the president’s appointments are   and technocratic and perhaps most important of all, not controversial  —   meaning that the New York Times and the Washington Post are prepared to give him a pass,” Bolton said. “Look, it’s very early days, and this is not necessarily a reflection of the truth about these individuals. It’s a reflection of how the Washington echo chamber is trying to mold them, to get them to seek the approval of their   betters who write editorials on the pages of the New York Times and the Washington Post. ” “If they can avoid succumbing to that siren song, they’ll do fine,” he advised. “But what the media and the Democrats are trying to do now is convince them: ‘You don’t want to be controversial. You don’t want to be ideological. Things are just fine. Be a technocrat. Tinker around the edges. Don’t change much.’ That’s not what Donald Trump got elected to do. That’s the fight really on the national security front, I think, for the soul of the administration. ” Marlow confessed he had been quietly rooting for Bolton to become national security adviser, prompting Bolton to humorously observe that he might have gotten the job if Marlow had only been less quiet about supporting him.  “What do you think of McMaster?” Marlow asked, referring to General H. R. McMaster, who was named national security adviser this week. “His book, Dereliction of Duty, is something, really, that anybody concerned about either the Vietnam war or   relations in the United States ought to read. It’s absolutely ” Bolton replied. “I think he’s demonstrated that he’s a man of great personal courage, and he’s an original thinker. I hope that he’ll be able to demonstrate those qualities. You know, it’s an uphill struggle when you’re still on active duty, which he is. I wish him all the best. I hope he does well. I’m happy to help out, whatever way I can, from the outside. ”  “Let’s hope he can help coordinate the various departments and agencies that do national security. It sounds kind of boring and bureaucratic, but I tell you, it can be fatal to an administration  —   again, especially a Republican administration  —   if it doesn’t speak with one voice,” Bolton said. John Bolton is a senior fellow at the American Enterprise Institute and presides over his own political action committee, BoltonPAC. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742562188.3588777}