{"duration": 0.047495126724243164, "input_args": {"text": "'Libertarian Candidate Endorses Hillary By Daily Bell Staff - November 02, 2016 \\n‘I fear for the country’ if Trump wins, Bill Weld tells Rachel Maddow … Libertarian vice presidential candidate William Weld said the country will be in “chaos” if Donald Trump wins the presidency and praised Hillary Clinton during an interview with MSNBC’s Rachel Maddow Tuesday. – USA Today \\nBill Weld is hardly a libertarian. His informal endorsement of Hillary Clinton shows this clearly. \\nOf course it is hard to say what a “libertarian” is, but it certainly isn’t someone who has supported gun control and is a member of the Council on Foreign Relations. \\nWeld has … and is. \\nHe comes from one of the oldest families in America, is a Harvard graduate like many in his family and former governor of Massachusetts. \\nSome of his career was spent with the federal justice system where he sent numerous “white collar criminals” to jail. \\nWhy is he the vice presidential candidate of the Libertarian Party? \\nThat’s hard to say. More: \\nThe former Massachusetts governor conceded that a realistic goal for the Libertarian Party in this election would be to win 5% of the popular vote and while he didn’t call for Libertarian voters in swing states to vote for Clinton, he made it clear that he strongly opposes Donald Trump. \\n“I see a big difference between the R candidate and the D candidate and I’ve been at some pains to say that I fear for the country if Mr. Trump should be elected,” Weld said. “It’s a candidacy without any parallel that I can recall. It’s content-free and very much given to stirring up envy and resentment and even hatred. \\nWeld also said he believes Trump is “psychologically” unstable, a bully and incapable of “competently managing the office of the presidency.” \\nThe article points out that Weld’s criticism of Trump is in contrast to the “kind words” he had for Hillary. It also informs us that Libertarian presidential candidate. Gary Johnson, has criticized both mainstream candidates. \\nWeld is not so even-handed. The article quotes him as saying that he knows Hillary well, has worked with her professionally and believes her to be a “person of high moral character.” \\nHe also said she is “reliable” and “an honest person.” He even predicted “chaos” if Trump were elected and said that the continued investigation into Hillary’s emails was just a distraction from more important issues. \\nJust from the public record alone, Weld’s comments on Hillary don’t seem accurate. It seems fairly obvious that Hillary and Bill Clinton have presided over a “pay-to-play” program that funnels donations to the Clinton Foundation in return for political favors they are able to grant or initiate. \\nMeanwhile, the Council on Foreign Relations is evidently America’s most prominent globalist think tank. Weld’s membership certainly implies that he supports a borderless world managed by a technocratic elite using monopoly central banking and global corporatism. \\nLibertarianism certainly implies decentralized power and a lack of a guiding elite, which would seem to be the opposite of what the Council on Foreign Relations obviously endorses. \\nWeld’s presence on the Libertarian ticket is surely more evidence of the meaninglessness of political parties in an era of increase internationalism and high-level homogeneity. \\nInterestingly, while political parties have been neutered from the top down, Trump’s candidacy suggests that there is much different approach among voters who actually have to support these parties. \\nConclusion: Political leadership in modern Western societies usually also doesn’t change much, and Weld’s presence on the Libertarian ticket is testimony to that. However, the current contentiousness in both Britain and America indicate that a change is occurring, though it certainly won’t come from Weld or Hillary. It is not necessarily political change, as it is taking place on a personal level. But over time that will make it even more powerful.'"}, "time": 1742628513.4924836}