{"duration": 1.6844568252563477, "input_args": {"text": "'Norbert Schemansky, one of the world’s greatest weight lifters and the first to win medals in four Olympic Games, all while scraping to make a living in a hometown, Dearborn, Mich. that more than 60 years ago greeted his achievements with a shrug, died on Tuesday at his home there. He was 92. The   Funeral Home in Dearborn confirmed his death. Schemansky competed across four decades, winning competitions, breaking records and, with his   heaves, leaving spectators in awe. A bear of a man with a mild countenance, he could be instantly picked out of a bevy of musclemen in tights by his signature   eyeglasses, as if Superman had shown up still wearing Clark Kent’s. But there was no disguising his prowess. “Norbert Schemansky is the greatest and strongest athlete I have ever seen,” his Cold War rival and fellow Olympian Yuri Vlasov of Ukraine was quoted as saying. Schemansky himself said, “One time I figured it out, and I’d lifted enough weight to lift the Queen Mary. ” At just under six feet tall and weighing 265 pounds or so, Schemansky had   thighs, wrists like    and, by all accounts, steel in his sinews since childhood. The Detroit Free Press called him “born strong. ” At 11 years old he had gotten a job at a Detroit market unloading   bags of potatoes. He began his Olympic run in 1948 in London, where he won the silver medal in the super heavyweight class. In 1952, in Helsinki, he won the gold in the   class. He missed the 1956 Games, in Melbourne, Australia, while recovering from two back operations to repair damaged disks. But the injuries did not deter him. He returned to the Olympics in 1960, in Rome, to win the bronze as a superheavyweight, and then in 1964, in Tokyo, to bring home the bronze again. In between, he was winning world and national championships and breaking records. In 1964 he became the first man ever to lift a total of 1, 200 pounds: 400 with the press (no longer used in competition) 355 with the snatch and 445 with the clean and jerk. He later exceeded that total, lifting 415, 363 ¾ and 445 (totaling 1, 223 ¾ pounds). An international poll in 1954 ranked him as the fifth greatest athlete in the world. “What Muhammad Ali and Joe Louis are to boxing, what John Grimek and Arnold Schwarzenegger mean to bodybuilding, and what Gordie Howe and Wayne Gretzky represent in hockey, Norbert Schemansky is to Olympic weight lifting,” Richard Bak wrote in his 2007 biography of Schemansky, “Mr. Weightlifting. ” Yet for all his success, Schemansky was consigned to stardom in a sport that drew little notice in the United States. Even his hometown, Dearborn, seemed indifferent, particularly before and after the 1952 Games. “I was working at Briggs Manufacturing, and I asked for time off,” Schemansky told The Detroit News in 2002, “and one of the guys from downstairs said: ‘Give him all the time off he wants. Fire him. ’” Schemansky quit, went to Helsinki and won the gold medal. When he returned home, a gold medal in his bag, no one was there to greet him. Only an airport porter recognized him. “The bus porter said, ‘Nice going, Semansky,’” he recalled. “He mispronounced my name, but he knew who I was. ” Schemansky took a bus home alone. It was not an unfamiliar experience. As he told Strength  Health magazine in 1973, “The worst part of competing was coming home. ” Norbert Schemansky was born in Detroit on May 30, 1924, and grew up there, one of four brothers. He started lifting at 15 with an older brother, a national junior champion, and training in a converted   garage. In high school he was a    . In World War II he fought in the Battle of the Bulge. While competing across the country and abroad, he took mostly menial jobs  —   one was cleaning latrines  —   despite a reported I. Q. of 132. Sometimes he was out of a job or took unpaid leave just so he could compete. His straitened circumstances dismayed the sportswriter Mark Kram, who in a sympathetic 1966 profile in Sports Illustrated expressed incredulity that Schemansky had not earned more than $3, 000 in any of the previous eight years, a time when he and his wife, Bernice, were rearing four children and scratching to make payments on their house. “How can it be,” Kram wrote, “that a man who has won respect for himself and prestige for his country clings to the shadowy periphery of life, is a nonperson without status or function and one whose wife for most of the last 20 years has, in effect, supported his participation for the U. S. with an $   job?” Schemansky said he had to work because there were no endorsements in his day and no money for athletes. “Not a penny,” he said in 2002, adding, “If I was competing now, I’d be a millionaire. ” The Soviet news agency Tass was quick to recognize Schemansky’s plight as a useful propaganda tool when he and Vlasov met in front of 8, 000 fans in Budapest in 1962 in what was billed as the “heavyweight match of the century. ” After Schemansky beat Vlasov in the press and the snatch but lost the match on total points (his ankle collapsed on the final lift) Tass made ideological hay, declaring that “the story of Schemansky” illustrated “the attitude toward man in a capitalistic world. ” Schemansky retired from competition in 1972 after 26 years of lifting and became a civil engineer for the city of Dearborn, which named a park after him in 1996. He was elected to the National Weightlifting Hall of Fame, the National   Sports Hall of Fame and the Michigan Sports Hall of Fame. His wife died in 1996. He is survived by three daughters, Paula Sperka, Pamela Petro and Laura Rowe a son, Larry 10 grandchildren and 16  . Schemansky could be ambivalent about the fame and fortune that never accrued to him in any great measure. “Norb himself is an anomaly, a man of contradiction,” Strength  Health magazine observed in 1973. “He appears to disdain recognition, yet he feels he should have it for what he has done. ”   years later, his attitude remained the same. “I always thought something good would come out of it,” he said of his career, in an interview with The Detroit Free Press, “but nothing ever did. I thought it would help me get a better job. When I worked for Stroh’s Brewery, I asked for a salesman’s job. They said, ‘We’re not hiring athletes.’ Then, a couple of months later, I find out they hired a football player. You give up so much. Yeah, sometimes I wonder why I did it. ”'"}, "time": 1742562911.642492}