{"duration": 0.13724255561828613, "input_args": {"text": "'Posted on October 26, 2016 by Admin \\nBy Vekar \\nOne thing I have yet to see anyone bring up is how this “election” could be bait and switch at the last minute. In order to understand this however I need to explain the unique possibilities the NWO has created with these two “candidates” and how this is in fact a very old card from the 1900’s. \\nFirst we have Trump, everyone loves Trump because Trump is not Hillary, therefore he must be better, it is an argument based on the following: Stalin killed 47 million and one while Mao killed 47 million and TWO so Stalin is better than Mao! Trump is outright the “let’s go back to sleep” candidate, Hillary is not. Already I have seen and heard more than enough about how if only Trump goes in then at least four more years have been bought and the nation will survive juts four more years. \\nFrom the so called “militia” and “patriots” at AWRM and the “Intelligence” Report they yammer that if only Trump goes in then we can POSTPONE the coming war or buy ourselves more time to prepare, after all, they claim “time favors us not the enemy.” All this bearing in mind that Trump has gone back on his word many times, changed his mind, flip flopped on illegals, wants a bigger police state, is the most hated in the media, etc. Now let’s compare the next runner up quickly. \\nHillary, it is currently chic to hate Hillary, you’re not in style if you like her, she will end the nation, doom the world and so on. Never mind that both Trump and Hillary were put up by the NWO, you are not allowed to run otherwise, this is old news. She is going to cause more war, she is a liar, cheat, she betrayed the nation, etc. Yet both her and Trump met with Netanyahu behind closed doors and apparently received his blessing to proceed, it is a trap and we should all know it and see it clearly. She is also the darling of the media. \\nBoth of them have in common the 1900’s rise to power theme of Lenin and Hitler, both take after these two for both nations (Germany and Russia) were in collapse or outright collapsed, debauchery was the rule as well as corruption. Hillary is like Lenin, she is going in red banners flying and the Cheka on her heels to remove any “undesirables.” She is going to finish the job and push the agenda to the hilt even if it takes war to do it. Trump on the other hand is following Hitlers script, offering hope without promising anything except a bigger government, more powerful police state, etc. Trump will also see the plan to fruition but there is a subtle nuance between these two: one is offering to do it with an iron fist in a velvet glove the other is simply the iron fist. \\nNow comes the problem people are not seeing: if they force Hillary in despite all the public outrage then we know for a fact they have reached a level of preparation that is adequate to dealing with public backlash, even insurrection should it be minor or full. If they put Trump in then they are taking the back street approach because they have not gathered the resources yet to put us down and need to put someone in who will quiet the public just like Obama did for a time. This election is about purchasing time; nothing more, nothing less. \\nIf Trump is put in then already we can see that most are going straight back to bed and not getting up for another four years at minimum, maybe eight. The militias and other “patriot” groups will declare a “partial victory” and that they can bury their guns again and whistle Dixie. They are mortified of having to take action so Trump is their obvious choice. Hillary on the other hand represents that steamroller coming down the hill at full tilt, they do not want that and seek to avoid it rather than fight it. The reality is time does NOT favor us here, time favors the enemy. If time favored us then we would not be here, diminished and in dire straits. Imagine how much could have been avoided had the militia stood up during Waco, again time favored the enemy. Ruby Ridge? Time favored the enemy as they whittle away and build their power base up bit by bit. They are not fools. \\nConsider those two possibilities then consider this: If Trump goes in and goes along with the “war with Russia” if indeed that is the plan for WW3 they laid out more than SIXITY years ago admittedly, people are FAR more willing to join Trumps army and go fight than they would Hillary. Something else to consider is perhaps they want a second civil war. Put Hillary in KNOWING it will cause an insurrection, fake one which we know they can do… Have Trump “reluctantly” take the reins and like Davis lead the way in marching the fools single file into the enemy guns just like the first one causing mass casualties for nothing. A second civil war of this sort would favor the enemy for it would absolutely end the nation, but who would fight for Hillary? Oh right, THAT’S why they are bringing in all those foreigners and foreign troops! Just change the uniform quickly and voila! Some would suggest this would favor the American Nationals… Not really, rather than fight intelligently for the Bill of Rights they would be fighting for TRUMP! They would be fighting to bleed us dry like the Confederates did in the civil war fighting “by the rules” and it cost them dearly. Only by fighting by OUR OWN RULES can we win, Trump would allow them to guide the slaughter one way or another all the while weakening us. Remember, the end game is to destroy ABSOLUTELY the last vestiges of Americans and our culture, whatever may be left of it, which is not much if anything. \\nPerhaps the above is where those warning about the “coming breakup of America” will occur, perhaps, perhaps not, but they now have the OPTION to do so! I want you to think on all this and let your mind run wild with other possibilities, but just remember that they are right now lining the ducks up (you) while the firing squad is forming up and loading their rifles. No matter WHAT you believe will be the outcome of this and no matter what happens one way or another know that this is all preplanned and they would NEVER allow this situation unless they had a humdinger of a plan hidden just beneath the surface, I hope I scratched that surface for you. Like you, they have a plan A, B, C and D, it is why they have succeeded for more than two centuries! Do not take them for the fool, they have proven they are not. \\nSo maybe we will get Trump and the populace will quiet down while the communists march on with a different uniform, Cheka versus Gestapo. Then again Hillary might go in and just finish things and be done with it or prep the nation for the next phase. No matter what happens, be ready for it and do not let them sucker you into believing this honest or that TRUMP is honest! They are both in on it together! They merely represent two different paths for them to reach their ultimate goal! Share this:'"}, "time": 1742563095.7170014}