{"duration": 0.11072087287902832, "input_args": {"text": "'WASHINGTON  —   More than 50 State Department diplomats have signed an internal memo sharply critical of the Obama administration’s policy in Syria, urging the United States to carry out military strikes against the government of President Bashar   to stop its persistent violations of a   in the country’s    civil war. The memo, a draft of which was provided to The New York Times by a State Department official, says American policy has been “overwhelmed” by the unrelenting violence in Syria. It calls for “a judicious use of   and air weapons, which would undergird and drive a more focused and   U. S.  diplomatic process. ” Such a step would represent a radical shift in the administration’s approach to the civil war in Syria, and there is little evidence that President Obama has plans to change course. Mr. Obama has emphasized the military campaign against the Islamic State over efforts to dislodge Mr. Assad. Diplomatic efforts to end the conflict, led by Secretary of State John Kerry, have all but collapsed. But the memo, filed in the State Department’s “dissent channel,” underscores the deep rifts and lingering frustration within the administration over how to deal with a war that has killed more than 400, 000 people. The State Department set up the channel during the Vietnam War as a way for employees who had disagreements with policies to register their protest with the secretary of state and other top officials, without fear of reprisal. While dissent cables are not that unusual, the number of signatures on this document, 51, is extremely large, if not unprecedented. The names on the memo are almost all midlevel officials  —   many of them career diplomats  —   who have been involved in the administration’s Syria policy over the last five years, at home or abroad. They range from a Syria desk officer in the Bureau of Near Eastern Affairs to a former deputy to the American ambassador in Damascus. While there are no widely recognized names,   State Department officials are known to share their concerns. Mr. Kerry himself has pushed for stronger American action against Syria, in part to force a diplomatic solution on Mr. Assad. The president has resisted such pressure, and has been backed up by his military commanders, who have raised questions about what would happen in the event that Mr. Assad was forced from power  —   a scenario that the draft memo does not address. The State Department spokesman, John Kirby, declined to comment on the memo, which top officials had just received. But he said Mr. Kerry respected the process as a way for employees “to express policy views candidly and privately to senior leadership. ” Robert S. Ford, a former ambassador to Syria, said, “Many people working on Syria for the State Department have long urged a tougher policy with the Assad government as a means of facilitating arrival at a negotiated political deal to set up a new Syrian government. ” Mr. Ford, who is now a senior fellow at the Middle East Institute, resigned from the Foreign Service in 2014 out of frustration with the administration’s   policy toward the conflict. In the memo, the State Department officials wrote that the Assad government’s continuing violations of the partial   known as a cessation of hostilities, will doom efforts to broker a political settlement because Mr. Assad will feel no pressure to negotiate with the moderate opposition or other factions fighting him. The government’s barrel bombing of civilians, it said, is the “root cause of the instability that continues to grip Syria and the broader region. ” “The moral rationale for taking steps to end the deaths and suffering in Syria, after five years of brutal war, is evident and unquestionable,” it said. “The status quo in Syria will continue to present increasingly dire, if not disastrous, humanitarian, diplomatic and   challenges. ” The memo acknowledged that military action would have risks, not the least further tensions with Russia, which has intervened in the war on Mr. Assad’s behalf and helped negotiate a  . Those tensions increased on Thursday when, according to a senior Pentagon official, Russia conducted airstrikes in southern Syria against   forces fighting the Islamic State. The State Department officials insisted in their memo that they were not “advocating for a slippery slope that ends in a military confrontation with Russia,” but rather a credible threat of military action to keep Mr. Assad in line. Once that threat was in place, the memo said, Mr. Kerry could undertake a diplomatic mission similar to the one he led with Iran on its nuclear program. The expression of dissent came a week after Mr. Assad showed renewed defiance of the United States and other countries, vowing to retake “every inch” of his country from his enemies. The   which Mr. Kerry helped negotiate in Munich last winter, has never really taken hold. Mr. Assad has continued to block humanitarian convoys, despite a warning that the United Nations would begin airdrops of food to starving towns. “There is an enormous frustration in the bureaucracy about Syria policy,” said Andrew J. Tabler, a Syria expert at the Washington Institute for Near Eastern Policy. “What’s brought this to a head now is the real downturn in the negotiations, not just between the U. S. and Russia, but between Assad and the opposition. ” Last month, Mr. Kerry rejected the suggestion that the United States and its allies would never use force to stop the bombings or enforce humanitarian access. “If President Assad has come to a conclusion there’s no Plan B,” he said, “then he’s come to a conclusion that is totally without any foundation whatsoever and even dangerous. ” Still, Mr. Obama has shown little sign of shifting his focus from the campaign against the Islamic State  —   a strategy that probably acquired even more urgency after the mass shooting Sunday in Orlando, Fla. In the memo, the State Department officials argued that military action against Mr. Assad would help the fight against the Islamic State because it would bolster moderate Sunnis, who are necessary allies against the group, also known as ISIS or ISIL. While the State Department has a tradition of being open to dissent  —   in the 1990s, Secretary of State Warren Christopher met with Foreign Service officers who had written a   dissent on the Clinton administration’s Balkans policy  —   Mr. Christopher and his successors have been frustrated when these classified memos become public. In this case, the memo mainly confirms what has been clear for some time: The State Department’s rank and file have chafed at the White House’s refusal to be drawn into the conflict in Syria. During a debate in June 2013, after the Assad government had used chemical weapons against its own people, Mr. Kerry brandished a State Department report that argued that the United States needed to respond militarily or Mr. Assad would view it as “green light for continued CW use. ” Three years later, the sense of urgency at the State Department has not diminished. The memo concludes, “It is time that the United States, guided by our strategic interests and moral convictions, lead a global effort to put an end to this conflict once and for all. ”'"}, "time": 1742561631.6721075}