{"duration": 0.07834911346435547, "input_args": {"text": "'President Donald J. Trump killed the Trans Pacific Partnership (TPP) once and for all on Monday, signing an executive order officially withdrawing from the trade deal negotiations. [It came as a part of series of three separate executive actions that President Trump took on Monday.  “The first is a withdrawal of the United States from the Trans Pacific Partnership,” White House chief of staff Reince Priebus said, explaining the first executive action President Trump was taking in the list of three. The other two were one freezing hiring of all federal employees except in the military, and one that restores the Mexico City policy. As President Trump signed the executive action killing the TPP, he announced for the cameras in the oval office that it was a “great thing for the American worker, what we just did. ” Trump campaigned heavily against TPP, so it’s only fitting he’d crush it once and for all on his first business day as President of the United States. It’s his efforts campaigning against it —  and the efforts of failed presidential candidate Sen. Bernie Sanders ( ) —  that shook Washington’s political establishment, and eventually forced failed Democratic presidential nominee Hillary Rodham Clinton to come out against the deal that was supposed to be a legacy achievement of now former President Barack Obama. Trump hammered TPP repeatedly throughout his campaign and even leading up to it in speeches and interviews, including many exclusive interviews with Breitbart News. For instance, back in May 2015 —  when many Republicans were in favor of TPP and before he announced his campaign —  Trump told Breitbart News exclusively in an interview that the TPP was a “disaster” of a deal. “I deal with foreign companies all the time. I do a lot of business with foreign companies and do well with foreign companies,” Trump said in that May 2015 interview. “The trade deal is a disaster for many reasons. Number one, we don’t have any good negotiators in our government. That’s possibly the single greatest reason —  we don’t have our best and our brightest negotiating for us. That’s a real problem. Number two, and very, very importantly, it doesn’t take into consideration the currency manipulation because we get beaten in trade more by currency manipulation than any single other factor. So it’s not even discussed in the trade deal. They’re not addressing the number one cause of the unfairness which is the currency manipulation. China manipulates their currency so brilliantly and it’s very, very hard to compete. The other thing they do and they do it despite agreements is they make it impossible to sell product in their countries even after they sign an agreement so we need much stronger penalties if they continue to do that. ” Later, as a candidate in November 2015, now President Trump then candidate Trump called the deal “insanity” in another exclusive Breitbart News interview. “The deal is insanity,” he said in November 2015. “That deal should not be supported and it should not be allowed to happen. ” “The deal is so bad because of the fact they don’t cover currency manipulation,” Trump added in that interview. “It’s the   weapon used by foreign countries to hurt the United States and take away jobs. ” He repeatedly hammered it over and over again, and continued throughout the entire campaign. Just a couple weeks before the general election, Trump appeared on Breitbart News Daily and hammered TPP and the North American Free Trade Agreement (NAFTA) —  which he plans to renegotiate now with planned meetings with Canada and Mexico. “I have traveled around this country, and I have seen places that were vibrant 25 years ago,” Trump said in that October 2016 interview. “I’ve seen NAFTA. What NAFTA has done to our country is incredible. Probably 40 percent of our manufacturing jobs have been shipped to other places, and it’s only getting worse. And now they want to do TPP, which will be not as bad as NAFTA, but it’ll be very bad. It’ll be a continuation of the same. ” The move to nuke TPP once and for all, ripping it up, begins to fulfill one of Trump’s biggest promises. Now that he’s crushed the bad deal, it remains to be seen how he will negotiate positive deals for America. Back when Trump became presumptive GOP presidential nominee, he told Breitbart News in his 26th floor Trump Tower office in New York City he wants to negotiate good deals for American workers. “One of the big drastic policies is on trade,” Trump said in the May 2016 interview. “And what I want in trade is great deals. I’m fine with free trade, but all of our trade deals are doing horribly. It’s free trade for the other side, not for us. So I like free trade but all of our trade deals are doing terribly. What I want is great deals. You know what my trade policy is? I want to make great deals for the American people. It’s a very simple policy. You can call it anything you want —  you can call it free trade, you can come up with three different names —  but it’s a very simple policy: Make great deals for the American people.'"}, "time": 1742563697.9142306}