{"duration": 0.11098051071166992, "input_args": {"text": "'Share on Facebook \\nWhile visiting a Chili’s restaurant in Cedar Hills, Texas, U.S. Army Veteran Ernest Walker was approached by the manager and had his military service questioned even though he had his military ID with him. Chili’s offers free meals to Veterans on Veterans Day as a thank you for their service, but what Walker received was anything but. \\nNoticing what was happening, Walker took out his phone and began to record everything that was being said to him. At one point, even his food was stripped away from him. There’s really no other way to see this than an act of racism, and Chili’s needs to answer for it. \\nWalker wrote on Facebook : \\n“I went there to get a Veterans meal and all was good. I had my service dog with me because I am on Dialysis and he monitors my BP. I ordered the waitress was wonderful. It took about 35 mins for meal to come. So when it attived I gave her a Tip as asjed for a take out. She said sure, at that point a old white guy wearing a Trump flag shirt walked buy me on hi way to the bath room. He came back and aked me what unit did i serve in the 24th. I said no the 25th. He said he was in world war 2 in Germany and we did not see people like you over there. They would no allow blacks. I just listened he left then came back to bathroom again and pet my dog. So waitress put foid in container. Then the managers comes and says a somes guest at the restaurant say that your not a real Soldier. I reply what are you serious what guest. The manager Wesly Patrick said can I see military ID. I felt that was reasonable I most people ask for that so I shoed him my ID it checked out. At that point all he should have said was ‘Sir I am sorry Thank you for your service and I would have left. But instead ge says ‘ tbe guest also says that your service dog is not a service dog. Now that’s when igot upset and started Recording so see for yourself what happened.” \\nWatch the altercation here: \\nChili’s did respond by saying : \\n“We are aware of the situation that happened at our Chili’s Cedar Hills location yesterday. Our goal is to make every guest feel special. Unfortunately, we fell short on a day we strive to honor our Veterans and active military for their service. We have escalated this to the highest levels of our company.” \\nHopefully, all of this will be resolved properly and Walker given the respect that he deserves. \\nThe fact that some manager of a local Chili’s restaurant felt so bold to question anyone’s service to deny them a meal is just beyond comprehension. \\nWatch the story here via CBS DFW: \\nFeatured image via video screen capture '"}, "time": 1742563819.435606}