{"duration": 0.13814640045166016, "input_args": {"text": "'This weekend, Tim Kaine and his wife, Anne Holton, are expected to step off the campaign trail for a beach vacation with their extended family at the Virginia shore. It is an annual tradition, as is Ms. Holton’s practice of making the adults hand over all their grocery store receipts. She ensures that every household, factoring in the number of children, has paid not a dollar more or less than its fair share. “She is not the accountant, she’s the judge,” said her brother Dwight Holton, a former United States attorney in Oregon. “No one has ever questioned her Solomonic wisdom. ” The daughter of a governor who grew up to marry a man who became governor, senator and now   nominee, Ms. Holton has lived since childhood in a world of politics and power. But relatives and friends describe her as being uncommonly unimpressed by the trappings of privilege and instead driven by an almost religious sense of fairness, an aversion to idleness and a   commitment to service that has helped elevate her into   of Virginia’s most famous power couple. As a child, Ms. Holton, 58, had a symbolic role in helping integrate Virginia’s public schools before graduating from Princeton and meeting Mr. Kaine at Harvard Law School. As he rose up Virginia’s political ladder, she achieved renown in her own right as a legal aid lawyer, family court judge and Virginia’s secretary of education, a job she resigned once her husband was chosen as Hillary Clinton’s running mate. In some ways, Ms. Holton, who has been mentioned as a possible replacement for her husband in the Senate, represents Mrs. Clinton’s road not taken, continuing to pursue her career throughout her husband’s ascent rather than waiting her turn. But now those roads have converged on the presidential campaign trail, with Ms. Holton sharing stages with the Clintons and amplifying her husband’s high school teacher vibe with her Everywoman appeal. In a backstage holding room after Mrs. Clinton’s acceptance speech last Thursday, Mr. Kaine broke out his harmonica, one of his hobbies, and goaded his wife into one of hers, clog dancing. On the trail, Ms. Holton is a staple at her husband’s side, monitoring his speeches, giving him encouraging smiles and offering remarks in her lilting accent. “She has been around politics a looong time,” said Tom Wolf, Mr. Kaine’s former law partner and a friend of the family. “And she knows what it’s about and knows what needs to be done. ” Ms. Holton, who declined to be interviewed, first moved into the Virginia executive mansion in 1970 as the    daughter of Gov. A. Linwood Holton Jr. a Republican, and his wife, Virginia, known as Jinks. She enrolled at a prestigious grade school recommended to her parents by their   friends. Many children at school wanted to attach themselves to her because of who her father was. “She called them ‘Buggy Friends,’” recalled her brother Woody, because they were constantly bugging her to visit the mansion. Status seeking, he said, was not a value instilled by their father. Instead, the children were roused from their comfortable beds every morning with refrains of “It’s opportunity time! Let’s go get ’em. ” A Presbyterian, he gave each of his four children Bibles with underlined passages about the good Samaritan. The lessons stuck. When a lightning strike in 1968 killed the daughter of the sitting governor, Ms. Holton started the Becky Godwin Club in the girl’s honor. The club specialized in good Samaritan deeds, like playing with and raising money for a developmentally disabled girl down the block. When a federal judge ordered the desegregation of Virginia schools, Governor Holton sent his children to Mosby Middle, an   public school. He also made sure to alert the news media. “Dad is like Tim in this way,” said Woody Holton, a historian at the University of South Carolina and the author of an acclaimed biography of the first lady Abigail Adams. “They both are really good social justice people, but they also understand that you better call reporters. ” A photograph of Anne’s older sister, Tayloe, being escorted into the school by her father became an iconic image, though Woody Holton said she “was mad because Tayloe was becoming famous wearing Anne’s dress. ” At Mosby, Ms. Holton, then 12, showed a middle child’s talent for getting along with people, starting a cheerleading squad and making friends. She also gave a tour of the mansion to   Slaughter, another    who would go on to be a foreign policy adviser to Mrs. Clinton, and whose best friend was the daughter of the Democrat that Linwood Holton beat in the governor’s race. “She was very gracious,” Ms. Slaughter said. The Holton children entertained themselves by roller skating in the basement, and while Donald J. Trump has criticized “Corrupt Kaine,” as he calls him, for accepting gifts as governor  —   it was legal  —   the Holton children were themselves awash in presents. “When Dad was governor, the gifts just flowed,” Woody Holton said. “This is all before Watergate. Nobody thought how it might be corrupting. So one of the gifts we got was a golf cart, and we drove it all around the Capitol grounds. ” Ms. Holton later enrolled in Open High School, which allowed students to create their own curriculum and did not give grades. When asked to pick an activity for physical education, she took up clogging. When assigned to research her family’s ancestry, she presented not the names of distant gentry, but the names of slaves owned by her  . At Harvard Law, she met Mr. Kaine in a legal assistance program that focused on civil rights protections for inmates, and she worked for the Mental Health Legal Advisors Committee, interviewing the criminally insane about the conditions of their imprisonment. “She handled the case of a serial killer,” Woody Holton said. As the couple decided where to live, Mr. Kaine’s family, who lived in the Kansas City area, wooed her by taking her to barbecue meccas. But for ambitious young lawyers, Richmond had its advantages. “He told us that Anne’s dad was the former governor of Virginia,” said Pat Kaine, Tim’s younger brother. Ms. Holton came home first, looking for a church to marry in. She was attending services at a Quaker meeting house at the time, but she knocked on the door of St. Elizabeth’s, a predominantly black Roman Catholic church (her husband is Catholic). She gave her name to the priest. “I tried to play it a little cool  —   we all deal with hierarchy all the time,” recalled the Rev. Michael Schmied, who said they had talked about wedding details for an hour. Then he looked up and remarked: “‘Wow. You are the real Anne Holton. ’” Ms. Holton began clerking for Robert R. Merhige Jr. the federal judge who had issued the desegregation order. As Mr. Kaine became a successful lawyer, a City Council member and mayor, Ms. Holton made a name for herself as a lawyer for   families and foster children, and then as chief judge on Richmond’s juvenile court. Ms. Holton was sometimes so busy that she dropped her three children off at day care in their pajamas. In 2002, she conducted the   ceremony when her husband became lieutenant governor. But before he ran for the office, she had to assuage his concerns about whether they could give a normal life to their three children: Nat, now a Marine Woody, an artist and Annella, who is studying to be an actress. “You’d see Anne tacking up posters to advertise the elementary school and middle school plays,” said Pierce Homer, a former secretary of transportation under Mr. Kaine and a neighbor. The couple live in a modest house and drive sensible cars. Their friends talk about the autoharp Ms. Holton bought Mr. Kaine for his birthday (she plays the violin) and their unapologetic public displays of affection: kissing on stages, holding hands in the park. When Mr. Kaine was elected governor in 2005, Ms. Holton resigned from the bench and returned to her childhood home, where as first lady she concentrated on foster care programs that helped keep older children with permanent families and extend their education. Mr. Kaine won his Senate seat in 2012. When Terry McAuliffe was elected governor a year later, he surprised many people by appointing Ms. Holton as secretary of education, a position she at first declined because of her lack of education background, according to Mr. Wolf, the family friend. “She knew everybody and had a real opportunity to bring people together,” Mr. McAuliffe explained. As for filling Mr. Kaine’s seat in the Senate should he and Mrs. Clinton win, Mr. McAuliffe said, “It will be a little hard since he presides over the Senate. ” (The vice president serves as president of the Senate.) Ms. Holton is clearly at ease among the most exclusive club in Washington. At a retreat at his Virginia farm last month, Senator Mark Warner said, senators were singing along to Mr. Kaine’s harmonica playing when Ms. Holton jumped into the middle of the room and started clog dancing. “Our jaws dropped,” Mr. Warner said. Mr. Kaine told Virginia delegates at a Democratic National Convention breakfast last week that his wife was “my political partner, my most astute critic, my most energetic enthusiast, my lover, my girlfriend, my wife of 32 years, the great mother of our great three children. ” He then kissed her on the lips and relayed to the crowd what the Clinton campaign told him about his wife: “We want every last minute that she can give us. ”'"}, "time": 1742564541.0233645}