{"duration": 0.03753352165222168, "input_args": {"text": "\"Email \\nISIS barbarians used an industrial dough kneader to kill 250 children, and roasted adults in a bakery oven, according to a shocking new report. \\nIn an interview with the humanitarian organization Roads of Success, Syrian mom Alice Assaf went into chilling detail about the atrocities the jihadists committed about two years ago in the town of Douma, explaining that some of the youngsters were even decapitated in front of their parents, according to the Express. \\n“We heard that the militants grabbed six strong men working at the bakery and burned them inside the oven. We knew them,” Assaf told Dr. Yvette Isaac, who works for the advocacy group, according to the UK Mirror. \\n“After that, they caught some 250 kids and kneaded them like dough in the bakery dough machine,” Assaf said, according to media reports. “They were put in the dough mixer, they were kneaded. The oldest one of them was four-years-old.” \\nISIS transported hundreds of girls to the city of Douma, which has been at the center of the Syrian civil war, to be slaughtered. ISIS has been systematically killing non-Muslims, and the majority of its victims at the time were Christian. \\nAssaf said her own son, George, was killed by the radical militants after he refused to switch to a Muslim name. \\n“My son said to me, ‘No, mother, I don’t want to die with an identity not my own. I prefer to die with the name George,'” Assaf said, according to the Christian Post. \\nAssaf added, “I asked my son then to hide, but he refused and said, ‘I don’t want to hide myself. You are the one who taught me to follow what Christ said’ — ‘whoever denies me before man, I will also deny before my father who is in Heaven.'” \\nDr. Isaac reported the savage slayings to a member of the UK Parliament, Fiona Bruce, who recently recounted the horrifying testimony to her colleagues in open chambers. \\n“She showed us recent film footage of herself talking with mothers–more than one– who had seen their own children crucified,” Bruce said. \\n“She told us of a mother with a two-month-old baby. When [ISIS] knocked at the front door of her house and ordered the entire family out, she pleaded with them to let her collect her child from another room,” Bruce said. \\n“She told us of a mother with a two-month-old baby,” Bruce continued. When [ISIS] knocked at the front door of her house and ordered the entire family out, she pleaded with them to let her collect her child from another room. They told her, ‘No. Go. It is ours now.’”\""}, "time": 1742562636.532112}