{"duration": 0.1558060646057129, "input_args": {"text": "'If only we were able to deport citizens, we could use Trump’s new policy of excluding those who are “hostile” toward our country to get rid of Judge James Robart. [Judge Robart’s veto of Trump’s travel ban notwithstanding, there is not the slightest question but that the president, in his sole discretion, can choose to admit or exclude any foreigners he likes, based on “the interests of the United States. ”  The Clinton administration used the executive branch’s broad power over immigration to send a    boy back to a communist dictatorship. The courts were completely powerless to stop him. As explained by the federal appellate court that ruled on Elian Gonzalez’s asylum application: “It is the duty of the Congress and of the executive branch to exercise political will,” and “in no context is the executive branch entitled to more deference than in the context of foreign affairs,” which includes immigration. The court acknowledged that Elian might well be subjected to “” “communist indoctrination” and “political manipulation. ” (Then again, so would enrolling him at Sidwell Friends.) It didn’t matter! Sending little boys back to communist dictatorships was the policy of the Clinton administration. The Obama administration’s immigration policy was to ensure that millions of   foreigners would come here and help turn our country into a Mexican version of Pakistan. When Arizona merely tried to enforce the federal immigration laws being ignored by the Obama administration, the entire media erupted in rage at this incursion into the majestic power of the president over immigration. They said it was like living in Nazi Germany! The most reviled section of the act, melodramatically called the “Papers Please” law, was upheld by the Supreme Court. But the other parts, allowing state officials to enforce federal immigration laws, were ruled unconstitutional. A president’s policy choice to ignore immigration laws supersedes a state’s right to enforce them. The court conceded that hundreds of thousands of illegal aliens were arrested in Arizona each year, that they were responsible for “a disproportionate share of serious crime,” and that illegals constituted nearly 6 percent of Arizona’s population. But Arizona was powerless to enforce laws on the books  —   if those laws happened to be about immigration. The president’s authority over immigration is absolute and exclusive, as part of his authority over foreign policy. To review:  —   When the president’s immigration policy is to promote international communism: The president wins.  —   When the president’s immigration policy is to transform America into a different country: The president wins.  —   But when the president’s immigration policy is to protect Americans: Some   judge announces that his authority exceeds that of the president. This is exactly what I warned you about in Adios, America: The Left’s Plan to Turn Our Country into a Third World Hellhole. Nothing Trump does will be met with such massive resistance as his immigration policies. The left used to attack America by spying for Stalin, aiding our enemies, murdering cops and blowing up buildings. But, then liberals realized, it’s so much more effective to just do away with America altogether! Teddy Kennedy gave them their chance with the 1965 immigration act. Since then, we’ve been taking in more than a million immigrants a year, 90 percent from comically primitive cultures. They like the welfare, but have very little interest in adopting the rest of our culture. In many parts of the country, you’re already not living in America. Just a few more years, and the transformation will be complete. There will be a North American landmass known as “the United States,” but it won’t be our country. The only thing that stands between America and oblivion is a total immigration moratorium. We are well past the point of quick fixes  —   as Judge Robart’s delusional ruling proves. The judiciary, both political parties, the media, Hollywood, corporate America and approximately 1 million lobbying groups are all working frantically to bring the hardest cases to our shores.   traitors, who used to honeymoon in Cuba and fight with peasant revolutionaries in Peru, toil away, late into the night, to ensure that genocidal Rwandans can move to America and immediately start collecting food stamps, Medicaid and Social Security. No matter how clearly laws are written, government bureaucrats connive to import people from countries that a majority of Americans would not want to visit, much less become. Federal judges issue lunatic rulings to ensure that there will never be a pause in the transformation of America. Congress could write laws requiring immigrants to pay taxes, learn English, forgo welfare and have good moral character. It could write laws giving the president authority to exclude aliens in the public interest. Except it already has. Those laws were swept away by INS officials, federal judges and Democratic administrations  —   under ferocious pressure from     groups. The country will not be safe until the following outfits are out of business: The ACLU’s Immigrants’ Rights Project the National Immigration Forum the National Immigration Law Center the National Immigration Project of the National Lawyers Guild the National Network for Immigrant and Refugee Rights the Office of Migration and Refugee Services the American Immigration Law Foundation the American Immigration Lawyers Association the Border Information and Outreach Service Atlas: DIY the Catholic Legal Immigration Network the Clearinghouse for Immigrant Education the Farmworker Justice Fund Grantmakers Concerned with Immigrants and Refugees the Immigrant Legal Resource Center the International Center for Migration, Ethnicity and Citizenship the Lesbian and Gay Immigration Rights Task Force the Lutheran Immigration and Refugee Service the National Association for Bilingual Education the National Clearinghouse on Agricultural Guest Worker Issues the National Coalition for Dignity and Amnesty for Undocumented Immigrants the National Coalition for Haitian Rights the National Council of La Raza and the National Farm Worker Ministry. And that’s only a small fraction of the   immigration groups assiduously dragging the Third World to our shores  —   while you were busy working. Look at that list  —   look at Judge Robart’s ruling!  —   and ask yourself: Is it possible that anything short of a total immigration moratorium can save this country? Only when there is no immigration to bellyache about will these nuts be forced to think of a new way to destroy America.'"}, "time": 1742562230.870966}