{"duration": 0.04426312446594238, "input_args": {"text": "'  documentary filmmaker Michael Moore says the Trump administration’s efforts to repeal and replace Obamacare is proof that no nation on earth “sh*ts on its own” people the way the U. S. does. [“Civilized countries that have universal healthcare  —   no country, no group of people, no tribe sh*ts on their own to the extent and the level that we do to each other it’s the most embarrassing and humiliating thing about this great country,” Moore said on a conference call Thursday held by the Progressive Democrats of America.  “Humans anyplace else, what they don’t do is sh*t on their own,” Moore said. “They need their own for their own defense. They need their own for their own survival  —   they need their own. They need to protect their children, not say to the child, ‘sorry, no, we got rid of Obamacare. We won’t help you. You’re sick? Tough. ’” Moore predicted that Trump would work with Congress to “retain as much or most, even all” of the Patient Protection and Affordable Care Act, signed into law by President Obama in 2010 and commonly called Obamacare, because at the end of the day Trump “likes being popular. ” “[Trump is] trying to find a way to have his cake and eat it too, basically. He likes being popular. He likes his ratings. He does not want to be seen  —   and he said this during the campaign  —   as the guy who is throwing 20 million people out on the curb. He said that because he wouldn’t be very popular then,” Moore explained. “He will look for a way to retain as much or most, even all, and I think he’s learned that the worst thing about Obamacare to his supporters is the fact that it’s called Obamacare,” Moore continued. “And I think he’s just going to change the name, you know, the man is all about branding. ” On Wednesday, conservative lawmakers called on Trump to work with Republican leaders in Congress to completely repeal the health care law. But Moore says Trump will likely keep much of Obamacare intact, and move merely to change the law’s name and make adjustments. The   went on to praise the 9th Circuit Court of Appeals for its   ruling upholding a lower court’s order halting President Trump’s temporary   executive order. “The more we can discombobulate him, the better,” Moore said of the ruling. Moore also told Progressive Democrats of America members that the liberal left is “doomed” if Rep. Keith Ellison ( .) doesn’t win his race to become the next chairman of the Democratic National Committee.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562006.8283975}