{"duration": 0.044219970703125, "input_args": {"text": "'The county is calling it an accident, but many are not convinced that it was. Credit: UK Progressive \\nIn what some are calling a “hilliarious” typo, Hillary Clinton’s name was misspelled to represent what many people think of her as: a liar. Though it has been waved off as an accident, the ballot spelled her name “Hilliary” Clinton and some are upset by the handling of this situation in Lonoke County, Arkansas. \\nJerry Shepard, the Republican chairman of the Lonoke County Election Commission, has said that they were not made aware of the typo until voting began. As a Republican, there would be an incentive to put in this last comical comment about Clinton’s lack of trustworthiness, but even the Democratic chairman for the county’s commission has said that there was no intention to defame her name. Credit: NBC News \\nMany are not convinced, as the ballots are checked thoroughly and repeatedly for typos, misprints, and incorrect information before being sent out by mail and to polling places. The misspelling of a major presidential candidate’s name would not easily make it through unnoticed. \\nThough Arkansas is largely Republican, there are still Democratic voters in the state who were upset with this alleged typo. One disgruntled voter in Lonoke County took to Facebook to express their experience with trying to report the mistake: \\n“I would like to believe that they did not do this on purpose because I think it was just a spelling error. However, I did contact the clerk’s office and told them of this error and they told me that they are blowing it off because they don’t expect people in Lonoke county to vote for Hillary Clinton. \\n“Whoever I spoke to they were rude and they just laughed off my complaint so I decided to call the Arkansas Secretary of State’s office. They took my complaint and forwarded me to the Arkansas Election Commission, where I filed an official complaint on the Lonoke County Clerk’s office.” \\nSpelling Hillary’s name wrong does not affect citizens’ ability to vote for her, but it’s the lack of care that has people questioning whether this was really a mistake. If something similar had been done to Donald Trump’s name, his supporters would be outraged and attribute it to Clinton’s rigging of the election. \\nThe fact that people aren’t more upset at this typo might be evidence of her reputation as a liar in a number of situations. If her email scandal hadn’t discouraged some people from voting for her, then her history of constantly lying and changing her mind on key issues might. Though the typo was completely uncalled for and unnecessary, some might argue that it wasn’t exactly incorrect. \\nDo you believe that this typo was a mistake?   Ballot ‘Typo’ Leaves Hillary’s Name With The Word “Liar” In It  '"}, "time": 1742628495.0127847}