{"duration": 0.05391216278076172, "input_args": {"text": "'LGBT writer Skylar   refused to accept homosexuals who “come out” as supporters of President Trump in a new article for The Independent, encouraging others in the LGBT community to cut ties with gay conservatives. [In the article,   responded to OUT magazine’s Chadwick Moore, who came out as a conservative on Saturday and explained how the   LGBT community started to ignore, reject, and cut ties with him after he wrote a neutral profile on Breitbart Senior Editor MILO and expressed conservative political beliefs.  “Gay conservatives aren’t welcome in gay spaces because the people they support are an existential threat to our rights and our community,” claimed   condemning homosexual conservatives including Moore and MILO. “After all, queer spaces (such as bars, bathhouses, community centres, and even bookstores) were founded and instrumental in radical sexual politics and political engagement. You can’t divorce that from the social aspect, because doing so would deny the history of our community and the present reality of so many vulnerable LGBT people. ” “Asking that the gay community embrace you and your politics is like one turkey asking another to be okay that he voted for the farmer and Thanksgiving,” he continued. “I don’t care if this hurts someone’s feelings I’m more concerned with the harm their vote causes. So until American conservatism welcomes queer people, queer people shouldn’t welcome American conservatives. Even if they’re queer themselves. Sorry, Chad. Maybe Milo will buy you a drink. ”   further attacked homosexual conservatives on his Twitter account, where he added: “I have no time for gay American conservatives. Go cry your tears elsewhere. ” I have no time for gay American conservatives. Go cry your tears elsewhere. My latest for the Independent: https:  .   —   Skylar   (@SkylarJordan) February 13, 2017,  During his article coming out as a conservative on Saturday, Chadwick Moore explained how he had been ousted from LGBT circles and cut off from his best friend, who no longer wanted to have anything to do with him. “I decided to go out to my local gay bar in Williamsburg, where I’ve been a regular for 11 years. I ordered a drink but nothing felt the same half the place  —   people with whom I’d shared many laughs  —   seemed to be giving me the cold shoulder,” Moore recalled. “Upon seeing me, a friend who normally greets me with a hug and kiss pivoted and turned away  …     My best friend, with whom I typically hung out multiple times per week, was suddenly perpetually unavailable. Finally, on Christmas Eve, he sent me a long text, calling me a monster, asking where my heart and soul went, and saying that all our other friends are laughing at me. ” “I began to realize that maybe my opinions just didn’t fit in with the liberal status quo, which seems to mean that you must absolutely hate Trump, his supporters and everything they believe,” he concluded, adding, “It can seem like liberals are actually against free speech if it fails to conform with the way they think. And I don’t want to be a part of that club anymore. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628332.740789}