{"duration": 0.0654153823852539, "input_args": {"text": "'Russian analysis shows western-backed terrorists using chemical weapons against civilians In yet another blow to the credibility of the Western corporate media and the anti-Syria propaganda blitz By Brandon Tuberville   9:50 AM EST \\nAlthough the 1070 Apartment Complex was liberated by the Syrian government a few days ago, the terrorists have been repeatedly shelling the area with indiscriminate missiles in order to kill civilians attempting to flee terrorist control as well as firing missiles at Syrian military personnel. Many of these missiles have been filled with poisonous gas which the Russian Center has identified as being chlorine and white phosphorous. \\nDozens of people have been injured as a result of the chemical munitions and have been hospitalized for treatment. Chlorine and white phosphorous both cause extremely painful deaths. \\nWhile the United States government has repeatedly accused the Syrian military of using chemical weapons against terrorists and even civilians, not one shred of evidence has been produced to back up these claims. \\nHowever, not only have a number of internationally recognized experts demonstrated clearly that the terrorists have used chemical weapons against both civilians and Syrian military soldiers, the terrorist forces have admitted as much by videotaping themselves testing the weapons and threatening to use them against those who oppose them. \\nNotably, all of these substances were banned by the Chemical Weapons Convention on January 13, 1993. \\nThe Russian center has established a mobile analysis center in Aleppo in order to test samples quickly but the samples will soon be sent to the Radiological, Chemical, and Biological Center in Moscow. This center is accredited by the Organization for the Prohibition of Chemical Weapons. \\nIn yet another blow to the credibility of the Western corporate media and the anti-Syria propaganda blitz it has maintained since early 2011, experts from the Russian Center For Radiological, Chemical, and Biological Defense have recently announced that analysis of the shells fired by terrorists at the 1070 Apartment Complex in Aleppo contained chemical weapons. \\nThis new revelation brings Western propaganda crashing to ground in regards to the claims that it is Assad’s government using chemical weapons and that the terrorists have no access to them. \\n“Rapid sample analysis shows that the toxic substances in the militants’ artillery ammunition were chlorine and white phosphorus,” an analyst from the center said.'"}, "time": 1742561875.4537091}