{"duration": 0.1679375171661377, "input_args": {"text": "'Waking Times \\n“If the matrix gives you Trumpocalypse, then use secret alchemical means to create matrix-shifting Trumpocalyptic lemonade.” ~ Rob Brezsny \\nWhen people asked Carl Jung, who actually met Hitler, how he manipulated the psyche of the German people, Jung replied, “Hitler didn’t manipulate the psyche of the German people, he was the psyche of the German people.” \\nIf, as Mark Twain said, “History does not repeat itself, but it rhymes,” and you’re still wondering how this racist, xenophobic, authoritarian, climate-science-denying, misogynistic, “grab-them-by-the-pussy” candidate somehow made his way into the presidency, then look no further than a mirror. For far too long you have given into the idea that an authority will save you. You were under the delusion that you needed someone to rule over you. That delusion has led to someone who just so happens to want to rule over you. Are you really that surprised? \\nIf you’re not careful your own Stockholm syndrome will have you thinking the state is moral and just and wants to empower you to be free. It doesn’t. It’s the complete opposite, in fact. It wants you to remain blindly subservient to its outdated laws and its chain of obedience which leads right up the immoral-laden ladder to the president who holds the violent monopoly on power. \\nThis isn’t about who won the presidency. This is not about bipartisan fuckery. This is about the illegitimacy of any presidency, ever . This is about the illegitimacy of authority and the immoral nature of entrenched power. The state is unhealthy, unsustainable, immoral, and violent, and who ever rules over it is thereby illegitimate; whether it’s the orange-headed, spoon-fed baby of a man, FrankenTrump, vomiting hate and racism through narcissistic, ignorant, misogynistic, and bigoted bully tactics, or the status quo queen, Killary Clinton, spewing Military Industrial Complex rhetoric from her plutocratic pulpit backed by greedy corporations from Wall Street calling themselves “persons” backed by even greedier corrupt banksters with their vampire-tentacles in every country’s pie. As Larken Rose said, “The only “us versus them” that matters is not about race, religion, nationality, or income level; it is about aggressors and their victims.” 1.) They Sheepishly Assume They Need Someone to Rule Over Them \\n“A man is no less a slave because he is allowed to choose a new master once in a term of years.” ~ Lysander Spooner \\nIt’s not your fault, really. You were born and raised in a culture that conditioned and brainwashed you into believing that you must answer to someone. From your authoritarian upbringing to your indoctrinated school years, you were propagandized and persuaded into thinking people are inherently bad so they must be led by people who are… somehow not bad? Huh?! \\nHere’s the thing: people are, for the most part, a product of their environment. We’ve all been programmed to be kowtowing statists by an extremely unhealthy, unsustainable, immoral, and violent state. To break the cycle, we must break our addiction to being ruled over by such a state. We must reprogram our programming. Unlearn what we have learned. Recondition the precondition. It’s time to rise up and become an author of self (self-authority). \\nThis is your life; not your parent’s life, not your peer’s life, not your state’s life. As Eliezer Yudkowsky said, “You are personally responsible for becoming more ethical than the society you grew up in.” It begins by admitting that you need neither masters no rulers, neither president nor queen, to rule over you. It begins by empowering yourself and taking responsibility for your own power. 2.) They Falsely Assume Leadership Means Rulership \\n“I find it extremely liberating to see that I was the cause of all my problems. With this realization, I have also learned I am my own solution. This is the great big gift of personal accountability. When we stop blaming external forces and own up to our responsibility we become the ultimate creators of our destiny.” ~Jenna Galbut \\nContrary to popular statist dogma, it is possible to have rules (cosmic law; Golden Rule; non-aggression principle) without the need for rulers and masters. Through bottom-up leadership as opposed to top-down leadership. It begins by not being an ignorant statist who gives his/her power to a tyrannical state. It begins by speaking your own truth to power, and then becoming a leader of your own. It begins by being proactive with the power you’ve wrestled back from the state and then leading by example. It begins by realizing that nobody –no president, no king, not even God– can give you permission to be free. In fact, every single president from Washington to Trump only had power because people believed it. Without that petty belief, they were nothing more than charismatic, fallible men. \\nYou, and you alone, must become a freedom unto yourself. And that may require a little revolt. Especially if you discover that you’re not so well adjusted to a profoundly sick society. As Niels Bohr said, “Every valuable human being must be a radical and a rebel, for what he must aim at is to make things better than they are.” 3.) They Ignorantly Assume Voting and Taxation are Moral and Just \\n“If taxation without consent is robbery, the United States government has never had, has not now, and is never likely to have, a single honest dollar in its treasury. If taxation without consent is not robbery, then any band of robbers have only to declare themselves a government, and all their robberies are legalized.” ~Lysander Spooner \\nTaxation without consent is immoral. There is no way to wriggle out of this profound truth. It’s especially immoral in a state where violence is threatened if you do not consent. Most naïve statists assume they must pay taxes in order to live freely. When, really, it’s the exact opposite of that. You’re only free if you’re able to choose to pay taxes or not without the threat of violence or imprisonment hanging over your head. Otherwise it’s just soft slavery. Deep down, we’re all anarchists. We know, inherently and instinctively, that all transactions should be voluntary. We’ve just been programmed to make an exception for the state. \\nVoting is indirectly violent, as the result directly forces majority rule on the minority who did not consent. Voting is a profound futility, an egregious gamble. As Robert Rorschach said, “If the outcome of a vote is unknown, then voting is tantamount to gambling. If the outcome of a vote is known, then voting is futile.” Most naïve statists have been conditioned to believe that voting is the only way to change things, that one must do it from the inside. Nothing could be further from the truth. Real change only occurs outside the doing-things-over-and-over-again-and-expecting-different-results ballot box. No matter what, you’re only ever going to get a puppet popping out. Trump just happens to be the latest jack-in-the-box, albeit orange, ugly, and dumb. 4.) They Blindly Assume Their Nation State is the Greatest Nation State \\n“Don’t believe yourself, and don’t believe anyone else. If you don’t believe, what is not true will dissolve in front of your eyes. Only what is true will remain, because what is true doesn’t need anyone to believe it” ~ Don Miguel Ruiz \\nMen never act so contentedly (and conveniently) evil as when they do so from a patriotic conviction. With hyper-nationalized perspectives whipping their brains into xenophobic scrambled eggs, and border-worshipping divisiveness cutting them off from any authentic engagement with the rest of the world, statists are the new dogmatists. They are brainwashed extremists, worshiping law and order, power and violence, and grossly outdated notions of how to be a flourishing human in an ever-changing world. They assume waiving a flag is an honorable thing. When flags are nothing more than propagandized “bits of colored cloth that governments use first to shrink-wrap people’s minds and then as ceremonial shrouds to bury the dead ( Arundhati Roy) .” \\n“Flags don’t unite us” as Belfast surmised; “they only reinforce our false sense of entitlement to lands we were born into by sheer chance.” And yet the inured statist myopically moos, ignorantly sneering at other nations from a platform of convictions gotten at second-hand, and without examination, from “authorities” who have had their own convictions spoon-fed to them by parochial forefathers who themselves didn’t have the courage to question the legitimacy of authority. As Mark Twain cryptically stated, “To create man was a fine and original idea; but to add the sheep was a tautology.” Indeed. Avoid the tautology (and the Trumpocalypse). Progressively evolve. Liberate yourself from the outdated ill-reasoning that you ever needed a chain of obedience, let alone a president. 5.) They Tragically Assume Violence is the Answer \\n“Like all great ideas, anarchism is pretty simple when you get down to it –human beings are at their best when they are living free of authority, deciding things among themselves rather than being ordered about.” ~Clifford Harper \\nThis is by far the worst of the five outdated assumptions. The fact that people still think that peace comes from waging war is mind-boggling to those of us who have freed ourselves from the state and discovered empathy and compassion from our interdependence with each other as free human beings in solidarity with leaving a healthy world for our children. \\nIt’s simple, really. To become a better human all you need is a simplified perspective: Your birth place –Earth, your race –Human, your politics –Freedom, your spirituality –Love. It’s so easy it’s stupid. All it requires is a shedding of your statist skin, and a transformation into a free human being who seeks to free others from the sickness of statism. \\nThe only way all of us win is through horizontal democracy that’s void of centralized government. In other words: no masters, no rulers. In short: democratic anarchy. The Mohawk, Onondaga, Oneida, Cayuga, Seneca, and Tuscarora peoples did it through the Iroquois Confederacy, living in authentic democracy for hundreds of years before the tyranny of the state ruined everything. So it’s not some far-fetched utopian dream. If they did it, so can we. Democratic anarchy, combined with the non-violent non-aggression principle , has the potential to usher in an age of peace, and a progressively sustainable evolution for our species. Read more articles by Gary ‘Z’ McGee . About the Author \\nGary ‘Z’ McGee , a former Navy Intelligence Specialist turned philosopher, is the author of Birthday Suit of God and The Looking Glass Man . His works are inspired by the great philosophers of the ages and his wide awake view of the modern world. Like Waking Times on Facebook . Follow Waking Times on Twitter . This article ( Trumpocalypse & 5 Ridiculously Outdated Assumptions Every Statist Makes ) was originally created and published by Waking Times and is printed here under a Creative Commons license with attribution to Gary ‘Z’ McGee and WakingTimes.com . It may be re-posted freely with proper attribution, author bio, and this statement of copyright. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742562328.85925}