{"duration": 0.16242504119873047, "input_args": {"text": "'The Hill newspaper has taken the rare step of removing an   article mocking Hollywood celebrity Lindsay Lohan’s dalliance with Islam following a flurry of   from Islamic advocates and a Washington Post reporter. [The mocking article, headlined “Lindsay Lohan May Have Made Her Worst Life Choice Yet,” mocked Lohan for her public endorsements of Islam, and warned her that multiple other   converts have subsequently gotten themselves jailed or killed while trying to implement Islam’s many calls for jihad against  .  Lindsay Lohan has sparked widespread speculation that she has converted to Islam by deleting everything on her Instagram account except for the Arabic greeting “Alaikum salam” (upon you be peace)  …     So what’s not to like? Converts and prospective converts are never told about how so many converts to Islam end up as jihad terrorists, most notably including John Walker Lindh, the “Marin County Mujahid” who was discovered fighting alongside the Taliban and   against American troops in Afghanistan, and Adam Gadahn, the   “revolting geek of mass proportions” who, like Lindh, discovered Islam through rap music and black grievance theater (neither were black, but both wished they were) read the Qur’an and realized that one   way to please Allah was to wage jihad against infidels, and set out to do just that.   …     Gadahn, Lindh, and numerous other converts illustrate the appeal of conversion to Islam among the psychically marginal, who find comfort in the fact that Islam has a rule (and sometimes many rules) for every imaginable human activity, relieving them of the responsibility of having to make tough moral and ethical decisions themselves. The article was penned by Robert Spencer, the prolific and   author of many books about Islam, including book, Did Muhammed Exist? An Inquiry Into Islam’s Obscure Origins. Spencer also runs the Jihad Watch website, and frequently asks Islamic advocates to engage in   public debate. As he repeatedly says, Spencer does not argue that all Muslims are radicals or jihadis. Instead, he simply argues that the written, hegemonic doctrines of orthodox Islam encourage many Muslims to provide charity to each other, and to tolerate, support or even demonstrate hostility and aggression towards  . Similarly, while not all Christians are pacifist, saintly or charitable, orthodox Christian doctrines encourage believers to promote generosity towards others and to use violence only as a last resort. In his article for The Hill, Spencer criticized Islam by referring to commandments in the Koran, which Islam says is the perfectly copied transcript of their deity’s unchangeable,   commandments. Lohan has fueled this kind of speculation [about a possible conversion to Islam] in the past, saying in 2015: “My very close friends, who have been there for me a lot, in London are Saudi and they gave me the Qur’an and I brought it to New York because I was learning. It opened doors for me to experience spiritually, to find another true meaning. This is who I am. ” She didn’t say what “true meaning” she found in Qur’anic injunctions sanctioning   (Qur’an 4:34) devaluing of women’s testimony (Qur’an 2:282) and inheritance rights (Qur’an 4:11) allowance for polygamy (Qur’an 4:3) or mandate of warfare against and subjugation of unbelievers (Qur’an 9:29) but that’s just the beginning of the absurdity. The Hill says “The Hill stands alone in delivering solid,   and objective reporting on the business of Washington, covering the   of Congress, as well as the nexus between politics and business. The Hill serves to connect the players, define the issues and influence the way Washington’s decision makers view the debate. ” The Hill declined to explain its decision to Breitbart. When asked about TheHill‘s takedown, Spencer told Breitbart, “I had never been published there before. I don’t care about Lohan and never would have written about her, but they asked me to. ” Before this episode, Spencer said he has never seen one of his articles removed after publication. “No, I haven’t had an article published and then taken down before. ” Spencer pins the blame on Bob Cusack, The Hill‘s   . “Sharia cowardice at @thehill,” Spencer Tweeted. Spencer also called for Cusack’s firing. “It’s time to start a pushback for truth and free speech: Fire Fascist Bob!” It’s time to start a pushback for truth and free speech: Fire Fascist Bob! @BobCusack @thehill https:  .  pic. twitter.   —   Robert Spencer (@jihadwatchRS) January 19, 2017,  Spencer also scoffed at the Muslims’ complaints about his article, noting that his opponents have not mounted a   criticism of his article’s facts, logic and fairness. “The Left traffics in demonization and marginalization of its foes, as it cannot meet them on an even playing field intellectually,” he told Breitbart. Among those celebrating the removal of the article was the Washington Post‘s   correspondent covering Syria, Lebanon and Iraq, Liz Sly. Sly called Spencer’s article “rabidly Islamophobic. ” A phobia is defined as “an extreme or irrational fear of or aversion to something,” and is regarded as a mental illness. The Hill (@thehill) has removed that rabidly Islamophobic article on Lindsay Lohan from its website. Good for them https:  .   —   Liz Sly (@LizSly) January 19, 2017,  Breitbart asked Sly at the Washington Post to explain her comments, and received this Tweet in response. FYI I didn’t receive any request for comment, but I stand by my tweets. @andrewbostom @thehill @NeilMunroDC,  —   Liz Sly (@LizSly) January 19, 2017,  Islamic advocates assailed Spencer’s s article via Twitter, without providing any rebuttals against Spencer’s statements or arguments about Islam. . @thehill  —   why did you ask anti Muslim hatemonger Robert Spencer to write this piece on Lindsay Lohan  Islam?  https:  .   —   Wajahat Ali (@WajahatAli) January 18, 2017,  . @thehill commissions massive Islamophobe Robert Spencer to chastise Lindsay Lohan for potentially becoming Muslim. How is this OK? pic. twitter.   —   Sara Yasin (@missyasin) January 18, 2017,  @RubaAlHassani True and it’s also written by              Robert Spencer,  —   آل خليفة كلاب خبيثة (@shaykhdaniel) January 19, 2017,  Does @thehill just publish anything? This is total #Islamophobic garbage, very low. Robert Spencer is a know bigot: https:  .   —   Michael K. (@MichaelD_Kaplan) January 18, 2017,  Wow. @thehill lets notorious islamophobic asshole Robert Spencer go   on their site. https:  .   —   Amarnath Amarasingam (@AmarAmarasingam) January 18, 2017,  What an extraordinarily bigoted piece for such a respected publication as @thehill. The mainstreaming of hate https:  .   —   Liz Sly (@LizSly) January 18, 2017,  Dean Obeidallah, a columnist at The Daily Beast who has helped raise funds for the   Council on   Relations (CAIR) also weighed in on the incident. CAIR has been declared a terrorist organization by the United Arab Emirates and was named by federal prosecutors as an unindicted   in a   operation. Hey @bobcusack just saw Robert Spencer’s vile   article on ur publication @thehill Next will u give  + racists platform,  —   (((DeanObeidallah))) (@Deanofcomedy) January 18, 2017,  The CAIR group is so closely entwined with Islamists and with jihadis that court documents and news reports show that at least five of its people  —   either board members, employees or former employees  —   have been jailed or repatriated from the United States for various financial and   offenses. The record highlighted by critics also shows that CAIR was named an unindicted   in a   criminal effort to deliver $12 million to the HAMAS jihad group, that it was founded with $490, 000 from HAMAS, and that the FBI bans   meetings with CAIR officials. Multiple   translations of the Koran have been posted here, here and here on the Internet by orthodox Islamic advocates, allowing Americans to individually study Islam’ combination of religion and ideology. Spencer   an 2015 art exhibition in Texas, featuring conventional cartoons of the Islamic prophet. Two armed Muslims attacked the exhibition, but were quickly killed by Spencer’s security guards before they could do more harm. Spencer hired the security guards because he expected Islam’s doctrines would push some Muslims to attack his art show. Since then, Spencer has continued his writing and debating about Islam’s jihad doctrine. Breitbart. com has published several articles by Spencer, and has quoted him numerous times. The Spencer article, and the readers’ comments, are archived here. The article has been updated with a reply from Sly at the Washington Post. '"}, "time": 1742563618.229677}