{"duration": 0.08483481407165527, "input_args": {"text": "'Region: Southern Asia The fight against terrorism is increasingly a key issue for all countries, and it is quite natural that it has drawn the attention of the participants of the 8th BRICS summit. However, India has a particular interest in focusing attention on it after terrorists from the radical group “Jaish-e-Mohammed” (“Army of Mohammed”) committed attacks on the Indian infantry battalion garrison near the town of Uri, 10 km from the Line of Control in Kashmir on September 18th. India held Pakistan responsible for the deaths of 18 Indian soldiers, and claimed that it supports these terrorists. On Twitter, Rajnath Singh, the Home Minister, described the attack as a cross-border invasion of militants trained and armed by Pakistan, and called it a “terrorist state.” Speaking at the 71st session of the UN General Assembly, the representative of India raised the issue of Pakistan’s support for cross-border terrorism, which has both a regional and global impact. India responded to the terrorist attack with surgical strikes on their bases in the Pakistan-controlled part of Kashmir, which destroyed seven militant hideouts and killed more than 35 extremists. Despite protests from Pakistan, the world community has not condemned India’s actions. Relations between the two countries have entered a new round of confrontation that has also involved the BRICS countries. The problem of terrorism brought up by Narendra Modi at the summit (which was condemned by Pakistan) turned out not to have such a simple solution as it affects the interests of other members of the organization, especially Russia and China. At the opening of the meeting, N. Modi said: “In our region, terrorism poses a grave threat to peace, security and development. Tragically the mothership of terrorism is a country in India’s neighbourhood. Terror modules around the world are linked to this mothership. BRICS must speak in one voice against this threat.” Earlier at the G20 meeting on September 5th, N. Modi called for the isolation and punishment of those who sponsor or support terrorism. Thus, when discussing the issue of terrorism, the BRICS countries de facto had to answer the question of who they support more: \\xadIndia or Pakistan in their struggle for leadership in South Asia. In spite of the Russia-Pakistan joint military exercises carried out shortly before the summit, N. Modi decided not only not to focus attention on this issue but put every effort into winning the support of Russia, which he called “old friend” (in Russian), and expressed his appreciation for the unequivocal condemnation of the terrorist attack on an army garrison in Uri. In the Joint Statement issued following the visit of Russian President Vladimir Putin to the Republic of India on October 15, 2016, the parties stressed the need to avoid the emergence of ‘safe havens’ for terrorists. Although the wording is rather vague and does not point directly to Pakistan as a ‘safe haven’ for terrorists, India was satisfied with it. While answering the journalists’ questions about military ties between Russia and Pakistan, the Deputy Foreign Minister of India Subrahmanyam Jaishankar said that Russia would not do anything that could harm India’s interests. There is full understanding between Russia and India. At the summit, this was actually proved by the strengthening of the military-technical and economic cooperation between the two countries. As for China, its position regarding the involvement of Pakistan in the terrorist attack to India, was announced even earlier, when it blocked the Indian proposal to include Masood Azhar, the leader of the Pakistan-based Jaish-e-Mohammad, into the list of international terrorists, declared illegal by the UN. India considers him responsible for a series of terrorist attacks in the country including the attack of December 13, 2001 on the Parliament and of January 2, 2016 on the Pathankot Air Force Station. The issue, of course, is not about Masood Azhar. As it was officially announced, “China opposes all forms of terrorism. Double standards in combating terrorism should be abandoned. However, it is also unacceptable to use the fight against terrorism as a pretext for political purposes.” China is governed by purely pragmatic economic and political considerations underlying its rapprochement with Pakistan. Politically, China wants to use Pakistan as a geopolitical player, able to resist the growing influence of India in South Asia, and as a link with the Islamic world. Expansion of military cooperation between India and the United States also causes concern among the Chinese leadership as it could adversely affect China’s plans in the Indian Ocean. In addition to the geopolitical rivalry between China and India, the fact that India provides protection to the Dalai Lama is a further irritant to their relations. Pakistan is also of economic interest to China in terms of the realisation of its ambitious initiative, “One Belt, One Road”. Although N. Modi tried to persuade Xi Jinping that India and China, as ‘victims of terrorism’, should not conduct different approaches to counter it; the Chinese leader acknowledged the growing threat of terrorism and condemned all its forms in his 10-minute speech at the summit, however he limited himself to stating the need to strengthen dialogue on security and partnership in the region. China’s position on Masood Azhar remained unchanged. India’s attempts to politicise the issue of terrorism at the BRICS summit in order to isolate Pakistan politically as a country “which provides havens for terrorists and arms them” failed. The leaders of the five countries reasonably remained neutral and demonstrated political foresight, in order not to aggravate the situation in South Asia which may be used by the terrorists to enhance their activities. Natalya Rogozhina, Ph.D. in Political Science, senior research fellow at the Institute of World Economy and International Relations, the Russian Academy of Sciences, exclusively for the online magazine “ New Eastern Outlook. “ \\n'"}, "time": 1742562370.6060834}