{"duration": 0.07535409927368164, "input_args": {"text": "'Tuesday 22 November 2016 by Mark Maguire Kanye West rushed to hospital with suspected ‘dislocated ego’ \\nRap ‘legend’ Kanye West is this evening undergoing emergency treatment for a suspected dislocated ego, suffered while talking to himself in the mirror. \\nThe self-loving 39-year-old was rushed to hospital after a member of his entourage noticed worrying signs that the usually conceited front-man was not his normal vanity-obsessed self. \\nThey told reporters, “One minute everything seemed fine, and he was swaggering around the place looking down his nose at all the rest of us, like normal. \\n“Then, what seemed like just seconds later, he was stood at the side of the room, shoulders slumped, displaying some frankly worrying signs of genuine humility. \\n“I asked him he was OK, but all he could say was, ‘The Life of Pablo – that album is just a load of old self-indulgent horseshit, isn’t it?’. I’m not afraid to admit that at that moment, I was terrified.” \\n“It soon became a race to see how quickly we could reach the emergency services and get him some treatment before the ego suffered permanent damage.” \\nThe star’s support staff reacted swiftly, with an on-site emergency first-aider ensuring Kanye received some much needed mouth-to-ear ego stroking. \\nOne witness explained, “I think that first-aid saved his ego to be honest – they just seemed to instinctively know how to react, and the right thing to say. Thankfully the paramedics arrived after just a few minutes. \\n“They brought all this incredible equipment and spent about fifteen minutes applying emergency ego-massage, while the rest of us just looked on in horror. \\n“Fortunately they managed to stabilise him so that they could get him to the hospital, but they continued the ego-massage as they loaded him into the ambulance. \\n“The last thing I heard them say was, ‘You’re amazing Kanye, and The College Dropout is the best album of the last twenty years, and that’s absolutely all down to you, and you alone’.” \\nKanye was rushed to a specialist ‘Ego Hospital’ in Beverly Hills and underwent a complex eight-hour surgery to re-locate the ego, which Doctors have declared a complete success. \\nA hospital spokesperson confirmed that his recuperation could take up to eight weeks, but that he would likely make a full recovery and should return to his previous levels of brazen egotism. Get the best NewsThump stories in your mailbox every Friday, for FREE! There are currently witterings below - why not add your own? '"}, "time": 1742562740.821095}