{"duration": 0.0332486629486084, "input_args": {"text": "'The Washington Examiner has published an account of a meeting of the American Constitution Society  —   the left’s version of the conservative Federalist Society of lawyers  —   at which participants discussed how to encourage the “deep state” to undermine President Donald Trump. [Ryan Lovelace of the Examiner reported Saturday:  Forlorn liberals took refuge at the American Constitution Society’s national convention in Washington this week, discussing whether to encourage the growth of the “deep state” resistance inside the government or fight President Trump from outside.   …     UCLA law professor Jon Michaels said he favors filling the Trump administration with liberals opposed to Trump’s agenda. “We hear a lot of language about draining the swamp and this idea about a deep state that somehow was going to thwart the intentions or the political mandate of the president,” Michaels said. “I kind of embrace this notion of the ‘deep state. ’” Michaels listed his ideas for how to ensure the success of the “deep state. ” Act as a group  —   a department, across agency lines, as a community  —   rather than as an individual when pushing back against Trump from the inside, he said. Once such a coalition is formed, he suggested “rogue tweeting” or “leaking to the media” as options for fighting the president. Some present also discussed the possibility of using federalism to oppose Trump. For more than a century, liberals have opposed federalism, preferring rule by the federal government over allowing states to govern their own affairs. However,   states like California have newfound enthusiasm for federalism  —   although their version has more to do with ignoring federal law altogether, rather than exercising state powers and prerogatives. Read the full Examiner article here. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628401.830082}