{"duration": 0.1299905776977539, "input_args": {"text": "'SAN FRANCISCO  —   Paraag Marathe’s structured, analytical mind has served him well in the offices of Silicon Valley and the National Football League. He figured that he could lean on those traits the first time he spoke publicly about his sister, Shilpa, and how anorexia had taken her life. But composure failed Marathe in 2011, six years after Shilpa’s death, while he spoke to survivors and grieving family members at an event for Andrea’s Voice, a nonprofit foundation that tries to promote education about eating disorders and their treatments. “Not only did I break down a little bit during that speech,” said Marathe, 39, the San Francisco 49ers’ chief strategy officer and executive vice president for football operations. “It was also one of those weird moments afterwards. I emotionally collapsed in the arms of somebody there who had lost her daughter. ” The memories were back. Marathe had watched his brilliant sister succumb to   thoughts and starve herself. He had seen Shilpa wither to less than 50 pounds in the last years of her life, had felt the shame and puzzlement that her condition brought to his family. Fueled by regret  —   why had he not noticed sooner, and why wasn’t he more assertive in trying to help Shilpa?  —   Marathe has found his voice. He will patiently tell you that 30 million Americans are believed to suffer from eating disorders, and that medical insurance plans rarely cover treatment of the condition. He will remind you that anorexia has the highest fatality rate among mental illnesses  —   about 10 percent, according to a 2011   published in Archives of General Psychiatry and cited by the National Institute of Mental Health.   caregivers and advocates welcome Marathe’s help in shattering the myth that anorexia afflicts only    white girls and women. The illness claims men, too, and frequently remains a taboo subject in less affluent or nonwhite families, said Kristina Saffran of Project HEAL, an organization that raises money to cover care from diagnosis to recovery. “He told me, ‘I’m your perfect spokesman: I’m a male, I’m a minority and I’m in football,’ ” Saffran said. Paraag and Shilpa grew up in Saratoga, Calif. a prosperous bedroom community southwest of San Jose. They were the children of successful Indian immigrants. Paraag, three years younger, was gregarious and smart, but drawn more to Wiffle ball and Nerf football than homework. Shilpa was bookish and introverted, a   student she hated sports. She also had compulsive idiosyncrasies. Shilpa insisted on eating her meals at the same time every day, her brother said. After dinner each night she would walk around the house for half an hour listening to her Sony Walkman. Marathe said he thinks now that Shilpa was showing signs of mental illness as far back as junior high school. At the time, just a child himself, he dismissed the signs as typical of his “weird sister. ” By the time Shilpa graduated from law school at U. C. L. A. (magna cum laude, of course) she was down to 55 pounds, Marathe said. He remembers that firms eagerly invited her for job interviews after reading the incisive legal papers she wrote, but no one would hire her after seeing her in person. Shilpa spent her final 10 years living with her parents. She died at 31 in March 2005. It took Marathe years to emerge from a cocoon of secrecy. He had friends who never met Shilpa. That included his wife, Jennifer, who Marathe said became his best friend when they were at the University of California, Berkeley. In retrospect, he sees his own vanity. “I was a kid,” Marathe said. “I was in my early 20s, and I used to convince myself that I was just a protective little brother when I saw other people looking at my sister the way they did. When in reality, the truth was that I was embarrassed by being seen with her. So I could never take her to a coffee shop or a movie. I used to be jealous of my cousins who would be able to do that. ” Marathe is now on the board of directors for Andrea’s Voice, and he has supported other similar organizations in Northern California, like the Eating Disorder Resource Center and the Monterey Institute of Mental Health. But there is one place where Marathe has not dared to tread. He still has not found a way to discuss Shilpa’s deterioration in any detail with their parents, or invited them to hear him speak about it. He recognizes deep sacrifices they made for Shilpa: Their father quit his job as an engineer at   to help care for her and carried her to bed when she became too weak to climb the stairs. His mother changed Shilpa’s diapers and dutifully steamed broccoli for her. The family spent huge sums of money on her treatment, including what Marathe estimates were 30 trips to the emergency room or intensive care unit and, later, hospice care. Through all of that, he said, he never heard his parents talk openly about what was happening to their family. And he hasn’t figured out how to break the silence. “Immigrant families are particularly susceptible, because of the whole Tiger Mother, Tiger Father concept,” Marathe said. “You don’t talk about your feelings. There’s no such thing as mental illness. You don’t want to bring shame on the family by being put in an inpatient facility. ” Marathe hopes to talk with his parents soon, so he can share his growing understanding of Shilpa’s illness. What he has learned, as well as the help he tries to offer, brings him some comfort. Marathe’s 16th year with the 49ers has been bumpy. He lost the title of team president in February. The organization called it a restructuring, but it was largely reported as a demotion for Marathe. The 49ers have been dreadful on the field, and the fan base has grown rebellious with management. Coming to terms with his sister’s death, however, has kept professional disappointment in perspective. He and his wife have a young daughter, Juniper. A few months ago, just before her first birthday, Juniper was standing on her own and clearly ready to walk. But she couldn’t muster the courage to take that first step. As he watched her, something clicked for Marathe. “I want to do everything I can to help her develop   or ” he said. “My sister didn’t have that. She felt worthless. ” Marathe knows that his words alone won’t erase the despair of anorexia. But they’re a powerful first step.'"}, "time": 1742563672.8646123}