{"duration": 0.02726006507873535, "input_args": {"text": "'Pinterest \\nThe FBI is reopening the criminal investigation into Hillary Clinton’s email case. \\nThe news came while Clinton was without WiFi on a flight to an Iowa campaign stop, so while reporters hurled questions at her upon landing, all Clinton could muster was the old smile-and-wave. \\nLater, after collecting her thoughts, Clinton faced national reporters eager to hear her reaction and declared that the FBI needs to explain their behavior against her. \\n“We are 11 days out from perhaps the most important national elections of our lifetimes,” Clinton said . “Voting is already underway in our country. So the American people deserve to get the full and complete facts immediately.” \\nLike so many others who’ve jumped to defend her after FBI Director James Comey announced there would be an investigation into newly uncovered emails, Clinton claimed that the FBI should have kept their mouths shut until after the election. \\nThere’s an election going on, after all. \\nAnd Clinton thinks it’s “perhaps the most important national election of our lifetimes” because she thinks her opponent isn’t fit to lead. \\nIf the FBI investigates her, they’re disturbing the nation. They’re disrupting the election. While many voters believe candidates for president ought to be held to the same standards as anyone else, and the truth can only help Americans make the right decision in the polls, Clinton thinks the FBI was wrong to announce the latest uncover to the public. \\nTypical of someone who has so much to lose for having done so much wrong. \\nPerhaps her continual insistence that she is above the law for one reason or another is why there’s been so much backlash already. \\nIndependent Journal Review reports: \\nIn Wisconsin and Minnesota , there are already reports of voters coming back to their polling offices to change their votes. And in Maine, the Secretary of State has allowed voters the option of switching votes in past elections. \\nThe fallout could be intense, as the polls have tightened dramatically in recent days. Tracking the same ABC/WaPo poll that had Hillary Clinton up four points earlier this week shows them within just two points on Saturday: \\nIt’s clear that Clinton is rapidly losing supporters as the election draws near, while Trump is gaining. \\nIf Clinton believes that being a presidential candidate in a close election should excuse her from investigation, what will she think her role as president would grant her? \\nIf current trends continue, she might not get that chance. \\nIndependent Journal Review continues: \\nThe national polls aggregated by Real Clear Politics have the spread at 3.8 points. The battleground states of Florida , Arizona , and North Carolina are down to thin margins for Hillary Clinton, and Trump has the lead in Iowa , Georgia , and Ohio . Trump still trails by a significant, but not insurmountable, margin in Pennsylvania and Virginia . \\nBe sure to let us know what you think, and sound off in the comments below.'"}, "time": 1742628568.6790435}