{"duration": 0.09495162963867188, "input_args": {"text": "'Donate How Cities Can Protect People Threatened by Trumpism Cities can offer shelter and protection to their vulnerable citizens and become a place progressives can exert real power. By Arun Gupta / yesmagazine.org \\nThe disbelief, shock, and anguish that Donald Trump is now president-elect is giving way to waves of protests. Tens of thousands are hitting the streets in cities large and small, blocking roads, and rejecting Trump’s blatant racism, misogyny, and Islamophobia. \\nBut Trump is swiftly assembling a cabinet. The names being floated include some of the most dangerous fanatics, demagogues, and authoritarians in America, such as Rudy Giuliani, Sarah Palin, Ben Carson, Newt Gingrich, and Chris Christie. Trump has drawn considerable support for his proposals to deport undocumented immigrants, force Muslims to register with the government , and ban immigration from specific countries. He has allied himself with hardliners opposed to abortion and LGBTQ rights, and his website still includes a call for a “complete and total shutdown of Muslims entering the United States.” \\nNot surprisingly, the targets of these policies are terrified. \\nBut there is also a chance to create bulwarks of resistance that can minimize much of the harm, while creating space for movements to build power and eventually challenge Trump’s agenda. \\nLet’s start in the cities. Cities are places of great diversity, creativity, and tolerance. They are the economic engines of the United States, producing much of the wealth, and where 63 percent of the population lives . Cities are the one place where the left and progressives can exert real power. \\nWe should start organizing to make cities powerful bastions of noncooperation, resistance, and protection. Activists and organizations can start demanding in every city that city councils and mayors issue resolutions and statements saying: \\n1. Our city will not assist or cooperate with any raids or detentions or deportations of any immigrants. This includes assistance of local law enforcement or providing data to the federal government. Already, Seattle Mayor Ed Murray has pledged it will remain a sanctuary city even if Trump cuts off federal funds, as he has vowed to do. \\n2. Our city will not cooperate or assist with registration and surveillance programs of Muslims, or any attempts to make our friends, neighbors, and loved ones the enemy. \\n3. Our city is a safe zone for all immigrants, Muslims, LGBTQ people, women, and anyone fearing persecution from the Trump regime. \\n4. Our cities reject any effort to criminalize or attack Black Lives Matter or other organizing for social justice, as Trump has suggested he might do. \\nIt’s vital to go beyond nice-sounding but toothless resolutions. This would involve directing city and county attorneys to design legal strategies to resist odious federal policies. It means exerting strong civilian control of police departments, which a Trump administration will try to enlist as front-line troops to persecute entire communities. \\nIt’s also vital to pass other resolutions and statements asserting unequivocal support for full reproductive health care for women; no attacks on the right to organize or unions; no attacks on workers’ wages, benefits, or health care; and an end to the fossil fuel economy and a rapid and just transition. Complementary strategies can also be developed to make cities more welcoming for LGBT youth and for women denied abortion by creating networks to fund travel and lodging. But it will take organizing to bring local governments on board with such an agenda. \\nMany city governments will try to do the minimum and hope protests die down. So there will be a need to organize to get community groups, unions, activist organizations, professional groups, and businesses on board for strong resolutions and action. \\nThe strategy should be to build a broad-based movement with a focused agenda. In other words, we want as many people on board as possible, but there are also minimum, nonnegotiable demands to protect vulnerable communities. \\nMeetings should start happening citywide, in communities and in neighborhoods. Meet with your neighbors, meet with your coworkers. If you’re a student, meet with other students. Wherever possible. \\nA lot of horrendous things are going to happen, so we need to resist fiercely and build bastions of noncooperation and protection throughout the country. We have to defeat Trumpism without getting suckered into a failed Democratic Party. \\nThe world is counting on us. \\nArun Gupta wrote this article for YES! Magazine . Arun is an investigative reporter who contributes to YES! Magazine, The Nation, Telesur, The Progressive, Raw Story, and The Washington Post. He is a graduate of the French Culinary Institute in New York City and author of the upcoming “Bacon as a Weapon of Mass Destruction: A Junk-Food-Loving Chef’s Inquiry into Taste” (The New Press). Follow him on Twitter @arunindy . 4.0 ·'"}, "time": 1742564162.6014533}