{"duration": 0.09847068786621094, "input_args": {"text": "'In our previous article The Secret Truth about Russia Exposed, we elaborated on how Russia is a convenient enemy for politicians and specifically the Democratic party, to create an enemy that really , well - doesn\\'t exist to distract and confuse voters. But like with any \\'enemy\\' if you bomb a village, you may have some pissed off villagers. As we explain in our best selling book Splitting Pennies - the world doesn\\'t work the way you see on TV - in fact, it works more closely as seen on Zero Hedge. \\nAlthough Russia simply is just a country in the wrong place at the wrong time (which, throughout Russian history, seems to be a theme for them) - there really is a reason the Elite hate Russia. It\\'s not because they\\'re Xenophobic, although there\\'s that too - it\\'s because of several key factors that make Russia a unique power in the world, compared to similar countries. \\n1. Russia is an independent country. It\\'s not possible to manipulate Russia via external remote control, like it is most countries. The Elite don\\'t like that! Russia kicked out Soros \"Open Society\": Russia has banned a pro-democracy charity founded by hedge fund billionaire George Soros, saying the organization posed a threat to both state security and the Russian constitution. In a statement released Monday morning, Russia\\'s General Prosecutor\\'s Office said two branches of Soros\\' charity network — the Open Society Foundations (OSF) and the Open Society Institute (OSI) — would be placed on a \"stop list\" of foreign non-governmental organizations whose activities have been deemed \"undesirable\" by the Russian state. \\n2. Russia is not easy to cripple via clandestine means, whether it be CIA, MI6, or outright military conflict. Some other BRICs however, that\\'s not the case. Say what you will about Russia\\'s military - it\\'s on par and in many cases, advanced, compared to the US military. And that\\'s not AN opinion, that\\'s in the opinion of top US military commanders: Late in September, we brought you “ US Readies Battle Plans For Baltic War With Russia ” in which we described a series of thought experiments undertaken by The Pentagon in an effort to determine what the likely outcome would be should something go horribly “wrong” on the way to landing the US in a shooting war with Russia in the Balkans. \\nThe results of those thought experiments were not encouraging. As a reminder, here’s how Foreign Policy summed up the exercises: \\n3. Russian culture, and language, is too complex for the average \"Elite\" who pretends to be internationally well versed because they had a few semesters of French. For example, when the diplomat Clinton was Secretary of State, she presented a reset button translating the opposite meaning... ooops. \"I would like to present you with a little gift that represents what President Obama and Vice President Biden and I have been saying and that is: \\'We want to reset our relationship, and so we will do it together.\\' ... \\n\"We worked hard to get the right Russian word. Do you think we got it?\" she asked Lavrov, laughing. “You got it wrong,\" said Lavrov, as both diplomats laughed. \\n“It should be “perezagruzka” [the Russian word for reset],\" said Lavrov.\"This says ‘peregruzka,’ which means ‘overcharged.’” \\nYes, it\\'s almost a certainty that if Clinton by some horrible fate is President there will be Nuclear war. Wars have been started over much more subtle mistakes. One would think, that Clinton would have had an advisor CHECK THIS before presenting it in a public ceremony, in front of reporters? How much more blatantly unprofessional can one be? If politicians worked in the private sector, they wouldn\\'t last a day! How do these people advance so far in politics? \\n4. Plain and simple, the Elite do not control Russia. While there are backchannels of Russian oligarchs that work directly with Western Rothschild interests, for example, they simply don\\'t have the same level of control as they do European countries, like Germany for instance. Or another good example is China, there\\'s this fanatical talk that China can dump US Treasuries blah blah blah the fact is that China is completely dependent on USA and US Dollars, and will be for the rest of our lives. Maybe in 1000 years in the Dong Dynasty still to come they will rule the world but it\\'s not going to happen anytime soon. \\nRussia is one of the most highly misunderstood cultures in the West. Which is strange, because Russia is more like America than any European country: Both Russia and America share huge landmasses with large undeveloped territory Both Russia and America are predominantly white christian majorities (although in last decades, America tries to be more of a melting pot whereas Russia favors ethnic cleansing) Both Russia and America fought against Hitler and the Nazis during World War 2, the defining event of the last 60 years \\nThere have been numerous interesting situations where Russia helped America and America helped Russia on a number of levels, to learn more about it checkout the following books: \\nWall Street and the Bolshevik Revolution . Armand Hammer: The Untold Story \\nMost interestingly, during the Nixon administration Kissinger was prodding Nixon to partner with Russia that would, in Kissinger\\'s view would create an unstoppable alliance, that no one could compete with such a superpower axis. But, it didn\\'t happen, as there were \\'neo-cons\\' who were against it, mostly Polish Catholics who have some deep genetic fear of any culture using the Cyrillic alphabet. \\nNixon instead chose China (what a mistake!) and created Forex. But the point being that, through a small slip of fate, \"China\" may have been in this alternative Kissinger reality the \\'Great Evil Enemy\\' hacking our elections, as we drive across the Alaskan-Siberian highway without any speed limit, oil would be ten cents a gallon, and we wouldn\\'t need to war with the Middle East. Did you enjoy this article? - Consider helping us! Russia Insider depends on your donations: the more you give, the more we can do. $1 $10 Other amount \\nIf you wish you make a tax-deductible contribution of $1,000 or more, please visit our Support page for instructions Click here for our commenting guidelines On fire'"}, "time": 1742564400.1223722}