{"duration": 0.006994724273681641, "input_args": {"text": "'Get short URL 0 27 0 0 The head of the German delegation, which is currently visiting Crimea, Andreas Maurer pledged on Wednesday to respond to the Ukrainian authorities\\' threats over the unauthorized trip, with another visit to the peninsula. \\nSIMFEROPOL (Sputnik) — Maurer, who is the chairman of the Left Party (Die Linke) parliamentary faction in the town of Quakenbruck in Lower Saxony, also noted that the Ukrainian authorities had threatened him with up to three years in prison for visiting the peninsula . © Sputnik/ Sergey Malgavko Putin: Crimean Integration Into Russian Legal Framework Goes Forward \"I will respond to such sanctions with my next trip to Crimea . There is nothing they can do to me, it is just ridiculous. As a German citizen and a citizen of Europe, I will never allow anyone to tell me where to go and with whom to communicate,\" Maurer said at a press conference at the Rossiya Segodnya International Information Agency’s press center in Crimea . \\nHe added that Ukraine was mistaken in assuming it could \"dictate to the people of Germany, where they may travel.\" © Sputnik/ Vladimir Sergeev Strength Through Unity: EU to Stay United on Policy Toward Russia According to the guidelines on the legal regime of Crimea issued by the Ukrainian Foreign Ministry, entry and exit of foreigners from the region is allowed only with the special permission via relevant control checkpoints.\\nThe German delegation consists of 20 people, including politicians, acting lawmakers, public figures, and entrepreneurs. The delegation is visiting the peninsula within the framework of people\\'s diplomacy project and will stay there until Friday. \\nCrimea, Russia\\'s historical southern region, seceded from Ukraine to rejoin Russia in March 2014. Almost 97 percent of the region\\'s population voted for reunification in a referendum. Sevastopol, which has a federal city status, supported the move by 95.6 percent of votes. The referendum was held after a coup in Ukraine in February 2014. Kiev, as well as the European Union, the United States and their allies, did not recognize the move and consider the peninsula to be an occupied territory. ...'"}, "time": 1742628458.4264743}