{"duration": 0.07302546501159668, "input_args": {"text": "'by ARIANA MARISOL \\nThis little-known, anti-aging superfood can help prevent cancer, lower bad cholesterol, support the immune system, and much more! Chaga , otherwise knowns as Inontus Obliquuus , is a wild mushroom that grows on birch trees in extremely cold regions. Chaga can be found in the Baltic regions, Scandinavia, Siberia, Alaska, and northern Canada where temperatures fall bellow -30 F for over 2 to 3 months per year. The chaga conk grows in cooperation with the birch tree over a seven to twenty year period, absorbing life-sustaining nutrients from the tree. This medicinal mushroom’s DNA structure is 30% more human than it is plant. \\n\\nChaga has been used medicinally for centuries. The Inuit never used chaga and had an average lifespan of only forty to fifty years whereas people in Siberian tribes who used chaga had a lifespan of ninety to over one hundred years. Indigenous Siberians would grind it and put it in stews, soups, and daily beverages. The Siberians found that, despite their harsh climate, the regular consumption of chaga prevented the onset of various degenerative diseases. Contemporary Russians have found that the districts that regularly used chaga had no traces of cancer. \\n[Suggested Reading: Know These Important Rules Before You Forage ] \\nChaga was also traditionally used by many ancient peoples of China, Korea, and Eastern Europe. In Russia and other parts of Eastern Europe, it is considered a cancer cure. In Northern Canada it is known as a cure for tumors. In Korea, it is used to fight stress and regulate energy. It is also known for its ability to cure inflammatory skin conditions such as psoriasis and eczema. In Eastern Europe it is also known for its powers against bronchitic and lung disease. \\n\\nFor centuries, people in the East have traditionally consumed chaga in tea. More recently, chaga has gained popularity in the West where enormous amounts of health benefits are beginning to be recognized by many health gurus. \\n\\nHere are only a few of chaga’s health benefits. \\n\\nSupports Immune System An abundance of Beta-D-Glucans are found in chaga. These help balance the response of the body’s immune system . This means chaga can help boost the immune system when it is necessary, while also having the ability to slow it down when it is overactive. This makes chaga a natural Biological Response Modifier (BRM). \\n\\nCancer Fighting Medical researchers have gone to Siberia to learn about the effects of chaga on the indigenous people of the region. The medical team found that although there was a lot of talk about cancer, not a single cancer patient was admitted to any of the hospitals in the region. They also found that these people were brewing chaga instead of coffee in order to save money. Researchers found that these people were unwittingly treating themselves for cancer prevention. \\n\\nChaga has a very high content of super-oxide dismutase (SOD), an important enzyme that functions as a powerful antioxidant. SOD occurs naturally in different forms in human tissues, but levels decline with age, greatly declining after age thirty. Chaga provides SOD in a form that can be used both topically and internally. Having been studied in about 900 different clinical trials, the health benefits of its use are clear. Cancer patients undergoing radiation who were given SOD in a form that they could absorb had dramatically better survival rates with less toxicity, less scarring, and better wound healing. \\n\\nChaga also activates immune cells responsible for combating cancer initiation. Research is ongoing, and more studies must be done to determine chaga’s full role in fighting cancer. \\n\\nSoothing Properties Chaga is able to support the integrity of blood vessels and can provide soothing properties during irritation. This is helpful for people who suffer from pain, neuropathy, and diabetes. \\n\\nUlcers and Gastritis Chaga has been known to treat ulcers and support gastrointestinal health. Most ulcers are caused by bacteria that can be fought off by a well-functioning immune system. \\n\\nNormalize Blood Pressure and Cholesterol Levels The betulinic acid found in chaga is able to break down LDL cholesterol (bad cholesterol) in the bloodstream. \\n\\nAnti-Aging SOD performs vital anti-aging functions by neutralizing oxygen free radicals, and preventing oxidative damage to cells, and tissue. For this reason, chaga is supremely healthy for the skin. It has proven to be highly anti-aging as well as therapeutic for skin disorders. \\n\\nYou can make a face cream with chaga, raw beeswax, and spice oils. \\n\\nWhat are the properties in chaga that make it so healthy? \\n\\nPolysaccharides Chaga contains structural polysaccharides which provide energy, cardiovascular health, intestinal and liver health, and promote healthy blood sugar levels. These can also improve your mood. \\n\\nBeta-D-Glucans Beta-D-Glucans are known for their ability to help the immune system. They can also help with normalizing cholesterol levels and blood pressure. \\n\\nPhytosterols Chaga contains many phytosterols , 45% of them being Lanosterol, 25% of them being Inotodiols and a ramaining 30% of them being Egosterol, Fecosterol, and several others. In vivo and in vitro testing shows a direct effect of both Lanosterol and Inotodiols on cancer cells, with Lanosterol having a positive effect on viral compounds. \\n\\nBetulin and Betulinic Acid (Triterpenes) Betulin and betulinic acid are powerful therapeutic agents that can support healthy cholesterol levels. These agents are also being studied for their effects on cancer and viruses. \\n\\nAntioxidants Chaga contains massive amounts of melanin which has high antioxidant levels. In fact, chaga has the highest level of antioxidant potency of any superfood. \\n\\nWhere to Find Chaga Chaga can only grow wild and is quite hard to find. It grows predominantly on birch trees in cold climates throughout the Northern Hemisphere, including northern parts of Europe, Russia, Korea, Canada, and the United States. \\n\\nIf you do not live in these northern regions, you can find chaga mushrooms and chaga tinctures at local health food stores or online. \\n\\nHow to Make Chaga Tea Chaga tea is the most popular way to consume chaga. \\n1. Break the whole chaga into roughly 10g chunks. \\n2. Grind one chunk into powder using a blender or coffee grinder. \\n3. Place one or two teaspoons into a tea infuser. \\n4. Place the tea infuser into a large mug and pour in about 400 ml of hot water. \\n5. Leave the chaga and hot water steeping for at least 5 minutes (the longer the better to get more bioactive ingredients). \\n6. Remove the infuser from the mug and add maple syrup or honey for taste. \\n\\nAriana Marisol is a contributing staff writer for REALfarmacy.com. She is an avid nature enthusiast, gardener, photographer, writer, hiker, dreamer, and lover of all things sustainable, wild, and free. Ariana strives to bring people closer to their true source, Mother Nature. She is currently finishing her last year at The Evergreen State College getting her undergraduate degree in Sustainable Design and Environmental Science. Follow her adventures on Instagram . \\nPhoto Credit:'"}, "time": 1742628587.923133}