{"duration": 0.1638658046722412, "input_args": {"text": "'WASHINGTON  —   The bespectacled teenager in the gray A. C. L. U. hoodie and cargo pants stood, back pressed against a   fence on Pennsylvania Avenue, under a sign saying “No Trespassing, Authorized Personnel Only. ” The White House, illuminated at night, cast a glow over   who, having just wrapped up a protest against President Trump, waited in line to pay homage to    Gavin Grimm. Mr. Grimm looked a little flustered. “Absolutely humbled,” he pronounced himself, as his admirers thanked him for being brave. With Mr. Trump’s decision this week to rescind protections for transgender students that allowed them to use bathrooms corresponding with their gender identity, the next stop is the Supreme Court, where Mr. Grimm  —   an engaging yet slightly awkward young man  —   is the lead plaintiff in a case that could settle the contentious “bathroom debate. ” Amid a thicket of conflicting state laws and local school policies on bathroom use, the suit, which pits Mr. Grimm against his school board in Gloucester County, Va. could greatly expand transgender rights  —   or roll them back. Mr. Trump has portrayed the issue as one of states’ rights, and already the country’s transgender students face differing realities depending on their school. Some are restricted to the bathroom of the gender on their birth certificate. Others are not. Then there are the students like Mr. Grimm, who have had separate facilities set aside for them. At issue in Mr. Grimm’s case is whether Title IX, a provision in a 1972 law that bans discrimination “on the basis of sex” in schools that receive federal money, also bans discrimination based on gender identity. President Barack Obama concluded that it did. Despite Mr. Trump’s action, lawyers for both Mr. Grimm and the school board said Thursday that they expected the case to go forward, with oral arguments set for March 28 and school officials across the country awaiting the result. “No one was in a rush to bring this case to the Supreme Court,” said Joshua Block, a lawyer with the American Civil Liberties Union, which represents Mr. Grimm. “Gavin didn’t choose this fight this fight happened to Gavin. But now that we are here, lives are at stake, and they are at stake in a way that is even more acute because you don’t have a federal government anymore to protect us. ” For Mr. Grimm, who said he knew he was a boy “as soon as I was aware of the difference between boys and girls,” the case amounts to a crash course in government and media relations. It bears his initials, G. G. because he is a minor, and the name of his mother, Deirdre. At home in rural Gloucester, he is a kid with a pet pig named Esmeralda, a geek’s love of Pokémon cards and   Facebook friends. He wears $12 sneakers from Walmart and likes eating at Fuddruckers because the name sounds funny. He is applying for college, but doesn’t want to talk about it. But here in the nation’s capital and in big cities around the country, Mr. Grimm is now a hot property, the new face of the transgender rights movement. Laverne Cox, the actress and activist, gave him a public   at the Grammys. (“Everyone, please Google ‘Gavin Grimm,’” she said.) After his appearance here Wednesday night, he dashed off to New York to appear Thursday morning on ABC’s “The View. ” At the protest here Wednesday night, he was the star speaker, besieged with teary hugs and cellphone selfies. The mother of a transgender child burst into tears when she saw him. A government lawyer shook his hand. Activists posed for pictures. Suddenly, he is hearing his name mentioned in the same breath as Norma McCorvey, the eponymous plaintiff in Roe v. Wade, the Supreme Court case that established a national right to abortion (and who died last week) and Jim Obergefell, whose case led to the legalization of   marriage. Mr. Grimm looked   at the thought. “I just hope I do it justice,” he said quietly. When Mr. Grimm was about 12 or 13, he said, he was able to put a name to what he was feeling and recognized himself as transgender. He came out first to his friends, which was easier than telling his parents. For the family, it was a jolt, his mother said. It made her question preachers  —   she eventually left her church  —   but strengthened her faith. “God gave me this child to open my heart and my mind,” Mrs. Grimm, a nurse, said. In 2014, when Mr. Grimm was 15 and starting his sophomore year, the family told his school he was transgender. Administrators were supportive at first and allowed him to use the boys’ bathroom. But amid an uproar from some parents and students, and after two tense school board meetings, the board barred Mr. Grimm from using the boys’ bathrooms and instead adopted a policy requiring transgender youth to use separate “single user” restrooms. The school now has three such restrooms, but two are in refurbished utility closets, said Mr. Block, the A. C. L. U. lawyer. Kyle Duncan, a lawyer for the school board, said the board “agonized” as it sought a thoughtful way to accommodate Mr. Grimm while protecting students who felt uncomfortable. “This is a sensitive and difficult issue in which everyone’s privacy rights need to be respected,” he said. But Mr. Block said that Mr. Grimm had been singled out for “classic sex discrimination. ” Mrs. Grimm was more pointed: “This school board has targeted my child. ” Her son did not always have such aplomb. Before he began “living authentically,” his mother said, he was introverted, often retreating to his room. She winces at the times she tried to curl his hair and make him wear dresses. Mr. Grimm is, by all accounts, the perfect plaintiff, poised beyond his years. He knows how to deflect unwanted lines of questioning (he will not talk about his twin brother, friends or teachers) and is unfailingly polite in replying to intimate queries about his bathroom habits (“If I have to go, I go to the nurse’s restroom,” he told a local television reporter on Wednesday night) and his emotions (“It’s incredibly frustrating, it’s embarrassing, it’s very uncomfortable. I have this neon sign above my head that says I’m different from my peers”). But at heart, he is still a kid. Once, while touring the National Archives here, Mr. Grimm excitedly played Pokémon Go in front of the Declaration of Independence, as Bill Farrar, a spokesman for the A. C. L. U.’s Virginia affiliate, patiently tried to remind him that he was probably “the only person here who has a legal proceeding before the Supreme Court. ” The two have bonded over hours of travel, including a dash from Gloucester to Washington on Wednesday. Mr. Grimm stuffed his belongings in a white trash bag, sticking in a dress shirt at the last minute, which proved handy for “The View. ” Because Mr. Grimm is to graduate this year, it is unlikely that he will benefit if the court finds in his favor. And legal experts say that is a big if. The Supreme Court could rule narrowly, send the case back to the appeals court for further review, or decide to wait until similar suits percolate through the federal court system. And with just eight justices on the court  —   confirmation hearings for Judge Neil M. Gorsuch, Mr. Trump’s nominee for the ninth seat, are scheduled to begin March 20  —   the justices might be inclined to wait. “There are many reasons not to resolve this issue now,” said Carl Tobias, a professor at the University of Richmond School of Law, who has followed the case. But Vanita Gupta, who ran the Civil Rights Division in Mr. Obama’s Justice Department and helped write the directive that Mr. Trump rescinded, said the Grimm case had already advanced the cause of transgender rights, just by raising awareness. “There has been such social and cultural change in the hearts and minds of people in this country,” she said, “and I think that’s only going to grow, even if there is a legal setback. ” Whatever happens, Mr. Grimm appears destined for a life of advocacy. He says he feels a heavy burden standing up for other transgender people, knowing that everyone is different. He worries that other young people will not have the support that he has had. While he is not much on school (he is taking only the two courses he needs to graduate) he would like to be a geneticist. He wants to know how the brain works. But asking him about his career plans brings a   answer  —   wry and pointed. “I want to be,” he said, “someone who doesn’t have to talk about where he is going to use the bathroom. ”'"}, "time": 1742564536.4949884}