{"duration": 0.12794137001037598, "input_args": {"text": "'It didn’t take us long to think of a word to describe the 2016 election results. In fact, it took approximately 2 seconds. \\nEPIC. \\nTwo weeks ago the media and their allies in the GOP establishment’s #NeverTrump movement had already made their decision. And they had their polls back up their proclamation. \\nHillary Clinton was going to win and that was that. \\nAccording to the media and their ilk in Washington, there was nothing anyone could do to change the outcome. There was no amount of enthusiasm, no amount of energy, no amount of effort that could defeat their choice. \\nHillary Clinton would be the next President. She would go on to pass TPP, tax the hell out of America, spend us into oblivion, get us into war around the world, further corrupt our government and remain unscathed by her abundant scandals. \\nSo much for that . \\nTurns out America has had enough. America is making a stand and that stand doesn’t include corrupt elitists like Clinton, Pelosi and whoever they had planned to take over the Senate. It doesn’t include Loretta Lynch, Director Comey and a radical leftist Supreme Court. It doesn’t include George Soros, criminal aliens and potentially dangerous Muslim Refugees. \\nNor does it include the old and tired bunch of self-proclaimed #NeverTrump conservatives who, for decades have told voters to support big government Republicans like Paul Ryan, John McCain and Mitt Romney. \\nThey’re all out and a new game is in town. \\nDonald Trump will be the next President of the United States of America . \\nIt’s real. It happened. It’s a done deal. \\nIt gets better, though, in that Trump will go into his Presidency with a strong majority in both the House and Senate. Yeah, the same House and Senate the media said would tilt towards Democrats in this election. \\nOur hats are off to the electorate for restoring faith in the system, the people and the sanity of our nation. \\nCongratulations to Donald Trump and his team. A hard fought battle won, a victory well deserved. \\nNow buckle up, folks. The media and their friends in Washington are going to lose their minds. It’s going to be a wild ride. AL'"}, "time": 1742564045.9002266}