{"duration": 0.013947010040283203, "input_args": {"text": "'Tweet Home » Gold » Gold News » Alasdair MacLeod’s Market Report: Gold and Silver Find Support! \\nA rise of 44% this year for the sterling price of gold just shows what gold does best. It protects ordinary people from the failure of central bankers to protect the purchasing power of their fiat currencies. \\n\\nFrom Alasdair Macleod : Precious metals continued to consolidate at the lower levels, moving broadly sideways. Gold was unchanged on the week by last night’s close in New York, at $1269, and silver up 9c at $17.63. The uncertainty facing traders is whether or not gold will now go lower to test the $1200 level, or will current levels hold. Time will tell. Comex figures are not offering much guidance either. The next chart is of the gold contract’s open interest, and while we can see that open interest has declined significantly since the mid-year peak, an open interest level of 500,000 contracts is by no means low. There is some evidence, however, that among the managed money category there exists long-term players seeking strategic portfolio exposure to gold. That being the case, the downside for open interest becomes more limited, and perhaps the cannier managers will look to add to positions on price weakness. However, we must also take into account potential window-dressing at the end of this month, for the third quarter. And here it is the bullion banks short positions and their traders’ bonuses that are on the line. The lack of volatility in gold and silver is being reflected in other markets, with the dollar stuck at the top end of a sideways consolidation pattern. DXY, the main dollar index traded in futures markets, is our next chart along with the conventional trade-weighted version. This sideways trading pattern could end with a break to the upside, because the euro is drifting lower. Note that the euro comprises 57% of DXY. The reason this is important is a strong dollar worries the Fed. The Fed is desperate to limit the deflationary effects of a rising dollar, and believes that the appalling trade deficit is due to the dollar being very over-valued. So if DXY goes much higher, we can probably dismiss the possibility of an increase in the Fed Funds Rate in December. But that’s a long way off, and doubtless is contributing to the lack of decision over markets generally. That said, the pick-up in Chinese and Indian demand for physical gold bullion lends some support to prices. Meanwhile, gold has performed spectacularly for sterling-based investors, as our last chart clearly shows. A rise of 44% this year for the sterling price of gold just shows what gold does best. It protects ordinary people from the failure of central bankers to protect the purchasing power of their fiat currencies. 2016 30th Anniversary Proof Silver Eagles Available Now at SD Bullion! Secure Your PR 69 and PR 70 Graded Coins Before They’re Gone! This entry was posted in Gold News , Silver News and tagged Alasdair Macleod , gold update , silver update . Bookmark the permalink . Post navigation'"}, "time": 1742628580.66883}