{"duration": 0.1301884651184082, "input_args": {"text": "'Cameco, the Saskatchewan-based uranium mining colossus, is currently in Federal Court facing charges by the Canada Revenue Agency (CRA) that it illegally avoided a stunning $2.2 billion in Canadian income taxes. It is not only the largest such case in Canadian history but one of the most shameless tax dodges ever hatched by a Canadian corporation. The court case has been delayed for years and just the fact that it has finally made it before a judge is good news. But the news could quickly turn bad if, facing defeat, Cameco makes a pitch to settle for less than the full amount. That would be a miscarriage of justice.\\nIt is absolutely critical that the government not make a deal with Cameco for a smaller sum — as often happens in these cases. Because this is no ordinary case. Cameco is a rogue corporation, contemptuous of the country it operates in, and so arrogant in its tax avoidance scheme that it can’t even bother to try to justify it. Confronted by the facts, Cameco just repeats its executive mantra: “We believe that it was established in accordance with sound business principles and in accordance with relevant laws and regulations.”\\nAt a time when more and more attention is being paid to off-shore tax havens and the billions we lose to them, Canada needs to make an example of this irresponsible corporate “citizen.”\\nHere’s the bare bones of the scheme. In 1999 Cameco decided to dramatically reduce its income tax bill by setting up a subsidiary in Zug, Switzerland, where the tax rate is 10 per cent — compared to the (then) Canadian rate of about 27 per cent. At the time the price was at rock bottom — $10 a pound. That’s the price the Saskatchewan head office charged its Swiss “subsidiary.” Then came the windfall manoeuvre: Cameco drafted a 17-year uranium supply agreement at a fixed price of $10 a pound. It was simplicity itself: Cameco would sell literally all of its uranium through the Swiss subsidiary and it would sell it for whatever the world price was. That world price went to almost $140 a pound in 2007 and is now around $35. All the revenue earned above $10 a pound was taxed in Switzerland at the low rate. (An insignificant amount is actually sold in Europe and, of course, not an ounce of the stuff ever finds its way to Zug.)\\nThis scheme is known as “transfer pricing” and sometimes it is perfectly legitimate — companies that sell their products in multiple countries “sell” them to subsidiaries which then sell them in their jurisdiction and get taxed on the profits. But more and more multinationals have been abusing the law that allows this — including Apple, “based” in Ireland, which is now facing a US$15-billion tax bill from the European Commission for its abuse of transfer pricing.\\nBut Apple actually sold its products in European countries and has 5,500 employees in Ireland. Cameco? Not so much. According to a 2014 Globe and Mail story :\\n“While Cameco says Cameco Europe has its own board of directors and a full-time CEO, documents in the case reveal the European company had no other full-time employees, and no stand-alone office, instead renting space from the law firm performing its legal work.”\\nVirtually all the substantive work was performed in Canada.\\nAll of the uranium is mined in Canada, all of Cameco’s sales are negotiated and completed in Canada, and literally all of its profits are generated in Canada. The company’s scheme is pure scam which is why fair-tax activists in Saskatchewan call the company Scameco. A citizens’ group, Saskatchewan Citizens for Tax Fairness, has been on Cameco’s case for several years — paying for a billboard demanding Cameco pay up and collecting 36,000 names on a petition which it presented to the federal government.\\nBut it isn’t just citizens’ groups looking askance at Cameco. Investment research firms, like Veritas, have questioned the company’s scheme. In 2013 company analyst Pawel Rajszel stated :\\n“[A]ll the upside has been transferred to the subsidiary. Meanwhile all the risk has stayed with Cameco Canada. … It’s strange that the company would have created this Swiss subsidiary without having any real operations in Switzerland.”\\nA Veritas report concludes: “It is therefore difficult to see a reasonable business purpose to [Cameco Europe’s] existence, beyond tax minimization.” In a further comment, Mr. Rajszel told The Globe and Mail in 2014: “Based on our review of Cameco’s [first quarter] results, the dispute with the CRA may force the company to borrow funds and/or cut its dividend in order to finance the back tax payments.” Does that suggest Cameco’s clever tax dodge could actually expose it to a charge of failing to carry out its fiduciary duty to its shareholders?\\nAnother business-focussed group has been sniffing around Cameco’s problems. The Bottom Line , a Canadian publication which bills itself as a “Forensic Accounting and Fraud” magazine, has been in contact with Saskatchewan Citizens for Tax Fairness about the case.\\nCompanies like Cameco have for too long framed the tax haven issue as business as usual. But that is now clearly changing and people are starting to see this behaviour for what it is: the legalized theft of Canadian government services. Cameco started off as a public mining company and its technology was developed in Canada with the help of Saskatchewan government money. The Canadian transportation infrastructure allows them to get their uranium to market, they have enjoyed decades in a stable economy, with low inflation, cheap money, low crime and the legal protection accorded a “corporate citizen” under the Charter of Rights and Freedoms. Their workers received free and/or subsidized education and Cameco doesn’t have to pay health insurance for its employees — as companies in the U.S. do. Adding insult to injury, the (federal) taxes Cameco is avoiding are amongst the lowest in the developed word: 15 per cent compared, for example, to 35 per cent in the U.S.\\nIronically — or maybe not — while the CRA is going after Cameco, Saskatchewan’s unabashedly pro-business premier Brad Wall has said almost nothing about the case (the timid NDP opposition has said even less). That seems a bit strange given that Saskatchewan’s share of the proceeds, if the CRA wins, would be over $700 million. Governments may govern in the era of globalization, but giant companies rule. It is long past time that we put a stop to it. A great first step would be for the CRA to refuse to negotiate and get all of our money back. Then we need to change the law.\\n MURRAY DOBBIN , now living in Powell River, BC has been a journalist, broadcaster, author and social activist for over forty years. He now writes a bi-weekly column for the on-line journals the Tyee and rabble.ca . He can be reached at murraydobbin@shaw.ca'"}, "time": 1742561924.863882}