{"duration": 0.06516122817993164, "input_args": {"text": "'WASHINGTON  —   The father of the commando killed in a Special Operations raid in Yemen last month said in an interview published this weekend that he had refused to meet with President Trump on the day his son’s body was returned home, and criticized the White House over the mission, saying, “Don’t hide behind my son’s death to prevent an investigation. ” “The government owes my son an investigation,” the father, William Owens, told The Miami Herald, referring to Chief Petty Officer William Owens, 36, a member of the Navy’s SEAL Team 6. The death of Chief Owens on Jan. 29, in the first Special Operations raid approved by Mr. Trump, came after a chain of miscues and misjudgments that plunged the elite commandos into a ferocious   firefight with Qaeda militants in a mountainous village in central Yemen. Three other Americans were wounded, and a $75 million aircraft was deliberately destroyed. In a risky mission where almost everything that could go wrong did, the Pentagon has acknowledged that several civilians, including some children, were also killed. The dead included, by the account of relatives interviewed by human rights groups in Yemen, the    daughter of Anwar   the   Qaeda leader who was killed in a targeted drone strike in 2011. The mission’s casualties have raised doubts about the months of detailed planning that went into the operation, initially during the Obama administration, and whether the right questions were raised before its approval, which took place over a dinner Mr. Trump held with top advisers five days after taking office. Senior Trump administration officials said that the Defense Department had conducted a legal review of the mission and that a Pentagon lawyer had signed off on it. But the comments by Mr. Owens, his first public remarks since his son’s death, cast a new spotlight on whether the mission’s risks  —   to the American commandos and to Yemeni civilians  —   had been considered fully enough by Mr. Trump and his top aides. On Feb. 1, Mr. Trump flew to Dover Air Force Base in Delaware to be present as the body of Chief Owens, who was known as Ryan, was returned to the United States. His death was the first in the military on the new commander in chief’s watch. “I’m sorry I don’t want to see him,” Mr. Owens recalled telling a chaplain who had informed him that Mr. Trump was on his way from Washington. “I told them I don’t want to meet the president. ” “I told them I didn’t want to make a scene about it, but my conscience wouldn’t let me talk to him,” Mr. Owens said in the interview, which The Herald said took place on Friday at Mr. Owens’s home in    Sea, Fla. “Why at this time did there have to be this stupid mission when it wasn’t even barely a week into his administration? Why?” said Mr. Owens, who told The Herald that he had not voted for Mr. Trump. “For two years prior, there were no boots on the ground in Yemen  —   everything was missiles and drones  —   because there was not a target worth one American life. Now all of a sudden we had to make this grand display?” The operation was the first known   ground mission in Yemen since December 2014, when members of SEAL Team 6 stormed a village in southern Yemen in an effort to free an American photojournalist held hostage by Al Qaeda. That raid ended with the kidnappers killing the journalist and a South African held with him. Mr. Owens told the newspaper that he was a veteran himself, having served four years in the Navy before joining the Army Reserve in Illinois. Chief Owens’s two half brothers also served in the Navy, one as a member of the SEALs, according to The Herald. A woman who twice answered the phone at the Owens residence on Sunday and identified herself as Mr. Owens’s wife said he would not be making any statements beyond what he told The Herald. Shortly after the raid, Trump administration officials called the mission a success, saying that criticisms like those from Senator John McCain of Arizona, the chairman of the Armed Services Committee, who called the mission a failure, dishonored Chief Owens’s memory. “I know that the mission has a lot of different critics, but it did yield a substantial amount of very important intel and resources that helped save American lives and other lives,” Sarah Huckabee Sanders, the deputy White House press secretary, said on ABC’s “This Week” on Sunday. Pentagon officials, however, have declined to provide any specific examples of how the information on the cellphones, laptop computers and other materials recovered at the site would help track down terrorists. Officials have said it could take weeks or longer to fully analyze the materials. When asked if Mr. Trump would support an investigation into the circumstances surrounding Chief Owens’s death, Ms. Sanders said she had not spoken directly to the president about it but added, “I would imagine that he would be supportive of that. ” Col. John J. Thomas, a spokesman for the military’s Central Command in Tampa, Fla. which oversees operations in the Middle East, confirmed in an email on Sunday that the military was conducting an inquiry, as happens anytime there is an American casualty. “We take this very seriously, and we appreciate the deep desire to find out all we can about the tragic death of Ryan Owens during an operation against terrorists,” Colonel Thomas said. After initially denying that there had been any civilian casualties, Pentagon officials quickly backtracked after reports from the Yemeni authorities began trickling in and grisly photographs of children purportedly killed in the attack appeared on social media sites affiliated with Al Qaeda’s affiliate there. The Central Command has acknowledged the likelihood that civilians were killed in the crossfire, but Colonel Thomas offered no new information on the status of the military’s investigation into the allegations.'"}, "time": 1742628408.3263042}