{"duration": 0.06354975700378418, "input_args": {"text": "\"Taki's Magazine October 29, 2016 \\nPALM BEACH, Fla.—Maybe you missed this little item, but last month Obama shut down 130 colleges in a single day. \\nThat’s one-three-oh campuses in 38 states that failed to open for the fall semester even though everybody was already enrolled. \\nCorrect me if I’m wrong, but I don’t think anything even remotely similar to this has ever happened in the history of the Republic. Education is the religion of the country. It’s the one thing that all politicians put on their list of bromides (always saying we need more, not fewer, colleges). Education ranks right up there with sick babies and flogged pit bulls for things people will donate money to. If Obama had shown up in, say, Dayton, Ohio, in 2008 and said, “By the way, part of my platform is that I might shut down 130 colleges,” I think he would have needed a security escort to get out of the Wright Brothers Banquet Hall. \\nSo why are there no riots? \\nBecause the victims of this Orientation Day Surprise are all students at the ITT Technical Institute. \\nITT Tech is one of those for-profit chains that offer degrees in rarefied skills like automobile mechanics and refrigeration repair and medical billing—they’re not afraid to get specific with their curriculum—but historically it’s the Oxford of that group. It grew out of an Indianapolis company called Howard W. Sams that was a publisher of electronics textbooks and service manuals. Sams Technical Institute was formed in 1963 to teach electronics to students who wanted to forgo the typical liberal-arts curriculum of the day and learn how to work with emerging technologies, usually in the service end of the business, and it proved so popular that STI soon merged with Teletronic Technical Institute in Evansville, Acme Institute of Technology in Dayton, and another Sams in Fort Wayne, before being acquired in 1966 by ITT, the diversified international conglomerate that got started in the ’20s by consolidating phone companies. \\nIn the ’60s and ’70s these were sneered at as “trade schools” or “vo-tech schools,” but ITT turned them into actual colleges, a fact recognized in 1973 when the original ITT Technical Institute in Indianapolis became the first “nontraditional” school allowed into the federal tuition loan and grant program. It was considered good policy since these programs were extremely popular with Vietnam War veterans trying to re-enter society. ITT Tech expanded rapidly in the ’70s, pulled back slightly in the ’80s, expanded again in the ’90s, then became publicly traded after the Starwood hotel group bought ITT and decided it didn’t want to be in the education business.\""}, "time": 1742563766.3899114}