{"duration": 0.1948850154876709, "input_args": {"text": "' The list of Emmy winners | red carpet looks | our critic’s review of the show ] LOS ANGELES  —   It was business as usual in the two major categories at the Emmys on Sunday night, as HBO’s “Game of Thrones” and “Veep” repeated as winners for best drama and comedy. But for a ceremony that can be numbingly predictable, the Emmys were energized by a slew of   winners in the acting categories and a tour de force in the limited series category by FX’s “The People v. O. J. Simpson: American Crime Story. ” The success of the O. J. series set the theme for the evening as Sarah Paulson, Courtney B. Vance and Sterling K. Brown all scored their first Emmy victories. Rami Malek won his first Emmy as well in a   race for best actor in a drama, for his role as the tortured hacker in USA’s “Mr. Robot. ” And in a big upset, Tatiana Maslany won as best actress in a drama for her numerous performances in BBC America’s “Orphan Black,” beating out the likes of Robin Wright, Claire Danes and last year’s winner, Viola Davis. Kate McKinnon of “Saturday Night Live” provided a change of pace, too, upsetting Allison Janney, a   Emmy winner, as best supporting actress for comedy. Likewise, Louie Anderson won his first Emmy in the best supporting comedy category for his role as a suburban mother in FX’s “Baskets. ” There was a changing of the guard in the variety category, as John Oliver’s show, “Last Week Tonight,” ended the   run of Comedy Central victories. There were familiar winners as well: In the comedy category, Julia   won her fifth consecutive best actress award for her role on “Veep,” and Jeffrey Tambor, for the second year in a row, won for his role as a transgender woman in “Transparent. ” This was the second consecutive year that “Game of Thrones” and “Veep” took top honors, which helped propel HBO to six Emmys on Sunday night and 22 Emmys over all (some categories were awarded previously) the biggest haul of any programmer. FX was right behind with 18 wins, including six on Sunday. “Thrones” once again led all shows with 12 wins, including three on Sunday, but there is some good news for HBO’s rivals in the drama category: Next year “Game of Thrones,” one of TV’s most widely praised dramas, will not be eligible for the Emmys the network elected to start the show’s seventh season in the summer 2017, outside of the   window. In a sign of the expected Emmys dominance for “Game of Thrones” and “O. J,” Jimmy Kimmel, the show’s host, said in his opening monologue, “If your show doesn’t have a dragon or a white Bronco in it, go home. ” Here are some of the themes and highlights of the evening: Comedy Central had a chokehold on the variety talk show category for years, and a Comedy Central alumnus took the award on Sunday: Mr. Oliver, for his HBO show, “Last Week Tonight. ” The show is now in its third season, and the win represents a breakthrough of sorts. The Emmy in this category has been handed out to daily talk shows for years and hasn’t been given to a weekly show since Tracey Ullman won for her sketch series “Tracey Takes On  …    ” nearly 20 years ago. (Starting last year, variety sketch series and variety talk series were separated into different categories.) Mr. Oliver’s triumph is a blow for Comedy Central, which had won this award for 13 consecutive years between “The Daily Show” and “The Colbert Report. ” Not this year Trevor Noah, Jon Stewart’s replacement, was shut out of the race and not nominated in his first year as host of “The Daily Show. ” But there was some solace in Comedy Central’s night, when “Key  Peele” won the best variety sketch series award. The bad news? That is now off the air. Not surprisingly, this year’s divisive election played a significant role in this year’s ceremony. Lamenting the possibility of a Donald J. Trump presidency, Mr. Kimmel lit into the reality show producer Mark Burnett, who was one of the creators of NBC’s “The Apprentice,” the show that made Mr. Trump a nationwide television star. With ABC’s camera firmly squared on Mr. Burnett  —   who laughed the entire time, despite the charged barbs  —   Mr. Kimmel said that if Mr. Trump is elected president, Mr. Burnett is the man to blame. “If he’s elected and he builds that wall, the first person we’re throwing over it is Mark Burnett,” Mr. Kimmel said. Later in the night, after “The Voice” won the best reality show, Mr. Burnett, a producer for that show as well, shot back at Mr. Kimmel saying that the host gave “another five minutes of free publicity” for Mr. Trump. Mr. Kimmel took the stage afterward and had his own retort: “That Emmy is going on the hood of Trump’s limousine, isn’t it?” And Ms.   who plays the vice president turned president Selina Meyer, said this upon winning her Emmy for every year she’s been nominated in the role: “Our show started out as a political satire, but it now feels more like a sobering documentary. ” FX’s “The People v. O. J. Simpson: American Crime Story” was a ratings hit and a darling of critics, and now a   Emmy winner. In addition to winning the limited series Emmy, Ms. Paulson, Mr. Vance and Mr. Brown all won acting awards. Mr. Vance and Mr. Brown both beat   to win. Nearly every feature player on the show was nominated for an award, a total of six in all. After Ms. Paulson was named best actress, she got up from her seat and gave a big hug to Marcia Clark, the prosecutor she played in the   drama, and whom she brought as her guest to the ceremony. Ms. Paulson’s performance was a sympathetic one, and it’s been a year of redemption for Ms. Clark. “I, along with the rest of the world, had been superficial and careless in my judgment,” Ms. Paulson said, choking up as she directed her comments to Ms. Clark. “And I am glad to be able to stand here today in front of everyone and tell you I’m sorry. ’’ For FX, “The People v. O. J. Simpson” was the leader for what was turning out to be its best year at the Emmys ever. “Fargo” was also nominated in the   category and, after years of being shut out, FX’s critically praised “The Americans” finally broke through with three major nominations  —   best drama, best actor (Matthew Rhys) and best actress (Keri Russell)  —   though it did not win. The Oscars have been the subject of withering outrage the last two years for a lack of racial diversity in the acting categories. The Emmys? There’s been something closer to silence. No one would argue that TV has fully addressed the issue of race  —   it has a problem when it comes to tapping minorities behind the scenes, as the Directors Guild of America reported last week, and CBS was criticized in August for a fall lineup featuring familiar white male actors. But nearly two dozen minority actors were nominated for Emmys this year, following Ms. Davis’s acting victory a year ago. There were three   winners in acting categories Sunday, a notable departure from this year’s Academy Awards, in which no minorities were nominated in the acting categories. In addition to wins from Mr. Brown and Mr. Vance, Regina King won the supporting actress in a limited series Emmy for her role in ABC’s “American Crime. ” And “Key  Peele” prevailed in the variety sketch award. Instead, attention has turned to the awards themselves, with campaigning having turned into something of a blood sport. In the last two years there has been a 40 percent increase in the number of submissions for the best drama Emmy, according to the Television Academy. And “for your consideration” mailers have reached comical proportions, with Netflix sending out a package to Emmy voters so hefty that it could crush a toe. For each of the last three years, streaming services like Netflix and Amazon have become a larger presence at the Emmys. Netflix had 54 nominations this year, its highest ever, and for the first time, it did better than any of the broadcast networks. But despite the upheaval Netflix has caused in the industry, the streaming service has yet to have a big Emmys night. Though it collected nine Emmys overall, including three on Sunday, Netflix continues to strike out in the best drama, best comedy and best actor and actress categories. Ben Mendelsohn did win the Emmy for best supporting actor for his role in “Bloodline. ” But even with the lavish attention on the presidential election this year, neither Kevin Spacey nor Robin Wright won for their roles in the political drama “House of Cards. ” Neither actor has won a Primetime Emmy Award. For Amazon, Mr. Tambor won again for “Transparent. ’’ The broadcast networks continued to have a diminished presence at the Emmys. NBC won two awards Sunday night, and ABC and Fox won one. CBS was shut out altogether. Sign up for the Watching newsletter to get expert film and TV recommendations straight to your inbox.'"}, "time": 1742564003.9101963}