{"duration": 0.03483724594116211, "input_args": {"text": "\"Trump Wants To Nuke ISIS, But Says Hillary Would Start WWIII? WTF?? (VIDEO) By Grownmangrumbles   \\nIt’s been over 71 years since nuclear weapons were used in anger but Republican presidential nominee Donald Trump believes that the next atomic war is just around the corner. Speaking to Reuters yesterday he said : “What we should do is focus on ISIS. We should not be focusing on Syria. You’re going to end up in World War Three over Syria if we listen to Hillary Clinton.” Unclear Fusion Of Ideas \\nYou might have noticed that Trump is a little obsessed with the idea of nuclear war. He talks about it a lot . He seems to be attracted to the idea of simply smiting his enemies, in much the same way the God of the Old Testament used to deal with those who failed to show the proper respect. It’s more than a little disturbing. \\nEspecially when you realize how little he understands geopolitical reality. His grasp of such things are so facile that they border on criminal levels of ignorance. If anyone is likely to fire off a couple of nukes, it’s Trump. \\nWhen told by CNN’s Chris Matthews that world leaders didn’t want to hear that a man running for president wanted to use nuclear weapons on his enemies, Trump asked simply : “Then why are we making them?” \\nThe answer to that question dates back to 1957 when Horrace Gaither presented President Eisenhower with the controversial Deterrence & Survival in the Nuclear Age report. The report was commissioned in order to research how best the United States might provide fallout shelters for its citizens. It soon reached a chilling and unexpected conclusion. The best a fallout shelter could achieve was to allow Americans the agony of a slow painful death. \\nIndeed, the only way to survive a nuclear war was to ensure that one never happened. Plans to build mass civilian shelters were sidelined in favor of a policy that was given the most aptly chosen acronym of all times: Mutually Assured Destruction. M.A.D. \\nThat Trump has failed to master even a high school level understanding of geopolitics is kind of a big deal. \\nHe seems to believe that foreign policy actions are something that can be intuited, rather than studied. The Nuclear Non-Proliferation Treaty , for example has been in force since 1970. The whole reason for its existence is to limit access to nuclear weapons. \\nWith a few notable exceptions, the treaty has been a success. \\nNot so, says Trump. \\nIn March , he suggested that Japan, a country constitutionally forbidden from the threat or use of force as means of settling international disputes, should create its own nuclear weapons. Citing America’s inability to pay for Japan’s protection, he felt that they might benefit from their very own atomic security blanket. \\nPresident Barack Obama was concise in his assessment of Trump’s plan. Speaking at a press conference during the 2016 Nuclear Security Summit in Washington DC, he said : “The person who made the statements doesn’t know much about foreign policy or nuclear policy or the Korean peninsula or the world generally … We don’t want somebody in the Oval Office who doesn’t recognize how important that is.” Nuclear Bore \\nThe 71 years that have passed without any nation using devastating WMD on one another did not happen by accident. At the close of World War II, statesmen were forced to tackle the realities of modern warfare. World War I killed 5 million people and wounded 12 million more. WWII killed ten times that number. An atomic war might kill us all. \\nIn fact, it almost certainly would. \\nTheir plans, treaties, and compromises were far from perfect, but they worked, and they continue to work. We can be thankful for that. \\nBecause if there were to be such a war in 2017, it wouldn’t be Clinton pressing the button. \\nIt would be the satsuma-like hand of a volatile, narcissistic amateur deciding to rage-quit a world that just doesn’t seem to understand what a wonderful, tremendous guy he is. \\nWatch Trump refuse to rule out the use of nuclear weapons: \\nFeatured image via MemeGenerator /Trump caricature by DonkeyHotey via Flickr under a CC BY-SA 2.0 license \\nAbout Grownmangrumbles \\nI'm a full- time, somewhat unwilling resident of the planet Earth. I studied journalism at Murdoch University in West Australia and moved back to the UK where I taught politics and studied for a PhD. I've written a number of books on political philosophy that are mostly of interest to scholars. I'm also a seasoned travel writer so I get to stay in fancy hotels for free. I have a pet Lizard called Rousseau. We have only the most cursory of respect for one another. Connect\""}, "time": 1742628487.6143472}