{"duration": 0.01591944694519043, "input_args": {"text": "'Despite Gaining Some In The National Polls, The Electoral Math Remains Dismal For Trump   \\nAllow me to be the voice of reason and sanity amidst a storm of doubt, recrimination, and uncertainty. Yes, Donald Trump has narrowed the margin since the news from FBI Director James Comey on Friday that information “pertinent” to the matter of Hillary Clinton’s email server had been found on a device belonging to disgraced Congressman and sexting freak Anthony Weiner, but it’s time to look beyond the superficial statistics and dive a bit deeper into the real math which wins Presidential elections. \\nThe ABC News/Washington Post national tracking poll shows Trump within 1 point of Hillary Clinton in a four-way race that includes Libertarian candidate Gary Johnson and Green Party nominee Jill Stein. Last week, that same poll had Clinton up nationally by 12 points. Oh my gosh! She lost 11 points in a single week? No. That’s nearly impossible to have happened, which means there is a better than 99 percent chance it hasn’t. \\nAlso, one does not win a Presidential election on the national level. Such races are won on a state-by-state basis and then electoral votes are awarded to whatever candidate wins a particular state. In other words, the race between Hillary Clinton and Donald Trump is 50 individual state races which will determine who the next occupant of the Oval Office will be. \\nSo, if we look at the aggregate polling data–i.e. data from many polls–we see that based on that information the HuffPost Pollster model shows Clinton leading by 7 points in a two-way race and 6 points when third party candidates are included . \\nOK, you can breathe now. \\nAlso, despite the recent fluctuations in national polls, there remains virtually no discernible path by which Trump can get the 270 electoral votes needed to win the election. Now this isn’t to say that we can all just sit back and expect others to do our voting for us. All of us–liberals, progressives, moderates, the rational and sane who do not want to give a psychopath nuclear weapons–have to get out and vote for Clinton if we value our future and those of our families. \\nThanks once again to the good folks at the Huffington Post, we can clearly see that Hillary Clinton now has a 98 percent chance of being the next President of the United States. \\nWhew! Feeling much better now. \\nAre you kidding me?! Get up off your duff and go vote! This is no time for complacency! The fate of this country and the entire world is at stake. \\nSo don’t fret, but DO VOTE! \\nFeatured Image Via CBS Miami  '"}, "time": 1742628471.6035554}