{"duration": 0.20881104469299316, "input_args": {"text": "'PALM BEACH, Fla.  —   The decision came Thursday afternoon on Air Force One on the way to Florida. President Trump assembled his National Security Council on his plane, some by secure video link, as the generals made the case that President Bashar   of Syria had to learn there was a price to pay. Mr. Trump was already shaken by photos his staff had shown him of children dying after the Syrian government’s chemical weapons attack  —   far more graphic than those the public had seen  —   so the president did not need a lot of convincing. “What happened in Syria is truly one of the egregious crimes, and it shouldn’t have happened,” he told reporters when he poked his head into the press cabin. “And it shouldn’t be allowed to happen. ” Two hours later at his    resort in Palm Beach, Fla. Mr. Trump gave the order to unleash 59 Tomahawk cruise missiles at Al Shayrat airfield in western Syria, where the chemical weapons attack originated. His generals had given him the option of delaying a day, but Mr. Trump chose not to wait. It had been only 63 hours from the chemical attack to the American strike. The bombs fall on the town of Khan Sheikhoun, in the   territory of Idlib Province. Video footage of the attack quickly surfaces, showing women and children gasping for breath and foaming at the mouth as they fight the effects of what officials later say is sarin gas, a brutal nerve agent. President Trump huddles at the White House with his military and national security advisers for what his aides now describe as an extensive briefing on the attack. The president had questions for his aides, including Lt. Gen. H. R. McMaster, the national security adviser. “He was very interested in understanding better the circumstances of the attack and who was responsible,” General McMaster later tells reporters. Mr. Trump has a series of meetings on health care, the environment and other topics, but aides say the images from Syria  —   especially those showing the suffering of small children and babies  —   weigh on him. The first public evidence of the president’s concern about the chemical attack comes from Sean Spicer, the White House press secretary, who reads a statement condemning the Syrian government. He also places blame on President Barack Obama for not striking the Syrian regime in 2013. The attacks, Mr. Spicer says, are “not something that any civilized nation should sit back and accept or tolerate. ” But he does not demand that President Assad step down, and dismisses the idea as impractical: “We would look like, to some degree, rather silly not acknowledging the political realities that exist in Syria,” he says. At the White House, national security aides to Mr. Trump gather for a “restricted deputies committee meeting” to review options. The group  —   made up of the deputies to the president’s chief foreign policy advisers  —   begin vetting the options with the agencies that would have to carry them out. Members of the National Security Council arrive at the White House to review the work from the night before. Intelligence and military officials continue to investigate the attack, giving them confidence that Mr. Assad is responsible. “That confidence level has just continued to grow in the hours and days since the attack,” General McMaster later tells reporters. The evidence, he says, is increasingly associated with “the victims that are being treated and confirmation of the type of agent which was used, which is a nerve agent. ” Mr. Trump makes his first public remarks about Syria, telling a group of reporters in the Oval Office that the attacks are unspeakable. As his advisers continue working on details for a military strike, Mr. Trump remains uncharacteristically disciplined about his plans. Asked by a reporter whether he intends to take any action with regard to Syria, Mr. Trump says, “You will see. ” At a news conference in the White House Rose Garden after a meeting with King Abdullah II of Jordan, Mr. Trump says his horror at the images of “innocent children, innocent babies” choked by poison gas in the attack has led him to reassess his approach to Syria. “It’s very, very possible, and I will tell you it has already happened, that my attitude toward Syria and Assad has changed very much,” Mr. Trump says, adding later: “It crossed a lot of lines for me. When you kill innocent children, innocent babies, little babies, with a chemical gas that was so lethal,” then that “crosses many lines, beyond a red line, many many lines. ” Without giving away his plans for possible military action  —   already under consideration at this point  —   Mr. Trump acknowledges that “I now have responsibility, and I will have that responsibility and carry it very proudly. ” Mr. Trump convenes a meeting of his National Security Council after lunch with the Jordanian king. For several hours in the Situation Room, the president’s top military and national security aides present him with three options for action in Syria. Aides say Mr. Trump was looking for something aggressive but “proportionate” that would be sufficient to send a signal  —   but not so large as to risk escalating the conflict. “The president asked us to focus on two options in particular, to mature those options, and he had a series of questions for us that we endeavored to answer,” General McMaster later tells reporters. Deliberations continue throughout the afternoon as military and intelligence officials focus in part on how they might use missiles to target the airfield used to launch the chemical weapons. After several hours, the president and his advisers agree to reconvene the next day. The president participates in an event honoring wounded veterans as he mulls his options. He tells the veterans assembled in the East Room that they are “real heroes” who have sacrificed for their country. “I call them America’s winners because they’re winners,” Mr. Trump says. Mr. Trump’s motorcade pulls out of the White House headed for Air Force One and then a summit meeting with President Xi Jinping of China at   . With the president on the plane are General McMaster Stephen K. Bannon, his chief strategist Reince Priebus, the White House chief of staff and Mr. Trump’s economic advisers. Flying through unusually turbulent weather on his way to Florida, Mr. Trump reconvenes the National Security Council, adding those on the ground via a secure video connection. His aides later describe Mr. Trump’s   as deliberate, although he is also driven by emotion at the sight of the atrocities  —   and with the power to do something about it. Mr. Trump makes up his mind to act, although aides declined to provide more details about the president’s thinking and the conversations on the plane. Mr. Spicer fields questions on the plane from reporters about the possibility of military action in Syria. “He is being presented with a lot of options,” Mr. Spicer says as Air Force One bounces wildly through pockets of rough air. “I would go back and echo the comments the president made in the Rose Garden. He is not one to telegraph those decisions until he is ready to make them. ” Mr. Trump is still on Air Force One when Secretary of State Rex W. Tillerson lands in Florida to greet Mr. Xi, who has arrived a few moments earlier on his Air China plane. After the greeting, Mr. Tillerson briefs reporters at the airport about the coming meeting with Mr. Xi. Pressed by reporters on Syria, Mr. Tillerson says the United States must act. “It would seem there would be no role for him to govern the Syrian people,” Mr. Tillerson says of Mr. Assad, an abrupt turnaround from Mr. Spicer’s comments about 48 hours earlier. “We are considering an appropriate response for this chemical weapons attack. A serious matter requires a serious response. ” Air Force One lands in Palm Beach, and the president is whisked to    and heads into another meeting with the National Security Council. By this point, the military options have been winnowed to a Tomahawk cruise missile strike at Al Shayrat airfield. American intelligence has tracked the planes that carried out the attacks and determined that they were Syrian government warplanes that had departed from and returned to the base. “It was important during the president’s deliberations,” General McMaster says. Aides say Mr. Trump was determined to display some form of strength, but also was aware of the difficulties looming with Russia once the strikes became known. Before the meeting ends, Mr. Trump formally says the missile strikes are a “go. ’’ Mr. Trump and Mr. Xi, who arrives at    just after 5 p. m. pose for pictures with their wives. Mr. Trump is seated hunched over on a couch in the middle of one photo. A reporter yells out, “Have you been presented with options on Syria?” Mr. Trump ignores the question as reporters are led out. The formal dinner with Mr. Xi begins. From a phone line in a small, nondescript room at the sprawling Al Udeid Air Base in Qatar  —   the United States’ air war command for the region  —   American commanders begin warning their Russian counterparts of an imminent strike at the airfield. They do this under a “deconfliction” agreement with Moscow to try to prevent an unintended confrontation between the two countries. But the Americans give the Russians the warning no more than 90 minutes before the strike, according to one American official. In other words, it is a notification rather than a consultation. The conversation is described as lengthy. The Russians do much of the talking. At 2:40 a. m. local time in Syria, two destroyers, the U. S. S. Porter and the U. S. S. Ross  —   already in position in the eastern Mediterranean  —   fire 59 Tomahawk missiles at the airfield. In Washington and at    the president’s advisers  —   Vice President Mike Pence, Mr. Tillerson and General McMaster among them  —   begin notifying foreign leaders and members of Congress that the missile strikes have begun. Senator Mitch McConnell of Kentucky, the Republican leader, gets a call from Mr. Pence. As Mr. McConnell later tells reporters, Mr. Pence “explained the rationale, how they were doing it, and I thought it made a lot of sense and would be a strike that would be noticed, not some kind of pinprick. ” The cruise missile strike targets aircraft, hardened aircraft shelters, radars, an air defense system, ammunition bunkers and fuel storage sites. American planners have avoided targeting sites where they suspect chemical agents might be stored. Dinner wraps up at   . As the missiles are about to hit their targets, Mr. Trump pulls Mr. Xi away from the other guests and informs him of the strike. Aides describe it as a brief,    discussion. The Chinese delegation leaves    after the dinner ends. Mr. Trump assembles his national security team and other top advisers in a secure room at    after the strikes. A photograph of the meeting, distributed by Mr. Spicer on Friday, shows the president at a small table with General McMaster, Mr. Priebus, Mr. Bannon, Mr. Tillerson and Jared Kushner, the president’s    and adviser. Others, including Treasury Secretary Steven Mnuchin, Commerce Secretary Wilbur L. Ross and Dina Powell, the deputy national security adviser for strategy, are also in the room. On a secure video screen, according to Mr. Spicer, are Mr. Pence Gen. Joseph F. Dunford Jr. the chairman of the Joint Chiefs of Staff and Defense Secretary Jim Mattis. Reporters are called in for a statement that Mr. Trump delivers to announce the strikes. The military action, he says, is in the “vital national security interest of the United States to prevent and deter the spread and use of deadly chemical weapons. ” The statement is organized so quickly that reporters are unable to broadcast it live. They record it to be aired soon after the rush also means the sound quality is poor. But the import of his words is clear. “We ask for God’s wisdom as we face the challenge of our very troubled world,” Mr. Trump says. “We pray for the lives of the wounded and for the souls of those who passed. And we hope as long as America stands for justice, then peace and harmony will in the end prevail. ”'"}, "time": 1742561744.7773788}