{"duration": 0.07679367065429688, "input_args": {"text": "'Robert Creamer and his Democracy Partners consulting group sued conservative filmmaker James O’Keefe and his Project Veritas on Thursday in the District of Columbia for $1 million. [The lawsuit concerns an O’Keefe sting that exposed Creamer’s efforts to incite violence at Donald Trump’s 2016 campaign rallies to create a sense of “anarchy” around the candidate.  O’Keefe’s work revealed that Creamer and his associates, who worked with the Democratic National Committee, were involved in a tactic called “” which involved provoking Trump supporters to lash out at them, and to film those reactions, with footage to be distributed to media outlets. The Project Veritas team also showed a Creamer associate describing a complex communications system he referred to as the “Pony Express,” which Democrats used to circumvent rules against coordination between political campaigns and super PACs. O’Keefe’s work resulted in Creamer being forced to step aside from his campaign activities  —   and also exposed his close connections to the Obama White House. Arguably, his reporting shifted the momentum in the campaign. Creamer’s   complaint alleges that O’Keefe and Project Veritas “selectively edit   …     videotapes so as to distort and misrepresent what was said,” and complains that their efforts unfairly interfered with Democrats’ efforts to wreak havoc on the Trump campaign. The complaint also alleges: “The [Project Veritas] video was heavily edited and contained commentary by O’Keefe that drew false conclusions from the selectively edited videos, to charge that Plaintiffs were involved in a conspiracy to incite violence at rallies for   Donald Trump  …    ”. As a result of O’Keefe’s exposés, Creamer’s complaint alleges, Democracy Partners lost valuable business contracts from   political clients. Creamer and his company are seeking damages for alleged unlawful interception of oral communications, for civil conspiracy, and for fraudulent misrepresentation, among other torts. O’Keefe responded with a statement: Robert Creamer believes that by suing us, he can intimidate us. I will not be silenced  —   only over my dead body! We are on the right side of the law and will not stop exposing the truth.   …     This lawsuit further justifies the need to drain the swamp. Our army of guerrilla journalists, which grows daily, will continue to expose the malfeasance and corruption committed by these organizations. In fact, we will be deploying a new batch of freshly trained journalists next week to shine additional light on the cockroaches of the corrupt DC establishment. We will not be intimidated. We will not be silenced. We will find out who is funding this lawsuit. We will never stop exposing the truth. We will not back down. Project Veritas attorney Benjamin Barr added: “The First Amendment protects the rights of undercover journalists to expose exactly the sort of corruption captured in these videos. Veritas will assert its full First Amendment rights to defend itself in these proceedings. ” Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742561827.2861557}