{"duration": 0.14684414863586426, "input_args": {"text": "'BIRDSVILLE, Australia  —   Birdsville sits perched on the edge of the vast Simpson Desert, hundreds of miles from the nearest city, on the far reaches of the Australian outback. It is an unforgiving place, choked by swirling sandstorms and baked by summer temperatures that can reach 122 degrees Fahrenheit. Home to just 100 people, it has one primary school with six students, one tiny hospital and one police station, which are staffed by one nurse and one policeman. But every year, thousands of people descend on the town for the Big Red Bash, which its organizers claim is the remotest music festival on earth. “This is the ultimate Australian country gig,” said Jimmy Barnes, one of Australia’s   rock musicians, as he lounged backstage at the festival in July. The Big Red Bash, named for the towering    sand dune on which it is usually held, just outside Birdsville, is what Mr. Barnes called “a celebration of the bush. ” The event was first held in 2013 with an audience of just 600 this year’s   festival had 7, 000 attendees. The influx of visitors is critical for the survival of the community that has built its recent fortunes on tourism. The town also hosts the annual Birdsville Races, a renowned horse racing event that was first held in 1882 and now attracts thousands of people each year. “Once upon a time, Birdsville depended on local ringers, stockman, drovers,” said Don Rowlands, an Aboriginal elder of the local Wangkangurru and Yarluyandi nations and a ranger of the nearby   National Park, referring to the workers on the cattle ranches that surround the town. Now, he said, “it would not survive without tourism  —   not a chance in hell. ” For many, the attraction of the Big Red Bash is its remoteness. Fresh vegetables are delivered twice a week by truck (“road mail,” as locals call it) some residents fly their own small planes (the airfield, conveniently, is a   walk from the pub) and if the lights go out, electricians must be booked from the closest city, Mount Isa, which is a   drive away. “You don’t go through Birdsville, you come to Birdsville, and that makes the difference,” Nell Brook said. She and her husband, David, whose family settled in Birdsville in 1885, farm on an enormous scale. They own 40, 000 cattle on five properties that span 32, 000 square kilometers. “It’s an effort to get here,” said Ross McGregor, 51, a laundry worker who drove for two days from his home in Townsville for the Big Red Bash. “It’s a challenge. ” Sporting a bushy    beard, a black pirate hat and   Mr. McGregor, like many attendees, is a “gray nomad,” a movement of retirees and older citizens who traverse the country in trailers. The prevalence of    vehicles, in particular, has opened up tourism in the outback. And Birdsville, Mr. McGregor said, has become a destination in itself, a “beacon in the desert. ” Established in the 1880s to collect tolls for cattle drovers moving across the borders of   Australia, Birdsville was once a thriving frontier town. When the tolls were abolished with the federation of six   colonies that united under the Commonwealth of Australia in 1901, the town, which sits on the Diamantina River, fell into decline. Those who stayed worked on cattle ranches. While the coastal areas of Australia developed, Birdsville’s remote inland location ensured its isolation. “You can’t just go down to the shop and buy things,” Mrs. Brook said. “You always have to plan what you need for the next two months. ” She said that in the 1970s, the telegraph was the only way to connect with the outside world. A   flight brought fruit, vegetables, mail and a movie that residents would gather together at the Brook home to watch. The town’s first telephone line was installed in 1986, and the first cell tower in 2011. Birdsville is expected to get broadband internet access next year. To travel to Birdsville, visitors had to fly or take the dangerous, dusty Birdsville Track, a   dirt road from Marree, in South Australia, which crosses three deserts. Mailmen willing to risk the hazardous, weekslong journey on the Birdsville Track became heroes. Tom Kruse, who delivered letters to outback properties from the 1930s to the 1950s in his Leyland Badger truck, was immortalized in the 1954 documentary “The Back of Beyond. ” In the 1960s, the perils of crossing the desert made national headlines when five members of the Page family  —   Ernest Page his wife, Emma and their three children  —   ran out of gas and water and died from dehydration after abandoning their car. Their partly decomposed bodies were found near Deadman’s Sandhill under a coolibah tree on New Year’s Day in 1964. Their brutal deaths, combined with Mr. Kruse’s expeditions, helped cement the town in national legend. “It’s become a bucket list for people,” said Greg Donovan, founder of the Big Red Bash and its sister event, the Big Red Run, a   ultramarathon through the Simpson Desert. Tourism has become a mainstay. Visitors flock to the Birdsville Hotel, which has quenched thirsty travelers since 1884, and the Birdsville Bakery, celebrated for its curried camel pies, with meat from feral camels that roam the desert. “I could have built a bakery in Marree to the south, Bedourie to the north, Quilpie to the east,” said Robert “Dusty” John Miller, the owner of the bakery. “I would have failed in the first year because they don’t have the iconic status this town’s got. ” Even so, tourism, along with cattle rearing, has taken its toll on the desert. As a boy, Mr. Rowlands, the park ranger, hunted for “bush tucker” after school, catching wild goanna, the native monitor lizards, and snakes to cook over a pit of hot ash like his Aboriginal ancestors. “Now, you can go down with a magnifying glass and find nothing,” said Mr. Rowlands, 58. “And here we have Birdsville full of people, but nobody really knows what has happened to the land. ” The town’s infrastructure can also buckle under the pressure. During last year’s Big Red Bash, the Birdsville Hotel ran out of food. This year, the Birdsville Bakery ran out of bread, and the town’s power grid failed. “We’re building our own little minicity with facilities, sanitations, rubbish,” said Mr. Donovan, noting that almost everything needed to be transported for hundreds of miles on dirt roads. “If you have a bit of rain, those roads get closed. There are no shortcuts. ” Mr. Donovan, who is from Sydney, applauded the “she’  ” optimism of the residents. “In the bush, you have your good years and your bad years, and people roll with that. ” Yet, with meager employment opportunities, few young people stay. Tourism is limited to the winter months, when temperatures are more temperate. In summer, “it’s back to the old days,” said Lucas Trihey, who organizes events at the Big Red Bash. “There’s no one around. You can’t go outside and eat a sandwich. It will end up full of sand. There’s a real frontier feel. ” Recreation in the summer shrinks to barbecues, swimming in the billabong, and drinking stubbies, or bottles of beer, on Big Red under the stars. But, Mr. Miller said, the lack of diversions has helped foster real community spirit in the town. “We need one another,” he said as he as he got up to dispense another curried camel pie to a hungry customer.'"}, "time": 1742562112.1647081}