{"duration": 0.11530804634094238, "input_args": {"text": "'You are here: Home / *Articles of the Bound* / Can Trump Survive the Media Onslaught? Can Trump Survive the Media Onslaught? November 23, 2016, 12:48 pm by Cliff Kincaid Leave a Comment 0 \\nAccuracy in Media \\nWith CNN and MSNBC depicting the incoming Trump administration as the advent of a Fourth Reich, it should be obvious that the President-elect will have to go beyond his blistering tweets to cultivating sympathetic media and getting his own message out in a systematic way. But is the Trump transition team up to the job? \\nPresident Obama was ahead of the curve in this regard, having established an office of “Progressive Media and Online Response” to cooperate with “progressive” media sources. The Hillary Clinton presidential campaign understood this form of “outreach” as well, as we saw in the WikiLeaks disclosures of how they colluded with major media outlets and reporters. Trump has used tweets, meetings with the press, official statements, and an occasional video. But much more will be needed if the President-elect hopes to survive the transition with a team in power that can get things done and communicate directly with the American people. \\nIn addition to Trump’s tweets, which serve a legitimate purpose, the President-elect should consider a position that is comparable to what the Obama administration had, albeit with a focus on conservative and alternative news media. Trump appears to have great confidence in Dan Scavino , who now carries the title of Director of Social Media & Senior Advisor to President-elect Trump. Scavino has a fascinating bio and has worked for Trump nearly half his life, including as the former Executive Vice President and General Manager of Trump National Golf Club, Westchester. But it’s not clear what role he is playing in the presidential transition. \\nWhat Obama did is worth studying. Jesse Lee was named as the White House Director of Progressive Media and Online Response in 2011. He helped Obama win a second term. According to Lee’s bio , he previously worked as Online Programs Director in the White House and in the New Media department for the Presidential Transition team doing online outreach. He also had worked in online communications for the Democratic National Committee leading up to the 2008 election, served as Senior New Media Advisor to Speaker Nancy Pelosi (D-CA) for the 110th Congress, and helped the Democratic Congressional Campaign Committee launch its online program from 2004 to 2006. \\nHis current effort , as special assistant to the president and “director of rapid response,” includes dissemination of propaganda points about the greatness of Obamacare and other Obama administration initiatives. \\nWhile the Trump administration is being painted by the media as an extension of the White Power movement, it’s clear that the Democrats, including Obama, are going on the attack. Together, the media and the Democratic Party are functioning as the new obstructionists, determined to thwart progress and destroy the next administration’s nominees. Trump calls the media names and issues tweets, but there doesn’t seem to be much else being done in response to this coordinated assault. \\nA group called UltraViolet has placed full-page ads in The Arizona Republic, The Lincoln Star Journal, and The Reno Gazette Journal attacking Republican senators Jeff Flake (AZ), Deb Fischer (NE), and Dean Heller (NV) “for failing to speak out” against Trump’s appointment of Stephen Bannon, “a white supremacist and domestic abuser,” as chief White House strategist. The first charge is apparently a reference to Bannon’s Breitbart News having covered groups which talk about protecting the European heritage and Judeo-Christian traditions of the United States and other Western nations. Some of these groups are controversial and out of the conservative mainstream. But the idea that they are in favor of white supremacy is ludicrous. The “domestic abuser” charge against Bannon was dismissed as a spurious accusation made by an angry spouse in a divorce case. \\nSignificantly, UltraViolet is run by Nita Chaudhary, who is married to Obama White House official Jesse Lee. She served as the Democratic National Committee’s first Director of Online during the 2004 cycle and started her career at People for the American Way. She was also the National Campaigns and Organizing Director at MoveOn.org Political Action. \\nPublicly, Democrats are saying that they intend to work with the Trump administration on some issues. Consider that the University of Arizona just took out a full-page ad in Politico, advertising a statement from the “ National Institute for Civil Discourse ,” whose members include such prominent Democrats as former U.S. Secretary of Labor Robert Reich, a Professor of Public Policy at the University of California at Berkeley. The statement signed by Reich and others says Americans should move beyond the “bitter” election and “ensure that America’s next chapter is civil and respectful…” \\nDespite talk of “civil discourse,” Reich has just written a column titled, “The Trump Administration Will Be the Most Dangerous Since Richard Nixon.” And he writes this before Trump takes office! \\nRather than take a wait-and-see attitude, Reich has also written a column , “The First 100 Day Resistance Agenda,” in which he advises, “Get Democrats in the Congress and across the country to pledge to oppose Trump’s agenda. Prolong the process of approving choices, draw out hearings, stand up as sanctuary cities and states.” He also suggests, “Boycott all Trump products, real estate, hotels, resorts, everything. And then boycott all stores (like Nordstrom) that carry merchandise from Trump family brands.” \\nReich is a Democrat double-talker who puts his name on a statement promising peace and harmony, while telling the far-left to do everything possible to obstruct and destroy the next administration. \\nReich’s double-talk will not be worthy of any media scrutiny, of course. \\nOne way to overcome this onslaught is to continue to go on the offensive, not only against the media but also the media’s darlings, such as Hillary Clinton. When the liberal media see that Trump is apparently backing away from holding Mrs. Clinton accountable for her corruption, they know they are winning the information war and that they have the President-elect on the run. \\nMeeting personally with The New York Times, as Trump did on Tuesday, will not mollify his critics. The media will see such a meeting as a sign of weakness. He needs to reach out to allies in the media who are willing to cover him and his administration in a fair and objective manner. Another way to do this is to open up the White House press briefings of his new administration to conservative bloggers and media outlets. There’s no reason to reserve front-row seats for what he once called the “crooked media.” Let them stand in the back with their hands raised. Cliff Kincaid \\nCliff Kincaid is the Director of the AIM Center for Investigative Journalism and can be contacted at cliff.kincaid@aim.org. View the complete archives from Cliff Kincaid . 0'"}, "time": 1742562030.668816}