{"duration": 1.4952647686004639, "input_args": {"text": "'You can tell a lot about a person by watching him lose. I did not suggest   specifically because I thought Jonah Hill would lose at it, but rather because his initial suggestion for an interview activity  —   tennis  —   presented logistical complications: specifically, the problem of trying to talk with someone from 70 feet away across a net on a loud city court. So Hill agreed to  . “Doesn’t Susan Sarandon have a   place in New York?” he mused while forming a plan. “I’ve heard that. I know people who’ve gone there. I don’t really know what Susan Sarandon’s involvement is. I just know for certain that she’s tangentially connected to the   industry. ” This turns out to be correct. The Academy   actress Susan Sarandon is a founder of a chain of   lounges called SPiN. It has locations in New York, Toronto, Los Angeles, Chicago and San Francisco. The New York outlet, where I met Hill on a Wednesday afternoon in June, is an icily   subterranean space on 23rd Street with nightmarish wall murals and 18 royal blue tables. Players were scattered about the place, ponging away to a dance remix of “Let’s Talk About Sex. ” Hill arrived punctually with drowsy eyes and an iced coffee from Starbucks. “No sign of Susan Sarandon,” he observed, looking around the room and dragging on his coffee, “which is the biggest sign of Susan Sarandon. ” He did not, he said, get a lot of sleep last night. There was a work call with someone in a different time zone  —   a “finance person” for a movie he plans to direct  —   and the conversation left Hill so jazzed that he couldn’t fall asleep, so he took his French bulldog Carmela (named after Tony Soprano’s wife) for a walk around the neighborhood, and when he finally dozed off he left a window open, leaving him speckled with “a thousand” mosquito bites, visible in rosy constellations across his arms. The coffee was helping. Hill, at 32, has appeared in enough movies (currently 29) that he was recognized, in the space of 10 minutes, by a female SPiN employee in her 20s who requested a photo, by a 40ish camp counselor who asked that Hill take a picture with his campers and by the campers themselves, who clustered around the actor and stared stoically into the camera for a photo in which Hill was the only one smiling. These people probably knew Hill from his role as a hilarious sidekick in the “21 Jump Street” remakes, or from his role as a hilarious sidekick in “The Wolf of Wall Street,” or from his role as a hilarious sidekick in “Superbad. ” The   roles make up a numer ically small but   portion of Hill’s career, and no number of contrasting performances  —   in indie comedies directed by the Duplass brothers, in   dramas like “Moneyball”  —   can seem to override the public impression of him as a man who might, at any moment, start humping the furniture. This is fair, because Hill is excellent at delivering coitus jokes. It’s also unfair, because his acting career didn’t begin in a   place and it doesn’t seem to be heading in that direction, even if his IMDb page is dotted with the presence of Judd Apatow. Hill has received two Oscar nominations and produced six movies and has writing credits on both of the “Jump Street” movies. He is not Seth Rogen, although people sometimes confuse the two men, which feels vaguely   given that they look nothing alike. Next year he’ll direct a movie that he wrote (not a comedy). This summer he appears in “War Dogs,” directed by Todd Phillips, of the “Hangover” movies. Though it’s strewn with giggly moments, the movie is ultimately alarming. Hill plays a sociopathic arms dealer. In the basement at SPiN,   patrons continued to recognize the actor, who didn’t wear a hat or sunglasses or other protective camouflage, until a manager registered the ogling and transferred Hill to a private room behind a   curtain. By now the coffee had kicked in. I asked Hill if he was ready to play  . “Yeah!” he said. “I was just thinking that I’d love to. ” Pause. “You didn’t think of that idea  —   I thought of it. ” This last sentence came across as a joke in real life  —   he was doing an impression of a surreally bratty person  —   but it reads horribly on the page, which turns out to be true of many things that Hill says. His humor is  . This may be one reason that profiles of the actor have not historically been ultraflattering. Another reason may be Hill’s face. “I have resting bitch face,” he explained to me once. “I really do. It’s heartbreaking. I don’t mean anything by it. ” This is borne out by paparazzi photos of Hill sternly alighting from a vehicle, angrily riding a Citi Bike and resentfully hanging out with Leonardo DiCaprio. “I know I look really pissed off,” he said, “but I’m not. ” If life were a reality TV show, it would be accurate to say that Hill has received a “bad edit,” in part because of the above factors. In 2013 he did an interview with Rolling Stone that resulted in the following words being used by media outlets to describe him: humorless, insufferable, angry, defensive, pompous jerk, and “20 Most Hated Celebrities!” Today’s Jonah Hill, rallying at a   table, seems like someone who might do yoga, or drink green tea, or practice Transcendental Meditation. Maybe it is just the residue of his youth in California. Maybe “centeredness” is just Los Angeles leaving the body. Whatever it is, he comes off as mellow and polite, keeping his phone out of sight during interactions and asking if I have any dietary restrictions. He behaves in a way that would assure his mother that she did a good job. He says that the trait he values most in others is being nice. Most famous people have a thin oleaginous layer of social grace that tops a bottomless well of impatience to get their press duties over with, but Hill seemed to be in no particular hurry to do anything, except lose at  . While his serve is 90 percent unreturnable and his backhand is evil, Hill’s forehand is unreliable. Midway through Round 1 an employee popped his head in and asked for the score. “Fourteen to 20,” Hill replied. “She’s winning. ” The guy scoffed. “You’re losing to a girl?” “That’s not a very feminist attitude, my friend,” Hill said. “Does that make you mad?” he asked, after the employee left. “It’s not the dumb outlook that bothers me. It’s that he expects me to share that sentiment. He expects me to be like, ‘Yeah, I’m really embarrassed that a girl is beating me. ’’u2009” For Round 2, which he also lost, Hill plugged his iPod into a speaker and selected a playlist of   ’90s rap acts like the Coup and Jeru the Damaja. When the game ended, he briefly howled in grief, bounced over to shake hands and then floated the idea of barbecue for lunch. Not a bad loser. A certain comfort with vulnerability might be the most prominent aspect of Hill’s personality. At lunch, he gets the hiccups. He warns me that his face sweats a lot, but that the rest of his body produces a normal amount of sweat, and he occasionally mops his forehead as politely as anyone can mop anything using a napkin that he has folded into a tidy mopping rectangle. If you compliment his acting, he’ll say, “Thank you,” and then “Do you really feel that way?”  —   and not in a “Do go on” tone, but as if he suspects a polite fabrication and is offering an out. Once he was asked to audition for a part in a filmed musical adaptation, and he declined  —   because he can’t sing, but also because the   possibility of his audition tape’s being leaked was too embarrassing to contemplate. This hypothetical struck him as even more embarrassing than a leaked sex tape, because after all, he said, “most human beings have had more practice at having sex than they have at singing. ” Vulnerability is a counterproductive trait for a famous person to have, but Hill is funniest   when he plays characters thumping up against their feeble natures, and he is most affecting in dramatic roles doing the same. It makes you wonder whether the kind of person most suited to being an actor  —   sensitive, expressive, slightly weird  —   is the kind of person least suited to being a celebrity. Hill has been sensitive and weird since infancy. He grew up in Los Angeles, the son of an accountant and a costume designer, enjoying a childhood that he characterizes as “fun” yet “super emo. ” He cried frequently. For a year starting at age 4 he pretended to be a dog and padded around the house on all fours, woofing, which may have been his first acting experience. He intended to grow up into a writer until he became obsessed with skateboarding at around 10. His dreams of becoming a professional skater eventually receded because of a lack of skill, and he enrolled in college at The New School with plans to write and direct. “In school I was always a decent athlete, a decent student, but I was never exceptional at any of that stuff,” he says. “When I started taking acting classes, it was the first time teachers were like, ‘You’re good and you should keep doing this. ’’u2009” Another adult who recognized Hill’s potential was Dustin Hoffman, who happened to be the father of Hill’s former schoolmate Jake Hoffman and who suggested that Hill audition for “I Heart Huckabees. ” Hill got the part and appears halfway through the movie as a   teenager arguing with his sister and playing video games at a family dinner across from Mark Wahlberg. The role is a blip, but Hill earns his few minutes   appearing at ease despite never having been in a movie and having no idea, he told me, when the camera was on him. This confidence apparently stretches back to his youth: A Jewish Journal profile from 2012  —   a rare flattering one  —   includes a quote from Cantor Yonah Kliger of Temple Emanuel of Beverly Hills, where Hill had his bar mitzvah, describing him as “destined for something great” and “electric” even at 13, reciting his Torah portion in a prayer shawl. Three years after “Huckabees,” Hill   in “Superbad” as a   who cries, dances, lies, has his heart broken, is struck by a number of vehicles and exchanges tender    with Michael Cera’s character in a final scene that still makes me weep in a way that no Pixar movie ever will. This was his breakthrough. If “Superbad” cemented Hill’s status as an entertaining accent piece, “Moneyball” (2011) suggested that pegging him as a novelty actor was an error. His character in that movie, an economics geek named Peter Brand, is an introvert who walks the earth as if he’s about to be pantsed. He underplays the part so deftly that Brand’s emotional climax  —   when he sees that his methods actually work  —   is conveyed by no more than a few euphoric seconds of rapid blinking and a  . The next movie he appeared in was a critical disaster of a comedy called “The Sitter. ” Because of this seesawing, the best way to make sense of Hill’s career is to divide it roughly in half, not chronologically but by the two kinds of movies he makes: on one side, the goofy com edies, and on the other side,   movies by respected directors, like “Django Unchained” and “The Wolf of Wall Street” and “Hail, Caesar!” After “Superbad,” it would have been easy for Hill to take the Adam Sandler route and ride the wave of his own typecasting, making bad copies of the same movie over and over again. Instead, he exercised discretion in his roles and did a   job to hammer out the kind of career that hilarious sidekicks in   teen com edies have not traditionally enjoyed. (Jason Biggs offers a useful point of comparison it took him a decade and a half to recover from the abasement of “American Pie. ”) The parallel movie tracks have one thing in common, which is that Hill tends to play obsessive characters in both. In “War Dogs” he is obsessed with selling weapons to the United States government for piles of money. In “True Story,” he is obsessed with a murderer. In “Moneyball,” he is obsessed with sabermetrics. In “Cyrus,” he’s obsessed with his mom. In “Superbad,” he is obsessed with the probability of losing his best friend. Even in “Hail, Caesar!” though he is onscreen for approximately two seconds, the gag of Hill’s character is that he is too engrossed in processing legal papers to take note of Scarlett Johansson’s predatory innuendoes. Obsessiveness is a good filter for choosing roles, because there is nothing with more comic potential than a character who desperately wants something, and there’s also nothing with more tragic potential the distinction is in how that obsession pans out. It can be a poignant trait, as with Jay Gatsby or an evil one, as with Hannibal Lecter or a creepy one, as with Annie Wilkes or a mesmerizing one, as with Willy Wonka or an epic one, as with Charles Foster Kane or a pa thetic one, as with Norma Desmond. Monomania is infinitely versatile. Ellen Lewis, who cast Hill as Donnie Azoff in “The Wolf of Wall Street,” had been particularly impressed with his performance in “Superbad. ” “Wolf” wasn’t necessarily written to be funny, she said, but Martin Scorsese wanted a Donnie who could improvise. “Obviously it was a different way to go,” she said. “Jonah’s got depth, but at the same time, he’s extremely charismatic. And really funny people can be very dangerous. He showed that edge. ” He reminded her a little, Lewis said, of Robin Williams. One thing I’ve never understood about acting is how famous actors get better at it. Do they all have acting coaches on retainer? And if these acting coaches are so good, why aren’t they famous actors? When someone is freakishly precocious at acting, like Claire Danes, where does that come from? When someone gets appreciably worse at acting, like Al Pacino or Robert De Niro, how does that happen? And when someone gets perceptibly better at acting, like Jonah Hill, how does he make sure that his trajectory continues in a northeastern direction? At lunch he mentioned that every night before filming “Cyrus,” he brushed his lips with a toothbrush because his character seemed like the kind of person who would have permanently chapped lips. How did he learn to think of this stuff, these novelistic details? Hill shrugged at the question. “If it was your job to think of those things, you would. You just would. ” But what’s his secret? “The acting juice I drink every morning. ” But really. “I watch things over and over again,” Hill said. Like, 20 times. Most recently, “Behind the Candelabra. ” Before that, the French film “A Prophet. ” All the great Scorsese and Francis Ford Coppola movies, obviously. All the Paul Thomas Anderson movies. He loves Lena Dunham and Spike Jonze. When he finds a movie he likes, he watches it compulsively  —   and at a loud volume, because he has bad hearing from listening to live music as a youth without taking the proper precautions. He watches movies until he is able to forget that he is watching a movie, which to Hill is the sign of a really great movie. He picks the roles he plays using the same rubric he uses to pick the movies that he watches, which is by director. “If you have a great script, it’s hard to [expletive] it up  —   but I’ve kind of had that happen,” he said. “And I’ve had scripts that were not even complete, and the director was amazing, and I ended up being proud of the movie. ” Great directors, he maintained, make great movies. It took him a while to figure this out. Even if a role is good, he won’t do a movie now unless he believes in the director, because “You don’t want to be a cool character in a bad movie. ” Nobody has bulletproof judgment, though, and Hill’s character in this summer’s “War Dogs” could be seen as a terrific character in an otherwise O. K. movie. It’s not that “War Dogs” isn’t funny and it’s not as if Todd Phillips has made a   comedy about Ferguson, but it is an Iraq War movie made by the director of “The Hangover. ” There are strippers and an underwritten   role and Bradley Cooper. Phillips originally approached Hill with the movie a few years ago, offering him either of the two lead roles, but Hill declined, thinking it was somehow too similar to “The Wolf of Wall Street. ” Phillips kept trying. Hill appreciated the persistence and eventually said yes. He was driving out of the “yes” meeting in his car when he spotted Phillips leaving separately on his Vespa. Unaware that Hill was watching, Phillips pulled over to the side of the road and did a victory fist pump, by himself, in a moment of unguarded personal joy. Hill found this immensely endearing. (Philips said he does not recall this event but that he believes it happened: “I’ve been known to tool around on my Vespa and I’ve been known to get excited. ”) “It’s funny,” Phillips said of Hill, “because in actual life he’s  —   ‘quiet’ is the wrong word, but reserved. If you sit down to lunch with him you’ll laugh, but he’s reserved. When he steps on set, this natural swagger comes out. ” In the movie, Hill plays Efraim Diveroli, an   bro from Miami Beach with   ambitions and a buttery spray tan. The movie is based on a true story, which originally appeared in Rolling Stone and which Hill himself tried to option before finding out that Phillips had already bought the rights. The real Efraim Diveroli does not approve of the movie, has not spent time with Hill and has filed a lawsuit against Warner Bros. The buttery spray tan was applied nightly in Hill’s hotel room by a woman named Felicia, who stood aiming a hose while he pulled his boxers into a thong and revolved. Throughout filming he smelled faintly tropical. To prepare for all his movies, Hill compiles   playlists and then listens to them until they seep into his consciousness. For “War Dogs,” the playlist involved “a lot of cheesy,   Miami booty bass,” which gives you a sense of his character’s personality: loud, libidinous and whatever the opposite of introspective is. “I imagined him listening to music that revved him up to lie to someone,” Hill said. “A lot of the people with confidence that you play, you try to find their deep insecurity. I don’t think Efraim is a deeply, deeply insecure person. ” Instead of making the character a cartoon villain, Hill’s Efraim is gleeful and coercive and menacing, with a helmet of gelled hair and a   giggle that sounds like the creepiest ringtone on earth. Miles Teller   in the film but disappears in the role next to Hill, he has the charisma of a corn dog. Hill’s appeal, whatever the genre, is in his instinct to punctuate long stretches of smoothness with florid bloopers. He’s either fully in control of himself or totally at the mercy of his emotions. He has the fallibility of an Everyman with the magnetism of someone millions of young men and women would halt a   game to take a selfie with. A decade ago we idolized celebrities whom we could never, in a million years, imagine being or dating. Lately we have adjusted our expectations downward to prefer figures, like Hill, who could be described as “reasonably aspirational. ” In person he’s both smooth and   not with cinematic extremity but in a way that makes you think his friends definitely have a lot of Jonah Hill anecdotes in their back pockets. He is a generator of incidents. One morning in June we went for a southbound walk on the High Line. Hill ambled along at a      pace, pausing to buy a $1 amulet reading WORK SMOOTHLY LIFETIME PEACE from a (possibly phony) monk and lingering to form a   audience for a street performer singing Rick Astley’s “Never Gonna Give You Up. ” “I love this song,” Hill said, grooving mildly and retrieving a bill from his pocket. There was no visible donation receptacle, so he put the money on the performer’s side table, where it started blowing away in the wind. To prevent this, Hill slid the man’s nearby iPhone onto the bill to act as a paperweight, but his finger tapped “pause” in the process and the Rick Astley instrumental abruptly ceased. “I’m sorry!” Hill wailed. “I completely [expletive] that up. ” The performer made a “no prob” gesture and resumed singing, then did a back flip, as if to assure Hill that everything was cool between them. As we walked away Hill spoke directly into my tape recorder, as if to guarantee that the corny Rick Astley joke he was about to make would be reflected accurately for future generations: “I want it on the record that he just looked me in the eye and promised me never to hurt me. It’s documented. If that man ever, ever breaks my heart or deserts me, there will be legal repercussions. ”'"}, "time": 1742563854.8916552}