{"duration": 0.10655450820922852, "input_args": {"text": "\"(mis à jour 19:05 26.10.2016) URL courte 15 2043 16 4 L’égérie ukrainienne Nadejda Savtchenko, libérée en mai dernier après deux ans de détention en Russie, y est revenue pour la première fois mercredi, alors que cela pourrait la faire accuser de haute trahison à son retour en Ukraine. \\nConnue pour sa position intransigeante, Nadejda Savtchenko, députée de la Rada suprême (parlement) d'Ukraine, est venue à Moscou pour le procès en appel de ses compatriotes Stanislav Klykh et Mykola Karpiouk, qui se déroule à la Cour suprême de Russie, annonce sur Twitter Ilia Novikov, avocat de ces derniers. © Sputnik. Mikhail Voskresensky Nadejda Savtchenko revient à Moscou « Ces deux Ukrainiens ont été condamnés en mai à plus de 20 ans de prison par un tribunal de Tchétchénie pour avoir combattu contre les forces russes lors de la guerre dans cette république du Caucase dans les années 1990 », rappelle M. Novikov. \\nLa pilote militaire de 35 ans, qui purgeait une peine de 22 ans de prison en Russie pour avoir, selon des accusations qu'elle rejette, fourni à l'armée ukrainienne la position de deux journalistes de la télévision publique russe tués par un tir de mortier en juin 2014, a étééchangée fin mai contre deux Russes et a pu rentrer à Kiev, où elle a été accueillie en héroïne. Depuis, elle a fait de la libération des Ukrainiens détenus en Russie sa priorité. © Sputnik. Mikhail Palinchak Savtchenko bientôt à la tête d’une nouvelle révolution en Ukraine? « Même si je ne reviens pas vivante de Russie, j'irai quand même soutenir Mykola Karpiouk, Stanislav Klykh et tous nos gars qui restent en captivité en Russie et luttent pour l'Ukraine », a déclaré Nadejda Savtchenko, dans une vidéo publiée sur sa page Facebook. \\nQuoi qu'il en soit, selon les sources kiéviennes du journal russe Kommersant, l'arrivée de Mme Savtchenko à Moscou n'est en réalité qu'un élément d'une campagne d'envergure lancée contre le président ukrainien Piotr Porochenko par différentes forces politiques, notamment par Ioulia Timochenko, ex-première ministre du pays et chef du groupe parlementaire Batkivchtchina. \\nUn député du bloc de Piotr Porochenko à la Rada a estimé dans un entretien avec le quotidien russe que Mme Savtchenko comptait s'entendre avec les autorités russes sur la libération du journaliste Roman Souchtchenko, arrêté pour espionnage en Russie, et d'autres ressortissants ukrainiens emprisonnés ou attendant leurs procès dans ce pays. « En cas de réussite, Mme Timochenko qui compte Nadejda Savtchenko parmi les membres de son groupe parlementaire, pourra accuser le président d'incapacitéà défendre les Ukrainiens emprisonnés en Russie. Et son parti Batkivchtchina insistera encore plus sur une élection présidentielle anticipée », a déclaré l'interlocuteur de Kommersant. © Sputnik. Eugene Kotenko Seuls 19,5% des Ukrainiens prêts à réélire le président Porochenko \\nEt d'ajouter que l'entourage du chef de l'État avait très mal réagi à la visite de Mme Savtchenko en Russie, pays agresseur. « Nous ne croyons pas une seule minute que Mme Savtchenko se soit rendue en Russie sans avoir reçu des garanties préalables de sa non-arrestation à la frontière », a indiqué la source du journal russe. \\nNéanmoins, Dimitri Peskov, porte-parole du président russe, a déclaré que l'arrivée de Nadejda Savtchenko n'avait pas été concertée avec le Kremlin, cela n'étant « pas nécessaire ». « Toute la procédure juridique concernant Mme Savtchenko a été remplie. Elle peut à tout moment entrer en Russie et en sortir. Il n'y a rien à commenter là-dessus », a expliqué aux journalistes M. Peskov. \\nOn apprend que le chef adjoint du groupe Front populaire à la Rada Iouri Bereza a déjà exigé que, suite au voyage de Nadejda Savtchenko à Moscou, on lui ferme l'accès aux secrets d'État, en l'excluant du Comité de sécurité nationale. \\nSuivez Sputnik sur Telegram pour ne jamais manquer les actualités les plus importantes grâce à nos sélections du matin et du soir. Pour recevoir les actualités de notre chaîne, il suffit de télécharger l'application Telegram sur n'importe quel smartphone, tablette ou ordinateur puis cliquer sur le lien et appuyer sur « Join » ...\""}, "time": 1742563921.530836}