{"duration": 0.08977723121643066, "input_args": {"text": "'With headlines swirling and lawmakers meeting behind closed doors, it’s not difficult to conclude there is trouble in the Trump White House. [But a deeper dive reveals that lots of people who would not consider themselves Trump supporters admit there is no evidence of any wrongdoing by the Trump campaign regarding alleged collusion with Russians.  Here’s a list of some of those who fall into the “no evidence” column: “The last time we spoke, Senator, I asked you if you had actually seen evidence of collusion between the Trump campaign and the Russians, and you said to me  —   and I’m quoting you now  —   you said, ‘not at this time.’ Has anything changed since we spoke last?” asked CNN’s Wolf Blitzer, “Well, not —  no, it hasn’t,” Feinstein said. “But I just want to be precise, Senator. In all of the —  you’ve had access from the intelligence committee, from the Judiciary committee, all of the access you’ve had to very sensitive information, so far you’ve not seen any evidence of collusion, is that right?” Blitzer pressed. “Well, evidence that would establish that there’s collusion. There are all kinds of rumors around. There are newspaper stories, but that’s not necessarily evidence,” Feinstein admitted. “But just to be clear, there has been no actual evidence yet,” Sam Stein of the Huffington Post asked. “No, it has not been,” Waters said. “What I have found appalling is the number of leaks that have taken place over the last several months,” Brennan said at the SALT conference in Las Vegas, the annual gathering of   managers and other financiers. “This needs to be stopped. ” “The damage that was done is what was leaked in the aftermath, what was put in the media. The real damage to national security is the leaks,” Brennan said. Brennan said. “These individuals who still stay within the government and are leaking this stuff to the press need to be brought to task. ” “Former Director of National Intelligence James Clapper told MSNBC’S Andrea Mitchell on Friday that there could be evidence of collusion between Russia and President Donald Trump’s 2016 campaign,” CNN reported. But, “There was no evidence that rose to that level, at that time, that found its way in to the intelligence community assessment, which we had pretty high confidence in,” Clapper said of collusion between Trump campaign aides and Russians, referring also to the U. S. intelligence assessment that Russia tried to influence the presidential election in favor of Trump. “That’s not to say there wasn’t evidence, but not that met that threshold,” Clapper said. Reuters ran a story on Thursday with the headline “Exclusive: Trump campaign had at least 18 undisclosed contacts with Russians sources” But buried in the story is the real headline: “In January, the Trump White House initially denied any contacts with Russian officials during the 2016 campaign. The White House and advisers to the campaign have since confirmed four meetings between Kislyak and Trump advisers during that time. The people who described the contacts to Reuters said they had seen no evidence of wrongdoing or collusion between the campaign and Russia in the communications reviewed so far. ”'"}, "time": 1742562001.3813066}