{"duration": 0.05241203308105469, "input_args": {"text": "'A man who admitted changing the Hollywood sign to “Hollyweed” has turned himself in to the authorities. Zachary Cole Fernandez, a    artist, surrendered on Monday with his lawyer at his side, according to the Los Angeles Police Department. He was booked on a misdemeanor trespassing charge and released on bail. The sign was changed about 3 a. m. on Jan. 1, when two O’s were partly obscured by sheets and turned into E’s. It remained that way throughout the morning before the sign was restored. In a phone interview, Mr. Fernandez said he considered the results more of an art installation than a prank. “Yeah, I broke the rules, but I broke it with good spirit and good intentions,” he said on Tuesday. “It was just to bring light and positivity and happiness. ” But David Ryu, a Los Angeles councilman, remained unamused. “Pranks of this nature deplete the resources of our valuable public safety personnel, in both responding to the prank and in responding to the increased crowds and copycat attempts that these incidents generate,” he said in a statement on Monday. “My office has urged the city attorney and L. A. P. D. to investigate and prosecute this case, as well as all attempts to trespass near, alter, or vandalize the sign. ” Mr. Fernandez is expected to appear in court on Feb. 15. He said he had been inspired by a similar alteration in 1976, and that he had used clamps and sheets so as not to damage the sign. “I don’t want to destroy anything,” he said. “I’m about peace and love and respect and integrity and a lot of things that in some ways are missing these days. I wanted to show there’s a light in the world. ” A father of four children ranging in age from 3 to 9, Mr. Fernandez said he had been told he could face up to six months in jail. He said he saw that as excessive for a “harmless” art project, but would accept any consequences. “I’m a person of integrity,” he said. “If I do something wrong, I will own up to it. ”'"}, "time": 1742563673.4640565}