{"duration": 0.13893556594848633, "input_args": {"text": "'MIAMI  —   The day Rodrigo   told his prominent parents about his new gender identity, he did so in a letter that he left on their bed. Then he grabbed a packed bag and, unsure of whether he would be welcomed back, went to a friend’s house to see if his family would love him or leave him. His shocked parents, Representative Ileana   a Miami Republican, and Dexter Lehtinen, who served as the top federal prosecutor here, did not hesitate. They grabbed the phone and told him that they loved him and that family trumped all, and asked him to come home. But as with many parents of transgender children, they were also overwhelmed by fear: The future they saw for their then    whom they had named Amanda, would be pockmarked with discrimination and bullying, if not outright violence. It was this visceral reaction to want to protect her child that drove Ms.   to break from her party’s skepticism or hostility on gay and transgender issues  —   a stance evident now in North Carolina’s battle over transgender bathroom visits  —   and become a conspicuous advocate in Congress and more recently in public service announcements. On Monday, Ms.   her husband and her son, now 30, will appear in the latest one for SAVE, a longtime South Florida gay rights group that hopes to engage the Latino community here. “I worried about his safety and about his ” Ms.   said, noting that inflammatory debates like the one about school bathrooms serve to further alienate transgender youths and subject them to more bullying and animosity. “I didn’t want him to be depressed. You think of all the parade of horribles that could happen. ” There is ample evidence that many transgender people continue to be rejected by their families, employers and society, a situation that is beginning to change as the transgender movement becomes more visible and better organized. And while Ms.   profoundly disagrees with President Obama on a number of issues, especially on his approach to Cuba, she agreed with his administration’s directive Friday telling school districts to allow students to use the school facilities that match the sex they identify with, even if that conflicts with their anatomical sex. “Allowing students to use the bathroom of their authentic selves is a step forward in stopping the stigma around transgender individuals,” said Ms.   63, the first Hispanic woman elected to Congress. “Unnecessary laws only make transgender youth feel unaccepted, and can lead to depression or even worse, suicide. ” Her husband, a lawyer who as a United States attorney here supervised the prosecution of the Panamanian strongman Manuel Noriega and now teaches constitutional law at the University of Miami, said the administration had sent a strong message. But he questioned the method, worrying that the president’s unilateral approach might undercut the protections he is offering. “It’s important that in this slow but necessary recognition of equality that we do it on a sound legal basis, because law and process carry great weight with the American people,” Mr. Lehtinen said. “It legitimizes what we are trying to do. ” As for the Republican Party, Ms.   who has served in the House for more than 25 years, said it would come along as more Americans shared stories of how discrimination can harm the lives of gay and transgender people. “The Republican Party’s stance on the issue is lagging behind,” she added. “But folks are figuring out that there is no political harm in embracing these issues and, in fact, they see a lot of good can come out of it. ” For her family, the journey that began with Rodrigo’s letter in 2007 unfolded over five years. Rejecting their child, who had just graduated from Brown University, was unthinkable. Even so, getting entirely comfortable with the idea of a daughter who had become a son, a sister who had become a brother, was not altogether easy for the family and required adjustments, particularly outside the home. “It was an evolving conversation for the next five years,” said Mr.   who will soon move back to Miami from Los Angeles, where he works as a   for a gay, lesbian and transgender rights group. “Nobody expects their child to be transgender. It’s a big shift, and we often want to go back to our normal lives. ” Although he had come out as bisexual as Amanda in high school, he said he knew so little about transgender people that he did not see it in himself until he got to Brown. He trod slowly, first by wearing men’s clothing and asking friends to call him Rodrigo. “I didn’t know how comfortable a person could feel until I had tried on men’s clothes,” said Mr.   who goes by Rigo, adding that he had long grown accustomed to feeling depressed or anxious. “A fog lifted. ” When the moment came to tell his family, he had no reason to think they would lash out, but he still imagined the worst. “I am about to lose everyone I love,” he told himself. He also feared that he would hurt his mother’s political career, a possibility that did not worry Ms.  . A turning point came when he told his    abuelo in 2010. “We were terrified to tell him,” Mr.   said. Instead of becoming angry, his grandfather shrugged. At his age, he said, nothing was more important than the happiness of his grandchild. “It was an incredibly simple and loving response,” Mr.   added. As time went on, he began taking testosterone, and now sports a beard. Last year, he married a man, adding Heng to his name. His father, who was badly wounded in the face in Vietnam as an Army Ranger (and still bears the scar) says one way to generate empathy is to help people understand that sexual and gender orientation do not define a person’s character  —   but that their work ethic, their honesty, their grit do. “I don’t mean it’s not important to the individual it’s that it should not be important to us which choice they make,” Mr. Lehtinen said. “They are the same person. It’s sometimes difficult for me to understand why anybody would think that their fundamental character would change because of their sexual orientation. ” Their son, Mr. Lehtinen added, has never been happier. As for the family, the new normal is exactly that  —   normal. This is exactly the message the Lehtinens hope to convey to Latinos as they sit around their kitchen table drinking coffee in the SAVE public service announcement, which will air on   networks. Many Latinos are perceived as more traditional and more reluctant to embrace sexual diversity. Gay, lesbian and transgender issues were mostly taboo until recently, which meant that there was scarce media attention on the issue. Polling by the local management consultant Bendixen  Amandi, which has surveyed people on these issues for years and was commissioned by SAVE, showed that the way to connect with Latinos was to present a parent talking about the importance of family. This was an easy fit for the Lehtinens, who embraced that message from the start and whose prominence here gave it extra weight. “Every transgender person is a part of someone’s family and should be treated with compassion and protected from discrimination,” Ms.   said in the video.'"}, "time": 1742564494.6346226}