{"duration": 0.08521676063537598, "input_args": {"text": "'Leave a reply \\nAlexandra Bruce – This is Daniel Liszt, Dark Journalist’s Election 2016 Special Report featuring me, Alexandra Bruce in the first segment and then Dr. Robin Falkov of Event Horizons Radio in the second segment. \\nI discuss the unprecedented details of this wildly leak-driven Election, several days prior to the disclosure by Dr. Steve Pieczenik, that WikiLeaks has been used as a channel by over 15 US intelligence agencies, to systematically undermine the Clinton Campaign, in a soft counter-coup against the soft coup that has been committed by the Clintons via the Clinton Foundation over the past several years, with their corruption and co-option of everybody of strategic interest to them and their agenda to return to the White House. \\nThis is the most leak-driven election in history, due to this covert campaign which has used WikiLeaks to expose the emails of key figures of the Clinton Campaign. The Benenson Group’s “Salvage Report” – which was leaked by Anonymous clearly shows that one’s exposure to Alternative Media is a major determinant of how one will vote. \\nOf those polled in the Report, those who only watch the Mainstream Media had a much more favorable impression of Hillary Clinton. Those who were exposed to Alternative Media tended to have a negative view of Clinton and to have a more favorable view of Trump (I screwed this up, during the interview). Those who have not been paying attention to the flood of leaks are more likely to vote for Hillary. In this poll, that group is over-represented by women and non-whites. \\nBesides WikiLeaks, there have also been leaks by the decentralized hacktivist group, Anonymous, by embattled New Zealand Internet entrepreneur Kim DotCom; by DC Leaks and by Clinton “Fixer”, Jeff Rovin, who broke his 27-year silence with his withering revelations published by the National Enquirer about the inconceivable depravity of both Bill and Hillary Clinton’s activities, which he actively helped to cover-up for the better part of two decades. \\nOne of the craziest-seeming leaks but potentially the most serious was that of the Benenson Group’s Firesign “Salvage Report”, in which Clinton’s top strategist runs through scenarios that would prevent Trump supporters from going to the polls to vote. The options include a fake holographic “Alien Invasion”, that would terrify the public on election day and throw the results into chaos. \\nThe ainwave-entrainment-frequencies/” target=”_blank”>advanced brainwave entrainment frequencies and 3D laser FIRESIGN technologies proposed for deployment by the Benenson Group are above Top Secret and it’s unlikely that either Joel Benenson, members of his staff or anyone in the Clinton camp have the security clearances to know the details about it, let alone to discuss it as an option to be deployed in a bid to win the election. This fact could actually land some of those people in some very hot water. \\nThat aside, there are rumors that FIRESIGN was tested with success in the theater of a Middle East military operation. In that particular case, it is said that images and subliminal themes of a religious nature were projected onto the skies above the battlefield and into the minds of those targeted, causing a large scale surrender of enemy soldiers. \\nIn the second part, Dr. Robin Falkov opines that the Trump presidency may be the last chance for America to wrestle control back from a variety of special interests unified by a Transhumanist agenda, including Common Core, Open Borders, Mandated Vaccines, The Trans-Pacific Partnership (TPP) and the Centralization of Power via a powerful Artificial Intelligence Global Control Grid. \\nDon’t miss this fascinating Dark Journalist Special Report on Election 2016. Share this:'"}, "time": 1742562551.5821104}