{"duration": 0.12901735305786133, "input_args": {"text": "'Leave a reply The 7 Maoi facing the equinox sunset at Ahu Akivi on Easter Island (photo copyright Ian Sewell) \\nPaul Rosenberg – Civilization has to be transmitted from one generation to another. If it isn’t, processes break down and life becomes difficult. Soon there must be a painful reform, or else the civilization will be lost. \\nThis is fundamentally the job of families (especially parents), but at the moment that’s not really possible: How many families can survive on one income? And if one of the parents can’t stay home and teach the fundamental lessons of civilization, who will pass them to the next generation? \\nCertainly the better daycare facilities try, but to think that someone watching a couple dozen kids is going to transmit civilization to them as effectively as a parent who’s with the child day and night is simply ridiculous. The blame for this rests almost solely at the feet of the state of course, but we’re getting ahead of ourselves. \\nI’ll begin by quoting the redoubtable Fred Reed on the current situation: \\nWe live in a dying culture and, soon, a diminished country. It cannot be saved. \\nNot true? Add up the bits and pieces. We laugh in horror, some of us, primarily the older, at the decline of schooling, the courses like Batman and the Struggle for Gender Equity. Comic, yes. Yet in aggregate, these constitute an academic and civilizational collapse both profound and irreversible. Enstupidation does not happen in a healthy country. Who even wants to reverse this onrushing night? Not the universities, nor the teacher’s unions, nor a professoriat gone as daft as the “students,” nor the banks battening on student loans [sic]. \\nI’m more optimistic than Fred in that I think our civilization can be saved. But what he writes is true, and the West’s big institutions are simply vampires sucking the blood of a declining civilization. \\nI think we can all admit that every major institution of the West, including the mega-corps, is engaged in stripping the Western populace of everything they possibly can. There is no virtue involved, no principle, no honor… there’s not even much consideration for the future. These outfits, under whatever excuses they’re trotting out this year, are strip-mining Western civilization, not building it. \\nThat said, let’s look at some particular villains. The Political Correctness Barbarians \\nWhen I first saw these people rising to power, decades ago now, I thought they were so ridiculous that they’d come and go quickly. Unfortunately I was wrong, and they subverted millions of children. The current insanity over “safe spaces” and such condemns them openly, and especially that it’s becoming acceptable to say “I hate white people.” Anti-Religionists \\nIt’s one thing to be a simple agnostic. It’s quite another to go out and try to dismember religion… which in nearly every case means Christianity. And to be honest about it, most people who do this are acting out their personal traumas: either in permanent rebellion to their parents or in anger at one church or another. \\nSlashing and burning things simply bears bad fruit, but here’s the core issue with attacking Christianity: \\nThe people who pushed Christianity out of Western culture were arrogant and destructive – not that they pushed it away, but that they never bothered to replace it . \\nIf you want to remove the moral core of a civilization, you have to replace it with something better. And the religion-haters did not. They sawed off the limb that held them and were too arrogant to consider the consequences. Academia and the Education Vampires \\nThe Enlightenment sits before us as a twisted wreckage. Its destruction followed the usual path: first setting up institutions, then monopolies and fiefdoms, and finally lording it over others as far and as long as they could. \\nEducation has whored itself out to the state and treats its students as income-generating tools. Are there a few exceptions? I’m sure there are, but they are few. Academia, including most of scientific academia, has disgraced itself. Could any serious Enlightenment thinker have respected “scientific consensus”? Please! Science places experimentation above all and never ever sells itself to a page full of names and initials! \\nThe scientific process has been subjugated by institutions that thrive on restricting access. Cronyism is massive, peer review is corrupted, and the uncredentialed are treated like lepers. These institutions sit atop the corpse of the Enlightenment. Corporatized Art \\nThe arts – music, film, painting, sculpture – are not widgets. They are immensely more important than that, forming minds and cultures in deep ways. \\nHow to pay the artist (singer, writer, whatever) has long been a problem and remains one. Hopefully a good answer arises at some point. Until then, seeking profit by dumbing down every art form is simply degrading. \\nThe corporations that now control music and film have bastardized art for money. I’m not ready to jail them and I certainly don’t think the state could do a better job, but I am willing to say that they have disgraced art. Have you ever wondered why elegance is gone? Why loudness and drunkenness are treated as virtues? The State \\nBeing that it forcibly skims half of the West’s production every year, given that it punishes all who do not obey it, and given that its laws are for sale to the highest bidders, the number one destroyer of Western civilization is the state. Hands down. Think of what people could do for their children and grandchildren with twice as much money. \\nAnd don’t get me started on enforced charity, the victim culture, “you didn’t build that,” and “it takes a village.” I don’t like to swear in print. A Final Point \\nI could go on, but this is a column, not a treatise. My final point is this: \\nNone of the above are transmitting civilization, even if some of them once did. They are tools for reaping the masses, and we need to leave them behind. But far more importantly, we need to build methods and systems that will transmit Western civilization. \\nThe authentic Western virtues – cooperation, initiative, creativity, curiosity, co-dominance, and real justice (not merely a form thereof) – are necessary for a prosperous humanity, and the institutions of our time have flamboyantly failed. \\nIt’s time to start building afresh. SF Source Freeman’s Perspective Nov. 2016 Share this:'"}, "time": 1742562142.8080242}