{"duration": 0.06314802169799805, "input_args": {"text": "'What Anonymous is and what it means really depends on the individual; to one person it means one thing, and to another, something else. Anonymous has even been around long enough, these days, that there is actually a generational gap developing. Protesters wearing Anonymous Guy Fawkes masks take part in a demonstration against controversial Anti-Counterfeiting Trade Agreement (ACTA), on February 25, 2012 in Nice, southeastern France. AFP PHOTO / VALERY HACHE\\nThink about it in this perspective: the Matrix is already 17 years old; there is an entire generation which didn’t grow up with it!\\nThe oldest members are naturally the most die-hard ‘Anons,’ and the older the member, typically, the better the hacker – there are becoming fewer and fewer of them by the day. For the most part the oldest ‘Anons’ are of the mind that Anonymous should be an exclusive hacker collective – everyone who can’t hack is largely considered a n00b or just a fan of the movement.\\nAnons protesting against the government\\nThe newest members of Anonymous tend to be social justice warriors of sorts; almost none of them are hackers, but they make up the large majority of people who now call themselves “Anonymous.” They are, for the large part, protestors, civil rights/liberties advocates or people who want to change the world, but are unsure on how to go about it. They seem to be drawn to Anonymous, not because all of the hacks occurring around the world, but because they see Anonymous publicly advocating for many of the same things they believe in.\\nThere are a lot of things happening in this world that people do not get to vote on, or simply have no say over; there are a lot of things that tend to control/dictate peoples’ lives, for which they have no control over.\\nI remember a conversation last year with a friend in the movement. I was frustrated because all I want is to change and make an impact on the world, but always feel like nothing more than an ant – nothing I seem to do is even measurable in the grand scheme of life.\\nThey responded, “Welcome to the anthill.”\\nJust as with any group of people in the world, or in politics, there are bound to be some fringe lunatics/extremists on both sides of the spectrum – and Anonymous is no different.\\nPeople do not seem to understand that no one in Anonymous speaks for anyone else in Anonymous. Far too often, people in Anonymous are left defending – or accused – for the actions of other people they know nothing about. People also do not seem to understand what it means when some says “Anonymous is an idea, not a group.”\\nWhat it means to be part of an “idea” can also differ depending on the purpose. But what I have come to believe this “idea” means is a freedom of expression in its purest form: Freedom from censorship; freedom for ALL knowledge to be free and available to the public/society; freedom for people to stand up and fight for whatever they believe in; freedom for everyone’s voice to matter – not just corporations/politicians/government elites.'"}, "time": 1742561993.419366}