{"duration": 0.11794161796569824, "input_args": {"text": "'37.0% 6.2% \\nLower interest rates are not the reasons why rates of return on retirement savings for most households are low. High fees, undiversified liquid portfolios, and low net-of-tax returns are contributing factors. The low returns are the result of the failed structure of individual-directed, commercially-managed 401(k) and IRA plans. Because individuals in the bottom 60 percent or so of households get little tax relief due to their low marginal tax rate, the retirement accounts for the households at the bottom of the income distribution can easily earn negative real returns after deductions for fees are taken into account [8] . \\n2) Lower interest rates force employers to increase funding contributions to pay for defined pension plans [9] . If employers must increase contributions to fund promised liabilities such as pensions and retiree health care, funds dedicated to employee compensation shift to finance post-employment obligations. Increased pension contributions add to labor costs and shift total compensation away from wages. Aggregate spending or demand consists of spending by households, businesses, government, and foreigners: the most important source is households — two-thirds of aggregate demand comes from households. [10] Most income to households takes the form of wages and salaries. Though labor income to the bottom 90 percent of households has been stagnant for over 30 years, [11] increased pension contributions suppresses current aggregate demand even further — especially in the public sector, where pay has only increased by less than 5 percent in the recovery, and in which the overall employment figure is 500,000 less than it was before the recovery, and 2 million lower than what we would have if public sector employment kept up with population increases and the economy. There are fewer IRS agents per tax dollar collected; fewer teachers; and U.S. Postal Service employees are at 1964 levles. [12] . \\nIn short, increased employer contributions to defined-benefit pension plans – though vitally important to ensure promised pensions are paid, have the unfortunate side effect of reducing aggregate demand, further weakening the economy. The Wisconsin pension fund and CalPERS, after being nervous about the riskiness in their bond fund, are taking the bold move of lowering their interest rate assumptions. That sets the stage for negative economic feedback effect in our low growth environment — more taxes or lower benefits or both. [13] \\n3) Lower returns on assets lowers household wealth. The negative wealth effect lowers current spending, and makes a weak economy even weaker. [14] Without activist fiscal policy to overcome the suppression in wealth and spending, the economy only weakens and forces interest rates down, continuing the cycle. \\n4) Low interest rates immediately suppress the buying power of seniors. Though most seniors in America do not obtain income directly from financial accounts, many still do. [15] Without activist fiscal policy, household consumption will be further suppressed, further slowing the economy. \\n5) Portfolio managers are tempted to take greater risks to reach their investment targets, which in turn creates asset inflation — the U.S. stock market is trading at multiples similar to 2007, and the Case Shiller index is at pre-2007. This leads to financial destabilization and increased volatility. \\nHarvard professors Bo Becker and Victoria Ivashina [16] found evidence that large institutional investors, like pension funds and insurance companies that have to meet a specific return target, often reach for yield by buying assets that promise high returns because the riskiness is not well measured. \\nSince low interest rates prompt investors to take on below-the-radar risk, the system as a whole is exposed to greater risk [17] because of feedback loops — as billions of dollars are plowed into risky bonds, the yields are driven even lower. “Reaching for yield” was a contributing factor to the financial crises of 2008. \\n6) Low borrowing rates changes the relative price of capital over labor. Though substituting capital for labor because interest rates are low is not a practical problem for now – given the cash glut held by firms – low interest rates can encourage very low-value capital investment in the private sector. This is not a practical problem at present because firms are relatively uninterested in investing despite the low rates. But if the capital substitution occurs without an increase in demand, there will be labor displacement. \\nVirtually every economist from the left or right is commenting on the failure of our collective will to borrow money in order to fund infrastructure when interest rates are so low. [18] The failure of Congress (and political leaders at the state and local level who can issue public debt) is the only cause of the increasing public-good deficit. The nation needs trillions of spending in infrastructure just to maintain the level of investment reached decades ago. [19] \\n(A group of economists [20] are considering monetizing the debt [1] precisely because Congress won’t act to invest long term. If the regulatory legal structure can be changed, the next president may have to bypass Congress and buy bonds directly from state and local governments. Clearly, pension funds would benefit directly from the supply of high-yielding government bonds.) \\n7) The banking community is organizing to point out that a low interest rate destroys the business model for banks. [21] \\n###p[22] We know permanent austerity leads to profound risks of permanent stagnation, but what is underappreciated is how household, investment and government reactions to the blunt, non-precise, and somewhat crude tool of permanent low interest rates will combine to cause enduring damage to the economy. Investors, especially institutional investors such as pension funds, should rise up and demand the combination of higher rates and the swift end of permanent austerity with bold public spending. \\nEndnotes'"}, "time": 1742561990.7338204}