{"duration": 0.06713557243347168, "input_args": {"text": "'We Are Change \\nBy J. Christian Adams\\nVia PJ Media\\n\\nLeaked funding documents reveal an effort by George Soros and his foundations to manipulate election laws and process rules ahead of the federal election far more expansively than has been previously reported.\\nThe billionaire and convicted felon moved hundreds of millions of dollars into often-secret efforts to change election laws, fuel litigation to attack election integrity measures, push public narratives about voter fraud, and to integrate the political ground game of the left with efforts to scare racial minority groups about voting rights threats.\\nThese Soros-funded efforts moved through dozens of 501(c)(3) and (c)(4) charities and involved the active compliance with civil rights groups, government officials, and purportedly non-partisan groups like the League of Women Voters.\\nThe leaked documents also reveal deliberate and successful efforts to manipulate media coverage of election issues in mainstream media outlets like the The New York Times . \\nConservatives and Republicans have no opposing effort or source of funds that represents even a small fraction in opposition to level of the Soros-led manipulation contained in the leaked documents.\\nThe documents reveal that the Soros campaign fueled litigation attacking election integrity measures, such as citizenship verification and voter ID. It funded long-term efforts to fundamentally transform election administration — including the creation of databases that were marketed to state governments for use in voter verification. It propped up left-leaning media to attack reports of voter fraud, and conducted racially and ideologically targeted voter registration drives.\\nThe racially targeted voter registration drives were executed at the same time Soros dollars were funding other public relations efforts to polarize racial minority groups by scaring them about the loss of voting rights and the dangers of police officers.\\nThe Soros documents reveal hundreds of millions of dollars being poured into the effort to transform the legal and media environment touching on elections. One document notes that poverty-alleviation programs are being de-emphasized for this new effort. It states: “George Soros has authorized U.S. Programs to propose a budget of $320 million over two years, with the understanding that the annual budget for U.S. Programs will be $150 million beginning in 2013.”\\nThe purpose of the expansion is clear:\\nThe increase in Democracy and Power Fund budget will expand funding of non-partisan voter engagement to catalyze participation from African-American, Latino, immigrant, and youth communities in particular, and to ensure a fair and just redistricting process. The increase in the Transparency and Integrity Fund will expand support for election reform, judicial independence and journalism.\\nBelow are some highlights of this expansive Soros-funded campaign to alter the legal environment and rules of American elections.\\nRead more: https://pjmedia.com/jchristianadams/2016/11/07/leaked-documents-reveal-expansive-soros-funding-to-manipulate-federal-elections/\\n\\nThe post Leaked Documents Reveal Expansive Soros Funding to Manipulate Federal Elections appeared first on We Are Change .\\n'"}, "time": 1742564190.9664407}