{"duration": 0.09236836433410645, "input_args": {"text": "'BUDAPEST  —   Lawmakers in Hungary on Tuesday rejected a proposed national ban on refugees relocated from the rest of the European Union, dealing a rare defeat to Prime Minister Viktor Orban. Mr. Orban submitted a plan to ban the refugees, in the form of a constitutional amendment, last month, after a similar proposal failed to pass by referendum because of insufficient voter turnout. He has vowed to block a European Union program that would resettle migrants from the Middle East and Africa who have gone to countries like Greece and Italy. Under that program, Hungary, a nation of 10 million, would have to accept  1, 294 of a total of about 160, 000 migrants. The amendment needed   of sitting members of the   Parliament to pass. It got 131 votes on Tuesday  —   two shy of the necessary threshold. Three lawmakers voted no, and the rest abstained. The   Jobbik party, which is part of the official opposition but usually sides with Mr. Orban’s Fidesz party on migration issues, was crucial to the defeat of the amendment. Gabor Vona, a lawmaker and the leader of Jobbik, said that his party would support only a solution that “defends Hungary and Hungarian people, not just from poor migrants but from rich migrants, not just from poor terrorists but from rich terrorists. ” He was referring to a rule that allows foreigners who invest over 300, 000 euros, or about $332, 000, in Hungarian bonds to acquire residency. The program dates to 2012, but it has drawn attention recently, after reports that Hungarian bonds could be bought in places like Erbil, Iraq. Critics say that allowing migrants to settle in Hungary could open the door to terrorists from unstable countries like Iraq, and they say the residency program might open the door to corruption. The Fidesz party has been politically weaker since last year, when it lost its supermajority in Parliament. That advantage had allowed Mr. Orban’s government to rewrite the Constitution and to pass legislation to rein in the judiciary and the press, packing some of the country’s top institutions with political allies. Lajos Kosa, an ally of Mr. Orban who leads Fidesz lawmakers in Parliament, said before the vote on Tuesday that the Jobbik party would be “joining the ranks of traitors” if it rejected the amendment. “Hungary can only count on Fidesz and K. D. N. P. in the struggle against migration,” he said as he emerged from the vote, using the initials for the Christian Democratic People’s Party, which is part of the governing coalition. “We are naturally going to continue the struggle,” he said, noting that more than three million voters in the referendum had opted to support the ban on migrants. On Tuesday, analysts were cautious in interpreting the defeat of the amendment as a sign of the government’s declining political power. “I wouldn’t say that this is a huge failure for Orban  —   it’s a failure, but a minor one,” said Csaba Toth, the director of strategy for the Republikon Institute, a research and advocacy group that has been critical of Mr. Orban’s government. “This is the second time the government can’t have their own way, which is important for a group whose main governing strategy is power. ” Last year, Mr. Orban and his government began an aggressive campaign against migrants, particularly those from the Middle East, as hundreds of thousands crossed Hungary’s southern border, most of them en route to Germany. The number of crossings fell nearly to zero after Hungary built a   fence along sections of the border and as the flow of migrants shifted away from the Balkans. Nonetheless, Fidesz’s campaign against migration has continued, and the party’s stance has seized both attention and voters from Jobbik, which had been the main voice for   nationalists. Mr. Toth, the analyst, said that the vote on Tuesday could be seen as an attempt by Jobbik to improve its political standing. “It can say that corruption is more important to Fidesz than the fight against quotas,” he said.'"}, "time": 1742562138.637057}