{"duration": 0.2035074234008789, "input_args": {"text": "'Carmela Tyrell November 1, 2016 Moving Your Computer Off Grid \\nMore than a few preppers feel that as long as they can provide food, shelter, water, and basic medical needs for themselves and their families, nothing more is required. Other preppers may feel that self defense, power generation, education, and machine repair are skills that will be required in the post crisis world. \\nSadly, many preppers and also off-gridders tend to ignore or underestimate the need to have a computer that can be used to help make it easier to survive. \\nIn all likelihood, these are also the people most likely to have serious problems in the post crisis world because they do not have a computer available to help meet a range of goals. \\nComputers and Prepping Can Get Along \\nA computer cannot hunt a deer for you, boil water, or make a pair of shoes, obviously. On the other hand, any computer with a connection to the internet can help you find out how to do these things and much more. When you find good information, it is also very easy to store those files on your computer so that you can read them and work with them whenever you want. \\nAnd if you are in a situation where internet access is still available, you can use your computer to contact friends and loved ones as well as people that might be able to help you get through a crisis. Then you can certainly relate to the quandary of many preppers that are finding out it is becoming impossible to make or obtain raw materials that would be needed in a major crisis scenario. \\nOn the other side of the equation, many of the items you need for basic prepping can still be purchased online. All you really need is a prepaid debit card and an internet connection so that you can find websites where you can place your orders. Not only will you be able to get the supplies you need, you will also have a much wider selection of other goods to choose from. \\nRegardless of whether you are interested in the best quality gun cleaning kits, need a certain type of fishing reel, or need good quality vintage hand tools, you can find them all online. In fact, even if you are disabled, you may be able to find customized materials and tools that have been modified to meet your needs. \\nMost people don’t realize just how important it is to network with preppers from diverse geographic regions and make plans for bugging out that include those friends and connections. Consider what would happen if an earthquake or hurricane strikes your area. \\nIf you only have friends and family in a local, or small area, chances are everyone will be affected. If you have friends in other states that might be able to offer temporary shelter or help you make a new start, then you will be well ahead of the game. \\nIn these times and beyond, both money and barter systems are vital for exchanging needed goods and services. A computer is very important for expanding your trade and marketing options. It is also very important for securing alternative currencies that may play a vital role in remaining solvent in the face of currency collapse. \\nMost people would be truly amazed at how easy it is for the average consumer to secure foreign currencies, keep a good supply of them, and even use them as down and dirty form of currency trading or flipping. \\nThe Tough Choice on the Best Device(s) \\nObsolete devices may still be very useful because certain older technologies are easier to work with and may be safer than newer devices that are routinely overclocked or are based on unstable hardware platforms. \\nIf you are interested in newer devices, here are some categories, brands, and models that you can start off with for each category of device: \\nDesktops \\nIf you are primarily interested in a conventional desktop computer, my own experience leads me to believe the best option is to build the computer yourself so that you know exactly what parts are being used and how best to optimize the BIOS (this is where you can determine how fast the computer will run, whether or not the system can boot from a USB drive, and other aspects of basic operation) settings. \\nSince modern computer chips tend to run hot, it is very important to provide plenty of ventilation and cooling options inside the case. If your CPU and motherboard kit come with sub-par heat conducting gel, do not hesitate to find the best on the market. It is also very useful to add extra fans and other cooling devices right inside the case. \\nAlways remember, the cooler you can keep the chips during operation, the lower your chances of erratic freeze-ups or even ruining the chips. \\nInsofar as other vital parts such as hard drives, CD/DVD drives, and video cards, it truly depends on your personal tastes. \\nYou will need a dedicated video card to gain access to these specialized chips that will reduce wear on the CPU and enhance computer performance at the same time. Be sure to study gamer forums and video editing forums to find out which video cards work best with specific CPU and motherboard combinations. A bad fit between these parts can truly be a disaster. \\nMemory cards (RAM) are yet another tricky, yet vital area of the computer that you will need to think about. This is also one area where only the best will do. It is better to go with the fastest cards that the motherboard will take, and also from the best rated vendor. \\nLaptops \\nUnlike desktop computers, you will have far less control over what parts are found inside the case. Before purchasing a laptop, be sure to find out the model number of the CPU and motherboard. From there, you will need to look up the chipsets to find out what the optimal clock speeds are. \\nI have seen more than one laptop burn up at around the 1 year mark because a sub-part mother board with a slower timing chip was paired with a faster CPU. Since most buyers do not ask about the motherboard model, there was no way for them to find out that they basically had an overclocked system that was going to fail very quickly. \\nOverall, I can safely say that I don’t recommend spending 3 – 4 times as much money on a laptop when I can choose a much cheaper tablet and optimize it with less intensive apps. The only advantage a laptop might have over an off grid tablet is that it is easier to customize the programs. \\nTablets \\nAn unlocked tablet will give you just about everything you need for basic document access and communicating with others. You can also choose apps that will enable you to create your own apps and carry out other more complex tasks. \\nTablets also have the advantage of taking far less power than a desktop or laptop computer. They can easily be recharged on a portable solar pack, and it is also fairly easy to bypass the battery. \\nInsofar as brand names, I tend to favor Lenovo, but have also found Alldaymall tablets to work well. The Alldaymall tablets are also a good bit cheaper, so you can purchase more of them and put them in your bug out bag as well as other locations. \\nSmart Phones \\nWhen it comes to a comfortable viewing experience combined with relatively low power usage, larger tablets will work much better than smart phones. That being said, in a “something is better than nothing” or a vital tool for your EDC, few things can rival a good quality unlocked smart phone. \\nWhile I recommend a 10” tablet for bug out gear, a 5” smart phone is truly more than enough for EDC. Not only a phone this size fit easily into a purse or backpack, it is even easier to power than a larger tablet. \\nThey also work well for reading a range of documents and will give you a good sized window for viewing videos. You can also hook up a folding keyboard and be able to carry out a number of tasks that would be difficult using the screen keyboard. \\nThe Challenge on Providing a Steady Source of Power \\nToday, the vast majority of computers have sub par power supplies that make them more susceptible than ever to fluctuations in power coming into the system. \\nAs our electric grid continues to crumble, rolling blackouts, brownouts, and line voltage fluctuations caused by excess usage during peak hours will shorten the life cycle of many computers. If you are generating your own power, it is just as important to make sure you know how to keep the current going into your computer as steady as possible. \\nThere are some things you can do now, as well as consider when building a power system that will help you get the most out of every computer that you own. CLICK HERE to subscribe to Survivopedia’s newsletter and get the free report on how to take your computer off grid. \\nUnderstanding the Impact of Utilization \\nNo discussion about preparing your computer hardware for off gridding would be complete without at least touching on the resource cost involved in each program that you run on the system. For example, if you have a simple word processor program with no fancy graphics, it will take up far less processor and memory resources than one that has funny critters dancing around all over the place. \\nApps that automatically play videos or programs that automatically play music also shorten the hardware life of your computer. Therefore, when it comes to choosing the best computer for your off grid or prepping needs, it is always important to study benchmark tests and hardware longevity tests under certain loads. \\nOnce again, you will find some of the best and most accurate information in the gaming forums. \\nImportant Parts to Keep On hand \\nFor each device in your EDC, bug out bag, or other location, there are some important parts that can help double or even triple the useful lifespan of your computer. Even if you lose some functionality, the main parts should still work for 2 – 3 decades on desktop units, and up to 10 years on laptops, tablets, and smart phones. Start off by buying all of your devices brand new and with the maximum warranty available. If something breaks down during the warranty period, let the manufacturer or repair center take care of the problem. Buy at least 3 to 5 non-functioning devices that are compatible with the make and model of each device. Usually, you can pick these units up for around 10 to 20% of the cost of a brand new device. You can choose different manufacturers as long as the parts are fully interchangeable with your device. You will use these devices to learn how to make repairs, and also for spare parts if something breaks down on your main device. Since RAM chips take the most abuse on any computer system, keep a few spare ones on hand. Have at least one extra power supply for desktop units. Unlike other parts of the system, you should never open up the case on the power supply unless you have a good bit of experience working with electronic devices. Never forget that the capacitors inside these power supplies may not be fully discharged, and that touching them or a live circuit can cause death or severe injury. Keep at least 2 USB hubs handy that also have the capacity to power any device you hook up to them. When connecting devices to the USB ports on your computer, try to never at least one pair of ports. \\nWhat Happens When the Battery Dies? \\nIf you have been thinking about using a smart phone or tablet as a place to store important survival information, you may hesitate because you know that the battery can easily be ruined by over charging , or that it will wear out sooner rather than later. \\nWhile some devices will continue to work while the battery is “charging”, others will not. If you have a device that will not work while charging, you will need to remove the battery and apply current directly to the device. \\nIn this scenario, you must know how to keep the voltage and amperage as stable as possible before they reach the device. You can make your own controllers for this purpose then hook them up to solar panels or anything else that you will be using as a power source. \\nJust remember that you power controller may also need to go safely from AC to DC current as well as match the voltage and amperage needs of the device. If you aren’t sure how much power to provide for laptops, tablets, or smart phones, just go by what the battery is rated for. Video first seen on PrepareForTheUnexpected . \\nBasic Toolkit \\nIt will not be of much use to have plenty of parts on hand, and then no way to install them or make good use of them. Here are the most essential tools you will need for building computers or making repairs: chip extractors for chips that are installed in sockets high heat conducting gel precision and larger size screwdriver kit magnifying glass low wattage solder iron, solder, and flux suitable for computer parts desoldering bulb'"}, "time": 1742562924.522717}