{"duration": 0.10538744926452637, "input_args": {"text": "'Posted on October 27, 2016 by Dr. Eowyn | 20 Comments \\nYesterday, I watched the first of 3 Netflix DVDs of the 2016 British TV series, The Hollow Crown: The Wars of the Roses — a BBC adaptation of William Shakespeare’s Henry VI and Richard III plays on a turbulent period (1455 and 1487) in English history of foreign and civil wars when two rival branches of the royal House of Plantagenet, those of Lancaster and York, fought for control of the throne of England, while England fought France in the Hundred Years War. \\nThe TV series boasts an impressive roster of actors, including Benedict Cumberbatch (he’s in DVDs #2 and #3), Hugh Bonneville (of Downton Abbey fame), Michael Gambon ( Harry Potter ‘s Professor Albus Dumbledore), and Judi Dench. \\nAbout a quarter or third into the Hollow Crown DVD, while on an English siege of France, the Duke of Somerset (a leader of the Lancaster “red rose” faction, portrayed by Shakespeare as one of the bad guys) came upon a “fair maiden” in a castle — Margaret, a daughter of the Duke of Anjou. Struck by Margaret’s beauty, Somerset proposed a scheme to Margaret — that she marry the young English King Henry VI, in exchange for the independence from English rule of the French regions of Anjou and Maine. England at the time had conquered and controlled various parts of northern France. \\nLong story short: Margaret the “fair” maiden of French Anjou would marry Henry VI and become Queen Margaret, who plotted and schemed with the Lancaster faction. \\nEven though the scene of the encounter of Somerset and Margaret was dimly lit and Margaret’s face was partly obscured by a hideous mop of long black hair, I could see what was wrong: Margaret was not a young maiden, but a middle-aged woman. History says Margaret of Anjou was 15 when she married King Henry VI, who was 23. ( Henry VI had become king when he was only 9 months old, upon the sudden death of his father, King Henry V.) Margaret was not fair or beautiful by any stretch of the imagination. Margaret was black, with stereotypical negroid features. \\n15-year-old Margaret of Anjou, France, was played by a 47-year-old actress — Sophie Okonedo , a British actress who was born in London of a Nigerian father and a Jewish mother. In an “exclusive” to the UK Express , May 6, 2016, Hollow Crown director Dominic Cooke explained the decision to cast Okonedo in “what is considered to be a traditionally white role,” saying that Okonedo was simply “the best person” for the part: \\n“Well, in the theatre we’ve been doing this for donkeys years. I think Sophie is the best person in this country to play that part, I really do. Her visceral power and range is so extraordinary – that’s what I was really looking for. It might be surprising for TV audiences to adjust to the idea that what they are watching is a myth, right. So it’s the best actor and I know from the theatre that that works and I’ve done it many, many times. I don’t think that you can do a piece of work that is about who we are as a society and just have white people doing it. I hope that she is so brilliant in the part that that will be the thing people talk about in the end. I feel we should always be making sure that we’re being open-minded, when making drama, about the casting possibilities. I think the sense of impatience there is in culture about all these issues is actually very healthy. You want the world you’re showing on screen to reflect the world you’re in and we live in a plural world, so our stories have to include the widest possible range of people.” The reporter for the Express article writes: Sophie’s casting comes at a time when the lack of ethnic minorities within the British film and television industry is being called into question. Recall that in the lead up to the 2016 Academy (Oscar) Awards, blacks in Hollywood complained that no blacks were nominated for an acting award. \\nJust you wait. \\nAny day now, there’ll be a Hollyweird movie with a black actress playing Jacqueline Kennedy. And if you point out that Jackie was not black, but white, you’ll be called . . . . \\nYou guessed it.'"}, "time": 1742562561.8070912}