{"duration": 0.0601809024810791, "input_args": {"text": "'One Twitter user once asked me, “Is it too much to hope that *one* of our parties would pick someone with no links to a pedophile sex-slave island?” \\nApparently, it is too much to ask for. \\nBoth presumptive Republican presidential nominee Donald Trump and former President Bill Clinton have ties to convicted pedophile and Democratic donor, billionaire Jeffery Epstein and “Sex Slave Island.” \\nNote: President Bill Clinton is not merely the husband of Democratic presidential candidate Hillary Clinton, either. Bill is currently campaigning for his wife, plus Hillary recently unveiled that Bill with be in charge of “ revitalizing the economy ” if she were to take office. \\nIt has been uncovered that Clinton, known for his trouble-making libido, has even stronger ties to Epstein than previously reported. As noted by The Free Beacon , “Clinton was aboard the infamous Lolita Express owned by a billionaire pedophile at least 26 times,” not the initially reported 11 times. \\nFox News reports : \\nClinton’s presence aboard Jeffrey Epstein’s Boeing 727 on 11 occasions has been reported, but flight logs show the number is more than double that, and trips between 2001 and 2003 included extended junkets around the world with Epstein and fellow passengers identified on manifests by their initials or first names, including “Tatiana.” The tricked-out jet earned its Nabakov-inspired nickname because it was reportedly outfitted with a bed where passengers had group sex with young girls…Official flight logs filed with the Federal Aviation Administration show Clinton traveled on some of the trips with as many as 10 U.S. Secret Service agents. However, on a five-leg Asia trip between May 22 and May 25, 2002, not a single Secret Service agent is listed. \\nThe Republican presumptive nominee apparently got in on the action, too. Trump’s ties to Epstein — a man Trump once called a “terrific guy” — and Sex Slave Island have been chronicled by The Daily Wire here . \\nPer The Political Insider, Trump is accused of threatening and raping a 13-year-old girl on the private island . Epstein is also named in the suit for sexual misconduct. The lawsuit accusations have been vehemently denied by the Trump camp, alleging that the filing is a “hoax” and that there is “no evidence” that the plaintiff in question “actually exists.” \\nSex Slave Island, sometimes referred to as “Orgy Island,” (both lovely names), is one deranged place, allegedly rife with solicited sex, often from minors “ groomed ” by Epstein. \\n“Terrific guy” Epstein, of course, was convicted for soliciting sex from a minor in 2008; the billionaire served 13 months in prison. \\nElection 2016: Where both candidates have ties to a convicted pedophile, the Lolita Express and Sex Slave Island.'"}, "time": 1742563145.114004}