{"duration": 0.03580737113952637, "input_args": {"text": "'Conspiracy theories about Western plots to undermine Turkey run so deep in the nation’s collective psyche that only the language of psychology is suitable to understanding them. The phenomenon is known as the Sèvres Syndrome, harking back nearly 100 years to a treaty that was never carried out but that would have divided Anatolia, the Asian landmass that makes up the bulk of modern Turkey. The syndrome is named for the French city where Western powers, at the conclusion of World War I, signed a treaty that brought about the collapse of the Ottoman Empire. Analysts have used the terms “phobia,” “trauma” and “syndrome” to describe the country’s   as if Turkey were a patient on a psychologist’s couch. Ever since Sèvres, they have said, Turkey as a nation has been suffering from   stress disorder. One way the syndrome is believed to have manifested itself is in Turkey’s denial of the Armenian genocide. More recently, Turks have blamed the United States and Western allies for huge street protests, a corruption scandal and this summer’s  failed military coup. The Turkish government has accused followers of Fethullah Gulen, a Muslim cleric in   exile in Pennsylvania, of plotting the coup. But rather than talking about how President Recep Tayyip Erdogan had allowed Mr. Gulen’s supporters to gain a foothold in the nation’s military, the Turkish public has been consumed with blaming the United States. “They say, well, it was the Americans who worked with Gulen to get in these positions,” said Fatma Muge Gocek, a   sociologist at the University of Michigan. “Why? Because they are out to get us. ” She added: “When you are constantly blaming others for what happens to you, you can never, therefore, heal. ” Dietrich Jung, a professor of Middle East studies at the University of Southern Denmark, said the actions of Europeans sometimes underscored suspicion about the Turks. He pointed to a recent debate in Denmark about whether that country’s royal family should meet with Mr. Erdogan during a visit to Turkey, given concerns about the Turkish leader’s growing authoritarianism. “They visited Saudi Arabia,” Mr. Jung said. “They visited China. Nobody talked about authoritarian politics. Why Erdogan?” Why indeed, many Turks would say, suspiciously.'"}, "time": 1742561889.8674412}