{"duration": 0.1406846046447754, "input_args": {"text": "'CINCINNATI  —   He boasted about himself in the third person. He sneered at the opponents he had vanquished. He disparaged journalists and invited angry chants from the crowd, grinning broadly at calls of “lock her up” and “build the wall. ” He ridiculed the government’s leaders as stupid and dishonest failures. In his first major address since winning the presidency three weeks ago, Donald J. Trump soaked up the adulation of thousands of his supporters at a   rally here, unabashedly gloating about the “great” victory he had secured. If there were any question about whether his evolution to    would temper his presentation or moderate his tone, the rally offered a forceful answer: Not a chance. Kicking off what was billed as a “thank you” tour, Mr. Trump was incendiary and prideful, hopeful and indicting, vengeful and determined. His staff said the rally was the first of several he will hold before his inauguration next month. His tour is an unusual move for a   most of whom do not return so quickly to the campaign trail, especially while key cabinet positions remain unfilled. Mr. Trump, who has been mostly cloistered in Trump Tower as he tries to assemble a government, was said to be eager to reconnect with voters. Connect he did, whipping the partially filled arena into a frenzy by reprising the   rhetoric from his    campaign. He repeated pledges to suspend immigration from countries with a history of terrorism, repeal the Affordable Care Act, lower taxes, end unfair trade and “drain the swamp” of corruption. But while he at times stuck to the script on his teleprompter, Mr. Trump came alive when he veered from it to talk about himself and demean those who had opposed him. “We had a lot of fun fighting Hillary Clinton,” he said, smiling knowingly as the crowd chanted “Lock her up!” but offering no indication that he intended to do so. In the middle of a scripted part of the speech about lower taxes for businesses, he shifted abruptly to note the magnitude of his wins. “How about North Carolina  —   how well did we do in North Carolina? Remember when they said he cannot win North Carolina?” Mr. Trump said, adding a moment later: “Donald Trump can’t break the blue wall, right? We didn’t break it, we shattered that sucker. We shattered it, man. That poor wall is busted up. ” And he reserved special bile for the “extremely dishonest press,” provoking boos as he lashed out  —   without naming her  —   at a network anchor who he said had cried on television on election night when she realized he was going to win the presidency. “You know what she doesn’t understand, things are going to be much better now,” he said. “I love this stuff,” he said after a nearly   discussion of his electoral prowess and his critique of the news media. “Should I go on with this for just a little bit longer? I love it. ” He did go on, shifting back and forth between his prepared remarks and his extemporaneous walk down the memory lane of victory. During the prepared parts of the speech, Mr. Trump seemed eager to reach out to the people who had opposed his candidacy. He said the new government would “seek a truly inclusive society,” and he proclaimed that “we condemn bigotry and hatred in all of its forms. ” On the economy, he vowed to “reverse the stagnation and usher in a period of prosperity and growth,” even as he promised to overcome the partisan gridlock that has led to stalemate in Congress during much of the past eight years. “We’ll compete in the world, we want to compete in the world, but we’re going to compete in the world where it’s a   road, not a   road,” Mr. Trump vowed. “The advantages are going to come back to our country, and they haven’t for many, many years. ” Speaking in Ohio just days after a Somali refugee wounded several people with a knife at Ohio State University, Mr. Trump essentially attributed the attack to programs to admit refugees “stupidly created by our very stupid politicians. ” “We will suspend immigration from regions where it cannot be safely processed,” he said, echoing some of his most effective campaign rhetoric. But he sometimes veered from his prepared remarks in the middle of a sentence. A discussion of what his administration would do if a company wanted to move jobs overseas reminded him again of his victories. And that discussion of winning several states led directly into a diatribe against reporters, who he said had never seen his victories coming. Then, when he mentioned Utah, he railed against a   candidate who before Election Day had seemed poised to do well. “Remember when they said Donald Trump is going to lose to some guy I’ve never even heard of?” he said, laughing. “The people of Utah were amazing, and we trounced them. Hillary came in second, and that guy came in third. What the hell was he trying to prove?” Mr. Trump offered both an olive branch and a warning to Democrats in Washington, saying he believed that “they want to get together” but reminded them that they had lost “because the people are angry. ” He delivered his promise through the prism of a   federal government. “Our victory was so great, we have the House, we have the Senate,” Mr. Trump said, his last words drowned out with cheers. He smiled and paused, before offering some tepid reassurance that “we want to get them on board. ” Mr. Trump opened his rally with a familiar trope: gawking at the crowd and lamenting the difficulty that supporters were having traveling to the arena. “So I didn’t know what came with this position, and I didn’t know that they closed down the roads around the stadium for an hour and a half,” he said, thanking the crowd “for being so patient. ” Before he spoke, a familiar scene developed at the arena, with hundreds of Mr. Trump’s supporters lined up, some clad in red shirts handing out “ ” signs. The prerally soundtrack, heavy on Elton John and the Rolling Stones, rotated through the songs heard during the campaign. The main difference this time: the lectern at center stage, which now had a big, bold “USA” where the name “TRUMP” used to be. As   Mr. Trump has at times seemed frustrated by criticism of his business conflicts and his loss by more than two million ballots in the popular vote. But at the rally, Mr. Trump was once again in good spirits, feeding off the fervor in the crowd. He had just come from Indianapolis, where he celebrated his involvement in Carrier’s decision to keep roughly 1, 000 jobs in Indiana. Mr. Trump seemed to relish toying with the news media, at one point announcing that he had chosen James N. Mattis, a retired Marine Corps general, to be his secretary of defense  —   even though his spokesman had said four hours earlier that no decision had been made. “I gave up a little secret,” Mr. Trump said, urging the crowd not to “let it out of this room. ” But nothing seemed to fire up the   as much as recalling his victories in the campaign, each made so much sweeter, he repeatedly said, because the media and his opponents had never seen them coming. “We had a lot of fun,” he said, adding: “The bottom line is, we won. ”'"}, "time": 1742564110.9857998}