{"duration": 0.05305194854736328, "input_args": {"text": "\"Share on Twitter \\nJoanne Liberato had noticed a few unusual things about her son Eddie. He seemed to bruise more easily than his older brother, and his cuts took too long to heal. However, nothing seemed worthy of panic until the day when a minor fall turned into a major injury. \\nIf Joanne hadn't followed her instincts, her toddler might have died. Image Credit: Flickr CC/ Damien Ayers \\nAccording to Kidspot , it was eighteen-month-old Eddie's penchant for copying his older brother that led to the accident. Although neither boy was allowed to play on the couch, three-year-old Joel often did so anyway. \\nWhen Eddie climbed up there himself, his mom called out for him to stop and ran to grab him. Unfortunately, she was too late to catch his fall. She tells Kidspot: \\n“It was a heart-stopping moment, but then he started crying a second later and I thought he must be okay, people always say if they cry it means they’re okay.” \\nTo Joanne's relief, Eddie didn't seem to have any injuries. However, his cries and the slight swelling she noticed on his head made her uneasy, so the worried mom followed her intuition and took her son to the hospital. Loading Facebook Post... \\nAt first, it seemed as though she had overreacted. After being under observation for four hours, Eddie seemed fine and his mother was ready to take him home. But when the toddler began vomiting, a doctor ordered a CAT scan. Suddenly, Joanne was extremely grateful they hadn't left the hospital earlier. She tells Kidspot: \\n“They said he had bleeding on the brain and he had to be flown to Lady Cilento Hosptial in Brisbane for emergency surgery. All I could think was, 'what if I had gone home?' I could have lost him.” \\nAfter Eddie's emergency surgery, doctors were disturbed to see that excessive bleeding was preventing his wound from healing properly. That's when Joanne told the doctors about her son's tendency to bruise and have cuts that bled for too long. \\nThe mom's recollection spurred new tests that revealed Eddie had hemophilia, a rare disorder that prevents blood from clotting. The discovery saved his life : \\n“If they didn't stop the bleeding he would have passed away.” \\nUnfortunately, that was only the beginning of the complications the courageous boy would face. Two successive infections required an operation to remove a portion of infected skull. This was followed by multiple blood transfusions and forty stitches in his head. \\nNow, Eddie has to wait several months for surgery that will put a plate on his skull to protect his brain. In the meantime, a GoFundMe page has been set up to help the family with his medical costs. Loading Facebook Post... \\nEddie must wear a helmet to protect his fragile head and avoid rough play. His mother tells the Sunshine Coast Daily that keeping the active toddler safe can be stressful: \\n“It's very hard for him, he just wants to run around with his brother and have fun. I'm living on tenterhooks watching over him.” \\nStill, after everything her son has been through, Joanne says it's amazing how well Eddie has coped with his injuries. She tells Kidspot: \\n“He’s just an absolute trooper, I’m really proud of how he’s handled everything.” \""}, "time": 1742562084.4450312}