{"duration": 0.08244132995605469, "input_args": {"text": "'“The best people. ” This refrain rang throughout Donald Trump’s presidential campaign at times, it seemed to be his justification for being in the race at all. He wasn’t a politician  —   he was a businessman. He had never run a government, but he ran a company, and running a company is, at bottom, easy: You get the best people. The pitch worked, and Trump will be sworn in as the 45th president of the United States of America. In the meantime, he has been stocking his cabinet with what he promises are the best people. Even without thinking too hard about what “best” means  —   best for whom? to do what?  —   it’s still instructive to see who made the cut. The two people who will be perched on Trump’s shoulders, his chief of staff Reince Priebus and his chief strategist Steve Bannon, are white men. The top layer of his cabinet  —   the attorney general, as well as the secretaries of state, Treasury and defense  —   is made up of white men. In fact, if you print out a chart with the faces of Trump’s picks on it, the first thing you’re likely to notice about it is that his cabinet consists almost entirely of white men. And the second thing you’re likely to notice is Dr. Ben Carson. His is a conspicuous face. It’s black, for one, which makes it, in this cabinet, unique. It’s also famous: Carson is one of the   medical doctors of our time and mounted a presidential run of his own. But Carson’s face seems to be in the wrong place. The retired neurosurgeon won’t be running, say, Health and Human Services he’ll manage the Department of Housing and Urban Development. His inclusion is conspicuous for another reason too: Shortly after the election, Carson’s friend and adviser Armstrong Williams said that Carson wouldn’t take a cabinet position, because he had no governing experience. “The last thing he would want to do,” Williams said, “was take a position that could cripple the presidency. ” It seems very unlikely that a retired neurosurgeon with no governing experience is one of “the best people” to handle city planning and housing policies. So why is he there? Carson certainly looks like what people might call a token: Someone admitted into a space dominated by one group mostly to feign inclusivity toward others. It feels unkind to actually call him that: It’s rude, messy and dismissive of Carson’s agency and ability. Still, this administration stands to be mighty white and male, and its few women and people of color, tend to appear in roles that feel like afterthoughts or stereotypes. It’s almost funny in its clumsiness. Nikki Haley, who has virtually no   experience but is the child of Indian immigrants, will be ambassador to the United Nations. A black man will oversee housing projects. As of late December, Politico was reporting that Trump’s staff was “scrambling” to find a Hispanic candidate to head the Department of Agriculture. These appointees may be as accomplished and well qualified as anyone else in Trump’s cabinet. But the stagecraft and typecasting of their appointments are definitely what you might call tokenism, writ large and on full, public display. In 1961, President John F. Kennedy signed Executive Order 10925, which expanded on President Franklin D. Roosevelt’s order, signed 20 years earlier, which banned racial discrimination in the federal government and defense industries. Kennedy ordered that government contractors “take affirmative action to ensure that applicants are employed, and that employees are treated during employment, without regard to their race, creed, color or national origin. ” Three years later, the Civil Rights Act of 1964 extended that action to women. The Civil Rights Act of 1968 banned housing discrimination. By the decade’s end there was, at least in theory, a commitment to include everyone in American life  —   an admission that per federal law, if only per federal law, women and brown people were full citizens. One response was violence. Where violence was ineffective or unacceptable, other forms of resistance had to suffice. Schools integrated spasmodically, often kicking and screaming in court. Workplaces often didn’t. Many white homeowners and landlords refused to sell or rent to families of color. In 1973 in New York, President Richard Nixon’s Department of Justice sued Donald Trump and his father for refusing to rent to black people. That the Trumps objected and denied this reflected not just their legal situation but a growing social consensus that things like naked racism and sexism were untoward  —   things few people wanted to be accused of or forced to defend. But institutions throughout the nation also found it difficult to stop doing them. This is the world that brought us modern American tokenism, both as a word and as a practice. People concluded that it was easier to fake inclusion than truly include women and people of color. The easiest course was to find one person who could serve as a   to appear in a classroom or a workplace to signal that everyone was getting a fair shot  —   not only when that was untrue, but because it was untrue and needed hiding. Tokenism is, above all, a form of misdirection. It’s the smiling Muslim kid on the school brochure, the black editorial assistant in the   newsroom, the telegenic woman serving as a campaign spokeswoman. By the   television and film had mastered this, too, dutifully checking off boxes with actors of color whose purpose was mainly to be seen. These were minor, disposable mascots who played to stereotypes, provided shallow comic relief or merely died first to show that others were in danger  —   the obnoxious gay best friend, the asexual Asian bookworm, the West Indian nanny. This type of character became such an established trope that the adult cartoon “South Park” featured an   child actually named Token. At tokenism’s cheapest and laziest, a mascot isn’t even necessary. People counter accusations of racism by pointing to their close but unidentified black friends. One October Trump rally featured a prominent “Blacks for Trump” sign that was held up by an elderly white woman. In politics, complaints about tokenism come from both sides. Those on the left accuse the right of using   tokens to create the false impression of a diverse, dynamic movement that both values and is supported by women and people of color. Those on the right accuse the left of valuing diversity over quality, ticking off racial boxes instead of insisting on merit. The defining difference between these analyses is obvious. In one, the suggestion is that people other than white men are qualified to do important jobs and too seldom get the chance in the other, the suggestion is that they often lack merit but are rewarded anyway. Last month on the Fox News program “Hannity,” the Trump adviser Newt Gingrich hailed what he saw as Trump’s dedication to the quality of cabinet appointments over arbitrary diversity. “This is what leads him to Jim Mattis,” Gingrich said. “This is what leads him to Rick Perry. I mean, he’s going to look for the best to come in. It’s a piece of what Trumpism is, as opposed to liberalism, which would look for the right token, surrogate, even if they were incompetent. ” But just one week later, Gingrich changed his tune. “There has to be more Hispanics in the administration,” he told Politico, which later reported that Trump’s search to fill that Department of Agriculture slot was extending even to people who were “  and have no experience in agriculture. ” Many white kids grow up learning that they can be anything: an astronaut, an inventor, the president. Many minorities of a certain age and place, kids who grew up before the possibility of a black president, were bused up Route 295 to Johns Hopkins University in Baltimore on   field trips, treated to speeches by a renowned neurosurgeon and taught that if they went to class, kept their heads in books and got good grades, they, too, could one day be like Ben Carson. I was one of those kids. This winter, while home for the holidays, I searched for his autobiography “Gifted Hands,” and found it resting on a shelf in my childhood bedroom “The Big Picture,” another of his books, was propped next to it, with my little brother’s name scrawled inside. A unique sort of sadness stirs within me when I watch Carson now. He is, in many ways, the best of us. Yet in the end, he’s just a tool for someone else. I recognize myself in him. My scholastic, athletic and professional careers have always taken me through   spaces in which I’m often alone and often the first. I’ve been called a token more times than I can count I’ve been one more times than I cared to. A token is always chosen, and there is a steady, throbbing angst that comes with being chosen over and over again, always knowing that, on some level, my abilities may be ancillary to my appearance. How do you know when you’re being used as an excuse? How can you tell the difference between a new employer who is making earnest steps toward diversity and one who is just trying to cover himself? What about the times when you know it’s the latter but want the spot, or need it, or tell yourself that being successful in it will crack the door wider for the next person? How do you prove that you belong? Can you?'"}, "time": 1742628557.8216836}