{"duration": 0.2154078483581543, "input_args": {"text": "\"Email \\nAccording to the reports, it appears the Muslims who accused him had no proof- they did this just for spite. They hate Christians and wanted to see a Christian die. \\nThe boy was eventually released, but not after pressure from international Christians aid groups. No Koran copy was ever found. The boy and his family are now in hiding, since Muslims are threatening to murder them if they find them: \\nInzam was at school when he was accused of having burnt a Koran on 20th October 2016, his mother Shakil who works as a Nurse at Civil Hospital, in Quetta was arrested with him on 21st October after registration of First Information Report (FIR) 167. \\nThe arrests were made without investigation on the testimony of a Muslim witness and was totally in accordance with the draconian blasphemy laws of Pakistan. A Muslim witness is given higher authority then non-Muslim testimonies under sharia law, these are Islamic laws that determine Pakistani law. \\nNews of the arrests created huge community tension, however prompt police action prevented threats to the Christian community and the formation of a mob from becoming a full scale attack on an innocent Christian community. \\nOver the next four days local politicians and the BPCA have been clamouring for justice for the innocent mother and child. Four days by a miracle the two victims were released from Civil Lines Police station in Quetta on 25th October. The mother and child have expressed in no uncertain terms that they had been interrogated and suffered torture during their 4 day detainment. However despite their treatment they both did not confess to the crime of blasphemy. \\nMoreover, Police have confirmed that no evidence of any alleged Koran desecration was found. ( source ) \\n… \\nNasir Saeed, director of the Centre for Legal Aid, Assistance and Settlement, said in a statement that bringing blasphemy charges against a 9-year-old child shows just how the blasphemy laws are being used to promote hatred toward Christians. \\n“He may have never have even heard the word of blasphemy,” Saeed said, referring to Izhan. “Unfortunately, this is the worst example of hatred and intolerance against Christians and treatment toward them in Pakistan.” \\n“The government of Pakistan must look into such cases and take appropriate steps to bring necessary changes to stop the ongoing misuse of this law,” he added. “The international community has continuously expressed its concern and called for amendments.” ( source ) \\nViolence against Christians in the Muslim world is rampant. Nobody is safe from accusations, torture, and death for no reason other than being a Christian, not even a small child. Daily life is for many Christians in places like Pakistan like living under the reign of Diocletian during the 4th century, who had Christians arrested and tortured just for fun, no differently than what happens in the Muslim world today. \\nThe West is not without its problems, and certainly there is a tremendous one today with Islam. However, there are many places in this world where Christians have literally no money, no place to go, and no help from anybody except Christ alone absolutely. Never forget them- for they are truly the Church suffering. \\nArticle posted with permission from Shoebat.com . Article by Andrew Bieszad. Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . shares\""}, "time": 1742562660.7405832}