{"duration": 0.07199859619140625, "input_args": {"text": "'in: War Propaganda , World News (image credit: AP) The battle for Mosul is more about redeploying thousands of US-supported ISIS fighters to Syria, along with perhaps letting Turkish forces move in to control evacuated areas. Erdogan long coveted Mosul. He may think now’s his chance to seize the city and its lucrative oil reserves, claiming it’s a buffer zone against Kurdish fighters, similar to his northern Syria occupation. According to Syrian parliamentarian Hohammad Kheir Akam, “(t)he US has opened a southern side of Mosul (corridor) to the terrorists to” let thousands of its fighters enter Syria. US-led coalition warplanes easily spot their convoys. Yet they’re allowed to move freely – America supporting terrorists it claims to oppose. Iraqi Ansarullah al-Nujaba Movement spokesman Hashem al-Moussavi said “Washington is still continuing its military support for the terrorists in” his country, airdropping them weapons and other supplies. “Our forces have filmed US aircraft while dropping military aids for” ISIS terrorist fighters, he said. Iraq’s Hassan Abdel Hadi said government forces are concerned about US aerial attacks, impeding their advance to ISIS-controlled areas. “Unfortunately, there are still some people in Iraq who have been deceived by the US-led coalition, while Washington supports ISIL and is trying to compensate for the damage done” to their fighters by government forces, he explained. Last Friday, Russia’s Defense Ministry spokesman General Igor Konashenkov said US-led coalition warplanes struck a funeral procession. “Dozens of Iraqi civilians died, including women and children,” he explained. “Russian reconnaissance pinpointed two jets conducting airstrikes on Daquq, located 30 kilometers to the south of Kirkuk, where, according to our data, there are no ISIS fighters,” – a willful war crime. They’re “almost a daily routine for the (US-led) international coalition. Too often weddings, funerals, hospitals, police stations, and humanitarian convoys are being hit by the coalition warplanes.” Russian General Sergey Rudskoy said “(w)e are closely monitoring the situation around Mosul. So far we see no substantial progress in liberating this city from…ISIS” since operations began on October 16 – because no effort is made to do it. Last week, a coalition airstrike targeted a mosque south of Kirkuk, killing over a dozen women and children. A southern Mosul girl’s school was struck. US-led coalition warplanes were operating in the area, clearly responsible for what happened. On October 25, Russia’s Defense Ministry reported over 60 civilians killed, over 200 others injured on airstrikes on residential areas in Mosul – locations where no ISIS fighters were present. So far, no fighting inside Mosul was reported. By the time, so-called liberating forces enter the city, ISIS fighters will be gone – redeployed to Syria to combat government troops and civilians. Moscow letting this happen without resistance so far makes the battle to liberate Syria harder. Is an offensive planned to rectify this blunder, compounded by failing to launch airstrikes against al-Nusra terrorists in eastern Aleppo since October 18? According to General Rudskoy, Russian Aerospace forces are monitoring the situation in the area of the Syrian-Iraqi border day and night with the help of unmanned aerial vehicles and other reconnaissance means.” “Russian planes are on patrol missions in the airspace and are ready to immediately deliver strikes against terrorists.” Aerial operations “in a 10-km zone around Aleppo” remain suspended. “The moratorium…will be extended.” The longer Russia delays full-scale aerial operations against US-supported terrorists infesting eastern Aleppo, the harder the struggle ahead to liberate the city and all key parts of Syria. Submit your review'"}, "time": 1742564075.1707587}