{"duration": 0.40956759452819824, "input_args": {"text": "\"'The Others' Alliances , Balkans , Hybrid Wars By Andrew KORYBKO (USA) We are publishing the exclusive English source of the interview given by the American political analyst Andrew Korybko to the Macedonian NetPress agency. He speaks about the forthcoming early parliamentary elections to be held in Macedonia on 11 December 2016 which are likely to be won by the ruling VMRO party of Nikola Gruevski, the effective defeat and demoralization of the globalist agents in the Balkans, and geoeconomic implications of the new political landscape in the region: \\nLess than one month before the early parliamentary elections in Macedonia, the polls indicate a clear victory for the ruling party of VMRO-DPMNE lead by Nikola Gruevski. This on the other hand represents a mayor failure for the Western elements and their NGO/media machinery that in the past 2 years have been trying to overthrow the democratically elected Macedonian government together with the opposition lead by SDSMs Zoran Zaev, using methods such as Color Revolutions, public broadcasting of illegally wiretapped conversations, violent opposition protests, terrorist attacks, the formation of the so-called “special” prosecution, fabricating false scandals with alleged phantom voters and fake IDs, etc. What can we expect to be happening in Macedonia ahead of after the 11 December elections? \\nIt’s clear that VMRO will be handed a resounding victory by the people, but voters still need to go to the polls in order to make this the largest success that it can be and give Gruevski the unquestionable mandate that he will need to govern the post-crisis country. All surveys indicate that this will be the case, but people mustn’t become apathetic and assume that it’ll be a landslide just because everyone else is supposedly going to vote and instead choose to stay home. Everyone needs to go to the polls and make this election the crowning achievement of the patriotic counter-Color Revolution movement. If VMRO can clinch an overwhelming majority of the votes, then the rest of the world will see once and for all that the people have spoken and democratically expressed both their support for the legitimate government and their rejection of the Western-orchestrated Color Revolution. Nikola Gruevski \\nIn the run-up to the vote, there were clear signs that efforts were made by SDSM to unite the opposition into a solid bloc, but this failed because nobody really trusts Zaev. If a man will betray the entire country by becoming the figurehead of a Western regime change operation, then he’ll surely sell out any of his “political allies” if given the opportune chance to do so. Most patriotic opposition members recognize this and thus don’t want to contaminate their political brand, which is why the effort has thus far been a failure. Similarly, Zaev’s shameless pandering to Albanian voters has also been a dud. The demographic is aware that they’re being exploited, and while some admittedly find it flattering, many of them don’t want to be part of his international political games and know that the doesn’t truly have their best interests at heart. \\nBy and large, there’s no reason to second guess that VMRO and Gruevski are headed for an historic win in this election. Should this come to pass as expected, then Macedonians can look forward to a new era of stability and prosperity, with their country working equally with the West and East (Russia, China, BRICS) in order to maximize its geostrategic position as the prime infrastructural gateway to Europe. Russia is moving ahead with the Balkan Stream gas pipeline while China is making progress on the Balkan Silk Road high-speed rail system which will eventually link Budapest to Piraeus. Western investment, while having likely been impacted to an extent by the manufactured political crisis, hasn’t fled the country like it ordinarily would have in many other cases. Businessmen understand that Macedonia is growing and is an attractive place to set up shop because of its irreplaceable mainland location at the civilizational crossroads of Afro-Eurasia. \\nAll of this is indeed possible so long as the US pulls back from its recent history of destabilizing the Republic of Macedonia. Washington and its conspirators have already been beaten back twice – something which no other country has managed to do – and are slated for at third defeat during the December elections. The US’ behavior during this time will be contingent on how it’s “deep state” (the permanent military, intelligence, and diplomatic bureaucracies) decides to response. The US is undergoing the most transformational phased regime change event that it has ever experienced in history with Obama’s government giving way to President-elect Trump’s, so it remains to be seen if the “deep state’s” subjectively determined cost-benefit calculation will continue to lean in favor of asymmetrical destabilization. \\nA reasonably confident argument can be made that won’t. Commencing yet another wave of failed Color Revolutions would be a waste of time, money, and resources if Trump simply decides to stop it once he enters office. On the other hand, Obama and his neoconservative “deep state” backers might be conspiratorially vengeful enough that they’d want to sabotage Trump’s incoming presidency by forcing him to inherit a legacy of conflict. Even if that’s the case, however, it doesn’t seem likely that this would succeed, since it’s obvious to all observers that the Macedonian people have repeatedly proven that all foreign-concocted plots against their statehood are determined to fail. Because of this, the US probably won’t opt to continue with this failed plan any longer, and will attempt to ‘save face’ by recognizing VMRO and Gruevski’s imminent victory, hoping that this can allow them to earn back some of the goodwill that they needlessly squandered over the years. \\nSeen from this perspective, one can definitely conclude that the western sponsored wing together with their patrons, failed in Macedonia big time. What are the main factors that according to you helped Macedonia deal with these foreign sponsored crises, which can be used as an example for other countries that are or will be fighting these kinds of Western sponsored crises? \\nMacedonians were able to withstand and repel the US’ Hybrid War pressure because they came to master the art of what I call the Resistance Circle, which is a counter-Color Revolution innovation which must absolutely be applied to all countries that are experiencing this form of aggression. Here’s an illustration of this concept, and then I’ll explain what each part of it means in practice: Media: \\nMacedonians were already an educated and aware even before the Hybrid War started, and this can be attributed to the prevalence of patriotic media outlets in the country, both mainstream and alternative. They kept the public informed of the US’ various regime change machinations across the world before Washington inevitably came to victimizing their homeland. Once the destabilization began, the media kept the people up to date on what was really going on and the larger forward-looking reasons behind it, which had the effect of heightening the already strong sense of patriotism that most Macedonians feel. Patriotism: \\nMacedonian patriots formed the core of the counter-Color Revolution movement. They were inspired by the media and what they saw happening all around them and conveyed the extent of the regime change plot to the rest of their fellow citizens. They knew that this wasn’t just an operation targeting Gruevski personally, but a far-reaching scheme that affects all Macedonians through its goals of changing the constitutional name, “federalizing” (internally partitioning) the country, and thus advancing a dangerous and treasonous scenario which could result in the dismantlement of Macedonia’s hard-fought statehood. Organizing: \\nThe patriots utilized reverse-Color Revolution technology by applying some “traditional” models of large-scale crowd organizing through their skillful employment of social media and allied NGOS. This produced attention-grabbing demonstrations in support of the government and culminated most spectacularly in the May 2015 demonstrations that decisively dealt a death blow to the first failed Color Revolution. The external manifestation of the Macedonian people’s patriotism and their backing of the democratically elected and legitimate government sent a powerful normative message all across the world, especially since it came on the heels of Zaev’s comparably much smaller rally. International Networking: \\nMacedonia’s patriots networked with foreign friends and journalists to spread the truth about the regime change operation underway in their country, particularly relying on the influential power of Russian mass media, experts, and think tanks to champion their resistance. \\nThis propelled heavy alternative media coverage of the events and put pressure on the plotters by exposing their links with the US and Soros, thus discrediting the false narrative that this was an ‘indigenous democratic uprising’ and revealing it as the Western Color Revolution that it always was. \\nAt this point, the multipolar media coverage, analysis, and investigations into the unrest were channeled back into Macedonia’s patriotic mainstream and alternative media outlets for domestic consumption, which fuelled the patriotism and encouraged even more counter-Color Revolution demonstrations and related activity. \\nIt’s quite interesting to see the shock of the fifth column in Macedonia after Donald Trump won the USA elections, which was quite similar to their reaction to the Brexit as well. Why is there such despair among the Western mercenaries in Macedonia and what does Trump’s victory mean for the Western-sponsored crises and Color revolutions elsewhere? \\nThe reason why they’re so upset is because they realize that Trump’s election will likely herald in a sea change of American policy in some (operative word) vectors, notably how it relates to Soros and Color Revolutions . Trump’s campaign team and alternative media surrogates such as Breitbart made a point of emphasizing the disruptive role that Soros has been playing in the US, such as shedding light on his support for pro-Clinton Super PACs, funding the urban extremist group known as “Black Lives Matter”, and even indirectly being connected to some electronic voting machine companies. In fact, one of the least-discussed but most important aspects of Trump’s election is how it affects Soros and his worldwide network now that the billionaire Color Revolution financier’s chief foe will be in the Oval Office. Trump and his base are antipathetic to Soros in all ways, even more so nowadays because of the shadowy figure’s role in organizing the nationwide riots against the President-elect. To put it bluntly, Soros has declared war on Trump, and the incoming President is expected to push back in all ways in order to safeguard his Presidency. \\nThere’s a lot that can be written about the dynamics of this struggle and the widespread influence that Soros commands among The Establishment and its “academia’, pop culture, media, and social elites, but explaining all of that would require a lot more time and a broader scope than is presently available. How all of this relates to the Balkans, and specifically to Macedonia, is rather simple, in fact. Soros, preoccupied with tackling Trump, will probably direct a lot less time and energy towards his traditional stomping grounds, especially considering that he’s already failed two times in trying to topple the Macedonian government. Furthermore, Soros won’t have the incoming Trump Administration’s foreign policy and covert support to back him up. Remember, Trump disdains Soros, and the feeling is mutual. They’re not going to cooperate on any major schemes together, or at least not right away, but here’s where the possible scenarios get rather interesting. Trump and Soros want to destroy one another, but it’s possible that they could reach a ‘ceasefire’ arrangement between themselves in putting their mutual differences aside and focusing on areas of ‘shared interest’. \\nWhat this means in practice is that the neoconservative elements of the American “deep state” (the permanent military, intelligence, and diplomatic bureaucracies) might be able to influence Trump and his team to the point where they come to appreciate the covert foreign policy utility of the worldwide Soros network. If this happens, and provided that Soros is on the retreat due to the Trump Administration’s relentless hounding of him, then it’s possible for the President to reach a deal with the Color Revolution architect whereby Soros would stop or lessen his anti-Trump attacks in exchange for the new American government being able to utilize his global regime change ‘services’ again. On the other hand, however, it’s also possible that Trump defeats Soros and takes over his organization, investing time and resources to ‘retool’ it from a “far-left/hyper-liberal” group to something more aligned with the global conservative and “right-wing” zeitgeist in order to make it more attractive and operationally effective in this day and age. It’s still too early to tell which way things may or may not go, but these are reasonable ideas to countenance given the existing state of affairs. \\nThe point in bringing this all up is to emphasize the very real split between Soros and his American governmental facilitators/criminals-in-arms. Trump’s Administration will be the first time when the US won’t blindly support Soros in all of his endeavors, and is ironically one of the mastermind’s targets this time around. This paramount asymmetrical conflict can’t help but interfere with Soros’ other operations all across the world, which, to get back to answering the main part of the question, is why the fifth column is so distraught at Trump’s victory. They also know that the “politically incorrect” President-elect doesn’t support their wild post-modern “liberal” views such as attacking conservative societies through the weaponization of homosexuality and destabilizing their centuries-old value systems. It’s indeed possible that Trump might be convinced by the CIA and some other “deep state” actors to tolerate the mild continuance of this campaign in some key geostrategic states, but seeing as how it’s so spectacularly failed in Macedonia, the Balkan country probably won’t be a top priority for him like it was for Obama. \\nIran, however, will be, since several high-profile voices around Trump and a few of the people who he’s rumored to be considering for crucial Cabinet positions have openly declared that the US must foment regime change in the Islamic Republic, but of course, the specifics of this could be discussed at another time. It’s just important to know that Color Revolutions won’t become an outdated weapon of the past just because of the Trump-Soros War, and everyone should always remember that the President of the US is still the leader of the world’s pioneer in unconventional destabilizations. The US still wants to retain and strengthen its hegemony, but Trump and his team feel that some fundamental tweaking must be made to the system in order for it to become much more effective. Most of the substance will remain the same, but it’s just that some of the style will change. I explored some of the details pertaining to this in my Sputnik article titled “ Here’s What Trump’s Foreign Policy Will Look Like ”, and I welcome all interested readers to check it out if they want to have a more comprehensive forecast about the future nature of American behavior abroad. \\nI must say, however, that no one should get their hopes up that Trump’s rule will herald in the US’ retreat from abroad – he’s been very clear from the start that his guiding mantra is “America First”, and while opposed to some of Obama’s foreign policy platforms, he’ll probably end up retaining some of them even if he rebrands them with his own style. He’s a pragmatic businessman who knows how to make deals, which is why the Great Powers of Russia and China have cautiously optimistic hopes that he’ll usher in a period (however brief) of New Détente in the New Cold War, but just because Trump might ease up the US’ pressure on one or both of these Eurasian anchors doesn’t mean that he won’t up the ante against Iran, Pakistan, and perhaps some other unforeseen targets of Washington’s wrath. \\nGreek diplomatic sources have briefed Greek media that the implementation of the Turkish stream is now moving faster than expected and the projections are that the construction will begin this year, while ending in 2019. Some information says that Gazprom and the EC are now getting close to agreement. What does your information say? \\nI don’t have any exclusive information about this project, but my analysis about its progress is that things have been moving along quite well ever since the game-changing Russian-Turkish rapprochement over the summer, which, to remind everyone, was the reason why the US hastened to clumsily arrange a failed coup attempt against President Erdogan. I discussed the specifics of this more thoroughly in my Oriental Review article about “ Reassessing The Reasons For The Failed Turkish Coup Attempt ”, and just like with my Sputnik piece which I reference in my last answer, this article might also be interesting for some readers to go through if they have the time and inclination to do so. I bring up the failed pro-US coup attempt in Turkey because it was hatched with the motivation of reversing the strategic gains that Russia and Turkey were poised to make, one of which is obviously Balkan Stream. \\nWith Ankara back on board with this Russian megaproject, the only other actor left which needs to fall in line is the EU, which – regardless of its US-ordered and politically driven rhetoric – desperately needs to secure reliable energy sources in the future, and will more than likely end up reaching some agreement with Russia around the time that the first part of the pipeline is completed. The anti-Russian sanctions regime has been cracking for the past year and many Eastern European countries want to ease the restrictions and work with their Russian partners in order to spearhead creative workarounds that would be mutually beneficial for both sides. Sooner or later, the EU will probably give in to its natural self-interested desire to restore relations with Russia and end up hashing out a deal for Balkan Stream. The major impediment to this, however, will remain the Third Energy Package, which Bulgaria clung to as its excuse two years ago in pathetically pretending that it was just “following the law” and wasn’t under any American pressure to obstruct South Stream. \\nThis totalitarian piece of legislation decrees that a company is not allowed to own both the pipeline and the gas which transits through it. Gazprom argued that this law entered into effect after it had already concluded negotiations on the project and should thus be exempt from its restrictions, but the EU didn’t accept this and said that the Russian company must “play by the rules”. Since Bulgaria was supposed to be the terminal point for the project and the first EU country through which South Stream was planned to pass, it took the vanguard role in stopping the pipeline and thus sacrificed billions of dollars of transit revenue as a result. The same problem could predictably repeat itself with Greece, but I think that Russia preparing a handful of possible solutions for dealing with this. The most realistic one would be to partner up with trusted companies and jointly own either all of the pipeline or each national section that it’s supposed to transit through, even if Gazprom gets 49% and its ally has a 51% controlling stake. \\nSince Balkan Stream will pass through a bunch of countries, it’s more realistic for each leg to be jointly owned by a different national partner, so for example, this could be DEPA in Greece, just like it’s Botas for Turkey. The model of working with individual partner companies in each transit state could be replicated all throughout the line’s forecasted route, but the liability is that unexpected disputes with one or another partner could lead to downstream disruptions if a national actor decided to “pull a Ukraine”, though there’s nothing at this time to suggest that such a scenario will happen. Likewise, being overly dependent on one or two major regional companies which could jointly operate the entire line with Russia could create a situation where the said company feels overly empowered and tries to push Russia around one day (whether on its own initiative or under pressure from the US). Therefore, having multipole stakeholders all along the route could ironically be a much more stable alternative because it means that everyone else would put pressure on the disruptive actor in the event that they ‘go rogue’ and do the US geostrategic bidding. \\nWhat we need to look forward to now is the business diplomacy that will inevitably commence sometime in the future and monitor this to the best of our abilities in order to get a clearer picture of Balkan Stream’s technical-administrative aspects. Gazprom will obviously look to enter into deals with its partners in order to get around the Third Energy Package, but knowing the Russian giant, it’ll probably conduct a lot of these in secret in order to keep the details under wraps so it might be difficult to find out what’s really happening. This is why it’s so useful to use models such as the joint ownership one which I just explained in order to have an initial framework for testing hypotheses and seeing how well they correlate to the unfolding reality. I don’t have any idea about the timeframe for these negotiations, but it’s safe to say that the ones with Greece will definitely be concluded by the time that the first part of the pipeline is completed with Turkey, and Russia might also by that time line up agreements with Macedonia, Serbia, and Hungary in order to move as fast as possible from that point onwards in pairing Balkan Stream’s logical northwards expansion with China’s Balkan Silk Road high-speed rail project. \\nAndrew Korybko is the American political commentator currently working for the Sputnik agency. He is the author of the monograph “ Hybrid Wars: The Indirect Adaptive Approach To Regime Change ” (2015). RELATED POSTS\""}, "time": 1742564497.951127}