{"duration": 0.036096811294555664, "input_args": {"text": "'Videos In 2016, Israel Demolished Over 200 West Bank Homes In Illegal Settlement Expansion ‘True to Israel’s entire history, it’s a story of moving in where people already live and kicking them out,’ noted Abby Martin, a journalist who traveled to Palestine earlier this year to document Israel’s oppressive occupation.   A Palestinian man tries to stop work by an Israeli bulldozer during a protest outside the village of Deir Qaddis, near the West Bank city of Ramallah, Wednesday, July 13, 2016. The Israeli bulldozers were bulldozing land outside Deir Qaddis village near Ramallah for an apparent plan to expand a nearby Jewish settlement. \\nJERUSALEM — Israel’s illegal settlements in the West Bank of Gaza have expanded rapidly over the past year, seriously threatening many Palestinian communities and their farmlands. \\n“This practice doesn’t just mean expanding into Palestinian land,” journalist Abby Martin explained in an Oct. 31 episode of “The Empire Files.” This week on the @EmpireFiles : @AbbyMartin investigates the eviction of Palestinian families https://t.co/rzBYBm1HAD pic.twitter.com/AnvToA9e0Q \\n— teleSUR English (@telesurenglish) November 1, 2016 \\nWhen Martin traveled to the region for several weeks in August and September to report on the effects of Israel’s apartheid policies on the indigenous Palestinian population, her movement around Gaza was heavily restricted by Israeli forces. \\nMartin continued: “True to Israel’s entire history, it’s a story of moving in where people already live and kicking them out. Wherever these new settlements are planted, they first evict the Palestinians living there and bulldoze their homes into the ground.” \\nThe demolition of Palestinian homes has reached record levels in recent months. Martin cited figures from B’TSelem , an Israeli NGO that opposes the occupation of Palestine, which show that over the past 10 years Israel demolished over 1,148 homes in the West Bank, leaving over 5,282 Palestinians homeless, including over 2,650 children. But in 2016, home demolitions hit a 10-year high, with over 200 homes demolished in the West Bank this year, resulting in 800 homeless Palestinians, half of whom are children. \\n“Many hundreds more have orders to evacuate their homes and shops for demolition,” Martin noted. \\nDemolition orders are issued through the Israeli court system, but Palestinians have little to no legal recourse to resist the orders. To make matters worse, many Palestinians never receive the notice of impending demolition in the first place. An expert on home demolitions, who gave his name as “Qossay AZ,” told Martin: “What they do is, they just simply place [the notice] somewhere, on the street, on a wall, on a balcony, whatever, and they would put just a rock on it, if they’re courteous enough, so the wind won’t blow it away. And then they would come, like, ten days after and start demolition.” \\nTypically, new illegal settlements begin with just a single home built on a hilltop overlooking an existing Palestinian village. This home and any others that follow are illegal under international law , and these settlements develop without explicit approval of the Israeli government. While Israel allows the settlers to violently attack local Palestinians with impunity , but Israeli authorities react with deadly force if Palestinians try to defend themselves. \\n“Villages all across the West Bank have new settlements encroaching on their residents,” Martin explained. “Instead of building in the acres of empty land, they move in right next door, and expand into Palestinian neighborhoods.” \\nThe settlements expand over time, gradually forcing out more and more Palestinians. Despite their violent origins, most settlements are eventually granted official recognition by the Israeli government. \\nIsraeli forces and settlers frequently burn or bulldoze Palestinian olive trees, an act of genocide which destroys a crop vital to survival. Israeli soldiers also severely restrict Palestinians’ access to the olive groves which remain intact. If the land falls fallow, the Israeli government can then declare it “barren” and further expand into that territory. \\nFaced with the rapid growth of illegal settlements and outposts, many Palestinians remain determined to defend their land. Martin interviewed Khaled, a Palestinian man who is from one of the last remaining families in his village. He and his family live under constant threat from Israeli settler and soldier violence. Khaled told Martin: “We suffer continuously from the attacks by the settlers. They throw rocks at us and other similar acts of sabotage to cause us harm and damage. We face daily harassment from the settlers in order to force us to leave our homes. These repeated attacks occur constantly and are brutal.” \\nDespite the violence, Khaled refuses to leave his village. He concluded: “As long as we are staying in our home, they will not be able to achieve their goals in removing us and that is how we are protecting our land. We will not leave our homes, and we are not going anywhere. We are staying in our houses until we die.”'"}, "time": 1742628566.2230797}