{"duration": 0.052130937576293945, "input_args": {"text": "'CNN and other outlets were in high dudgeon Friday afternoon after several news outlets were apparently excluded from a White House press gaggle, complaining that conservative, “ ” outlets like Breitbart News were allowed into the briefing. [Those excluded called it “absolutely unacceptable” and described it as an attack on the freedom of the press.  CNN was blocked from WH @PressSec‘s media gaggle today. This is our response: pic. twitter.   —   CNN Communications (@CNNPR) February 24, 2017, CNN’s media correspondent Brian Stelter accused the Trump administration from trying to “ ” questions, defeating the media’s ability to hold the president accountable. Dean Baqeut, executive editor of the New York Times, said: “Nothing like this has ever happened at the White House in our long history of covering multiple administrations of different parties. ” However, as the New York Times itself reported in 2015, President Barack Obama met privately with liberal reporters and columnists frequently throughout his tenure in office  —   “more than a dozen” times. And although he occasionally invited conservative columnists, “  columnists from newspapers tend to dominate at Mr. Obama’s secret sessions. ” Obama’s private briefings for liberal members of the media, which excluded conservatives, were  . A few: On Friday, CNN media reporter Dylan Byers expressed concern at the alleged exclusion of   media outlets. Yet in 2015, he wrote about the frequency of Obama’s private meetings with journalists. Byers noted that President Obama “holds the occasional meeting with conservatives,” but the list of “regulars” included a roster of prominent liberal journalists. Some at CNN  NYT stood   News when the Obama admin attacked us  tried 2 exclude   WH gaggle should be open to all credentialed orgs https:  .   —   Bret Baier (@BretBaier) February 24, 2017,  In reaction to the exclusion of some outlets from Friday’s briefing, Fox News’ Bret Baier noted that some journalists at CNN and the Times had stood up to the Obama administration when it tried to exclude Fox News from White House briefings. That is true  —   and admirable. The question of whether some outlets are being excluded from otherwise public briefings is a valid one  —   and, as of this writing, the White House has not yet clarified why some outlets were not included in the gaggle. Nevertheless, the New York Times‘ claim that “[n]othing like this has ever happened” is simply false  —   or “fake news. ” Update: The White House has denied claims that it excluded any outlets at all: White House Deputy Comms. Dir. Raj Shah denies reports of a gaggle block against CNN, NYT, Politico and others: pic. twitter.   —   ErikWemple (@ErikWemple) February 24, 2017,  CNN’s Jake Tapper, host of The Lead, opened his show by calling Trump’s attitude toward the press “ . ” . @jaketapper: ”The White House does not value an independent press. There is a word for that:  .” https:  .  pic. twitter.   —   The Lead CNN (@TheLeadCNN) February 24, 2017,   Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. His new book, How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742561671.6307933}