{"duration": 0.11074209213256836, "input_args": {"text": "'Life at migrant centers in Germany: RT talks to volunteers, refugees about their hopes & fears   20:39 Get short URL © Pascal Rossignol / Reuters Some have faced criticism in their own country for aiding asylum seekers, while others are themselves migrants who have seen their accommodation centers burnt down. RT Russian talked to residents and volunteers at migrant centers in Germany. \\nMiriam Düsterhöft, 27, studies social science at university and believes that working at one of the refugee centers in Düsseldorf, Germany, will be a good experience. \\nDüsterhöft told RT Russian that she wants to help refugees to integrate into Europe. Read more Christian refugees persecuted by Muslim asylum seekers in German shelters – survey \\n“At first it was very difficult. There was a lack of essentials, it was hard to communicate with refugees. Many didn’t make any effort to learn German,” she said. \\nOne of the issues at the center was a lack of interpreters of Persian or Kurdish. There was a man who translated from Arabic for men, and a woman translating for female residents. \\n“[Kurdish and Persian] women do not communicate with men, they are afraid to speak about certain things. Even we [volunteers] don’t know what they feel or need.” \\nAsylum seekers have to spend at least six months at the center before authorities can grant them refugee status and provide them with accommodation. Sometimes they have to wait longer before receiving the status, or because the condition of the accommodation provided is much worse than that of the center, Düsterhöft said. \\nDüsterhöft’s style of clothing at the center differs greatly from what she wears in her everyday life. Here at the migrant center she wears long skirts and trousers, and covers her hands with sleeves. \\n“This is my decision – I have a lot of tattoos all over my body, and I don’t want to confuse people who aren’t accustoed to this. I don’t think that it infringes on my rights.” \\n“No one has ever tried to rape me,” she added. This isn’t a random comment – asylum seekers have been accused of numerous sexual harassment incidents towards women and children in Europe since the start of 2016. \\nEarlier in October, a female interpreter for a French journalist was raped near the notorious Calais ‘Jungle’ migrant camp. Reports also emerged that the woman’s attackers were three Pashto-speaking male asylum seekers. Read more \\nDüsterhöft said she hasn’t had any major conflicts with refugees. The most serious incident was when the father of one child asked not to draw animals or humans during classes because Islam forbids the depiction of people. \\n“We solved this issue and removed the controversial exercise,” she said. ‘There are bad people both among Europeans and migrants’ \\nThe mother of 18-year-old student Fiona Braun, who is giving German lessons to refugees, says that her life hasn’t changed with the arrival of asylum seekers. \\n“My daughter works with refugee children from Syria and Afghanistan in camps in Vienna and in Bratislava,” Jana Olearnikova told RT Russian. \\n“She [Fiona] now has a lot of female friends among migrants. Fiona comes home with new recipes that she learned from the Arab girls,” she said, adding that she welcomes “the opportunity to dive into Arab life” and likes “the diversity of cultures in Europe.” \\nOlearnikova said she’s not afraid to walk alone in the evenings, despite the stories that have emerged since the refugee crisis started. \\n“Of course, there may be criminals and bad people among migrants, but they may be among the Europeans, too,” she said. Syrian refugee: ‘ISIS killed my entire family, I have nowhere to go’ Read more More than 300,000 refugees in Germany work illegally, pay kickbacks to asylum center staff - reports \\nAid Abu Kasem was an architect back in Syria. He understands that when he receives refugee status, he won’t be able to find the same job in Germany. \\n“But I don’t mind. The most important thing for me is to find myself in a new reality. I\\'m learning German, it’s very difficult, but I’m trying,” he told RT Russian.Kasem says it will be difficult for him to settle into his new home. \\n“I know that in Germany there are common swimming pools and common saunas for men and women. They bathe together naked, although completely unfamiliar with each other. I can’t understand it. I guess I just won’t attend such places.\" \\nHe said that the center in the town of Zirndorf, Bavaria, where he is currently living, was set on fire twice. \\n“It’s unpleasant. I didn’t do evil to anyone and shouldn’t suffer for the fact that these people hate anyone who runs away from war.\" \\n“ISIS [Islamic State/IS] killed my entire family, I have nowhere to go, so I decided to start a new life,” he added.'"}, "time": 1742563092.588289}