{"duration": 0.0890505313873291, "input_args": {"text": "'TEL AVIV  —   Supernatural actor Mark Pellegrino slammed the United Nations and the U. S. for the “unethical” Security Council resolution condemning Israeli settlements. [Pellegrino was visiting Israel for the first time last week with a group of fellow actors and other professionals from the entertainment industry. The trip, organized by Israel’s Ministry for Strategic Affairs and Public Diplomacy and America’s Voices in Israel, coincided with Secretary of State John Kerry’s controversial address on the   conflict.  The actor, who is best known for playing Lucifer in the Warner Bros. series, lambasted Kerry for condemning Israel in his speech. “[Kerry] was on the wrong side of every historical event and this was no different,” he said in an interview. He further slammed the United States for abstaining from the vote on Resolution 2334, which calls Israeli settlements a “flagrant violation of international law. ” “Leave it to the UN to do the absolute wrong thing and save it for posterity’s sake in the form of the resolution,” Pellegrino said. Pellegrino, who was joined by TV stars Meagan Good from Deception and The Walking Dead‘s Sonequa   among others, made the decision to come on the trip out of a sense of “obligation to support democracies. ” “I’ve always been a huge supporter of the only democracy in the Middle East,” he said. “The way things are turning out all around the world, we have an obligation to support democracies. ” While Israel continues to be “under attack from the rest of world,” for Pellegrino as a secular person, the Jewish state is an island of hope in the region for allowing “full freedom of religion, freedom of conscience and for promoting human prosperity. ” Pellegrino said that one of the highlights of his trip was visiting the Western Wall  —   Judaism’s holiest site  —   defined in the resolution as “occupied Palestinian territory. ” Despite identifying himself as an atheist, Pellegrino conceded that being at the Western Wall made him “open to the suggestion because of its unique power that prayer goes straight to God. ” Pellegrino was also drawn to the rich archaeology of the area, which “prove[s] Israeli existence there for many thousands of years. ” But the most profound moment, unexpectedly, was visiting a hospital. The Rambam Healthcare Campus, which has Arab doctors and Jewish doctors working side by side treating Arab and Jewish patients alike  —   and even Palestinians from the West Bank and Gaza  —   opened Pellegrino’s eyes to the “wide diversity in Israel. ” “It’s symptomatic of a free country, of a culture that respects everybody’s mind and values. Far more so than Arab countries,” he said. “The hospital was an entire community devoted to medical sciences, to using science to increase prosperity. It is literally changing the world,” he added. According to Pellegrino, Hollywood has a myopic,   view of the   conflict. “In my opinion, Hollywood doesn’t know the context. Hollywood sees a David and Goliath story with Israel being cast in the role of Goliath, as the evil aggressor,” he said. “The Palestinians are simply innocent reactors to whatever Israelis are throwing at them. And everything  —   like their economic situation  —   excuses the savagery. ” “Those people in the Hollywood community would be served by coming here,” he added.'"}, "time": 1742561901.2300308}