{"duration": 0.06734633445739746, "input_args": {"text": "'One more demonetisation death; stone-pelter commits suicide after being out of work for 9 days Posted on Tweet ( Image via intoday.in ) \\nNinth day into demonetisation and the death toll has reached 48. These are confirmed deaths reported on Huffington Post India. The number of unreported deaths may be higher if we can link all deaths in the past 10 years to demonetization. While most deaths are of elderly waiting in long bank queues as their sons and daughters patiently waited at home for the news channels to arrive and interview them, there are quite a few suicides, the latest being an innocent stone-pelter in Kashmir who was forced to take the drastic step owing to financial constraints. \\nWhile Modi was engaged in a chit-chat with Bill Gates over a cup of tea yesterday, Yakub Ali, a stone- pelter by profession had put an end to his life after he ran out of valid currencies. Sources say he was distressed as his employer urged him to accept 500 and 1000 rupee notes and resume the noble work he was associated with. \\n“But I can only exchange 4000 rupees,” implored Mr. Ali as his employer gave him a bundle of currency notes in 500 denomination. \\n“Yes, but you can deposit the rest in your account.” \\n“But do you know how long the queues are? It takes hours to reach the counter.” \\n“Here,” he handed him a memory card. \\n“What is it?” \\n“Jodha Akbar by Ashutosh Gowariker. I have copied the file in it. By the time it gets over, you should reach the counter, but if you still don’t then there is one more file in it as backup.” \\n“And which file is it?” \\n“Sri Lanka’s national anthem. Now go and deposit the money in your account.” \\nHe went to the nearest bank branch and saw the queue. He already heard about people dying in bank queues. \\n“Let’s deposit the money,” his friend suggested. \\n“But have you seen the queue? We might die before reaching the counter.” \\n“But if that happens, you will at least feature on Huffington Post.” \\n“Do you realize how embarrassing the headline would be for us? Terrorist dies while standing in bank queue.” \\n“Then what would you do?” \\n“I will commit suicide. There are better facilities in heaven than a bank queue. And I will feature on the front page anyway.” \\nThe news of his death has cast a gloom over the proceedings of some of the news channels. The journalists abandoned their interviews with politicians in the disguise of traders and hurriedly aired the news, demanding an answer from the Prime Minister. \\nWe tried to contact Arvind Kejriwal and Rahul Gandhi but they were not available for comments. Sources reveal that they have already left for Kashmir to meet the bereaved family members of the deceased.'"}, "time": 1742563784.003902}