{"duration": 0.06619834899902344, "input_args": {"text": "'A federal appeals court in New York has thrown out a $655. 5 million verdict rendered last year that had held the Palestinian Authority and the Palestine Liberation Organization liable for their roles in supporting terrorist attacks in Israel that claimed American lives. In reversing the verdict on Wednesday in the case, which drew the attention of the Obama administration, the appeals court did not minimize the impact of the six terrorist attacks, which occurred from 2002 to 2004, but it held that the Federal District Court in Manhattan had lacked the jurisdiction to hear the case. “The terror   attacks and suicide bombings that triggered this suit and victimized these plaintiffs were unquestionably horrific,” said a   panel of the United States Court of Appeals for the Second Circuit, in Manhattan. “But the federal courts cannot exercise jurisdiction in a civil case beyond the limits prescribed by the due process clause of the Constitution,” the court added, “no matter how horrendous the underlying attacks or morally compelling the plaintiffs’ claims. ” The plaintiffs included 10 families, comprising about three dozen people, eight of whom were physically injured in the attacks, as well as the estates of several victims who were killed. The suit was brought under the   Act, which provided for the tripling of the $218. 5 million in damages awarded by a Manhattan jury. The law, which allows United States citizens who are the victims of international terrorism to sue in the federal courts, was passed some years after the 1985 murder of Leon Klinghoffer in the Palestinian hijacking of the cruise ship Achille Lauro. Kent A. Yalowitz, a lawyer for the families in the case, said in a statement that the law had been passed by Congress “to protect Americans wherever in the world they traveled. ” “The very terrorists who prompted the law have now hidden behind the U. S. Constitution to avoid responsibility for their crimes,” Mr. Yalowitz said. “This cruel decision must be corrected so that these families may receive justice. ” Mr. Yalowitz said the plaintiffs were weighing their options, which could include seeking review by the full appeals court, or asking the United States Supreme Court to hear the case. The attacks in Israel occurred on the street, at a crowded bus stop and inside a bus, and in a cafeteria on the Hebrew University campus. Hanan Ashrawi, a member of the P. L. O. ’s executive committee who testified for the defense in the trial, expressed satisfaction with the appeals court’s decision, saying, “I hope this is the end of it. ” Speaking by telephone from Ramallah in the West Bank, Ms. Ashrawi said, “Finally the American justice system proved its impartiality. ” She added that the decision “restores my faith in the judicial system. ” The jury in the   trial, which ended in February 2015, heard emotional testimony from victims and witnesses in the attacks. But in finding that the federal court lacked jurisdiction, the appellate panel ruled that the connections between the Palestinian defendants and the United States were not sufficient to give the trial court the power to hear the plaintiffs’ claims. Judge John G. Koeltl, writing for the panel, said the attacks in Israel had not been “expressly aimed at the United States,” and evidence presented by the plaintiffs had established the attacks’ “random and fortuitous nature. ” “Evidence at trial showed that the shooters fired ‘indiscriminately,’” the judge wrote, “and chose sites for their suicide bomb attacks that were ‘full of people,’ because they sought to kill ‘as many people as possible. ’” The decision was joined by Judges Pierre N. Leval and Christopher F. Droney. The trial judge, George B. Daniels, had required the Palestinian Authority to post a bond of $10 million and an additional $1 million monthly to appeal the case. The bond is typically 111 percent of the judgment, but the authority said it could not afford that. Lawyers for the victims had objected to the lower amount, but the authority won support from an unexpected source: the Obama administration. Officials at the Justice and State Departments had asked Judge Daniels to consider the ramifications of requiring too high a bond, suggesting that doing so could cause economic and political harm to the Palestinian Authority and the broader peace process. “A P. A. insolvency and collapse would harm current and future U. S.  efforts to achieve a   solution to the   conflict,” Antony J. Blinken, the deputy secretary of state, said in a court filing in August 2015. The government’s filing came after sharp debate between officials at the State and Justice Departments over the strategy to take in the case.'"}, "time": 1742562316.3290348}