{"duration": 0.10469174385070801, "input_args": {"text": "\"Before the LORD the whole universe is as a grain from a balance or a drop of morning dew come down upon the earth. But you have mercy on all, because you can do all things; and you overlook people’s sins that they may repent. For you love all things that are and loathe nothing that you have made; for what you hated, you would not have fashioned. And how could a thing remain, unless you willed it; or be preserved, had it not been called forth by you? But you spare all things, because they are yours, O LORD and lover of souls, for your imperishable spirit is in all things! Therefore you rebuke offenders little by little, warn them and remind them of the sins they are committing, that they may abandon their wickedness and believe in you, O LORD! New map of the Universe \\nHere’s a video on 3,000 scientists and professors with Ph.D.s who became believers of Creation, based on evidence, not faith. Some examples are Duane Gish, Cornell U. researcher with a Ph.D. in Biochemistry from U.C. Berkeley; Henry Morris, Ph.D., professor of Hydraulic Engineering at Virginia Tech. \\nPull quotes from the video, spoken by Dr. Jerry Bergman, co-author of the book Persuaded by the Evidence : \\n1:09 mark: “The book basically summarizes accounts of why people became creationists . . . . So many people believe that creationists are . . . just born that way or raised that way . . . . We want to show that many people became creationists because of the scientific evidence. In fact, many people in the book, including myself, became creationists by the evidence, not because we were raised this way.” \\n6:55 mark: “In fact, when I was an atheist, we used to often call these, what they call theistic evolutionists, ‘useful idiots’ . . . and that term was heard over and over again. They felt they’re [theistic evolutionists] useful for now. Once we convince the world of Darwinism . . . then there’ll be no need for religion, and they [theistic evolutionists] in essence are digging their own grave.” \\n8:07 mark: “Many [of the 3,000 scientists and professors in the book] stress very strongly that I would not be a Christian today if it was not for my study of evolution and my realization that evolution is not supportable by the science. And therefore they became creationists, and then they became Christians.” \\n8:54 mark: “I began to question atheism for a number of reasons. One reason was a lot of the scholarship that atheists did, I realized due to a lot of reading, was just not valid. Like the claims about Galileo and Bruno, and the claims that the Church executed many, many scientists because of their science. I realized that these claims are just not true, they’re just false. So I became disillusioned with atheist scholarship. And the next step was, indeed, is there any evidence for evolution because a major reason why many people are atheists is because they are convinced we do not need a Creator to account for the origin of life and the Universe. This is a foundational doctrine of atheism. So I decided, ‘Well, if this is not true, if evolution is not valid, then that negates the reason why many people are atheists.'” \\n11:28 mark: The evolutionary progression from ape to man that’s “commonly presented” is “either faked or they are distorted or the evidence is very unpersuasive for what they call a monkey or primate into man.” \\n11:48 mark: “Dogmatic evolution, I find, is interfering with science . . . because you are looking at the world with very distorted glasses. You’re not looking at what’s there; you’re looking at what you want to see there . . . . You must not force the facts into an evolutionary interpretation, and this all too often is done.” \\nAn example of science forcing the facts into an evolutionary interpretation is pseudogenes and junk DNA. 12:33 mark: “It was said for a long time that . . . 95% of the DNA is junk, it has no function . . . . I said all we can say now is we don’t know that it has a function . . . . Over and over I argued with colleagues about this. Now it’s widely recognized that much, if not most, possibly almost all of this so-called junk DNA now we know has a function. Much of it has a regulatory function.” Helix Nebula , dubbed “Eye of God,” in the constellation Aquarius, 700 light years from Earth. \\nMay the peace and love of Jesus Christ our Lord be with you! \\n~Eowyn\""}, "time": 1742561700.9372408}