{"duration": 0.08007359504699707, "input_args": {"text": "'Email \\nAs an old SDS-er, I found it hard to see Tom Hayden go. However meandering his path, he was at the heart of radical history in the 60s, an erstwhile companion, if not always a comrade, on the route of every boomer lefty. \\nOne of his finer moments for me, which I’ve never seen mentioned (including among this week’s encomia) since he wrote it, was his 2006 article , published on CounterPunch with an introduction by Alexander Cockburn, in which he apologized for a “descent into moral ambiguity and realpolitick that still haunts me today.” It would be respectful of Hayden’s admirers and critics, on the occasion of his passing, to remember which of his actions “haunted” him the most. \\nThe title of the article says it clearly: “I Was Israel’s Dupe.” In the essay, Hayden apologizes for his support of the Israeli invasion of Lebanon in 1982, which was for him that “descent into moral ambiguity” More importantly, he explains why he did it, in a detailed narrative that everyone should read. \\nHayden sold out, as he tells it, because, in order to run as a Democratic candidate for the California State Assembly, he had get the approval of the influential Democratic congressman Howard Berman. Berman is a guy who, when he became Chairman of the House Foreign Affairs Committee, was proud to tell the Forward that he took the job because of his “interest in the Jewish state” and that: “Even before I was a Democrat, I was a Zionist.” \\nHayden had to meet with Howard’s brother Michael, who, acting as “the gatekeeper protecting Los Angeles’ Westside for Israel’s political interests,” told Hayden: “I represent the Israeli Defense Forces”—a sentence that could serve as the motto of most American congress critters today. The “Berman-Waxman machine,” Hayden was told, would deign to “rent” him the Assembly seat on the “one condition: that I always be a ‘good friend of Israel.’” \\nBut American congressmen were not the only “gatekeepers” through whose hands Hayden had to pass before being allowed to run for Congress. Other “certifiers” included “the elites, beginning with rabbis and heads of the multiple mainstream Jewish organizations,… the American-Israel Political Action Committee (AIPAC), …[and].. Israeli ambassadors, counsels general and other officials.“ \\nIn fact, Hayden had to, in his words, be “declared ‘kosher’ by the ultimate source, the region’s representative of the state of Israel,” Benjamin Navon, Israel’s Counsul-general in Los Angeles. \\nIn other words, in this article Hayden was describing, in an unusually concrete way, how the state of Israel, through its state officials and their compliant American partners, was effectively managing—exercising veto power over Democratic Party candidates, at the very least—American elections down to the level of State Assembly . In any constituency “attuned to the question of Israel, even in local and state elections,” Hayden knew he “had to be certified ‘kosher,’ not once but over and over again.” \\nThis experience prompted Hayden to express a “fear …that the ‘Israeli lobby’ is working overtime to influence American public opinion on behalf of Israel’s military effort to ‘roll back the clock’ and ‘change the map’ of the region.” Hayden warned of the “trepidation and confusion among rank-and-file voters and activists, and the paralysis of politicians, especially Democrats,” over support of Israel. He vowed to “not make the same mistake again,” and said: “Most important, Americans must not be timid in speaking up, as I was 25 years ago.” \\nWhatever else he did—and he was never particularly radical about Palestine—this article was a genuinely honest and unusual intervention, and it deserves a lot more notice—as a moment in Tom Hayden’s history and that of the American left—than it has got. Looking back and regretfully acknowledging that one had been duped and morally compromised by what seemed the least troublesome path 25 years earlier, saying “I woulda, shoulda, coulda done the right thing,” is a haunting moment for anyone. Doing it in a way that exposes in detail how a foreign country constantly manipulates American elections over decades is worthy of everyone’s notice. \\nI doubt Hillary and her Democratic supporters will have anything to say about this “interference “in American elections, even local and state. But I do hope many of those who are touched by the loss of Tom Hayden heed these words from him, and don’t wait another 25 years to overcome their “fear and confusion” about saying and doing the right thing regarding the crimes of Israel, troublesome as that might be.'"}, "time": 1742564610.9375398}