{"duration": 0.04010725021362305, "input_args": {"text": "'usapoliticsnow admin 2016 Election , US News \\nBroward County is one of the largest swing counties in Florida. It would not take much voter fraud there to flip it. \\nThe voter fraud whistle-blower is a former Secretary of Elections Department employee and she has filled out a sworn affidavit: \\nYou can read the affidavit here. The affidavit by Chelsey Marie Smith accuses Broward County officials of filling out blank absentee ballots to officials who she saw filling the ballots out at the Supervisor of Elections headquarters. Smith said she was asked to deliver numerous ballots to a secret locked room where employees were filling out the absentee ballots. At first she was not clear as to what was happening. When she finally clearly saw what was up and reported it, she was terminated and told to never come back! \\nAfter being caught red-handed engaging in voter fraud, Broward Country FL Sec of Elections Brenda Snipes claimed staff were “replicating damaged ballots” in the locked secret room without official monitors present. Yeah, that was a good one Brenda! \\nAccording to the whistle-blower, the massive voter fraud went on day after day and included what had to be thousands of ballots. Brenda Snipes is already under lawsuit for deliberately misprinting absentee ballots! Why is she still around? \\nDonald Trump is currently preparing a lawsuit against Snipes and the FL State Attorney investigators are actively reviewing the voter fraud case. Secretary of Election employees in Broward County, FL caught filling out absentee ballots! #FloridaFraud pic.twitter.com/MqjmFtDXHX \\n— Mike Cernovich 🇺🇸 (@Cernovich) November 4, 2016 \\nRecently, numerous Florida voters have complained that they have not been receiving their absentee ballots. It seems we have found where some are going! How many other counties have a secret locked room!! \\nDemocrats live by an “ends justify the means” mentality. Cheating and stealing is of no issue to them as long as the outcome is the one that they want! Voter Fraud is entirely legitimate to them. \\nUPDATE: \\nFox News reported that the Florida GOP has also filed a voter fraud lawsuit for illegally opening absentee ballots! \\nThe state GOP alleges that officials in Broward County, which includes Fort Lauderdale, have been opening tens of thousands of vote-by-mail ballots prior to them being cleared for counting. \\nChairman Blaise Ingoglia told Shapiro that “Florida law prescribes that when the supervisor of elections takes in all these ballots, they have to be approved by the canvassing board.” \\nTherefore, the officials have no legal authority to open the ballot envelopes. \\nIngoglia said none of the ballots had been approved, so the party will be filing a lawsuit at 9 a.m. ET Thursday if county officials do not respond to his complaint by close-of-business on Wednesday. \\nSource: www.ihavethetruth.com '"}, "time": 1742563562.4277878}