{"duration": 1.3179147243499756, "input_args": {"text": "'By Alexa Person\\nFriday, October 14, 2016, one day after President Obama issued an Executive Order regarding space weather events , the Earth’s magnetic shields collapsed and the energetic streams of energy flowing around Earth (solar winds) completely changed direction. These events corresponded with a severe geomagnetic storm that can be tracked in the satellite video below.\\nA massive plasma wave literally washed over our planet. This wave consisted of high frequency energy bearing Ascension codes and these codes arrived in the form of Light, otherwise known as photons. My ascended Twin Flame, Ahy, has taught me a great deal about these photon packets, which I now understand to be Amplituhedrons.\\nSatellite Imagery and Executive Order regarding Space Weather \\nSince this event took place, I’ve seen a dramatic rise in a number of unexpected side effects:\\nStillness. More than usual. It’s as if Gaia is allowing us to experience a “pause” while we are given a chance to integrate the energy bombarding her 4th Density. Time has vanished. And along with it, urgency has disappeared. Everything is getting done, but any anxiety associated with the completion of tasks is nonexistent. Profound sense of peace. Conscious contact with our Higher Dimensional Selves. Body temperatures rising unpredictably and dramatically while at rest. Powerful Light energy intermittently discharging through the skin and/or spine causing intense tingling sensations. Increased focus. Unconsciously shielding the Mind/Body/Soul. Increased contact with the Higher Self. Appetite fluctuations paired with conscious eating. Fatigue. Increased sensitivity, joy and clairvoyant abilities. Due to the onset of my own side effects earlier last week, I cancelled appointments and managed only the most pressing responsibilities. Knowing it was important to be still with this energy, I chose to isolate myself with the intention of integration. I noticed that within the stillness, I desired my own energy. Pushing back all my Guides and other external energies, I found myself hibernating within the stillness of my own I AM Presence.\\nI normally do not review journal entries once they are written, but I was specifically guided to share these two entries.\\nThe following writings took place before and after the plasma wave moved over our planet. The passages are excerpts taken directly from my journals. For the sake of authenticity, I have kept the copy in tact and have not altered it in any way. It is my prayer that they are of some assistance. If only one person finds any guidance in what I share, I will consider these efforts a success.\\n\\nJournal Entry I I entered a deep meditation and experienced an intense connection with the Amplituhedon. Elementals and the Cardinal Directions gathered and assisted me in moving it [Amplituhedron’s energy] outward in every direction; 360 degrees it moved away from the Earth’s core. Multiple crystalline Amplituhedrons swirled away from the center at tremendous speeds. As they moved, I felt a rush and connection with them.\\nWorking with the Amplituhedrons was different this time. Instead of moving through each individual layer of the Earth, I connected intensely and instantaneously [with the energy], moving it upward into the Christos Grid and the Magdalen Grid, only to turn my attention outward to reconnect this radiant pink light with the Sun and the Great Central Sun.\\nI had an epiphany. I felt my consciousness proclaim: “I am fine. I am where I need to be. I am in Service of Others. I am positioned exactly where we decided I would be.”\\nNo longer do I yearn to fly off the Earth and leave her for my higher, familiar realms. I know my job is right here in the NOW. This is the moment I’ve been waited for, the one we have all waited for: the Harvest.\\nMy mind continually wanders past the multiverses and I consider who or what gazes down at the honeycomb mazes of life and wonders, “Do they have any concept of anything grander?”\\nAnd so it goes, I guess: one atom building against another and so on-the Divine Matrix.\\nShortly after this entry, I had another moment with the Amplituhedron that directly related to everyone on the planet.\\nJournal Entry II As it connected to Gaia, I wondered if I needed to visualize the Amplituhedrons. Suddenly, I began moving the energy upwards from the center Earth’s Amplituhedron and called upon the Elementals and cardinal directions for assistance. It wasn’t as dramatic as before, but it moved incredibly fast, much faster than other times.\\nAs I got to the surface where I joined with all mankind again, something different took place. I found myself standing with hands cupped open in front of me, manifesting another Amplituhedron. This one revolved in the air, spinning just in front of the heart chakra of every human being. It remained there, revolving in a holding pattern, waiting to be accepted.\\nWe are all being asked to consciously step into the new frequencies coming into the planet. It is accepted by Free Will.\\nI watched and marveled at the beauty of this geometry floating before the abstract representation of ALL people.\\nThe Amplituhedron then rose into the blue sky and lowered itself into brilliant blue water where it turned 45 degrees to the right and lodged itself into the Earth. A second Amplituhedron revealed itself and remaining upright, hovered far in front of the one buried beneath the water in the soil.\\nTwo identical Amplituhedrons remained before me. One buried at a right angle within the Earth and a second levitating in another realm, completely unhindered by the other.\\nConfused, I asked my Higher Self what this scene meant and I received a brief, yet lengthy (this is how it works) explanation of how 3rd Density will phase out.\\nThe Earth’s timelines are wobbly, splicing, and we are being asked to choose our path. Some people will bury themselves in the gravity of the Earth’s illusion and others will transcend it. But all is in order and perfection, as there is no judgment. All paths ultimately lead to the same place-Source. Some paths are merely shorter than others.\\nThe time has come. Frequencies are being evaluated and put into order. There is little time to reevaluate and alternate paths. The difficulty lies in the trajectory of assimilating the lessons of Unity Consciousness.\\nHolding Space for the Higher Self Immediately after experiencing the double Amplituhedrons, I thought about an exercise I did a long ago:\\nMy cells were in solitude I spoke to my cells I brought Light into my cells Activating the “junk DNA” As a result, my body became conscious of me, thus I “awakened to myself”. Just as my cells became aware of me, it was my job to hook into the greater sea of Unity Consciousness and look past the 3rd Dimension. I strove to higher ground, ever-seeking a higher frequency of consciousness, praying my Higher Self would bless me with a “sign”. Thankfully, I quieted my mind long enough to allow this “sign” into my consciousness.\\nThe irony is our Higher Self is always communicating with us. The problem is that we are so contaminated by the illusion of the 3rd Dimension and everything it offers that we don’t listen. Distractions have the intention and priority to become unavoidable. Technology, addictions, entertainment and vices never sleep. They rage 24 hours a day. In an age of instant gratification, Stillness is not rewarded. So how does the Higher Self reach us?\\nIf we are wise enough to practice stillness via meditation or other sacred practices, the Higher Self will communicate and the threshold between the illusory offerings of this dimension and higher ones will be broken. Contact made, the upward reaching cycle continues. As activated beings we begin to see the Universe(s) through the lens of Unity Consciousness.\\nThe Solar System then becomes a multiverse. The multiverse soon becomes part of a system of multiverses, and so on, whereas before releasing fear, there was merely one Solar System-the ego.\\nAnd so, the cycles continue, but where do they end? What happens after we traverse multiverses? Is there a designer? Multiple designers? Are they wondering when we will begin to ponder their existence?\\nIf Nassim Haramein’s model is correct, there is no ending. The fractal can be drilled down in either direction. Density is irrelevant.\\nVideo-Nassim Haramein 2015 The Connected Universe \\nMore Information on Nassim Haramein’s Fractal-Holographic Universe .\\nSomething to ponder… We are all dreamers dreaming the dream, so why not make it a loving one?\\nWe ALL have the opportunity to raise our frequency, step into these new algorithms of Light and integrate them into our resonate fields. It merely requires dropping fear and embracing Love. Forgive. Be more kind to people.\\nLove & Light,\\nAlexa Person\\nAlexa Person is and Alchemist of Light, an author and a professional speaker. Born “awake” and gifted with the full spectrum of clairvoyant gifts, Alexa is committed to shifting individuals into a higher alignment of their own Divine Male-Female frequency. Her regular public speaking engagements include her work as a Medium and a Certified Akashic Records Consultant. alexaperson.com \\nSource: In5D \\n'"}, "time": 1742562797.8666027}