{"duration": 0.08423852920532227, "input_args": {"text": "'Employees at a Florida McDonald’s have redecorated their restaurant in blue for National Police Week after backlash from the community for removing the decorations. [Workers originally put up blue ribbons and blue stripes throughout the McDonald’s on North Orange Avenue in Green Cove Springs to honor local police officers for National Police Week but took the decorations down because of an order from the McDonald’s corporate office, WJXT reported.  Someone apparently filed a complaint with McDonald’s corporate office, which responded that the store could not keep up the display due to the company’s “no sign rule” barring decorations inside the store. The employees complied with the corporate office’s decision, although they were not happy about it. Customers at the Green Cove Springs McDonald’s were also unhappy with the decision. “I think it’s cruel for people to do things like that,” customer Mary Tillman said. “I think we live in a time where we let political things get in the way of what really matters and I think the whole purpose of this is to honor those fallen officers,” Chandler Steele, another customer at the store, said. WJXT reached out to McDonald’s corporate headquarters, which responded that “the McDonald’s in Green Cove Springs is locally owned and operated” and declined to comment any further on the matter. Employees told the news station Monday evening that they received permission to put the blue decorations back up, although it was not clear whether corporate decided to allow it or if the local owner approved of the decision. A spokesperson for the Green Cove Springs Police Department said the McDonald’s had always supported law enforcement. National Police Week runs from May   21 this year, according to the event’s website. Other Florida McDonald’s locations have supported law enforcement in the past. On National Law Enforcement Appreciation Day back in January, all Florida stores gave law enforcement officers a free Extra Value Meal to thank them for their service.'"}, "time": 1742563498.5528073}