{"duration": 0.04740476608276367, "input_args": {"text": "'On Monday’s broadcast of CNN’s “New Day,” House Freedom Caucus Chairman Emeritus Representative Jim Jordan ( ) argued that the latest Obamacare bill isn’t a repeal of Obamacare, but is “a pretty darn good bill” and “the best bill we can get out of the House. ”  Jordan said that he thinks the bill will get a vote this week, adding, “I feel this is a pretty darn good bill that we made better because we engaged in this debate. I think that the tax increases are gone right away. The Obamacare tax increases are now gone right away in this bill.   adults in the Medicaid expansion population, there’s now a work requirement for them. And this waiver option that states can seek to get out from under those key Obamacare regulations that are driving up premiums for   families, I think when you look at those, this is the best bill we can get out of the House. But frankly, we should be clear, this is not repeal of Obamacare. If it was repeal, you wouldn’t need the option for a waiver option for states to seek. So, we have to be clear with the voters about that, and continue to work on it. ” Jordan later said that the bill isn’t a complete repeal of Obamacare, but is a “good step, and it’s —  I think —  the best step. ” He added that “States can get out of some of the regulations that are driving up premium costs.   conditions —  as the president mentioned —  is specifically covered in the legislation. And there’s $125 billion of taxpayer money that goes to the states to make sure there’s that safety net provision that we call   pools available for states to use. They have to have that set up first before they can actually seek the waiver. ” Jordan further stated, “If you maintain continuous coverage, you can’t lose coverage and coverage can’t be jumped up to a higher rate if you have some tough illness happen to you or your family. That is clear. What we’re trying to do, is reward responsible behavior. You maintain coverage, that’s the right thing to do. You don’t get bumped up because something serious happens to you or your family. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742564379.3881326}