{"duration": 0.08452296257019043, "input_args": {"text": "'  5 Things America Can Learn From Hungary’s Resistance Against The Migrant Masses 5 Things America Can Learn From Hungary’s Resistance Against The Migrant Masses \\nThe PAPRIKA PLUTOCRAT is a spicy capitalistic Hungarian blogger. Follow his unyielding assaults against Cultural Marxism on his blog, paprikaplutocrat.com November 10, 2016 Politics \\nOn the 2 nd of October Hungary has seen a stunning manifestation of national unity, as 98% of votes cast on a referendum regarding the EU-imposed migrant settlement quotas were declared a strong and undebatable no. Now the Hungarian national parliament works at incorporating the referendum results as an amendment to the country’s constitution. While some left-wing news outlets—like the Guardian—celebrated the supposed inadequacy of the referendum, it is beyond dispute that the message of the voting is strong and firm. \\nHere are five lessons we can learn from this monumental stand against globalism. 1. Democracies Need Strong Leaders \\nWimpy western politicians would have their voters believe that personality does not matter. Strong, witty, and masculine politicians are often depicted as exponents of a “fascistic personality cult.” Nowadays, it seems, not much distinction is made between being a macho and being a Nazi. \\nIn reality, all great western democratic leaders were strong men—and sometimes women. Winston Churchill, Charles de Gaulle, David Ben-Gurion, Ronald Reagan and Margaret Thatcher were not known for being timid, politically correct politicians who would retract and apologize for every past comment that they’ve made. Do you think that today’s EU politicians and Western leaders could have beaten Hitler or won the Cold War? \\nHungary’s Viktor Orbán might have some faults, but he is certainly not a shy and weak politician who lacks magnetism. Even his opponents will grant him that he has a rare political talent and an almost visionary skill for seeing future happenings: think of how one year ago Hungary was the first European country to build a wall to keep the migrant wave out. Today, most countries—from Austria to Great Britain—follow his lead. \\nJust listen to his 15 th March, 2015 speech (made on Hungary’s national holiday commemorating the country’s 1848 freedom fight against the Habsburgs). Look at how he is standing in the rain, without some guy holding an umbrella over his head. This man has speaking skills, grand views, and balls: \\nThe idea that Western democracies can function with leaders who “have the charisma of a damp rag and the appearance of a low-grade bank clerk”—to quote Nigel Farage who has so sharply put it to Herman van Rompuy—is a lie and has no foundation in reality. Democracy is about the masses; the masses need inspiration and leaders; democratic leaders therefore have to be strong and need game themselves. \\nI am personally a friend of monarchies, and I have libertarian arguments for it; but as long as the western world believes in democracy, we cannot have cucks and wimps protecting it. 2. Liberty Is Protected By The Right-Wing \\nAnyone who believes in game enjoys the fruits if Western liberal capitalism, like it or not. Yes, the modern world has its faults, but freedom of speech, freedom of sex life, freedom of entrepreneurship and freedom of travel are all essential parts of our lifestyle. Of course, these are tenets that the left hates today; in fact, if you want to live free and live a masculine lifestyle, the “liberalism” of today is certainly not your friend. \\nTherefore I’m going to write about “liberty,” and not “liberalism.” One can debate the difference between these terms; in short, what I mean is that the left today doesn’t want you to be free, but wants a politically correct nanny state to control and plan every move you make, and punish you if you do not oblige. \\nThe right, however, still stands for the basic concept of personal liberty that we have grown to love and respect. Hungary has been criticized a lot by left-wing groups for having curbed some freedoms; I will agree that some of these state actions were unnecessary and hardly defensible. But Hungary—and Eastern-Europe—today still has more freedom than some corners of the oh-so-liberal-and-tolerant Western world. \\nIn Hungary, universities rarely propagate the debased agenda of social justice wars; cultural Marxism is regularly attacked and barely tolerated; feminism is rare and marginal, and the country is, overwhelmingly, conservative and right wing (the governing party with two-thirds of parliamentary seats is centre-right, the largest opposition party is openly far-right). In the capital city of Budapest, one of the best and cheapest cities for night-life and gaming in Europe, you will certainly not be prosecuted for stopping hot girls and asking for their number—unlike some Western cities. 3. Minorities Are Misled \\nThe Hungarian press—much outside of the view of the grand world, due to our rarely known and complicated language—has been in throes for the past few months about the migrant crisis. Like most Eastern European countries, Hungary barely has any immigration or Muslims. In fact, if there’s a black person on the street, people will often turn their heads. \\nDebates that have been present in the Western media—about Muslim integration, terror and Islam, “Palestine” and Israel— have only recently surfaced in the Hungarian press. Minorities, of course, have been misled by the left-wing press into believing that the migrants were “refugees,” “poor victims whom he have a responsibility to assist.” The Jewish press (meaning official Jewish congregation organs, not conspiracy theories) and LGBT groups voiced their concern for tolerance and non-violent communication. \\nIt is probably not a grand revelation to most readers of this site that Muslim immigration brings little good to minorities. As Milo Yiannopoulos said in a lecture of his, the Muslims are “not on top of the oppression ladder, but they want to kill all the others on the oppression ladder.” Minorities have been misled into following the agenda of the political left; the sight of Hungary’s gay public personalities demonstrating for letting in Muslims in front the parliament is a clear proof of this. 4. Feminists Love Islam \\nFeminism in Hungary is a rare bird, but it does exist. One such radical Marxist-Feminist made the news when she openly argued that there could be “no terrorists among Muslim refugees”; this, of course, was before the Paris and Brussels attacks, many of the perpetrators of which arrived as “refugees” through Hungary. A few days ago I stumbled across the Facebook page of another fine specimen: this hardly attractive girl celebrated the “empowerment” of the hijab which, according to her, was a beautiful expression of female’s voluntary decision to defy the dating market. \\nDescribing such violent and shameful oppression of people as “voluntary self-empowerment” is crazy. Feminists live in denial of facts, and the recent alliance between crazy radical Islam and Marxist Feminism only proves that neither has any love for Western culture. 5. Eastern Europe Is Still OK \\nThe Western media gleefully celebrated the fact that with a voter turnout of a little more than 40%, the 50% limit of required turnout was not reached. According to Hungarian laws however, a referendum with 25% or more electorate turnout is valid, even if not politically binding. The Hungarian government will soon amend the constitution to declare that Brussels cannot force the country to take in immigrants without the consent of the people. \\nSuch a policy is clear and sound. The message is that Eastern Europe—with all its faults, economic lagging and sometimes real intolerance—is still a better place to live for masculine men that many a place in the western world. Here masculine lifestyle is appreciated, Donald Trump has grand support—even Viktor Orbán voiced his good wishes for the Republican president-elect—and feminism has failed to win any serious ground. \\nEastern Europe is still not lost, and Hungary is certainly among the best options for men of game today.'"}, "time": 1742628432.0029724}