{"duration": 0.016329288482666016, "input_args": {"text": "'The Xbox One port of Funcom’s fantasy survival simulation Conan Exiles will not feature a “penis slider” in the character creation tools. [If you’re feeling a wee bit insecure about your prospective Xbox barbarian, I have some bad news. Microsoft is reportedly forcing the creators of Conan Exiles to castrate the character creation system in the upcoming port of their popular survival game. No, you will not be able to ensure you are as   (or not) as you imagine your shirtless savage should be. In fact, you very well might not have a visible penis at all.  Funcom Creative Director Joe Bylos said that “Xbox has been pretty clear with us that it’s not going to fly. ” Even so, there remains hope that the oily, burly manly men of the greater Cimmerian zip codes won’t be entirely neutered. According to Bylos, “It’s just going to be off by default I think. I don’t know if partial nudity might be OK. ” He’s a little bit more hopeful for the continued existence of bare breasts, but the developers “haven’t spoken to Xbox” about them specifically. “They do allow breasts in some of their games, but the penises definitely won’t be there. ” The game is already facing a possible ban in Japan due to the depiction of uncensored genitalia, but they “haven’t heard anything” definitive yet from the region. Bylos played coy about the popularity of the game’s naked avatars, expressing surprise at “the attention, the viralness[sic]” of the game’s customizable full nudity. He claims that the developers thought that players “would just sort of see it and laugh and move on,” in clear defiance of all known laws of the Internet. To be fair, we don’t definitively know that any of them have used the Internet before. Will the team be forced to tuck, or will the offending members be removed entirely? For now, the fate of their collective virtual manhood rests firmly in Phil Spencer’s hands. Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742628590.6993876}