{"duration": 0.051474571228027344, "input_args": {"text": "'Follow on Facebook Print This Post \\nIMRAN GASHKORI | Sports Editor | \\nAs excitement for summer cricket builds, Wynnum father Chris Richards has honed his preparation, taking 7 wickets in a “frightening” spell yesterday. \\n“They were coming out perfectly,” the 36-year-old said between celebratory beers. The Australian tradition of backyard cricket has gotten much more competitive in recent years. PHOTO: Supplied. \\n“Warnie always said one brings two… In this case I went further,” he said. \\nThe full-time landscaper took the wickets of his three kids (aged 5, 8 & 13) as well as his wife (32) and two kids from down the street (ages unknown). \\n“I was a pretty talented junior but my best was only three or four for,” he said. \\nRichards claimed the scalps in just four overs on his 16-meter backyard pitch aided by generous electric wickie rules and the controversial one-hand-one-bounce law. Richards vehemently denies that he tampered with the ball, despite half of it being covered in a mysterious tape for the duration of the match. PHOTO: Supplied. \\nHowever, video has emerged of Richards allegedly tampering with the ball with what seems like red electrical tape. \\n“The tape was already on the ball before we started playing. That’s well within the rules,” he said. \\nNeighbours described his spell as “frightening and intense” but added numerous dismissals were through the six-and-out by-law. \\nIn addition to his economical and wicket-to-wicket line-and-length bowling style, Richards also used an impressive array of sledges and other psychological tactics to get under the skin of the opposition team. \\nHis daughter Kayla explains. \\n“Dad would dip one in short and I’d have to dive out-of-the-way,” she said. \\n“Every time I tried to dodge the short balls, he’d call me a poofter, which doesn’t make any sense to me,” \\nDespite the criticism levelled against him, Richards has lashed out at his detractors. \\n“You don’t hear Johno (Mitchell Johnson) whinge about how he takes ’em” the one-time 3rd grader said. \\n“I’m already growing the mo’ so I can steam in with him when The Ashes start.” \\n“I played it smart. Me boy Jacob (aged 8 ) Is a pretty timid kid. I knew after knocking over Darcy (aged 5) with a full toss that he would be pretty nervous at the crease. I banged the first one in short to get him backing away. He was a frightened rabbit after that. All I had to do was put the next one on the stumps. Seven balls later I had his wicket.” \\nWith additional reporting from the Wynnum Advertiser. \\n2 Responses to \" Brisbane Dad Takes 7 Backyard Wickets In “Frightening Return To Form” \" Greg July 6, 2015 at 5:08 pm \\nBest one yet boys, keep it up'"}, "time": 1742562233.987079}