{"duration": 0.15025687217712402, "input_args": {"text": "'WASHINGTON  —   In President Trump’s world, boring is disruptive. After   weeks of gleefully setting the Washington establishment ablaze and declaring a new war with virtually every public utterance, Mr. Trump took the radical step on Tuesday night of delivering a soothing comfort food of an address to a jittery Congress and skeptical public. For the first time since his   in January, Mr. Trump seemed to accept the fetters of formality and tradition that define and dignify the presidency. And while he touched on all of the   elements of the economic nationalist agenda that has impelled his executive orders and calls for “revolution,” Mr. Trump brandished a blunter rhetorical ax and, for once, delivered on his promise to speak the Reagan Republican dialect of optimism and reconciliation. Why the sudden shift? Numbers. Mr. Trump’s approval rating is the worst for any new president in recorded history  —   between 38 and 50 percent at a time when many presidents are in the 60s. Slamming the news media or   demonstrators energizes his base, but it’s hard to move much higher in the polls without making a less partisan pitch. The other key statistic spurring his    adjustment: $54 billion, the amount of federal funding he hopes to siphon from other departments to increase spending at the Pentagon  —   a budget proposal that is already   on arrival, judging from its lukewarm reception on Capitol Hill this week. Presidents, even those commanding comfortable majorities in both houses, need to get Congress in line, and the only way to do that is to declare peace. Here are five takeaways from the most presidential speech Mr. Trump has ever given  —   delivered at precisely the moment he needed to project sobriety, seriousness of purpose and  . The   between Tuesday’s temperate Mr. Trump and the everyday Mr. Trump was striking, to put it mildly. “The time for trivial fights is over,” said Mr. Trump, a man who spent the first 48 hours of his presidency bickering about the size of the inauguration crowd. While that statement was meant as a challenge to his establishment critics, it also seemed as if he were coaching himself. All of the previous   speeches delivered by Mr. Trump, from his nomination address in Cleveland last summer to his   inaugural speech, had a gloomy,    quality. His aides promised a Ronald   invocation of America’s future in the days leading up to his  . What he delivered, thanks to his speechwriting team of Stephen Miller and Stephen K. Bannon, was an invocation of “American carnage. ” Since his   Mr. Trump roved the airwaves and Twitter, lashing out at anyone who opposed him, and many people who didn’t. In just the past couple of weeks, the president has reiterated his description of some news outlets as “enemies of the American people,” while taking his shots at Paris, Sweden, Hill Democrats, the F. B. I. government leakers, President Barack Obama and his own communications staff, among other targets. But on Tuesday, the president rolled the dice, and went for nice. In style, if not substance, Mr. Trump delivered an address that nearly any of his Republican primary opponents  —   whom he once savaged as establishment stooges  —   might have delivered had they been standing at the rostrum. “That torch is now in our hands,” Mr. Trump said within the first few minutes of his speech, echoing, if not entirely approaching, the wispy mountaintop oratory of more polished predecessors like Mr. Obama and Mr. Reagan. “And we will use it to light up the world. I am here tonight to deliver a message of unity and strength, and it is a message deeply delivered from my heart. ” Mr. Trump has made immense progress sticking to a script, but Wednesday is a new day, and the presidential Twitter finger gets itchy in the middle of the week. The big question is whether his unifying tone represents the mythical,   pivot point  —   or was just part of a   speech efficiently delivered by a gifted politician learning his new trade. Mr. Trump has been criticized for his sluggish response to violence and vandalism against Jews, blacks and Muslims during his presidency. But the opening words of his speech were dedicated to tolerance and inclusion. “Recent threats targeting Jewish community centers and vandalism of Jewish cemeteries, as well as last week’s shooting in Kansas City,” he said, “remind us that while we may be a nation divided on policies, we are a country that stands united in condemning hate and evil in all of its very ugly forms. ” Again, it’s hard to say if his statement reflected a genuine change of approach. Mr. Trump and some allies have suggested that recent   episodes might be   attempts by his opponents to embarrass him. But his words were welcomed in the House chamber, greeted by some of the most sustained applause of the evening. The polls have not been especially kind to Mr. Trump lately, but there is one distinct bright spot: 56 percent of voters in a   Consult poll released on Tuesday said that Mr. Trump was following through on his campaign promises. This is no small matter for a president eager to prove he’s no mere talker. For all its messaging, personnel and operational struggles, Mr. Trump’s team has relentlessly executed a branding strategy aimed at projecting the image of a man of action fighting against gridlocked and corrupt Washington elites. Every day, Mr. Trump appears before the cameras where he is shown doing stuff like signing executive orders or convening panels of business, labor or political leaders. “It’s been a little over a month since my inauguration, and I want to take this moment to update the nation on the progress I’ve made in keeping those promises,” he said, taking an extended bow for saving jobs at several factories across the country, renegotiating defense contracts, scrapping the   Partnership, greenlighting two new fuel pipelines and cracking down on illegal immigration and criminal foreigners. Never mind that Mr. Obama, the man Mr. Trump says left him “a mess” to clean up, had accomplished much more at this point in his term  —   including the stimulus package and a gender   law. For all his newfound civility and message discipline, Mr. Trump cares most about this takeaway  —   proving he is an effective president at a time when his administration is being portrayed in the media as   adrift and  . The president’s speech had admirable length (it clocked in at just over 60 minutes) the requisite number of ovations, about 90, and a succession of punchy pronouncements. What it didn’t have was very much of an explanation on how Mr. Trump plans to govern. There were hardly any details about his proposals on the   items that will most likely define his first term. That included his Obamacare    pledge, his plan to overhaul the tax code, the big infrastructure package he’s vowed to ram through, or even his plan to shovel $54 billion into the Defense Department. Cracking down on illegal immigration is the central pillar of Mr. Trump’s   popularity with white   voters, so much so that it was the subject of his most decisive action thus far as president: the bungled rollout of his executive order barring migrants from seven predominantly Muslim nations. But Mr. Trump and his team sent out some seriously mixed messages in the hours leading up to the address. “We will soon begin the construction of a great, great wall along our southern border,” Mr. Trump declared, to the delight of many Republicans in the hall, who gave him a hearty standing ovation. But earlier, in a   with some of the country’s leading news anchors, the president seemed to soften his stance considerably, as he has done previously in private, suggesting that legal status be granted to millions of undocumented immigrants who have not committed serious crimes. Immigration   led by his attorney general, Jeff Sessions, have long considered such a stance “amnesty. ” Mr. Trump never brought up the topic again  —   and didn’t touch on his prior reference to legalizing undocumented immigrants  —   raising questions about what position he’ll stake out in negotiations with Congress.'"}, "time": 1742563101.327997}