{"duration": 0.06512975692749023, "input_args": {"text": "'Donald Trump pide que le encadenen en el sótano de la Casa Blanca durante la superluna \"HAY UN TRUMP QUE NO QUIERO QUE CONOZCÁIS\", HA DICHO superluna \\nAsegurando que es “lo más seguro para los ciudadanos y para mí mismo”, el nuevo presidente de los Estados Unidos, Donald Trump, ha pedido al servicio secreto que lo encadene en el sótano de la Casa Blanca durante la noche de hoy “y hasta que la superluna desaparezca”. \\n“La coincidencia temporal de mi presidencia y de la mayor y más brillante Luna desde 1948 y hasta 2034 no es casualidad”, ha declarado Trump desde la Casa Blanca minutos antes de ser encadenado en una de las dependencias subterráneas de la Casa Blanca, según han informado la CNN y el New York Times a última hora de la tarde. “Pedir que me sujeten con cuerdas y me ajusten en la cara un bozal de plata es completamente normal, no es necesario alarmarse”, ha explicado. \\n“Un mal que ni siquiera yo puedo controlar está despertando en mí, pero podéis estar tranquilos”, ha dicho. \\n“Si os parezco racista no queráis saber cómo soy cuando hay una luna como la de esta noche”, ha declarado el presidente. Según dice, durante la noche de hoy tendrán lugar ciertos “cambios fisiológicos probablemente reversibles y sin conssecuencias” en su persona. \\n“Un Trump que no conocéis está a punto de ser desatado pero si estoy bien encadenado no sucederá nada que haya que lamentar”, ha explicado el propio Trump. \\n“Ya viene, el otro Trump ya viene y tiene hambre”, ha insistido al notar que su peinado se agitaba como si tuviera vida propia. El líder republicano, que derrotó a Clinton en unas tensas elecciones presidenciales, ha querido dejar claro que lo que vaya a ocurrirle hoy “no es peligroso y es absolutamente rutinario”, aunque ha advertido al Servicio Secreto que si esta noche logra escapar del sótano le disparen sin dudarlo. \\n“Desatadme por la mañana si sigo vivo”, ha concluido Trump. \\nEl servicio secreto ha advertido a los americanos que si escuchan quejidos, insultos y comentarios misóginos procedentes del sótano del 1600 de Pennsylvania Avenue no se asomen y sigan encerrados en sus casas hasta el amanecer.'"}, "time": 1742562153.750667}