{"duration": 0.1255497932434082, "input_args": {"text": "'Sen. Cory Booker’s attack against Sen. Jeff Sessions was “disgraceful,” “” and motivated by political ambition, says Arkansas Senator Tom Cotton. [.@CoryBooker attacks on Jeff Sessions are so   I   his   friend   to be next witness.  —   Tom Cotton (@SenTomCotton) January 11, 2017,   Cotton’s tweet refers to what has been described as Booker’s “imaginary friend. ” As National Review reported in 2013, Booker “invented a street character” named   whom he frequently mentioned in his campaign stump speeches “for dramatic effect. ” “The central character in one of Booker’s   stories  —     the drug pusher who the mayor has said threatened his life at one turn and sobbed on his shoulder the next  —   is a figment of his imagination,” National Review wrote. In a separate social media post, Cotton characterized Booker’s transparent political opportunism, testifying against his colleague to further his own “presidential aspirations,” as “disgraceful. ” “I’m very disappointed that Senator Booker has chosen to start his 2020 presidential campaign by testifying against Senator Sessions,” Cotton wrote on Facebook. “This disgraceful breach of custom is especially surprising since Senator Booker just last year said he was ‘honored to have partnered with Senator Sessions’ on a resolution honoring   marchers. ” Cotton continued: Senator Booker says he feels compelled to speak out because Senator Session wants to keep criminals behind bars, drugs off our streets, and amnesty from becoming law. He’s welcome to oppose these   policies and vote against Senator Sessions’s nomination, but what is so unique about those views to require his extraordinary testimony? Nothing. This hearing simply offers a platform for his presidential aspirations. Senator Booker is better than that, and he knows better. Cotton’s claim that Booker’s decision was motivated by his own political aspirations was echoed throughout the beltway. NBC’s Joe Scarborough noted that there was “a collective groan” —   and Democratic lawmakers, in particular, were “irked” —   as they watched Booker’s “obviously calculated” decision to “launc[h] his bid for the 2020 campaign” before the Senate Judiciary Committee. NPR’s Cokie Roberts described the maneuver as “ ”. Here’s how you know Cory Booker wants to run for president in 2020 https:  .   —   Washington Post (@washingtonpost) January 11, 2017,  The first press conference of the 2020 Iowa caucuses pic. twitter.   —   Dave Weigel (@daveweigel) January 11, 2017,  Sen. Booker just declared he’s running in 2020 by smearing Sen. Sessions. Stay classy, liberals.  —   Brent Bozell (@BrentBozell) January 11, 2017,    Ever shorter Cory Booker: #Booker2020. https:  .   —   David French (@DavidAFrench) January 11, 2017,  Booker’s opposition to Sessions is a fight that pits an established corporatist against a committed populist —   in that “one of Wall Street’s favorite senators [Booker] [is] attacking one of Wall Street’s least favorite [Sessions],” notes the Washington Examiner’s Tim Carney. Carney writes: The top recipient of money [in the 2014 midterm election] from the financial sector was Sen. Cory Booker, who pocketed $4. 5 million from financial executives and PACs. Within that sector, Booker dominated among cash from real estate developers (almost 50 percent more than the Senate  ). He also dominated in Wall Street money. Carney reports that Booker’s support for the policies of his corporatist donors has been  .   publications, Carney notes, have described Booker as “disturbingly tight with Wall Street and entrenched financial interests” —   a politician who “shares a worldview with the financial elites who fund his campaigns,” and who “represents the interests of both Wall Street and Silicon Valley. ” By contrast, Sessions is   as the intellectual   of the conservative   populist movement that emphasizes the need to enact an agenda that puts the interests of American workers first. Sessions, Carney writes, has clashed with the Silicon Valley tycoons and “Wall Street titans who have bankrolled Booker’s rapid rise” —  most notably, on the issue of immigration, where Sessions has pushed for policies that prioritize the job and wage opportunities of working Americans over corporatists’ desire for cheap labor. In recent months, Cotton has seemed primed to take up Sessions’ mantle as the leader of this populist movement in the Senate. In particular, Cotton has become a vocal champion for American workers of all backgrounds against the     policies lobbied for by corporate special interests and advanced by Washington politicians like Cory Booker, who represent the interests of the donor class. In a New York Times   last month, Cotton wrote:   Trump now has a clear mandate not only to stop illegal immigration, but also to finally cut the   influx of   immigrants that undermines American workers  …     For too long, our immigration policy has skewed toward the interests of the wealthy and powerful: Employers get cheaper labor, and professionals get cheaper personal services like housekeeping. We now need an immigration policy that focuses less on the most powerful and more on everyone else  …     In some quarters, proposals like these invoke cries of “nativism” and “xenophobia. ” But recent immigrants are the very Americans who have to compete with new immigrants for jobs. Far from being   this proposal would give recent arrivals a better shot at higher wages, stable work and assimilation. Following Cotton’s clarion call for an immigration policy that benefits American workers, the Center for Immigration Studies’ Mark Krikorian wrote a piece titled “Immigration: As Sessions Moves On, Cotton Steps Up. ” In the post, Krikorian assured voters that as Sessions, Congress’s tireless advocate for an America First immigration policy, departs the Senate to join the incoming President’s cabinet, American workers should “fear not” as “Tom Cotton has reported for duty. ”'"}, "time": 1742563258.5210862}