{"duration": 0.06984972953796387, "input_args": {"text": "'Comments \\nAfter the reignition of the Hillary Clinton ’email scandal,” the polls indicate that 63% of Americans still don’t give a damn about Hillary Clinton’s emails. \\nThe House Republicans’ final gambit is the worst example of grasping at straws, and only days later yet the American people are signaling that yet another attempt to revive the Clinton email non-scandal has failed, miserably. \\nRecent reports say 21 million early votes have already been cast in this year’s election, which represents roughly 1/6th of the total cast in the 2012 general election and none of those votes will be impacted by the FBI Director’s memo. \\nToday, The Guardian reports that voters’ minds are already mostly made up about Clinton’s emails, and recent disclosures are having more impact among Republicans and other groups already not pre-disposed to vote for the Democratic nominee. \\n“About a third of likely voters say they are less likely to support Clinton given FBI director James Comey’s disclosure,” said pollster Gary Langer . “Given other considerations, 63% say it makes no difference.” \\nMany loyalists are convinced the latest trove of emails, discovered on equipment shared by Clinton aide Huma Abedin and her estranged husband Anthony Weiner, are an irrelevance. Even if some show more classified information passed its way through the private server, it should not change the FBI’s earlier decision that a criminal charge would be unfair without evidence of intent or coverup. But so long as this is not categorically established, there may be a nagging doubt in some minds that the FBI suspects otherwise. \\nVermont Senator Bernie Sanders destroyed the issue of Hillary Clinton’s emails early in the Democratic primary campaign, noting that they’re a giant pile of minutiae and that the American people are more concerned about economic fairness, trade policies and the corrosive effect of Citizens United on our politics. Famously, he said: \\nLet me say something that may not be good politics, but the Secretary is right. People and America are sick and tired of hearing about your damn emails. \\nThe American people aren’t buying Trump’s lies about the FBI Director’s vague memo – written entirely without actual facts – signifies anything other than a DC game being played by House Republicans. Even CNN’s New Day plainly says at the start of this video plainly that, “Trump is Lying.” \\nRepublicans are in familiar territory after having run a divisive and needlessly incendiary political campaign this year, and stuck focusing on literally any little thing they can find about the Democratic nominee to distract voters from the real issues. \\nIt didn’t work during primary season and it’s not likely to work now. \\nWatch Bernie Sanders debunk the Republican email spin machine in one minute here:'"}, "time": 1742564139.3681586}