{"duration": 0.12658929824829102, "input_args": {"text": "'We Are Change \\nA month ago, this writer told you about an ongoing conflict within the FBI that was validated by online and personal sources concerning the outcome of the Clinton investigation. Now it’s been revealed that the FBI has been flooded with resignations letters by disenfranchised agents ever since Comey decided last July not to indict Hillary Clinton. Comey’s now attempting to save face has reopened the investigation into Hillary Clinton’s private server claiming that the FBI has now found an additional 650,000 email messages on Anthony Weiner’s laptop, ten thousand of which were found were in a folder called “Life Insurance.” Things are boiling up for the Clinton campaign, what an October surprise!\\n10,000 new emails found on Huma Abedin and Anthony Weiner\\'s computer and phones. They were in a file marked \"Life Insurance\". #Corruption \\n— Morgan Brittany (@MorganBrittany4) October 29, 2016 \\n\\nWeiner is under investigation for sending sexually explicit pictures and material to a 15 year old girl and it drags Hillary’s campaign and chances of presidency with it..\\nHuma Mahmood Abedin, recently divorced from Weiner, has worked with Hillary Clinton since 1996, where she began as a white-house intern She quickly grew her political career to the position of vice chairman of the Hillary campaign.\\nWhat could be found on Huma Abedin and Anthony Weiner’s laptop?\\nA source has a guess at what may potentially be found on Huma Abedin and Anthony Weiner’s computer: Huma’s long-speculated ties to the Muslim Brotherhood , something that U.S. Representative Michele Bachmann asserted in 2012 when she accused Huma Abedin of being a mole for the Muslim Brotherhood . Bachmann then said during a live broadcast interview that “the infiltration of our government is much wider than anyone expected.”\\n“It appears that there has been deep penetration in the halls of our United States government by the Muslim Brotherhood,” Bachmann stated during a radio interview. “It appears that there are individuals who are associated with the Muslim Brotherhood who have positions, very sensitive positions, in our Department of Justice, our Department of Homeland Security, potentially even in the National Intelligence Agency.” \\n~U.S. Representative Michele Bachmann, said.\\nHuma actually hasn’t been shy about her potential connection to the brotherhood, earlier in 2016 she confirmed that her Muslim Brotherhood-connected mother Saleha Mahmoud Abedin was proud of her .\\nSaleha Mahmoud Abedin was identified in 2011 as one of 63 suspected leaders inside the Muslim Sisterhood. \\nWell we are about to truly find out what was on the laptop of Huma Abedin as the FBI as of Sunday filed for the warrant needed to begin looking through the emails.\\nAgain my source asserts that, “Huma Abedin was copying emails and printing them and she was labeled a threat by the FBI in it’s own report about the Clinton investigation.” \\nHuma herself said in an interview this week with a podcast that she has yet to read the emails she exchanged with her longtime boss, Hillary Clinton, but that she is “mortified” by what may be in them.\\n“Terrifying,” is how Abedin described the existence of the records in the public domain during an interview on the “Call Your Girlfriend” podcast.\\n“I confess I have not read anything that has become public,” Abedin, said.\\nComey has jumped on this chance to right his wrongs, seizing an opportunity to save his own career and reputation as well as the FBI’s reputation which, according to a source, has been tarnished. Agents are not happy about the outcome and conduct of the former Director, including some agents that have decided enough is enough and are resigning in droves .\\nThe FBI director has been embroiled in an inside fight against his own agents worried about internal leaks. Comey said it himself in his reasoning for announcing the re-opening of the Clinton email investigation.\\nEx-FBI Assistant Director of New York, James Kallstrom weighed in on Comey’s actions calling the Clintons a crime family . Kallstrom also acknowledged the fact that agents were rebelling within the ranks including senior agents. \\n“The agents are furious with what’s going on, I know that for a fact,”\\n‘The Clintons, that’s a crime family. It’s like organized crime, basically. The Clinton Foundation is a cesspool,” \\n~former FBI, assistant director, James Kallstrom , said.\\nKallstrom additionally told Fox’s Judge Jeanine Pirro, “I think there is something happening, I think something big is going to happen,” when confronted with the question on why Comey chose 2 weeks before the election to announce the re-opening of an investigation, politicizing the investigation.\\n\\nKallstrom made sure to not leave out that it was the higher power of the FBI to blame and not the field agents who were involved in the overall investigation into the Clintons server.\\nMeanwhile several FBI field offices and U.S. attorneys are busy investigating and collecting evidence on the Clinton Fraudation. The investigation backed by none other then the Assistant U.S. Attorney for the Southern District of New York, Preet Bharara, who is also investigating Anthony Weiner, who authorized the warrants for the devices to be seized. That means that Preet Bharara is behind both cases on the Clintons – the investigation into the Clinton Fraudation , in which Bharara is leading NY, DC, and Texas branches of the FBI’s investigation into the Clinton’s long time fraud vehicle the “Clinton Foundation”. The Clinton Fraudation investigation was started when Terry Mccauflife was linked to the Clintons and the Chinese mob .\\nWikileaks has proven that the Clinton foundation is basically a large money-laundering operation sprinkled with a bit of fraud thanks to Doug Band. Although hacked documents can’t be used for prosecution the new Wiener emails may be identical copies of Huma’s emails that have been leaked in Wikileaks releases, and if it’s true that she printed out copies she could face charges. Additionally there may be evidence of pay-to-play in Huma’s emails as well as fraud, or potentially her ties to the Muslim Brotherhood. We will have to wait to see; stay tuned to WeAreChange for your coverage and analysis of the most eventful election cycle in American history. If what the birds are chirping is true. Is there anything that won’t happen in this election?\\n#WikiLeaks : Clinton aide details $50M in payments for @BillClinton and how business was mingled with the @ClintonFdn https://t.co/0jhYJkDT0x \\n— Chad Livengood (@ChadLivengood) October 27, 2016 \\n\\nJudge Jeanine : “So he wouldn’t have come out unless he knew it was coming out?”\\nJames Kallstrom: “ Well, I think he couldn’t hold onto it any longer. OK. Because who knows? Maybe the locals would have stepped in on this.”\\nJudge Jeanine: ” …I think he had to do it.”\\n \\n \\nThe post FBI Rebels, Huma Abedin “Insurance File” Found On Seized Laptop 10,000 EMAILS appeared first on We Are Change .\\n'"}, "time": 1742563348.1441247}