{"duration": 0.11083650588989258, "input_args": {"text": "'How did the “growing trust” that Russian President Vladimir Putin once said marked his “working and personal relationship with President Obama ” change into today’s deep distrust and saber-rattling?\\nTheir relationship reached its zenith after Mr. Putin persuaded Syria to give up its chemical weapons for verified destruction, enabling Mr. Obama at the last minute to call off, with some grace, plans to attack Syria in late summer 2013. But at an international conference in the Russian Black Sea resort of Sochi last week, Mr. Putin spoke of the “feverish” state of international relations and lamented: “My personal agreements with the President of the United States have not produced results.” He complained about “people in Washington ready to do everything possible to prevent these agreements from being implemented in practice” and, referring to Syria, decried the lack of a “common front against terrorism after such lengthy negotiations, enormous effort, and difficult compromises.”\\nA month earlier, Russian Foreign Minister Sergey Lavrov , who chooses his words carefully, told Russian TV viewers, “My good friend John Kerry … is under fierce criticism from the U.S. military machine. Despite [Mr. Kerry’s] assurances that the U.S. commander in chief, President Barack Obama, supported him in his contacts with Russia (he confirmed that during his meeting with President Vladimir Putin) apparently the military does not really listen to the commander in chief.”\\nDo not chalk this up to paranoia. The U.S.-led coalition air strikes on known Syrian army positions killing scores of troops just five days into the September cease-fire — not to mention statements at the time by the most senior U.S. generals — were evidence enough to convince the Russians that the Pentagon was intent on scuttling meaningful cooperation with Russia.\\nRelations between the U.S. and Russian presidents have now reached a nadir, and Mr. Putin has ordered his own defense ministry to throw down the gauntlet. On Oct. 6, ministry spokesman Maj. Gen. Igor Konashenkov said Russia is prepared to shoot down unidentified aircraft — including any stealth aircraft — over Syria, and warned ominously that Russian air defense will not have time to identify the origin of the aircraft.\\nIt seems possible that the U.S. air force will challenge that claim in due course — perhaps even without seeking prior permission from the White House. Last week, National Intelligence Director and former Air Force General James Clapper commented offhandedly, “I wouldn’t put it past them to shoot down an American aircraft … if they felt it was threatening their forces on the ground.”\\nInjecting additional volatility into the equation, major news outlets are playing down or ignoring Russia’s warnings. Thus, Americans who depend on the corporate media can be expected to be suitably shocked by what that same media will no doubt cast as naked aggression out of the blue if Russian air defenses down a U.S. or coalition aircraft.\\nMeanwhile in Europe, as NATO defense ministers met in Brussels on Wednesday, Defense Secretary Ashton Carter told reporters the U.S. is contributing “a persistent rotational armored brigade combat team” as a “major sign of the U.S. commitment to strengthening deterrence here.”\\n“This was a decision made by the alliance leaders in Warsaw,” he explained, referring to NATO’s July summit meeting in the Polish capital. “The United States will lead a battalion in Poland and deploy an entire battle-ready battalion task force of approximately 900 soldiers from the 2nd Cavalry Regiment, which is based in Germany.”\\nOn Thursday, at the Valdai Conference in the Russian Black Sea resort of Sochi, President Putin accused the West of promoting the “myth” of a “Russian military threat,” calling this a “profitable business that can be used to pump new money into defense budgets … expand NATO and bring its infrastructure, military units, and arms closer to our borders.”\\nMyth or not, German Foreign Minister Frank-Walter Steinmeier was correct to point out last spring that military posturing on Russia’s borders will bring less regional security. Mr. Steinmeier warned against “saber-rattling,” adding that, “We are well advised not to create pretexts to renew an old confrontation.”\\nSpeaking of such pretexts, it is high time to acknowledge that the marked increase in East-West tensions over the past two and a half years originally stemmed from the Western-sponsored coup d’état in Kiev on Feb. 22, 2014, and Russia’s reaction in annexing Crimea. Americans malnourished on the diet served up by “mainstream” media are blissfully unaware that two weeks before the coup, YouTube published a recording of an intercepted conversation between U.S. Assistant Secretary of State Victoria Nuland and the U.S. ambassador in Kiev, during which “Yats” (for Arseniy Yatsenyuk) was identified as Washington’s choice to become the new prime minister of the coup government in Kiev.\\nThis unique set of circumstances prompted George Friedman, president of the think-tank STRATFOR, to label the putsch in Kiev on Feb. 22, 2014, “really the most blatant coup in history.”\\nIt’s time for Western politicians and media to learn their lesson and pay attention to the statements coming out of Russia. Ask yourselves: Why all this hype now?\\n Ray McGovern was an Army officer and CIA analyst for almost 30 year. He now serves on the Steering Group of Veteran Intelligence Professionals for Sanity. He is a contributor to Hopeless: Barack Obama and the Politics of Illusion (AK Press) . He can be reached at: rrmcgovern@gmail.com . A version of this article first appeared on Consortiumnews.com.'"}, "time": 1742562266.0162933}