{"duration": 0.21457147598266602, "input_args": {"text": "'SEOUL, South Korea  —   The chief of North Korea’s powerful secret police, long considered the   man for the top leader, Kim   has been dismissed on charges of corruption and abuse of power, the South Korean government said on Friday. The firing of the chief, Gen. Kim   as minister of state security highlights the turmoil that has engulfed the upper reaches of Mr. Kim’s government. The general is the latest in a series of   party and military officials Mr. Kim has fired, demoted or executed as he tried to consolidate his totalitarian power through what South Korean officials and North Korean defectors have called a “reign of terror. ” General Kim was fired in   after he was demoted to a   general from a   one, said Jeong   a spokesman for the South’s Unification Ministry. The general’s surprise downfall was the latest indication that even top lieutenants are at risk as Mr. Kim has rival agencies monitor one another to detect and punish any sign of disrespect or disloyalty. Until his dismissal, General Kim had been Mr. Kim’s chief henchman in purging potential enemies. “Kim   has been a key aide to Kim   and has buttressed his reign of terror,” Mr. Jeong said. “His dismissal could further deepen unrest among officials and add to the instability of the regime by weakening its control on the people. ” Mr. Jeong said General Kim was accused of corruption and held responsible for various human rights violations, including torture, committed at his agency. But other political machinations could be at play behind the dismissal, Mr. Jeong said, citing speculation about a rivalry among different power centers. Mr. Jeong noted that the dismissal resulted from an investigation by another powerful agency, the Organization and Guidance Department of the governing Workers’ Party of North Korea. The department supervises all state agencies and is reportedly directly overseen by Mr. Kim. “The Organization and Guidance Department is conducting an intensive investigation of Kim   and the Ministry of State Security, so the level of punishment and the number of people affected could be expanded,” Mr. Jeong said, without disclosing how the South Korean government learned of the reported purge transpiring inside a secretive regime. The Ministry of State Security, which serves as the secret police and intelligence agency in the North, is one of the most feared tools of government there, responsible for arresting dissidents and running a network of prison gulags. When Mr. Kim executed his own uncle and No. 2 official, Jang   on charges of factionalism, corruption and plotting to overthrow his government in 2013, it was General Kim’s ministry that arrested and   Mr. Jang. Since taking power after the death of his father in 2011, Mr. Kim has frequently reshuffled the party and military elites as he has moved swiftly to establish his monolithic authority in North Korea, which his family has ruled for seven decades. Mr. Kim has executed at least 140 senior officials, usually killing them with machine guns and even flamethrowers, according to the Institute for National Security Strategy, a think tank affiliated with the South’s National Intelligence Service. Thae   who was the North’s No. 2 diplomat in London until his defection to South Korea last summer, said he fled partly because of Mr. Kim’s reign of terror. General Kim, 71, served in various top military positions under Mr. Kim, said Cheong   a senior analyst at the Sejong Institute, a South Korea research organization. He had been the top political officer of the North’s People’s Army and chief of its general staff, as well as its minister of armed forces. Purges and executions remain an important feature of political life in the North. In 2015, South Korean officials said that Gen. Hyon   the defense minister, was executed with an antiaircraft gun in Pyongyang, the North’s capital, after he dozed off during military events and   Mr. Kim’s orders. In August, they said Mr. Kim had found fault with a deputy premier’s “disrespectful posture” during a meeting and had him executed by a firing squad.'"}, "time": 1742564517.6493642}