{"duration": 0.06300544738769531, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Asia and the Pacific region: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at asiabriefing@nytimes. com. Here’s what you need to know: • Donald J. Trump’s plans for a smooth transition to the presidency are in disarray after the abrupt departures of two top aides handling national security and foreign policy matters. Vice   Mike Pence, who was placed in charge of the transition after Gov. Chris Christie was removed, plans to join Mr. Trump in New York to speed the naming of a cabinet. Rudolph W. Giuliani, the former mayor of New York, is a top contender for secretary of state. _____ • Mr. Trump’s   holdings present an array of potential conflicts of interest, complicated further by his decision to have his children serve on his transition team and run his businesses. As president, he will be exempt from a federal ethics rule prohibiting government workers and members of Congress from actions that could benefit their financial interests. Some American families are facing uncomfortable holidays  —   or deciding to skip gatherings  —   because of relationships strained by the country’s political divide. _____ • President Obama made some of his strongest comments since last week’s election. In Greece on the first leg of his last official international trip, he warned of a rise in “a crude sort of nationalism” and of “tribalism that is built on ‘us’ and a ‘them’ ”  —   an apparent reference to Mr. Trump’s appointment of Stephen K. Bannon, a   nationalist, as chief strategist. _____ • In South Korea, pressure is mounting on President Park   to step down as a campaign by Moon   her losing rival in the 2012 presidential election, builds. Ms. Park’s new lawyer requested time to review the case, delaying official questioning in the   scandal. _____ • Two   politicians in Hong Kong plan to appeal a court ruling that bars them from taking office for using their oaths of office to insult China. The judge said he would have ruled against them even without Beijing’s reinterpretation of the city’s Basic Law, adding to concerns for other lawmakers who altered their oaths as a form of protest. _____ • A   security firm discovered preinstalled software in some Android phones that was sending text messages, contact lists and other data to a server in China every 72 hours. The scope of the issue is not clear. The software provider, Shanghai Adups Technology, said its code runs on 700 million phones, cars and other smart devices. • Google and Facebook are taking aim at purveyors of fake news after criticism that misinformation may have influenced the 2016 election. • Technologies that emerged from the effort to combat distracted driving have added to the problem, U. S. safety experts say, contributing  to a surge in highway deaths. • Fintech, the emerging industry that combines finance and technology, is looking for its Silicon Valley. Berlin, Singapore and Sydney, Australia, are in the race, but Hong Kong may have the inside track. • Indian banks in major cities are marking customers’ fingers with  indelible ink to prevent   repeat visits to exchange devalued bank notes. Our reporter explains how Prime Minister Narendra Modi’s currency ban was meant to work. • Wall Street was mixed, and oil was higher. Here’s a snapshot of global markets. • Russia resumed airstrikes on   areas of Aleppo, Syria, ending three weeks of relative calm in the city. [The New York Times] • President Vladimir V. Putin of Russia fired his economy minister, citing a “lack of trust,” after the official was accused of soliciting a $2 million bribe in a huge oil deal. [The New York Times] • Mongolia has appealed to the International Monetary Fund for help with a financial crisis that has driven its currency, the tugrik, to an   low. [Bloomberg] • China executed a farmer convicted of killing a village official, despite months of public outcry over the inciting incident, the loss of his home. [The New York Times] • Hizbul Mujahedeen, a militant group, has emerged as the face of the independence movement in Kashmir. Above, women mourned a teenager’s death. [The New York Times] •   a Japanese robot equipped with artificial intelligence, has flunked the University of Tokyo entrance exam for a fourth year, leading its makers to concede that the limits of its skills. [Asahi Shimbun] •  Lake Baikal, one of the most pristine bodies of freshwater in the world, has been invaded by algae caused by an influx of untreated sewage. [The New York Times] • Tuesday was Election Day in Beijing, but despite urging voters to “treasure democratic rights,” the government bullied and detained activists and candidates. [The New York Times] • Jackie Chan finally received an Oscar. The Hong Kong native, known for comedic timing and martial arts expertise, received an honorary award for his long career as an actor, director and producer. • Toshiro Mifune, the flinty Japanese movie star best known in the West for his roles in Akira Kurosawa films, was posthumously honored with a star on the Hollywood Walk of Fame. • Xi Jinping wants China to bring back the revolutionary greeting of “comrade,” but its meaning has changed a bit after it was adopted as a term of affection among the country’s gay men and lesbians. The movie adaptation of the book “Harry Potter and the Philosopher’s Stone” was released in the United States 15 years ago this week. If the title sounds odd to American readers, that’s because in the U. S. the stone was a sorcerer’s. Book and movie titles differ often in adaptation  —   and not always because producers think sorcery is more enticing than philosophy. In some cases there’s a practical reason. “Schindler’s List” was first published in book form as “Schindler’s Ark. ” Oskar Schindler actually did keep a list, and book publishers changed the title later. Other cases are simply random. While it would have been a stretch for the movie “Blade Runner” to carry “Do Androids Dream of Electric Sheep,” the film’s title doesn’t actually appear in Philip K. Dick’s book. It was lifted from a different novel, Alan E. Nourse’s “The Blade Runner. ” American movie titles are often altered when they are released overseas to resonate with local audiences. That’s why “Up in the Air” became “Mileage, My Life” in Japan and “Cloudy With a Chance of Meatballs” turned into “It’s Raining Falafel” in Israel. A movie critic there summed up the criteria film studios used. “They are looking for something catchy or funny,” he said, “even if it is ridiculous. ” Evan Gershkovich contributed reporting. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742628443.8255453}