{"duration": 0.07672333717346191, "input_args": {"text": "\"Share on Twitter \\nAlyssa had known that having a baby wouldn't be easy. According to Fox News 5 , a variety of health problems — including cerebral palsy, hyperthyroidism, and diabetes — guaranteed that her pregnancy would qualify as a high risk one. \\nStill, she and her husband wanted nothing more than to be parents. Image Credit: Alyssa Young/Independent Journal Review \\nSo, when Alyssa learned she was pregnant, it was a joyous moment in what had been a very difficult year for their family. Immediately, Alyssa decided that if the baby was a girl, she would name her “Scarlett Faye” after the two most important women in her life — her mother and her recently deceased grandmother. Alyssa tells Independent Journal Review: \\n“The joy I felt was indescribable. I loved being pregnant. It's all I talked about, thought about, and dreamed about. From the moment I found out that there was life inside of me, I thought that this baby was a blessing sent to us all. She was going to shed light on this terrible year everyone had had.” \\nThe pregnancy progressed better than Alyssa could have hoped. She learned that her baby would be a girl, and that little Scarlett was growing as expected. Then, at 20 weeks, Alyssa started experiencing pain and minor bleeding. \\nAt first, her discomfort was dismissed as normal pregnancy aches. However, when the pain got worse, Alyssa headed to the hospital, praying all the way that everything would be fine. \\nOnce at the hospital, the on-call obstetrician told Alyssa that she had an incompetent cervix. While Alyssa was willing to undergo a procedure to address the issue, the doctor explained that it wouldn't help. The only hope lay in strict bed rest and medication that might stop her from dilating further. Alyssa tells Independent Journal Review: \\n“After the doctor left the room, Justin laid over the bed rail, grabbed my right hand, and just sobbed. I wrapped my left arm around him and kissed his head, and cried with him. ... We held each other and cried together for what seemed like forever. That night seemed very long. I tossed and turned, prayed and thought. I begged God for everything to be okay. She was our blessing and I couldn't stand think of losing her.” \\nSadly, the next day, Alyssa learned that the measures they had tried hadn't worked. Her baby was on its way. The grief she felt was mixed with the feeling that she had failed as a mother: \\n“I felt like I had failed. I felt like I failed him [her husband] and our daughter. All I could spit out was 'I'm sorry. I'm so sorry.' I must have repeated that a dozen times.” \\nScarlett Faye was born at 20 weeks gestation, weighing less than a pound. Image Credit: Alyssa Young/Independent Journal Review \\nAlyssa describes the beauty of her newborn daughter: \\n“She was perfection. She was very well developed, and the most perfect combination between her father and I. She holds a special place in our hearts. There isn't a day that goes by that I don't think of her. My little girl yesterday, my angel today, my daughter forever.” \\nAs the nurses gave Alyssa her daughter to hold for the first time, the new mom found that there was so much she wanted to tell her baby. She tells Independent Journal Review: \\n“I held Scarlett on my chest and cried into hers. I studied her face, so it'd forever be imprinted in my mind. I studied her body, her toes, her ribs. Everything. ... I told her that I was so sorry. I told her I loved her. I told her it was okay to let go. ... Everyone took their turns and held her. Everyone got to love her. That's all she ever experienced was love.” \\nAlyssa's memories of her daughter are illuminated by love. Image Credit: Alyssa Young/Independent Journal Review \\nShe explains to Independent Journal Review that though her daughter only lived for two hours, every moment of that time was filled with the love of family: \\n“She felt love. That is it. In the two hours that she was alive, she fought to stay with us. In those two hours, she was cuddled, kissed, hugged, and loved. She went peacefully. Justin and I got to be with her two whole days before we went home. I was able to cuddle her body, change her dirty diapers, bathe her, and love her. While in the hospital, I never left her side.” \\nAlyssa says she isn't sharing her story to gain sympathy. Rather, she hopes that she can help other women from experiencing the same loss by raising awareness of the problem of incompetent cervix. Image Credit: Alyssa Young/Independent Journal Review \\nShe has set up a Facebook page to help women going through pregnancy loss and tells Independent Journal Review that she wants to make a difference for her daughter, as well as for other babies who were taken too soon: \\n“Scarlett along with all the other babies, deserves justice. Even those who have lost their littles too soon for other reasons. We need to stand together and fight for our babies.” \""}, "time": 1742564466.1010282}