{"duration": 0.0489199161529541, "input_args": {"text": "'Mayor Bill de Blasio posted a video on his City Hall Twitter account on Tuesday that featured two Broadway actors singing his praises and promoting his accomplishments, drawing criticism from government watchdog groups who said that it was an inappropriate use of public money and was too much like a campaign ad. The video, which tries to poke fun at itself even as it promotes the mayor, was posted on the official City Hall Twitter account, @NYCMayor, and features Mr. de Blasio in an awkward thespian effort. It also includes his wife, Chirlane McCray a senior adviser, Andrea Hagelgans and two Broadway stars, Jenna Ushkowitz and James Monroe Iglehart. Ms. Ushkowitz starred in the television show “Glee” and has appeared in Broadway musicals, including “Waitress” and “Spring Awakening. ” Mr. Iglehart won a Tony Award in 2014 for his role as the Genie in “Aladdin. ” The video shows Mr. de Blasio, who is running for   in the coming year, sitting in the back of what appears to be one of the mayoral sport utility vehicles, talking with Ms. McCray on his cellphone. “Hey honey, I really like this song idea,” he says. “I really think it’s the perfect way to wrap up all the great things we’ve done this year. ” Ms. McCray, Ms. Hagelgans and the actors are shown in a room at Gracie Mansion. Ms. McCray puts the mayor on speaker phone so he can listen as the two actors sing, accompanied by a piano player. “In case the folks are unaware, we’ve got some facts we’d like to share,” they sing. They go on to plug mayoral programs like protections for renters, the construction and preservation of affordable housing, and a mental health initiative. “Who’s bringing cops and community close?” Ms. Ushkowitz sings as the beat goes  . “Who’s got incarceration and crime rates sinking to a record low?” The performance closes with a rousing reference to Mr. de Blasio. “No matter what will be, we’ve got Billy D. B. !” Ms. Ushkowitz belts out. The mayor starts out nodding happily to all the praise but then whispers to an aide, “This is kind of over the top. ” In the end, he delivers his review of the performance: “Maybe the song’s a little too elaborate,” he says. “Maybe we should just do a couple of tweets and a Facebook post instead. ” Dick Dadey, the executive director of Citizens Union, a government watchdog organization, questioned whether creating the video was a justifiable use of public resources and said it raised questions because it came right before next year’s   campaign. “This is a virtual campaign ad that is meant to be a   announcement but goes beyond that in serving to promote the mayor,” Mr. Dadey said. The video is part of a broader effort by City Hall to increase its use of the internet and social media to reach out to New Yorkers directly, bypassing traditional news media. It also comes as Mr. de Blasio controls his interactions with the press, frequently avoiding questions and limiting the news conferences at which he will take questions on any topic to once a week. Eric Phillips, Mr. de Blasio’s press secretary, said that the video was produced by City Hall staff and that the actors volunteered their time. Mr. Phillips said that City Hall spent a total of $700 to pay the piano player and a composer. He said it cost an additional $170 to have the piano tuned and $30 to rent a rehearsal room. Although the mayor is running for   next year, Mr. Phillips said in a written statement that the video “doesn’t have anything to do with his campaign. ” He added, “We think New Yorkers have a right to know what their government does, and it’s our job to communicate that work in a modern way. ” The immediate effect of the video was not exactly the stuff of Broadway hit material. In the first seven hours after the video was posted on Twitter, it had received 218 likes on the mayor’s account and 88 retweets.'"}, "time": 1742563536.0573308}