{"duration": 1.7423946857452393, "input_args": {"text": "'Here’s Why Hillary Won’t Allow Her Corporate Speeches to be Published Eric Zuesse (update added 8 November 2016) In a previous report, I indicated “Why Hillary Clinton’s Paid Speeches Are Relevant” , but not what they contained. The present report indicates what they contained. One speech in particular will be cited and quoted from as an example here, to show the type of thing that all of her corporate speeches contained, which she doesn’t want the general public to know about. This is the day’s keynote speech, which she gave on Wednesday, 25 June 2014 , to the Biotechnology Innovation Organization , a lobbying organization in DC, at their annual convention, which in 2014 was held in San Diego . The announcement for attendees said: “Wednesday’s Keynote session is sponsored by Genentech, and is open to Convention registrants with Convention Access and Convention Access & Partnering badges only. Seating is limited.” Somehow, a reporter from a local newspaper, the Times of San Diego , managed to get in. Also, somehow, an attendee happened to phone-video the 50-minute interview that the BIO’s CEO did of Clinton, which took place during the hour-and-a-half period, 12-1:30, which was allotted to Clinton. The Times of San Diego headlined that day, “Hillary Clinton Cheers Biotechers, Backing GMOs and Federal Help” , and gave an excellent summary of her statements, including of the interview. Here are highlights: — It was red meat for the biotech base. Hillary Rodham Clinton, in a 65-minute appearance at the BIO International Convention on Wednesday, voiced support for genetically modified organisms and possible federal subsidies. … “Maybe there’s a way of getting a representative group of actors at the table” to discuss how the federal government could help biotechs with “insurance against risk,” she said. Without such subsidies, she said, “this is going to be an increasing challenge.” … She said the debate about GMOs might be turned toward the biotech side if the benefits were better explained, noting that the “Frankensteinish” depictions could be fought with more positive spin. “I stand in favor of using seeds and products that have a proven track record,” she said [at 29:00 in the video next posted here] , citing drought-resistant seeds she backed as secretary of state. “There’s a big gap between the facts and what the perceptions are.” [that too at 29:00] … Minutes earlier, Gov. Jerry Brown made a rousing 3-minute pitch for companies to see California as biotech-friendly. “You’ve come to the right place.” … Brown had some competition for biotech boosterism in the form of Virginia Gov. Terry McAuliffe, the longtime Clinton ally who pitched his own state as best for biotech. … [Clinton was] Given a standing ovation at the start and end of her appearance. — In other words: As President, she would aim to sign into law a program to provide subsidies from U.S. taxpayers to Monsanto and other biotech firms, to assist their PR and lobbying organizations to eliminate what she says is “a big gap between the facts and what the perceptions are” concerning genetically modified seeds and other GMOs. In other words: she ignores the evidence that started to be published in scientific journals in 2012 showing that Monsanto and other GMO firms were selectively publishing studies that alleged to show their products to be safe, while selectively blocking publication of studies that — on the basis of better methodology — showed them to be unsafe. She wants U.S. taxpayers to assist GMO firms in their propaganda that’s based on their own flawed published studies, financed by the GMO industry, and that ignores the studies that they refuse to have published. She wants America’s consumers to help to finance their own being poisoning by lying companies, who rake in profits from poisoning them. Her argument on this, at 27:00 to 30:00 in the video of the 50-minute interview of Clinton , starts by her citing the actual disinformation (that’s propagandized by the fossil-fuels industries, which actually back her Presidential campaign ) that causes the American public to reject the view that humans have caused global warming. At 27:38 in the video, she said “98% of scientists in the world agree that man has caused the problem” of global warming, and she alleged that the reason why there is substantial public resistance to GMOs is the same as the reason why there’s substantial public resistance to the reality that global warming exists and must be actively addressed: Americans don’t know the science of the matter. She received several applauses from this pro-GMO audience, for making that false analogy. The reality, that it’s false, is that on 15 May 2013, the definitive meta-study, which examined the 11,944 published studies that had been done relating to the question of global warming and its causes, reported that “97.1% endorsed the consensus position that humans are causing global warming.” The meta-study was titled “Quantifying the consensus on anthropogenic global warming in the scientific literature” . So, Clinton’s statement “98%” was only 0.9% off regarding the size of the scientific consensus. However, her implication that the public’s rejection of that actual 97.1% of experts’ findings on global warming, is at all analogous to the public’s rejection of the actually bogus finding by GMO industry ‘experts’ that GMOs are safe, is pure deception by her. The reality is the exact contrary: The fossil-fuels industries have financed the propaganda ‘discrediting’ the scientists’ consensus about global warming, much like the GMO industries have financed the deception of the public to think that ‘scientists’ ‘find’ that GMOs are safe. In fact, as was reported in Scientific American , on 23 December 2013, “’Dark Money’ Funds Climate Change Denial Effort” , and the study they were summarizing, from the journal Climate Change , was titled “Institutionalizing delay: foundation funding and the creation of U.S. climate change counter-movement organizations” . It found that: “From 2003 to 2007, the Koch Affiliated Foundations and the ExxonMobil Foundation were heavily involved in funding CCCM [climate change counter-movement] organizations. But since 2008, they are no longer making publicly traceable contributions to CCCM organizations. Instead, funding has shifted to pass through [two] untraceable sources [ both of which had been set up by the Kochs: Donors Trust, and Donors Capital Fund ] . “ On 23 April 2016, Politico headlined “Charles Koch: ‘It’s possible’ Clinton is preferable to a Republican for president” , but this isn’t the only indication that Hillary is merely pretending to be their enemy. On 24 February 2016, I headlined “Hillary Clinton’s Global-Burning Record” and summarized and linked to news reports such as the opening there: “On 17 July 2015, Paul Blumenthal and Kate Sheppard at Huffington Post bannered, ‘Hillary Clinton’s Biggest Campaign Bundlers Are Fossil Fuel Lobbyists’ and the sub-head was ‘Clinton’s top campaign financiers are linked to Big Oil, natural gas and the Keystone pipeline.’” In other words: the same pro-GMO lobbyists who applaud Hillary for verbally endorsing the science that affirms global warming, applaud her for endorsing their own fake ‘science’ which asserts that GMOs have been proven safe. They just love her lie, which analogizes them to the authentic scientists who (97.1%) say that global warming exists and is caused by humans’ emissions of global-warming gases. Also, she expressed the wish that: “the federal government could help biotechs with ‘insurance against risk,’ she said. Without such subsidies, she said, this is going to be an increasing challenge,” because otherwise, biotech companies might get bankrupted by lawsuits from consumers who might have become poisoned by their products. She wants the consuming public to bear the risk from those products — not the manufacturers of them to bear any of the risks that could result from those manufacturers’ rigged ‘safety’ ‘studies’ (a.k.a.: their propaganda). In other words: the reason why Hillary Clinton won’t allow her 91 corporate speeches, for which she was paid $21,667,000 , to be published, is the lying political cravenness of her pandering to those corporations there. Each group of lobbyists is happy to applaud her lying, regardless of whether her lies include insults against another group of lobbyists, to whom she might be delivering similar lies to butter them up at a different annual convention or etc. In other words: she’s telling all of them collectively: You’re my type of people, and the public who despise you are merely misguided, but as President I’ll set them straight and they’ll even end up paying part of the bill to be ‘educated’ about these matters, by my Administration, and even part of the bill to pay corporations’ product-liability suits. The reason why Clinton doesn’t want those speeches to be made public is that she doesn’t want the voters to know that she intends to use their money to propagandize to them for the benefit of those corporations, and also to protect those corporations from liability for harms their products cause the public. This is called (by the propagandists) ‘capitalism’ and ‘democracy’ . Mussolini, with pride, called it sometimes “fascism,” and sometimes “corporationism.” But whatever it’s called, it’s what she supports, and what she represents, to the people who are paying her. And even most of her own voters would find it repulsive, if they knew about it. So: she can’t let them know about it. And she doesn’t. UPDATE : On 5 October 2016, fifty-six food-related lobbying organizations, such as the American Soybean Association and the International Dairy Foods Association, and including some universities that receive large income from biotech firms to produce ‘scientific studies’ so they can promote their products as being ‘proven safe’, wrote a letter to the heads and ranking members of the Appropriations Committee in both the House and Senate, opening , “The undersigned organizations support the inclusion of $3 million within the Fiscal Year 2017 Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act to better inform the public about the application of biotechnology to food and agricultural production. Regrettably, there is a tremendous amount of misinformation about agricultural biotechnology in the public domain. Dedicated educational resources will ensure key federal agencies responsible for the safety of our nation’s food supply – the U.S. Food and Drug Administration (FDA) and the U.S. Department of Agriculture (USDA) – are able to more easily convey to the public science- and fact-based information about food.” That was exactly what Hillary Clinton had proposed on 25 June 2014 to the Biotechnology Innovation Organization (which was one of those 56 lobbying groups). As to whether the idea had originated with Clinton or with top executives in the biotech industry, one can, at the present time, only speculate. However, she was on record (privately) proposing it to the biotech industry more than two years before the biotech industry proposed it to Congress.'"}, "time": 1742564286.0716753}