{"duration": 0.03186345100402832, "input_args": {"text": "'  \\nThere’s a change.org petition being passed around by progressives right now — with 1.4 million signatures at the time of this writing — that asks the Electoral College to break historical precedent, ignore the laws in their respective states, face whatever political and legal consequences there may be (if an elector in a red state did that, they would and should fear for their lives. Think about it), and vote for Hillary Clinton despite the way the cards fell. It’s a dumb petition and you shouldn’t sign it. It’s never, never, ever going to happen that way. And furthermore, because of the way the numbers stack up, there are more Republican than Democratic electors — they want him elected. It’s never going to happen. \\nDon’t get me wrong — I’m all for democratizing the presidential election process. Want the popular vote to pick the president? I’m right there with you . However, this petition isn’t going to accomplish that, and not so deep down, I think you know that. \\nWhat it is going to do is make you feel a little bit better about not doing anything to actually make it happen. That’s all online petitions typically do, unless there is a pledge for personal action attached. That’s not the solution here — especially since there is a REAL solution to the problem of the electoral college on the table. The petition being passed around is going to make people feel complacent, and less likely to call a state legislator, which is the real way to go about this. The electoral college won’t stop this — in fact, the electoral college needs to go. \\nThere is a movement and bill in the works that binds individual states’ electors to casting electoral votes along with the national popular vote. All you need is enough states to agree to have 270 votes, and boom! Popular vote wins. No, it’s not going to make Hillary Clinton the president. It’s really too late for that. But instead of despair and pointless petitions, you should begin acting for the future you want, today. \\nAs I wrote for Addicting Info, \\nEleven states have already signed on to the National Popular Vote bill, which is an interstate compact agreeing to cast the votes of those states (165 in all) to whoever wins the popular vote in the general election. If more states sign on, specifically 105 votes’ worth, it’s decided — the popular vote will determine who wins the general election. \\nIf you live in California, New York, New Jersey, Illinois, Maryland, Washington, Massachusetts, Rhode Island, Vermont, Hawaii, or DC, your district is already on board with truly democratic elections. Although those states are mostly blue, not all of the legislative branches are, so there’s hope! \\nIf you do not live in one of those states, you can pressure your state legislators to pass a bill joining the cause. You can find the progress made in your state already at this link , or find out more behind the movement in general here . \\nIf you don’t like the fact that a Wyoming Republican’s vote counts for four times as much as a Democrat’s in California, see how far along your state is on accepting truly democratic elections. Don’t sign a dumb petition and then forget about it. \\nFeatured image via change.org'"}, "time": 1742628475.042748}