{"duration": 0.1711902618408203, "input_args": {"text": "'O. K. Peter Doig may have tried LSD a few times when he was growing up in Canada during the 1970s. But he still knows, he said, when a painting is or isn’t his. So when Mr. Doig, whose eerie, magical landscapes have made him one of the world’s most popular artists, was sent a photograph of a canvas he said he didn’t recognize, he disavowed it. “I said, ‘Nice painting,’” he recalled in an interview. “‘Not by me. ’” The owner, however, disagreed and sued him, setting up one of the stranger art authentication cases in recent history. The owner, a former corrections officer who said he knew Mr. Doig while working in a Canadian detention facility, said the famous painter indeed created the work as a youthful inmate there. His suit contends that Mr. Doig is either confused or lying and that his denials blew up a plan to sell the work for millions of dollars. But Mr. Doig, 57, has compelling evidence he was never near the facility, the Thunder Bay Correctional Center, about 15 hours north of Toronto. “This case is a scam, and I’m being forced to jump through hoops to prove my whereabouts over 40 years ago,” he said. To Mr. Doig’s surprise, though  —   and the astonishment of others in the art world  —   a federal judge in Chicago has set the case for trial next month at United States District Court for Northern Illinois. Art law experts say they can’t recall anything like it, certainly not for a major artist like Mr. Doig. “To have to disprove that you created a work seems somehow wrong and not fair,” said Amy M. Adler, a professor at New York University Law School. The stakes are high as well. A Doig painting has sold for more than $25 million. Other works have routinely sold at auction for as much as $10 million. The plaintiffs, who include the correction officer and the art dealer who agreed to help him sell the work, are suing the painter for at least $5 million in damages and seek a court declaration that it is authentic. They have focused on what they say is a hole in Mr. Doig’s teenage years in Canada when, they assert, he cannot fully account for where he was or what he was doing. “Every artist has destroyed work,” said William F. Zieske, the lawyer for the painting’s owner and the art dealer. “We can’t really get into his mind and say why he looked at this painting and said, ‘I am not going to own that.’ I don’t think anyone can. ” Disputes about authenticity, a vexatious topic in the art world, tend to center on the works of dead artists. Legal claims, when they arise, are usually made against experts who have doubted the art’s veracity, and not against the artist. But Mr. Doig is not the first artist to deny having created a work and still be challenged. Picasso denied painting a work attributed to him, “Erotic Scene” (known as “La Douleur,” or “The Pain”). (The Metropolitan Museum, which was given it, however, did some research and thinks it’s clearly his.) Similarly, Gilbert Stuart denied having painted the portrait of George Washington that hangs in the East Room of the White House. The White House says it’s his. Neither man, however, was sued for rejecting the work. When artists have been sued, it has been in cases in which they disavowed works because they said they had been altered. In 2012, for example, a collector sued Cady Noland, an American conceptual sculptor, after she disavowed a work, “Cowboys Milking,” because, she said, it had been damaged. In her defense, Ms. Noland invoked a 1990 law called the Visual Artists Rights Act. It gives artists powers to, among other things, prevent their names from being used on works that have been mutilated or distorted. The retired corrections officer, Robert Fletcher, 62, said he bought the painting for $100 from a man named Pete Doige (spelled with an e) whom he met in 1975 in Thunder Bay, Ontario. The young man he knew was taking art classes at a local college, Lakehead University, and said he was, like Mr. Doig, from Scotland. After the man was incarcerated on an LSD charge at a prison farm where Mr. Fletcher worked, Mr. Fletcher saw the young artist create the painting, an untitled acrylic canvas of a rocky desert scene. The painting is signed “Pete Doige 76. ” “I am 100 percent convinced that this is the man and that this is the painting I own,” Mr. Fletcher said in an interview. He became the young man’s parole officer and also helped him find a job through the Seafarers International Union. He said he bought the painting because he feared Mr. Doige might go back to selling drugs. About five years ago, a friend noticed the painting on Mr. Fletcher’s wall and told him it was by a famous artist. When Mr. Fletcher pulled up a video and watched Mr. Doig speaking at a college, he said, he recognized his facial expressions and mannerisms, and now feels let down by someone he believes he helped, and wants to be proved right. Mr. Fletcher, who lives in Sault Ste. Marie, Ontario, consigned it to a gallery in Chicago on the recommendation of his brother, who lives there. The gallery, run by Peter Bartlow, contacted an auctioneer, hoping no doubt for a payday similar to those achieved by several recent Doig sales. Mr. Fletcher and Mr. Bartlow said the painting contains many similarities to Mr. Doig’s undisputed works, such as a horizontal striped landscape, a body of water, logs protruding from a lake, even white lichen on the trees. A Sotheby’s specialist, to whom they sent an image of the picture, said it was “rare to see such a complete and highly resolved early painting by Doig” and said it had Mr. Doig’s “trademark eeriness of the empty landscape,” though she later said she never inspected it firsthand and did not authenticate it, according to court papers. “There are so many of defendant Doig’s commonly used techniques and elements in the disputed work that it could be the most typical of all of his works,” Mr. Fletcher and Mr. Bartlow say in court papers. Mr. Doig, however, said they are taking advantage of the similarity in two people’s names so as to profit from a   tale. Yes, he grew up in Canada before attending art school in England. But in 1976 he was only 16 or 17, and lived in Toronto. He has never been to Thunder Bay, he said, and was never incarcerated. He denies there are similarities to his own works. “I did not begin to paint on canvas until late 1979. (Before that, I had done some pencil and ink drawings on paper),” he said in court papers. Never to this day, he said in an interview, has he used acrylic paint on canvas. “If I had painted that painting when I was 16, I would admit it. ” Mr. Doig and his lawyers say they have identified the real artist, a man named Peter Edward Doige. He died in 2012, but his sister said he had attended Lakehead University, served time in Thunder Bay and painted. “I believe that Mr. Fletcher is mistaken and that he actually met my brother, Peter, who I believe did this painting,” the sister, Marilyn Doige Bovard, said in a court declaration. She said the work’s desert scene appeared to show the area in Arizona where her mother moved after a divorce and where her brother spent some time. She recognized, she said, the saguaro cactus in the painting. The prison’s former art teacher recognized a photograph of Ms. Bovard’s brother as a man who had been in his class and said he had watched him paint the painting, according to the teacher’s affidavit. Mr. Fletcher and Mr. Bartlow have no record of Mr. Doig being imprisoned in Thunder Bay, but they said that’s because he was a minor and his records were probably expunged, or paperwork was just lost. (In June, The New York Times asked the Ontario authorities to search their records in an effort to come up with conclusive evidence. They were able to easily search only records going back as far as 1985 a deeper search would take more than six weeks.) Mr. Doig plans to present his own set of records, school documents, correspondence, photos and testimony to demonstrate, he said, that he never attended Lakehead University and that during the months in 1975 and 1976, when he is said to have created the painting, he actually was in Toronto or working on oil rigs in western Canada or traveling outside the country. He asked the judge to dismiss the case, arguing that he should not be tried in Illinois. But Judge Gary Feinerman of United States District Court decided in April this was a dispute that could be resolved only at trial. “The presence of the Lakehead and the Seafarers records for Doige, but not for Doig, certainly favors Doig,” Judge Feinerman said in his decision. “There is no doubt about that. But it’s not strong enough evidence, given all of the evidence in the record,” the judge said, to eliminate any chance that Doig “was not the person at Thunder Bay who was the author of the painting. ” Mr. Bartlow said that, at first, he thought Mr. Doig disowned the painting because he was embarrassed by that period in his life. But Mr. Doig has never denied his association with past drug use. Some of his paintings have been inspired, in part, by LSD. Now, Mr. Bartlow said he thinks the artist refuses to acknowledge the painting because it shows he has been using similar formulaic compositions for four decades. Mr. Bartlow has made dozens of videos to demonstrate his case, some posted on YouTube. He financed some of the costs of bringing suit by soliciting contributions from about six or seven private contacts, with whom he promised to share some of any payouts. “There is no question that Peter Doig painted the painting,” he said. “You see the outline of our painting in his other works. ” Both sides plan to call experts to debate this point. The   process is a stressful distraction for an artist at the peak of his talents, said Gordon VeneKlasen, Mr. Doig’s dealer at Michael Werner Gallery in New York. “This has become about much more than Peter’s painting,” Mr. VeneKlasen said. “It’s about authorship. It’s about being forced to put your name on another artist’s work. ” In a statement, he went further: “In our case, the artist and dealer have the resources to carry on this fight, but I wonder about all the artists who might not. Do they simply acquiesce and let inauthentic works into the market if they are the product of a similar attempt at bullying and rampant greed?” To win, art lawyers say, Mr. Fletcher and his advisers will have to persuade the judge that the painting is real. But even if the court favors Mr. Fletcher, it could be a hollow victory. Since the artist himself and the dealer who represents him say it’s not a Doig, the art market is unlikely to assign much value to it, art experts said. A decision against Mr. Doig, and any costly award for damages, would nevertheless probably send a shock wave through the art world. “It would,” said Nicholas M. O’Donnell, a Boston art lawyer who has no role in the case, “put all artists in the cross hairs. ”'"}, "time": 1742563382.2565854}