{"duration": 0.1321406364440918, "input_args": {"text": "'SAN DIEGO  —   Secretary of Homeland Security John Kelly, Attorney General Sessions, and Sen. Ron Johnson ( ) concluded a visit to the border on Friday with a tough message for “sanctuary city” jurisdictions, including California. [Standing on an access road on the U. S. side of the border, Secretary Kelly began a press briefing by reaffirming the Trump administration’s commitment to border security, including a “physical barrier” along the southern border.  He also emphasized the importance of stopping human trafficking along the border. “There’s nothing the Attorney General and I want more than to put human smugglers out of business,” he said. Kelly cited drastic reductions in the number of illegal border crossings, which he said were down 64% from the same period last year. The reason, he said, was that the Trump administration had shown “we’re serious about border security and enforcing our immigration laws. ” Attorney General Sessions spoke about the boost in morale among law enforcement staff, and praised the progress of the Trump administration. “It’s exceeded what I thought possible so far,” Sessions said. He warned about the danger of infiltration by gangs like   “whose motto is ‘murder, rape, and control,’” he said. And then the Attorney General launched a broadside against sanctuary cities  —   and the   “sanctuary state” of California. “It was nearly two years ago that Kate Steinle was shot and killed, dying in her father’s arms, along Pier 14 in San Francisco,” Attorney General Sessions recalled. “The alleged shooter was an illegal immigrant with seven prior felony convictions who had been deported from this country five times. Only weeks earlier, the city had released him from custody, after being apprehended again, even though the federal immigration authorities had filed a detainer requesting that he be held in custody until they could remove him for deportation proceedings. Even worse, this man admitted he came to San Francisco in part because of its sanctuary policies. “So today, the Department of Justice sent letters to nine jurisdictions that were identified  —   by the Obama administration  —   as having policies that potentially violate federal law and which receive millions in federal grants. These jurisdictions have until June 30th to send their legal justifications for why they are not in violation of federal law  —   and the state of California is one of these jurisdictions.   …     Sanctuary jurisdictions have put known gang members back on the streets. ” He concluded: “I urge New York, California, and other jurisdictions to reconsider. ” The California State Senate recently passed a “sanctuary state” bill, SB 54, that still awaits passage by the State Assembly before proceeding to Governor Jerry Brown’s desk.  Kelly, Sessions, and Johnson were concluding a   visit to the border, which began in El Paso, Texas on Thursday and concluded in San Diego at the Otai Mesa Detention Facility. The press conference was held in between two existing border fences  —   a thin, rusted corrugated iron fence on the Mexican side, and a tall,    American fence. In the distance, the new pedestrian walkway between Tijuana’s airport and San Diego hovered over the boundary. Johnson, who serves as Chairman of the Senate Committee on Homeland Security and Governmental Affairs, said: “One of the main reasons we come here, in addition to learning   …     is to thank the men and women” of law enforcement. He reiterated that the Trump administration, in contrast to his predecessor, had prioritized helping border patrol and enforcing the law. “We’re not going to apologize,” he said, for enforcing the law and keeping the country safe. Asked by a local reporter to respond to the argument by sanctuary cities that enforcing immigration law would hurt local policing, Sessions described that as more of an “excuse” than a reason, suggesting that it was driven by ideology rather than evidence. He rejected an accusation earlier Friday by California State Senate President pro Tem Kevin De León (  Angeles) that he and the Department of Justice were basing their law enforcement efforts on “principles of white supremacy. ” “It’s a kind of extremist statement that I totally reject,” Sessions said. He also defended his recent comment about a ruling in a federal court in Hawaii that stopped President Trump’s executive order suspending travel from six   countries from going into effect. Earlier Friday, Secretary Kelly told Kate Bolduan of CNN that President Barack Obama had presided over a “very, very open border” and that Obama had done “nothing” to secure the border and enforce immigration law internally. Outside the event, about a dozen demonstrators from the Remembrance Project, which commemorates victims killed by illegal aliens, gathered to support the Trump administration’s efforts.  Vaught Becht of Orange County gave the administration an “ ” for its work on immigration and border security thus far. “I think they’re doing a great job. We’ve got a new era. [Trump] supports the citizens. America first, and jobs first. We’ve got a new sheriff in town. He speaks for the American people, not the swamp in D. C. He speaks for us. ” Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742562128.7078085}