{"duration": 0.19842123985290527, "input_args": {"text": "'Consider this a primer on everything you need to know about one of the most important events of the fall season: the Metropolitan Opera premiere of Kaija Saariaho’s “L’Amour de Loin” on Thursday, Dec. 1. (It runs through Dec. 29.) WHY IT’S A BIG DEAL For a couple of reasons. Even as the Met has slowly modernized its offerings in recent years, it still does far less contemporary opera than major European companies. And “L’Amour de Loin,” which had its premiere at the Salzburg Festival in Austria in 2000, has since become one of the most acclaimed and widely performed works of the 21st century. The Met may be late to the party on this one, but it’s still an arrival worth celebrating. Another important aspect relates to its composer’s gender. The Met hasn’t performed an opera written by a woman since Ethel Smyth’s “Der Wald” in 1903. (Read that sentence one more time, and think about it hard.) So it’s a major statement for the company to be adding Ms. Saariaho’s “L’Amour de Loin” to its history  —   though this is a slightly delicate matter, since she has long resisted being categorized (read: ghettoized) as a “female composer. ” WHO SHE IS Born in Helsinki in 1952, Ms. Saariaho has long experimented with incorporating electronics and technology into her work, without ever abandoning the resources and colors of traditional instruments. (For one piece, she developed a special microphone to individually amplify each of a cello’s four strings.) There are fewer recognizable melodies in her music than there are shimmering, changeable textures, and sudden whirlpools of violence and activity. But even if they’re not necessarily catchy, her vocal lines are lush and intense, well suited to the love and longing in “L’Amour de Loin. ” WHAT IT’S ABOUT Ms. Saariaho, working with the writer Amin Maalouf, created a stylized version of the life of a historical figure, the   troubadour Jaufré Rudel. A wealthy prince in Aquitaine, Jaufré is tired of his dissolute aristocratic life and, spurred by a pilgrim’s tale, falls in love with someone he’s never met: Clémence, the Countess of Tripoli. He avoids meeting her, though, fearing that that would ruin the purity of his “amour de loin” (“love from afar”). The story couldn’t be simpler, and the opera deepens not through the complexity of the plot, but from the emotional weight of living with these characters in a kind of contemplative stillness. (We aren’t in “La Bohème” anymore, Toto. “L’Amour de Loin” feels more like it’s suspended in space.) The work moves back and forth, like a kind of pendulum, from Jaufré (a baritone role) to Clémence (soprano) with the Pilgrim ( ) acting as   transmitting the  ’s songs to the countess. POLITICAL RESONANCES “Though it was not intended as such,” Anthony Tommasini wrote in his review of the 2000 premiere in The New York Times, “‘L’Amour de Loin’ provides a jolt of sanity amid the political conflicts that of late have been rattling the world, Austria in particular, over issues of nationality, immigration, the sanctity of borders and the cultural gulf between the West and the East. ” And in an interview with The Times in 2002, Ms. Saariaho said: “In the midst of composing it, I understood that it was also my story. I was at once the troubadour and the lady, these two parts of me that I try to reconcile in my life. To write music, concentration is necessary, an interior hearing. To be a woman, to be a mother, one needs to be always available and busy. It’s difficult to have, at the same time, your feet on the ground and your head in the sky. ” WHAT IT SOUNDS LIKE There always seems to be a kind of metallic shimmer over the score, or perhaps a sheen of iridescent sea foam. Ms. Saariaho has always been adept at weaving together acoustic and electronic sounds, and here she adds tastes of medieval harmonies and North African rhythms. It’s a     sinuous landscape, punctuated by dramatic orchestral explosions. While there are only three soloists, a chorus and powerful orchestra make this a very grand intimate opera. In Jaufré’s music, the oboe and low strings are prominent, with harp chords connected to what would have been his instrument, the lute. Clémence’s world is brighter, its string textures higher. Ms. Saariaho conceived the two characters as having different harmonic languages that eventually merge. But, she said in a recent phone interview, “you don’t need to know music theory to perceive it. My music is written for ears you don’t need to intellectualize it. You just need to let yourself enter. ” Reviewing the 2000 premiere, Mr. Tommasini wrote: “Ms. Saariaho has provided a lushly beautiful score, structured in five continuous acts lasting two hours. ” (It should be noted that the Met will perform it with an intermission.) “Best known for her explorations of sound, Ms. Saariaho continues in that vein here with music that combines vivid orchestration, the subtle use of electronic instruments and imaginative, sometimes unearthly writing for chorus, which sings from the side of the stage. The vocal writing is by turns elegiac and conversational. Her harmonic language is tonally grounded, with frequent use of sustained low pedal tones, but not tonal. Bits of dissonance, piercing overtones and gently jarring electronic sounds spike the undulant harmonies, but so subtly that the overall aural impression is of beguiling consonance. ” BUT Mr. Tommasini added: “The music sometimes lacks urgency. Stretches of the score pass by, beautiful, yes, but lacking in profile, just orchestral backdrops for the singer’s reflections. ” DO I NEED TO PREPARE? The short answer is no: All you need to enjoy this opera is a couple of hours and an open mind. But of course it can only be rewarding to listen to some of Ms. Saariaho’s music beforehand to get a sense of her sound world. The haunting vocal works she wrote in the years leading up to “L’Amour de Loin” are gorgeous, among them “Lonh” (“Afar”) a setting of Jaufré Rudel’s poetry for soprano and live electronics from 1996 “Château de l’Âme” (1996) “Miranda’s Lament” (1997) and “Oltra Mar” (1999) for chorus. WHAT INFLUENCED IT “Before I had the story,” Ms. Saariaho said by phone, “I was already thinking about how to express these two very universal things and big mysteries of internal life which are love and death. ” An impossible love shot through with the death drive, presented through lush, contemplative music? Yes, Wagner’s “Tristan und Isolde” (already heard at the Met this season) makes its presence felt in “L’Amour de Loin,” as it does in much of modern opera. The stylized, dreamlike quality of Debussy’s “Pelléas et Mélisande,” its sense of shifting mists of sound that can suddenly coalesce in furious energy, is also a clear precursor. Messiaen’s “St. François d’Assise,” ruminative and largely interior, made an important impression on Ms. Saariaho, who had doubted that she had the traditional operatic gift for narrative thrust. WHO’S IN THE CAST Clémence will be sung by the bright young soprano Susanna Phillips, who’s mostly performed at the Met in Mozart operas. (The role was written for Dawn Upshaw, known for the purity of her tone.) The   Eric Owens, who had a breakthrough with the company as the malevolent dwarf Alberich in Wagner’s “Ring” cycle, may put that gift for moodiness (and his smoky voice) to good use as Jaufré. Tamara Mumford, with her rich, plummy mezzo, will be the Pilgrim. And the Met’s exceptionally versatile chorus takes a crucial role here as, Ms. Saariaho explained, “the sonic bridge between the soloists and the orchestra. ” WHO’S CONDUCTING Almost as exciting as the Met premiere of “L’Amour de Loin” is the company debut of Susanna Malkki, a conductor of wide range who has nevertheless made contemporary music something of a specialty. Recently installed as music director of her hometown Helsinki Philharmonic Orchestra, she also led the New York Philharmonic for the first time last year. Since the Met has been barely better at attracting female conductors than female composers, to have the two finally together in a single production does feel, yes, like the breaking of a glass ceiling. WHO’S DIRECTING Robert Lepage, the Canadian master of theatrical spectacle, declined the opportunity to direct the Salzburg premiere of “L’Amour de Loin,” but he’s now getting a second chance. His work hasn’t been seen at the Met since the last outing, in the spring of 2013, of his     production of Wagner’s “Ring” cycle. (Remember the massive set of mechanical seesaws that never seemed to work quite right?) If that “Ring” was widely considered a failure  —   “Pound for pound, ton for ton, it is the most witless and wasteful production in modern operatic history,” Alex Ross wrote in The New Yorker  —   it didn’t sway the loyalty of Peter Gelb, the Met’s general manager. He has brought Mr. Lepage back for Ms. Saariaho’s far more intimate, restrained and, well, short work, and the staging at least looks transfixing, with a Mediterranean created through LEDs. THE OPERA IS DEDICATED TO Gerard Mortier, one of the great impresarios of modern operatic history, who died in 2014. He shook up the stodgy Salzburg Festival when he took over its leadership in the early 1990s, and after the premiere of “Lonh,” at Salzburg in 1996, he proposed to Ms. Saariaho the idea of writing the opera that became “L’Amour de Loin. ”'"}, "time": 1742563984.957993}