{"duration": 0.09745240211486816, "input_args": {"text": "'The leader of the populist   migration Freedom Party of Austria (FPÖ)   Strache has proposed that known Islamists should be arrested and sent to prisons on “lonely islands”. [Mr. Strache made the comments in reaction to the terrorist attack in Manchester which saw the deaths of 22 people and over 60 injured. The FPÖ leader said Islamists were “tomorrow’s murderers” and the European Union needed to introduce “hard” measures against returning Islamic State fighters, Austrian newspaper Die Presse reports.  According to Strache, almost all of the Islamic State fighters who return to Europe from Syria and Iraq pose a potential security risk. He said many of these fighters, including the Manchester terrorist, are well known to authorities. “If they are banished to a lonely and   island, the problem is solved for the most part, instead of waiting until they strike and massacre people,” he said. He also urged EU member states to deport foreign radicals as soon as possible. “Against such radical people, only hard measures help,” he noted. Strache has long been an ardent critic of both radical Islamic terrorism, mass migration, and Islamisation in Austria. Taking over the leadership of the FPÖ in 2005, he has managed to transform the party from a fringe group to a major force in Austrian politics. Earlier this year Strache expressed a desire to completely ban Islamism in Austria. He called the ideology “antagonistic to women, antiliberal and corresponds to a fascist worldview” and added that any migrants from the Islamic world “may go back to their Islamic country, we have forced no one to come here”. On the subject of mass migration, Strache is clear that he thinks German Chancellor Angela Merkel is the “most dangerous woman in Europe” because of her   policies which led to over a million migrants entering Germany in 2015. After the surprise resignation of former Austrian   Reinhard Mitterlehner, the coalition government of the conservative Austrian People’s Party (ÖVP) and the Socialists has largely collapsed and early elections announced for October 15th. Whilst the ÖVP has seen a boost in polls due to the new leadership of popular Austrian Foreign Minister Sebastian Kurz, the FPÖ have remained in the contention. Some have predicted a possible coalition government between the conservatives and the FPÖ as Mr. Kurz has been the main proponent for the recent banning of the Islamic full face veil and has agreed with other proposals like housing incoming asylum seekers on islands until they can be properly processed. Austria, OGM poll:  : 31% ↑ : 28% ↑ : 26% ↓ : 9% ↓ : 4% ↓  —   Europe Elects (@EuropeElects) May 21, 2017, '"}, "time": 1742628456.7586312}