{"duration": 0.10800766944885254, "input_args": {"text": "'UNITED NATIONS  —   Already furious over President Trump’s visa ban, Iran warned the United States on Tuesday not to escalate tensions over tests of Iranian missiles  —   tests that his administration’s new United Nations ambassador called “absolutely unacceptable. ” The Iranian warning, made in Tehran by Foreign Minister Mohammad Javad Zarif, came a day after American and Israeli officials accused Iran of having conducted a missile test that they said had violated a United Nations Security Council resolution. The United States called an urgent meeting of the Council on Tuesday to discuss the grievance, making Iran the subject of the first diplomatic skirmish at the United Nations by Nikki R. Haley, the former governor of South Carolina who is Mr. Trump’s new ambassador. “The United States is not naïve,” she told reporters after the closed meeting. “We’re not going to stand by. You’re going to see us call them out as we said we would, and you are also going to see us act accordingly. ” Ms. Haley took no questions after her Security Council debut and proposed nothing concrete. The council agreed to refer the issue to its own sanctions committee for further inquiry, which is what it did last year after the last missile test by Iran. Iran has not confirmed that it conducted a test. But Mr. Zarif, at a joint news conference in Tehran with his visiting counterpart from France,   Ayrault, said he hoped that the new American administration would not use Iran’s military defenses “as a pretext to create new tensions. ” When the nuclear deal with Iran was reached in 2015 with major powers including the United States, they agreed sanctions on Iran would be relaxed in exchange for its verifiable pledges of peaceful nuclear work. A Security Council resolution “called upon” Iran not to undertake any tests of missiles designed to be capable of carrying nuclear warheads. Iran contends that it has not violated the resolution and that its missiles are not designed to carry nuclear warheads  —   which it already has promised not to make as part of the nuclear accord. Nonetheless, the American and Israeli accusations have created what amounts to an early test of the Trump administration’s toughness on Iran. During the presidential election campaign, Mr. Trump denounced the nuclear agreement and sometimes conflated it with the Iranian missile program. Arms control experts have cautioned that Iran’s missile tests are not prohibited under the nuclear accord. Ms. Haley used tough words about such tests but did not say whether her administration regarded them as a violation of the accord. “We have said with this administration that we are not going to show a blind eye to these things that happen,” she said. “We’re going to act. We’re going to be strong. We’re going to be loud and we’re going to do whatever it takes to protect the American people and the people across the world. ” Iran’s United Nations mission added to Mr. Zarif’s warning, issuing a Foreign Ministry statement asserting that Iranian ballistic missiles are “exclusively for legitimate defense. ” The statement said missile tests “are an integral component” of Iran’s   and that “we reject politically motivated comments regarding Iran’s missile program. ” Mr. Zarif also used the news conference on Tuesday to emphasize Iran’s anger over the Trump administration’s executive order on Friday suspending refugee admissions and prohibiting the issuance of visas to Iran and six other   countries. Mr. Zarif called the order “a shameful act. ” The order has upended the lives of thousands of Iranians, who are by far the largest population affected among the seven countries, which also include Iraq, Libya, Somalia, Sudan, Syria and Yemen. Iran’s government has pledged a reciprocal response to the order. Mr. Ayrault told reporters at the news conference that France had “expressed its concern” over Iran’s missile tests, according to an account by Agence  . Earlier, upon Mr. Ayrault’s arrival in Tehran, Iranian news media quoted him as saying the Trump administration’s order on refugees and visas amounted to “discrimination” and should be revoked.'"}, "time": 1742561920.195384}