{"duration": 0.05254364013671875, "input_args": {"text": "'A white football player from Idaho will not face jail time, after being accused of raping a mentally disabled black student with a coat hanger. [John R. K. Howard, 19, will instead serve out the punishment initially handed down by the courts in October of 2015, when he received a   probation and 300 hours of community service.  The courts decided against prison time, after a judge accepted a plea deal which allowed Howard to plead guilty and still maintain innocence. That plea, also known as the Alford plea, technically allows the client to continue maintaining innocence while acknowledging that the evidence against them is serious enough that the jury could find them guilty. The victim’s family have not spoken publicly, but according to the Independent, are “furious” at the court’s decision. The victim relayed the harrowing details of the rape during the trial of one of the other accused rapists, Tanner Ward. “After practice I was in the locker room, and one of my friends, he told me to come here, and I went over to him and gave him a hug,” the victim said during testimony obtained by the Guardian. “He told me to give him a hug. He had his hands out like he was going to give me a hug. And I gave him a hug, and he signaled for one of my other friends to come over. ” At that point, the rape commenced. The victim described his feelings during the rape, saying, “Pain that I have never felt took over my body. I screamed, but afterwards, I kept it to myself. ” The assailant, Howard, faced the charge of forcible sexual penetration by a foreign object, a charge which was later reduced. According to the Independent, “  …    following negotiations between the defence counsel and the State Attorney General’s office  —   in which the state prosecutor, Deputy Attorney General Casey Hemmer, claimed the attack was not racially motivated and did not constitute a sex crime  —   the felony rape charge was dropped and replaced by a lesser charge of felony injury to a child. ” The victim, aged 17 at the time of the attack, qualified as a minor. The judge also referred to the attack as “bullying. ” As for the racial component of all this, the Independent reports, “Legal documents filed by the family in a separate case suing the school and district officials claim before the attack, the victim was “taunted and called racist names by other members of the team which names included ‘ ’ ‘chicken eater’ ‘watermelon’ and [the  ]“. The family’s lawsuit against the school states that coaches on the football team encouraged players to toughen the victim up, presumably through fighting or hazing, and that coaches confronted the victim before the trial, convincing him to repudiate his own statement. During that episode, another coach recorded the conversation. According to the victim, “I just started telling a bunch of just lies because I wanted my friends back. ” The victim has attempted to commit suicide multiple times since the incident occurred in late 2015. Meanwhile, should John Howard violate his probation, he will face a possible prison sentence of up to ten years. However, according to the Independent, even this could get thrown out since Judge Stoker entered “a withheld judgement at the final hearing. ” Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742561987.945891}