{"duration": 0.1763288974761963, "input_args": {"text": "'WASHINGTON  —   President Trump issued an ultimatum on Thursday to recalcitrant Republicans to fall in line behind a broad health insurance overhaul or see their opportunity to repeal the Affordable Care Act vanish, demanding a Friday vote on a bill that appeared to lack a majority to pass. The demand, issued by his budget director, Mick Mulvaney, in an evening meeting with House Republicans, came after a marathon day of negotiating at the White House and in the Capitol in which Mr. Trump  —   who has boasted of his   prowess  —   fell short of selling members of his own party on the health plan. House Speaker Paul D. Ryan emerged from the session and announced curtly that Mr. Trump would get his wish for a vote on Friday. Mr. Ryan refused to answer reporters’ questions about whether he expected the measure to pass. Although the House Republicans’   meeting became a cheerleading session for the bill, their leaders braced for a showdown on the floor, knowing they were likely to be at least a handful of votes short of a majority for the health insurance bill and would need to muscle their colleagues to the last to prevail. Some conservatives were still concerned that the bill was too costly and did not do enough to roll back federal health insurance mandates. Moderates and others, meanwhile, were grappling with worries of their states’ governors and fretted that the loss of benefits would be too much for their constituents to bear. Mr. Ryan had earlier postponed the initial House vote that was scheduled for Thursday to coincide with the seventh anniversary of the Affordable Care Act’s signing. Mr. Trump confronted the possibility of a humiliating loss on the first significant legislative push of his presidency. At a White House meeting with members of the   Freedom Caucus earlier on Thursday, Mr. Trump had agreed to the conservatives’ demands to strip federal health insurance requirements for basic benefits such as maternity care, emergency services, mental health and wellness visits from the bill. But that was not enough to placate the faction, part of the reason that Thursday’s vote was placed on hold. As House leaders struggled to negotiate with holdouts in the hopes of rescheduling the vote, Mr. Trump sent senior officials to the Capitol with a blunt message: He would agree to no additional changes, and Republicans must either support the bill or resign themselves to leaving President Barack Obama’s signature domestic achievement in place. “We have a great bill, and I think we have a good chance, but it’s only politics,” Mr. Trump said earlier Thursday, as it was becoming clear that his negotiating efforts had failed to persuade enough members of his party to back the plan  —   which was years in the making  —   to repeal and replace the health law. Privately, White House officials conceded that competing Republican factions were each demanding changes that could doom the effort, placing the measure in peril and Mr. Trump’s chances of succeeding at a   legislative deal in jeopardy. With some of its demands in place, the Freedom Caucus ratcheted up its requests, insisting on a repeal of all regulatory mandates in the Affordable Care Act, including the prohibition on excluding coverage for   medical conditions and lifetime coverage caps. Mr. Trump, who has touted his negotiating skills and invited the label “the closer” as the vote approached, was receiving a painful reality check about the difficulty of governing, even with his own party in power on Capitol Hill. “Guys, we’ve got one shot here,” he told members of the Freedom Caucus at a meeting in the Cabinet Room, according to a person present in the room who spoke on the condition of anonymity because the meeting was private. “This is it  —   we’re voting now. ” “The choice is yes or no,” Representative Joe Barton, Republican of Texas and a member of the Freedom Caucus, said on Thursday night. “I’m not going to vote no to keep Obamacare. That’d be a stupid damn vote. ” Others were unconvinced. Having secured Mr. Trump’s acquiescence to eliminate the requirement that insurers offer “essential health benefits,” members of the Freedom Caucus pressed their advantage. While they did not specify precisely which regulations they wanted to eliminate, the section they wanted to gut requires coverage for   health conditions, allows individuals to remain on their parents’ health care plans up to age 26, bars insurers from setting different rates for men and women, prohibits annual or lifetime limits on benefits, and requires insurers to spend at least 80 percent of premium revenue on medical care. “We’re committed to stay here until we get it done,” said Representative Mark Meadows, Republican of North Carolina and the chairman of the Freedom Caucus. “So whether the vote is tonight, tomorrow or five days from here, the president will get a victory. ” He said 30 to 40 Republicans planned to vote “no” House leaders can afford to lose only 22 in order to pass the bill. But for every concession Mr. Trump made to appease critics on the right, he lost potential    supporters in the middle, including members of the centrist Tuesday Group who had balked at the bill’s Medicaid cuts and slashed insurance benefits. Moderate Republicans in that group went to the White House on Thursday but emerged unmoved in their opposition. “There’s a little bit of a balancing act,” conceded Sean Spicer, the White House press secretary. Representative Leonard Lance, Republican of New Jersey, said he still opposed the bill because he did not believe it would give people “complete and affordable access” to health insurance. At the same time, a new estimate of the bill’s cost and its impact on health coverage further soured the picture for wavering lawmakers. The nonpartisan Congressional Budget Office on Thursday issued a report on the revised version of the health care bill showing that it would cost more than the original version but would not cover more people. The report said the bill, like the original version, would result in 24 million fewer Americans having health insurance in 2026 than under current law. But recent changes to the bill, made through a series of amendments introduced on Monday, would cut its deficit savings in half. Instead of reducing the deficit by $337 billion, the new version of the bill would save only $150 billion over the decade. The budget office did not consider the effects of various additional changes that remain under negotiation, including eliminating benefit requirements and other health insurance regulations. A Quinnipiac University national poll found that voters disapproved of the Republican plan by lopsided margins, with 56 percent opposed, 17 percent supportive and 26 percent undecided. The measure did not even draw support among a majority of Republicans 41 percent approved, while 24 percent were opposed. President Trump appealed to supporters to weigh in, assuring them in a video on Twitter, “Go with our plan. It’s going to be terrific. ” The chaotic process that unfolded on Thursday exposed Republicans to criticism that they were moving recklessly in a desperate bid to get their plan passed. Representative Raúl Labrador, Republican of Idaho and a Freedom Caucus member, said the party’s leaders had tried to ram through the measure over their members’ objections. He panned what he described as a “brute force” strategy that resembled the approach of former Speaker John A. Boehner, Republican of Ohio. “It’s better to get it right than to get it fast,” Mr. Labrador said. It was not clear that the changes that Mr. Trump has agreed to and those being demanded could survive. Under the strict budget rules being used to advance the bill, changes to the Affordable Care Act must affect federal spending or revenues. Regulatory measures that affect private health policies, not government programs like Medicaid, are highly likely to be challenged by Senate Democrats. If the Senate parliamentarian rules in the Democrats’ favor, those changes in the House would be stripped from the bill. The emerging power of the Freedom Caucus, a group that has been historically marginalized in policy making but a thorn in the side of leadership, is one of the surprises of the rushed health care debate. The group has been empowered by the addition of Mr. Mulvaney to the senior White House staff, and Mr. Trump’s disengagement from policy details, coupled with his intense desire to score a win after a rocky start to his presidency. Mr. Obama stepped into the fray on Thursday with a lengthy defense of his law on the seventh anniversary of its signing, and a call for bipartisan improvements. “I’ve always said we should build on this law, just as Americans of both parties worked to improve Social Security, Medicare, and Medicaid over the years,” he wrote in a mass email to followers. “So if Republicans are serious about lowering costs while expanding coverage to those who need it, and if they’re prepared to work with Democrats and objective evaluators in finding solutions that accomplish those goals  —   that’s something we all should welcome. ” The Affordable Care Act requires insurers to provide “essential health benefits” in 10 broad categories, including maternity care, mental health care, addiction treatment, preventive services, emergency services and rehabilitative services. Mr. Spicer defended the removal of the “essential health benefits” regulations, saying that it would accomplish Mr. Trump’s stated goal of reducing health care costs. “Part of the reason that premiums have spiked out of control is because under Obamacare there were these mandated services that had to be included,” Mr. Spicer said. Family planning groups and advocates for women’s rights criticized Republican plans to roll back these requirements. “Paul Ryan and his House members are willing to sell out the moms of America to pass this bill,” said Dawn Laguens, an executive vice president of the Planned Parenthood Federation of America. Conservatives say the mandates, as interpreted in rules issued by the Obama administration, add to the costs of health insurance and make it difficult for insurers to offer   options to meet consumers’ needs. Democrats say that the purpose of insurance is to share risk, and that without federal requirements, insurers would once again offer   policies. Before the Affordable Care Act took effect, maternity coverage was frequently offered as an optional benefit, or rider, for a hefty additional premium.'"}, "time": 1742562369.0994787}