{"duration": 0.09435582160949707, "input_args": {"text": "'Alfred Hitchcock explains James Comey, the media and 2016’s ‘MacGuffin’ It takes a master of suspense to decode the final plot twists of this election. By Neal Gabler Posted on November 7, 2016 by Neal Gabler \\nIt is impossible to count the myriad ways in which the media botched FBI Director James Comey’s Friday announcement that the agency had found a cache of emails that seemingly (a key word) pertain to Hillary Clinton’s use of a private server. I heard the news via CNN at an airport while waiting to board a plane. No one needs to be told that CNN is a journalistic disgrace—a textbook case of the decline of American media, all the more depressing because, unlike Fox News and MSNBC, it purports to be a real news organization. Instead, it is a ratings machine, and it is beyond contemptible. \\nSo what I heard was Wolf Blitzer in his customary tizzy, as if Pearl Harbor had just been attacked, breathlessly ballyhooing Comey’s missive to Congress and asking what seemed to be an endless queue of talking heads to weigh in on what is now routinely called a “bombshell.” This too is a textbook example of media practice. In the movies, bombast has replaced narrative. The last half-hour of every blockbuster is obligatory and generic: noise, lots and lots and lots of noise, and a gazillion special effects until any vestige of story evaporates and your head throbs. Cable has done something similar with news. It is all pitch, no content. The hysteria can transform anything into a drama, which is precisely cable’s intention. \\nThis has been true of the Clinton emails since the beginning. It was always something of a hoax—a new chapter for a hungry media juicing its audience. Not one in a hundred voters can tell you the awful crime Clinton was supposed to have committed or why it matters. Not one in a hundred—and I would include journalists—have any idea of what really went down with these emails, as I discussed in an earlier post that highlighted the one reporter, Garrett M. Graff of Politico , who actually did something it appears no other reporter thought of doing: read the FBI’s summary account of the investigation. \\nIn effect, then, the Clinton emails have always been what the great film director Alfred Hitchcock called a “MacGuffin,” which Hitchcock described as the “device, the gimmick, if you will, that sets the plot in motion.” And he continued: “It doesn’t matter what it is. And the logicians are wrong in trying to figure out the truth of a MacGuffin, since it’s beside the point. The only thing that really matters is that in the picture, the plans, documents or secrets must seem to be of vital importance to the characters. To me, the narrator, they’re of no importance whatever.” \\nIt takes Alfred Hitchcock to reveal the secret of the emails as well as the basic operating principle of our political media. To the media, the emails are the primary plot device. In reality, they mean nothing. And I should add this: Should Donald Trump win this election, and he very well might now, historians 50 years from now will be scratching their heads over how something so inconsequential as a private email server could possibly have swayed the election. Emails! Really! How do we explain a MacGuffin overtaking our politics? \\nThe thing is that while the media have been obsessing over the MacGuffin, they have missed entirely the real story—the story that historians will examine and ponder. Oddly enough, it was arguably one of the world’s worst newspapers, England’s right-wing Daily Mail tabloid, which is about 10 notches below our own New York Post , which is 10 notches below any real newspaper, that broke the deeper story . \\nThe Daily Mail reported that FBI agents were incensed over Comey’s decision not to prosecute Clinton (so, says the paper, was Comey’s wife) and many submitted resignations in protest. Even when real newspapers finally caught up with this angle, they soft-peddled the significance of the nation’s primary investigative agency being an in-house right-wing force that was determined to veer the election toward Trump. The later dump of Bill Clinton documents only underscores the determination of the FBI to turn the election. \\nThat is real and really disturbing news—colossally big news, giant headline news. With his sudden announcement, Comey may or may not have been trying to pacify the GOP, which would have been bad enough. It does appear he was trying to raise morale among the Gestapo at his own agency by aiding Trump. And let’s be clear: He knew he was aiding Trump. \\nThat the media have largely ignored this aspect is both astonishing and depressing. The New York Times very delicately compared Comey to the late J. Edgar Hoover, who used the agency for his own devices, largely to settle personal grievances and advance his right-wing agenda. (And I mean very delicately. The media have always treated Comey as Diogenes.) \\nBut then the media are so caught up in their own hysteria over emails, they don’t have distance to view the big story. And when they aren’t preoccupied with the emails, they are preoccupied with how Comey’s revelation, seemingly in violation of Justice Department protocols and the Hatch Act, will affect the election. So you go from the MacGuffin to the horse race without ever having to engage anything substantive. \\nYou could say that Comey brilliantly played the media for his own benefit, knowing that they couldn’t resist and certainly wouldn’t investigate a new plot twist. Hitch knew the difference between an insubstantial MacGuffin and something that was important. Comey realized that the media don’t. Their confusion, along with their unwillingness to out the FBI and its seemingly alt-right agenda, could wind up being the decisive element in this election. It is the campaign equivalent of that deafening superhero movie climax—all noise, no sense. This post was first published on BillMoyers.com . \\nNeal Gabler is an author of five books and the recipient of two LA Times Book Prizes, Time magazine’s non-fiction book of the year, USA Today’s biography of the year and other awards. He is also a senior fellow at The Norman Lear Center at the University of Southern California, and is currently writing a biography of Sen. Edward Kennedy.'"}, "time": 1742563536.5022538}