{"duration": 0.036994218826293945, "input_args": {"text": "'The Reason Why Jade Helm Is Obama’s Favorite Conspiracy Theory May Surprise You By Kristie on November 22, 2015 Subscribe \\nPresident Obama has had to deal with his fair share of conspiracy theories. Even before he was elected he had to deal with questions about his origin of birth. He’s also secretly a Muslim masquerading as a Christian. One of the best is that he is going to unarm Americans by taking our guns. I’m still waiting on that one. But in a recent GQ interview , President Obama revealed his favorite conspiracy theory – Jade Helm. Featured image by Boricuaeddie , available under a Creative Commons Attribution-Noncommercial license. \\nAs most will recall, Jade Helm was one of the largest military training exercise ever conducted on U.S. soil. In July of this year, roughly 1,200 U.S. military troops participated in exercises that spanned seven states. Jade Helm included New Mexico, Arizona, and Texas. As we all know though, this exercise proved itself to be a great opportunity for the bitter right-wing to start up the conspiracy machine. \\nWhile this resulted in great ratings for the likes of Alex Jones , Jade Helm turned out to be a — military exercise — not a military led plot for Obama to take over the country and stay in power as a dictator. No wonder Jade Helm entertained Obama. Only a right-wing nut-job would believe something like that. \\nBut why is that Obama’s favorite conspiracy theory? He explained after GQ asked : “What’s the most entertaining conspiracy theory you ever read about yourself?” \\nObama then answered : “That military exercises we were doing in Texas were designed to begin martial law so that I could usurp the Constitution and stay in power longer. Anybody who thinks I could get away with telling Michelle I’m going to be president any longer than eight years does not know my wife.” \\nYou see, even the leader of the free world answers to somebody. About Kristie \\nKristie is 22-years-old and resides in Nashville, TN. While reading is a passion, she also has a passion for writing. Reporting on social issues such as LGBT rights, racial injustices, and religious intolerance, she also has a vested interest in the current political climate in America. Connect'"}, "time": 1742563787.67261}