{"duration": 0.1717393398284912, "input_args": {"text": "'How to Survive a Nuclear Fallout Ad 728×90 – HBS Account – 2149237058061490 http://blogs.naturalnews.com/survive-nuclear-fallout/ \\nBy Caleb Stephen \\nPosted Friday, October 28, 2016 at 07:54am EDT \\nKeywords: fallout , Nuclear , nuclear attack , nuclear attack survival , nuclear bomb , nuclear bomb survival , nuclear power , nuclear radiation , nuclear war , nuke , radiation , survival , tactical nuke With the ongoing tensions between the United States and Russia, fears of a nuclear World War 3 breaking out are running at an all-time high. \\nWith that in mind, I thought it needful to write an article on how to survive the aftermath of a nuclear fallout. Obviously we could discuss the likelihood of such an event occurring but that isn’t within the scope of this article. Personally I believe that at this point in time, such a scenario is not at all far fetched, however the situation is very fluid and thus things could change at any time. \\nBasically there’s two main types of nuclear weapons out there. First, you’ve got what is known as the ‘tactical’ nukes and then the intercontinental sort – the stuff that would basically flatten the earth. In that case there’s no point even trying to survive that. I’m going to be talking about how to survive a tactical nuke incident. #1. Don’t be anywhere near ground zero \\nObviously the first step to surviving the initial explosion is to not be there in the first place. Of course, there’s not a ton that you can do if you happen to be in the wrong place at the wrong time. You’ve just got to hope that you exit this world pretty quick – which would most certainly happen if you’re anywhere close to ground zero. \\nThe tremendous heat and sheer force of the explosion is enough to kill anyone and flatten anything within an 8 km radius of the detonation site. The intense thermal radiation emitted by the flash of light at detonation is enough to blind you, burn your flesh and start fires in the impact zone. \\nIf you’re outside when this happens and you happen to survive, you should take immediate cover in a building. If you get any debris on you, you should wash it off with soap and water as soon as possible. \\nAs a survivor of the initial explosion, you now have around 10 to 20 minutes to bail out of the area before a lethal amount of radiation (fallout) comes down from the mushroom cloud. In those 10-20 minutes, you need to get at least 1.5 km (1 mile) from the blast zone to survive the fallout however within 24 hours lethal radiation will spread with prevailing winds so keep moving to safety. You should feel for the wind and begin running perpendicular to it – not upwind or downwind. #2. Getting to shelter \\nIf you can’t get out of ground zero for whatever reason, then you need to get to shelter as soon as possible. Get into the deepest underground basement that you can find, or the highest story (above the 9th level) if possible. \\nIf you are in the fallout zone, but safely sheltered, you need to remain there for at least 9 days. During this time, food and water should be carefully rationed and clothing layered up to prevent radiation. \\nReally the best way to survive a nuclear event is to prepare for one. \\nRemember the nuclear fallout shelters of the Cold War era? Well that’s what you need to be inside to survive. But not just any shelter. It’s got to meet a number of different specifications which I am not going to go into because you can find plenty of information on that if you Google ‘how to build a nuclear fallout shelter’ etc. #3. Personal protection measures \\nProtecting your body from harmful radiation and fallout particles is your number one priority after getting to shelter. \\nLike I said before, being prepared prior to such an event is very important which is why it’s a good idea to carry the gear I’m going to talk about shortly inside a ‘Go Bag’ that you can keep in your car, house or workplace. \\nSome quick first aid tips: It is necessary that all wounds should be covered to prevent contamination and the entry of radioactive particles. Any burns caused by radiation must first be washed and then normal burn first aid procedure should be followed. \\nNow let’s look at the gear you should have ready before a nuclear attack happens. \\nGas mask: You’ll need a gas mask to protect your face and respiratory system from airborne pathogens and chemical particles. Israeli Military Surplus M-15 Gas Masks fitted with NATO 40 mm CBRN filters are some of the best and cheapest around, yet are getting harder and harder to find these days with huge supplies flying off the shelves in the relatively recent Ebola scar. I have the M-15 civilian version of this gas mask and it’s extremely comfortable, has a port for a hydration tube and best of all it’s been tested in real life conditions in the Middle East. \\nMilitary chemical suit: These suits provide optimal protection from chemical and biological attacks and are used by the British army. These are surprisingly cheap yet are proven to work by soldiers whose lives depend on them in everyday combat situations. You can get these for around $25 from Amazon.com \\nGloves: You’re going to need gloves to protect your hands from contact with chemical pathogens and biological particles. Long, chemical resistant gloves can be found online, at some supermarkets and hardware stores. You can get these at around $10 – $15 depending on the brand etc. \\nBoots: In order to have full protection from chemical and biological hazards, it is important to have a good pair of rubber over-boots to protect your feet and legs from chemical and biological particles from coming into contact with your body. Ensure that you ‘blouse’ your trousers inside your boots for maximum protection. Once again, these boots that I recommend are used by the UK military and you can get them on Amazon.com for around $25. \\nNuclear Protection: There is a way to reduce the effects of nuclear radiation in your body. Its called Potassium Iodide and its available on Amazon for less than $10 for a pack of 14 tablets. What this basically does is it reduces the chances of harmful radioactive iodine from entering your thyroid glands. \\nIf you don’t have any of these when a nuclear attack happens, you can improvise. As I mentioned before, clothing should be layered up to prevent radiation contact with the skin. Cover your eyes with close-fitting sunglasses or improvised goggles. \\n#4. Decontaminating food and water \\nWater and food will be contaminated by debris from the nuclear fallout making procurement and consumption difficult, however it is not impossible to make them safe to consume. \\nWhenever possible, try to use water that has been sealed in a container or bottle as you can safely assume that the water inside the sealed container is not contaminated. Wash the container thoroughly with soap and water or boil it for at least 10 minutes before breaking the seal. If water in sealed containers is not available, your next choice, only under emergency conditions, is water from springs. Again, boil the water for at least 10 minutes before drinking. Keep the water covered while boiling to prevent contamination by airborne pathogens. \\nYour last choice (only in an extreme emergency where sealed water and spring water are unavailable) is to use standing water (that found in small pools, ponds and basically any water that does not flow). Contaminants, micro-organisms and germs can survive easily in stagnant water. First, boil this water as long as practical to kill all organisms. Next, filter it through a cloth to remove the nasties. \\nIn all cases mentioned above, use water purification tablets (following all directions on the bottle/packaging) after boiling and initial filtration prior to consumption. \\nLike water, you can also assume that sealed containers or packages of processed food are safe. To ensure safety, decontaminate all food containers by washing with soap and water or by boiling the container in water for 10 minutes. This is where it helps to have a decent supply of sealed buckets and containers of military-style MRE’s and freeze-dried foods such as Wise Foods and Mountain House. \\nYou should consider supplementing your sealed rations with local plants, animals and produce only in extreme emergencies. Unfortunately, no matter what you do to prepare or decontaminate the food, there is no guarantee that cooking will kill all the biological agents. \\nRemember, you can survive for a long time without food (at least 3 weeks, but can be longer), especially if the food you eat may potentially kill you! \\nIf you must use local food, select only healthy-looking plants, animals, fruit and vegetables. Do not select known carriers of organisms such as rats or other vermin. Always use gloves and protective clothing when handling and dressing animals, plants etc. Cook all plant and animal food by boiling only. Boil all food for at least 10 minutes to kill all pathogens. Do not try to fry, bake, or roast local food as there is no guarantee that all infected portions have reached the required temperature to kill all pathogens. Do not eat raw food at all costs! \\nObviously this article is nowhere near comprehensive, but I hope it gives you some idea of what you need to do in order to survive the aftermath of a nuclear attack. We can only hope and pray that such an event does not happen and that peace will prevail on this planet. You might also like…'"}, "time": 1742564041.3009117}