{"duration": 0.13628768920898438, "input_args": {"text": "\"  Donald   says   Friedrich Trump amassed 'substantial nest-egg' from Yukon hotel before heading to New York Donald   says \\nCanadians amused by the improbable presidential run of Donald Trump might be surprised to learn the role their own country played in shaping his story. \\nTrump’s grandfather started the family fortune in an adventure that involved the Klondike gold rush, the Mounties, prostitution and twists of fate that pushed him to New York City. \\nFriedrich Trump had been in North America a few years when he set out for the Yukon, says an author who’s just completed a new edition of her multi-generational family biography. \\nThat Canadian chapter proved pivotal for the entrepreneurial German immigrant, says Gwenda Blair, author of The Trumps: Three Generations That Built An Empire. \\n“It allowed him to get together the nest egg he’d come to the United States for,” the author and Columbia University journalism professor said in an interview. \\n“Whether he could’ve accumulated that much money somewhere else, in that short a period of time, as a young man with no connections, and initially not even English, is certainly … unlikely.” \\nHe’d left Europe in 1885 at age 16, a barber’s apprentice whose father died young. \\nTrump wanted a life outside the barber shop, far from the family-owned vineyards his ancestors had been working since they’d settled in Germany’s Kallstadt region in the 1600s carrying the soon-altered surname Drumpf. \\nHe sailed in steerage to join his sister in New York. \\nWithin five years he’d anglicized his name to Frederick; moved to the young timber town of Seattle; and amassed enough cash to buy tables and chairs for a restaurant. \\nHis next big move was heralded by the front page of the Seattle Post-Intelligencer of July 17, 1897, and its exclamatory headline: “Gold! Gold! Gold!” \\nIt described a resplendent scene at the port involving mountains of yellow metal and men returning from the “New Eldorado” with fortunes as high as $100,000. \\nTrump sold everything and headed north. \\nThe move to Canada spared him financial disaster. He not only sold off two Seattle eateries, but also land in nearby Monte Cristo, Wash. — right before floods and avalanches destroyed the nearby railroad and development plans for the town were scrapped. \\nBlair describes his perilous northward journey in early 1898. \\nAfter boarding a crowded ship to Alaska, Trump trekked over mountains, through Canadian customs, and to the Yukon River where he had to build a boat from scratch and transport a year’s worth of personal supplies. \\nThe worst was a notorious mountain pass. The U.S. National Parks Service estimates 3,000 animals died on the White Pass, with many bones still visible today in its so-called Dead Horse Gulch. \\n“Owners whipped horses, donkeys, mules, oxen, and dogs until they dropped. The bodies were not buried or even moved,” Blair writes. \\n“Travellers … had no choice but to walk over the remains. As the months went by, the walls of the pass were stained dark red from the blood.” \\nTrump smelled opportunity. \\nHe opened a canteen along the route, Blair says, where weary travellers likely stopped for a bite of Arctic roadkill. There are records for similar establishments along the route, Blair writes: “A frequent dish was fresh-slaughtered, quick-frozen horse.” \\nThis established a pattern for Trump’s Canadian business model. \\nIt’s summed up in one chapter title: “Mining the Miners.” \\nUnlike other gold-crazed migrants, Blair wrote, “[Trump] realized that the best way to get [rich] was to lay down his pick and shovel and pick up his accounting ledger.” \\n‘Liquor and sex’ \\nIn his three years in Canada, Trump opened the Arctic Restaurant and Hotel in two locations with a partner — first on Bennett Lake in northern B.C., and then moving it to Whitehorse, Yukon. \\nTheir two-storey wood-framed establishment gained a reputation as the finest eatery in the area, Blair said — offering salmon, duck, caribou, and oysters. \\nIt offered more than food. \\n“The   sex,” Blair wrote. She cited newspaper ads referring obliquely to prostitution — mentioning private suites for ladies, and scales in the rooms so patrons could weigh gold if they preferred to pay for services that way. \\nOne Yukon Sun writer moralized about the backroom goings-on: “For single men the Arctic has the best restaurant,” he wrote, “but I     sex.” \\nThe Mounties initially tolerated the rowdiness. There were exceptions, according to the legendary Canadian writer Pierre Berton. People faced forced labour or banishment from town if they cheated at cards; made a public ruckus; or partied on the Lord’s Day. \\n“Saloons and dance halls, theatres and business houses were shut tight one minute before midnight on Saturday,” Berton wrote in “Klondike Fever.” \\n“Two minutes before twelve the lookout at the faro table would take his watch from his pocket and call out: ‘The last turn, boys!”‘ \\n‘I wouldn’t call him a pimp’ \\nTrump acted as cook, bouncer, waiter. \\nBut Blair cautions: “I wouldn’t call him a pimp.” \\nShe said backroom ribaldry was part of the restaurant package in those towns, and it’s not clear how the arrangement worked: “As somebody trying to attract business to his restaurant, of course he would have liquor. Of course he would arrange easy access to women. A pimp is, I think, a different business model.” \\nBy early 1901, trouble was brewing. \\nThe Mounties announced plans to banish prostitution, and curb gambling and liquor. Trump quarrelled with his partner. Gold strikes were getting scarcer. \\n“The boom was over, Frederick Trump realized,” Blair wrote. “He had made money; perhaps even more unusual in the Yukon, he had also kept it and departed with a substantial nest-egg.” \\nHe returned to Germany with US$582,000 in today’s currency, and found a wife. But he was greeted as a draft-dodger for being away and becoming a U.S. citizen during his military years. \\nSo he was deported from his own country. He boarded a ship for New York, his wife pregnant with Donald’s dad. \\nThe elder Trump died of pneumonia in 1918, leaving behind some real estate. His son built the empire, his grandson the global brand. \\nIronically, their heir is now running for president on a platform of mass-deportation. But Donald and grandpa share some traits — an entrepreneurial spirit, and formative youthful adventures in Canada. \\nDonald met his first wife, Ivana, at the Montreal Olympics. Related Posts:\""}, "time": 1742562323.6234362}