{"duration": 0.18945550918579102, "input_args": {"text": "'Print Email http://humansarefree.com/2011/02/proofs-that-reincarnation-exists-part.html Dr. Helen Wambach set about to prove how foolish the whole idea of reincarnation was by conducting a scientific investigation of her own in the 1960s. Dr. Wambach questioned 1088 white, middle class subjects from California while they were under hypnosis. The subjects were asked to regress to a former life. If this was successful, they were told to remember everything when they awoke from their hypnotic state. Not satisfied to just ask who they were or when they lived, Dr. Wambach also made them describe their status, gender, race, clothing, footwear, utensils, tools they used, their money, housing and even the food they ate! The subjects frequently reported viewing the former lives much like watching a movie. They said they could experience whatever the individual experienced in that particular time. They heard ancient languages but did not understand them. The full details of their experiences were recorded both during and after the sessions. Never before had past life inquiries been that specific or involved such a large population. The results of her 10 years of research surprised everyone. The detailed reports were thoroughly investigated to see if they corresponded with historical facts. In all but 11 cases (less than 1%), the descriptions were totally accurate. Some of the results are as follows: -50.6 % of the past lives reported were male and 49.4 % were female -- this is exactly in accordance with biological fact. -The reported class or status was exactly the same proportion as the estimates of historians of the specific period of the former life. In general, this was approximately 10% upper class, 20-35% from the middle class and the remaining 55-70% from the lower class. Although the proportion of middle class was higher around 1000 BC, the proportion later dropped and increased again after 1700 AD. -The recall by subjects of clothing, footwear, type of food and utensils used was better than that in popular history books. She found over and over again that her subjects knew better than most historians -- when she went to obscure experts her subjects were invariably correct. A subject who lived around 1000 B.C in Egypt described different types of clothing worn by the upper and lower classes. The upper classes wore either a half-length or full-length white cotton robe. The lower classes wore something like an exotic-looking type of pants that was wrapped downwards from the waist. The researchers viewed historic records of clothing worn during the respective periods and could therefore compare it to the descriptions of these subjects. The descriptions were found to be correct. -Between 60-77% of the ancient population lived at or below the poverty level. They wore home made clothes and lived in simple, even primitive, abodes. The majority were farmers who labored every day in the fields. None of the hypnotized individuals recalled being a famous historical figure. Those who recalled a high social position seemed highly dissatisfied with their lives, as if it was a burden to be alive. Those who recalled being a farmer or a member of a primitive tribe appeared to be content. -Their recollections were from different geographic areas and races during their prior life. Dr. Wambach divided them into several categories: Caucasians, Asians, Indians, Blacks and Middle Eastern descent. Around 2000 BC, only 20% of the subjects reported that they were Caucasians. They lived widely dispersed throughout what is now known as the Middle East, the Mediterranean, Europe and Central Asia (Kazakhstan, Uzbekistan, etc., called the central steppe during historical times). -Five subjects stated that they lived in Central Asia between 1000 and 2000 BC. They recalled living in tents, which was common to the migrating population of that region. Amazingly, they found themselves to have white skin color and yellow or golden hair! At first, this didn\\'t appear to be historically accurate as Asian people should have black hair and darker skin. However, recent discoveries of mummified corpses along the ancient Spice Route have shown that there were indeed light skinned and blond haired people! -Eating habits of people who lived around 500 B. C. were not that bad. Twenty percent of the subjects recalled that they ate poultry and sheep meat. However, between A.D. 25 to A.D. 1200, people\\'s eating habits were rather poor. The subjects recalled that the food was tasteless. One young man said: \"I will never bad-mouth McDonald\\'s food\". It is not surprising that those who recalled the best tasting food were those who remembered a prior life in China. -Among all the subjects, 62% died of old age and illness, 18% percent died violently during war, or some other manmade catastrophe and the remaining 20% died in accidents. Many of the prior lives ended during the two world wars, as well as civil wars in Asian countries. Thus, these people reincarnated shortly after they died. We will see more evidence for this in our next striking example. Surprisingly, Dr. Wambach found that 69% of the subjects who had died during the 1850\\'s were Caucasians, while between 1900 and 1945, only 40% were Caucasian. It seems that transmigration of the different races increased after 1945. This is still not understood. Dr. Wambach went on to publish her findings in RelivingPast Lives: The Evidence Under Hypnosis and Life Before Life (1984). Although she began her work as a skeptic, she would later write, \"...Fantasy and genetic memory could not account for the patterns that emerged in the results. With the exception of 11 subjects, all descriptions of clothing, footwear, and utensils were consistent with historical records...\" And in later interviews, she stated, \" I don\\'t believe in reincarnation - I know it! \" As we mentioned in the report, Dr. Wambach\\'s results suggest that reincarnation usually happens shortly after death. In the next example we will see an amazing case that saw a reincarnated woman who was able to be reunited with her husband and son after remembering her former life at the age of 4 years old! This famous case was thoroughly studied by both believers and skeptics of reincarnation -- including the famous religious teacher, Mahatma Ghandhi. It happened in the 1930s in India... The Story of Shanti Devi On January 18,1902, a daughter was born to a family named Chaturbhuj, residents of Mathura, India. Her name was Lugdi. When Lugdi was 10, a marriage was arranged with a man named Kedarnath Chaube, a shopkeeper in the same village. After puberty, Lugdi became pregnant for the first time but her child was stillborn following a Cesarean section. During her second pregnancy, Kedarnath took her to the government hospital at Agra, where a son was born, again through a Cesarean. There were some complications, however, and several days later, on October 4, Lugdi\\'s condition deteriorated and she died at 10 A.M. One year ten months and seven days after Lugdi\\'s death, on December 11, 1926, a beautiful daughter was born to Babu Rang Bahadur Mathur of Chirawala Mohulla, a small locality of Delhi. The girl was named Shanti Devi. Shanti was unusually quiet and hardly spoke until she was four years old. When she started talking, she surprised her family by telling them, \"This is not my real home! I have a husband and a son in Mathura! I must return to them!\" Shanti said that her husband was in Mathura where he owned a cloth shop and they had a son. She called herself Chaubine (Chaube\\'s wife). The parents considered it a child\\'s fantasy and took no notice. They got worried, however, when she talked repeatedly about it and, over time, narrated a number of incidents connected with her life in Mathura with her husband. On occasions at meals, Shanti would say, \"In my house in Mathura, I ate different kinds of sweets.\" Sometimes when her mother was dressing her she would tell what type of dresses she used to wear. Curiously, she mentioned three distinctive features about her husband: he was fair, had a big wart on his left cheek, and wore reading glasses. She also mentioned that her husband\\'s shop was located in front of Dwarkadhish temple. This strange talk continued. By this time Shanti was six-year-old, and her parents were perplexed and worried. Shanti even gave a detailed account of her death following childbirth. They consulted their family physician who was amazed how this little girl correctly described so many details of the complicated surgical procedures she claimed to have endured. As Shanti grew older, she insisted that her parents take her to Mathura. All this time, however, she never mentioned her husband\\'s name. It is customary in India that wives do not speak the name of their husbands. Even when specifically asked, Shanti would only blush and say, \"I will recognize him, if I am taken there.\" Her parents thought their daughter was mentally ill and tried everything to discourage her strange talk. But Shanti continued to talk about her \"other family\" and gave a specific address and more details about her previous home, her husband and his family. Eventually, a teacher in Ramjas High School Daryaganj in Delhi, told Shanti that if she told him her husband\\'s name, he would take her to Mathura. Convinced, she whispered his name into his ear -- \"Kedarnath Chaube.\" The teacher told her that he would arrange for the trip to Mathura after he had made some inquiries. He wrote a letter to Kedarnath Chaube, detailing all that Shanti had said, and invited him to visit Delhi. Amazingly, the teacher received a quick reply from Kedarnath, admitting that his young wife, Lugdi, had recently passed away. Even more amazing was that all the details Shanti had described about her old house and members of her previous family were all true! Shanti\\'s story spread all over India through the media. Many intellectuals became interested in it. When the famous teacher and pacifist, Mahatma Gandhi, heard about it, he personally talked to Shanti and then requested her to stay in his ashram. Gandhi instigated a committee to investigate and report on the claims the little girl was making. Soon a committee of 15 prominent people, including polticians, national leaders and members from the media was formed and they persuaded Shanti\\'s parents to allow her to accompany them Mathura. Upon arriving at Mathura by train, Shanti -- on her own -- quickly lead them straight to her previous home. She correctly described what it had looked like years earlier -- before its recent refurbishing. As a test, to mislead Shanti Devi, Kanjimal introduced Kedarnath as his elder brother. Shanti blushed and stood on one side. Someone asked why she was blushing in front of her husband\\'s elder brother. Shanty said, \"No, he is not my husband\\'s brother. He is my husband himself.\" Then she addressed her mother, \"Didn\\'t I tell you that he is fair and he has a wart on the left side cheek near his ear?\" She then asked her mother to prepare meals for the guests. When the mother asked what should she prepare, she said that he was fond of stuffed potato paranthas and pumpkin-curry. Kedarnath was speechless, as these were his favorite meals. He asked whether she could tell them anything \"unusual\" to help him accept that this was really his former wife. Shanti replied, \"Yes, there is a well in the courtyard of our house, where I used to take my bath.\" She was also able to relate extremely intimate information, such as extramarital affairs of family members that no one, outside the family, could possibly have known. But that wasn\\'t enough to convinced Kedarnath. He needed something reallyprivate, that only his dead wife would know. Apparently, Lugdi had suffered from painful arthritis, making it difficult for her to move. This presented problems when the couple tried to have sex. But Lugdi had found a way to move that enabled her to have relations with her husband. This was an extremely private matter, yet Shanti was able to describe this in intimate detail.That convinced him! '"}, "time": 1742563423.5072649}