{"duration": 0.1738431453704834, "input_args": {"text": "'$23 Save America From Donald Trump to Fix America, or, Did Your Mother Drop You on Your Head? Posted on Nov 2, 2016 \\nBy Juan Cole / Informed Comment \\nWhen I trained as a lifeguard they warned us that you have to be very careful how you approach a drowning victim flailing around. They will be so happy to be rescued that they will grab you and pin your arms and freeze up, and then you’ll both sink to the bottom and drown. You have to keep your distance, keep your arm stiff, and pull them out straight on their back, head out of the water, to reassure them. Then you can rescue them. The rescued teenager may not be a saint. Or they may have a bad family situation. You’re not thinking about that when the issue is whether they will live or die. Maybe they can straighten out their lives if they end up having lives. \\nSo America is drowning, and voting for Hillary Clinton is the equivalent of rescuing it. It is the stiff arm to deal with a hysteria that will otherwise sink us. \\nI see too many people agonizing over this election. Will they vote for the Greens? Libertarians? Is Hillary as bad as Trump? \\nDid your mother drop you on your head? This is a drowning country we’re talking about. You don’t have the luxury to sit on the beach and decide whether to go in. And maybe you’ll be delivering the country to someone who is a bad mother. But it will be a live country and maybe the mother could be reformed. Drowned people can’t be reformed. Remember when, in Princess Bride, Inigo Montoya brings Westley to Miracle Max (Billy Crystal) to be brought back from the dead? And Miracle Max discovers Westley isn’t dead, and so could be revived: “Mostly dead is slightly alive. With all dead, well, with all dead there’s usually only one thing you can do.” Inigo Montoya : “What’s that?” Miracle Max : “Go through his clothes and look for loose change.” \\nAn America under Trump would be all dead. Donald J. Trump is the greatest danger to American democracy in modern history. He openly menaces journalists, he keeps inquiring about why we have nukes if we can’t use them, he wants to steal Iraq’s petroleum wealth, he promises to use torture, he courts the KKK, he proposes tax and other policies that will vastly increase inequality and bankrupt the government, and he wants a trade war with China. I could go on with a litany of fatal “policies” (actually more like wicked quips) all the way down the page (and blog pages don’t really have a fixed bottom). All this is not to mention his criminal notion that he has a right to French kiss and fondle any woman he can get hold of with his tiny hands. \\nAdvertisement Square, Site wide \\nI think it is entirely possible that if Trump were president, I and other writers and journalists and critics could be targeted for dirty tricks. It happened even under Bush. This is one reason it is so dangerous to have a standing massive domestic surveillance program of our current sort; one election could put it into the hands of a dictator. \\nI get it. Hillary is Wall Street. She will do nothing to rein in the excesses of the financiers (and not all financiers need reining in, but many do). One of our country’s most pressing problems, wealth inequality, will almost certainly get worse in a Clinton presidency. She probably will continue Obama’s phony “all of the above” energy policy, which will mean an overheated climate (we need a Manhattan project to get off oil, coal and gas immediately). She is a foreign policy hawk and seems committed to intervening in Syria. She is in the back pocket of Haim Saban and the AIPAC Israel lobbies and has a virtual love fest with Israeli PM Binyamin Netanyahu. \\nBut here’s a surprise. We live in a society dominated by corporations the way medieval Britain was dominated by feudal lords. The only difference is that we have a higher standard of living than did the serfs and we get to decide between two Establishment candidates for high office regularly. \\nOver two-thirds of America’s $18.5 trillion economy is generated by Fortune 500 big corporations (in 2014 it was 73%!) \\nWhen I was a graduate student 36 years ago it was about 50%. (Small business accounted for most of the other half then, and were the source of the vast majority of innovation). \\nAlthough the corporations and the economists who ultimately actually mostly work for them maintain that this system is efficient and based on competition, in fact there are lots of monopolies or near-monopolies, and it clearly has giant inefficiencies (compare your internet bill to that of people in Europe). They also complain about government regulation, but through lobbying most of them have actually captured the legislators who are supposed to be regulating them. Often they write the laws for the legislators and just have the latter sign them. \\nThe corporations don’t always get their way. But they most often do. It would have cost them trillions of dollars in profits if the US had moved quickly to green energy in the 1990s when the climate crisis first became apparent, so they waged a PR campaign to smear climate scientists like Michael Mann and pull the wool over the eyes of most consumers to keep them burning coal, gas and oil as long as possible. In the US alone, they managed to put on the order of an extra hundred billion metric tons of carbon dioxide into the atmosphere in the past 20 years through this dishonest ruse. It’s like blowing up billions of atomic bombs, making the earth hotter and hotter. No one has been president who would have stood in their way, and almost nobody has been allowed in Congress who would obstruct them either. They are starting to give up on coal, and Obama did stab them in the back on that fuel, but they still burn as much gas and oil as they like and flare up methane when they frack both, destroying the environment (not to mention water pollution). I say ‘they’ because there are essentially interlocking directorates. A lot of the Fortune 500 is heavily invested in hyrdocarbons. That is why it is so hard to do environmental investing, because if you buy a bank stock you are buying Exxon-Mobil.There isn’t any more pressing issue than addressing climate change, and I’m sorry but nothing Hillary has said about the issue is actually ambitious enough to fit the scale of the emergency. \\nSo I know. \\nBut you aren’t thinking about this right. The people screwed over by the 1% are hurting and have turned to Trump because he talks like a maverick, even though he will screw them over even harder. They are drowning. \\nYou can’t rehabilitate the patient if the patient drowned. And America would drown, would be all dead, would be beyond redemption, under 4 years of Trump. \\nSec. Clinton is from that generation of baby boomer Democrats who decided in the Reagan era that they had to become Eisenhower Republicans ever to hold office. So she surrendered to Wall Street & etc. We know that. But she can be pressured, just as Eisenhower was pressured (if only we could get back to his tax policies!) We can oppose her if she drags her feet on key issues. It will be easier to pressure her from below if we can also take back Congress and can get some liberals on the Supreme Court. \\nWe can’t oppose Trump because he has made it clear that he will rule as dictator and will brook no opposition. He has lots of goons to sic on his critics already, and would pick up their entire Federal government if he wins. \\nI have made my peace with being a serf who gets to vote for the candidates the two parties (mainly representing the corporations) present me with. (It is a first past the post system, so creating a 3rd party is almost impossible). It is a very corrupt system, maybe the most corrupt on earth . I’ll probably never see a president who really represents the mainstream of America, because of voter suppression and big money in politics and the corruption of corporate media. I blow off my frustrations at this blog and maybe I change a few minds here and there. Civil disobedience seems increasingly called for with regard to hydrocarbons. But we can’t do that if America is dead. And Clinton won’t kill it, however wrongheaded some of her announced policies. We survived Bush, though with a $6 trillion bill, and we can survive Clinton. We can’t survive Trump. TAGS:'"}, "time": 1742561830.0117214}