{"duration": 0.028932809829711914, "input_args": {"text": "'Email \\nAt least two sources are confirming that a Grand Jury has been called to decide if there is enough evidence to indict four FBI HRT team members in the coverup of LaVoy Finicum , who was shot and killed on January 26, 2016 by Oregon State Police. \\nGuerilla Media Network reports : \\nGuerilla Media Network received information 10 days ago that a Grand Jury had been called to decide if there was enough evidence concerning a coverup by \"FBI HRT\" Team Members on the ground in Burns Oregon, to formally charge them with a crime. Members of HRT, (Hostage Rescue Team) have been accused of shooting at LaVoy Finicum as he exited his vehicle on January 26, 2016 with his hands in the air. \\nLegal sources in Portland told GMN that they were aware the Grand Jury had been convened but did not have information about an actual indictment, at the time the information was passed down to us. \\nGMN went on to report that Bob Powell of The Truth is Viral stated that he confirmed with sources at the Justice Department that an indictment may soon come against the 4 agents involved in the coverup. \\n\"In all there were 4 shots fired at Mr. Finicum by these rouge agents, before and after he exited his truck,\" Powell said. \\nFinicum\\'s widow, Jeanette Finicum, also confirmed that she had heard about the convening of the Grand Jury as well. She has also filed a wrongful death lawsuit against Oregon State Police and called on American Patriots to stand against the growing tyranny of the central government . \\n\"I\\'ll believe it – When I see it,\" said Mrs. Finicum on Wednesday. \\nThough the Oregon State Police were apparently responsible for actually shooting Finicum to death , the FBI claimed to investigate several of their agents concerning failing to report that they fired shots at Finicum and his vehicle . They apparently disposed of the bullet casings as well. \\nListen to Bob Powell\\'s report on what is taking place. Don\\'t forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . shares'"}, "time": 1742562017.7480834}