{"duration": 0.11854171752929688, "input_args": {"text": "'By Jeffrey Snider, Alhambra Investment Partners \\nThere is a growing body of public work that suggests Federal Reserve officials are prepared now for a very different sort of normalization than what had been envisioned up until this year. That comes, as noted earlier , with the realization that the economy is not just in rough shape but likely to remain that way for the foreseeable future . \\nThe important caveat left off that bleak pronouncement is actually ceteris paribus . So long as the current policy and monetary system remains firmly in place, there is little hope the global economy will just spontaneously ignite. Since economists and central bankers have made it clear they aren’t going anywhere despite being wrong about everything up to now, here we are. \\nEven Janet Yellen has been forced to concede that even if the Fed does manage to get on with further rate hikes, the ultimate destination for them in nominal terms is much less than prior “cycles.” Current thinking seems to be aiming for around 3% for the federal funds rate rather than 5% as had long been accepted. The way things are going, and as the Japanese showed , they will be lucky to get even half that far. \\nBut in what can be only another sign of just how twisted, upside down, and easily receptive to pretzel logic the mainstream is now, that is supposed to be a good thing especially for stocks. Writing today for BloombergView , Mohamed El-Erian, chief economic advisor for Allianz, makes this exact argument . \\nEquity investors have also been reassured by the growing — and correct — recognition that this Fed hiking cycle will depart drastically from historical norms. Instead of following a relatively linear path of increases at regular intervals, it will have pronounced “stop-go” characteristics. Also, and perhaps more importantly, the endpoint — or what economists call the “neutral rate” — will be considerably lower than recent historical averages. \\nHow in the world is that a good thing that would “reassure” equity investors ? Truly rational investors make decisions based on discounted information about the future, and what El-Erian suggests here (and he hasn’t been alone) is that stock investors show more preference for “accommodative” monetary policy than actual growth. A lower rate ceiling implies without much ambiguity continued awful economic conditions here and elsewhere around the world. But to the screwed up nature of mainstream thought, so long as monetary policy is lower overall continued stagnation is forgiven, perhaps even to be mildly celebrated? \\nWhat does it mean by claiming “accommodation” that gives “investors” so much apparent comfort? It can’t mean that in economic terms for obvious reasons; instead we are led to believe that low (meaning desperately insufficient) growth isn’t all that bad so long as interest rates don’t rise too far. Investors are supposed to be paying for growth , not the failure of interest rate “stimulus” to seed it. If the Fed feels it can’t raise rates all that much, with a true “ceiling” yet to be determined, it is a much riskier , not less risky, environment. \\nThe idea of a lower R* or r-star is truly a defining defeat, though it is, like El-Erian’s attempt here, being spun into what is nothing more than rationalization . As I wrote in September , the falling R-star can mean nothing else: \\nThere is more complexity when we talk about inflation, of course, but by and large it is commodity prices that have thwarted John William’s (or Janet Yellen’s) “normalizing” narrative. Commodities have been falling more intensely since the middle of 2014 but really dating back to the middle of 2011. Both of those inflections recall and are related to obvious eurodollar or global wholesale money events. Thus, even subscribing to Wicksell’s theory, the current rate must now be, as it has been, above the natural rate, unambiguously indicating “tight” money. Whether it is via Friedman’s interest rate fallacy or Wicksell’s natural rate hypothesis, both arrive at the same conclusion due to seemingly intractable market prices. \\nCentral banks assume that means they have to “stimulate” more when in fact it is just their math telling them they haven’t stimulated at all – at least not where it counts and has been needed. Translating depression into econometrics is a long and costly affair, but it is at least starting to be done, slowly and in discrete pieces. R* may yet be of some great value, insofar as further calculating just how little monetary authorities know about money. \\nReception of and belief about QE have been very much cult-like and it was thus too thinly constructed to withstand being so thoroughly debunked. This is not even close to making the best of a bad situation; it is instead claiming positive attributes that just don’t exist, being downright offensive to common sense. How anyone, let alone El-Erian, wrote that paragraph (contained within an article further rationalizing the latest of the “rising dollar”) without awareness of its very basic flaw can at best be described as intentionally obtuse while still bordering upon nakedly deceiving. The world of the near future is going to be bad, worse than everything “we” have been expecting, but take heart, the Fed’s monetary policy will reflect just that . Translating it from the original mainstream thought-bubble language truly reveals its truly absurd premise… The Fed failed, and that changes everything; including and especially what is to be made of “accommodation” and what it is that might have “reassured” equity investors in the past and might do so (or not) going forward.'"}, "time": 1742563184.8637955}