{"duration": 0.03156542778015137, "input_args": {"text": "'Comment \\nAmid the seemingly friendlier atmosphere in the South China Sea, China was reportedly in a ‘ready for combat’ position as it prepares to position its first aircraft carrier in the region. \\nWhile some claimant countries in the highly disputed maritime zone, such as the Philippines, have shifted their foreign policies and began dealing with China bilaterally, tension in the region is far from over. Asserts Position In The Region \\nAs reported by the state-run news website the Global Times , China is battle ready and is prepared for any possibilities or conflict that may arise in the region. The aircraft carrier, Liaoning, is the first of its kind in the Chinese Navy. \\nAlso Read: South China Sea Row – What Will Happen Now As Donald Trump Enters The Picture? \\nThe 60,000-ton Liaoning sports a launch pad that is much wider than a typical football field. This aircraft launcher also features high-tech military capabilities that China can use in performing its patrols and surveillance in the region. \\nBut Li Dongyou, a Chinese political commissar who was aboard the Liaoning, said the showing off of the aircraft carrier was not intended to ignite tension in the region. Always War Ready \\n“As a military force, we are always prepared for war and our combat capacity also needs to be tested by war. At this moment, we are doing our best to promote our strength and use it to prevent war, and are prepared for actual combat at any time,” Dongyou was also quoted saying by the Global Times . \\nAlso Read: South China Sea Row – India Challenges China’s Ambitions In The Region \\nMembers of local and foreign media were allowed to board the massive aircraft carrier, but the tight security measure has been implemented. Chinese officials also admitted that they specifically told those who were invited on what they can see and not see. \\nWhile the world awaits Donald Trump’s position in the region, his close aide hinted that the president-elect won’t abandon its Asian allies, the Associated Press reported. \\nIf you want more World news , subscribe to our newsletter or follow us on Twitter and Facebook . \\n'"}, "time": 1742628500.5955281}