{"duration": 0.06308102607727051, "input_args": {"text": "'LOS ANGELES  —   “The Birth of a Nation,” “Hidden Figures” and “Loving” are three films with the same theme (racism) the same ambitions (Oscar glory) and the same pathway into theaters (big studio labels). All three, along with several other movies that examine racial politics, are set to create thunderclaps at the Toronto International Film Festival, which begins on Thursday night and represents the unofficial starting gate for the 2017 Academy Awards. Yet these pictures, as pointed out by Cameron Bailey, the festival’s artistic director, “could not be addressing race in more different ways, and to put them in a box  —   as ‘black films’ or whatever  —   would just be more racism, frankly. ” Speaking by telephone, Mr. Bailey added, “I think it’s fair to have a conversation about their similarities, but I think it’s almost more important to be aware of their differences. ” Mr. Bailey’s concern is real, especially given the shorthand that is forming around certain films on the early awards circuit and the #OscarsSoWhite outrage that defined the last two awards cycles. In conversations about the contours of the coming season, some Hollywood players have started bifurcating (some would say segregating) award candidates  —   the films that examine racism and the black experience on one hand, and everything else on the other. Another worry involves diminishing artistic experience, or “flattening,” as Mr. Bailey put it, which can happen when films are narrowly defined and labeled. Giving as an example Barry Jenkins’s “Moonlight,” a poetic film about a young black man growing up in a poor section of Miami, Mr. Bailey said in a   email, “The histories that shape the black experience are crucial to ‘Moonlight,’ but they don’t contain it, any more than ‘Foxcatcher’ and ‘Whiplash’ should be defined mainly as movies about the white experience. ” (“Moonlight” will also play in Toronto.) A closer look at “Loving,” “Hidden Figures” and “The Birth of a Nation”  —   the first two counting on Toronto to rev up their awards chances, and the third hoping for a resuscitation  —   reveals drastically different artistic statements and cinematic approaches. “Loving,” written and directed by the Southern filmmaker Jeff Nichols, is a   relationship drama that imparts its messages  —   love is love let’s try harder to appreciate one another  —   in a whisper. It looks at an interracial marriage in 1950s Virginia. Mr. Nichols (“Mud”) based his latest film on the true story of Richard and Mildred Loving, whose marriage broke their state’s   law and led to the landmark Supreme Court ruling that deemed marriage a human right. “All this talk of civil rights,” a friend tells Mildred (played by Ruth Negga) as they watch television news. “You need to get you some. ” Mr. Nichols said he wanted “Loving,” which also stars Joel Edgerton, to draw its power from subtlety. “It’s hard to make movies that people experience instead of just receive,” Mr. Nichols said, adding that the film’s intimate feeling was meant to humanize the issue at stake. “Especially in an election year like we’re in, everyone goes to their corners and gets ready to fight, and what gets forgotten are the people at the center of these topics. ” Mr. Bailey noted that “Loving” counted integration dramas like “Gentleman’s Agreement” as antecedents. (That film, directed by Elia Kazan and examining   won best picture at the Academy Awards in 1948.) Focus Features, a division of Universal Pictures, plans to release “Loving” on Nov. 4. Taking a much more rollicking approach is Theodore Melfi’s “Hidden Figures,” which tells the true story of black women who calculated rocket trajectories for NASA in the early 1960s. “Hidden Figures,” from Chernin Entertainment, Levantine Films and Fox 2000, a unit of 20th Century Fox, is not yet finished. But about 30 minutes of footage will be shown in Toronto, followed by a street concert by Pharrell Williams, who wrote songs for the film. The footage begins with the movie’s three lead actresses  —   Taraji P. Henson, Octavia Spencer and Janelle Monáe  —   stranded on the side of a rural road after their car breaks down. An arrogant white cop arrives, and the central conflict is established: These are three smart,   patriotic Americans who find themselves put down, underestimated and insulted because of their race. In a scene at NASA that finds Ms. Henson’s math whiz abruptly assigned to an office filled with hostile, white, male engineers, she approaches the only other woman, who is also white, to ask directions to the restroom. The icy response: “I have no idea where your bathroom is. ” (The only “colored” lavatory, as it turns out, is across campus.) At a time of particular togetherness  —   everyone in the film, black and white, is galvanized behind putting a man into space  —   the races could not be farther apart. “This isn’t a black movie, and this isn’t a women’s movie: This is an everyone movie,” said Margot Lee Shetterly, who wrote the book from which “Hidden Figures” is adapted. She continued: “Black history has always been about slavery and civil rights. There is a whole lot more than that. I want the full spectrum of the   experience reflected in the same way that other American experiences are reflected. ” Even so, the   producer Donna Gigliotti (“Shakespeare in Love”) who optioned Ms. Shetterly’s book, emphasized that “Hidden Figures,” set for   release, had an     ethos. “A real nail biter” is how Ms. Gigliotti, whose credits include “Silver Linings Playbook,” described the overall story, noting the   space travel effort at the center of the film. “They were mathematicians, which makes their story sound like homework,” she said. “But it’s not. It’s exciting. ” Perhaps the most scrutinized film at Toronto will be “The Birth of a Nation,” a sweeping antebellum melodrama with scenes of horrifying violence. The fiery film, based on the Nat Turner slave rebellion of 1831, was considered an Oscar   and balm for #OscarsSoWhite after its sizzling debut at the last Sundance Film Festival. But in recent weeks, following renewed attention on a 1999 rape case, controversy has swirled around Nate Parker, the film’s director, writer, producer and star. Mr. Parker was charged  —   and later acquitted  —   in that case, which occurred when he was a student at Penn State Mr. Parker’s former roommate Jean McGianni Celestin, who has a story credit on “The Birth of a Nation,” was convicted of sexual assault, but his conviction was later overturned. Their accuser later committed suicide. Mr. Parker declined an interview request for this article, but he will attend the Toronto festival, where he is expected to participate in    sessions and a news conference, according to a spokeswoman for Fox Searchlight, which has scheduled “The Birth of a Nation” for release in theaters on Oct. 7. Mr. Parker has noted that his film, which also stars Armie Hammer and Aja Naomi King, bears similarities to “Braveheart,” which won the best picture Oscar in 1996. That film tells the story of William Wallace (played by Mel Gibson) who roused and united the medieval Scots against their oppressors at a time when no one thought it was possible. “Nat Turner became a leader against incredible odds,” Mr. Parker is quoted as saying in the film’s production notes. “So often when we see slavery in popular culture, it is through stories of suffering and endurance. But Nat Turner’s is a more incendiary narrative he was a slave but also a true rebel against injustice. ”'"}, "time": 1742628547.5580761}