{"duration": 0.24901342391967773, "input_args": {"text": "'When the liberal class heard news media report Donald Trump won the Electoral College vote, numerous people experienced meltdowns that involved blaming anyone and everyone but Hillary Clinton’s presidential campaign. In particular, Green Party presidential candidate Jill Stein was one of the targets, even though the math did not point to Stein as a culprit for the outcome. \\nMSNBC’s Rachel Maddow wailed, “If you vote for somebody who can’t win for president, it means that you don’t care who wins for president.” It not only displayed the prejudice many liberals have against allowing more choices and more voices in presidential elections, but it also exemplified a denial among liberal pundits. They reflexively lashed out at Stein or Bernie Sanders in order to ignore their failure to recognize how Trump had a strong chance all along to win because voters were fed up with the neoliberal economic policies of Democrats. \\nFor this week’s “Unauthorized Disclosure,” the show returns with an interview with Jill Stein. She highlights what her campaign managed to accomplish. She looks back on smears she faced, such as the idea that she was anti-vaccine and says she views it as a “sign of the media’s weakness and also their fear and our strength.” Then, she shares how she was never confident Clinton would win the election and addresses the denial among Democrats, who do not want to confront the reality of what happened. She also lists off a number of initiatives and efforts she plans to help support in the aftermath of the election.\\nThe episode continues with an equally important interview with journalist Andy Worthington, who is one of the co-founders of the “Close Guantanamo” campaign. He regularly covers the Guantanamo Bay military prison, and we discuss the future of Guantanamo now that Trump is the president-elect. He also is a musician, who wrote a song about closing Guantanamo. We play part of it on the show. And, finally, Worthington is from the United Kingdom so we discuss the rise of far-right forces in both the United States and the UK. \\nCo-host Rania Khalek is in Lebanon. She currently plans to return to the show next week. \\nThe latest episode is available on iTunes. To listen to the episode (and also to download the episode), go here. A page will load with the audio file of the interview that will automatically play.\\n\\n*\\nBelow is a partial edited transcript of the interview with Jill Stein: GOSZTOLA: What did you manage to accomplish as a Green Party presidential candidate in this election that other previous Green Party presidential campaigns did not manage to accomplish? I noticed you managed to break into the establishment media in a way that had not been achieved in 2012. Did you feel that way?\\nSTEIN: Yes, but it was like the door was just barely cracked open. When you look at the numbers, we got something like three seconds of primetime network TV for I think it’s like 1700 minutes that Donald Trump got. Or to put it a different way, Donald Trump got about 35,000 times as much free airtime on mainstream media. Hillary got something like 20,000 times as much. So, it was good. It was an improvement compared to prior campaigns. \\nClearly, nowhere where near where we need to go. It was a beginning, and I think the consequence of that is that we earned three times as many votes as we earned in the past election. That is, in 2012 itself doubled our count from the prior election. I think the overall result of this election, which is basically a very dangerous and discouraging outcome, that is with the victory of Donald Trump. I think in a way that reflects how much this system is ready to change, and we can talk about that more later. But to my mind that’s a big victory in and of itself. \\nThere’s going to be a huge amount of buyer’s remorse out there, as Trump’s base—which wasn’t for Trump nearly as much as it was against Clinton and the Democrats—But as that base wakes up to the really awful reality of what Donald Trump will mean for their communities, their schools, their jobs, our economy, our climate, etc. As that group wakes up, it creates enormous momentum for change and enormous potential for change.\\nTo my mind, really one of the most important outcomes is that we are on the threshold. It is kind of a perfect storm for organizing right now. Not something would have wished for in their right mind, but that is what we have. And in addition, let me just say I think people are really in despair at the voting system that forced them to choose between a militarist and a neofascist, and what kind of a choice is that? So, it is a voting system in which people were voting against the person they hated the most or the person they feared the most, and it gives us a really awful outcome. \\nThis is the time for us to seriously consider voting reforms, and in particular, ranked choice voting is the alternative. We don’t have to search for it. It is already in effect in cities all over the country. The state of Maine passed this with very strong Green Party leadership and support. It’s now implemented for all state and federal elections now in the state of Maine, which is really exciting because this is a model that we can follow in other states now. \\nLet me mention a couple of other successes: that we now have automatic ballot access. Because of the vote count that we received in many states and new Green Party registrations, we will have automatic ballot access in many states. \\nWith strong Green support and leadership, marijuana legalization was passed in three states—California, Massachusetts, and Nevada, and in several others as medical marijuana. Some very important Green-backed and led citizen initiatives were passed at the state level in California and in Washington state that basically repeal the underpinnings of Citizens United . Or, I should say they call for a constitutional amendment, which will take away the false legal arguments on behalf of Citizens United . That is the idea that money equals speech and therefore unlimited amounts of money can be poured into our election system and hijack it. So that’s a very positive development. There are a number of positive developments. \\nOne other area I think that for me is especially exciting is that we really established strong alliances with social movements in this campaign, and in particular, with people who are the very powerful spokes men and women for those movements. And that includes solidarity with the Standing Rock movement, having been the only presidential candidate to go there and to actually participate in civil disobedience along with these indigenous leaders. With the Black Lives Matter campaign, and in particular, we were present in Baton Rouge at the flooding. We participated in many of the protests against police violence, marched with the mothers, so-called Million Moms March in Washington, DC. You know, stood strong with the Muslim community. \\nThere are many initiatives that are going full tilt now as we come out of this race. That includes the fight against student debt, having been the only campaign to call for actually bailing out the students. Grassroots libertarians as well. There are many grassroots libertarians that share with us the excitement about pushing forward ranked choice voting so we can actually bring our values into our voting system and open up the elections to more voices and more choices. \\nFinally, the election debate commission, which 75 percent of voters were screaming to open it up to the other two candidates, that is to Gary Johnson and myself. We’ll be working with voters of all stripes but also with many of the grassroots libertarians. So there’s just really exciting initiatives and momentums that are ready to go now. \\n*** \\nGOSZTOLA: I’d like to conclude with the critical question related to the amazing collapse that people are witnessing right now within the Democratic Party and the complete denial on their part. Many people who were friendly to the Clinton campaign and worked for the press or are part of Clinton’s campaign are blaming Sanders for “poisoning” the minds of millennial voters and that’s perhaps why Hillary Clinton was unable to defeat Donald Trump. But it seems that we’ve had this huge rejection of neoliberalism and all of the different policies connected and I’d like to know from you—Since you went around campaigning in the United States, did you get the sense while campaigning that the Clinton campaign was going to be trounced by Donald Trump? \\nSTEIN: We certainly over the past year saw enormous anguish, suffering, misery, resentment against the Democratic Party. I, myself, while the polls were often misleading—I, myself, never had confidence that Hillary Clinton was going to win. I think that was an expectation I shared, but I’ve just seen so many completely unpredictable outcomes to have taken any kind of assurance from the misleading polls about that. \\nI have to say from my point of view I’ve really seen a system in meltdown. And I say this as a medical doctor, having seen the healthcare system collapse, having seen the incredible misery that people are in, having seen jobless and under employment. And especially the misery of an entire generation that is really locked into hopelessness right now without decent jobs, without the ability to get out of college debt, without the ability to have their own place, without the ability to start a family and have kids, really having been denied the essence of reproductive freedom. This is a generation that cannot have a family. It’s just staggering with few exceptions, but many people are being denied that now. \\nAnd then, having to deal with the climate catastrophe that’s barreling down on us. I think in this election the veil was lifted from this catastrophic system, which is unraveling on all quarters; now in the political realm. But it’s been clear that this has been a house of cards for quite some time, and whether it was going to be a Donald Trump and a victory of Republicans or whether it would be some other form of outright revolt, it wasn’t clear. It’s been obvious that this has been a sick and corrupted system. There was no way that something good was going to come out of this. \\nSo a lot of people, myself included, were braced for something terrible, and whether it was Hillary Clinton’s victory, which would have been awful in its own way, in a much subtler way but still a disaster for us and our future. Or whether it was a Trump victory or something else, I think many of us had been bracing for this catastrophe for the communities of color that have lived under oppression for 500 years. \\nWhat’s happening now is not altogether new. It is indeed a disaster. It is particularly a disaster for the LGBTQ community, for many immigrants who are living in fear, for people of color, and there are many informal reports now of people being subjected to more abuse and harassment on all quarters and of many suicides in the trans community. This is a really regrettable and vile outcome of a very sick and corrupted system, which must be more than reformed. We need more than ever now a peaceful nonviolent revolution, a transformation, and we have the capacity to do that now. \\nWhen we’re divided into a thousand separate movements each based on our own identity or our own biggest need, we are divided and conquered. But now so many people are being absolutely slammed across the spectrum of justice, it creates a potential for a very powerful coalition. This is a coalition that we have seen in the making for quite some time. I want to mention along those lines that there is a political coalition called Left Elect, which brings together the many small parties of resistance and that we will be having a conference this spring. I believe it’s in March this year. Again, stay tuned through Jill2016.com or through our social media, @DrJillStein. We’ll keep you posted. \\nI think it is a very positive sign that so many from the Bernie campaign woke up the minute Bernie endorsed Hillary, and the floodgates opened into our campaign. I think this has a lot to do with why our vote numbers tripled, why we are growing Green Party chapters all over the country, where the party had really gone into dormancy. It’s now awake and alive and kicking all across the country. \\nWe can transform this breaking point that we’re at into the tipping point that we need to take back our future and make it healthy, just, green, and democratic. We will be continuing by the way to do our livestreams with the incredible spokespeople and with grassroots leadership. Yesterday, we streamed with Andrea Merida, one of the co-chairs of the Green Party who just came back from a week at Standing Rock. We will be continuing to live stream from the front lines, from the real sites of inspiration and action around the country. So I urge you to join us, to be a part of this unstoppable team, and for us to continue to reject the efforts the Democrats, still, to blame everybody else but themselves for this catastrophe. \\nRemember, they themselves, as revealed by the WikiLeaks emails, they lifted up Donald Trump, helped the media to take him seriously, gave him credibility, lifted him up as part of this so-called Pied Piper candidates that they were promoting in order to make Hillary Clinton’s task easier. They brought this on themselves with the horrific policies that Bill Clinton, in fact, signed and Hillary Clinton supported—NAFTA, Wall Street deregulation, the crime bill that opened the door to mass incarceration, particularly to people of color. And, indeed, they opened the door to the attack on immigrants with the Clinton anti-immigrant bill of the 1990s, and it is indeed, while Republicans of hate and fear against immigrants, Democrats are the party of deportations, detentions, and night raids. \\nI say it’s time to leave them both behind. Let’s reject this lesser evil and the greater evil. Let’s fight for the greater good like our lives depend on it because they do. We can do that knowing that, in fact, when we stand together, we not only have the vision, the values, and the solution. We have the numbers that we need to take our future back, and make it work—an America that works for all of us and a world that works for all of us. The power to do that is still in our hands. \\nThe post Interview: Green Party Presidential Candidate Jill Stein On Clinton’s Loss To Trump appeared first on Shadowproof .\\n'"}, "time": 1742562702.3796031}