{"duration": 0.11928343772888184, "input_args": {"text": "'Comments \\nA new federal government document has surfaced which details the housing discrimination practices of Donald Trump and his family’s vast Trump Organization’s realty holdings in New York City’s outer boroughs of Queens and Brooklyn. \\nIt’s the first time that tangible proof of Donald Trump’s history of racial discrimination practices has been confirmed in an official record. \\n  found this key document from the archives of University of Michigan’s Law School, markgin the very first time that the complete list of Trump’s covered properties has been discovered. \\nThe Republican nominee spent most of the 1970s battling federal housing discrimination charges alongside his father, a fact Democratic nominee Hillary Clinton highlighted in an attack ad this week . \\nHowever, Trump has always publicly denied culpability and hid behind the confidentiality of settlement discussions to avoid full disclosure like this new public record document exposes. In fact, he has always never admitted guilt, according to Politifact : \\nThe case was settled and Trump never admitted guilt, though his company had to agree to stipulations meant to prevent future discrimination at his rental properties. Donald Trump’s Properties Had 75% Fewer Minorities Than Lived Nearby In Other Buildings \\nThe Trump Organization had 9,050 apartment units covered under the settlement agreement with the federal government, which housed only 399 minority residents across 35 covered properties, or only 4.4% of Fred and Donald Trump’s New York City rental real estate empire. \\nThe public record document proves the Trump Organization and principals Fred and Donald Trump’s buildings schemed to ignore the Fair Housing Act of 1968 but failed miserably and ultimately landed in court for two years starting in 1973. \\nThe Trumps eventually capitulated to the government in 1975. \\nKeep in mind, the federal government named Donald Trump personally in their Fair Housing complaint, so he wasn’t just a bit player in the dark history of his family business’ illegal management practices — but a named defendant. \\nThe Justice Department named 39 buildings in their original complaint, which leading to a story entitled, “ Major Landlord Accused of Antiblack Bias ,” on the front page of the New York Times. \\nOut of the total of 14,000 units that The Times says the Trump family owned in 1973, 68% of their holdings fell under the settlement. \\nThe Trumps segregated a small group of non-white tenants into a few of their properties, maintained a single building with just over half minority residents, and virtually excluded minorities from 24 New York City buildings of the 36 total project covered in their 1975 settlement with the federal government which covered a mind-boggling 9,500 apartments. \\nFive of the Trump buildings affected had no minority residents whatsoever, and more than half of the buildings had less than ten minority residents. \\nThere’s also spreadsheet below with easier to read copy of the key public record document proving Trump’s discriminatory housing practices, but you can see the original here: \\nWho Wrote This Letter At The Department of Justice Civil Rights Division And Why Did They Write It? \\nDrew S. Days, III transmitted the Trump Leak (below) to the Open Housing Center of New York shortly after his appointment by President Carter. It was prepared by career Civil Rights division lawyer Harvey L. Hanley in the summer of 1977, \\nDays , was the Assistant Attorney General in charge of the Civil Rights division then, where he personally oversaw the Trump family’s desegregation efforts. \\nHe went on to become a Yale Law Professor, and eventually the US Solicitor General under President Clinton in 1993. \\nDays’ memo reveals that the portfolio of Trump Organization realty which was covered in the 1975 settlement, and their slow progress of racial integration as of July 11th, 1977. \\nBy then, the Trump Organization had designated two additional buildings to accommodate significant blocks minority renters compared to other buildings. \\nBut across the board, non-white occupancy rates only went from 4.4% to 7.2% with 663 residents of color housed. \\nWhen you factor out those two buildings – named Argyle Hall and Westminster Hall who accepted 48 of only 264 new minority tenants – the Trump Organization’s overall minority occupancy rate stood at only 6.45%. Trump Organization Management Actively Discriminated Against African-Americans \\nThe New York Times reported in August that Trump’s property managers – both New York and Cincinnati, Ohio – marked minority housing applications for denial whether they were segregationists or more likely following their orders strictly. One manager spilled the beans on Trump’s discriminatory practices: \\nA former Trump superintendent named Thomas Miranda testified that multiple Trump Management employees had instructed him to attach a separate piece of paper with a big letter “C” on it — for “colored” — to any application filed by a black apartment-seeker. \\nThat wasn’t only reason to date why the federal Department of Justice’s Civil Rights division monitored fully 2/3rds of the Trump family’s realty empire for racial discrimination in the 70s. \\nCase records like the one provided by DCAT below show that Trump’s manager would tell prospective tenants that their neighborhoods were safe, “because there were no blacks around.” \\nFurthermore, as in many housing discrimination cases, the below court document also documents testers visiting the Trump Organization’s buildings and coming out with different results based on the skin color of the prospective tenant. Federal Court Document from US vs. Trump. Click to Open in New Tab New York’s Minority Population Doubled In the 1970s \\nIt’s important to note that demographic data from the US Census illuminates this report to show that most of Trump’s buildings had far fewer minorities than the communities in which they sat. \\nUS Census data indicates that Kings and Queens Counties were the two most populous counties in New York back then, with 4.6 million people in 1970. (doc 2, page 11 in link) US Census Data. Click to Open in New Tab \\nRoughly 20% of that 1970 population was listed as African-American. \\nBy the 1980 US Census , the population of the two New York City boroughs dipped slightly, however the percentage of African-American and hispanic residents in the two boroughs was 40% of the population. (pages 29-30 in link) \\nThis data demonstrates that the Trump Organization’s covered apartments only had one fourth of the proportion of minority residents compared their surrounding neighborhoods in the mid-1970s, while 15% percent of their properties had zero African-Americans residing inside them. \\nFor the purposes of this story, we used the blended average of minority population in both districts, since there’s a large portfolio of buildings. Conclusion \\nDonald Trump settled a federal Fair Housing Act lawsuit because most of his buildings often had few, or even no minority residents. \\nA careful examination of his record shows that his family’s real estate empire systematically excluded African-Americans from its housing, and even after settling with the US Department of Justice, the Trump Organization continued to use the same tactics of loading just a few properties with most of the minority tenants.'"}, "time": 1742562107.4432461}