{"duration": 0.05854988098144531, "input_args": {"text": "'  \\nThe NRA has just s tated the obvious – that President Obama does not have the ability to confiscate guns, nor has he ever tried. This statement is an acknowledgment directly from the NRA, after years of warning their members that a Democratic president is going to take away their guns. This debunks the ludicrous “Obama conspiracy” to repeal the Second Amendment and confiscate guns, once and for all. \\nThe article was featured in NRA magazine, “America’s 1 st Freedom” on June 9 th , in which the author admits that “Congress writes the laws, not the president” and therefore the president does not have the power to repeal the right to bear arms. The piece was written after the author took issue with Obama’s “rude” response to a gun store owner named Rhune, on “gun control,” which is below as follows: \\n“First of all, the notion that I or Hillary or Democrats or whoever you want to choose are hell-bent on taking away folks’ guns is just not true. And I don’t care how many times the NRA says it,” declared Obama. \\n“I’m about to leave office. There have been more guns sold since I’ve been president than just about any time in U.S. history. There are enough guns for every man, woman and child in this country. And at no point have I ever proposed confiscating guns from responsible gun owners. So it is just not true.” \\nThe author’s response proves that the NRA has known all along that Dems will not take their guns and now they have publicly admitted it: \\n“Congress writes the laws, not the president. He could then have listed the many attacks on the right to bear arms — from Operation Fast and Furious to Operation Choke Point to Obama’s attempted ban on common ammunition for AR-15-type rifles to his using a “pen and phone” to push anti-gun executive actions. But Rhude respectfully stayed silent.” \\nAlthough neither Clinton or Obama have ever claimed they are going to take away guns from law-abiding gun owners, this has been the NRA’s campaign against Democrats for years. The NRA has basically just admitted to blatantly manipulating their members through scare tactics – but it hasn’t stopped them from reviving this tired old conspiracy theory and applying it to Hillary Clinton, who, for the record, does not want to take your guns. \\nIndeed, even in the doubtful scenario that Congress and the president agreed to repeal guns, the Supreme Court would veto this as unconstitutional. NRA members need to acknowledge once and for all that a democratic president is not going to seize their firearms and stop listening to the organization that clearly does not have their best interests in mind.'"}, "time": 1742562305.2849529}