{"duration": 0.05007624626159668, "input_args": {"text": "'posted by Eddie One of the world’s largest travel sites announced that it will no longer sell tickets to “attractions” that exploit and put wild or endangered animals at risk. This is big news. After six months of meeting with the animal rights organization People for the Ethical Treatment of Animals (PETA), Association of Zoos and Aquariums (A.Z.A.), Global Wildlife Conservation (G.W.C.) and a few others, one of the world’s largest travel websites announced that it will no longer sell tickets to animal attractions that exploit and may put endangered or wild animals at risk. This means tourists will no longer be afforded the option to ride elephants, pet tigers, or swim with dolphins – at least not through TripAdvisor. The purpose is to take a stand against activities that exploit wild animals and, ultimately, improve the creatures’ well-being. After all, dolphins and elephants held in captivity for entertainment purposes can suffer severe physical and psychological damage, according to various animal rights groups. Says Stephanie Shaw, a corporate liaison for PETA: “TripAdvisor is a leader in the industry and we understand and applaud that this is a precedent-setting move.” The NY Times reports that the site will also launch an education portal to help educate travelers about animal-welfare concerns and why they shouldn’t be disappointed about not being offered a chance to visit with wild animals. As True Activist has mentioned in the past, the processes required to ‘tame’ wild animals are often barbaric and cruel to the beasts involved, which is why they should not be supported by those who are advocates for equality. Read more about how elephants’ spirits are “broken” here . “We believe the end result of our efforts will be enabling travelers to make more thoughtful choices about whether to visit an animal attraction and to write more meaningful reviews about those attractions,” says TripAdvisor’s chief executive and co-founder, Stephen Kaufer. The site will stop selling tickets to some attractions immediately, but the majority of booking policy changes will be implemented in early 2017. The company says that there will also be an appeals process for the hundreds of affected attractions should they be able to prove they are within the new policy. If you’re an avid traveler and are an advocate for the animals, you have one more reason to support TripAdvisor. In the past, the conscious agency has prohibited listing or posting reviews of blood sports such as bullfights and canned hunts. What are your thoughts? Please comment below and share this news! source:'"}, "time": 1742561811.2337193}