{"duration": 0.17760801315307617, "input_args": {"text": "'WASHINGTON  —   The S. S. Andania, plain and sturdy, pulled into New York Harbor on April 11, 1923, after a slow journey from Liverpool, England. In a   cabin was a   Irishman named Richard Michael Cawley, fleeing poverty and war. The son of a tailor from a rural village, Mr. Cawley, then 20, had come of age during a guerrilla conflict. Now, with Irish fighting Irish, he had made his way to America to join his older brother and uncle. He would settle in Chicago, a city bursting with Irish Roman Catholic life marry a teacher find work as a streetcar driver and sing ballads by the piano on Saturday nights. He would become an American citizen, march in St. Patrick’s Day parades and visit Ireland, looking, one cousin marveled, like “a real Yank. ” It is a familiar American tale, except for this: Mr. Cawley’s grandson and namesake, Michael Richard Pence, is the vice president of the United States, which is in the thick of a roiling immigration debate. On Thursday, Mr. Pence, wearing a spray of shamrocks in his lapel, welcomed Enda Kenny, the Irish prime minister, for breakfast at the vice president’s residence as part of the White House’s St. Patrick’s Day festivities. For Mr. Pence  —   who calls his grandfather “the proudest man I ever knew, and the best man I ever knew”  —   and his family, it is a deeply personal celebration. “He’d be busting his buttons, that’s what he’d say,” Mr. Pence’s mother, Nancy Pence Fritsch, 84, said of her father, who died in 1980. The story of Mr. Cawley  —   pieced together from interviews with historians and relatives in the United States and Ireland, as well as archival documents  —   is one of family ties and a man whose experience had an impact on Mr. Pence. Some facts have been lost to time memories do not align perfectly with the written record. When Mr. Pence was a toddler, overshadowed by talkative older brothers, his grandfather taught him to recite “Humpty Dumpty” in Gaelic. As a boy, he shared the older man’s admiration for Presidents John F. Kennedy and Franklin D. Roosevelt, though both eventually left the Democratic Party. He inherited Mr. Cawley’s sense of humor and easy manner, Mr. Pence’s oldest brother, Gregory Pence, said  —   qualities that helped him thrive in politics. Mr. Pence declined to be interviewed a spokesman, Marc Lotter, when asked about Mr. Cawley’s immigration status, said he “entered this country through Ellis Island. ” Barry Moreno, the librarian and historian at the Ellis Island Immigration Museum, reviewed the ship’s manifest and other records and said Mr. Cawley’s paperwork  —   including a 1936 document stating that he had been “lawfully admitted”  —   appeared to be in order. Mr. Cawley’s journey does not offer a precise parallel to those of today’s refugees escaping   nations like Syria. Mr. Lotter said President Trump’s efforts to restrict immigrant travel would not have applied to Mr. Cawley because “Ireland is not compromised by terrorism. ” But with Mr. Pence defending the president, and the Irish  divided over Mr. Trump, it is difficult not to view Mr. Cawley’s experience through the prism of current events. In a recent speech to Latino   leaders, Mr. Pence pledged that he and Mr. Trump would “show great heart every step of the way” regarding immigration, before recounting his  ’s farewell to her son. “She told him she was going to get him a   ticket to America,” Mr. Pence said, “because, she said, ‘There’s a future there for you. ’” Born on Feb. 7, 1903, Mr. Cawley was the third of six children, Irish census records show. The family lived in Doocastle, County Mayo, in a small cottage on a hill outside a village called Tubbercurry, in County Sligo. Older villagers still remember his father as “Dick the Tailor. ” The Sinn Fein nationalist party declared Ireland’s independence from Britain in 1919, setting off a guerrilla war between Irish and crown forces. That included the notorious British “Black and Tans” paramilitary group, which waged a night of terror in Tubbercurry in October 1920, burning buildings, including church parish halls, according to Michael Farry, an Irish historian who has documented the war in Sligo. In December 1921, Britain and Ireland signed a peace treaty, only to have civil war break out six months later among the Irish. Then, according to a handwritten ledger from Irish military archives, Mr. Cawley enlisted in the Irish Free State’s army. He felt “pushed into” serving, Mrs. Pence Fritsch said, and was reluctant to fight his countrymen. With little prospect of work, he fled to England, she said, to earn his way to America. The ship’s manifest lists him as a coal miner, with an address near Manchester, and says his brother paid for his passage. In the United States,   and   sentiment was flaring. A   Congress had passed the Emergency Quota Act of 1921, a restrictive immigration law strongly opposed by many   Democratic politicians. Monthly quotas allowed more British immigrants than Irish, who were welcomed as English speakers but faced some suspicion of being radicals. (On the day Mr. Cawley’s ship arrived, The New York Times carried news of Irish rebels.) Many Irish immigrated through Canada. And it might have been easier to gain entry to the United States with a British address, said Richard White, a Stanford historian who has chronicled his own grandfather’s illegal immigration from Ireland to Chicago in 1924. Passing through Ellis Island, Mr. Cawley would have answered an immigration officer’s routine questions, noted on the ship manifest. He was neither sick nor an anarchist, the manifest said. He had the equivalent of $23. And though records show he did not become a citizen until 1941, a decade after he married, historians say that was typical many Irish came to America not quite sure they would stay. While his brother James made his life in New York, Mr. Cawley settled in Chicago. It was a “fully developed Catholic world” of churches, schools and a heavily Irish Democratic political machine, the historian Ellen Skerrett said. In 1927, he was hired as a motorman for the Chicago Surface Lines, a streetcar service later absorbed by the Chicago Transit Authority, which still has Mr. Cawley’s insurance card on file. He held that job, eventually driving a bus, for more than 40 years. By 1931, records show, he had married Mary Elizabeth Maloney, a teacher and   American whose family hailed from Doonbeg, County Clare. (In 2014, Mr. Trump bought a golf course there.) With Mrs. Cawley’s widowed mother, they moved into a tidy brick “ ”  —   tenants, often relatives, rented the second floor  —   on the South Side. When Mrs. Pence Fritsch, born in 1932, was a baby, her father went home to see his dying mother. “He was gone so long,” she said, “my mother worried he wouldn’t come back. ” There was not much Irish life in Columbus, Ind. where Mr. Pence grew up as one of six children. (His father died in 1988, and his mother remarried.) Mr. Cawley was 56 when Mr. Pence was born. “I think he was partial to Michael,” Mrs. Pence Fritsch said of her father, “because he was named after him. ” Holidays meant trips to Chicago. In high school in the 1970s, Mr. Pence would regale friends with an imitation of his grandfather’s soft brogue. By this time, his grandparents were retired and traveled frequently to Ireland. In 1981, not long after his grandfather died, Mr. Pence made his own pilgrimage. The trip was deeply emotional, said Trish Tamler, a cousin of Mr. Pence’s who accompanied him to Tubbercurry. “It was just something that we all treasured,” she said. “We were just all so fascinated with the history. ” By this time, Mr. Pence had left his Catholic faith to embrace evangelical Christianity, a decision that would redefine him as one of the nation’s most religious and culturally conservative legislators. Grappling with immigration policy, he often invoked his grandfather  —   including in 2006, when he tried unsuccessfully to unite Republicans around a compromise that conservatives attacked as amnesty. “He got off that boat an Irish lad, he died an American, and I am an American because of him,” Mr. Pence said then. He also warned conservatives to demonstrate “that we believe in the ideas enshrined on the Statue of Liberty. ” Yet he also took tough stances, pleasing the right. A decade before Mr. Trump proposed a border wall with Mexico, Mr. Pence backed a bill that led to the construction of about 700 miles of fencing. As governor, he barred Syrian refugees from Indiana, citing fear of terrorism. In 2013, Mr. Pence took his wife, Karen, and their three children on vacation to Ireland, stopping in Doonbeg, where Hugh McNally, a distant cousin, runs a bar. “They want to hold on to an identity,” Mr. McNally said. Now, amid the tensions over Mr. Trump’s immigration policies, Mr. Pence says his grandfather taught him a powerful lesson: “If you work hard, play by the rules,” he told the Latino leaders, “anybody can be anybody in America. ”'"}, "time": 1742563562.909192}