{"duration": 0.10445356369018555, "input_args": {"text": "'  Ian Greenhalgh is a photographer and historian with a particular interest in military history and the real causes of conflicts. His studies in history and background in the media industry have given him a keen insight into the use of mass media as a creator of conflict in the modern world. His favored areas of study include state sponsored terrorism, media manufactured reality and the role of intelligence services in manipulation of populations and the perception of events. Turkish Disinfo: Daesh terrorist leader Baghdadi urges followers to attack Turkey By Ian Greenhalgh on November 4, 2016 Turkish map showing the planned annexation of northern Syrian and Iraq including the cities of Mosul and Aleppo [Editor’s note: This story is deliberate disinfo put out by a newspaper that is controlled by the Turkish government and functions as a mouthpiece for their propaganda and disinfo. The claim that Daesh is to target Turkey is nonsense, the goal of this story is to give Turkey an excuse for further military action in Syria and Iraq, they can simply use the excuse that they are attacking Daesh in response to Al-Baghdadi’s call for attacks on Turkey. Turkey aims to seize large portions of Syrian and Iraqi territory including the cities of Mosul and Aleppo, they are planning to move on Kurdish held Manbij shortly and have been massing forces on their side of the border in preparation for further offensive moves. The big question is why the US and Russia are remaining silent on the matter of Turkish military adventurism aimed at annexation of Syrian and Iraqi territory in order to create what Davutoglu calls ‘Lebensraum’ for the Turkish people, part of a plan to restore the Ottoman empire. Ian] Daesh terrorist leader Baghdadi urges followers to attack Turkey \\nThe Daesh terrorist group’s leader Abu Bakr al-Baghdadi, who is currently believed to be in Mosul, called on his supporters to take the battle to Turkey and carry out attacks in the country. Baghdadi’s call, which was released in a voice recording on Thursday, is the first message he issued after Iraqi forces backed by the U.S. launched an offensive in Mosul to take the city back from the terrorists. \\nIn the 31-minute-long recording, Baghdadi expressed confidence that Daesh will be victorious in Mosul, and told his followers to invade Turkey. \\n“Unleash the fire of your anger on Turkish troops in Syria” the terrorist leader said and added: \\n“Turkey today entered your range of action and the aim of your struggle … invade it and turn its safety into fear.” \\nBaghdadi claimed that Turkey is cooperating with Atheists, therefore deserves to be attacked and targeted. \\nHe also urged Daesh terrorist fighters to target security forces, members of the ruling Al Saud monarch and media outlets in Saudi Arabia and launch simultaneous attacks, as he claimed they were also cooperating with ‘infidel nations’ in Syria and Iraq. \\nWith a population of over 1.5 million people, Mosul stands as a bastion of the terrorist group. \\nTurkey launched Operation Euphrates Shield in late August to clear Syria’s northern border area of terrorists. The Free Syrian Army (FSA) units backed by Turkish forces were able to liberate Jarablus and more than 32 villages west of the Euphrates River following Turkey’s operation. \\nIn December 2015, Daesh released a video urging the conquest of Istanbul and Turkey and called President Recep Tayyip Erdoğan ‘Satan,’ while harshly criticizing him for supporting the U.S.-led coalition against the terrorists. \\nIn its determined fight against the terrorists, Turkey has prevented the entry of over 52,075 people from entering the country and detained thousands of Daesh suspects, since the start of 2016, according to Interior Ministry figures. Moreover, since 2011, Turkey has deported more than 3,290 foreign terrorist fighters from 95 countries and refused entry to more than 38,269 individuals in its fight against Daesh, which counts the Muslim-majority country as an enemy. \\nDaesh terrorists frequently target Turkey, which has recognized it as a terrorist group in October 2013. It is responsible for a string of terror attacks in Ankara and Istanbul, as well as cross-border fire from Syria that has killed a number of residents in Turkish border towns over the last year. Related Posts:'"}, "time": 1742563826.379047}