{"duration": 0.06666088104248047, "input_args": {"text": "'API Reports A Build, DOE A Draw by IWB · October 26, 2016 Tweet \\nYou cannot make this up…one could almost think an election was nigh… \\nThe “”markets”” were selling off and the VIX had just crossed into important bear territory when – surprise! – the DOE completely reversed the API report (which reported a larger than expected BUILD) and reported a DRAW. \\nNow, I am prone to thinking that nearly all “”markets”” are in full shenanigan mode right now, I confess to that, but that comes from having a lot of context and possibly too much information. \\nI knew that a major 400,000 barrel per day pipeline taking oil away from Cushing had broken a few days ago, so I wasn’t surprised to hear of a build. \\nPipeline remains closed following oil spill in Oklahoma \\nUpdated: 3:50 PM CDT Oct 25, 2016 \\n(AP) — A Seaway Crude Pipeline Co. pipeline that spilled oil at a storage hub in Oklahoma remained closed Tuesday, according to a spokesman for Houston-based Enterprise Products Partners, a 50 percent owner of Seaway. \\n“As of right now we don’t have an estimate of when it will be back up,” as officials are trying to determine the cause of the spill that happened shortly before midnight Sunday in Cushing, spokesman Rick Rainey said. \\nCUSHING, Oklahoma – While crews in Cushing continue to clean up oil after a pipeline break early Monday morning, the spill is stoking fears about what may be to come for the nation’s oil hub. \\nThe Seaway Pipeline is one of the largest in the nation, running 500 miles from Cushing to refineries in Freeport, Texas. Because it’s two pipelines, the owning company Enterprise could shut down one and keep oil flowing, but only 450,000 barrels per day. \\nThe section of pipe that burst can carry 50,000 barrels of oil or roughly 2.75 million gallons. \\nSo right on top of the reported build and right on top of a major break in one of the largest oil pipelines carrying crude AWAY from Cushing, what’s a “”market”” manipulating government lackey to do? \\nWhy report a surprise DRAW, thereby spiking oil, and indeed the entire US equity “”markets” because, such as. \\nThis all feels about as believable as anything else this (s)election cycle. \\nChris'"}, "time": 1742562137.764651}