{"duration": 0.047473907470703125, "input_args": {"text": "'ISTANBUL  —   The models, tall and lithe and strutting down the runway to the beat of   house music, are from Russia and Eastern Europe. They could be displaying the latest designer styles in Paris or New York, but instead they are here, in Istanbul, wearing high heels, flowing tunics and colorful head scarves. The fashion show, part of Istanbul Modest Fashion Week, was held at an   railway station, with   train cars and vintage luggage as props. This is not the Islamic fashion of Riyadh or Kabul, nor is it the dark and dreary dress stereotyped in the West. Islamic fashion here is a colorful, creative and joyful enterprise. It is also a huge business. “We’re taking over,” said Dina Torkia, a Muslim fashion blogger from London, who wears a head scarf and was mobbed by fans hoping for a photo. “There are a lot of us Muslim girls who wear the hijab, and we like fashion. ” As Europe grapples with the burkini  —   a   swimsuit that some French beach towns have tried to ban as a symbol of the oppression of women  —   Islamic dress in Turkey has become a symbol of religious freedom from the strictures of secularism. Istanbul has sought to become an Islamic fashion capital, an ambition that reflects the degree to which Turkish society has been reshaped under the Islamist government of President Recep Tayyip Erdogan. Under Turkey’s old   secular system, the head scarf, or hijab, was seen as a symbol of backwardness and banned in government offices and schools. In recent weeks, as France debated the burkini, Turkey again chipped away at old taboos, allowing female police officers, for the first time, to wear head scarves on the job. No longer an object of derision in Turkey  —   and with the backing of the Islamist government  —   the head scarf has spurred an Islamic fashion revolution, complete with fashion houses, magazines, bloggers and Instagram stars. Powerful women in the region, like Mr. Erdogan’s wife, Emine, and Sheikha Mozah, a wife of a former emir of Qatar, have become fashion icons for young conservative women. “Everyone was like, ‘Muslim market? ’” said Kerim Ture, a former technology industry executive who now runs the Islamic fashion house Modanisa, based in Istanbul. “Black burqas. That was the stereotype. ” Mr. Ture employs several   designers, and has partnerships with brands in Dubai and Malaysia. Popular colors these days are yellow and baby blue, as are camouflage and tropical leaf patterns. Saudi Telecom has invested in his company. “Our main purpose is to make women feel better,” he said. “To feel the glamour and the shine inside, even if they are covered. ” Mr. Ture said he did not come from an especially religious family, but he has supported Mr. Erdogan, whose policies, arguably, have made his business possible. “My mother is covered,” he said. “My sister is not covered. It’s a Turkish family. ” Mr. Ture organized the Istanbul Modest Fashion Week, the fancy affair held at the train station, in May, the city’s first such event. Designers from around the Islamic world unveiled their collections there. But most of the models in the show were not Muslim. Russian and Eastern European models tend to be taller than Turkish women, Mr. Ture said, and are better able “to carry the stuff, easier to show the glamour. ” One of the designers in the show was Loubna Sadoq, a Muslim woman in her 40s who lives in Amsterdam and began wearing a hijab a few years ago. “I was on a religious journey, and I wanted more peace in my life,” she said. Her new fashion sense, though, did not last long. “I have another lifestyle,” she said, mentioning bikinis and bars. “But I am still religious. I still pray. And I wear a scarf when I go to the mosque. ” Now she is an entrepreneur, selling head scarves made from natural fibers, like bamboo. Muslim fashion designers are essentially trying to answer a single question: How can a woman be fashionable and true to her religion at the same time? “God doesn’t send in a fax, or email, of how we are going to be wearing things,” Mr. Ture said. “Don’t be a sex object on the street for men. That’s the message. Don’t provoke them. ” Ms. Sadoq said the rules of Islamic dress were simple. “There is no difference between modest fashion and mainstream fashion,” she said. “You just have to adjust some things, like the length and width. You shouldn’t see skin, and it shouldn’t be tight. That’s it. ” But as secular Turks fear religion encroaching on daily life, Turkey’s conservative Muslims fear the opposite  —   that Islam is becoming watered down by commercialism. A small group of conservative Muslims protested outside the fashion show, chanting, “God is great!” One of the protesters, a man, told the gathering that the Quran is clear that women should be veiled, and he lamented that God’s instructions have become “a tool for the immorality called fashion. ” Some of the clothes displayed at the show seemed to push traditional boundaries: slightly   tops, a little skin here, a plunging neckline there. “Lengths got shorter, everything got tighter,” said Gamze Ucar, 38, whose family runs a textile business and believes that some items worn by Muslim women nowadays violate Islamic rules. “Trousers are everywhere. ” As the market for couture Islamic clothing has grown in recent years, mainstream designers have sought a piece of the action. DKNY and Tommy Hilfiger have designed Ramadan collections, and Dolce  Gabbana sells abayas, long outer garments, priced at more than $2, 000 apiece. Noor Tagouri, a journalist from the United States who has said she wants to be America’s first   television anchor, said she often receives emails from Christians who say, “We like the clothes, but we are not Muslim. ” Her response: “O. K. you can still wear it. You can still rock it. ”'"}, "time": 1742628538.5446484}