{"duration": 0.05537748336791992, "input_args": {"text": "'  \\nI have said throughout this presidential campaign that it doesn’t matter much which candidate wins. Both Donald Trump and Hillary Clinton are authoritarians and neither can be expected to roll back the leviathan state that destroys our civil liberties at home while destroying our economy and security with endless wars overseas. Candidates do not matter all that much, despite what the media would have us believe. Ideas do matter, however. And regardless of which of these candidates is elected, the battle of ideas now becomes critical. \\nThe day after the election is our time to really focus our efforts on making the case for a peaceful foreign policy and the prosperity it will bring. While we may not have much to cheer in Tuesday’s successful candidate, we have learned a good deal about the state of the nation from the campaigns. From the surprising success of the insurgent Bernie Sanders to a Donald Trump campaign that broke all the mainstream Republican Party rules – and may have broken the Republican Party itself – what we now understand more clearly than ever is that the American people are fed up with politics as usual. And more importantly they are fed up with the same tired old policies. \\nLast month a fascinating poll was conducted by the Center for the National Interest and the Charles Koch Institute. A broad ranging 1,000 Americans were asked a series of questions about US foreign policy and the 15 year “war on terror.” You might think that after a decade and a half, trillions of dollars, and thousands of lives lost, Americans might take a more positive view of this massive effort to “rid the world of evil-doers,” as then-president George W. Bush promised. But the poll found that only 14 percent of Americans believe US foreign policy has made them more safe! More than 50 percent of those polled said the next US president should use less force overseas, and 80 percent said the president must get authorization from Congress before taking the country to war. \\nThese results should make us very optimistic about our movement, as it shows that we are rapidly approaching the “critical mass” where new ideas will triumph over the armies of the status quo. \\nWe know those in Washington with a vested interest in maintaining a US empire overseas will fight to the end to keep the financial gravy train flowing. The neocons and the liberal interventionists will continue to preach that we must run the world or everything will fall to ruin. But this election and many recent polls demonstrate that their time has passed. They may not know it yet, but their failures are too obvious and Americans are sick of paying for them. \\nWhat is to be done? We must continue to educate ourselves and others. We must resist those who are preaching “interventionism-lite” and calling it a real alternative. Claiming we must protect our “interests” overseas really means using the US military to benefit special interests. That is not what the military is for. We must stick to our non-interventionist guns. No more regime change. No more covert destabilization programs overseas. A solid defense budget, not an imperial military budget. US troops home now. End US military action in Syria, Iraq, Afghanistan, Somalia, and so on. Just come home. \\nAmericans want change, no matter who wins. We need to be ready to provide that alternative.'"}, "time": 1742563743.4140725}