{"duration": 0.1524505615234375, "input_args": {"text": "'While Democrats perpetually circle the wagons, Republicans engage a perpetual circular firing squad. The same holds true for many evangelicals. Democrats and secularists count on it. \\nAnd we never disappoint. \\nFull disclosure: I went from a dogged “Never Trumper” to a “Maybe Trumper” and, finally, settled as a “Reluctant Trumper.” I, like any God-fearing father of daughters was, and remain, appalled by Donald Trump’s sordid past, and his 11-year-old vulgar video in which he objectified women. His words are indefensible, and I fully expect the Clinton camp to strategically release additional revolting and embarrassing opposition research about the Republican nominee before Election Day. \\nStill, I will be voting against Hillary Clinton on Nov. 8 in what is objectively and irrefutably the most effective way possible: by casting a vote, for better or worse, for the policies and promises of Donald Trump – and for the vice presidency of Gov. Mike Pence. \\nRegrettably, with many of my Never Trump friends I’m reminded of the fanatic who refuses his daughter chemotherapy and watches her die in an effort to convince himself (and others) of the strength of his own faith. Pride is an awful thing. We are to be “wise as serpents and innocent as doves” (Matthew 10:16). Foolishness called “faith” is just foolishness. \\nEven so, there are Christian Pharisees on both extremes of this Trump fiasco: first, those Trumpian cultists who buy the “Make America great again!” pablum and deride any person who, while not casting judgment upon others, makes, with all sincerity, what they view as the principled decision. The latter say they’ll sit this one out (or go through the motions by voting third party – a wasted vote by any objective standard). While I appreciate this milder strain of Never Trumper’s sincerity, I nonetheless believe it is sincerely wrong. \\nAnd then there are the self-righteous, plank-in-the-eye Never Trump prigs who slander as having “lost their saltiness,”“sinned against God” and “compromised their principles,” brothers and sisters who recognize the empirical reality that a vote for a horribly flawed (Lord knows I’m the worst sinner of all) baby Christian as president is a vote against Hillary Clinton’s tyranny in perpetuity. \\nThe Media Research Center has done America a tremendous service. In 2014 the watchdog organization released a video of an actual partial birth abortion – something Hillary Clinton stood on stage during the final presidential debate, stared into the camera with cold, callous eyes, and then both lied about and defended unequivocally. I plead with Never Trumpers to watch the video and then prayerfully reassess their plans for Nov. 8. \\nMrs. Clinton’s beloved late-term abortion practice is one so brutal and needless that even the left-leaning American Medical Association has admitted that it is dangerous to the mother and never necessary under any circumstances, not the least of which is for “the life or health of the mother.” \\nDuring a partial-birth abortion, the abortionist pulls a fully “viable” child – often kicking and thrashing – feet first from her mother’s womb, leaving only the top of her head in the birth canal. This is so the abortionist can technically claim to be performing an abortion, rather than committing murder. \\nHe then stabs the child through the base of her skull with scissors, piercing her brain until her kicking and moving about suddenly and violently jerks to a halt. Next, he opens the scissors to enlarge the wound as blood and brainstem fluid gush down his hands, inserts a vacuum tube and sucks out her brains, thereby collapsing her skull. \\nHer now limp and lifeless body is then cast away like so much garbage. \\nThis is homicide, plain and simple. Hillary Clinton supports it. Donald Trump opposes it. \\nWe deserve God’s wrath and judgment as a nation for allowing this abortion holocaust to occur on our watch. In my estimation, Mrs. Clinton is a bloodthirsty monster who enthusiastically supports this barbarity. Her Supreme Court appointees will ensure that tens of millions of precious babies like the one in the video are murdered in the same brutal manner. \\nMy conscience tells me that I must vote in such a way that exercising my civic duty will have the strongest net effect against Mrs. Clinton and ensure that she is stopped. She must not be elected president. To not vote – or to vote for a non-starter third party candidate, which is effectively the same thing – while not an actual vote for Mrs. Clinton, still puts this Mengele in a pantsuit one step closer to the White House and the Supreme Court. \\nIt’s simple math, and it’s undeniable. The most effective thing you can personally do as a citizen is to vote against Mrs. Clinton by voting for Mr. Trump. This does the most electoral damage possible to candidate Clinton and offers the best chance for life that you can provide future generations. \\nWith its 1973 Roe v. Wade decision, the U.S. Supreme Court put the government’s official stamp of approval on mass murder. Since then, the battle lines have been drawn. This is war. “Pro-choicers” are the bad guys and pro-lifers, the good guys. It really is that simple – that black and white. It’s good versus evil. \\nHistory will reflect as much. \\nUnder a President Hillary Clinton, millions more babies will be tortured and dismembered alive. Under a President Donald Trump, these millions might live. And yet, even as Hillary sharpens her knives, we quibble like fools over Donald’s potty mouth. \\nThe devil and Democrats: Oh, how they love derision and division within the body of Christ.'"}, "time": 1742562526.1616054}