{"duration": 0.04432535171508789, "input_args": {"text": "'Financial Markets admin \\nThe good news is that Hillary lost but the bad news is that Trump won. \\nA massive take-down of the gold and silver markets was put into action shortly after it became obvious that Trump was going to take the election, shortly after midnight EST. Gold had finished soaring about $64 when early returns indicated the possibility of an upset. So why was gold methodically disemboweled once Trump emerged as the official winner? \\nContrary to all the propaganda smoke being blown from the right and the left, Trump won because of economics. Going back to 1932, in any Presidential election year in which the growth in real disposable income was less than 3.1%, the incumbent party holding the White House lost the White House – in 2016 the official real disposable income growth has been 2.33%. Please re-read that fact and let it sink in. There’s been six elections in which this occurred – this table was sourced from John Wiliams’ Shadowstats.com: \\nIn other words, people vote with their wallets. The reason gold has been inexorably smashed in the paper markets – along with the Dow and S&P 500 manipulated higher – is nothing more than a form of propaganda in an attempt to make the public believe that a Trump presidency is a good thing – that Trump can save the economy from collapse. Jim Sinclair refers to this as “MOPE:” Management of Perception Economics. It’s the Central Planners’ signal that they still intend to continue stealing your wealth. They don’t care who is sitting in the Oval Office. \\nThe takedown in gold included cooperation from India’s Prime Minister – a western elitist lapdog – who “coincidentally” removed large denomination currency bills from the banking system last week in an attempt to curtail the Indian public’s current voracious appetite for physical gold. Removing this element from the global market last week enabled the Fed and bullion banks to bombard the Comex and LBMA with massive amounts of paper gold derivatives to push down the price of gold. \\nOf course, the shenanigans in the west have stimulated demand for gold even more in the Asian markets. Last night the market premium in Viet Nam soared to over $91. Premiums this high in Viet Nam have not been seen since at least 2011. On the Shanghai Gold Exchange the market premium soared to $12.47 above world gold – on Friday it was $8.20. It is rare when the premium gets this high on the SGE and signals very heavy demand. \\nIn today’s episode of the Shadow of Truth, we put closure – at least for us – on last week’s election and we explain why Trump has no intentions of “draining the Swamp” and why the current take-down in the price of gold and silver is setting the market up for a much bigger move higher: Share this:'"}, "time": 1742564040.4429514}