{"duration": 0.047467947006225586, "input_args": {"text": "'“Let’s get her some sex. ” Susan Silver says that was one of her chief contributions as a writer on “The Mary Tyler Moore Show. ” Playing the beloved young housewife Laura Petrie a few years earlier, Ms. Moore and her TV husband, Dick Van Dyke, had been made to sleep in separate beds. But it was the 1970s now. Even good girls had sex. Ms. Silver and the other women writing for “The Mary Tyler Moore Show” made sure of it. [ Read Mary Tyler Moore’s obituary | How she changed fashion ] As Ms. Moore’s new sitcom character, the independent, single career woman Mary Richards, put it in one episode: “I’m hardly innocent. I’ve been around. Well, all right I might not have been around. But I’ve been nearby. ” Ms. Silver said there was no particular feminist agenda for the show. There was, however, an   number of female writers on it  —   well over a dozen in the show’s   run that started in 1970. They were encouraged, she said, to write from their own experience, and to let Mary Richards’s   derive “organically. ” That made “The Mary Tyler Moore Show” a laboratory for the social issues of the day, which in some cases were being reflected for the first time on   television. Sex, birth control, equal pay, workplace sexism, homosexuality  —   all took a turn on the show, and not from the bully pulpit but from the “girl” who could turn the world on with her smile. Here’s how they played: When Lou Grant (Ed Asner) interviews Mary Richards for an associate producer job in his Minneapolis TV newsroom, he asks questions that women in the workplace often got asked but that weren’t necessarily legal: How old are you? Are you married? Divorced? What religion are you? She calls him out but answers anyway, in the show’s first episode. The point was not belabored but Mary Richards slept with her boyfriends. A   Chicago journalist had suggested that Mary, who was 30 when the series began, was “undersexed,” Ms. Silver said, and so in Season 3, Ms. Silver wrote an episode in which Mary asked her friend Rhoda if that was the case. A few episodes later, Mary goes on a date and comes home the next morning in the same dress. “Men across the country wrote to the show in despair over the betrayal of their trust and admiration,” Jennifer Keishin Armstrong wrote in her 2013 book, “Mary and Lou and Rhoda and Ted: And All the Brilliant Minds That Made ‘The Mary Tyler Moore Show’ a Classic. ” The third season featured another   handled in a    way. Mary’s friend Phyllis (Cloris Leachman) tries to push her brother into Mary’s arms, but the brother (Robert Moore) is more taken with Phyllis’s archnemesis, Rhoda (Valerie Harper). Phyllis works herself into a lather over this development, until Rhoda puts her out of her misery. “He’s not my type,” she reassures Phyllis, who remains skeptical. No really, Rhoda says. “He’s gay. ” Mr. Moore himself was gay, and he embraced the late decision to out the character this plainly, Ms. Armstrong writes in her book, especially since all the laughs were directed at his clueless TV sister. Had the Pill ever been mentioned in a sitcom script before “Mary Tyler Moore”? If so, the moment has been lost to history. Not long after the   episode, Mary’s father, at loose ends after his retirement, is visiting Mary for dinner at her apartment. Mary’s mother, making her exit, turns at the door. “Don’t forget to take your pill!” she calls out. “I won’t,” father and daughter answer in unison. Cut to the comically guilty look on Mary’s face. The Pill had won federal approval in 1960, but it was only that year, 1972, that a Supreme Court decision had made it available to unmarried women. And Mary was unmarried, for all seven seasons. Early hopes to make her a divorcée from the outset were instantly quashed by queasy executives. “It used to be I felt I could be myself. Now I feel I represent women everywhere. ” The third season opens with Mary kvetching to Rhoda as she prepares for a meeting at the TV station, where she resents the station manager “trotting in groups of people and saying, ‘This is our woman executive. ’” Her views take on a slightly different cast when she discovers that she makes $50 a week less than the man who had her job before her. She confronts Lou, asking him why. “Because he was a man,” Lou says. “The Dick Van Dyke Show” ended just four years before “The Mary Tyler Moore Show” made its premiere, even though it seemed the two shows were worlds apart. Ms. Moore broke ground in the earlier show, too, though. When the script called for her to vacuum in skirt and heels, she put her foot (in ballet flat) down and her Capri pants on. “We got the absolution of men everywhere,” she told TV Guide a few years ago, “and women kind of breathed a sigh of relief, too, and said: ‘Hey, that’s right. That’s what we wear. ’”'"}, "time": 1742628589.004543}