{"duration": 0.08133554458618164, "input_args": {"text": "\"Kowtowing to Kaepernick May Have Permanently Damaged the NFL Written by Selwyn Duke Email \\nThere’s a price to be paid for everything — even for being politically correct in a “politically correct time.” A new poll shows that the main cause of the National Football League’s much discussed ratings drop is, in fact, the National Anthem Protests sparked by Colin Kaepernick. \\nBut here’s the really bad news for the NFL: Some of the boycotting fans may never come back . \\nWatching sports is frivolity, a non-essential luxury, and people are creatures of habit. If fans stay away for a while, fill that time with other pursuits (perhaps more worthwhile ones), they may just find they don’t miss football all that much. Or they may watch more college ball and discover they like it more. Pro football isn’t indispensable. \\nIt’s much as when people give up soda, sugar, going out to clubs, or anything else: They often lose their taste for what they once found so alluring. Admittedly, this theory about permanent NFL fan loss is just that, a theory. But there’s no doubt the feckless, cowardly, corrupt NFL is playing with fire. Many believe the quality of play has declined, football is getting a lot of bad press, and today’s sports entertainment business is very competitive, with many in the younger generations watching extreme sports or mixed martial arts. Football is much like boxing: old school. There’s no guarantee the NFL can replace its old fans with new ones. \\nBesides being immoral and irresponsible, the NFL has been, in a word, phony. Many will say the San Francisco 49ers’ “Kaepernick has a right to protest, but…,” and the NFL has postured, bloviating about “freedom of speech.” As Niners coach Chip Kelly said recently, “Kaepernick's decision to not stand during the Anthem is ‘his right as a citizen’ and ‘it's not my right to tell him not to do something.” But this is nonsense. Freedom of speech only guarantees freedom from government infringement upon speech, and the NFL is a private entity that is like any other workplace: It sets conduct rules. \\nThis brings us to the obscene NFL hypocrisy. The league sets rules for dress and expression all the time; for example, it penalized Kansas City Chiefs player Husain Abdullah for kneeling in prayer in the end zone, fined New York Jets coach Rex Ryan $100,000 for shouting profanity following a victory, and fined Kaepernick himself more than $10,000 after accusing him of using a racial slur. It also has not been supportive of other protests — such as ones in favor of police. \\nIn addition, Kaepernick’s “cause” is based on nothing but lies. Many more whites than blacks are shot by police every year; shootings of black suspects have declined 75 percent during the last few decades; police are more likely to shoot whites relative to the races’ different homicide rates and the rates at which they feloniously shoot police; cops are more likely to be shot by a black suspect than to shoot one; and a study showed that law-enforcement personnel are actually to shoot white suspects , no doubt due to conditioning stemming from the fear of career and personal destruction. \\nMany people are aware of at least some of the above information. And NFL leadership appears to be like so many other pseudo-elites: unaware that the average person doesn’t subscribe to doctrinaire political correctness. Even many people who may be somewhat sympathetic to BLM bushwa don’t think showing disrespect to our nation is a proper response or that an NFL game is the proper venue for disruptive social activism. \\n\\n, follow him on Twitter or log on to SelwynDuke.com  \""}, "time": 1742563365.765751}