{"duration": 0.12228250503540039, "input_args": {"text": "'LOS ANGELES  —   Smiling and clapping through marathon   awards banquets. Week after week, month after month. Racking up   miles (New York to Los Angeles to London to Los Angeles) to woo Oscar voters at    sessions. Giving endless command performances to   reporters who ask the same five (three?) questions on loop. All the hair and makeup. All the gown fittings. And losing the whole time. Nicole Kidman, Naomie Harris, Michelle Williams and Octavia Spencer  —   each nominated for best supporting actress at the coming Academy Awards  —   know this drill all too well: It has been their lives (boohoo, I know) since November, when their fellow nominee, Viola Davis, started to vacuum up prize after prize for her    performance in “Fences. ” All told, Ms. Davis, who plays a   homemaker in 1950s Pittsburgh, has collected at least 29 trophies in recent months. (“Thank you to the Iowa Film Critics Association! ”) She walked to bellwether wins at the Golden Globes, the British Academy of Film and Television Arts and the Screen Actors Guild. The oddsmakers at GoldDerby. com have her seizing the supporting actress Oscar in a landslide on Feb. 26. It’s the most   category there is: She’s winning. So why do the other contenders keep going through the motions? That question pops into my head almost every year around this time, when the gracious losing starts to seem like   performance art unto itself.   reporters do their best to keep the Academy Awards feeling like a contest, but at least one category is perennially no contest at all. In 2015, Julianne Moore won best actress on the September day when Hollywood insiders first saw her in “Still Alice” at the Toronto International Film Festival. In 2012, Ms. Spencer similarly breezed to the Oscar lectern, collecting the supporting actress statuette for her portrayal of a maid in “The Help,” in which she starred with Ms. Davis. For answers, I spoke to longtime studio executives, publicists, agents and even a few of this year’s   nominees. And some of their responses were surprising. Joe Quenqua, who runs the entertainment practice at DKC Marketing and Public Relations, cleared up one thing right off the bat: No nominees, no matter what they say, concede they are losing until that golden envelope has been opened. “You can be the longest shot in the history of Oscar nominees,” he said. “You still have to think you have the teeniest, tiniest,    chance of winning walking into that room. ” Mr. Quenqua, who has worked on numerous Oscar campaigns, including one for “The Help,” said that there are multiple reasons that   contenders cling to hope. Aside from ego  —   and don’t underestimate that factor in Hollywood  —   actors and actresses, from their earliest days auditioning, don’t make it very far if they have a defeatist attitude. Upsets from past Oscars can also contribute to magical thinking nobody thought voters would select Marisa Tomei as best supporting actress in 1993 for her   girlfriend in “My Cousin Vinny,” but they did. And reporters may play a role. “It’s not like journalists single out the long shots and say, ‘Tell me how it feels to be losing,’” Mr. Quenqua said. “Instead, the question asked to everyone is always, ‘What are you saying in your acceptance speech? ’” Guilty as charged. Every year, the Academy of Motion Picture Arts and Sciences hosts a luncheon a few weeks before its prize ceremony to celebrate all the nominees as a group, from major stars down to the sound mixers. The academy peppers the room with reporters. Since the event usually falls at a crucial time in the voting process  —   this year, a few days before ballots went out  —   nominees tend to be very chatty. One of my first stops was Ms. Harris, who played a   mother in “Moonlight” and is vying for best supporting actress against Ms. Davis. “Do you plan to write an acceptance speech?” I asked her. Ms. Harris smiled. “I’m going with Helen Mirren’s advice, which is to always have a speech, even if you know beyond a doubt that you’re not going to win,” she said. I knew I was pushing it, but I said it anyway: “How do you know that?” With a single facial expression, she seemed to toss all 29 of Ms. Davis’s trophies in my direction. In the end, the affable Ms. Harris offered some insight into how she has approached the Year of Viola Davis, who has never won an Oscar despite two prior nominations (for “The Help” and for “Doubt” in 2009) making her the most nominated black actress in academy history. “I’m so grateful for the acknowledgment, which has made a huge difference in my career already, in terms of scripts and projects coming to me  —   it’s quite extraordinary, actually  —   but I’m also happy to be able to come to these events and help get ‘Moonlight’ to a broader audience,” Ms. Harris said. “I feel a responsibility to get out there and do as much legwork as I can to promote the film. ” Perhaps her category mates had similar points of view. Ms. Kidman, nominated for her   adoptive mother in “Lion,” has certainly done her best, dating back to the September film festivals, to keep that     in the public eye. Ditto Ms. Williams, nominated for her heartbroken mother in “Manchester by the Sea. ” Before I could track them down, I stumbled across Ms. Spencer, honored for playing a NASA leader in “Hidden Figures. ” She caught my eye partly because she was not aggressively working the   room. “Can I ask you a question?” I said to her, after identifying myself as a reporter. “No,” she said, sitting down at her lunch table. Now it was my turn to make a face. “Well, you can ask me how my day is going,” she said quickly. “But I’m not doing any press. ” Maybe she just wanted to be left alone with her salad. Maybe she was worried that I might drag her into yet another discussion about the #OscarSoWhite controversy. Or maybe, just then, she had stopped going through the motions.'"}, "time": 1742564154.8788188}