{"duration": 0.0636148452758789, "input_args": {"text": "'President Donald Trump celebrated the opening of a new coal mine in Pennsylvania, sending a recorded video to miners for the ceremony. [“I’m absolutely thrilled to be speaking with you on this great, great day,” Trump said in the video. “The miners of Pennsylvania  —   we’re digging coal again. ”  The Corsa Coal Company is opening the Acosta coal mine and is expected to employ   miners. Yesterday, Trump delivered a speech via video celebrating the opening of a new coal mine in Pennsylvania https:  .  pic. twitter.   —   Charlie Spiering (@charliespiering) June 9, 2017,  Trump reminded the miners of his promises during the campaign, and his ongoing efforts to reduce regulations to bring back jobs. “Clean coal will power America into the future,” Trump said. He also celebrated his decision to remove the United States from the “horrendous” Paris Climate Agreement, asserting that it would have sent the United States back “decades and decades. ” “We are doing something special and we are helping American coal,” Trump said. Hail to their hero. At Acosta mine opening. pic. twitter.   —   Debra Erdley (@deberdley_trib) June 8, 2017,  Trump also highlighted the mine’s opening during his speech announcing his decision to withdraw from the climate agreement. The president’s video aired as attention was focused on former FBI director James Comey’s testimony to the Senate. He vowed to continue fighting for coal jobs despite opposition: Though Washington may be some 180 miles down the road, as long as I’m the president of your great country, each and every day I’m fighting for you and I’m fighting for all the forgotten men and women in our country. It’s not easy, we have a lot of bad opposition, we have a lot of bad, bad phony opposition, but together we will all make sure that our nation is a land of prosperity and opportunity for all. Table centerpiece @CorsaCoal Acosta Deep Mine opening day pic. twitter.   —   Stephen Huba (@shuba_trib) June 8, 2017, '"}, "time": 1742562285.419528}