{"duration": 0.07057881355285645, "input_args": {"text": "'Videos Israel Tracked ‘Anti-Government’ Journalists On Facebook Netanyahu thinks the new channel doesn’t have enough government supervision and is too critical of his government and policies.   An Israeli soldier looks at the IDF’s Facebook page at the army spokesperson’s office in Jerusalem. \\nIsrael’s ruling party used Facebook to spy on “anti-government” journalists, Likud parliamentarian David Bitan said in a public debate Saturday. \\nBitan openly said he and others had been scouring the Facebook pages of journalists hired recently to set up a new public broadcasting service, saying they were scorned by their left-wing politics. \\n“We went and we checked the Facebook pages of these people. We saw what they are writing and I will tell you that we are talking about people who are leftist. They want to impose their own agenda on the new channel,” he said in the forum. \\nBitan has been the lead crusader against the establishment of the Israel Public Broadcasting Corporation. The new radio and TV media outlet, to be launched in recent months, is slated to replace the decades-old Israel Broadcasting Authority. \\nBut Bitan and his cadre, including Prime Minister Benjamin Netanyahu, are looking to stop the new broadcast service, establishing a committee tasked to find a way to keep the old Israel Broadcasting Authority. \\nTheir concern? The new public service channel doesn’t have enough government supervision and is overtly critical of Netanyahu’s government and policies. \\nThis, despite Netanyahu calling the change “essential” and “necessary” two years ago. \\nDespite this resistance, work has been underway in establishing the new outlet, with deals having been made with unions and generous severance packages being offered to workers who have agreed to quit the old broadcast voluntarily. \\nThe new media corporation has been poaching media personalities from competing outlets and preparing content for the launch date, which has already been postponed several times. \\nAnd critics are firing back at the prime minister, saying the new public broadcasting service should be free of political influence. They also see Netanyahu’s actions as a clear attack on media freedom. Local media has also come out to harshly criticize the ruling party. \\nAfter Bitan’s comments about surveillance became public, the Union of Journalists in Israel called on the attorney general to investigate the legality of Bitan’s actions. \\n“Closing down public broadcasting just because the prime minister can’t control it crosses a red line reminiscent of a totalitarian regime and not a democratic society like Israel,” said Yair Tarchitsky, the union’s chairman. He said the government’s actions amounted to McCarthyism. \\nBitan, even last week, had not been hesitant to voice his opinions about the change. \\n“It’s not going in the direction that we want. It is clear that the corporation will be left-leaning, according to what they are talking about. The journalists and workers are talking, they are tweeting, there is a red line that we will not allow it to cross,” said Bitan during an interview last week with Israel’s Channel 2 news. \\nThe Israel Broadcasting Authority was first established in 1948 and was the apartheid state’s sole television and radio outlet until commercial channels began broadcasting in the nineties.'"}, "time": 1742561674.94047}