{"duration": 0.12185144424438477, "input_args": {"text": "'STAFF NEWS & ANALYSIS If Trump Wants to Fix the ‘Disaster’ of the Pentagon, He Should Clean Up Its Nuclear Lies   \\nTrump Versus the Pentagon … On the campaign trail, Trump called the military a “disaster” … He pledged to vastly increase the sizes of the Army and Marines and to buy scores of new ships and planes. Does that make sense? – Bloomberg \\nWe’ll answer Bloomberg’s question: No it doesn’t make sense. America doesn’t need a bigger military anymore than it needs a bigger prison system. \\nThe American military is many ways a fraud. The idea is that if it were smaller, America itself would somehow be overrun by “enemies.” Do you believe it? \\nAmerica’s military services, like its intelligence agencies, are actually in the service of London’s banking elite. \\nThe US military is used to reshape the world in order to make it more congenial to one-world government from what we can tell. America’s military power has little if anything to do with actually defending the country. \\nThe Pentagon is rife with corruption. It has recently mislaid something like $8 trillion and has also, obviously, participated in a 9/11 coverup. This is the facility that Trump wants to lavish more trillions on. \\nMore: \\nInstead of adding regular troops and ships, the military should get granular, focusing on special forces, unmanned technology like drones, cyberdefense, and a naval strategy of “distributed lethality” that emphasizes firepower and self-defense across the current fleet. \\nThe generals will gladly take the additional money he’s promising, but will follow their own priorities. \\nThis is absolutely correct. The Pentagon’s generals will do as they please. They listen to London long before they listen to the White House. \\nThe Pentagon wants trillions for a nuclear upgrade. This is a bad joke. We’ve written numerous articles on how the Pentagon’s nuclear program was fraudulent from the very beginning. You can see some of them here, here and here . \\nThe Pentagon basically only allowed one journalist to cover the creation and completion of the original nuclear program, and that person – a New York Times reporter – was also on the Pentagon payroll. \\nWhatever was dropped on Hiroshima and Nagasaki in the way of a “nuclear” bomb was also accompanied very obviously by fire-bombing. The damage to Hiroshima and Nagasaki looks no different than the damage to Tokyo, which was lavishly firebombed. \\nWe’ve even identified the 66 bombers that likely bombed Hiroshima on August 6 th (666). The fleet was initially sent to a city near Hiroshima that had already been bombed several times. No, there’s no way those bombers bombed the same city yet again. Those bombers fire-bombed Hiroshima. \\nOr course the tale of the bombings was not told at the time. Instead, the US military shut down all access in and out of Hiroshima and Nagasaki for a full month. And then both Japan and the US made it a capital offense to talk about the bombings, to say or write anything at all, unless it was approved. \\nIf Trump really wants to create a better and more efficient military, he can start by getting to the bottom of the fakery of the Pentagons’ nuclear program. Parts of the program may indeed be real, but a lot of the narrative surrounding Hiroshima and Nagasaki is false. \\nAlso false are the videos and pictures of nuclear explosions provided to the public by the Pentagon throughout the ‘40s, ‘50s and ‘60s. \\nThe Pentagon has actually admitted that every single one of these presentations was “touched up” by its Hollywood special effects department. And were massive amounts of TNT present at many of these “tests?” Could the Pentagon have been faking some of these explosions? \\nWho vouches for the Pentagon’s nuclear program? The same elements of the military-industrial complex that has lied and faked portions of the nuclear program in the past? Who is present at the “tests” that the Pentagon performs? Just military types? Who vouches for the truth of what the Pentagon builds and tries out? \\nThe Pentagon reports regularly to Congress and the media about its “progress.” But does anyone check what the Pentagon is asserting? Does anyone actually investigate? The Pentagon can’t tell you what it did with $8 trillion but for some reason the words of its generals and others involved in the military-industrial complex are taken at face value. \\nConclusion: If Trump really wants to make America’s military more efficient, he could aim a reportorial truth squad to sort through at least a half century of lies and misinformation. That would be a start.'"}, "time": 1742563363.0446782}