{"duration": 0.028779268264770508, "input_args": {"text": "'The transgender star of the Netflix series “Orange is the New Black,” Laverne Cox, is set to speak at the University of Colorado’s Boulder campus on January 25th, at the same time as MILO’s scheduled event. [Cox’s talk is currently entitled, “Ain’t I a Woman: My Journey to Womanhood,” and according to Maura Towey, the chair of CU Boulder’s Distinguished Speakers Board, Cox will “provide an engaging conversation surrounding   and oppression. ”  Leftists at CU Boulder had attempted to shut down MILO’s event, which is being hosted by the CU College Republicans and the CU chapter of Turning Point USA. A petition in favor of banning MILO from the campus reached around 1000 signatures, and claimed that MILO “is not a journalist according to any respectable definition of that word he is a racist, sexist, reactionary opportunist who makes a comfortable living off sensationalism. ” “To deny him the privilege of speaking at our esteemed university is not to infringe on his (or anyone’s) freedom of speech” it continued. “And deny him the privilege of speaking at our university is exactly what we ought to do. ” However, following a report by Breitbart News, the university administration reassured students that MILO’s event would “go on as planned. ” “We value free speech and respect our student organizations’ decisions on who they want to invite to events at our campus” proclaimed the university in an email to Breitbart News. “Personally, I feel strongly that discrimination and harassment have no place on our campus,” said College Chancellor Philip P. DiStefano. “With that said, we must support the free exchange of ideas. I would hope that any speaker who comes here can present his or her opinions in a respectful manner. We understand that some topics will be supported by some students and denounced by others. Hosting a speaker on campus does not mean the university endorses or has other viewpoints on that speaker’s message. ” MILO’s speech, which will be one of the last on the Dangerous Faggot Tour, will start at 7PM in the Mathematics Building, with doors opening from 6PM. Like most other dates on the tour, the event is sold out.'"}, "time": 1742563273.7877953}