{"duration": 0.07130002975463867, "input_args": {"text": "\"Vertical Pools Help Heal Wounded Combat Veterans Seeks Positive Doers To Help Make It Happen ‹ › Since 2011, VNN has operated as part of the Veterans Today Network ; a group that operates over 50 plus media, information and service online sites for U.S. Military Veterans. UFC GYM® Celebrates “Veterans Day” with Complimentary Military Access By VNN on November 1, 2016 Complimentary 'Bootcamp' Themed Class Offered on Saturday, November 12 \\nUFC GYM® will celebrate the upcoming Veterans Day holiday by offering active duty and veteran military personnel as well as their families VIP status at more than 130 locations across the United States from Friday, November 11 through Sunday, November 13. \\nDuring this celebratory weekend, VIP attendees will receive total gym access, including a special ‘Bootcamp’ themed Daily Ultimate Training® (DUT®) class on Saturday, November 12. The 50-minute class is designed to challenge participants of all fitness levels and will include a variation of exercises often used in military training. For this specific class, all sessions will also be offered using body-weight based exercises, making it easy to execute in any setting. \\nDue to limited spacing, attendees are encouraged to contact their local club for more information. Please visit your local club at UFCGYM.com for the time slots offered for this class. \\nOffering a full-range of functional fitness classes, group and private MMA training, group fitness, personal and group dynamic performance-based training, plus MMA youth programming, UFC GYM creates training programs to fit all ages and fitness levels. UFC GYM programming has been developed through exclusive access to the training regimens of internationally-acclaimed UFC® athletes, providing members with everything they need for the entire family to move, get fit and live a healthy life. \\nSince debuting in 2009, UFC GYM has opened more than 135 locations throughout the United States, \\nAustralia, Canada, South America and the United Arab Emirates. The fitness franchise has continued to grow at a rapid pace with more than 50 locations opening in the past two years and over 50 gyms expected to open in the next year. \\nFor more information about UFC GYM, please visit UFC GYM.com , or follow us on Facebook.com , Twitter or Instagram: @UFCGYM. You can also subscribe on YouTube at UFCGYM . \\nAbout UFC GYM® \\nUFC GYM® is the first major brand extension of UFC®, the world leader in the sport of mixed martial arts (MMA). In alliance with New Evolution Ventures(tm) (NeV), developers of many of the world’s most successful fitness brands, the UFC GYM brand gives UFC enthusiasts and fitness seekers of all ages the opportunity to practice the training techniques of famed UFC athletes. Offering a full-range of group fitness classes, private MMA training, personal and group dynamic training, plus MMA style youth programming, UFC GYM creates something for all ages and fitness levels. As the first to combine the world of mixed martial arts and fitness, UFC GYM’s TRAIN DIFFERENT® approach has developed an atmosphere where members can see immediate results. UFC GYM is the ultimate fitness experience. The brand is not what you expect, and more than you can imagine, aiming to continue revolutionizing the fitness industry. Related Posts:\""}, "time": 1742562328.3166676}