{"duration": 0.14780402183532715, "input_args": {"text": "'all 30,000 of the “missing” Hillary emails are on Weiner’s laptop, plus hundreds of thousands more that were deliberately ditched and we never knew existed in the first place, evidencing not only lying about the content of the 30,000 emails but the existence of hundreds of thousands more?\\nWhat if among the authenticated email traffic is John Podesta saying, just days before the Clinton campaign was compelled to produce said material they they had to “dump those emails”, apparently proving intent to obstruct justice?\\nWhat if all of the emails that came from big public cloud providers are provably, to a near-forensic standard, to be exactly as WikiLeaks has presented them and could not have been tampered with because those providers digitally sign every email that comes from them and those signatures all validate back against those cloud providers, and those emails are thus in fact already known to be authentic?\\nWhat if the evidence on that laptop adds to the already known fact that Bill Clinton took a number of trips on Epstein’s “Lolita Express” aircraft, some of them after dismissing his Secret Service detail, and implicates what was about to, or did, happen on those trips?\\nWhat if the evidence on that laptop shows that Hillary was present on at least one of those trips and either knew about or participated in those acts?\\nWhat if the evidence shows that the Clinton Foundation operated as a major pay-to-play operation and national security interests were implicated such as, for example, in the sale of uranium to the Russians. \\nWhat if some of the “pay to play” activity involves nations we have a sketchy relationship with or even those that are under some sort of active embargo, but the Foundation was able to “get around”?\\nWhat if these “pay to play” activities implicate federal Racketeering and/or bribery statutes?\\nWhat if some of the “pay to play” activity involves nations that have been implicated in international Muslim terrorism, arguably therefore rising to the act of treason since by our own government’s own statements we are in a war against said international terrorism?\\nWhat if the Clintons actively conspired with Loretta Lynch to obstruct the ongoing investigations including but not limited to Bill Clinton’s “chat about family matters” aboard Lynch’s aircraft, a meeting for which no minutes or recording has been produced for the public?\\nWhat if for the first time in known history of FBI and DOJ investigations of such serious conduct with national security implications utterly nobody was served with a subpoena, nobody had evidence seized and material witnesses were allowed to corroborate and be present when others were testifying, and those acts were undertaken by the DOJ for the explicit purpose of both crippling the investigation and preventing a Grand Jury from seeing and judging the evidence in the case?\\nWhat if the FBI Deputy Director who headed up — and is still in charge of — the Hillary email server investigation has a wife who received nearly $700,000 in political contributions from a major Clinton operative and yet despite this clear and publicly-known conflict of interest has not recused himself or been forced to step aside? \\nWhat if James Comey was browbeaten into making a public announcement that was beyond his legal authority (that “no reasonable prosecutor” would indict) through political pressure but upon being presented with the new evidence on Weiner’s laptop he couldn’t stand by his previous decision because this new evidence made him sick to his stomach, convinced him that the damage to this nation was so severe that we might not survive it — or both? \\nWhat if it turns out that Hillary’s campaign cheated multiple times during the primary season when it came to being fed debate questions and other means of tampering with the primary election process, denying her primary opponent a fair election?\\nWhat if Hillary should have never been nominated in the first place due to her cheating in the primaries and the race should be “Trump .vs. Sanders”? What does that say about the legitimacy of the upcoming election if one candidate on the ballot cheated to get there and is thus not legitimately entitled to stand for election in the general at all? \\nWhat if the evidence shows how people “divested” and transferred financial interest in foreign firms so as to evade federal reporting requirements that would have otherwise triggered scrutiny on some of the Foundation’s deals?\\nWhat if Friday afternoon comes and goes, Saturday, Sunday and Monday come and go, all or a sufficiently-damning group of the above turn out to be true and as a result the person who was at the center of all of these things stands to be able to pardon herself and everyone else associated with what would be, quite-arguably, the most outrageous series of acts of public corruption in our nation’s history? \\nThat we are here, just a few days before an election, that we have a DOJ that has actively obstructed the investigation for at least months if not longer and has a history of doing this during Obama’s Presidency, including I remind you with “Fast-n-Furious” where a whole bunch of people got killed as a result of our government’s illegal gun-running is an outrage.\\nThe only thing more-outrageous than what has already happened would be if we were to get to Monday night, on the eve of voting, and all of those “What Ifs” up above remained unanswered.\\nOh wait, I tricked you and I admit it — some of those “what ifs” — including some truly damning ones — have already been answered in the affirmative. \\nIf you know the answers to any of the remaining questions — not a belief of what the answers might be but you are in possession of hard facts that prove any of the above, either in the positive or negative, you have a duty to this Republic and the people in it to make those answers known. \\nIf you do not then you stand as equally responsible for every “Yes” answer that is ultimately proved, and the harm that comes to this Republic as a consequence. \\nOriginally posted at Market Ticker .\\n'"}, "time": 1742563155.4408925}