{"duration": 0.05742502212524414, "input_args": {"text": "'As U. S. courts seek to block President Trump’s executive order restricting some travel into the country, Italian populist leader Matteo Salvini has sharply criticized the move as politically motivated. [The leader of Italy’s Northern League party (La Lega) told Breitbart News Friday that Trump is paying the price for keeping his campaign promises, facing the wrath of a “system in rebellion” and federal judges who have been “politicized. ”  Salvini said that Trump’s executive order was a “proper, useful and courageous response to a real threat,” one that European leaders should emulate. Leaders of both individual European states as well as of the European Union have been notoriously ineffectual in responding to the grave migrant crisis afflicting the continent. The head of Italy’s Lega told Breitbart that he had nothing but admiration for the U. S. President’s ability to act on his campaign promises, “something that seldom happens in Italy. ” Salvini, who aspires to govern Italy, said he would do the same thing Trump has done: “I would rely on intelligence services to close Italy’s borders to those countries considered a threat to national security,” he said. Even though President Trump must now deal with strong internal protests against his actions, Salvini said, “he will move forward with courage, emboldened by the knowledge that he has the majority of American citizens on his side, as evidenced by the election outcome. ” From early on, the League’s leader has been a vocal advocate of Trump’s ascendance to the White House, setting him apart from Italy’s other political parties. During the campaign cycle last April, Salvini traveled to the United States to meet Trump personally and pledge his support. “On many issues we see    with President Trump and we look forward to partnering with his administration,” Salvini told Breitbart Thursday, declaring his party to be a logical ally of the Trump administration. Salvini has noted many similarities between the platform of his party and that of the Trump administration, spanning beyond immigration to the idea of a flat tax to boost the economy to financial penalties for companies that outsource and opposition to international economic treaties that damage the national economy. “Our battles on these issues are perfectly in tune,” he told Breitbart, “and we also agree on limiting the role of expensive supranational structures like the U. N. and NATO. ” Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742563394.5130117}