{"duration": 0.02172255516052246, "input_args": {"text": "'Two leading advocates for reforming illegal and legal immigration enforcement were appointed by President Donald Trump to serve as senior advisors for the Department of Homeland Security (DHS). [Jon Feere, the former legal analyst for the Center for Immigration Studies, and Julie Kirchner, the previous executive director for the Federation of American Immigration Reform (FAIR) have both been appointed to senior positions.  Feere, who work with the Trump campaign and transition team on immigration policy, will serve as the senior adviser to the Immigration and Customs Enforcement (ICE) agency Director Thomas Homan. Kirchner, a campaign alum as well, will serve as the senior adviser to Customs and Border Protection (CBP) Commissioner Kevin McAleenan. Center for Immigration Studies Executive Director Mark Krikorian told Breitbart Texas that the Trump Administration appointed a person who “knows the ins and outs” of immigration when they chose Feere to serve. “ICE needs somebody like Jon because he’s worked on immigration policy for many years,” Krikorian said. “After eight years of Obama, there were civil servants and people at ICE who weren’t as quite up to date on immigration enforcement. ” FAIR spokesperson Ira Mehlman told Breitbart Texas that Kirchner’s appointment is welcome news. “They’re both people with long experience and deep knowledge and they’re highly qualified for their positions,” Mehlman said. Both the Center for Immigration Studies and FAIR have long been advocates for increased border security, a wall, reforming foreign guest worker visas and lower levels of legal immigration to help American wages to rise. The appointments have come with the usual media backlash that the Trump Administration has grown accustomed to. CNN, for instance, has written that Feere and Kirchner’s appointments have “alarmed” the open borders lobby. The network propped up opposition to the appointments through the   Southern Poverty Law Center, with Director Heidi Beirich claiming that that the Center for Immigration Studies and FAIR publish “racist” and “xenophobic” reports. Krikorian, though, said the open borders lobby is only outraged because they know how effective both nominees could be. “This isn’t a complaint about qualification,” Krikorian told Breitbart Texas. “Jon and these others know what they’re doing and that’s what the   groups are afraid of. ” John Binder is a contributor for Breitbart Texas. Follow him on Twitter at @JxhnBinder.'"}, "time": 1742561801.1946497}