{"duration": 0.3248734474182129, "input_args": {"text": "'280 Views November 06, 2016 No Comments Analyses The Saker \\nThis article was written for the Unz Review: http://www.unz.com/tsaker/the-ancient-spiritual-roots-of-russophobia/ \\nIntroduction \\nThe term “russophobia” (the hatred and/or fear of things Russian) has become rather popular in the recent years, courtesy of the anti-Russian hysteria of the AngloZionist Empire, but this is hardly a new concept. In his seminal book “ Russie-Occident – une guerre de mille ans: La russophobie de Charlemagne à la Crise Ukrainienne ” (“The West vs Russia – a thousand year long war: russophobia from Charlemange to the Ukrainian Crisis”) which I recently reviewed here , Guy Mettan places the roots of russophobia as early as the times of Charlemagne. How could that be? That would mean that russophobia predates the birth of Russia by a full two centuries? And yet, Mettan is correct, although even he does not paint the full picture. \\nWhat I propose to do today is not to discuss modern russophobia which has numerous causes and forms, but to look far back into history for the ancient spiritual roots of this relatively modern phenomenon. \\nMy thesis will probably trigger even more condescending smirks, expression of outrage and accusations of bigotry and racism than usual. That is fine. In fact, I will welcome them as a visceral reaction to what I propose to uncover below. One glaring weakness of my argument will be that I won’t bother presenting numerous sources as evidence for my assertions. Not only am I not writing an academic paper here, I simply don’t have the time and space needed to substantiate all my claims. Still, all the facts and claims I make below are easily verifiable for anybody with an Internet connection. My goal today is not to convince the naysayers, but to offer a few hopefully useful pointers to those seeking to connect the dots and see the full picture. This being, said, let’s now go far back in time. \\nA 2000 year old dispute \\nThose who believe that the Romans crucified Christ better stop reading here and go back to the comfort of ignorance. Those who have actually read the New Testament or, for that matter, the basic Judaic texts on this topic, know that Christ was accused and executed for the crime of blasphemy: He claimed to be the Son of God, the Son of Man (a messianic title), the messiah announced by the prophets and that He was God: “ Verily, verily, I say unto you, Before Abraham was, I AM ” (John 8:58) (this “I AM” is a direct reference to Exodus 3:14). This claim is what split the Jewish people into those who accepted Christ’s claims and believed Him and those who did not. What is interesting here, is the view which the Jews who did accept Christ had of those Jews who did not. As we all know, Saint John the Theologian wrote the famous words “ I know the blasphemy of them which say they are Jews, and are not, but are the synagogue of Satan ” (Rev 2:9). And Christ Himself said “ If ye were Abraham’s children, ye would do the works of Abraham ” (John 8:39). What we see here is the basis for a claim which was first made in the Apostolic times and which was later fully endorsed and further developed by the Church Fathers: those Jews who rejected Christ thereby lost their “Jewishness” and the “new Jews” are the Christians, regardless of ethnicity, which now have become the new “chosen people”. In our modern times of hyper-political correctness and generalized “ecumenical dialogs of love”, Christians are mostly ignorant of theses facts and, when they are, they dare not mention them in public. At a time when Popes declare that Jews are their “older brothers”, that they need not accept Christ and that Christians and Jews are awaiting the same 2 nd coming of Christ, saying that Christianity denies Jews their very Jewish identity is definitely “ mauvais ton ”. But before the 20 th century, this Christian claim that modern “Jews” were not really Jews anymore was common knowledge, both amongst Christians and amongst Jews. \\n[Sidebar: as I explained it in some details here , modern “Judaism” is not the religion of “Abraham, Isaac and Jacob” but the religion of Maimonides, Karo and Luria and has its roots in the teachings of the sect of the Pharisees, the Talmud and the Kabbalah. The closest modern heir to Christ-rejecting Jews of the times of Christ would be the Karaite sect. Modern “Judaism” really ought to be called “Phariseic Talmudism”. For a traditional Patristic look at Phariseic Talmudism, please see here and here ] \\nConversely, Judaic teaching about Christ are not sympathetic either. A quick read of the Toldot Yeshu or, for that matter, the passages about Christ in the Talmud, will convince anyone in need of convincing that the Pharisees’ hatred for Christ was not satiated with His crucifixion. And lest anybody think that this is all racist drivel by blue-eyed Nazis, here is a good article on this topic from Ha’artez corroborating it all. \\nNowadays an uninformed observer might erroneously conclude that there is a big love-fest between Judaics and Christians, but to the extend that this is true, this is solely due to the fact that most modern Christians and Judaics have long ceased to believe, think and act in accordance to their own traditions. The reality is that for traditional Christians, modern Judaics are fallen, lapsed, people who have failed to live up to their election by God and who now are determined to take by force what had been promised to them by God. For traditional Judaics, Christians are idolaters of the worst kind, as they worship a blaspheming magician, born of a promiscuous hairdresser and a Roman legionnaire, who was justly executed for his crimes and who now forever is confined to hell where he boils in excrements. And lest anybody believe that this hostility is only a matter of a long gone past, I would add that while the Judaics are still waiting for as their messiah, the Christian consensus patrum indicates that this Judaic messiah will be the very same person whom Christ and the Apostles called the Antichrist. \\nWhy does all this matter? It matters because at the very core of it all is the claim that Gentiles have replaced Jews as the chosen people of God, that Christians are the “new Jews” and that modern day Jews are simply not Jews at all, not only because most of them are more Khazarian than Jewish, but because their faith, traditions and beliefs are not the ones of the ancient Jewish people as described in the Old Testament. In other words, Christianity says that Jews are not Jews. \\nA 1000 year old dispute \\nWestern history books usually say that Rome was sacked in 410 and fell in 476. The former is true, but the latter is completely false as it conflates the city of Rome and the Roman Empire. Only the city of Rome and the western Roman Empire came to an end in the 5 th century, but that very same Roman Empire continued to exist in the East for a full 1000 years (!), until the 1453 when the Ottomans finally captured the city of Constantinople. In fact, the imperial capital of the Roman Empire had been moved from Rome to the city of Constantinople, the “New Rome”, by the Emperor Constantine in 320. Thus, the Rome which, at various times, Visigoths, Vandals and Ostrogoths sacked was no longer the capital of the Roman Empire. \\nThese two crucial dates, 476 and 1453, are often used to mark the beginning and the end of the Middle-Ages (along with other dates between the 5 th and the 15 th century). And since I am setting up the crucial dates for my argument, I will add another one here: 1054, the “official” date for the so-called “Great Schism” between, on one hand, Rome (the city) and, on the other, the other four Patriarchates founded by the Apostles: the Patriarchates of Alexandria, Antioch, Jerusalem, and Constantinople. \\nAt this point, things get complicated and a halfway decent explanation of what really took place would require no less than 100 pages, including a discussion of dogmatic theology, culture, sociology and, of course, politics. The best I can provide at this point are a few bullet-point style sentences summarizing what happened: \\nThe Franks, especially Charlemagne, decided that they would re-create the Roman Empire. To be truly Romans, the Franks also wanted to make their own, original, contribution to Christian theology. They did so by making an addition to the so-called “Symbol of Faith”, or “Credo” in Latin, a text which summarizes the key Christian beliefs. Furthermore, since they were now occupying Rome, the former imperial capital of the Empire, the Franks felt that they were in control of the spiritual capital of the Christian world and that, therefore, the rest of the Christian world ought to accept the primacy of the bishop of Rome – called the “Pope” – and his right to impose a new dogma on the entire Christian world. Following roughly 200 years of tensions between the (Frankish-occupied) Rome and the (still free) eastern Roman Empire the final separation took place in 1054 when the Pope excommunicated the Patriarch of Constantinople who then returned him the favor. What is important for our purposes is this: not only did the Frankish invasion of Rome mark the end of the Roman civilization in the West, it also cut-off the western world from the Roman Empire which continued to exist for another ten centuries. The process of severance between the two parts of the Empire began in the 5 th century following the fall of the city of Rome and continued throughout the following centuries. During the 10 th century, Rome suffered during the so-called dark ages ( saeculum obscurum ) and the so-called the “Rule of the Harlots” ( pornokratia ). At a time when the Roman Empire in the east was almost at the apex of its glory, the Franks were indulging in an orgy of destruction and corruption which completely changed the face of the western part of the European continent and completely severed the vital cultural and spiritual ties which had kept the Roman Empire together in the past centuries. \\nDuring the following 1000 years while the Roman Empire continued its existence in the East, the European Middle-Ages slowly and painfully gave birth to a new civilization, the West European civilization, which really took its first mature shape during the Renaissance with it’s re-discovery of the ancient Greek and Roman world. Whatever form this so-called “re-discovery” took, it is a fact that the 1000 years of the Middle-Ages separate modern western civilization from the Roman civilization and that modern Europe was born not of the Romans, but of the Franks. The (Orthodox) East, however, has never known any “Middle-Ages” and has maintained a cultural and religious continuity to the ancient Christian world and the Roman Empire. \\nIn the West, the so-called “Roman Catholic Church” (another misnomer – there is nothing Roman or “catholic” – meaning “universal” – about the Papacy as it is Frankish and local) likes to present itself as the original Church whose roots and traditions go back to the Apostolic times. This is simply false. The reality is that the religion which calls itself “Roman Catholic” is a relatively new religion, younger than Islam by several centuries, which was born in the 11 th century of a rejection of the key tenets of the 1000 year long Christian faith. Furthermore, from the moment of its birth, this religion has embarked on an endless cycle of innovations including the 19 th century (!) dogmas of the Papal infallibility and the Immaculate Conception. Far from being conservative or traditionalists, the Latins have always been rabid innovators and modernists. \\nNowadays there are many Christian denominations out there, but only the Orthodox Churches can testify to the fact that the Frankish local Church is neither Roman, nor Catholic, that it’s roots are not in the Apostolic times, but in the (dark) Middle-Ages and that far from being a heir to the 2000 year old faith “ which the Lord gave, was preached by the Apostles, and was preserved by the Fathers ” to use the words of Saint Athanasios, the Latin faith is nothing but a collection of deviations from the original Christian faith. \\nThe feared and hated witness \\nNow we see a pattern here. Both for the Judaics and for the Latins, the Orthodox Christians are the only witnesses out there who can (and do!) openly challenge not only their legitimacy, but their very identity. From an Orthodox perspective (and here I am referring to the traditional, Patristic, point of view) modern Jews are not Jews and the Catholics are not catholic . In both cases, we are dealing with very successful frauds, but frauds nonetheless. Orthodox Christians believe that they, and they alone, are both the real Jews and the real Catholics. Modern Jews are nothing but Pharisees while Latins are simply heretics. Jews were called to be the Chosen People while Rome used to be recognized as the “first amongst equals” by the other Patriarchates. Alas, in both cases a tragic fall from grace occurred in a manner reminiscent of Lucifer’s fall from Heaven (“ How art thou fallen from heaven, O Lucifer, son of the morning! ” Isa 14:12). And to those who would say that such a claim is preposterous, Orthodox Christians would simply point at the immense corpus of Patristic writings which has always supported that claim. The only option for somebody rejecting this claim is to reject Christianity itself. \\nMy argument here is not a historical or theological one. Regardless of whether one accepts or not the Orthodox view of modern “Judaism” and “Roman Catholicism” – it is certain that both Judaics and Latin were quite aware of this view (there were plenty of polemical texts written over the centuries by all sides to this dispute) and that this challenge to their very legitimacy and identity was perceived as a monumental affront and, when supported by an immense and powerful empire like the Russian one, a mortal enemy which had to be either conquered or eliminated. \\n[Sidebar: Islam. It is interesting to note here that Orthodox Christianity, which Muslims called “Rum” as in Rome, in no way challenges the legitimacy or identity of Islam. While Islam and Christianity have plenty of irreconcilable theological differences, Muslims do not claim to be Jews or Christians. As for Orthodox Christians, they obviously do not claim to be the true or original, Muslims. Thus the co-existence of these two religions is not logically mutually exclusive even if their theologies are fundamentally incompatible]. \\nThe modern dispute \\nIt would be ridiculous to claim that the cause(s) modern fear and/or hate of things Russian can all be explained by ancient theological arguments. In reality, neither Russia nor the West are all that religious nowadays. And while there is definitely a religious rebirth taking place in Russia, it remains also true that only a minority of Russians are truly religious or well-versed in Orthodox theology. Furthermore, there are plenty of reasons why some hate/fear Russia which have absolutely nothing to do with religion, including the fact that Russia is, and has always been, an unconquered military superpower, that the Soviet regime has oppressed millions of people in Eastern Europe and in the Soviet Union and that any more or less sovereign and independent regime in Russia stands as the main obstacle for the West to take control of Russia’s immense resources and many other reasons. As for (truly religious) Judaics and Latins, they are a small minority compared to the vast majority of largely agnostic people around them. In reality, modern russophobia has numerous independent “vectors” all contributing to a grand “sum vector” expressed in the West’s current policies towards Russia. And yet. \\nRegardless of the actual level of religiosity in Russia, Russia remains the objective historical and cultural heir to the Roman Empire: the First Rome fell in 476, the Second Rome fell in 1453 while the Third Rome fell in 1917. \\n[Sidebar: A Fourth Rome cannot happen simply because, unlike what happened with the First and Second Rome, the Third one could not “pass on” its role to a hypothetical Fourth one. Seventy years of Communist rule will forever remain and unsurmountable barrier between Russia the Third Rome and modern Russia and not true succession is now possible] \\nTo ignore the historical importance of a Christian Roman civilization which lasted from the 4 th to the 20 th century would be a major oversight. Those 16 centuries have had a huge impact on the Russian culture, even upon those Russians who are only superficially religious or outright agnostic, and they still can be felt today. The same is true for what is called the “West” nowadays: what is the AngloZionist Empire if not the cultural continuation of the British Empire with the Zionist (and, thus, Judaic) element recently added to it ? And don’t let the fact that Protestants and Anglicans are not “Roman Catholics” distract you from the reality that Protestantism itself is just the offspring from the spiritual intercourse between its Latin and Judaic parents, just as Freemasonry – the dominant ideology and worldview today – is the offspring resulting from the spiritual intercourse between of Protestantism and Phariseic Judaism. Whether we are aware of it or not, we live in “civilizational realms” which have ancient roots and our worldview and outlook on life are often shaped by a past which we often know very little about. \\nConclusion \\nThere is a clash of civilizations taking place. It does not primarily oppose a putative “Christian West” to Islam. For one thing, the modern “West” has long ceased to be Christian and should now be categorized as post-Christian. Furthermore, the Muslim world is not united and does not have the resources to meaningfully oppose the AngloZionist Empire. Until China, Latin America or some other civilization truly rises up to be able to challenge the current world order, Russia is the only country which will dare to openly challenge the very legitimacy of the western political system and the ideology it has been built upon. Modern Russia is both capable and willing to challenge the dominant western ideology (from Capitalism to the belief that homosexuality is a normal and healthy variation of human sexuality ) precisely because of her position as the heir to, and continuator of, the Christian Roman Empire. True, for the past 300 years or so, Russia has been ruled by a generally westernized ruling elite, but that elite itself has always remained a foreign superstructure imposed upon the Russian nation which never truly identified with it. With Putin Russia has finally found a leader who does not represent the interests of the elites, but rather the interests of the vast majority of the population – hence Putin’s stratospheric popularity ratings. And that too frightens the West, especially the western elites who now feel that their rule is threatened by a nuclear superpower which is determined not to let them take over our entire planet. It is impossible to predict what will happen next. But it does appear likely to me that this ancient conflict between two fundamentally opposed spiritualities and civilizations will come to some kind of a resolution, for better or for worse, in the near future. \\nThe Saker The Essential Saker: from the trenches of the emerging multipolar world $27.95'"}, "time": 1742561756.2570167}