{"duration": 0.21465611457824707, "input_args": {"text": "'More Philippine President Rodrigo Duterte speaks during a banquet hosted by Japan\\'s Prime Minister Shinzo Abe (not pictured) in Tokyo on October 26, 2016. (Photo by AFP) \\nPhilippine President Rodrigo Duterte says he wants US troops out of his country in the next two years, amid rising tensions between Manila and Washington. \\nDuterte told an economic forum in the Japanese capital Tokyo on Wednesday that Manila was also willing to scrap defense pacts with Washington if necessary. \\n\"I want, maybe in the next two years, my country free of the presence of foreign military troops,\" Duterte said in a clear reference to US forces, adding, \"I want them out and if I have to revise or abrogate agreements, executive agreements, I will.\" \\nDuterte told reporters on Tuesday before leaving for Japan that if he stayed longer, he would not sign the Enhanced Defense Cooperation Agreement (EDCA) with the United States. \\nPresident Duterte has promised that he would review the defense pact. He has already said that the presence of the US troops in the island of Mindanao could complicate Manila’s operations against the Abu Sayyaf militant group, notorious for different terrorist attacks in the country. \\nIn a meeting with business leaders in the Chinese capital Beijing last week, Duterte said the Philippines would \"separate\" from the United States and realign with China and Russia. \\nThe Philippine president has tried to reach out to China and Russia amid an uneasy relationship with Washington. Policemen block protesters during a rally in front of the US embassy in Manila, the Philippines, October 19, 2016. (Photo by AFP) \\nLast month, the Filipino leader harshly criticized the US and President Barack Obama, saying he was not a “puppet” of America. “I am the president of a sovereign country and I am not answerable to anyone except the Filipino people.” \\nWashington is critical of Duterte’s bloody war on drugs. The attitude has led to tensions between the Philippines and the United States. Loading ...'"}, "time": 1742563826.107997}