{"duration": 0.10020852088928223, "input_args": {"text": "'VATICAN CITY  —   For a while, Senator Bernie Sanders’s Roman holiday seemed less than it was cracked up to be. Immediately after his campaign announced that he would leave the United States for a “  meeting” at the Vatican, questions arose about the wisdom of the trip. The critical New York primary was just days away. One official of the Vatican’s Pontifical Academy of Social Sciences, which hosted the conference Mr. Sanders would attend, even suggested he had fished for the invitation. Most critically, there seemed to be little chance that Mr. Sanders would meet the Vatican resident whose name he frequently invokes. Pope Francis, it turned out, would not be visiting the conference of the academy, an   think tank of the Vatican. Politically, a trip to Rome without a meeting with Francis would have been a blunder, Costas Panagopoulos, a political science professor at Fordham University who is teaching at Yale, had said on Friday. “The point is to make sure you are going to get an audience with the pope,” he said. “Anything short of an actual visit will probably be a mistake. ” Mr. Sanders continued to hold out hope. “I certainly would be delighted and proud if I had the opportunity to meet with him,” he said before leaving New York. He also had two things going for him: his host, Bishop Marcelo Sánchez Sorondo, an Argentine who is the chancellor of the academy and happens to be close to Francis, and his hotel room, also close to the pope. Mr. Sanders was to stay in a   room at Casa Santa Marta, the Vatican guesthouse where Francis keeps his residence. “So it won’t be difficult to find the pope,” the bishop said last week, seeming to hint at something. On Thursday, the day before the conference, a Vatican spokesman appeared to end all speculation, saying, “There won’t be a meeting with the Holy Father. ” Bishop Sánchez Sorondo dismissed the statement as “Roman gossip. ” But final word, it seemed, came Friday afternoon in the form of a handwritten letter from the pope apologizing to conference attendees for his absence. “I will keep them all in my prayers and good wishes, and send them my heartfelt thanks for their participation,” he wrote. “May the Lord bless you. Fraternally, Franciscus. ” Around 5:30 p. m. Friday, the conference’s business ended and Mr. Sanders made an appointment for dinner at the Casa Santa Marta with his foreign policy adviser, Jeffrey D. Sachs, the economist and a fellow conference participant. Mr. Sanders and his wife, Jane, sat with Mr. Sachs and his wife, Sonia, for a soup and buffet dinner, where they were joined by Bishop Sánchez Sorondo and Cardinal Óscar Andrés Rodríguez Maradiaga of Honduras, the pope’s   man and one of the Vatican’s top power players. “It was a   conversation,” Mr. Sachs said. “It was about issues of the church and its history, about Honduras and foreign policy. ” But the most important words occurred in the middle of dinner, when a personal secretary for Francis arrived with the news Mr. Sanders had been hoping for, Mr. Sachs said. If Mr. Sanders were in the foyer of the Casa Santa Marta at 6 a. m. the next day, he would be able to speak briefly with Francis as the pope headed to the airport for his Saturday trip to Greece, where the pope would be addressing the migrant crisis. So early Saturday morning, Mr. Sanders stood in the marble foyer, which looks out onto a large cobblestone drive just inside the Vatican walls. Joining him were his wife, Mr. Sachs and his wife and Bishop Sánchez Sorondo, the senator’s de facto Vatican fixer. The pope, speaking to reporters on his plane later in the day, described the meeting. “This morning when I was leaving, Senator Sanders was there,” he said, adding, “He knew I was leaving at that time, and he had the courtesy to greet me. ” No photos of the encounter were permitted, but Mr. Sachs said the senator was delighted all the same. He was beaming as he left the guesthouse, and celebrated the informal audience with a victory lap of sorts in St. Peter’s Basilica along with Mr. Sachs and the bishop, passing Bernini’s Baldacchino, a monumental bronze canopy over the papal altar, and Michelangelo’s Pietà. Aware that his every statement is parsed for deeper meaning, Francis said he was simply being polite, not political. “I shook his hand and nothing more,” he said. “If someone thinks that greeting someone means getting involved in politics,” he added, laughing, “I recommend that he find a psychiatrist!” But the candidate was excited to talk about his coveted souvenir. “I conveyed to him my great admiration for the extraordinary work that he is doing all over the world in demanding that morality be part of our economy,” Mr. Sanders told reporters aboard the plane as it rushed him back to the campaign in New York.'"}, "time": 1742561760.7937894}