{"duration": 0.18317055702209473, "input_args": {"text": "'Of all the things connected to Donald J. Trump, few have given him more mileage than his fleet of aircraft. His Boeing 757 jet, often referred to as Trump Force One, has received the full    lifestyle treatment The Washington Post even queried whether it was better than Air Force One. One of Mr. Trump’s helicopters has gotten similar coverage an interior renovation made CNBC’s “Secret Lives of the Super Rich” in a segment entitled “Pimp My Chopper. ” A close look at Mr. Trump’s two airplanes  —   the 757 and a smaller jet used on the campaign trail  —   and three helicopters, however, suggests that their value rests chiefly in their marketing potential, with the Trump stamp of status masking the fleet’s age. Four of the five aircraft are more than 20 years old, a rarity for most billionaires. The exception is a    Cessna 750 Citation X  —   the only one of the five without the Trump name painted on it in large letters. The smaller plane was grounded last week after The New York Times reported that its registration had expired in January. It is now cleared to fly again, according to the F. A. A. Most people who own aircraft do not have more than one or two. Even those who can afford to own planes often lease or charter them instead, offering a layer of ease and anonymity. But anonymity is not Mr. Trump’s style. The Boeing, built in 1991 to seat roughly 200 people, is Mr. Trump’s favorite flying toy, he said in an interview on Saturday. The jet, which once did duty with a commercial airline in Mexico in the 1990s, has been famously renovated. It has a bedroom the fixtures are brushed with   gold and the toilet seats were reupholstered with Edelman leather, which also graces the Eames chairs in Ivanka Trump’s den. “It’s like a new plane,” Mr. Trump said in a documentary that showed off some of the renovations. “The plane is very much an extension of the Trump brand. ” While the 757 might seem like an odd choice for a man who puts his net worth at $11 billion, and, records show, does not use the plane much to travel abroad, Mr. Trump has cited it and his other planes as proof of how he gets good value for his money. In the 1980s, for example, he paid $8 million to buy a 1968 Boeing 727 from a financially troubled Texas company, Diamond Shamrock, according to his book “The Art of the Deal. ” Mr. Trump said a smaller Gulfstream jet would have cost more than twice as much. “It was a little more plane than I needed,” he wrote, “but I find it hard to resist a good deal when the opportunity presents itself. ” In the interview on Saturday, Mr. Trump said he did not own the five aircraft to burnish his brand, but agreed that the fleet had “promotional value. ” He added that he could get by without owning a Boeing 757 but it was a “great luxury to have. ” Air travel is one of the largest expenses of Mr. Trump’s Republican presidential campaign: A company he owns has charged the campaign approximately $3. 7 million in travel costs since he announced his candidacy in June 2015. Using the 757 does not help keep costs down: It guzzles fuel and costs thousands of dollars an hour to fly, more than private planes being used to shuttle other presidential candidates. Still, Mr. Trump has used it to crisscross the country, sometimes with just a small group of people aboard. The Boeing also weighs more than 100, 000 pounds, making it too heavy to land at many smaller airports, including one at Teterboro, N. J. the airport of choice for wealthy New Yorkers like Mr. Trump. Instead it must fly in and out of La Guardia Airport in Queens, which Mr. Trump, and others,  have likened to what one might find in a third world country. La Guardia does offer a marketing perk: The 757 can often be seen at the airport, a billboard on wheels. Mr. Trump said that he was aware of the Boeing’s limitations and that he did not “use it that much. ” According to F. A. A. records, the Boeing has flown about 333 hours between Mr. Trump’s announcement of his intention to run for president last June and March 16, 2016. During the same stretch, F. A. A. records show, the Cessna has flown roughly 216 hours. A review by The Times shows most of the hours logged were for campaign travel. Large jets are popular among professional sports teams and rock bands, which have to move large groups and equipment. Still, some individuals and companies do own such aircraft. Ronald W. Burkle, a billionaire investor who owns stakes in a number of companies, including Whole Foods Market, flies on a Boeing 757 registered to his firm. Las Vegas Sands, a casino operator run by the billionaire Sheldon Adelson, has several larger planes that are used to transport company executives and Sands customers. Buying older planes has advantages: In addition to being less expensive, their depreciation costs are lower. Mr. Trump said he liked older planes because they had been “tested” and had “been around. ” For Mr. Trump, doing things bigger than most has been a guiding principle, as reflected in his penchant for slapping his name on buildings and planes. In June 1989 he launched the Trump Shuttle, after paying $365 million to buy the old Eastern Airlines shuttle operations, which connected New York City with Boston and Washington. The deal is not counted among his more successful ventures. In 1990 he defaulted on his loan and lost control of the airline to a group of lenders. Around the same time, a helicopter shuttle service he ran also fizzled. As for Mr. Trump’s personal travel, he prefers to fly private. In 2009, he decided to sell his Boeing 727, which was by then 41 years old. He replaced it with another used aircraft, the Boeing 757. A company controlled by the billionaire Paul Allen, a founder of Microsoft, had bought that plane in 1995. Mr. Allen did a full renovation, transforming it into a luxurious private jet. He installed a master suite that included a bathroom and guest room. He put a conference table, overhead projector and bar in the center of the aircraft. This room had two couches and 11 single seats, according to F. A. A. records. Elsewhere on the plane, Mr. Allen installed 12 sleeper seats, each with their own foldout monitors.  He agreed to sell it to Mr. Trump in 2010, records show. The purchase price was not disclosed, though it was widely reported that Mr. Trump paid $100 million. The aircraft was insured at a value of $35 million in 2011, records show, and aviation experts say it is currently worth about $18 million. Boeing no longer makes 757s, but a 2015 Boeing Business Jet would sell for approximately $80 million, and cost anywhere from $20 million to $40 million to outfit. After Mr. Trump took possession of the 757 in 2011 he made a number of changes but did not fundamentally undo Mr. Allen’s initial renovation, records show. For instance, he kept the headboard in the master bedroom, as well as most of the chairs, couches and toilet seats Mr. Allen had left, choosing to reupholster them. Greg Raiff, chief executive officer of Private Jet Services, an aviation consulting firm and   charter broker for corporations and individuals, said the Boeing was an unusual aircraft for a man of Mr. Trump’s wealth. “Buying a    757 is like buying a bag of Cheetos. It’s a lot of food for a low price,” he said. The Cessna was previously owned by NetJets, an aircraft company that caters to the nation’s wealthiest people, and has flown more than other planes its age, records show. It was worth $15. 3 million new and has a current resale value of approximately $3. 2 million, according to an estimate by Vref Publishing, a company that supplies information about aircraft values. The Times paid Vref to value the plane based on publicly available information. Mr. Trump’s three other aircraft are helicopters. Two of those are 1989 Sikorsky   one of which was used to give rides to children at the Iowa State Fair. Mr. Trump took possession of the other 1989 in August 2014. It has logged only a handful of flights with the F. A. A. since he took possession, records show, though not all chopper flights are logged with the federal regulator. One notable trip that it received clearance to make was on New Year’s Eve in 2015, when, records show, it was given authorization to fly to Nassau, in the Bahamas, from West Palm Beach, Fla. Both helicopters are worth approximately $875, 000, according to Vref. The third helicopter, a 1990 Sikorsky   was purchased in March 2012 and is currently worth roughly $940, 000. The Trump Organization has used pictures of it to help market its golf courses. It was shipped to Scotland in 2015, for the use of clients of Trump Turnberry Resort in Scotland. “The sky’s the limit at Trump Turnberry, with exclusive helicopter charter now available for guests for quick and seamless travel to destinations across Scotland and beyond,” the resort’s website reads.'"}, "time": 1742564160.3747115}