{"duration": 0.12341690063476562, "input_args": {"text": "'“The advice that I would give to people today, if they’re home from work, is to  —   is to go about a normal day,” Mayor Rudolph W. Giuliani said on Sept. 12, 2001. “Take the day as an opportunity to go shopping, be with your children. Do things. Get out. Don’t feel  —   don’t feel locked in. ” Go shopping. Mr. Giuliani’s   counsel on the day after a terrorist attack killed 2, 753 people in Lower Manhattan was quickly stripped of context and turned into caricature  —   retail as opiate. When the going gets tough, the tough go shopping. I don’t think he meant that shopping would solve the problems of a city struggling to awaken from an unparalleled nightmare. But it was the first thing that came to his mind. The role of retailing at ground zero came to mind again last week on my first visit to the Westfield World Trade Center shopping mall, which opened in August. The experience was at once heartening and dispiriting. Heartening, because Santiago Calatrava’s soaring Oculus now teems with people. The cantilevered “diving boards” over the great hall have instantly become downtown’s version of the crowded balconies at Grand Central Terminal, the ideal spot to take that perfectly symmetrical architectural panorama. (With a selfie in the bargain.) Things will only get livelier when subway stations are opened at either end of the hall, and the Oculus grows into its role as a transit corridor. Dispiriting, because there is little to suggest that Westfield World Trade Center occupies consecrated ground. Apart from the bravura of Mr. Calatrava’s design, and the   marble floors, this mall could be just about anywhere. And unlike the   mall of the original trade center, there seems to be no place yet to get your shoes shined or a key copied. It was also dispiriting because I could have seen this coming years ago. As a reporter, I failed to pay enough attention to the role played by Westfield America in the redevelopment. That left me susceptible to the official line that the Oculus was a transportation center with shops appended. It is now clear that the Oculus is  —   and was always intended to be  —   a shopping mall with an ancillary transportation purpose. Lynne B. Sagalyn’s new book, “Power at Ground Zero: Politics, Money and the Remaking of Lower Manhattan,” lays out some clues I neglected. Westfield had big ideas for a trade center mall years before the attack. The company is a shopping center operator founded by Frank P. Lowy and based in Australia. Its American arm was the partner of Silverstein Properties, which signed a contract with the Port Authority of New York and New Jersey in April 2001 to take over the trade center. Westfield looked at the expansive trade center plaza and the already profitable underground mall, and dreamed greater dreams, Ms. Sagalyn wrote: “150, 000 square feet of additional shopping space created by raising the plaza one level, opening up the concourse with a grand entrance to bring light into the underground areas, and making better connections with ramps and staircases to provide access to the new level. ” Silverstein and Westfield remained the leaseholders after the trade center was destroyed. Though city planners sought to recreate the street grid that had been obliterated by the original trade center, Westfield was adamantly opposed. “Frank Lowy had built his mall empire on the highly successful model of the suburban center the design of this prototype  —   large, undivided pedestrian spaces without passing cars and trucks  —   was totally oriented to making it as easy as possible for consumers to spend money,” Ms. Sagalyn wrote. Westfield pulled out of the project in September 2003 but paid $1 million for an option to return. “Nothing had changed about the company’s ambition to control the retail opportunity in one of the country’s most valuable locations,” Ms. Sagalyn wrote. Four months later, Mr. Calatrava’s design for the World Trade Center Transportation Hub was unveiled. The mezzanine level was the working heart of the PATH commuter railroad terminal. But the birdlike    shell between Church and Greenwich Streets  —   now known as the Oculus  —   was what captured the city’s imagination. And that is where the Port Authority intended to accommodate many of the trade center stores. “The Transportation Hub offered exceptionally good retail space with strong   profit potential,” Ms. Sagalyn noted. Westfield returned and eventually put $2 billion into the project, Ms. Sagalyn said. The Oculus structure, built by the Port Authority, cost $483 million out of the overall $4 billion budget for the hub. On Sunday, the 15th anniversary of the attack will be marked with a solemn ceremony at the trade center. This is Westfield’s first chance to show itself as a corporate citizen there. “Due to the sensitive nature of the day,” Westfield told its tenants in a recent letter, “we’re recommending to our retailers  —   in part based upon guidance from our community partners  —   that they not open for business until the conclusion of the ceremony at approximately 12:30 p. m. This is 90 minutes after our traditional open hours on Sundays. ” Last week, I canvassed 50 of the 60 tenants currently at the trade center. Of the 21 that responded to an email inquiry, 19  —   including Apple, Breitling, Charles Tyrwhitt, Fossil, John Varvatos, Kate Spade, Kiehl’s, Kit and Ace, L. K. Bennett, Moleskine, Sephora, Sugarfina and Thomas Sabo  —   said they would honor the   request. Two other stores, COS and House of Samsonite, said they would not open until 1 p. m. The John Varvatos store said it would donate 20 percent of the day’s sale proceeds to the   Tribute Center. Westfield also plans to turn the enormous LED advertising billboards in the concourses over to video programming by the National September 11 Memorial and Museum. The restraint is commendable. I’m not certain it suffices for the magnitude of the moment. But it certainly hews to Mr. Giuliani’s suggestion, made long ago.'"}, "time": 1742562015.0824652}