{"duration": 0.18064141273498535, "input_args": {"text": "'WASHINGTON  —   The Supreme Court on Thursday rejected a challenge to a   admissions program at the University of Texas at Austin, handing supporters of affirmative action a major victory. The decision, Fisher v. University of Texas, No.   concerned an unusual program and contained a warning to other universities that not all affirmative action programs will pass constitutional muster. But the ruling’s basic message was that admissions officials may continue to consider race as one factor among many in ensuring a diverse student body. The decision, by a    vote, was unexpected. Justice Anthony M. Kennedy, the author of the majority opinion, has long been skeptical of   programs and had never before voted to uphold an affirmative action plan. He dissented in the last major affirmative action case. Supporters of affirmative action hailed the decision as a landmark. “No decision since Brown v. Board of Education has been as important as Fisher will prove to be in the long history of racial inclusion and educational diversity,” said Laurence H. Tribe, a law professor at Harvard, referring to the Supreme Court’s 1954 decision striking down segregated public schools. Roger Clegg, the president of the Center for Equal Opportunity, which supports colorblind policies, said the decision, though disappointing, was only a temporary setback. “The court’s decision leaves plenty of room for future challenges to racial preference policies at other schools,” he said. “The struggle goes on. ” President Obama hailed the decision. “I’m pleased that the Supreme Court upheld the basic notion that diversity is an important value in our society,” he told reporters at the White House. “We are not a country that guarantees equal outcomes, but we do strive to provide an equal shot to everybody. ” Justice Kennedy, writing for the majority, said courts must give universities substantial but not total leeway in designing their admissions programs. “A university is in large part defined by those intangible ‘qualities which are incapable of objective measurement but which make for greatness,’” Justice Kennedy wrote, quoting from a landmark desegregation case. “Considerable deference is owed to a university in defining those intangible characteristics, like student body diversity, that are central to its identity and educational mission. ” “But still,” Justice Kennedy added, “it remains an enduring challenge to our nation’s education system to reconcile the pursuit of diversity with the constitutional promise of equal treatment and dignity. ” Justices Ruth Bader Ginsburg, Stephen G. Breyer and Sonia Sotomayor joined Justice Kennedy’s majority opinion. Justice Elena Kagan, who would probably have voted with the majority, was recused from the case because she had worked on it as solicitor general. In a lengthy and impassioned dissent delivered from the bench, a sign of deep disagreement, Justice Samuel A. Alito Jr. denounced the court’s ruling, saying that the university had not demonstrated the need for   admissions and that the Texas program benefited advantaged students over impoverished ones. “This is affirmative action gone berserk,” Justice Alito told his colleagues, adding that what they had done in the case was “simply wrong. ” Under the University of Texas’ admissions program, most applicants from within the state are admitted under a part of the program that guarantees admission to top students in every high school in the state. This is often called the Top 10 Percent program, though the percentage cutoff can vary by year. The Top 10 Percent program has produced significant racial and ethnic diversity. In 2011, for instance, 26 percent of freshmen who enrolled under the program were Hispanic, and 6 percent were black. The population of Texas is about 38 percent Hispanic and 12 percent black. The case challenged a second part of the admissions program. Under it, remaining students from Texas and elsewhere are considered under standards that take into account academic achievement and other factors, including race and ethnicity. Many colleges and universities base all of their admissions decisions on such grounds. In Grutter v. Bollinger in 2003, the Supreme Court endorsed such   holistic admissions programs, saying it was permissible to consider race as one factor among many to achieve educational diversity. Writing for the majority in that case, Justice Sandra Day O’Connor said she expected that “25 years from now,” the “use of racial preferences will no longer be necessary. ” Justice Kennedy’s decision left Grutter intact. Thursday’s case was brought by Abigail Fisher, a white woman who said the university had denied her admission based on her race. She has since graduated from Louisiana State University. “I am disappointed that the Supreme Court has ruled that students applying to the University of Texas can be treated differently because of their race or ethnicity,” Ms. Fisher said in a statement on Thursday. “I hope that the nation will one day move beyond affirmative action. ” When the court last considered Ms. Fisher’s case in 2013, supporters of affirmative action were nervous. But the court deferred conclusive action in what appeared to be a compromise decision. In his dissent on Thursday, Justice Alito said the court had reversed itself. “Something strange has happened since our prior decision in this case,” he wrote. When the second iteration of the case was argued in December, Justice Kennedy suggested that the court might again send it back to the appeals court. On Thursday, though, he said that would have been a waste of time. “A remand would do nothing more than prolong a suit that has already persisted for eight years and cost the parties on both sides significant resources,” he wrote. “Petitioner long since has graduated from another college, and the university’s policy  —   and the data on which it first was based  —   may have evolved or changed in material ways. ” Justice Kennedy then methodically rejected Ms. Fisher’s arguments. He said the university’s diversity goals were not amorphous but “concrete and precise,” satisfying the constitutional requirement that government racial classifications advance a compelling interest. Justice Alito described those goals  —   concerning “the destruction of stereotypes,” promoting “  understanding” and preparing students “for an increasingly diverse work force and society”  —   as slippery and impervious to judicial scrutiny. Justice Kennedy wrote that the university was justified in saying that the Top Ten Percent plan did not alone produce sufficient diversity, adding that the holistic part of the admissions program “had a meaningful, if still limited, effect on the diversity of the university’s freshman class. ” He said the Top Ten Percent program had   limits. “An admissions policy that relies exclusively on class rank creates perverse incentives for applicants,” he wrote. “Percentage plans ‘encourage parents to keep their children in   segregated schools, and discourage students from taking challenging classes that might lower their grade point averages,’” he added, quoting from an earlier dissent from Justice Ginsburg. “Wherever the balance between percentage plans and holistic review should rest, an effective admissions policy cannot prescribe, realistically, the exclusive use of a percentage plan,” Justice Kennedy wrote. Justice Kennedy’s majority opinion was 20 pages long. It elicited a furious   dissent from Justice Alito, joined by Chief Justice John G. Roberts Jr. and Justice Clarence Thomas. Justice Alito said the majority opinion helped affluent   students and hurt   ones. “Even though U. T. has never provided any coherent explanation for its asserted need to discriminate on the basis of race, and even though U. T.’s position relies on a series of unsupported and noxious racial assumptions,” he wrote, “the majority concludes that U. T. has met its heavy burden. This conclusion is remarkable  —   and remarkably wrong. ” Sherrilyn Ifill, the president of the NAACP Legal Defense and Educational Fund Inc. said the decision was gratifying. “Universities all over the country are breathing a sigh of relief,” she said. “The court very compellingly reaffirmed the importance of diversity. ”'"}, "time": 1742563583.116351}