{"duration": 0.06283164024353027, "input_args": {"text": "'WASHINGTON  —   Continuing his sustained critique of the American capital justice system, Justice Stephen G. Breyer on Monday issued an unusual dissent from the Supreme Court’s decision not to hear the case of a Florida death row inmate who said his conviction had been based on flawed evidence and false testimony. Justice Breyer did not discuss the evidence against the inmate, Henry P. Sireci. Instead, he again urged his colleagues to reconsider the use of the death penalty, which he said was unreliable, arbitrary and shot through with racism. In the process, he addressed two other recent death penalty cases, from Ohio and Alabama, in which he said the court had also gone astray. In Mr. Sireci’s case, Justice Breyer returned to a longstanding concern, saying the court should have considered whether the inmate’s four decades on death row violated the Eighth Amendment’s ban on cruel and unusual punishment. “He has lived in prison under threat of execution for 40 years,” Justice Breyer wrote of Mr. Sireci. “When he was first sentenced to death, the Berlin Wall stood firmly in place. Saigon had just fallen. Few Americans knew of the personal computer or the internet. And over half of all Americans now alive had not yet been born. ” “Forty years is more time than an average person could expect to live his entire life when America constitutionally forbade the infliction of cruel and unusual punishments,” Justice Breyer wrote. Justice Breyer  has long been troubled  by what he said were excessive delays between death sentences and executions. “It is difficult to deny the suffering inherent in a prolonged wait for execution,” Justice Breyer wrote in a dissent in 1999, adding that “our Constitution was written at a time when delay between sentencing and execution could be measured in days or weeks, not decades. ” In response at the time, Justice Clarence Thomas said he found that argument unpersuasive. “I am unaware,” Justice Thomas wrote, “of any support in the American constitutional tradition or in this court’s precedent for the proposition that a defendant can avail himself of the panoply of appellate and collateral procedures and then complain when his execution is delayed. ” Justice Breyer also used his dissent on Monday in Sireci v. Florida, No.   to explain his thinking about two other cases. He said he would have agreed to hear the case of an Ohio death row inmate, Romell Broom, who had sought to avoid a second attempt to execute him after a first one had gone awry. “Medical team members tried for over two hours to find a usable vein, repeatedly injecting him with needles and striking bone in the process, all causing ‘a great deal of pain,’” Justice Breyer wrote of the first attempt to execute Mr. Broom, quoting a court decision. “The state now wishes to try to execute Broom once again. Given its first failure, does its second attempt amount to a ‘cruel and unusual’ punishment?” Justice Breyer said the question was at least worthy of the court’s attention, and he suggested that the answer was yes. But the Supreme Court on Monday declined to hear the case, Broom v. Ohio, No.  . As is their custom, the justices in the majority gave no reasons for turning down the case. Justice Elena Kagan indicated that she had voted to hear it, but she did not join Justice Breyer’s dissent. Justice Breyer is the court’s leading critic of the death penalty. In a sweeping   dissent last year, he urged the court to take a fresh look at the constitutionality of the punishment. On Monday, he summarized part of his critique. “As I and other justices have previously pointed out,” Justice Breyer wrote, “individuals who are executed are not the ‘worst of the worst,’ but, rather, are individuals chosen at random, on the basis, perhaps of geography, perhaps of the views of individual prosecutors, or still worse on the basis of race. ” He gave one recent example of another case in which he said he would have granted review. On Thursday, he wrote, “this court, by an equally divided vote, denied a stay of execution” to Ronald B. Smith, an Alabama man who was sent to death row after the trial judge rejected the jury’s    vote in favor of a life sentence. Mr. Smith was executed that night.'"}, "time": 1742562560.95011}