{"duration": 0.060938119888305664, "input_args": {"text": "'Print This Post Los Angeles County Sued for Millions in Medical Kidnapping Case CA Jury Awards $3.1 Million in Damages to Mother Whose Baby Was Seized Without a Warrant, Accused of Munchausen Syndrome by Proxy \\nby Monica Mears Health Impact News \\nAfter a six-year court battle, a mother in Los Angeles who lost custody of her 15-month-old baby through false abuse charges won a major battle for parental rights last week. \\nWhen Rafaelina Duval’s son Ryan was seized by L.A. County Department of Children and Family Services (DCFS) in 2010, she was falsely accused of intentionally starving him. He had been diagnosed by a pediatrician with “failure to thrive,” but the doctor at the time also noted that the child was in no immediate danger, according to Duval’s attorney, Shawn McMillan. \\nNot only did DCFS seize her baby, but they ordered no reunification because they claimed Duval would starve her baby to get attention due to Munchausen syndrome by proxy (MSBP) a rare, widely discredited mental disorder often used (and misused) against mothers by social workers across the country. The basis for DCFS’ claim – that Duval’s baby was underweight and she was taking him to doctors to find out what was wrong with him – sounds more like what any concerned, responsible mother would do, not some twisted form of child abuse. \\nSee: World Renowned Medical Anthropologist Compares Munchausen Syndrome by Proxy Labeling to Witch Hunts \\nIn a stunning blow to Los Angeles County, the jury found that its DCFS social workers “intentionally and willfully” seized her child without a warrant, and did so “with malice.” Additionally, the jury found that the county DCFS had “an official custom and/or practice of seizing children from their parents without a warrant” and failed “to enact an official policy or procedure when it should have done so.” \\nSee: Mom stripped of son wins $3M from social workers \\n“The law is very clear, and they (social workers) get special training on this. You cannot seize a child from its parents unless there’s an emergency,” stated McMillan in an interview with FOX 11, a local TV station. \\nThe jury awarded Duval $2.94 million in compensatory damages, plus $165,000 after finding in a separate verdict that she was the victim of discrimination, since she suffers from a lifelong tremor disorder, which social workers wrongfully claimed interfered with her ability to feed and care for her child. The money awarded for punitive damages will come directly from the social workers. \\n“Money is not everything. And no money can satisfy how I feel,” Duval told FOX 11’s reporter as she choked back tears. The win is bittersweet, since she is still pursuing custody of her son. ( Source .) \\nSuing a county’s child protective services agency is extremely rare, notes Duval’s attorney, Shawn McMillan, who specializes in civil rights cases against child protection agencies. He has been awarded the “Street Fighter of the Year” award for defending family rights and taking on the abuses of social service agencies in California. \\n“You have to have a fire in your belly,” to fight CPS, he said in an interview with Medical Kidnap. “It’s not considered ‘sexy’ or high profile.” \\nMcMillan was a highly successful lawyer prior to taking on CPS cases. “I was like a mercenary. I was good at it – very good.” \\nBut when he took Deanna Fogerty’s case in 2007, his eyes were opened. Deanna had her daughters taken from her wrongfully for six years, and sued Orange County. McMillan fought her case all the way up to the Supreme Court, where Fogerty finally won. \\nNow, he says: \\n“I don’t trust these guys (CPS) farther than I can throw them.” \\n“No one does this,” McMillan pointed out, noting the lack of lawsuits against CPS agencies nationwide, despite the widespread abuses of power. \\n“I hope other parents, other attorneys will take up the fight with these guys,” he said. “Taking kids is a one billion dollar industry – do you really think they’ll just stop? These cases will hopefully show others that the government does bleed.” \\nMcMillan acknowledges that Duval’s case has a fairly narrow Constitutional application: specifically defining parents’ 4 th amendment (freedom from unreasonable searches and seizures) and 14 th amendment rights (due process). \\n“This case demonstrated that our community still places a high value on the Constitution. They cannot seize a child from a mother without a warrant.” \\nDuval’s successful case may positively affect several other cases McMillan is pursuing, including class action lawsuits against Orange County and Riverside County in California, both of which are also accused of kidnapping thousands of children without a warrant. \\nSee:'"}, "time": 1742628439.1619136}