{"duration": 0.18333864212036133, "input_args": {"text": "'Vladimir Putin: The United States continues to sleep with al-Nusra ‹ › Richard Edmondson is an author, novelist, poet, and journalist whose writings often focus on Middle East issues, the Zionist lobby, and religion. His latest novel is The Memoirs of Saint John: When the Sandstone Crumbles , a story about an archaeological team doing a dig in Syria and set amidst the current conflict in the country. In 2014 Richard attended an International Conference on Combating Terrorism and Religious Extremism, held in Damascus. The book is part two in the Memoirs of Saint John series. Two other books by Richard are Rising Up: Class Warfare in America from the Streets to the Airwaves , relating his experiences founding and operating an unlicensed or \"pirate\" FM radio station in San Francisco in the 1990s, as well as a volume of poetry entitled American Bus Stop: Essay and Poems on Hope and Homelessness . Richard is cognizant of the words of the early Christian writer Tertullian, who in the second century-basically prognosticating the fall of the Roman Empire-wrote: \"We have made merry amid the ludicrous cruelties of the noonday exhibition.\" Veterans Forced to Repay Signing Bonuses…While Billions in Aid Continues Flowing to Israel By Richard Edmondson on October 27, 2016 Petition Launched to Stop Veterans from Having to Repay Bonuses \\nLet’s say you recruit somebody to do a job for you. Because it’s a particularly dirty job, you’re having trouble finding people to fill the position… so… to sweeten the pot, you offer a $20,000 “signing bonus.” That’s in addition, of course, to the monthly salary you plan to pay them. The added incentive helps. People start signing their names on the dotted line to go to work for you. \\nThen nine or ten years pass by. Suddenly one day you think to yourself, “Hell, what did I offer all those bonuses for? That was dumb. I think I’ll demand my money back!” Of course some of the people you paid the money to are no longer alive, and others sustained catastrophic injuries while working for you, but hey! All’s fair in love…and especially in war!!! \\nWell, that’s the predicament that a number of US veterans now find themselves in. Back in the days when the wars in Afghanistan and Iraq were ramping up big time, military recruiters took to offering sizeable bonuses to get people to join or reenlist. Recently it was reported that the government has begun demanding this money back. Supposedly the bonuses never should have been paid out in the first place, and the decision to do so was a result of oversight, fraud, and mismanagement. \\nSo…long story short, veterans have begun paying back their bonuses, in some cases at the rate of hundreds of dollars per month, while others, those in financial binds who could not afford to meet the additional expenses, are said to be facing wage garnishment. There are reports that veterans are even being charged interest on their outstanding debt. \\nAs you may expect, the story of this shabby treatment of American vets has prompted public outrage, and the latest news, posted Wednesday at NPR , is that the Pentagon is now “suspending” the debt collection program. \\nDefense Secretary Ashton Carter is calling for “the fair and equitable treatment of our service members and the rapid resolution of these cases,” although the article seems deliberately vague and ambiguous as to whether the bonuses will have to be repaid or whether the debts will be cancelled. The only thing stated clearly is that Carter intends to establish “a streamlined, centralized process that ensures the fair and equitable treatment of our service members and the rapid resolution of these cases.” The “resolution” (whatever that means) of “these cases” is to be completed by no later than July 1, 2017, the Defense Secretary has announced. \\n“Ultimately, we will provide for a process that puts as little burden as possible on any soldier who received an improper payment through no fault of his or her own,” Carter said. “At the same time, it will respect our important obligation to the taxpayer.” \\nRight now the focal point of the scandal is California, because that’s where most of the illegal bonuses were paid, although it seems veterans in other states may be facing similar demands. Carter’s statement on the matter addresses only the problem in California. \\nA petition has been launched demanding Congress take action to rescind the obligation for veterans to repay the bonuses: \\nIn 2006, at the height of the wars in Iraq and Afghanistan, the California National Guard offered bonuses for troops enlisting and re-enlisting. It was part of an aggressive recruitment effort to retain troops during the height of both of those wars. \\nNow, ten years later, the Pentagon is demanding many of those who received bonuses – almost ten thousand service members – pay them back because they were offered in violation of Federal law. \\nRight now, veterans are receiving letters from debt collectors, they’re being threatened with tax liens, tax return withholdings and other penalties if they do not repay those bonuses. \\nThese troops, many of them whom went on to serve overseas, were offered these bonuses in good faith and should not be penalized for what amounts to a bureaucratic failure in oversight. \\nCongress, or the Pentagon need to make this right, and they need to do it immediately. \\nSign our petition calling for immediate Congressional action, or action from the Defense Department, to use its authority to waive repayment of enlistment or re-enlisted bonuses they accepted in good faith ten years ago. \\nThe stories are heartbreaking: \\n“It’s gut-wrenching because you have to figure out what you’re going to do and how you’re going to survive. We were paying upward $1,300 a month back to that recoupment. We weren’t able to afford everything — food for the kids, a day care.” – Christopher Van Meter, Iraq War Veteran and Purple Heart recipient \\nCongress, or the Department of Defense, must take action immediately to make things right for Christopher, and thousands of veterans like him, who are being forced into an impossible situation because of mistakes they did not make. \\nWe’re hopeful that there will be resolution on this issue, quickly, and we know that outcome is more likely if we all make our voices heard today. \\nSign our petition calling for immediate Congressional action, or action from the Defense Department, to use its authority to waive repayment of enlistment or re-enlisted bonuses they accepted in good faith ten years ago. \\nI have worked in financial management at the base level and at the Pentagon. In my view, there is no more important task an agency has than to alleviate any issues related to the undue financial burden placed on these veterans and their families. \\nThank you for making your voice heard. \\nYou can click here to sign the petition. \\nThe US has been giving money to Israel since 1951, and of course nobody is presently demanding that any of that be repaid. The year 1979 was an especially watershed year–with $3 billion in US tax dollars being paid out. According to the Jewish Virtual Library, a “second special package” was approved in 1985 due to a “severe economic crisis in Israel,” this consisting of two disbursements, totaling $1.5 billion, handed out in 1985 and ’86. (1) \\nEconomic aid, however, has gradually been phased out over the past 2o years and replaced by increases in military aid. In 2007, the Bush administration approved a 10-year, $30 billion package for military expenses, and most recently the Obama administration approved a $38 billion package that will start in 2019 and cover Israel through 2029. The present rate of flow of US tax dollars to Israel is approximately $10.2 million per day. (2) \\nAid to the Jewish state is of course vigorously pushed by the pro-Israel lobby in Washington. And the lobby, as many of us are aware, doesn’t just clamor for aid; it also promotes wars. \\nIt’s interesting that many military veterans now being called upon to repay their signing bonuses are veterans of the Iraq war. In the following video, dating from 2002, you’ll see none other than Israeli Prime Minister Benjamin Netanyahu making a case for military action against Iraq, urging the US to wage “preemptive war”–he actually uses that term, not once but repeatedly–and in the process claiming, falsely, that Saddam Hussein had chemical and biological weapons and was on the verge of acquiring nuclear weapons. Basically, he plays Congress like a violin. As you watch his performance, a performance that seems almost choreographed, consider what we now know about 9/11, the overwhelming evidence of controlled demolition, and of how the fall of Saddam Hussein led to the rise of ISIS. \\nIt’s interesting to note what was going on in 2002 when Netanyahu made that appearance before Congress. This was two years after the start of the second Intifada, and Saddam Hussein had begun paying out sums of money, in some cases $25,000 , to the families of Palestinian suicide bombers. That’s a fact of history, though not a well-known one. And while Saddam Hussein posed no threat to the US, quite obviously Israel had plenty of reason for wanting him overthrown. And so Netanyahu made his pitch before Congress. And neocon pundits in the media began fanning the flames of war. Weapons of mass destruction! Mushroom clouds! Smoking guns! Yellowcake uranium from Niger! And off we went to war!! \\nA war essentially for Israel. \\nBy 2005 we were caught in a quagmire with no end in sight, and the Pentagon, having trouble meeting enlistment quotas, began sweetening the pot with signing bonuses. Between 2000 and 2008, the money spent on enlistment bonuses rose from $891 million to $1.4 billion. The following is an article from CBS News published back in 2007. You might find it interesting. \\nTwenty-nine-year-old Joan Marte thinks now is the right time to join the army. \\n“I get to travel, basic training sounds like fun,” he says. \\nYemin Ko, 24, who describes himself as a patriot, is also signing up. \\n“I wanted to do something important,” he says. \\nThe Army needs them both to meet its enlistment goals for this year. \\nIt surpassed its July recruitment targets by more than 200 new soldiers, CBS News correspondent Michelle Miller reports, by adding recruiters — and with an unprecedented incentive: $20,000 signing bonus given to soldiers willing to ship out to basic training within a month . \\n“The intent of the bonus is to get folks to ship quickly so they can attend basic training and we can meet the end strength the army is required to have,” says Lt. Col. Joseph Feliciano. \\nIn New York, recruitment commanders say they’re already seeing better numbers this month since the signing bonuses were put on the table. And the army hopes to pump up those numbers by September 30th, the end of the fiscal year. \\n“Is this what we really want? To bribe people to get them to go and fight an unpopular war?” says Larry Korb, who served as assistant secretary of defense in the Reagan Administration. Korb, who is a senior fellow at the Center for American Progress, says the new policy will be bad for the army. \\n“They’ve already lowered the standards. Last year, when they did meet their recruiting goals, they had lowered the educational and aptitude standards,” says Korb. \\nUnder the new deal, recruits could be serving in a combat zone within four months. \\n“That’s a risk I’m willing to take, and I’m proud of it,” says Ko. \\nYemin Ko says he’ll be ready to serve, and at a time when every body counts, the Army is banking on the same thing. (3) \\nThat was in 2007. Now here we are nine years later, and veterans are being told to repay the money they were paid. One such veteran is Susan Haley, who got sent to Afghanistan in 2008 and is now trying to repay the bonus she received. She presently sends the Pentagon $650 per month–a quarter of her family’s income. \\n“I feel totally betrayed,” Haley told the L.A. Times . “They’ll get their money, but I want those years back.” \\nHaley, 47, spent 26 years in the Army along with her husband and oldest son, a medic who lost his leg in Afghanistan. \\nThere is a lot of outrage felt in America now toward our own government, and certainly a lot of it is justified. But maybe Americans, particularly those whose passions have been aroused over the treatment of veterans, should start considering the enormous influence exerted by the Israeli lobby in Washington, along with the possibility that the anger they’re now reserving for their own government is, at least in part, misdirected. \\nNotes: \\n1. Jewish Virtual Library, US-Israel Foreign Aid 2. If Americans Knew, US Aid 3. CBS News, Army-signing-bonuses-bring-in-recruits, Aug. 11, 2007 Related Posts:'"}, "time": 1742563183.5955667}