{"duration": 0.04861927032470703, "input_args": {"text": "'Matchbox Twenty frontman Rob Thomas says Hollywood celebrities’ constant complaining about President Donald Trump is getting stale, whatever one’s personal opinion of the president may be. [“I’m not a fan of Donald Trump, but I am so tired of hearing celebrities talk about not being a fan of Donald Trump, that it almost seems like white noise,” Thomas said in an interview with The Hill. “I think that he’s a man that’s not really equipped for the job, but I think no one really cares what I think about that. ”  “I have opinions, but my opinions are as a    husband, father, taxpayer. No matter what I say, they always kind of come across as a guy who sings music and it’s always, ‘Well you need to shut up! ’” the   singer continued. Thomas also acknowledged that a large part of Trump’s base thinks the president is “killing it right now,” and said it would be difficult to criticize them despite his own political opinions. The “Lonely No More” singer was a featured speaker Tuesday at the American Society for Composers, Authors and Publishers (ASCAP) Foundation’s ninth annual “We Write the Songs” event at the Library of Congress. Thomas has been advocating on behalf of songwriters, whom he claims are being robbed of their royalties by big businesses that take advantage of antiquated federal regulations. “American songwriters, composers and music publishers are some of the most   small business owners and entrepreneurs in the country because   of the income that songwriters receive is subject to federal regulation,” Thomas wrote in an   published Wednesday at Quartz. “And you better believe the big,   Wall   music streaming companies are happy to take advantage of these regulations to pay songwriters less than fair value for their work and are actively fighting updates to these regulations so they can continue to build their businesses on the backs of songwriters,” he added.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563811.6522067}