{"duration": 0.05124545097351074, "input_args": {"text": "'Natural Blaze As if the November elections weren’t bad enough news for the world, a new report by the Living Planet Index was recently released that contains very frightening visions for the future.\\nAccording to the report, the number of living wild animals is expected to fall by two-thirds by 2020 from its 1970 levels. The report suggests that this massive disappearance is actually part of a mass extinction that will have effects that reach every corner of the globe and ultimately destroying the natural world and thus, humanity itself. \\nThe report is considered the most comprehensive analysis published so far by many experts. It points out that animal populations between 1970 and 2012 declined by 58 percent and that by 2020 it is projected to reach 67 percent. \\nIn other words, we are in the midst of a mass die-off and only four years away from seeing an irreparable amount of damage to the natural world. \\nResearchers from the World Wildlife Fund (an admittedly questionable organization) and the Zoological Society of London were responsible for compiling the report drawn from various data sources and determined that pollution, over-hunting/fishing and the destruction of wild habitats were to blame. \\nNot only endangered species like elephants and gorillas are in danger, however. For instance, vultures and salamanders appear to be on their way to extinction and the animals at risk reside in forests, jungles, mountains, deserts, rivers and oceans. \\nAccording to the Guardian , \\nThe report analysed the changing abundance of more than 14,000 monitored populations of the 3,700 vertebrate species for which good data is available. This produced a measure akin to a stock market index that indicates the state of the world’s 64,000 animal species and is used by scientists to measure the progress of conservation efforts. \\nAccording to the report, logging and the destructing of natural habitats for farming purposes are the biggest cause of animal deaths. Poaching and over fishing and over-hunting for food are other major causes. \\nRecent research shows that 300 mammal species are being eaten into extinction . \\nPollution is also an obvious significant factor. \\nFor instance, dolphins and killer whales in European seas are being killed by the presence of industrial chemicals. In Southeast Asia the vulture population has been decimated for two decades due to the fact that the birds are dying after eating cattle carcasses of cows who had been treated with anti-inflammatory drugs. \\nFungal diseases are having a horrific effect on the amphibian population – a disaster that many believe to be caused by world trade of frogs and newts. \\nRivers and lakes are having the most dramatic declines. Here, animal populations are down 81% since 1970. \\nAs Marco Lambertini, Director General of WWF, said: \\nThe richness and diversity of life on Earth is fundamental to the complex life systems that underpin it. Life supports life itself and we are part of the same equation. Lose biodiversity and the natural world and the life support systems, as we know them today, will collapse. \\nWhile Westerners wring their hands and obsess over CO2, they continue to ignore real environmental catastrophes like industrial chemical pollution, over-fishing, loss of biodiversity through genetic modification and unsustainable farming. \\nIf the world wants to survive 21st century, it will immediately begin to look at ways in which development and higher living standards can be produced while at the same time ensuring that the natural world is protected. \\nAt this point, we have no other choice.'"}, "time": 1742628359.2946832}