{"duration": 0.03519773483276367, "input_args": {"text": "'President Obama shortens 98 more ‘unduly harsh’ drug sentences; Never mind those firearms violations Posted at 6:57 pm on October 27, 2016 by Brett T. Share on Facebook Share on Twitter \\nSeeing the end of his second term approaching quickly, President Obama made another dent in his to-do list Thursday by granting 98 more commutations, bringing his total to 872. Obama grants 98 more commutations. The total is now a record 872 shortened sentences, mostly for drug offenses. https://t.co/oVF3HgoYNU \\n— Ray Locker (@rlocker12) October 27, 2016 . @POTUS granted another 98 commutations today and has commuted more than the previous 11 presidents combined. https://t.co/htzhcFtV2f pic.twitter.com/v6lQo4YoSN \\n— Civil Rights (@civilrightsorg) October 27, 2016 BREAKING: Obama grants 98 more commutations, setting single-year clemency record https://t.co/yUV63AurvM pic.twitter.com/uB0MNRQs39 \\n— SPLC (@splcenter) October 27, 2016 \\nThe White House usually makes quite a big deal out of the president’s commutation sprees, but the blog post accompanying Thursday’s batch was relatively brief, noting that “while there has been much attention paid to the number of commutations issued by the President, at the core, we must remember that there are personal stories behind these numbers.” Eggleston says the 98 commutations are going to individuals \"who have diligently worked to rehabilitate themselves while incarcerated.\" \\n— Mark Knoller (@markknoller) October 27, 2016 \\nThe people to whom some of these criminals sold drugs certainly have their own personal stories as well, but don’t look for those in the news. Most of those granted clemency are serving time for nonviolent drug crimes, but while the president has teamed up with rapper Macklemore to fight opioid abuse, he’s also cutting the sentences of a whole lot of crack and meth dealers. @markknoller Great, more criminals added to the thousands of others he\\'s released into our communities. \\n— Normi Shamblin (@RtisticOne) October 27, 2016 \\nOh, yeah, and don’t forget the guns. For a believer in gun control, the president doesn’t seem to believe felons in illegal possession of firearms deserve the harsh sentences they were given. Of the 98 people granted clemency Thursday, 19 or so were felons in possession of firearms — but sure, pass more gun control laws. Trending'"}, "time": 1742562173.9853384}