{"duration": 0.03544473648071289, "input_args": {"text": "'Actor and   comedian T. J. Miller believes that the roles of entertainers have changed drastically with the election of President Donald Trump. [In an interview with the Wrap this week, the Silicon Valley star  —   whose first HBO   special, Meticulously Ridiculous, premiered Saturday  —   said his whole approach to his craft has changed now that Trump, whom he called “this mother***er in the White House,” was elected in November.  “It used to be different  —   before it was, ‘What is absurdist?’ Then this mother***er in the White House totally changed everything for everyone,” the    actor told the outlet. “Immediately after the election, Kumail Nanjiani was walking around the set of Silicon Valley saying, ‘Everything’s changed now  —   standup, everything.’ Now, I have a political obstacle to a social mission, and the f*ckery that must be dealt with,” he added. Miller has previously spoken out against the president during his hosting gig at the Critics’ Choice Awards in December, the actor joked that trolls did well in 2016, “not the movie, but the dudes on the Internet,” adding: “One of them got elected president. ” Miller also stood on an actual “soap box” for a segment about how celebrities should stick to doing their jobs instead of trying to opine on politics. “All I want to do is talk about what’s going on in the world, but the problem is, I hate when celebrities get on their soap box,” Miller said. “Just do your act. Don’t tell the rest of us how to think, O. K.?” A few days before the awards show, the Office Christmas Party actor was arrested after allegedly slapping an Uber driver during what was reported to be an argument between the two about    Trump. While a large number of Hollywood stars have taken their political activism to new heights since Trump’s election, not every celebrity believes it is the obligation of entertainers to discuss political topics. A number of celebrities, including Mark Wahlberg, Billy Joel, and Kevin Hart have said explicitly in the past that they prefer to stay away from talking about their personal politics.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742563877.923791}