{"duration": 0.03181123733520508, "input_args": {"text": "'After CNN host Reza Aslan stirred controversy with a series of vulgar tweets against President Trump and others, the cable news network has dropped plans to move forward on Believer, Aslan’s “spiritual adventure series” that purported to explore religious ideas across the world. [“CNN has decided to not move forward with production on the acquired series ‘Believer with Reza Aslan,’” the network said in a statement reported by Variety. “We wish Reza and his production team all the best. ”  Had CNN picked up the show, it would have entered into its second season. Aslan released a statement accusing CNN of trying to “protect its brand. ” He insisted his show stands for “tolerance,” but his personal statements reflect his role as “a social commentator and scholar” rather than a journalist. My statement about the cancellation of #Believer pic. twitter.   —   Reza Aslan (@rezaaslan) June 9, 2017,  The parting of ways comes as Aslan stirred controversy with a June 3 Twitter attack on President Trump, calling the president a “piece of shit. ” “This piece of shit is not just an embarrassment to America and a stain on the presidency. He’s an embarrassment to humankind,” Aslan, a man who claims to be a student of religion, wrote in a tweet he later deleted. It turns out the June 3 tweet was not the only time Aslan used Twitter to attack the president in vulgar terms. After Aslan’s   of Trump had gone viral, Twitter users began combing through his feed and found many other examples of the CNN host’s   comments. Twitter users quickly found that Aslan had called the president and his eldest son the   in a past tweet, and in another case, Aslan tweeted that he hoped someone would rape GOP congressional candidate Todd Akin. Twitter users next discovered that Aslan began deleting his problematic tweets after they were uncovered. Aslan also stirred controversy on his CNN show. The host was heavily criticized for eating part of a human brain during a segment about a Hindu sect in India on his CNN series, Believer. The U. S. India Political Action Committee slammed Aslan’s actions, saying, “With multiple reports of   attacks against people of Indian origin from across the US, the show characterizes Hinduism as cannibalistic, which is a bizarre way of looking at the third largest religion in the world. ” In another case, Aslan upset Christians when he excoriated the Christian Bible as “replete with historical errors. ” It is interesting that CNN completely ignored Aslan’s many off color and vulgar tweets until now. He has a long history of such tweets liberally dropping   and using the   time and again. For a man who claims to be a student of religion he certainly uses an awful lot of foul language. In one tweet Aslan accused House Speaker Paul Ryan of saying “f*ck” Syrian moms, in another he told conservative commentator Dinesh D’Souza to “go f*ck” himself,” then he guffawed that Trump didn’t “sh*t himself in public,” and those are just a few examples. Except of course Syrian moms fleeing war, famine, and genocide with their starving children. Fuck those moms. https:  .   —   Reza Aslan (@rezaaslan) May 14, 2017,  Hey Dinesh. I’ll say this as politely as I can: Go fuck yourself, you adulterous piece of shit felon. https:  .   —   Reza Aslan (@rezaaslan) October 21, 2016,  But on the plus side he didn’t shit himself in public. https:  .   —   Reza Aslan (@rezaaslan) May 29, 2017,  In fact, on May 9, Aslan arguably said something far worse about Trump than he did in the Tweet that got him fired by CNN: “Oh the joy when this lying conniving scumbag narcissistic sociopath piece of shit fake president finally gets what’s coming to him. ” Oh the joy when this lying conniving scumbag narcissistic sociopath piece of shit fake president finally gets what’s coming to him. https:  .   —   Reza Aslan (@rezaaslan) May 10, 2017,  Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628550.4646287}