{"duration": 0.10283994674682617, "input_args": {"text": "'SAN BERNARDINO, Calif.  —   Gunfire erupted inside an elementary school classroom in San Bernardino, Calif. on Monday, leaving two adults and one student dead in what the authorities said was an apparent  . The shooter, whom the police identified as Cedric Anderson, 53, walked into the classroom and without speaking opened fire on his wife, Karen Elaine Smith. Ms. Smith, 53, was the lead teacher in the class of 15 students with special needs, who ranged from first to fourth graders. Two students were standing behind Ms. Smith, though the police did not say whether they had been directly hit by gunfire or wounded with shrapnel. An    student, Jonathan Martinez, was airlifted by helicopter from the school, North Park Elementary, to a nearby hospital where he was pronounced dead shortly after he arrived. A    student was also wounded and was in stable condition Monday afternoon. The shooter entered the school through the front office and was checked for his identification, following routine procedures, the police said. There was no sign Mr. Anderson was carrying a weapon. Mr. Anderson and Ms. Smith had been married for several months and had been separated for the last month, the San Bernardino police chief, Jarron Burguan, said in an afternoon news conference. There was no indication of an earlier threat at the school, which does not have metal detectors. While the couple had been estranged, friends and family had not told the police about any previous violence between the couple, Chief Burguan said. Mr. Anderson did have a criminal record, including domestic violence, weapons possession and possibly drug possession, he said. At least six shots were fired from a . 357 caliber revolver, the chief said. “Tragedy again has befallen our city,” said Lt. Mike Madden, a spokesman for the Police Department who was one of the first officers to respond to the terrorist attack in San Bernardino in 2015. The school will be closed for at least two days, said Dale Marsden, the superintendent of the school district. Several counselors were sent to talk with students, he said, including those who were also questioned by investigators about the shooting. Counselors will continue to be available, Mr. Marsden said, urging parents to talk with their children and contact officials if they need help. “Be willing to listen to their story and be willing to listen to their story multiple times,” he said. “Reassure them that the danger that they faced has passed. ” Capt. Ron Maass said officers arrived at the school seven minutes after they received the first call about the shooting, just before 10:30 a. m. Other students at North Park were taken to California State University, San Bernardino for safety. All students had been released to their families by 4:30 p. m. Several parents who went to the high school complained about the confusion over where to reunite with their children and said they had only heard about the shooting from friends who live in the area. One man said he had received a call from his daughter, a sixth grader, before the school notified him. “She was just in a panic, but what kid wouldn’t be in a situation like that?” he said. Arnetta Carpenter, 70, the grandmother of two children at the school  —   ages 7 and 9  —   was in a meeting at the nearby New Hope Missionary Baptist Church, where she is the minister, when a staff member walked in to tell her about the shooting. She ran to the phone to call her son. “He said ‘Mama, I’m here,’” she recalled, relieved. “Children should never have to witness something like this,” she said. “It hasn’t been that long since the other shooting happened in San Bernardino. It really shows how we need to be close to the Lord. ” Lydia Beltran, 56, went to pick up her two grandchildren who attend North Park. Though they appeared to be unharmed, she was worried about the other effects of the shooting. “Mentally, we’ll have to wait and see,” she said. “Hopefully, it didn’t happen in their classroom. We don’t even know. What have we come to?” A Police Department spokeswoman posted a picture on Twitter from the inside of the gymnasium where the students were waiting, saying that they were being taken care of and entertained with glow sticks, checkers and a Disney movie while they waited for their parents. Mayor R. Carey Davis of San Bernardino said he had received a call from the White House and that President Trump offered to help “in any way possible. ” Betsy DeVos, the secretary of education who has supported Mr. Trump’s promise to ban   zones around schools, wrote on Twitter asking “everyone to join me in keeping the victims and all those impacted by today’s senseless violence in your prayers. ” North Park Elementary is about 10 miles from the site of the 2015 attack. The city, which is predominantly   has seen a significant increase in violent crime in the last year. There were 62 murders in the city in 2016, compared with 44 in 2015, including the 14 victims of the attack. Roughly 500 students, who are predominantly Latino, attend North Park Elementary.'"}, "time": 1742562363.7895372}