{"duration": 0.015611886978149414, "input_args": {"text": "'  EXPOSED: Blocks Of George Soros Funded Anti-Trump Protest Buses For Paid Agitators Caught On Tape The video was taken at 3:30pm on South Canal Street in Chicago on Saturday. As our reader points out, hundreds of the participants that took part in the downtown Chicago protests from November 12 were bused in using these vehicles. Other arrived by train.   Video reveals that the “spontaneous” anti-Trump protesters are actually paid agitators bused in courtesy of the George Soros machine \\nEDITOR’S NOTE: Video taken on the ground in Chicago yesterday show block after block of buses that are being used to bring in professional agitators to protest Donald Trump’s landslide victory over Hillary Clinton. Who is paying for all these buses bringing in all these protesters? Why, it’s our old friend George Soros, of course. And he is playing his favorite card, the race card. Soros, you will recall, spent millions busing in agitators to fuel the race riots in Ferguson , Baltimore and Chicago . \\nFrom Zero Hedge: Earlier today we showed that, contrary to USA Today’s claims that the anti-Trump protests across the nation are “spontaneous, involving people from all walks of life”, according to Wikileaks documents at least two of the people profiled by USA Today have a history of being professional agitators for the Democratic party, whose task is to stir up popular protests and – in extreme cases – unleash rioting, such as the following clip showing the latest day of violent protests in Portland revealed. \\nAs our reader notes , “I have a video of 5 city blocks on the West side of Chicago lined with busses from Wisconsin (Badger Bus Lines) bringing in protestors. The Sears tower is visible in the background.” \\nThe video was taken at 3:30pm on South Canal Street in Chicago on Saturday. As our reader points out, hundreds of the participants that took part in the downtown Chicago protests from November 12 were bused in using these vehicles. Other arrived by train. source Police repeatedly charge anti-Trump protesters as Portland chaos continues https://t.co/h3Y24Ykb9h pic.twitter.com/vPPD10sQbw'"}, "time": 1742628445.6809866}