{"duration": 0.04951119422912598, "input_args": {"text": "'  \\nThe death of former Israeli president and prime minister Shimon Peres last week marks the last of the Zionist “old guard” who successfully fought for a UN mandate to establish the state of Israel in what was formerly British Palestine. Much has been written about Peres since his death. He was a peacemaker. He was a warrior. He was brutal. He was complex. It is possible for all of them to be accurate at the same time. \\nWas Peres a warrior? That is without question. Israel was established in bloodshed and Peres played an important role in that fight. Also, the brutal Israeli attack on a Palestinian refugee camp at Qana in 1996 took place under Peres’s command. In that attack more than 100 women and children were killed. \\nBut history, and especially Middle East history, can be quite complex. Shimon Peres was above all in favor of trying to find a way for Israelis and Palestinians to live side-by-side. He was right there in spirit when Israeli Prime Minister Yitzhak Rabin had a famous 1993 handshake with Palestinian leader Yassir Arafat. Rabin paid for his efforts with his life, as a right-wing radical assassinated him in 1995. \\nShimon Peres was in favor of real negotiations with the Palestinians and he several times inserted himself into the process to urge the hawkish Benjamin Netanyahu to start talking rather than saber rattling. In 2012, for example, Peres made it known again that he favored a two-state solution and that Palestinian leader Mahmoud Abbas was a suitable negotiating partner. He also urged Netanyahu to open up direct talks with Hamas if certain agreements could be made beforehand. \\nBut perhaps his greatest move to avert war only came known with his passing. Former Jerusalem Post editor Steve Linde wrote a fascinating article last week in his old newspaper detailing a meeting he and the Post’s managing editor had with Shimon Peres in 2014. According to Linde, Peres was asked what he thought was his greatest legacy. He replied that he had personally intervened to stop Netanyahu from ordering a preemptive strike on Iran’s nuclear sites. Asked by the journalists when they could report this revelation, Peres responded, “when I’m dead.” So it came to pass last week. \\nHow much for the worse things have become in Israeli-Palestinian relations with the passing on of anyone preferring negotiations to violence. There is little interest among current Israeli leadership to take steps toward negotiation or peace. Innocent Israelis and Palestinians will continue to be killed and injured as long as no compromises are considered. Sadly this position is reinforced in Washington, where the Obama administration just agreed to grant Israel the largest military aid package in US history. \\nThere is much to admire in those who work for peace, even those with stains on their record. I remain convinced that Israeli-Palestinian peace efforts would be much closer to bearing fruit if the US government would stop inserting itself into the process and subsidizing either side. Left alone, both sides would likely produce more leaders interested in ending bloodshed and conflict.'"}, "time": 1742628420.2146475}