{"duration": 0.031748056411743164, "input_args": {"text": "\"Zach Cartwright | November 6, 2016 \\nOne of the most prolific Twitter users in the world is being denied his favorite medium of communication in the days before the election. \\nAccording to the New York Times, Donald Trump’s social media usage is being stymied by top campaign aides, in an effort to keep the Republican presidential nominee from straying off message as voters prepare to cast their ballots. Calling the revocation of Trump’s sole control over the @realDonaldTrump account an “essential move” prior to Election Day, the Times reported that Trump’s tweets are now being closely screened by top communications aide Hope Hicks , who approves every tweet before it’s fired off into the world. \\nTrump’s tweeting has previously landed him in rough waters, such as a flurry of tweets fired off at 3 AM about former Miss Universe Alicia Machado, who the billionaire reality TV host once referred to as “Miss Piggy” in reference to her weight gain following the pageant, and “Miss Housekeeper” in reference to her Latina upbringing. Trump also encouraged his 13 million followers to “check out” a sex tape allegedly featuring Machado. The tweets came after a debate with Hillary Clinton, who brought up her rival’s treatment of the beauty queen near the end of the 90-minute debate. Using Alicia M in the debate as a paragon of virtue just shows that Crooked Hillary suffers from BAD JUDGEMENT! Hillary was set up by a con. \\n— Donald J. Trump (@realDonaldTrump) September 30, 2016 Did Crooked Hillary help disgusting (check out sex tape and past) Alicia M become a U.S. citizen so she could use her in the debate? \\n— Donald J. Trump (@realDonaldTrump) September 30, 2016 \\nTrump has frequently used his account on the popular social media platform to attack his political rivals on both sides of the aisle. In 2012, Trump tweeted his doubts that President Barack Obama was born in the United States, and to peddle fears about the Ebola virus. He’s also tweeted insulting remarks about prominent women in society, given unsolicited advice to celebrities about their relationships, and fired off insults at random people. An 'extremely credible source' has called my office and told me that @BarackObama 's birth certificate is a fraud. \\n— Donald J. Trump (@realDonaldTrump) August 6, 2012 How amazing, the State Health Director who verified copies of Obama’s “birth certificate” died in plane crash today. All others lived \\n— Donald J. Trump (@realDonaldTrump) December 12, 2013 . @ariannahuff is unattractive both inside and out. I fully understand why her former husband left her for a man- he made a good decision. \\n— Donald J. Trump (@realDonaldTrump) August 28, 2012 Everyone knows I am right that Robert Pattinson should dump Kristen Stewart. In a couple of years, he will thank me. Be smart, Robert. \\n— Donald J. Trump (@realDonaldTrump) October 22, 2012 I have never seen a thin person drinking Diet Coke. \\n— Donald J. Trump (@realDonaldTrump) October 14, 2012 \\nTrump will likely be able to wrest control of his social media accounts back from his campaign staff on November 9. \\n\\nZach Cartwright is an activist and author from Richmond, Virginia. He enjoys writing about politics, government, and the media. Send him an email at [email protected] \""}, "time": 1742628446.1555462}