{"duration": 0.053710222244262695, "input_args": {"text": "'In an interview with Spain’s flagship leftist newspaper, Pope Francis warned against rash judgments of President Donald Trump, noting that he deserves to be given a chance to prove himself. [The interviewer from the Spanish daily El País told the Pope that “the whole world is tense” over the election of President Trump, calling him a xenophobe filled with “hatred for foreigners. ”  The Pope said that the new President deserved to be judged by his actions, not by “prophecies” of what he may or may not do. “I think that we must wait and see,” Francis said. “I don’t like to get ahead of myself nor judge people prematurely. We will see how he acts, what he does, and then I will have an opinion. ” The Pope said it is “most unwise” to be afraid of something that might happen. “It would be like prophets predicting calamities or windfalls that don’t take place. We will see. We will see what he does and then evaluate,” he said. “I prefer to wait and see. ” The interviewer, Antonio Caño, pressed the Pope further, asking whether he wasn’t “worried about the things you have heard up until now. ” “I’m waiting. God waited a long time for me, with all my sins  …    ” Francis replied. The Pope’s words Friday echoed a recent interview with the Archbishop of Vienna, Cardinal Christoph Schönborn, who also advised against rushing to negative judgments of Trump, comparing him to Ronald Reagan, who turned out to be a great president. Asked for his impressions about the election of Donald Trump, Cardinal Schönborn noted that when Ronald Reagan was elected in 1980 “many shook their heads” and it turned out they were wrong. “Good God, an actor from California!” they said. “And Reagan was certainly one of the best presidents the U. S. ever had. So you should not be too quick to judge,” he advised. In Friday’s lengthy interview with El País, Pope Francis was also asked whether he was concerned about the spread of a populism throughout the world that capitalizes on “people’s fears,” preaching “a message of hate. ” Francis distinguished between a good, grassroots populism, where it is the people who are “the protagonists,” and a cult of personality where a charismatic figure like Hitler rises to power and is welcomed as a savior figure. The latter can be very dangerous, he said. The risk, Francis said, is that in times of crisis we lack judgment and people can begin to think, “Let’s look for a savior who gives us back our identity and let’s defend ourselves with walls,   whatever, from other people that may rob us of our identity. ” “And that is a very serious thing,” he said. “That is why I always try to say: talk among yourselves, talk to one another. ” Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742563852.0179539}