{"duration": 0.03187680244445801, "input_args": {"text": "'Rep. Barbara Lee ( ) said on Tuesday that she does not agree with states’ rights because President Donald Trump believes in restoring states’ authority on a wide range of issues, including education and health care insurance markets. [Lee made the remarks at the   Center for American Progress in Washington, DC, where she referenced states rights as it applies to Trump’s decision this month to withdraw the United States from the Paris climate change agreement, a move she claims would hurt the U. S. economy.  Moreover, Lee said, California is still committed to fighting global warming. “Pulling out of the Paris Accord is also a job killer,” Lee said. “Because the energy sector  —   the green sector  —   coming from California we’re doing a lot of things  —   I think some other states will follow. “Because the jobs that are being created will be destroyed now as a result of what this president has done,” Lee said. “I don’t agree with states’ rights because that is kind of this administration’s push but in some instances when we have to just go at it on our own  —   we need to go at it on our own,” Lee said. But according to Robertson Williams, a professor at the University of Maryland and director of academic programs for Resources for the Future, a   group that studied the climate change agreement, it is difficult to know exactly what the economic impacts of withdrawing will be. Williams was interviewed by the Boston public radio station in May where he was asked about the economic impact of leaving the agreement. “One of the problems we have, we’re much better at modeling the cost of doing something to reduce emissions than we are modeling the cost of doing nothing,” Williams said. “We don’t know very well how other countries are gonna react. “If other countries react by doing less to fight climate change, that has very real costs,” Williams said. “That unchecked climate change could have very serious costs for the U. S. economy. “But knowing exactly how big that is is really hard,” Williams said.'"}, "time": 1742562243.576979}