{"duration": 0.03914189338684082, "input_args": {"text": "'Russia refuses to join any scheme to help Syrian refugees and blames Western powers for Europe’s migration crisis. A trickle of migrants have entered Russia – but the country has granted asylum to only two Syrians so far this year. \\nVia UsualRoutine \\n\\nNonetheless, Russia blamed the West for Syria’s bloodshed and for the outflow of refugees. “We expect that for the most part that expenditures [for dealing with refugees] will fall on the countries linked to causing the catastrophic situation,” said Dmitry Peskov, the Kremlin spokesman, according to Interfax news agency. Asked whether Russia would join any program to help refugees, Mr Peskov replied: “It’s hardly likely.”\\nScroll Down For Video Below! He confirmed that some refugees from the Middle East had tried to cross Russian territory with the aim of reaching the European Union by crossing the border into Norway. Mr.Peskov warned that terrorists from the Islamic State of Iraq and the Levant(Isil) could infiltrate groups of migrants, posing a possible security threat.\\nThe Kremlin has recently provided Mr.Assad with more military support by sending a contingent of Russian troops to Syria. Their role appears to be to protect the Russian naval facility at Tartous, on Syria’s Mediterranean coast, and provide training and expertise for the regime’s forces, which are responsible for the great majority of civilian deaths in the conflict. “The threat coming from Islamic State is evident,” said Mr.Peskov. “The only force capable of resisting it is the Syrian armed forces.”\\nLast week, President Vladimir Putin said that Europe’s migration crisis was “completely predictable”, adding: “These are the policies of our American partners. Europe blindly follows within the framework of its so-called duties as an ally – and then must bear the burden.”\\n'"}, "time": 1742562187.212054}