{"duration": 0.08268547058105469, "input_args": {"text": "'BREAKING! NYPD Ready To Make Arrests In Weiner Case…Hillary Visited Pedophile Island At Least 6 Times…Money Laundering, Underage Sex, Pay-for-Play,Proof of Inappropriate Handling Classified Information Blackwater USA Founder, Retired Navy Seal Erik Prince \\nPrince claimed he had insider knowledge of the investigation that could help explain why FBI Director James Comey had to announce he was reopening the investigation into Clinton’s email server last week. \\n“Because of Weinergate and the sexting scandal, the NYPD started investigating it. Through a subpoena, through a warrant, they searched his laptop, and sure enough, found those 650,000 emails. They found way more stuff than just more information pertaining to the inappropriate sexting the guy was doing,” Prince claimed. \\n“They found State Department emails. They found a lot of other really damning criminal information, including money laundering, including the fact that Hillary went to this sex island with convicted pedophile Jeffrey Epstein. Bill Clinton went there more than 20 times. Hillary Clinton went there at least six times,” he said. \\n“The amount of garbage that they found in these emails, of criminal activity by Hillary, by her immediate circle, and even by other Democratic members of Congress was so disgusting they gave it to the FBI, and they said, ‘We’re going to go public with this if you don’t reopen the investigation and you don’t do the right thing with timely indictments,’” Prince explained. \\n“I believe – I know, and this is from a very well-placed source of mine at 1PP, One Police Plaza in New York – the NYPD wanted to do a press conference announcing the warrants and the additional arrests they were making in this investigation, and they’ve gotten huge pushback, to the point of coercion, from the Justice Department, with the Justice Department threatening to charge someone that had been unrelated in the accidental heart attack death of Eric Garner almost two years ago. That’s the level of pushback the Obama Justice Department is doing against actually seeking justice in the email and other related criminal matters,” Prince said. \\n“There’s five different parts of the FBI conducting investigations into these things, with constant downdrafts from the Obama Justice Department. So in the, I hope, unlikely and very unfortunate event that Hillary Clinton is elected president, we will have a constitutional crisis that we have not seen since, I believe, 1860,” Prince declared. \\nMarlow asked Prince to clarify these revelations. \\n“NYPD was the first one to look at that laptop,” Prince elaborated. “Weiner and Huma Abedin, his wife – the closest adviser of Hillary Clinton for 20 years – have both flipped. They are cooperating with the government. They both have – they see potential jail time of many years for their crimes, for Huma Abedin sending and receiving and even storing hundreds of thousands of messages from the State Department server and from Hillary Clinton’s own homebrew server, which contained classified information. Weiner faces all kinds of exposure for the inappropriate sexting that was going on and for other information that they found.” \\n“So NYPD first gets that computer. They see how disgusting it is. They keep a copy of everything, and they pass a copy on to the FBI, which finally pushes the FBI off their chairs, making Comey reopen that investigation, which was indicated in the letter last week. The point being, NYPD has all the information, and they will pursue justice within their rights if the FBI doesn’t,” Prince contended. \\n“There is all kinds of criminal culpability through all the emails they’ve seen of that 650,000, including money laundering, underage sex, pay-for-play, and, of course, plenty of proof of inappropriate handling, sending/receiving of classified information, up to SAP level Special Access Programs,” he stated. \\n“So the plot thickens. NYPD was pushing because, as an article quoted one of the chiefs – that’s the level just below commissioner – he said as a parent, as a father with daughters, he could not let that level of evil continue,” Prince said. \\nHe noted that the FBI can investigate these matters, “but they can’t convene a grand jury. They can’t file charges.” \\n“The prosecutors, the Justice Department has to do that,” he explained. “Now, as I understand it, Preet Bharara, the Manhattan prosecutor, has gotten ahold of some of this. From what I hear, he’s a stand-up guy, and hopefully he does the right thing.” \\nMarlow agreed that Bharara’s “sterling reputation” as a determined prosecutor was “bad news for the Clintons.” \\nPrince agreed, but said, “If people are willing to bend or break the law and don’t really care about the Constitution or due process – if you’re willing to use Stalinist tactics against someone – who knows what level of pressure” could be brought to bear against even the most tenacious law enforcement officials? \\nListen to interview here: \\n“The point being, fortunately, it’s not just the FBI; [there are] five different offices that are in the hunt for justice, but the NYPD has it as well,” Prince said, citing the Wall Street Journal reporting that has “exposed downdraft, back pressure from the Justice Department” against both the FBI and NYPD, in an effort to “keep the sunlight and the disinfecting effects of the truth and transparency from shining on this great evil that has gone on, and is slowly being exposed.” \\n“The Justice Department is trying to run out the clock, to elect Hillary Clinton, to prevent any real justice from being done,” he warned. \\nAs for the mayor of New York City, Prince said he has heard that “de Blasio wants to stay away from this.” \\n“The evidence is so bad, the email content is so bad, that I think even he wants to stay away from it, which is really telling,” he said. \\nFor entire story: Breitbart News 14.7K shares '"}, "time": 1742563099.0176907}