{"duration": 0.02956533432006836, "input_args": {"text": "'Marc Faber Blog October 28, 2016 \\nThey could essentially monetize everything, and then you have state ownership. And through the central banking system, you introduce socialism and communism, which is state ownership of production and consumption. You would have that, yes, that they can do. \\nThe BoJ owns more than 50 percent of Japanese ETFs (exchange traded funds), which own large parts of the underlying companies. So indirectly they may own 20 percent of the Japanese companies, and they can go up to a higher level. \\nI don’t think the central bankers are intelligent and smart enough to understand the consequences of their monetary policies at present. They focus on inflation but in my view they shouldn’t do anything. They don’t focus enough on what it does to the average standard of living of the people, to the average household income. \\nThe developed market central banks can go on for quite some time.If Zimbabwe prints money, the pain is more obvious right away because if you are Zimbabwe, and you print money and the others don’t, and the currency collapses, and you feel the pain much sooner. \\nIf the major central banks, the Fed, the European Central Bank (ECB), the BoJ, the Bank of England, and the Chinese monetize and print money in concert and agreement with each other, they all talk to each other; then the currencies don’t collapse against each other. There may be fluctuations, but we don’t have a general collapse of a currency. \\nPaper money, in general, can then collapse, and it has to a large extent against asset prices like real estate around the world over the last 30 years, against equity prices, against bond prices—which have been rallying since 1981—and against precious metals since 1999. \\nAsset price inflation is less obvious to the average person in the street. The average American has no money, so he doesn’t care if prices for paintings and real estate go up—until it touches him.'"}, "time": 1742561912.1544883}