{"duration": 0.10046720504760742, "input_args": {"text": "'PARIS  —   A casual remark about France’s wartime   actions by Marine Le Pen, the leader of the   National Front, threatened on Monday to derail her yearslong effort aimed at “ ” her party just as she is emerging as a strong contender in this month’s presidential election. The remark was made on Sunday during an interview in which she referred to the most notorious roundup of Jews in France during World War II, when nearly 13, 000 were arrested in Paris by the French police on July 16 and 17, 1942, in what is known as the “Vel d’Hiv roundup. ” “France wasn’t responsible for the Vel d’Hiv,” she said. “If there was responsibility, it is with those who were in power at the time, it is not with France. France has been mistreated, in people’s minds, for years. ” Ms. Le Pen’s words created a small eruption in an already heated campaign, drawing strong criticism by politicians right, left and center and by Jewish groups, who all saw it as an echo of her party’s   roots. In addition, the remark contradicted over 20 years of state policy, which has been to recognize French responsibility for the roundup, in which thousands of men, women and children were rousted from their homes by French police officers, parked in a stinking overcrowded sports arena in Paris  —   the Vélodrome d’Hiver, which has since been destroyed  —   and eventually deported to their deaths in concentration camps. Ms. Le Pen’s words also flew in the face of over four decades of historical research into the eager collaboration of the wartime French government, which had been installed in the spa town of Vichy. It was the French government’s police chief, René Bousquet  —   a favorite of the head of the government at the time  —   who organized the roundup, impressing his German counterparts with his energy. “Vichy did not have a knife to its throat,” the historian Philippe Burrin wrote of the Vel d’Hiv roundup in his landmark book, “La France à l’Heure Allemande,” (“France Under the Germans”). “Without the help of the police”  —   the French police  —   “the SS was paralyzed,” Mr. Burrin wrote. “The French authorities were entirely disposed to get rid of foreign Jews,” he wrote, referring to the officials’ offer to the Nazis, on that occasion at least, to hand over Jews who were not French citizens. Ms. Le Pen’s remark on Sunday was criticized as a “grave mistake” by her principal election opponent, the former economy minister Emmanuel Macron, and as “negationism” by a leader on the right, Christian Estrosi, the president of the    d’Azur region. The Israeli government also had harsh words, as did French Jewish organizations. Ms. Le Pen’s campaign has been oriented around an extreme form of nationalism, and she often criticizes historians and others who bring up the uglier aspects of France’s past, as she did on Sunday. “We’ve taught our children that they have all the reasons in the world to criticize it, to only see its darkest historical aspects,” she said. “I want them to be proud of being French. ” Mainstream candidates on the right have uttered similar sentiments about respecting France’s “national narrative. ” But the Vel d’Hiv and France’s wartime treatment of its Jews have generally been   to this sort of historical revisionism. As the American historian Robert Paxton has pointed out, France was unique in Western Europe in that it was the only country to use its own police force for roundups in territory not occupied by the Germans. Ever since President Jacques Chirac declared in a speech in 1995 commemorating the Vel d’Hiv roundup that “France, on that day, committed the irreparable,” the question of French complicity and guilt has appeared largely settled, officially at least. “Going back on its word, it delivered those whom it was protecting to their executioners,” Mr. Chirac said at the time. On Sunday night, to quiet the growing polemic, Ms. Le Pen tried to place her words in the context of others who have disassociated the Vichy government from France itself. “I consider that France and its Republic were in London during the occupation, and that the Vichy regime wasn’t France,” Ms. Le Pen said in a news release. There again, the historians’ verdict is different. The Vichy government initially enjoyed wide support, its functionaries and officials came largely from the prewar bureaucracy, and many went on to have excellent careers in government and business after the war. Foreign countries, including the United States, maintained embassies at Vichy and had cordial relations with it. Mr. Bousquet received a suspended sentence in 1949 and had a successful career in business afterward. His role and high connections were only belatedly   40 years later, when he was charged with crimes against humanity. He was shot dead by a deranged person in June 1993. “To isolate Vichy from the French population, that doesn’t hold up for one second,” one of France’s leading historians of the period, Henry Rousso, said on Monday. “You only have to look at the newsreels of the crowds applauding Pétain,” Mr. Rousso said, referring to the wartime Vichy leader, Marshal Pétain. “Not all of France was at Vichy. But a part of it was. ” Ms. Le Pen’s remark was all the more puzzling in that she has worked strenuously to dissociate herself from her party’s   past, embodied by her father, the party founder,   Le Pen, who notoriously called the Holocaust a “detail in the history of the Second World War. ”   Nazi collaborators were prominent in the early leadership of the National Front in the 1970s  —   including members of the French SS and collaborationist Milice, and even a leading official of the French wartime   agency, a minor cog in the Holocaust. By the end of the 1980s, Holocaust denial “had become a wholesale part of the Front’s ideology,” the historian Valérie Igounet has written. Ms. Le Pen has typically distanced herself from that aspect of her party.'"}, "time": 1742562169.2828045}