{"duration": 0.2284069061279297, "input_args": {"text": "'VIDEOS Your complete guide to election day and night: What to watch for and when Just winning the popular vote will be insufficient: indeed, it may well be that the popular-vote winner does not win the electoral college By Tyler Durden - November 8, 2016 \\nIt’s almost over: the most divisive, theatrical, dramatic and dirty presidential campaign will be in the history books by this time tomorrow, with more than 130 million Americans expected to cast ballots across 50 states. However, just winning the popular vote will be insufficient: indeed, it may well be that the popular-vote winner does not win the electoral college. \\nSo which states should one be looking at, and how long is the final day’s drama set to continue? \\nFor the benefit of the traders out there, last week we showed a primer from Citigroup explaining when traders can hope to go home on election evening, according to which it was “ all about Florida, North Carolina and Ohio .” \\nAs Citi said, for traders hoping to capitalize on volatility next Tuesday as the election results come trickling in, it may all be over by early evening, at least if Trump loses. That is the calculation of Citi’s Steven Englander, who determined that if Trump loses either Florida or North Carolina or Ohio “the math doesn’t work and it tells us that the shift to Trump was not as pronounced as feared.” Those states close at 7:00 or 7:30 ET. As Citi adds, even if Trump loses by a little in one of these states, it becomes almost impossible for him to win. It would take a tidal wave in a couple of states that look firmly Democrat. Citi helpfully added that “the odds that he loses, say a Florida or North Carolina, but wins a Pennsylvania do not seem high” at which point “vol collapses, MXN rallies and we go home early.” \\nHowever, in a hint that tomorrow may be a very long night for traders – recall that Brexit was an all-nighter, which briefly saw ES halted limit down – the just released “ no toss up ” map from RCP based on the latest polling, shows Trump winning all three of these key states, and suddenly opening up the prospect not only for much more volatility, and yet another all-nighter, but potentially a Trump victory, something the market after today’s furious rally, is certainly not prepared for. \\nIn any event, no matter the fate of these three states, here is a full preview of tomorrow’s election night. \\nThe following chart from Morgan Stanley summarizes what times polls close for any given state as well as the number of electoral votes afforded to each: \\nAs the FT observes , this year’s election is being fought hardest in 10 states: Arizona (11 electoral college votes), Colorado (9), Florida (29), Iowa (6), Nevada (6), New Hampshire (4), North Carolina (15), Ohio (18), Pennsylvania (20) and Virginia (13). Clinton starts with an advantage in the electoral college and can afford to lose traditional battlegrounds such as Florida and Ohio. But if that happens, falling short in states such as Pennsylvania and North Carolina could prove fatal to her presidential ambitions. On the other hand, as noted above, if Trump does not win in Florida and Ohio, his chances of victory will be non-existent. One key could be the size of the turnout of Latino voters in Arizona, Florida and Nevada, which have large Hispanic populations. Another could be whether African-American voters go to the polls at a high rate in North Carolina and Ohio. \\nWhat to watch for during the day, courtesy of Bloomberg : 12 am – Voting is already over in Dixville Notch, the New Hampshire hamlet that delivered a 5-5 tie in the 2012 race between Barack Obama and Mitt Romney. This time, Clinton received four votes, Trump two and Gary Johnson one, with a write-in vote for Mitt Romney, AP reported. Election Day has, finally, arrived. 6 am – Polls are open in eight states, including battlegrounds Virginia and New Hampshire, as well as in New York, where Clinton votes at a public school in Chappaqua, Trump at a public school in Manhattan. 8 am – VoteCastr, which aims to break Election Day’s “traditional information embargo,” goes live on Slate.com with estimates based on early voting in Florida, Colorado, Nevada and Iowa. Those are four of the eight states, representing 102 electoral votes, where VoteCastr is concentrating its data-crunching. More results, from more states, are made available in rolling fashion throughout the day. 2 pm – The VoteCastr/Slate partnership will probably have data from all the battleground states by now, reflecting broad election-day voting patterns. 4 pm – Late afternoon is when leaks and rumors about exit polls may begin to spread, as they did in the last three presidential elections. (The actual results of exit polls are supposed to be closely held by the TV networks and the Associated Press until voting closes, state by state.) Trust these early unconfirmed reports at your own peril, as they indicated in 2004 that the next president would be named Kerry and that Romney was on track to carry Florida in 2012. \\nAnd after markets close, here is the hour by hour guide to closing polls: 6pm EST — The first polls close in Indiana (11), home to Trump running mate Mike Pence, the state’s governor, and Kentucky (8). Both states are heavily Republican and likely to be carried by Mr Trump 7pm EST — Polls close in the battleground states of Florida (29) and Virginia (13). As well as Georgia (16), South Carolina (9) and Vermont (3). The counting of ballots across the nation will go on well into Wednesday. You can, however, expect US media outlets to begin calling the races in safe Democratic and Republican states such as Kentucky, Vermont and South Carolina. But do not expect early calls in Florida or Virginia. In 2012, a winner was not declared in Florida until days after the election. A result in Virginia was not declared until after midnight. 7:30pm EST — Polls close in two more important states: Ohio (18) and North Carolina (15). They also shut in West Virginia (5), where Trump is heavily favoured. Trump has done a lot of campaigning in Ohio, hoping to capitalise on the appeal of his protectionist trade policies in the rust belt state. In 2012, Mitt Romney had been declared the winner in four of the five states called before 8pm. President Barack Obama had won only Vermont. 8pm EST — Things start to heat up. Polls close in the crucial states of Pennsylvania (20) and Michigan (16), and in Alabama (9), Connecticut (7), Delaware (3), the District of Columbia (3), Illinois (20), Kansas (6), Maine (4), Maryland (10), Massachusetts (11), Mississippi (6), Missouri (10), New Jersey (14), Oklahoma (7), Rhode Island (4) and Tennessee (11). Expect a flurry of declarations in safe Republican and Democratic states. If Mrs Clinton does not take Pennsylvania it will be a big blow — especially because she chose to spend the last night of her campaign in Philadelphia alongside her husband and the Obamas. In 2012 it took almost two hours for Obama to be named the winner in the state. It was the first real battleground to be called. Maine is the first of two states that do not allocate their electoral college votes on a winner-takes-all system. Maine and Nebraska allocate some of their electoral votes by congressional district. 9pm EST — The polls close in Colorado (9), Wisconsin (10) and Texas (38). They also shut in Louisiana (8), Minnesota (10), Nebraska (5), New Mexico (5), New York (29), South Dakota (3) and Wyoming (10). Look for early calls for Clinton in the population-heavy states of New York and New Jersey where she is firmly favoured. 10pm EST — Polls are closing in western states Arizona (11), Idaho (4), Montana (3), Nevada (6) and Utah (6) as well as the mid-western farm state of Iowa (6). In 2012, this is when Mr Obama began really piling up the victories. Although it has a long tradition of voting Republican in presidential races, Arizona has been seen as more of a battleground this year. Utah is also interesting this year as conservative Mormon Evan McMullin has been polling well in the state and could even win it. 11pm EST — The polls close in the biggest electoral prize on the map — solidly Democratic California (55) — as well as Washington state (12), Oregon (7) and North Dakota (3). 1am EST — Polls close in Alaska (3) and Hawaii (4). \\n* * * \\nTime for the concession speeches? \\nIn 2008 and 2012, John McCain and Mitt Romney each gave nationally televised concession speeches shortly after midnight eastern time. \\nBut what if there is no winner by the end of the night? In the event that neither candidate gets to 270, the Republican-controlled House of Representatives will decide who the next president should be. \\n* * * \\nWhat are the main factors to watch? \\nWith polls showing voters having negative opinions of both major candidates, one of the key factors on election day could be the enthusiasm of their bases. If black, female, Latino and young voters do not turn out in significant numbers, it could represent a blow to the Clinton camp. Likewise, if white working class voters do not go to the polls in significant numbers it would hurt Mr Trump. \\nTurnout among African-American voters looks likely to be lower than it was in 2008 and 2012. But Trump’s provocative immigration policies mean a growing Hispanic electorate is expected to vote heavily against him. \\nWhat other races should I keep an eye on? \\nAmericans will also be voting for 34 of the US Senate’s 100 seats and for all 435 seats in the House of Representatives. Twelve governorships are up for grabs this year. The big question beyond the presidency is what will happen in the Republican-controlled Congress. A good night for Democrats would see them win five seats and regain control of the Senate (four if Mrs Clinton wins as that would mean vice-president Tim Kaine would cast the deciding vote) while also whittling down the Republicans’ 30-seat majority in the 435-seat House. It is extremely unlikely Democrats will regain control of the House. \\n* * * \\nFinally, here is Goldman’s own guide to election night: Poll closing times and the estimated time each state will be called: we note the time that polls close in each state. For states in multiple time zones, we include the latest poll closing time. We also include a rough estimate of when media outlets will announce a winner of the presidential race in each state, based on the polling margin (close votes take much longer to call). Prediction market probabilities: we note the implied probability of a Democratic win in each state for the presidential and Senate contests. Probabilities are taken from Predictit.org as of 2pm ET on Nov. 7.'"}, "time": 1742563251.613971}