{"duration": 0.09073758125305176, "input_args": {"text": "'Posted on October 31, 2016 by Dr. Eowyn | 2 Comments \\nChristians are one of the main targets of the Islamic State as they cut a murderous swath through Syria and Iraq. And yet, Christians constitute only 0.5% of the Syrian refugees whom the Obama administration has admitted into the United States. \\nOn October 21, 2016, in his concurrent opinion in the case of Heartland Alliance National Immigrant Justice Center v. U.S. Department of Homeland Security , Judge Daniel Manion , a federal appellate court judge for the U.S. Seventh Circuit, issued a sharp rejoinder to the Obama administration over the almost complete lack of Syrian Christian refugees being admitted to the U.S. Note: Heartland Alliance National Immigrant Justice Center is a “progressive” liberal advocacy organization. The Heartland Alliance v. DHS case has nothing to do with Christian refugees, but pertains to Heartland Alliance’s FOIA request to the DHS for information on Tier III terrorist organizations. \\nWhile concurring in the 7th Circuit Court’s ruling, Judge Daniel Manion explains why he’s writing separately. On pages 7-8 of U.S. Court of Appeal for the Seventh Circuit No. 16-1840 Heartland Alliance National Immigrant Justice Center v. U.S. Department of Homeland Security , Judge Manion writes: “I write separately for a second, critical reason, which is my concern about the apparent lack of Syrian Christians as a part of immigrants from that country . It is possible that our case bears a direct link to this enigma. It is well‐documented that refugees to the United States are not representative of that war‐torn area of the world. Perhaps 10 percent of the population of Syria is Christian, and yet less than one‐half of one percent of Syrian refugees admitted to the United States this year are Christian. ¹ Recognizing the crisis in Syria, the President in 2015 set a goal of resettling 10,000 refugees in the United States. And in August the government reached this laudable goal. And yet, of the nearly 11,000 refugees admitted by mid‐September, only 56 were Christian. To date, there has not been a good explanation for this perplexing discrepancy.” \\nJudge Manion also noted that while the Obama administration is bringing Syrian refugees into the country by the thousands, it is concealing basic information about those refugees behind a wall of government secrecy, including whether terrorists are among the refugees. The administration refuses to tell the American public or the states how it is making its decisions on who are accepted for resettlement in the U.S., or even what steps it is taking to ensure there are no terrorists among the refugees. Nor is Congress exercising its oversight functions. \\nAs Manion writes in his concurrent opinion: “The good people of this country routinely welcome immigrants from all over the world. But in a democracy, good data is critical to public debate about national immigration policy. When we demand high evidentiary burdens for states seeking to keep their citizens safe, and then prevent the states from that evidence, we create a Catch-22.² […] And yet, Congress, through the exemptions to FOIA, has consciously made the decision to limit what governmental information is available to the public. If Congress is concerned about how immigration officers are making their decisions related to the designation and application of the Tier III terrorist organization affiliation, Congress has the authority to act. Congress has its own oversight capabilities and subpoena power, and Congress could choose to amend our nation’s sunshine laws or our immigration laws. Until that time, however, many of us remain in the dark as a humanitarian catastrophe continues.” \\nDaniel Manion , 74, is a senior jurist on the United States Court of Appeals for the Seventh Circuit whose chambers are located in South Bend, Indiana. He was an Indiana state senator (R) from 1978-82. In 1986, Manion was nominated by President Ronald Reagan to the 7th Circuit Court.'"}, "time": 1742562020.216807}