{"duration": 0.0960245132446289, "input_args": {"text": "'Families minister Manuela Schwesig has pledged to do more to protect children in Germany from right wing “hipsters” who post messages about migrant criminality on social media. [The Social Democratic Party (SPD) minister was speaking at a press conference last week at which youth protection website Jugendschutz. net said “right wing extremists” are using rap music and social media trends to “spread hate against refugees, Muslims and other minorities”.  “Right wing extremists are using stylish memes and videos to convey their messages,” said the website’s deputy director Stefan Glaser. Speaking in Berlin he warned that “false messages are being launched in a targeted manner to fuel hate” and said activists are posting “false messages” intended to “spread hate” in between “photographs of strawberry and muesli” and other apolitical content. A common tactic of the new wave of   right wing extremists, whom Glaser calls “nipsters”  —   a portmanteau of the words ‘Nazi’ and ‘hipster’ is posting on social media about “the supposed criminality of refugees”. According to Glaser, this typically involves taking messages ‘such as press releases from the police’ out of context to post about “sex jihadists” and “mass rape by Islamists” on Facebook. Jugendschutz. net also warned “the identitarian movement is packaging its propaganda in cool   songs” highlighting ‘Komplott’ a rapper who says that mass migration poses a threat to Europe. Condemning the youth protection website’s findings, Schwesig pledged to expand “media competence” programmes which the chairman of the Federal Centre for Civic Education says teach “young people to recognise fake news, oppose incitement, and show solidarity with victims of hatred”. The minister for family affairs also called for stronger laws to be put in place to ensure that social media companies like Facebook delete   hate posts more quickly, “with no ifs or buts”. Jugendschutz. net reports that in 2016 it found 1, 678 examples of “far right content that poses a threat the development of children and adolescents” 94 per cent of which were found on Facebook, YouTube and Twitter. The organisation was able to get offending content either removed, or access to the material blocked in Germany, in more than 80 per cent of cases after reporting it.'"}, "time": 1742562499.4428365}