{"duration": 0.04742264747619629, "input_args": {"text": "'“The Great British Bake Off,” a hit reality TV show that has been hailed as a cheery avatar of multicultural,   modern Britain, has been torn apart in recent days over a decision by producers to leave its longtime home at the BBC for a rival network, an announcement that surprised its hosts and prompted two of them to quit on Tuesday. “We were very shocked and saddened to learn yesterday evening that Bake Off will be moving from its home,” two of its four hosts, Sue Perkins and Mel Giedroyc, said in a joint statement. “We’re not going with the dough. ” Ms. Perkins and Ms. Giedroyc are both comedians who provide witty banter that is sprinkled throughout the show. Its other two hosts, professional bakers Paul Hollywood and Mary Berry, have not announced if they intend to remain with the program when it moves to its new home, Channel 4. The Guardian reported on Monday that none of the four hosts were consulted during the negotiations. Channel 4 announced the move in a statement on Monday that said it had signed a deal with the show’s producers, Love Productions, and will begin broadcasting the show in 2017. Both companies emphasized that Britons would still be able to watch the show without cost, but they will now have to contend with commercials. The BBC is publicly funded and does not have commercials, nor does the show’s American home, PBS, where it is shown under the name “The Great British Baking Show. ” It is also available in the United States on Netflix. “We believe we’ve found the perfect new home for ‘Bake Off,’ ” Richard McKerrow, the creative director of Love Productions, said in a statement. “It’s a public service,    broadcaster for whom Love Productions have produced high quality and highly successful programmes for more than a decade. ” Mr. McKerrow added that he believed Channel 4 would “protect and nurture” the show “for many years to come. ” Jay Hunt, the chief creative officer of Channel 4, said she was “delighted” that the deal would “keep this much loved show on    television. ” “The Great British Bake Off” follows a group of amateur bakers as they execute increasingly complex recipes and is noteworthy among reality shows because its contestants are uniformly pleasant and likable. It is devoid of both the interpersonal drama and the cash prize that are the hallmarks of American reality TV. There are no screaming fights, just spongecake. The show has had a significant cultural impact in Britain and beyond. Its diverse,   cast has been heralded as a microcosm of modern Britain as it wrestles with questions of national identity in the wake of its surprise vote in June to leave the European Union. More than 10 million viewers in the United Kingdom watched its season premiere last month, and it has spawned a fleet of spinoffs in other countries. Many viewers in Britain reacted negatively to the news that an iconic TV show was leaving the country’s iconic national broadcaster. Julia MacFarlane, a BBC producer, shared a picture on Twitter of the broadcaster’s newly redecorated cafeteria, whose walls were adorned with the image of two of the hosts of “Bake Off. ” Those viewers were not alone. The BBC made no secret of its displeasure with the move. Shortly before Channel 4 announced it had acquired the rights to the show, the BBC issued what amounted to a plea to “Bake Off” producers, saying in a statement that it had “grown and nurtured the programme over seven series and created the huge hit it is today. ” In their joint statement, Ms. Perkins and Ms. Giedroyc agreed with that sentiment. “We made no secret of our desire for the show to remain where it was,” they wrote. “The BBC nurtured the show from its infancy and helped give it its distinctive warmth and charm, growing it from an audience of two million to nearly fifteen at its peak. ” “We’ve had the most amazing time on Bake Off, and have loved seeing it rise and rise like a pair of yeasted Latvian baps,” they added. “We wish all the future bakers every success. ” In the end, the BBC said its disagreement with Love Productions came down to money. “We made a very strong offer to keep the show but we are a considerable distance apart on the money. The BBC’s resources are not infinite,” the BBC statement said. “GBBO is a quintessentially BBC programme. We hope Love Productions change their mind so that Bake Off can stay ad free on BBC One. ” It was a rare moment of drama for a show noted for its placidness. When asked via email to comment on the news that “Bake Off” had found a new home, a BBC spokesperson replied tersely, “We’re not adding anything to the statement. ”'"}, "time": 1742628532.876449}