{"duration": 0.16164445877075195, "input_args": {"text": "'| July 10, 2016 at 4:05 pm | Reply \\nMichael Flynn is more than a valued adviser to the presumptive GOP nominee. He’s also a potential VP candidate. \\nThe growing chatter about his key role in the Trump campaign coincides with his new book, “The Field of Fight: How We Can Win the Global War Against Radical Islam and Its Allies,” scheduled for release July 12. A vice presidential trial balloon certainly would drive interest in the text, and possibly juice sales. \\nHe teamed up on the book with Michael Ledeen, a prominent member of a group of scholars and former government officials that helped shape the views of many top national security leaders in the George W. Bush administration. \\nFollow us: @politico on Twitter | Politico on Facebook \\nMichael Ledeen \\nFrom Wikipedia, the free encyclopedia \\nWork in the United States[edit] \\nIn the early 1980s, Ledeen appeared before the newly established Senate Subcommittee on Security and Terrorism, alongside former CIA director William Colby, author Claire Sterlingand former Newsweek editor Arnaud de Borchgrave. Both Ledeen and de Borchgrave worked for the Center for Strategic and International Studies at Georgetown University at the time.[6]All four testified that they believed the Soviet Union had provided for material support, training and inspiration for various terrorist groupings.[7] Ledeen was involved in the Iran–Contra affair as a consultant of National Security Advisor Robert C. McFarlane. Ledeen vouched for Iranian intermediary Manucher Ghorbanifar. In addition, he met with Israeli Prime Minister Shimon Peres, officials of the Israeli Foreign Ministry and the Central Intelligence Agency to arrange meetings with high-ranking Iranian officials, whereby U.S supported Iranians would be given weapons by Israel, and would proceed to negotiate with Hizbollah for the release of hostages in Lebanon.[8] Ledeen’s own version of the events is published in his book, Perilous Statecraft.[9] \\nYellowcake forgery allegations[edit] \\nMain article: Niger uranium forgeries \\nAccording to a September 2004 article by Joshua Micah Marshall, Laura Rozen, and Paul Glastris in Washington Monthly:[10]“The first meeting occurred in Rome in December, 2001. It included Franklin, Rhode, and another American, the neoconservative writer and operative Michael Ledeen, who organized the meeting. (According to UPI, Ledeen was then working for Undersecretary of Defense Douglas Feith as a consultant.) Also in attendance was Ghorbanifar and a number of other Iranians.” \\nColleagues Andrew McCarthy and Mark R. Levin have defended Ledeen, writing[11] \\nUp until now, the fiction recklessly spewed by disgruntled intelligence-community retirees and their media enablers—some of whom have conceded that the claim is based on zero evidence—has been that Michael had something to do with the forged Italian documents that, according to the Left’s narrative, were the basis for President Bush’s “lie” in the 2003 State of the Union Address that Saddam Hussein had obtained yellowcake uranium (for nuclear-weapons construction) in Africa. \\nIraq War advocacy[edit] \\nRegarding the “pre-emptive” invasion of Iraq, in 2002 Ledeen criticized the views of former National Security Adviser Brent Scowcroft, writing:[12] He fears that if we attack Iraq “I think we could have an explosion in the Middle East. It could turn the whole region into a cauldron and destroy the War on Terror.” \\nOne can only hope that we turn the region into a cauldron, and faster, please. If ever there were a region that richly deserved being cauldronized, it is the Middle East today. If we wage the war effectively, we will bring down the terror regimes in Iraq, Iran, and Syria, and either bring down the Saudi monarchy or force it to abandon its global assembly line to indoctrinate young terrorists. \\nThat’s our mission in the war against terror. Ledeen specifically called for the deposition of Saddam Hussein’s regime by force in 2002: So it’s good news when Scowcroft comes out against the desperately needed and long overdue war against Saddam Hussein and the rest of the terror masters.[12] and: Question #2: Okay, well if we are all so certain about the dire need to invade Iraq, then when do we do so? Ledeen: Yesterday[13] Ledeen’s statements prior to the start of the Iraq war such as “desperately needed and long overdue war against Saddam Hussein” and “dire need to invade Iraq” caused Glenn Greenwald to label his later statement that he “opposed the military invasion of Iraq before it took place” to be an “outright lie”.[14] However, Ledeen maintains these statements are consistent since: “I advocated—as I still do—support for political revolution in Iran as the logical and necessary first step in the war against the terror masters.”[15] \\nViews on Iran[edit] \\nAlthough Ledeen was in favor of invading Iraq, he also believes that Iran should have been the first priority in the “war on terror.”[16] The New York Times describes Ledeen’s views as “everything traces back to Tehran”.[16] Ledeen’s phrase, “faster, please” has become a signature meme in Ledeen’s writings (it is currently the title of his blog on the Pajamas Mediawebsite) and is often referenced by neoconservative writers advocating a more forceful and broader “war on terror.” In 1979, Ledeen was one of the first Western writers to argue thatAyatollah Ruhollah Khomeini was a “clerical fascist”, and that while it was legitimate to criticize the Shah’s regime, if Khomeini seized power in Iran the Iranian people would suffer an even greater loss of freedom and women would be deprived of political and social rights. He presently believes that “No one in the West has yet supported Iranian democratic organizations” and that “aggressive support for those Iranians who wish to be free” would most likely work in ending the clerical government.[17] \\nAccording to Justin Raimondo, Ledeen “holds up Bill Clinton and Madeleine Albright as patsies for Khomeini—who supposedly believed that the Ayatollah overthrew Shah Reza Pahlavibecause the Iranian government was ‘excessively repressive and intolerant.’ While it would not do to come right out and deny the savagery of the Shah’s legendary SAVAK secret police, Ledeen informs us that, under the monarch’s beneficent rule, ‘Iran had become too modern, too tolerant—especially of women and of other religious faiths—and too self-indulgent. The shah had Westernized Iran’—except, perhaps, in his prisons, where the ancient methods of torture were routinely employed on dissidents of all sorts.”[18] \\nLedeen is currently against both an invasion of Iran or air-strikes within the country.[17][19] He has argued that the latter may eventually become necessary if negotiations with the Iranian government fail, but it would only be the least bad option of many options and it would lead to many negative unforeseen consequences.[19] The New York Times has called Ledeen’s skepticism towards military action against Iran surprising given his opposition to the regime.[16] In October 2007, Ledeen argued that:“Those who believe that I am part of some “hawkish gang” just haven’t noticed that I am opposed to invasion or bombing the nuclear facilities. My fear is that, by failing to promote a non-violent democratization of Iran, we make large-scale violence much more likely.” \\n“In any event, time will tell, and I share the fear of most commenters [sic] that we will indeed arrive at a horrible choice between Iran with the bomb, or bomb Iran, as Sarkozy and Kouchner have put it. And if that happens, it will demonstrate a terrible failure on the part of the West, including the United States, to craft a serious Iran policy lo these many years.”[17]'"}, "time": 1742564435.7512076}