{"duration": 0.0776512622833252, "input_args": {"text": "'Hi folks! Eddie Lampert, CEO of Sears Holdings here! I’ve been reliably informed that everyone who’s anyone in conservative America reads MILO, and he has been gracious enough to lend me his column today to send you a simple message  —   Sears and our other failing brand   fucking hate you! [We’re not the first company to think of this innovative customer relations strategy. Nordstrom took the bold first leap into openly shitting on their own shoppers by dumping Ivanka Trump’s clothing line  —   but be realistic conservatives, that particularly racist cissexist misogynistic antisemitic transphobic fatphobic treephobic icecreamphobic autoerotasphyxiaphobic   member of the first family had it coming. Never mind that she is a woman married to a Jewish man, just trust my  !  It makes sense for Sears and   to dump the Trump Home Collection. In fact, I’m struggling to figure out why we didn’t do it sooner. I guess we can’t be accused of being the rocket scientists of the retail world. Just think of the advantages this presents. We’re closing 150 stores by April. If we didn’t piss off half of America with a move against the democratically elected commander in chief and his family, imagine how crowded our remaining stores could be! And we don’t think we’ll see much blowback on our brands. Conservatives are certainly more likely to buy products from our most famous line of products, Craftsman tools, because you like to do things like fix machines and follow disgusting patriarchal gender roles like being handy. Most liberals either live in a big city with no lawn, or have illegal Mexicans working for below minimum wage mow their lawn, so Craftsman tractors are in the same boat. Well, that doesn’t matter because we’ve sold off our best known products anyway! Yes, I will allow we are slightly concerned about some of our other brands. Our Diehard line of vehicle products might turn off metrosexuals, but at least the lesbians still enjoy some automotive maintenance. And the vegans who remind you on Facebook every five minutes that they are vegan will line up to buy Kenmore grills and barbeque equipment, right? We are still working out the details, as you can see, but we know Sears and   can still excel in certain areas. Our high quality sheets can represent a valid fashion alternative for America’s most obese shoppers, a market we will not surrender to competitor JC Penney. Beyond the numbers, dumping Trump is going to make us feel damn good. We will be able to bask in the glow of Hollywood liberals, who we stand beside in making empty gestures against the President of the United States. Heck, maybe J. K. Rowling will like this move so much, she’ll write me in as the next Headmaster at Hogwarts! Let’s be honest  —   we at Sears Holdings have to put feelings before facts. Our stock has cratered in the past six months from almost $18 to $7, and I can’t bear to look at a chart that goes back further. If you did something crazy like read this report from FOX Business, you’d see we are doing terrible by every conceivable retail metric. Falling revenue, terrible comparable store sales and questionable survivability. We’ve pumped $12 billion into Sears Holdings to keep the lights on, and I have to keep loaning my own company money to make suppliers feel comfortable sending us products to put on the shelves. Some companies facing hard times will carefully examine the market and build a business plan that doesn’t actively antagonize half of the country. Sears isn’t one of those companies. Other companies might also review what happened when other companies in their industry took similar steps. We aren’t one of those companies either  —   we really don’t care that Target has had a tough road following their own special   to conservatives. In summary, the Sears and   family knows it is making the right decision in telling you to get stuffed, and we think our business track record speaks for our judgement on making smart decisions. Sincerely, Eddie, DANGEROUS is available to   now via Amazon, in hardcover and Kindle editions. And yes, MILO is reading the audiobook version himself!  Follow Milo Yiannopoulos (@Nero) on Facebook, Instagram and Snapchat. Hear him every Friday on The Milo Yiannopoulos Show. Write to Milo at milo@breitbart. com.'"}, "time": 1742563242.0505369}