{"duration": 0.045361995697021484, "input_args": {"text": "'President Donald Trump met with Republican senators for lunch at the White House to discuss progress on the bill to replace Obamacare, using the occasion to highlight the failures of former President Barack Obama’s signature healthcare plan and the obstruction of Democrats. [“Obamacare has been broken, and it’s been a broken promise,” Trump said to the press, pointing to the “lies” by Democrats that Americans could keep their doctor and their plan and would experience lower premiums. He cited the Obamacare’s leading to skyrocketing premiums in multiple states, many over 100 percent increases.  Trump did not go into detail about what the Senate Republican bill would include, but he said it would be “phenomenal” and “generous, kind, with heart. ” The Democrats, Trump said, were “obstructionists,” whom he said would never support Republican efforts to fix health care. “Even their new motto  —   ‘Resist’  —   I guess it’s a pretty accurate motto. Every time I see it, I say, ‘That’s right. That does represent the Democrats,’” he said. The president said he had “great respect” for the Senate Republicans who attended the lunch: Senator Rob Portman ( )Senator John Thune ( )Senator Pat Toomey ( )Senator Mike Lee ( )Senator Ted Cruz ( )Senator Lamar Alexander ( )Senator John Barrasso ( )Senator Cory Gardner ( )Senator Tom Cotton ( )Senator Lisa Murkowski ( )Senator Susan Collins ( )Senator Joni Ernst ( )Senator Orrin Hatch ( ) “I’ve gotten to know and love some of them and know and like others,” he said as the senators laughed. When asked about the timing of the Republican Senate healthcare bill, Trump replied, “As soon as we can do it. ” The president is expected to meet with families experiencing the failed promises of Obamacare during a trip to Wisconsin Tuesday.'"}, "time": 1742562198.1032112}