{"duration": 0.15062952041625977, "input_args": {"text": "'Os e-mails de Hillary Clinton e da Confraria Thierry Meyssan A investigação do FBI sobre os e-mails privados de Hillary Clinton não diz respeito a uma negligência face às regras de segurança, mas antes a um complô visando destruir qualquer traço da sua correspondência que deveria ter sido arquivada nos servidores do Estado Federal. Poderia incluir trocas de mensagens sobre financiamentos ilegais ou de corrupção, outros sobre laços do casal Clinton com os Irmãos Muçulmanos e os jiadistas.\\nRede Voltaire | Damasco (Síria) | 2 de Novembro de 2016 ελληνικά English Español français Türkçe русский Deutsch italiano Hillary Clinton e a sua chefe de gabinete Huma Abedin. O relançamento da investigação do FBI sobre os e-mails privados de Hillary Clinton não visa mais as questões de segurança, mas, sim trafulhices que poderiam ir até à alta traição.\\nTecnicamente, em vez de utilizar um servidor seguro do Estado Federal, a Secretária de Estado fez instalar no seu domicílio um servidor privado, de maneira a poder usar a Internet sem deixar vestígios numa máquina do Estado Federal. O técnico privado da Sra. Clinton limpara o seu servidor antes da chegada do FBI, de modo que não foi possível saber por que é que ela tinha posto em acção este dispositivo.\\nInicialmente, o FBI observou que o servidor privado não possuía a segurança do servidor do Departamento de Estado. A senhora Clinton, apenas tinha, pois, cometido uma falha de segurança. Numa segunda etapa, o FBI apreendeu o computador do antigo membro do Congresso, Anthony Weiner. Este é o ex-marido de Huma Abedin, chefe de gabinete de Hillary. Nele foram encontrados e-mails provenientes da Secretária de Estado.\\nAnthony Weiner é um político judeu, chegado aos Clintons, que ambicionava tornar-se presidente da câmara(perfeito-br) de Nova Iorque. Ele fora forçado a demitir-se após um escândalo muito puritano: enviara mensagens de texto(SMS) eróticas a uma jovem mulher que não era a sua esposa. Huma Abedin separou-se oficialmente dele durante esta tormenta, mas na realidade não o deixou.\\nHuma Abedin é uma norte-americana que foi criada na Arábia Saudita. O seu pai dirige uma revista académica —da qual ela foi durante anos a secretária de redacção— que reproduzia regularmente as opiniões dos Irmãos Muçulmanos. A sua mãe preside a Associação Saudita das mulheres membros da Confraria e trabalhava com a esposa do presidente egípcio Mohamed Morsi. O seu irmão Hassan trabalha por conta do Xeque Yusuf al-Qaradawi, o pregador dos Irmãos e conselheiro espiritual da Al-Jazeera.\\nPor ocasião de uma visita oficial à Arábia Saudita, a Secretária de Estado visita o colégio Dar al-Hekma em companhia de Saleha Abedin (mãe da sua chefe de gabinete), presidente da Associação das Irmãs membros da Confraria. Huma Abedin é hoje uma personagem central da campanha de Clinton, ao lado do director de campanha, John Podesta, antigo secretário-geral da Casa Branca na presidência de Bill Clinton. Podesta é, além disso, o lobista contratado pelo Reino da Arábia Saudita no Congresso pela módica quantia de US $ 200.000 mensais. A 12 de Junho de 2016, Petra, a agência de notícias oficial da Jordânia, publicou uma entrevista com o príncipe herdeiro da Arábia Saudita, Mohamed Ben Salmane, pretendendo a modernidade da sua família pela mesma ter financiado, ilegalmente, por uns 20% a campanha presidencial de Hillary Clinton, apesar de se tratar de uma mulher. No dia a seguir a esta publicação, a Agência anulava este despacho e assegurava que o seu sítio internet havia sido pirateado.\\nSegundo a agência oficial jordana Petra, a 12 de Junho de 2016, a família real saudita financiou ilegalmente 20 % da campanha presidencial de Hillary Clinton. A Srª Abedin não é o único membro da administração Obama ligada à Irmandade. O meio-irmão do Presidente, Abon’go Malik Obama, presidente da Fundação Barack H. Obama é também o tesoureiro da Obra missionária dos Irmãos no Sudão. Ele está colocado directamente sob as ordens do Presidente sudanês, Omar al-Bashir. Um Irmão Muçulmano é membro do Conselho Nacional de Segurança —a mais alta instância executiva nos Estados Unidos— . Foi o caso de Mehdi K. Alhassani de 2009 a 2012. Ignora-se quem lhe sucedeu, mas a Casa Branca também negava que um Irmão fosse membro do Conselho até esta prova ter surgido. Rashad Hussain, é também um Irmão que é o embaixador dos E.U. junto à Conferência Islâmica. Outros Irmãos identificados ocupam funções menos importantes. Deve-se citar, no entanto, Louay M. Safi, actual membro da Coligação Nacional Síria e antigo conselheiro do Pentágono.\\nO Presidente Obama e o seu meio-irmão Abon’go Malik Obama no Gabinete Oval. Abon’go Malik é o tesoureiro da Obra missionária dos Irmãos Muçulmanos no Sudão. Em Abril de 2009, dois meses antes de seu discurso no Cairo, o Presidente Obama tinha secretamente recebido uma delegação da Irmandade na Sala Oval. Ele já tinha convidado, aquando da sua tomada de posse, Ingrid Mattson, a presidente da Associação das Irmãs e Irmãos Muçulmanos nos Estados Unidos.\\nPor seu lado, a Fundação Clinton empregou como líder do seu projecto «Clima» Gehad el-Haddad, um dos dirigentes mundiais da Irmandade, o qual tinha sido até aí responsável de um programa de emissão de televisão corânica. O seu pai tinha sido um dos co-fundadores da Irmandade, em 1951, aquando da sua recriação pela CIA e pelo MI6. Gehad deixou a Fundação em 2012, data em que se tornou, no Cairo, o porta-voz do candidato Mohammed Morsi, depois oficialmente o dos Irmãos Muçulmanos a nível mundial.\\nSabendo que a totalidade dos líderes jiadistas do mundo têm origem quer na Irmandade quer na Ordem Sufi dos Naqshbandis –- as duas componentes da Liga Islâmica Mundial, a organização saudita anti-nacionalista árabe--- seria interessante saber mais sobre as relações da Sra. Clinton com a Arábia Saudita e os Irmãos.\\nAcontece que na equipa do seu adversário Donald Trump, conta-se o General Michael T. Flynn, o qual tentou opôr-se à criação do Califado pela Casa Branca e se demitiu da direção da Defense Intelligence Agency (Agência de Inteligência da Defesa-ndT) para marcar o seu protesto. Ele é acompanhado por Frank Gaffney, um «cold warrior» histórico (da guerra fria-ndT), agora qualificado como «conspiracionista» por ter denunciado a presença dos Irmãos no seio do Governo Federal.\\nEscusado será dizer que, do ponto de vista do FBI, todo o apoio às organizações jiadistas é um crime, independentemente da política da CIA. Em 1991, os polícias do FBI —e o Senador John Kerry— provocaram a falência do banco paquistanês (registado nas Ilhas Caimão) BCCI, que a CIA utilizava em todo o tipo de operações secretas com os Irmãos Muçulmanos, tal como com os cartéis latinoamericanos de drogas.\\nThierry Meyssan Tradução\\nAlva'"}, "time": 1742563619.345544}