{"duration": 0.07239770889282227, "input_args": {"text": "'Recent posts on social media by Gavin Long, the Marine veteran who fatally shot three law enforcement officers in Baton Rouge, La. on Sunday morning, show a man with a paranoid and political message, describing a world “run by devils,” imagining himself as their feared enemy and talking of a need for revolution. In this YouTube video posted from Dallas on July 10, just three days after five police officers there were murdered, Mr. Long says, “When an African fights back, it’s wrong, but every time a European fights back against his oppressor, he’s right. ” In the above video, Mr. Long is apparently wearing a body camera as he tries to give copies of one of his books to customers in a Dallas barbershop. He delivers a sermonlike speech from near the front door. “It’s real out here, man. I’m here for y’all,” Mr. Long tells the group of mostly black patrons. “Be great, have knowledge,” he says as he walks out the door. Mr. Long filed a form last year in Jackson County, Mo. to change his name to Cosmo Ausar Setepenra, a name freighted with ancient Egyptian references. Ausar, often rendered as Osiris, was the Egyptian god of the underworld. A group called the Ausar Auset Society, founded in the 1970s, describes itself on its website as being dedicated to reviving the ancient Egyptian religion among Africans and people of African descent. Setepenra, sometimes rendered as Setepenre, or    among other variations, meant “chosen by Ra,” the Egyptian sun god. The name has been used in modern times by some people affiliated with occult groups that use Egyptian symbols. In his application, Mr. Long also made many references to a small, obscure group called the United Washitaw de Dugdahmoundyah Mu’ur Nation, and attached a declaration from the organization. It is a group of   based in Louisiana, who say they are a sovereign Native American tribe  —   a claim that courts have repeatedly rejected. In a  podcast posted in late June on his website Convos With Cosmo, Mr. Long draws parallels between his own   and success, including his weight loss, to that of the rapper Gucci Mane, who was released from prison that week. Mr. Long’s opinion is that the rapper “came out a better person than when he went in,” despite external forces, including “the system,” that exert pressure on individuals to stay “trapped. ” “That’s why they gotta watch people like me,” he says. “I wake people up. ” Mr. Long posted frequently on the Twitter account ConvosWithCosmo, where he made his first post on Oct. 22. The feed was dominated by   style musings, paeans to entrepreneurship, the promotion of his books and his love of vegan food. Another theme is racial injustice. On April 5, he posted two tweets suggesting he had been racially profiled during a traffic stop in Los Angeles. In a video, a police officer tells him that he is being let off with a warning, but that it would be in his best interest “not to have an attitude with a police officer. ” “O. K. I’m a black man,” he replies. “And somebody pulling me over saying I didn’t stop beyond a line or something. That’s a reason to cop an attitude as a black man because you get harassed multiple times. ” His final tweet, early Sunday, foreshadowed his fate that day. Mr. Long was killed in a shootout with Baton Rouge officers that left three of them dead, and three others wounded. Police officials said on Monday that Mr. Long had “ambushed” them.'"}, "time": 1742564269.9920652}