{"duration": 0.11357951164245605, "input_args": {"text": "'Waking Times \\nMore evidence emerges that a culture war, or class war, is brewing between the 99% and the 1%, between the ‘Have-Mores’ and the ‘Have-Nots.’ Or, more truthfully between the middle and lower socio-economic classes who are forced to follow the law and pay taxes, and the elite who are allowed to be absolutely lawless and ruthless in their accumulation of wealth and privilege. \\nIn a speech in 2000 at the Al Smith Dinner for charity , the same event that recently hosted presidential candidates Trump and Clinton together, former President George W. Bush reminded us who the political elite works for in this nation, and in the world at large. \\n“This is an impressive crowd. The haves and the have mores. Some people call you the elite. I call you my base” ~George W. Bush \\nThis sort of trickle-down mentality of disdain for the middle classes has not since the days of monarchs been as visible as it is today in 2016. The 1% are doing the most insane things with the wealth that is being stolen from the rest of us by way of collusion between corrupt government and the want-all banking cabal, and sadly, this mentality is being bred into succeeding generations of the entitled. \\nIndigenous activists accompanied by sympathizers from all walks of life are being beaten, tazed, gassed, bitten, and shot at by a front line of private security, police, and national guard on the Standing Rock Indian Reservation in North Dakota. Their efforts to oppress the people who live on this land, who have for generations buried their ancestors here, are backed by a court system which is actively targeting sympathetic journalists who dare to expose this living tyranny. The politicians on high in Congress and the White House are committed to silence in support of the financial interests of the pipeline project . READ: This is the Man Militarized Police at Standing Rock are Working For \\nAs reported by Vincent Schilling of Indian Country Today , Halloween is being celebrated by the ‘Have Mores’ in North Dakota this year, and some apparently find it entertaining to mock the ‘Water is Life’ struggle of the Sioux people whose native treaty lands have been invaded in recent months by the oil cartel backed by militarized police. \\n“In the midst of the struggles faced by Native people on the frontlines of NoDAPL, some individuals have taken to social media, posting pictures of themselves in Native American “NoDAPL” Halloween costumes. In one photo, two girls wearing feathers and shirts with #NoDAPL are in a liquor store holding beers while another couple posed with makeshift costumes holding a bottle of wine, also holding #NoDAPL signs. In the post with the two girls, which appears to have been taken from Snapchat, one of the signs reads, “I Godda Job, I’m a Water Pertecter.” The caption on the screen captured image says, “Let’s start a riot!” The woman on the left of the photo has what appears to be chains on her ankle.” [ Source ] In another photo, a couple is seen in mock Indian garb, ready to get drunk on the high vibes of ignorance and disrespect. \\nThe photos are of North Dakota, and it’s worth mentioning the original route of the Dakota Access pipeline was slated to carry the oil just 10 miles north of Bismarck, N.D., however, residents in these areas were able to avert pipeline construction in this area, citing environmental concerns. \\n“An early proposal for the Dakota Access Pipeline called for the project to cross the Missouri River north of Bismarck, but one reason that route was rejected was its potential threat to Bismarck’s water supply, documents show.” \\nAs reported by MPR News on September 13th, 2016: \\n“The Dakota Access Pipeline was originally proposed to run about 10 miles north of Bismarck, N.D., crossing the Missouri River. This route was rejected in the Corps’ environmental assessment due to its close proximity to source water protection areas, multiple conservation easements and residential areas — the North Dakota Public Service Commission has a 500-foot residential buffer requirement.” \\nIn other words, residents of Bismarck were able to stop this pipeline from being built in their backyards, and some now find the same struggle by the Sioux people worthy of ridicule, further amplifying the cultural differences between groups of people who depend upon the same resources for survival. The Culture War is First and Foremost the Economic War \\nSuch disconnectedness and such disrespect for the struggle against corporate ownership of the land and water that sustains all life on human earth is a sad trend , but it’s important to understand that the brewing culture war has its roots in the financial tyranny that has gripped planet earth. We are all being raped by an emerging global corporate scheme of government that derives its power from manipulation of the money supply through a private banking system that is not accountable to any electorate, nor to the rule of law. \\nAs such, the inevitable outcome is a culture war, where those who value life and have respect for the natural world will be pitched in conflict with the entitled and belligerent 1% whose continued entitlement increasingly depends upon the protective shield of violence gained from the deployment of a radically militarized police state who serves not the people. Read more articles by Dylan Charles . About the Author \\nDylan Charles is a student and teacher of Shaolin Kung Fu, Tai Chi and Qi Gong, a practitioner of Yoga and Taoist arts, and an activist and idealist passionately engaged in the struggle for a more sustainable and just world for future generations. He is the editor of WakingTimes.com , the proprietor of OffgridOutpost.com , a grateful father and a man who seeks to enlighten others with the power of inspiring information and action. He may be contacted at . This article ( War Brewing as the ‘Have Mores’ Dress Up as DAPL Protectors for Halloween ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Dylan Charles and WakingTimes.com . It may be re-posted freely with proper attribution, author bio, and this copyright statement. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742564033.1406443}