{"duration": 1.6371924877166748, "input_args": {"text": "'Interview: Why did Quito cut Assange’s access to the Internet? 02.11.2016 \\nProfessor Doctor Mads Andenæs, a Norwegian lawyer and president of the UN Working Group on Arbitrary Detention, comments in the following interview with Edu Montesanti, for Pravdareport, on the Ecuadorian government\\'s decision to cut off Julian Assange\\'s Internet access. \\nAssange was granted political asylum in the Ecuadorian Embassy in London in 2012 to avoid extradition to Sweden or the United States; the Australian journalist has access to the Internet denied since October 17, less than 24 hours after releasing John Podesta e-mails, the Chairman of the Hillary Clinton presidential campaign. \\nThrough official statement, the Ministry of Foreign Affairs of the South American country said it \"respects the principle of non-intervention in the affairs of other countries\", which led Quito to temporarily cut off Assange\\'s access to the Internet. Print version Font Size \\nAt the same time, the Ecuadorian government stressed its commitment to protect \"victims of political persecution\" like Assange, and intended to \"safeguard his life and physical integrity.\" Denying having suffered any external pressure for cutting the Internet, in line with the speech of US Department of State, the Ecuadorian Foreign Minister assured: \"We reaffirm that the protection of the Ecuadorian State will continue as the circumstances that led to the granting of such asylum remain.\" \\nWikiLeaks states that several US sources say that there has been pressure exerted by Washington on Rafael Correa’s government to restrict Assange\\'s access to the Internet. \\nEdu Montesanti: How do you evaluate the decision of the Ecuadorian government to deny Julian Assange\\'s access to the Internet? President Rafael Correa claims that his country will not interfere in foreign elections: such a measure is really democratic? \\nMads Andenæs: That has surprised me. President Correa is one of my heroes, and I cannot understand well this latest measure. I understand that this latest measure is alarming to Assange. And it should be for all of us. \\nEdu Montesanti: WikiLeaks tweeted after the incident: \"Multiple US sources tell us John Kerry asked Ecuador to stop Assange from publishing Clinton docs during FARC peace negotiations,\" while the United States Department of State denied the accusation, and President Correa said he acted on his own, and does not give in to foreign pressures. In your opinion, Professor Mads, Washington really pressured Quito, as says Assange? \\nMads Andenæs: There has been pressure, no doubt. What you cite here sounds credible, but again I only know what I have read in the papers. \\nEdu Montesanti: Do you think the government of Ecuador will restrict journalistic work of WikiLeaks, in general? \\nMads Andenæs: I hope not. \\nEdu Montesanti: Do you think Assange\\'s asylum is running a risk? \\nMads Andenæs: No I really hope not. But it is worrying that so much pressure is brought to bear on the Ecuadorians. I am increasingly worried that Assange is not safe anywhere, in asylum or not. He has very good reasons to resist extradition. Remember that two UK Supreme Court justices dissented in the judgment about the extradition to Sweden, and the reporting judge and one of the Supreme Court justices in Sweden held the request illegal because it was disproportionate. \\nProfessor Andrew Ashworth, Oxford, advised that the Swedish request did not allege facts that constituted a criminal offence under English law. Professor Liora Lazarus, Oxford has held that Assange\\'s detention is in vioaltion of international law, the chair of the English Bar Association Human Rights Committee, Kirsty Brimelow QC and the general counsel at Human Rights Watch Dinah PoKempner have all supported the ruling by the UN Working Group on Arbitrary Detention. The UK and Sweden should now just comply with international law as applied by the UN. \\nEdu Montesanti: Do you fear that if the Ecuadorian opposition, pro-US, wins the 2017 presidential election, Assange will be extradited to America? \\nMads Andenæs: I really hope that they will not win, and if they do, that they will not renege on the asylum. Fear - yes strong reasons for much fear in this case. \\nEdu Montesanti'"}, "time": 1742562578.8051498}