{"duration": 0.15997695922851562, "input_args": {"text": "'Amy Schumer is set to return to the big screen this weekend for the first time since 2015’s Trainwreck with the   kidnap caper Snatched, alongside veteran actress Goldie Hawn, but negative early reviews from critics could threaten to spoil crucial    and dampen the film’s Mother’s Day weekend   prospects. [Snatched doesn’t hit theaters until Friday, May 12, but already reviewers from the New York Times, the Hollywood Reporter and IndieWire have derided the film as “lazy,” “uninspired” and “wildly scattershot. ”  The film stars Schumer as Emily Middleton, who is dumped by her boyfriend just before a planned exotic vacation to Ecuador. While Middleton persuades her mother (Goldie Hawn, in her first film appearance in 15 years) to join her on the trip, the two get more than they bargained for as they try to survive after being kidnapped in the jungle. In his review of the film, the New York Times‘ A. O. Scott calls the film “lazy, sloppy and witless,” and says Hawn in particular is “cruelly and inexplicably” denied the ability to be as funny as she can be. “Snatched is one of those movies that subscribes to a dubious homeopathic theory of cultural insensitivity by which the acknowledgment of offensiveness is supposed to prevent anyone from taking offense,” Scott wrote. “The idea is that if you use variations on the phrase ‘That’s racist!’ as a punch line a few times, nothing else you say or do could possibly be racist. Including, say, populating your movie with   thugs with funny accents and killing a few of them for cheap laughs. ” But perhaps the most harsh criticism of the film comes from IndieWire’s Kate Erbland, who calls it “criminally unfunny. ” Like Scott, Erbland says Snatched commits the “unforgivable sin” of not allowing Hawn to “inhabit her stature as a great comedic performer. ” “One character calls [Schumer’s character] ‘garbage’ (and makes her repeat the insult) while another tells her she’ll be safe from sex trafficking because she’s just not pretty enough, but even these attempts to add some meat to the undercooked film fall flat,” Erbland wrote, giving the film a D grade. “Pairing up talented comedians like Hawn and Schumer with a wacky plotline to match should spell comedy gold, but Snatched is about as cheap and disposable as a tourist trap tchotchke. ” The Village Voice‘s Melissa Anderson was similarly down on the film, accusing it of trading in “offhand xenophobia” and “soft racism” for its depiction of two white main characters unable to cope in a foreign country. “[Hawn’s]   performance here, however understandable, suggests she may have regretted the decision to end her ” Anderson wrote. Meanwhile, Variety‘s Owen Glieberman and the Hollywood Reporter‘s Jon Frosch gave the movie slightly better marks, though Glieberman wrote that the film’s “  jokes are like firecrackers with damp fuses. ” “Still, in the apocalyptically bleak landscape of the mainstream studio comedy, the mere sight of Schumer and Hawn just doing their thing is almost pleasing enough to get a pass. Almost,” writes THR‘s Frosch. Snatched   Wanda Sykes, Joan Cusack, Ike Barinholtz, Randall Park, Tom Bateman, and Christopher Meloni. Jonathan Levine (The Wackness) directed off of a script by writer Katie Dippold (The Heat, Ghostbusters). The film hits theaters May 12.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562521.5420196}