{"duration": 0.04744458198547363, "input_args": {"text": "'Emmanuelle Riva, whose performance in the antiwar film “Hiroshima Mon Amour” in 1959 placed her at the center of the French New Wave  —   and who, more than 50 years later, became the oldest person nominated for an Academy Award for best lead actor or actress, as a woman debilitated by strokes in “Amour”  —   died on Friday in Paris. She was 89. The cause was cancer, her agent, Anne Alvares Correa, said. “Hiroshima Mon Amour,” directed by Alain Resnais and written by Marguerite Duras, was one of the first internationally acclaimed films to emerge from the French New Wave, a movement that rejected classic cinematic storytelling with youthful irreverence. In the United States it was an   hit. “With his first feature film,” Andrew Sarris wrote in The Village Voice, “Resnais has made the most important contribution to realizable film aesthetics since ‘Citizen Kane. ’” The movie opens with Ms. Riva, playing an actress who has come to Hiroshima to make a film promoting peace, and her   Eiji Okada, as an architect, in a lovers’ embrace. Their faces are unseen and their limbs are covered in what appears to be ash, as if from a nuclear blast, that is then washed away. They speak in  . Ms. Riva says she has seen evidence of the bomb’s effects in a hospital and a museum. But Mr. Okada rebukes her, over and over: “You saw nothing in Hiroshima. Nothing. ” She reveals tortured memories of an affair she had during World War II in her native Nevers, France, with a German soldier. Her living and dead lovers become linked  —   as do the horrors of Nevers and Hiroshima. Looking back at it nearly a   later, the critic Michael Koresky said that Ms. Riva’s performance was “responsible for much of the emotional heft” of the film and that “the range of feelings that run across Riva’s face is perhaps the most unforgettable element. ” Ms. Riva sensed at the time that “Hiroshima Mon Amour” might turn out to be the creative peak of a film career that had just begun. “I think I was particularly blessed because I put my trust in Alain Resnais,” she told an interviewer at the Cannes Film Festival in 1959, when the film was shown there. But, she added: “I feel like I might be a disappointment after this, because Resnais pushed me to excel. He made me reach certain heights. ” Paulette Germaine Riva was born on Feb. 24, 1927, in Chenimenil, in northeastern France, and grew up in nearby Remiremont. Her father, René Alfred Riva, was a sign writer her mother, the former Jeanne Fernande Nourdin, was a seamstress. An only child, she never married and had no children. Ms. Riva had wanted to act since she was a child, she later said, but felt that her ambition was circumscribed by her family’s modest life in a rural village. She began performing in regional theater, but also trained as a seamstress before she entered acting school in Paris in her  . “If I had failed, I’d be dead,” she told the French newspaper Libération. “I did not have a second to lose. ” Her first role on the Paris stage was in Shaw’s “Arms and the Man” in 1954. Five years later, Mr. Resnais cast her as the nameless actress in “Hiroshima Mon Amour. ” In the decades that followed, Ms. Riva toggled from movies to stage work to television series. She distinguished herself in movies like “Léon Morin, Priest” (1961) but she never had another role as sensational as the one she played in “Hiroshima Mon Amour. ” “I refused as many offers as I accepted,” she told The New York Times in 2013. “I refused commercial roles. But it was wrong, I have been too extreme, and I don’t say it was good. ” Then the Austrian director Michael Haneke  —   who told The Times in 2012 that as a young man he had been “captivated” by Ms. Riva’s performance in “Hiroshima Mon Amour”  —   asked her to audition for “Amour. ” “Clearly he wanted to see me again after all these years,” she told The Guardian in 2013. “I was in his head, perhaps. ” In “Amour,” Ms. Riva played Anne, a retired music teacher who is failing mentally and physically. Her husband, Georges, played by   Trintignant, devotedly cares for her. Writing in The Times, Manohla Dargis called them “two titans of French cinema. ”  In an interview with the entertainment news website TheWrap. com, she said that Mr. Haneke had only one direction for her as she worked with Mr. Trintignant. “We were doing a scene,” she recalled, “and he said, ‘It’s very nice  —   very sweet, very tender  —   but it’s too tender. No sentimentality. From here on in, no sentimentality.’ This was the key that opened the horizon of the film. Once I heard that, it became much more clear. ” “Amour” won the Academy Award for best   film. Ms. Riva did not win the Oscar for best actress  —   she lost to Jennifer Lawrence for “Silver Linings Playbook”  —   but she won the César, the French version of the Oscar, and a Bafta film award, from the British Academy of Film and Television Arts, for the role. After the release of “Amour,” she said in an interview with The Times, she received a letter from a friend who wondered how she had aged “so tragically in front of our eyes. ” She explained:  “Anne is another person, it isn’t me. It is a journey into someone else, someone I’m not. ”'"}, "time": 1742628524.5062454}