{"duration": 0.04409670829772949, "input_args": {"text": "'California’s State Senate passed SB 54 on Monday, rocketing the state one step closer to becoming an official “sanctuary state. ”[Senate President Pro Tem Kevin de León’s sanctuary bill passed on a straight   vote,   according to the Sacramento Bee. Strong pushback from law enforcement led to several amendments before the bill passed.  The bill was first introduced as an “urgency” measure, as De León argued the Trump administration presented a threat to those in the country illegally. The Senate President later pulled the “urgency” status to lower the standard for passage, but at the cost of delaying the bill’s implementation to January 1, 2018. President Donald Trump has put sanctuary cities on notice that they could lose federal funding if they chose to continue to defy federal immigration authorities. In February the President called California a sanctuary state that is “out of control. ” De León declared that “half” of his family were in the United States illegally, and lashed back at Trump during an interview on KPCC 89. 3. In the interview he admitted “the vast majority of immigrants” have used fraudulent Social Security numbers. “SB 54 shields child abusers, human traffickers, and elder abusers from deportation and guarantees their return to our communities, and that’s why our fight must continue,” said State Senator Joel Anderson ( ) in an email to supporters after voting against the bill. “Over 31, 000 Californians signed our petition and helped force the author to amend SB 54 so that murderers, rapists and child molesters would not be shielded from federal immigration authorities, but as long as felons are protected, we cannot stop fighting. ” Anderson called the bill “the greatest threat to dreamers,” according to the Bee. Maryland has also been working on passing a sanctuary state law. The made national headlines in recent days on allegations that two illegal alien students had raped a young teenage girl in a school bathroom. Last week, Attorney General. Jeff Sessions warned that sanctuary jurisdictions could lose their portion of $4. 1 billion in grants from the Department of Justice if they fail to comply with federal immigration law. He said that more than 200 jurisdictions had refused to honor ICE detainer requests in just one week. “The charges and convictions against these aliens include: drug trafficking, hit and run, rape, sex offenses against a child and even murder,” said Sessions. SB 54 now moves on to the State Assembly, where it is expected to pass and be signed into law by Gov. Jerry Brown. Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742563568.1267364}