{"duration": 0.043502092361450195, "input_args": {"text": "'  Edmondo Burr in Weird // 0 Comments NASA’s space cameras have accidentally filmed another unidentified flying object ( UFO ) travelling out of earth’s atmosphere. \\nThe question is why did the space agency not turn off the live feed or try to cover up, as it usually does with UFOs and aliens? \\nA disk-shaped UFO appears in the video giving support to the theory that extraterrestrial beings and their crafts are continuously visiting earth. \\nAncient Code reports: \\nEver since the footage was uploaded to YouTube, it generated great controversy both among those who support the idea that it might be an extraterrestrial object, as among those who are completely skeptical of the subject, and as a joke suggest that “UFO’s that are planning on entering our air space should be registered and pay taxes.” \\nThe truth is that on many occasions only fragments of videos in which these mystery objects are visible are released. \\nHowever, the fact that NASA interrupts its live feed transmissions is what arouses more suspicion among those who are eager to find new evidence of the existence of alien life, UFO’s and how we are all part of a massive conspiracy. \\nOne user wrote on YouTube: \\n“The question isn’t “ is this an alien spacecraft? ”, but actually “Why NASA didn’t cut or blur this video as they always do with other strange sights?” \\nAccording to many people, in today’s era, it isn’t a question anymore whether or not UFO’s are real. \\nIn fact, if we look back into the past we will see numerous fascinating statements made by former astronauts, military officials and scientists about Alien life and the existence of UFOs. \\nHere are only a few: \\n“Intelligent beings from other star systems have been and are visiting our planet Earth. They are variously referred to as Visitors, Others, Star People, Et’s, etc…They are visiting Earth now; this is not a matter of conjecture or wistful thinking.” – Theodor C. Loder III, Ph.D., Professor Emeritus of Earth Sciences, University of New Hampshire. \\nWe cannot address the UFO phenomena without mentioning Dr. Edgar Mitchel, one of the best-known Apollo astronauts and the sixth man to walk on the moon; a retired Captain in the US Navy, aeronautical engineer and founder of the Institute of Noetic Sciences (IONS) who had much to say about Alien life: “I happen to be privileged enough to be in on the fact that we have been visited on this planet, and the UFO phenomenon is real…Yes, there have been crashed craft, and bodies recovered. We are not alone in the universe; they have been coming here for a long time.” \\nFranklin Story Musgrave, an American Physician, retired NASA astronaut who worked on the design and development of the Skylab Program and the only astronaut to have flown missions on all five Space Shuttles had very interesting things to say about life elsewhere in the cosmos: “Statistically it’s a certainty there are hugely advanced civilizations, intelligence, life forms out there. I believe they’re so advanced that they’re even doing interstellar travel. I believe it’s possible that they even came here. It’s logical to presume the universe must have other life in it and by virtue of association that we could be visited at some point.”'"}, "time": 1742628549.1530652}