{"duration": 0.06254005432128906, "input_args": {"text": "'NEW ORLEANS, Louisiana  —   The monument to General Robert E. Lee was removed from its pedestal in Lee Circle at the heart of the city of New Orleans. Mayor Mitch Landrieu used the event to claim victory for political correctness. [The famous Civil   monument of Robert E. Lee has been at the center of the city’s most famous traffic circle for more than a century. The statue was put on the chopping block my Landrieu after he began a crusade against four monuments he deemed “symbols of white supremacy. ”  Other monuments removed by the Landrieu Administration include the Battle at Liberty Place, Jefferson Davis, and the P. G. T. Beauregard Monuments, Breitbart Texas reported. All the monuments were removed at some expense to taxpayers, as New Orleans Police Department (NOPD) and New Orleans Fire Department (NOFD) officials were present at each of the removal processes. The money to physically remove the monuments, though, came from a private donor which Landrieu has refused to disclose to the public. In an address to the city, Landrieu derided critics of his now infamous monument removal crusade, saying Davis, Beauregard and Lee were not patriots. “These monuments that we took down were meant to rebrand the history of our city and the ideals of the Confederacy” Landrieu said. “It is   that these men did not fight for the United States of America. They fought against it. They may have been warriors, but in this cause, they were not patriots. ” “These monuments celebrate a fictional, sanitized Confederacy,” Landrieu said. “Ignoring the death, ignoring the enslavement, ignoring the terror that it actually stood for. ” Landrieu hinted at what the monuments, specifically the Beauregard and Lee Circle statues, would be replaced with. “It immediately begs the question: Why are there no   monuments,” Landrieu said. “No public markers on public land to remember the lynchings or the slave blocs? Nothing to remember this long chapter of our lives of pain, of sacrifice, of shame, all of it happening on the soil of New Orleans. ” Landrieu has been widely criticized for his calling for the removal of the historical monuments, with historians asking him to add context to the monuments, rather than removing them altogether. The grassroots activist group Save Our Circle formed solely in opposition to Landrieu’s actions in regards to the monuments. They say that the monuments represent the city’s history. Take ‘Em Down Nola and STAND With Dignity, two     organizations lobbied Landrieu to go further than just the four monuments. Now, they are calling for the removal of more than a dozen monuments and street names, including: Most recently, Landrieu made a broad accusation about the impact of the four Civil   monuments on the city of New Orleans. While speaking to local media, Landrieu said the monuments caused a “great migration out of the city,” as Breitbart Texas reported. “But I will say this for people that are interested in the cost,” Landrieu said. “The cultural and economic and the spiritual loss to this city for having those statues up that have run people out of the city,” Landrieu claimed. “The great migration that sent some of our best and brightest to places across the country that we don’t have the benefit of has been incredible. ” Historians have refuted this claim in 2015, when Landrieu first demanded the monuments come down. They argued that the city serves tourists and locals as a public history museum, unlike any other city in the U. S.'"}, "time": 1742561984.0658326}