{"duration": 0.16735291481018066, "input_args": {"text": "'Alynda Segarra knows what it’s like to live between cultures. As a lonely teenager in the Bronx, she would regularly escape downtown, soaking up Latin poetry slams at the Nuyorican Poets Cafe and hanging out with crusty punks in Tompkins Square Park. “I always remember punk kids saying to me, ‘You’re not Puerto Rican, you’re white,’” Ms. Segarra said. “And the Puerto Rican kids would say: ‘Who dresses like you? Who are you really? ’” The question stung because Ms. Segarra herself didn’t know the answer. “I hadn’t internalized my heritage,” she said. “I was still finding most of my heroes in white men, feeling like they’re the ones who make history. I believed what was shoved down my throat. ” The art she made reflected that view. Even deep into her 20s, as Ms. Segarra rose as a critically admired   on three albums released under the band name Hurray for the Riff Raff, she kept her lineage at bay. Instead, her music explored the blues and folk roots of Americana. Only last year, as she approached her 30th birthday, did Ms. Segarra confront her internalized cultural exile with the intent to reconcile the disparate strands of her identity. The results can be heard on her ambitious new work with the band due on Friday, “The Navigator,” a    concept album that traces the wanderings of a character named Navita Milagros Negrón. Ms. Segarra fashioned the story as an imaginary Off Broadway play “starring” the musicians, “directed by” its producer and featuring a faux Playbill to guide listeners through. The music uses her contradictions to her advantage, mixing rock guitars with bomba rhythms, while melding original lyrics with some verse from the Puerto Rican poet Pedro Pietri. The songs connect the dots in a long history of Latin influences in popular music, from the   harmonies of   to Brill Building hits like “Save the Last Dance for Me,” to the   of Mink DeVille. On a recent winter afternoon, Ms. Segarra returned to the Nuyorican Poets Cafe to discuss her early alienation, framing it, in part, as a product of assimilation. When she was growing up, her mother, Ninfa Segarra, had a thriving career as an educator and a politician, rising to become the deputy mayor of New York under Rudolph W. Giuliani. Her father was a vice principal and a music teacher in the Bronx, where he taught the singer and actor Marc Anthony as a youth. The couple split when Ms. Segarra was a child, and she was reared mainly by her   aunt and uncle in Marble Hill. Ms. Segarra’s father introduced her to the clave rhythms of   music, yet she gravitated more toward the videos of Dean Martin and Frank Sinatra beloved by her aunt and uncle. Puberty ignited in her a rebellious side, which found reflection in punk bands like the Dead Kennedys and Bikini Kill. “I started to feel very angry about my place in the world as a girl,” Ms. Segarra said. “I wanted to go wherever I wanted without fear of danger, to be treated the same as my brother. ” In high school, she formed an acoustic punk group with other young women, modeled on the music of the   singer Kimya Dawson. She also began to spend more time in the East Village, identifying with women who shaved their heads but not their armpits. Failing in school and feeling like a drain on her family, Ms. Segarra ran away from home to squat on the Lower East Side. “I was really scared  —   and really hungry,” she said. “But I was determined to live the life of an artist that everyone said was impossible. ” Aching for experience and escape, Ms. Segarra took to the road, hopping trains until she finally ended up settling in New Orleans by her 18th birthday. There, she found street kids she connected with more deeply. Together, they began performing songs by Woody Guthrie, whose wanderings Ms. Segarra’s own had echoed. She lived by busking, getting good enough at her craft to make home recordings that earned some buzz, starting with “It Don’t Mean I Don’t Love You” (2008). In 2014, Ms. Segarra was signed to ATO Records for “Small Town Heroes,” which proved a critical breakthrough. Yet she felt unsatisfied in her work. To focus, she moved to Nashville, where she didn’t know anyone. “I began to ask myself, ‘Who am I when everyone I know is gone? ’” she said. The answer manifested itself in “The Navigator. ” Ms. Segarra felt   to simply mimic Latin rhythms for the album. “‘Ziggy Stardust’ was a eureka moment,” she said, referring to the intergalactic David Bowie album and alter ego. “I learned I could create a character, the Navigator, who would stand at the intersection of all these identities and weave in and out. And I related to being the alien. I began to take that as a badge of honor. ” For musical role models, Ms. Segarra looked to earlier Latin artists heavily influenced by rock, like the Ghetto Brothers, a politically active Puerto Rican street gang turned band that recorded one album in 1971. She also looked to Rodriguez, whom she discovered from the documentary “Searching for Sugarman. ” The album’s lyrics conform to rock rather than to theatrical music, favoring poetic abstractions over clear narrative. Themes of gentrification and cultural appropriation center the work, all boldly delivered by Ms. Segarra’s billowing vibrato. Along the way, she gives a nod to the Young Lords, the Puerto Rican activist group of the ’60s and ’70s. In turn, Ms. Segarra finally took full ownership of her heritage. “Before, when I heard Latin sounds in popular music, I thought: That music belongs to everyone. Now I think: Oh, that’s the sound of where I came from. Look what we brought to the culture. Listen to what we added. ”'"}, "time": 1742562045.7580526}