{"duration": 0.08315658569335938, "input_args": {"text": "'We Are Change \\nOn Sunday evening, side-by-side images of Hillary Clinton’s campaign chairman John Podesta and his brother Tony next to police sketches of potential suspects in a 2007 kidnapping of a three-year-old girl took over the internet.\\nThe resemblance is striking, and Reddit, 4chan, and Twitter rapidly took up the case. \\nWe found your pedophile suspects @metpoliceuk . You\\'re welcome. #DNCLeak2 pic.twitter.com/H8kF1jWGUN \\n— Jared Wyand ?? (@JaredWyand) November 7, 2016 \\n\\nMadeleine Beth McCann should have celebrated her 13th birthday with her family in England this year, but she vanished from her bed during a family vacation to Portugal in 2003. The case gripped the entire world, becoming one of the most high profile missing persons cases in history. Coverage of her kidnapping was comparable to the press interest in the death of Princess Diana. \\nHer parents had been out with friends at the hotel restaurant approximately 200 feet from where the child had been sleeping. When her mother Kate McCann went to check on her around 11 pm, but she was gone. \\n“We go to bed every night with the agonising feeling that just maybe tomorrow we will find something to lead us back to Madeleine. To let us know what happened. To give us hope,” Kate McCann, who is now an ambassador for Missing People, said at the launch of a new nonprofit organization called Find Every Child, in London this week . \\nThough it has been nearly a decade since their little girl vanished, the family has continued the search, and believe that there is a possibility that she may still be alive. \\n“When my little girl first disappeared, on that horrendous night that changed our lives forever, I could never have imagined that nearly 10 years later we would still be in the same position,” she continued. \\nIn 2013, five years after Portuguese police had closed the case, they reopened it and revealed two new police sketches. It was believed that they were supposed to be of the same man, but from two different witnesses. Reddit and others on social media are now asking, what if it was actually two different men, and what if it was the Podestas? \\nAwkward! Sketches from 2007 Madeleine McCann case look just like Clinton associates. Victim of #SpiritCooking ? #Podestabros #DNCLeak2 pic.twitter.com/by7AHqESzD \\n— Jazu the Deplorable (@Jazukai) November 7, 2016 \\n\\nAn email found in the Wikileaks release of John Podesta’s emails at the time of McCann’s disappearance implies that he may have been vacationing around the time of her disappearance, but does not indicate where.\\nShortly after the rumor began to go viral, Twitter went offline for over 20 minutes, which helped to fuel the theorists even more.\\nThat moment when you Realize they are DDOS\\'ing @WIkiLeaks @Twitter and @4Chan to cover up a Horrific Crime. RIP Madeleine McCann. pic.twitter.com/4EqSAcOpWA \\n— Kyle (@refutal) November 7, 2016 \\n\\nBizarrely worded messages in the Podesta emails had lead to conspiracy theories on 4chan and Reddit that John Podesta was involved in some sort of child sex ring , last week.\\n\"I\\'m dreaming about your hotdog stand in Hawaii…\"\\nThis is code for something.\\nSex trafficking? https://t.co/BNulNKBi4u pic.twitter.com/L3l5j40ahy \\n— Mike Cernovich ?? (@Cernovich) November 3, 2016 \\n\\nThe same evening, the world became familiar with the term “ Spirit Cooking .”\\nThe Podestas\\' \"Spirit Cooking\" dinner?\\nIt\\'s not what you think.\\nIt\\'s blood, sperm and breastmilk.\\nBut mostly blood. https://t.co/gGPWFS3B2H pic.twitter.com/I43KiiraDh \\n— WikiLeaks (@wikileaks) November 4, 2016 \\n\\nWhile it is extremely far-fetched that the Podestas would be involved in this extremely high-profile missing persons case, the fact that thousands of people are having serious discussions about it on a Sunday evening speaks volumes about the trust people have in Hillary Clinton’s inner circle.\\n \\nThe post Internet Sleuths Are Convinced That The Podestas Are The Kidnappers in These Police Sketches appeared first on We Are Change .\\n'"}, "time": 1742564439.399918}