{"duration": 0.09349513053894043, "input_args": {"text": "'Yesterday, we put out an alarm in a post titled, CalPERS Plans to Violate California Constitution, Pave Way for Hiring Under-Qualified Candidate, for Critically Important Job of Chief Actuary . \\nAt 12:20 PM, which is 9:20 AM Sacramento time, I received this e-mail from Brad Pacheco, CalPERS’ head of media relations. I didn’t see it until later in the day because I work nights and then go through my e-mail box in reverse chronological order: \\nYves, \\nI saw your post about our Chief Actuary position. I wanted to let you know that we are no longer pursuing the change to the position and the item is being pulled from the Nov. 3 meeting. The intent of the change was to help us cast the net wide in our search. We feel good about the candidate pool that we have so we are forgoing the change. \\nPlease let me know if you have any questions, Brad \\nThis is certainly very good news, and thanks to you readers who contacted potentially journalists as we requested. \\nFor those of you wondering about the timing, meaning as to whether CalPERS had requested the removal of its proposed revisions to the Chief Actuary Specification Classification from the agenda of the November 3 meeting of the State Personnel Board before our post ran, that seems unlikely. \\nFirst, under California law, notices for public meetings, including the agendas and any materials that are part of any deliberative process, are to be published ten days before the session. Admittedly, the State Personnel Board could have released its agenda earlier, but my observation of California agencies is that the usual practice is to stick with the minimum notice period (I’ve upon occasion seen CalPERS be a day late). The item had also been on the agenda of the October 6 State Personnel Board meeting and was pushed back to November. Inside sources tell me that the actuaries at CalPERS met before the original October meeting, upset at the fact that the new specifications might even allow a non-actuary to be appointed as Chief Actuary. So given the degree of upset in the department in question, it would have behooved CalPERS to withdraw the revisions sooner rather than later if that had been the intent before yesterday. \\nSecond, the interviews for Chief Actuary started in Sacramento at 9:30 AM Pacific time yesterday….a mere ten minutes after Pacheco e-mailed me. Given that CalPERS was using an outside search firm, Heidrick & Struggles, to find candidates, and the search process has a certain degree of formality about it, the idea that CalPERS suddenly found a raft of better candidates and changed its mind this late in the game for that reason seems unlikely. \\nFortunately, CalPERS corrected this mistake rather than expose itself to more media criticism. With the investing environment as difficult as it is, and with public pension funds under even fiercer attack than before, high profile players like CalPERS need to as pure as Caesar’s wife . Hopefully the organization will act accordingly. 0 0 0 0 0 0'"}, "time": 1742563065.444575}