{"duration": 0.06598162651062012, "input_args": {"text": "'In the middle of Marilyn Oshman’s otherwise cozy apartment on the Lower East Side of Manhattan, between an antique candelabra,   curtains and framed family photos, was a hospital bed. “I was dying,” Mrs. Oshman, 85, said. “I felt like I was in a prison in that lousy hospital bed. I couldn’t get out. ” She was bedridden and unable to walk because of venous stasis and cellulitis, a painful bacterial infection that covered the lower half of her body with large,   sores. Ordinary tasks, like getting out of bed every morning, became impossible. It was a drastic setback for someone who loved to move around on her own. As a child born and raised on Monroe Street on the Lower East Side, she loved exploring the city by foot. When she was 20, she had a job at a toy factory on Broadway, and it was there that she met her husband, David Oshman. They divorced in the late 1980s after 35 years of marriage, but Mrs. Oshman recounted fond memories of their active, early years together: Dancing the jitterbug on Fridays and Sundays at a club on the Lower East Side (“And he was some jitterbug dancer!” she said) fishing for pogies off a Coney Island pier and when they had children, a son and a daughter, taking family vacations to the mountains. Most of all, though, she said she loved doing the simpler things around the house: washing the walls, scrubbing the floors and cooking her favorite Jewish delicacies, stuffed cabbage and pot roast. But her health took a bad turn around 50 and deteriorated over the last three decades. For the last two years, Mrs. Oshman has made many trips between Mount Sinai Beth Israel hospital at 16th Street and First Avenue, and Gouverneur Health on the Lower East Side, and then back to her apartment. “Two years of hell,” she said. “And I mean hell. ” The back and forth became so strenuous that her doctor helped Mrs. Oshman get a hospital bed  —   not the centerpiece she would have preferred  —   so that she could receive medical care in her apartment. She was home, but she was miserable she could not lie comfortably in the new bed and often resorted to sleeping upright in a wheelchair. The ordeal became a dangerous cycle: She struggled to stand on her own, meaning she spent more time bedridden and immobile, which intensified the swelling, redness and pain. “I don’t want money, I don’t want jewelry,” Mrs. Oshman said, glancing at her still swollen legs, wrapped in compression socks. She added, through tears: “The only thing I want, at this stage in my life, is to be able to walk again. ” Over the summer, Mrs. Oshman’s doctor recommended a special recliner that could help her stand up, but Mrs. Oshman could not afford it. Every month she receives $1, 251 in Social Security benefits and $180 in food stamps, which is not enough to cover her monthly grocery bills. She pays $406 a month to Medicaid for the home care services, and $350 monthly toward her apartment. She was 62 when she retired from Citibank, where she was a greeter and an assistant to bankers, after she got too sick to continue working. Mrs. Oshman left with no retirement savings and does not receive financial support from her children. She has been getting help from the Educational Alliance, an organization that offers a social service program for people over 60. The Educational Alliance is a beneficiary agency of   of New York, one of the eight organizations supported by The New York Times Neediest Cases Fund. When the Alliance learned of Mrs. Oshman’s need for the recliner, the group used $799 from the Neediest funds to buy it. It arrived in August. “This chair saved my life, and I’m not kidding when I tell you that,” Mrs. Oshman said. “I was suffering with the hospital bed, and because of this chair, I’m able to walk again. It’s a blessing. I’m doing more for myself than I ever did. I’m changing myself. ” She has had to relearn tasks once taken for granted: standing up on her own, dressing herself and getting into the kitchen. “I’m living since I got this chair,” she said, tilting it up and down. It even has a massage function and heated seats. “What should we name it?” she asked, referring to the chair draped in a bright purple sheet and   blanket. Mrs. Oshman has been able to get out of the apartment more in recent months than she ever did during the last few years. She is again walking the streets of the Lower East Side, where she grew up. “I was a familiar face around the neighborhood then, and until this day, I still am,” she said. “I was away from here for two years, and when the aide took me downstairs one day recently, people stopped me in the street saying, ‘What happened to you? Where were you?’ And all I said was, ‘I’m back. ’”'"}, "time": 1742564057.5523884}