{"duration": 0.14733290672302246, "input_args": {"text": "'Larry Colburn, who became an    American hero when he intervened with two comrades to halt the massacre of unarmed Vietnamese civilians by United States soldiers in 1968, elevating an innocuous hamlet named My Lai into a watchword for the horrors of war, died on Tuesday at his home in Canton, Ga. He was 67. The cause was liver cancer, his wife, Lisa, said. Mr. Colburn was the last surviving member of a   helicopter crew that was assigned to hover over My Lai on Saturday morning, March 16, 1968, to identify enemy positions by drawing Vietcong fire. Instead, the men encountered an eerie quiet and a macabre landscape of dead, wounded and weaponless women and children as a platoon of American soldiers, ostensibly hunting elusive Vietcong guerrillas, marauded among defenseless noncombatants. The crew dropped smoke flares to mark the wounded, “thinking the men on the ground would come assist them,” Mr. Colburn told Vietnam Magazine in 2011. “When we would come back to those we marked,” he said, “we’d find they were now dead. ” Audaciously and on his own initiative, the pilot, Chief Warrant Officer Hugh Thompson Jr. swooped down and landed the copter. “Mr. Thompson was just beside himself,” Mr. Colburn recalled in an interview in 2010 for the PBS program “The American Experience. ” “He got on the radio and just said, ‘This isn’t right, these are civilians, there’s people killing civilians down here.’ And that’s when he decided to intervene. He said, ‘We’ve got to do something about this, are you with me?’ And we said, ‘Yes.’ ” Mr. Thompson confronted the officer in command of the rampaging platoon, Lt. William L. Calley, but was rebuffed. He then positioned the helicopter between the troops and the surviving villagers and faced off against another lieutenant. Mr. Thompson ordered Mr. Colburn to fire his   machine gun at any soldiers who tried to inflict further harm. “Y’all cover me!” Mr. Thompson was quoted as saying. “If these bastards open up on me or these people, you open up on them. Promise me!” “You got it boss,” Mr. Colburn replied. “Consider it done. ” Mr. Thompson, Mr. Colburn and Glenn Andreotta, the copter’s crew chief, found about 10 villagers cowering in a makeshift bomb shelter and coaxed them out, then had them flown to safety by two Huey gunships. They found an    boy clinging to his mother’s corpse in an irrigation ditch and plucked him by the back of his shirt and delivered him to a nun in a nearby hospital. Crucially, they reported what they had witnessed to headquarters, which ordered a  . By then, as many as 500 villagers had been killed. Would Mr. Colburn have fired at his fellow Americans? “How could I ever be prepared for something like that?” he replied years later. “Would I have? I guess that’s the $64, 000 question, isn’t it?” Seymour M. Hersh, the independent journalist who later uncovered the My Lai massacre, said of Mr. Colburn in a phone interview on Friday that “for a door gunner in Vietnam to point his machine gun at an American officer” under those circumstances “was in the greatest tradition of American integrity. ” Lawrence Manley Colburn was born on July 6, 1949, in Coulee Dam, Wash. His father, Harry, a World War II veteran, was a civil engineer who had helped build the Grand Coulee Dam. His mother, the former Catherine Manley, was a homemaker. His father died when Larry was 15. An altar boy, he attended Roman Catholic elementary and junior high schools and a public high school, where, after an altercation with an assistant principal, he was suspended for two weeks. Rather than return to school, he joined the Army. Because he was 17, he needed his mother’s permission. He earned his high school equivalency diploma in the Army before being shipped to Vietnam in December 1967. The full extent of the gang rapes, massacre and mutilations by Charlie Company in My Lai and another hamlet, on the South Central Coast, was not exposed until two months after Mr. Colburn was discharged. A Pulitzer   report by Mr. Hersh for The Dispatch News Service in November 1969 provoked international outrage and eventually resulted in charges against more than a dozen officers. Only one, however, was convicted: Lieutenant Calley, for the murder of 22 civilians. He was sentenced to life imprisonment but ended up serving only three and a half years under house arrest at Fort Benning, Ga. Mr. Colburn entered Green River College in Auburn, Wash. on the G. I. Bill but struggled academically and financially and quit before graduating to become a commercial fisherman in Alaska. He later moved to Oregon, where he met Lisa Cale, a student at Eastern Oregon State College. They married in 1985 and moved to Atlanta, where he sold orthopedic rehabilitation equipment. She survives him, along with their son, Connor, and his sisters, Sheila Beal, Mary Jones and Colleen Capestany. My Lai became a paradigm for unbridled brutality and an object lesson in battlefield ethics, but the crewmen whose audacious intervention prevented even more bloodshed were largely forgotten. Their heroism was acknowledged with Bronze Stars, which they considered inappropriate recognition: The Bronze Star is awarded for bravery under enemy assault, they reasoned, and they had demonstrated courage in the face of friendly fire. After the investigations and trial, Mr. Thompson and Mr. Colburn received something else, too: hate mail. “One of the most infuriating things is being called a   as if we went and ratted someone out,” Mr. Colburn told Vietnam Magazine. “That is completely false there was no   going on. We were right in their face at My Lai. We were ready to confront those people then and there. And we did, the best we could. ” In the late 1980s, after seeing Mr. Thompson interviewed on a television documentary, David Egan, a professor at Clemson University in South Carolina, began a crusade to recognize, belatedly, the crew’s actions. Trent Angers, the author of “The Forgotten Hero of My Lai: The Hugh Thompson Story” (1999) told The Associated Press that Mr. Colburn had “stood up, shoulder to shoulder with Hugh and Glenn, to oppose and stand down against those who were committing crimes against humanity. ” “Without his assistance,” he added, “Hugh might not have done what he did. ” In 1998, 30 years after the massacre, Mr. Thompson and Mr. Colburn were awarded the Soldier’s Medal, which is granted for lifesaving bravery not involving direct contact with an enemy. “It is my solemn wish that we all never forget the tragedy and brutality of war,” Mr. Colburn said at the ceremony, held at the Vietnam Veterans Memorial in Washington. “I would like to quote Gen. Douglas MacArthur: ‘The soldier, be he friend or foe, is charged with the protection of the weak and the unarmed.’ ” Mr. Thompson and Mr. Colburn walked the short distance to the memorial, where they made a rubbing of the inscribed name of Mr. Andreotta, who was killed in Vietnam three weeks after the massacre. He was awarded the Soldier’s Medal posthumously. The two men returned to My Lai that year, meeting some of the villagers they had rescued and dedicating an elementary school. On the flight home, Mr. Colburn recalled, he turned to Mr. Thompson and said, “It was so good to see all those little kids smiling again, not having to worry about being blown up, not having to be looking over their shoulders all the time, just being able to be kids. ” Mr. Thompson died of cancer in 2006 at 62. Two years later, on the 40th anniversary of the massacre, Mr. Colburn returned to Vietnam and was reunited with Do Ba, who as a boy had been rescued by Mr. Colburn from an irrigation ditch.'"}, "time": 1742563145.0269423}