{"duration": 0.10847139358520508, "input_args": {"text": "'The New York City Campaign Finance Board on Wednesday issued a blunt critique of a nonprofit closely linked to Mayor Bill de Blasio that has used unlimited donations to advance his political agenda, denouncing the group’s behavior while clearing it and the mayor of any campaign finance violations. The decision briefly soothed one irritant for Mr. de Blasio, a Democrat, whose administration is facing several different investigations at once, including federal and local inquiries into the nonprofit’s   activities. Yet the board appeared to find much that was troublesome, if not illegal, in the behavior of the group, the Campaign for One New York, which has amassed millions of dollars in donations to push for City Hall initiatives, including universal prekindergarten and an affordable housing policy. In a statement at a public meeting, the board said that the nonprofit’s   “plainly raises serious policy and perception issues,” exposing the limitations of the city’s current campaign finance laws, which strictly curb or ban contributions to political candidates to “reduce the appearance that influence can be bought or sold. ” Calling on the City Council to pass legislation to tighten limits on contributions to nonprofits that are tied to specific politicians, the board added that “it defies common sense that limits that work so well during the campaign should be set aside once the candidate has assumed elected office. ” The heavy skepticism that saturated the board’s report reflected the dismay of government watchdogs, who have characterized the Campaign for One New York’s license to operate outside of campaign finance limits as a major intrusion of money into politics  —   an expansion of “   culture,” as Dick Dadey, the executive director of Citizens Union, put it on Wednesday. More than 95 percent of the funds raised by the Campaign for One New York, which shut down in March amid increasing scrutiny of its finances, would have been banned under the city’s normal campaign finance laws for political candidates, the board found. Most of the gifts far outstripped the $4, 950 cap on individual donations to candidates, including a $350, 000 donation from the American Federation of Teachers and $500, 000 in two contributions from 1199 S. E. I. U. United Healthcare Workers East. These were just three among at least a dozen   contributions. Other gifts came from companies or people who did business with the city, including a $100, 000 contribution from Two Trees Management Company, a real estate developer that had negotiated with the de Blasio administration over redeveloping the Domino Sugar Factory site in Brooklyn. Mr. de Blasio, who has raised money for the Campaign for One New York, has argued that the activities of the nonprofits tied to him are aboveboard because they voluntarily disclose all of their contributions, despite not being required to do so. “It’s not dark money if it’s disclosed,” he said in February. But the board said the nonprofit’s disclosures fell short of being “comprehensive” and fully accessible to the public. On Wednesday, a spokesman for the mayor, Eric Phillips, said that Mr. de Blasio had been a “lifelong advocate” of campaign finance reform, though he did not touch on the specifics of the legislation the Campaign Finance Board and watchdogs have suggested. “He looks forward to continuing the work to help get big money out of politics and to make sure everyone is playing by the same rules,” Mr. Phillips said. The board’s actions were far more muted than its words. Responding to a February complaint from Common Cause New York, a watchdog group, the board determined that because the nonprofit’s activities on behalf of the mayor had focused on his policy goals and took place more than three years before the election, there was not enough information to conclude that the organization had coordinated with the 2017 campaign. The board also clarified rules governing nonprofit advocacy groups that are affiliated with politicians. If such groups coordinate with a politician’s campaign to promote the politician in the   to an election, anything they spend will be treated as a donation to the candidate and subject to normal campaign finance limits. Run by former advisers to the mayor’s 2013 campaign, the Campaign for One New York functioned as a policy advocacy group, not a shadow   committee. But it checked a few of the other boxes the board outlined on Wednesday: Mr. de Blasio has helped raise funds for the group, and most  of its spending has been on political consultants who routinely advise him. A spokesman for the Campaign for One New York, Dan Levitan  —   who doubles as one of those consultants  —   said the group was “pleased” with the decision. “The Campaign for One New York was formed to advocate for New York City’s progressive policy agenda,” Mr. Levitan said in a statement. “It never engaged in any election campaign activity for any candidate and shut down more than a year and a half before next year’s election. ” But government watchdogs said the mayor and the nonprofit won a narrow victory on narrow grounds. “I’m looking at the philosophy underlying the campaign finance law, not whether this dollar or that dollar was spent for campaign purposes,” said Susan Lerner, the executive director of Common Cause New York. “Don’t give the appearance that you’re selling out. It doesn’t sit right. ”'"}, "time": 1742561851.9171495}