{"duration": 0.14346599578857422, "input_args": {"text": "'Lost Children of the Anunnaki CONFIRMED: Melanesian Tribe’s DNA Carries Genes from Unknown Species Published on October 31, 2016 in Forbidden History by UFOholic Scientists recently discovered that islanders from Melanesia posses genes belonging to an unknown hominid species. Will this prove our Anunnaki ancestry? \\nOn October 20, the American Society of Human Genetics held its annual meeting and the conclusions they reached can be easily described as staggering. The data they gathered shows that people from Melanesia (an area in the South Pacific that encloses Papua New Guinea and its neighboring islands) may be packing some strange genes in their DNA. The geneticists believe the unrecognized DNA belongs to a previously undiscovered species of humanoids. \\nAccording to Ryan Bohlender, one of the researchers involved in the study, that species is not Neanderthal or Denisovan, but something completely different. “We’re missing a population or we’re misunderstanding something about the relationships,” he stated. Like this \\nThe Denisovans represent an extinct species belonging to the hominid genus. They were named after the Denisova Cave in the Siberian Altai Mountains, where the first bone fragment belonging to this species was found. Very little is known about this enigmatic cousin of ours. \\nHuman history is a lot more complicated than we thought it was,” Bohlender said. \\nOh, yes, it is. But piece by piece, humanity’s convoluted past is brought to light. And discoveries such as this one seem to point in one direction: we might not be who we think we are. Here is a quote from the study that I think you’re going to appreciate: \\n“With assumptions about population size and more recent population separation dates taken from the literature, we estimate the archaic-modern separation date at ~440,000 ± 300 years ago for all modern human populations.” \\nIf that number doesn’t ring any bells, allow me to reiterate the Anunnaki hypothesis. \\nAccording to the genesis story, the twelfth planet, known as Nibiru was populated by humanoid beings very similar to us humans. After they encountered a severe atmosphere problem, they went on a quest through the solar system in order to find gold, a special metal that could heal their planet. \\nWhen Nibiru approached Earth’s orbit, about 432,000 years BC, the Nibiruans used space ships to send people and essential goods from their planet to Earth. After they reached the surface, the advanced beings established bases in ancient Mesopotamia. \\nMany believe this is the true station of mankind’s creation – inside the Anunnaki geneticists’ laboratories. And this recent study confirms this hypothesis almost to the day. It offers insight that might answer one of our oldest and most significant question: Who are we? \\nIn order to obtain the irrefutable solution to this age-old enigma we either have to dig deep where no-one has dug before. But this is harder said than done. Another way to do this would be to analyze the microscopic records that are hidden away inside each and every one of us. The Anunnaki knew that their DNA was the key to engineering the ideal nine-to-fiver. In our never-ending search for our true lineage, we as humans must do the same. \\nIn a recent endeavor, another group of scientists reached a similar conclusion. Led by evolutionary geneticist Eske Willerslev of the Natural History Museum in Denmark, the scientists examined DNA samples taken from 83 aboriginal Australians. They also tested 25 participants belonging to populations native to the highlands of Papua New Guinea. To their surprise, the researchers discovered exotic, Denisovan-like DNA in the genomes of the study volunteers. Please note, the researchers only called it Denisovan-like but in reality, the group that lent its genes to the ancestors of the participants is completely unknown. “Who this group is we don’t know,” Willerslev said. Neither do we, but one particular crowd comes to mind. \\nIt shouldn’t come as a surprise that such discoveries are always made when studying the genome of remote populations. Over time, these isolated groups had little contact with the outside world. They lived and procreated within closed communities and this is reflected in their genome. The richer and more diverse your ancestry is, the less likely it is for particular genes to remain unchanged. In the case of aboriginal Australians and Melanesians, the isolation meant fewer genes were altered over the course of their existence. \\nIt’s not hard to picture this alternative version of our past. The Anunnaki come to Earth, play god and engineer mankind. The chief scientist Enqi and the medical chief Ninti use genetic manipulation and in-vitro fertilization in order to create humans in their own image.They use mankind to serve their purposes and when it suits them, they dispense destruction in the form of a deluge of biblical(!) proportions. A few chosen humans are protected by a faction of the Anunnaki that decided to go against protocol. They survive and spread in all corners of the globe. Thousands of generations pass, and the genomes of those who ‘socialized’ the most become mingled beyond recognition. \\nBut in a few places, the flame of the creators still burns. '"}, "time": 1742563370.2067125}