{"duration": 0.04350018501281738, "input_args": {"text": "'The much ballyhooed “Breitbart of the left” planned by Clinton apologist David Brock lost its CEO before the site even launched, as investigative reporter David Sirota announced he is bowing out of the project. [After the disastrous 2016 election revealed that his Hilary Clinton cheerleading efforts were woefully ineffective, David Brock went back to liberal donors with his hand out  —   asking for even more cash to start a new website that he promised would become the left’s “answer to Breitbart News. ”  Not long after his initial announcement, Brock proudly reported that he had hired investigative reporter David Sirota as the CEO of the new effort named True Blue Media. Sirota was said to be preparing to quit his role as senior investigations editor at the International Business Times to lead Brock’s new Breitbart of the left. But now it appears those plans have fallen apart. This week Sirota sent out an email to supporters and friends to “pass on some personal news” explaining that “circumstances of the job changed” and he is now taking a pass on the role as chief of the left’s answer to Breitbart. “As you know, I was thrilled to initially accept the proposal to work with True Blue Media because I believe in nonpartisan accountability journalism,” Sirota said in his statement. “However, the circumstances of the job subsequently changed. True Blue Media does not right now have in hand the resources for the kind of independent, nonpartisan journalism I want to continue to do and that is needed to execute on the ambitious editorial strategy that we agreed on. Therefore, I have decided to turn down the job. I wish David Brock all the best. ” Sirota did not elaborate on exactly what had changed between the time he initially agreed to head up Brock’s news website and today’s decision to bail out of the project. But the statement hints to the possibility that Brock is not getting the funding he would need for the sort of fully staffed news organization Sirota had envisioned. Perhaps Sirota doesn’t want to be part of a mere propaganda effort and expected the resources to be able to sustain a serious news bureau. The news comes on the heels of reports that many top liberal donors are getting tired of David Brock’s many failed efforts to “help” the liberal cause. Early in January, for instance Clinton donor John Morgan complained, “Anybody who gives money to him is pissing down a rathole. ” Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742628307.0664418}