{"duration": 0.06341266632080078, "input_args": {"text": "'Actress Meryl Streep became the toast of the Golden Globes Sunday night after using her Cecil B. DeMille Lifetime Achievement Award acceptance speech to bash   Donald Trump and defend Hollywood, which she said has become one of the most “vilified” segments of American society. [“Hollywood is crawling with outsiders and foreigners,” Streep said, listing several actors who were born in Canada and other places outside the United States. “And if we kick them all out, you’ll have nothing to watch but football and Mixed Martial Arts, which are not the arts. ”  At tonight’s #GoldenGlobes we honor Hollywood legend Meryl Streep with the prestigious Cecil B. Demille Award. pic. twitter.   —   Golden Globe Awards (@goldenglobes) January 9, 2017,  The    actress  —   who did not mention Trump by name during her speech  —   also criticized the   for what she called his “instinct to humiliate. ” “Disrespect invites disrespect. Violence incites violence,” she said. While the Golden Globes audience loved her speech, Streep’s comments drew a strong negative reaction on social media and from some commentators, with many claiming that the actress’s comments served yet again to illustrate the disconnect between rich Hollywood actors and the rest of the country. But Streep’s Golden Globes speech wasn’t the first time the actress has weighed in on politics and current events. Below are five more examples of the actress’s political wisdom. 1. Trump supporters attending political rallies are “driven to the worst possibilities by the bloodlust in a crowd. ” In August, Streep told Variety that she was shocked to hear that Clint Eastwood was supporting Trump in the presidential election. “I’ll have to correct that! I’m shocked. I really am. Because he’s more  —   I would have thought he would be more sensitive than that,” she told the outlet. Streep also weighed in on the phenomenon of people behaving differently in large groups than they would individually, connecting it to supposed violence occurring at Trump’s political rallies. “The aggregate of everybody’s emotion, it’s such a powerful thing. You can see it in the Trump rallies, where people I just know, in their living rooms, would be better people, are driven to the worst possibilities by the bloodlust in a crowd,” she said. “It just gets ginned up and they’re outside of themselves. They’re behaving as a larger unit, not just themselves. ” 2. Streep puts on a wig, makeup and fat suit to mock Trump during a play, In June, when most observers still believed Trump had no chance to win the election, Streep dressed up as Trump to mock him while performing at a Shakespeare in the Park Theater Gala event in Central Park. “You’ll let me know, why all the women say no,” the actress sang while performing Cole Porter’s “Brush Up Your Shakespeare” from the Broadway show Kiss Me, Kate. More of Meryl and Christine Baranski doing Trump and HRC pic. twitter.   —   Jacob Bernstein (@BernsteinJacob) June 7, 2016,  Streep’s Mamma Mia!   Christine Baranski joined the fun by dressing as Hillary Clinton. 3. Streep compares Hillary Clinton’s “grit and grace” to that of Continental Army soldier Deborah Sampson, who was wounded fighting while disguised as a man during the Revolutionary War. “What does it take to be the first female anything? It takes grit, and it takes grace,” Streep said while speaking during the Democratic National Convention in Philadelphia in July. The actress compared Clinton’s perseverance in the face of adversity to Sampson, who was shot while illegally serving in George Washington’s Continental Army. “When she took a blast in battle, to her leg, she was afraid to reveal her secret, so she took out a   dug out the   and sewed herself back up again,” Streep explained. “That’s grit. ” “And grace? Hillary Clinton has taken some fire over 40 years of her fight for families and children. How does she do it? That’s what I want to know. Where does she get her grit, and her grace? Where do any of our female firsts, our   where do they find that strength?” 4. The Alar Scare, In 1989, Streep played a major role in the   “Alar scare. ” The Natural Resources Defense Council became concerned that fruits  —   specifically apples  —   containing pesticides including Alar, or daminozide, were causing adverse health effects. A segment on CBS’ 60 Minutes that featured a skull and crossbones over a photo of apples only exacerbated the public’s fear. In June of 1989, Streep testified before Congress on the dangers of Alar. According to the Washington Post, the actress told  . Joseph Lieberman that she was qualified to speak about Alar because she had been “involved” with the issue for four months. The Post reported that Streep told Congress: “I think the reason we have all been invited here, as I look around the room and I see so many experts, is we have been invited for what we do not know, which probably will fill the room. But actually, I do not mind representing the constituency of the great mass of uninformed, because I think what we do not know about this issue is the most alarming, and that is coming up over and over in what I have been hearing. What we don’t know is a frightening chasm. ” In the end, the Alar scare crippled the apple business, costing growers an estimated $100 million. “There was never any legitimate scientific study to justify the Alar scare,” food science professor Dr. Joseph D. Rosen later told the New York Times. 5. Streep uses discredited propaganda to claim Walt Disney was a racist, sexist   During a speech at the National Board of Review awards in January 2014, Streep accused Disney founder Walt Disney of having had “racist proclivities,” said he formed and belonged to an “  lobbying group” and called him a “gender bigot. ” But Disney historians lashed out at Streep for relying on “ ” accusations entirely without merit. “Every statement she made about Disney was either grossly distorted or outright false,” Cartoon Brew’s Amid Amidi wrote at the time. While social conventions during Disney’s lifetime were undoubtedly more harsh on women and minorities, Disney reportedly employed numerous women during the 1930s, when it was not an accepted industry practice to do so. “If a woman can do the work as well, she is worth as much as a man,” Disney reportedly told artists working on Dumbo in 1941. “The girl artists have the right to expect the same chances for advancement as men, and I honestly believe they may eventually contribute something to this business that men never would or could. ” As for the   charge, Jewish author Douglas Brode, who wrote a book about Disney culture, told the Hollywood Reporter in 2014: “There is zero hard evidence that Disney ever wrote or said anything   in private or public. His films feature a wide array of great Jewish actors in the most diverse roles imaginable, more so than any other studio of Hollywood’s golden age, including those run by Jewish movie moguls. Finally, there is no evidence in the work of   via negatively portrayed Jewish characters. ” *Hypocrisy Bonus: Streep gives standing ovation to convicted child rapist Roman Polanski at the 2003 Oscars, For all the talk about morality, Streep and several of her Hollywood associates wildly cheered in 2003 when Roman Polanski  —   who was convicted of having sex with a    girl in 1977 and fled the country before sentencing  —   won the Best Director Oscar for The Pianist in 2003.    Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742628532.7813225}