{"duration": 0.13095998764038086, "input_args": {"text": "'BLACKPOOL, England  —   “Ramones forever!” C. J. Ramone yelled to a tightly packed crowd at the Rebellion Festival here earlier this month, and a little roar rippled through a sea of   mohawks,   spikes  —   and more than a few balding heads. It was 40 years ago this summer that the Ramones flew to London and played a July 4 concert at the Roundhouse in Camden, an event that many cite as the moment that punk rock first took flight in Britain. A month earlier, a   London group called the Sex Pistols had played a gig at Lesser Free Trade Hall in Manchester. It has been said that there were only a few dozen people in attendance, but every one went out and started a band. “I’ve said this quote before, but I’ll say it again,” Steve Diggle of the Buzzcocks said in a recent interview over a pint of Guinness in London. “If Jesus was born in Bethlehem, British punk was born in Manchester at that gig. ” The anniversary of that summer is being celebrated in Punk London, a citywide, yearlong series of exhibitions, talks and concerts supported by the mayor’s office and the National Lottery. Proving, perhaps, that punk’s rebellious spirit hasn’t yet receded into rock’s history books, this institutional endorsement of an   movement has drawn skepticism, a little bit of ridicule and even some mild acts of resistance. “We heard our song on BBC News,” as part of the anniversary celebrations, Noel Martin, 61, of the band Menace, which formed in the   said outside the Blackpool festival grounds. The song, “G. L. C. ,” which stood for Greater London Council, took aim at the city government, whose conservative members had called for a ban on punk concerts. “BBC banned that song 40 years ago, how come they’re playing it now?” In March, Joe Corré, the son of the fashion designer Vivienne Westwood and the Sex Pistols manager, Malcolm McLaren, vowed to burn 5 million pounds, or about $6. 46 million, worth of punk memorabilia to protest what he saw as the   of the movement. (The event, which is planned for this fall, was promptly added by a City Hall staff member to the Punk London website). In July, the singer Viv Albertine of the band the Slits visited the British Library for a talk connected to Punk London. While there, she stopped by the institution’s punk history exhibition to scrawl over the names of prominent female punk artists in permanent marker onto to the show’s signage. “What about the women! !” she wrote on a sign, crossing out the names of male punk groups and replacing them with   acts like Siouxsie and the Banshees and   Spex. The concerts of the summer of ’76 proved a crucible: In the months that followed, punk broke into public consciousness across Britain. The Clash, the Buzzcocks and the Damned gained nationwide attention. And the Sex Pistols became tabloid sensations, both for their wild behavior and their   lyrics, particularly for “God Save the Queen,” an   screed that suggested the queen was the head of a “fascist regime. ” The reaction from the news media was swift: Sex Pistols tracks, including “Queen” and “Anarchy in the U. K.,” were banned from the BBC, and, after reports that band members had spit on and yelled at staff at Heathrow Airport, the Pistols were dropped from their record label, EMI. The Sex Pistols dissolved in spectacular fashion months later, but the Ramones soldiered on for another 20 years (C. J. Ramone joined the band in the late ’80s). Fans and musicians at the Rebellion Festival in Blackpool, a resort town on the Irish Sea, noted the incongruity of the establishment’s embracing of punk rock, but they said the British punk scene was vibrant and even growing. “We go to gigs every week here, Manchester, Birmingham,” Graham Norris, 51, a fan of punk, said over a hot dog on the first day of the festival. “There’s lots of good bands coming through, a lot of them,” said Mr. Norris, who carried a cane and had a single synthetic green dreadlock threaded onto his last wisp of natural hair. “Maybe their dads were punks, maybe their mothers were punks and they’ve picked up on it. ” This festival’s lineup reflected that intergenerational spirit: Early bands like Agnostic Front and the Buzzcocks split the bill with newer acts like Youth Man and Angry Itch. Outside the main venue, a group of young punk fans gathered on a stoop, smoking and swigging from liquor bottles. One young musician, Connor MacPherson, 18, whose band the Antiseptics played at Punk Weekender, a   concert series held at the Roundhouse in July to commemorate the anniversary of the Ramones concert, said that the punk spirit was particularly relevant now that conservatives control Britain’s government. Describing himself as a “socialist with anarchist tendencies,” Mr. MacPherson got a rousing response from the others when he lobbed a shot at David Cameron, the former prime minister. “We have got a government that doesn’t care about the youth, that doesn’t care about the   people,” he said. “We need punk more than ever  —   we need punk more than they needed it in 1977. ” Nella Bellinzoni, 62, was selling bags and   sweaters in the halls of the festival. With blue hair sprayed vertical and reaching about a foot above her head (she said it took her around one and a half cans of hair spray and three hours to achieve the look) Ms. Bellinzoni, who described herself as an “old punk, from the beginning,” expressed a sunny vision of punk’s future. “It’s getting more and more stronger,” Ms. Bellinzoni, a native of Italy who lives near Blackpool, said. “All the kids, when their father or mother was punk, then they’re punk as well. ” One   duo was Simon Reynolds, 50, who took a train from London to Blackpool and his    son, Oscar. Mr. Reynolds, who started listening to punk in the early ’80s, said he thought that the movement had cleaned up its act somewhat since the early years and grown a “conscience. ” Oscar, with spiky green hair and a   advertising the punk band Gnarwolves, said he became interested in punk about eight years ago, through skateboarding and through his father. He said that he appreciated the sympathy for the working classes, and also that he liked that the music was different from what his friends listened to. Asked whether he ever felt strange dabbling in the same music scene as his father, he looked briefly incredulous. “No, no,” he said with a chuckle, before his face got serious and he added, “My dad’s rad. ”'"}, "time": 1742561702.880293}