{"duration": 0.08945035934448242, "input_args": {"text": "\"Email It’s not just the FBI that has been forced to reveal that they’ve made new and worrisome discoveries about Hillary Clinton’s email scandal . \\nThe Department of the Defense apparently sent Congress a letter on Tuesday detailing their discovery of at least 1,000 new, previously unknown Clinton emails between she and General David Petraeus. House Oversight Orders DoD Sec. Ashton Carter Hand Over Clinton E-Mails to Pertraeus. #DC https://t.co/E19GbZ8SX6 pic.twitter.com/aghRlCMbqI \\n— Bruce Porter, Jr. (@NetworksManager) October 29, 2016 LOOKs like it declassified this morning now Ashton Carter n mix wonder how many going down 4 #HillarysEmail #DoD #DC https://t.co/vzQlohNZ4r \\n— Bruce Porter, Jr. (@NetworksManager) October 29, 2016 Mon House likely knew more #HillarysEmail Tues House order DoD give Clinton-Petraeus emails \\n— Bruce Porter, Jr. (@NetworksManager) October 29, 2016 \\nThese 1,000 new emails are likely to be quite important, considering that the General was the Commander of CENTCOM and then the Director of the CIA. While we may not know what appeared in these emails, the probability that these are simple boilerplate political issues is low. The most likely reason for Clinton and Petraeus to be communicating would be to discuss classified security issues. \\nEven more troublesome (for Clinton and for our national security) is what the FBI seems to have discovered on devices acquired from Anthony Weiner (and Huma Abedin). \\nThe FBI seems to have discovered “ tens of thousands” of emails on a laptop belonging to Abedin, and in those emails they’ve discovered a worrisome amount of obviously classified material . \\nWhat is more troubling is the amount of redaction involved in these emails which migrated to the open email account, which as we now know ended up in Anthony Weiner’s computer: in the above example, the two pages of timetables and deliverables attached to the email were 100 percent redacted, with “PAGE DENIED” stamped across the first redacted page. \\nAn argument can be made that the extensive redaction confirms confidential material was part of the transmission… \\n… According to the NYT , the number of Huma emails that made their way to Weiner’s PC was staggering: \\nThe F.B.I. is investigating illicit text messages that Mr. Weiner, a former Democratic congressman from New York, sent to a 15-year-old girl in North Carolina. The bureau told Congress on Friday that it had uncovered new emails related to the Clinton case — one federal official said they numbered in the tens of thousand \\nWhile this could (and should) damage Hillary Clinton’s presidential hopes, the latest revelations could mean even stiffer punishment for Abedin in the not-too-distant future. Remember, Abedin swore under oath that had given up each and every device that contained State Department emails, and that she had held nothing back from investigators. This latest discovery proves that story to be a complete lie. \\nThis should serve as a reminder to everyone that Hillary Clinton isn’t the only person involved in this morass that deserves to serve time in prison. There is a small circle of Clinton confidantes that all owe the American people a few years in a federal prison, including Huma Abedin . \\nArticle posted with permission from Constitution.com Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here . shares\""}, "time": 1742561748.0529525}