{"duration": 0.08215689659118652, "input_args": {"text": "'BREAKING: Wall Street Journal Reveals Shock Business Details About Podesta and Russia Oct 28, 2016 Previous post \\nDemocrat presidential candidate Hillary Clinton’s campaign chairman John Podesta has been linked to an investment firm owned by the Russian government. Moreover, it has been shown that he tried to hide this connection from the U.S. government. \\nFive years ago, the U.S.-based solar energy startup Joule Unlimited elected Podesta to its board of directors in the hopes that he would help it foster the sorts of international relationships needed for long-term success, according to The Wall Street Journal . \\nLo and behold, Podesta did exactly that. Within months of his election to the board, the Russian firm Rusnano announced plans to invest about $35 million in the solar company. Several months later, Joule invited Rusnano’s chairman Anatoly Chubais to join its board of directors. \\nNote that around this time, Podesta joined then-Secretary of State Hillary Clinton’s Foreign Affairs Policy Board, seemingly unconcerned about the potential conflicts of interest at play. This attitude changed in 2014, when he signed up to serve as a counselor to President Barack Obama. \\nHacked emails published by WikiLeaks last week showed that in 2014, Podesta asked that his shares in Joule be transferred to a newly created entity called Leonidio Holdings, LLC. \\nSpeaking with reporters on Wednesday, a Clinton campaign representative confirmed this finding, but claimed that the entity was owned by Podesta’s children — and that his purpose in transferring his holdings to them was to recuse “himself from all matters pertaining to Joule for the duration of his time at the White House.” \\nHere’s the problem: The emails published by WikiLeaks also revealed that Podesta paid the bill for Leonidio’s incorporation in Delaware — and that he also took care of expenses for some legal work performed for Joule in 2005 by a law firm \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742563756.0538464}