{"duration": 0.09202313423156738, "input_args": {"text": "'We Are Change \\nRussia has been increasing it’s weapons capabilities recently, adding a newly improved “ Super Satan Nuke ” to it’s arsenal and running test run drills with it. Now Russian President Vladimir Putin has proclaimed to American voters if they choose “Trump it’s peace, if they choose Clinton it’s war.”\\n\\nThis comes as no surprise and it’s something that many of us feared deep down, but knew that it was likely true. Now Putin has said it out his own mouth. It seems that things are heating up in Ukraine and Syria. With Russian battle ships moving towards Syria and tensions building up along Ukraine’s boarder with NATO, it seems like world war could break out any day. As We Are Change’s Luke Rudkowski recently pointed out, Russia isn’t playing games anymore.\\nWith failure after failure of peace talks and cease fires things are getting dangerous and Russia is running out of options. To have Putin come out and say something so straight forward should scare all Americans — this is serious.\\nEspecially since NATO wants to continue trying to push for war with Russia and the U.S. is a member of NATO. Putin has also vowed retaliation over the U.S. missile system that was setup in Syria.\\n\\n“If Americans vote for Trump, they’re voting for peace! ”If they vote for Clinton, its war.” – Vladimir Putin. \\nIt’s no wonder that Putin would make such a strong statement when Hillary Clinton has been for years bashing him. It’s additionally been revealed thanks to Wikileaks that Hillary Clinton would enforce a “no fly zone” in Syria . An instant declaration of war in Russia’s eyes. Washington has had troubled relations with Moscow starting from 2012 with Syria and in 2014, when the Ukraine coup was orchestrated by the U.S. — as a leaked Victoria Nuland phone call shows. Victoria Nuland answered to Hillary Clinton who was Secretary of State at the time of these discussions, and her leaked call is below.\\nA pre-Maidan video of former Ukraine Deputy Oleg Tsarov warning of a civil war coup before it broke out in Ukraine also makes this point. Maiden was the event where snipers shot at both sides of the opposition rebels and police. Polish MP Janusz Korwin-Mikke alleges that what occurred in Ukraine was a special op to provoke a riot.\\nThen we had the MH17 incident that has been blamed on Russia and Russian separatist despite the Ukrainian government being allowed to fabricate evidence. \\nAdditionally a leaked phone conversation from the EU foreign affairs chief Catherine Ashton and Estonian foreign affairs minister alleges that the snipers were paid for by Maidan leaders .\\nSoros is also linked to the Ukraine uprising and he is someone that Vladimir Putin despises, so it’s again no surprise that Vladmir Putin would say “If Americans vote for Hillary it’s war,” since Hillary is George Soros’s puppet after all.\\n“Many of the participants in Kiev’s ‘EuroMaidan’ demonstrations were members of Soros-funded NGOs and/or were trained by the same NGOs in the many workshops and conferences sponsored by Soros’ International Renaissance Foundation (IRF), and his various Open Society institutes and foundations. The IRF, founded and funded by Soros, boasts that it has given ‘more than any other donor organization’ to ‘democratic transformation’ of Ukraine,” – William F. Jasper reports.\\nDoes the U.S. really want war with Russia? No the U.S. as a whole doesn’t want war, no one likes war but oligarchs and the military industrial complex that profits off of it’s citizens blood.\\nThat’s where Donald Trump sets himself apart, at least according to his campaign promises that he would work with Russia .\\nPutin recently expressed support for Trump, saying that “Russia’s not playing favorites but Trump does speak for the people.” Putin added, that “Elections have stopped being an instrument of change, and have been reduced to scandals, to mudslinging, to questions of who pinched whom and who is sleeping with whom,” during a WSJ interview. \\nIf Hillary gets in the Oval Office she will continue her war mongering ways – after Libya and Ukraine, Syria is next as General Wesley Clark warned in his 2007 speech . Hillary is taking marching orders from the CFR which she admits herself . If the fix is in for Hillary like we detailed previously will Hillary Clinton be the president that starts World War III with Russia?\\n \\n \\n \\n \\n \\nThe post Putin: “If Americans Vote For Trump It’s Peace, Clinton It’s War” appeared first on We Are Change .\\n'"}, "time": 1742564224.3033466}