{"duration": 0.08352541923522949, "input_args": {"text": "'Home / Badge Abuse / Cop Arrested for Using Police Status to Rape Little Boys at Home for Abused Children Cop Arrested for Using Police Status to Rape Little Boys at Home for Abused Children Matt Agorist November 3, 2016 2 Comments \\nSanta Rosa County, FL — Florida Department of Law Enforcement (FDLE) Agent Charles Calvin McMullen was arrested this week after two 8-year-old boys came forward with allegations that the cop repeatedly sodomized and sexually abused them. \\nAccording to police, the boys disclosed their information separately and did not know the other was coming forward. #BREAKING : #FDLE agent, Charles C. McMullen arrested, charged with sexual assault/battery on a victim younger than 12 y/o. #C3N #NWFL \\n— WEAR ABC 3 (@weartv) November 2, 2016 \\nMcMullen, who has been with the FDLE for five years, worked on cases with the Gulf Coast Kids House and the Santa Rosa Kids House, centers that advocate for abused children. \\nMcMullen’s position in law enforcement allowed him easy and trusted access to the children and he was able to repeatedly rape the young boys from the time they were only 7-years-old. \\nThe first boy came forward on October 28 to deputies with the Santa Rosa County Sheriff’s Office (SRCSO). After the 8-year-old reported McMullen had been touching him “downstairs on his private part” on a frequent basis, an investigation was launched which led to the other boy coming forward. \\nAccording to a report from WEAR, \\nThe child said the abuse began when both children were 7-years-old. He said McMuMullen made them perform sex acts like sticking their fingers in his buttocks, putting their mouth on his penis. \\nThe victim also said McMullen put his penis in the other child’s buttocks at least four times, the last time being October 27. He also disclosed that McMullen made him touch the other victim’s penis. \\nThe first child’s interview detailing McMullen’s abuse mirrored the second child’s. He said some of it happened at McMullen’s home. \\nThe first victim said when he told McMullen he didn’t like to be touched that way, McMullen would stop. However, he’d make the second victim rub his penis. \\nWhen McMullen was confronted by investigators, he reportedly began to cry and then denied touching the children sexually. \\nOne of the boys told police that the abuse went on for so long because he was afraid to come forward because McMullen told him not to tell anyone. \\nHe said McMullen told him this was “between you and me” and not to tell anybody because it would break up his relationship, according to the report. \\nIn July of this year, ABC 3 actually interviewed McMullen who was investigating a man for driving around town and exposing himself to little boys. \\n“There was a residence in Milton that was sharing images and videos of child pornography through their social media platform,” said McMullen in July, likely admiring his fellow sicko. “Mr. Braswell indicated that he did have a sexual attraction towards children. And that he, in the past, had driven around neighborhoods in the Milton community and would expose himself to children as they would walk down the street,” McMullen said. \\nSince his arrest, McMullen’s bond was set at $1.5 million. However, on Wednesday that amount was reduced to only $300,000. McMullen is currently still receiving his paycheck while on administrative leave. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Follow @MattAgorist on Twitter and now on Steemit Share'"}, "time": 1742563757.2745593}