{"duration": 0.10127806663513184, "input_args": {"text": "'The first time David Letterman’s mom, Dorothy Mengering, appeared on “Late Night,” she was part of a Take Your Parents to   episode, in which the staff, including members of the band, stood not far from their mothers. It was the kind of oddball concept that Mr. Letterman pioneered in the middle of the 1980s, when his show was required viewing for the cool, young and caffeinated. Taking cameras outside the studio and into his office, Mr. Letterman recruited his mother, a   church secretary from the   town of Linton, Ind. to speak into a bullhorn through an open window of Rockefeller Plaza. “Attention, New York,” she said, her gentle voice amplified, as she made a reference to the “Today” crew. “My name is Jane Pauley. I’m being held prisoner by Willard Scott. He’s not wearing pants. ” Mr. Letterman had made a similar bullhorn joke with Bryant Gumbel five months earlier, but his comedy didn’t sting as much when filtered through his mother. It even acquired a new and essential incongruity, introducing a sweetness and warmth that made him more relatable to viewers who might have been alienated by his acerbic sensibility. Ms. Mengering, who died on Tuesday at 95, was the most unlikely television star. She was   reserved and, as her three children explained in a beautiful obituary, she “was the happiest when she could curl up in a quiet place with a book and a box of   cherries. ” And yet she became a major figure on Mr. Letterman’s shows over decades, a comic foil with a radiant smile whose cheerful unflappability contrasted perfectly with her son’s exasperation. Inspired by Howard Stern, who used conversations with his mother on his radio show, Mr. Letterman turned phone calls with Ms. Mengering into a regular feature in the early 1990s, asking her to review TV shows like “Cop Rock” (“It’s not something I’ll watch again,” she said) or recite a Top 10 list (“Top 10 Things Found in Dave’s Mom’s Refrigerator”). During these exchanges, Mr. Letterman portrayed the teasing, needling son while she gamely played along. During one show in February 1991, he told his audience that if he called his mother, who kept a garden and once worked at her husband’s flower shop, at this time of year, she would say something about how the “crocuses were up. ” This turned a mundane conversation into an unexpectedly funny and suspenseful joke about how predictable parents can be to their children. These dozen or so phone conversations took place when the comedic heart of “Late Night” had shifted from scripted comedy to the compelling personality of its host. Mr. Letterman surrounded himself with a series of vivid personalities  —   like Chris Elliott’s bizarre characters  —   who inspired   that revealed more of him than a monologue joke ever could. When Mr. Letterman moved to CBS in 1993 to begin “Late Show,” the role of his mother changed, shifting from an offstage voice to an   correspondent, reporting from her home in Indiana and at three different Winter Olympics, including one in Norway, where she interviewed Hillary Clinton. Through these remote videos, she proved unerringly polite and far more game than her son. (It’s hard to imagine Mr. Letterman in a tight yellow suit and joining a luge team.) These cameos were perfectly in sync with one of the main tactics of Mr. Letterman’s TV career: turning ordinary people into funny performers while also recasting the talk show, ripping it out of its context and placing it on an airplane or in a person’s home or on the streets of New York. What was striking about Ms. Mengering’s performances is how much the spotlight didn’t change her manner or style. No matter where she was or whom she was talking to, she maintained the same poise and equanimity. She didn’t mock show business, as her son did, but she appeared immune to its notorious seduction, and completely resisted being   or remotely theatrical. Mr. Letterman’s relationship with his mother was, of course, more complex than simply devoted parent and loving son. In interviews, he called her “the least demonstrative person” in the world, and he would tell a story about the first time his mother saw him perform live, when it was clear her muted response made an impact. After telling this anecdote to Mr. Stern on “Late Show” in 2013, his famously blunt listener flummoxed him with a joke: “You have mother issues, obviously, everyone knows that. ” Just as it’s impossible to understand another person’s marriage completely, the relationship between parent and child is also a mystery. The gift that Mr. Letterman gave his fans was allowing them to see things not just from his point of view, but also from his mother’s. What we saw, in the limited way that television allows, was a genuine woman whose emotional understatement couldn’t hide her unconditional love and a son who loved to poke fun, but then made sure he hadn’t gone too far. After Mr. Letterman got his mother to yell into a bullhorn in her first appearance, the kind of brazen and juvenile move that she clearly would never do on her own, he turned away from the camera and toward her and asked, “Did that just embarrass you to tears?” She flashed a toothy smile, looked down and said, “No, David. ” He chuckled and added with some relief, “O. K. good. ”'"}, "time": 1742564602.268349}