{"duration": 1.613283634185791, "input_args": {"text": "'RT.com reports: \\nThe search warrant allows the bureau to scour through some 650,000 emails discovered on a laptop belonging to ex-Congressman Anthony Weiner and apparently also used by his wife, Clinton’s closest aide Huma Abedin. The probe is set to check if any of the texts are related to the reopened investigation of the former secretary of state’s private email use. \\nThe authorization came two days after FBI Director James Comey finally revealed the existence of the emails stash which was reportedly discovered by the agency in early October. \\n“ The process has begun, ” a federal law enforcement official told the New York Times. \\nThe new emails were discovered as part of a separate ‘sexting’ probe into former Representative Anthony Weiner (D-New York). His electronic devices were seized during that investigation. \\nAbedin claims she has no knowledge of any of her emails being on the electronic device belonging to her husband, CBS News has learned on Sunday. A source told the network that newly-discovered emails belonged to Weiner, not his wife, who left her husband earlier this year over his sexting addiction. \\nClinton’s longtime aide is allegedly cooperating with the investigation and “ seemed surprised that the emails were there, ” according to the CBS source. \\nOn Friday, FBI Director Comey announced that due to new findings, the criminal investigation into Hillary Clinton’s private email server had been reopened, as he sent a letter notifying Congress of the email review. \\nThe review, which is likely to take weeks, will seek to determine whether any of those messages are work-related, and whether they include either classified information or important new evidence in the probe aimed to check whether Clinton’s actions undermined US national security. ‘I can’t predict how long this will take us to complete’– Comey on reopening Clinton email investigation https://t.co/6SJJAU349V pic.twitter.com/EjuwwFENZ8 \\n— RT America (@RT_America) 28 October 2016 \\nThe unexpected announcement came just over a week before Americans head to the polls to determine the winner in the race for the White House between Democrat Clinton and Republican Donald Trump. Even though some of those emails passed through Clinton’s private server and could be duplicates of the information already handled by the FBI as part of the previous investigation, the probe is unlikely to wrap up before November 8. \\nConcerned by the FBI’s move to relaunch the investigation so close to the election date, US Senate Democratic leader Harry Reid on Sunday sent a letter to the FBI director hinting that Comey had violated the Hatch Act, which bars the use of an executive branch position to influence an election. \\n“ Through your partisan actions, you may have broken the law, ” Reid, a senator from Nevada, said in the letter to Comey. \\nClinton campaign chairman John Podesta and campaign manager Robby Mook also questioned the legality of the FBI’s actions. Comey’s letter to Congress was “ long on innuendo, short on facts, ” Podesta told CNN’s State of the Union. “ We are calling on Mr. Comey to come forward and explain what’s at issue here, ” Podesta said, adding the significance of the emails was unclear. \\nIn the meantime, the NYT reported that senior Justice Department officials vowed to make all resources available to conduct the investigation as quickly as possible. \\nIn July the FBI’s long investigation of Clinton’s private email use during her time as secretary of state ended without any charges.'"}, "time": 1742562445.6649795}