{"duration": 0.17484426498413086, "input_args": {"text": "'The Department of Justice should keep the public informed about the results of former President Barack Obama’s decision to grant early releases to 1, 715 convicts, says a former federal prosecutor. [“What [Attorney General Jeff] Sessions Justice Department needs to do now is track the hundreds of fellows who got these pardons and commutations,” said former federal prosecutor Bill Otis. “With overall recidivism rates for drug offenses already being 77 percent, I think we have a pretty good idea, but [the public] should get specifics: How many of these guys   what’s the nature of the new crime were there related violent crimes in the mix as well and how many victims (including but not limited to addicts and overdose victims) were there?”  But only the Department of Justice has the manpower and access to raw data needed to detail and analyze Obama’s     process which released a record 1, 715 convicts back into Americans’ neighborhoods. At least one other group has tried to gauge the impact of President George W. Bush’s pardons —  but that group had to hire three researchers to assemble only some of the data that the federal government has at its fingertips but does not share. Since January, President Donald Trump has already taken some steps to increase federal transparency by forcing agencies to release data about crime by illegal aliens. For Otis, this change is a good example of what officials should do with information about Obama’s commutations. “It may be helpful to have some kind of interagency standard or oversight body to ensure the public has reasonable access to the data it paid for,” consistent with privacy rules, said Jason Richwine, a public policy expert who studies government data to gauge the impact of policy alternatives. “When the government publishes [only] selected statistics from the restricted data, we get answers only to the questions that the government thinks are important —  not necessarily the same questions that the public wants (or needs) to be answered,” he said. “It’s almost always a good idea for the feds to be more transparent,” said Otis. “The sheer size of the federal government makes it hard for citizens to know what’s going on,” Otis wrote, adding: The feds should also be, not just more transparent, but quicker to release crime data. Because the present release procedures are so slow, liberals were able to deny for many months —  if not close to a year —  the crime spike that began at the end of 2014, and to dismiss it as just ‘scattered reports’ or ‘a bunch of scaremonger anecdotes. In  January, as he was preparing to leave the White House, Obama claimed “there is no growing crime wave,” despite the crime wave that has killed an extra 1, 500 Americans in 2015 and 2016. Sheltered by the embargo on government data that could have debunked his denial, Obama used his pardon power to shorten sentences for 1, 715 criminals, including traffickers of deadly drugs. Many of those who received clemency are also violent felons. For example, Obama commuted the sentence of a   drug trafficker sentenced for involvement in his   ’s shooting death —  and Sherman Ray Meirovitz will be back on the streets in June instead of serving out a life sentence. Obama freed a former armed cocaine dealer onto Virginia’s streets in March, along with a former armed Philadelphia crack cocaine dealer, plus a former armed California meth trafficker. Obama also justified his   release by claiming racial disparities in the criminal justice system. “About one in every 35 African American men, one in every 88 Latino men is serving time right now. Among white men, that number is one in 214,” Obama said in a 2015 NAACP speech. He continued: For nonviolent drug crimes, we need to lower long mandatory minimum sentences —  or get rid of them entirely. Give judges some discretion around nonviolent crimes so that, potentially, we can steer a young person who has made a mistake in a better direction. We should pass a sentencing reform bill through Congress this year. We need to ask prosecutors to use their discretion to seek the best punishment, the one that’s going to be most effective, instead of just the longest punishment. We should invest in alternatives to prison, like drug courts and treatment and probation programs. Obama’s White House stated that 60 percent of those incarcerated in federal prison were black or Latino but declined to reveal critical details. The   claim deeply shaped Congress’s debate over crime in 2015 and 2016, when Obama and his deputies tried to pass the Sentencing Reform and Corrections Act of 2015 (SCRA) which would have slashed mandatory minimums for drug traffickers. The bill’s language, however, reached far beyond the small number of people convicted solely on drug offenses.  Sessions, who is now the U. S. Attorney General, noted in May 2016 that there are “virtually no cases of simple possession” in the federal courts. Nearly all, or 99. 5 percent, of those incarcerated in federal prison for   “nonviolent drug crimes” are convicted on trafficking charges. The bill stalled in the Senate as a handful of Republican senators, including Arkansas’ Tom Cotton and Florida’s Marco Rubio, publicly opposed the legislation, and GOP presidential nominee Donald Trump campaigned on a platform promising “law and order. ” Defeated by data, Obama sought another path to reducing the federal prison population. “As was so often the case, Obama simply took the law into his own hands. Had Congress thought its prior drug laws were too stringent, it could have, by legislation, given retroactive effect to any lighter sentences it wanted,” Otis explained. “But it didn’t —  the push for sentencing ‘reform’ fizzled. Frustrated with Congress’s refusal to adopt even more of his   agenda, Obama just acted unilaterally. ” Now that Obama has provided clemency to 1, 715 prisoners, his actions will have   ramifications, Otis warned: I think there are two   effects of Obama’s mass clemencies. One is to send the message that we’re just not that serious anymore in dealing with drug traffickers, and that we think the real problem is that American is too callous and punitive (and racist?) —  not that drug dealers are too unfeeling towards the lives they damage while trying to make a quick buck  …     The other   effect will be simply to exacerbate the heroin overdose crisis that’s been escalating for at least a decade. Why we become lenient toward drug dealers at exactly the moment the dangers of drugs have reached a shocking level is a mystery wrapped in an enigma. Obama undertook his   campaign at a time when over 47, 000 Americans died from drug overdose deaths in 2014, including 28, 647 from opioid overdoses, and   overdose deaths tripled between 2010 and 2015. The CDC found over that a staggering 500, 000 people died from drug overdoses from 2000 to 2014. It is difficult to track criminals who received commutations, especially when the government is reluctant to share or even collect important statistics, as several experts explained to Breitbart News. Without clear and detailed government data, activists and critics of government policies must rely on outside surveys, indirect or   data, often decorated by anecdotes. A Justice Department investigation into the makeup of the commutations would need to compare the makeup of the commuted population, versus the current prison population, versus the general population. Unfortunately, much of the needed data is not collected and the existing statistics sometimes raise more questions than they answer. For example, the Uniform Crime Reports, a compilation of street crime reports collected from 18, 000 different sources published annually by the FBI, has five race categories: White, Black or African American, American Indian or Alaska Native, Asian, Native Hawaiian or Other Pacific Islander. “White” in the UCR’s case includes all Latinos —  and the Latino population in the U. S. stood at roughly 57 million in 2015. Blurring racial and ethnic categories makes obtaining a complete picture difficult. Since nearly all of the heroin used in the U. S. is brought across the border by Mexican traffickers, who are nearly always illegal aliens, there is an immigration angle to Obama’s sentence commutations as well, made more opaque by the “muddled” data collected by the feds. For example, a report by the CATO Institute recently claimed that Trump’s new VOICE program was unwarranted because immigrants are less likely to commit crimes than similar Americans. “Our headline finding is that both illegal immigrants and legal immigrants have incarceration rates far below those of   Americans —  at 0. 85 percent, 0. 47 percent, and 1. 53 percent, respectively,” claimed author Alex Nowrasteh. However, the study, titled “Criminal Immigrants: Their Numbers, Demographics, and Countries of Origin,” relies on extrapolations from the American Community Survey, not on actual data from the Department of Justice. That lack of DOJ data skews the CATO report because it cannot measure how many migrants were sent home before they could   like many American criminals who stay in the country to commit more crimes. That immigrant vs. American comparison problem might be reduced if the federal government released data showing the share of   criminals in jail under   offenses. But, said author Alex Nowrasteh, “that data is not in the    …     If you have it, please share it. ” The group ProPublica tried to study the patterns in the pardons (not commutations) approved by President George W. Bush. The group recognized the lack of DOJ data and launched an enormous undertaking by at least two authors and three researchers, and extensive data analysis, to show that 494 requests for pardons were submitted, but only 189 were partly or fully approved. Of those 189 pardons, many were for   crimes, while only a small proportion was for drug offenses. “Accounting for the effects of these variables did not eliminate the strong influence of race on getting a pardon [and] [a]fter testing all available variables, we found that whites were still nearly four times as likely to be pardoned as minorities overall,” said the 2011 report, which explains the complexities caused by the lack of public federal data. President Bush relied almost exclusively on recommendations from the Office of the Pardon Attorney inside the Justice Department. The data thus provide an opportunity to assess the office’s impact on final pardon decisions. Through a Freedom of Information Act request, ProPublica obtained the names of petitioners who were denied pardons during Bush’s two terms —  1, 729 individuals. The names of 189 petitioners who received pardons came from the pardon office website. ProPublica pulled a random sample of 500 names from the combined list  …     For all those in the sample, ProPublica staff and freelance researchers searched public records or made phone contacts to gather demographic data such as age, race, gender and marital status. Researchers gathered sentencing information from federal court records and FOIA requests, and searched other records to collect data on bankruptcies, liens, financial judgments and any additional criminal history  …     We conducted a binary logistic regression. The dependent variable was whether the petitioner received a pardon. We tested all other available variables against the outcome. In the end, variables that we included in the analysis were:   …     Hispanic petitioners are classified as white in most federal court and prison records. To identify Hispanics in our sample, we relied on Hispanic surname or race as designated in other public records  …     The government’s habit of hoarding original data complicates many policy debates, said experts. When the government shares its data, the public can understand existing patterns and data, crime expert Heather McDonald told Breitbart News. For example, she said: [In] New York City blacks make up 53 percent of all New York police department pedestrian stops, but blacks are only 23 percent of the city’s population. To a naïve observer, that disparity in police activity looks like racism. What you need to know is that blacks commit 75 percent of all shootings in New York City and 70 percent of all robberies. By contrast, whites are 34 percent of the population but they commit less than two percent of all shootings and less than four percent of all robberies. Whites make up nine percent of all police pedestrian stops. So blacks are actually under stopped compared to what their crime rates would predict and whites are over stopped compared to what their crime rates would predict. The extra knowledge can help resolve public debates, such as the controversy over race and arrests rates, she explained. “The big fallacy of all   activism is to ignore the fact that policing today is   and police go where people are most being victimized and that is in minority neighborhoods. But the public is, by and large, clueless about how vast the disparities in criminal offending are,” she said. “The federal government could take the lead in educating the public about policing and crime. ” On immigration issues, the federal government hides data about the scale of   programs, such as the   program, and it hides data about green card holders, said Steven Camarota, research director at the   Center for Immigration Studies (CIS). Similarly, the federal government has muddled data regarding repatriations, he said, adding: “This is how the Obama administration made [the number of] deportations look higher. ” The federal government does have data from the states about the number of illegal aliens in U. S. jails, but it only releases data about the annual number of hours spent by all illegal alien prisoners, he continued. The data about cumulative hours is released via federal reports about federal funding for state jails that house illegal aliens. “It is not enough to know that Arizona says they had a million hours of aliens in prison in the last year,” he told Breitbart News. “You want to know what that is a percentage of the total” number of hours and prisoners, he said. Without the   “microcode’ data, he said, “we can’t do our own analysis. ” “I would like to know all the different categories of people among those arrested,” said Jessica Vaughan, director of policy studies at the CIS. “How many have protected status? How many have green cards?” she asked. “They won’t even tell us how many are ” she said, adding: “I know they can do a breakdown because I’ve seen it in the past. ” The Department of Homeland Security should reveal far more of the data is keeps secret, said Vaughan, including: “The number of releases of illegal aliens from ICE custody, the number of people who are caught and released by the Border Patrol, how about the number of people who are here on exchange visas who are working as opposed to studying? The number on [Optional Practical Training] approvals  …     [and] what ‘training’ they’re doing and the number of terror convicts who are foreign born. ” For example, the agency should release data about ‘IRS tax returns which are filed by people who provide two different [identification] numbers  …     how many times are returns filed with a number that is used multiple times  …     how many employers are reporting information that includes Social Security Numbers that are used by multiple employees,” she said. The Department of Education should collect and release data about how private universities treat applications by people from various racial and ethnic backgrounds, said Roger Clegg, president of the Center for Equal Opportunity. “That’s not something that private universities are willing to divulge,” he told Breitbart News. Until the federal government chooses to accurately collect and then publicize such crime data, Americans seeking the truth about dangerous criminals released into their communities will continue to be left in the dark. “Data about Obama’s commutations would be especially useful, for a reason that’s easy to see: They were given out in record numbers, vastly more than any President at least since Eisenhower,” Otis told Breitbart News. “Why was that? Maybe we should examine the facts to find out. It could be that there were so many more harmless or   people in federal prison when Obama was President, but, if so, let’s put the facts on the table. ” “In deciding the real basis for Obama’s nearly unprecedented clemency binge, of course it would be useful for the public (and the press, if it had any interest) to be able to see more of the story behind the clemency decisions,” he said. “One other thing: Liberals are forever telling us that we need ‘ ’ policy, only they seldom seem to welcome the data,” he added. Listen to a discussion of this investigation on Breitbart News Daily, airing Monday through Friday on SiriusXM PATRIOT 125 from 6 AM EST to 9 AM EST: '"}, "time": 1742628468.476009}