{"duration": 0.14352130889892578, "input_args": {"text": "'CAPE CANAVERAL, Fla.  —   Back in his days as a test pilot at   Air Force Base in Ohio, Gus Grissom had a message for his wife, Betty. “If I die, have a party,” he said. Betty Grissom never did have that party. But on Friday, as for the past 25 years, there was a solemn observance at the   memorial for her husband and two crewmates who were killed in the Apollo 1 disaster. Mr. Grissom, Roger Chaffee and Ed White died in a flash fire that engulfed their capsule atop a Saturn 1B rocket during a routine training operation on Jan. 27, 1967. Mr. Grissom was 40. Ms. Grissom, 89, was at the memorial again on Friday, wearing a denim jacket with a large Apollo 1 patch in patriotic colors. She joined old friends, family members, and NASA officials and veterans, among them Charlie Duke, who took part in the Apollo 16 moon landing. With the recent deaths of the astronauts John Glenn and Eugene A. Cernan and the sea changes in Washington, the gathering felt like a memorial for an era as well as for three men. At the ceremony, candles were lit for the dead astronauts by members of their families, including Cody Grissom, 22, a pilot, who is completing his last year at his grandfather’s alma mater, Purdue University. Representatives from the Navy, the Air Force and NASA spoke, and a Navy bugler performed taps after the sun went down. “It is important that Challenger and Columbia are remembered, and that Apollo 1 is remembered,” said the Kennedy Space Center director, Robert D. Cabana. “And that we take those steps that create an environment where everyone has a voice, that we really work to ensure the success and the safety of the crew as we continue to explore and move beyond our planet. ” Ms. Grissom said this year’s ceremony was probably her last. It coincided with a NASA tribute exhibit about Apollo 1 at the Kennedy Space Center, which she, like many, thought was long overdue. “I thought this is probably a good time to call it quits with them finally getting a memorial of some kind,” she said. This year’s event drew around 150 people, one of the largest crowds ever for a memorial that few people knew of unless they were related to an astronaut or were a   space fan. “We need heroes today, and these were heroes,” said one such fan, Robert Pearlman, an American space historian. People from all over the world traveled to the memorial, among them Masato Maruyama, 65, who has come for the past 10 years from Tokyo. He brought a big bottle of sake to share with the family and friends. Mr. Maruyama said Mr. Grissom reminded him of his father, who was in the Japanese Navy. He remembers just where he was when the fire occurred. “It’s not the distance  —   it’s in here,” he said, pointing to his heart. “I’m just one of hundreds of thousands. Apollo counted a lot not just for Americans, but human beings. ” Although the launch platform is crumbling like a concrete Greek ruin, and stenciled with an eerie “Abandon in Place,” the site was decorated with three     floral wreaths brought by the Grissom family. A bagpiper stood ready and Ms. Grissom sat front and center. She was treated as the event’s grande dame as people lined up to speak with her. “I want you to know it is such an honor,” said Shirley Brown, whose shop provided the wreaths. “The first time you walked in my shop and said, ‘I’m Betty Grissom,’ I thought Queen Elizabeth had walked in. You never went down, you fought all the way. ” “I never quit,” Ms. Grissom agreed, in the kind of taciturn response her astronaut husband might have offered. Many years after the accident, two space buffs, Bob Castro and Mark Pinchell, started going out to the site of the fire, which is on Air Force property, in their own private tribute. One year, they bumped into each other, and came up with the idea of doing something bigger. “Just two space geeks who were going to Pad 34 and doing their own separate ceremonies,” said Mark Grissom, 63, who was 13 when his father died. “They met at the pad and decided to invite the families. ” The Grissoms were the first astronaut family to become involved. Early on, car headlights provided the only illumination. While other astronauts and families have been absent over the years, this year Roger Chaffee’s wife, Martha, and her daughter, Sheryl, attended, along with Ed White’s daughter Bonnie. “This is the families’ memorial,” said Sonny Witt, the 45th Space Wing director of operations for Division 1 at Patrick Air Force Base, who helps provide the access. “Not the Air Force and not NASA. They are the ones that lost the husbands and brothers and fathers. Mistakes were made, and they paid the price. ” When the three Apollo 1 astronauts were trapped in their burning capsule on Pad 34, a cry for help, believed to be from Mr. Chaffee, a rookie astronaut, came over the communications system: “Hey, we’re burning up. ” Mr. White tried opening the hatch, but caught within the highly combustible pure oxygen atmosphere, the crew suffocated. “I don’t want any of this forgotten,” Ms. Grissom said. “Gus Grissom was a human being. ” Mr. Grissom, often seen as an underdog, was a favorite astronaut of many Americans. He infamously “screwed the pooch”  —   as Tom Wolfe put it in “The Right Stuff”  —   when the hatch blew on his Mercury capsule, causing it to sink it in the Atlantic upon splashdown. Mr. Grissom was initially blamed, and the sunken capsule cost the astronaut couple a visit to the Kennedy White House. In the end, he was cleared of responsibility. Ms. Grissom, who lives in Houston by herself, and Mr. Grissom were high school sweethearts in Mitchell, Ind. Her life always revolved around him. She worked as a   telephone operator for Indiana Bell, putting her husband through college at Purdue, where he studied mechanical engineering on the G. I. Bill. He was selected as an astronaut after flying an   Sabre on over a hundred combat missions in Korea. Death was always on the horizon for the wives. The program lost seven astronauts on the path to the moon, largely as a result of crashes of the   the supersonic jet trainer airplanes the astronauts flew back and forth from where they lived in Houston and Cape Canaveral. When the news of the Apollo 1 accident came to her, delivered by a NASA doctor when she was at a friend’s home for a weekly poker night, Ms. Grissom told her friend that she had “already died 100, 000 deaths” living with her husband. Martha Chaffee, the youngest space widow, slept with the flag that hung over her husband’s coffin at Arlington. Pat White killed herself years later, a weekend before she and some of the other wives had a reunion planned, her friends said. The space widows felt rejected after their husbands died, while still living in the closely knit community of astronaut families in the “space burbs” by the Manned Spacecraft Center (later the Johnson Space Center) in Houston, nicknamed “Togethersville” because of its exclusivity. In the late ’60s, Ms. Grissom became a black sheep among the astronaut community. She was the first of the widows to sue NASA’s largest contractor, North American Rockwell, over the construction of the capsule, and she inspired Ms. Chaffee and Ms. White to do the same. Ms. Grissom eventually settled for $350, 000. On Friday, as Ms. Grissom was helped off the old launching pad, professional and amateur stargazers pointed out the International Space Station passing in the sky above, along with Venus and a shooting star. Back in the car and about to be driven to a celebratory dinner for friends and family at a hotel in nearby Cocoa Beach, she turned to her son and said, “The stars are out tonight. ” Earlier, she spoke of how her husband’s sacrifice helped pave the way for the missions to come like the Apollo 11 moonwalk her husband never got to see. Still, she said, “I’m pretty sure he got to the moon before they did. ” She added: “Of course he didn’t make it, but in spirit I think he was already there. ”'"}, "time": 1742562368.7028534}