{"duration": 0.03515338897705078, "input_args": {"text": "'Criminal   are generating around 35 billion USD in revenue from the migrant trade, according to the International Organisation for Migration (IOM). [Lacy Swing, who heads the United Nations agency, estimated that around 1, 700 migrants have died while in the care of   this year. Around 5, 000 died in 2016, and 3, 700 in 2015, suggesting a worrying upward trend.  Swing cautioned that we should be “careful” when considering these figures, however, “because those are the people we know who died, how many other bodies are submerged in the Mediterranean or buried in the sands of the Sahara?” He added: “That’s the tragedy and this is why we are so concerned to try to caution migrants about smugglers. The smugglers are really the big problem. It’s about $35 billion a year [that people smugglers make] and we know they’re making lots of money across the Mediterranean. ” People smugglers make about USD 35 billion a year   @IOMchief https:  .  pic. twitter.   —   IOM (@UNmigration) June 1, 2017,  Swing claimed the migrant crisis was being exacerbated by “unprecedented   sentiment,” although he did not appear to offer any explanation as to the mechanism through which this alleged sentiment could contribute to the issue. He added that   feelings were “fueled now by suspicions that some of those fleeing terrorism might be terrorists themselves”  —   a possible reference to migrants like the Islamist refugee Ramadan Abedi, whose son Salman killed 22 children, young people and parents at Britain’s Manchester Arena in May or bogus asylum seeker Anis Amri, who drove a hijacked lorry into a Christmas market in Berlin last year. The IOM has actively supported open borders and mass immigration throughout the migrant crisis, claiming that, “with 244 million people on the move, migration is inevitable, necessary, and desirable” as part of its #ForMigration campaign. With 244 million people on the move, migration is inevitable, necessary, and desirable: https:  .  #ForMigration pic. twitter.   —   IOM (@UNmigration) May 19, 2017,  Significantly, a comprehensive Risk Analysis by the European Union Border Agency (Frontex) indicates that global bodies’ relaxed and even welcoming attitude towards mass immigration is a large part of the problem when it comes to   with the “taxi service” to Europe offered by the authorities and NGOs strengthening their business model, encouraging more journeys and, inevitably, resulting in more drownings. “Apparently, all parties involved in [  ] operations in the Central Mediterranean unintentionally help criminals achieve their objectives at minimum cost [and] strengthen their business model by increasing the chances of success,” the report noted. “Migrants and refugees  —   encouraged by the stories of those who had successfully made it in the past  —   attempt the dangerous crossing since they are aware of and rely on humanitarian assistance to reach the EU. ” Stopping the boats has stopped the drownings. Australia’s “tough love” policy less deadly than EU’s. https:  .   —   Jack Montgomery ن (@JackBMontgomery) February 8, 2017,  Worryingly,   is known to be a significant source of income for terror groups such as the Islamic State, which was reported to have made over $320 million from the trade in 2015. This suggests that, so long as   continues relatively unchecked, efforts to cut off the revenue streams to Islamic radicals will be unsuccessful.'"}, "time": 1742562737.8336627}