{"duration": 0.06712007522583008, "input_args": {"text": "'Shah Rukh Khan, the Indian actor known as the “King of Bollywood,” said he was detained for a few hours at an American airport on Thursday. Again. To detain one of India’s biggest celebrities would itself attract international headlines, but this, he said, was the third time that he had been held then released while traveling in the United States. His treatment at American airports was already a sore point among his fans as well as critics of airport security procedures, with each episode sparking outrage and discussion. Mr. Khan was estimated to have a net worth of $600 million in 2014, making him one of the richest actors in the world, just after Jerry Seinfeld. Mr. Khan did not name the airport or say why he had been held, but Rich Verma, the American ambassador to India, said in an apology on Twitter that the incident had happened at Los Angeles International Airport. Mr. Khan’s previous interactions with immigration officials followed a similar pattern of being held for a few hours before being released. In 2009, Mr. Khan, 50, was detained in Newark while in the United States to promote his film “My Name is Khan,” which was about racial profiling of Muslims after the Sept. 11 attacks. In the movie, his character insists he is not a terrorist when he is searched at the San Francisco airport. Then in 2012, he was held in White Plains, N. Y. on his way to address students at Yale. “Whenever I start feeling too arrogant about myself, I always take a trip to America,” he later told the students. With humor, he relayed his frustration on Thursday to his 20. 7 million Twitter followers. (For reference, he has roughly the same number of followers as Eminem, Nicki Minaj and Kourtney Kardashian.) Nisha Biswal, the assistant secretary of state for South and Central Asia, tweeted: “Sorry for the hassle at the airport, @iamsrk  —   even American diplomats get pulled for extra screening!” Mr. Khan responded to her tweet: “No hassle ma’m. ” He said he respected the protocol and did not expect special treatment. “It’s just inconvenient. ” A spokeswoman for Customs and Border Protection said she could not discuss individual cases, citing privacy laws. On Twitter, the incident prompted condemnation and accusations of racial profiling. Mr. Khan’s immediate response to Thursday’s episode, complete with a Pokémon Go joke, is in line with how he has spoken about his past detentions. In his address to Yale students in 2012, he made light of his interaction with immigration officials. “They always ask me how tall I am and I always lie and get away with it and say 5 feet 10 inches. Next time I am getting more adventurous. ‘What color are you?’ I am going to say white. ” In 2013, he wrote about his experience and about the stereotypes he encounters as a Muslim with the last name of Khan, including his security   at American airports. “I wonder, at times, whether the same treatment is given to everyone whose last name just happens to be McVeigh (as in Timothy)?” he wrote, referring to the Oklahoma City bomber.'"}, "time": 1742563088.1354795}