{"duration": 0.2123556137084961, "input_args": {"text": "'A Hillary Clinton Indictment Is Coming By Michael Snyder, on November 3rd, 2016 \\nDoesn’t it seem like most of us are collectively holding our breath as we wait to see what will happen with this election? We are now only a handful of days away from election day and the polls have really tightened up , there are unprecedented concerns about post-election violence , and the Democratic nominee for president could be indicted literally any day now. The American people are going to be absolutely shocked when the FBI finally reveals what they have discovered regarding Hillary Clinton’s mishandling of classified materials, corruption at the Clinton Foundation, and other “stomach churning” matters that normally aren’t topics of polite conversation. Without a doubt, a Hillary Clinton indictment is coming. The only question now is when it will happen. \\nThe moment that FBI Director James Comey sent his letter to Congress, he knew that someone’s head was going on the chopping block. If Hillary Clinton does not get indicted, Comey’s career is over and there is a very good chance that he will be going to prison instead. There is no way that he would have ever put himself on the line like this if extremely powerful evidence had not already been found against Clinton. \\nBecause without a doubt, the vultures are circling. Just consider what House Minority Leader Nancy Pelosi recently told CNN about Comey… \\n…Nancy Pelosi has claimed that FBI Director Comey is “not in the right job,” following his decision to reopen the investigation into Hillary Clinton’s misuse of a private email server. \\n“Maybe he’s not in the right job,” Pelosi said in an interview with CNN . \\n“I think that we have to just get through this election and just see what the casualties are along the way,” she continued, refusing to answer a question on whether she thought the FBI director should resign. \\nIf it turns out that this investigation into Hillary Clinton’s emails was renewed for no good reason, Comey is going to be strung out to dry, and he knows this. \\nFortunately for Comey, there are reports that indicate that the evidence the FBI is compiling in this case is absolutely overwhelming. The following comes from Infowars … \\nAccording to other uncovered emails, Abedin and Clinton both sent and received thousands of classified and top secret documents to personal email accounts including Weiner’s unsecured campaign web site which is managed by Democratic political consultants in Washington D.C. \\nWeiner maintained little known email accounts that the couple shared on the website anthonyweiner.com. Weiner, a former seven-term Democratic Congressman from New York, primarily used that domain to campaign for Congress and for his failed mayoral bid of New York City. \\nAt one point, FBI sources said, Abedin and Clinton’s classified and top secret State Department documents and emails were stored in Weiner’s email on a server shared with a dog grooming service and a western Canadian bicycle shop. \\nIf you even send a single classified document outside of a secure channel that is a major criminal offense. \\nSo if there are “thousands” of these emails as some reports are indicating, that should be enough to lock Hillary Clinton up for the rest of her life. According to investigative journalist Jerome Corsi , what Clinton and her close associates have done is “an obvious violation of the law”… \\n“The rules for handling classified materials is you’ve got to handle them on secured channels. You can’t let them go on an insecure channel,” Corsi said. “Clearly, sending these emails to Yahoo.com – and we know some of them had classified material because they’ve been marked classified – is a violation of the law, and it doesn’t require intent.” \\nHe said Clinton and Abedin could have avoided this entire scandal by establishing secure government accounts and not sending any of it to private accounts. \\n“This was such an obvious violation of law, and perhaps leading to an espionage case or a treason case, that when presented to Comey, he really had no alternative than to go forward,” Corsi said. \\nBut this isn’t the only investigation that could lead to a Hillary Clinton indictment. According to Fox News Channel’s Bret Baier , the FBI investigation into corruption at the Clinton Foundation is also “likely to lead to an indictment”… \\nTwo sources with intimate knowledge of the FBI’s investigations told Fox News Wednesday that a probe of the Clinton Foundation is likely to lead to an indictment . Fox News’s Bret Baier said Wednesday that the FBI probe into a possible pay-to-play scheme between Democratic presidential nominee Hillary Clinton and the Clinton Foundation has been going on for over a year. Sources told the news network that the investigation, which is conducted by the White Collar Crime division of the FBI, is a “very high priority.” \\nOne of the anonymous sources told Baier that the amount of evidence now being uncovered is equivalent to “an avalanche coming in every day.” \\nIf what these two sources have told Baier is true, then this changes everything. The following is how Real Clear Politics summarized the most important pieces of information from this report… \\n1. The Clinton Foundation investigation is far more expansive than anybody has reported so far and has been going on for more than a year. \\n2. The laptops of Clinton aides Cherryl Mills and Heather Samuelson have not been destroyed, and agents are currently combing through them. The investigation has interviewed several people twice, and plans to interview some for a third time. \\n3. Agents have found emails believed to have originated on Hillary Clinton’s secret server on Anthony Weiner’s laptop. They say the emails are not duplicates and could potentially be classified in nature. \\n4. Sources within the FBI have told Baier that an indictment is “likely” in the case of pay-for-play at the Clinton Foundation, “barring some obstruction in some way” from the Justice Department. \\n5. FBI sources say with 99% accuracy that Hillary Clinton’s server has been hacked by at least five foreign intelligence agencies, and that information have been taken from it. \\nIt is also being reported that the Department of Justice tried unsuccessfully to stop the investigation into the Clinton Foundation. \\nAt this point, the struggle between the FBI and the Department of Justice is being described as “a civil war”. The Department of Justice is obviously extremely pro-Clinton, and meanwhile over at the FBI many agents consider Hillary Clinton to be “the antichrist personified” … \\nThe currently serving FBI agent said Clinton is “the antichrist personified to a large swath of FBI personnel,” and that “the reason why they’re leaking is they’re pro-Trump.” \\nThe agent called the bureau “Trumplandia”, with some colleagues openly discussing voting for a GOP nominee who has garnered unprecedented condemnation from the party’s national security wing and who has pledged to jail Clinton if elected. \\nPerhaps if Hillary Clinton had not made it a habit to regularly cuss out Secret Service agents and other law enforcement personnel over the past several decades she would have more friends in the FBI. \\nTo a certain extent, this is simply a case of the chickens coming home to roost. \\nAnd at this point, even some of Hillary’s biggest supporters in the media are turning on her. Just consider what Chris Matthews of CNBC is saying about her… \\n“You know what I think? I’m going to be more judgmental than Beth who’s a straight reporter. I’ll make a judgment. Every time I watch a politician engage in a certain pattern of behavior before they go to the White House, they continue to engage in that pattern afterwards. People don’t change because we swear them into the White House. They become that person big-time. And the Clintons were raising money like this hand over hand, hand over fist, back in 1996, using—we called it Motel 6. They were hoarding them in, pulling them in by train loads of contributors and then letting them sit in the Lincoln bedroom for a while and charging them by the hour. You can still vote for Hillary Clinton, but remember, you’re getting this as part of the package, because that’s been their pattern. “ \\nVoting has already begun in most states, and Americans are facing a historic choice. \\nIf they choose to elect the most wicked politician of this generation despite everything that has been revealed about her, I think that will speak volumes about where we stand as a nation. \\nOur leaders in Washington D.C. reflect who we are as a country. If if we willingly send Hillary Clinton to the White House, the truth is that we will fully deserve everything that happens to us afterwards. November 3rd, 2016 | Tags: Clinton , Election , Election 2016 , Hillary Clinton , Hillary Clinton Charged , Hillary Clinton Indicted , Pain , Painful , Stomach , Stomach Churning , Tightened Up | Category: Commentary If Donald Trump Wins, He Will Be 70 Years, 7 Months And 7 Days Old On His First Full Day In Office »'"}, "time": 1742563953.483937}