{"duration": 0.0635075569152832, "input_args": {"text": "'Our New Country: Women And Minorities Hardest Hit Ann Coulter, VDARE, October 26, 2016 \\nEvery ethnic group except whites bloc-votes for the Democrats. Coincidentally, the Democrats have brought in another 30 to 40 million nonwhite immigrants in the last few decades. \\nIt doesn’t help that white voters can’t agree on what constitutes an acceptable candidate. In 2012, working-class whites sat out the election, rather than vote for the out-of-touch rich guy they saw in Mitt Romney. This year, the out-of-touch rich guys say they’ll vote for Hillary because Trump is tacky and gross. \\nThe sad irony is that the only people who will be better off in our new country are mostly white plutocrats–the top .01 percent. The rest of us will be their servants. \\nThe people who will be worse off are everybody else–the working class, the middle class (who will soon be working class) and, most of all, women, minorities, children, the elderly, the weakest and most vulnerable members of society. \\nLook to Mexico for your future–or any Third World country. Or to Univision’s Jorge Ramos. The ruling class in Mexico is composed of European-looking, white descendants of Spanish conquistadors who raped the native population, giving them only their Spanish names in return. (British settlers in America brought women with them.) \\nExplaining Latino culture’s acceptance of incest and child rape, criminal justice researcher Shana Maier writes in a book about rape that “the male is the head of the household, and women are subordinate to men. . . . Hispanics and Latinos are more likely than other racial/ethnic groups to blame the victim. The victim, not the perpetrator, is blamed for bringing dishonor to the family.” \\nOne American detective said that, today, police are being taught to keep an “open mind” about child rape because “it’s a cultural thing.” \\n{snip} \\n, our media already have a totally “open mind” about incest and child rape–and murder!–when it’s committed by immigrants. \\n{snip} \\nImmigrant women arrive in America, thrilled to have escaped cultures where rape, incest and spousal murder are acceptable, only to discover that those crimes are perfectly acceptable in this country, too–provided the perpetrator is from the very culture they fled. \\n{snip} \\nPerhaps American men could do better, but, as American women may soon discover: They never had it so good. \\nManifestly, the purpose of our immigration policies is not to help Americans–or the immigrants who wanted to live in a place like America. They are designed to funnel welfare-dependent voters to the Democrats and cheap labor to the rich. {snip} \\nOur country will be Zimbabwe, but–if all goes according to the Democrats’ plan–they’ll get to be Mugabe! \\nThat’s Hillary’s dream. If she wins, Joe Sobran’s parody of the typical New York Times headline (about anything) will come true: “Women and Minorities Hit Hardest.”'"}, "time": 1742562300.4564223}