{"duration": 0.04764699935913086, "input_args": {"text": "'JERUSALEM  —   Instead of condemning a terrorist attack carried out by a Jordanian citizen right outside Jerusalem’s Old City on Saturday, the Kingdom of Jordan blamed Israel for the “ugly crime” of an Israeli policeman defending himself by shooting the Jordanian assailant as the officer was being repeatedly and brutally stabbed. [Jerusalem Police Spokeswoman Luba Simri explained the policeman was walking down a street near the Lion’s Gate, an entrance to the Old City, when the officer was stabbed in the face and body by the Jordanian citizen,    Mohammed Abdullah Salim  .  “The terrorist rushed toward him, whipped out a knife that he had in his possession, stormed him and began stabbing him. The police officer responded with determination and in a professional manner, managed to activate his weapon and neutralized the terrorist,” Simri told reporters. A second policeman was stabbed in the hand while helping to subdue the terrorist, who reportedly entered Israel several days ago. The Israeli police released graphic video of the attack (watch it below) in which Kasaji can clearly be seen repeatedly stabbing the policeman, who had been knocked to the floor.  Jordan’s Foreign Ministry in Tel Aviv described the attack as an “ugly crime. ” Jordan was referring to the policeman’s   and not to the reportedly unprovoked terrorist attack by one of its own citizens. Jordan’s Minister of Communications Muhammad  ’man was quoted as saying, “The Israeli government, as the occupying power in Jerusalem, bears responsibility for the shooting of a Jordanian civilian who was killed. ” Mu’man failed to note that the terrorist, Kasaji, was killed while stabbing the officer. Prime Minister Benjamin Netanyahu criticized the Jordanian statements. “It is time that Jordan ceases its double sided game. Just as Israel condemns terror attacks in Jordan, Jordan must condemn terrorist attacks in Israel. Terror is terror,” Netanyahu said. The Times of Israel further reported on today’s terrorist attack: The    police officer was taken to Jerusalem’s Shaare Tzedek Medical Center in moderate condition after the incident near the Lions’ Gate. He had wounds in the neck and head, and was conscious and in stable condition when evacuated to the hospital. A second man was lightly wounded, with cuts to the hand.   …    After the incident police arrested a local merchant who they suspected prevented   from helping the policeman during the attack. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio. ” Follow him on Twitter @AaronKleinShow. Follow him on Facebook.'"}, "time": 1742563319.5556836}