{"duration": 0.04729652404785156, "input_args": {"text": "\"Two liberals on a crusade submit petition for Oregon to secede from the Union New petition hopes to make Oregon a 'safe space' as bigoted liberals plan State's succession By Shepard Ambellas - November 11, 2016 PORTLAND ( INTELLIHUB ) — Two liberals by the names of Jennifer Rollins and Christian Trejbal, likely offended by the powerhouse personality of the new President-Elect, have filed a petition for the State of Oregon to secede from the Union. \\nThe petition for a 2018 ballot initiative will require only 1,000 signatures to move forward as the two wish to make the state a liberal safe-space, where robust personalities with vigor can’t encroach on their feelings. \\nTrejbal told the Oregonian Thursday, “Oregonian values are no longer the values held by the rest of the United States.” \\n“Those values? “Life, liberty, the pursuit of happiness.” \\nSo essentially you have two bigoted liberals who likely crave open borders, more tax, more security arising from false flag attacks like 9/11 and transgender bathrooms. \\nIs this what they call “happiness?” \\nLadies and gentlemen, if this is the mindset of Oregonians — then all I have to say is good riddance. \\nHowever, I suspect that it is not the mindset of most Oregonians and that these two crazed loons have their own agenda in which it is okay for them to express their ideology but they do not want others, like Trump, to express his. \\nThe not so dynamic duo plans to get the 1,000 signatures needed by the end of Thursday. \\n#SafeSpaceFail \\nShepard Ambellas is an opinion journalist, filmmaker , radio talk show host and the founder and editor-in-chief of Intellihub News & Politics. Established in 2013, Intellihub.com is ranked in the upper 1% traffic tier on the World Wide Web. Read more from Shep’s World . Get the Podcast . Follow Shep on Facebook and Twitter . Featured Image: Mike McCune/Flickr\""}, "time": 1742564431.0001154}