{"duration": 0.06292343139648438, "input_args": {"text": "'We Are Change \\nPolitical strategist Roger Stone and Alex Jones of Infowars have made it well known to the Clinton campaign that “Bill Clinton is a rapist” – by sending an army of their followers to heckle the Clintons with well-known accusations that Bill raped Juanita Broaddrick and others while Hillary covered it up.\\nIt took a wild turn yesterday when Hillary exposed herself and her history of anger management issues that several former Secret Service agents assigned to Hillary and White House staffers have detailed.\\nHillary Clinton’s temper flared Tuesday in Fort Lauderdale, Florida, when a protester interrupted her.\\n“Bill Clinton is a rapist!” the protester shouted as the audience began to boo him.\\nClinton’s attitude then changed like a flick of a switch and she became angry exposing that legendary behavior that Secret Service and White House staffers have alleged for years.\\n“You know, I am sick and tired of the negative, dark, divisive vision from people who support Donald Trump,” she screamed into the mic before the crowds uproar drowned her out.\\n“We are not going backwards, we are going forwards!” she yelled, pointing at the protester.\\n“So how do we do that? For the next seven days, we focus on what is important. Don’t get distracted. Don’t get diverted. Focus on the country and the world we want to help create,” she continued.\\nThe latest greatest craze has taken over Clinton’s campaign rallies for the past month since Infowars announced it’s contest and even though people are no longer being paid for their “services,” people continue to protest Hillary’s rallies calling Bill Clinton a rapist.\\nEarlier in October in Detroit, another protester a black man was wearing a Bill Clinton is a rapist t-shirt when Clinton confronted him turned around, and gave a gesture with her left hand extended and called for “someone” to stage an “intervention” on the protester. \\nWhile at another rally in October, violent “Democrats” who support Hillary Clinton beat up another Bill Clinton is a rapist protester . Bill Clinton is a rapist protesters even disrupted Obama’s North Carolina Greensboro rally for Hillary Clinton. Here’s the best of the Bill Clinton is a rapist protesters prior to October 9th.\\nWikileaks has even proven that the Clinton campaign was worried about Bill Clinton being a rapist and they were worried that a comparison would be made between Bill Cosby and Bill Clinton . Dozens of women suspected to be hundreds are alleged to have been raped by Bill Clinton. The latest rape revelation is an ex Arkansas reporter Leslie Millwee claims she was sexually assaulted by Bill Clinton three separate times. \\nBuy the new We Are Change t-shirt because you will enjoy shredding the Clinton News Network in public!\\n\\n \\nThe post “Bill Clinton Is A Rapist” Protester Makes Hillary Lose Her Mind appeared first on We Are Change .\\n'"}, "time": 1742562300.6886826}