{"duration": 0.0743875503540039, "input_args": {"text": "'Posted Monday, October 31, 2016 at 12:42pm EDT \\nLow cholesterol and its consequence \\n\\nPreviously, we have seen that cholesterol is a critical element of our cells and tissues (1). In addition, scientific evidence suggests that high cholesterol is not necessarily harmful, but offers a protective effect against brain disorders such as Alzheimer’s disease (2). At this point, we should ask the opposite question: what about if we have too little cholesterol? What are the consequences? \\n\\nWithout cholesterol, we would die! \\nIt is well known today that cholesterol performs several important functions in the body. One of the best important is not the most important function of cholesterol is to assist the proper regulation of the immune system. Indeed, people who have a low blood cholesterol have an anergic immune system, i.e. a lack of reaction by the body’s defense mechanisms to foreign substances (Vredevoe et al. 1998). In other words, your body cannot fight off pathogens, such as bacteria, viruses, parasites, and fungi. Without cholesterol, the different cells involved in an immune response (such as macrophages, lymphocytes, etc.) cannot recognize the invaders and destroy them. Interestingly, it was shown that the LDL particles are the ones needed for an adequate immune response (Masterjohn 2007). These particles neutralize microbes and toxins before they cause any damage to the tissues/organs. And we call these LDL particles bad cholesterol! Without them, we would be dead! Another fact is that a low blood cholesterol increases our risks of developing tuberculosis. \\nMore importantly, a sufficient supply of cholesterol to the immune system is critical to eliminate cancer cells. Indeed, cholesterol is needed to slow down the progression of cancer. In addition to cholesterol, saturated fats, like palmitic and myristic acids, are also necessary for an optimum immune system. These fats are found in tropical oil such as coconut oil. Would this fact explain why Asian people have a lower rate of cancer than North Americans? \\n\\nIs cholesterol protective not causative of heart disease? \\nThere is a tremendous amount of evidence to suggest that microbial infections are one of the primary drive force of plaque accumulation in the arteries of the heart (5, 6). In support of this, a lack of buccal hygiene considerably increases your risk of heart disease (7). Some researchers have noticed that people who suffered from a heart attack also had the flu a few days prior (8, 9). It seems that those microorganisms change the structure of the blood vessels leading to inflammation and an accumulation of plaques at the sites of injury. Based on this evidence, we can propose that cholesterol actually minimizes the risk of developing heart disease via the elimination of dangerous pathogens. Indeed, it seems to be the case (10). \\nIt is time to end this war on cholesterol. Science is very clear; cholesterol does not cause heart disease. On the contrary, cholesterol is a vital element of a vibrant health by making sure the immune system is strong, by being a critical component of vitamin D synthesis, by helping the body make sex hormones, among other functions.'"}, "time": 1742561851.5668905}