{"duration": 0.06651663780212402, "input_args": {"text": "'CANNON BALL, N. D.  —   The prairie is seething. Work crews are plugging ahead on the   Dakota Access oil pipeline, inching closer and closer to a river crossing that activists view as a critical juncture in their monthslong fight against a $3. 7 billion project that they say will threaten water supplies and that Native Americans say violates their right to sacred land. Last week, clashes erupted between lines of law enforcement officers and protesters. The air was filled with pepper spray and black smoke from burning tires. The authorities arrested 142 people during what local sheriffs denounced as a riot and protesters said was a peaceful demonstration. For months now, Mekasi Horinek and Deputy Jon Moll have lived these demonstrations, day in and day out. But they fall on opposite sides of the front lines, reflecting a community that is as divided as, well, oil and water. Mekasi Horinek, activist Mr. Horinek sees the pipeline protest from the rolling prairies, his arms locked with his fellow Native American activists to sing and pray. He sees tribe members standing up to years of racist slights and   treaties. He sees prayer circles, pipe ceremonies and a unifying fight for clean water. He is the son of Ponca Tribe activists from Oklahoma who took him to rallies when he was a baby. Mr. Horinek, 43, remembers riding on his father’s and uncle’s shoulders as they marched with Cesar Chavez in the California  ’ protests. “I can’t remember a time that I wasn’t being taught to stand up for human rights, native rights,” he says. He came to North Dakota for a cause. Here is how he describes that cause now: “What I said to the police officers when I was sitting down in a prayer circle, I asked them, ‘Don’t you drink water, too? ’” he says. “Don’t your children drink water? We’re here to protect the water. This isn’t just a native issue. We’re here protecting the water, not only for our families and our children, but for your families and your children. For every ranch and every farm along the Missouri River. ” Law enforcement officials have accused the protesters of rioting and attacking pipeline contractors, and they have arrested more than 400. But Mr. Horinek says the protesters  —   water protectors, they call themselves  —   are not the bad guys. He tells a story: Last week, he and 49 other demonstrators decided to link arms and sit together by the overturned earth where the Dakota Access pipeline is slated to go. They were on what the Standing Rock Sioux Tribe considers sacred ancestral land, but from a legal perspective, it is owned by the pipeline company. So sheriff’s officers arrested them for trespassing. Mr. Horinek says he and the others, including his    mother, were   and driven to the county seat, Mandan. He says he had bruises from being tied up so tightly, and from being thrown to the ground and pinned during his arrest. His mother and some of the older people were stiff and sore for days. Officials wrote numbers on their arms  —   his was 4838, he says  —   and held them overnight in cages in a parking garage, men and women separated by a plastic tarp. They spent the night singing and praying. “No matter what they do to us, they’re not going to strip our dignity, our honor,” Mr. Horinek says. “These are things we hold in our DNA, and we’ll never lose. ” The next morning, he bailed himself out of jail with money he had been keeping in his wallet in case he was arrested, and headed back to the camp.  Jon Moll, sheriff’s deputy  Deputy Moll sees the pipeline protest through a   windshield, his patrol car slipping along North Dakota’s gravel county roads. He sees    protesters occupying federal land and trespassing on private ranches. He sees tense confrontations, lost days off and threats to his fellow officers. He is the son of a Lutheran pastor, who moved the family from Ottertail, Minn. to Philadelphia. Mr. Moll, 38, remembers learning about the diversity of this country as the only white child in his class. “I’m the son of farmers, and we worked hard for everything we have,” he says. He came to Morton County, N. D. for work. Here is how he describes that work now: “Sometimes, the job sucks, but you do your job. It’s definitely been a strain. Every time we’ve been out, we’ve seen weapons. People screaming down this road at 100 miles per hour. Trespassing and squatting on federal property. If I wanted to build a house there, I’d have U. S. marshals knocking on my door, saying, ‘No, you can’t do that. ’” Activists have accused law enforcement of needlessly roughing up and   demonstrators, and of responding to their   and marches with militarized force. But Mr. Moll says the deputies are not the bad guys. He tells a story: Earlier this fall, about 70 demonstrators rallied at one of the ranches being bisected by the pipeline. Ranchers have grown angry and impatient with the protests and regularly come up to Deputy Moll when he gases up his car to ask him when it will all just be over. He says he sees the Standing Rock Sioux as neighbors and respects them, but he has a harsher view of what he sees as   protesters from outside North Dakota. “Folks are terrified,” he says. On this day, officials decided to move in and arrest the protesters for trespassing. As they did, some in the crowd started to yell, “Bring out your horses!” to their fellow activists who had parked their trailers in a field of winter wheat. From his patrol car, Mr. Moll says, he saw one of the horses charge directly at a line of officers, and he hit the gas and raced over to cut off the horse as another officer raised a shotgun loaded with beanbag rounds at the rider. “You run a   animal at a   person, that’s a deadly threat,” Mr. Moll said. “They were willing to use the threat of the horse against us, all the while screaming, ‘We’re peaceful protesters. ’” He has been working around the protests almost every day since, and expects to be on straight through to Thanksgiving.'"}, "time": 1742628345.7658515}