{"duration": 0.6958775520324707, "input_args": {"text": "'Why We Are Still In ‘The Danger Zone’ Until January 20th, 2017   17th, 2016 \\nDonald Trump is not the president yet, and Barack Obama could still do an extraordinary amount of damage during his last two months in the White House. Prior to the election, I described the period of time ending on January 20th as “the danger zone”, and my outlook has not changed just because Donald Trump was victorious on election night. As you will see, the next two months are an absolutely critical time, and if we can get through January 20th without something major happening perhaps we can breathe a little bit easier (at least for a while). On the other hand, the events of the next two months could easily plunge this country into a period of unprecedented chaos. A lot of people are feeling really good about things right now because of Trump’s victory, but now is definitely not a time to relax and let down our guard. \\nAnd the truth is that Donald Trump has not even won the presidency yet. As I detailed shortly before election night , the next president will not be determined until December 19th when the Electoral College meets. \\nOn Monday, December 19th the members of the Electoral College will gather in all 50 state capitals to cast their votes for president. It is then, and only then, that the next president of the United States will be elected. \\nThroughout our history, electors have followed the will of the people more than 99 perfect of the time, but there have been “faithless electors” before, and if Democrats can get enough of them to switch sides in December it is still possible (though not probable) that Hillary Clinton could win the election. \\nOne petition that is asking electors to switch their votes has already been signed by more than 4 million people. The petition claims that Donald Trump is “unfit to serve” as president, and that since Hillary Clinton won the popular vote by a wide margin she should be elected president instead. The following comes from a USA Today article entitled “ Could the Electoral College elect Hillary Clinton instead of Donald Trump? “… \\nA Change.org petition, now signed by more than 4.3 million people, encourages members of the Electoral College to cast their votes for Hillary Clinton when the college meets on Dec. 19. The petition argues that Donald Trump is “unfit to serve” and that “Secretary Clinton WON THE POPULAR VOTE and should be President.” \\n“If they all vote the way their states voted, Donald Trump will win,” the petition states. “However, they can vote for Hillary Clinton if they choose. Even in states where that is not allowed, their vote would still be counted, they would simply pay a small fine – which we can be sure Clinton supporters will be glad to pay! We are calling on the Electors to ignore their states’ votes and cast their ballots for Secretary Clinton.” \\nPersonally, I don’t believe that this is going to happen. They may be able to flip a few electors, but the gap in electoral votes is almost certainly too wide for the Democrats to overcome. \\nHowever, that is not the only concern we are facing. Ever since his victory on November 8th, there have been a multitude of violent threats against Donald Trump and his family. And without a doubt, there are a lot of very powerful people that would be very interested in finding a way to keep Donald Trump from getting to Inauguration Day. So let us pray for his safety and for the safety of his family. \\nIf Donald Trump were to be incapacitated after he wins the Electoral College vote on December 19th, Mike Pence would take his place. \\nBut if something were to happen to him before December 19th, his electors would be free to vote for another candidate – including Hillary Clinton. \\nIf everything goes smoothly and Donald Trump successfully makes it to Inauguration Day, he could be facing one of the biggest political protests in United States history. \\nIn an article for The Most Important News , I showed that the far left is calling for thousands upon thousands of protesters to descend upon Washington D.C. on January 20th in order to disrupt the Inauguration festivities as much as possible. \\nThis giant protest is being organized by the usual suspects, and they have already put up Facebook pages , websites , and the hashtag “#DisruptJ20″ is being widely used all over social media. \\nTraditionally Inauguration Day is a day of joy and celebration, but the far left seems intent on transforming it into a massive riot. \\nLet us hope that they are not successful. \\nAnother reason why we will be in “the danger zone” over the next two months is because of what Barack Obama may choose to do at the United Nations. \\nNow that it looks like Donald Trump is going to be our next president, the international pressure on Barack Obama to do something at the United Nations regarding the Israeli-Palestinian conflict before the end of his term has become even more intense. \\nAnd this is something that Trump and his advisers are actively concerned about. In fact, I came across an article earlier today that discussed the fact that the Trump team is warning Obama “against making moves on the Israeli-Palestinian conflict in his last months in office” … \\nSaying that pushing agendas “contrary to the president-elect’s position” would not be in the “spirit of the transition”, Trump national security advisor for Donald Trump last week warned the Obama administration against making moves on the Israeli-Palestinian conflict in his last months in office. \\n“On big, transformative issues where President Obama and President-elect Trump are not in alignment, I don’t think it’s in keeping with the spirit of the transition…to try to push through agenda items that are contrary to the president-elect’s positions,” the advisor told Politico . \\nSpecifically, the concern is that Obama may decide to support a UN Security Council resolution that would officially recognize a Palestinian state, set the parameters for a “two state solution”, and establish East Jerusalem as the capital for the new Palestinian state. \\nJust a few weeks ago, an article in the Wall Street Journal entitled “ Obama’s Israel Surprise? ” reported that this is one of the options that the Obama administration is strongly considering right now. A UN Security Council resolution would be legally binding on both Israel and the Palestinians, and it would be something that President Trump would not be able to undo. \\nThe rest of the UN Security Council is eager to support such a resolution, and so the decision about whether this resolution is going to happen or not sits in the hands of Barack Obama, and at this moment we do not know what he is going to do. The following comes from an article by Leo Hohmann … \\nThe Wall Street Journal reported one week before Tuesday’s election that Obama had requested his aides provide him with a list of options to deal with the decades-old Israeli-Palestinian conflict. \\nIsraeli diplomats, according to the WSJ story, are preparing for the possibility that a lame-duck President Obama “may try to force a diplomatic resolution for Israel and the Palestinians at the United Nations.” \\nThe president is presumably now reviewing those options, which number about half a dozen. \\nHe may be preparing to recognize a Palestinian state at the U.N. before he leaves office , WSJ reported. \\nIf Barack Obama decides to divide the land of Israel at the United Nations, it will be the worst decision of his entire presidency. I have warned repeatedly that all hell will break loose in America if it happens, and it will also mean that many of the events that I warn about in my latest book are much closer than many had been anticipating. \\nBut if we can get to January 20th and the land of Israel has not been divided yet, we may be able to rest easy for at least a little while, because Trump has already said that he would not support a UN Security Council resolution that forces a solution on the Israelis and Palestinians. \\nWhen politicians are going to do something that they know people won’t like, they tend to try to sneak it through around the holidays when a lot of people aren’t paying attention. For example, yesterday I discussed how the legislation that created the Federal Reserve was rushed through Congress right before Christmas in 1913 . \\nSo keep an eye on the period around Thanksgiving and the period around Christmas. If Barack Obama is going to stab Israel in the back, it may happen during one of those times. \\nMy hope is that we can get through January 20th without anything going seriously wrong. If that happens, I know that I will be very thankful. \\nAnd as I detailed in a previous article , Donald Trump will be 70 years, 7 months and 7 days old on his first full day in office on January 21st, and that will happen in year 5777 on the Hebrew calendar. \\nCould that be a sign of better things ahead as many believe? \\nOr will the next two months set off a chain of events that will be absolutely disastrous for this nation? \\nI believe that this is an absolutely critical moment in our history, and let us hope that our leaders make the right decisions. \\n“Danger Zone” Brings back memories of Kenny Loggins and Top Gun. anonymous \\nListen to her howlin’ roar Metal under tension Beggin’ you to touch and go Highway to the Danger Zone Ride into the Danger Zone Headin’ into twilight Spreadin’ out her wings tonight She got you jumpin’ off the deck And shovin’ into overdrive Highway to the Danger Zone I’ll take you Right into the Danger Zone William Lutz \\nI will not celebrate the holidays this year! Screw Christmas and New Years already. anonymous \\nGood on you. Why support corporate mandated holidays anyway? Thanksgiving should be the most important celebration. We should also celebrate the day of the dead. A solemn reminder of what the future holds for us all. Besides, their parties are awesome! Ricardo \\nWe should also celebrate the day of the dead. ………. that is spiritism. \\nKing Saul tried to bring up the dead (Samuel) via the witch of Endor………. don’t mess with spiritism \\nLet the dead bury the dead ..Matthew 8:22 …… meaning if you have no spiritual life you are dead so let the dead bury the dead. \\nHalloween. October 31st. What date did Martin Luther nail the 95 thesis to the church (catholic) door ? …… October 31st. Halloween is the catholic church playing with spiritism and fostering it on the world via the disguise of “its just harmless fun”…….. don’t mess with spiritism. anonymous \\nI meant more of a remembrance of loved ones who have passed away. You are painting with a broad religious brush. What is God? Isn’t God a Spirit? What do you know of death? Have you died? You are clearly biased. df NJ \\nGod is unknowable force that motivates the electrons to move and have charge. Without God, time would cease to exist. Paul Benson \\nWrong again df NJ (Dumb Friend from New Jersey?) God has gone to great extremes to make himself knowable. When Jesus died on the Cross the veil of the Temple was torn by god from top to bottom as a sign the way into his presence had been given. Put your faith in Jesus, follow his teaching, and that path will lead you to the Father and eternal life. YOU CAN KNOW GOD! Mondobeyondo \\nMerry Hallothanksmaskwanzaanewyear! nick \\nI am a political atheist, just to set the record straight. Although I visit this site fairly often, it is showing signs of paranoia and provoking fear. When George W. as elected, there were many protesters, they were just hidden away in “free speech” zones. Of course there are many unhappy people, as there were in 2000, and every election. Trumps votes were less than 19% of the 325 million people in the country. Will Trump bring jobs. No, not unless they are gov’t employees, or funded by taxes. There is only one way jobs are created, and that is when there is demand for products and services. A lot of people with their low paying jobs can hardly afford the basic necessities, let alone keep playing the consumerism game. I cannot see Obama doing anything that requires legislation, as he is lame duck status now. Perhaps this site needs to focus on the swamp getting filled with more careerists, especially lobbyists I have been an expat for over 6 years, it is a lovely peaceful warm day here. Think I will go for a bicycle ride, then a dip in 86 degree seawater. I do have faith that not much will change and the sun will continue to rise, even when it is obscured by clouds. Peace and Love…it is the only way df NJ \\nObama’s big political move will be to appoint an ultra liberal judge to the bench during the recess. I just can’t imagine that he doesn’t leave office without punishing the Republicans for not taking Garland. And given all the threats to taking away all of Obama’s legacy this is the only thing left he has to make his mark on history. Rick \\nI don’t think he can do that with a phone and pen. Sorry. HeyAHuman \\nCould you imagine the pandemonium that would ensue if the Electoral College were to vote Hillary in? Then we’d be in a REAL danger zone… Mondobeyondo \\nYes, it would be. It would be like the Krakatoa volcano erupting again. df NJ \\nThat is not going to happen because the electors hate Hillary as much as you do. It would be like cutting off one of your own fingers with a kitchen knife. I think we are okay. anonymous \\nIt always amazes me that people will look for signs in anything. Remember the world was going to end in the year 2000? Then again in 2012 with the end of the Mayan Calendar. \\n“Uncertainty is the only certainty there is, and knowing how to live with insecurity is the only security.” \\n-John Allen Paulos df NJ \\nIt’s 11/18 and still no second coming of Jesus. Every single person reading this and posting on this board is going to be long dead and gone before Jesus returns. James Staten \\nYou just fulfilled prophecy, and you don’t even know it. https://www.biblegateway.com/passage/?search=2+Peter+3%3A2-4&version=KJV Jerry C \\nNo longer need to look for signs as they are happening whether or not you’re looking. By the way, 2000 & 2012 were LSM saying it was ending. I guess for you the fact Trump will be 70 years 7 months 7 days old on his first full day of office is coincidence? You see coincidence; believers see signs. ISA41:10 \\nLiberals have long since gone beyond Activism, and descended to mobs all acting like spoiled children, stamping their feet and screaming, “I want it NOW!” It’s the politics of juvenile delinquency. \\nTo be a liberal means you must lie, deceive, deflect and, as a last resort, attack a conservative. \\nLiberalism is godlessness. df NJ \\nYou only criticize and hate on other people’s character what you do not like about your own character. \\nOtherwise, if you are able to meet people as being sacred then all you have remaining is unconditional love and acceptance of other people’s flaws. \\nWhere does civility come from if not from having respect for opposing opinions? ISA41:10 \\nThe election is OVER!!!! These demonstrations mean nothing. These are bunch of winy liberals breaking laws. Did Conservative do these childish things in 08 or 12. \\nN ! \\nI wonder what Obama’s “Pardon List” looks like! JC Teecher \\nJesse “james” Jackson, a pawn for the left, is pushing hard to have hitlery pardoned for all her crimes, before she is even charged. As a crook himself, he has received a free pass because of his so called “religious” connections. Bull caca! Occult religions maybe. Mondobeyondo \\nYes, there is still a possibility that Hillary Clinton could still get in the Oval Office. But a Trump presidency is pretty much a done deal (knock on wood). The Secret Service had better guard him and his family VERY closely. From what I’ve seen and heard, President Obama is trying to make Trump’s transition to the presidency very peaceful and orderly (even though they hate each other). Let’s hope that Trump’s presidency will be a successful one, and that it heals the many divisions and other issues that plague our country. Back in 1985, I bought a brand new book called “The Art of the Deal” at my college bookstore. It was written by some guy named Donald Trump. Yes, I actually did read it. df NJ \\nNot a chance. Hillary is dead and gone. Mondobeyondo \\nBarack Obama is actually liberal enough to sign a resolution that would divide the land of Israel. Donald Trump would have to be pressured by outside forces to make such a decision. Would he do it? Don’t know. Although from what I’ve heard, President Putin of Russia likes Trump a lot… df NJ \\nWe dropped 23,000 bombs on five predominately Muslim countries in 2015. Maybe it’s time to give the Yinon plan a rest and stop bombing ragheads for Israel. \\nAmerica first! We have way too many problems and debt in this country to continue our foreign policies of American adventurism. Where’s Pat Buchanan when you need him? I think it’s time we return to a more traditional conservative approach to foreign policy. The long war does absolutely nothing to make me feel safer on the streets of Newark or Jersey City. I say eff ’em. America first! TheLulzWarrior \\nWho f***ing cares? Israel is not an US state so far, they would simply refuse to go along such a plan. Paul Patriot \\nFreedom loving Americans (should) know what needs to happen if hitlery is said to be el presidente on December 19th. \\nThe left can whine, shout, protest and riot……its time freedom loving Americans get the right mind set about standing up to tyranny……and apathy, passivity, fear and political correctness will prove ineffective. \\nThe liberty tree is getting mighty thirsty…..just saying! df NJ \\nThere are many forms of freedom. You criticize the left but you just don’t understand it. Here’s how the left thinks: \\n“An old English judge once said: ‘Necessitous men are not free men.’ Liberty requires opportunity to make a living – a living decent according to the standard of the time, a living which gives man not only enough to live by, but something to live for. \\n“For too many of us the political equality we once had won was meaningless in the face of economic inequality. A small group had concentrated into their own hands an almost complete control over other people’s property, other people’s money, other people’s labor – other people’s lives. For too many of us life was no longer free; liberty no longer real; men could no longer follow the pursuit of happiness. \\nAgainst economic tyranny such as this, the American citizen could appeal only to the organized power of government. ” \\nYou many not agree with this approach but ALL the evidence shows wealth inequality is at all time highs. Most of you right wingers claim we have too much socialism and communism in this country. The sad fact is we cannot be further way from communism and still have a currency with any shred of value. \\nBut do not fear. Every year the top 1% become richer and richer. Every year the middle class is driven deeper and deeper into poverty wages. Marx said laissez faire capitialism is always followed by communism because unfettered greed would result in a government’s currency collapse. Once the currency collapses people in bread lines will DEMAND more government not less. \\nSee you in the breadlines comrades! хорошего дня JC Teecher \\nIt is fairly evident that B Hussein Odrama is spewing his NWO rhetoric and propaganda overseas, as he attempts to assume the role of the world’s authoritarian. He was handpicked by the biggest Nazi since Hitler, behind the scenes, as in GHW Bush. Odrama was chosen by the underworld as a successor to GHWB, and billery. \\nWhy? To fulfill their occultic destiny of the Beast System of Gov, Religion, Education, and Economics. The four hidden Dynasties. also viewed as Die-Nasty, if one is part of it. \\nAnything is possible in the next two months, and with the huge amounts of $$ invested into continuing an evil empire, the underworld/shadow gov, will use any and all means to make their plans come to fruition. \\nAll we as Christians can do is prepare for the worst, and pray for the “will” of God, to become manifest for His purpose, pleasure, and fulfillment of the end of days, of this age. \\nThe time of the fulfillment of a 100 year generation since the planting of the Fig Tree/ House of Judah, in Israel, is drawing nigh. \\nChrist said the generation that sees it (nation of Israel) replanted in the Covenant land, will also see His return. Glory glory Hallelujah, we might just get out of this world………alive. Not fly away in a pre-trib rapture (trap), but change in the twinkling of an eye, here, in this earth, to be a part of the “Kingdom come, on Earth as it is in Heaven”. df NJ \\nWe just need to stop dropping bombs on ragheads and God will shower us with blessings. Guns or butter, choose. You get one or the other. Black \\nWow. I hope there is such a place as hell so scum like you can burn there for eternity Jerry C'"}, "time": 1742561626.249959}