{"duration": 0.06655335426330566, "input_args": {"text": "'Update: Madonna told Us Weekly in a statement that she is not planning to adopt two more children. [“I am in Malawi to check on the children’s hospital in Blantyre and my other work with Raising Malawi, and then heading home,” she said. “The rumors of an adoption process are untrue. ”  Original story below: Blantyre (Malawi) (AFP)  —   US pop superstar Madonna appeared in person at a court in the Malawian capital Lilongwe on Wednesday to apply to adopt two more local children, a court spokesman told AFP. Madonna, who runs a charity called Raising Malawi in the southern African nation, adopted Malawian children David Banda in 2006 and Mercy James in 2009. Local media reports said the singer appeared before Justice Fiona Mwale amid tight security, accompanied by two unidentified children and several other people, before being driven away in an SUV vehicle. “The court is looking at the application now to determine whether Madonna can adopt these two children,” said Mlenga Mvula, spokesman of the Lilongwe High Court. “The  …     process requires the court to make a ruling on the adoption. ” She also inspected her charity’s work, including progress at a surgical unit for children at the Queen Elizabeth hospital in the commercial capital Blantyre. It was Madonna’s first visit in nearly two years to Malawi, where she has at times been embroiled in controversy after her earlier adoptions.  —   Adoption controversy  —   She was stripped of VIP status by former president Joyce Banda’s government in 2013 and accused of being “uncouth” and wanting eternal gratitude from the impoverished country for adopting the two children. But Banda was ousted in 2014 elections and the new president, Peter Mutharika, moved to repair relations, saying “my government has always been grateful for the passion Madonna has for this country”. Last July, Madonna said she would not revive plans for a $15 million academy for girls in Malawi, which was cancelled amid allegations of mismanagement  —   leading to her tiff with Banda. The singer, who divorced film director Guy Ritchie in 2008, reportedly landed in Malawi by private jet and was staying at a exclusive lodge outside Lilongwe. Madonna, who has four children, is reportedly among the biggest individual donors to children’s projects such as orphanages in Malawi, which is ranked by the UN Human Development Index as one of the world’s 20 least developed countries. On Saturday, she made an unannounced appearance in Washington at a rally protesting against US President Donald Trump a day after his inauguration. Madonna had campaigned for Hillary Clinton to become America’s first woman president, and told Billboard Magazine after the Democrat’s loss that women had a “tribal inability” to accept a female president.'"}, "time": 1742561868.8017757}