{"duration": 0.07380056381225586, "input_args": {"text": "'in: General Health Every once in a great while, a perfect child is born. One who never cries, sleeps all night, and gladly eats whatever food you choose to put in front of them. But unfortunately for most of us with children, developing lifestyle habits, such as a healthy appreciation for nutritious fruits and vegetables, usually requires years of continual work. New information recently released by researchers at Michigan State University’s College of Nursing helps to shed some light on the problem of establishing healthy dietary preferences in young children, and more importantly, may help both parents and medical professionals find more effective ways to approach it successfully [ 1 ] . Does Your Diet Really Affect Your Child’s? In order to better understand the connection between mother’s dietary habits, and those of their children, researchers questioned almost 400 low-income women from all over the state with pre-school-aged children then currently enrolled in educational head start programs. They found that the children whose mothers ate fewer than four servings of fruits and vegetables per week were less likely to consume the recommended number of servings themselves. Perhaps more interesting, was their discovery that children who were viewed as “picky eaters” by their mothers were also likely to consume an inadequate number of servings per week, regardless of the mother’s own dietary habits. This has led the researchers behind the study to speculate on improved methods for encouraging better eating habits in children. Many nutritional specialists have become increasingly focused on making healthy foods appear fun and therefore more appealing to kids. And while a certain amount of progress has been made following this approach, it is far from a stand-alone solution. Tips for Being a Better Influence for Your Child’s Diet In today’s busy world, it’s easy to fall into a routine of serving your family convenience foods — especially when dealing with young children and toddlers, whose taste buds can be very difficult to please. Still, the importance of developing smart dietary habits early in life cannot be overstated. Without a balanced and varied diet, growing bodies don’t get the vitamins and minerals they need to thrive. By focusing directly on the food choices of mothers, experts may be able better influence the diets of their children. This is likely due to a combination of positive modeling and increased access to more nutritious foods. There’s more to it than just working a few extra vegetables into dinner. (Although cooking meals at home instead of eating out every night is a smart first step for some.) Make sure that fresh snack options are also readily available for those in-between bouts of hunger. Not only is this better for your family’s health, replacing pr-epacked commercial snack products with seasonal organic fruits and vegetables or raw nuts and seeds is a great way to save money in the checkout line. Parent’s of so-called “picky eaters” should also keep in mind that some children may need to be exposed to a given food as many as 15 times before they are able to decide whether or not they like it. So don’t give up just yet on convincing your little one that broccoli is good. In the long run, it’ll be worth the effort. References: Jill Vondrasek, Jason Cody. Mothers’ diets have biggest influence on children eating healthy . Michigan State University. 2010 December 14. Submit your review'"}, "time": 1742562058.143767}