{"duration": 0.3108561038970947, "input_args": {"text": "'Email \\nNovember 3 rd is around the corner. This day of the year may or may not mean something to you. I consider it is a sad day for poetry. On this day 13 years ago the poet of Dagestan, Rasul Gamzatov, left our world. Born on September 8, 1923, Gamzatov is not only the “People’s Poet of Dagestan”, he is the poet of the people who love poetry, nature, home, language, and beauty. In his prolific writings, Gamzatov showed that if we know the place where we come from intimately, we will have enough stories to tell for the rest of our lives. He taught us that it is only by telling stories and paying attention to others’ stories that we truly live. From the remote villages and treacherous mountains of Dagestan, Gamzatov wrote poems and stories whose words are like loaves of bread to feed the hungry. His rhythms like raindrops falling on the endless deserts of the deprived souls. His depth and clarity like clear spring waters from the melting snows of the mountaintops of Dagestan. Some of his poems turn me into a bleeding red rose, a singing wind on a long lonely night, a thunder loudly objecting every form of oppression on this planet. Others silence my vocal cords and sets free a stubborn tear hanging on the corner of my eye. With his stories, I turn into a bird, into a short-lived wild flower on the side of a mountain rock, into a shiny distant star on a silent and cold winter night. Is it a coincidence that Gamzatov died in 2003, the same year Iraq, the land of poetry and beauty, was occupied and turned into rubble and ashes? \\nThe poet arrived to this world in the Avar village of Tsada in the north-east Caucasus. The name of the village means “fire” in the Avar language, which reflects his own poetic fire that was neither tamed nor domesticated nor put out throughout the 80 years of his life. His poems capture the human soul that is like nature: powerful yet also fragile and delicate in other ways. As children of nature, we are capable of doing so much, yet Mother Nature can crush our arrogance in a blink of an eye. Gamzatov understood our delicate existence that can easily be crushed by the cruel rocks of reality. Yet our only bet is on our souls that enable us to fly high and far away. Reminding us of our strengths and weaknesses, he wrote: “Hit a bird with a stone, the bird dies. Hit a stone with a bird, the bird dies.” \\nThe son of the well-known bard, Gamzat Tsadasa, Gamzatov from the early years of his youth showed an extraordinary passion for Avar stories, myths, oral traditions, village songs, and everything the people of the mountains cherished and held dear and sacred. His intellectual character is best captured in a version of an old saying that many mountain peoples worldwide recite: “One should only kneel down in two cases: to drink clear water from a spring, or to smell a wild flower.” This profound expression reminds us of the role of the intellectual in a world where everyone and everything is up for sale. Intellectuals can only kneel down to drink from the spring water of knowledge; or to smell a wild flower whose scent would set their imagination free. If we kneel down for any oppressive power even once, we may forever be cursed, crippled, paralyzed, and perhaps never able to stand up on our feet again. Gamzatov tells us that he first picked the seeds of poetry from his mother’s songs in the cradle. He picked the fire of poems from his father who loved reading and writing poetry, in addition to working long and harsh hours in the fields. From an early age, he was determined to capture the stories of his people to show the world that poetry transcends languages, human differences, and all artificial borders. He once recalled his father, Tsadasa, reacting to one of his early poems: “if you rummaged in the ash, you might find at least a glowing amber.” \\nI am sad to report that there is an embarrassing absence of the translations of Gamzatov’s writings, particularly in the English language. This negligence is itself a form of censorship of works that may potentially humanize and change how we think about other people and cultures who inhabit our planet. Great works of literature from other places are not only censored by banning them, but even more so by silencing them, by refusing to translate them in the first place. Marginalization is the worst form of censorship and intellectual assassination. Likewise, choosing what gets translated into a certain language and what gets marginalized is a form of shaping and constructing the historical memory of a place according to whims of those who own the money and means of knowledge production. But since the “politics of translation” is not the subject of this article, I will spare you more details lest I distort this poetic atmosphere. To commemorate the 13 th anniversary of Gamzatov’s death, I would like to take you on a journey in one of his most poetic books of all time titled My Dagestan . The book, originally written in the Avar language, was first translated into Russian in 1967. Since then the book has been translated into many languages. For those interested, the only English translation I was able to find is one from 1970, published by Progress Publishers in Moscow. In this article, I will use the Arabic translation first published in Damascus, Syria, in 1984, to share with you some of the countless gems Gamzatov leaves us with in this masterpiece. \\nFrom the very opening of the book, Gamzatov treats the reader as a “guest” who, upon entering his home, shall hopefully leave as a long-lasting friend. He opens it with what he titles “Instead of an Introduction”. From the early pages, the poet creates a harmony between writing and his beloved Dagestan. He writes that ideas and emotions are like mountain guests: they come without invitations, without prior notice, and there is no way for us to hide or escape from them when they arrive. In the mountains, there are no “important” or “unimportant” guests. The youngest of guests are equally important and honored even more than the oldest person in the household, simply because they are guests . We receive guests at the doorstep without asking them “where are you from?” We take them to the center of the house and seat them on the pillows, near the fireplace. Gamzatov adds that guests in the mountains appear suddenly and unexpectedly, but they never surprise us, because we are always waiting for them. We wait for them every day, every hour, and every minute. And “like a mountain guest, the idea of this book came to me.” Elsewhere he writes: “I want to write a book in which not the language follows the grammar, but the grammar follows the language.” \\nQuoting from his notebook, the poet shares with us how in Kolcata (formerly Calcutta) India, while visiting the house of Rabindranath Tagore, he saw a drawing of a bird that doesn’t exist in reality. That bird was first drawn in Tagore’s imagination. Yet if Tagore hadn’t had seen and observed so many different birds that do exist, he would have never been able to draw his own bird. Gamzatov calls it “Tagore’s bird”. To him, this is how writing about the self, the place you love, and the others is also done. In fact, originality and original thinking, in a sense, are like Tagore’s bird: they are unique and never seen before. Yet they can only be created after seeing and observing so many different types of birds that do exist in reality. This is why, Gamzatov insisted that his book be titled My Dagestan , because just like the bird he saw in Tagore’s house was “Tagore’s bird”, so is the Dagestan in the book “Gamzatov’s Dagestan”. It is not, he adds, because Dagestan only belongs to him, but because the way he sees, imagines, and perceives Dagestan is different than any other person on earth, especially when seen through the eyes of transient visitors and tourists. In this sense, Gamzatov reminds us that our homes, our languages, our mountains, and everything we love dearly need a lifetime to be known and a lifetime to be forgotten. \\nLater he writes that everything around us is potentially a piece of gold or silver. But silver and gold don’t mean anything in themselves. What is important is that the crafter has skilled hands to turn them into something meaningful and beautiful. This is precisely how the stories we hear, see, and experience in this world can be turned into meaningful writings. Here he cites a phrase he once saw engraved on an old jar that read: “the most beautiful jars are made from clay. The most beautiful poems are written with simple words.” \\nOn a different page, he reminds young writers that writing takes so much patience and perseverance. He then cites a phrase he once read on an old door in one of Dagestan’s villages which read: “Don’t break the door! It can be opened with its key!” This, to him, is the type of patience a young writer needs to learn how to open different doors through different words, different styles of writing, and through patience. He advices young writers that rather than asking for a specific topic to write about, they should ask for a set of eyes that can recognize and capture topics worth writing about. In this way, the poet is telling writers that instead of thinking of themselves as “magicians” who can change the world in one piece of writing, they are really more like farmers who plant the seeds of their alphabet not knowing on which hearts and minds they shall fall and grow into new wild lives. Gamzatov then goes on to remind us that just as it is hard to determine whether it is the feelings that generate music or is it the music that generates feelings; it is equally hard to determine whether it is the writer who produces the writing or the other way around. \\nGamzatov’s appreciation for poetry and writing that spring out of the deepest point of knowing the self after demolishing all walls with others is deeply connected to the Avar culture and myths. He shares that the Avar people have an old myth stating that the poet was created 100 years before the world was created, as though they are saying that had the poet not participated in creation, our planet would not have been as magnificent as it is. This is why poets and writers must never compromise themselves. The only way to do so, he writes, “is to always be yourself in every single word you write.” As usual, the poet draws on a village tradition to illustrate the point. He cites the tradition of mountain villagers who, before entering a wedding, usually ask: “is this gathering complete, or do you still have a space for me?” The wedding holders usually respond: “Come on in if you are you !” And “in this book,” Gamzatov writes, “I want to prove that I am me !” \\nIn a section titled “Genius”, the poet writes that even if humans get to know all the secrets on this earth, nobody will ever know what “genius” really is, what is its source, how is it shaped, and how does it grow over time. Genius people are also different from one another, for if they were similar, they would cease to be called so: “I have seen so many faces like my father’s face, but I have never recognized in any of them the genius like that of my father,” he writes. He then adds that, fortunately, genius is not inherited, for if it was, it would be like a royalty passed from one royal family to another, from one rich family to another. Indeed, “it is not unusual for an idiot to be born out of a wise person, nor a child of an idiot to turn out wise.” \\nIn the second part of the book Gamzatov begins another journey to introduce us to his love and attachment to his hardly known mother tongue, the Avar language. To him, this deep love and connection with this language is precisely what makes him able to appreciate every other language, land, mountain, plain, and valley on this planet. He shares that a poet can and should in fact be able to speak to all people, regardless of their languages. For Gamzatov, the destinies, dreams, and pains of all people can be carried in a single heart—the heart of the poet. Yet poets don’t actually write poems for each single heart on the planet, nor do they write for every single love, every single smile, or every single teardrop. Poets write about themselves only. But it is only when the boundaries between the self and the other are demolished that the poet will be able to at once write for nobody and for everybody. \\nPerhaps not surprisingly, following a long chapter on the “mother tongue”, as My Dagestan nears its end, Gamzatov dedicates a good part of the book to mothers and how the first lullabies and songs they sing to us shape and provide us with enough love and inspiration to face the harshness of this world for the rest of our lives. He wonders whether “cowards” are those people whose mothers didn’t sing for them in their cradles. Perhaps those who betray others are people who have forgotten the songs their mothers sang for them in their cradles. The poet is deeply aware of what it means when a mother—or any loving woman in her place—sings for us our earliest songs and tunes. He writes “a mother’s song is the beginning and the source of all human songs. It is the first smile and the last tear.” Considering how the early tunes and the early songs shape our intellect, cognitive abilities, and literary and poetic selves, it is significant that Gamzatov would emphasize the role of mothers’ songs that teach us how to be in love with everything beautiful around us. He writes that there are songs mothers sing when the child is born, others they sing when they lose their child, and yet others they keep singing long after their beloved children are gone. In this way, poetry for Gamzatov is neither words nor music nor the human senses that receive them. It is the encounter between language, music, and the senses. After reciting numerous stories about the power of singing that, to him, far exceeds the power of swords and weapons, he insists that songs can change the world and save countless lives. His words in this section remind me of a very old saying from the Arabian Peninsula which asks us to beware of mingling with people who don’t love music; to beware of people who don’t like and don’t know how to sing. \\nGamzatov left us in 2003 but he left behind a treasure in the form of poetry. He left us prose even more poetic than his poetry. From the magical and tough mountains of Dagestan, he wrote in the Avar language and spread so much love and poetry for so many people who aspire to be human before anything else. After all, one of his favorite inscriptions he saw on a tombstone read: \\nHe was no sage, \\nBut bow to him: \\nHe was a man. \\nIn My Dagestan , Gamzatov writes that the people of the mountains were asked why they built their villages so far away, blocked from others, and secluded by all these mountains. Villagers were told that in residing in these mountains, it is impossible to reach them given the dangers of the road. The villagers responded: “Good friends will reach us without worrying about these dangers. As for bad friends, we don’t need them anyway!” Gamzatov was keen throughout his life to record many inscriptions he came across on old doors, gates, tombstones, and mountain rocks in Dagestan’s villages. In two memorable inscriptions about “guests” he writes: \\nCome, hillfolk, please knock! \\nWe’re well. If we’re not, \\nYour coming shall cure us! \\n* \\nDon’t knock, don’t rouse the household, \\nYou who pass this way! \\nIf good you bring us, enter! \\nIf mischief, go away! \\nIt is hard to end an article about Gamzatov as much as it was hard to start it. I first read My Dagestan when I was an undergraduate student at the University of Baghdad. This year I had to reread its 550 pages to share some of its vivid images and poetic jewels with you. As soon as I finished rereading the book, I felt sad and empty, because the poet indeed fulfilled his promise: I entered the book like a passing mountain guest and here I am leaving it as a dear friend to the poet and to all the remote villages and people he writes about. Gamzatov’s mountains and magical scenes resemble northern Iraq and remind me of everything and everyone I loved and loved me. It reminds me of all the letters I have received over the years from friends who cared about me, friends who betrayed me, and others who still renew their vows of love and friendship in my life every day. \\nI close the book with great sadness because, in a strange way, it makes me ask the same old questions always secretly lurking in the back of my head or circulating in my bloodstream like an incurable virus: do we only realize the meaning of all things, people, and places that we love after they are no more? Do we always put the people, things, and dreams that truly matter to us aside like storing a precious item in a closet, hoping naively to come back one day to find them as we left them? Is it the big paradox of life that we don’t master the art of living until it is nearly time to depart? After all, Gamzatov himself was quoted saying shortly before his death: “My life is a draft I wish I had the time to revise.” Oh, my friends, I know I should not end on this sad note. Perhaps to truly celebrate Gamzatov’s poetry and life, I should end exactly as he ended My Dagestan in the translation I am holding now in my hands: “We are finished. It is time to separate. And, as they say, we shall meet again. God willing.” \\nLouis Yako is an Iraqi-American poet, writer, and a PhD candidate of cultural anthropology researching Iraqi higher education and intellectuals at Duke University.'"}, "time": 1742562056.6153092}