{"duration": 0.16921567916870117, "input_args": {"text": "'AMONA OUTPOST, West Bank  —   Thousands of Israeli police officers stormed this hilltop settler outpost in the occupied West Bank to raze nine illegally built homes. Settlers and their supporters hurled cinder blocks at the officers, who charged on horseback and beat protesters with batons. The homes were torn down, but 300 people were injured and the emotional scars ran deep. Some later called it a pogrom. That was a decade ago. Now the residents of Amona are readying for another battle with their own government and security forces, trying to thwart an Israeli Supreme Court order that the entire outpost be dismantled by Dec. 25. Barring an   compromise, organizers expect up to 20, 000 sympathizers to move into Amona, where 40 families live in prefabricated homes and trailers, to resist a forced evacuation. “I will sit down on my backside with my arms folded,” said Avichay Buaron, a lawyer who moved to the outpost a few months after it was established in 1996. “Thousands will sit down,” he added. “If they hit us, they hit us. ” A flagship of the settler enterprise, Amona is becoming a test of how far Israel’s   government will go to avoid a clash with its constituency and how vested it is in more than 100 outposts built without authorization across the West Bank. It is forcing Prime Minister Benjamin Netanyahu to balance the demands of his conservative coalition partners, the state’s judicial authorities and world leaders, who overwhelmingly view the settlements as violations of international law. The Obama administration on Wednesday condemned Israel’s plan to build 98 housing units east of Shilo, a settlement a few miles north of Amona, which are meant to accommodate the outpost’s evacuees. In an unusually sharp statement, the State Department said the plan, which Israel described as a new neighborhood of Shilo, was “deeply troubling” and would “create a significant new settlement deep in the West Bank. ” In the years since the bloody 2006 confrontation in Amona, the West Bank settler population has grown to nearly 400, 000 from about 250, 000. Support for removing settlements as a route to peace has dropped among an Israeli Jewish public jaded by failed negotiations with the Palestinians, recurring violence and the widespread perception that withdrawing from the Gaza Strip in 2005 only fomented terrorism. Mr. Netanyahu’s government has been working to retroactively legalize dozens of settler outposts that sit on public land. But Amona was built on privately owned Palestinian land, where Israel’s own judiciary insists the state cannot simply   construction. “It puts the government in a very uncomfortable spot,” said Yoaz Hendel, a former aide to Mr. Netanyahu who put the current impasse down to the inertia of successive   governments on the issue. Amona sits at the top of a narrow asphalt road winding up from Ofra, a vibrant settlement of about 3, 300 religious Jews near Ramallah, the Palestinian administrative capital. The outpost is strategically perched 3, 000 feet above sea level, with commanding views of the central West Bank, which the Palestinians envision as the heart of their future state. Mr. Buaron, who came as a student in his early 20s, said Amona’s founding residents were told at the time that the government wanted to set up a new neighborhood of Ofra. “We did not come as thieves in the night,” he insisted. “We were pioneers. ” Mr. Buaron married and had seven children in Amona, where his home has a slightly unkempt garden and a view of a picturesque Palestinian village in the rolling hills beyond. Now he is leading the campaign to save it. Leafing through a bound folio of maps, photographs and documents from the outpost’s early years, Mr. Buaron pointed out how the state helped provide its infrastructure: a   power line, Housing Ministry plans to prepare 40 plots for permanent homes, a road. If there are legal flaws in Amona’s location, he argued, it is up to the state to find a solution that would allow its residents  —   lawyers, teachers, a computer programmer and farmers who grow raspberries, olives and grapes or who raise sheep  —   to remain in place. The settlers are pushing for legislation that would force Palestinian owners to accept compensation rather than get their land back, arguing that the current legal strictures could be applied to thousands of settler homes beyond Amona. The attorney general has already ruled out that option, but 25 of the 30 Parliament members from Mr. Netanyahu’s Likud Party nonetheless signed a petition backing it last month. The Amona leaders have publicly rejected the idea of relocating to the alternative site on what the government declared to be state, or public, land near Shilo. In a letter addressed to Mr. Netanyahu and posted on  Facebook, they wrote, “We have nothing to lose. ” The prime minister’s office declined to comment on the options for Amona. Israel’s   defense minister, Avigdor Lieberman  —   a settler himself  —   has said that the outpost cannot remain where it stands. Oded Revivi, the chief foreign envoy of the settlers’ Yesha Council, said he still hoped the government and the residents could “find the middle ground. ” They have had plenty of time. The Supreme Court ruling, which followed more than a decade of legal wrangling, came in December 2014. The Palestinians who petitioned the court are now watching from the towns and villages in the surrounding hills. Atallah Abd   Hamed, 63, a resident of the Palestinian town of Silwad, said that he and his three siblings inherited an   plot on the edge of Amona from his father. “It was all grapevines,” he recalled. The family has not worked the land, where a single settler home sits, since the 1980s. Mr. Hamed said that was because the only access to it was through Ofra and, in any case, the grapes went bad from disease. Accusing settlers of setting fire to his fields soon after the blight, he said, “Within 10 minutes everything was black. ” If Amona is removed, as the court has mandated, Mr. Hamed said, “I am going to plant it all again with apples and almonds. ” “Not grapes,” he added, as if the vines would be somehow cursed. Mr. Buaron, the Amona leader, said there was nothing stopping Palestinians from coming to work their land, but Mr. Hamed’s wife, Nihad, 56, expressed a widely held fear. “They would shoot us,” she said, noting that an unarmed man from Silwad was killed by Israeli soldiers in August. “I wouldn’t send my sons. ” In a feverish search for a compromise, Israel’s attorney general has been examining the possibility of leasing to the settlers plots adjacent to Amona whose Palestinian owners appear to have abandoned. The Israeli military’s custodian of abandoned West Bank lands placed an advertisement in   in the Palestinian newspaper   along with a map, asking anybody claiming ownership to submit objections within 30 days. The United States State Department denounced that approach, saying it “would represent an unprecedented and troubling step that’s inconsistent with prior Israeli legal opinions and counter to longstanding Israeli policy to not seize private Palestinian land for Israeli settlements. ” Michael Sfard, an Israeli lawyer who represented the Palestinian landowners in the Amona case on behalf of the Israeli human rights organization Yesh Din, said this was an inversion of the Military Order of 1967, when the occupation began, meant to protect abandoned property until its owners returned. “If the army has a duty to preserve abandoned property,” he said, “is this the best way it can think of, giving it to people who are not ready to leave it and who have already shown that they have no problem with violating the property rights of others?” Alan Baker,   of a 2012 government report that recommended authorizing settler outposts built on public land, agreed that “privacy is holy” when it comes to property rights. But contrary to Mr. Sfard, Mr. Baker argued that absentee land “is placed in the hands of the government to use and enjoy the same way as public land,” as long as it remains registered as absentee property. Abdallah Abu Rahmeh, a Palestinian Authority official who focuses on settlements, saw the Israeli debate as hairsplitting that obscures the depth of the occupation. “It is not up to Israel to determine where each piece of land is going to go in our own country,” he said. In any case, Yesh Din, the Israeli rights group assisting the Palestinian landowners, said objections had been submitted regarding the “vast majority” of the plots. One is from Maryam Hassan Abd   Hamad, 81, of Silwad, whose husband, now dead, passed his property on to their six children. “The lawyer once told us they wanted to give us alternative land,” Ms. Hamad said, sitting in a domed room in her family’s compound, where chickens were running around in the yard. “We refused. We were raised there,” she said, reminiscing how her family would plant grains one year and vegetables  —   tomatoes, cucumbers, zucchini, okra  —   the next. “We put the blood of our hearts into our land. ” Rivka Nizri, who was born in Amona 18 years ago and was married late last month, has set up her home in a trailer that she and her new husband renovated in the outpost. She said she was trying not to think much about the possibility of being ousted before the end of the year. “I won’t go easily,” Ms. Nizri said of the impending evacuation. “They will have to take me. ”'"}, "time": 1742564365.653544}