{"duration": 0.1767899990081787, "input_args": {"text": "'Print Email http://humansarefree.com/2016/11/red-alert-war-on-alternative-media-has.html Reports about Facebook’s and Google’s nascent battle against purported “fake news” must be considered in solemn gravity — not because there are bogus articles circulating — but because, in actuality, it constitutes a war on legitimate, factual information and dissenting opinion. Certainly, many of us grumble when an article about aliens invading New York City passes through our newsfeeds only to be taken seriously — but the so-called “problem” of “fake” news Facebook’s Mark Zuckerberg is referring to isn’t targeting such vapid content. What Facebook will target, however, should concern all of us. After the absurdity that was the 2016 presidential election, Hillary Clinton supporters and establishment Democrats excoriated Zuckerberg for dereliction of duty in failing to remove sham news articles and sites from his wildly popular platform — because, in their eyes, this putative “fake” news literally swung the election toward Donald Trump .But this seemingly hapless campaign of finger-pointing — the Clinton camp also railed against FBI Director James Comey, among many others, in their search to blame anyone but themselves — has nothing at all to do with inane articles of no worth. Rather, the new war on “fake” news is simply a poorly-disguised attempt to quash legitimate information unfavorable to the liberal establishment’s agenda — for good. This perilous course of blanketing, State-sponsored censorship marks what might be the most overarching effort to kill dissenting opinion in decades — perhaps approaching or exceeding the height of the Red Scare and McCarthyism. Here’s why: Mark Zuckerberg, a known proponent of establishment narrative and supporter of liberal goals, originally responded to this criticism somewhat rationally, saying the actual percentage of imposter news items is so miniscule, it could not possibly have affected the outcome of the election. He’s right. Or at least, he was. “Of all the content on Facebook, more than 99 percent of what people see is authentic. Only a very small amount is fake news and hoaxes,” the Facebook head wrote in a post to his site on Saturday. “The hoaxes that do exist are not limited to one partisan view, or even to politics. Overall, this makes it extremely unlikely hoaxes changed the outcome of this election in one direction or the other.” After the failed Clinton campaign turned and targeted Zuckerberg and Facebook with its bitter wrath of loss, he abruptly switched his tune — and a plan is now underway for how to “cope” with this “fake” news [non] “problem.” It’s imperative to consider several points concerning Facebook’s burgeoning war — with over one billion users worldwide, no staff would be large enough to combat reports of fraudulent news that will undoubtedly be rolling in soon. So, the plan? Artificial intelligence — a self-teaching algorithm to identify and remove the supposedly counterfeit news items, and likely relegate the source as a Scarlet Letter verboten site. But an issue of grave concern has already arisen before the war on fake news even gets off the ground. Business Insider boasted in a headline “It took only 36 hours for these students to solve Facebook’s fake-news problem”— but there’s a serious problem. Their algorithm failed. Miserably. In fact, one of the two items touted by Business Insider as proof of the success of the spurious news-slaying algorithm can be proven factually true — nearly verbatim — on the government’s own website. According to Business Insider, the four students from various top universities participated in a recent hack-a-thon at Princeton University — which Facebook co-sponsored . In a mere 36 hours, they created an extension for the Chrome browser to ostensibly identify and parse out whether suspicious items constitute legitimate, truthful news, called “ FiB: Stop living a lie .” “It classifies every post, be it pictures (Twitter snapshots), adult content pictures, fake links, malware links, fake news links as verified or non-verified using artificial intelligence,” one of the students told the outlet. “For links, we take into account the website’s reputation, also query it against malware and phishing websites database and also take the content, search it on Google/Bing, retrieve searches with high confidence and summarize that link and show to the user. “For pictures like Twitter snapshots, we convert the image to text, use the usernames mentioned in the tweet, to get all tweets of the user and check if current tweet was ever posted by the user.” Appearing smug in the article’s lead picture, Nabanita De, a second-year master’s student in computer science student at UMass Amherst; Anant Goel a freshmen in Purdue University; Mark Craft, a sophomore at University of Illinois at Urbana-Champaign; and Catherine Craft, a sophomore also at the University of Illinois at Urbana-Champaign, all believe they’ve discovered the quick fix to Zuckerberg’s [now] problem. As an example, the extension identified and marked an article “not verified”; but the article, a report touting findings from the National Cancer Institute which appeared on the government’s National Institute on Drug Abuse site —“Marijuana Kills Cancer Cells, Admits the U.S. National Cancer Institute”— isn’t fake at all. From the government’s site , with emphasis added: “NIH-funded and other researchers are continuing to explore the possible uses of THC, CBD, and other cannabinoids for medical treatment. “For instance, recent animal studies have shown that marijuana extracts may help kill certain cancer cells and reduce the size of others . “Evidence from one cell culture study suggests that purified extracts from whole-plant marijuana can slow the growth of cancer cells from one of the most serious types of brain tumors. “Research in mice showed that treatment with purified extracts of THC and CBD , when used with radiation, increased the cancer-killing effects of the radiation.” Beyond this one example, and much further to the point, the Democratic establishment is leading the call to abolish “fake” news — a blaring alarm bell for anyone paying attention this election cycle. A trove of published leaked emails and documents by Wikileaks concerning the Democratic National Committee, campaign chair John Podesta, and Hillary Clinton , proved a staggering degree of corruption and collusion undertaken for years by establishment insiders and corporate media, which, for all intents and purposes, amounted to an attempt to throw the election in their favor. As the campaign came under heavy fire from all sides, Clintonites were quick to shift blame and try to discredit the mountainous evidence of wrongdoing — first by blaming Wikileaks for trying to throw the election, then by claiming the information being published was fake. Except it wasn’t. For nearly the entire duration of its existence, Wikileaks has offered a prize of several hundred thousand dollars for anyone who can prove even a single document it published isn’t authentic . And that bounty, though challenged from time to time, remains unclaimed. And now the outgoing Democratic party wants to initiate a war on fake news? Nothing to see here, folks. “Everyone has the right to say what they want, have access to sites that they want, share what they want,” Obama and Democrat Party insider , Teddy Goff, told Politico — which, incidentally, starred in several damning emails for colluding with the Clinton campaign. “But a publisher with a record of making stuff up is not likely to rank that highly on Google, and the equivalent ought to be the case on Facebook. […] “Two, three weeks ago, many of us are beginning to talk about what a big problem this is, both from the campaign and from the administration, and just sort of broader Obama orbit, and are talking about, this is one of the things we would like to take on post-election. “This is something we were very aware of, saw zero percent chance Facebook was going to be compliant or work with us during the election, but wanted to take on post-election.” Recall the aforementioned and justifiable doubt Zuckerberg originally expressed about the nonexistent “problem” of “fake” news — and consider Goff told Politico these ostensibly false news items posted to Facebook painted ‘Clinton as corrupt, criminal or otherwise beyond the political pale.’ In fact, evidence of corruption, media collusion, and highly questionable, if not explicitly criminal, activity now mar Hillary Clinton’s legacy as Secretary of State and 2016 Democratic nominee — not because of bogus reporting. There was no need for fake items, and — although a few websites certainly blew points out of proportion — the emails, themselves damned Clinton’s campaign. Thus, the liberal establishment’s war on fake news — for which the head of the largest social media platform has now been roped in — amounts to little more than a witch hunt to silence truthful, but damaging, information. Information vital to the American public, imperative for making informed choices, and indispensable if this nation is still to be characterized as maintaining even a shred of freedom. Employing failed algorithms — or even people — is a hopelessly flawed solution to a problem that simply doesn’t exist. And what will result is a war on alternative, independent media and opposing thought — in all forms. Considering the insidious, wholly one-sided nature of this plan, it would be errant not to draw parallels to a new McCarthyism. Indeed, independent media websites likely did help turn the election away from Hillary Clinton — not by posting inane, false garbage, or slanted reporting — but by having the integrity to post the truth about her dealings behind the scenes. And, where corporate media failed in journalistic integrity and due diligence, alternative sources — led by Wikileaks — excelled. Had the same vault of information surfaced about Trump, alternative media would have had the same field day — and that’s where the Clintonites have it all wrong. Fake news — dissenting opinion, opposing viewpoints, a free press — none of that tilted the election. Unless, of course, by fake news they are referring to corporate media’s submitting articles to the Clinton campaign prior to editors, or Hillary insiders collaborating on articles so ensure the ‘right’ angle was employed — or any of the examples proven in leaked documents. Nominating Hillary when a veritable revolution erupted behind Bernie Sanders, however, did. It would behoove them to turn tail, learn the lesson, and walk away, instead of imposing a blanketing and unnecessary campaign of censorship against “fake” news when the truth is a bitter pill to swallow. Meanwhile, the Mainstream Media has been caught faking news countless times, which had serious consequences worldwide:'"}, "time": 1742563537.9064035}