{"duration": 0.16350173950195312, "input_args": {"text": "'By Les Visible on November 1, 2016 Reflections in a Petri Dish — Nov 1, 2016 Dog Poet Transmitting……. It’s one week until the ‘to be hijacked elections’ are supposed to take place. It stands to reason that at some point in the next seven days a bombshell, or several bombshells, are going to go off in the American political landscape. I do not know what these will be composed of. One of them will certainly have to do with the emails but I don’t know what shape it will take. I suspect that the Trump camp has got some things up its sleeve but they want to wait until no amount of following spin will possess the amount of time necessary to undo the damage. I feel pretty confident saying this. I have this strong impression that the Trumpsters are sitting on some seriously damaging information. You’ve got to love The Apocalypse in times like these. The latest news is that Huma Abedin is seeking immunity . How real all of this is , I don’t know. When I read things like Hillary has a predilection for underage girls, it makes me scratch my head. It isn’t like I put anything past these people but sometimes I get the feeling people are reaching and more than willing to believe anything whether it is true or not. I’m not saying it isn’t true, what I am saying is that, “I don’t know.” Still, there is a lot of chatter going on about the emails and sundry. Suffice to say that we can be certain there is a lot more known by those in a position to know than we are being told. I have been feeling a certain uneasiness for two days now. I’ve no idea what it pertains to but I feel sure something is about to rise to the surface and it is going to be significant. There are so many agendas at work and many who are employed by our oppressors and abusers have had it with the Satanic behavior of their employers. I don’t know what we are looking at but it’s “hour has come round at last.” We are definitely living in interesting times. There are so many ways to look at the state of the world in this period. If you are a Satanist, a materialist, an atheist, a fear driven entity, or any permutation of similar perspectives, it is either, as Dickens put it; “the best of times and the worst of times.” On the surface it certainly has the appearance of being a time for plunder or flight. On the one hand, those orchestrating or promoting the chaos are confident that they can steal and murder at will, under the darkness being generated for that purpose. On the other hand, certainly some amount of people are looking for a place to weather the sum of their fears. They want some place to hide. I don’t know where that might be. Maybe they do. Many are already in that bunker mentality with all those guns and footstuffs. Certainly the agents of the dark side have got their boltholes put together. None of these folk have a plan for anything Lady Nature may come up with. For myself, I know that the almighty is screening a movie that was written out of the combined destinies of every life form on the planet. This has been going on for such a length of time that no human mind can measure or comprehend the extent of it. No human mind can comprehend the extent of one go round of Yugas; a Kalpa, whut is that? It doesn’t matter what anyone thinks it is. All that matters is what it really is and the essence and detail of that has been long known to those so informed of the warf and woof of the process. It was all delineated back in the time of the Rishis. The nature of existence and the protocol of existence were all mapped out and remain to the present for any inquiring mind to peruse at their leisure. Of course there are and will be many arguments to the contrary. The separated human mind is capable of endless arguments, depending of what that separated mind wants to realize out of it. It is of no importance to me what others wish to believe. All that is important to me is what is true. I make no claims to be in possession of this information. What I can say is that I have been convinced of the divine architecture of existence and it is only important for me to recognize this and seek to align myself with it. Experience has proven to me that when I go along with the inner voice and rely on the certitude of the presence of the ineffable, things go well for me. When I rely on my own imperfect awareness of circumstance then I find out what is what and what is not. It is never an easy thing to talk about what one only has a partial understanding of. It is next to impossible to discuss the ineffable when it exists forever beyond the parameter of words. This is the telling argument for Faith. “Faith is the substance of things unseen.” We are here to find ourselves and nothing more. Surely we can give our time and attention to all manner of pointless exercises and some of them have a long enough shelf life as to seem convincing to many. The evidence of the life successes of those who have prospered in the material world stand as examples for the ambitious and those who believe that, “he who dies with the most toys wins.” This is certainly not true. It wouldn’t even be true if there were no invisible hierarchy or worlds beyond this one. If you are dead forever then what is the point of the toys? The good and bad news is that this is not a one time event; life on this Earth. The cyclicity of Nature is consistent in all of its productions and an unwavering theme of justice and balance runs through the whole. Richard Dawkins can roll out all of his specious arguments, as can the rest of those whose primary intention is to kill our faith, or provide justifications for bad behavior, as is the motive behind the machinations of all those Tribe representatives, who work to bring about the managed chaos that is the ongoing game plan of their dark master. If it gets intense or seems hopeless at times, this is all permitted for the purpose of seeing what we will do in such moments. The witness watches and the actors perform. Strive always to keep the goal uppermost in your mind. The bumps and bruises, the treacheries and disappointments of this world are temporary. The possibilities and potential are everlasting. You will become the sum total of your investments. You will be representative and emblematic of what you put your Love and industry into. It matters not if it took you all this time to find out what the right road was. It matters not if you made a passel of mistakes in your time of ignorance. I am living proof that redemption awaits, without respite, for so long as you remain here and the opportunity to try again, should you fail and fail and fail, will always be there. You can make remarkable strides right from the point at which you sit in this moment. You can rouse yourself with an optimism that you may have not previously believed to exist. Extreme measures of physical effort are not required of you. We are talking about mental work and the ability to stand guard at the gateway of the mind. Anyone who has attempted this has discovered that it is not easy. This is why people chant. This is why people seek to pray without ceasing. This is why people attempt to practice the presence of God. All the many disciplines are for this single purpose. My version is to ‘cast out thought’. Then what is permanent in the mind, prior to all thought, will reveal itself given a consistency of effort in this respect. Then… in the emptiness of that place, I get to say, “I love you, I love you, I love you,” over and over and over. For each of us the time required will vary. You have to be equal to what is necessary for you. Ultimately there is only one thing you need to remember; if you do not quit, you cannot fail. It doesn’t matter what Hillary does or what Trump does or all those thousands of people who pass you by in the supermarkets and department stores, on the sidewalks and in the park, on the highway in their cars, or who populate the astral plane when you dream. It only matters what you do and which, of all the desires that come and go in your being, is uppermost in your mind. Once you can reduce the chatter of all those unimportant desires, the power invested in your single greatest desire will increase to impressive proportions. Once you can concentrate so that all other thought is excluded from your focus, you can accomplish amazing results. ‘Concentration is the secret of the magical art’…. “All magic lies in the will.” I am not here to promote magical enterprise. My understanding of and application of this dynamic is much different than the common understanding of the medium which, works equally for good or ill, depending on the intention of the practitioner. My employment of magic- should that even be the correct term- is to come into the presence of the ineffable and nothing else. So… I suppose it wouldn’t be magic really but… the results… should one succeed, could certainly be called magical. End Transmission…….'"}, "time": 1742563245.651275}