{"duration": 0.05713343620300293, "input_args": {"text": "'It’s the sort of story that only feeds existing suspicions that the upcoming presidential election is being rigged to install Hillary Clinton in the White House regardless of the true vote count. \\nVia TruthAndAction \\n\\nIt strikes directly at the heart of the integrity of our election process and has the potential to cast doubt on the legitimacy of candidates who are declared the winners. The story in question appeared on the Infowars website, and while some of the details cannot be confirmed, it’s worth a look .\\n\\n\\nElections in the United States do not have a perfect record of being free from attempts to manipulate the results through fraud. As reprehensible as that may be, it’s not entirely unexpected considering what’s at stake. Aggressive efforts to insure the integrity of our elections and the prosecution of those who would corrupt them are essential to giving the winning candidates the legitimacy they deserve.\\nAll of this has the potential to go out the window this year as accusations of voter fraud through the manipulation of the counting of the ballots are already rampant.\\nA recent story appearing on the Infowars news site claims to show that one TV station is already preparing to announce a Clinton victory.\\nA NBC station was caught posting election results showing a Hillary Clinton victory days before the election, fueling concerns that the mainstream media is conditioning the public to accept a rigged election favoring Hillary.\\nPolitical activists discovered a hidden web site for WRCB out of Chattanooga, Tenn. showing election results with Hillary Clinton securing 343 electoral votes and 42% of the popular vote.\\nThe web site originated from the FTP server of WorldNow, a media software company that provides real-time data – such as election results – and other media assets to local news stations.\\nIt’s important to note that although Infowars claims that the site is a “hidden site for WRCB,” we at Truth and Action could not independently verify this . Note that Infowars states that this “hidden web site” is located in Chattanooga, Tennessee. A search of the domain name returns Ohio as the location where the domain name was registered, although that is not conclusive either as to the actual location where the site is maintained.\\nEven with these doubts about the authenticity of the web site under discussion, this news will do nothing to instill confidence, but will be one more factor furthering the suspicion and lack of trust surrounding the integrity of this year’s presidential election.\\nIn fact, it dovetails nicely with the “fractional” method of counting the votes previously reported.\\nElection fraud expert Bev Harris was the first to uncover this method, which is also known as “vote shaving.”\\n“You need to have votes counted as fractions,” Harris said on The Alex Jones Show Monday. “You need the votes to be counted with decimal places, like you count money.”\\n“If a vote is a dollar, you also need to have cents with it. That will not show. It’s hidden.”\\nVote shaving works by treating votes as decimals rather than whole numbers, which allows the machines to allocate the remaining fractional percentages elsewhere to sway election outcomes.\\n“There’s this one central computer, which at the end of the day, all the votes come to it,” Harris pointed out. “That’s where you take it. You don’t run around to 5,000 different precincts. You wait until the votes come to you, and then you have your way with them.”\\nAll of this is incredibly troubling. One ray of hope is that if there really is a concerted effort to rig the vote for Hillary, that the Trump campaign is vigilant and prepared to take all legal measures to expose any vote fraud and insure that the ballots are counted accurately resulting in a decision that truly does represent the will of the people.\\nSource: Infowars \\n'"}, "time": 1742564563.2065501}