{"duration": 0.04841184616088867, "input_args": {"text": "'Women are not just sexual objects you pigs. Just remember that when they trot out the bejewelled boobs , wear the “ TaTa Top ”, or just want to “ Free the Nipple ” in the name of “empowerment.” Ms. Holliday has a message for the “pig” \\nFrom Daily Mail : Tess Holliday is using her platform as a model to speak out against Donald Trump and the allegations of sexual assault against him. \\nThe 31-year-old took to Instagram over the weekend to share an ad of herself posing in New York City’s Times Square while modeling a New Look Fashion T-shirt that reads: ‘Respect Women #Dump Trump.’ \\n‘Respect Women,’ she captioned the image. ‘Our bodies are not for you to stare at or touch without our consent. Women are not just sexual objects , women are not here for your consumption. So many of us have a sexual assault story, myself included,’ she continued. \\n‘To endorse someone who not just condones this behavior but actively engages in it would be an awful step backwards for women not just in the US but across the world. #dumptrump #dumptrump #dumptrump The feminist in action \\n‘Also might I add I’m NOT telling you who to vote for. Trump is a pig & that’s a fact. [sic]’ \\nThe photo, which was taken by her longtime partner Nick Holliday, sees Tess posed with her hands on her hips as she stares at the camera. Along with the white T-shirt, which features black block lettering, she is wearing ripped jeans and black high-heeled sandals. \\nThe photo has been liked more than 62,000 times since it was posted on Saturday, and unsurprisingly, the political statement caused a stir. \\n‘Love the shirt, Tess,’ one woman wrote. ‘Way to use your constitutionally protected voice. #activism #freedom #feminism.’ \\nAnd while many supported Tess’ statement, there were plenty of people who disagreed with her. ‘Such a shame to have to [unfollow] you,’ another woman wrote. ‘Use your celebrity for something better than being political.’ \\nThere was also a fierce debate about whether or not Tess’ post could be seen as an endorsement for the Democratic nominee, Hillary Clinton, and some people who disagreed with her statement attacked the size 22 model for her weight . \\n‘There is some super hateful stuff on here,’ one woman wrote. ‘I don’t agree or disagree with your position, but I still admire your message. Why can’t everyone get along! Dang! Everyone gets to have their own opinion people! \\n‘And targeting her weight because you disagree? Really? People are crazy, keep up your positive messages Tess! Whatever your political views are, I still love what you represent girl!’ \\nRead about the rest of this womyn’s rant here . \\nDCG'"}, "time": 1742562322.8815644}