{"duration": 0.24781274795532227, "input_args": {"text": "'When the actress Kate Hudson needed a sofa, she headed to Wyeth in SoHo for a vintage blue Dunbar by Edward Wormley. When the designer Tomas Maier needed a coffee table, he went there, too, and plunked down his credit card for a safety glass and   coffee table from Joe D’Urso. And when the Hollywood agent Bryan Lourd was in search of a new lounge chair, he picked out a black leather Papa Bear by Hans Wegner, also from Wyeth. With its   prices and enormous selection of Danish modernist pieces, the store is arguably the premiere   emporium in the United States. Its owner, John Birch, is also one of the most elusive, and talked about, dealers on the   furniture scene: a Larry Gagosian for the   set, with strong taste that did not just mirror the market but helped set it. Mr. Birch  —   a trim,      with   eyes and salt and pepper spackled hair  —   hobnobs with the Olsen twins (who featured an assortment of his furniture at the most recent presentation of their line, the Row) introduced Helmut Lang to his assortment of Wegner furniture and has recently been giving Jimmy Fallon advice on his Gramercy Park home. Sleek bamboo dining tables designed by Mr. Birch have become status objects owned by the likes of Gwyneth Paltrow and the entertainment manager turned real estate mogul Sandy Gallin. Mr. Birch’s girlfriend, Tiffany Vassilakis, is an accomplished interior designer who has worked with Carey Lowell and Richard Gere. Next Tuesday, Mr. Birch is expanding his footprint with a Sotheby’s auction of rare midcentury finds that could fetch upward of $1. 8 million. Later this month, he’s opening a    showroom on the ground floor of 533 Canal Street that’s a triumph of Wyethesque minimalism: exposed white brick walls, perfectly sanded cement floors, light fixtures from O. C. White and Isamu Noguchi, and a floating raw steel staircase  —   its 23 steps fabricated by hand and welded on site by Mr. Birch. Yet as movers came in and out on a recent afternoon, and a team from Sotheby’s prepared to photograph pieces for the catalog, Mr. Birch looked less like a furniture mogul than a boy whose toys were being taken away from him. He didn’t like having to move a prized George Nakashima coffee table (estimate: $20, 000 to $30, 000) out of the shot. And he didn’t like that a mosaic coffee table by Vladimir Kagan ($8, 000 to $12, 000) and Cippolino marble coffee table by Poul Kjaerholm ($7, 000 to $9, 000) had nothing on them. “I don’t understand the empty tables,” he said, peering around the room. “Nothing’s ever empty at Wyeth. ” A bulb in one of Noguchi ceiling lanterns had gone out and was becoming a source of real irritation. “I’m glad I have employees who realize the bulb has been blown out for two weeks,” he said sarcastically, climbing on top of a Hans Wegner desk so he could replace it himself. As can be surmised, Mr. Birch is a    sort of guy. He’s not mean, although he says so little and charges so much for things that people often presume he must be. But he is painstaking, meticulous and so focused on achieving a kind of aesthetic perfection that he can drive himself (and everyone around him) crazy. And in recent months, it’s not just neurosis keeping him up at night. The wealthy Brazilians who used to stream through his doors are largely gone, as their economy implodes and their president, Dilma Rousseff, awaits an impeachment trial. Gone, too, are the Brunello   hedge funders, who, as the art market shows evidence of a possible correction, are clearly less inclined to pay $50, 000 for a pair of Finn Juhl’s chieftain chairs. And then there’s 1stdibs. Once exclusive, the online site featuring modern and antique furniture, jewelry, fine art and other collectibles, has been ferociously signing up dealers who, as he puts it, “work out of storage lockers” in places like suburban Illinois with low rents, and don’t bother with the painstaking restoration for which Wyeth is known. The site is also increasingly aggressive about collecting commissions on the online sales, a practice Mr. Birch sees as  . Many of his Manhattan colleagues are already downsizing or folding up shop. Todd Merrill packed up his mirrored Paul Evans pieces and left Bleecker Street this winter for a location in the slightly more affordable financial district. In the fall, Alan Moss, the Art Deco purveyor, will close his Lafayette Street store and go online only. “It’s a last stand,” Mr. Birch said, reflecting on the current state of the   furniture market. “Retail is a terrible business. ” In fact, he sees his new showroom as a way of weaning himself away from 1stdibs. “I don’t want anything to do with them anymore,” he said. But how did it come to this, that one of the country’s leading purveyors of midcentury modern design should find himself in retrenchment, just as the market finds a wider audience thanks to sites like 1stdibs, not to mention knockoff manufacturers that hawk cheap imitations? John Birch (no relation to the Baptist minister who has a   group named after him) was born in Brigham City, Utah, the oldest boy in a Mormon family of nine children. “With only one mother!” joked his younger brother Paul, who as Wyeth’s principal woodworker builds many of the original pieces and oversees restoration of vintage finds. In the early 1980s, after attending Brigham Young University for a semester (“maybe half,” he said) Mr. Birch arrived in New York City, fell into the fashion business, and spent a decade bouncing around the display departments of Ralph Lauren, Tommy Hilfiger and Giorgio Armani. “He had an incredible eye and very defined taste,” said Gabriella Forte, who was his boss at Armani before becoming president at Calvin Klein and then chief executive of David Yurman. “He positions things with real talent. It’s pure simplicity. Is it minimalism? I don’t know if that’s how I’d describe it. It was just perfection. ” By 1994, Mr. Birch had had enough. So he leased a    space on Franklin Street in TriBeCa, named it for his then    son, Wyeth, and filled it with his favorite things. (Wyeth graduated from the Rhode Island School of Design last year and now works for the family business. Mr. Birch and Wyeth’s mother, Daphne, separated over a decade ago, though they never divorced. “It’s cordial,” Mr. Birch said.) Back then, TriBeCa was still in its infancy. Nobu had just opened and the majority of big antiques dealers had fairly narrow specialties like Biedermeier and Art Deco, which befit an earlier, fussier era. The novelty of Wyeth, said Robin Standefer, half of the design team Roman and Williams, was how Mr. Birch mixed things up, placing postwar Danish chairs with     gas light fixtures and   coffee tables from the ’80s. “He would take objects that were somehow considered less valuable, that didn’t necessarily have pedigree, and reassemble them in unexpected ways,” Ms. Standefer said. “He certainly educated American consumers to a kind of Danish design. But what I found most interesting is what he paired those things with. That’s what was different. That’s what was unusual. ” Soon, word spread about the   Mormon who talked little to his customers and charged a fortune for the coolest stuff in town. Ms. Standefer brought Ms. Paltrow, who bought pieces like $3, 000 lamps and the company’s $16, 000 bamboo dining table. When Ms. Paltrow started dating Ben Affleck, he also began shopping at the store. So did André Balazs, Richard Gere, Julianne Moore, Ben Stiller, Meg Ryan and David Bowie. Around that time, a woman with long blond hair began coming in regularly without ever saying hello or goodbye. “After five visits, she handed over her credit card,” Mr. Birch said. “It was Annie Leibovitz. ” Many of his famous customers did not even get discounts or a friendly smile. “He was not a pleasure to buy from,” Diane von Furstenberg said. “He really wasn’t. ” But instead of walking away, she (like many others) became a repeat customer, part of an elite circle that kept coming back even as they complained about the store’s outrageous prices and the way its owner barely seemed to grunt in their direction. As with most myths, the legend may not have been totally in sync with reality. Mr. Birch, it turns out, is actually shy, the sort of person who is more comfortable with beautiful things than beautiful people. And those that did try negotiating often got a bargain, particularly when he sensed a fellow design worshiper. Still, his untraditional approach to salesmanship had a reverse playback among a subset of people used to being doted upon: His lack of solicitousness made customers desperate to buy from him. “Part of his mystique was that he was elusive,” said Wendy Goodman, the design editor of New York Magazine. “When you went in and had an audience with him, it was a big thing. Because it was a question: ‘Were you worth it? ’” That’s more or less how Jessica Seinfeld, another person who came to Wyeth over the years, described the experience of shopping there. “Their taste is impeccable,” she said. “Every piece in their shop is ‘important’ in one way or another, so I respect their consistency, even their condescension. I find myself charmed by their lack of interest in human contact. ” Wyeth did go through rough patches, which often coincided with its expansion. It moved out of Franklin Street and into its current    home on Spring Street around the September 2001 attacks. And it opened a space in Sagaponack, N. Y. in 2008, just after the financial crisis hit. Casual customers presumed that Mr. Birch cared only about selling things at the highest price, but as Wyeth’s trove grew and grew, a different theory emerged among those who knew him best. Mr. Birch, they said, could not bear to be separated from his favorite things, so he began pricing them as high as possible so they wouldn’t sell. “He’s putting together a continuum of a design aesthetic, and to do that, he needs to own these things, touch them and feel them,” said Richard Barrett, his friend and landlord at 533 Canal. “Some might say he’s a hoarder. ” Mr. Birch didn’t exactly deny the thesis. “It’s true that I was never focused on money,” he said. “I don’t even get sales reports. I don’t ask for them. ” His idiosyncratic approach to business also extended to the new Canal Street store. When Mr. Birch first agreed to rent that space around 2008, he thought it would become a third Wyeth outpost, focused largely on his new productions. Then, renovations took years, as Mr. Birch slaved over every detail, while the market for midcentury modern furniture became more transparent and democratic, thanks both to 1stdibs and to Restoration Hardware, which recently introduced a modern collection of   tables called the Wythe collection. “It was hilarious,” Mr. Barrett said. “Even the typeface looked like Wyeth. ” (Restoration Hardware did not respond to a request for comment.) “When you educate people too well, which in a sense is what he did, they discover ways to sleuth the same objects,” said Ms. Standefer of Roman and Williams. That   market led Mr. Birch to call Sotheby’s this winter, and people there were happy to help Mr. Birch divest of what they viewed to be one of the best modern design collections in the world. “It’s one of the few sales I’ve conducted in my career where I wanted to buy half the things in it,” said Jodi Pollack, the auction house’s head of 20th century design. Perhaps predictably, Mr. Birch worked all the way to the wire, fussing over every imaginable detail the last furniture shipments arrived at the Canal Street showroom mere minutes before a party there on May 17 celebrating its opening and the coming Sotheby’s sale.   aficionados and fellow dealers began arriving around 7 p. m. streaming into a room of Kjaerholm tables, Finn Juhl chairs and new biomorphic,   mirrors by Mr. Birch. Longtime customers remarked on the high auction prices (including two Wegner easy chairs expected to fetch $60, 000 to $80, 000 each) while tattooed staffers told stories about the poor Sotheby’s photographer tasked with getting Mr. Birch’s portrait (he wouldn’t sit still, kept rearranging the furniture and smoked the entire time). True to form, Mr. Birch was hard to find. Wearing a pair of RRL jeans, a charcoal Comme des Garçons sweater and a dark Jil Sander blazer, he huddled in the back with the Olsen twins. They made a fitting trio, this reclusive   character and two women whose public personas have been built largely upon doing lots and saying little. But it was impossible to know what they were talking about because   Olsen quickly shut a reporter down. “Sorry,” she said. “We’re not giving any interviews. ” Nearby was Mr. Birch’s son Wyeth. “In my family, we don’t often express our appreciation for each other,” Wyeth said. “I don’t know how to put it because right now, I’m exhausted. But this is the first time in my adult life we’ve celebrated Wyeth. It’s tough love with my dad. ”'"}, "time": 1742562096.0737002}