{"duration": 0.11066317558288574, "input_args": {"text": "'Attorneys for David Daleiden and the Center for Medical Progress (CMP) have filed a motion requesting the disqualification of the federal judge who ordered videos showing abortionists discussing dismemberment of unborn babies to be removed from the Internet. [According to a motion filed in U. S. District Court in Northern California on June 7, the request for the disqualification of Judge William H. Orrick III is made “on the grounds that there is evidence of bias in favor of the plaintiff and prejudice against the defendants. ”  The plaintiff in the case is the National Abortion Federation (NAF) which claims the videos would endanger the lives of their abortionists. In the latest CMP video, which is a compilation of excerpts from video filmed at NAF trade shows, abortionists are heard discussing, amid laughter, the difficulties they face in their jobs, such as “the head that gets stuck that we can’t get out,” and “an eyeball just fell down into my lap, and that is gross!” At the end of May, Orrick censored any video links and references to the identities of NAF members. Following Orrick’s order, YouTube, Facebook, Vimeo, and LiveLeak deleted the video from their sites. In an interview with Breitbart News, Peter Breen, special counsel with the Thomas More Society  —   which represents Daleiden  —   said the motion is extremely significant. He explained: Bringing a motion to disqualify a federal judge is a very serious matter. It’s not something that you do lightly, but in view of the evidence that has now come to light, we, as attorneys are duty bound, at this point, to bring the motion to disqualify. In fact, it would be malpractice for us not to. We believe the law requires disqualification. Breen continues: Some of the evidence we’ve brought forward is that as recently as September of 2015  —   several weeks after entering the temporary restraining order in the NAF case  —   we’ve learned that the Good Samaritan Family Resource Center, which is interlinked with a Planned Parenthood affiliate that is a member of the National Abortion Federation  —   that they are holding out Judge Orrick as an emeritus member of their board. The National Abortion Federation  —   their allegations were there would be harm to their members  —   and, so, you’ve got an entity that is in partnership with a member that actually hosts one of the NAF members. Now you’ve got the judge being held out by that entity as part of the organization, as connected to it. The motion states the request for Orrick’s disqualification is based upon evidence contained in an affidavit by Daleiden: This includes Judge Orrick’s longstanding relationship as a past board member, and more recently as an emeritus board member, of an organization that has a “key partnership” with a Planned Parenthood affiliate that is a member of the plaintiff National Abortion Federation (NAF). Judge Orrick’s wife has also posted public comments, pictured with her husband, that are supportive of Planned Parenthood and critical of these moving defendants. For this reason, and the others set forth below, Daleiden and CMP respectfully request that Judge Orrick be recused from this case and that a stay be granted on all proceedings in this case until this motion is heard. The affidavit contains Orrick’s United States Senate Committee on the Judiciary Questionnaire for Judicial Nominees. In his responses to the questions, Orrick states, “I advised Good Samaritan Family Resource Center when it was unionized,” (p. 42) and “After returning to San Francisco in 1984  …    I assisted the Good Samaritan Family Resource Center on many legal issues from 1986 to 2009. ” (p. 44). The motion also cites Daleiden’s statement about Orrick’s wife, Caroline Orrick: I learned that, no later than the fall of 2015 Mrs. Orrick, “pinkified” her Facebook page and added the “I stand with Planned Parenthood” overlay across her profile picture. Planned Parenthood urged its supporters to add these elements to their Facebook pages as part of a social media campaign orchestrated specifically in response to the release of videos by myself and CMP. “Pinkifying” showed one’s support for Planned Parenthood and one’s belief that the videos were fraudulent. Just days ago, I further discovered that Mrs. Orrick “liked” a Facebook post by the National Abortion Rights Action League (NARAL) that described my and CMP’s work as “heavily edited videos by a sham organization run by extremists who will stop at nothing to deny women legal abortion services. ” The Facebook post also appeared to describe our videos as “domestic terrorism” against abortion providers. Mrs. Orrick also liked a Facebook Post by “Keep America  ” that applauded my indictment in Harris County, Texas, which was ultimately dismissed as invalid by two different judges. Both “likes” were accompanied by a profile picture featuring Judge and Mrs. Orrick. According to the document containing Orrick’s responses to the Questionnaire for Judicial Nominees, in June of 2009, Orrick introduced  . Kamala Harris ( ) at a fundraiser for her campaign at the time for her bid for the post of California’s attorney general [p. 23]. In addition, he states, “I raised money and sponsored an event for the campaign of Kamala Harris for Attorney General in 2009, before I joined the Department of Justice. ” (p. 31). Democrat Harris was elected California attorney general in 2010, barely defeating   Angeles district attorney Steven Cooley, a Republican, whose firm, Steven Cooley  Associates (SCA) now defends Daleiden and his colleague, Sandra Merritt, who have been charged with 15 felony counts under California’s law protecting “confidential” conversations. “  General, now U. S. Sen. Kamala Harris, wielded unprecedented police power against a true American journalist while civil suits were already pending in Federal District Court concerning the same ” says Cooley. “Public Records Act requests filed by SCA reveal the Attorney General’s real interest in this case is entirely political, meant to manipulate the law to do the bidding of their benefactors at Planned Parenthood. ” In September 2016, emails obtained by the Washington Times showed that   AG and U. S. Senate candidate Harris’s office collaborated with Planned Parenthood to produce legislation that specifically targeted Daleiden. The emails, according to the Times, were accessed through a public records request, and revealed conversations between officials of Harris’s office and Planned Parenthood regarding legislation that criminalizes undercover journalists for publishing and distributing recordings of private communications with abortion providers. On March 28, 2017, the new California Attorney General, Xavier Becerra, announced the criminal complaint charging Daleiden and Merritt with 15 felony counts against the state’s “confidentiality” legislation. Previously, Becerra was a longstanding Democratic congressman who received a total of $5, 535 from Planned Parenthood during his congressional election bids between 1998 and 2014, according to OpenSecrets. org. Harris is on record as having received $2, 600 in 2016 from Planned Parenthood for her Senate race campaign. Additionally, Harris was the recipient of $39, 855 from the Abortion    Rights lobby group, according to OpenSecrets. org. ElectionTrack. com reported Harris received $15, 000 from Planned Parenthood for her attorney general campaign bids.'"}, "time": 1742561834.9189963}