{"duration": 0.09194779396057129, "input_args": {"text": "'SHOCKING: Hillary’s Looking At Disaster & Anthony Weiner’s To Blame Posted on October 28, 2016 by Rebecca Diserio in Politics Share This \\nHillary Clinton just got hit with a huge roadblock by the FBI in her quest for the presidency, and things are looking pretty dire for her campaign and election hopes. However, the Clintons play dirty, and she won’t go down easily. Yet, in a crazy turn of events, it looks like the fall of Hillary Clinton is linked to none other than Anthony Weiner, and what’s been exposed now going to shock the whole world. Hillary Clinton (left), Anthony Weiner (right) \\nHillary’s campaign was rocked today by FBI James Comey as he announced the reopening of the investigation into Hillary’s email server and sending of classified emails. When Hillary spoke in Iowa after the huge announcement, she was delusional as she gave her prepared comments and said nothing about the FBI’s case against her. \\nAdding fuel to the fire, Clinton campaign manager Robby Mook did something pretty damning, just minutes after the Comey announcement. He deleted his entire Twitter feed and years of tweets that must have incriminated him in some way to Hillary’s email scandal. But, that’s not all. \\nFox News is reporting that the FBI found other emails from another government official, not from WikiLeaks but coming from an investigation into Anthony Weiner , which may indicate that his wife Huma Abedin, Hillary’s closest aide, is the link to the disaster Hillary is now facing: \\n“A senior law enforcement official separately told Fox News the FBI decision is not linked to WikiLeaks messages or any hack, and the newly discovered emails did not come from the Clinton server – but from another device from another government official.” \\nHillary doesn’t live in the real world very well, so she won’t go quietly, even though it’s pretty clear her campaign is probably over. Even when facing defeat against Barack Obama in 2008, she would not give up. \\nEven when it came to the battle for the Democratic nomination, Hillary Clinton refused to concede defeat until the bitter end and then past it. Not only did Hillary refuse to drop out even when Obama was the clear winner, while her people threatened a convention floor fight, but she insisted on staying on in the race for increasingly bizarre and even downright disturbing reasons. \\nIn South Dakota, Hillary explained that there was no reason for her to drop out because somebody might shoot Barack Obama, “We all remember Bobby Kennedy was assassinated in June in California.” [via Sultan Knish ] \\nEven after Obama had clinched the delegate votes, Hillary’s speech brought back the Al Gore argument that George Bush didn’t win the election in 2000, saying, “Nearly 18 million of you cast your votes for our campaign, carrying the popular vote with more votes than any primary candidate in history. Even when the pundits and the naysayers proclaimed week after week that this race was over, you kept on voting.” Robby Mook (left) deleted his entire Twitter feed after FBI re-opened email case, Huma Abedin & Hillary Clinton (right) \\nLook for Hillary, refusing to drop out of this campaign, and We the People need to put pressure on the FBI to conclude this investigation before Election Day. We cannot have a sitting president who will be going to prison, and yet, we know that Hillary Clinton will refuse to drop out no matter how dire this situation truly is. \\nThe mere fact that we all know she is guilty of sending classified documents makes her unfit to hold any political office ever again, and Americans must demand Hillary Clinton is held accountable. It’s time we take back our country and put Hillary in prison where she belongs.'"}, "time": 1742562011.9282594}