{"duration": 0.08275389671325684, "input_args": {"text": "'An NSA spy blimp known as the Hover Hammer, which can eavesdrop on civilians from above, was active in Maryland, according to a report by The Intercept. [“To residents of Maryland, catching an occasional glimpse of a huge white blimp floating in the sky is not unusual,” proclaimed The Intercept’s Ryan Gallagher on Monday. “But less known is that the test flights have sometimes served a more secretive purpose involving National Security Agency surveillance. ”  “Back in 2004, a division of the NSA called the National Tactical Integration Office fitted a   diameter airship called the Hover Hammer with an eavesdropping device,” he continued, adding that “The agency launched the   airship at an airfield near Solomons Island, Maryland. ” The blimp was reportedly referred to publicly as an “antenna mounting platform,” and comprises of a “  sphere inside another sphere, constructed of Spectra, the same material used to make   vests. ” “From there, the blimp was able to vacuum up ‘international shipping data emanating from the Long Island, New York area,’” Gallagher explained, citing a classified document published on Monday. “The spy equipment on the airship was called Digital Receiver Technology  —   a proprietary system manufactured by a   company of the same name  —   which can intercept wireless communications, including cellphone calls. ” In his report, Gallagher notes that, “Unsurprisingly, privacy groups have expressed concerns about the prospect of the blimps being used domestically to spy on Americans. However, military officials have often been quick to dismiss such fears. ” “In August 2015, Lt. Shane Glass told Baltimore broadcaster WBAL that the JLENS blimps being tested in Maryland were not equipped with cameras or eavesdropping devices,” he stated, before concluding that “The same cannot be said, it seems, of the NSA’s Hover Hammer. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628350.5807183}