{"duration": 0.06372451782226562, "input_args": {"text": "'President Donald Trump promised to move the U. S. embassy to Jerusalem, but a recent diplomatic spat showed why it has been so hard for him to do so. [On Monday, the Times of Israel reported that talks between U. S. and Israeli officials coordinating Trump’s upcoming visit to the Western Wall  —   the holiest site in Judaism  —   stumbled when a “senior American official” said that the area was not within Israeli control and was part of the West Bank.  That is the official position of President Barack Obama’s administration, and of UN Security Council Resolution 2334, Obama’s parting shot against the Jewish state. It is not clear who, exactly, the “senior American official” was, but Israel’s Ha’aretz identified the culpable parties as “diplomats stationed at the U. S. consulate in Jerusalem. ” The consulate is located in eastern Jerusalem and has long been regarded as more sympathetic to the Palestinians. (Update: The name of the official has since been reported as David Berns, a career bureaucrat at State.) The Trump administration disavowed that official’s view. But generally, it is difficult to overstate the degree to which the career bureaucracy disapproves of moving the U. S. embassy  —   and not just in the State Department. There are various reasons given, from possible prejudice to peace talks with the Palestinians, to repercussions in U. S. relations with Arab and Muslim countries. Still, it is difficult to distinguish the arguments against moving the embassy from the arguments against recognizing Israel in the first place. Already, the Trump administration has been grappling with the challenge of working with Obama administration holdovers in the bureaucracy who have not yet been replaced. Add to that the fact that there are members of the   “deep state” who are actively undermining the president, through leaks and other methods, and you have a formidable obstacle to progress  —   one to which Trump’s predecessors yielded, and which Trump alone can defeat. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742563506.1058507}