{"duration": 0.08681678771972656, "input_args": {"text": "'Ten years or so ago, as the actor Alec Baldwin remembers it, the gallery owner Mary Boone sent him an invitation to a show of work by the painter Ross Bleckner, an artist whom she represented and he had befriended. The card featured a reproduction of Mr. Bleckner’s “Sea and Mirror,” a work from 1996, when the artist was at the height of his popularity. So began Mr. Baldwin’s love affair with the painting  —   an infatuation that has ended with Mr. Baldwin, who occupies a central role in New York’s cultural life, now pitted in a bitter dispute with two formidable players in the city’s rarefied world of art and money  —   Ms. Boone, a prominent art dealer, and Mr. Bleckner, one of her notable talents. This has, to say the least, become awkward. For years, Mr. Baldwin said he carried the image of “Sea and Mirror” in his shoulder bag, alongside a picture of one of his daughters and his father. In 2010, he asked Ms. Boone to find the collector who owned it and pry it away. “There was a kind of beauty and simplicity” to the work, Mr. Baldwin recalled in an interview this month. Happily, she reported back, the collector would sell  —   but at a premium. Mr. Baldwin put up the $190, 000. “I love this thing so much,” he said in a 2012 speech about support for the arts at the Kennedy Center for the Performing Arts, proudly recounting his quest. “Three months later it was hanging in my house, in my apartment in New York. ” But Mr. Baldwin said that something about the painting always gave him unease. The colors weren’t quite the same. It smelled, somehow, new. In fact, he said, just a few months ago he discovered that he had not bought the painting he pined for. Instead, he said, for reasons that remain disputed, Ms. Boone sent him another version of the painting. He claims she passed it off as the original. “I thought she had made my dream come true,” Mr. Baldwin said. Instead, he said he believed that Ms. Boone, frustrated that the collector would not agree to sell, persuaded Mr. Bleckner to take an unfinished work from the same series, finish painting it and sell it to him without saying a word. Mr. Bleckner’s office said he could not be reached for comment. Ms. Boone, through her lawyer, disputed Mr. Baldwin’s account, asserting he was never misled about the identity of the work. “He’s wrong that the painting is a copy it’s an original and very fine work of art by Ross Bleckner,” Ms. Boone’s lawyer, Ted Poretz, said in a statement. Mr. Baldwin, however, has emails that buttress parts of his account. The Boone gallery also stamped a number  —   7449  —   on the back of the painting it sold to Mr. Baldwin, the same number it had listed next to the work it had said it was pursuing from the collector. Mr. Baldwin said he met with the Manhattan district attorney’s office this summer but was told that a criminal case could not be made. Ms. Boone’s lawyer declined to address in full the issues raised by the emails or the number next to the painting. “The gallery never likes to have unhappy clients,” Mr. Poretz said in his statement, “and it has turned cartwheels to try to satisfy Alec Baldwin. It has repeatedly offered Alec Baldwin a full refund, among other things. ” The interaction is hardly the first to end badly in an opaque, largely unregulated art market. It raises questions about why works created in one era by an artist, operating under one set of motivations, are sometimes different in value and reputation, compared with works that were perhaps created by the same artist in another era. But to Mr. Baldwin, the concerns are not nearly so esoteric: He contends he was betrayed. “Ross was a kind of friend of mine,” Mr. Baldwin said. He continues to be a Bleckner supporter. Mr. Baldwin’s foundation helped to underwrite an exhibition this month on Long Island that featured Mr. Bleckner’s paintings. He owns five of Mr. Bleckner’s works. Mr. Baldwin said that the flamboyant, outspoken Ms. Boone, from whom he sometimes bought art, admitted this year that she had switched the works. “She said, ‘I didn’t want to disappoint you,’” he said. Mr. Baldwin, who met Mr. Bleckner at parties in the Hamptons, where the actor owns a home, became an admirer of his work in the 1990s. Mr. Bleckner, who had a Guggenheim retrospective in 1995 at 45, had been an ascendant art star of the 1980s. He belonged to a stable of young artists who helped Ms. Boone build her reputation in the ’80s, though two of her stars from that time, Eric Fischl and David Salle, have since left for rival dealers. Mr. Baldwin bought his first Bleckner from Ms. Boone in 2010, and during that transaction mentioned that he really wanted “Sea and Mirror. ” The painting had sold at auction at Sotheby’s in 2007 for $121, 000. Ms. Boone told Mr. Baldwin in an email that the collector now sought $175, 000 for it. “The Gallery normally charges ten to twenty percent for this kind of transaction,” she wrote. “To make this a friendly deal, we would charge you even less  —   $190, 000,” before adding, “I know Ross is so thrilled for you to have a painting and so am I. ” Mr. Poretz said that shortly afterward Mr. Baldwin was told that, in fact, he was getting a different version of “Sea and Mirror. ” “By the time Alec Baldwin paid for the painting and it was delivered to him, he should not have misunderstood what he purchased,” Mr. Poretz said in his statement. Mr. Baldwin denies he was ever told he would be receiving a different work. He said that when he received the canvas, he noticed the composition lacked a feathery quality in the brush strokes he had admired in the photos of the work sold at Sotheby’s, and seemed brighter. Ms. Boone told him, he said, that it had been newly cleaned as a courtesy. This year, his suspicions growing, he sent emails to Mr. Bleckner and Ms. Boone inquiring about the collector from whom he had bought the painting and about the cleaning. According to copies of the emails, Mr. Bleckner responded that he did not know the name of the collector. Mr. Baldwin says Mr. Bleckner did not point out that that transaction had never gone through. Mr. Bleckner also discussed how he might have done the cleaning. “I would usually do that,” he wrote to Mr. Baldwin, “although I don’t actually remember. ” Mr. Baldwin finally had a Sotheby’s expert compare his painting to a catalog image from the 2007 auction. The expert said, “This is not that painting,” Mr. Baldwin recalled. He then confronted Ms. Boone and Mr. Bleckner. He said they acknowledged having given him another work. Mr. Baldwin has an email in which Mr. Bleckner is deeply apologetic but does not directly address about what. “im so sorry about all of this,” he wrote. “I feel so bad about this   …     what can I do to make this up to you?” He said Mr. Bleckner told him that he had started the painting in 1996 and finished it in 2010, though he had dated it 1996. “I don’t know what Ross knew,” Mr. Baldwin said. “Ross may have been instructed to make a copy. I don’t know. ” This summer, as Mr. Baldwin complained to Ms. Boone, he gave her an ultimatum. “Deliver to me the painting that I bought. The one you sold me,” he wrote in an email. Ms. Boone again asked Sotheby’s to contact the owner of the painting sold at auction in 2007, according to an email supplied by Mr. Baldwin. The collector, whose identity remains a mystery, was still not interested in selling. Ms. Boone’s lawyer, Mr. Poretz, also contacted Mr. Baldwin to try to settle the matter. In an interview, Mr. Baldwin acknowledged that the work he has was created by Mr. Bleckner and that it looks quite similar to the painting he coveted. But he said it was not the work he had fallen in love with  —   not a painting, in his view, created when the artist was at the peak of his fame. Still, he told Ms. Boone in a recent email, he did not want to hurt Mr. Bleckner. “I’m less worried about you, Mary,” he wrote, “as you are more of an armadillo and I’m sure you have been blasting your way out of corners like this on more than one occasion. ” Ms. Boone wrote back to say that she was working to get him the work he wanted. “I am not an Armadillo however,” she added.'"}, "time": 1742628596.1683433}