{"duration": 0.133772611618042, "input_args": {"text": "' The Tales of Bodies and Blood That Surround a Front Line in Syria By Robert Fisk\\n The Independent \" - We arrived so soon after Jabhat al-Nusra\\x92s retreat from the village that one man and his family had only just buried the remains of four Islamists at the bottom of their field. \\x93We found them at the back and they stank so much that we had to get rid of them,\\x94 Mohamed Kenjo said. \\x93So we took the remains and put them under a covering of earth away from our home.\\x94\\nBut the house he once shared with his wife and six children had been looted \\x96 everything, from the washing machine and the water tank, to cups and saucers and kettles \\x96 and the homes of Kenjo\\x92s neighours lay in ruins, broken open by shells and rockets. This was the front line north of Hama, a city whose history lay in the blood of insurrection more than 34 years ago.\\nSo close to the front line, in fact, that the fighter bombers were still howling over our heads to attack the Islamists \\x96 Ahrar al-Sham, Nusra, all the usual suspects \\x96 in the next village to the north-west. The Syrians say you can only see their jets, that the Russian fighter-bombers are so fast it\\x92s impossible to catch them with the naked eye. You could make out the spray of anti-missile flares that the aircraft released, four or five bright stars that drifted through the imperial blue sky like fireworks.\\nBut then, as the planes turned one after the other from their bombing runs, you could just see them as the sun caught their swept-back wings, daggering up into the heavens to the south before their bombs exploded with a loud, hollow sound like two giant wooden planks banging together on the ground. Amid the soldiers, sweating, tired, a general turned up, steel helmet over his eyes, marching briskly with his officers through the ruins. I wanted to know how many of the Nusra men had died.\\n\\x93Many, many,\\x94 he replied. But when I asked how many of his Syrian soldiers had been killed in the broken, smashed village of Soran, his answer came without hesitation. \\x93We had 42 martyrs,\\x92 he said bleakly. I didn\\x92t doubt the figure. And when soldiers tell the truth, it means they are winning. But that\\x92s a lot of men to lose for one dust-covered hamlet. The Syrian army\\x92s death toll in six years of war is a state secret. But I\\x92ve been given a reliable figure for the government army\\x92s fatalities in this terrible war: around 75,000. These are the dead, not the hundreds of thousands of wounded. Soldiers expect to die. They live by the sword.\\nCivilians on both sides are the innocents whose lives should be spared. Their mortality statistics come from all sides, including the United Nations. Is it 250,000 or 300,000 as the UN now states? Or 400,000 as the \\x93experts\\x94 in faraway cities now claim? Whatever the figure, add another 75,000 to it.\\nThe ruins of the village of Soran north of Hama (Nelofer Pazira)\\nThe Nusra men and their allies had only captured this place two and a half months ago. House after house in what had been Soran had been blown apart. Some remained, their doors ajar, the bougainvillea still spilling over their concrete walls. But always, when I walked inside, there were cupboards torn open by the retreating Islamists, piles of children\\x92s clothes and toys and clocks and family snapshots scattered across the floor. One picture showed a baby smiling from a cot, another a husband and wife surrounded by their children. The Islamists had probably been looking for money hidden in the cupboards. But why did the looters want a washing machine? Did they plan to lug this rubbish away in their retreat? What happened to those who lived here?\\nThere was no doubt of the tragedy of one middle-aged man. He stood forlornly in the street beside a huge bomb crater surrounded by heavy, jagged pieces of steel casing that lay at his feet. \\x93I am a policeman in Hama,\\x94 he said. \\x93My father stayed behind. He was an old man. And on the day they left, the killers murdered him. They shot him at the back of his home.\\x94 And he led me into his father\\x92s blackened house and pushed open the door to a small, darkened closet. \\x93We found him there, on the floor,\\x94 he said.\\nOther Syrian villagers, returning now that the Islamists had fled, told similar stories, of missing women, of bodies in the wreckage. Highways seem to survive wars, as if history insists that the basic geography of a society should remain mapped out amid the ruins for a village\\x92s later reconstruction. So on the main road, those who had fled the invaders last August had turned up in pick-up trucks and old cars to see what remained of their homes, to collect what detritus was left.\\nIn the neighbouring village of Maardes, I found a woman and her daughter \\x96 her name was Qamar, which means \\x93moon\\x94, and they had returned to a real moonscape. She and Qamar found part of a wardrobe and a mat carpet which they loaded pathetically onto a pick-up which a relative had brought up from Hama. In a different age, in 1982, the Muslim Brotherhood \\x96 a pale ghost compared to the Islamists of today \\x96 had staged a fearful insurrection in the city, put down with more than equal ferocity by Hafez al-Assad\\x92s army all those years ago.\\nThe statistics of those long dead civilians who had died in the government\\x92s reprisals are as slippery as today\\x92s death toll. Was it five or six thousand? Or 20,000 as we journalists claimed at the time?\\nMany of the ruins of Hama\\x92s old city were bulldozed away to make room for new apartment blocks and a luxury hotel. But a few ancient houses remain beside the ancient \\x93nouriah\\x94 water wheels that still wail and creak away in this haunted city. Its Sunni Muslim citizens are quiet now. Maybe they have learned their terrible lesson. Or maybe the government learned to treat them with respect, leaving new generations with their new-found trade and wealth and schools. Today, its market packed with shoppers, it feels like a memory of the old, dubiously \\x93safe\\x94 dictatorship that dominated Syria before this war; content, subdued, careful, aware \\x96 to use an old British wartime maxim \\x96 that \\x93careless talk costs lives\\x94. Brotherhood prisoners back in 1982 were later slaughtered in a prison massacre at Palmyra.\\nThe Ibrahim mosque still displays a three-decade old shell hole in its minaret. But Nusra has not let the city forget its past. Less than a month ago, a suicide bomber set off a truck load of explosives outside the Baath party headquarters. One governor has been assassinated. It\\x92s a relief to drive north again to a wooded hillside whose burned trees and massive earth revetments show that it was an artillery position until a few days ago. Two 120mm guns stand on a parapet above the plain of Hama.\\nOn top of the hill, there stands the almost untouched shrine of Ali Ibn Hussein al-Abdin, the fourth Imam who survived the seventh century battle of Kerbala, a Shiite holy place \\x96 the Alawi sect to which the al-Assads belong is Shia \\x96 and soldiers had arrived from the battlefront to pray and kiss the black marble shrine beneath its cupola of antiquity. A major later stood outside the courtyard and pointed to the horizon. You could see 30 \\x96 perhaps 40 \\x96 miles across the flat, featureless countryside where around 7,000 armed opponents of the Assad regime are still fighting to retake the lost villages and cut the desert military supply road to Aleppo. Are they all Nusra men? A few Isis members, no doubt. Perhaps they were the \\x91moderate\\x92 rebels whom David Cameron, a former British prime minister seemingly invented.\\nAnd how long before the Syrian army could recapture all those lands which ran seventy miles to Aleppo and linked up to the Turkish border north of the city? The major looked across this vast expanse of territory. Then he pointed to the sky and opened his hands. The gesture said it all. Only God knows.'"}, "time": 1742562668.7179031}