{"duration": 0.1413562297821045, "input_args": {"text": "'Written by Melkulangara Bhadrakumar   The battle of Mosul has been joined, finally, as Iraqi Special Forces entered the city limits earlier today from the east. ( BBC ) The early reports suggest that the Islamic State fighters responded with guided anti-tank missiles and small arms to block the Iraqi advance. Al Jazeera reported that the battle is “intense” and IS fighters are putting up “stiff resistance” against the approaching forces.The IS has set the oil wells on fire to obscure their positions from possible air attacks. Nonetheless, US air strikes are continuing. Another Iraqi column from the south is still 35 kms away from Mosul city. To the north, Kurdish forces and Iraqi army units are approaching the city, while the Shi’ite militias are covering the western flank to cut off any escape route for the IS fighters in the direction of Syria. There is a tacit understanding that the Iran-backed Shi’ite militia known as the Popular Mobilisation Force will not enter the Sunni-dominated Mosul city.The US military estimates that there could be up to 7500 IS fighters in Mosul, including 1000 foreigners. The Iraqi forces and their Kurdish allies, Sunni tribesmen and Shia militias converging on Mosul are 40000-strong. The top US commander in Iraq Lt. Gen. Stephen Townsend in a video conference last week from Baghdad had exuded optimism that “the Iraqis will be successful”. The general said: The Mosul offensive is a large and extraordinarily complex operation that the Iraqis have been planning for a very long time. They’re the ones making the decisions and their forces are the ones who will enter Mosul and raise the Iraqi flag in the center of the city. We assisted them with the planning and preparation of forces and have provided advice and assistance such as air and artillery strikes and intelligence to support the Iraqi operations.A few days before Mosul operations began, I attended the Iraqis’ final operational briefing where each commander responsible for a different axis of advance provided their plan to the prime minister. I can tell you that it was clear to me that night that the sovereign nation of Iraq owns this fight. There’s a lot of hard fighting ahead, but we’re confident the Iraqis will be successful. ( Transcript ) However, coming days may well throw up nasty surprises, when house-to-house fighting begins. In a graphic field report from Baghdad two days ago, the Xinhua correspondent had noted: IS militants appeared well-trained for urban combat, and they showed stubborn fighting when they continued sporadic clashes for two days after Friday, as the troops searched for unknown number of militants holed-up in some buildings and houses and possibly would attack again or flee the city.Heavier resistance is anticipated by some 3,000 to 5,000 IS militants once the anti-IS forces enter populated neighborhoods located on the eastern side of the Tigris River that bisects the city… IS group has evacuated most of its fighters from its headquarters in the eastern side to the western side where the old city located… The battles in the eastern side of Mosul would mainly depend on suicide car bombs, roadside bombs and snipers attacks, which aimed at hindering the progress of the troops, while the fierce battles are expected to be on the western side.Mosul is the IS last major stronghold in Iraq, the group more likely is unwilling to surrender without a fight. Over the past two and a half years, they have dug an extensive network of tunnels to transport equipment and fighters, and rigged roads and bridges with bombs and digging trenches to be filled with burning oil to impede the Iraqi forces’ movements. Then there is the human toll of an estimated over one million civilians who are still living in the city, and IS apparently to use them as human shield.” ( Xinhua ) The ‘known unknown’ will be as regards Turkey’s role. Baghdad has resisted any Turkish involvement in the fighting, whereas, Ankara is raring to go. It is reasonably certain that at some point, Turkey will find an alibi to intervene. There are reports that tanks and armoured vehicles from the 28th Mechanized Brigade of Turkish armed forces are being deployed in the border town of Silopi on the border with Iraq. A Turkish incursion into Iraq seems to be in the making. ( Hurriyet )If Turkey enters the Battle of Mosul, all bets are off, as things can take an unexpected turn. Both Iraq and Iran (and the US and Russia) would know that Turkey has geopolitical objectives. Indeed, Turkish media is for the first time opening challenging the Lausanne Treaty of 1923 under which Britain had handed over Mosul to Iraq. President Recep Erdogan himself staked claim recently to the former Ottoman territories: “We are not happy with these borders. Our territory which was 2.5 million square kilometers in 1914 shrank to 780 thousand square kilometers nine years later, when Lausanne was signed… Those who are trying to imprison Turkey in a vicious circle since 1923 want to erase our thousand-year history in this region.”Clearly, so much remains in the womb of time. The Arab world will feel uneasy if and when Turkey begins to reclaim former Ottoman territories. An incredibly complex situation is unfolding as the contestation over Mosul’s post-IS future begins. Read an excellent analysis by the European Council on Foreign Relations titled Mosul operation sees Turkey flex its muscles .   Indian Punchline . Related'"}, "time": 1742562226.1439016}