{"duration": 0.06699657440185547, "input_args": {"text": "'A magician walks into a laboratory. It’s not the beginning of a joke. It’s the subject of a declassified 1969 Central Intelligence Agency memo, one of more than 930, 000 searchable documents that the agency posted online on Tuesday. The memo about the magician was among the more unusual files in the trove of declassified reports, which include more than 12 million pages of dispatches and correspondence that document the history of the C. I. A. If you wanted, you could read up on the United States government’s research on “spiritualist healers in Mexico,” the “dreamlike structure of telepathic assertions” or “an assessment of the evidence for psychic functioning. ” Or you could examine the agency’s actions and research during the Vietnam and Korean Wars. Maybe you would prefer to read through the files of Henry A. Kissinger, who was secretary of state under Richard M. Nixon and Gerald R. Ford, or a description of the Berlin Tunnel, a wiretapping effort to monitor the Soviet Union during the Cold War. You can look through intelligence reports on specific countries or events, find recipes for invisible ink or learn how to open sealed letters. “It gives insight into a lot of different elements of our history since the 1940s,” said Mike Best, a journalist and archivist who pushed for the online publication of the files. Technically, you could have gained access to the files before, but only if you drove to the National Archives building in College Park, Md. where there were four computers you could use to sift through the C. I. A. Records Search Tool, known as Crest. You couldn’t email or otherwise electronically transmit files to yourself, but you could print them out on the C. I. A. ’s dime (as long as the paper and ink hadn’t run out). “Access to this historically significant collection is no longer limited by geography,” Joseph Lambert, the C. I. A. director of information management, said in a statement. “The American public can access these documents from the comfort of their homes. ” Mr. Best would often drive 90 minutes from southeast Pennsylvania to examine the documents. Nearby signs instruct users that their searches and printed files are being monitored, he said. “You’re under surveillance for doing this entirely legal thing,” he said. The publication of the files represents a potential motherlode of background material for researchers, journalists and curious hobbyists. While many such people have already combed through the material in Maryland, the online publication will allow for access among people who can’t drive there. But, to be clear, most of the files are pretty boring. The collection appears to be the result of regular bureaucratic collation: Someone sends something interesting to the agency (the magician, who someone claimed was a   healer) or someone writes an interesting academic paper (the spiritualist healers) and the result is files like these, summaries of work that the agency thought notable enough to file away. Others have no apparent reason for having been collected by the C. I. A. like a   ad for the Buffalo Bill Wax Museum. (Maybe it’s a code, the key to which remains classified.) The Crest archive represents a major document dump, but the C. I. A. has published many other declassified files online. Its files are typically unclassified after 25 years. For those who believe the truth is out there, the website has a collection of reports on unidentified flying objects, and capitalized on interest in last year’s “ ” reboot by posting the “top five documents Mulder would love to get his hands on. ” After journalists at MuckRock, a news site, filed Freedom of Information Act requests for access to the Crest database, the C. I. A. said in 2015 that it would take 28 years to publish. In 2015, the agency cut its estimate to six years, and said the documents would be delivered on 1, 200 compact discs at the price of $108, 000. Put off by what he perceived as stalling, Mr. Best crowdfunded $15, 000 to print, scan and publish files himself. In October, the C. I. A. said it would post the files. “C. I. A. made significant architectural and procedural changes to load and index the Crest documents more quickly,” said Heather Fritz Horniak, a spokeswoman for the C. I. A. “This means that we were able to post the entire Crest collection, totaling nearly 13 million pages, online much earlier than anticipated. ”'"}, "time": 1742561945.3222034}