{"duration": 0.1754286289215088, "input_args": {"text": "'by Health Impact News \\nA North Carolina grandmother writes: \\n“I never thought in my life that child trafficking would be legal in our own government.” \\nYet, her grandson has been forcibly taken from his family and currently lives with strangers, through the Child Protective System. His grandmother, Kimberly Deese, is one of thousands of parents and grandparents who view the actions of Child Protective Services as literally being a form of legalized child trafficking. It has been one year since Health Impact News first reported the heartbreaking story of Malakai, a little boy who was medically kidnapped from his family and has suffered abuse and malnutrition since being in state custody. \\nSince that time, there has been little change. Several times, the family was told that there would be an investigation into the reports of abuse and photographs showing his dramatic weight loss, but nothing has reportedly materialized. Malakai is still in state custody, and the last window of opportunity to get him back home is rapidly closing. \\nKimberly Deese says that a new attorney has assured them that he can get him back home, but they have less than 60 days to come up with attorney’s fees and to get the legal process rolling before the January 6th deadline. ( Contribute to these legal fees here .) His mother Heather has lost her parental rights, and the new attorney plans to file for an appeal. They are still working to get Malakai placed with his grandmother, but CPS in Wake County has fought them at every turn. The family believes that Malakai never should have been taken from his home. \\nSee original story: North Carolina Child Medically Kidnapped Starving to Death in Foster Care \\nIn September, Malakai’s godmother ran into him with the foster family in a clothing store. The friend was shocked to see how skinny Malakai has become. She was able to get a picture, but the photo quality is very grainy. Malakai in a store in September. Photo source: Help Save Malakai Facebook page . \\nKimberly is very fearful for him: \\nI feel like my grandson’s been forgotten and it hurts bad. My daughter did nothing wrong but loved her children. \\nWhy does CPS have to put a price tag on children’s heads? I never thought in my life that child trafficking would be legal in our own government. \\nI don’t have much hope anymore and my pain is ongoing since the day they took him. \\nWe are just another family that’s lost in this corrupted government kidnapping our children. \\nThis pain will live in me till the day the good Lord takes me. \\nI still have Tony, my Heather’s youngest, because I fear in my heart should I give him back to his innocent mother they would take him too. Blessings. \\nThey are very hopeful that the new attorney will help them to set things right. The family says that they have done everything in their power to get him out of foster care, “where he is being malnourished and neglected.” \\nHowever, as most families dealing with the system have reported to Health Impact News , the fight has been “mentally and financially draining.” Kimberly writes: \\nWe NEED your help! Wake County CPS refuses to let him come home due to the large amounts of federal funding they receive on his behalf! \\nFor over 2 years Wake County CPS has denied Malakai his mother, whose rights have been terminated, his grandmother, who has custody of his 2 siblings and has been approved as a suitable home for his 2 siblings with no criminal history and other family members who have tried to gain kinship or custody of him to keep him with biological family. \\nFamily SHOULD always be first choice! \\nBefore Malakai was taken from his family, he was a happy and healthy little boy with a ready smile and chubby cheeks. Malakai was happy and healthy before CPS. Photo source: Help Save Malakai Facebook page . \\nHe and his brother were taken from his family in April of 2014 after his younger brother Zechariah sustained a small burn on his leg. Their grandmother later figured out that the burn must have come from a hot buckle on a wagon, after she was able to match his injury to the buckle. \\nHeather’s boyfriend had placed him in the wagon. He misinterpreted Zechariah’s cries as fear, and pulled him around on the wagon for a couple of minutes in the hope that he would settle down before taking him out of the wagon. It was an accidental injury, and the boys’ mother was not even involved. \\nSomeone who reportedly didn’t like Heather called CPS and told them that she had purposefully caused the burn. Social workers placed Zechariah with his other grandmother, but placed Malakai in a foster home with strangers. \\nSince he went into foster care, his condition allegedly has rapidly deteriorated. By November of 2014, the once-healthy boy was considered special needs. His grandmother reports that he showed evidence of being: \\nstarved, neglected and abused … and eventually needed leg braces to help him walk. His ribs and shoulder blades began to protrude from his small frail body so now Wake County can claim Special Care funding while holding him hostage from us. Kimberly Deese: “I could see all my grandson’s bones, it was so horrible, reminded me of a child from a third world nation. I just wanted to cry. This is America – this thing should NOT BE HAPPENING.” Source: Help Save Malakai Facebook page . Malakai Suffering in Foster Care \\nThe family has not had any visitation with Malakai since that November. Though there have been many phone calls and reports made to CPS by the family, nothing has been done. Kimberly reports that she has been told that social workers have investigated but have not found any of the allegations to be substantiated. She does not believe that the authorities are listening or that they care about her grandson. \\nIn July of 2016, the family learned that Malakai had been hit by a car while in foster care. Though he was allegedly hospitalized for cuts, scrapes, and bruises, his family was not permitted to see him. Even after the car accident, nothing has changed. The family has learned that he remains in foster care, in the same foster home he was in when he was hit by a car. All phone calls from concerned friends and family have reportedly been ignored. How You Can Help \\nThe family has very limited finances and no means to hire the attorney who believes that he can help them to bring Malakai home. Former court-appointed attorneys have not been helpful in getting Malakai returned to his family. \\nThey need support and prayer as well as financial assistance to raise the retainer fee. They have less than 60 days to come up with the retainer fee for the private attorney. Kimberly Deese believes that this is their last, best hope to get Malakai home and out of the risks that he is facing in foster care. \\nHealth Impact News has set up a special fund to help families in our stories who need financial help. Donations may be made to Malakai’s legal defense fund through this page:'"}, "time": 1742563400.0401464}