{"duration": 0.033124685287475586, "input_args": {"text": "'The Electronics Entertainment Expo (E3) the largest trade show for the gaming industry, will open its doors to 15, 000 of its most devoted consumers in 2017. [On Monday, February 13, the Entertainment Software Association will open limited ticket sales to what is arguably the most important trade show in the gaming industry. E3 will welcome fifteen thousand fans to join developers, publicists, and members of the media in June. The first 1, 000 to purchase their tickets will gain access for $150. The remainder will need to pay $250 to gain entrance to the ESA’s chaotic digital wonderland.  While E3 attendance has never been officially public, prior to 2007 the credentials needed for entry were relatively broad. 2007’s   restructuring attempted to curtail the growing crowd but culled much of the event’s excitement along with the vast majority of its attendees. This year’s expo looks to capture the   enthusiasm of eager consumers while taking reasonable precautions not to flood the show floor to the point of obstruction. ESA Senior VP of Communications Rich Taylor called it “a strategic decision” for “a changing industry,” made possible “thanks to our members and their vision and leadership. ” According to Taylor, they’ve been listening: The feedback we heard was clear —  they wanted to play the games inside the convention center. In addition, exhibitors inside the convention center wanted to have access to the fans. So this year we’re bringing the two together. Is this a step in the right direction for the world’s most famous industry event? Will it bring back some of the major publishers that have decided to host their own separate shows in the recent past? And, most importantly, will I see you at this year’s E3? Follow Nate Church @Get2Church on Twitter for the latest news in gaming and technology, and snarky opinions on both.'"}, "time": 1742628332.9200437}