{"duration": 0.07966971397399902, "input_args": {"text": "'ATHENS  —   In Greece’s biggest peacetime evacuation ever, about 72, 000 people left their homes in the city of Thessaloniki on Sunday as experts defused and removed a World War II bomb from below a gas station. Hundreds of police officers in Thessaloniki, the country’s   city, began knocking on doors early in the morning to remind residents within a radius of two kilometers, about 1. 2 miles, to leave their homes. Though residents had been given several days’ warning, with leaflets posted around the city and an online campaign by the local authorities, some were reluctant to leave and had to be convinced by the police that their properties would remain intact. “The security measures might be excessive, but it’s better to be excessive and be safe,” Greece’s public order minister, Nikos Toskas, warned in a televised message. The bomb was found last week under the gas station during excavation work aimed at expanding storage tanks. It was about five feet long and weighed about 550 pounds  —     of which was explosive, and the rest casing. The bomb had been dropped onto Thessaloniki by Allied forces in 1943 or 1944, toward the end of Greece’s occupation by Nazi Germany, according to the Greek news media. On Sunday, residents were transported by bus to schools and sports venues. Greek television broadcast images of bemused pensioners, many of whom lived through the Nazi occupation of Greece, sitting on plastic chairs and drinking bottled water provided by the local government. Others carried pet cats in boxes through empty streets or led   children by the hand as army officers stood guard near the   gas station. Hundreds of refugees who have been living at a former toilet paper factory, including many Syrians who fled strife in their country, were taken by aid workers to the city’s archaeological museum for the day. They were given snacks and taken to see the artifacts, aid workers said. “The refugees accepted the situation with stoicism and understanding,” Vassilis Karambidis, who runs the center, told Greece’s   news agency. “There were no protests, and those who were reluctant initially ultimately came round to the need to vacate the center. ” Over the course of an hour and a half, three Greek military pyrotechnic experts defused the bomb in an operation that “went very smoothly,” Apostolos Tzitzikostas, the regional governor, told reporters. He had declared a state of emergency in the city for the operation, suspending train routes and church services. The bomb was loaded onto an army vehicle and taken to a military shooting range near the city to be destroyed, Mr. Tzitzikostas said. About five hours after the defusion, residents started returning home. A local military spokesman, Colonel Nikolaos Fanios, played down the operation, noting that army experts had defused similar bombs found near the city’s international airport in the past. “This is a routine event for the army,” he told the Greek news media. The discovery of the bomb in a densely populated area, however, made Sunday’s evacuation necessary, he said, noting that an accidental explosion would have resulted in deaths within the   radius.'"}, "time": 1742564064.8721092}