{"duration": 0.09184050559997559, "input_args": {"text": "'Hillary’s So Pissed At FBI, But Here’s The 1 Person Who Really Screwed Her Posted on October 31, 2016 by Rebecca Diserio in Politics Share This \\nHillary Clinton and all of her supporters are freaking out over FBI Director James Comey’s recent re-opening of the email scandal investigation, saying he has new information coming from a forgotten Huma Abedin laptop. Hillary is so pissed, she has been on a tirade, blasting Comey and Donald Trump, but she forgot one thing — and that is the one person who really screwed her. Hillary Clinton is pissed off. \\nPoor Hillary Clinton, since stepping into the White House back in 1992, she has imagined herself sitting in the Oval Office as the one with all the power. She has conspired and broken laws, killed men in Benghazi, and lied about their deaths, but now, it looks like its all for nothing. \\nIf only she could live in reality for 20 seconds, she would realize the one person who screwed her was staring back at her in the mirror. Everything that has happened is because she decided or rather insisted that all her crimes involving her own home based server be covered up. \\nShe was warned when she became Secretary of State that all emails having to do with government business must go through the “dot gov” system. She had to take a class on how to handle classified documents, and after the class, she had to sign a document confirming that she understood all of her work emails must stay on the “dot gov” system. \\nWhy? Was this just a stupid rule that had no real life consequences? No. People’s lives are at risk. Our troop’s movements are in those emails. The information about CIA spies, who are risking their lives in foreign countries, are in those emails. Who needs a class to understand what is at stake? \\nSo, how can she get pissed off about this investigation and say over and over “it was a mistake, there is no case with the FBI”? A mistake? A mistake is an action or judgment that is misguided or wrong. Intentionally going against all protocols and putting the lives of others in danger is a crime. Hillary Clinton in August 2015 \\nHere’s what Rush Limbaugh said: \\n“They’ve nominated somebody that’s under constant FBI investigation, and there are four different investigations into the Clinton Foundation. Do not doubt me when I tell you that within the inner circles of the Democrat Party, they are very worried about this. Even if she gets elected, they’re very worried about it, because of what it portends for her presidency. This woman is corrupt. She and her husband are constantly engaged in things that place them under investigation, for 30 years .” [via Rush Limbaugh.com ] \\nHillary is so pissed off, but for those of us who have suffered through watching her tear apart this nation, sell influence to foreign entities in the “pay for play” scandals, leave our men in Benghazi to die while blaming it on a video, and lie under oath numerous times, well, we couldn’t be happier. \\nAmerican women have no business voting for Hillary as the first woman American president. What kind of a legacy is that for our daughters and granddaughters? How will those women who backed her and voted for her ever explain that the first woman president was the biggest criminal ever to hold that office? \\nShe is a monster, and I’m tired of her supporters crying now that it’s falling apart. The only person to blame is Hillary Clinton, and anyone who can’t see her clearly is delusional. No one made her commit crimes that she needed to cover up with a home based server. Put her in prison, where she belongs, and throw away the keys.'"}, "time": 1742561986.0632627}