{"duration": 0.07980489730834961, "input_args": {"text": "'It’s no secret that Obama and his puppets are doing everything they possibly can to rig the election against Trump. Positive Trump polls are coming all the time, so it’s all hands on deck from the Democrats to do whatever it takes to hand the election to Hillary.\\nObama’s latest move involves registering immigrant voters who will most likely be voting for Hillary in November and he’s spent TONS of your taxpayer money doing it.\\nFrom Judicial Watch :\\nMonths after the Obama administration spent $19 million to register new immigrant voters that will likely support Democrats in November, it’s dedicating an additional $10 million in a final push as the presidential election approaches. The money is distributed by U.S. Citizenship and Immigration Services (USCIS), the Homeland Security agency that oversees lawful immigration, to organizations that help enhance pathways to naturalization by offering immigrants free citizenship instruction, English, U.S. history and civics courses. Officially, they’re known as “citizenship integration grants.”[…]\\nJudicial Watch went on to say… The Department of Homeland Security (DHS) has been aggressive in promoting its citizen integration grant program this year, offering large sums to recruit new groups that can offer immigrants the services they need to become citizens. Clearly, the ultimate goal is qualifying as many immigrants as possible to vote since they tend to cast ballots for Democrats. “We intend to award about $1 million to first-time recipients in the Citizenship and Integration Grant Program for fiscal year 2016,” the agency’s grant announcement states. “If you represent one of these organizations, or know of an interested organization, we strongly encourage that organization to consider applying. Additionally, another $9 million will fund programs that provide both citizenship instruction and instruction and naturalization application services.” Some might consider this a cash giveaway.[…]\\nPractically every federal agency is participating in the effort by contributing resources and creating programs to help immigrants. For example the Department of Labor (DOL) is implementing “new workforce programs” for the “new Americans” and the Department of Education is promoting “funding opportunities” to assure that the immigrants “are provided the tools they need to succeed.” The Department of Health and Human Services (HHS) is collaborating with other agencies to release a career and credentialing toolkit on “immigrant-focused career-pathways programs.” The Department of Justice (DOJ) and USCIS are making sure the new Americans have worker rights and protections and the Department of Housing and Urban Development (HUD) is launching a two-year pilot to assure that non English speakers have “meaningful access to housing programs” subsidized by American taxpayers.\\nObama likes to pretend that he’s doing this for the greater good of America, but the truth is it’s just part of the overall agenda to do whatever it takes to make sure Democrats run Washington and continue to drive our country into the ground.\\nSource: End the Fed \\nMore from Breitbart… Schweizer: Obama’s DOJ ‘Transferring Money to Left-wing Groups’ ‘to Influence This Election’ By John Hayward\\nOn Wednesday’s edition of Breitbart News Daily on SiriusXM , Clinton Cash author and Government Accountability Institute (GAI) President Peter Schweizer discussed the latest GAI report about the Obama Justice Department’s funneling of money to left-wing groups using fines levied against financial institutions. Breitbart Editor-in-Chief and SiriusXM host Alex Marlow described the report as exposing the Justice Department of “quite literally extorting companies to fund left-wing activists.”\\n“When I first joined Breitbart,” Schweizer recalled, “There was a scandal called Pigford where the federal government was basically taking taxpayer money and giving it to people who were claiming to be victims who were not victims and giving them billions of dollars. This is in that tradition.”\\nHe explained:\\nWhat’s really happening here is simple. You’ve got large financial institutions on Wall Street, you’ve got banks like Bank of America, who have in some cases committed financial crimes. I think some of them are real, some of them may not be, but set that aside for a minute. The Department of Justice has gone after them and basically said, ‘You committed these offenses, you’ve got to pay restitution in the form of billions of dollars.’ Okay, they committed the crime, they ought to pay that.\\nNow, ostensibly that money, those billions of dollars, are supposed to go to the victims of their financial crimes. If your Wall Street broker committed fraud, you’re supposed to be made whole with this money, and the rest of it is supposed to go to taxpayers.\\nThe problem is the Obama Justice Department has been diverting literally more than $650 million to left-wing groups. They do it under the guise of, “Well, you know, if this bank discriminated against lenders racially, we’re going to give this money to these left-wing quote-unquote housing groups to help deal with the problem.”\\nBut that’s not what’s going on. These housing groups are advocacy groups. They’re left-wing organizations. They are registering voters and getting voters out to the voting booth. And they specifically target what they call quote-unquote progressive voters.\\nSo this is taking the Department of Justice, which we’ve experienced so much in recent years has been politicized by this Administration, even further to where now the Department of Justice is transferring money to left-wing groups — in an effort, frankly I think, to influence this election.\\nBreitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern.\\nLISTEN: \\n\\nSource: Breitbart \\n'"}, "time": 1742561784.502361}