{"duration": 0.04806661605834961, "input_args": {"text": "'Campus carry and legislation holding   businesses liable for injuries to disarmed citizens are both on the move in Missouri. [The campus carry legislation is contained in House Bill 630, which is sponsored by state Rep. Jered Taylor ( ).  The Missourian reports that HB 630 would remove numerous “  zones” around the state, including those in “child care centers, public universities and churches. ” This means child care workers with concealed carry permits would be able to have a gun at hand to protect children, permit holders would be able to keep a gun with them on campus to defend their lives and the lives of fellow students, and   could be armed to fend off an attack during church services around the state. State Rep. Jon Carpenter (  City) was taken aback by  efforts to roll back “  zones” and asked, “Is this for show or is this for real?” Rep. Taylor responded, “I want individuals to be able to choose whether or not they carry a gun to protect themselves and others if the need were to arise. ” He added, “Criminals know where the   zones are. They know they’re going to be able to carry out their rampage and likely won’t be stopped until law enforcement arrives. ” State Rep. Nick Schroer ( ’Fallon) is sponsoring legislation that would hold “ ” businesses liable if a customer in the business suffers harm in a situation where they could have defended themselves with a gun. He said, “This policy of making places   provides a sense of safety to those who engage in magical thinking. These killers are not stopped by a sign on the front door. ” Schroer said businesses that advertise their   status with signage highlight “the dangerous condition we talk about when we talk about premises liability. ” AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742561771.1804795}