{"duration": 0.056296348571777344, "input_args": {"text": "'Pinterest \\nToday, Project Veritas released the fourth video in their “Rigging the Election” series, titled, “ Rigging the Election – Video IV: $20K Wire Transfer From Belize Returned .” In it, Democracy Partners founder Robert Creamer, who visited the White House 342 times during President Obama’s time there — 45 times with Obama himself — and has since resigned from his position, is on tape talking about shady, offshore donations. \\nAt the beginning of the video, Creamer admits how close he is to the White House: “I’ve known the president since he was a community organizer in Chicago […] Every morning, I am on a call at 10:30 that goes over the message being driven by campaign headquarters […] I do a lot of work with the White House.” \\nMRC TV reported about the video that unearthed major donations from offshore accounts in Belize that were “mysteriously returned”: \\nO’Keefe then claims the Clinton campaign violated Federal Election Campaign (FEC) coordination laws. He alleges they sent a fake possible donor, named Charles Roth III, to speak with members of Americans United for Change (AUFC), another organization working with the Clinton campaign, to see how they would go about helping a “donor” who wanted to stop Donald Trump from winning the presidency. \\n“Roth” spoke to Creamer about donating $20,000, and also inquired about how to affect Trump campaign events. \\nAccording to Creamer, who responded to Roth: “Now, Trump events is fine and frankly I spent most of my time overseeing the Trump events around the country. I mean that’s what I do, that’s what I do for the Clinton campaign…so that’s interesting as well.” \\nCreamer then instructed Roth to send a check to AUFC — the group that O’Keefe reported Creamer was a general consultant for. Creamer admitted that he was a consultant for AUFC, but conveniently, after the first two Project Veritas videos were releaed, Creamer’s name was scrubbed from their site. \\nProject Veritas dug even deeper into the corruption after AUFC confirmed that they got the $20,000 donation check from Roth via the offshore Belize account. To do so, Project Veritas sent another undercover journalist to intern with Democracy Partners and work with Creamer. \\nScott Foval, who we met in the previous “Rigged Election” series videos, is now the former national field director for AUFC and spoke to who he believed was a representative for Roth: “If he wants to get dirty, we can get dirty.” \\nMuch more was unearthed in the video — including Cesar Vargas, an illegal alien and founder of the Dream Action Coalition — who talked about conducting voter fraud in a meeting with Foval. \\n“What’s the goal of the campaign right,” Vargas asked and added, “Yeah and for me I totally get it, this is illegal, this is something that can be done.” \\nProject Veritas created a fictitious “money man” for Roth named Michael Carlson to see what these Democrat operatives would do with the promise of more money dangled in front of them. Creamer spoke to Carlson on the phone about a fictitious, wealthy client living in Syria that wanted to come to the U.S. Creamer told Carlson: \\nI just need to, I will try and find a couple of good referrals to you and get back to you pretty quick then. Okay? On the first…Well, I’ll just talk to…the guy I’m going to talk to first, to see if this is up his alley, the first thing is up his alley. It’s the guy who ran the campaign for President Obama. He has a firm that’s pretty well connected. \\nNow, where did the $20,000 go? MRC-TV reported: \\nThe shocker of why the $20,000 was mysteriously returned led back to the direction of Woodhouse [AUFC President Brad Woodhouse]. O’Keefe claims that once Woodhouse learned of the future release of the undercover videos, the money was wire returned back to the offshore account in Belize with Woodhouse claiming suspicion of a foreign donation. \\nMake sure to watch the entire Project Veritas video so you can see the corruption for yourself — including a pay-to-pay situation involving Creamer who was caught admitting that a donation could buy a meeting with Clinton.'"}, "time": 1742564332.189122}