{"duration": 0.06423330307006836, "input_args": {"text": "'LOS ANGELES  —   Two men were killed in a shooting at the University of California, Los Angeles on Wednesday, prompting thousands of frightened students and staff members to hunker down or run for shelter as the police went door to door searching for the gunman or other victims. After a lockdown that lasted throughout the morning, the Los Angeles police said that the gunman was among the dead, and declared the campus safe. “A homicide and a suicide occurred,” Charlie Beck, the Los Angeles police chief, said. “It appears it is entirely contained. We believe there are no suspects outstanding and no continuing threat to U. C. L. A.’s campus. ” A gun was found at the scene, and Chief Beck said, “There is evidence there that could be a suicide note. ” The shooting victim was William S. Klug, an associate professor in U. C. L. A.’s Mechanical and Aerospace Engineering Department, said Alan Garfinkel, a professor of integrative biology and physiology who worked closely with Mr. Klug for the past five years. Mr. Garfinkel, who was attending a meeting in a nearby building when the shooting occurred, said he had been informed of Mr. Klug’s death by Los Angeles and campus police officers. “He was an extremely sweet and kind person,” Mr. Garfinkel said. “It’s so   that this happened to him of all people. ” He described Mr. Klug as a devout Christian, adding that the two would often have debates in front of students about ethics and religion. The shooting took place about 10 a. m. inside a small office in the Engineering IV building, officials said. There were hundreds of people in the building at the time. The campus was placed on lockdown, with text message and email alerts sent out to students and employees telling them to shelter in place or, if they were in the open, to find shelter. It was not until more than two hours later that the authorities declared the situation was resolved and officials began to lift the lockdown. Earlier, police officers went building by building, escorting groups of people out who had their hands raised. The people then knelt on the ground as officers searched their backpacks and purses for weapons. Melanie Beecher, a   student, said she had reached her philosophy class shortly after receiving the first alert. “Immediately we barricaded the doors, blocked openings with trash cans, turned off the lights and pulled down the blinds,” she said. Ms. Beecher added that she had called friends who had not yet arrived, telling them to stay in their dormitories. “We have been getting frequent alerts and have been able to live stream the news,” she said. The lockdown meant that any student who left a dorm room was unable to   it, even with a key. “Our R. A. has instructed us to stay in our rooms no matter what,” said Izzy Gardner, a   student who spent the time in her room. “There are tons of rumors going around, and it’s hard to determine what is true and isn’t true. People are pretty shaken up. ” Ceci Falktoft, another   student, was walking to a meeting with a professor when she saw people running, she said. Without knowing why, she ran, too, learning about the shooting after she asked others what was happening. Ms. Falktoft ran to Powell Library, where staff members handed out snacks to the many people hiding or studying there and told them they could not leave. All classes and   activities were canceled for the rest of the day Wednesday. But Scott Waugh, U. C. L. A’s executive vice chancellor, said he wanted to resume normal routines as quickly as possible, especially because this is a crucial time of year for many students, with finals coming up, followed shortly thereafter by commencement. Classes will resume on Thursday, he said, and professional counselors would be available on campus. The Los Angeles police, the university police, the F. B. I. and the Bureau of Alcohol, Tobacco, Firearms and Explosives responded to the incident. Hundreds of law enforcement officers scoured the building where the shooting occurred and surrounding buildings.'"}, "time": 1742562301.881637}