{"duration": 0.11480116844177246, "input_args": {"text": "'JAKARTA, Indonesia  —   Crowned with spiky feathered headdresses and daubed with face paint, scores of protesters gathered outside the Jakarta offices of an American mining giant last week, chanting, waving signs and throwing uncertainty into global commodities markets. The traditional garb was meant to make it clear whom they represented: the people of West Papua, site of  ’s Grasberg mine  —   one of the world’s largest sources of gold and copper. Their shouted slogans made it equally clear what they wanted. “Freeport must be shut down!” the crowd chanted. It was a refrain that, in recent months, has resonated throughout Indonesia. Less than a week earlier, dozens of students from a different organization  —   dressed in red and white, Indonesia’s national colors  —   gathered outside the same office, calling for the government to take a firm hand with the company. “Freeport hasn’t brought prosperity. It’s just destroyed the natural environment,” said Surya Anta, national coordinator for the Indonesian People’s Front for West Papua. His organization helped organize   protests in 17 cities around the country. Billions of dollars’ worth of metal is produced at the mighty Grasberg mine, which provides jobs in a province with few other prospects. The problem? The mine is  —   to the frustration of Indonesians watching their country’s economic growth begin to sputter as commodity prices sag  —   American owned and operated. To address that, the government has in recent years passed regulations intended to exert greater control over mine operators. Freeport says those requirements violate the company’s 1991 contract, which lasts until 2021 and which it wants to renew. The dispute has put the brakes on production at the mine and slammed Freeport directly into Indonesian politics. The company, which counts as a major investor the billionaire Carl Icahn, a major backer of President Trump, has brought it to the attention of the United States government. “It is disingenuous and insulting that Indonesia would violate a contract by hiding behind politically motivated laws that were enacted after the contract was signed,” Mr. Icahn said. Jakarta is already in the midst of a tough race for governor that has engulfed the capital in demonstrations against Gov. Basuki Purnama, an ally of President Joko Widodo. Considered   Mr. Joko faces pressure to push back against an unpopular company at a time of declining exports, relatively slow economic growth and high political tension. The contract fight exemplifies Indonesia’s often fraught transition from a country exploited by colonial powers to one with the political clout to control its own resources, which are worth billions of dollars. For many Indonesians, Freeport, the biggest mining operation here, puts a face on that struggle. “We are hoping that if Freeport is nationalized, the revenue from Freeport will be distributed to ordinary people, to subsidize basic needs and education,” said Ahmad Hedar, a student activist. Freeport has operated Grasberg since the early 1970s, the crown jewel in what a former chief executive called its global “trove of treasures. ” Indonesia, however, sees the mine as a national resource whose riches are being spirited away to foreign owners. “Freeport pays only 8 trillion rupiah in taxes,” but complains about unfair treatment, Ignasius Jonan, the minister of energy and natural resources, told the youth wing of a prominent Muslim organization in February. That figure, about $600 million, compares with about $3. 1 billion worth of gold and copper mined in 2015. But the company says that from 1992 to 2015, about 60 percent of its profit was returned to Indonesia in taxes, royalties, fees and stock dividends. Both sides have threatened to take the contract disagreement to international arbitration. Until the dispute is resolved, the Grasberg mine will run at about 40 percent capacity without a licensing deal, the Indonesian government will not allow Freeport to export unprocessed minerals. The price of copper has been stable since a sharp rise in November, but the company’s shares have dropped nearly 20 percent in the last two months. “It is in the best interests of all stakeholders to receive a resolution in these matters,” Richard Adkerson, the chief executive of Freeport, said in a written statement to The New York Times. The Indonesian government faces extraordinary pressure from its citizens and national media to be firm with Freeport. This is driven by a perception that the company has consistently taken advantage of the Indonesian government since it entered the country in 1967 as one of its first big foreign investors. That year, Indonesia’s strongman leader, Suharto, granted Freeport a   tax holiday, as well as a reprieve from paying royalties, though Indonesia’s terms improved over the decades as the country’s economy developed. Some Indonesian media reports have called Freeport a “monument” to the Suharto era. “Indonesians have always been educated that they have   resources that are the envy of the entire world, but that over the years Western colonial powers have hatched schemes to take over Indonesia to exploit those resources,” said Matthew Busch, a research fellow in the East Asia Program at the Lowy Institute for International Policy. Indonesia’s largest Muslim civic organizations have aggressively opposed foreign control over the country’s resources, including calling for a “constitutional jihad” to challenge Indonesian laws that allow foreign companies to control domestic resources. The resulting friction has made Indonesia one of the world’s least attractive mining investment environments, according to the Fraser Institute, a Canadian research organization, which ranked it the 99th most difficult out of 104 nations, states and regions in 2016. Eve Warburton, a researcher at Australian National University who studies Indonesian resource nationalism, said that over the last decade Indonesian politicians had consistently been more assertive toward foreign mining companies. “Now it seems many people in government believe that Indonesia can afford to stay the nationalist path in the resources sectors,” she said. The conditions may be scaring off business. Last year Newmont, an American miner, sold its stake in Indonesia’s Batu Hijau copper mine after struggling to adjust to Indonesian regulations. Rio Tinto, the   company, has a deal to develop Grasberg with Freeport, but its chief executive suggested in February that the company might back out over the new rules. International analysts say Freeport’s contract might not be as   as many Indonesian government officials make it out to be. And despite the uncompromising statements from both sides, they say, a deal remains in reach. “I see this as smoke and mirrors,” said Bill Sullivan, a lawyer and mining analyst in Jakarta. “The government has no incentive whatsoever to make things so difficult for metal mineral producers that they won’t reach an agreement. Because of the government’s need for deep political cover, however, it has to relax the export ban in a way that does not make it look as though the government is caving in to metal mineral producers. ” Papua Province, where the Grasberg mine is, is Indonesia’s most restive and least developed, with a small independence movement that clashes with the military. Freeport pays about $20 million annually to the Indonesian government for security, including payments to Indonesia’s military, which has been linked to human rights abuses in the province. The payments have periodically drawn the scrutiny of human rights organizations as well as pension funds that invest in the company. But with Vice President Mike Pence scheduled to visit Indonesia in April, politicians here are unconcerned about effects on international relations. “I’m someone who is very happy with Donald Trump’s brilliant ideas and was glad to see him elected president,” said Mukhtar Tompo, an Indonesian legislator who has called for Freeport to be expelled from Indonesia. “As long as Donald Trump looks at things from every perspective, he will agree with our side. ”'"}, "time": 1742628303.7400496}