{"duration": 0.06720232963562012, "input_args": {"text": "'Pinterest \\nOregon militia leaders Ammon and Ryan Bundy, along with several others, were acquitted on Thursday in relation to their 41-day standoff at a federal wildlife refuge in Oregon earlier this year, CNN has reported . Shaun King wrote in the New York Daily News that the acquittal was an example of “white privilege.” \\nLiberal race-baiters have jumped to the fore in the wake of the acquittal to make such claims without any understanding of the case. \\nAccording to King, if these had been Black Lives Matter activists, they wouldn’t have been acquitted. Neither would Muslim-American activists in King’s racist world. \\nKing claimed that BLM protesters would be treated very differently: \\nImagine just for a moment that heavily-armed Black Lives Matter activists took over a federal building. It’s doubtful that such a siege would last longer than a day. By and large, unarmed, non-violent peaceful black protestors are arrested on sight when they even block the entrance to a federal building. Many are still facing charges for such simple acts of civil disobedience to this very day and they did nothing like what the Bundy clan did in Oregon. \\nSet aside the fact that King has no clue about what the Bundys did and why they did it — if he did he would understand why his comparison doesn’t hold water — he also doesn’t realize that we don’t have to imagine much here in relation to BLM activists. \\nWere BLM protesters “non-violent” when they blocked major highways? How about when they beat an innocent white man? What about the rampant looting of innocent store owners in the wake of officer involved shootings? Then there are the police officers whose lives have been ruined, despite the fact that the shootings were found to have been justified, because race-baiters jumped to conclusions and incited violence to further their agenda. \\nWe see an enormous amount of lawlessness committed in the wake of officer-involved shootings that has nothing to do with the “cause”— which is roundly debunked by the facts — but people like King still defend it. \\nWhen a black man is killed by police, the police are condemned before the facts are in and even after it’s shown that a particular shooting was justified. \\nI wonder if King and other race-baiters cared as much when Oregon militia leader LaVoy Finicum was killed in an officer-involved shooting. That’s not to say whether it was justified or not, but that never stops the racial grievance mongers from protesting and rioting, does it? What’s the only difference there? Oh, Finicum was white. \\nHere’s what King had so say about how Muslim activists would be treated: \\nOr imagine that an armed group of Muslim-American activists took over a federal building. I’m not talking about immigrants or people on the terrorist watch list, but just good, old fashioned American students who happened to be Muslims. Do you think they’d be allowed to continue their takeover for 41 days? Do you think they’d be acquitted at trial? Those young men would likely be taken to Gitmo. I’m not even kidding. \\nReally? So that’s why this country allows in refugees that we can’t properly vet and refuses to monitor known radical mosques…because things are so biased against Muslims? \\nApparently King has never heard of things called hate crime laws or affirmative action — two things that represent the true “systemic racism” plaguing this country. \\nWhat kind of “white privilege” did the more than 80 white people killed — including women and children — in the Waco siege have, Mr. King? \\nPeople like King really do live in a fantasy land of alleged racism, that is self-imposed by their inability and/or unwillingness to critically think for themselves. Then again, there’s a lot of money to be made in peddling racial division based on lies, so it certainly could be that as well… '"}, "time": 1742561788.211989}