{"duration": 0.13633227348327637, "input_args": {"text": "'  years after a   at Smith Barney sexually assaulted her at work, Lisa Mays says she still trembles when she tells the story. It was early one morning at the Walnut Creek, Calif. branch when a   broker, the only other person in the building, followed Ms. Mays into her office and backed her into a corner. “Before I knew it, he was lifting my skirt to get into my tights and I was begging him to stop,” she recalled in an interview. The assault was cut short when another employee arrived. “And then, he just walked away like nothing happened,” Ms. Mays said of her attacker. Ms. Mays, who worked as a wire operator, entering trade orders into the system for brokers, was one of 23 women who sued Smith Barney for sexual harassment and pay discrimination in an explosive   lawsuit filed 20 years ago this month. It became known as the “  room” suit, named after a basement party room at Smith Barney’s branch office in Garden City, N. Y. Nearly 2, 000 women joined the case, exposing the sordid antics of Wall Street’s   culture. Smith Barney paid $150 million in arbitration awards and settlements in the case, and it and other Wall Street firms rushed to set up   training, employee hotlines and programs to recruit women. Twenty years later, permanent change is less obvious. “You may no longer have strippers coming for afternoon entertainment, but that doesn’t mean you are treated as an equal,” said Anne C. Vladeck of the New York employment law firm Vladeck, Raskin  Clark. “It’s not quite as blatant as what went on in the   room, but it’s still there in a way that makes it very hard for women to succeed. Companies on Wall Street are just not changing. ” Complaints persist about pay and promotion disparities and a lack of women in senior management roles, and frustrations are growing about the limited ability of individuals to seek damages in court. Brokerage firms today say they deal swiftly with harassers and have developed programs to mentor and showcase   women. Branch managers at Morgan Stanley, which operated a brokerage joint venture with Smith Barney until acquiring it in 2013, can earn up to an additional $150, 000 a year by recruiting and developing diverse advisers, a spokesman said. Last year, nearly 50 percent of financial adviser trainees hired were female or members of minority groups, he added. He declined to say what percentage of the firm’s current brokers are women. Women are slowly joining the senior ranks of Wall Street firms. Last year, women at Deutsche Bank represented 20. 5 percent of the firm’s directors and managing directors, up from 17. 1 percent in 2011, according to its 2015 human resources report. Goldman Sachs’s latest class of managing directors was 25 percent female, the highest proportion since that title was created in the  . The least progress has been made in pay. Last week, a managing director at Bank of America Merrill Lynch filed a   complaint in federal court in New York, noting that her 2015 bonus was $1. 55 million while her male counterpart’s was $5. 5 million. The bank has a “bros club” culture, the complaint says. A bank spokesman said, “We take all allegations of inappropriate behavior seriously and investigate them thoroughly. ” Last year, women filled 31 percent of jobs in the “securities, commodities and financial services sales agents” group tracked by the Bureau of Labor Statistics, but they earned only 52 cents for every dollar that men made, according to a study released last month by the Institute for Women’s Policy Research in Washington. Among 119 job categories analyzed in the study, that group had the largest gender pay gap. By comparison, women on average make 79 cents for every dollar men make. “It’s unbelievable,” said Ariane Hegewisch, a program director at the institute and   of the study. “I get calls from women who have come across our work and they say, ‘What do I do? ’” Ms. Hegewisch said that today’s female brokers repeatedly complain that men are circumventing reforms. The 1996 suit against Smith Barney, as well as one in 1997 against Merrill Lynch, drew attention to the widespread practice of branch managers’ excluding of women when it was time to assign the accounts of departing brokers. Morgan Stanley’s spokesman said the company today uses a formulaic,   process for distributing accounts. Ms. Hegewisch said, however, that senior male brokers at some firms were “forming teams of young white guys to work with old white guys, which means the accounts stay on the team and don’t get distributed” when older brokers retire. In the   room era, some women complained that they couldn’t become brokers at all. Roberta Thomann, a former sales assistant and one of the three women in the Smith Barney Garden City office who initiated the lawsuit, said in an interview that her bosses stopped her from studying for the exam to become a broker. “They gave my books to a male sales assistant so that he could study,” Ms. Thomann said. “I never even got a chance. ” Linda D. Friedman, one of the lawyers who represented Ms. Thomann and the others, said that would not happen today. Neither would the “open and celebrated” brand of harassment of that era, she said. Still, big producers can get special treatment. Ms. Mays’s attacker, for example, worked at Smith Barney, and then Morgan Stanley, for another 24 years after the episode at her office, despite her having reported it to his supervisor. Julie   a former compliance supervisor at Deutsche Bank Securities, said in a 2010 lawsuit that a   was promoted to managing director “despite having such a poor record on sexual harassment that DB will not permit him to have a female administrative assistant. ” In court papers, Deutsche Bank denied the allegation. In an email statement, a Deutsche Bank spokeswoman said it promptly investigates allegations of gender discrimination and takes disciplinary action where appropriate. Some of the behavior depicted in cases rivals the indignities of the   room, the Smith Barney party room that the lead plaintiff, Pamela K. Martens, had visited once, only to be grabbed by her branch manager and kissed on the lips. Maria Garcia, a former Barclays Capital sales executive, described a similar incident at a conference in Bogotá, Colombia, in 2011, in her discrimination case, which is still in progress. In her complaint, Ms. Garcia said she was at a business dinner when a male director at Barclays stopped by and kissed her on the lips in front of members of her team. She said that when she told her boss about the episode after returning to New York, he made it clear that he preferred she not report it to human resources. A Barclays spokesman said the firm denies that Ms. Garcia was subjected to unlawful treatment. A manager who left Deutsche Bank in 2010 was described in a deposition as being so intoxicated during an evening out that he “urinated against a wall in front of his employees. ” In a court filing, the bank called the incident “hearsay. ” To Ms. Martens, who was a broker at Smith Barney, the biggest disappointment is that mandatory arbitration persists. She opted out of the settlement over the issue and never received money from the case. The Smith Barney litigants devoted eight of their complaint’s 41 pages to criticisms of the practice of forcing employees to arbitrate civil rights claims. “We felt that the underpinning of this abuse, whether it was physical abuse or sexual abuse or sexual assaults or sexual harassment, was the private justice system that Wall Street had carved out for itself,” Ms. Martens said in an interview. “I wanted to come away with ending mandatory arbitration for the entire industry, but, at a minimum, for civil rights cases. ” She did not get her wish. Ms. Friedman, the lawyer, said that about 90 percent of the Wall Street women she represents do not have the option of going to court today. Typically, they agree to this in a “Dear Prospective Employee” letter that must be signed if they want the job, she said. Increasingly, firms are prohibiting employees from participating in class actions. Morgan Stanley has mandatory arbitration and a   waiver. “You couldn’t bring the   room case today,” Ms. Friedman said. “The biggest problem we face now is that the courthouse doors are closing. ”'"}, "time": 1742562697.1899598}