{"duration": 0.05030345916748047, "input_args": {"text": "'Get short URL 0 6 0 0 US Department of State spokeswoman Julia Mason said that Washington is fully confident that bilateral relations with Philippines remain strong, including in trade, investment and remittances. © AFP 2016/ THOMAS PETER Philippines Understands China, Not US Its \\'Real Friend\\' WASHINGTON (Sputnik) — The United States expects the current government of the Philippines to continue fulfilling the country’s obligations under a military alliance with Washington, Department of State spokeswoman Julia Mason told Sputnik on Wednesday. “US forces have been providing support and assistance in the southern Philippines for many years, at the request of several different Philippine administrations,” Mason said. “We will continue to honor our alliance commitments, and we expect the Philippines to do the same. We will work closely with the government of the Philippines to address any concerns they may have.” \\nShe emphasized that the countries’ military-to-military relationship remains robust and multifaceted, including joint work on matters of national security as well as responses to natural disasters and other crises. \\nThe State Department spokeswoman’s remarks follow statements by Philippine President Rodrigo Duterte earlier Wednesday that all foreign military forces would be withdrawn from his country within two years. “We’ve seen a lot of this sort of troubling rhetoric recently, and this is not a positive trend,” Mason said. “This recent string of comments does not reflect the warmth, breadth and depth of the US-Philippines partnership.” © REUTERS/ Ng Han Guan/Pool Philippines Turning Away From \\'Unilateral Ties\\' With US to \\'Diversified Contacts\\' With China, Russia Mason stressed that Washington is fully confident that bilateral relations remain strong, including in trade, investment and remittances. “As we have stated, we continue to focus on our broad relationship with the Philippines and will work together in the many areas of mutual interest to improve the livelihoods of the Philippine people and uphold our shared democratic values,” she explained. \\nDuterte made his statement during a three-day visit to Japan, Mason noted. “We welcome the Philippines having strong, productive relationships with other neighbors in the Asia-Pacific region,” she said. “This is not a zero-sum game; we don’t think that the Philippines, or indeed any country, should choose between good relations with the US and with another partner.” \\nDuterte recently said it was time for Manila to \"say goodbye\" to the United States’ long use of Philippine land for military bases, and on a visit to Beijing he announced his country was separating from the United States in order to realign with China. ...'"}, "time": 1742562650.707566}