{"duration": 0.05881857872009277, "input_args": {"text": "'The Wall Street lawyer Walter J. Clayton does not travel in political circles, nor is he well known in corporate America. He is the insider’s insider  —   a deal maker. As such, his nomination to lead the Securities and Exchange Commission is a strong signal that financial regulation in the Trump administration will emphasize helping companies raise capital in the public markets over tightening regulation. In contrast, the agency’s two chairwomen under President Obama had regulatory or enforcement backgrounds. Mr. Clayton, known as Jay, has spent nearly his entire career in corporate boardrooms. His regulatory experience stems from advising banks on dealings with the government and helping several financial institutions with their settlements related to mortgage securities. He had a   seat to the financial crisis, advising Barclays Capital in buying the assets of the bankrupt Lehman Brothers in 2008 and Bear Stearns in its fire sale to JPMorgan Chase in 2007. He has advised on mergers and initial public offerings, including the biggest ever, the $25 billion offering by Alibaba Group of China in 2013. If Mr. Clayton is confirmed, he may have to recuse himself from some matters. A similar scrutiny was applied to Mary Jo White, the agency’s current chairwoman. She had been a litigator at Debevoise  Plimpton, where her clients included JPMorgan Chase, Rupert Murdoch’s News Corporation and Kenneth D. Lewis, a former Bank of America chief executive. Still, such recusals are not unusual. Laura S. Unger, a former commissioner and acting chairwoman, said that during her tenure, she had to recuse herself from a number of matters before the commission. She said the process of deciding when to recuse oneself often took place in consultation with the commission’s ethics officer. “An ethics officer at the S. E. C. knows all of your intimate details, and the ethics officer flags for you what may be potential conflicts,” she noted. Yet Mr. Clayton’s nomination will be sure to fuel criticism that Goldman Sachs could wield too much influence in the Trump administration. Sullivan  Cromwell, where Mr. Clayton is a partner, has been Goldman’s   law firm for more than a century. Mr. Clayton advised Goldman Sachs on perhaps its most important deal, the $5 billion investment by Warren E. Buffett’s Berkshire Hathaway amid the financial crisis. Mr. Clayton’s wife works as a   adviser at Goldman. The S. E. C. nomination follows the appointment of Goldman’s No. 2 executive, Gary D. Cohn, to be the top economic policy adviser to   Donald J. Trump, and the selection of a hedge fund manager who was a former Goldman trader, Steven T. Mnuchin, to be Treasury secretary. Mr. Trump’s chief strategist, Stephen K. Bannon, is a former Goldman banker. During the presidential campaign, Mr. Trump had repeatedly criticized Goldman Sachs as an emblem of a financial elite. Mr. Trump, who met with Mr. Clayton on Dec. 22, said in a statement that the lawyer “will ensure our financial institutions can thrive and create jobs while playing by the rules at the same time. ” Mr. Clayton is expected to face scrutiny on his confirmation as a Sullivan  Cromwell colleague, H. Rodgin Cohen, did in 2009. Mr. Cohen, the dean of Wall Street lawyers, withdrew his name from consideration for a senior Treasury role amid an outcry over his deep involvement in nearly all the bank deals struck during the financial crisis. “It’s hard to see how an attorney who spent his career helping Wall Street beat the rap will keep   Trump’s promise to stop big banks and hedge funds from ‘getting away with murder,’” Senator Sherrod Brown, Democrat of Ohio, said. “I look forward to hearing how Mr. Clayton will protect retirees and savers from being exploited, demand real accountability from financial institutions the S. E. C. oversees and work to prevent another financial crisis. ” One issue could be Mr. Clayton’s representation of Alibaba. The Chinese   giant is under investigation by the S. E. C. over its accounting practices. Mr. Clayton also represented   Capital Management in its $1. 2 billion initial public offering a decade ago, and subsequent offerings and financing. A unit of the New   hedge fund pleaded guilty for what federal prosecutors said were more than $100 million in bribes paid to officials in African countries. The hedge fund was forced to pay a $400 million settlement. Government authorities said in September that they were still investigating individuals related to case. Another issue could be a 2011 report critical of the government’s enforcement of the Foreign Corrupt Practices Act, which argued that “the current   regime” was “causing lasting harm to the competitiveness of U. S. regulated companies and the U. S. capital markets. ” Mr. Clayton was the chairman of the New York City bar association committee that drafted the report. Requests to speak with Mr. Clayton at Sullivan  Cromwell were not answered. A number of fellow deal lawyers said they were glad that the    practitioner could be at the helm of the S. E. C. “He’s a very smart, pragmatic guy who has real deal experience and has seen this stuff firsthand,” said Richard Truesdell, a head of Davis Polk’s global capital markets group, who has worked with Mr. Clayton on several deals. “There’s been a lot of buzz today, and I have yet to talk to anyone who isn’t pleasantly surprised by the choice. ” The role of the Securities and Exchange Commission is to protect investors and enable companies to raise capital through the public markets in a way that fosters economic growth. The latter is a key tenet of Mr. Trump’s economic plan, with the aim that companies can use the excess capital to create jobs. Harvey Pitt, a former chairman of the S. E. C. appointed by President George W. Bush, said Mr. Clayton was a “  appointment. ” “It is especially logical with respect to the agency’s obligation to promote capital formation, a subject with which the incoming administration is appropriately concerned,” said Mr. Pitt in an email. “Mr. Clayton’s background is very impressive  —   both for the depth of his experience, and for the quality of his efforts. ” Mr. Clayton went to the University of Pennsylvania and the University of Cambridge for separate bachelor’s degrees and then obtained his law degree from the University of Pennsylvania Law School. Mr. Clayton donated to Mitt Romney and Mr. Obama in previous presidential elections and to Jeb Bush’s primary campaign in 2015, according to public records. Those who know Mr. Clayton describe him as the     type, a doer who is often in the shadows of the better known Mr. Cohen at Sullivan  Cromwell. “When I think about the position, the guy has a really deep understanding of the capital markets and financial regulatory matters, so he checks those boxes,” said Brad Whitman, vice chairman in mergers and acquisitions at Morgan Stanley, who has worked with Mr. Clayton over many years. “He’s got a great appreciation for what drives business and growth. ”'"}, "time": 1742628500.1089}