{"duration": 0.06321501731872559, "input_args": {"text": "'STORE Trump’s blueprint may soon cross the pond to effect Europe’s elections \\nPerhaps one of the biggest ironies in this year’s historic election was how often the media and the pundits tried to both tell and get Donald Trump to ‘act’ more presidential. And at the heart of this irony was the fact that Trump’s demeanor was no different than some of the greatest Presidents in America’s history when you study the likes of Andrew Jackson and Teddy Roosevelt. \\nIn the end however, Donald Trump’s personality was a perfect mixture of determination coupled with a dash of bombastic that helped create a whirlwind which energized a nation into pulling off the greatest upset in political history. \\nIn times of political and societal change it is charisma, far more than ability, that most often wins the race. And in a year where the world was shocked by the Brexit vote in the UK, and the Chicago Cubs coming back from a 3-1 deficit to win the world series, those who can tap into the ethereal energy of that change will accomplish the impossible no matter what people think or believe. \\nAnd going forward the ongoing frequency shift that has is occurring right now, just as it has occurred in a cyclical fashion throughout history, still has a long way to playing itself out. And with that in mind the next potential nexus point of extreme change is emerging in the scheduled referendums and elections over in Europe that will take place over the next six months. \\nDaniela Schwarzer, director of research at the German Council on Foreign Relations (DGAP), said Trump’s bare-fisted tactics against his opponents and the media provided a model for populist European parties that have exercised comparative restraint on a continent that still remembers World War Two. “The broken taboos, the extent of political conflict, the aggression that we’ve seen from Trump, this can widen the scope of what becomes thinkable in our own political culture, ” Schwarzer said. \\nPerhaps it is not the “political conflict” or aggression from Trump that Daniela is worried about; perhaps it is the threat of a truly democratic vote in a world in which all the benefits of crony capitalism and suppressed representation have gone exclusively to the 1%, something which is now openly known and resented by the rest of the increasingly angry population. And, as both Brexit and Trump have shown, an angry, education population is the worst possible enemy of any elitist, globalist clique. \\nItaly and Austria \\nEurope will get the first taste of its own “Trump Moment” as early as next month, when on December 4 Austrians will vote in a presidential election that could see Norbert Hofer of the Freedom Party become the first far-right head of state to be freely elected in western Europe since 1945. On the same day, a constitutional reform referendum on which Prime Minister Renzi has staked his future could upset the political order in Italy, pushing Grillo’s left-wing 5-Star movement closer to the reins of power. \\nChanneling Donald Trump, local Euroskeptic politician and comedian, Beppe Grillo said that “an epoch has gone up in flames . The real demagogues are the press, intellectuals, who are anchored to a world that no longer exists.” – Zerohedge \\nPolitics today is most often ruled by tradition and expectations, with things like lies, obfuscation, and corruption being accepted parts of the process. But as Donald Trump proved in the last two years leading up to the results of Nov. 8, the right person or movement can not only supersede establishment machines, but in very real ways it can also destroy them. \\nSix months ago no one would have imagined that Britain would have voted to leave the European Union, especially after nations such as Greece willingly stayed in the coalition despite the treatment they were given by member states and banking interests. But we are no longer in a frequency of normal, and before this paradigm shift is finally completed impossible phenomenons like Trump winning the Presidency will be just one of many changes that will alter the entire landscape of Europe, America, and the world. \\nKenneth Schortgen Jr is a writer for The Daily Economist , Secretsofthefed.com , Roguemoney.net , and Viral Liberty , and hosts the popular youtube podcast on Mondays, Wednesdays and Fridays. Ken can also be heard Wednesday afternoons giving an weekly economic report on the Angel Clark radio show . '"}, "time": 1742563251.941468}