{"duration": 0.0758364200592041, "input_args": {"text": "'In his first live “Late Show” broadcast since the start of the Republican National Convention, Stephen Colbert promised the return of an old friend from his   days, but instead, viewers got to see two familiar faces: first, Jon Stewart, the longtime host of “The Daily Show,” and then “Stephen Colbert,” the unctuous conservative commentator that Mr. Colbert portrayed for nearly a decade on his Comedy Central program, “The Colbert Report. ” The guest appearances from Mr. Stewart and that other Mr. Colbert appear to have paid off for “The Late Show. ” According to preliminary ratings information on Tuesday, “The Late Show” was the No. 1 broadcast   show in overall viewership on Monday night, the first time the program has surpassed all its competitors (including Jimmy Fallon’s “Tonight” show on NBC and “Jimmy Kimmel Live” on ABC) since Feb. 15. “The Late Show” announced in June that it would present two weeks of live broadcasts, Monday through Thursday, to air after each night of the Republican and Democratic conventions. Though the current iteration of the program made its debut to considerable fanfare in September, it has had trouble finding a consistent voice under Mr. Colbert, who succeeded David Letterman as host and who has tried to expand his horizons beyond the irreverent political comedy he performed on “The Colbert Report. ” Monday’s installment of “The Late Show” on CBS began with an elaborate, pretaped musical number performed by Mr. Colbert, paying satirical tribute to the Republican convention in Cleveland and the party’s presumptive presidential nominee, Donald J. Trump. (As Mr. Colbert sang: “This week, you and me, we will witness history   As the R. N. C. crowns their orange manatee. ”) The host followed with a live monologue in which he riffed on moments from the first night of convention and Mr. Trump’s “60 Minutes” interview with his running mate, Gov. Mike Pence of Indiana. Later, a taped comedy sketch followed Mr. Colbert to what appeared to be an isolated cabin in the woods, where he knocked on its door and was greeted by a bearded,   Mr. Stewart, who was Mr. Colbert’s boss for many years at “The Daily Show” and is now an executive producer of “The Late Show. ” Alerting Mr. Stewart that it was once again time for a Republican convention, an animated Mr. Colbert told him, “You will not believe who the nominee is. ” He paused to let Mr. Stewart take a sizable drink of water from a mug, then told him, “It’s Donald Trump,” at which point Mr. Stewart doused him in a sizable spit take. The sketch revealed that Mr. Stewart had been sharing his cabin with the Colbert character (brandishing a sword and a Captain America shield). And then “Stephen Colbert” (still holding the sword and shield) returned to the Ed Sullivan Theater and performed a new edition of “The Word,” a recurring segment from “The Colbert Report,” which ran from 2005 to 2014. Just as “The Colbert Report” helped introduce audiences to the word “truthiness,” Mr. Colbert used this latest installment to contemplate the condition of “Trumpiness”: “Remember, elections aren’t about what voters think, it’s about what voters feel. And right now, at least half of Americans feel their voices aren’t being heard. ” (An onscreen graphic delivered the punch line: “Especially Mike Pence. ”) After a commercial break, Mr. Colbert returned as  —   presumably  —   himself. “It was really great to see Jon Stewart again,” he said. With a knowing smile, he added: “You know what would be nice? To have that happen again some time this week. ”'"}, "time": 1742564243.1714783}