{"duration": 0.06440067291259766, "input_args": {"text": "'Last night, Donald Trump soundly won the presidential election and defeated former Secretary of State Hillary Clinton. Clinton was a problematic candidate from the beginning, and only secured the nomination because she was backed by arrogant party elites. \\nTrump’s victory was due in no small part to his gains in the so-called rust belt , where he pulled out victories in Ohio, Wisconsin, and Pennsylvania (Michigan remains too close to call currently). Trump promised to bring back manufacturing jobs to the region by renegotiating trade deals such as NAFTA. He also called for placing tariffs on foreign goods to discourage unfair competition, such as when foreign countries manipulate their currency. Usually, Trump singles out China for currency manipulation.\\nIt is no surprise that people living in depressed areas, where manufacturing jobs were shipped overseas, found Trump’s promise appealing and abandoned the Democratic Party’s Wall Street-backed candidate.\\nBut what about the rest of Trump’s economic program? According to the Trump campaign’s website , Trump will create 25 million new jobs by increasing GDP to 4% each year through the new trade agenda, rolling back federal regulations, repealing Obamacare, and tax reform.\\n4% would be a massive increase in GDP, which currently hovers around 2% . In a speech before the New York Economic Club, Trump admitted few economists agree that he can reach a 4% annual GDP growth rate, though he labeled that as “cynicism.” \\nTrump has also made late additions to his tax reform plan, which currently includes a new deduction for child care expenses, an initiative spearheaded by Trump’s daughter, Ivanka. Also part of the current plan is a 20% tax cut for corporations, from 35% to 15%. Trump correctly notes that corporations rarely actually pay the 35% rate anyway.\\nThe rest of the tax code gets a makeover. Trump plans to take the current seven tax brackets down to three, with the top income tax being 33% and the top capital gains rate being 20%. Lower income Americans will arguably pay more as the lowest income rate will go from 10 to 12% and the overall burden on the wealthy will be reduced by the corporate and income tax cuts.\\nBut more to the point, there is little evidence to support the supply-side contention that lower taxes increase economic growth. For Trump to hit his 4% GDP number, he will have to rely on deregulation, repealing Obamacare, and gains from America First trade policies to drive the largest economy in the world into historically high growth.\\nThe post Trump’s Economic Program Set For Rough Reality appeared first on Shadowproof .'"}, "time": 1742564488.2038503}