{"duration": 0.10536885261535645, "input_args": {"text": "'If you love a good spy story, no doubt Tuesday you’ll tune in for the latest in a gripping serial about Russian operatives using duplicity and “kompromat” to undermine American democracy. But once you’re done watching the news, might I suggest “The Americans”? Yeah, it’s a cheap joke. But if television’s best drama finally gets the buzz it deserves because evidence of Russian interference in the 2016 election served as viral marketing  —   well, as Comrade Trotsky once said, “The end may justify the means as long as there is something that justifies the end. ” If you’re new to the series (the first four seasons are on Amazon Prime) it follows Elizabeth and Philip Jennings (Keri Russell and Matthew Rhys) married K. G. B. agents posing as travel agents in suburban Virginia during the Reagan era. While raising two American children, they’ve donned fabulous wigs, ferreted out military secrets and killed innocents in service of the fading Soviet empire  —   all to a     soundtrack. When the first season, in 2013, had Elizabeth and Philip bug the home of Secretary of Defense Caspar Weinberger, it seemed outlandish enough. A writer who suggested a successful   to help install Russia’s preferred United States presidential candidate would have been laughed out of the room. In the light of today’s headlines, this Cold War drama feels newly relevant  —   but also almost comfortingly  . In the 1980s of “The Americans,” the    lines are at least clear. Ronald Reagan denounced the “Evil Empire,” whereas President Trump’s top adviser, Stephen K. Bannon, has been quoted comparing himself to Lenin. But the series’ nuanced depiction of espionage as grinding emotional labor is still enthralling. Season 5, which begins Tuesday on FX, finds the Jenningses’ entanglements deepening. Their teenage daughter, Paige (Holly Taylor) having learned that her parents are spies, is being groomed for the family business. She’s also dating the son of their neighbor Stan Beeman (Noah Emmerich) who happens to be an F. B. I. agent. (Philip also has a   grown son, who unbeknown to Philip is wending his way to America for a surprise family reunion.) Philip and Elizabeth, meanwhile, have been assigned to befriend a Soviet defector who consults for the United States Agriculture Department. There’s a grain shortage in the Soviet Union, and the Russians suspect American sabotage. This is hardly the first time these spies have had to create false intimacy: They’ve made friends and betrayed them, had sex with contacts  —   Philip even married an F. B. I. secretary (Alison Wright) under another identity. Love, in “The Americans,” is a kind of biological weapon. Over four seasons, “The Americans” has used relationships as a window into geopolitics. For Elizabeth and Philip, whose very marriage was arranged by the state, there is no boundary between family and service. That’s become true for Paige as well. Season 5’s   story line inverts this dynamic by framing the Soviet Union as a kind of vast, dysfunctional family. If Mother Russia can’t put food on the table, her children are bound to start asking questions. Sometimes, as with Elizabeth  —   the more militant of the couple  —   the impulse will be to defend and rationalize. Philip, on the other hand, loves his homeland, wants to believe in it, but can’t deny the evidence. The Soviet Union is a massive country, he says: “Why can’t we grow enough grain ourselves?” He’s a little like Paige  —   growing up, realizing his parents are complicated and imperfect. “The Americans” has always had a   melancholy, partly because of the historical setting. We knew, after all, that Elizabeth and Philip, even if they were America’s enemies, were fighting for a doomed cause. But how doomed was it? The election scandal, Russia’s muscle flexing in Europe and, well, whatever is going on between Vladimir V. Putin and President Trump, inevitably make the series play differently. For instance, when “The Americans” began, one would have assumed things would end badly for the Jenningses. They still might. Communism did fall, after all. But Mr. Putin was a K. G. B. officer, and he landed on his feet. And the series’ premise was based partly on the case of the Russian sleeper agent Anna Chapman, who was arrested and deported from the United States in 2010. She’s resurfaced as a model, posting glamour photos with nationalist and   captions on Instagram. “The Americans” is scheduled to end after its sixth season. Maybe it can write Elizabeth and Philip a   epilogue, now that it turns out there are second acts in Russian lives.'"}, "time": 1742561768.959081}