{"duration": 1.7788889408111572, "input_args": {"text": "'A’u2009man was on a train in Japan, reading a novel set in Japan. The train slid past the mountains, bound for Kyoto, where the man, bearded,   was headed. The year was 1989. The train was a bullet train. The man on the train was in a quandary, and the man in the novel he was reading was in a quandary and as he read the novel, it emerged that his quandary and the one in the novel were essentially the same. The man in the novel was Sebastian Rodrigues, a Portuguese Jesuit priest sent to Japan in the 17th century. He was there to minister to Japanese Catholics suffering under a brutal regime and also to find out what had happened to his mentor, a priest rumored to have renounced the faith under torture. The man on the train was Martin Scorsese. He was in Japan to play the part of Vincent van Gogh in a movie by Akira Kurosawa, another master filmmaker. He was also there to move past a brutal battle in America’s culture wars over a picture of his, “The Last Temptation of Christ. ” The film had been pilloried by conservative Christians for a dream sequence in which Christ has sex with Mary Magdalene. In depicting Christ’s life as a   struggle between his human and divine natures, Scorsese had intended to make a film that was at once an act of doubt and an act of faith. In the novel he was reading, the priest was shown profaning an image of Christ, and yet the act was an act of faith. The train slid past the mountains. Scorsese turned the pages. This novel spoke to him. All at once he saw it as a picture he would like to make. The novel was “Silence,” by Shusaku Endo, a Japanese convert steeped in European literature and the history of Catholicism in Japan. Published in Japan in 1966, “Silence” sold 800, 000 copies, a huge number in that country. Endo was called “the Japanese Graham Greene” and was considered for the Nobel Prize. Greene referred to “Silence” as “one of the finest novels of our time. ” The Jesuit missionary Francis Xavier brought Catholicism to Japan in 1549. In the next century, it was suppressed through the torture of missionaries and their followers, who were forced to apostatize by stepping on the fumie  —   a piece of copper impressed with an image of Christ. In “Silence,” Endo took the missionaries’ point of view, casting much of the novel in the form of letters by Rodrigues reporting back to his superior. He goes to Japan with another young priest, Francisco Garrpe, vowing to seek the truth about their mentor, Father Cristóvão Ferreira, but they are captured and shown the   reality of human suffering under torture. The shogunate invites the Japanese converts to avoid torture by stepping on the fumie. Many do some are tortured anyway. Rodrigues sees converts crucified, burned alive, drowned. A magistrate fluent in Christianity makes a grim proposal: Rodrigues can save the lives of the converts under torture if only he will step on the fumie and apostatize. When Scorsese returned from Japan, he procured the film rights to “Silence. ” As the years passed, hardly a day went by without his mentioning the project to the people around him: actors, friends and even his old parish priest, Father Principe. As he made “The Aviator” and “The Departed,” “Shutter Island” and “Hugo,” he insisted that “Silence” was the picture he really wanted to make. A Jesuit was elected pope Islamic terrorists began targeting Christians in the Middle East. In 2014, with “The Wolf of Wall Street” a hit, Scorsese declared that “Silence” would be his next picture: He wouldn’t commit to another until it was finished.   years in, filming began. What led this great American artist to make a story of missionaries in Japan his ultimate passion project? He is known for his gangster pictures he is a grandmaster of the profane. From the beginning, he has revealed himself to be an artist of intensely Catholic preoccupations, and the poisoned arrow of religious conflict runs straight through his career. “Taxi Driver”: a Vietnam vet as a spiritual avenger, bent on cleansing the city of filth through violence. “Cape Fear”: a tattooed fundamentalist determined to exact God’s justice. “Kundun”: a young man raised to be a spiritual master, thrust up against   communism. Even “Living in the Material World,” Scorsese’s documentary about George Harrison, takes as its theme the conflict between flesh and spirit, between Beatle and seeker. “Silence” is a novel for our time: It locates, in the missionary past, so many of the religious matters that vex us in the postsecular present  —   the claims to universal truths in diverse societies, the conflict between a profession of faith and the expression of it, and the seeming silence of God while believers are drawn into violence on his behalf. As material for Scorsese, then, “Silence” is apt, and yet Scorsese’s commitment to it has been extraordinary, even by his exacting standards. To understand that commitment, I spoke with the filmmaker, with members of the cast and the production team and with others who know the novel well  —   trying to grasp just what kind of an act of faith this film is. “I don’t know if there’s redemption, but there is such a thing as trying to get it right,” Scorsese said to me, in the ungentrified New York voice familiar from the cameos in his movies. “But how do you do it? The right way to live has to do with selflessness. I believe that. But how does one act that out? I don’t think you practice it consciously. It has to be something that develops in you  —   maybe through a lot of mistakes. ” He had invited me to his East Side townhouse at 9 p. m. having spent a full day editing “Silence” in Midtown. The living room,     is decorated with a vintage movie camera,   posters for Jean Renoir’s “The Grand Illusion” and photographs of his wife and daughter. He is 74, compact and gray, with tremendous life in his eyes and a youthful ardor that seems to have its source in reverence for his elders  —   like the Polish filmmaker Andrzej Wajda, who had signed a storyboard that Scorsese unhooked from the wall to show me. We took seats, and he began to talk. As the hours passed, the room, already dark, seemed to diminish around us, until it resembled a screening room, or a chapel, a place where questions of how to live are posed through stories and images. “It goes back to what Father Principe was telling me the last time I saw him, a couple of years ago,” he said. “Failing, doing something that is morally reprehensible, that is a great sin  —   well, many people will never come back from that. But the Christian way would be to get up and try again. Maybe not consciously, but you get yourself into a situation where you can make another choice. And that’s the situation Rodrigues is in”  —   he can choose to save the lives of others by renouncing his faith, the act he considers most reprehensible of all. “Silence,” no less than Scorsese’s informal New York trilogy  —   “Mean Streets,” “Taxi Driver,” “Raging Bull”  —   is rooted in his childhood. As a boy in Little Italy, he wanted to be a missionary. His parents were not religious, in part because their parents had felt the church’s heavy hand in Sicily, but for him the church  —   a malign force in so many    stories  —   was a portal to the world beyond family and neighborhood. “I trusted the church, because it made sense, what they preached, what they taught,” he said. “I understood that there’s another way to think, outside the closed, hidden, frightened, tough world I grew up in. ” The movies, likewise, pointed to the wider world. His father, a presser in the garment district, didn’t make much but always had enough money to take him to the movies. A local TV station broadcast Italian films on Friday nights. He grew up watching the crucial works of Italian neorealism, many of them with a strong Catholic dimension  —   like Roberto Rossellini’s “Rome, Open City,” in which a priest is executed for cooperating with the Resistance. The   Catholicism of the area was centered on street processions devoted to saints brought over from the old country: San Gandolfo for the Sicilians on Elizabeth Street, San Gennaro for the Neapolitans on Mulberry Street. “When I was there, it was already dying out,” Scorsese told me. It hooked him even so. The vast, vaulted interior of St. Patrick’s Old Cathedral on Mott Street was a sharp contrast to the family’s small apartment, the Latin Mass a formal counterpoint to their mealtime banter. “I think fast, I move fast, and I think it has something to do with the medication I was given for asthma,” Scorsese said. “It affected the way I breathe, the way I think. I needed to pull back. Film did that for me, and so did the church. They slowed me down. They allowed me to meditate. They gave me a different sense of time. ” Francis Principe, a young priest assigned to the neighborhood, brought faith and film together. “He was the one who opened up things for us,” Scorsese recalled. “Who said: ‘You don’t have to live this way. You don’t have to follow in this cultural cycle. You don’t have to get married at 21. ’’u2009” Scorsese had become an altar boy, and each year Principe would take the altar boys to a movie uptown  —   “Around the World in 80 Days,” “The Bridge on the River Kwai”  —   and sit talking about it with them afterward on the steps of the rectory on Mulberry Street. They went to the Roxy near Times Square to see the Gospel drama “The Robe” and then heard him put it down. “Father Principe detested Christian sentimentality or   religious aspects,” Scorsese said. “’u2009‘Oh, it’s so cliché,’ he said, meaning the thunder when Judas mentions his name  —   ‘My name is Judas,’ and there’s the thunder in stereophonic sound. To this day I haven’t heard thunder as good as that. ” And yet  —   at age 11  —   he conceived of the wish to do it differently, “to take the biblical epic to another place. ” Faith and film offset the asthma that kept him out of sports and off the streets. Indoors, he drew movie storyboards, including some, a few years later, for a life of Christ. “I set it right in the neighborhood,” he told me, “with the crucifixion taking place on the West Side piers and the N. Y. P. D. involved. Can you see it?” Indoors, he had a   seat for adult matters, especially his father’s dealings with a spendthrift uncle who seemed to take money from his father freely and with impunity to pay the loan shark. It was a pattern he knew from the Scripture passages read in church. “My brother’s keeper  —   it’s my brother’s keeper!” he said, chortling with recognition. “And it goes beyond your brother. Are we responsible for other people? What is our obligation, when somebody does something that is so upsetting? . .. Do you really have to do it because they’re a brother, or you’re related, or you made vows of marriage? What is the right thing to do for the other person, and for yourself? All of this carried through. I would see it acted out one way in reality, and I would hear it another way from Father Principe and a couple of priests at Cardinal Hayes. ” Cardinal Hayes is a high school in the Bronx, and after a year of minor seminary  —   a tryout for the priesthood once a regular stop for bright Catholic boys of limited means  —   Scorsese went there. (Don DeLillo, the novelist, was a few years ahead.) Rejected by Fordham University because of poor grades, Scorsese enrolled at N. Y. U. ’s Washington Square College and its film program. From there, he plunged into the ’60s: a concertgoer at the Fillmore East, an expatriate in England and Holland, an assistant director at Woodstock (he became an editor on the concert film) and then a maker of his own movies  —   “Who’s That Knocking at My Door,” about a young man in the suddenly liberated ’60s whose Catholic principles keep him out of bed with his girlfriend, and “Boxcar Bertha,” a film about a female   “free’er than most. ” When he returned to Little Italy in 1972 to make “Mean Streets,” some of the young men in his generation were stepping into the underworld roles their fathers had occupied. Early in the picture, Charlie, an   mobster played by Harvey Keitel, talks about going to confession in the old cathedral. He wishes he could choose his own penance instead of having one assigned by the priest. He gets his wish, in a way: It falls to him to look out for Johnny Boy, played by Robert De Niro  —   the lost boy of the neighborhood, a reckless gambler who puts them both in danger. Charlie becomes his brother’s keeper  —   and Charlie, eager to rise in the mob, lets his friend dangle without reaching out to the powerful uncle who could save him. Pauline Kael, in The New Yorker, struck a biblical note: “Charlie talks a lot to Johnny Boy about friendship and does nothing. He’s Judas the betrayer. ” It is striking to see the brother’  pattern show up at the other end of Scorsese’s career, in “Silence. ” As the two Jesuits set out for Japan, they find a translator named Kichijiro in a seedy neighborhood and drag him into their mission. He resists. He drinks himself sick. He lies. He bemoans his fate. A convert, he apostatized and was allowed to live, while the shogunate killed his brothers and sisters. Rodrigues decides that he is Kichijiro’s keeper and grimly bears up as Kichijiro apostatizes again and again and finally betrays him to the shogunate. But as Rodrigues is racked by doubts, the peasant becomes the priest’s keeper, a man whose faith is rooted in his recognition of his own weakness. Who is more Christlike: the person who is strong in faith or the one who is weak, who is humiliated? “Humiliation: That’s the key,” Scorsese told me. “As Kichijiro says in the movie: ‘Where is the place for a weak person in the world we’re in? Why wasn’t I born when there wasn’t any persecution? I would have been a great Christian. ’’u2009” For half a century, Scorsese has been a missionary for the cinema: making his own movies, promoting the work of great international directors, consolidating the history of the medium in a brilliant group of documentaries and advocating for the preservation of classics. Over time, this picture of his about a missionary adventure became a mission in its own right, and the act of getting it made became an act of faith. “I knew he had this script and was terribly disappointed that he couldn’t get it made,” Irwin Winkler, who produced “Raging Bull” and “Goodfellas,” told me. “And I thought, What a sad state Hollywood is in when Martin Scorsese, with all his success, with all the honors he’s gotten, can’t get a movie made. ” There began an intense collective effort guided by Emma Tillinger Koskoff, the film’s producer, to make the project materialize. Winkler worked through dozens of legal disputes attached to the project. Randall Emmett, a producer, secured new funding, and in 2013 Scorsese and some associates went to Cannes and returned with $21 million in distribution commitments. “I don’t think he’d ever done that before,” Koskoff told me, “but for this picture he has done a lot of things he hadn’t done before. ” He would direct the picture without a fee. All the principal actors  —   Andrew Garfield, Adam Driver, Liam Neeson  —   have   pedigrees but would work for Screen Actors Guild “scale” or for greatly reduced fees (“a pittance,” Neeson called it, uncomplainingly). Paramount Pictures signed on as the U. S. distributor in 2014. Koskoff and the production designer Dante Ferretti scouted locations in Vancouver, Montreal, the Pacific Northwest and New Zealand. After four trips to Taiwan, they decided that Taiwan it would be  —   for eight months. In all, 750 people, cast and crew and production team, would put their faith in Scorsese’s act of faith. “Silence” is a novel about “the necessity of belief fighting the voice of experience,” as Scorsese has put it. To get the Jesuits’ beliefs right, he engaged the Rev. James Martin, an author and editor at large of the Jesuit weekly America. Filmmaker and priest had several colloquies at Scorsese’s home, and Martin worked intensively with Garfield and Driver. Just as De Niro learned to box for “Raging Bull,” they familiarized themselves with the rites and disciplines of the Jesuit priesthood to bring authenticity to their performances. Garfield, known for his role in two “ ” movies, prepared to play Father Rodrigues by entering fully into the process that Jesuits call “spiritual direction. ” Raised outside London, with a secular Jewish father, Garfield developed his character by undergoing the “Spiritual Exercises” of St. Ignatius of Loyola, the founder of the Jesuit order. The exercises, devised in the 1520s, invite the “exercitant” to use his imagination to place himself in the company of Jesus, at the foot of the cross, among tormented souls in hell. Garfield met with Martin for spiritual direction, and they swapped reflections via email and Skype. Then he set out for St. Beuno’s, a Jesuit house in Wales, to undertake a   silent retreat. “If I’d had 10 years, it wouldn’t have been enough to prepare for this role,” Garfield told me. “I got totally swept up in all things Jesuit and very taken with Jesuit spirituality. The preparation went on for nearly a year, and by the time we got to Taiwan, it was bursting out of me. ” It’s not unusual for performers to allude vaguely to their spirituality. But Garfield describes the process with guileless specificity. “On retreat, you enter into your imagination to accompany Jesus through his life from his conception to his crucifixion and resurrection. You are walking, talking, praying with Jesus, suffering with him. And it’s devastating to see someone who has been your friend, whom you love, be so brutalized. ” Before Garfield left for Taiwan, Martin gave him a cross he had received as a gift while a Jesuit novice. “Andrew got to the point where he could   a Jesuit,” Martin told me. “There were places in the script where he would stop and say, ‘A Jesuit wouldn’t say that,’ and we would come up with something else. ” “I don’t think I am called to be a priest,” Garfield said to me resolutely, as if making this film had spurred him to consider the prospect. “But I had the feeling that I was being called to something: called to work with one of the great directors, and called to this role as something I had to pursue for my spiritual development. ” Driver has played the unreliable boyfriend in “Girls” and the villainous Kylo Ren in “Star Wars: The Force Awakens. ” To play Francisco Garrupe (Garrpe in the novel) Rodrigues’s slightly more skeptical companion, Driver, who was raised a Baptist in Indiana, worked by analogy. “This movie is the story of a crisis of faith,” he said, and explained that he tried to apply the ideas of faith and doubt generally. “It could be faith in your work, in the project or in a marriage it could be doubts about the work or the project or the marriage. When you think about it that way, it’s very relatable. ” So he related to faith and doubt  —   and he lost nearly a third of his weight for the role. “  pounds,” he told me over black coffee. “It’s about control, and as an actor you want to have control. But it’s also about suffering: It gives you information you can use in the role. ” He lost the weight over four and a half months, supervised by a nutrition coach. Early on, he spent a week at St. Beuno’s. Garfield was already two days into his retreat when Driver arrived at the place, a Victorian Gothic pile where the Jesuit poet Gerard Manley Hopkins was once in residence. Pledged to silence, the two actors waved when they spied each other in the refectory. Liam Neeson, raised Catholic in Ireland, brought to “Silence” the insights he gained during “The Mission,” Roland Joffé’s 1986 film about Jesuit adventures in South America. Daniel Berrigan, the Jesuit poet and pacifist, was an adviser to that picture and celebrated Mass with the actors  —   Neeson, De Niro, Jeremy Irons  —   on location in Colombia. Neeson told me: “I remember Father Dan saying, ‘Do you know that Stanislavski based his “Exercises” for actors on the “Spiritual Exercises” of St. Ignatius?’ I’d come all this way to hear that! That had a real effect on me. ” This time, in Taiwan to play Father Ferreira  —   the older Jesuit who apostatized after being tortured  —   Neeson underwent a simulacrum of the torture, suspended upside down by ropes over a pit of excreta. The Japanese actor Yoshi Oida, determined to do his best to play a character crucified in the sea, hung on a cross as a wave machine pushed rising tides of water over him. Oida was 82. By the time Driver filmed his final scene  —   in which Garrupe, long unseen, staggers into view, starved by his captors  —   he was hallucinating from hunger. “I did the scene and hopped on a plane to New York to do a table reading for ‘Girls,’’u2009” he told me, and then began a regimen of triple breakfasts at a diner in Brooklyn. A. O. Scott, now a chief film critic for The New York Times, once wrote that Scorsese approaches filmmaking as “a priestly avocation, a set of spiritual exercises embedded in technical problems. ” So it was with “Silence. ” “Marty insists on having silence on the set,” Garfield told me. “The silence says: ‘Something is happening here. ’’u2009” Scorsese arranged the shooting script chronologically, so the cast could feel the characters’ emotions in sequence. Finally Garfield reached the scene in which Rodrigues steps on the fumie, profaning the God he believes in and renouncing the faith he has come halfway across the world to preach. Actor and director prepared the shot: a bare foot pressed to a piece of copper, the face of Christ worn smooth by the feet of countless apostates before him. “It’s something we had both waited for,” Garfield said, “but Marty had waited much longer  —   he had waited decades to film that scene. ” The director was ready the priest stepped  —   and then there was a technical difficulty. “I almost lost my mind, and I think Marty did, too,” Garfield recalled. “He wanted it to be done in one take. ” There was a second take, and the priest profaned the image of Christ once and for all. Step by step, “Silence” got made. The picture Scorsese saw in his head on the bullet train took 27 years and $46. 5 million to realize. “All in God’s good time,” he said to me philosophically as we sat together in his house in the near dark. It was one o’clock in the morning. “We don’t know why, but this is how this picture got made. It had to be this way. ” Scorsese could speak philosophically, because he had been through all this before. A passion project, religious in nature, based on a novel delays, funding difficulties and reluctance among studio executives: Such was “The Last Temptation of Christ,” his adaptation of the novel by Nikos Kazantzakis. When the novel was published in Athens in 1955, its conceit  —   that Jesus felt a temptation to climb down from the cross and live an earthly life with Mary Magdalene  —   was seen as a challenge to conservative Christianity, represented by the Greek Orthodox Church. By the time it reached the United States in English translation, the ’60s were on, and the novel was taken up by the counterculture as a template for religious illumination through carnal knowledge. Scorsese read the novel in the ’70s after it was given to him by Barbara Hershey and David Carradine, the two stars of “Boxcar Bertha. ” By the time he set to making a movie adaptation, it was the Reagan era, and the novel was again seen as a challenge to conservative Christianity, then at full volume. Scorsese’s stated aims for the picture were straightforward. He wanted to give the Gospel story a contemporary accent, the way great artists like Caravaggio had done. And he wanted to fulfill his childhood vision and take the biblical epic to a different place. But the project soon turned complicated beyond belief. After committing to the picture in 1983, Paramount Pictures began to have doubts. Scorsese shrank the shooting schedule (planned for Israel) and the budget, agreeing to forgo his fee. As fundamentalist Christian leaders got wind of the project, they organized a hostile   campaign against Paramount’s parent company, Gulf and Western. Salah Hassanein, the head of United Artists, then the     chain, declared that U. A. wouldn’t show the picture on its screens, citing trouble with “The Life of Brian” and other   films, as well as with a film called “Mohammed: Messenger of God” that had prompted bomb threats. In an agonizing meeting with Scorsese and studio executives, Paramount’s chief, Barry Diller, canceled the picture. By now Scorsese’s intentions for it were a good deal more complicated. “I told him that God can’t be only in the hands of the churches,” he later said, recalling the meeting with Hassanein. “There are so many obstacles in between us and the spirit. In a sense, to make this film was to try to make God accessible to people in the audience who feel alienated from the churches. I said: ‘I have had three divorces. Does this mean I can’t speak to God because the church says I can’t? No, no! I can talk for myself because I’m me. ’’u2009” Angry and restive, he took on two projects initiated by others: “After Hours,” set in Lower Manhattan, and “The Color of Money,” a   drama starring Paul Newman and Tom Cruise. “The Color of Money” grossed $52 million: the biggest hit he’d ever had. Emboldened, he switched agents  —   to Newman’s agent, Michael Ovitz, the head of Creative Artists Agency. “Mike said: ‘What is it you want to get done? What is the film you really want to get made?’ I said, ‘The Last Temptation of Christ.’ And he said, ‘O. K.’ And I said, ‘I’ve heard that before. ’’u2009” Ovitz swiftly got “Last Temptation” greenlighted at Universal. Scorsese filmed in Morocco with Willem Dafoe as Jesus, Harvey Keitel as Judas, David Bowie as Pontius Pilate and Barbara Hershey as Mary Magdalene. What happened next still stands as a central episode in the culture wars. As Scorsese worked round the clock to edit the picture, the religious right moved against it. Donald Wildmon, a   instigator and head of the American Family Association, organized a picketing campaign at Universal Pictures in Los Angeles. The Rev. R. L. Hymers Jr. of the Baptist Tabernacle of Los Angeles did the same outside the home of Lew Wasserman, the chairman of MCA, which owned Universal. The leader of the Campus Crusade for Christ, Bill Bright, offered to buy the film from Universal in order to destroy it. Universal moved up the film’s release date and took out   newspaper ads in its support. In an interview with reporters in Rome, the Italian director Franco Zeffirelli, who hadn’t seen the movie, called it “truly horrible and completely deranged. ” Reports attributed to him a remark that the movie was the product of Hollywood’s “Jewish scum. ” Zeffirelli denied this, but the notion took root that the movie was the sinister work of a cabal of Jewish movie executives conspiring against the Christian faith. The day the film had its premiere at the Ziegfeld  —   Aug. 12, 1988  —   hundreds of picketers were there. So were several television news crews. “After the premiere,” Scorsese recalled to me, “a group of us went to dinner at the Regency hotel. ” The group included Universal executives the celebrated director Michael Powell Scorsese’s longtime editor and collaborator, Thelma Schoonmaker and prominent Christians who had supported the movie. Paul Moore, the Episcopal bishop of New York, had written a letter to The New York Times declaring that the movie dramatized the core church teaching that Jesus is both fully human and fully divine. At the Regency, Moore told Scorsese about a book he should read. The next day he had it sent over: “Silence,” by Shusaku Endo. In Egypt, Syria, Pakistan, China, and elsewhere, the persecution of Christians  —   often to the point of martyrdom  —   is real and continuing. Since the Sept. 11 attacks, the word “martyr” has taken on awful new connotations. “Silence,” then, is inadvertently topical. Like the novel, the picture interrogates the very idea of Christian martyrdom, by proposing that there are instances when martyrdom  —   the believer holding fast to Christ to the bitter end  —   is not holy or even right. It makes in the way of art the arguments made in defense of “Last Temptation”: that an act can’t be fully understood if the intentions behind it aren’t taken into account, and that a seeming act of profanation can be an act of devotion if done out of an underlying faith. At a dramatic moment in the novel, Rodrigues hears the cries of Christians who are being tortured outside his cell. He has been told that he can save their lives if he will step on the fumie. He agonizes. He prays. He feels the offer as a temptation. Weary, hungry, surrounded by suffering and death, he hears a voice he takes to be Jesus: “Trample! It was to be trampled on by men that I was born into this world. ” “The novel poses a very profound theological question,” Peter C. Phan, a Catholic theologian at Georgetown who was born in Vietnam, told me. “The question is this: Are we allowed to do an essentially evil act to obtain a good result? If it is done to save himself, then the answer is no. But the novel is so complex because he does it for his followers, for the good end of saving his flock. He will go to hell  —   but he will go to hell for their sake. ” Rodrigues tramples on the fumie. Because his intention is right  —   to save the lives of others  —   the act seems right. And because it entails the sacrifice of his exalted sense of himself, it seems a Christian act, a loss of self for others’ sake. The novel doesn’t work through theological questions so scholastically. Rather, it enfolds them within other questions: whether missionary activity is ipso facto a form of imperialism, and whether the content of a religious faith is lost in translation when it is promulgated in a new language in a new land. Should the church adapt to particular cultures, or should it maintain an approach distinctively its own? In Christian theology, that is a question of “inculturation. ” Since the Council of Jerusalem  —   when the apostles, Jews by birth, clashed over whether new Christians should be held to Jewish law  —   the history of Christianity has turned on questions of inculturation. The brilliance of “Silence” is that it shows how these questions increase and multiply. The young Jesuits seem to favor inculturation, adopting peasant dress, taking the sacraments directly to the people and calling their hut “the monastery. ” A magistrate  —   a figure akin to Dostoyevsky’s Grand Inquisitor  —   tells Rodrigues that Christianity cannot take root in the “swamp” that is Japan. When Rodrigues finally meets him, Ferreira concurs. The converts? They are breakaway Buddhists, the apostate priest says they worship the “Sun of God,” not the Son of God. Those martyrs, dying upside down in the pit? They didn’t die for Christ, he tells Rodrigues, they died for you. For all that, “Silence” is itself a complex act of inculturation  —   a novel, featuring a European priest’s point of view, that could not have been written by anyone but a Japanese. The fumie, too, is an expression of inculturation, a point developed in a new book by the artist Makoto Fujimura. It is an image of God devised by the shogunate for the purpose of abuse, but over the course of the novel, it becomes an authentic image of Christ. Under threat, the converts abuse it. They renounce their faith. But that doesn’t mean they stop believing. They keep “hidden faith” in mysterious ways. Scorsese’s own body of work is a strong argument for inculturation, in that he instinctively finds religious patterns and images in modern, urban, vulgar, dispirited society. His “Silence” is an act of cultural adaptation (some would call it appropriation) to the third degree: Here an   Catholic adapts a Japanese Catholic’s novel about Portuguese Catholics for a Hollywood movie  —   arguably American culture’s most distinctive art form. And yet Scorsese’s “Silence” suggests that inculturation of the usual kind is impossible. Instead, it makes vivid the idea that the act called apostasy can be a shrewd adaptation of religious faith to a hostile culture, and that faith maintained in spite of a believer’s outward acts of apostasy is faith nonetheless. The question the novel comes down to, then, is this: “Are you a Christian?” This question, posed by Garrpe to the peasant Kichijiro, is one that Rodrigues must answer for himself before he approaches the fumie, and long after he tramples on it. It is a question that cannot be answered for the   believer by the church, or a mentor, or society. The novel is not about a missionary’s struggle with a hostile culture. When the magistrate says as much, Rodrigues denies it: “’u2009‘No, no . . . ’ Unconsciously the priest raised his voice as he spoke. ‘My struggle was with Christianity in my own heart. ’’u2009” Before it opens in New York and Los Angeles in December, “Silence” will be screened in Rome for several hundred Jesuits and for cinephiles at the Vatican. It’s no stretch to suppose that Pope Francis, a Jesuit himself, will find a way to be there. Scorsese assuredly will be there, and it’s striking to envision him sitting in the dark with the pope as his new picture plays. Their boyhoods were a lot alike: Six years older, Jorge Mario Bergoglio was brought up in Buenos Aires in a family of Italian immigrants who took him to the movies often, and he grew up cherishing Italian cinema, especially Fellini’s “La Strada”  —   “a film about the possibility of sainthood,” Scorsese calls it. I asked Scorsese how he would describe his work to Pope Francis. He paused, then replied, “I would say that I’ve tried, in my work, to find out how to live life  —   tried to explore what our existence really is and the meaning of it. ” One day not long ago, Scorsese stepped out of a black car in front of the old cathedral. He had on an overcoat, a scarf and a   hat. He tightened the scarf, pulled the hat low and stood near the graveyard adjoining the cathedral. “We used to play    right here,” he said. “You could hide behind the gravestones. You knew which ones were the right size for you. ” Little Italy today is largely symbolic territory, like the Vatican within Italy. The old Ravenite Social Club  —   a headquarters for the Gambino crime syndicate  —   is now a Cydwoq “ . ” Chinatown, once south of Canal Street, extends most of the way up Mott Street. At the Catholic churches, Mass is offered in Vietnamese and Cantonese. Scorsese looked up Mott Street toward Houston Street. “Where the Korean restaurant is, that used to be a   house. Past it was a funeral home. The funeral procession would come out and bear the coffin along the sidewalk here and into the cathedral. I remember two kids from the neighborhood, 16 or 17  —   they died of cancer, and the families had to be carried from the funeral home to the church, they were so devastated. It was terrible. I’ll never forget it. ” Inside the old cathedral, it became clear how literally Scorsese has never forgotten  —   not the splendor of the church, nor the presence of suffering and death, sin and redemption, nearby. The pastor pointed out the details of a renovation: the saints retouched in their original colors, the marble and brass altar fixtures restored to the way they were before a 1970 modernizing effort. Scorsese, who left the neighborhood in 1965, didn’t need a guide. He knew every inch of the place. “Picture an    boy standing right here in a white cassock, reciting a prayer in Latin,” he mused aloud. “That’s me. ” The closing scenes of his “Silence” follow Rodrigues through the decades after he apostatizes. A priest no more, Rodrigues represents the shogunate in its dealings with traders from Europe. What is his inner life? What does he believe? Working from the imagination rather than from the text of the novel, Scorsese found a final image, subtle but not cryptic, for the character’s position  —   and it’s an image that suggests the nature of Scorsese’s own engagement with matters of faith. I asked him to draw a connection between “Silence” and what he was seeing in the old cathedral. He tapped his forehead with two fingers. “The connection is that it has never been interrupted. It’s continuous. I never left. In my mind, I am here every day. ”'"}, "time": 1742564397.9856594}