{"duration": 0.10491704940795898, "input_args": {"text": "'On any given weekend, you might catch President Trump’s    and top Mideast dealmaker, Jared Kushner, by the beachside   ice cream machine, or his reclusive chief strategist, Stephen K. Bannon, on the dining patio. If you are lucky, the president himself could stop by your table for a quick chat. But you will have to pay $200, 000 for the privilege  —   and the few available spots are going fast. Virtually overnight,    Mr. Trump’s   Palm Beach, Fla. club, has been transformed into the   capital of American government, a   winter White House where Mr. Trump has entertained a foreign head of state, health care industry executives and other presidential guests. But Mr. Trump’s gatherings at     —   he arrived there on Friday afternoon, his third weekend visit in a row  —   have also created an arena for potential political influence rarely seen in American history: a kind of Washington steakhouse on steroids, situated in a sunny playground of the rich and powerful, where members and their guests enjoy a level of access that could elude even the   of lobbyists. Membership lists reviewed by The New York Times show that the club’s nearly 500 paying members include dozens of real estate developers, Wall Street financiers, energy executives and others whose businesses could be affected by Mr. Trump’s policies. At least three club members are under consideration for an ambassadorship. Most of the 500 have had memberships predating Mr. Trump’s presidential campaign, and there are a limited number of memberships still available. William I. Koch, who oversees a major mining and fuels company, belongs to    as does the billionaire trader Thomas Peterffy, who spent more than $8 million on political ads in 2012 warning of creeping socialism in America. Another member is George Norcross, an insurance executive and the South Jersey Democratic Party boss, whose friendship with Mr. Trump dates to the president’s Atlantic City years, when Mr. Norcross held insurance contracts with Mr. Trump’s casinos, and Mr. Trump wrangled with the state’s Democratic leaders over tax treatment of the properties. Yet another member is Janet Weiner, part owner and chief financial officer of the Rockstar energy drink company, which has spent hundreds of thousands of dollars lobbying federal officials to avoid tighter regulations on its products. Bruce Toll, a real estate executive who   Toll Brothers, one of the nation’s largest home builders, and who is still active in the industry, owns a home nearby and frequently sees Mr. Trump at    he said. While they did not discuss any of Mr. Toll’s specific projects, he said, the two would occasionally discuss national issues, such as Mr. Trump’s plans to increase spending on highways and other infrastructure projects. “Maybe you ought to do this or that,” Mr. Toll said of the kind of advice that Mr. Trump got from club members. Mr. Trump’s son Eric, in an interview on Friday, rejected suggestions that his family was offering access to his father and profiting from it. First, he said, only 20 to 40 new members are admitted per year, and second, the wealthy business executives who frequent the club, among others, have many ways to communicate with the federal government if they want to. “It assumes the worst of us and everyone, and that is unfair,” Eric Trump said. Hope Hicks, a White House spokeswoman, said the president had no conflicts of interest, a reference to the fact that federal law exempts him from provisions prohibiting federal employees from taking actions that could benefit themselves financially. “But regardless, he has not and will not be discussing policy with club members,” she said in a written statement.    she added, is “one of the most successful private clubs in the world,” and it “was intended to be the Southern White House, and the president looks forward to hosting many world leaders at this remarkable property. ” But unlike the real White House, it has no public access, and no official visitor log is available. When members of the White House press corps accompanied Mr. Trump to the club and nearby golf course last weekend, they were housed during part of the trip in a room whose windows had been covered with black plastic.    members and their guests, on the other hand, had a   seat to a brewing foreign policy crisis, when Mr. Trump and his aides huddled on the dining patio to devise a response to North Korea’s launch of an   ballistic missile in the middle of a dinner with Shinzo Abe, the Japanese prime minister, and his wife. “No one needs to have a long   with Donald Trump,” said Robert Weissman, the president of Public Citizen, a nonpartisan watchdog group. “If you can whisper in his ear for 40 seconds, that can be decisive on your policy. ” Mr. Koch  —   the estranged brother of his   siblings, Charles G. and David H.  —   owns a home in Palm Beach and hosted a   for Mr. Trump during the campaign. His company, Oxbow Carbon, is among the world’s largest sellers of petroleum coke, an oil byproduct, and would be a significant beneficiary of the Keystone XL pipeline, construction of which is now a Trump administration priority. Brad Goldstein, a spokesman for William Koch, said that he did not know whether the two men had ever discussed policy matters. “If I did know,” Mr. Goldstein added, “the answer would be that I decline to comment. ” Historically, of course, American presidents have often been rich men with mansions, who sometimes conducted the people’s business in weekend haunts of the wealthy: the Bush compound in Kennebunkport, Me. for example, or the Kennedy family home in Hyannisport, Mass. President Dwight D. Eisenhower joined the elite Augusta National Golf Club before he was elected, frequently hanging out there with a group of affluent businessmen who became known as “the gang,” which included top executives from   and an oil company, an investment banker and a   . But Mr. Trump’s weekend White House appears to be unprecedented in American history, as it is the first one with customers paying a company owned by the president, several historians said. “   represents a commercialization of the presidency that has few if any precedents in American history,” said Jon Meacham, a presidential historian and Andrew Jackson biographer. “Presidents have always spent time with the affluent,” he added. “But a club where people pay you as president to spend time in his company is new. It is kind of amazing. ” John Dean, who served as White House counsel during the Nixon administration and has been a frequent Trump critic, noted that President Richard M. Nixon used to fly down to Florida to stay in an earlier winter White House: a private home in Key Biscayne that had also earned that name. But that arrangement was entirely different, Mr. Dean said, as Mr. Nixon was staying at a private home, not surrounded by some of the nation’s wealthiest business executives. “Most presidents feel very strongly about the dignity of the office they hold,” Mr. Dean said. “Mr. Trump has busted every norm in campaigning, and he seems to be doing the same with the traditions of his office. ” One longtime member is Kenneth M. Duberstein, who served as White House chief of staff under President Ronald Reagan and who now works as a corporate consultant and lobbyist. Clients of Mr. Duberstein’s firm include Alibaba Group, the Chinese internet company Amgen and Pfizer, the pharmaceutical giants and Dow Chemical and America’s Health Insurance Plans, which represents the nation’s largest health insurers. Like other members interviewed for this article, Mr. Duberstein said he did not bring up business matters with any Trump administration officials when visiting the club, which also is near a home he owns. “It is a social thing,” he said. “It is not a business thing. ” Christopher Ruddy, the chief executive of Newsmax Media and a longtime donor to and a friend of the president, said Mr. Trump had always conducted what amounted to informal focus groups on a variety of topics, but that face time with him since the election had become restricted to family and old friends. “It’s a myth to think that anybody could just join the club and go speak to the president,” Mr. Ruddy said, adding that the Secret Service has instituted a de facto rope line around the president’s table in recent weeks, which several other club members confirmed. But the weekly gatherings at    have already drawn some scrutiny from Democrats in the Senate, who called for Mr. Trump to release a list of all of the members. “Your winter White House will provide an audience with you for those who can afford it, not to mention an increasing   into your   organization,” Senators Sheldon Whitehouse, Democrat of Rhode Island, and Tom Udall, Democrat of New Mexico, wrote in a letter sent to Mr. Trump this month. “Instead of draining the swamp, it appears you’re bringing Washington right to the swamps at   . ”    has never been snooty in the manner of some private clubs in Palm Beach under Mr. Trump, it has long welcomed Jews, gay couples, Republicans and Democrats. (So long as they could afford the entry fee, that is:    doubled that fee to $200, 000 shortly after Mr. Trump was elected members also pay $14, 000 in annual dues.) Mr. Trump spent years populating his club with people rejected by rival clubs, while also urging his friends to join. Several members said Mr. Trump’s pronouncements on   topics such as immigration  —   and in particular his recent move to ban visas for visitors from certain nations  —   had caused some friction among the members at   . But Bernd Lembcke, the club’s managing director, said that applications had risen since Mr. Trump’s election. “It enhances it  —   his presidency does,” Mr. Lembcke said, referring to membership in the club. “People are now even more interested in becoming members. But we are very careful in vetting them. ” And potential members must be sponsored by a current one, he said. “You still have to be introduced. ” The list of members is a who’s who of the world of global finance and real estate, but it is also sprinkled with other boldface names, like Howie Carr, the Boston radio show host, and Bill Belichick, the head coach of the New England Patriots, according to three lists reviewed by The Times, from 2015 through earlier this year. Several members are also major campaign contributors to Mr. Trump, like Mr. Ruddy and Brian Burns, a businessman and lawyer whom Mr. Trump has indicated he now intends to nominate as ambassador to Ireland, records show. One longtime member is Richard LeFrak, a fellow New York developer and one of Mr. Trump’s closest friends, who in turn has recruited some of his own friends to join. Jeff Greene, a Senate candidate in Florida in 2010, said he had joined at the urging of Mr. LeFrak. But    where Mr. Trump’s old New York circle blurs easily into his presidency, is now a place where the president of the United States might seek guidance on a major government project the way another New Yorker might ask around for a good orthopedist. When Mr. LeFrak paid a visit to Mr. Trump at    last weekend, he appeared a little startled when Mr. Trump, in a brief interlude during the conversation, told him that the Department of Homeland Security was quoting a price of more than $20 billion for the proposed border wall with Mexico. “He said, would I consider doing it? And then he suggested that the price that was being quoted in the media seemed absurdly high to him,” Mr. LeFrak said. He is not interested in the work, but said, “And I didn’t react to him one way or the other because I don’t know what the facts are. ” Mr. LeFrak said to the president, “I thought you were going to have homeland security deal with this,” he recalled, describing Mr. Trump as stymied by the bureaucracy. “And he said, ‘Yes, maybe General Kelly will call you. ’”'"}, "time": 1742628502.9762266}