{"duration": 0.08016729354858398, "input_args": {"text": "'\\nOver 2,500 hacked Clinton Campaign staff emails have been released by Wikileaks, bringing the total number of emails released to over 50,000. In the most recent batch, there is a transcript of a paid speech given by Bill Clinton at a “Hillary for America” fundraiser while Hillary was secretary of state.\\nAn email from January 2016 from Tina Flournoy, Bill Clinton’s aide, had an attached document with a transcript of a speech given by Bill Clinton at the home of Mike and Patti Miller in October 2015.\\n“I haven’t run for office in 20 years, and yet every election I feel like an old horse that once won a bunch of races and somebody comes to the barn, gives me an extra bale of hay, hauls me on the track and slaps me on the rump, just to see if I can get around one more time,” Bill Clinton joked.\\nSpeaking about the presidential primary debates, Clinton said, “These people actually think they can insult their way to the White House, or compete with each other for who can say the most politically correct things.”\\nSpeaking of the Iran nuclear deal, he said:\\nEven the people that don’t like this Iran nuclear agreement like the sanctions that were imposed on Iran. She did that, and she got Russia and China to go along… you don’t know yet whether this Iranian thing is going to be good or bad. It depends on whether we enforce it. And you’ve got to have somebody in there tough enough, with enough connections in these other countries, to enforce the trigger that will re-impose the sanctions if they violate the rules.\\nSpeaking about Republicans who oppose Hillary Clinton, Bill said:\\nBecause, don’t be fooled: these guys do a lot of serious psychological studies. And they know that if you badmouth somebody enough in the press, day in and day out, especially if you’ve got your own microphone with Fox News, even if every single charge turns out to be false, you can hurt them.\\nReferring to a call he received from Barack Obama to tell him that Osama Bin Laden was killed, Bill said:\\nI could take CIA papers every day if I wanted to. I don’t, because of Hillary’s jobs in the Senate and Secretary of State, because I give too many public speeches and I’d hate to accidentally say something that I read in a government document.\\n  Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by The Daily Sheeple of www.TheDailySheeple.com . \\nThis content may be freely reproduced in full or in part in digital form with full attribution to the author and a link to www.TheDailySheeple.com. '"}, "time": 1742562189.874491}