{"duration": 0.19491243362426758, "input_args": {"text": "'Even though he’s about to get the full Hollywood C. G. I. treatment, Doctor Strange has never been a superstar of the Marvel Universe  —   more like an endearing benchwarmer with a knuckleball personality and a wacky Cloak of Levitation. He arrived unheralded in 1963 in Strange Tales No. 110 as a     feature to the Human Torch. He was a slight,   afterthought dreamed up by Stan Lee and Steve Ditko, who are better known for creating the Amazing  . Conceived at first in the cornball tradition of comics necromancers like Mandrake the Magician and Mr. Mystic, Doctor Strange gradually staked out a singular position as a master of the mystic arts and, eventually, Sorcerer Supreme. And unlike most Marvel heroes, who rely on their fists, he uses magic to defend Earth from malign, otherworldly threats like the   Dread Dormammu and the nefarious Nightmare. He finally got his own comic book in 1968, but it was canceled the next year. Not even Doctor Strange’s mighty enchantments could overcome poor sales, a sad hallmark of his      career. But now potential vindication is near. “Doctor Strange” opens Friday, Nov. 4, with Benedict Cumberbatch starring. Based on my many decades of   study, here are 10 things you should know before you see the movie. Magic, after all, can be exhilarating but befuddling. 1. HE’S A REAL DOCTOR Before draping his cape and waggling his fingers, Stephen Strange was a talented yet arrogant surgeon, driven by ego and ambition. So he’s your man, whether you’ve got a bad ticker or, as Jason Aaron wrote in the recent graphic novel “The Way of the Weird,” “your daughter started cursing in Latin and walking like a spider. ” 2. HE’S AN ALLITERATION ADDICT This is really the writer Stan Lee’s fault, but Strange can’t speak without racking up   points. His many munificent mutterings include: the Shadowy Shades of the Seraphim, the Seven Rings of Raggadorr and  —   who can forget?  —   the Hoary Hosts of Hoggoth. 3. HE’S GROOVY, MAN! In the 1960s and early ’70s, he did have a certain counterculture cachet. In T. Rex’s “Mambo Sun,” Marc Bolan sang, “On a mountain range, I’m Doctor Strange for you. ” A 1965 psychedelic concert in San Francisco was called “A Tribute to Dr. Strange,”  and he showed up on the cover of the Pink Floyd album “A Saucerful of Secrets” (1968). 4. HE’S A MERRY PRANKSTER, TOO Speaking of the counterculture, the doc also appeared in “The Electric   Acid Test,” Tom Wolfe’s nonfiction chronicle of the   trip taken by the novelist Ken Kesey and his   Merry Pranksters. Mr. Wolfe wrote of Kesey reading comic books, “absorbed in the plunging purple Steve Ditko shadows of Dr. Strange. ” The writer Roy Thomas later returned the favor, giving Mr. Wolfe a   in Doctor Strange No. 180 in 1969. 5. HE LIVES IN THE VILLAGE (OF COURSE) Stephen Strange’s   Sanctum Sanctorum sits in Greenwich Village at 177A Bleecker. Presumably it’s not too far from his preferred watering hole, the   Bar With No Doors. 6. HE’S A MAGICAL LADIES MAN Sure, he routinely saves the world  —   if not the universe  —   but Strange is also something of a cad and a hound. He’s been known to make out with any entity that’s vaguely female in form, including insectlike  . Really, he’s more likely to be killed by a spurned girlfriend than by one of his archenemies. 7.  HE’S NO ALI He prefers to hurl spells, incantations and mystic bolts, but Doctor Strange will engage in physical combat if he has to. He knows martial arts, but his weapon of choice (in this fleshly plane of existence) is a baseball bat wrapped in enchanted barbed wire. 8. HE KNOWS SUPERNATURAL BONDAGE One disturbing element during Strange’s Ditko years ( ) was how often Clea, the doctor’s love interest, was drawn bound and in poses of submission. But the Ditko biographer Blake Bell explained in “Strange and Stranger: The World of Steve Ditko,” that in the years he worked on the character, Mr. Ditko shared a studio at the corner of Eighth Avenue and 43rd Street in Manhattan with Eric Stanton, a fetish artist. Stanton was best known for his bondage work on comic strips like “Sweeter Gwendolyn” and “Confidential TV. ” Maybe something stuck with Mr. Ditko. 9. HIS MENTOR WAS NOT TILDA SWINTON In the coming movie, Doctor Strange’s mentor, the Ancient One, is played by a beguiling if tough Tilda Swinton. In the comics, Ancient is male, an archaic Asian relic who owns an I’    face that looks like a fossilized prune. Ms. Swinton’s version is Celtic, and the change was one of a number of developments that led to renewed controversy over Hollywood’s whitewashing of Asian characters. 10. HIS DEFINING ARTIST WAS STEVE DITKO Though he stopped drawing the character in 1966, Steve Ditko is still the definitive Doctor Strange artist. For four years Mr. Ditko imagined Strange’s netherworlds,   dimensions and   phantasmagorias. (It’s hard to believe upon reading Doctor Strange that Mr. Ditko also once drew the   bulk of the Incredible Hulk.) As the comics historian Dean Mullaney has written of Ditko, “He took the ethereal and made it tangible. ” And two books have just been published that provide full access to Mr. Ditko’s dreamscapes. “Ditko Unleashed” (IDW) is the generously illustrated catalog for a Ditko retrospective on display through Jan. 8 at the Casal Solleric museum in Mallorca, Spain, while the “Doctor Strange Omnibus” (Marvel) reprints his full, epic run on the character. As the Marvel artist John Romita Sr. who succeeded Mr. Ditko on   told Mr. Bell, “No one could do Doctor Strange like him. ”'"}, "time": 1742562185.7054415}