{"duration": 0.06953883171081543, "input_args": {"text": "'Canada’s Ethics Commissioner Mary Dawson has announced she will launch an investigation into Prime Minister Justin Trudeau’s use of a private aircraft to travel to a private island in the Bahamas over the New Year holiday, the first such ethics probe of a prime minister since the ethics office was established in 2007. [Following a formal request for an investigation into Justin Trudeau’s use of the aircraft, owned by the Ismaili Shiite leader the Aga Khan, Dawson wrote in response that she was “satisfied” that the situation merited an official investigation. “I have therefore commenced an examination under subsection 44( 3) of the [Conflict of Interest] Act to determine whether Mr. Trudeau has contravened sections 11 and 12 of the Act in connection with his recent stay at and travel to the Aga Khan’s privately owned island,” she wrote, according to Canada’s CBC.  The federal Conflict of Interest Act prohibits the use of private aircraft on the part of the prime minister “for any purpose except in exceptional circumstances,” requiring Dawson to approve all such uses before they occur. Trudeau did not submit a request to Dawson for approval before using the aircraft. Using a private aircraft in such a way, which may be seen as a form of bribe coming from someone receiving as much government largess as the Aga Khan, also violates Liberal Party ethics rules Trudeau himself championed. According to the Toronto Sun, the maximum sentence for the ethics charges Trudeau is facing is a $500 fine for each of two violations Dawson is considering, which the newspaper notes is a “relatively paltry sum for a prime minister who earns more than $350, 000 a year and gets a free home. ” Trudeau’s office initially refused to reveal where the prime minister was spending the New Year’s holiday, other than to confirm it would be outside of Canada. Before leaving the country, Trudeau had delivered a traditional end of the year message in which he called the holiday a “once in a lifetime opportunity to ring in the new year together” among fellow Canadians for the 150th anniversary of the nation’s founding. Canada’s National Post later revealed that the Trudeau family celebrated the new year on the Aga Khan’s private island, located in an island cluster locally referred to as “the Hamptons of the Bahamas” due to the names of the   owners of those islands. Trudeau reimbursed the government for use of federal aircraft to fly to Nassau, the capital of the Bahamas. The Aga Khan is the head of the Ismaili Shiite branch of Islam, an imam “philanthropist and hereditary spiritual leader,” according to NBC News. He is also a longtime friend of the Trudeau family, which the Prime Minister acknowledged in response to the ethics review. “This was our family vacation and it was with someone who has known me since I was a toddler and been a   friend of the family,” told CBC about the vacation, in response to whether he would take the vacation again knowing it would launch an unprecedented probe into the ethics of his actions. While not answering the question, Trudeau said he was “happy to take all of the questions” Dawson sent his way. The CBC also asked Trudeau to explain why he did not submit the private jet use for Dawson’s review, as the law demands. “We’re going to have all sorts of conversations with her, I’m sure, in the coming days and all this will be ironed out,” he responded. “It was a family vacation and we were focused on that,” Trudeau added. Last week, when journalists revealed that Trudeau had taken the trip on the Aga Khan’s aircraft, Trudeau told Canadian media, “we don’t see an issue on that. ” While certainly the flashiest, this is not Trudeau’s first ethical conflict since taking office in late 2015. In November 2016, Trudeau admitted to having discussed political issues with Chinese millionaires at a Trudeau Foundation fundraiser, a violation of lobbying laws. Upon being confronted by conservative MPs over his presence at the lavish fundraising events, Trudeau insisted it was necessary for him to attend because it would allow him to “create economic growth for the middle class. ”'"}, "time": 1742562014.0383894}