{"duration": 0.12964677810668945, "input_args": {"text": "'Leave a reply \\nLaraine C. Abbey – President Obama’s statement “giving up some freedom in exchange for security” [1] was a lance through my heart. Give up freedom for security?? Patrick Henry, of “Give me liberty or give me death” fame, must be rolling over in his grave! We are losing America. \\nLove him or hate him, Donald Trump has been the catalyst for a volcanic eruption of raw emotion about all that seems wrong in the governance of our country. Citizen unrest predates Trump’s electoral campaign but it has acted as a lightning rod that laser-focused on many issues alarming and infuriating Americans. In “shock and awe” style, ultra-liberal filmmaker and Bernie Sanders supporter Michael Moore had this to say in his “out of context” Ohio theater speech: \\nOur citizenry has increasingly lost its faith and trust in government following the 9/11 World Trade Center attacks. The Benghazi situation, Middle East wars, banking/financial crisis and housing market mortgage mess have done nothing to support confidence in the powers-that-be. Leadership has failed us. We’ve seen millions maimed or killed in these horrific unjust globalist wars. A call for change is on many lips and given a voice in presidential candidate Donald Trump. \\nTrump threatens the power structure, while Hillary is the power structure. \\nDo you see any personal gain for Trump in spending his own money on the campaign and possibly harming his Trump brand around the world to lead this country? \\nAsked many times over the years if he would consider running for president always brought forth the same answer: He didn’t want the job, but repeatedly said that he loved this nation and would consider running if he felt it was absolutely necessary for the well-being of our nation…and here we are. \\nIn this currently circulating video Trump starts out saying he doesn’t want to enter politics because “it’s a mean life.” Many mostly-good people would agree that they dare not even attempt running for office fearing some inevitable wrong-doing will hit the public arena and wreck their personal life. No good deed goes unpunished! \\nIt’s becoming ever clearer how criminal the Clinton enterprise really appears following Hillary’s deleting thousands of State Department emails—after being subpoenaed. This is a criminal activity that should be prosecuted and would seem to make her ineligible to run for president. The repeated WikiLeaks Clinton email dumps coupled with the Project Veritas Action videos make serious accusations, and lay bare political warts on what many are calling criminality here and here and here . \\nIt’s odd how the media goes after every gaffe or faux pas from Trump, while saying nothing of the alleged suspect Clinton behaviors over the years, including the cocaine scandals back from the Arkansas days. If this is news to you, go into YouTube and search ‘Clinton cocaine scandal’ and watch some of the many videos and documentaries. Here’s a short one to get you started. There are so many YouTube documentaries on “Clinton scandals” and “Clinton murders,” it would take a bite out of your lifetime to watch them all! \\nWhile everybody’s focusing on who is the more flawed of these two presidential candidates, the darker undercurrent issues are barely discussed by the political establishment of Democrats, Republicans, and the liberal mainstream media. My guess is they are petrified of the politically incorrect Donald Trump exposing their self-serving and criminal agendas. \\nMainstream media has put no focus on the Washington, DC pedophilia and drug dealing scandal of some years back [2, 3] that still infests seats of power. Instead they focus on feel-good talk that favors fixing things via an agenda of bigger government, increased taxation, centralization of control, and dominance in the name of the so-called ‘greater good’ as founded in collectivism (the hallmark of Socialism and Communism) rather than by maintaining limited government, individual liberty, and private property rights upon which our country’s foundational documents are based. \\nThe Founding Fathers efforts via the U.S. Constitution to protect against over-reaching and corrupt governance, while appearing to have functioned successfully for over 200 years, is now under siege by powerful people on both sides of the isle, and in ownership of media, to foster globalist agendas, for their own benefit. \\nAnother example of losing our country is found in the erosion of private property rights; “ over the last 25 years, 68 percent of America’s National Parks, Preserves and Monuments have been designated as a United Nations World Heritage Site , Biosphere Reserve or both by Executive Branch action with virtually no Congressional oversight or approval and out of the sight of the public scrutiny.” [4] Even more alarming: your right to own personal property is seriously threatened by UN Agenda 21 . Note this statement from an article in Conservative News and Views on July 27, 2011: To see what UN Agenda 21 really means, read the Local Agenda 21 Planning Guide . This 241-page book talks of balancing the needs of the economy, the community, and the environment. But a close read makes the real goal clear. People would lose many of the rights to their properties—and so would not really have property at all. In fact, people would have no inherent rights to anything. [5] \\nGovernment is known for its frequent inefficiency, incompetency, cronyism, pedophilia, drug and gun running and other wrongdoings. Enlarging and expanding government only increases such problems. The Founding Fathers tried to limit the size and power of the federal government, but unfortunately, the populace consistently looks to government to solve problems; and governments, as perpetual seekers of power, are only too happy to comply. \\nWhat are the results? A 20 trillion national debt; 6 trillion dollars unaccounted for in the Pentagon Budget, over 2 trillion of which was missing and announced the day before the 9/11 World Trade Center and Pentagon attacks and ‘forgotten’ in the chaos—some saying intentionally. A VA system, failing the care of our veterans, funded by a government that now prefers to spend money on refugees that may be dangerous to our populace rather than on taking care of its needy citizens and veterans. An IRS that improperly targets its citizens An FDA that attacks anything threatening to the pharmaceutical and commercial food industries— protecting them at the expense of the public and the CDC now repeatedly accused of fraudulent actions, involving manipulation and misrepresentation of research data including vaccine research, which endangers our children and the public while protecting the pharmaceutical and medical industries in their abuse of power. \\n[T]he latest [abuse of power] comes as Thomas Frieden, director of the CDC, is attempting to block CDC whistleblower Dr. William Thompson from testifying in response to a congressional subpoena on the destruction of data and scientific fraud committed by senior CDC officials in a critical vaccine safety study to conceal a causative relationship between vaccines and autism. \\nThompson was among the authors of widely cited studies debunking a link between vaccines and autism. [6] In apparent defiance of Thompson’s subpoena, Frieden stated “Dr. William Thompson’s deposition testimony would not substantially promote the objectives of CDC or HHS [Health and Human Services].” Since when does one’s boss have the power to override a congressional subpoena, no less with an agency protecting motive at the expense of the public’s benefit? \\nThe CDC fraud story is detailed in movie VAXXED , now available for rent or purchase at Amazon.com. \\nBad as all this is, it’s merely a piece of the globalist agenda as detailed in such things as the U.N. Agenda 21 and 2030, the Codex Alimentarius (the world food code which will take away food and nutrient supplements rights), and the TPP (Trans Pacific Partnership) for which we are systematically destroying our national sovereignty. While NAFTA and CAFTA seem to have started this destruction of the U.S. most recently, President Obama handed over the Internet (U.S. created and taxpayer funded) to the U.N. for no apparent reason, and then, as mentioned previously, said Americans should give up some freedoms for increased security. (Heard at approximately 37:50): \\nI personally prefer Patrick Henry’s “Give me liberty or give me death!” \\nWe’re giving billions of dollars to the U.N. for the Global Warming initiative. Is this money well spent, when funds are needed for our country’s internal problems including the restoration of our crumbling infrastructure? \\nBesides shipping out billions of dollars, Obama’s attempt to blame cyclical global “Lukewarming” [7] as man-made—rather than nature-made in order to impose a carbon tax—is another of his many ‘grind America down’ behaviors, as is his open border policy to flood America with illegal aliens and drug runners, and to destroy American culture with hundreds of thousands of Muslim refugees in service of his stated plan to reform America. In my view, this behavior along with flouting the Constitution and subordinating the U.S. to the U.N. clearly establishes Obama and his associates as engaging in treasonous behavior . Judge Janine says the Obama administration has acted treasonously (at 0:24) \\nObama has expressed a desire to become the Secretary General of the U.N. after leaving office so he can apparently further promote his globalist, one-world goals. Such efforts will only lead us down a path of more unconstitutional bureaucratic control, which is the very thing Brexit is a reaction to, and which I believe will eventually lead to destruction, or major reform, of the European Union. Brexit represents a turning away from the centralized control of totalitarianism—a good thing, I say! With Hillary as president an expansion of globalism and disintegration of U.S. sovereignty is guaranteed, so you can kiss the American Dream goodbye. \\nI loved the insights from the following shows.'"}, "time": 1742562656.2182827}