{"duration": 0.09854531288146973, "input_args": {"text": "'November 18, 2016 - Fort Russ -  Ruslan Ostashko, PolitRussia - translated by J. Arnoldski - \\n\\n\\nWhat scares Kiev politicians more than anything? What is their number one fear? No, not Russian tanks coming down Kreshchatik street. They aren’t afraid of Russian tanks for two reasons. First of all, Kiev politicians have made so much money selling media disinformation to the West about Russian tanks invading Ukraine that they themselves are no longer afraid of this happening. They have a whole business, a whole image of this and all relations with the West are built on their promises to provoke Russia into open military intervention. These promises have brought them money and power, so the very thought of a Russian military invasion warms their soul. \\nNow for the second reason. Kiev is now ruled by very opinionated people who are 100% convinced that, if something happens, they’ll manage to make it to Borispol and fly away. They hope that after fleeing from Russian tanks they will be provided with jobs, money, and respect for the rest of their life. They’ll form a Ukrainian government in exile and follow Khodorkovsky with endless lawsuits in international courts and travel the world giving lectures about how much they’ve suffered from Putin and how much they miss unfortunate Ukraine. Thus, the Kiev regime is not afraid of a Russian invasion. They have an entirely different nightmare, and it is precisely this other nightmare that is creeping into their daily reality. \\nI periodically try to explain to the Ukrainian experts that I encounter in television studios that Ukraine has worn out even its strongest supporters in the West. They’ve tired them out so much and so thoroughly that these supporters are already starting to discuss things that were unthinkable a year ago. Remember PACE - that bunch of European bureaucrats who condemned Russia for aggression against Ukraine and deprived the Russian delegation of its voting rights? Well now Ukrainian deputies are saying that PACE is preparing a devastating report on human rights failures in Ukraine. The chairman of PACE has even stated that it is necessary to bring back the Russian delegation to work in PACE, and he even wrote a letter to Vyacheslav Volodin with the proposal to personally meet to discuss this issue. Members of the Ukrainian delegation to PACE are writing articles about the powerful Russian lobby which could steal PACE and force it to “betray Ukraine.” \\nHere’s another example. After Ukrainian authorities fulfilled all 144 conditions for obtaining a vise free regime, European politicians turned to outright mocking them. During Rada discussions, it was recently revealed that Martin Schulz, the chairman of the European Parliament, now binds the visa-free regime to the fulfillment of the Minsk Agreements. An unpleasant situation has unfolded for official Kiev. If they blame Russia for not fulfilling the Minsk Agreements, then they’ll have to admit that the EU has made Kiev dependent on the Kremlin’s goodwill. If this is not so, then they’ll have to admit that Martin Schulz has de facto blamed Kiev for disrupting the Minsk Agreements and has punished the Ukrainian side by depriving it of its coveted visa free regime. Amidst all of this, the Ukrainian propaganda that the whole world supports Poroshenko looks very unconvincing. \\nYesterday I asked whether Trump would put Ukraine up for sale as a whole or in parts . Today I can present the Finnish version of the answer to this burning question. Former Finnish army commander General Gustav Hagglund told local media that “dividing Ukraine into two parts will put an end to the conflict in the country” and said that Trump will reach an agreement with Putin on concluding the conflict. A year ago, imagining that a representative of a European army would express such a position in the media was unthinkable, but now it is normal.  \\n\\nIn fact, I am not convinced that Trump will opt for this variant, but it cannot be excluded. The most important point is that no one is going to ask Ukrainian politicians about their opinions on the future of their country. This is Kiev’s greatest fear. On one fine day, they will wake up in a country that has been simply gifted to Putin.       Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742562335.9467187}