{"duration": 0.050020456314086914, "input_args": {"text": "'Russia Vitaly Churkin, the Russian ambassador to the UN (Photos by AFP) \\nRussia’s UN Ambassador Vitaly Churkin has accused the United Nations aid chief of arrogance and bias after he told the UN Security Council that Russian and Syrian airstrikes have turned Aleppo into a \"kill zone.\" \\nDuring a Wednesday Security Council meeting, Churkin accused Stephen O\\'Brien of making \"arrogant” and \"outrageous\" remarks and failing to recognize that Russia and Syria have been observing a humanitarian pause, which has been in place for the last eight days. \\n“The moratorium on flights has been in place for eight days. Give us at least one proof or leave those narratives for a romance you would probably write later,\" he said. \\n\"If we needed to be preached to, we would go to a church,\" the Russian envoy added. UN aid chief Stephen O\\'Brien speaks during a press conference in the Saudi capital Riyadh on October 5, 2016. \\nOn Tuesday, Russia announced plans to extend the week-long suspension of airstrikes targeting foreign-backed Takfiri terrorists in Aleppo. \\nLieutenant General Sergei Rudskoi of the Russian military\\'s General Staff said that Russian and Syrian jets had stayed 10 kilometers away from Aleppo since October 18, and that humanitarian corridors out of Aleppo remained open. \\nRudskoi further expressed Moscow’s readiness to organize more ceasefires on the ground in Aleppo to allow wounded civilians to be evacuated. Smoke rises from buildings hit by militant shelling in a government-held neighborhood of the Syrian city of Aleppo on October 20, 2016. \\nAleppo, Syria’s second largest city, has been divided between government forces in the west and the militants in the east since 2012. In an attempt to free the trapped civilian population and to end the militants’ reign of terror in the east, the Syrian army, backed by Russian fighter jets, began a major offensive on September 22. \\nSince March 2011, Syria has been hit by deadly militancy it blames on some Western states and their regional allies. Loading ...'"}, "time": 1742563764.2265399}