{"duration": 0.09098339080810547, "input_args": {"text": "'BEIJING  —   The ominous images in the video pile up, set to darkly urgent music. Refugees fleeing failed uprisings in the Middle East. Western diplomats and politicians cast as puppet masters of subversion in China. Chinese lawyers abjectly confessing to subversion in show trials. Protests erupting in Hong Kong. “ ‘Color revolution’ has already succeeded in pushing many countries into the flames of war and schism, and its devilish claws are reaching into China,” one of the subtitles in the video reads. It goes on to say: “Embassies in China are at the forward command, combining forces to promote ‘street politics.’ ” The video, which spread on the internet this week, has been widely promoted online by public security offices that oversee the police, including an office of the central Ministry of Public Security. But who ordered its production is unclear. An earlier version surfaced online in August but disappeared from the internet, only to resurface in its current version. Attempts to contact the makers, whose working name, Gewuzhijian, appears at the end of the video and also on Weibo, a Chinese social media service, went unanswered. The video is a      phantasmagoria of the Communist Party’s nightmares of Western subversion. The video does not have an official title, but it has been promoted online under the question “Who most wants to overthrow China?” “Color revolution” is the party’s thumbnail term for these fears, and the video, while shoddily made, offers a vivid lesson in how threats to party control  —   real or imagined  —   that can seem unrelated to outsiders are often seen inside the party as calculated moves in a grand plot, orchestrated from Washington, to bring it down. The term “color revolution” first gained currency in China to describe antigovernment insurrections in former Soviet bloc countries, which Chinese officials have said were coups inspired by the United States. The party says such uprisings are a template of Western plans for China. This conspiratorial worldview is more than bombast. It is a longstanding theme that has gained greater official credence under President Xi Jinping. That perspective has threaded through the trials of Chinese lawyers and rights advocates convicted and sentenced on subversion charges this year. It was echoed in a meeting this month about strengthening ideological controls in Chinese universities. A law governing foreign nongovernment organizations that takes effect on Jan. 1 was also partly motivated by fears of foreign subversion. “The first option for hostile forces infiltrating us is our education system,” the Chinese minister of education, Chen Baosheng, said in remarks published this month. “To wreck your future, first of all they wreck your schools. ” China has been exposed to the world through trade, travel and the internet, and its citizens are in many ways increasingly sophisticated. Even so, party propaganda remains deeply bound to the view that China faces not just disparate critics and foes, but a closely meshed conspiracy that unites those forces. The video is an especially feverish dose of that worldview. It says plotters and subversives are “stirring up mass incidents and using social tensions as a point to break through and serve as the fuse for ‘color revolution.’ ” They are, the video says, “using foreign nongovernmental organizations to nurture ‘proxies’ and to establish a social basis for ‘color revolution.’ ” Hong Kong, in particular, is depicted as a bridgehead for Western subversion in China. The   law professor Benny Tai, the media entrepreneur Jimmy Lai, the student leader Joshua Wong and others are lined up as among those “making Hong Kong into a base for ‘color revolution.’ ” The video also refers briefly to booksellers from Hong Kong who were abducted and taken to mainland China last year, prompting an outcry in Hong Kong, which is supposed to have substantial legal autonomy as a   Chinese territory. The video says the booksellers, who specialized in lurid and wildly imaginative accounts of China’s political elite, had “traduced the images” of party leaders. Under Mr. Xi, who assumed power four years ago, such videos have become an important part in the party’s propaganda arsenal. “Silent Contest,” produced by China’s National Defense University and issued in 2014, was even more breathless in its depiction of Western threats. But the new video ends on a reassuring note. The dark images and language give way to swelling melodies and images of a bright dawn over the Great Wall. There are pictures of smiling people and of muscular People’s Liberation Army troops. “Thoroughly expelling ‘color revolution’ from China will be a long war,” the video warns. But at the end it declares, “If there is war, we will answer the call. ”'"}, "time": 1742561984.4028065}