{"duration": 0.05310630798339844, "input_args": {"text": "\"Range of BrahMos cruise missile to be doubled 28 October 2016 Sputnik The range of BrahMos missile may be extended up to 600 km. Facebook brahmos , defence , indo-russian cooperation BrahMos is capable of hitting targets beyond the radar horizon and can be launched from sea based and land based weapon systems. Source:EPA \\nIndia and Russia have approved the proposal to double the range of the BrahMos, world’s first supersonic cruise missile at the 16th Russia-India intergovernmental commission on military cooperation meeting. \\nFGFA may be armed with BrahMos cruise missiles \\nSources told Sputnik that during the annual summit in Goa, Russian President Vladimir Putin and Indian Prime Minister Narendra Modi reached an agreement to develop different range of the BrahMos. \\nOne of the ranges agreed upon was to double it from current range of 300 km which received final nod on October 26 during the Russia-India intergovernmental commission on military cooperation meeting co-chaired by Indian Defence Minister Manohar Parrikar and his Russian counterpart Sergei Shoigu. \\n“Russia is India's time tested and closest partner and it will continue to remain our primary defence partner,” Manohar Parrikar, Indian Defence Minister, said after the meeting on Wednesday. \\nThe proposal to increase the range of BrahMos was under consideration for a long time and now it is formalized after India became a member of Missile Technology Control Regime this year. It is said that only minor changes will be enough to extend the range of BrahMos up to 600 km. \\nWhy the BrahMos armed Sukhoi is bad news for India’s enemies \\nCurrently, BrahMos is capable of hitting targets beyond the radar horizon and can be launched from sea based and land based weapon systems. Test fire of an air-launched version of Brahmos cruise missile expected to be held in February next year. The 2.5 metric ton Brahmos air-to-ground missile will be fired from an IAF (Indian Air Force) Sukhoi-30 MKI fighter aircraft that has undergone modifications to accommodate the new weapon. A successful preliminary trial has already been carried out, and two more dummy trials are in the pipeline before the actual test. \\nFirst published by Sputnik .\""}, "time": 1742563765.1068778}