{"duration": 0.1324148178100586, "input_args": {"text": "'28. Oktober 2016 Tamara Wojewodina Die Wirtschaftskrise in Russland eröffnet neue Möglichkeiten für Unternehmen. Während der Export einbricht, steigt die Anzahl neuer Projekte überraschend auf Vorkrisenniveau. \\nFoto: Gaia Russo \\nWenn Russen „pojechali“, „los geht’s“, sagen, dann kann etwas Alltägliches wie eine Taxifahrt bevorstehen. Oder etwas Außergewöhnliches wie ein Flug in den Weltraum – jeder hierzulande kennt den saloppen Ausruf von Juri Gagarin vor seinem ersten Flug. Und so meint der Deutsche Oliver Hermes eher Gagarin als Taxi, als er im Sommer mit der Schere in der Hand„Pojechali“ rief und das Bändchen einer nagelneuen Wilo-Fabrik durchschnitt. Hermes, der Vorstandsvorsitzende des Dortmunder Pumpenherstellers, war zur Werkseröffnung eingeflogen, genauso wie Russlands Premier Dmitrij Medwedew samt etwa 400 weiteren Gästen aus Deutschland und Russland. \\nNatürlich ist eine Werkseröffnung so wenig ein Sprung ins Weltall wie die investierten 35 Millionen Euro der Dortmunder ein Riesenbetrag. Dennoch zeigt der hohe Besuch, wie wichtig gute Nachrichten über Investitionen aus dem Ausland für die Regierung derzeit sind. Die 450 neuen Mitarbeiter sollen nun jährlich bis zu 70 000 Pumpen herstellen, etwa für kommunaleBetriebe. Der Anteil lokaler Produktion beträgt 30 Prozent und soll in den kommenden Jahren auf 80 Prozent steigen. Die Geschäfte liefen in Russland schon immer gut für Wilo. Fast zehn Prozent des Umsatzes, etwa 100 Millionen Euro, macht das Unternehmen hierzulande. Mit der neuen Fabrik, eigentlich schon 2013 geplant, wollen sich die Dortmunder nun für rauere Zeitenwappnen. \\nDas neue Werk von Wilo ist in diesem Jahr die größte Investition eines deutschen Unternehmens, aber bei Weitem nicht die einzige. Der Pumpenhersteller gehört zu einer Riege von Unternehmen, die gerade jetzt in Russland investieren. Die meisten versuchen, durch Lokalisierung die Krise abzufedern, sich öffentliche Aufträge zu sichern oder Protektionismus zu umgehen. So ist zwar der Export aus Deutschland nach Russland in den vergangenen beiden Jahren von etwa 42 auf 21,5 Milliarden Euro gesunken. Auch weil schrumpfende Öleinnahmen den Rubel stürzen ließen. Anders sieht das Bild aber bei den Direktinvestitionen aus. Russland lockt Mittelständler Deutsche Investitionen in Russland auf Rekordhoch Auch hier hatte es mit Beginn der Krise und der Einführung der Sanktionen im Zuge des Ukraine-Konflikts einen merklichen Einbruch gegeben. Hatten deutsche Firmen 2013 noch etwa 660 Millionen investiert, zogen sie 2014 nach Angaben der Bundesbank netto etwa 90 Millionen Euro ab. Doch schon 2015 kam die Wende. Mit 1,78 Milliarden fiel das positive Investitionssaldo so hoch aus wie seit 2008 nicht mehr. Die russische Zentralbank weist zwar etwas andere Zahlen aus. Ihr zufolge stiegen die deutschen Direktinvestitionen zwischen 2014 und 2015 von 311 Millionen auf 1,3 Milliarden Euro. Doch im Grunde bestätigen sie den Trend. \\nDer größte Unterschied zu der Zeit vor der Krise, sagt Alexander Ivlev, Russland-Chef der Beratungsfirma Ernst and Young (EY) in Russland, ist, dass vor allem international orientierte Mittelständler nach Russland kommen. So hat die Firma Gühring aus Albstadt im Juni eine Werkzeugfabrik in Nischnij Nowgorod eröffnet und acht Millionen Euro in die Produktion investiert. Der Zulieferer Edscha mit Sitz in Remscheid investierte vier Millionen Euro in die Produktion von Scharnieren für Autotüren in Togliatti, wo auch der Lada-Hersteller Avtovaz ansässig ist. Besonders viel Aufmerksamkeit bekam der Landmaschinenhersteller Claas, der Anfang des Sommers einen Sonderinvestitionsvertrag mit der russischen Regierung unterschrieben hat. Seine Mähdrescher gelten von nun an als russische Fahrzeuge, was dazu führt, dass russische Bauern nun beim Kauf eines Claas auf staatliche Zuschüsse hoffen können. Im Gegenzug verpflichtete sich das deutsche Unternehmen, weitere zehn Millionen Euro in die lokale Fertigung zu pumpen, zusätzlich zu den 120 Millionen, die bereits geflossen sind. Roter Teppich für Investoren Schlupfloch im Sanktionskrieg: Rechtssicherheit für ausländische Investoren „Ein großer Teil der Investitionen fließt aktuell in die Produktion“, erklärt Experte Ivlev. Auch weil der Markteintritt derzeit sehr günstig sei. Löhne und Baukosten sind in Euro gerechnet deutlich zurückgegangen. In einer Studie hat EY aktuell über 200 neue Investitionsprojekte in Russland gezählt. Noch im vergangenen Jahr lag die Zahl der Projekte bei 125. Überhaupt wurde die Marke von 200 in den jährlichen EY-Studien lediglich im Jahr 2010 überschritten. Wenig überraschend landete Deutschland bei den Herkunftsländern der Investoren in Russland auf Platz eins mit insgesamt 36 Projekten und über 2 000 neu geschaffenen Jobs. \\n„Der russischen Regierung sind Investitionen angesichts der Wirtschaftskrise und des Sanktionsregimes überaus wichtig“, sagt Matthias Schepp, Vorstandsvorsitzender der Deutsch-Russischen Auslandshandelskammer. „Wer Technologie transferiert und sich entscheidet, in Russland zu produzieren, bekommt einen roten Teppich ausgerollt.“ \\nOb der Investitionsboom auch in diesem Jahr weitergeht, ist noch offen. Die Daten der Bundesbank weisen für das erste Quartal bereits einen Wert von über einer Milliarde Euro aus. Die russische Zentralbank kommt lediglich auf rund 300 Millionen Euro frische Investitionen. \\nBei Wilo jedenfalls herrscht noch Optimismus. „Russland ist für uns in den nächsten Jahrzehnten ein hoch attraktiver Markt“, sagte Jens Dallendörfer, Generaldirektor von Wilo Rus, bei der Werkseröffnung. „Wir sehen das Werk auch als Exportplattform für den Wirtschaftsraum von Lissabon bis Wladiwostok und die Länder der Eurasischen Wirtschaftsunion.“'"}, "time": 1742563575.1079159}