{"duration": 0.02959132194519043, "input_args": {"text": "'United States Attorney General Jeff Sessions directed federal prosecutors to pursue the most severe penalties for defendants with the most serious and provable crimes. [Sessions instructed federal prosecutors to “charge and pursue the most serious, readily provable offense” in an   memorandum sent to more than 5, 000 assistant U. S. attorneys across the country on Thursday.  In a speech on Friday, Sessions highlighted the rapidly increasing crime rates in U. S. cities and pointed to drugs as the main cause. “The murder rate has surged 10 percent nationwide. The largest increase in murder since 1968 and we know that drugs and crime go    they just do, the facts prove that so,” Sessions said. “Drug trafficking is an inherently dangerous and violent business. If you want to collect a drug debt, you can’t file a lawsuit in court. You collect it with the barrel of a gun. ” The memo sent by Sessions also rescinded the policies of former attorney general Eric Holder Jr. effectively immediately. “We are returning to the enforcement of the laws as passed by Congress, plain and simple,” Sessions said. “If you are a drug trafficker, we will not look the other way, we will not be willfully blind to your misconduct. ” Sessions made clear that the criminals he is referring to are not   offenders but rather major players in America’s war on drugs. “These are not   drug offenders we, in the federal courts, are focusing on,” Sessions said. “These are drug dealers, and you drug dealers are going to prison. ” Sessions said that under the Trump Administration, the Department of Justice (DOJ) would stand behind law enforcement agencies across the U. S. “We will do all that we can to keep you safe and promote public support for honorable officers in your dangerous work,” Sessions said. Sessions encouraged all Americans to find a way to show their gratitude for law enforcement as he pointed out that those working in the field do so to help keep America safe. “Bring a home cooked meal to your local precinct. Go to a national memorial service or simply shake the hand of a police officer and say thank you for your service,” Sessions said. The move by Sessions against drug traffickers comes after he announced on April 28 that the DOJ was going to start targeting the notoriously violent   street gang, Breitbart Texas reported. Results can already be seen across the country as federal agencies look to rid America’s streets of crime. Breitbart Texas reported on Thursday that the Department of Homeland Security had concluded a   nationwide crackdown on gangs which led to the arrests of over 1, 000 confirmed gang members. Ryan Saavedra is a contributor for Breitbart Texas and can be found on Twitter at @RealSaavedra.'"}, "time": 1742628608.3946095}