{"duration": 0.01674938201904297, "input_args": {"text": "'Should Russia rejoice at Donald Trump\\'s victory? 09.11.2016 The head of the Civil Society Development Fund, Konstantin Kostin, is certain that the victory of presidential candidate Donald Trump has demonstrated people\\'s disappointment in the old American elite. \"No one was expecting Trump to win. They did not expect the Republicans to take the majority at the Senate elections. This speaks of people\\'s disappointment in Obama\\'s policies. The American people have shown that they do not want to see Democrats either in the White House or on Capitol Hill,\" one of Russia\\'s leading political strategists said. \"The Americans were ready to accept Obama\\'s tax increases. At the same time, many people had to cut their living standards. Yet, no one wants to give the money to the lazy instead of the poor,\" the analyst believes. According to Konstantin Kostin, \"Trump will defend US interests, while reducing the budget spending on the export of democracy.\" \"Let\\'s wait for the formation of the Trump administration. It is hard for me to understand the Russian MPs, who applauded to the news about Trump\\'s election. Trump is the US President, and he will act in the interests of his country first and foremost,\" the analyst said. Donald Trump\\'s victory is not a perfect occasion for applause on Russia\\'s part, yet, Russia has two reasons for restrained optimism, Mr. Kostin believes. Print version Font Size \"First off, US-Russian relations have always been better and more predictable during the times of Republican presidents. Secondly, Trump, as an adherent of realpolitik, will certainly be against the USA\\'s mission of the global hegemon, exporter of democracy and color revolutions,\" he explained. \"Trump is most unusual and anti-system candidate in modern US history. The support that Trump has received means that most Americans are a lot more interested in their own income, taxes and safety than in the rights of sexual minorities, migrants and issues associated with color revolutions. \"Trump has taken a complete advantage of this in his campaign. His winning recipe contains such ingredients as bright and extraordinary style in conjunction with absolutely conservative rhetoric,\" Konstantin Kostin said. Politonline'"}, "time": 1742628486.764502}