{"duration": 0.1721336841583252, "input_args": {"text": "'Police in North Dakota surrounded hundreds of water protectors fighting construction of the Dakota Access pipeline on a highway bridge and fired a water cannon, tear gas, concussion grenades, and rubber bullets. During the assault, which lasted for hours, the police also threatened the group with a long-range acoustic device to further disorient them. Standing Rock Sioux Tribe’s emergency medical services deployed to treat dozens of individuals with injuries.\\nFor months, protests, including nonviolent direct action, have taken place with indigenous people, who will suffer the worst impact, at the forefront. An encampment called Sacred Stone Camp near the Standing Rock reservation has stood as a grand example of resistance.\\nOn November 20, according to a press statement from the Sacred Stone Camp, water protectors attempted to remove “burnt military vehicles” that police “chained to barriers weeks ago,” which were blocking traffic on Highway 1806. The effort was undertaken with a semi-truck, and water protectors hoped to “clear the road to improve access to the camp for emergency services.”\\n11/20/16: Burnt military truck left by police to block Hwy 1806 removed by water protectors using semi & chains. #NoDAPL pic.twitter.com/2ryIRN90VV \\n— Unicorn Riot (@UR_Ninja) November 21, 2016 \\n\\nPolice responded with an incredible show of force, using multiple so-called “non-lethal” tools in their arsenal to pummel water protectors. Particularly unsettling was the blasting of water at water protectors when the temperature dropped to 26 degrees Fahrenheit. There were multiple complaints of people suffering from the early onset of hypothermia.\\nTara Houska, the national campaigns director for Honor the Earth, reacted, “For weeks, the main highway to the Standing Rock Sioux Reservation has been cut off, with no movement by the state to address a public safety risk. Attempting to clear the road was met with police spraying people with water cannons in 26 degree weather.”\\n“That’s deadly force. It’s freezing outside. They want to kill people for clearing a road? When will our cries be heard? Stop the Dakota Access pipeline. Respect the rights of indigenous people, of all peoples.”\\nThe director of the Sacred Stone Camp, LaDonna Allard, responded, “All I can say is why? We are asking for clean water, we are asking for the right to live, we are asking for our children to live. Instead they attack us, because they protect oil. Morton county and DAPL security are inhuman. What is wrong with their hearts?”\\nThe Morton County Sheriff’s Department, which responded to the water protectors’ move to clear the highway, put out a statement on Facebook that was taken by outlets, such as NBC News and CNN, as the frame for understand the “clashes” that unfolded.\\n“Law enforcement is currently involved in an ongoing riot on the Backwater Bridge, north of a protest camp in Morton County. Protesters in mass amounts, estimated to be around 400, are on the bridge and attempting to breach the bridge to go north on highway 1806. Protesters have started a dozen fires near the bridge,” the Department alleged.\\nThe Sacred Stone Camp reported flares were shot by law enforcement. Those flares ignited “grass fires.” However, the water cannon was not specifically used to extinguish the fires. The water cannon was directed at water protectors.\\nDrone footage captures police spraying Dakota Access Pipeline protesters with a water cannon.\\nVideo shows the water cannon as police directed it at nonviolent water protectors. The video, shot with a drone, was at one point shot at with a water cannon presumably to knock it out of the air. The camp indicated police “shot down three media drones and targeted journalists with less lethal rounds.”\\nUnicorn Riot, a volunteer-operated collective of multimedia artists and journalists that has been on the ground documenting Standing Rock resistance for months, reported on the scale of the force used against water protectors as well as the impact on protectors.\\nThe collective indicated there were serious injuries, including “one person who was badly injured after being shot in the head with a rubber bullet.” A girl, who is 13 years-old, was reportedly shot in the face and suffered lung and eye irritation from the tear gas. There were multiple reports of cardiac arrest. One of Unicorn Riot’s reporters “had their press badge shot off when shot in the abdomen by a rubber bullet.” Multiple individuals suffered seizures. At least 150 water protectors suffered injuries.\\nAs Unicorn Riot reported, police “formed a line with armored vehicles, concrete barriers, and razor wire.” The police unleashed a plume of water on hundreds of people for hours, who chose to stand their ground but also in a sense were trapped because of how the police established a perimeter limiting where they could disperse.\\nFor hours, Kevin Gilbertt live streamed the incredible use of force by police. His stream eventually climbed to 50,000-plus viewers as cable news networks like CNN stuck to regularly scheduled programming and refused to offer viewers a news break covering what was happening.\\nDallas Goldtooth of the Indigenous Environmental Network declared, “Tribal EMS are stepping up and providing services that should be the responsibility of Morton County, this is ridiculous. Because of the police enforced roadblock, ambulances now have an extra 30 minutes to get to the hospital. Those are life and death numbers right there, and Morton County and the State of North Dakota will be responsible for the tally.”\\nPolice maintained their barricade around the encampment throughout the night and into the morning, according to Navajo and Yankton Dakota writer Jacqueline Keeler. This obstructed EMTs from being able to get to the camp.\\nIn an interview with Goldtooth, Angela Bibens of the Red Owl Legal Collective, indicated 20 mace canisters were fired in a period of five minutes at one point. This resulted in a number of individuals losing control of their bowel functions. “One elder went into cardiac arrest and was revived through CPR at the front line by medics.” The police also fired mace canisters at medics.\\nYet, despite the assault, Bibens described the response of people nearby as “calm.” They maintained their resolve and rushed blankets to the front line. They provided forms of immediate medical aid, and some even chose to stay at the front line to help others hold their ground against the assault. Multiple water protectors donned gas masks and grabbed shields to face down the police.\\nThere was one reported arrest, but why that person was arrested was not immediately clear.\\nRob Keller, a spokesman for the Morton County Sheriff’s Department, parsed language and maintained no water cannon was used and water was only deployed to put out the fires that were set by water protectors. This is only accurate if one ignores the hours of video footage showing water shot directly at water protectors or if one calls what was turned against water protectors a hose instead of a cannon.\\nApparently, the Morton County Sheriff’s Department previously expressed concern about hypothermia at the encampments, as winter approaches. But on November 20, Morton County police had no second thoughts about dousing water protectors with water for hours, even if it meant they might end up needing emergency medical attention.\\nLast week, Energy Transfer Partners LP Chief Executive Officer Kelcy Warren said the pipeline will not be rerouted despite concerns expressed by indigenous Americans. The Army Corps of Engineers has examined possible changes to the route so the pipeline does not violate sacred Native American land.\\nEnergy Transfer Partners announced on November 8 it would start the “final phase” of construction around November 22 and ignore the requests of federal agencies to suspend construction until a new assessment could be completed.\\nIn September, the United Nations Special Rapporteur on the rights of Indigenous Peoples, Victoria Tauli-Corpuz, called for the construction to end and cited “serious risks to drinking water and potential destruction of the tribe’s lands.” She also acknowledged indigenous people were denied access to information and excluded from consultations during planning.\\nThe Standing Medic and Healer Council declared in a statement: “We call on the Morton County Sheriff’s office to immediately stop the potentially lethal use of these confrontational methods against people peacefully assembled. We request media support, medical support, and observers to the area immediately.”\\nThe post Police Launch Hours-Long Attack On Dakota Access Pipeline Resistance, Injure Dozens appeared first on Shadowproof .\\n'"}, "time": 1742562082.6863983}