{"duration": 1.697981595993042, "input_args": {"text": "'Why Is Obama Threatening Russia With World War 3 Right Before The Election?   October 16th, 2016 \\nIt sure seems like an odd time to be provoking a war with Russia. As I write this, we stand just a little bit more than three weeks away from one of the most pivotal elections in U.S. history, and Barack Obama has chosen this moment to strongly threaten the Russians. As I wrote about on Friday , Reuters is reporting that Obama is contemplating “direct U.S. military action” against Syrian military targets, and the Russians have already indicated that any assault on Syrian forces would be considered an attack on themselves. The rapidly deteriorating crisis in Syria has already caused tensions with Russia to rise to the highest level since the end of the Cold War, but now Obama is adding fuel to the fire by publicly considering “an unprecedented cyber covert action against Russia”. Apparently Obama believes that Russian hackers are interfering in the election and so he wants payback. The following comes from an NBC News article entitled “ CIA Prepping for Possible Cyber Strike Against Russia “… \\nThe Obama administration is contemplating an unprecedented cyber covert action against Russia in retaliation for alleged Russian interference in the American presidential election , U.S. intelligence officials told NBC News. \\nCurrent and former officials with direct knowledge of the situation say the CIA has been asked to deliver options to the White House for a wide-ranging “clandestine” cyber operation designed to harass and “embarrass” the Kremlin leadership. \\nThe sources did not elaborate on the exact measures the CIA was considering, but said the agency had already begun opening cyber doors, selecting targets and making other preparations for an operation . \\nSomebody should tell Obama that he is not playing a video game. A cyber attack is considered to be an act of war, and the Russians would inevitably retaliate. And considering how exceedingly vulnerable our cyber infrastructure is, I don’t know if that is something that we want to invite. \\nAt the end of last week, Vice President Joe Biden also publicly threatened the Russians … \\nOn Friday, Vice President Joe Biden met “Meet the Press” host Chuck Todd for an interview that has raised serious concern in Russia. \\nWithout bothering to question the authenticity of the claims, Todd took the allegations of Russian hacking at face value, opening his interview with a loaded question: “Why haven’t we sent a message yet to Putin?” \\nAfter a moment of stunned silence, Biden responded, “We’re sending a message. We have the capacity to do it and it will be at the time of our choosing, and under the circumstances that will have the greatest impact.” \\nWhen Todd asked if the public will know a message was sent, Biden replied, “Hope not.” \\nThe Russians firmly deny that they had any involvement in the hacking, and so far the Obama administration has not publicly produced any firm evidence that the Russians were behind it. \\nPerhaps the Obama administration privately has some evidence, but at this point they have not shown that evidence to the American public. \\nSo for Joe Biden to be making these sorts of threats is a very dangerous thing. The Russians are taking these threats very seriously, and they are preparing to protect their interests … \\n‘The threats directed against Moscow and our state’s leadership are unprecedented because they are voiced at the level of the US vice president. \\n‘To the backdrop of this aggressive, unpredictable line, we must take measures to protect (our) interests, to hedge risks,’ a Kremlin spokesman said, according to RIA Novosti news agency. \\nHere in the United States, most people don’t even realize that we could be on the verge of a major conflict with Russia. \\nBut over in Russia things are completely different. Talk of war is everywhere, and the potential for war is the number one topic in the Russian media right now. Just check out some of the recent Russian media headlines about the conflict between our two nations… \\n-“ In Contrast to Clinton, Trump Has No Appetite for War With Russia ” \\nAnd one Russian television network recently instructed their viewers to locate the nearest bomb shelter in case a nuclear war between the United States and Russia suddenly erupts… \\nA terrifying Russian television broadcast explicitly told civilians to find out where their nearest bomb shelter is and repeatedly asked viewers if they were ready for nuclear war. \\nOne apocalyptic broadcast told viewers on Moscow’s state-owned TV channel NTV: “If it should one day happen, every one of you should know where the nearest bomb shelter is. It’s best to find out now.” \\nI don’t believe that the Russians are crazy to be thinking that a war might be coming. \\nTo me, it almost seems as though Obama wants one. \\nCould it be possible that a conflict with Russia will be used to alter, change or influence the upcoming election in November? \\nThe truth is that it isn’t going to take much for the shooting to begin. If Obama orders airstrikes against Syrian forces, the Russians have said that they will shoot back … \\nAsh Carter has threatened Russia with “consequences”. After blowing up the ceasefire, the Pentagon – supported by the Joint Chiefs of Staff — now is peddling “potential strikes” on Syria’s air force to “punish the regime” for what the Pentagon actually did; blow up the ceasefire. One can’t make this stuff up. \\nMajor-General Igor Konashenkov, Russia’s Defense Ministry spokesman, sent a swift message to “our colleagues in Washington”; think twice if you believe you can get away with launching a “shadow” hot war against Russia. Russia will target any stealth/unidentified aircraft attacking Syrian government targets – and they will be shot down. \\nThe only serious question then is whether an out of control Pentagon will force the Russian Air Force – false flag and otherwise — to knock out US Air Force fighter jets, and whether Moscow has the fire power to take out each and every one of them. \\nI discussed the potential for war with Russia in my latest video . Hopefully cooler heads will prevail and war with Russia will be put off… \\nBut without a doubt the crisis in Syria is not going to be resolved any time soon because it is one giant mess. Most people don’t realize that the Syrian civil war has essentially been a proxy war between Sunni Islam and Shia Islam from the very beginning. Jihadist rebels that are being armed and funded by Saudi Arabia and Turkey are fighting Hezbollah troops that are being armed and funded by Iran. And now Turkish forces have invaded northern Syria, and this threatens to cause a full-blown war to erupt between Turkey and the Syrian Kurds. Of course ISIS is right in the middle of everything causing havoc, blowing stuff up and beheading anyone that doesn’t believe in their radical version of Sunni Islam. \\nIt is absolutely insane that the United States and Russia could potentially go to war because of this conflict. Both sides are determined to show the other how tough they are, and one false move could set off a spiral of events from which they may be no recovery. \\nThe American people very foolishly elected Barack Obama twice, but up until now the consequences have not been quite as dire as many had been projecting. \\nHowever, right here at the end of his second term Obama is facing a moment of truth. If he ends up dragging us into a war with Russia, the American people will ultimately bitterly regret putting him into the White House. Drowning In Debt: 35 Percent Of All Americans Have Debt That Is At Least 180 Days Past Due » Guest \\n“If he [Obama] ends up dragging us into a war with Russia, the American people will ultimately bitterly regret putting him into the White House.” \\nOh, I doubt it. Most Americans just lap up the propaganda fed to them by the mainstream media that has incessantly demonized Putin and other foreign leaders. Where is the outrage over what this administration has done in destabilizing Libya and other sovereign nations in the Middle East? Where is the outrage over what the Bush administration did in Iraq and Afghanistan? \\nThere is a video on Youtube with General Wesley Clark discussing how the Pentagon planned to attack 7 countries in 5 years. Google it. JC Teecher \\nThe reality of the general public putting an atheistic/muzzy, into the white house, will not strike home, until their sons and daughters are coming home in body bags. Guest \\nNo, when their sons and daughters come back in body bags, their parents will wave that American flag and say that their children died to defend the “freedoms” of this country. Good grief. JC Teecher \\nOh yea. plenty of those folks as well. watchmannonthewall \\nGod help us! You are both right! But there will be far fewer of the first than the second! Paul Patriot \\nNothing liked a lame duck traitor to recklessly stick his nose in the affairs of others, and then leave office in a few months. \\nThis traitor should have been impeached after one year of his first term…..but the American sheeple demanded the “change you could believe in”. So, the way I see it, we are bearing the fruits of allowing a traitor to occupy the white house, and a apethetic population that is not united and sat back and did nothing to protest. If Hitlery gets in, she will gladly continued the change that Obama (global elite masters) has been determined to accomplish, and will transform this nation into a nation unrecognizable to most who call this nation home. \\nI predict if hitlery gets in she will be even more addicted to executive orders than the invader obummer. df NJ \\nI’m not sure Obama is really in control of the military at this point. gfmucci \\nSheesh, I hope you’re right. Orlando \\nPrayers for us all since all the elite and Governments have bunkers to hide in smh we should have never allowed the Government Coruption to get this Far that’s why I’m voting Trump if we even make it to That at this point Who Knows Bill G Wilminton NC \\nVOTE TRUMP !!! Donna \\nYes we need to vote for Trump, but here’s the problem, it has now surfaced that 15 states have voters machines that are connected to George Soros and friends. The second thing is we have to quit being so weak as the American people wanting someone else to fix this for us. I do t know that they can this time. Bill G Wilminton NC \\nDonna Vote For Trump, Be Strong, And Be Happy That You Are One Of The ” DEPLORABLES” !!! Donna \\nThank you, didn’t get to see this till today but, WE WON!!! SnodtBlossom \\n2 Peter 2:1-22 ESV \\nBut false prophets also arose among the people, just as there will be false teachers among you, who will secretly bring in destructive heresies, even denying the Master who bought them, bringing upon themselves swift destruction. And many will follow their sensuality, and because of them the way of truth will be blasphemed. And in their greed they will exploit you with false words. Their condemnation from long ago is not idle, and their destruction is not asleep. For if God did not spare angels when they sinned, but cast them into hell and committed them to chains of gloomy darkness to be kept until the judgment; if he did not spare the ancient world, but preserved Noah, a herald of righteousness, with seven others, when he brought a flood upon the world of the ungodly; … Lester Holt \\nWe knew you were an idiot. At least you’re a Christian idiot. SnodtBlossom \\nHow much prior political experience does Trump have? NADA!!! ZIP!!!! ZILCH!!! ZERO!!! He talks the talk, but never walked the walk. But hey.. it’s only THE PRESIDENCY! Maybe next we’ll grab people off the street w/no medical training to do surgery! Neither did Ulysses Grant or Dwight Eisenhower have a prior politcal position, though both had a strong military background. Dwight being ” The Supreme Commander of Allied Forces in World War II” and Grant “Commanding General of the United States Army” How much military background does Trump have? NADA!!! ZIP!!!! ZILCH!!! ZERO!!! \\n“no major U.S. company has filed for Chapter 11 more than Trump’s casino empire in the last 30 years.” He has filed four business bankruptcies. Maybe he thinks it’s just as easy to file bankruptcy w/the entire government and walk away. randy wellman \\nbankrupt…all major cities in america ARE bankrupt, so it is fitting that we put a person in charge that knows HOW to go through the process….cities, states, counties, the federal gub-mint, and individually. we are ALL broke now. they ALL thought they could spend money in perpetuity, never having to actually PAY these debt obligations. the check is now ON THE TABLE, and the waiter is nervously tapping his foot….and BTW, we don’t NEED a person with “experience”, as their advisors they hire once in office are the ones that actually do the work/planning….all we need is a person willing to do U.S. RIGHT….a person with HEART. we KNOW killary has done the WRONG thing at every turn….pick the guy who will do RIGHT, america…don’t put ANOTHER criminal in the spitehouse. Lazarovic \\nDon’t waste your time with Bill, he ain’t playin’ with a full deck…. Orac4Prez \\nHillary is going to have him in her team to “kickstart” the economy! pulltheweeds \\nhe has the same amount of military background as obozo and hitlery SnodtBlossom \\nBoth were Hillary & Obama were Senators before Presidency Trump hasn’t even been mayor of a rich boy community watchmannonthewall \\nAn interesting thought and one that appears to be supported in some quarters. However, who “purged” the military leaders over the past 5-6 years and placed those who are now in charge where they are? The man seems to be a master at creating situations where a defense of“plausible deniability” can be invoked! There is little doubt much of what he has done has been a well thought out, and implemented, strategy that creates a lot of confusion and allows no one to be held accountable. Look at the IRS scandals and the gun running to drug dealers in Mexico by the DOJ! Everything he does is meant to destabilize society! Mike Smithy \\nPerhaps President Zero will get another Nobel Peace Prize. alan \\nPiece prize. Similar but completely different. John \\nYeah, Piece Prize. For blowing up Americans to Pieces! tracey marie \\nlearn to spell if you are going to troll ALWAYSTOMORROW \\nCOUNTDOWN. Today, October 16, 2016. In 22 days I predict Mrs. Clinton will be elected our next president. Bill G Wilminton NC \\nIf Trump Is As Far Ahead As I Think He Is There May Not Be An Election…… Donna \\nIf he causes a war with Russia and our idiot GOP congress approves it, we the people better take up arms to remove them and try them for treason! jakartaman \\nObama”s job from the globalist elites was to bring down the USA to the level of Greece. Globalism is the new term for Communism. BTW he has done a terrific job!! Lennie Pike \\nHate democracy much? Orac4Prez \\nClinton’s account hacked. Blame Russia. This is the classic bait and switch. Love or hate her, the “line” has been sold that the Russians were involved in the hacking. Even if something happens that was a system fault, she now has a scapegoat and will hammer the line that Russia did it before and will do it again. She’s blamed China on other occasions, so she can even play the line that “at this stage we only know that it was an outside attack.” And be sure that the media will spin it even further for those ratings! Before long the general public will be DEMANDING action. Orac4Prez \\nCan you explain why the US air force has been sending warbirds into the region with transponders off (eg over the Black Sea and through commercial airspace) and some painted in Russian air force colors – with the Red star! df NJ \\nIn the movie The Dark Knight, Batman is trying to figure out the Joker’s motivations. \\nAlfred tells the story that one day he found a child playing with a ruby as big as a tangerine. The bandit had been throwing the stones away. \\nWayne says, “So why was he stealing them?” \\nAlfred says, “Because he thought it was good sport. because some men aren’t looking for anything logical, like money…they can’t be bought, bullied, reasoned or negotiated with. \\nSome men just want to watch the world burn.” SnodtBlossom \\n“Are all these words to go unanswered? Is this talker to be vindicated? 3 Will your idle talk reduce others to silence? Will no one rebuke you when you mock? 4 You say to God, ‘My beliefs are flawless and I am pure in your sight.’ 5 Oh, how I wish that God would speak, that he would open his lips against you 6 and disclose to you the secrets of wisdom, for true wisdom has two sides. Know this: God has even forgotten some of your sin. 7 “Can you fathom the mysteries of God? Can you probe the limits of the Almighty? 8 They are higher than the heavens above—what can you do? They are deeper than the depths below—what can you know? 9 Their measure is longer than the earth and wider than the sea. 10 “If he comes along and confines you in prison and convenes a court, who can oppose him? 11 Surely he recognizes deceivers; and when he sees evil, does he not take note? 12 But the witless can no more become wise than a wild donkey’s colt can be born human.[a] 13 “Yet if you devote your heart to him and stretch out your hands to him, 14 if you put away the sin that is in your hand and allow no evil to dwell in your tent, 15 then, free of fault, you will lift up your face; you will stand firm and without fear. 16 You will surely forget your trouble, recalling it only as waters gone by. 17 Life will be brighter than noonday, and darkness will become like morning. 18 You will be secure, because there is hope; you will look about you and take your rest in safety. 19 You will lie down, with no one to make you afraid, and many will court your favor. 20 But the eyes of the wicked will fail, and escape will elude them; their hope will become a dying gasp.” LOSER BLO SUM ONE \\nIGNORE THE BLO SOME ONE SnodtBlossom \\nThe wind blows where it wishes. You hear its sound, but you do not know where it comes from or where it is going. So it is with everyone born of the Spirit.” \\n9“How can this be?” Nicodemus asked. \\n10“You are Israel’s teacher,” Jesus replied, “and do you not understand these things? 11Truly, truly, I tell you, we speak of what we know, and we testify to what we have seen, and yet you people do not accept our testimony. Teresa F \\nOh good… you’re in the New Testament now SnodtBlossom \\n😀 momentarily Orac4Prez \\nYou missed the obvious… 2 Tim 3:16 “All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness” Both new and old testament.. watchmannonthewall \\nUnfortunately, there are still many teachers Jesus could still ask, “And you are a teacher in Israel and do you not understand these things?” Forget about explaining them to those who are lost! Bill G Wilminton NC \\nPut Her On BLOCK…I Did. watchmannonthewall \\nIt is interesting that the man you quote ended up being rebuked by God for his FOOLISH words. He was eventually forgiven when God stood up for Job and had Job pray for the man because of his stupidity in projecting a false picture, bearing false witness, of Him. Oh that we might take some of this to heart! JC Teecher \\nFor what it is worth; would it not be an easy task, for the Odrama/liberal/Industrial War Machine, to pull off a strike of instant war of immediate reaction, with the powers of the Iranian/Russian regimes, in light of a Donald Trump win next month. \\nEasily, it could be the catalyst for a chaotic event of stock market crashes and world wide chaos to invoke a martial law edict. Which, would prevent Trump from becoming potus, and keep the NWO wheels turning. \\nEven with a liberal win, it could be the one thing that prevents a psychopath from actually taking the reins, and continuing a program that is soon to take a hold of the whole world, anyway. \\nFolks that are awake and seeking truth, should pay attention and make changes in their lives accordingly. df NJ \\nOn the one hand you say government is completely incompetent and a waste of money. And then in the next breath you say government is a super genius organization capable of duping everyone into a NWO. Just like people resist Jesus Christ and your Christian religion, people will resist the NWO. \\nOne thing is for certain. People will continue to copulate and have babies. And most people hate their bosses and would not do anything the boss asked them to do if they were not being paid to do it. I think having faith in people this way is a faith that is very strong. gfmucci \\nAgain, words from an obviously abused person: \\n“And most people hate their bosses and would not do anything the boss asked them to do if they were not being paid to do it.” \\nThat is a dark and hopeless sounding attitude you have there. And it does not reflect reality in my 70 years in the world. Liberty First \\nThere would be a civil war. Are they that stupid? df NJ \\nThe South got their butts kicked the last time. I doubt the pussssies in the South have the guts to try it again. dlewenz \\nThe civil war of the past is not relevant, what we will have is a takeover of all democratic office holders and remove them from office with military and local police support, you can call it a constutional rebirth. James Staten \\nMark Twain said that ever man is entitled to at least one insanity, but he was wrong!!!! alan \\nIt doesn’t need to be an armed revolt, just vote for succession and do it. Donna \\nYour an idiot, you make it sound as though it was quick and seamless, I’d say we all lost that war, many Americans died in that long ruthless war. Another point I might make here is you better look at the size of Trumps rallies to the size of her meetings…oops, my bad her rallies. Also us southern rednecks aren’t the ones who won’t own a gun because you think you’re corrupt government is the only ones who should have them. Civil war is the last thing you liberals want. You enjoy being helpless and told what to do, and over half the military will not support her or the POTUS you have now. Destiny \\nThe U.S. didn’t win the war on the battlefield but by the war on Southern civilians. The marches through South Carolina, Georgia, Mississippi, North Carolina where 25% of the houses were burned and all food was taken, Florida, where children of a town were nail inside a church and burned alive. Athens, Alabama where the soldiers were given an hour to rape, pillage and do any evil thing to the people they could dream up. Southerners more that other Americans should know why the world hates us, df NJ. JC Teecher \\nYep! Donna \\nI think there is a chance of that anyway if she gets elected. Our military will be cut to shreds because they won’t serve her. pulltheweeds \\nagreed Allan Rogan \\nRight on the money forgive the pun a voice in the dark chillawack bc canada.thanks neighbour SnodtBlossom \\nJCT is the biggest fool to ever walk these boards.. You Canadians have bacon for brains. tsf \\nNo reason to get regional here. We’re all made of the same stuff – Canadian or American. Instead, we should appreciate our neighbors for sharing the longest unguarded border on earth. crossroads2016 \\nIf JCT were a fool, he’s a fool for CHRIST. Whose fool are you?? \\nnobody’s df NJ \\nI think many Christians want WWIII to happen. I don’t understand why people are praying for death and mayhem of innocent woman and children. If WWII happens, millions of pregnant women will be killed and their babies aborted. I just don’t understand the death wish by the Christians. If they want to to meet their maker can’t they do it in private. KarenL \\nI am a christian & we’re not praying for death to anyone, however WWlll is inevitable whether we want it to or not its coming, it’s in the bible, we must be wise & be ready to meet the Lord i just pray that when it does its swift so no one suffers but the enemy is at play & certainly wants it, aldownunder \\nI agree WWIII is inevitable But not because it’s in the bible Fiction = Not true KarenL \\nyou are entitled to your opinion even if its wrong, no matter how hard scientist have tried to disprove the bible, the more they proved every thing is correct, in the end, every knee will bow every tongue will confess, when Jesus returns but in Rev 9 it speaks about it, so its going to happen bc God said it will…. SaveUSA \\nBible is true…Has been proven to be true…You are not obligated to believe it.However, the facts and the events lines up as was told by the Lord through the apostles in the Holly Bible. GSOB \\n……”You are not obligated to believe it”…. ?? \\nAll In The Bible……. Jerry C \\nThe Holy Bible is the only Truth on this planet and the Deception will get much worse. gfmucci \\nWhere do you get this BS idea from? There isn’t one sect of Christianity that desire what you described. You may be mistaking Christianity with Islam whose leaders are hoping to bring in their Mahdi via violent provocation. SnodtBlossom \\nWHEN???What did i miss? SaveUSA \\nWWII is past tense a 70+ years ago..And as of WWIII you are a very poor soul to believe that Christians are waiting or wanting to happen…If it is true they are not true Christians….Get your fact straight and read the Revelation that may shed some light in your heart. Bill G Wilminton NC \\nBS…….Are You On Drugs ALWAYSTOMORROW \\nBill, was your above statement a quote from the bible too? New or old testrament? Bill G Wilminton NC \\nMr gfmucci Below Says It Perfectly…..Read About It…. Paul Patriot \\nThere is no death wish by Christians. It is in your mind. You are not listening……I have told you manyt times before…..stop drinking the koolaide that the pied piper of propaganda is feeding you, get off yoiu mefds and start thinking for yourself. realist \\nWhy is it that when Trump says there is election interference and rigging going on, he is derided and chastised as being ridiculous. But Hillary can say the Russians are doing the same, with absolutely no proof, and the media take it as the word of God. What irony and hypocrisy. gfmucci \\nI call it mindless complicity due to the training of most journalists in our Socialist/Communist schools of higher education over the last 5 decades. Resistance \\nNot just higher education. It starts from elementary school. Indoctrination is the key to controlling future generations. It’s been going on for longer than the last five decades. Still, an awesome comment. Orange Jean \\nAnd it’s not just journalists. I went to UMass-Amherst in the 80s, studied anthropology and then grad school in geography. Anthro was clearly focused on presenting the “Marxist-Leninist school of thought” on EVERYTHING. Geography somewhat less, but they have swollowed the “global warming” hoax hook, line and sinker. And that was in a state university, funded largely with taxpayer money. LIZ THE SHIZ \\nyup, there’s nothing like a good old commie education from the Peoples Republic of Massachusetts SnodtBlossom \\nTrump IS RIDICULOUS!!! He’s the RONALD MCDONALD of the USA w/o the CLOWN OUTFIT All the world may love a clown, but he would make the USA a LAUGHINGSTOCK w/his INCOMPETENCY & ARROGANCE! GoinSheep \\nWhen you compare the candidates, I wonder if you’ve noticed: \\nDonald Trump \\n1. Hasn’t killed anyone… 2. Hasn’t lied under oath… 3. Hasn’t committed perjury in Congress…… 4. Hasn’t leaked national secrets… 5. Hasn’t sold Uranium to Russia… 6. Hasn’t supplied weapons to militant Muslims… 7. Hasn’t stolen money from the State Department… 8. Hasn’t peddled national interest in turn for donations… 9. Hasn’t left any Americans for dead… 10.Hasn’t provided new Toyota trucks to ISIS… \\n11. Hasn’t left a string of body bags behind him, including two young boys The list goes on and on, but I don’t have that kind of time… \\nLocker Room Banter Versus Treason – There is no comparison! \\nFirst, any guy who says that they have never participated in locker room banter or said something sexually explicit when they had a reasonable expectation of privacy is either Jesus or a liar. There is no comparison between natural male human behavior and treasonous activities. \\nAdditionally, this low-life ploy by the Progressive Liberal Democrats is disgusting and changes nothing for many of us. JFK was having an ongoing affair with Marilyn Monroe and I’m sure his Secret Service Agents could have repeated some rather spicy language in which he described their sexual sessions. But you know what? Neither JFK’s Secret Service Agents nor the Mainstream Media said anything about the affair, much less JFK’s private conversations about it because they had dignity, respect for the office of POTUS, and respect for JFK. Any ONE of those things alone should be enough to keep despicable actions of the democrats and the Mainstream Media from happening around the whole institution of the POTUS, including the potential POTUS candidates. However, we see that neither the democrats nor the Mainstream Media have any honor, truth, or journalistic integrity remaining. \\nGeneral George S. Patton and Prime Minister Winston Churchill were both as crude as they come in private, and often in public, but they got the job done when they were called upon. Maybe you don’t consider Donald Trump in the same ranks as the above three men. Maybe you don’t think Donald Trump can get the job done. Either way, I couldn’t care less. What I do care about is the poor state of our country, the damage that Barack Obama & the democrats have done, and the damage that Hillary Clinton is sure to do. For Pete’s sake! Look at the shell of a city that used to be Detroit, MI. Look at Chicago with double-digit murders just about every week. If you want the US to look like these long-time democrat-run cities, by all means, vote for Hillary Clinton. If not, then the ONLY other VIABLE option is Donald Trump. \\nIf the worst thing that the democrats, the Mainstream Media, and the Progressive Liberal Useful Idiots have on Donald Trump is locker room banter by a man acting like men do, then that’s nothing to see, in my opinion. It might actually be beneficial to our country to have an alpha-male as POTUS, for a change. Lynn Bowling Cosentino \\nAnd we’re not already? Obama has succeeded in making us look stupid and weak, always apologizing for America’s actions of past decades. Other world leaders don’t trust him. Lazarovic \\nI’d say you’re a mindless, brainwashed acolyte of the Rush Limbaugh Institute of Advanced Conservative Studies…. (snicker) Raymond Chow \\nHow is that when you can turn off Limbaugh anytime you want but you have no choice when it comes to public education? You are one stupid dimwit, you are one of the idiots that voted for a dumbass knee grow and now want to put in a DISHONEST CORRUPT CROOKED HOG (no typo) for president. Lazarovic \\nIt is difficult to free fools from the chains they revere. SnodtBlossom \\nTrump has done nothing but give lippservice. He has never worked a steady bureaucratic job in his life. He blasts his mouth in obnoxious ways. Are you insane enough to want this man as a president? Paleface \\nIt states quite plainly that I’m referring to lippservice Trump TheLulzWarrior \\n“that I’m referring to lippservice Trump” \\nWe have no troubles believing you! 😉 SnodtBlossom \\nYou know I have to edit spelling to avoid censure LIZ THE SHIZ \\nlippservice , I thought that was you give to your dates after they bought you dinner SnodtBlossom \\nmm.. been a long time since I’ve done that.. I had a bf over 10yrs you know.. maybe my boss will get brave LIZ THE SHIZ \\nit’s always a good career move to SUCK up to the boss SnodtBlossom \\nHe’s much HARDER to get than expected 😉 LIZ THE SHIZ \\nbut I HEAR HE’S A BIG TIPPER SnodtBlossom \\nI AM due for a raise Da Fish \\nYES; beats the crap out of Warmonger Hillary. ThePeanut995 \\nWe do not need this slimy couple in the White House again! SnodtBlossom \\nRidiculous! T rump would be the first one to say offensive things and get us into a war. TrollingforTrolls \\nClinton has both public and private positions on issues. At least he (Trump) speaks his mind on what is so blatantly wrong with our current system. Hillary will sell out everyone, including YOU to attain the power and prestige she yearns. Be careful what you wish for Bill G Wilminton NC \\nPut Snotty On Block…I Did !!! SnodtBlossom \\nBill wears frilly girly panties LIZ THE SHIZ \\nand you of course wear Government issue boxers SnodtBlossom \\nI wear no undies under my Mao suit 😉 jonodough \\nyes. satin85718 \\nShe and obama want WW3 more than anything! What is wrong with you? Check it out! They have signed a death certificate for the Americans! GoinSheep \\nDid she say that? Would you post the link of the death certificate? watchmannonthewall \\nAdults don’t immediately respond to words. If they did the U.S., because of Obama and Hillary, would be toast. We will be toast anyway. Any one who thinks Russian leadership is going to wait for the U.S to make the first move, unless they allow us one and then hit back 100 x’s harder, is living in la la land. Nukes will come out almost immediately. No more 15 year wars. If Hillary wins, this is what you have to look forward to. If Trump wins, the neocons might still hijack policy and we may end up there anyway. Count on Putin to play to win, it won’t be a long war! jonodough \\nI hope they nuke D.C. First. \\nWow. Thought police Automatically typing in for me with the lowercase d c turning into D.C. \\nGlobal control of the internet and free speech now in place. LIZ THE SHIZ \\nsteady bureaucratic job = lazy pencil pusher with 10% productivity at best just biding time until they collect a pension paid for by the makers and do’ers SnodtBlossom \\nYes.. but not everyone can sit there steadily while draining the taxpayers ThePeanut995 \\nAre you insane enough to want Hillary as president? I pick Trump over Hillary any day of the week! The_Ipcress_File \\nI’d rather have a Muslim in the WH….oh, wait. TheLulzWarrior \\nFacetious BelieveInCod \\nSnodt is quite sane. Almost all the people in Intelligence and the Military are voting for Hillary. We know that TrumP really isn’t what’s good for America. -retired Major ThePeanut995 \\nThe people on this website are mostly Christians. Christians will vote for the President who will stand up for and enforce Christian Values … such as pro-life! By voting for Hillary you are voting pro-choice which means KILLING BABIES! You will have to answer to GOD if you vote for her. I choose GOD and what HE has said is important! Also Trump wants traditional marriage (not Hillary) which is also God’s will! Woa to those voting for Hillary … they will have to answer to God! GoinSheep \\nGuys who vote for Trump won’t be able to get some for many years. John Hughes \\nI think most men can live without sexual favours from Madonna! Lynn Bowling Cosentino \\nWell, if Hillary gets in I hope you never piss her off if you know what I mean. Raymond Chow \\nSnodtBlossom is the same troll a few months back trolling in this site. She had a picture of a vampire back then calling herself someone from Florida. SnodtBlossom \\nlook closely into my flower.. Same pic Same Florida 😉 \\nLester is a homopester crossroads2016 \\nWe’re so sorry that when you were a kid, you got caught trying on your mom’s dress when you thought no one was home. SnodtBlossom \\nI’m female you goof jonodough \\nWhAt about tomorrow? Will you self identify as a woman tomorrow to get into a ladies locker room? Bill G Wilminton NC \\nPut A Block On Snotty…I Did !!! Odeezy Liita \\nYea, because we TOTALLY need more beaurcrats running the show. That’s worked out so well for us. Wake up dummy. Gave \\nYes. Insane or not – our choice. You made yours – you’re not with us, so –‘git. SnodtBlossom \\nAnd I’ll be yours until the stars fall from the sky, \\nYours until the rivers all run dry \\nIn other words, until I die \\nBaby, I’m yours (baby, I’m yours) \\nAnd I’ll be yours (yours) until the sun no longer shines, \\nYours (yours) until the poets run out of rhyme \\nIn other words, until the end of time \\nI’m gonna stay right here by your side, \\nDo my best to keep you satisfied \\nNothin’ in the world can drive me away \\nCause every day, you’ll hear me say \\nBaby, I’m yours (baby, I’m yours) \\nAnd I’ll be yours (yours) until two and two is three, \\nYours (yours)… \\nHa..ha…ha….. LIZ THE SHIZ \\nThank you everybody, I’m Snodtblossom and I’ll be appearing here all week at the Tampa Holiday Inn, bye the way try the sausage ,it’s to die for satin85718 \\nWhy do you want killery? What does she have planned for USA that you want? SnodtBlossom \\nKick Tru mp in the Rump Lynn Bowling Cosentino \\nAre you saying that the ordinary US citizen cannot serve as president? Remember our Constitution represents a government for the people and by the people (aka Donald Trump) not career politicians who want to rule instead of serve. HisChild \\nIt’s not so covert when Obama goes around talking about it. EVIL BAS TURDS \\nHmm, isn’t that what they said about Bush? Just sayin’ gfmucci \\nI agree with your concerns – the Obama/Clinton machine will commit any insanity to remain in power. \\nHowever, this statement is a bit off the mark: \\n“Of course ISIS is …blowing stuff up and beheading anyone that doesn’t believe in their radical version of Sunni Islam.” \\nWhat ISIS is doing is Islam…not just “their radical version.” Muhammad and most who followed created the misnamed “radical” Islamic playbook. Most Islamic leaders today follow that same Muhammad-inspired playbook. So, no, it is not “radical Islam.” It is Islam, period. ali \\nRead bible and you feel its pretty violent at some places but offcourse I might be reading it out of context. Same is true for Quran. Now you can create more hatred among faiths by your statements as above or you can try to be a little less judgemental and try to create interfaith harmony which is the need of time. Bless you.  re Is NO Interfaith Harmony With Islam….Islam Means Submission !!! And If There Is Harmony It Is Only A Fake Interlude As “They” Work On Gaining Strength And Numbers !!!. One Wife 4 Concubines Equals Upwards Of 25 Kids AND ALL ON WELFARE AND SOCIAL SERVICES !!! The Host Pays For His Own Demise!!! Just Look At Paris “FINISHED” \\nI Have Read And Studied The Quran And The Hadith…The Infidel Either Converts Or Dies….Islam Is About Death To Its Believers And Its Enemies….Die For Allah And Have 72 Virgins….Allah Is No Loving God, Allah Is The Moon God “Lucifer” He Has NO Son Who Died For US But Wants Us To Die For Him….Blow Yourself Up For Allah…. What A Flock Of BS!!! MeMadMax \\nAnd we have president importing these mini nukes by the 747 load…. SnodtBlossom \\nHow much prior political experience does Trump have? NADA!!! ZIP!!!! ZILCH!!! ZERO!!! He talks the talk, but never walked the walk. But hey.. it’s only THE PRESIDENCY! Maybe next we’ll grab people off the street w/no medical training to do surgery! Neither did Ulysses Grant or Dwight Eisenhower have a prior politcal position, though both had a strong military background. Dwight being ” The Supreme Commander of Allied Forces in World War II” and Grant “Commanding General of the United States Army” How much military background does Trump have? NADA!!! ZIP!!!! ZILCH!!! ZERO!!! \\n“no major U.S. company has filed for Chapter 11 more than Trump’s casino empire in the last 30 years.” He has filed four business bankruptcies. Maybe he thinks it’s just as easy to file bankruptcy w/the entire government and walk away. Paleface \\nfile bankruptcy? that ought to be obamas job Lester Holt \\nHey you effeminate, flower-faced buffoon: \\nAt least Trump went out and did something with his life. \\nHave you never heard the saying:“Failure is the rungs on the ladder of success.” \\nOh sorry, that’s a little deep for you. Or was that cerebral? Oh never mind. \\nSo, how many businesses have you started? How many people have YOU employed? \\nTrump has no military background?Neither does Hillary. (Oops.) You conveniently left that out of your little tirade. \\nMaybe you should listen to others more, instead of crankin’ your bitch box.. Or before struttin’ your pompous, kneejerk opinions around. jakartaman \\nThat why I will vote for trump!! Donna \\nYour talking Old Testament, I wish democrats would quit doing that! Once Christ was born and died for our sins all that changed. So don’t bring it up, it is there for the stories of how it was before Christ, not after. SnodtBlossom \\n5:17 Think not that I am come to destroy the law, or the prophets: I am not come to destroy, but to fulfil. 5:18 For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled. 5:19 Whosoever therefore shall break one of these least commandments, and shall teach men so, he shall be called the least in the kingdom of heaven: but whosoever shall do and teach them, the same shall be called great in the kingdom of heaven. 5:20 For I say unto you, That except your righteousness shall exceed the righteousness of the scribes and Pharisees, ye shall in no case enter into the kingdom of heaven. 5:21 Ye have heard that it was said of them of old time, Thou shalt not kill; and whosoever shall kill shall be in danger of the judgment: 5:22 But I say unto you, That whosoever is angry with his brother without a cause shall be in danger of the judgment: and whosoever shall say to his brother, Raca, shall be in danger of the council: but whosoever shall say, Thou fool, shall be in danger of hell fire. Lester Holt \\n“A proverb in the mouth of a fool is like a thorny branch brandished by a drunk.” Proverbs 26:9 \\nPut Snotty On Block…I Did !!! jakartaman \\nITS called a NEW Covident LIZ THE SHIZ \\nwhat’s a covident? is that some new technique used in auto body shops? Bill G Wilminton NC \\nCovenant….. ali \\nHow come word of God has so many versions. Which one is true and which is false. Jerry C \\nThe Dead Sea Scrolls found in 1947 prove the accuracy of translation for almost 2,000 years, based on the Textus Receptus texts; otherwise known as the Received Texts. All modern perversions go by texts found much later in Alexandria, Egypt, so all those are corrupt. Hope that helps you. By the way, you should study the book of Esther in original Hebrew using acrostics since that book was almost not included in the canon because God’s name (God of Abraham) was not written (technically, not written on the textual level). May the God of the Holy Bible lead you to the Truth. Abba Father. Amen. Donna \\nThey are all true, the old testament was written before Jesus’s birth, after Jesus was born and died for us on the cross a lot of things changed because we are forgiven through his blood on the cross. All we have to do is sincerely ask for his forgiveness and obey the commandments, and live an obidient life. Study his word and apply it to our daily lives. Don’t just take someone’s word, go to church and even then back it up with his word and prayer. gfmucci \\nThe huge difference you choose to ignore, Ali, is that the founder of Islam, Muhammad, unlike the founder of Christianity, Jesus, practiced jihad, violence, intolerance, supremacism, and conquest as written in his book, Qur’an. Christ was opposite. So of course faithful Muslims attempt to emulate the life of Muhammad as Christians attempt to emulate Christ. So, naturally, good Islamic leaders want their followers to emulate Muhammad in all his violent and conquering overt jihad and stealth jihad ways as well. \\nEven the ratio of Jews today shooting, beheading, igniting and terrorizing people in the name of their ‘Old Testament” religion, compared to Muslims, is 1 to 1 million. \\nNope, the “moral equivalency” argument you attempt is BS – it is a ‘uuuge stretch, aka “lie”, obfuscation, distraction, vain attempt, etc. But I know you will persist because Islam promotes illogic to attempt to prevail and conquer. ali \\nI am not here to argue. But if you go into historical facts, you will see that all the battles fought by Muhammad were in Self defense. I love Jesus as I consider him also Prophet of God. But then again you can choose to believe in what you want to believe in. \\nI do agree that concept of Jihad has been demolished by retarded extremists but I am not here to defend Islam or Muslims. Jihad means to struggle. Remember Muhammad also said Jihad of Pen and Jihad of Self control over desires and bad virtues is much bigger than Jihad of sword GSOB \\nJesus is God. Jerry C \\n“23 For all have sinned, and come short of the glory of God; 24 Being justified freely by his grace through the redemption that is in Christ Jesus:” Romans 3:23-26 jakartaman \\nNO- the techers of today – the Islamic experts will unabashidly tell you that ISIS is following the true faith. Theer is no miss understanding pls educate yourself TheLulzWarrior \\nFalse flag cyberattack lead to US cyberattack “retaliation” on Russian federation that retaliates in kind = Continued fighting over Syria = Mass panic in the US = Worldwide economic collapse and mass riotings = Elections can´t go ahead of schedule, martial law is declared. jakartaman \\nBeen saying this for years ISIS are the TRUE followers of the official techings if Islam Alcoholic Prepper \\nWal-Mart has created such a good prepper supply center in the camping isle. alan \\nNot to mention their economic collapse brand “Great Value”, helps you to save a little prepping. Mike Smithy \\nPresident Zero and his NWO handlers are on the wrong side of history. I am with Putin on this one. tacoma \\nThe American War Machine, consisting of POTUS (of both parties), the Pentagon, the CIA/NSA, the neo-con politicians, who have been fighting some kind of war non-stop around the world since WW2, is today mad as hell. See, they are not doing what they want with expected impunity all over the Middle East, the Russian front and the Chinese front. They expected to go in and simply take over the regions. With Pentagon massive Afghanistan and Iraq invasions, these were initial success of conquest and plunder. U.S. forces are today running these countries, ensuring there are daily suicide bombers for entertainment in American TV. But projects to take over Libya, Ukraine, Georgia, Syria, even Egypt ran into resistance. All such resistance can be traced to the strategy and actions of Russian president Putin. \\nMr. Putin said he opposes American military conquest of countries on Russia’s border. Perhaps he feels this encirclement is not to Russia benefit? Perhaps Washington would feel the same way if Russia took over Mexico and Canada? Well, why do you think the American War Machine spent so much effort, blood and treasure, the latter two items come not from the Machine, but from ordinary citizen mass of fools. \\nTime again Mr Putin played a superior hand. The War Machine is not used to being out-played. It is used to American Impunity, American Exceptionsim, American Power, American Superiority. \\nAnd so, with only a few months left in the current regime of war, this gang of devils is talking big war. Not the kind of ‘routine’ war America fight every single year since the founding of this military state. But Vietnam War II, even global nuclear war. \\nThe Syrian government is winning its country back from the rebels and terrorists. This is bad news for the American War Machine. The Machine is deciding that the only way to stop their project of conquest and hell is to declare war on Russia and Syria. This will drag China in on Russia’s side, meaning a war will break out in the South China Sea. \\nBut you know what if war is what the American War Machine wants then war is what it will get. History will record who comes out alive. \\nThe Russian military already stated publicly that if Russia is attacked then the next war will not be fought on Russia soil alone as it was when Napoleon and Hitler attacked. Russia have lost dozens of million of people in these attacks from the West. It has proven it can survive, win, even prosper. It will do so again. \\nThe only question is if America is wiling to put up the cost of attacking Syrian/Russian forces. On its own soil. Big time. I don’t think Obama/Hillary gang dares to ask such a question to the public. The public will detracted from its non-stop tweeting and celebrity worshiping suddenly to find out a certain American city just disappeared. And it ain’t a video game. Scott Comin \\nIt is the neo-cons not Obama. Obama is a puppet. The neo-cons have been running our foreign policy since Clinton or before. If you want to understand our foreign policy. Paul Craig Roberts is your man! David \\nif michael will allow me to paste the site hopefully there has been an executive order signed on Oct 13 2016 on Government preparing nation for Space Weather Events. Sounds like an EMP Detonation to me. I really don’t think any of us will know anything of what happens when the lights go out. read this executive order & you may also agree. my guess would be just before or right after the elections. we the sheep will be out of their way & without power we will litterally be living in the dark, Government doing as they please without our knowledge. Donald Trump has been exposing these DC Criminals for who they really are & they are in panic mode right now with all the allegations of his sexual misconduct. anything to keep him out of the White House. he gets in it’s game over for them. I got a Gut feeling they are getting ready to stomp on us. may God Bless you all!! alan \\nThere is no profit in nuclear war, there fore no nuclear war will happen! \\nNow a hacker war you could blame everything on it. Oh social security is bankrupt, Putin did it. Your retirement is gone, Putin did it. Stock market crashed, Putin did it. No EBT Putin did it. \\nI’m not saying the Russian’s are saints, but looks like Putin will take the fall for everything that will go wrong shortly. ali \\n“Jihadist rebels that are being armed and funded by Saudi Arabia and Turkey” and the west. Just a little addition to your comment above Tatiana Covington \\nWhy? Because he’s an asshole. Sammy \\nThere will be World War with the globalists in charge before a Trump presidency with the bums out of power horse777res \\nThe wicked shall be turned into hell, and all the nations that forget GOD. Psalm 9:17 America is becoming HELL! df NJ \\nWell, as it turns out God is indifferent and doesn’t give a crap about evil. There is no amount of evil God will not tolerate in order to preserve our free-will. Man poops in his own bed. If you want justice in the world it’s not going to come from God. If you want justice, it’s up to us to uphold our secular laws. Why anyone would ever be surprise by the depths and evil of human nature is beyond me. JC Teecher \\nWell, if you are speaking of the liberals on the left, and liberals on the right, then you are absolutely correct, it is becoming a sort of Hell on Earth, by their hands at the voting booths. \\nMurdering of 3500 innocent babies daily, by ripping them out of their mothers womb, and glorifying the sexual perversions associated with gay marriage and teaching it in schools, and churches, as acceptable in God’s eyes, is like living on a planet called Hell, and wondering what happened to good ole 1849. Anonymous \\n1. Declare war with Russia 2. Declare Martial Law 3. Install New World Order \\nMy theory….. \\nYour theory and that of a million more of us. Jerry C \\n1. Trump becomes U.S. President 2. Collapse the economy 3. Install New World Order \\nMy theory… \\nEvery President HAS to leave a legacy, it ensures the timeline will continue. \\nIf Trump did actually win, he will have no choice before to go down the same line. biglipnagger \\nHe is lighting as many fires as he can before he leaves to get back at whitey. Someone needs to throw him a banana to calm him down. XSANDIEGOCA \\nThe Democrats learned long ago that there is nothing like a War to goose the Economy. It also blows everything else off the Front Page. We are no longer governed. We are ruled. df NJ \\nThe arms manufacturers are ALL owned by Republicans. What you are saying makes absolutely no sense. Lennie Pike \\nThe Western Financial System is now on life support through the creation of “money” out of thin air. Countries which could fill the void would take all power away from the criminals now in control. \\nMany years ago the banksters acurately estimated how much time they had left before their financial system was dead and have been taking the necessary steps to implement their next financial system which will be a totally fraudulent cashless one. They must eliminate any possible competition. \\nThe timing has nothing to do with the election. Trump is no threat to the banksters because if by small chance that he is not their tool, they will easily correct the problem as they corrected JFK. df NJ \\nEvery president who attempted to provide interest free money supply to the American economy was a_s_sinated. The attempt on Jackson’s life was not successful or he will have been killed too. Lennie Pike \\nI was agreeing with you. You know the truth behind our institutions of slavery. Lennie Pike \\nI knew you were agreeing with me. I put it that way because there are very few things that I agree with you on – but that’s ok, I can tell that your opinions are sincere. \\nAfraid that spelling out the word “assasinated” will set off some alarms at a Fusion Center? Not I – because I was Born Again, and although I feel extremely alive, it is not due to worldly stimuli. F##k the NSA. \\nNo fear is a nice added benefit. thegeorgespyman \\nNew Obama Executive Order Hints At Devastating Space Event: “Could Disable Large Portions Of The Electrical Power Grid… Cause Cascading Failures” \\nhttp://freedomoutpost.com/new-obama-executive-order-hints-at-devastating-space-event-could-disable-large-portions-of-the-electrical-power-grid-cause-cascading-failures/ \\nI would dare to say this has nothing to do with ‘space weather’ and everything to do with an anticipated EMP attack on the power grid by Russia as WW3 commences. The severity of the loss of power would mean in real terms never having electricity again for a couple of years if not forever depending on whether or not peace terms are sought early in the conflict. Enjoy the stone age. A thousand years from now we may be a conspiracy theory about a lost civilization. \\nUS under attack? Panic as ‘explosions, air raid sirens and fighter jets’ stoke WW3 fears \\nThere is an exercise under way as of today VIGILANT SHIELD 17. That could account for it. A more likely scenario might be Russia aircraft approaching off the coast. Mike Smithy \\ndon’t worry they’ll call it an alien invasion JC Teecher \\n“…… the Syrian civil war has essentially been a proxy war between Sunni Islam and Shia Islam from the very beginning. ” \\nThat is the absolute truth, and whoever says that Islam is a religion of peace is either lying through their teeth, or is so ignorant, they probably believe the Keebler Elves are baking all those cookies. lol. \\nThe fact is that the two Superpowers of the world, Russia, and USA, via their “appointed/chosen/selected” leaders, are using this ongoing feud between the Muzzies, as to achieve their goals of “feeding” their respective war machines. \\nIt just so happens, that the new Vietnam, is Syria. It just so happens, that the refugee issue was a planned one, to further the goals of spreading the Arabian bloodlines throughout the world, to weed out all caucasian races of different countries. \\nThe plans of the devil, to eradicate the caucasians, that came from Adam and Eve, called Hebrews, then Israelites, then, the House of Israel (ten tribes to the North) that migrated to western Europe, and then later to North America; and, the House of Judah, tribes of Judah and Benjamin (plus some Levites and a few mixed in from the others) that were also part of the migrations; the plans have evolved to what we see now via Islamic peoples. \\nWhat was, the plan back in the beginning of this Earth Age, to eradicate the pure bloodline. through which Christ would come (be born), is still a problem for Satan. Albeit, the problem for him has now grown to include peoples from all races and bloodlines, (grafted in), via true Christianity. We were a thorn in his side back then and still are. \\nNow we see that hatred manifested via the liberal minds of ignorant, and possessed people (most unknowingly), to help further the agenda of Satan, because……..Rev 12:17“And the dragon was wroth with the woman, and went to make war with the remnant of her seed, which keep the commandments of God, and have the testimony of Jesus Christ.” \\nCan anyone, as a Christian grasp that concept, of what is taking place? Satan is behind this whole mess, and uses those that are “useable” to obtain his goal of trying to punish Christians. \\nIf left to Putin, and Obama, and all their pawn regimes of rogue nations, they would kill off all peoples that were Christian, and have a following of robotic peoples, so that they could “control” them. \\nIt will backfire on them eventually, and the soon coming of their leader, Satan, will not have enough time to get his agenda of hatred to come to it’s full potential against Christians; thanks to our Saviour and King, the Lord Jesus Christ. Rick \\nMichael, Just a minor detail, but I do not believe the “American” people elected Obama, at least not the second time. There’s great proof the election and electronic ballots were rigged for him. I travel the country for my job, and other than a very few brain washed lefties, I heard of no one that actually pulled the lever for him, or were willing to admit it. As you may recall, the “American” people were fuming mad about his first 4 years, so doubt they would be lying after the second election. Lazarovic \\nYou’ve drank way, way too much right wing kool aid my friend, you can’t even tell reality from fantasy anymore. Turn off the Fox Fake News, it should clear up. df NJ \\nHow quickly the right wingers forget the economy was losing 800,000 jobs per month at the time of the election. If the boy wonder’s administration did not screw up the economy so badly the gay black muslim guy who was supposed to take all ur gunns would never have gotten elected in the first place!!! Seen2013 \\nAnd, job creation is predominantly part-time, seasonally adjusted, and contractor that has not a prayer of replacing full-time employment and capital structure remains severely neglected. df NJ \\nGet rid of the 30-hour rule. Put it back to 20-hours and full time workers will return. Labor has NO voice in this country. It’s completely skewed in favor of the corporations. It’s alright. The longer the CEOs repress the working class the bigger the swing is going to be back in the other direction. Bernie Sanders hand thousands of people at his labor rallies. Next cycle should be the one. Cal \\nDemocrats are so funny. Not only dead people vote but fictitious people who live at fictitious addresses vote. Richard J Daley has got nothing on current democratic vote fraud. Let Jesus handle it. He will sweep this current scum off the planet in good time. Call it purification of liberals…Washington Post. When Jesus arrives Post employees will be hiding under the rocks in the Potomac River. df NJ \\nYou will be long dead and gone before the second coming or the economy collapses.   Second Coming Is Armageddon…..” The Rapture” Is Very Close !!! JC Teecher \\nYes it is very close, ….. to Armageddon that is. About 15 minutes just before the Hand of Christ is raised and He kills all those in the army gathered to come against Israel, by the sword of His mouth, that cuts both ways. \\nSo, that 7 year pre-trib rapture is all junk that is proliferated by the likes of the “Left Behind” crowd. \\nThe “rapture” is nothing more, or nothing less than the physical change from a flesh body to a spirit body. For those found in the Book of Life, that have not followed the lies of man and followed the “first” Messiah, they will also have an incorruptible soul. \\nNot so much for the pre-tribbers and liberals, that have followed ole Lucifer as he has played the role of the Antichrist (first messiah), and the false prophet. max gon \\nWW3: The only one to blame for the end of humanity will be the brainwashed and spineless USA population for sitting idle and doing nothing to stop this insanity. df NJ \\nJust what exactly do you expect people to do? There’s nothing that can be done. I’m not 100% convinced the US military is under civilian control anyway. \\n“Reclaiming Civilian Control: How to Keep Generals as Warriors, Not Politicians” \\nJust ask yourself, “If the devil himself was president, what would he do?” Fiddlin df NJ \\nWould Jesus drop 23,000 bombs on five predominately Muslim countries in 2015 only? I don’t think so. I think Jesus would be advocating a little less war by our so called “Christian” country. GSOB \\n??? df NJ \\nYou would think people who follow the teachings of Christ would be anti-war. But they are not. LIZ THE SHIZ \\nI don’t know but I get the feeling that this is an NSA / CIA controlled website which wants to gin up and lure anti-government patriots to say provocative statements that can be used against them at a later date , so when a Reaper or Predator drone approaches your house will you hear it coming? df NJ \\nThe NSA practically doesn’t exist anymore. The guts of the agency have been outsourced to a private corporation Booz Allen Hamilton. How many times have we heard Edward Snowden’s name and NSA in the same sentence. Snowden was not even a government employee! He was some burger flipper hired off the streets. Snowden was an employee of Booz Allen Hamilton!!! It’s the most amazing story. Just imagine this implications of a privately run security apparatus for the US government. By their own corporate charter to increase shareholder value above all other considerations the executives of Booz Allen Hamilton would be remiss in their corporate duties if they did NOT sell state secrets to the highest bidder. I don’t understand why Snowden’s name is even mentioned in any stories. Booz Allen Hamilton taking over NSA is one of the biggest stories in our lifetime that is completely ignored. LIZ THE SHIZ \\noutsourcing is the best way to deflect blame , how many so-called private security enterprises are just cover operations for our intelligence apparatus , they are one of the major growth industries in the DC Metroplex df NJ \\nOutsourcing the NSA ? We might as well give the Chinese all the gold in Fort Knox. Oh wait, there is no gold in Fort Knox. LIZ THE SHIZ \\nthat’s right out of the Goldfinger plot line df NJ \\nYeah, I just made up the whole thing. Booz Allen Hamilton doesn’t exist. Snowden was government employee. Go back to sleep. Orange Jean \\nPlenty of Booz employees work for DOD also. Seen2013 \\nBy all signs, national security and national interests have been overly blurred. The Arabian Alliance predominantly made up of OPEC members effectively leveraged US Foreign policy in the region that Israel, Iran, Syria, Russia, and China are throwing a monkey wrench into national interests as a result. tsf \\nWell now, unusual things have a way of happening during an election year. Is not this game with the Russians a ploy to somehow help Hilary? Perhaps people will regard The Donald as more trigger-happy and Hillary as more restrained. (?) As such, more folks may be moved (or rather frightened) into her column. Your thoughts? Rhino Horns \\nGod is about to gather all nations to fight against Jerusalem (Zechariah 12 and 14), but not before Ezekiel 38-39 happens first! Rhino Horns \\nGod is putting a hook in Obama’s jaw (Ezekiel 38) to drag him into World War 3 over there in Syria, and then Obama will be destroyed in spectacular fashion once the battle moves down to Israel (Ezekiel 39, Zechariah 12, Zechariah 14). Coming soon! df NJ \\nA God of love would never allow such hatred to be realized. GSOB \\nGod is all loving. Bill G Wilminton NC \\nGod Is Just And God Will Forgive Any Sin If The Sinner Asks For Forgiveness……NO ONE Will Enter Into Heaven To Be With God With Unconfessed Sin On Their Soul… \\nGod Does Not Want AnyOne To Be LOST But Some Will CHOOSE To Be LOST !!! \\nShalom \\nWorld War 3 has been cancelled due to a lack of public support. If you are not 100% satisfied your money will be cheerfully withheld.Please call 1-800- MASHIACH and ask for “UNCLE NUKE”.. Chris utter \\nif it walks like a duck and quacks like a duck…. Its a quack, and this page is full of them… retired22 \\nI don’t believe this business is anything but an amateurish propaganda ploy that is not going anywhere except the front pages of left wing papers. If this regime of incompetent fools were really interested in these attacks on the Russians,…even they would not be stupid enough to advertise it all over the media. Something of this nature,if real,would be the deepest & most guarded secret until after it happened! This is like a widely advertised Hollywood stunt to generate activity for some new movie. Just imagine Hitler telling the world what he intended a week before he invaded Poland. Imagine the Japanese government in 1941 telling the world that Japan we was going to attack Pearl Harbor on Dec.7 of that year! \\nOnly a pack of fools like those in the Obama regime would cook up such a pathetic plot! df NJ \\nAll the news outlets are owned by Republicans. It’s just not true that the papers and cables news are liberal. \\nIf you want liberal this is liberal: \\nJust because you claim it’s liberal it’s NOT! Hillary is a Nixon Republican. A Democrat from Texas is further to the right than a Republican from New Jersey. USE YOUR MIND…. df NJ \\nDid Hillary Clinton work for Goldwater? \\nShe was a high-school Young Republican and “Goldwater Girl” in 1964 but swung to supporting Democrat Eugene McCarthy’s campaign in 1968 and George McGovern’s in 1972. \\nShe’s a Republican: \\nHillary Clinton (“Living History,” page 21): I was also an active Young Republican and, later, a Goldwater girl, right down to my cowgirl outfit and straw cowboy hat emblazoned with the slogan “AuH20.” … I liked Senator Goldwater because he was a rugged individualist who swam against the political tide. retired22 \\nCan I ask you a serious question? What the Heck are you babbling about? Orac4Prez \\nDay 1. Hillary wins Day 2. China unveils newly discovered ancient navigation charts showing an atoll off the US was actually Chinese territory. Day 3 Sends boats to reclaim island and build Chinese Cultural Center and Freedom Radio Station: Voice of China. Day 4. Sends aircraft carrier fleet along the coast of the US to ensure freedom of navigation & protect Chinese interests. df NJ \\nNative Americans have been proven genetically to be of Chinese descent. \\nBut what difference does it make. You are projecting American values on the Chinese. If you study Confucianism you would understand something profound about the Chinese character. They built the Great Wall to keep people out. Unlike American adventurism, the Chinese people simple are not expansionists. Yeah, they do stuff to make sure they have enough oil for their factories. But they also are spending huge amounts of money on alternative energy technologies. \\nThe United States is the only other country other than Germany in WWII to occupy 3 different countries with troops in the last 50 years. This country LOVES war more than Jesus. Orac4Prez \\nCan’t disagree. I would like to see something happen to shake some of the politicians and media moguls out of this aggressive mindset. Lazarovic \\nDay one: Hillary wins Day two: You wake up with a hangover, having had a terrible anxiety dream about the Chinese… Orac4Prez \\nI’m not worried about the Chinese in the slightest. But, I’d loved to be a fly on the wall when the news reaches the Oval office! I’m sure her reaction would be priceless. Poor Hillary might head for the bottle though and the rest of the world could end up with a hangover. History tells us how the US reacts t anyone even hundreds of miles from their borders (like the Cuban missile crisis) pulltheweeds \\nOne doozie of a choice coming November 8th. Republicans versus Democrats . Corporate rule or government rule. Does not matter. They are both of the same mind . Have fun when you swing that bar in the voting booth. Hold your loved ones close. We are in for one hell of a ride. df NJ \\nThey are the same in a fascist state: \\n“Fascism should more appropriately be called Corporatism because it is a merger of state and corporate power.” Benito Mussolini Lennie Pike \\nAnd since that is the truth, one can agree and at the same time be Conservative and Christian – especially since the desire to deal only with truth is what defines true Christians and Conservatives. Lennie Pike \\nWhat is truth? That’s for me to know (not inherently), and for you to find out. greanfinisher . \\nIn a scenario like that, I think that we’ll all be dead before any of us ever hear the air raid sirens. df NJ \\nIf a tree falls down in the forest and nobody is around to hear it does it make a noise? The answer is the forest does not exist. If humans are no longer here to experience the Universe, time ceases to exist. greanfinisher . \\nSounds rather cryptic, but yes, time is a human invention. df NJ \\nIt’s not cryptic at all. If no one exists to experience the Universe, the Universe, and time, does not exist. Without subjective experience, objective experience is meaningless. God is just a word, nothing more. God only exists in our use of language. If we cease to exist, God no longer exists. Lazarovic \\nTime is the Creator’s invention. Orange Jean \\nHa… I think the squirrels would argue with you on that point! You don’t think they notice if a tree going down? NARENDRA MODI KING of WORLD \\nNuclear war will NOT happen. I repeat, nuclear war will NOT happen. Just like I said the markets will NOT crash. Why? Because NARENDRA MODI is the savior df NJ \\nWell, I don’t know if Modi can save us. But I do know the last thing the people who have all the power and privilege want is to lose it. War will cause the ruling class to lose their legitimacy and power. The people in power will do anything and everything to keep everything exactly just the way it is now. Before the economy collapses the people in power will double people’s salaries to prevent rioting. Lazarovic \\nThat’s a great idea! What are they waiting for? David \\nI remember Hillary asking during the 2nd debate if Trump can be trusted with his finger on the nuke button. we may never know. Obama has his itchy finger on it right now. df NJ \\n” If you are depressed you are living in the past. If you are anxious you are living in the future. If you are at peace you are living in the present.” \\nLao Tzu Jerry C \\n“If you don’t learn from your past, you’re an idiot. If you do not plan for the future, you’re an idiot. If you are at peace in the present, re-read the first two sentences, because you’re an idiot.” \\nme \\nimpeach obama 2016 df NJ \\nYou do know in order to impeach a president a crime as to have been committed? What crime do you think Obama has committed? Also, please present the evidence for the crime. Because you can’t impeach a president of committing a felony if you do not have any evidence. You can’t do it just because of politics. Gay Veteran \\nLibya, Syria, Yemen, and Obama loves using drones to kill people Thomas D Guastavino \\nWar with Russia the “Wag the Dog” scenario to cover the absolute bombshell wikileaks that are coming out just before the election? df NJ \\nPeople who are voting for Hillary has already decided. People voting for Trump have already decided. Most swing voters are not that tuned into the propaganda sound machine. I doubt anything coming out of wikileaks really matters. If Hillary gets indicted for some crime then it will matter. But subjective judgments about Hillary’s character because of the content of the Emails is pretty much irrelevant. Thomas D Guastavino \\nThen vote for the candidate who will interfere with your life the least. df NJ \\nWhatever that means. Does the president come to your house and bother you? Do you talk to imaginary friends named Jesus? Thomas D Guastavino \\nWas it not Jesus that mentioned something about casting pearls before swine? Seems appropriate here. df NJ \\nAre you calling me a swine? \\nMatthew 7:5 \\nAre you calling me your brother ? Lazarovic \\nI get your point, but, ya, I talk to Jesus…. Bill G Wilminton NC \\nNo But When Hillary Passes TPP You Will Be Bothered And Because It Is Signed With The UN It Is Irrevocable Bill G Wilminton NC \\nPathetic Analysis….. df NJ \\nIt’s easy to play defense. Why not tell us your opinions so we can all have a good laugh. lilbear68 \\nthis is along the same lines as the lie about Benghazi being caused by an anti muslim film sister soldier \\nBenghazi, the “other” elephant in the room. Lazarovic \\nToo Bad The Four Soldiers Abandoned On The Roof Arn’t Able To YAWN !!! Chris Gerber \\nWhat a dumbass he is! Gave wootendw \\nThere are a number of possibilities besides the very real threat of all nuclear war. \\nIt could be that this is just a way of shutting up the warmongers who are pressing Obama to exact revenge on Russia for when Syria retakes Aleppo. Putin and Obama may just be putting on a show. \\nOr perhaps this just another way of rigging the election. If Trump somehow pulls out a win, Obama might say Russia hacked the election, declare the election invalid and go on to serve another six months or so. Or perhaps, Obama wants Russia to make an aggressive move that would make Trump look bad. \\nIt is too simple to say that this is between Sunni and Shia. Saudi Arabia would not be assisting ISIS without the USG approval. The USG has been saying for years that “Assad must go”– something that will be painful to back away from even if a referendum supports Assad after Syria is retaken. Bashar Assad is not a Shia either. He is a secular Alawite married to a Sunni. Most Sunnis in Syria have supported him. \\nOr this could be just another case of imperial hubris. Given that NATO’s population is 6 times Russia’s and its GDP nearly 20 times Russia’s, these guys may just think they have checkmate on Russia, not believing that Russia would dare resort to the unthinkable. Problem is, conventional war might be worse for Russia, once its air defenses are gone and NATO bombers have a free sky from which to carpet-bomb Russian cities. If this is the case, then we should all be asking ourselves where to go to be safe from nukes. Oregon is the best possibility in the US – not many targets and radiation-free winds from the Pacific. Maybe it’s time to pack and go. df NJ \\nWe survived the 70s without nuclear war. We will survive the teens without nuclear war. \\nThe last thing people in power want is to lose their power. If a nuke goes off anywhere in the world the people in power will be disposed by right or left wing reactionary totalitarian regime changes. This is not going to happen. wootendw \\n“We survived the 70s without nuclear war. We will survive the teens without nuclear war.” \\nThe Soviet Union had a credible ‘conventional’ defense – perhaps offense – back then. It does not now, especially when compared to NATO. \\nAs for “This is not going to happen”, such disasters happen when people least expect them. When people expect nuclear war, as in the Cuban missile crisis, they act to prevent it. When everyone believes nothing bad will happen – as in the aftermath of the Bear Stearns collapse – something bad does happen. Lazarovic \\nExactly. Finally, some logical discourse on this site. Bill G Wilminton NC \\nDem or Repub Two Wings Of The Same Bird….Trump Is Really His Own Party As He Has Taken Over The Republican Party. \\nVote Trump The Party Of The “Deplorables” Vote Trump He Will Bring Hillary To Justice !! Vote Trump He Will Bring Jobs Back To USA !! Vote Trump He Will Stop Illegal Immigration !! Vote Trump He Will Enforce Our Borders !! Vote Trump He Will Keep Radical Islamists Out !! Vote Trump ” He Will Build The Wall ” Vote Trump America’s Last Chance !!!! mtntrek3 \\nBill…. I love you and others of our bro’s and sis’s in Christ. While I wish for ones to help us politically…….. seeing it as wishful thinking. My passions for our country are as serious as yours. For example…….. my Dad has a sign outside his house relating Trump to Hitler. My Dad’s brother in particular is all in for Trump. Talk about division. Personally, I wrote in my vote. Christ is the Way. Division is eating us alive in what’s left of our country. Christ first. Take care. Chris. Bill G Wilminton NC \\nIs Your Dad Voting For Hillary…..And All The Babies Duck…. mtntrek3 \\nHow many abortions have occurred in our family? 0 Just saying. I’ve already stated my stance on the subject, Bill. Jerry C \\nYou’d do great on the Titantic. “Even God couldn’t sink her!” ROFLMAO. SpecialK \\nObama and Hillary blaming the Russians could be to provoke them into a confrontation, maybe because they want America to fall and the NWO to rise? Many people have seen visions of Russia and China invading America. Tony Bennett says it will happen after our economy collapses. Everyone really needs to prepare for all scenarios. df NJ \\nIf we let our fears drive what actions we take in our life then we will have a very poor quality of life. I would rather be brave int he face of fears and have a better quality of life. My gut feeling tells me I will be long dead and gone before the economy collapses or we experience the second coming of Jesus. If Jesus were here, he would not be able to win a Republican primary. He’s just way too liberal. SpecialK \\nNo one said anything about letting fear drive our actions. God gave us the Bible, for one reason, to prepare us for what’s to come. So we shouldn’t be afraid when it happens. Also, you can hope you’re dead before all this happens but looking at whats going on in the market, geopolitically, etc, something could happen next week for all we know. Lazarovic \\nJesus still wouldn’t win a Republican primary, he’s way too liberal… df NJ \\nPeople who seek God through the Bible are doing it out of fear and not because of love. Fear is the driving motivation behind the Bible. Nobody has proven eternal damnation exists. It’s all based on imaginary fears. Why would an omnipotent God who needs absolutely nothing from us care if we are sinners or not. It makes absolutely no sense. God needs nothing from us. There is no cosmic scoreboard. God is omnipotent whether we choose to have faith in God or not. \\nIf God truly loves us then he would use his omnipotent powers of forgiveness to allow everything through the gates of heaven to experience eternal bliss. What difference does it make to God? It’s not like it will diminish God’s omnipotent powers to forgive Hitler. God loves Hitler because other than Hitler’s mother, God is all Hitler has! \\nNot accepting God’s omnipotent powers of forgiveness will be given to everyone no matter what indicates you have a lack of faith in an all-powerful all-loving God. What sins you’ve committed or how you practice your religion makes no difference to an all-powerful all-loving God. Are you willing to risk eternal damnation by putting all your faith in an all-power all-forgiving God? Is your faith strong enough? Are you brave enough? Now that’s a real test of faith! \\nIt think a better way to be is to worship a loving God not out of fear but just out of faith. So rather than be afraid I choose to believe God will allow me through the gates of heaven no matter what sins I commit or how I practice my religion during my time on earth. You may think I’m wrong and crazy. But I would rather put my faith in all-loving all-forgiving God as opposed to your dark twisted idea of a hateful vengeful God. Your vengeful angry petty God is based on your twisted ideas of right and wrong. What is a sin and what is not sin is constantly changing. The big ones don’t change much. But there are thousands that are constantly being debated as being right or wrong. \\nThere is only one true God and that God is God. The Bible is not God. Your twisted ideas about Jesus are not God. Or the twisted ideas about Jesus written by men in the Bible are not above God. The disciples are not above God. The disciples are men and nothing more. The disciples are not Gods. You can’t tell me that each disciple did not describe the teachings of Jesus based on their own world view and interpretation of Jesus’s teachings. What is written in the Bible is the ghost of teachings of Jesus as seen through the eyes of each disciple. \\nThere is only one true God and his name is God. My faith is in God above all other words of men that were written in the Bible. \\nIf you are not talking about God then you are NOT talking about God. It’s so obvious yet most of you are so twisted with ideas about God that your ideas about God eventually have nothing to do with God. \\nFor example, talking about Jesus is not talking about God. Jesus was a Jewish rabbi who was talking about God. But when you are talking about Jesus you are not talking about God. \\nIf you want to seek God where do you look? You don’t need to look in the Bible to find God. I don’t need a disciple to tell me where God is or how to look. God is everywhere around us. God is infinite. God does exist outside the Bible. You don’t need a Bible to find God. You just have to have faith in God while you are looking. Bill G Wilminton NC \\nYou Just Flap Flap Flap…..Do You Get Paid By The WORD… df NJ \\nYup You Could Be A Writer For Professor Corey….Just Nonsense !!! GSOB \\nTrump is doing well tonight in this final debate. mtntrek3 \\nMy take on the matter…….. write in a vote. Christ first. Good day/night. df NJ \\nWrite in Christ as your vote? I wonder if Christ would get elected in this country. mtntrek3 \\nNo, Jesus wouldn’t take part directly in our imperfect governance. Bill G Wilminton NC \\nMy Take On The Matter…..You Waste Your Vote…..You Sentence Babies To Die….. mtntrek3 \\nI didn’t vote for Trump or Clinton……that’s for sure. How many abortions have happened in our family? None. mtntrek3 \\nWhat matters…….. Christ in our lives. I’ve read several inputs on this article. The article itself. Our collective frustration with the way things that are…….. are in the spotlight no doubt. Personally, I can’t recommend either of these. Write it in IMHO. To me that’s the way to bring about change for the better. Beyond that….. we don’t want to go there. God first. With love to all. SnodtBlossom \\nare of few days and full of trouble. 2 They spring up like flowers and wither away; like fleeting shadows, they do not endure. 3 Do you fix your eye on them? Will you bring them[a] before you for judgment? 4 Who can bring what is pure from the impure? No one! 5 A person’s days are determined; you have decreed the number of his months and have set limits he cannot exceed. 6 So look away from him and let him alone, till he has put in his time like a hired laborer. 7 “At least there is hope for a tree: If it is cut down, it will sprout again, and its new shoots will not fail. 8 Its roots may grow old in the ground and its stump die in the soil, 9 yet at the scent of water it will bud and put forth shoots like a plant. 10 But a man dies and is laid low; he breathes his last and is no more. 11 As the water of a lake dries up or a riverbed becomes parched and dry, 12 so he lies down and does not rise; till the heavens are no more, people will not awake or be roused from their sleep. 13 “If only you would hide me in the grave and conceal me till your anger has passed! If only you would set me a time and then remember me! 14 If someone dies, will they live again? All the days of my hard service I will wait for my renewal[b] to come. 15 You will call and I will answer you; you will long for the creature your hands have made. 16 Surely then you will count my steps but not keep track of my sin. 17 My offenses will be sealed up in a bag; you will cover over my sin. 18 “But as a mountain erodes and crumbles and as a rock is moved from its place, 19 as water wears away stones and torrents wash away the soil, so you destroy a person’s hope. 20 You overpower them once for all, and they are gone; you change their countenance and send them away. 21 If their children are honored, they do not know it; if their offspring are brought low, they do not see it. 22 They feel but the pain of their own bodies and mourn only for themselves.” Footnotes: mtntrek3 \\nYes…….. however there is hope Sunny. This life is a few days and full of troubles (To quote Job). The eternal picture…….. paradise with Christ as our Savior. Ask Him to forgive us our sins…… He is faithful and just to forgive us our sins and cleanse us from all unrighteousness. Take care. Chris. Bill G Wilminton NC \\nSo Dont Vote Or Right In Some Name….Brilliant Then Abortion Loving ” Rip Their Little Bodies To Shreds ” HILLARY gets elected…..You Answer To God Not Me !!!! mtntrek3 \\nTrump, Clinton no. Let’s get that out of the way up front. One that envies Putin…… ? Seriously? No. Write in a vote. df NJ \\nHis hair turns a deeper shade of Orange every time he lies. mtntrek3 \\nYeah, have to agree with that. Bill G Wilminton NC \\nUse Anti-BS Spray And Goggles…..Your Are Buried….Maybe A Flame Thrower ! \\nTrump Is The Last Chance For Our Country !!! mtntrek3 \\nTrump’s not any kind of savior. Clinton, no again . We’ve got to get away from the same old, the nut jobs and the weasels etc. mtntrek3 \\nI will say this Bill…… you and a few others online and in our local area have gotten me to inspect who I vote for more, along with opening my eyes more to the abortion topic and others. Thank you for that. Chris.   Main Stream Media Has You Buried Under BS……I Wouldnt Care If His Hair Was Pink….Trump Speaks The TRUTH !!!  re Is No Other Choice…..Trump Has Shredded The Elite Controlled Repub Party…..They “The Elites” Never Believed That Trump Could Do It….But He Did… The Elites Never Counted On The Fact That the American People Are Gettin It…..These Are “The Deplorables ” FOR TRUMP…..This Is The Last Chance !!! mtntrek3 \\nThe talk w/o the walk is just that. Trump a grandstanding weasel, just another corporate type that has avoided paying wages/taxes at several turns in his life, is delusional, narcissistic, unstable, ……… . Clinton is questionable in the integrity department, wants to continue certain Obama programs that need either improved greatly or discontinued, headed too far left for me in general. Neither one. mtntrek3 \\nI will add…….. those that think Putin is our friend are mistaken. Seriously? C’mon,please. Lerch \\nAnd I guess that Obongo, Binden, the Hildebeast and the rest of our war monging leadership are the best of friends? What century or planet you live on? Get your head out of the sand. Who nation has the empirical dreams of conquest? Who has the most military bases around the globe? Which country in every major conflict on this globe and the lust and desire for even more? If you say another country other the so-called good old US of A; you’re an idiot. mtntrek3 \\nYou neglected to reflect both sides of the political aisle. Just saying. While things are bad, getting worse….. I’m glad to be here in the U.S. Blame to be spread on both sides of the aisle IMHO. My humble advice is to get or keep your faith in Christ. Good day. Chris.  re Are Not Two Sides Of The Aisle….The Dem And Repub Are Two Wings Same Bird….Trump Has Totally Created A New Repub Party !! mtntrek3 \\nA single party system? The party of Trump……. “of, by and for Trump”. Trump’s way or the highway. Sounds scary to me. In an ideal world…… the dem’s /rep’s check and balance one another. In today’s world in particular……. they’re headed further apart. No cooperation whatsoever. Too far left or right a problem to me. Bill G Wilminton NC \\nTrump Is A Nationalist, Putin Is A Nationalist….Hillary Is A Globalist……Is That Hard To Get ? mtntrek3 \\nNot been on here in awhile. I get carried away with my rant sessions at times. My bad. Anyway…. hey Bill, how’re you? I’m going to be looking into Independents more in the future. Sick of this crap that is politically. I voted for who I thought was the “best” out of the ones I could think of. Maybe you and others say I threw my vote away…… or I actually voted for one or the other of these two clowns by default. I disagree. We need to get away from the status quo however possible. Hard to vote Independent often time as their aren’t many (if any) on the ballot / no space for a write-in. I’m going to try more in that direction in the future however. Also, I’m going to be contacting the elected officials more often as well. And, abortion……. I’ve already stated my views on the matter. Take care Bill. mtntrek3 \\nMy heart goes out to our people and Russia’s. We’re being led by ones in control of each. Which is worse?…. . I’d like to think which ones are worse. ………….. I have to say, I want to stay here in America that we’ve fought and died for. I’m sad for the state we’re in. Troubled indeed. We have to be on our guard for further declines as a nation. Improvements?….. with these two as a choice, not seeing it. Think about it. df NJ \\nI stopped thinking after George W Bush got elected…chosen to be president in 2000. mtntrek3 \\nRigged? I wonder. Trump cries that out now of course. He states several of these things that I personally have questioned for some years. He has tapped into the concerns of many of us in America. Now….. if only he was sane/credible and had some sort of viable plan. He’s been a part of the problem in our corporates. Now he says he’s not. To me, he’s a rabble-rouser with alternate objectives. df NJ \\n2000 was an historic election: \\n“THE COURT STEPS IN The Supreme Court actually interposed itself into the election contest three times. Only the last two are known as Bush v. Gore. In the first of these cases, Bush v. Palm Beach County Canvassing Board, the Court hoped to end the election crisis by putting a stop to the Florida Supreme Court’s decision to extend the time for certifying the vote past the period set by state law. But by the time the Court began hearing arguments in the appeal on December 1, the certification had already occurred. The embarrassed justices sent the case back down to the Florida Supreme Court, instructing the lower court to rewrite its opinion so that it would not create a conflict between state and federal law. \\nA week later, the Florida Supreme Court ordered a statewide recount of ballots. Unlike its earlier decision, however, this one was not unanimous. With the Florida justices split 4-3, the U.S. Supreme Court once again exercised its discretionary appellate review jurisdiction and granted certiorari, or review, to Bush v. Gore. The day after the Florida Supreme Court had ordered a recount, the U.S. Supreme Court granted a temporary stay, or delay, in enforcing the Florida Supreme Court’s order. The U.S. Supreme Court justices, too, were narrowly divided, 5-4. The five justices voting in favor of the stay were the same five conservatives who had been moving the Rehnquist Court to the right for more than a decade. The first hearing of Bush v. Gore telegraphed to the nation what would happen if the Court took further action in the case. \\nThe Court’s third and final intervention in the 2000 presidential election came just days later. In its unsigned opinion, the Court explained that it had voted 5-4 to put a stop to the Florida recount. Allowing the recount to go forward, the Court said, would violate the Equal Protection Clause of the Fourteenth Amendment. The U.S. Supreme Court sent the case back down to the Florida Supreme Court, which had no alternative but to dismiss it. The presidential election of 2000 had been decided, in essence, by the vote of one Supreme Court justice. “ mtntrek3 \\nYep, I remember that election…… counting and recounting, hanging chads, confusing ballots, etc. Some say that this election will be a landslide one way or the other. I’m not sure about that. To me it’ll probably be close. Whether it’s by a few hundred votes again or not, time will tell. Bill G Wilminton NC \\nGood Leaders Like Churchill, Gen Patton and Gen MacArthur Are Hard To Find. They Say What Has To Be Said and Dont Give A “F” What Anyone Thinks….. \\nTrump Is From That Mold…..He Has A Plan You Just Arn’t Listening To His Speeches….Borders, Trade, Constitution, Jobs, Factories, Illegals, Muslims, 1 st, 2 nd, 9 th Amendments etc etc etc etc etc etc etc …..What Does Trump Have To Do Drive To Your House And Sit At Your Kitchen Table for You To Get It….. mtntrek3 \\nI’m not hearing much if anything new except for tariffs. That would help? Maybe. To me it would just raise the prices on several things. Tax breaks for the corporations? Well…. another maybe. Seems as though it really doesn’t translate to that many more jobs. Guess the corp’s suck up the savings at the top w/o creating all that many new jobs. The border wall he touts is fantasy land fodder, as is renegotiating all trade deals. He’ll just wave his magic wand and do these things I suppose. It’d take probably 10-15 years to build a wall , not accounting for snafus along the way (illegals have been tunneling underground more all the time anyway)…… and I guess other world leaders will cave in to his wishes in trade deals just because “The Donald” is across the table from them. I’ve been hearing what he says…. in between all his extracurricular blah, blah, blah and his twitter escapades. When something sounds too good to be true……. . The guys is nuts basically. And…… no thanks, I don’t want him at my place. For that matter, Clinton either. I’ve heard enough of both of them the past several weeks. Trump/Clinton neither one as I see it. Neither one are my savior either. Take care again Bill. God Bless. Deplorable Twister Jones \\nThanks Bill, yours is one of the most succinct to the point posts for President Trump I’ve seen in weeks! You’re right, what the hell do these people hear? They don’t miss a lick when some dumbass spits out the lies about racism or hating women or illegals! They will soon learn to listen…soon enough!! Bill G Wilminton NC \\nTrump says what has to be said ” I Am Not Politically Correct, Never Was Politically Corect And Never Will Be Politically Correct ”……. \\nNo One Has To LEARN To Listen Or March In Goose Step….Nor Speak German!!! df NJ \\nWe’re all going to die….of old age. mtntrek3 \\nPolitics ……. s–t overall. To promote one side or the other is amounting to our demise. Hey…… I side somewhat left of center politically, but I see possible answers somewhere in the middle. Too far left or right is …….. not good. We’re all Americans, let’s meet somewhere towards the middle. If only…… . I think ideally that the left and right politically can check and balance themselves out. Nowadays……… not so much. Too far left and right. We can’t reach across the aisle due to the chasm that is. I go to the Bible for my indication of where we’re at….. and it’s getting late. Radical left/right….. umm, no thanks. Christ, He’s our Hope. df NJ \\nThere are two sides of the political spectrum. One side wants change. One side wants to keep things exactly the way they are. The side that wants to keep things exactly the way they are always wins. Bill G Wilminton NC \\nDid You Used To Be A Writer For Professor Irwin Corey…..He Was The “Professor Of Double Talk” df NJ \\nPower wants to preserve power. It’s not double talk. ALWAYSTOMORROW \\nCOUNTDOWN. Today, October 20, 2016. In 19 days I predict Mrs. Clinton will be elected our next president. df NJ \\nBill Clinton, first husband. LOL! \\nIf the Republicans want to win the White House in 2020 they have to run a gay guy. Bill G Wilminton NC \\nIf So, Goodbye USA……And Satan Will Applaud For This Abortion Loving, Perversion Loving, Drug Loving, God Hating Septic Tank We Are Stuck In…..Til Jesus Comes For His Bride !!! Salley Mae \\nWhy does the US fight ISIS and Al Qaeda in Syria by bombing Assad and arming ISIS (per the Wikileaks emails)? Meanwhile the Russians fight Al Qaeda and ISIS by bombing Al Qaeda and ISIS – all at the invitation of the Syrian government. I would like to know the REAL reason we have invaded that country and what is behind it. df NJ \\nOur ME foreign policy is determined by the Council of Foreign Relations. The centerpiece to our foreign policy is the balkanization of the Middle East and the Arab World using groups like ISIS. ISIS is a CIA black ops organization. The goal is not to have any strong states or regional powers remaining. This is accomplished by bombing certain Arab countries back to the stone age. ISIS is needed to have a legal and moral justification for excessively bombing of the ragheads. The result will be no credible threats to the USA’s most important interest in the ME. Jerry C \\nGlobalist centralized bank. They installed one here in the U.S. in 1913. A few years ago, Iraq & Libya didn’t have one but now they do (sorry Saddam & Qaddafi). Syria doesn’t have one, so that explains why they’re after Assad. The few remaining countries left without a centralized bank is China, Russia, North Korea, Iran & Syria. After Syria, the plan is to go after Iran.'"}, "time": 1742561888.380079}