{"duration": 0.08092260360717773, "input_args": {"text": "'Pop icon Cher says that old,    Democrats and their flawed messaging is the reason why Donald Trump won the election. [In an extensive interview with Billboard published Friday, the    singer said the old Democratic party leaders   failed to connect with younger voters.  “The Democrats f*cked up so bad in their message, and how old [the leadership] is,” Cher said. “You’ve got to pray that old people die before young people can get involved with the party. ” Cher, who helped raise funds for Democratic candidate Hillary Clinton’s campaign, said she “told Hillary she should have a group of millennials give their ideas about government. ” In January, the singer participated in the     Women’s March on Washington. Four months into his presidency, the “Believe” singer says she’s so incensed by Trump that she has to hide her phone from herself. “Since Trump was elected, I have to hide my telephone, because I’m so outraged. Twitter is like a drug,” Cher says of the platform she uses to skewer Trump. “It creeps into your life, and you have to say, ‘Time to put a stop to this. I’m a  . ’” Earlier this month, Cher compared Trump to a “mad King George III president,” called Republican House members “inhumane,” and predicted millions of people would die as a result of the   American Health Care Act. Though it has not yet been voted on in the Senate, the pop star still believes Trump’s health care bill will cause people to die. “The president is cheating and getting away with it, and using the White House to make money, and he’s going to take health care away from people, and people are going die. It’s outrageous,” she said. “You feel like you’re screaming ‘Fire!’ and no one’s listening. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563355.2371573}