{"duration": 0.1427600383758545, "input_args": {"text": "'Gender studies is a fake academic industry populated by charlatans, deranged activists and gullible idiots. [Now, a pair of enterprising hoaxers has proved it scientifically by persuading an academic journal to   and publish their paper claiming that the penis is not really a male genital organ but a social construct.  The paper, published by Cogent Social Sciences  —   “a multidisciplinary open access journal offering high quality peer review across the social sciences”  —   also claims that penises are responsible for causing climate change. The two hoaxers are Peter Boghossian, a   faculty member in the Philosophy department at Portland State University, and James Lindsay, who has a doctorate in math and a background in physics. They were hoping to emulate probably the most famous academic hoax in recent years: the Sokal Hoax  —   named after NYU and UCL physics professor Alan Sokal  —   who in 1996 persuaded an academic journal called Social Text to accept a paper titled “Transgressing the Boundaries: Towards a Transformative Hermeneutics of Quantum Gravity”. Sokal’s paper  —   comprising pages of   but meaningless   jargon  —   was written in part to demonstrate that humanities journals will publish pretty much anything so long as it sounds like “proper leftist thought” and partly in order to send up the absurdity of so much   social science. So, for this new spoof, Boghossian and Lindsay were careful to throw in lots of signifier phrases to indicate fashionable   bias: We intended to test the hypothesis that flattery of the academic Left’s moral architecture in general, and of the moral orthodoxy in gender studies in particular, is the overwhelming determiner of publication in an academic journal in the field. That is, we sought to demonstrate that a desire for a certain moral view of the world to be validated could overcome the critical assessment required for legitimate scholarship. Particularly, we suspected that gender studies is crippled academically by an overriding   belief that maleness is the root of all evil. On the evidence, our suspicion was justified. They also took care to make it completely incomprehensible. We didn’t try to make the paper coherent instead, we stuffed it full of jargon (like “discursive” and “isomorphism”) nonsense (like arguing that hypermasculine men are both inside and outside of certain discourses at the same time)   phrases (like “   society”) lewd references to slang terms for the penis, insulting phrasing regarding men (including referring to some men who choose not to have children as being “unable to coerce a mate”) and allusions to rape (we stated that “manspreading,” a complaint levied against men for sitting with their legs spread wide, is “akin to raping the empty space around him”). After completing the paper, we read it carefully to ensure it didn’t say anything meaningful, and as neither one of us could determine what it is actually about, we deemed it a success. Some of it was written with the help of the Postmodern Generator  —   “a website coded in the 1990s by Andrew Bulhak featuring an algorithm, based on NYU physicist Alan Sokal’s method of hoaxing a cultural studies journal called Social Text, that returns a different fake postmodern ‘paper’ every time the page is reloaded. ” This paragraph, for example, looks impressive but is literally meaningless: Inasmuch as masculinity is essentially performative, so too is the conceptual penis. The penis, in the words of Judith Butler, “can only be understood through reference to what is barred from the signifier within the domain of corporeal legibility” (Butler, 1993). The penis should not be understood as an honest expression of the performer’s intent should it be presented in a performance of masculinity or hypermasculinity. Thus, the isomorphism between the conceptual penis and what’s referred to throughout discursive feminist literature as “toxic hypermasculinity,” is one defined upon a vector of male cultural machismo braggadocio, with the conceptual penis playing the roles of subject, object, and verb of action. The result of this trichotomy of roles is to place hypermasculine men both within and outside of competing discourses whose dynamics, as seen via   discourse analysis, enact a systematic interplay of power in which hypermasculine men use the conceptual penis to move themselves from powerless subject positions to powerful ones (confer: Foucault, 1972). None of it should have survived more than a moment’s scrutiny by serious academics. But it was   by two experts in the field who, after suggesting only a few changes, passed it for publication: Cogent Social Sciences eventually accepted “The Conceptual Penis as a Social Construct. ” The reviewers were amazingly encouraging, giving us very high marks in nearly every category. For example, one reviewer graded our thesis statement “sound” and praised it thusly, “It capturs [sic] the issue of hypermasculinity through a   and nonlinear process” (which we take to mean that it wanders aimlessly through many layers of jargon and nonsense). The other reviewer marked the thesis, along with the entire paper, “outstanding” in every applicable category. They didn’t accept the paper outright, however. Cogent Social Sciences’ Reviewer #2 offered us a few relatively easy fixes to make our paper “better. ” We effortlessly completed them in about two hours, putting in a little more nonsense about “manspreading” (which we alleged to be a cause of climate change) and “  contests. ” No claim made in the paper was considered too ludicrous by the  : not even the one claiming that the penis is “the universal performative source of rape, and is the conceptual driver behind much of climate change. ” You read that right. We argued that climate change is “conceptually” caused by penises. How do we defend that assertion? Like this: Destructive, unsustainable hegemonically male approaches to pressing environmental policy and action are the predictable results of a raping of nature by a   mindset. This mindset is best captured by recognizing the role of [sic] the conceptual penis holds over masculine psychology. When it is applied to our natural environment, especially virgin environments that can be cheaply despoiled for their material resources and left dilapidated and diminished when our patriarchal approaches to economic gain have stolen their inherent worth, the extrapolation of the rape culture inherent in the conceptual penis becomes clear. The fact that such complete drivel was published in a social science journal, the hoaxers argue, raises serious questions about the value of fields like gender studies and the state of academic publishing generally: “The Conceptual Penis as a Social Construct” should not have been published on its merits because it was actively written to avoid having any merits whatsoever. The paper is academically worthless nonsense. But they do not hold out much hope for it having any more effect on the bullshit in the social sciences industry than Sokal’s hoax did  —   because leftist stupidity in academe is so heavily entrenched. As a matter of deeper concern, there is unfortunately some reason to believe that our hoax will not break the relevant spell. First, Alan Sokal’s hoax, now more than 20 years old, did not prevent the continuation of bizarre postmodernist “scholarship. ” In particular, it did not lead to a general tightening of standards that would have blocked our own hoax. Second, people rarely give up on their moral attachments and ideological commitments just because they’re shown to be out of alignment with reality.'"}, "time": 1742563265.1034694}