{"duration": 0.13491368293762207, "input_args": {"text": "'BRUSSELS  —   European Union officials announced plans for a big increase in military spending on Wednesday, pledging to take greater responsibility for their security at a time when the United States appears to be taking a step back in its role in the world. The bloc’s top officials proposed spending 5. 5 billion euros, or $5. 8 billion, a year to help governments acquire hardware, including helicopters and drones, and to develop military technology. Wary of concerns about consolidation of power in Brussels as member governments are under pressure from populist forces, officials stressed that the plan was in no way a step toward creating a European Union army. Member countries would own the hardware that was purchased, and much of the money would go to European companies. But the proposal, known as the European Defense Action Plan, follows calls by Donald J. Trump, the United States   for members of NATO to devote 2 percent of their gross domestic product to military spending. (Of the 28 nations in the European Union, 22 are also part of NATO.) “If Europe does not take care of its own security, nobody else will do it for us,” said   Juncker, the president of the European Commission, the executive arm of the European Union. “A strong, competitive and innovative defense industrial base is what will give us strategic autonomy. ” Total military spending by European Union governments was about €200 billion last year, but the union does not currently have a budget for military research or procurement. The plan foresees a pilot phase of €90 million, or $95 million, up to 2020  —   and €500 million, or $528 million, a year after that  —   for research into technologies like drones and for cybersecurity tools. A second plank of the plan foresees spending 10 times that amount to help governments develop and buy hardware. But rather than drawing on the shared European Union budget, member states would make individual contributions, and some of the money might come from   bonds. Obama administration officials welcomed the increased spending. “It is no secret that we’ve been asking them to do this for years,” said one senior administration official, speaking on the condition of anonymity to discuss alliance relations. But the official also said it was imperative that Mr. Trump reassured allies that his administration’s commitment to collective defense of NATO allies would be solid. During his presidential campaign, Mr. Trump questioned whether the United States would automatically defend NATO allies if they were attacked, and said American support would depend on the willingness of those countries to pay their fair share for military protection. But since then, a number of Republican lawmakers and foreign policy experts  —   including those in close contact with Mr. Trump since he won the election  —   have insisted that the American commitment to NATO will remain strong. European Union leaders will discuss the proposal at a summit meeting in December. The member governments still must approve it, and that could be a lengthy process given concerns about sovereignty. Politicians in countries like Lithuania and Poland, for example, might question whether the additional spending might be better devoted to bolstering NATO as a resurgent Russia is raising alarms in much of Central and Eastern Europe. Britain could be an obstacle, too. It has long stood in the way of deeper European military cooperation, which London fears could undermine NATO. British voters decided in a June referendum to leave the European Union, but the lengthy process of exiting the bloc has not yet legally begun. European officials “know that it will not be easy” to carry out the plans, Elzbieta Bienkowska, the European Union commissioner for the internal market and industry, said on Wednesday. Federica Mogherini, the union’s foreign policy chief, said the plans did not amount to competition with NATO. Agreeing to the spending could help European countries get over a “Trump hump” created by the  ’s demands, said Nick Witney, a senior policy fellow at the European Council on Foreign Relations. “This spending is very   and even money from the European budget is a fair basis for a country to claim it’s chipping more into defense,” said Mr. Witney, a former chief executive of the European Defense Agency, a forum for European Union member states to cooperate on defense initiatives. “On the other hand, the commitment to spending 2 percent on defense is meant to be about the long haul, and about genuinely readjusting national budget priorities, and I don’t see this plan as moving European NATO members much closer to that goal,” he said, adding that much of the plan was based on debt financing. Jyrki Katainen, a vice president of the European Commission, said the timing of the plan had “nothing to do with American elections” since it had been in the works since 2014. A longstanding goal was to avoid duplication of effort in military procurement, which is mostly done on a national basis, and to improve the compatibility of the various military hardware that European countries acquire, he said. One example of inefficiency in European defense was the development of the Airbus A400M military aircraft, European officials said. If the proposed plan is adopted, problems that include defining where to place doors for paratroopers  —   which had contributed to the development of the aircraft taking about a decade longer than necessary  —   could be more easily resolved, they said. The officials said more military spending could have a positive effect on the sluggish European economy. “Boosting defense RD in Europe is crucial to maintain critical competences and technologies! Thumbs up,” Dirk Hoke, the chief executive for Airbus Defense and Space, wrote on  Twitter.'"}, "time": 1742562229.5724921}