{"duration": 0.06518292427062988, "input_args": {"text": "'opednews.com - Advertisement - \\nIn the last two articles of this series we described the makeup of voters and considered the likely outcomes under a variety of different voting systems. Here we will repeat that thought-experiment but consider a different makeup of the voter attitudes. \\nIn the chart below, the results for the various voting systems are shown for both systems, serving both as a review and as a preview. But more importantly, the chart illustrates the difference between traditional voting systems and balanced ones. It is worth noting that in the traditional column, only Celeb (celebrity) candidates are competitive whereas in the balanced column the non-celebrity (Ghost) candidate is consistently at least competitive. Who Has a Chance of Winning(image by Paul Cohen) License DMCA \\nClearly, by these results, the balanced systems tend to be open to more candidates, and sometimes different candidates, than traditional systems. The difference stems from the fact that balanced voting systems consciously take into account both support and opposition of candidates -- whereas traditional systems only consider support. \\nThis election is between three candidates, two of whom are celebrities, well known by nearly all voters. Al Celeb has strong support from 35% of voters but is strongly disliked by 60%. Beth Celeb is strongly supported by 33% of the voters but very much disliked by 52%. The other candidate, Ghost, draws his support from the 12% of voters, who disapprove both of the Celeb candidates. Ghost is well regarded by the relatively small number of voters who know much about him. \\nYou might now take some time to think about which of the four candidates deserve to win the election. \\nIf the election were held using plurality voting, it is pretty clear that Al Celeb would be the winner with 35% of the vote. The fact that both Celeb candidates have more opposition than support does not matter because opposition is not a factor in traditional voting systems like plurality voting. \\nOn the other hand, if the election were held using balanced plurality voting , then presumably 35% of the voters would vote for Al Celeb and 33% would vote for Beth Celeb. But each of the Celeb candidates will face opposition votes as well. Al Celeb might have as much as 60% of voters casting votes against him, or as few as 48% against him if all 12% of voters who favor Al Ghost choose to vote for Ghost. So Al Celeb will have a net vote of somewhere between -13% and -35% of the voters. By the same reasoning, Beth Celeb will receive a net vote between -7% and -19% of the vote. Ghost, with between 0% and 12% of the vote will win the election. When opposition to them is taken into account, celebrity candidates lose their great advantage. - Advertisement - \\nWith approval voting , Al Celeb and Beth Celeb will respectively get 35% and 33% of the vote while Ghost will get only 12%. As with plurality voting, Al Celeb will be declared the winner. \\nWith balanced approval voting , (where the voter is asked to indicate approval or disapproval -- or neither - for each of the candidates), Al Celeb and Beth Celeb will respectively get -25% and -19% of the vote while Ghost will get 12% so Ghost will be declared the winner. \\nIn this election there are few enough candidates that one might question the motivation for using ration voting , but for the sake of providing an example we can consider it nonetheless. Each voter would be handed three plurality ballots (it could be more or less than that, but three seems reasonable with just three candidates). It seems likely that a Ghost voter would cast all three ballots for Ghost, giving Ghost 12% of the vote. But Al Celeb and Beth Celeb would respectively receive 35% and 33% of the vote. Al Celeb would be declared the winner. However, if sentiment among Ghost voters favored Beth Celeb over Al Celeb then some might cast some of their ballots for Beth Celeb and this could turn Beth Celeb into the winner. \\nIf this election were held using balanced ration voting, each voter would be handed three balanced plurality ballots. Any outcome is possible for this election, the voters have free reign to decide. This may not immediately obvious to you -- it was not to me. I had to set up a spread-sheet to try out scenarios to see this to be the case. \\nIt is the Ghost voters who will make the selection between the two Celeb candidates and that will be by deciding how many of their 12% of ballots will go to Celeb candidates. If 2% more of those 12% are cast against Al Celeb than are cast against Beth then the race between the Celeb candidates is a tie. Of course if more than 2% go against Al Celeb then he will lose and the contest will be between Ghost and Beth Celeb. If that margin is less than 2% then the contest will be between Ghost and Al Celeb. - Advertisement - \\nAlso as might be expected, whether Ghost can win will depend on how many of the Celeb voters decide to vote against the candidate they dislike (rather than for the Celeb candidate they like). If 23% of voters (Celeb voters) decide to cast votes against the Celeb candidate they dislike then the race becomes a toss-up. \\nIt is worth mentioning that voters will likely make these decisions according to their real feelings. They will cast votes against a candidate they dislike and they will vote for candidates they like. With balanced voting methods, voters can freely express dislike for particular candidates and that means they are not forced to resort to strategic methods to express this very real and very natural belief. \\nWith IRV , Celeb voters are likely to put the candidate they favor in first place on their ballots. Ghost will garner at most 12% of the vote, so Ghost will be eliminated in the first round of counting. Now the Ghost voters may all decide to not even list a second choice since that would mean voting for a candidate they dislike. The choice between the two Celeb candidates lies in the hands of these Ghost voters who do not like either of them. If just a little more than 2% more voters (necessarily these would be Ghost voters) list Beth Celeb as a second choice than those who list Al Celeb as second choice then that would give the election to Beth Celeb rather than to Al Celeb. Under IRV, the Ghost supporters would be well advised to give some serious consideration to whom they consider the lesser of the two evils. As with other traditional systems, with IRV a little-known candidate does not stand a ghost of a chance and the only real choice is apt to be between two celebrities. \\nWith IRBV , voters have more freedom of expression. Might any voters decide to cast their first priority against some candidate? Since there will be only two counts of the votes, some Celeb voters may well choose to cast their first-ranked choice as a vote against the Celeb they dislike. Presumably they would do that if they preferred Ghost to win rather than letting the wrong Celeb candidate winning. If enough voters choose to vote against one or the other of the Celeb candidates then Ghost actually could survive to the second round of voting and if a preference for Ghost by the voters whose Celeb candidate lost in the first round then it is quite possible for Ghost to become the winner. Under IRBV, this race is wide open with any of the three candidates having a chance to win.'"}, "time": 1742628592.77867}