{"duration": 0.04667830467224121, "input_args": {"text": "'Home / Be The Change / Elijah Wood Just Exposed Hollywood’s Organized Pedophilia Ring Elijah Wood Just Exposed Hollywood’s Organized Pedophilia Ring “The Number one problem in Hollywood was and always will be pedophilia.” -Corey Feldman, During interview with ABC News \\nUp until now, Corey Feldman’s attempt to blow the whistle on pedophilia and child abuse in Hollywood, have fallen on deaf ears. The actor’s troubled past made him easily dismissable in the mainstream, and his bombshell accusations were simply swept under the rug. \\nHowever, Feldman’s claims have now been backed up by another Hollywood child star. \\nHollywood is in the midst of a massive sexual abuse scandal, which can be compared to that of Jimmy Savile in Britain, childhood star turned adult actor Elijah Wood has claimed. \\nComing onto the silver screen for the first time in Back to the Future Part II in 1989, Wood has been a critically acclaimed actor for decades. \\nAt age 35, Elijah has now come forward in a recent interview to blow the lid off of the dark underground world of child acting in Hollywood. \\nIn an interview with the Sunday Times , Wood dropped a bombshell, noting how child actors were regularly “preyed upon” by industry figures. \\n“Clearly something major was going on in Hollywood,” said Wood. “It was all organized.” \\nWhat Wood is talking about is the rampant sexual abuse of childhood actors which has been previously exposed by Corey Feldman as well as Corey Haim. \\nIn an episode of their reality TV show, The Two Coreys, a candid fight broke out during which Haim claimed Feldman stood by and watched as a person Feldman “still hangs out with” and is “best friends with” proceeded to “rape” the 14-year-old Haim. \\n“There are a lot of vipers in this industry, people who only have their own interests in mind,” continued Elijah Wood in his interview. “There is a darkness in the underbelly – if you can imagine it, it’s probably happened.” \\nWhen noting how he was able to escape the molestation during his childhood in Hollywood, Elijah noted that he had good parents who protected him and who did not let him attend these parties. \\n“She was far more concerned with raising me to be a good human than facilitating my career,” he said. \\nWood says the abuse runs unchecked because the victims “can’t speak as loudly as people in power.” \\n“That’s the tragedy of attempting to reveal what is happening to innocent people,” he said. “They can be squashed but their lives have been irreparably damaged.” \\nWhat Wood is referring to is the immense power of Hollywood elites to control the narrative and quash any allegations of abuse before they even happen. \\nThe same owners of Hollywood also own the majority of other mainstream media. While none of them are specifically implicated, a handful of people, News Corp. President Peter Chernin, Paramount Pictures Chairman Brad Grey, Walt Disney Co. Chief Executive Robert Iger, Sony Pictures Chairman Michael Lynton, Warner Bros. Chairman Kevin Tsujihara, CBS Corp. Chief Executive Leslie Moonves whose great uncle was the first prime minister of Israel, MGM Chairman Terrence Lanni, and former NBC Universal Chief Executive Jeff Zucker, who is currently the president of CNN Worldwide, all run the movie industry as well as the television and news scenes. \\nWith the massive resources of the mainstream media, covering up the allegations of rape of dozens of children would be a simple task. \\n“If you’re innocent you have very little knowledge of the world and you want to succeed,” explained Elijah of the poor children and their parents who become easy prey as they seek out their dreams of becoming Hollywood stars. \\nAnother sad facet to this underground world of child predation is the fact that police not only look the other way, but they’ve often been exposed for participating in it. \\nLast year, an abuse survivor bravely broke her silence to tell her horrific childhood story. In an interview with Sky News, Esther Baker, 32, explained how she and other children were raped by the elite and politicians as uniformed police officers stood guard. \\nAlso last year, Jessa Dillow-Crisp testified at the Colorado State Capitol, during Human Trafficking Awareness and Advocacy Day, about the horrible experiences that she had in her past. \\n“I was a little girl and was sexually abused by family members. I had to pose for pornographers and was sold to countless men on a daily basis,” she said. \\nTo make matters even more hopeless for the woman, she was unable to report the abuse or go to the police because there were a number of police officers who were actually involved in the kidnapping and abuse. \\n“There was gang raping, the police officer who handcuffed me and raped me, told me I would be put in jail if I opened my voice,” she said. \\nSadly, positions of power, whether state-backed or not often attract society’s worst. Knowing they are above the law, these sickos are allowed to target innocence for their own disgusting desires. \\nIn his interview, Elijah Wood summed up this notion perfectly when he said, “People with parasitic interests will see you as their prey.” And, unfortunately, they continue to get away with it. Share'"}, "time": 1742628582.5303137}