{"duration": 0.01607513427734375, "input_args": {"text": "'Tuesday 8 November 2016 by Lucas Wilde Jeremy Vine already tripping his tits off \\nVeteran election reporter Jeremy Vine has embarked on his usual pre-election broadcast ritual by taking a load of drugs and hallucinating maps of the USA, pie-charts and various other election-themed visages. \\nThe least-funny of the Vine brothers usually waits until the polls close before cracking open his thermos flask full of hallucinogens, but has decided to get on it early this year. \\n“I can’t say I blame him” said Lucy Millwall, Head of CGI for BBC News. \\n“This election has been impressive only for sheer scale of mind-numbing awfulness. \\n“Honestly, you try pretending to give a shit about what Gary Johnson is up to without yawning. \\n“It’s actually intriguing watching him dance around an empty green room, imagining he’s kicking a football marked “Florida” between Trump and Clinton. \\n“We just computer-generate images around whatever he’s imagining. Technically we are ‘enabling’ him but fuck it; it’s really good telly. \\n“We’re always careful to cut away from him before he starts talking to Peter, the ‘Rapiest Giraffe of Them All’.” Jeremy Vine election coverage \\nJeremy Vine has been taking LSD ever since John Major’s first election victory; the campaign proving so overwhelmingly dull that recreational drug use became BBC protocol for several weeks. \\nVine is thought to be the only one to keep this up, apart from the Chuckle Brothers, who owe their youthful energy to a vigorous cocaine regimen. \\nAfter ballot day, it is thought that Vine will commence the mother of all comedowns, which should wear off just before his next pre-election bender for a Brexit-inspired snap election sometime next month. Get the best NewsThump stories in your mailbox every Friday, for FREE! There are currently '"}, "time": 1742628460.3046587}