{"duration": 0.13053369522094727, "input_args": {"text": "'GULFThe Making of an American SeaBy Jack E. DavisIllustrated. 592 pages. Liveright. $29. 95. SUNSHINE STATEEssaysBy Sarah Gerard359 pages. Harper Perennial. $15. 99. Florida is a place and a state of mind. As the former, it’s lovely but afflicted, like Fay Wray in the hands of King Kong (developers). As the latter, it leaves much to be desired. I went to high school in southwest Florida. The malcontents pronounced it  . Florida is a supposedly fun place that has a lot of sadness clinging to it, like barnacles to a boat’s hull. The novelist Cynthia Ozick is not someone I can imagine enjoying blender margaritas down at the beach bar, with sand in her toes. Yet Ozick was not far off, in her short story “Rosa,” when she wrote: “The whole peninsula of Florida was weighted down with regret. Everyone had left behind a real life. ” One of the themes of “Sunshine State,” Sarah Gerard’s striking book of essays, is how Florida can unmoor you and make you reach for shoddy,    solutions to your psychic unease. Gerard grew up in Clearwater, a beach city near Tampa. She writes about how her otherwise incredulous parents (they met in a biker bar he was wearing a   Jimmy Buffett  ) fell into New Thought, a   movement. Almost as bad, they signed on with Amway. That company,   by the    of Betsy DeVos, the secretary of education, can, many have argued, resemble a pyramid scheme. Gerard decides that dabbling with Amway was, in her perfect phrase, a form of “achievement tourism. ” She writes, “We left reality for a moment and believed the impossible was possible. ” Gerard’s essay collection is one of two new books that examine the Florida experiment. The other is Jack E. Davis’s “Gulf: The Making of an American Sea,” a sensitive and sturdy work of environmental history. Obviously, the Gulf of Mexico does not belong solely to Florida. It is the   body of water in the world. It touches several other countries  —   indeed, it is named for one of them  —   as well as other American states. But Davis lives in Florida, and that state’s wet western edges run along a vast amount of the Gulf’ like salt on the rim of a cocktail. He can’t help but dwell often upon his home place. Thanks to books by John Jeremiah Sullivan (“Pulphead”) and Leslie Jamison (“The Empathy Exams”) and a handful of other young writers, the essay collection has new impetus and drama in American letters. The essay has gained ground on the short story. “Sunshine State” deserves to be talked about in this company, even if its essays are   . When Gerard is on, she is really on. She’s the author of one previous book, the novel “Binary Star” (2015). The first essay is a knockout, a lurid red heart wrapped in barbed wire. It’s called “BFF,” and it’s about the author’s intense friendship with a girl who grew up to become a stripper and who spent time in shelters for battered women. This essay is about attraction and betrayal, and has the sinister propulsion of a Mary Gaitskill short story. “You shinier,” Gerard writes about her friend. “You prettier. You taller. You thinner, more popular. In middle school, you had friends and I had you. ” They’d had tattoos on their hips that read, when they stood side by side, “Forever    ever. ” Their eventual split was devastating. The author had the means to get out of town the friend did not. Gerard catalogs the lies her friend told her, then she lists her own. She writes about her damage, splitting her face open while jumping from a train. This essay draws blood. Many of the essays in “Sunshine State” fall somewhere between memoir and journalism. Two of the longer pieces, about work to care for the homeless in Florida and about a troubled bird sanctuary, are serious and impeccably reported. But the author’s voice is lost in the telling. She’s best when her evocations of the frenzy that is Florida are personal. Historians, inspired by Fernand Braudel’s epic 1949   study of the Mediterranean Sea (1949) have written books about most of the world’s important bodies of water. Davis’s “Gulf” is the first comprehensive history of the Gulf of Mexico, a place that tends to be, he persuasively argues, “excluded from the central narrative of the American experience. ” Texas and Louisiana also have a great deal of   real estate, and Davis’s book does not skimp on their histories. But since Gerard, Davis and I each grew up staring at the same   water off Florida, I will stick with Florida in this review. Davis carefully relates its history, from the state’s native people and its earliest European explorers, through the early history of the United States and the arrival of tourists, developers and those who would fish and hunt Florida to depletion. The author has a   mind, and frequently views the history of the Gulf through the prism of artists and writers including Winslow Homer, Wallace Stevens, Ernest Hemingway and John D. MacDonald. His prose is supple and clear. About the arrival of motorized shrimp boats on the Gulf, he writes: “They pushed farther out into the Gulf, the classical music of a   sea passage drowned forever by the heavy metal of internal combustion and snorting exhaust. Fishers discovered that if they worked past sunset, their trawls were filling with a new kind of shrimp, browns, which rose near the surface at night. ” Davis’s book functions, as well, as a cri de coeur about the Gulf’s environmental ruin. His book runs up through the 2010 Deepwater Horizon oil spill. That event aside, he writes, “Every day in the Gulf is an environmental disaster, originating from sources near and far, that eclipses the spill. ” “Goodbye North, Hello South,” Bessie Smith sang in “Florida Bound Blues. ” “It’s so cold up here that the words freeze in your mouth. ” The words in Gerard’s and Davis’s books are   and, in their way, optimistic. Both writers make the effort, essential to any form of love, to see their state plain.'"}, "time": 1742564138.4196212}