{"duration": 0.10962772369384766, "input_args": {"text": "'HOLLYWOOD, Fla.  —   Donald J. Trump’s newly installed campaign chief sought to assure members of the Republican National Committee on Thursday night that Mr. Trump recognized the need to reshape his persona and that his campaign would begin working with the political establishment that he has scorned to great effect. Addressing about 100 committee members at the spring meeting here, many of them deeply skeptical about Mr. Trump’s candidacy, the campaign chief, Paul Manafort, bluntly suggested the candidate’s incendiary style amounted to an act. “That’s what’s important for you to understand: That he gets it, and that the part he’s been playing is evolving,” Mr. Manafort said, suggesting that Mr. Trump was about to begin a more professional phase of his campaign. “The negatives are going to come down, the image is going to change, but Clinton is still going to be crooked Hillary,” he added. Mr. Manafort’s comments, which included a PowerPoint presentation, came during a   reception at the beachside hotel resort here. They were made behind closed doors, which were guarded by security. But a person in attendance taped the speech and shared the recording with The New York Times. Mr. Manafort, a longtime Republican strategist and lobbyist who in recent weeks has taken over control of much of the organization from Mr. Trump’s campaign manager, offered an olive branch to the party officials at the start of his remarks. “Is Donald Trump running against the Republican National Committee?” asked Mr. Manafort, referring to the candidate’s unrelenting assault on what he calls the “crooked” nominating process. “The answer is he is not. ” But Mr. Manafort went further than simply placating committee members: He also openly said that Mr. Trump wanted to coordinate with the very forces he has spent much of his campaign attacking. “He gave us the mandate to bring together a team of professionals that could finish the job for him, but could also then begin to link in with the establishment institutions that are part of our party, what you represent, what the state parties represent,” he said, also alluding to think tanks and members of Congress. “We’ve started all those conversations,” said Manafort, adding of Mr. Trump, “He cares about the united team. ” The remarks suggest Mr. Trump is conducting something of an   campaign simultaneously, railing against what he calls a “corrupt” process in public to win over   Republicans while sending Mr. Manafort to assure party stalwarts of his true intentions. Mr. Manafort largely ignored Senator Ted Cruz of Texas, Mr. Trump’s most formidable remaining Republican opponent, alluding to him only to echo remarks he made earlier this week about how a contested convention might leave the party fractured. Mr. Manafort said he agreed with Mr. Cruz. “I don’t want a fractured convention, we want this thing to bed early,” he said, adding, “We don’t want to be in Cleveland fighting for a nomination that’s already been decided. ” As for Mr. Trump’s continual attacks on the nomination process, Mr. Manafort said he was largely focused on “transparency” and had no genuine desire to undermine the   rules. “He is winning he’s not interested in changing the rules,” he said. Mr. Manafort acknowledged Mr. Trump’s deep unpopularity  —   his “negatives,” he called them  —   but invoked Ronald Reagan’s initial polling deficit in 1980 to claim Mr. Trump’s deficiencies were not permanent. Mr. Reagan’s unfavorability in 1980, however, was never as high as that of Mr. Trump now. “Fixing personality negatives is a lot easier than fixing character negatives,” said Mr. Manafort, claiming that Hillary Clinton suffered from negative. “You can’t change somebody’s character. But you can change the way somebody presents themselves. ” And that, Mr. Manafort said, was in the works. Mr. Trump intends to deliver a foreign policy address at the National Press Club in Washington next week, Mr. Manafort said, and that he would also hold similar events to address his “gender gap. ” “You’ll start to see more depth to the person, the real person,” Mr. Manafort continued, referring to more Trump appearances in “formal settings. ” Looking ahead to the fall, Mr. Manafort was joined by Rick Wiley, the campaign’s new political director, to help lay out an audacious case for how Mr. Trump could defeat Mrs. Clinton. Mr. Manafort, citing “the unique magic of Trump,” said the candidate could be in a “very competitive situation in states that by the end of September you say goodbye to the presidential candidate. He singled out Pennsylvania, Maryland and Delaware. The three states last voted for a Republican presidential nominee in 1988. As the Republicans ate oysters in a dim, stuffy conference room overlooking the Atlantic Ocean, Mr. Wiley walked them through a slide show that predicted victory for Mr. Trump not just in swing states with large Hispanic populations like Nevada, Colorado and Florida, but in states that Republicans have not captured since the 1980s: Pennsylvania, Michigan, Minnesota, Wisconsin and Connecticut. And in other solidly Democratic states, like Illinois and New Jersey, he said Mr. Trump could force Mrs. Clinton to spend money defending herself. “Can we win Illinois?” Mr. Manafort asked. “I don’t know. But what we can do is make Hillary Clinton go to Illinois, make her spend money there, make her spend money in the Northeast. ”'"}, "time": 1742562198.5747952}