{"duration": 0.08893728256225586, "input_args": {"text": "'By Hrafnkell Haraldsson   9:24 am \"We can’t do waterboarding, it’s far too tough! We’re fighting on a different level! we have to be tough...and in some cases pretty vicious\"   \\nDonald Trump complains about spending a fortune on a war in the Middle East that he supported, a war brought to us by a Republican administration that knowingly lied about the facts. Trump is also lying about the facts, which at least brings our country’s Middle East ordeal full-circle. \\nAccording to Trump, speaking at a rally in New Mexico – and you’ve no doubt seen the barrage of commercials repeating the same lie – “Hillary brought disaster to Iraq, Syria, Libya and every place that she touches. She empowered Iran and she unleashed ISIS by leaving that big vacuum.” \\nOf course, it was Republican President George W. Bush who negotiated the balance of forces agreement with Iraq, stipulating that America draw down its combat strength. Reneging on that agreement would have meant not peace in Iraq, or a negation of ISIS, but a second U.S. invasion on top of the rise of ISIS. \\n“We want peace through strength,” Trump told the crowd. “We don’t want to be in wars but these savages are chopping off heads.” \\nWell, in fact we DID want to be in that war. We invaded Iraq, not vice versa. \\nTrump went on to say, \\n“Drowning people in steel cages, burying people in the sand. We haven’t had – this is medieval times. This is medieval times and then we can’t do waterboarding, it’s far too tough! You know, we’re fighting on a different level! See, we’re fighting on a different level folks and we have to be tough and we have to be smart and we have to be in some cases pretty vicious, to be honest with you. Pretty vicious, but we have to take them out and then we have to get back to building our country because our country – we’ve spent $6 trillion in the Middle East. $6 trillion. And we could’ve rebuilt our country twice.” \\nNever mind for a moment that torture is illegal under international law; never mind that a 2014 Senate Intelligence Committee’s report said torture doesn’t work; Trump’s argument sounds once again like a child wanting to get back at another child who has aggrieved him. \\nThis is Trump wanting to spite his enemies on an international scale, and arguing to boot that the end justifies the means. \\nHe doesn’t, because he can’t, prove that acting like barbarians somehow doesn’t make us barbarians ourselves. He certainly can’t prove, because that Senate report says otherwise, that torturing people will win the war. \\nThe claim of $6 million, by the way, is one Trump made last week in Charlotte, NC as well, and PolitiFact ruled it “half true” at the time, saying, \\nTrump is citing the high-end estimate of credible analyses of spending associated with the wars in Iraq and Afghanistan. Yet he is confusing money that’s been spent with money that researchers say will be spent. \\nThe point here is that this is a war begun not by Obama and certainly not by Hillary Clinton, who at least admits she supported it and has apologized for doing so, while Trump continued to deny he was ever for it, despite the facts to the contrary. \\nWhen Trump says “we have to be pretty vicious” he is also saying “we have to be pretty dishonest,” and nobody lies with such success or at such a rate as Donald Trump. \\nTrump has said he loves war. He has said he likes to be unpredictable. He has asked why we can’t use nuclear weapons since we have them. This is a man most national security experts say should not have the nuclear football in his hands. \\nThis is a man who, no matter how much he claims otherwise, does not understand how the world works. And he does not understand that by promoting torture, he is only fulfilling the wildest propaganda wishes of the Islamic State, by promising to do precisely what they want him to do.'"}, "time": 1742563081.2434437}