{"duration": 0.043160438537597656, "input_args": {"text": "'On Monday, an accused cop killer, gang member Michael C. Mejia, reportedly laughed as he was arraigned in court, according to the local ABC News affiliate. [Mejia was once released under AB 109, Gov. Jerry Brown’s signature prison reform, and now stands accused of committing two murders, including the murder of a Whittier police officer in February.  The explosion of violent and serious crimes across Southern California in the past several months  —   some committed by offenders that Brown released from state supervision, promising they were “  “ ” and “ ” —   has sparked a heated discussion about whether or not the controversial “prison reforms” known as AB 109 and Propositions 47 and 57 are responsible for recent deadly assaults on law enforcement officers. Three days after the February 20 murder of Keith Boyer, a   old Whittier Police Officer, the Los Angeles Times Editorial Board wrote a scathing editorial attacking Officer Boyer’s grieving boss, Whittier PD Chief Jeff Piper, for putting the blame on “criminal justice reforms” championed by Gov. Brown and the Times. The board severely chastised Piper for “mischaracterizing” the AB 109, Prop 47 and 57 prison and sentencing reforms in his moment of grief, claiming he “need[s] to be held accountable for false or misleading statements that are calculated to sway opinion on important policy matters, even if those comments come during times of great duress   …     [Chief] Piper misused the occasion of Boyer’s traumatic death to lash out at recent criminal justice reforms. ” No one likes to be wrong  —   and when someone is caught in a lie, they often double down  —   but it’s unfortunate to see a major Los Angeles newspaper engage in a campaign of deliberate distortion. Take Mejia, Boyer’s alleged murderer, whom the Orange County Register reported had been serving time for grand theft auto before he was released from Pelican Bay State Prison in April 2016. According to the Times, Mejia was not the beneficiary of “early release” or “otherwise at large because of some supposed defect in AB 109, the 2011 ‘realignment’ law that assigned more criminal justice responsibilities to counties. ” Michele Hanisee, President of the Association of Los Angeles Deputy District Attorneys, destroyed the Times‘ claim in a single comment. “Under the old system, [Mejia] would not have been out there to kill Officer Boyer.  Simple as that,” she said in a telephone interview Tuesday with Breitbart News. “Under custody of the state parole system,” Hanisee explained, “Mejia would have been thrown back into state prison for a full year for any one of the five  —   yes, count ‘em  —   five violations he committed after being released. ” Tragically, Mejia’s final probation violation occurred on February 2nd, 2017  —   only 18 days before Officer Boyer’s murder. If only AB 109 had not restricted law enforcement from sending Mejia back behind bars for a longer period of time than 10 days for his repeated violations, Officer Boyer might be alive today. Instead, thanks to Jerry Brown’s AB 109 “reform,” Mejia was only required to report to Los Angeles County Probation, under the   program known as “Post Release Community Supervision (PRCS)” —  and under AB 109, probation violations are limited to a   maximum “flash incarceration. ” Hanisee recently condemned AB 109 in the harshest possible terms on 790 KABC’s McIntyre in the Morning Show, according to a local affiliate of ABC in Los Angeles (KABC 7). “‘If you open these profiles and read them, every time it says, ‘this individual was qualified to be released to the supervision of parole under AB 109 because their current commitment offense is defined as    . ’” She says AB 109, like Propositions 47 and 57, was sold to the public by the politicians. “And they also give them really catchy names like ‘Public Safety Realignment Act’ rather than ‘Transfer Dangerous Felons to Your Jurisdiction Supervision Act. ’” Hanisee says AB 109 continues to threaten public safety, citing the descriptions of the 120 persons currently on the “L. A.’s Most Wanted. ” “It’s horrifying, absolutely horrifying. ” And the result for L. A. and the state? “This is a great place to commit crime. You’re going to get off easy and you’re going to get out early if you go in. ” Tim Donnelly is a former California State Assemblyman and author who is doing a book tour for his new book: Patriot Not Politician: Win or Go Homeless. He ran for governor in 2014. FaceBook: https:  . facebook. . donnelly.  Twitter:  @PatriotNotPol'"}, "time": 1742628602.2401402}