{"duration": 0.0799100399017334, "input_args": {"text": "'Motorola is Dead but Donbass lives on ‹ › Dr. Kevin Barrett, a Ph.D. Arabist-Islamologist, is one of America’s best-known critics of the War on Terror. He is Host of TRUTH JIHAD RADIO ; a hard driving weekly LIVE call in radio show. He also has appeared many times on Fox, CNN, PBS and other broadcast outlets, and has inspired feature stories and op-eds in the New York Times, the Christian Science Monitor, the Chicago Tribune, and other leading publications. Dr. Barrett has taught at colleges and universities in San Francisco, Paris, and Wisconsin, where he ran for Congress in 2008. He currently works as a nonprofit organizer, author, and talk radio host. I beat the ban in Berkeley – still censored in Sacramento By Kevin Barrett on October 26, 2016 \\nby Kevin Barrett , Veterans Today Editor \\nThanks to members of the Social Justice Committee of the Berkeley Fellowship of Unitarian Universalists, a large and enthusiastic crowd turned out for my talk on “Recent False Flags” yesterday. It was a triumph of free speech in the city that gave the world the Free Speech Movement. \\nBut unlike last year’s talk (watch it here ) this one wasn’t held at BFUU. \\nWhy not? One member of the BFUU Social Justice Community, a certain Holly Harwood, demanded that my scheduled event be canceled because (she libelously claimed) I am a “Jew hater” and “homophobe.” \\nNot one member of the Social Justice Committee supported her. \\nSo Holly Harwood started inundating the BFUU Board with lies and distortions about me and my books. The Board, which apparently includes some “stealth Zionists” who got themselves elected by concealing their pro-Israel loyalties, went along with her. \\nHarwood’s vicious vilification campaign only succeeded in increasing the turnout for my talk, which was held at Redwood Gardens instead of BFUU. But Harwood didn’t get the message. Now she has managed to censor another Berkeley free speech institution: Bonnie Faulkner’s legendary Guns and Butter radio show. \\nToday’s broadcast, which goes out on KPFA Berkeley and other Pacifica stations, features most of an interview Bonnie recorded with me last week. Unfortunately, after more mendacious complaints from Holly Harwood, Bonnie was apparently forced to cut the final six minutes of the interview, which features me explaining how and why I was banned at BFUU. Here is the censored “Guns and Butter” segment (please spread it far and wide so the censorship backfires): \\nThe last place on earth I would ever expect ANY censorship of ANYTHING is Berkeley, California. And the last two places in Berkeley I would EVER expect to be censored are the Unitarian Church and the Guns and Butter radio show! \\nDid I fall into a black hole and emerge into a Bizarro World counter-universe where Berkeley Unitarians are authoritarians and censors, and it’s the Bible-thumping Baptists of Alabama who are at the cutting edge of free speech, free thought, and unfettered intellectual inquiry? Memo to the Association of Alabama Baptists: Please invite this “radical Muslim conspiracy theorist” to speak at your freedom-loving church! \\nAnd it gets worse. I will be speaking in Sacramento tonight, and guess who’s blocking the news? The main local leader of the 9/11 truth movement! \\nDavid Kimball, who runs Sacramento 9/11 Truth, has sponsored and/or helped publicize all of my previous talks in the area. Yet this time he wouldn’t return my repeated phone calls. Finally, weeks after I had started calling him, I got this email: \\nFrom: David Kimball <…> Sent: Friday, October 21, 2016 11:42 PM Subject: Re: Sacramento event October 26th \\nHi Kevin. \\nI’ve received your phone messages and email, and my apologies for this late response. \\nIn recent years I’ve continued to research 9/11 more thoroughly, and although you and I are still in agreement that the “official narrative” of 9/11 cannot be true and that the media perpetuates the Big Lie, my views about 9/11 are no longer in agreement with yours. \\nTherefore, I cannot in good conscience promote your upcoming speaking event. \\nSincerely,'"}, "time": 1742564411.4046474}