{"duration": 0.06330084800720215, "input_args": {"text": "'Videos Leaked Deutsche Bank Speech Shows Clinton Asking Wall Street To Police Itself, Supporting US Pivot To Asia Clinton’s October 2014 speech to Deutsche Bank was leaked as part of WikiLeaks’ archive of John Podesta’s Gmail account, revealing more of the nominee’s agenda for the financial sector and global affairs.   Democratic presidential candidate Hillary Rodham Clinton waves to supporter as she arrives at a town hall meeting, Tuesday, Nov. 3, 2015, in Coralville, Iowa. (AP Photo/Charlie Neibergall) \\n\\nMINNEAPOLIS — With just days to go before the election, a two-year-old speech to a prominent global bank provides new insight into Democratic nominee Hillary Clinton’s possible agenda if she takes control of the White House. \\nClinton delivered the speech on Oct. 7, 2014 to Deutsche Bank in New York , but the content of that speech and an ensuing Q&A session wasn’t made public until WikiLeaks released it as part of the organization’s ongoing publication of emails and files taken from the private Gmail account of John Podesta, Clinton’s campaign chair. \\nClinton has faced pressure to release her speeches to banking executives throughout her presidential campaign, and particularly while vying for the Democratic nomination against Bernie Sanders, the Vermont senator who made campaign finance reform a central plank in his presidential platform. \\nIn her speech, Clinton acknowledged the pressures facing Wall Street in the wake of the 2008 financial crisis. She referenced the legacy of President Theodore Roosevelt in calling for moderate economic reforms: \\n“Remember what Teddy Roosevelt did. Yes, he took on what he saw as the excesses in the economy, but he also stood against the excesses in politics. He didn’t want to unleash a lot of nationalist, populistic reaction. He wanted to try to figure out how to get back into that balance that has served America so well over our entire nationhood.” \\nRoosevelt was known as a “trust buster” who was responsible for breaking up massive corporations, and he was outspoken about his wariness of big banks and wealthy business executives. \\nClinton also acknowledged “that many Americans feel frustrated, some even angry,” about the economic downturn, adding: “And a lot of that anger has been directed at the financial industry.” \\nWhile recognizing the need for reforms, Clinton also seemed to suggest that the financial sector might be allowed to police itself: \\n“Today, there’s more that can and should be done that really has to come from the industry itself, and how we can strengthen our economy, create more jobs at a time where that’s increasingly challenging, to get back to Teddy Roosevelt’s square deal. And I really believe that our country and all of you are up to that job.” \\nAccording to one analysis of the speech and related emails, this attempt to acknowledge critics of the banking industry could have been intended as a way to placate Clinton’s critics in the event of the eventual release of the speeches. \\n“In an email on November 20, 2015 Clinton speechwriter Dan Schwerin explicitly noted how he left an ‘easter egg’ in the DB speech precisely in case the world came knocking and asking for Hillary’s speeches,” wrote an anonymous contributor at Zero Hedge using the name “Tyler Durden,” a shared pseudonym adopted by many writers at the site, in an analysis of the speech published on Wednesday. \\nIn the 2015 email , Schwerin wrote: \\n“I wrote her a long riff about economic fairness and how the financial industry has lost its way, precisely for the purpose of having something we could show people if ever asked what she was saying behind closed doors for two years to all those fat cats. It’s definitely not as tough or pointed as we would write it now, but it’s much more than most people would assume she was saying in paid speeches. … Perhaps at some point there will be value in sharing this with a reporter and getting a story written.” \\nUltimately, “Tyler Durden” noted, the Clinton campaign opted not to release the speeches . \\nElsewhere in the Deutsche Bank speech, Clinton acknowledged the crucial role big banks will play in Washington’s strategic pivot to Asia. She said: \\n“Will we have the discipline and dexterity to follow through on our pivot to Asia where so much of the history of the 21st century will be written, while managing new and old crises in the Middle East and Europe? \\nCan we get our relationship with China right, navigating between the twin shoals of excessive accommodation and the potential for dangerous conflict? \\nWill our traditional allies in Europe and East Asia step up and share the responsibilities of upholding a global order under pressure from so many fronts?” \\nThe focus on Asia, started under the Obama administration and likely to continue under Clinton, if her speech is any indication, involves encircling China with economic and military allies as a way to undercut China’s growing global influence. However, some historic allies like the Philippines have begun to push back against U.S. influence in the region. \\nMany analysts see the Trans-Pacific Partnership , a controversial trade deal, as a key element to the U.S. pivot to Asia. While initially supportive of the deal, Clinton now promises to oppose the TPP as president after facing intense pressure from Sanders and activists opposed to the deal .'"}, "time": 1742564102.5432773}