{"duration": 0.05188441276550293, "input_args": {"text": "\"Email \\nA member of our Liberty Alliance family was recently hammered by Facebook censors for providing content that proved to be too honest to share on social media. The ladies at 100% Fed Up have been doing their patriotic duty for several years now, and they’ve built up quite a following on social media. In fact, they’re well over 850K followers on Facebook, where they share most of their cutting edge, unvarnished content with other patriots. Recently, they woke up to find that their page had been shut down by the liberal extremists who lord over Facebook’s content. \\nThe 100% Fed Up ladies recently spoke to Breitbart about the persecution they, and other conservative groups, have faced at the hands of the media giants at Facebook, Twitter, and Google. \\n“It’s a sickening feeling to know you’re being censored not for any horrible thing you’ve done, but for trying to tell the truth to millions of people. Are we living in America? Seriously, our First Amendment rights have been slowly eroding away bit by bit… \\nWhen we woke-up and saw a note at the top of our Facebook page, with no explanation as to why, telling us that our page had been ‘unpublished and cannot be published again,’ our greatest fear was realized… \\nThe 100 Percent FED UP Facebook page was borne out of frustration by Patty and I after we discovered how far left our media had become. We were frustrated by the lack of desire by so-called journalists to investigate corrupt dealings with our politicians in Washington, or to reveal the truth about illegal immigration, or the abuse of our veterans, entitlement programs and so much more.” \\nRead the whole story over at Breitbart . \\nLest you think this is a one-time random problem that just happened to occur during the presidential race, our good friend (and another Liberty Alliance partner) Joe Newby recently wrote a book cataloguing Facebook’s history of censorship in defense of liberal and jihadi causes. The book is called Banned: How Facebook Enables Militant Islamic Jihad , and it is a must read for anyone interested in free speech issues. \\nWhile militant jihad is exploding throughout the Islamic world, westerners are increasingly subjected to gravely perilous circumstances. Americans, Israelis, and Europeans are in their direct crosshairs. \\nJihadists congregate on social media, “friend” like-minded Islamists, and plot global jihad. With over 1.6 billion users worldwide, Facebook is the world’s largest social media site. It has become the de factoInternet since nearly every site connects to it. With that size comes great power–the power to lift up and the power to destroy. CEO Mark Zuckerberg promised to stifle negative stories of “migrants” and assured Muslims he would make his site a welcoming place for them. Banned explains how social media in general and Facebook in particular seems to operate with a double standard that ultimately enables militant Islamic jihad. \\nIf you care about Facebook’s censorship of conservative causes, please get involved and start sharing our content and the content of sites like 100% Fed Up and Conservative Firing Line . We can’t win this battle against liberal fascism unless we work together to overcome the censorship of the left. \\nArticle reposted with permission from Constitution.com Don't forget to Like Freedom Outpost on Facebook , Google Plus , & Twitter . You can also get Freedom Outpost delivered to your Amazon Kindle device here .\""}, "time": 1742563813.5839317}