{"duration": 0.10260462760925293, "input_args": {"text": "\"The renewed criminal investigation into Hillary's misdeeds -- and how it could affect the election. November 1, 2016 Matthew Vadum \\nDemocrats are in panic mode a week out from Election Day as they try to spin away the FBI’s newly announced discovery of a hoard of two-thirds of a million potentially sensitive emails apparently related to Hillary Clinton’s catastrophic tenure as America’s top diplomat. \\nPartisan hack James Carville is spewing wild conspiracy theories. \\nI think it is an outrage and I think the fact that the KGB is involved in this election is an outrage and I think the American people ought to take their democracy back regardless of what the press wants to do and the excuses they want to make for [FBI Director James] Comey. That’s what I think. \\nHe added, “this is in effect an attempt to hijack an election. It ought to be called for what it is.” \\nJust this past July, Comey was praised by Democrats far and wide for his wisdom in opting not to pursue Clinton. There is evidence federal officials tried to hinder various investigations of Clinton and the endlessly corrupt Bill, Hillary and Chelsea Clinton Foundation, which functions as a bribe processing center for would-be president Hillary Clinton. \\nBut Democrats have suddenly flipped sides, denouncing Comey as an enemy of the republic now that he has opened an investigation into the newly discovered emails. \\nCarville, long known as the “Ragin’ Cajun,” is apoplectic because he thinks these emails could change the dynamics of the election. \\nThe old Clinton hand may be right. \\nInvestigators found 650,000 emails on a laptop computer they believe was used at home by disgraced former Rep. Anthony Weiner (D) and his wife, longtime senior Hillary aide Huma Abedin. The computer is reportedly the same device serial pervert Weiner used to send sexual messages to an underage girl. \\n“Underlying metadata suggests thousands of those messages could have been sent to or from the private server that Mrs. Clinton used while she was secretary of state, according to people familiar with the matter,” reports the Wall Street Journal . Some of the information emailed may have been classified. \\nAbedin, who has intergenerational ties to the Muslim Brotherhood, reportedly forwarded sensitive government information to her personal Yahoo email account and may have viewed them on her home laptop. \\nOver the objections of Attorney General Loretta Lynch, Comey notified Congress of the information about the previously unknown emails at this late stage in the election cycle because after letting Hillary off the hook this summer he was facing a huge uprising among FBI employees, the overwhelming majority of whom are not unprincipled supplicants to power. \\nLynch is doing her best to make sure the Department of Justice probe goes nowhere. \\nAssistant Attorney General for Legislative Affairs Peter J. Kadzik, whom Zero Hedge calls “the best friend” of John Podesta, Hillary’s campaign chairman and former White House chief of staff in Bill Clinton’s administration, is heading up the email probe. \\nSo the fix is in. \\nIn any event, the prospect of restoring his good name may also have prompted Comey to act. \\nPeople are upset at Comey because he took the coward’s way out in the email investigation and is viewed as helping the Clinton team and the Obama White House in their efforts to cover up wrongdoing. \\nIt was back on July 5 Comey announced that despite the massive body of damning evidence accumulating against Clinton he would not recommend charges be brought against the former secretary of state for her use of hacker-friendly homebrew private email servers to conduct official business. Clinton and her aides were “extremely careless” in their handling of classified documents but there was no evidence of criminal intent, he said, even though the relevant national security statute does not require intent. The next day Attorney General Lynch confirmed no charges would be laid against Hillary. Lynch, as everyone now knows, had a clandestine meeting with former President Bill Clinton at a Phoenix airport a week before, at which a corrupt bargain was presumably made. \\nThis internal rebellion in the investigative agency was serious enough that Comey felt he had to act immediately. \\n“I have some sources in the FBI and the former district attorney's,” commentator Larry Kudlow said Sunday on NBC’s “Meet the Press.” “The FBI is in full revolt right now. The FBI has been in full revolt since the decisions made last summer.” \\nEver the Hillary shill, host Chuck Todd corrected Kudlow. \\n“Not full revolt,” he said. “There's been a lot. I mean it's--there are agents--Let's not say full revolt.” \\n“All right, a semi-full revolt,” said Kudlow. \\nBecause what I'm getting at is if Comey hadn't said what he said to Congress and the rest of the world, it would have leaked. It would have leaked. That whole building was ready to leak that they had discovered this new source with [Anthony] Weiner and [Huma] Abedin. So, I don't think Comey had much chance here. And I think the FBI is badly divided.” \\nMeanwhile, the trickle of bad news for Hillary Clinton has turned into a raging flood in the last few days. \\nClinton has been directly implicated in a nasty false flag operation against the Donald Trump campaign. Top Democrat operatives Robert Creamer and Scott Foval were caught on undercover video describing their involvement in an elaborate criminal conspiracy involving the use of targeted political violence against political opponents. The euphemism employed was “conflict engagement” which means paying leftist agitators, the homeless and the mentally ill, to cause melees at Trump rallies. \\nFomenting violence and physically attacking political opponents was what the fascist Third Reich did, using the Sturmabteilung or S.A., also called brown shirts and storm troopers. \\nLongtime Democrat pollster and campaign consultant Doug Schoen, a familiar face on Fox News Channel, announced he could no longer in good conscience support Clinton’s candidacy. \\n“I’m deeply concerned that we’ll have a constitutional crisis if she’s elected,” he said Sunday. “If the secretary of state wins, we will have a president under criminal investigation, with [top aide] Huma Abedin under criminal investigation.” \\nRepublican Donald Trump is closing the gap in national polls of likely voters. \\nClinton’s unfavorability rating in polls now exceeds Trump’s. She’s at 60 percent; he’s at 58 percent. \\nFormer New York mayor and leading Trump surrogate Rudy Giuliani said over the weekend that enough evidence has surfaced from WikiLeaks and the FBI to indict Clinton for racketeering. Bill Clinton “does the speeches, they put the money in the pocket, she does the favors in the government,” said Giuliani, a former federal prosecutor. “It all links up. Why did they destroy 33,000 emails? Because it shows the link.” \\nInfluential liberal journalist Ron Fournier threw Hillary under the bus. Mrs. Clinton got “a secret server” to protect what the Washington Post called “the ‘circle of enrichment,’” he said. \\nIf Hillary Clinton wins next week, media outlets across America will have to hire extra investigative journalists to handle all the corruption exposes that will follow.\""}, "time": 1742564445.0994291}