{"duration": 0.0953066349029541, "input_args": {"text": "'Sales of emergency survival food are increasing as we approach election day, and rightfully so. With Hillary Clinton and other democrats hellbent on resuscitating a non-existent Cold War and the violent riots we’ve seen by so-called protesters at Donald trump rallies, many preppers are seeing the signs and preparing for post-election unrest by storing large amounts of non-perishable food.\\nAlthough it is quite normal to see long-term storable foods rise in sales around election time, but survival food companies are seeing a particularly large spike in business this year as we approach election day.\\n“This is more intense than what we saw in 2012,” Keith Bansemer, marketing VP for My Patriot Supply, a survival food company, told NBC news. He says that last election season doubled their sales, and this time around they have seen their sales triple. \\n“We have everyone we can on the phones. We are overwhelmed,” said Bensemer. \\nThose who expect Trump to win fear a revolt from violent anti-Trump protesters, such as the riot seen in San Jose , California outside of a Trump rally. Others who expect Hillary Clinton’s coronation to the presidency are preparing for a possible World War 3 scenario, which may be a very well-founded concern considering Clinton’s war-driven rhetoric about Russia’s involvement in Syria and the establishment of no-fly zones in air space around Aleppo.\\nHowever, not everyone is preparing for war with another country. Many are preparing for government-related threats to their life and liberty. One of the major threats we face is the ever-increasing desire of politicians to take away our guns and the resulting chaos that would ensue. Hillary Clinton completely disregards the second amendment, and the possibility that she would enact gun confiscation across the country should not be discounted. This would mean a declaration of war on the people, or at least those who cherish freedom.\\nBansemer does not think his customer base is fearing for any specific election outcome. He thinks that many just want to be prepared for whatever may come as a result of either of these candidates’ policies.\\n“You hear them saying, no matter who wins, I know I could take a positive step myself and secure what’s important,” he explained. “They’re securing their food supply.” \\nA number of other long-term food suppliers are seeing an increase as well.\\nLegacy Foods is predicting that sales will jump in the weeks following the election, said owner Phil Cox. Legacy sells a $2,000 package of a year’s worth of storable food, containing nearly 1,100 meals and sealed in military-grade Mylar packs.\\nRetailers are noticing the increase of sales of long-term food and they are serving the market. Costco is also getting into the emergency food market with a 390-serving bucket, or one month’s supply of food, for $115. Store owner Larry Friedman is unsure what to make of the increased presence of preppers at his military surplus supply store, M&G. “Some are regulars in here,” said Friedman. “They come in, seem perfectly normal, and then suddenly, they’re talking about the apocalypse. You do a double-take.”\\nFriedman recalled seeing an increase of sales like this nearly two decades ago, after the original invasion of Iraq:\\n“It really started in ’91 with Desert Storm. People were worried about Scud missiles and chemical weapons from Iraq. We had so many people waiting we almost couldn’t close the doors. We sold every gas mask we could get our hands on. That was off the hook.” \\nWhatever reason one may have for preparing, there is no question that if disaster strikes and food becomes scarce, food will become a primary currency , and storable food will become highly valuable. There’s no good reason to pass up the opportunity to prepare. \\nThis information has been made available by Ready Nutrition \\nOriginally published November 6th, 2016 Sign of the Times: Riot Control Gear Sales Are Soaring… Could the Next World War be Initiated with an EMP Weapon… Four Current Events that Could Challenge the Prepper… 14 Reasons Why The U.S. Economy’s Bubble Of False… Silver Bullion or Junk Silver for Long-term Bartering? '"}, "time": 1742561829.8378782}