{"duration": 0.0865938663482666, "input_args": {"text": "\"Top Hillary Official Leads Prayer Chain Hoping To Save Imploding Campaign Posted on October 31, 2016 by Prissy Holly in Politics Share This \\nDemocrats are constantly attacking Christianity while fighting to have God completely removed from our institutions, and evidence of their godless agenda was on full display during the Democratic National Convention, when they removed all references to God. However, now that Hillary’s campaign is imploding, Democrats are evoking the name of God, as a last-ditch effort to save her campaign. \\nIt doesn’t take a brain surgeon to see that Hillary and her presidential race is going down in flames. She continues to drop in the polls, while many of her previous supporters are now ditching her and flocking to early voting stations to cast their votes for Trump. As things progressively spiral out of control in the aftermath of the FBI reopening their investigation, chairwoman for the DNC is now calling on Hillary supporters to evoke the name of God and pray for “divine intervention” to save crooked Hillary’s deteriorating presidential campaign. \\nShortly after news broke of the FBI’s decision, chairwoman Donna Brazile immediately jumped on Twitter, leading liberals in somewhat of a social media prayer chain for Hillary. As evidenced by the heart and retweet buttons, Hillary’s supporters echoed the sentiments of Brazile’s desperate plea for God’s divine intervention to save Hillary’s imploding campaign. Please God, let this end soon \\n— Donna Brazile (@donnabrazile) October 30, 2016 \\nUnfortunately, Brazile wasn’t done mocking God quite yet. It looks like she even dusted off her Bible to find a verse she could twist for her political use, as she then blasted lines from the book of Psalms, accompanied with a frantic message to Hillary supporters to get out and vote. Exhaling every time I get distracted. Let's work until the midnight hour. Are you fired up and ready to vote? Keep you eyes on the prize! https://t.co/wnSixsJYu3 \\n— Donna Brazile (@donnabrazile) October 30, 2016 \\nNow, I’m no Biblical scholar, but I do know that God explicitly states in the Bible that he will not be mocked. Being that the Democratic Party is the epitome of evil as the original proponents of slavery and abortion, it’s truly asinine that these idiots think God is suddenly going to have their backs and assist them with getting the evilest and vilest person on planet earth elected into the White House. \\nTrump supporters were quick to catch the absolute irony of Brazile’s Twitter antics and immediately began firing back with some hilarious responses of their own: @donnabrazile Please golden, sweet Jesus… #DrainTheSwamp quickly!! Let's all #MakeAmericaGreatAgain and get these criminals out of here! pic.twitter.com/wsf3zx26LL \\n— Erica AmERICA (@EricaMelone) October 30, 2016 @donnabrazile Yes let's pray! Pray for God's justice and that @HillaryClinton is put in prison where she belongs! \\n— ☆ Prissy Holly ☆ (@PrissyHolly) October 31, 2016 @PrayInFaith This is true if one is serving The God of Abraham, Isaac & Jacob! Does God support reprobate & criminal behavior? \\n— Joe Butler (@jdb1964) October 31, 2016 @PrayInFaith I can't imagine God would want a corrupt person such as HRC running this country. \\n— Deplorable Kimie (@kimieand) October 31, 2016 @PrayInFaith God cannot honor this corruption which is out there for all eyes. I pray for America to be protected from her. \\n— Lou Stevens (@LouMalpagato) October 31, 2016 \\nNice try, Democrats. Maybe if you hadn’t made it your number 1 priority to erase God from our schools and governmental institutions in recent years, He might look down favorably upon you now, in your darkest hour. \\nAs for me, I will continue to get on my knees every night, begging for God’s mercy and asking not for my will but for His will to be done. Being that God is on the side of justice, I seriously doubt that if Hillary does manage to win, that He would have had anything to do in assisting in that devastating outcome!\""}, "time": 1742561886.0505562}