{"duration": 0.441725492477417, "input_args": {"text": "\"Corrente. \\nTPP/TTIP/TISA/NAFTA \\n“[Trump] has many tools to reverse the post World War II consensus on liberalizing U.S. trade without needing congressional approval. For instance, he can withdraw from the North American Free Trade Agreement, as he has threatened to do, by simply notifying the U.S.’ Nafta partners, Mexico and Canada, and waiting six months. Withdrawing from the World Trade Organization, which sets rules for global trading and enforces tariffs, has a similar provision” [ Wall Street Journal , “Donald Trump Will Need to Leverage Size, Power of U.S. Economy to Remake Global Trading System”]. “‘Our major trading partners are far more likely to cooperate with an America resolute about balancing its trade than they are likely to provoke a trade war,’ wrote Trump economic advisers Peter Navarro [ here ] of the University of California-Irvine and investor Wilbur Ross in September. ‘This is true for one very simple reason: America’s major trading partners are far more dependent on American markets than America is on their markets.'” \\nTPP: “To take effect, TPP must be ratified by February 2018 by at least six countries that account for 85 percent of the 12 members’ aggregate economic output. This effectively means that the U.S. and Japan, the world’s third-largest economy and the second-largest that is a signatory nation, must both be on board” [ DC Velocity ]. \\nTPP: “Mr. Trump’s win also seals the fate of President Barack Obama’s 12-nation trade agreement, the Trans-Pacific Partnership, or TPP. The president-elect blamed the TPP on special interests who want to “rape” the country” [ Wall Street Journal , “Donald Trump Win to Upend Trade Policy”]. “Mr. Obama had hoped to work with Republican lawmakers to pass the TPP during the ‘lame duck’ session of Congress after the election, where they faced an uphill battle even if Tuesday’s vote had favored Hillary Clinton, who previously backed the TPP negotiations. Now Republicans have little incentive to bring the TPP to a vote, since Mr. Trump could easily threaten to unravel the deal when he takes office and block its implementation, as well as punish lawmakers who vote for it.” \\nTPP: “Donald Trump’s historic victory Tuesday has killed any chance of Congress voting on President Barack Obama’s signature Asia-Pacific trade agreement while raising the odds of a damaging trade confrontation with China — just two ways a Trump presidency could upend the global trading system and usher in a new era of U.S. protectionism, analysts say” [ Politico ]. “‘This is the end of globalization is we knew it … because what the U.S. is going to do is certainly going to impact other countries’ and their decisions on negotiations,’ Gary Hufbauer, a senior fellow at the Peterson Institute for International Economics, told Politico. ‘TPP is now in the history dustbin for sure,’ Hufbauer said.” \\nTPP: “House GOP election outcomes will be key as House Speaker Paul Ryan decides whether to bring the TPP to a vote in the lame-duck session with GOP voters strongly against and the GOP ‘s high-donor base demanding action. With an eye to conservative GOP threats to withhold support for his speakership and a possible 2020 presidential run, Ryan’s decision is complicated. Whether the TPP will get a lame-duck vote is his call. Beyond whether he can muster the votes of representatives who weathered the wrath of trade voters in this cycle and worry about the 2018 primaries lies the longer-term implications of his even trying to do so with the GOP voter base so intensely against the pact” [Lori Wallach, Eyes on Trade ]. \\n2016 \\nThe Rending of Garments and Gnashing of Teeth \\n“People’s net worth has been crippled, if you were directly, in a 401K, through a mutual fund, or through a pension, invested in capital markets” [TeacherKen, Daily Kos ]. Bathos. \\nMoney \\n“Allies on the ground complained for weeks that they weren’t getting the resources they needed” [ The Hill ]. “‘The big question is ‘How much money did you spend? And what’s left in the bank?’ said one Clinton surrogate. ‘Because there were states like Michigan that kept sounding the alarm and no one was taking it seriously until the very end. They never really got everything they wanted.’…“Russ Feingold sent a flare up and said ‘I need help,’ [Democratic strategist Jim Manley] said, but it went largely ignored.” Huh? Clinton spent the month of August fundraising. The Clinton Victory Fund scam turned the state parties into a money laundries for cash passed through to the Clinton campaign. Clinton raised $154 million in September for her campaign and the party. And people “getting the resources they needed”? Seems odd. \\nPolicy \\n“Majority Leader Mitch McConnell signaled the Senate would move swiftly to repeal Obamacare now that the GOP Congress will have a Republican president next year” [ Politico ]. \\nPolling Debacle \\n“While the [Trump] campaign had expressed confidence in public, their own data showed only a narrow path to the 270 electorates needed to win the White House” [ NBC ]. And: “RNC staffers thought Trump would win 240 Electoral College votes, 30 short of the 270 needed to win. They cautioned reporters that these numbers could change. And it was noteworthy that their projections were more optimistic than much of the public polling. But Trump was down 2 points in Florida, down 2 points in Iowa, down 2 points in New Hampshire and down 3 points in Wisconsin. Trump won Florida, won Iowa, won Wisconsin, and as of the publishing of this story was in a tight race for New Hampshire” [ Yahoo News ]. Which, interestingly, is what I kept saying. When I cut through the triumphalism and looked at the polling, and threw those numbers against the “paths to victory,” it was always (except for one week) a horse race. So I seem to have channeled the Trump team’s thinking on the data. It’s been an interesting year, and I’ll critique my approach tomorrow. An interesting data point: “The best data inside the Trump campaign was just as pessimistic. Even the most optimistic models run by Cambridge Analytica for Trump showed him losing. But as Cambridge’s Matt Oczkowski tweeted late Tuesday, Trump’s support and turnout among rural voters was 10 percentage points higher than they had expected .” Ten points is rather a lot. \\n“Donald Trump’s win was predicted by Allan Lichtman — the US election expert who has called every result since 1984” [ Independent ]. “‘[The 13 keys method] is a historically based prediction system. I derived the system by looking at every American presidential election from 1860 to 1980,’ Professor Lichtman has said.” And: “Lichtman believes election analysts err by studying campaign as a series of battlefields — northern versus southern Florida, western versus eastern Pennsylvania, and so on. He prefers likening it to dominoes, toppling one way or the other. He says U.S. campaigns are contests of momentum. In the early 1980s, he and a colleague examined election results dating back to the Civil War and found a pattern. They drew up 13 true-false statements, and if the answer to six or more was ”False,” the incumbent party always lost the White House” [ HuffPo ]. And: “LICHTMAN: I don’t call [the 13 keys] data-driven. I have no problem with data. My prediction system is based on a huge amount of data, you know. But I do object to poll-and-pundit-driven analysis, which is not meaningful because it’s not based on any kind of systematic assessment of how elections work” [ NPR ]. \\n“I Answer Your Questions About Predicting President Trump” [ Scott Adams Blog ]. “Clinton’s team of cognitive scientists and professional persuaders did a terrific job of framing Trump as scary. The illusion will wear off – albeit slowly – as you observe Trump going about the job of President and taking it seriously. You can expect him to adjust his tone and language going forward. You can expect foreign leaders to say they can work with him. You can expect him to focus on unifying an exhausted and nervous country. And you can expect him to succeed in doing so. (He’s persuasive.) Watch as Trump turns to healing. You’re going to be surprised how well he does it. But give it time.” Scott Adams is looking pretty good right now. But is he only as good as his last trade? \\n“Silver is just guessing. And, in the run-up to this election, he made so many guesses that at least one of them has to be correct” [ WaPo ]. \\nDownballot \\n“The 2018 election cycle has started and Republicans find themselves in an interesting place. On the one hand, the tables are turned as they will get to play offense. There are 33 races in 2018 and Democrats will defend 25 of those seats while Republicans will defend just eight of them” [ Cook Political Report ]. \\nThe Voters \\nAnecdotes but well-chosen: “It was never enough to say that the Trump phenomenon rested only on whites without a college degree. They were part of Trump’s surprise, but not all of it. The real shocks were the fence-sitters, the late-breakers, the Bush-family types, and the suburban women. They would, we were so often told, recoil from Trump. Outside the Silverbrook Elementary School, a polling station in the affluent community of Fairfax Station, I encountered Jaclyn Miller, a genial tax accountant in her mid-thirties. I asked how she voted. She winced and laughed. ‘I voted for Trump, begrudgingly,’ she said” [ The New Yorker ]. “‘It was the lesser of two evils, in my mind. I’m definitely a fiscal conservative, and the corruption and everything from Hillary, just, I couldn’t do it,’ she said. “She’s not trustworthy.’ The ‘Access Hollywood’ tape did not matter much to her. After all, she said, Bill Clinton was ‘with an intern in the Oval Office.; Of Trump, she added, ‘I’m sure there’s things that I’ve said that I would never want public.’ Miller went on, ‘A couple weeks ago, I had decided, at that moment, that I was going third party. And I really wish that there was a valid third-party option. I think a lot of Americans don’t fall into one category.'” Amen to that last comment. \\n“The Democratic Party Deserved To Die” [Krystal Ball, HuffPo ]. “Well, those jobs are actually gone for good, we knowingly told them. And we offered a fantastical non-solution. We will retrain you for good jobs! Never mind that these ‘good jobs’ didn’t exist in East Kentucky or Cleveland. And as a final insult, we lectured a struggling people watching their kids die of drug overdoses about their white privilege. Can you blame them for calling bullshit? ” \\n“The ‘Deplorables’ Got the Last Laugh” [David Dayen, The New Republic ]. “[T]he lesson for Democrats is ultimately clear enough: You cannot write off half the country, much less spend an election cycle deriding it, and expect success.” \\n“Despite the unexpected triumph of Donald Trump, Democratic state legislative candidates held their own Tuesday in their efforts to close the gap on Republicans in the nation’s statehouses” [ RealClearPolitics ]. But: “Overall, after netting more than 800 state legislative seats during the Obama years, Republicans are hugely dominant in the nation’s statehouses, controlling 66 of the nation’s 98 partisan legislative chambers. Democrats control 30. There are two ties, pending the outcome in the New York Senate. (Nebraska has a nominally non-partisan unicameral legislature.) ” \\nOur Famously Free Press \\n“But I’ve come to think that the rise of fake news — and of the cheap-to-run, ideologically driven aggregator sites that are only a few steps up from fake — has weaponized those filter bubbles. There were just too many people voting in this election because they were infuriated by made-up things they read online” [ Nieman Labs ]. Dunno about that (see below). But this rings true: “One thread running through the countless profiles of Trump voters this cycle was the loss of community institutions. The factories shut down; the church pews were emptier than they used to be; the braided fabric of their towns had unraveled. Don’t forget that, particularly in smaller communities, the local newspaper was one of those key institutions — the daily or weekly package of stories that connected you to your neighbors.” \\n“Facebook’s algorithm and whatever ‘echo chamber’ or ‘filter bubble’ or whatever it may have created did not lead to this result. This was the result of a very large group of people who are quite clearly — and reasonably — pissed off at the status quo…. This was a “throw the bums out” vote, and many of the bums deserved to be thrown out” [ Tech Dirt ]. “But that’s not Facebook’s fault. And the idea that a better or different algorithm on Facebook would have made the results any different is just as ridiculous as the idea that newspaper endorsements or ‘fact checking’ mattered one bit. People are angry because the system has failed them in many, many ways, and it’s not because they’re idiots who believed all the fake news Facebook pushed on them (even if some of them did believe it). Many people don’t think Trump will be any good, but they voted for him anyway, because the status quo is broken.” \\nLegitimacy \\nTrump meets with Obama: “‘We discussed a lot of different situations, some wonderful and some difficulties. I very much look forward to dealing with the president in the future, including counsel,’ Trump said. ‘Mr. President, it was a great honor meeting with you. And I look forward to meeting with you many, many more times in the future'” [Olivier Knox, Yahoo News ]. \\nSanders: “To the degree that Mr. Trump is serious about pursuing policies that improve the lives of working families in this country, I and other progressives are prepared to work with him. To the degree that he pursues racist, sexist, xenophobic, and anti-environment policies, we will vigorously oppose him” [ Variety ]. \\n“Supreme Court Justice Ruth Bader Ginsburg appeared to be wearing her infamous “dissent jabot” on the bench Wednesday morning. The move is being widely interpreted as a repudiation of Donald Trump’s victory in the presidential election a night earlier” [ The Hill ]. “Ginsburg typically wears the collar when issuing dissenting opinions in the court, as she explained to Yahoo News in 2014. But no opinions were read Wednesday.” This isn’t like Kremlinology. It is Kremlinology. \\n“The audience for our glib analysis and contempt for much of the electorate, it turned out, was rather limited. This was particularly true when it came to voters, the ones who turned out by the millions to deliver not only a rebuke to the political system but also the people who cover it. Trump knew what he was doing when he invited his crowds to jeer and hiss the reporters covering him. They hate us, and have for some time” [ CBS ]. “What’s worse, we don’t make much of an effort to really understand, and with too few exceptions, treat the economic grievances of Middle America like they’re some sort of punchline. Sometimes quite literally so, such as when reporters tweet out a photo of racist-looking Trump supporters and jokingly suggest that they must be upset about free trade or low wages.” Yglesias being a prime offender. \\n“My mom-in-law was watching CBS all night, so that’s what we watched. All the pundits/anchors spoke in the hushed tones of a funeral. For two hours, the only images of campaign workers shown were the sad faces of Clinton supporters; not one image of jubilant Trump supporters was broadcast until Trump gave his acceptance speech” [ Of Two Minds ]. “When one of the talking heads noted that Hillary never generated the enthusiasm of the Sanders or Trump campaigns, his comment was followed by a stony silence. That he had given voice to a self-evident truth was not welcome. \\n“The White House on Wednesday refused to rule out the possibility that Obama would pardon Clinton to prevent Trump from prosecuting her when he takes office” [ The Hill ]. And: “‘There are deep and disturbing issues there,’ [Rudy] Giuliani, a top Donald Trump adviser and former federal prosecutor, said Thursday on Fox News’s “Fox & Friends,’ citing the Clinton Foundation. ‘That’s why I don’t think President Obama should pardon her,’ Giuliani added. ‘I think President Obama should leave it to the system that we all believe in to determine is she innocent or is she guilty?'” \\n“Within a few weeks of winning the White House, President-elect Donald Trump could face another group of U.S. citizens, a federal jury in California, courtesy of a lawsuit by former students of his now-defunct Trump University who claim they were defrauded by a series of real-estate seminars” [ Reuters ]. \\nStats Watch \\nJobless Claims, week of November 5, 2016: “Employers are holding tightly onto their employees as jobless claims remain steady at or near record lows” [ Econoday ]. And: “lower than the consensus forecast” [ Calculated Risk ]. But: “The trend of the 4 week moving average is continuing to marginally worsened – and catch up to the rolling averages of a year ago – and this trend historically indicates a weakening GDP” [ Econintersect ]. \\nEmployment Situation: “Despite largescale hiring announcements from numerous major retailers, the number of October employment gains in the sector declined 21 percent from a year ago to 154,600. That was the fewest job gains to kick off the holiday hiring season since 2012” [ Econintersect ]. \\nBloomberg Consumer Comfort Index, week of November 6, 2016: “The consumer comfort index, at 45.1 in the November 6 week, is accelerating” [ Econoday ]. “Strength in consumer confidence is tied closely to strength in the labor market. ” \\nShipping: “[“Smart containers”] can be tracked, managed and monitored remotely using special hardware such as relay antennas which allows the lines to collect, store and analyse data even while the ship is in high seas.. Based on this data, lines can take relevant remedial action where required, especially with regards to reefer cargo” [ Shipping & Freight Resource ]. “In a lot of the cases digital technology has become a USP (Unique Selling Proposition) and shipping lines while competing on price have also started competing on ease of UX (User Experience) and through this have managed to transfer a lot of the work from their desks to the customers desks…. Of course there are humans involved in these processes in the background, but the fact remains that in a lot of the cases you don’t have any visible human interaction as the system takes care of everything.” \\nShipping: “Cargo transportation by sea in 2015 saw its slowest rate of growth since 2009 amid the prolonged slowdown in global trade.Figures from the UN Conference on Trade and Development indicated that seaborne shipping had risen 2.1% year on year to exceed 10bn tons” [ Lloyd’s List ]. \\nThe Bezzle: ” Yahoo describes massive data breach, doesn’t explain two-year disclosure gap” [ FCPA Blog ]. “Yahoo said in a securities filing Wednesday that employees knew in late 2014 a state-sponsored hacker entered its network and stole names, birth dates, and encrypted passwords for more than 500 million accounts… Wednesday’s disclosure didn’t say which employees knew about the attack or who they informed. Yahoo first disclosed the 2014 data breach in September this year. The board is now investigating the attack with the help of forensic experts, Yahoo said Wednesday. The company didn’t say when the board first learned about the attack or which executives, if any, knew about the attack when it happened. Yahoo disclosed the attack in September, two months after entering into an agreement to sell itself to Verizon for $4.8 billion.” \\nThe Bezzle: “̌Republican Donald Trump’s victory in the U.S. presidential race puts a new rule on retirement advice in limbo, even after Wall Street’s biggest wealth management firms have spent millions preparing for it, lawyers and analysts said this week. The U.S. Department of Labor fiduciary rule, which is set to start taking effect in April, is meant to promote the best interests of retirement savers by eliminating conflicts of interest for brokers” [ Reuters ]. “On the campaign trail, Trump has said that ’70 percent of regulations can go,’ and an adviser, Anthony Scaramucci [ here ], told Reuters the fiduciary rule ‘would likely be stopped.'” \\nThe Bezzle: “We decided to examine the descriptions of [thousands of companies that received venture capital investment since 2010] to get a better look into the ever-changing startup landscape. We used natural language processing to identify trends by looking at which words are more or less common today than at the beginning of the decade” [ Priceonomics ]. “We found that social media, mobile apps, and email startups are on their way out, while messaging, healthcare, tools, and artificial intelligence are gaining momentum. By and large, startup descriptions are tech-heavy, featuring words like ‘app,’‘cloud,’ and ‘network.’ Our data also shows that no word has seen a bigger jump in usage than ‘virtual reality’ and no word a bigger decline than ‘electronics.'” \\nPolitical Risk: “‘The rapid rise of political and social populism and accelerating global migration are causes of concern,’ [AG CEO Joe] Kaeser said. [ Wall Street Journal , “Siemens Warns of Populist Threat to Business as Profit Jumps”]. \\nPolitical Risk: “The global shipping industry is bracing for a Donald Trump presidency, fearing the antitrade rhetoric in the campaign could turn into international showdowns that cripple the flow of goods” [ Wall Street Journal ]. “The betting in Mr. Trump’s camp is that trading partners will believe that access to the U.S. market is too precious to give up without negotiating new deals. Until that happens, however, ocean carriers will have to watch the political winds.” \\nToday’s Fear & Greed Index: 40 Fear (previous close: 30, Fear) [ CNN ]. One week ago: 18 (Extreme Fear). (0 is Extreme Fear; 100 is Extreme Greed). Last updated Nov 9 at 11:38am. Life goes on. \\nGaia \\n“Sex is far from a perfect way to reproduce. It imposes a huge cost on a species, and that cost is called “males.” If roughly 50 percent of a species is made up of males who are incapable of producing babies, it is at a serious reproductive disadvantage relative to another species made up mostly of females capable of reproducing on their own” [ Nautilus ]. “Despite its drawbacks, sex does seem to offer a species an incontrovertible advantage. It recombines individuals’ genes so that the species as a whole can maintain the diversity of traits it needs to survive whatever challenges—faster predators, changing climate, giant comet impacts—the future may throw at it…. By this logic, parthenogenesis is an evolutionary cul-de-sac.” But: “Earlier this year, a team from the American Museum of Natural History compared easily measurable traits such as scales along the belly, or pores on the right leg, from seven generations of one line of parthenogenic whiptails with a sexually reproducing species. The parthenogens showed just as much physical variability as sexually reproducing whiptails, even though the parthenogens all had identical DNA.” Hoo boy. \\nNews of the Wired \\n“A life in ruins” [ New Criterion ]. “On the architectural vision of John Soane.” Random quote: “Around 1850, Baudelaire was the first to use modernité in the sense of a unique aesthetic sensibility.” \\n“How Japan Prepares Its Children for Independence” [ Savvy Tokyo ]. “By five and six, Japanese children often take public transit or walk to school without their parents.” \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (ChiGal): \\nChiGal writes: “[A] hornbeam tree, never seen in the Chi but all over Carrboro, the ‘Paris of the South.’ If croissants were biscuits…” \\nReaders, Water Cooler is a standalone entity, not supported by the very successful Naked Capitalism fundraiser just past. Now, I understand you may feel tapped out, but when and if you are able, please use the dropdown to choose your contribution, and then click the hat! Your tip will be welcome today, and indeed any day. Water Cooler will not exist without your continued help. Donate \\n* * * \\nReaders, feel free to contact me with (a) links, and even better (b) sources I should curate regularly, and (c) to find out how to send me images of plants. Vegetables are fine! Fungi are deemed to be honorary plants! See the previous Water Cooler (with plant) here . And here’s today’s plant (ChiGal): \\nChiGal writes: “[A] hornbeam tree, never seen in the Chi but all over Carrboro, the ‘Paris of the South.’ If croissants were biscuits…” \\nReaders, Water Cooler is a standalone entity, not supported by the very successful Naked Capitalism fundraiser just past. Now, I understand you may feel tapped out, but when and if you are able, please use the dropdown to choose your contribution, and then click the hat! Your tip will be welcome today, and indeed any day. Water Cooler will not exist without your continued help. Donate 0 0 0 0 0 0 This entry was posted in Water Cooler on by Lambert Strether . About Lambert Strether \\nLambert Strether has been blogging, managing online communities, and doing system administration 24/7 since 2003, in Drupal and WordPress. Besides political economy and the political scene, he blogs about rhetoric, software engineering, permaculture, history, literature, local politics, international travel, food, and fixing stuff around the house. The nom de plume “Lambert Strether” comes from Henry James’s The Ambassadors: “Live all you can. It’s a mistake not to.” You can follow him on Twitter at @lambertstrether. http://www.correntewire.com\""}, "time": 1742562217.6207833}