{"duration": 0.061988115310668945, "input_args": {"text": "'If you believe those who spin the mill of rumors, Fox has undertaken a massive effort this year to make Super Bowl LI apolitical. [For example, Entertainment Tonight had a report, which was vehemently denied by the NFL, that the league told halftime performer Lady Gaga not to mention   Trump during her show.  Now, Fox has 86’d a Super Bowl ad from 84 Lumber, which includes the depiction of a border wall. According to The New York Post, “The spot, from 84 Lumber, a first time Super Bowl advertiser, was deemed by Fox to be too controversial, a spokesman for ad agency Brunner told The Post. Fox declined to comment. The two sides are said to be working on a compromise. ” Campaign’s Kathryn Luttner provides some description of the ad. Luttner writes, “The script has been rejected by the network for being “too political,” according to sources close to the project. The   spot from   agency Brunner focuses on recruitment and includes images of immigrants unable to cross the border due to “the wall,” a flashpoint of debate during the 2016 presidential election. ” 84 Lumber’s owner and president Maggie Hardy Magerko said in a statement, “Our industry is going through a period of extreme disruption. And I’ve always preferred to be the one doing the disrupting, rather than the one being disrupted. But to do that, we need to hire and train people differently. We need to cast a wider net, and to let the world know that 84 Lumber is a place for people who don’t always fit nicely into a box. We want people interested in creating their own path   …     for themselves and for 84 Lumber. ” If getting “outside the box” was the goal of this ad, 84 Lumber definitely achieved that. Still, it’s interesting that the NFL is so tightly policing this particular Super Bowl. They did not exercise such oversight last year when Beyoncé performed her extremely   song “Formation,” during the halftime show. Of course, that event occurred during a   and   halftime show and not in a   commercial ad, such as what’s happening here with 84 Lumber. Certainly, 84 Lumber should not be allowed to construct a giant replica border wall during the halftime show, even though that might be the greatest thing ever. But, if a performance that denigrates and endangers police officers can get an entire halftime show, a   border wall commercial can get some love, right? Probably not. Follow Dylan Gwinn on Twitter: @themightygwinn'"}, "time": 1742563118.8998196}