{"duration": 0.016175270080566406, "input_args": {"text": "'Top Chef  host Padma Lakshmi referred to Breitbart Senior editor MILO as a “ ” listing the riots at UC Berkeley as one of the “victories” of the   resistance. [The video posted to Lakshmi’s Instagram page is a compilation of supposed victories of the   protests that have appeared across the country. The video states, “Think protesting doesn’t change anything? In the last 48 hours the resistance has won major victories. ”  The video then takes credit for the rejection of Betsy Devos by two GOP senators, the cancellation of Donald Trump’s visit to the   company, however Trump did meet with two   executives and Nordstrom cutting ties with Ivanka Trump’s company despite Nordstrom explicitly stating that no boycott affected their decision to cut ties with Ivanka’s company. The video then states, “Berkeley protesters forced the cancellation of a hate speech by   Milo. ” The video fails to mention that innocent people were pepper sprayed, beaten with bats and chased by angry mobs or that the protest quickly devolved into a full blown riot with masked rioters destroying ATM’s and Starbucks shops. A video posted by Padma Lakshmi (@padmalakshmi) on Feb 4, 2017 at 7:00am PST,  The video also fails to mention MILO’s explicit rejection of white supremacy, white nationalism or any form of racism during a speech at UC Colorado Springs, “White pride, white nationalism, white supremacy isn’t the way to go,” he continued. “The way to go is reminding them and yourselves that you should be aspiring to values and to ideas. ” “You should be focusing on what unites people and not what drives them apart,” MILO concluded. “You shouldn’t give a shit about skin color, a shit about sexuality  …     You shouldn’t give a shit about gender, and you should be deeply suspicious of the people who do. ” MILO will be appearing on Justice with Judge Jeanine tonight at 9PM ET on Fox News.'"}, "time": 1742628492.2159078}