{"duration": 0.37394094467163086, "input_args": {"text": "'Indiana Parents Lose Their Baby and 2 Years of Their Lives in Jail for “Abuse” They Say Never Happened Laura Gellinger and Dylan Day with baby Jackson. Photo used with permission from the family. \\nby Health Impact News/MedicalKidnap.com Staff \\nAn Indiana couple watches their mailbox with dread, waiting for the papers they hope will never come – papers saying that their young son has been adopted out. \\nLaura Gellinger and Dylan Day haven’t seen their son in over 2 years, after they took their then 3 month old baby to the hospital for a minor injury and were subsequently accused of child abuse. They each spent 2 years in jail and are currently on probation after their son was found to have multiple fractures in various stages of healing. For some reason, the family alleges that they were not shown the x-rays. According to Laura’s mother Jamie Gellinger: \\nThey didn’t show us proof of anything! \\nA family history of osteoporosis, on both sides, was ignored, and there was only minimal testing for any other possible medical explanation for baby Jackson Day’s alleged injuries. There are reportedly numerous issues with the way the case was handled, as well as arguably inadequate representation, and a family has been torn apart in the meantime. \\nCould this be a case of innocent parents being unjustly accused, and imprisoned, for something that they didn’t do? Laura’s parents believe so, and Laura and Dylan maintain that they don’t know what actually happened, and that they never hurt their baby. \\nThe fact that they had no explanation for the fractures discovered by the hospital was apparently used against them. However, parents with children with brittle bones generally had no previous indication of any problems, and thus have no explanation for something they didn’t know was happening. Too often, they find that the doctors that they look to for help would sooner accuse them of abuse, rather than search for a medical explanation. \\nCourts and judges across the U.S. are increasingly overturning Shaken Baby abuse convictions, as most of these cases do not present the science against “Shaken Baby Syndrome,” and the medical evidence that can support injuries apart from parental abuse. \\nSee: University of Michigan Law School Awarded $250K to Learn How to Defend Shaken Baby Syndrome Cases \\nThis story from Indiana shares many details in common with other stories that Health Impact News has covered where innocent parents were falsely accused of abuse when there are legitimate medical conditions that caused the injuries to their children. \\nLocal media published the side of the story that Child Protective Services presented. Dylan Day and Laura Gellinger would like the opportunity to tell their side of the story – a side that has never been heard publicly, but which leaves many unanswered questions, and challenges the integrity of the investigation that led to the loss of their son and to their imprisonment. \\nHere is their story: \\nLaura and Dylan were young, just 19 and 20 when Jackson was born. They had never been in any trouble with the law and had no history of any kind of violence. Laura has always loved babies, and had dreams of becoming a nurse one day. According to Greg Gellinger, Laura’s father, the couple lived in a nice mobile home near her parents, and were excited about preparing for the arrival of their little one. Excited about the upcoming arrival of their little one. Photo source: Day family. \\nDuring her pregnancy, Laura reports that she took Prilosec for heartburn during mid-pregnancy. Her vitamin D levels were reportedly low. \\nPrilosec is a Proton Pumb Inhibitor (PPI) often used as an antacid. We asked a clinical radiologist if Prilosec during pregnancy could contribute to brittle bones in the baby. \\nThe known consequences are many including reduced absorption of Calcium, Magnesium, B12, vitamin C, copper. The bones can be affected by nearly all of these deficiencies (except B12). This is very well known. \\nSince infant metabolism is different than maternal, what do we know on the outcomes to fetus? Almost nothing. While there are many studies which claim there are no problems with PPI use in pregnancy, none actually measured bone quality in any meaningful way, thus were only recording severe congenital defects. \\nIn a nutshell, there is biological plausibility that use in pregnancy is a sign of nutritional deficiencies and can further result in fragile bone states to mom and fetus. \\nJackson was born at 41 weeks after an induced labor led to an emergency cesarean section on March 6, 2014. He weighed 7 lbs, 11 oz. Formula and Vaccines \\nThough Laura attempted to breastfeed, she says that didn’t go well, and Jackson was put on formula. During his first few months, he was healthy and happy except for some issues with gas. He spit up a lot and showed symptoms of reflux, which is a sign of vitamin D deficiency. Doctors recommended Mylicon drops, and his formula was changed several times. Typically, he only cried when his diaper was being changed or when he had gas. \\nLaura kept all of the doctor and WIC appointments. Jackson got all of the recommended vaccines according to the typical schedule. At 2 months of age, he received 8 vaccines in one day. Sweaty Head – Missed Sign of Rickets \\nBaby Jackson sweated a lot at night, especially around his head and back. Laura says that he would often soak through his pjs, and they had to put him to sleep in a short-sleeved onesie because he would sweat so much. Laura and Dylan just assumed he was hot-natured. \\nHowever, a sweaty head is a classic sign of rickets, discussed in the older textbooks. It is often overlooked, but Dr. David Ayoub discussed the symptom in an interview with Dr. Mercola: \\nI would be very concerned if a baby is perspiring heavily at night, especially around the face, head, and neck. They’re described as soaking their pillows. They had to change the sheets, because they’re so wet. That’s one of the odd, lesser-known signs of infantile rickets. Trip to Hospital has Disastrous Results \\nThe family got him a swing, and he loved it. Sometimes, he would pull a leg up and rest it on the tray of the swing. Laura says that she noticed a bump on his ankle that she assumed came from the swing, so she called the doctor’s office about it on Friday, June 14. They left a message, but didn’t hear back from the doctor’s office that day, so they planned to take him in the following Monday to check on it. Photo courtesy of the family. \\nMeanwhile, there was a family reunion on Saturday. It was Father’s Day weekend. After a long day of being loved on by various relatives, Jackson went down for a nap with his pacifier. He was 3 months old and was teething at the time. He was a bit fussy and fighting sleep, turning his head back and forth as he lay on his tummy. \\nA short time later, Laura says she heard him crying and checked on him. She was alarmed to see blood around his mouth and on the sheet where his head was. Laura’s mother Jamie went with Laura and Dylan to take him in to Reid Hospital in Richmond. \\nNone of them were prepared for what would happen next. \\nThey learned that the frenulum on the baby’s upper lip was torn. The medical records describe the “abrasion” as “small” and “superficial,” and they note that 2 teeth were just beginning to emerge. A nurse reportedly reassured the family that she had seen injuries like this, from teething or fussy babies moving their heads back and forth on the bed with a pacifier in their mouth. \\nWhat the family didn’t realize was that the state of Indiana has a policy that a report must be filed with the Department of Child Services any time that there is an injury of any kind to a child’s face or head: \\nChild Protective Services was, indeed, called, and social worker Amy Benton came to the hospital. When Laura began crying, her mother Jamie says that she walked her outside to get some air while Dylan held the baby. X-Rays and Hospital Chaos \\nOn their way out, Jamie overheard 2 nurses in the hallway discussing another case in horrified whispers. There was allegedly another baby boy at the hospital the same age as Jackson, and the nurses were shocked at the bruises and multiple broken bones in the baby. \\nShortly after that time, the emergency room doctor, Dr. Jamie Brummett, ordered a full skeletal survey for Jackson. This is the typical protocol when child abuse is suspected. The family thought that it was only going to be one or two x-rays. \\nJamie describes the atmosphere at the hospital that night as “chaotic.” Dylan reports that he took his son into the room for the x-rays. He noticed that there were already 2 sets of x-rays hanging up in the room that were from someone else. It appeared to be from a child, he says. He also reports that the nurses were having problems with the machines, and had to keep re-doing the x-rays. His son’s x-rays were then printed out in the room, so by the time they left the room, there were x-rays from 2 different people in the room. Dylan Day and baby – Easter photo used by permission from the family. Another Case of a Doctor’s Accusations Being Taken as “Truth” \\nShortly after, Dr. Brummett and the social worker met with the parents and grandparents and informed them that Jackson had multiple fractures in various stages of healing, including some ribs, and broken arms and legs. The family was stunned, and both Laura and Dylan began crying. They still don’t understand how some of the fractures were supposed to be several weeks old, but no one had seen any signs of them during any of the previous doctor visits and WIC visits. Jackson had not acted like he was in any pain, and there were no bruises on the baby. Laura says there were: \\nNone at all. That’s what makes no sense. There was never any abnormal crying, either. \\nThere was nothing that precipitated this. That’s what we couldn’t understand. There is something that is not right. I know I didn’t hurt my child, and my boyfriend didn’t hurt my child. \\nImmediately, Dylan asked for testing to be done, because osteoporosis runs in his family. His sister had been diagnosed with it as a teenager. It is also on Laura’s side of the family, and Laura’s mother has been diagnosed with osteoporosis. Those concerns were reportedly dismissed. Dr. Jamie Brummett. Should doctors have the power to put parents in jail and destroy families simply based on x-rays? Image source. \\nDr. Brummett allegedly told the social worker and the detective that the fractures were due to non-accidental injury. The family reports that, after she made that statement, the investigators never looked further or checked for any alternate explanation. Investigators reportedly had multiple theories, but all of them involved accusations of abuse: Shaken Baby Syndrome (SBS), the baby was yanked, or jerked, or maybe it was from being swaddled too tightly. Or the parents squeezed the baby. “Consistent with Non-Accidental Injury,” But Also Consistent with Other Medical Conditions \\nThe fractures were reportedly consistent with non-accidental injury, but, as Health Impact News has reported many times, multiple unexplained fractures are also consistent with numerous medical conditions, such as osteogenesis imperfecta, infantile rickets, vitamin D deficiency, Ehlers-Danlos Syndrome, and even vaccine damage. A hallmark of good medical care is careful investigation to rule out other medical conditions before accusing a parent of abuse, but all too often, that is not what parents find when they take their children to the emergency room. \\nSee related articles, including another recent story from Indiana: 5 Children Kidnapped from Family in Missouri When Baby with Low Vitamin D Found with Broken Bones \\nThere are more stories just like these, and they often read like they all came from the same script. Most involve parents who take a child to the emergency room for one thing, only to have their child be subjected to full skeletal x-rays. Someone discovered multiple fractures in various healing stages that no one ever previously suspected, and the parents have no explanation. The child is then taken from their family, and other possible medical conditions are ignored. Many of the families learn later that their child did, indeed, have some type of brittle bone or other medical condition. \\nOthers, like Laura Gellinger and Dylan Day, are never given the opportunity to find out if there is a medical condition. Once Reid Hospital’s Dr. Brummett identified the fractures as abuse, the family says that no one even entertained other possibilities. \\nLaura and Dylan were taken to the police station and interrogated late into the night. The detective reportedly believed Laura abused the baby because, even though they had occasional babysitters, she was the one with the baby most of the time. They were scared to death, with good reason. Their son was placed into foster care the next day – on Father’s Day. \\nThey didn’t have an explanation, because the young parents, who were 19 and 20 at the time, didn’t know what had happened. Experts assert that a baby with a brittle bone condition can break a bone with something as innocent as a diaper change or change of clothes. It doesn’t take much, because their bones are so fragile. They recalled an incident where a dog had jumped on the baby when he was 2 to 3 weeks old. They wondered if he could have hurt his leg on the swing. Dylan says that every possibility they came up with was rejected. Baby Jackson at his 2-month checkup. Before that night at the hospital, no one mentioned any possibility of abuse. Photo supplied by family. \\nLack of explanation for injuries is seen by the child abuse industry as being evidence of abuse, when, in some cases, it simply means that there is a medical explanation that the parents have neither the knowledge nor the experience to know, and that the doctors they turn to for help refuse to differentiate between abuse and legitimate medical conditions. Lack of explanation is seen as proof of guilt. \\nThey asked to see the x-rays, but Detective Tom Legear reportedly told them that, by law, they don’t have to show them the x-rays, and that it was up to DCS to show them the x-rays if they wanted. Laura and Dylan were never permitted to see the x-rays. \\nFor the first 2 weeks after Jackson was placed into foster care, his parents were permitted to visit him 3 times a week for 2 hour visits. During that time, DCS took Jackson to Riley Children’s Hospital in Indianapolis to be evaluated by a Child Abuse Specialist. \\nOn July 1, 2014, about a half dozen police cars came to Dylan and Laura’s home and the couple was arrested. They have not seen their baby since then. Parents not Adequately Defended in Court \\nTheir case went to court. Public defenders were appointed for Laura and Dylan, but the family does not believe that they were adequately represented. Greg Gellinger, Laura’s father, referred to the whole court system when he told Health Impact News : \\nThey’re all in cahoots with each other. The public defenders are a joke in this town. \\nHe reports that his daughter’s public defender told him and his wife that he had such a big caseload that he didn’t care whether or not Laura and Dylan did it or not. On one occasion, Laura reportedly went to see him in his office about her case, but he had a ballgame playing and paid no attention to his client. \\nTo this day, the senior Gellinger beats himself up for not being able to afford a good attorney. He feels like he let his daughter down: \\nI knew neither one of them done it. I thought we had a good case, but the public defenders didn’t do anything. \\nHe said that social worker Amy Benton approached him at the courthouse, telling him not to take it personally. Greg was incredulous: \\nWhat if it was your daughter and you knew she didn’t do it? \\nThis isn’t simply the rantings of an emotional father upset that his child was arrested. There are a number of anomalies in the way that the case was reportedly handled, which cast serious doubts on their guilt. \\nThe attorneys never obtained the x-rays or any more medical records than those that the parents already had. The family was told that they have no right to see the x-rays. To this day, there has only been one occasion that any family member has seen any x-rays, but they have no way of knowing if the x-rays are actually of Jackson’s bones. \\nThere were only a couple of x-rays used in court, but there was no name on the x-rays. Based on the experience that Dylan had in the hospital, he has no way of being assured that the x-rays he saw in court belonged to Jackson. They could easily have been mixed up with those of the other child who was in the hospital the same night. \\nThe attorney challenged the x-rays due to the lack of a name on them, but the court reportedly allowed them, simply based on the word of the doctor. Grandmother Jamie with baby Jackson. Photo courtesy of the family. \\nThe question arises: did Jackson actually have any broken bones? Laura’s mother told Health Impact News that they have never actually see any evidence that Jackson ever sustained any injuries, besides the torn frenulum, which she sees as easily explainable. \\nDetective Tom Legear allegedly told the family that the hospital ran a standard blood test to rule out a bone disease, but again, no one in the family or their attorneys has ever seen it. To the family’s knowledge, that simple test is the only test that was reportedly performed. \\nThere is another test that could be performed, but the judge reportedly decided that it would cost too much money to order that test. Social Workers Make False Statements \\nAt one point, social worker Amy Benton accused the parents of not ever taking Jackson to the doctor or vaccinating him – facts that were easily proven incorrect. She had allegedly pulled the records of a different baby with the same name. \\nAnother time, a DCS supervisor, Karen Bowen, reportedly talked about “bruises all over his body,” but, again, that was another baby, not Jackson. Medical records from the night in question clearly state that no bruising was noted. \\nAmy Benton alleged that the baby’s pacifier caused Jackson’s mouth injury, but several family members recall seeing her throw the pacifier away in the trash at the hospital. When the judge asked where it was, she reportedly said that Detective Legear had it. Neither were able to produce the pacifier. \\nBenton also allegedly told the court that the couple didn’t have adequate shelter or food or clothing. Greg and Jamie assert that this was never true, and that the detective and social worker went to the home and photographed furniture, food, diapers, and other supplies. \\nHowever, they don’t know what happened to the photos, because they were not presented in court. Their mobile home is “really nice,” according to the the Gellingers. This is just one more example of the DCF system painting an alternate picture of reality to the court, one which makes the family look much worse than they are. \\nThe family says that the detective and the judge agreed that, since Laura and Dylan were 1st time parents, they probably lost patience with their baby and hurt him, an assumption which the young parents vehemently deny. \\nThe court reportedly was never told that both sides of the family have brittle bone conditions. \\nLocal media reported that Dr. Brummett said that the baby weighed 10 lbs at 3 months, but should have weighed closer to 13 lbs. This is an error. The medical reports state that he weighed 5.56 kg on the night of June 14, which translates 12.26 lbs, not much under 13 lbs. Parent’s Coerced into Plea Bargain \\nOnce Dr. Brummett testified to the court, the court-appointed attorneys advised their clients to accept a plea deal, telling them that DCS always uses her, and once they use her, they always win. \\nIt’s a done deal. \\nLaura Gellinger and Dylan Day were originally charged with battery, but that was dropped because there was no evidence that they themselves had hurt Jackson. The occasional babysitters allowed for the possibility that someone other than the parents hurt the baby. \\nThere was a charge for neglect of a dependent for failure to get medical treatment, but because they took him to the E.R., that charge was dropped. \\nHowever, Laura and Dylan report that they felt bullied into accepting the charge of neglect of a dependent resulting in serious bodily injury, alleging their responsibility for his being hurt in their care. That was the plea bargain. They were sentenced to 10 years in prison, with 5 suspended, and 3 of those years as probation. Laura Gellinger and her adoring baby before the accusation of child abuse. Photo courtesy of the family. Other Prisoners Believe in Laura’s Innocence \\nThey are currently on probation after each served 2 years in prison. Laura was released on April 1, and Dylan came home on May 7. \\nLaura spent the first 13 months of jail in solitary confinement as protective custody. She went into the general population after requesting to be removed from solitary confinement, and, as feared, she was initially harassed and bullied. She reports that they “laid off” harassing her after she let other prisoners see the evidence. They could see that something wasn’t right. She says that her bunkmate was in tears after reading the medical reports: \\nYou don’t belong here. \\nLaura recalls that the other prisoners once called her to the TV because the Dr. Phil show was covering a story that was very similar to hers. In early March, just before Laura’s release, Dr. Phil aired his coverage of Marty Coleman’s case – a brittle bones story that Health Impact News first brought to public attention after local media inaccurately painted the mother out to be a monster. \\nSee story: \\nLaura’s bunkmate crocheted a scarf for Jackson, but Laura has not had an opportunity to give it to him. She doesn’t know if that will ever happen. Home Now, Hoping for a Miracle \\nBoth Dylan and Laura are home now, and they are still together. Their parental rights to their son have been terminated. They tried to appeal the TPR decision, but report that the request was denied because they still have no explanation for how the injuries occurred. \\nThey have been told that their son is being adopted out and that papers could arrive in the mail at any time. Laura recently contacted us, saying: \\nI have been searching and searching to find a doctor or someone to please help me prove my innocence and get my child back … Please help! \\nThey haven’t seen their son since he was 3 months old. The grandparents have been completely cut off as well from their grandson. The only hope they can see of reversing the decisions that have been made is for them to take their case to the state Supreme Court, but that would require money for an attorney, money that they don’t have. According to Laura: \\nI’ve lost my child. I’ve lost 2 years of my life – for something I didn’t do. \\nThe Governor of Indiana is Vice-President-elect Mike Pence. His office may be reached at 317-232-4567. He can be contacted here , and his Facebook page is here . \\nSenator Jeff Raatz may be reached at 317-232-9400, or contacted here . \\nRepresentative Richard “Dick” Hamm may be reached at 317-232-9769, or contacted here . \\nComment on this article at MedicalKidnap.com. Support the cause of Medical Kidnapping by purchasing our new book! If you know people who are skeptical and cannot believe that medical kidnapping happens in the U.S. today, this is the book for them! Backed with solid references and real life examples, they will not be able to deny the plain evidence before them, and will become better educated on this topic that is destroying the American family. 1 Book – 228 pages'"}, "time": 1742561722.2991295}