{"duration": 0.028875112533569336, "input_args": {"text": "'\\nSean Brown AMERICA’S FREEDOM FIGHTERS – \\nWikileaks has revealed some rather troubling things about Hillary Clinton and her staffers, but perhaps the most disturbing, a bizarre, is the fact that John Podesta is involved with satanic rituals. \\nNo, this isn’t fiction and I’m not wearing tin foil on my head. An email released by Wikileaks reveals Podesta was invited to a “spirit cooking dinner” by performance artist Marina Abramovic, and you can rest assured that it’s not anything like it sounds. \\n“I am so looking forward to the Spirit Cooking dinner at my place. Do you think you will be able to let me know if your brother is joining? All my love, Marina,” an email dated June 28, 2015 read. \\nShortly after, the emails, which was sent to Podesta’s brother Tony, was forwarded to john with the message, “Are you in NYC Thursday July 9 Marina wants you to come to dinner.” \\nNow you’re probably wondering what all the fuss is about, and I seriously can’t blame you. So let’s turn to Paul Joseph Watson from InfoWars for a little background on what this “spirit cooking” is really all about. \\nSpirit cooking refers to “a sacrament in the religion of Thelema which was founded by Aleister Crowley” and involves an occult performance during which menstrual blood, breast milk, urine and sperm are used to create a “painting”. \\nAccording to Marina Abramovic, if the ritual is performed in an art gallery, it is merely art, but if the ritual is performed privately, then it represents an intimate spiritual ceremony. \\nThe video embedded above depicts the bizarre nature of the ceremony. Abramovic mixes together thickly congealed blood as the “recipe” for the “painting,” which is comprised of the words, “With a sharp knife cut deeply into the middle finger of your left hand eat the pain.” \\nThe ceremony is, “meant to symbolize the union between the microcosm, Man, and the macrocosm, the Divine, which is a representation of one of the prime maxims in Hermeticism “As Above, So Below.” \\nBelow is a video of Abramovic conducting the satanic ritual: \\nHow creepy. Even creepier is the same woman holding a bloody goat’s head – a representation of the Satanist symbol Baphomet. The Podestas\\'\"Spirit Cooking\" dinner?It\\'s not what you think.It\\'s blood, sperm and breastmilk. \\n— WikiLeaks (@wikileaks) November 4, 2016 \\nYeah… \\nIf you enjoyed this story, be sure to follow Sean Brown on Facebook , and check out his website, politicalcult.com . \\nGod Bless. '"}, "time": 1742563463.2484584}