{"duration": 0.07856869697570801, "input_args": {"text": "'Today’s questions come from the #AskAzzmador Twitter hashtag. \\nDear Azzy, \\nDo you think by Donald Trump name dropping George Soros, yet again, it will force the window of understanding for people? \\n-Zanting \\nDear Zanting, \\nIt certainly can’t hurt. Soros is already one of the most reviled people on Earth, and everything he does is absolutely emblematic of The International Jew. He is the Jew’s Jew. The Jew to whom other Jews aspire to be. \\nNo amount of sunlight on Soros is too much. Whether the person shedding said light is Jew-wise or not. Every time he and other major players in World Jewry are exposed more people sudd3nly see the pattern. And as we all know, once you’ve seen (((the pattern))), it is near impossible to ever ignore it again. \\nAzzy Q. How much more Jewy can Soros be? A. None. None more Jewy. \\nDear Azzy, \\nAsking for a friend. My friend’s sister is a slutbag. Are the muzzies on point with the family honor thing? \\n-Alt Right Capybara \\nDear Alt Right Capybara, \\nMy condolences to your friend and his family for having to suffer the humiliation and discomfort that come with having a slut in the family. For at least 40 years now sluttery has been a widespread epidemic, and has grown worse with each passing year. \\nThe causes of this plague are many. They include easy access to birth control, the breakdown of the nuclear family, the celebration of every form of degeneracy, the “free love movement” ushered in by stinky hippies who, for the most part, no one would want to have sex with unless they were out of their minds on multiple controlled substances, feminism, the loss of moral authority in our religious institutions, and many, many more reasons, which can all be vaguely but accurately summed up by saying “The Jews.” So empowered. So inspiring. Thank God we gave them the vote. \\nTo answer your question, no, the muzzies are not on point. We can’t just go around throwing acid in the faces of sluts, as much as we might feel justified in doing so. It’s bad optics, and besides, we’re White, which means that when we have problems, we solve them, instead of chimping out and burning bitches down, whether literally or figuratively. \\nWhat we have to address is the core problems with our society that causes women to become sluts in the first place. \\nThe patriarchy must be restored. When men ran things, sluts were viewed as the vile whores they truly are, and were relegated to the filthy corners of society where no one wants to be. \\nWe have to end no-fault divorce. This is just a way to let a slut-in-hiding marry some poor guy, take him to the cleaners, then slut around on his dime when she’s supposed to be raising the kids. \\nWe have to stop making sluts role models for our kids. Just look at the sluts who came out of kid’s TV programming: Britney Spears, Christina Aguilera, Miley Cyrus. I’m sure there are many more. And the news media is full of sluts. Megyn Kelly, for example. Just the role model for your little girls goyim. Buy tickets please. \\nWe have to shame these sluts for their behavior. It’s a tried and true tactic, and the proof that it works is in the shrieking and bellowing of SJW sluts when you slut-shame them. \\nAbove all else, we have to marginalize slutty behavior again. That’s the only thing that will really work. And that means we have to keep doing what we’ve been doing, which is push the Overton Window farther and farther to the right until some semblance of sanity and morality is restored to our culture, and slutty behavior is no longer rewarded. \\nAzzy \\nTo submit questions to “Dear Azzy” you can post them in the Daily Stormer Forums here , in the Twitter hashtag #AskAzzmador , or for longer or more personal questions feel free to leave me a private message.'"}, "time": 1742561997.6079674}