{"duration": 0.21289491653442383, "input_args": {"text": "'Taming the corporate media beast Interview with Top Putin Advisor Nikolai Patrushev \\nPatrushev is the Secretary of the National Security Council   Sputnik \\nIn an exclusive interview for Sputnik, Russian Security Council Secretary Nikolai Patrushev offered his assessment of the main threats facing the world, and Russia\\'s plans to deal with them. Given the Security Council\\'s status as an advisory body reporting to the president, Patrushev\\'s word is basically the Kremlin line on national security issues.The Security Council is charged with working out the president\\'s decisions on national security affairs. In this light, Sputnik asked Secretary Patrushev to lay out his views regarding the security situation in the world today, and the regions which he sees as the most problematic. \\n\"The situation in the world is not becoming any easier,\" the official admitted. \"There is a growing competition for global influence and the use of global resources.\" \\nAt the same time, Patrushev added, \"the excessive ambitions of some countries is provoking new challenges and security threats in a variety of regions around the world, and creates serious obstacles to the creation of bilateral and multilateral efforts aimed at resolving crisis situations.\" \\nMajor Threats to Russia: NATO Buildup, Terrorism, Tensions in the Korean Peninsula \\nAsked to list the main threats to Russia\\'s security, Patrushev cited first and foremost the continued buildup of NATO\\'s military capabilities, \"along with efforts to endow this organization with global functions.\" Threats to Russia include \"the spread of [NATO] military infrastructure on Russia\\'s borders, the deployment of new types of weapons, and the creation of a [US] global missile defense system.\" \\nOther threats Moscow takes seriously include the \"unprecedented threat\" of global terrorism, represented first and foremost by the Daesh (ISIL/ISIS) terrorist group. \\n\"Syria, Iraq, Libya, Yemen, Afghanistan and several other states have become the arenas in which Daesh is fought,\" the official noted. \"Since fall 2015 and on the request of the legitimate Syrian government, Russia has been actively involved in the destruction of the terrorists on the territory of the Syrian Arab Republic.\" \\nStressing the need for international cooperation on this issue, Patrushev noted that \"it is obvious that our efforts in and of themselves will be insufficient; the fight against such evils requires collective efforts uniting the entire international community. We have said this many times, and are prepared for cooperation with all interested parties.\" \\nOther areas of concern to Moscow at the moment include tensions in the Korean Peninsula, caused not only by Pyongyang\\'s actions, but by Washington\\'s response as well. \\n\"The US is using the actions of the North Korean leadership to their advantage. Under the pretext of protection against the North Korean military threat, Washington is strengthening their presence in Northeast Asia, thus further inflaming the atmosphere through the demonstration of force – by means of vigorous military exercises with Japan and South Korea, together with the desire to place elements of its global missile defense system in the region.\" \\nFinally, last but certainly not least, Patrushev noted that Russia cannot help but be concerned by the ongoing crisis in Ukraine. \"Two years ago, Ukraine joined the list of regional hotspots. Washington and Brussels actively assisted the organization of an anti-constitutional coup d\\'état in Kiev. The end result has been a smoldering civil war in the country\\'s east, which Ukrainian authorities do not want to stop, and which they sabotage by failing to fulfill their obligations.\" \\nRussia\\'s \\'Vision of Global Security\\' in Five Easy Steps \\nAsked how Russia hopes to react to this difficult and complicated global security picture, the Security Council secretary stressed that Russia is guided by a relatively straightforward \"vision of global security.\" \\n\"Its essence is simple, and includes the primacy of international law, the priority of the peaceful resolution of conflicts within the existing frameworks of international organizations, led by the United Nations, the inadmissibility of backroom agreements and unilateral actions, bloc politics, and the unacceptability of interference in the internal affairs of sovereign states.\" \\nAs far as the Security Council\\'s role is concerned, Patrushev explained that the body\\'s main task revolves around identifying challenges to national security, and promoting multilateral dialogue to finding solutions. \"Dialogue is developed within the framework of the Commonwealth of Independent States, the Collective Security Treaty Organization, the Shanghai Cooperation Organization and the BRICS. We explain to our partners our view of the current situation, engage in the exchange of information between security services, and participate in the creation of new formats and areas of work.\" \\nProud of the Security Council\\'s achievements, Patrushev explained that among its serious initiatives is the organization of an annual forum attended by senior security services representatives from other nations. \"This year, the seventh such forum took place in Chechnya; delegations from 75 states took part. A number of agreements were signed in areas including the fight against terrorism and extremist ideologies, drug trafficking, transnational crime, and threats to information security.\"All in all, the official noted, \"our main goal is to ensure Russia\\'s interests – to create the conditions for sustained economic and social development, and to strengthen sovereignty and constitutional order.\" At the same time, \"Russia has avoided and will continue to avoid any interference in the internal affairs of sovereign states. However, this does not mean that we will allow someone else to export his or her own problems to our country. Such attempts will be stopped firmly and resolutely.\" \\nRussian-US Cooperation Contingent on Only One Condition \\nIn recent months, some US officials and media have engaged in a demonization of Russia never before seen in the modern era, while putting political and military pressure on countries which are friendly to Moscow. Asked whether constructive cooperation between Russia and the United States is still possible, Patrushev stressed that the answer is still \\'yes\\', and requires only one condition to be met: mutual respect. \\nWe are ready to cooperate with our American partners on the basis of equality and mutual respect for one another\\'s interests. Right now, Russia is listed among the main threats to US national security. We cannot but be surprised by kinds of criteria Washington thinks in, when it puts Russia on a par with Daesh and Ebola in its national security strategy. \\nUnfortunately, Patrushev noted, \"when such sentiments prevail in the minds of American politicians, and when these stereotypes are projected onto ordinary citizens by the media, it is hardly possible to establish a full and comprehensive dialogue on a wide range of issues.\" \\nThe methods of defense against the supposed \\'Russian threat\\' also raise questions, according to the official. \"You mentioned the deployment of elements of missile defense on our borders. From these installations it is possible to launch cruise missiles, whose range includes many facilities of Russia\\'s strategic [nuclear] infrastructure. The US naturally denies this capability, but do not offer any real arguments.\" \\n\"Earlier, Washington stated that European missile defense was directed against Iran. In that case, a legitimate question arises: Why was the base at Deveselu, Romania commissioned after progress had been made in the Iranian case?\" \\nPatrushev stressed that broadly speaking, \"Russia proceeds from the idea that in the present international situation, isolation is equally counterproductive to attempts to isolate other players.\" \\nAccordingly, he noted that he was optimistic that eventually, things will improve. \"As the experience of recent history has shown, Russian-US relations will return to normal sooner or later; this is the case because their further degradation is contrary to the interests of both Moscow and Washington.\" \\nNATO Policy: Dusting Off the Cold War Playbook \\nNaturally, any improvement in relations will have to include a revision of NATO policy toward Russia. Asked whether the doctrinal changes approved at NATO\\'s July summit in Warsaw were a sign that the alliance has resumed its \\'tough line\\' against Moscow, Patrushev stressed that a Security Council evaluation of summit documents reached a surprising conclusion: that no major revision to NATO military doctrine has taken place; in fact, the alliance simply never renounced the doctrine it had during the Cold War period of confrontation between two superpowers. \\n\"Take a look at the kinds of terms used [by NATO]: \\'containment\\', \\'intimidation\\', \\'rollback\\'– does this language really correspond to the image of an organization with a global reach and multilateral competencies?…Such concepts are more suited to a traditional military-political bloc, whose priority is the subordination of weaker states to the will of the strongest in the interests of solving the latter\\'s problems.\" \\nUnfortunately, Patrushev noted, NATO seems to be deliberately ignoring the genuine threats to Euro-Atlantic security, while focusing on the illusory threat of Russia. This, he suggested, is epitomized by NATO\\'s Warsaw Declaration on Transatlantic Security, which lists Russia as a threat from the very first paragraph, while mentioning Daesh, which has actually carried out numerous attacks on European soil, only in the eighth, and even then only in the context of the use of AWACS reconnaissance aircraft. \\nNevertheless, \"Russia continues to use the Russia-NATO dialogue platform, and to work on bilateral agreements on the prevention of incidents on the high seas and in the air.\" Ever the optimist, Patrushev stressed that he was confident \"that with the joint efforts of the world community, it will eventually become possible to build an effective architecture of common and indivisible security, in which military and political blocs will become a useless anachronism.\" \\nSyria: Victim of Double Standards \\nFinally, asked about the Syrian crisis, and what it will take to see it peacefully resolved, Patrushev said that he views Syria as a \"victim of double standards\" in the global fight against terrorism, with Western countries and some regional powers pursuing their own interests to Syria\\'s detriment. \"The losers in this game are the Syrian people,\" the official stressed, adding that Russia considers the humanitarian aspect, including the delivery of aid supplies, to be crucial at this stage. \\nAs far as militants are concerned, Patrushev explained that \"apart from Daesh, the Nusra Front also represents a serious threat…According to UN data, more than half of the militants operating in Aleppo belong to this group. Renaming itself Jabhat Fatah al-Sham did not turn this group into \\'moderate opposition\\'. Whatever a group calls itself, if it uses terrorists methods, it has no place at the negotiating table, and must be destroyed.\" \\nNusra\\'s destruction depends on its dissociation from the so-called moderate opposition, Patrushev stressed. \"However, in spite of all the Russian-US agreements on this issue, Washington has demonstrated an inability, or perhaps an unwillingness, to fulfill its many promises.\" \\n\"Recent examples offer proof: despite the Syrian government\\'s withdrawal of its troops from Castello road, Washington-backed moderate opposition groups not only failed to take similar steps; they refused to let UN aid convoys through. We also remember how on September 17, the US mistakenly (or so they said) attacked Syrian government troops surrounded by Daesh at Deir ez-Zor.\" \\nEssentially, Patrushev suggested, Russia has been left with the unpleasant feeling that the intensive Russian-US negotiations on Syria \"were used by Washington [merely] to delay time to allow the militants to regroup. Today we see the result: more and more groups on Syrian territory which had worked with the US have merged with Nusra.\" \\nFinal Thoughts: Terrorism Doesn\\'t Respect State Borders \\nUltimately, the Russian Security Council secretary stressed that Moscow \"has not lost hope that a constructive point of view can still prevail in Washington. We are ready on the level of defense ministries to consider possible additional measures to normalize the situation in Aleppo.\" \\nMoscow is ready to cooperate in this regard, Patrushev noted, because \"terrorism has never recognized state borders. What is happening today in Syria, Iraq, Libya, Yemen and Afghanistan could be repeated in other countries tomorrow.\"'"}, "time": 1742562180.0250072}