{"duration": 0.19477391242980957, "input_args": {"text": "'CALDAS, Colombia  —   Mélida was only 9 when guerrilla fighters lured her away with the promise of food as she played on the floor. For the next seven years she was held hostage by the rebels, forced to become a child soldier. Her family thought she had died in battle. Then Mélida suddenly returned to her village at 16, carrying a pistol and a grenade. Only her grandfather recognized her  —   from a birthmark on her cheek. The very next day, the military surrounded her house, called by an informant seeking the bounty on her head. “I found out my own father had turned me in,” she recalled. Colombia is nearing a peace agreement with the rebels to end a   of fighting, one of the longest conflicts in the world. More than 220, 000 people have been killed, leaving a country bitterly divided over what role, if any, former rebels should play in society once they drop their weapons for a new, unarmed life outside the jungle. That includes thousands of rebel fighters who were raised since childhood to carry out armed struggle. Many of them know little else but war. “There are times when I think about returning to the guerrillas because this life is hard here,” said Mélida, now 20, who, like other former child soldiers, asked that her last name not be used because she fears reprisals over her links to the rebels. She is now caught between two worlds, she says, belonging to neither. “True, we were children waiting for our deaths. But I’m always thinking about returning. ” The rebels, known as the Revolutionary Armed Forces of Colombia, or FARC, say they don’t recruit children. Yet during a recent visit to a FARC camp by The New York Times, a   soldiers as young as 15 said they had been recruited by the rebels only months earlier. In government rehabilitation centers throughout Colombia, minors told similar stories of being spirited away to camps by rebels. Now they face a future for which they are thoroughly unprepared. Fabio said he was kidnapped by rebel fighters at the age of 9. By the time he was 13, he said, his commanders began sending him on solo missions to slit the throats of government soldiers as they slept. He said his own family did not look for him or inform the authorities of his abduction. “They would have been killed,” said Fabio, who is now 19. Freddy said he joined the FARC at 14 to avenge the killing of a cousin by paramilitary forces. He deserted at 16 with two dozen other soldiers. But he said his aunt, fearing reprisals from the guerrillas, told him never to return to his village. Finding a place for these former soldiers is vital to the success of any peace deal, analysts say. “If poor or botched reintegration programs fail to offer opportunities to former child combatants, Colombia’s powerful paramilitaries and trafficking groups may offer them a tempting alternative,” said Adam Isacson, a senior analyst at the Washington Office on Latin America, a human rights group. At the rebel camp, one FARC commander, who goes by the name Teófilo Panclasta, defended the use of child soldiers, saying that many joined to escape trouble at home. “If a girl comes at 15 as a prostitute and wants to join us to stop being a whore, what are we going to say?” he asked. Mélida said that when her captors came to her house along the river, they drew her attention by saying they had soup in their canoe. The guerrillas brought her up the river until they reached a distant camp. She woke up alongside several other children, each around 10 or 11. Their first lesson was hiding in trenches during bombings by the military. Mélida’s father, Moisés, a traditional healer of the Amazon’s Cubeo group, was away at the time and did not return to their village for another month. He quickly left again to find the girl. Moisés went to the guerrilla camp near the village and asked to meet the commander, a tall FARC fighter in fatigues. “I said, ‘I came for my daughter,’ ” Moisés recalled. “He said she wasn’t there. ” In the camp, Mélida had been renamed Marisol and began her schooling. A Dutch woman who had joined the fighters and spoke broken Spanish taught lessons on the history of communism, the FARC and Darwin’s theory of evolution, something Mélida had never learned in her indigenous village. Mélida was also learning to make land mines. One “looked like a fish” and was triggered with a tripwire made of string, she said. Another was called the “quiebrapatas,” or the “” because it maimed rather than killed its victim. “I said, ‘I want to go home,’ ” she remembered saying. “But they told me, ‘Once you enter a camp, you cannot leave.’ ” Mélida said she saw the fate of runaway fighters firsthand. Once, a    and his    sister disappeared before dawn and soon found themselves trapped on the edge of a muddy river. They had not learned to swim. Mélida joined the search for them. When the pair were found, they were shot dead. “First the brother, then the sister,” Mélida recalled. She remembered feeling no remorse that day. “I said to myself, ‘Yes  —   yes they should be killed.’ ” She was 12 years old. Years after she was kidnapped, FARC rebels passed through her village and mentioned Mélida to her family. “They said she had died in an attack,” her father recalled. “After that, I just forgot about her. I thought it was best to forget. ” In reality, a commander in his 40s had taken an interest in her. At first, he followed her around the camp. Then one day, when she was 15, he asked her to wash his clothes in his tent. “Give me a kiss,” she recalled him saying. “I don’t know how,” she said. “Then I’ll teach you,” the commander said. She was later given a birth control implant in her arm and the commander forced her into a relationship, she said. “Imagine waking up next to someone who was that old when you are that young,” she said. At 16, she asked the commander if she could visit her family. She was surprised when he agreed. Carrying the pistol and the grenade, she made her way back home for what was meant to be a short reunion. The village was unrecognizable. A warship was now stationed near the dock. The home from which she had been abducted was abandoned. “I told the first person I saw that I was Mr. Moisés’ daughter, and they said I couldn’t be because that daughter was dead,” she said. Mélida says she does not know why her father turned her in to the military the next day. “He wanted me not to go back perhaps,” she said. “He wanted the best for me. ” But Moisés, sitting in his daughter’s living room on a recent afternoon, offered another explanation. “I wanted to buy a motorcycle,” he said. After a moment he added, “They never gave me the reward I was promised. ” The soldiers interrogated Mélida at one base after another, she said. What was her real name, they asked? Who were her commanders? Where were the FARC bases? After two weeks, Mélida was taken to a government rehabilitation center for indigenous youth who had left the FARC. It was on a mountainside in an alien part of the country for Mélida, who had never seen the Andes before she was captured. The center was home to about 20 other former child soldiers. Daily classes and chores, meant to adjust them to civilian life, were new to her. Other requirements, like another birth control implant, reminded her of the FARC. War was constantly on Mélida’s mind. “When I would get up, I would reach beside me to take my rifle and realize there wasn’t one there,” she said. Víctor Hugo Ochoa, the center’s director, said Mélida arrived angry and often threatened to run away. “It was hard to intervene,” he said. “She formed her own constellation of kids who turned on us. ” At night, Mélida began sneaking out of the center with a man named Javier, whose mother was a cook there. He was nine years older than Mélida, but the two would go out drinking and partying in a nearby town. Javier had a bad history with the rebels. In 2004, his brother, a soldier, was killed by a FARC sniper. His family never forgave the guerrillas, a tension at the heart of any peace deal. Despite this, Mélida and Javier realized they were falling in love. “Why did it have to be her?” he said. “From the people who killed my brother?” Mélida was forming another relationship  —   with her father, who began visiting to get to know her again. After turning Mélida in, Moisés now wanted a role in his daughter’s life. But even communicating was a challenge: Mélida had lost some of her fluency in Cubeo, the indigenous language they had spoken when she was a child. “She was just some young lady I didn’t know,” he said. The new ties were changing her, Mr. Ochoa said. She was getting to know her two cousins, María and Leila, themselves former FARC members who had left the center. Javier’s mother, Dora, was teaching Mélida to cook and clean, taking on a mother’s role. Dora took Mélida’s FARC history in stride. “My daughter is married to a policeman another is with a soldier,” she said. “Javier is with an  . The only thing we’re missing in this family is a paramilitary. ” One day Mélida’s birth control implant failed and she became pregnant. Dora pulled Mélida aside. “I told her, ‘Now you have something to fight for that’s not the revolution.’ ” Her daughter, Celeste, was born last year. The daily tasks of motherhood consumed Mélida for weeks. But the anger remained. “She told me she was raised for war, not to care, not to be a lover,” Javier said. “She would tell me, ‘I love you, but understand my life hasn’t been easy.’ ” One day, Javier returned to find that Mélida and the baby were gone. Days before, Mélida had mentioned returning to rebel territory to see her sister, but now Javier thought it was a ruse to return to the FARC fold. It wasn’t the case. Instead, her bus had been stopped at a checkpoint by rebels who questioned each of the passengers. “I thought they would catch me again,” said Mélida, who realized then she did not want to go back, at least not that day. Mélida’s relationship with her father remains strained. They rarely talk about her life in rebel hands. On a recent day, Mélida was recovering from a blow to her face. “She started to argue with me and I hit her,” said Moisés, looking at the ground. Recently, Mélida’s cousin Leila, the former FARC member, committed suicide. Mélida sometimes travels to visit the unmarked grave. Dora says Mélida is too strong to take her own life. But she worries Mélida might return to the guerrillas. “She is a good mother and puts her daughter first,” Dora said. “But she also tells me she is bored and doesn’t like this life. And I tell her: ‘If you want to leave, then leave. But think of the girl. Leave Celeste with me.’ ”'"}, "time": 1742562666.9127896}