{"duration": 1.4497699737548828, "input_args": {"text": "'If you were around in October of 1987 and had MTV then, you remember. You remember the camera climbing, in black and white, up a rotating pair of torn,   Levis. You remember it seeming to take in the seat of the pants  —   or seeming to let you take that in. You remember the annoying cut to a jukebox, against which leaned two pairs of legs: some lady’s in blue heels, and another in blue denim and   cowboy boots  —   a dude’s. You remember the fade from the jukebox back to the rotating body, and the camera’s revealing a man in a leather jacket and a white   with perfectly trimmed stubble, aviator sunglasses and a cross dangling from his left ear. Today, we’d call that a lot of look. (The pompadour doesn’t even arrive for another couple of shots.) But if you were around in 1987, you just called your friends and said, “Oh, my God. ” If you missed Elvis or James Dean or the Beatles, if you were immune to what they did to other people’s hormones, maybe George Michael’s “Faith” registered strongly on your superstar Richter scale. Maybe he triggered your gaydar, too. Mr. Michael, who died unexpectedly on Christmas Day, never had to say he was gay for his gayness to seem apparent and unabashed. Three years earlier, this same person could be seen hugging himself while singing into the camera as the   more freshly     blond in a   pop duo (Wham! with Andrew Ridgeley) whose sound was about as close as two white British boys could get to a black girl group from the 1960s. By 1987, Mr. Michael had become just fresh, switching personas from soft to hard, from exuberant cheerleader to butch troubadour. [ Read the obituary | Watch George Michael perform live ] Somehow, wagging his derrière and begging for sex  —   and sounding deeply soulful while he did it  —   didn’t make him a novelty act. It made him extremely famous. It was a pose he kept for about a year. By the time you saw him in 1988, swiveling through the video for “Monkey,” in suspenders and a bolero hat, he’d  . Striking a pose is one thing. Holding it is something else. There weren’t many major male pop stars who were openly gay back then. (Scarcely any are now. Elton John said he was bisexual in 1976, and officially stayed there for more than a decade. He could hold a pose.) Lots of men hinted. Lots of men messed around with masculinity, and not just the megastars. For every David Bowie or even Boy George, there was a Jermaine Stewart or a Good Question, many rungs down the fame ladder. And for reasons that make no cosmic sense, a few of those men  —   Prince, David Bowie, Prince Be of P. M. Dawn, and now Mr. Michael  —   died in 2016, a year in which dismaying ambivalence about aggressive, invasive male behavior was matched by the reinstatement of duller performances of masculinity in both our pop music and our politics. The Princes and the George Michaels seem as radical as ever. Some of the shock of seeing “Faith” for the first (or 10th) time was that, just that summer, the man in it was getting all kinds of kids in trouble for singing “I Want Your Sex” not far into the AIDS era. After that, we should have been ready for “Faith. ” But “I Want Your Sex” kept to MTV’s gender norms, in which videos objectified sexy women (in that case, the stunning Kathy Jeung). “Faith” seemed exhilaratingly dirty by those standards: Mr. Michael was objectifying himself. “Faith” isn’t as great a video as it is a song or an album. But it’s important. Its hotness gave Mr. Michael this new, macho self to work with: somewhere between leather bar opening act and the boyfriend that girls in teen comedies think they want. He seemed both dangerous and “dangerous. ” But the pleading in his voice made you take him more seriously than you would a star whose new look was “sexy Village Person. ” Mr. Michael’s artistry ensured he would never be received only as camp. He was too good. He was too rueful and needy. Under the jacket and the shades and the stubble and the hair was a human who ached. Mr. Michael had a pretty, plainly textured voice that could quickly flare outward, into regret or shame, just for a few bars, the way it does in the bridge for 1984’s “Careless Whisper,” one of those apologetic slow jams with the evergreen wisdom of a psalm. It’s clarifying to tally up all those excellent songs and discover just how many were about emotional desperation and sexual frustration (“Everything She Wants,” “Last Christmas,” “Faith,” “Father Figure,” “Hard Day,” “Hand to Mouth,” “Something to Save,” “Too Funky,” “Outside,” to name just nine). The need for both liberty and intimacy also recur. So does the urge to let go or be released, to be truly seen and to give love. You don’t always notice because Mr. Michael’s singing smooths out any psychological cracks. He was ingenious with melody. There aren’t that many pop stars with as many parts of as many songs that are as exciting to sing as George Michael has  —   bridges, verses, the fillips he adds between the chorus during a  . “Faith” isn’t just an album. It’s a complex city of modern sound: a collection of songs, yes, and a skyline, too. But the psychological always tended to be present. The church organ at the beginning of that “Faith” video is playing the chorus of Wham! ’s “Freedom. ” He sang about wanting to be free often enough to make you wonder whether he thought any freedom was ever attainable. He seemed to come to resent his fame. David Fincher’s video for another “Freedom”  —   “Freedom! ’90”  —   amounts to Mr. Michael’s changing his mind about 1987. The stars of the video are Cindy Crawford, Naomi Campbell, Christy Turlington, Tatjana Patitz and Linda Evangelista  —   supermodels  —   not Mr. Michael, who’s conspicuous by his absence yet represented by the demolition of that jukebox and the immolation of the leather jacket. He was rejecting “Faith,” and it was heretical. “Freedom! ’90” appears on “Listen Without Prejudice Vol. 1,” the album with Mr. Michael’s strongest singing. There are want, hurt, protest and artistic risk. Prince, Mr. Bowie and Michael Jackson were theatrical performers. This was the first time Mr. Michael allowed himself to sound theatrical, too. The lyrics are explicitly personal, if poetically implicit. The record rejects the perfect pop songwriting of “Faith” and replaces a lot of the danciness of that album with gospel. It holds up as a work of art as well as the previous record holds up as an achievement of commercial intelligence. Those other men who died this year  —   Mr. Bowie and Prince and Prince Be  —   also managed to do interesting stuff with race: to sing black music while white to be a   black guitarist in any genre to be a fat, bohemian rapper who sang. For all Mr. Michael did to make gayness interesting and less threatening, he might have done more to help erase a barrier between who should and should not sing soul music. In his prime, he was a relatively frictionless ambassador among the races. He didn’t cross all the way over, as Teena Marie did. He didn’t “sound black. ” He sounded like himself  —   and that was enough to land him near the top of the black music charts. “I Knew You Were Waiting for Me,” from 1987, is still the best Aretha Franklin duet. Mr. Michael’s black support was never an exploitative exhortation. It was never “Go, white boy! Go, white boy! Go!” It was: “Oh, he gets it. ” And by 2016, he wasn’t done mattering. Last spring, Key  Peele’s stoner,    comedy, “Keanu,” came and went. But there’s a running gag that’s stayed with me. It’s just three Los Angeles thugs and one uptight bureaucrat named Clarence (Keegan Michael Key) pretending to be a thug (long story a good one, though) chilling in Clarence’s minivan. To pass the time, they turn to the fake thug’s iPhone for music, and up comes George Michael’s “Freedom! ’90. ” One dude says, “That sounds kinda white. ” And Clarence begins a quick defense of his taste, studded with the   that also makes a flashy British pop star sound like a gangsta from Crenshaw. The sequence culminates with their being oblivious to the shootout in the house they’re parked in front of, belting “One More Try” like a pack of wolves baying at the moon. For about 25 minutes, “Keanu” is smarter than the bad action comedy it turns out to be. And one thing it’s brilliant about is the partial meaning of George Michael. Who knows if Mr. Michael found that annoying. Who knows if he was aware that “Keanu” existed. But the crush this movie has on him is the crush almost everybody did. At some point, Clarence takes a hit of some hot new street drug, and the first place his high takes him is dancing with Mr. Michael in the “Faith” video. He’s up where even Mr. Michael’s slowest, saddest music could take you. He’s in heaven.'"}, "time": 1742564087.2384672}