{"duration": 0.0686349868774414, "input_args": {"text": "'Print version Font Size The authorities of the city of Ekaterinburg announced the outbreak of AIDS epidemic. According to physicians, as many as 26,693 cases of HIV infection have been officially reported in the city, which accounts for 1.8% of the city population.The Sverdlovsk region of Russia is the leader in terms of the number of HIV patients. In general, the human immunodeficiency virus has affected 20 regions of Russia. Billions of rubles are allocated to struggle against the deadly virus.Interestingly, however, Ekaterinburg officials subsequently rejected the information by saying that the \"the epidemic of HIV was declared in the city by mistake.\"\"In our region, there are many penal colonies, where the rate of HIV infection is high, - first deputy head of Ekaterinburg Health Department Tatyana Savinova said. - In addition, the population coverage for HIV tests in the Sverdlovsk region makes up 23%, while in other regions, at least 15% of the population are tested for HIV.\"Ekaterinburg Mayor Yevgeny Roizman believes that the epidemic has broken out because of heroin and \"crocodile\" addict s of the 1990s.Pravda.Ru asked Director of the Federal Methodological Center for Prevention and Control of AIDS, a leading Russian scientist who devoted 20 years of his scientific activity to HIV infection problems, Vadim Pokrovsky, to comment on the situation. \"Ekaterinburg is a million-strong city, but they talk about the AIDS epidemic in such a large city in the 21st century. How can it be possible?\"\"In fact, this is a common process in all of Russia. Ekaterinburg is not the only Russian city with a high level of HIV infection incidence. There are many other cities, such as Irkutsk, Samara, Chelyabinsk, and even St. Petersburg, where one percent of the population is infected.\"The epidemic has affected the whole country, and one should say it out loud instead of putting it in a vague form. This is an epidemic .\"\"Most citizens contract the infection through the use of drugs. Yevgeny Roizman, the mayor of Ekaterinburg is known as the founder of \"City Without Drugs\" foundation. How can one solve the problem? \"The problem could be about Mr. Roizman or other narcologists, who do not recognize methods of effective prevention of HIV infection in these groups of the population. In Europe, the transmission of the HIV infection via syringe needles was stopped due to needle exchange programs and substitution therapy. This is the only method that makes it possible to stop the epidemic among drug users.\"Yet, Russian specialists believe that one should at first cure drug addiction , before proceeding to the HIV infection. All Russian drug addicts will be infected by that time, if it ever happens. It is vital to curb the HIV infection before eradicating drug addiction.\" Pravda.Ru'"}, "time": 1742564265.9056585}