{"duration": 0.13033390045166016, "input_args": {"text": "'He won six N. B. A. championships, is the greatest scorer ever and once netted 38 points while battling the flu. The logo of a   sneaker brand is a silhouette of him flying through the air. But on Twitter, Michael Jordan is a loser. For the past two years, a photograph of Jordan crying, snapped at his 2009 induction into basketball’s Hall of Fame, has been grafted onto any sports figure who has suffered humiliation or defeat. No one is seemingly safe from the Crying Jordan treatment. When the New England Patriots lost to the Denver Broncos in the N. F. L. playoffs this year, Tom Brady got Crying Jordaned. He’s joined by the University of North Carolina mascot Rameses and the Villanova band member who cried as she played the piccolo during her team’s stunning N. C. A. A. tournament defeat last year. Recently, Jordan’s cry face has transcended sports. It has graced the cracked Liberty Bell, losing Powerball numbers and that picture of Marco Rubio on a gigantic chair. When it was announced that Harriet Tubman would replace Andrew Jackson on the $20 bill, the president’s face got hit. Now you can Crying Jordan your friends: The “Crying Jordan Meme Generator” app, which serves up little Crying Jordan cutouts, has been downloaded more than 40, 000 times since its February release. The internet thrives on humiliation. Twitter is always raring for a public shaming. The Crying Jordan meme, which takes one of America’s biggest sports stars and makes him small, indulges those impulses, but it also works on another level as a corrective to online  . The meme’s hold over online culture offers clues about our ambivalent relationship to alpha males in 2016. “It takes somebody so good, so dominant  —   the crème de la crème  —   and it makes him into an international figure of epic failure,” said David Okun, a software developer who created the app. “That’s what’s so great about it. ” But the Crying Jordan meme radiates affection even as it burns. “Memes are used as a weapon,” said Limor Shifman, a lecturer at the Hebrew University of Jerusalem who studies digital culture. “But at the very same time, the weapon creates a kind of affinity between the groups that are fighting, because everybody gets the joke. ” By the way, “Michael actually thinks it’s funny,” his spokeswoman, Estee Portnoy, said. The meme pokes fun at a person’s failures, but it also turns them into an   game, one in which everyone messes up, and everyone receives the same absurd rebuke. It helps that the Crying Jordan often mercifully obscures the shamed person’s face. It’s a little like putting a   over a  . If the meme drags Michael Jordan’s image down with it, his   persona can take the hit. “It doesn’t make you feel bad, like a picture of a crying kid would,” said Courtney M. Cox, who studies the intersection of sports and technology at the University of Southern California. “He’s the greatest basketball player ever. The lowest we’ve ever seen him is crying at the Hall of Fame. ” Crying Jordan recalls other memes inspired by famous men caught in introspective moments. There is Sad Kanye, a meme based on a candid photograph of Kanye West looking dejected on a   tour, and Sad Keanu, which plays off a paparazzi photo of Keanu Reeves eating a sandwich alone. “There’s an element of flawed masculinity at play,” Ms. Shifman said. “You have a masculine star who expresses vulnerability, and people simultaneously mock and celebrate that. ” The Jordan meme can be read as straightforwardly emasculating: Watch a grown man cry. But it also works as a criticism of traditional maleness. The meme revels in the contradiction between Jordan’s legendarily aggressive persona and his   tears. The joke probably couldn’t work with any other sports star: Magic Johnson was a   passer, Tom Brady is a   but Jordan’s dominance on the court was matched only by his nerve. He came back from retirement  —   twice. And his Hall of Fame speech, in which he resurrected old feuds, extended that reputation. “Jordan is the ultimate alpha male, and this was his alpha male moment,” a columnist for ESPN  wrote after the event. Only in the snapshot does he look oddly pitiful: eyes red, shoulders slouched, cheeks shiny with tears. The meme makes fun at the guy who cried like a little girl over what a big man he was. It’s not a coincidence that the Jordan meme took off just as N. B. A. stars used the sport’s biggest stages to model humility and playfulness. Modern masculinity in basketball is Kevin Durant, the most valuable player of 2014, calling his mother “the real M. V. P. ” It’s Stephen Curry ceding the spotlight to his daughter Riley at a news conference. The meme seems to share that sense of perspective. Some iterations of the Jordan meme work as bizarre visual gags: replacing Michael Jackson on the cover of “Thriller” making up James Harden’s beard with layer upon layer of Crying Jordans. Other variations rely on sheer volume: As the Oklahoma City Thunder stumbled in the N. B. A. playoffs, every Thunder fan visible in the stands became a target. Perhaps the most technologically advanced and contextually creative Crying Jordan plays off LeBron James’s pregame ritual. When he tosses some chalk above his head, an ephemeral Crying Jordan appears, then dissipates into the air. When Jordan made a rare public appearance in April, showing up at an N. C. A. A. tournament game at his alma mater, North Carolina, the meme threatened to turn meta. Sure enough, the Tar Heels were upset and, in countless tweets, so was Jordan. “Memes, they come and they go, but this is unlike any I’ve ever seen,” Mr. Okun, the app’s creator, said. “It keeps feeling like it’s going to die, and it doesn’t. It only gets bigger. ” He added, “I hope it never stops. ” After all, the meme has helped extend Jordan’s legacy, if not exactly honor it. “I just hope that when kids say: ‘Mommy? Daddy? Who’s that crying basketball guy? ’,” Mr. Okun said. “They tell them: ‘That’s the greatest basketball player of all time. That’s Michael Jordan. ’”'"}, "time": 1742561671.0122812}