{"duration": 0.04734206199645996, "input_args": {"text": "'The Internet Movie Database (IMDb) is adding an “ ” for any film that features a female director, a female writer, sees “significant women on screen in their own right,” or passes the Bechdel test. [“The   is a great way to highlight women on screen and behind the camera,” IMDb founder and CEO Col Needham said.  The feminist rating system was first introduced by Bath Film Festival director Holly Tarquini in 2014 and has since been used by more than 40 cinemas and festivals across the United Kingdom, according to The Independent.  “The   is intended to make people talk about the representation of women on and off screen,” Tarquini said. If a film doesn’t feature a female director or writer, it can earn the special “F” designation by passing the   “Bechdel Test. ” To pass the test  —   first established in 1985 by comics writer Alison Bechdel  —   a film must feature two female characters who converse with each other about something other than a man. The new rating has been attached to worldwide blockbusters, including Kung Fu Panda 2 and The Girl on the Train, as well as older favorites like Freaky Friday, Animal Farm and Gentlemen Prefer Blondes. To date, about 21, 800 films on IMDB have the “F” rating tag. “It’s exciting when new organizations decide to join us in shining a light both on the brilliant work women are doing in film and on how far the film industry lags behind most other industries, when it comes to providing equal opportunities to women,” Tarquini said. “But our real goal is to reach the stage when the   is redundant because 50% of the stories we see on screen are told by and about film’s unfairly   half of the population  —   women. ” IMDB sees about a quarter billion page views every month. The popular film website is currently fighting a California law which requires it to agree to individual requests to remove the ages of  directors, producers, actors, and writers on the site.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562228.9674125}