{"duration": 0.05456280708312988, "input_args": {"text": "'WATCH As A Trump Advisor Has A HISSY FIT When Asked About White Supremacist Supporters By Andrew Bradford   \\nMaybe you’ve noticed that in recent weeks the people who advise and speak on behalf of the Donald Trump campaign seem to be more angry and defensive than usual. No doubt that has something to do with the fact that they realize their candidate is about to lose badly on Election Day. \\nThe perfect example of this was provided last night by Trump senior advisor AJ Delgado, who was appearing with GOP strategist Rick Wilson, who is supporting third-party candidate Evan McMullin. When host Chris Hayes mentioned Trump’s ties to white supremacists, Delgado got very agitated and said she was offended by the accusation. Hayes replied : “I just want to distinguish between two claims. If you’re a Trump supporter you’re there for a racist or white supremacist which I would never say and don’t think Rick would say. The people out there that are racist and white supremacist, they’re overwhelmingly and publicly supporting Donald Trump.” \\nDelgado yelled: “That’s not true!” \\nWilson then joined the conversation, telling Delgado: “AJ, it is true. The people on the white supremacists alt-right movement in this country flock to Donald Trump.” \\nLater in the debate, Delgado claimed that the average voter doesn’t care about Trump’s support from white supremacists such as David Duke, former Grand Wizard of the Ku Klux Klan (KKK). Wilson let Delgado have it for that comment: “This is a guy who is feeding these people with a nod and a wink every single day. A guy who constantly denigrates women, Muslims, minorities in a host of different ways. I’m not saying every person who supports Donald Trump is a racist, that’s absurd. Every racist you turn over — every time you turn over a rock and find a racist, they have a red MAGA hat on. There is not a — there’s not a coincidence here.” \\nExactly! Trump has been playing footsie with neo-Nazis, the KKK, and other white supremacist/white nationalist groups since he started his campaign. For him or anyone who supports him to now appear offended when someone makes that connection is not only disingenuous, it’s downright ludicrous. As the old saying goes, If you lie down with dogs, you wake up with fleas. \\nFeatured Image Via YouTube Screengrab About Andrew Bradford \\nAndrew Bradford is a single father who lives in Atlanta. A member of the Christian Left, he has worked in the fields of academia, journalism, and political consulting. His passions are art, music, food, and literature. He believes in equal rights and justice for all. To see what else he likes to write about, check out his blog at Deepleftfield.info. Connect'"}, "time": 1742562273.0382855}