{"duration": 0.06792497634887695, "input_args": {"text": "'Home » Headlines » World News » The Fix Is In: NBC Affiliate Accidentally Posts Election Results A Week Early: Hillary Wins Presidency 42% to Trump’s 40% \\nNBC affiliate WRCB TV in Chattanooga, Tennessee has inadvertently posted election night results exactly 1 week early. It appears The Fix Is In: \\n\\nFrom Mac Slavo, SHTFPlan : \\nNBC affiliate WRCB TV in Chattanooga, Tennessee has inadvertently posted election night results. The results page appears to be similar to what mainstream news networks display on election night, including Presidential and Congressional results, the popular vote count, electoral votes, and percentage of precincts reporting. \\nThe page, a screen shot of which has been sourced from internet archive site The Wayback Machine , is posted below and shows totals for the upcoming Presidential race. It announces Hillary Clinton as the winner. \\nAs Jim Stone notes, the page was pulled directly from the WorldNow.com content management platform utilized by major networks like NBC, CBS, ABC and Fox and appears to be a non-public staging area for news and election results. \\nThe original page has since been reset. \\n( Click here for full size image ) \\nThough the results information appears on an FTP server at WorldNow.com, media companies like NBC’s WRCB TV utilize the platform, also know as “Frankly,” to power their news content. This can be verified directly a the WRCB web site by scrolling to the very bottom of the page footer which notes that it is, “Powered By Frankly.” \\nIn addition to national results, Jim Stone has identified another page at the WorldNow.com FTP server that appears to show the State-By-State Presidential election results. This page is also accessible in archive format at WayBack Machine with a line by line breakdown available at Stone’s website. \\nOf interest is that the State-By-State results indicate a Hillary Clinton win in states like Texas (42% to 40%), Florida (44% to 40%) and Pennsylvania (44% to 40%) which have all been identified as states Clinton must steal to win the election . \\nDo these latest election “results” confirm that the fix is in and the vote is rigged? \\nIf so, then we are no longer looking at an election where our votes will count, but rather, a selection where the winner is determined by those who count the votes.'"}, "time": 1742564622.6174326}