{"duration": 0.06367897987365723, "input_args": {"text": "'A resolution on Jerusalem that will fuel anti-Jewish incitement and violence. October 31, 2016 Joseph Puder \\nIf anyone doubted the fact that the United Nations agencies harbored a deep-seated anti-Israel and anti-Jewish animus, the United Nations Educational Scientific and Cultural Organization (UNESCO) vote on Jerusalem proved it. The UNESCO World Heritage Committee voted this week (October 26, 2016) on a resolution dealing with Jerusalem, drafted by the Palestinian and Jordanian delegations, and submitted by Kuwait, Lebanon and Tunisia (all Arab Muslim states). The Executive Committee of UNESCO approved (10 for, 2 opposed, 8 abstained, and 1 missing) the resolution that was already voted on earlier this month in which 24 member-states approved the resolution; (Algeria, Bangladesh, Brazil, Cuba, Chad, Dominican Republic, Egypt, Iran, Lebanon, Malaysia, Morocco, Mauritius, Mexico, Mozambique, Nicaragua, Nigeria, Oman, Pakistan, Qatar, Russia, Senegal, South Africa, Sudan and Vietnam) 6 opposed (Estonia, Germany, Lithuania, The Netherlands, UK, and the U.S.). Among the abstaining 26 states were Argentina, France, Greece, India, Japan, Kenya, South Korea, Spain, Sri Lanka and Sweden. \\nThe resolution “deeply decries the continuous Israeli aggressions against civilians including Islamic religious figures and priests, decries the forceful entering into the different mosques and historic buildings, and into Muslim holy sites by Israelis, including employees of “the so-called ‘Israeli Antiquities.’” Israel is urged to “end these aggressions and abuses which inflame the tension on the ground and between faiths.” \\nAccording to Hillel Neuer, executive director of UN Watch, a Geneva-based watchdog organization, the resolution, which is likely to be adopted, “Dangerously risks fueling anti-Jewish incitement and violence, and legitimizing the escalating Palestinian denial of Jewish and cultural rights.” Neuer added that, “This inflammatory narrative, praised last week by Hamas, rewards the past year’s relentless Palestinian stabbing and shooting attacks in Jerusalem and other parts of Israel, which we mustn’t forget, began with false claims that Israel was planning to damage the holy Muslim Shrines.” \\nThe expected resolution mentions eleven times “Al-Haram Al-Sharif,” (the Muslim designation) to what Jews call Har Ha’bayit, the holiest shrine in Judaism (where the Temple of Solomon stood) and also known as Temple Mount. With the Islamic bloc controlling the largest voting bloc in the UN, it is no wonder that a resolution of this kind can be approved. (OIC- Organization of Islamic Cooperation, being the largest and most influential bloc at the UN, it might as well declare that the earth is flat, and it will garner a majority vote at the General Assembly or its other UN constituent agencies.) What this resolution effectively does to Jerusalem is to Islamize sites historically belonging to other faiths. \\nThe latest draft does not describe the Western Wall as the most hallowed remains of the Jewish Holy Temple destroyed by the Romans in 70CE, but as “The Western Wall of Al Aqsa Mosque, in a blatant effort to erase the Jewish heritage and biblical truth, and as part of a campaign to Islamize the site. It shamelessly disregards the fact that Jewish worshippers have prayed at the Wall for over two thousand years. The language of the draft resolution continues the deliberate attempt by the Palestinian Authority (PA) to deny the Jewish historical connection to the Land of Israel in general and to Jerusalem in particular. Mahmoud Abbas has continued on the path of denial that Arafat initiated at Camp David. \\nAmong the charges brought up by the PA and the other Arab-Muslim states for undertaking the resolution is that the Jerusalem light rail, which is used daily by thousands of Arab residents of Jerusalem, is having a “damaging effect on the “visual integrity” and the “authentic character” of the walls of the Old City of Jerusalem. Yet the rail tracks pass through an existing highway and facilitates effective transportation for visitors of all faiths. \\nPreceding the shameless resolution and the vote that took place in the Paris headquarters of UNESCO, Israel’s president, Reuven Rivlin stated at an event in his Jerusalem residence, “No forum or body in the world can come and deny the connection between the Jewish people, the Land of Israel and Jerusalem – and any such body that does so simply embarrasses itself. We can understand criticism, but you cannot change history.” \\nUNESCO’s Director General, Irina Bokova and the Chairman of UNESCO’s Executive Board, Michael Worbs, expressed displeasure and apologized for the resolution. In an interview with Israeli TV Channel 10 on October 14, 2016 (the day following the vote), Worbs said he hoped that the Board’s Tuesday meeting will be delayed in order to reach consensus on the resolution before a formal vote. Bokova, on her part, expressed her dismay at the resolution, saying that efforts to deny history and the City’s (Jerusalem) complex multi-faith character, harms UNESCO. \\nEarlier, in July, 2016 Bokova stated that, “The heritage of Jerusalem is indivisible, and each of its communities have a right to the explicit recognition of their history and relationship with the city. To deny or conceal any of the Jewish, Christian or Muslim traditions undermines the integrity of the site, and runs counter to the reasons that justified its inscription in 1981 as a “World Heritage site.” \\nUNESCO can be counted as one of the most anti-Israel UN agencies. In the course of a typical year, the organization’s legislative bodies will condemn Israel 10 or more times, with no criticism aimed at any other country in the world. In 2009 for example, UNESCO adopted 10 anti-Israel decisions , eight at the 181 st and 182 nd sessions of the Executive Board, and two at the 35 th session of the General Conference. Again in 2010, UNESCO adopted 10 anti-Israel decisions at the 184 th and 185 th sessions of the Executive Board. In 2011, UNESCO again adopted 10 anti-Israel decisions at the 186 th and 187 th sessions of the Executive Board and two resolutions against Israel at the 36 th session of the General Conference. \\nWhereas Jerusalem was King David’s capital and continued to be the capital of the Second Jewish Commonwealth, as well as Israel’s capital today, it was never the capital of any Arab or Muslim empire, Caliphate, or entity, nor was Jerusalem a spiritual center that Muslims yearned for. The Umayyad Caliphate had its capital in Damascus. The Abbasside Caliphate capital was Baghdad, and the Ottoman Empire’s (Caliphate) capital was Constantinople. Ramle, a small town in Israel, was its administrative capital in Palestine - not Jerusalem. A Palestinian state never existed as an independent entity, and the PA claims on Jerusalem are strictly contrarian – to deny Jerusalem as the heart of Jewish spirituality and yearning. Jerusalem exists in every Jewish prayer, and is invoked on every occasion and holiday. \\nDore Gold, former Director General of Israel’s Foreign Ministry, addressed last year’s UNESCO’s Jerusalem resolution. He pointed out that the resolution “glossed over any Jewish connection to Jerusalem, and it failed to acknowledge Christianity’s ties to Jerusalem.” \\nMost dismaying is the fact that Christian nations who voted for the resolution or abstained, have abandoned all vestiges of pride and honor, and are willing to deny historical truth for narrow political interests. Brazil, Mexico, and the Dominican Republic, predominantly Catholic states, are a case in point. Unfortunately other Christian countries including France, Spain, Greece, Argentina, and Sweden, who should know about Jerusalem from their church bibles, did not have the courage to reject this outrageously false resolution. It can only lead to the conclusion that perhaps cowardice and latent anti-Semitism drove their decision to accept, not reject this infamous resolution.'"}, "time": 1742628475.4661384}