{"duration": 0.054585933685302734, "input_args": {"text": "'Televisión Ana Rosa Quintana logra resolver un crimen antes que la Policía Nacional y que Susanna Griso EN LO QUE VA DE AÑO LA REINA DE LAS MAÑANAS YA HA CERRADO MÁS DEL DOBLE DE CASOS QUE LA POLICÍA televisión \\nTras semanas recolectando pruebas, realizando seguimientos y rastreando indicios hasta dar con los culpables de un crimen, Ana Rosa Quintana ha anunciado esta mañana que su programa conoce la identidad de los culpables, que los entrevistará a lo largo de esta misma semana y que posteriormente los entregará a la policía. “Y cuando salgan de la cárcel engrosarán la plantilla de colaboradores del programa”, ha anunciado Quintana. \\n“Les van a caer treinta años, en mi programa”, asegura la presentadora. \\nEste nuevo logro de Quintana vuelve a situarla por delante de Susanna Griso, de Antena 3, en número de investigaciones cerradas en lo que va de año. La intensa competencia que mantienen estas dos periodistas cada mañana por resolver los crímenes más violentos del territorio nacional ha hecho que las dos presentadoras superen desde hace tiempo a los cuerpos de seguridad del Estado en número de detenciones. \\n“Yo tengo mi propio procedimiento, si tengo que apretarle las tuercas a un menda, se las aprieto, pero hay que limpiar las callees”, ha explicado Ana Rosa en su programa matinal justificando sus métodos poco ortodoxos para interrogar a los sospechosos. En lo que va de año, la reina de las mañanas ya ha cerrado más del doble de casos que la Policía Nacional. \\n“Va por libre y a veces no sigue el reglamento pero, maldita sea, es la mejor”, reconoce Ignacio Cosidó, Director General de la Policía. \\nDesde Telecinco han admitido que Ana Rosa suele respetar poco el reglamento de la cadena porque “se involucra a nivel personal” en cada crimen. Hasta en cinco ocasiones Paolo Vasile, director de Telecinco, le ha pedido que se apartara de algún caso porque estaba demasiado implicada. Según las fuentes, en esas ocasiones Ana Rosa responde de forma violenta arrojando la tarjeta del comedor de Telecinco y prometiendo atrapar al culpable “antes de que acabe la publicidad”. \\nPor su parte, fuentes de Antena 3 explican que Susanna Griso tiene una forma de proceder más sutil, aunque no por ello menos efectiva. “Ana Rosa se recorre los peores tugurios de la ciudad mientras fuma y bebe golpeando a la gente para sacarles información, Griso es más metódica, es una investigadora más tipo CSI, se sienta en el plató y trata de juntar todas las piezas en su mente”, explica un experto en criminología. \\nAdemás de rivalizar en resolver crímenes, las dos presentadoras también rivalizan a la hora de juzgar a los detenidos siendo ellas las encargadas de establecer las penas y las condenas de los acusados. \\n“Es tantísimo el trabajo que realizan que en la policía tememos que empiecen a cometer los crímenes ellas mismas para resolverlos más rápido”, admite Cosidó.'"}, "time": 1742564319.403349}