{"duration": 0.06302762031555176, "input_args": {"text": "'LONDON  —   In a deeply embarrassing episode revealed on Sunday, a senior employee of the Israeli Embassy in Britain was recorded plotting to “take down” senior British politicians critical of Israel and calling Foreign Secretary Boris Johnson “an idiot” who “has become minister of foreign affairs without any responsibilities. ” The Israeli ambassador, Mark Regev, offered a formal apology on Friday, according to a statement from the Israeli Embassy. The embassy also said that the employee, Shai Masot, who described himself as a former major in the Israeli Army now working as a political officer, would soon leave his job. Mr. Masot made the comment in October, in footage filmed in a London restaurant and obtained by the newspaper The Mail on Sunday. The recording was made by an Al Jazeera reporter acting undercover, who called himself Robin and who described himself as working for a political group called Labour Friends of Israel, which rejected any connection to him. The conversation involved Mr. Masot and Maria Strizzolo, an aide to Robert Halfon, an education minister and former political director of Conservative Friends of Israel. Mr. Masot was particularly eager to target Alan Duncan, a minister in the Foreign Office who has been critical of Israel and its settlements in occupied Palestinian territory, a sensitive issue in British politics. Mr. Duncan, he said, “is causing a lot of problems. ” In the footage, Mr. Masot asked Ms. Strizzolo, “Can I give you some M. P. s that I would suggest you would take down?” he asked. He went on to say that she knew which M. P. s  —   members of Parliament  —   he was referring to. She asked him to remind her. “The deputy foreign minister,” he said, referring to Mr. Duncan. She said, “You still want to go for it?” His reply was ambiguous, but he said that Mr. Duncan was still causing problems. Ms. Strizzolo then asked, “I thought we had, you know, neutralized him just a little bit, no?” Mr. Masot answered, “No. ” Mr. Masot also mocked the opposition Labour leader, Jeremy Corbyn, whom he called “crazy,” and his “weirdo” supporters. Ms. Strizzolo told the newspaper that her conversation with Mr. Masot was “   and gossipy. ” But Crispin Blunt, a member of Parliament and the chairman of the Select Committee on Foreign Affairs, said the “apparent activity of a diplomat of a foreign state,” in reference to Mr. Masot, was “formally outrageous and deserving of investigation. ” (In the video, Mr. Masot was also very critical of Mr. Blunt.) Stuart Polak, a member of the House of Lords and the director of Conservative Friends of Israel, said, “We utterly condemn any attempt to undermine Sir Alan, or any minister, or any member of Parliament. ” In its statement, the Israeli Embassy said it “rejects the remarks concerning Minister Duncan, which are completely unacceptable” and described Mr. Masot as “a junior embassy employee who is not an Israeli diplomat, and who will be ending his term of employment with the embassy shortly. ” Mr. Regev, the statement said, spoke to Mr. Duncan on Friday to apologize “and made clear that the embassy considered the remarks to be completely unacceptable. ” Reached on Sunday, Yiftah Curiel, the embassy spokesman, said that Mr. Masot was “not a diplomat and not a   member of diplomatic corps  —   he’s an assistant to the deputy ambassador, who handles parliamentary affairs. ” Mr. Masot, sent from Israel, has been at the embassy for about a year, on a contract that is being terminated. Mr. Curiel emphasized that the Foreign Office judged the issue concluded. “The Israeli ambassador has apologized and is clear these comments do not reflect the views of the embassy or government of Israel,” a Foreign Office spokesman said in a statement. “The U. K. has a strong relationship with Israel, and we consider the matter closed. ”'"}, "time": 1742561857.4611728}