{"duration": 0.052613019943237305, "input_args": {"text": "'NTEB Ads Privacy Policy NOT OVER: FBI To Conduct New Investigation Of Emails From Clinton’s Private Illegal Server In a letter to congressional leaders, Comey said that the FBI had, in connection with an “unrelated case,” recently “learned of the existence of emails that appear to be pertinent to the Clinton investigation.” by Geoffrey Grider October 28, 2016 The FBI will investigate whether additional classified material is contained in emails sent using Hillary Clinton’s private email server while she was secretary of state, FBI Director James Comey informed congressional leaders Friday. \\nEDITOR’S NOTE: It’s a sad, sad, day in America when the first and only woman from one of our two political parties to run for president is being investigated by the FBI for leaking classified information through her private and illegal email server. Crooked Hillary has bragged about “making history” and she’s right, this is truly an historic event, albeit one that belongs in the Hall of Shame. \\nThe announcement appears to restart the FBI’s probe of Clinton’s server, less than two weeks before the presidential election, an explosive development that could shape the campaign’s final days. MSNBC: FBI re-opening investigation into Hillary Clinton’s use of a private email server Donald Trump announces FBI reopening Hillary Clinton case: \\nIn a letter to congressional leaders , Comey said that the FBI had, in connection with an “unrelated case,” recently “learned of the existence of emails that appear to be pertinent to the Clinton investigation.” Breaking news: FBI reopening Hillary email case \\nComey indicated that he had been briefed on the new material yesterday. “I agreed that the FBI should take appropriate investigative steps designed to allow investigators to review these emails to determine whether they contain classified information, as well as to assess their importance to our investigation,” he wrote. CNN: Clinton team ‘stunned’ by FBI re-opening email investigation, didn’t know until plane landed \\nT he FBI had previously closed its investigation in July with no charges, though Comey had concluded there had been classified content exchanged on the server and that Clinton had been “extremely careless.” source SHARE THIS ARTICLE Geoffrey Grider NTEB is run by end times author and editor-in-chief Geoffrey Grider. Geoffrey runs a successful web design company, and is a full-time minister of the gospel of the Lord Jesus Christ. In addition to running NOW THE END BEGINS, he has a dynamic street preaching outreach and tract ministry team in Saint Augustine, FL. NTEB #TRENDING'"}, "time": 1742561713.8845558}