{"duration": 0.06243395805358887, "input_args": {"text": "'Print \\nWho knew The Donald had those kinds of magical powers? \\nMainstream media bias took a bizarre turn Tuesday when the pro-Hillary New York Times published a report that Donald Trump is now invading the dreams of Muslim children. To illustrate that point, author Samantha Schmidt used anecdotal evidence of a child who said she had a scary dream involving the GOP nominee. \\nSchmidt wrote: \\nBilal Elcharfa was pouring cereal for his children before school this month when his 7-year-old daughter, Maaria, walked into the kitchen, calling for him. \\n“Baba, I had a scary dream,” she said, hugging him tight. “About Donald Trump .” \\nIt was the morning after the second presidential debate, which the Elcharfa family’s two youngest daughters watched in the basement of their Staten Island home with their parents. In the middle of the night, Maaria went to her parents’ room twice, unable to sleep, and walked to the living room and checked her family’s security camera. \\nThat morning, Mr. Elcharfa, 52, asked his daughter what she saw in the nightmare. \\n“He was so mean to us,” she said. “He had a scary face, like a zombie or something.” In the dream, Maaria later said, Mr. Trump came to the home of every Muslim family in the country and put each one in jail. \\n“Many Muslim parents fear that the tensions could push their children away from the faith entirely. “We don’t know how to handle it sometimes,” Elcharfa is further quoted. “Maybe someday they won’t believe in anything,” Schmidt added. \\nBut how is this Trump’s fault? Isn’t it the parents’ job to raise their children? \\nA post at the American Thinker observed: \\nHere we have an article blaming Donald Trump for terrorizing children for something he has never said or even intimated. He doesn’t want to put all Muslims in jail; he just wants to reduce immigration from countries that are un-vettable in the Middle East. One does not translate into the other. \\nBut that assumes one deals in facts, logic, and reason. As we’ve seen this election season, the so-called “mainstream media,” known here as the Democrat-media complex, have decided to toss facts, logic and reason out the window in a concerted effort to elect Democrat Hillary Clinton, perhaps the most evil person ever nominated to the White House by a major party, by any means necessary — even using propaganda the likes of which would make Josef Goebbels smile. \\nThere’s no question — if Democrats nominated Satan, the media would worship him and call you a bigot for opposing him. \\nRelated Articles'"}, "time": 1742563698.043854}