{"duration": 1.7275655269622803, "input_args": {"text": "'Linda Sarsour is a principal organizer for Woman’s March on Washington following President Donald Trump’s inauguration. [Her rise to liberal stardom following the march has occurred in spite of her support for   views and outrageous attacks on   women leaders.  Sarsour, who serves as the executive director of the Arab American Association of New York (AAANY) and who was honored by   Obama’s White House as a “champion of change,” seems as if she makes it a point to attach herself to every social justice cause known to man and tie it to Palestine. For example, in November, she attached herself to the cause of blocking Dakota Access Pipeline and made sure to bring her Palestinian flag. This shameless promotion could also be seen at the Women’s March as well. When addressing the crowd, she made sure to inject some Palestinian solidarity into the cause, stating “you can count on [her] your Palestinian Muslim sister to keep her voice loud. ” She also made sure to note that she was her “Palestinian grandmother’s who lives in occupied territory wildest dream. ” However, her biggest splash that weekend was when the level of her hypocrisy towards the cause espoused by the Woman’s March was pointed out to the public. Specifically, a tweet of Sarsour’s dismissing the misogynistic views of Saudi Arabia simply because the country has a paid maternity leave program, has been making the rounds on social media. Sarsour dismisses the fact that women in Saudi Arabia are treated as   citizens who are unable to drive, interact with men, and dress as they please as inconsequential. In addition to her dismissal of Saudi subjugation of women, she has attacked a documentary calling attention to the plight of women in the Islamic world. Sarsour has been a vocal critic of the executive producer of the film, Ayaan Hirsi Ali, a former Dutch Parliamentarian,   and vocal critic of Islam who was also the victim of female genital mutilation. In 2011, Sarsour took to twitter and vulgarly berated Hirsi Ali and ACT for America founder, Brigitte Gabriel, and said, “I wish I could take their vaginas away  —   they don’t deserve to be women. ” This is especially in vulgar considering the suffering Hirsi Ali has endured. Shortly after the tweet was uncovered, instead of owning up to the vulgar tweet and apologizing, she tried to delete it before it was seen by too many people.  Sarsour also has a long history of criticizing Israel in ways that cross the line into   and terrorist sympathizing. She supports the discriminatory and   BDS Movement and has claimed that “nothing is creepier” than Zionism. She called for solidarity with Muhammad Allan, a member of the terrorist group Palestinian Islamic Jihad who has a history of recruiting suicide bombers. After her hypocrisy towards Woman’s issue’s was exposed, she defended herself by describing attacks on her as fascist, claiming “Fascism is here” and that “[w]e cannot allow them to criminalize our leaders and movements using baseless claims  …     Remember, we are and can be the true #NeverAgain generation. ” She describes those supporting her as her “Love Army. ” To them, legitimate criticisms of both her views and her associations ring hollow. Groups that sponsored the march  —   including the official twitter account of Woman’s March, Human Rights Watch, Black Lives Matter, Amnesty International, and the Southern Poverty Law Center  —   have launched a full scale defense of Sarsour. The hashtag #IMarchWithLinda trended on Twitter. Cable news personality Sally Kohn issued several tweets defending Sarsour, including calls for people to donate to the AAANY. I don’t think Kohn is aware that the AAANY used to receive financial support from Qatar Foundation International, an organization closely linked to the Qatari government. Additionally, because of her ties to New York Mayor Bill de Blasio, the AAANY was able to secure $500, 000 in funding for the AAANY. Sarsour also received several celebrity endorsements from, among others, Susan Sarandon, Mark Ruffalo, and Russell Simmons. Hey, if Mark Ruffalo likes her she must be good, right? While personal attestations are nice, they are not proof that someone’s even a good person. Even terrible people can find someone who thinks they’re nice. Those supporting her do not care that she promotes terrorists they don’t care that she vulgarly called for a victim of female genital mutilation to have her genitalia removed and they are not concerned that she downplays misogyny in Saudi Arabia. As far as they’re concerned, she helped set up a March so therefore she’s the bees knees. Sarsour is seen as a rising star in leftist circles and the Democratic Party.   The left needs to take the blinders off and take a long, hard look at the people they’re propping up as role models. Alex VanNess is the director of the Middle East Peace  Security Project at The Center for Security Policy.'"}, "time": 1742563779.1629488}