{"duration": 0.0770878791809082, "input_args": {"text": "'WASHINGTON, DC  —   Political Islam, focused on establishing an unfree society ruled by strict sharia law, is “fundamentally incompatible” with the U. S. Constitution and the overall “foundation of the American way of life,” declared Ayaan Hirsi Ali, an expert at the Hoover Institution think tank, during a Senate panel hearing. [Meanwhile, Michael Leiter, the former director of the U. S. National Counterterrorism Center, argued that sharia law is compatible with the American Constitution.  “Muslim’s honoring of Sharia is not inherently in tangent with living in constitutional democracies anymore than it would be for Christians or Jews who also seek to honor their religious traditions while still complying with civil authority,” testified Leiter. The     Ali  —   an honor violence victim, a strong advocate against female genital mutilation (FGM) and author  —   strongly disagreed. During a hearing on Islamic ideology and terror held by the Senate Homeland Security and Government Affairs Committee Wednesday, Ali testified alongside the former U. S. official who served under Presidents George W. Bush and Barack Obama. “My central argument is that political Islam implies a constitutional order fundamentally incompatible with the US Constitution and with the ‘constitution of liberty’ that is the foundation of the American way of life,” proclaimed Ali in her written testimony. She later stressed, “Let it be said explicitly: the Islamists’ program is fundamentally incompatible with the US Constitution, religious tolerance, the equality of men and women, the tolerance of different sexual orientations, the ban on cruel and unusual punishment and other fundamental human rights. ” Ali explained that intimidation and advancing the goal of imposing Islamic law (sharia) on society are fundamental tenets of political Islam. She noted that “Islamism” is the ideology that drives political Islam and “dawa” provides the means by which it is spread, adding: The term “dawa” refers to activities carried out by Islamists to win adherents and enlist them in a campaign to impose sharia law on all societies. Dawa is not the Islamic equivalent of religious proselytizing, although it is often disguised as such by blending humanitarian activities with subversive political activities  …     The ultimate goal of dawa is to destroy the political institutions of a free society and replace them with strict sharia. Islamists rely on both violent and nonviolent means to achieve their objectives. The strategy used by the United States to combat violent Islamic extremism has “failed” because it has solely focused on acts of violence while ignoring the ideology that drives jihadists and Islamists, argued Ali. She told lawmakers, “The dominant strategy from   through the present, focusing only on Islamist violence, has failed. In focusing only on acts of violence, we have ignored the ideology that justifies, promotes, celebrates, and encourages violence, and the methods of dawa used to spread that ideology. ” In order to reverse its failure, the United States has to fight “a war of ideas against political Islam (or “Islamism”) as an ideology and against those who spread that ideology,” advised Ali. President Donald Trump advocating for an ideological campaign against “radical Islam” is “refreshing and heartening,” testified Ali, adding, “This deserves to be called a paradigm shift. ” She noted that Trump’s position marks a departure from his predecessors. Ali pointed out that Islam is on the rise across the world and jihadist groups have proliferated despite the U. S. spending at least $3. 6 trillion on combat and reconstruction costs in Iraq, Syria, Afghanistan, and Pakistan and sacrificing more than 5, 000 American service members and the tens of thousands of wounded U. S. troops. “According to one estimate, 10−15 percent of the world’s Muslims are Islamists. Out of well over 1. 6 billion, or 23 percent of the globe’s population, that implies more than 160 million individuals,” mentioned Ali. “Based on survey data on attitudes toward sharia in Muslim countries, total support for Islamist activities in the world is likely significantly higher than that estimate. ”'"}, "time": 1742562250.9950013}