{"duration": 0.18352174758911133, "input_args": {"text": "'Leave a reply \\nMichael Forrester – Every cause of disease first begins with an imbalance in the body’s energy systems, specifically, the interaction between how the heart communicates with the brain and the body. Fix that and there is no disease, ever. The heart can produce an electrical field 100 times greater than the brain and a magnetic field 5000 times greater. Which one are you using to heal? \\nEmotions are vibrations which influence consistently our reality. We not only think and work our way through a day, meeting, assignment, but also feel and believe our way through it. The outcome depends on both. \\nSimply put, the number one cause of health is your energetic and emotional state. How you connect emotionally to your overall wellness and wellbeing is more important than any supplement , food, exercise or health treatment. There is only one cause of disease and that has to do with the energy and frequency imbalances that exist within your body. Rectify that, and disease cannot exist… it would be impossible. \\nAll the emotions are varieties of two: fear and love: Fear/stress is contagious and causes contraction: inhibits creativity, brain activity, inhibits the immune system, selective perception and over extensive periods of time leads to breakdown. Love (positive beliefs and emotions) has high impact and causes expansion : creativity, physical and mental endurance, more productivity in shorter time because we take decisions quicker because we are receptive and highly perceptive. This a question of Math, HeartMath, as per the contribution in this field of the HeartMath Institute: when one has accurate information, takes better decisions. \\nThe quality of the field one creates with his heart influences his experience and reality. \\nThe research behind the evolution of HeartMath came from the idea that the body’s emotional response to events do not always occur from “top-down” processing (i.e., the brain sends signals to the heart and other organs, and the body responds accordingly). Rather, it has now proven that often times our emotional state triggers our heart to send out its own signals to the brain and other organs, and the body then responds accordingly. \\nFor instance, while two-way communication between the cognitive and emotional systems is hard-wired into the brain, the actual number of neural connections going from the emotional centers to the cognitive centers is greater than the number going the other way. Have you ever: Made a “rash” decision? Done something dangerous on impulse? Taken a risk because you believed in it? This research helps explain the influence emotions have on our ability to think and act. \\nIn fact, researchers at HeartMath have determined that the physiology and nerve centers of the heart are so complex and active, that they constitute a “brain” all on their own, termed a “mini-brain.” We now know that the heart contains cells that produce and release norepinephrine and dopamine, neurotransmitters once thought to be produced only by the brain and ganglia outside the heart. Even more remarkable is the discovery that the heart produces oxytocin – the “love hormone” – in concentrations that are as high as those in the brain. 7 Simple actions to create positive feelings: \\n1. Think about the colleagues who helped you today. Thank them in your heart. Think about your current assignments. Know that they will work out well and work from this space \\n2. What is it that you would like to have professionally? A new project? With whom? Think about it in detail, be specific and imagine you are already working on it \\n3. Entertain the feeling of celebration that arises in your heart. From this space take the appropriate actions to make it happen \\n4. Find ways to help your colleagues, or make them feel that you care. Do one (in)visible act of kindness per day or more if you want to \\n5. Before starting your work day give thanks and envision it the way you want it to be \\n6. When finishing your work day give thanks and clear it of negative emotions (which come out of fear that we know now is illusion). Do not take them at home or preserve for the next day \\n7. Smile \\nThe time of crisis is literally here: there is the fast pace of our world, the assault of too much to do with too little time and resources. Being in the present moment is just a concept for most of us and has little translation to daily life practice. Fear is wide spread and is polluting us on a very cellular level: hypertension, autoimmune diseases, cancer, infertility, chronic back problems, anxiety, and depression; the list could continue forever. The difference is how we interpret crisis because we can be at complete peace in the midst of chaos. \\nCan we live the life we want? Can we be authentic in our speech? Can we identify and release our underlying limiting beliefs so that we begin a new commitment towards genuine compassion, abundance, love and connection. Your commitment will show in your body and intentions. SF Source Wake Up World  '"}, "time": 1742562829.2084796}