{"duration": 0.03903675079345703, "input_args": {"text": "'Former President George W. Bush’s daughter, Barbara Pierce Bush, will deliver the keynote address at a Planned Parenthood fundraiser in North Texas. [Bush, the CEO and   of Global Health Corps (GHC) is headlining Planned Parenthood of Greater Texas’s 2017 Fort Worth luncheon, reports the Texas Tribune:  High schoolers! Earn community service hours, learn about sexual health, and inspire change Register now: https:  . ! pic. twitter.   —   Planned Parenthood (@PPGreaterTX) February 4, 2017,  “We believe that every person has the right to live a healthy, dignified life,” GHC says in its mission statement. “We also believe that everyone has a role to play in advancing social justice through the health equity movement. ” Bush, 34, joined with her twin sister, Jenna Bush Hager, and others to found GHC in 2009. The organization says its main concern is that “access to healthcare that exists today between the world’s rich and the world’s poor is unjust and unsustainable. ” Speaker sponsors for the fundraiser for the abortion chain’s Greater Texas affiliate will pay $20, 000, while Platinum and Gold Sponsors will pay $10, 000 and $5, 000, respectively. As Breitbart News reported in June of 2016, the New York Times interviewed Bush and Planned Parenthood’s president, Cecile Richards, as they lunched at the Gotham Bar and Grill. “Can I say how impressive Barbara is?” Richards complimented Bush. “It’s one thing to work at a    organization like Planned Parenthood, trying to shift the boat into the 21st century. But it’s another to say: ‘I see a problem, and I’m going to start an organization to fix it. ’” Bush explained her motivation to form her organization. “Since I was born, in 1981, we’ve had the drugs to save the millions of kids around the world who die every year,” she said. “Yet the number of deaths hasn’t dropped at all. We have the tools to keep people healthy, but the systems are broken. ” Richards commiserated with her: “It’s the same in reproductive health. We have the technology. But it’s not enough unless there’s public policy that supports getting women access to care. ” Richards is the daughter of the late Gov. Ann Richards (D) of Texas, who eventually lost to Bush’s father, Republican President George W. Bush, when he ran for governor of Texas in 1994. One of the main connections Richards and Bush have is Hillary Clinton. Planned Parenthood and the abortion industry endorsed Clinton in her bid for the White House in 2016. Clinton said unborn babies have no constitutional rights and that, if elected president, she would work to have the Hyde Amendment repealed so that taxpayer funds could be used for abortions  —   an outcome that would have been an obvious boost for the abortion business. GHC provides opportunities for young people to “work on the frontlines of the fight for global health equity” and offers paid fellowships for them with various “placement” organizations, among them Planned Parenthood Global. Additionally, GHC has provided “placements” at the Clinton Development Initiative, the Clinton Health Access Initiative, and the Clinton Health Matters Initiative  —   all of which are part of the Clinton Foundation. Peter Schweizer’s book Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich details the vast amounts of money that have flowed to both Bill and Hillary Clinton through their foundation from corporations and nations seeking favorable treatment from them. In August of 2013, Bush said she hoped Clinton would run for president because she is “unbelievably accomplished. ” Bush told Richards during their lunch interview, “It’s crazy and sad to think that health care is a polarizing issue. ” She went on to say that the young people in her organization are able to “work on social change” at “Planned Parenthood and other exceptional organizations. ”'"}, "time": 1742628424.715609}