{"duration": 0.08703994750976562, "input_args": {"text": "'Senator Rand Paul ( ) an outspoken critic of the House Republican replacement for Obamacare, joined SiriusXM host Raheem Kassam on Friday’s Breitbart News Daily. Paul revealed he has been in constant contact with President Donald Trump about the issue, including a phone call Thursday night, and said the president is “very open to negotiation. ”[Kassam asked if House Speaker Paul Ryan ( ) was correct to argue that repealing Obamacare without an immediate comprehensive replacement plan is impossible, and the plan his caucus has put on the table is the closest to repeal they can get.  “I’ve always been for repeal and replace at the same time, but not necessarily in the same bill,” Senator Paul replied. “The reason why I think you need ‘replace’ is we need to offer hope, and we need to offer an insurance product that is inexpensive, and something that will fix the marketplace so everybody can get access to health insurance. ” “The problem with putting replace and repeal in one bill is that we all tend to agree on the repeal aspect, Republicans, but we tend to disagree on the replacement aspect,” he said. “My idea of replacement is trying to let the marketplace work, encouraging people to join   and healthcare associations so they can drive prices down, and   the sale of all kinds of insurance. ” “Some of those things we actually agree with Paul Ryan on. The problem is Paul Ryan has a lot of Obamacare Lite stuff that he wants to keep in there,” Paul said. “He wants to keep the Obamacare subsidies. He calls them tax credits, refundable tax credits. He wants to keep the Obamacare taxes, all of the taxes, for a year  —   and then he wants to keep the Cadillac tax, the tax on good insurance, forever. ” “He also has an individual mandate in there, which is curious, because if you’ve listened to the debate for the last six, seven years, one of the things Republicans have hated the worst is the individual mandate,” Paul added. “He keeps the individual mandate. You just don’t pay the government you have to pay the insurance company. I think if you talk to customers and patients across the country and talk to doctors, there’s not a great deal of difference in dislike between the government and the insurance companies. You’re not going to make a lot of us happy if we have to pay the insurance company a penalty instead of the government. ”  “But there’s also insurance company bailouts in there. This gets to the fundamental heart of the problem. The problem with Obamacare is they tell people, ‘You know what? You can wait to buy insurance until after you’re sick.’ When they do that, nobody buys insurance until they’re sick, and the price of the insurance goes up. Ryancare doesn’t fix that. If you do not fix that, the premiums will continue to skyrocket, but we’re going to be blamed for it,” the senator warned his fellow Republicans.  “After repeal is voted on, and even if it’s an incomplete repeal or Obamacare Lite, Republicans will own this. So we’ve got to get it right before we do this. We have to understand fundamentally that if you wait to let people buy insurance until after they’re sick, they will,” he said. “The interesting thing about the individual mandate in the Ryan plan is that let’s say you do lose your job, or let’s say you can’t buy insurance for a while. Now you know that when you buy it again, you have a 30 percent penalty. You don’t get the penalty until you buy it. So why would you buy it? You’re going to wait to buy it until you get sick. So once again, as the adverse selection gets worse, the death spiral of Obamacare continues after Ryancare,” Paul argued. Kassam noted that the White House is making a push for the House bill on Paul’s home turf in Kentucky and asked if the situation had devolved into “  war” between Senator Paul and the executive branch. “Actually, I think the president is very open to negotiation,” Paul replied. “I talked to him again last night by phone. I’ve talked to him twice a week, which is quite a bit for anybody to talk to the president that’s not in the administration. ” “I talked to him again last night. He said he’s open to negotiation, but I reiterated to him that Paul Ryan went on TV for 45 minutes yesterday with a press conference, and he said, ‘The response to this, the choices are binary.’ Well, binary means there are two choices: either we take it or leave it. Either we take Obamacare Lite or we get nothing. That isn’t sitting well with conservatives, and I promise you, the more we hear Paul Ryan say, ‘Take it or leave it,’ the less we’re willing to take it,” he said. “Also, we are concerned that if we vote for Obamacare Lite, and insurance premiums still continue to go through the roof, and a year from now, insurance companies are going bankrupt the same way they’re going bankrupt now, people will say, ‘What did you guys do? You had six years to figure this out, and you couldn’t get it right,’” Paul said. When Kassam asked if opponents of the Ryan bill had the votes to keep it from passing, Paul replied, “The proof’s in the pudding. ” “There are 40 members of the House Freedom Caucus. They will make their decision. So far, their leadership and their voting has been that they’re for clean repeal. I believe they voted 80 percent to take a position of clean repeal. And that’s my position: separate repeal from replace,” he said.  “You do replace. I do replace it on the same day. We’re not completely unable to vote on more than one thing in a day,” he pointed out.  “We should put the repeal forward that we voted on a year ago, and that passed unanimously. Put it on, and the same day, let’s put up replacement,” Paul recommended. “Now, what House leadership will tell you is, you probably won’t get to 60 votes. I can’t guarantee 60 votes. All I can guarantee is what we’re for. We should put it forward, and if Democrats block replacement, they still own the whole thing. ” Paul agreed with Kassam that many Republicans do not seem to understand they hold the high ground on Obamacare repeal and could make Democrats pay a political price for interfering with vitally needed measures to deal with the failing program. “I don’t think they understand that yet. I’m still trying to get that through to them,” said Paul. “I am for replacement. I do want to pass replacement  —   but if they don’t, instead of Republicans fighting with each other, why don’t we make sure that the Democrats still are responsible? If they choose to block replacement, they’re still responsible. ” “I think we could pass replacement, though. I think there actually are some Democrats who will come around,” he predicted. “Some of these ideas are really reasonable. For example, what if we put up the individual idea that every patient in America should be allowed to join a healthcare association? We expand healthcare associations in one vote. That’s a tough vote for Democrats to say they’re against the consumer to join a buying group to get a lower price and to get guaranteed issue. ” “This is the other thing nobody understands,” he elaborated. “They think you have to mandate guaranteed issue  —   you know, that you can buy insurance after you’re sick by law. The other way you do it is you let people get group insurance. You join a   you join the health buying group, and when you buy it, you have group insurance. Group insurance is protected, and if you get group insurance, you will not be let go. Your prices will not go up. ”  Paul predicted such a reform would “completely transform” the    company relationship. “Let’s say you’re part of a   buying group. Now you have enormous leverage, so instead of us kissing the boots of the insurance executives, it’ll be the opposite. The insurance executives will be begging to talk to our person, whoever’s in charge of this,” he said. “And I promise you, whether you make $30, 000 or you make $100, 000 in our country, people don’t like the way they’re being treated by the health insurance companies. ” He said that under Ryancare, insurance companies would “continue to lose money, but Ryan’s going to give them a backstop, a bailout. ”  “The chronic insurance company bailout that was in Obamacare is still in this new Obamacare Lite bill,” Paul said. He also expressed strong support for tort reform as part of a plan to bring medical costs down. “I’m a physician,” he reminded the audience. “We’ve got to try to stop the frivolous lawsuits, not only for the expense of them, but everybody orders about a million too many test, because they’re afraid of being sued. We need to fix that. ”  “Unfortunately  —   or fortunately, depending on how you look at it  —   that probably has to be done at the state capitols, because people get sued at the state courts, and the state courts are under the purview of state law,” he added. “Some states have fixed this, frankly, or made it a lot better. They have review panels. They have caps on damages. I don’t know if any have   but I like the   aspect also. ” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742628605.180328}