{"duration": 0.05553388595581055, "input_args": {"text": "'The FBI is not happy with either Director James Comey or the Clinton family, and now former officials are starting to speak out about the issue. \\nFormer FBI assistant director James Kallstrom told Fox News’ Judge Jeanine Pirro that he is fairly certain “something big is going to happen,” in the Clinton email investigation. He also believes that internal strife at the FBI and the agencies upset with Comey’s decision not pursue charges against Hillary Clinton also played a role in Comey’s decision to act now. \\n“I think there’s something happening. People are asking me what is this about. I think something big is going to happen. I don’t know what it is. It’s just my gut feeling… I think he couldn’t hold onto it any longer. OK. Because who knows? Maybe the locals would have stepped in on this. ” \\nOn Sunday Kallstrom was a guest on a radio show where he called the Clintons a “crime family.” \\n“The Clintons, that’s a crime family, basically,” Kallstrom said. “It’s like organized crime. I mean the Clinton Foundation is a cesspool .” \\n… \\nHe also blasted Attorney General Loretta Lynch, claiming that she impeded the investigation into Clinton’s private server. \\n“The problem here is this investigation was never a real investigation,” he said. “That’s the problem. They never had a grand jury empanelled, and the reason they never had a grand jury empanelled, I’m sure, is Loretta Lynch would not go along with that.” \\nKallstrom also gave some insight to what is happening inside the agency right now, “The agents are furious with what’s going on, I know that for a fact.” \\nInterestingly, over at NBC, Larry Kudlow confirmed much of what Kallstrom said over the weekend when he told Chuck Todd that the FBI was in “full revolt.” \\n“What I’m hearing from everybody, I mean, I have some sources in the F.B.I. and the former district attorney’s. The F.B.I. is in full revolt right now. The F.B.I. has been in full revolt since the decisions made last summer… what I’m getting at is if Comey hadn’t said what he said to Congress and the rest of the world, it would have leaked. It would have leaked. That whole building was ready to leak that they had discovered this new source with Weiner and Abedin. So, I don’t think Comey had much chance here. And I think the F.B.I. is badly divided.” \\nShould we dare to hope? Could we really see justice meted out on the Clinton Crime Family? I’m not ready to throw a “Hillary to Jail” party yet, but I’ll be watching what happens over the next few weeks with high hopes for justice. \\nBy the way, Kallstrom wasn’t the only former Assistant Director of the FBI speaking out about the Clinton Family’s corruption recently. \\n  Constitution.com  '"}, "time": 1742561992.185309}