{"duration": 0.05713391304016113, "input_args": {"text": "'WATCH: Embattled GOP Senator Just Killed His Campaign With This Racist Remark By Carrie MacDonald on October 28, 2016 \\nSenator Mark Kirk (R-Ill.) faced Representative Tammy Duckworth (D-Ill.) in a debate last night, and he decided to go full racist and question her family’s military service. Kirk Goes Low … Again \\nSen. Kirk is battling to retain his Senate seat, and his chances of doing so get slimmer by the day. In last night’s debate, he made a racist comment to Rep. Duckworth that may put the final nail in the coffin of his re-election bid. \\nBoth candidates in the race are military veterans, and Rep. Duckworth was speaking about her own service as well as that of her family. She said : “My family has served this nation in uniform going back to the Revolution. I am a daughter of the American Revolution. I’ve bled for this nation. But I still want to be there in the Senate when the drums of war sound — because people are quick to sound the drums of war — and I want to be there to say, ‘This is what it costs. This is what you’re asking us to do. And if that’s the case, I’ll go.’ Families like mine are the ones that lead first. But let’s make sure the American people understand what we are engaging in. And let’s hold our allies accountable because we can’t do it all.” \\nSen. Kirk was given the customary 30 seconds to respond. However, rather than respond with dignity and grace, he chose to take the low road, saying: “I had forgotten that your parents came all the way from Thailand to serve George Washington.” \\nRep. Duckworth was born in Bangkok to a mother of Thai-Chinese descent and an American father. \\nAnd yes, her family’s military service on her father’s side can indeed be traced back to the American Revolution. \\nKirk’s comment, made to a woman who lost both her legs and nearly lost her right arm in Iraq, was racist and indefensible. I find myself wondering what he possibly thought he could gain by making it. His campaign has come forward to say that Kirk “honors her family’s service.” If that’s true, he has a strange way of showing it. \\nThe junior senator has come under fire in the past for lying about his own military service. \\nAs for Rep. Duckworth, she simply smiled and let the moderator move on. My guess is she was thinking of how nice “Senator Tammy Duckworth” sounds, because Kirk may as well just bow out gracefully now. \\nWatch the exchange here, and remember to vote on November 8: \\nFeatured Images by Lance Cheung and Daniel X. O’Nell via Flickr under a CC By 2.0 license About Carrie MacDonald \\nCarrie is a progressive mom and wife living in the upper Midwest. Connect'"}, "time": 1742561926.0608733}