{"duration": 0.06970643997192383, "input_args": {"text": "'A firebomb tore through the Republican Party headquarters in North Carolina’s Orange County on Saturday night, and graffiti warning its members to flee town was painted on the walls of a neighboring building, the party and police officials said on Sunday. The party posted images on Twitter of the damaged building in Hillsborough, N. C. on Sunday afternoon that showed blackened walls, charred couches and burned campaign signs for Donald J. Trump and several local candidates. A window was broken, and a swastika was   nearby alongside the words “Nazi Republicans leave town or else. ” The bombing occurred at a tense moment in American politics, just three weeks from Election Day and near the end of a divisive presidential campaign that has seen deepening hostility and suspicions between supporters of Hillary Clinton and those of Mr. Trump, who has repeatedly said that he believes the vote will be “rigged” against him. On Sunday, the Hillsborough police said the fire had been caused by a firebomb thrown through a window of the office, which is in a shopping center about 14 miles outside Durham. The damage was not noticed until Sunday, when a business owner called the authorities around 9 a. m. the police said. Gov. Pat McCrory said in a statement that no one had been injured. “This highly disturbing act goes far beyond vandalizing property it willfully threatens our community’s safety via fire, and its hateful message undermines decency, respect and integrity in civic participation,” Mayor Tom Stevens of Hillsborough said in a statement. “Our law enforcement officials are responding quickly and thoroughly to investigate this reprehensible act and prosecute the perpetrators. ” The Hillsborough police said they were investigating the attack along with the federal Bureau of Alcohol, Tobacco, Firearms and Explosives. In a statement to The Charlotte Observer, Dallas Woodhouse, the executive director of the state Republican Party, called the bombing “political terrorism. ” “The office itself is a total loss,” he said. “The only thing important to us is that nobody was killed, and they very well could have been. ” “Whether you are Republican, Democrat or independent, all Americans should be outraged by this   and violent attack against our democracy,” he added. “Everyone in this country should be free to express their political viewpoints without fear for their own safety. ” Mr. McCrory, a Republican, condemned the bombing as “an attack on our democracy. ” “Violence has no place in our society  —   but especially in our elections,” he said in his statement. “Fortunately no one was injured however, I will use every resource as governor to assist local authorities in this investigation. ”'"}, "time": 1742562003.587663}