{"duration": 0.09801864624023438, "input_args": {"text": "'Posted on November 7, 2016 by DavidSwanson \\n1. Stop the efforts to ram through the Trans-Pacific Partnership during the lame duck. \\n2. Stop the efforts to ram through a supplemental war spending bill for assorted future wars during the lame duck. \\n3. Stop the efforts to repeal the right to sue Saudi Arabia and other nations for their wars and lesser acts of terrorism during the lame duck. \\n4. Build a nonpartisan movement to effect real change. \\n5. Ban bribery, fund elections, make registration automatic, make election day a holiday, end gerrymandering, eliminate the electoral college, create the right to vote, create public hand counting of paper ballots at every polling place, create ranked choice voting. \\n6. End the wars, end the weapons dealing, close the bases, and shift military spending to human and environmental needs. \\n7. Tax billionaires. \\n8. End mass incarceration and the death penalty and the militarization of police. \\n9. Create single-payer healthcare. \\n10. Support the rule of law, diplomacy, and aid. \\n11. Invest in serious effort to avoid climate catastrophe. \\n12. Apologize to the world for having elected President Clinton or Trump. \\n\\n1. Build a movement that includes all the Democrats eager to get active. \\n2. Build a movement that includes a focus on rights of refugees / immigrants \\n3. Build a movement that resists racist violence at home. \\n4. Demand a swift end to NAFTA and NATO. \\n5. Oppose all the horrible nominations for high offices. \\n6. Break up the media cartel. \\n7. If win came through voter suppression, seek prosecution immediately. \\n8. If win came through fraudulent counting, launch massive campaign to compel Democrats to admit it and protest it. \\n\\n1. Build a movement that includes all the Republicans and Libertarians eager to get active. \\n2. Build a movement that includes a focus on rights of refugees / immigrants \\n3. Build a movement that resists racist violence directed at nations abroad. \\n4. Demand serious action on climate change. \\n5. Oppose all the horrible nominations for high offices. \\n6. Break up the media cartel. \\n7. If win came through fraudulent counting, support Trump’s noisy denunciation, and if it did not, then reject Trump’s noisy denunciation. \\n\\n1. Support the independent media that made this possible. \\n2. Support all the wonderful nominees for higher office. \\n3. Help people in other countries turn their disastrous political systems around too. \\n4. Volunteer for public service. This entry was posted in General . Bookmark the permalink . Vote as if your life depended upon it, because it does. → WillDippel \\nHere is a look at one of the most ironic emails released from Hillary Clinton’s campaign chairman’s computer by Wikileaks:'"}, "time": 1742562814.9677916}