{"duration": 0.07681536674499512, "input_args": {"text": "'So-called ‘Patient Zero’ not behind the spread of HIV in US Published time: 27 Oct, 2016 00:50 Get short URL Gaëtan Dugas (February 20, 1953 – March 30, 1984), Canadian flight attendant and alleged patient zero for AIDS. © Wikipedia Since 1987, the so-called “Patient Zero” of HIV was believed to be a Canadian flight attendant, blamed for importing the virus that causes AIDS into the US. New research has determined that he was not the first infected person in the US, however. \\nGaetan Dugas has been blamed for the appearance of AIDS in the US. However, research from the University of Arizona has exonerated Dugas, no longer the first villain in the deadly epidemic. \\nDugas was first identified as “ Patient Zero ” in Randy Shilts’ 1987 bestseller about the AIDS epidemic, titled ‘And the Band Played On.’ The former Air Canada flight attendant died of AIDS in 1984, but new discoveries about the genetic makeup of the AIDS virus have revealed that Dugas was not the source of the infection in the US, merely another victim of the disease during its earliest days. New antibody therapy suppresses #HIV for 2+ months without side effects – study https://t.co/bZWJQrHf5o pic.twitter.com/8YFtN0oK8w — RT America (@RT_America) June 25, 2016 \\nMichael Worobey, the evolutionary biologist at the University of Arizona, led the study that pieced together the genetic sequence of the HIV virus, using eight blood samples collected from gay and bisexual men during a hepatitis B study between 1978 and 1979, Reuters reported . \\nWhat Worobey and his team discovered was that AIDS first came to the US by way of the Caribbean in 1970 or 1971. Instead of originating in California and spreading eastward via Dugas, as it was long believed, the spread of AIDS was actually the opposite. \\nDugas did link cases in New York City to California and was found to carry HIV-1 sequences attributed to early mutations of the infection, but the study found “ no evidence that Patient O was the first person infected by this lineage. ” \\n\" The virus got to New York City pretty darn early ,\" Worobey told NPR. \\nDugas’ reputation for being the first AIDS patient did not come from science, but rather a simple misinterpretation of the letter “ O. ” The urban legend began in the early 1980s, when behavioral scientist William Darrow was working with the US Centers for Disease Control and Prevention (CDC) to try to discover what was behind the mysterious deaths of gay men in Los Angeles, NPR reported. \\nDarrow caught a break when he learned of rumors that the early cases of AIDS actually involved lovers. \\n“ Whoa! This is the first indication that we had that the disease might be sexually transmitted from one person to another ,\" Darrow told NPR. \\nDugas appeared on Darrow’s radar when three unconnected men named him as a lover. His name was mentioned by more men, until he was connected to eight early AIDS cases. \\nWhen Darrow went to write up his findings, he coded the men’s names to preserve their anonymity. The majority of them were from the Los Angeles area and were identified as such. \\n\" There was LA1, LA2 ... and so forth, \" Darrow explained. \\nBut when it came to the French-Canadian flight attendant, Dugas was identified as \"Patient O,” the outside-of-California case. That is an O, as in Oscar. Not a zero. \\n\" I never labeled him Patient Zero, ” Darrow said. Insurers discriminating against HIV/AIDS patients via drug costs – study http://t.co/kYYil7NjxZ pic.twitter.com/bs92vGJV54 — RT America (@RT_America) January 29, 2015 \\nHowever, the designation caused some confusion back at the CDC, where someone referred to Dugas as “ Patient Zero. ” This error was not corrected and Darrow went with it, but explained that “ Patient O ” was meant to show “ there was some person who was very important in this cluster of cases. \" \\nThis mistake followed Dugas even after his death. When Shilts first read about the Canadian, he originally believed he was described as “ Patient O, ” but then heard CDC employees call him “ Patient Zero. ” \\n“I thought, \\'Ooh, that\\'s catchy’,” he told Life magazine. \\nFrom that point onward, Dugas became known as “ Patient Zero ” in Shilts’ book. Amid the panic surrounding the disease, the media ran with Dugas being to blame for the epidemic and spread misinformation that the Canadian was the first person diagnosed with the disease in the US. \\nThe fact that Dugas’ HIV sequence offered little difference from the many other people who were infected at the time was often forgotten and his reputation as “ Patient Zero ” overshadowed the assistance he offered the CDC in recognizing and studying HIV, according to Darrow. \\n\" To me, there\\'s something nice about going back and correcting the record, \" Worobeysays. \" He has been blamed for things that no one should be blamed for. \"'"}, "time": 1742562092.1001477}