{"duration": 0.16188406944274902, "input_args": {"text": "'By George Zapo \\nPosted Friday, October 28, 2016 at 08:04am EDT \\nKeywords: Atlanta , food , food waste , fresh food , Georgia , hunger , landfills , perishable food , Second Helpings Atlanta , volunteers , waste managment \\nFood waste and hunger are enormous global, environmental, and public health problems. As overwhelming as these issues are, community groups, volunteers, local businesses, and organizations are working on trying to find a solution. \\nWhat started as a social action project in 2004, a few members of a small community in metro-Atlanta, Georgia took up the challenge to feed people in need and eliminate food waste. \\nAnd they’re succeeding! \\nThe project grew into a non-profit organization with a team of more than 400 volunteer drivers, a network of more than 50 donors, and front-line agencies who feed the hungry on a daily basis. \\nAmazingly, the entire group has rescued more than 5.5 million pounds of food — enough to provide 4.6 million meals. Here’s more of this motivating, against-all-odds story. Food Waste and Hunger \\nAbout a third of the planet’s food goes to waste. That’s enough to feed two billion people. \\nThe United Nations Environment Programme (UNEP) and the World Resources Institute (WRI) report that about one-third of all food produced worldwide — worth around $1 trillion — are lost or wasted in food production and consumption systems. \\nFurthermore, the Natural Resources Defense Council (NRDC) cites the following: \\n“Forty percent of the food in the United States is never eaten. But at the same time, one in eight Americans struggles to put enough food on the table.” \\nNearly 800 million people worldwide suffer from hunger . But according to the Food and Agriculture Organization of the United Nations, we squander enough food — globally, 2.9 trillion pounds a year — to feed every one of them more than twice over. \\nIn developing nations, much of the food is lost after harvest, because of the lack of refrigeration, good roads, and adequate storage facilities. On the other hand, developed nations waste more food when retailers order, display, or serve too much. \\nAdditionally, consumers waste food when they ignore leftovers in the back of their refrigerators — or toss perishable food out before it expires. More Alarming Statistics of Wasted Food \\nMuch of the wasted food in the U.S. ends up in landfills. The U.S. Environmental Protection Agency (EPA) reports that food waste is the second largest category of municipal solid waste sent to landfills in the United States. \\nAnd it accounts for about 18 percent of the waste stream. That’s more than 30 million tons of food waste that the U.S. sends to the landfills each year. \\nAdditionally, according to NRDC, on average, people dining out leave 17 percent of meals uneaten and 55 percent of these potential leftovers are not taken home. \\nIn spite of the dismal statistics on food waste — and the struggles and pain hungry people endure — community groups, organizations, local businesses, and volunteers in metro-Atlanta, Georgia are making headway in not wasting food and feeding people in need. People Are Fed, Perishable Food Not Wasted \\nMore than ten years ago, a few members of a community in metro-Atlanta, Georgia took up the challenge to feed people in need and eliminate food waste. They wanted to take leftover fresh food from grocery stores and restaurants and quickly deliver it to agencies that provide food to families and individuals in need. \\nSince the first delivery was made in 2004, the group has “rescued” more than 5.5 million pounds of food. And the group believes this figure equals enough to provide more than 4.6 million meals. \\nAs success mounted in eliminating food waste and feeding people in their community, the group established itself as a non-profit organization called Second Helpings Atlanta . Now, Second Helpings Atlanta has 62 donors, 31 partner agencies, and a team of more than 400 volunteer drivers who pick up and drop off perishable food every day. \\nExecutive Director Joe Labriola says, “The challenge is getting the food from those who have it to those who need it, and that’s what we do. We play a very specific role. We do 125 scheduled pickups and deliveries a week. We’ve gotten pretty good at this.” Fresh Food versus Non-Perishable \\nFresh food provides more nutrition than the non-perishable, processed diet that so many people eat — especially people with low or no income. One of Second Helpings Atlanta’s goals is to change that standard, offering fresh food that will ideally help prompt healthier eating habits. \\nThis year, the group has delivered 962,635 pounds of food and Labriola estimates they will pick up and deliver more than 1.3 million pounds by the end of the year. \\n“The reason we’re so focused on perishable food is that we’re providing nutrition to the diets of people who are surviving on processed food. We’re breaking the cycle and hope that some of the health benefits of fresh food will start to kick in.” \\nAccording to Labriola, he sees no reason why this type of food waste program can’t easily be adopted anywhere. He adds that 40 percent of the food produced in the U.S. is never consumed. And the average annual cost per household of food that is thrown out is $650. \\nTwenty percent of people in Georgia live in a food-insecure environment — meaning they’re not sure when they’re going to eat next. “It’s a pretty grim story,” Labriola says. “But if we rescue just 15 percent of that food, we can feed 25 million Americans.” How it’s Working \\nWhen people sign up to volunteer, they’re shown the available routes. Then they’re asked to choose the route that would work best with their location and schedule. \\nMost pickups are regularly scheduled. However, the group often gets calls from people holding weddings, bar mitzvahs, or festivals — knowing there will be leftover food at the end of the night. Then, a call goes out to find a volunteer to help pickup and delivery the leftover food. \\nVolunteer drivers make food deliveries every day of the year, except Christmas. Food pickups range in size — so people can pick them up no matter if they own a small sedan or a minivan. That way volunteering is within the reach of everyone. \\nFrom the time a driver leaves home — stopping to pick up the food and drop it off at a partner agency — it usually takes no longer than 90 minutes for he or she to return home. Families Volunteer \\nQuite often, entire families will volunteer and work together for the weekly delivery service. Labriola says families volunteering are instrumental to educating younger generations about hunger and food waste. \\nFor example, around Thanksgiving, a family with two young children met Labriola one day to pick up dozens of turkeys at a grocery store. The children looked amazed as they helped carry the delivery — bird-by-bird — from the store to the truck, and into the agency that would distribute them to families. Labriola told the kids they just helped feed 225 families. The children soon realized what they did. One of the children said, “That’s as many kids that are in my school!” \\nThe exemplary work and dedication exhibited by volunteers in the metro-Atlanta, Georgia community is a truly successful model of how to eliminate food waste and hunger. Perhaps more community groups, organizations, local businesses, and volunteers will consider following their worthy example. You might also like…'"}, "time": 1742562109.7542067}