{"duration": 0.1031789779663086, "input_args": {"text": "\"College Forces Mandatory Microaggression Sessions on Faculty After Prof Accuses Student of Plagiarism November 2, 2016 \\nCollege is now a politically correct joke . \\nSuffolk University’s interim president said Tuesday that the college will hold mandatory microaggression training for all faculty in response to an outcry last week after a Latina student wrote a viral blog post saying she was the victim of a professor’s racial bias. \\nWhat did this racial bias involve? \\nTiffany Martinez.said an unidentified Suffolk sociology professor handed back a paper she had written and in front of the class and told Martinez, “This is not your language,” insinuating that Martinez had plagiarized. \\nMartinez posted a photo of the paper on her blog, showing where the professor appears to have written “please go back and indicate where you cut and paste.” The professor had circled the word “hence” in the paper and wrote, “this is not your word.” \\n“In this interaction, my undergraduate career was both challenged and critiqued,” the student wrote. “It is worth repeating how my professor assumed I could not use the word “hence,” a simple transitory word that connected two relating statements. The professor assumed I could not produce quality research.” \\nMost college students, regardless of whether their ancestors originated from southern Europe or not, do not tend to use hence in a sentence. Hence, it's the sort of word that professors seize on and suspect that what they are seeing is cut and paste material. Tiffany's interaction has happened thousands of times with students regardless of race. \\nBut Tiffany is lucky enough to be a privileged minority. Which means that she can't be treated like everyone else lest she whine about it and a flood of social justice crybullies descend on Suffolk U. \\nKelly, the interim president, also sent a note to the school on Friday after the Buzzfeed article was posted. \\n“The truth is that all of us here at Suffolk should be concerned about any student feeling this way,” Kelly wrote in her Tuesday blog post. She said the school has experienced an outpouring of support for Martinez from other students, faculty and staff. \\nPrivilege. This is what it looks like. \\nScholars and Rogues fights a last stand against the decline and fall of journalism by stating the obvious . \\nIn short, what we have here isn’t merely iffy reporting on an academic dustup. It’s a microcosm of what has happened to journalism in modern America. These headlines are certain to entice Web surfers to click, and if the “reporters” can so easily be suckered into outrage then how can we possibly expect a rational reading by the average product of the American ed system, which has been stripped of all pretense at teaching critical thinking. \\nThe result: an emotionally pitched, unsubstantiated claim of injustice has been instantly transformed into cold, hard fact. \\nWell yes. \\nMeanwhile here's a sample of Tiffany's writing. You can decide whether she organically used hence in a sentence. \\nA Declaration of Self Love \\nI’m familiar negotiating who I am to please others. Some may call me inauthentic, I call this self-protection. However, I have burned through my shields. Too tired to be exhausted, this continuous disguise has faded. It’s time I accept myself and no longer sacrifice self-love for overall acceptance. \\nThe crybullies of the self-esteem generation can never get enough of loving itself and hating everyone who interferes with its boundless appetite for self-love.\""}, "time": 1742561772.4315856}