{"duration": 0.12250232696533203, "input_args": {"text": "'Donald Trump the Hero of the Common Man 03.11.2016 In America, many people had given up on politics. Our Congress was bought and sold by lobbyists. Both parties seemed to be the same, the same neocon bombings of other countries. The same media spin. They felt they had been left behind. The corporations and profits were all that mattered, not the common man. They were almost resigned to the fact that they had no say anymore and that \\'we the people \\' was a saying and the meaning long forgotten as government got bigger and bigger,and became a Gigantic Leviathan sucking off the working-class people. Then, along came Trump. A businessman who was a showman. A thin skinned bully who mocked those he did not like. But, he was different. He was not a politician. He was not beholden to the corporate elite. In fact, the corporate elite despised him. Their media eviscerated him at every turn. He was mocked, scored, his every word grotesquely twisted to sound nothing like what he originally meant. Font Size They loved him, he loved them back And, yet, the people loved him. And, he loved them back. Rally after rally they came by the thousands to cheer their hero on. Hated by the elites and loved by the masses Trump himself began to change. Once only wanting to be a part of the elite crowd, Trump began to fall in love with his crowds. He saw himself as the hero of the common man and it felt good. Trump began to speak out against the elites who had bought and sold Congress. The said he wanted to \"drain the swamp\" and put term limits on professional politicians. The people loved him even more. The media painted and painted but... The media, controlled by the corporate elites continued to paint Mr. Trump as a womanizer, a racist, a xenophobe, and in cahoots with (gasp) Russia. To the Hillary Clinton supporters he could do not right and everything he said was suspect. He was vilified into the worst monster imaginable. No one in their right mind could possibly support him and those that did were themselves nothing but uneducated racists. But, Trump was not a racist. In 1885, he bought Mar-a-Lago. An estate in Palm Beach that he was going to turn into a chi chi club. Back then in the United States the tony clubs were segregated. Only white WASPS were members of the fancy clubs. Donald Trump said that he wanted his club to be diverse and he wanted it to be open to everyone. People told him he would lose money and no one would join, but he did not care he wanted it to be diverse. And, so it was. Mar-a-Lago was one of the first primer clubs open to everyone in Palm Beach, Florida. Hardly the actions of a racist. To those that love Trump he is the patriarch of a beautiful family. His children are beautiful and successful in their own right. He is a successful businessman who turned a million dollar loan into business ventures that made him a multi-bullionaire. They see a man who can misspeak, who can lash out, but they know his bark is worse than his bite. They see a man who isn\\'t the greatest orator of all time and shoots from the hip, but they aren\\'t so bothered by this because one of their loves for him is the fact that he isn\\'t a politician with the rehearsed rhetoric. They see a man who\\'s heart is in the right place. A man who loves America and her people. Trump is a patriot But, most of all, they saw a man who is a patriot. A man who is capable of bullying where bullying has never been done before, but maybe it was time a dominant male started calling out the evil that had befallen America. A man who wasn\\'t afraid to call out the media bias, call out politicians in their corrupt dealings with wealthy donors. Wasn\\'t afraid to say we needed to vet Muslim terrorists and not let them into their land. A man who was not afraid to say we need a wall on the Mexican border to stop the insane illegal immigration into America. Trump had become the voice of the common man! The voice of the silent majority that didn\\'t think it mattered anymore. He has single-handedly destroyed the hold the corporations and elites had on his party. He has confounded all of the media, and all of every insider involved in politics. He wants to bring back the voice of the people who view him as their prince. The only person strong enough to take on the entire cabal. He has vanquished the Republican party. He is now tied in the polls with Hillary Clinton the mouthpiece and pasty of the corporate elitists and a neocon war monger. It is the prayer of Trump supporters, the common men and women in America, that their hero triumphs this week and wins in the most historic upset of our century. Nancy O\\'Brien Simpson Ms. Simpson was a radio personality in New York. She was a staff writer for The Liberty Report. A PBS documentary was done on her activism for human rights. She is a psychotherapist and political commentator.'"}, "time": 1742563827.8885996}