{"duration": 0.09591031074523926, "input_args": {"text": "'Home › POLITICS | US NEWS › FBI FOUND 650,000 EMAILS ON LAPTOP FBI FOUND 650,000 EMAILS ON LAPTOP 0 SHARES \\n[10/30/16] The surprise disclosure that agents from the Federal Bureau of Investigation are taking a new look at Hillary Clinton ’s email use lays bare, just days before the election, tensions inside the bureau and the Justice Department over how to investigate the Democratic presidential nominee. \\nInvestigators found 650,000 emails on a laptop used by former Rep. Anthony Weiner and his estranged wife Huma Abedin, a close Clinton aide , and underlying metadata suggests thousands of those messages could have been sent to or from the private server that Mrs. Clinton used while she was secretary of state, according to people familiar with the matter. \\nIt will take weeks, at a minimum, to determine whether those messages are work-related from the time Ms. Abedin served with Mrs. Clinton at the State Department; how many are duplicates of emails already reviewed by the FBI; and whether they include either classified information or important new evidence in the Clinton email probe. Officials had to await a court order to begin reviewing the emails—which they received over the weekend, according to a person familiar with the matter—because they were uncovered in an unrelated probe of Mr. Weiner. \\nThe new investigative effort, disclosed by FBI Director James Comey on Friday, shows a bureau at times in sharp internal disagreement over matters related to the Clintons, and how to handle those matters fairly and carefully in the middle of a national election campaign. Even as the probe of Mrs. Clinton’s email use wound down in July, internal disagreements within the bureau and the Justice Department surrounding the Clintons’ family philanthropy heated up, according to people familiar with the matter. \\nThe latest development began in early October when New York-based FBI officials notified Andrew McCabe, the bureau’s second-in-command, that while investigating Mr. Weiner for possibly sending sexually charged messages to a teenage minor , they had recovered a laptop. Many of the 650,000 emails on the computer, they said, were from the accounts of Ms. Abedin, according to people familiar with the matter. \\nThose emails stretched back years, these people said, and were on a laptop that hadn’t previously come up in the Clinton email probe. Ms. Abedin said in late August that the couple were separating. \\nThe FBI had searched the computer while looking for child pornography, people familiar with the matter said, but the warrant they used didn’t give them authority to search for matters related to Mrs. Clinton’s email arrangement at the State Department. Mr. Weiner has denied sending explicit or indecent messages to the minor. \\nIn their initial review of the laptop, the metadata showed many messages, apparently in the thousands, that were either sent to or from the private email server at Mrs. Clinton’s home that had been the focus of so much investigative effort for the FBI. Senior FBI officials decided to let the Weiner investigators proceed with a closer examination of the metadata on the computer, and report back to them. \\nAt a meeting early last week of senior Justice Department and FBI officials, a member of the department’s senior national-security staff asked for an update on the Weiner laptop, the people familiar with the matter said. At that point, officials realized that no one had acted to obtain a warrant, these people said. \\nMr. McCabe then instructed the email investigators to talk to the Weiner investigators and see whether the laptop’s contents could be relevant to the Clinton email probe, these people said. After the investigators spoke, the agents agreed it was potentially relevant. \\nMr. Comey was given an update, decided to go forward with the case and notified Congress on Friday, with explosive results. Senior Justice Department officials had warned the FBI that telling Congress would violate policies against overt actions that could affect an election, and some within the FBI have been unhappy at Mr. Comey’s repeated public statements on the probe, going back to his press conference on the subject in July. \\nThe back-and-forth reflects how the bureau is probing several matters related, directly or indirectly, to Mrs. Clinton and her inner circle. \\nNew details show that senior law-enforcement officials repeatedly voiced skepticism of the strength of the evidence in a bureau investigation of the Clinton Foundation, sought to condense what was at times a sprawling cross-country effort, and, according to some people familiar with the matter, told agents to limit their pursuit of the case. The probe of the foundation began more than a year ago to determine whether financial crimes or influence peddling occurred related to the charity. \\nSome investigators grew frustrated, viewing FBI leadership as uninterested in probing the charity, these people said. Others involved disagreed sharply, defending FBI bosses and saying Mr. McCabe in particular was caught between an increasingly acrimonious fight for control between the Justice Department and FBI agents pursuing the Clinton Foundation case. \\nIt isn’t unusual for field agents to favor a more aggressive approach than supervisors and prosecutors think is merited. But the internal debates about the Clinton Foundation show the high stakes when such disagreements occur surrounding someone who is running for president. \\nThe Wall Street Journal reported last week that Mr. McCabe’s wife, Jill McCabe, received $467,500 in campaign funds in late 2015 from the political-action committee of Virginia Gov. Terry McAuliffe, a longtime ally of the Clintons and, until he was elected governor in November 2013, a Clinton Foundation board member. Post navigation'"}, "time": 1742563957.896624}