{"duration": 0.0570521354675293, "input_args": {"text": "'The Islamic Republic of Pakistan has launched a crackdown against   “blasphemy” on social media, and Facebook and Twitter are doing little to stop it. According to government sources, Facebook is even assisting Pakistan in removing “blasphemous” content. [Late last week, government officials in Pakistan informed the Islamabad High Court that “almost 85 percent” of “blasphemous” material on Facebook had been taken down at the request of the government.  Facebook has yet to publicly confirm or deny this claim from the Pakistani government. However, earlier this month, Facebook  —   which claims to be “founded” on “principles of free expression,” dispatched a delegation to Pakistan to address the government’s demand for religious censorship. At the time of writing, Facebook did not reply to an inquiry from Breitbart News asking the company if they had removed “blasphemous” material to satisfy Pakistan. Pakistan, a   country which once harboured Al Qaeda leader Osama Bin Laden within its borders, recently launched a crackdown on social media blasphemy. The country’s Prime Minister, Nawaz Sharif has ordered authorities to take urgent steps to remove blasphemous content on social media and apprehend those who post it. Last week, three Pakistani bloggers were arrested on suspicion of blasphemy, and had their laptops seized. If convicted, they could face the death penalty. Pakistan wants social media companies to help identify anonymous posters of blapshemous content, and has announced that it will seek the extradition of any Pakistanis who post blasphemous content from abroad. International affairs magazine The Diplomat has branded the   crackdown a “war on atheism. ” Meanwhile, on Twitter, a hashtag calling for the execution of one of the arrested “blapshemers,” ‘#HangAyazNizami,’ trended in Pakistan as Muslim users took to the platform to call for the blood of heretics.  Fuck with freedom of speech hang this fucker asap. 😏 #HangAyazNizami,  —   Sardar Waqar (@Engrr_vicky) March 25, 2017,  Call us terrorist or extremist or what everbut he must be hanged #hangayaznizami,  —   Daniyal Ahmed (@daniyalaahmed) March 25, 2017,  He must be drag in the streets then hanged #HangAyazNizami,  —   Nida Ahmed (@nidaa214) March 25, 2017,  Western Twitter users reacted strongly against the trend. Some users pointed out the hypocrisy of Twitter allowing these open calls for religious murder on their platform, while cracking down on peaceful western conservative users. Dear @twitter Those posting pro #hangayazNizami tweets are far more dangerous than Milo. https:  .   —   Christina Sommers (@CHSommers) March 27, 2017,  Thousands of muslims who AREN’T terrorists want to hang a blogger for ”blasphemy” and some still want mass Muslim migration  #HangAyazNizami,  —   Joseph  (@JosephBrowno) March 27, 2017,  Those tweeting #HangAyazNizami for ”blasphemy” are insecure, petty, weak little cowards. @Jack  @Twitter should take note.  —   Maajid (@MaajidNawaz) March 26, 2017,  See this hashtag #HangAyazNizami  learn what ordinary Pakistanis want done to a secular blogger now in serious peril. This is NOT a fringe. https:  .   —   Ali A. Rizvi (@aliamjadrizvi) March 26, 2017,  I’m wondering if prominent Muslim voices such as @lsarsour will publicly condemn this #HangAyazNizami, or if she’ll completely ignore it.  —   Child Of Kekistan (@ChildofKekistan) March 27, 2017,  Twitter has yet to respond to an enquiry from Breitbart News, which asked the company why calls for violence against a blogger remain on the platform, and whether such posts violate the platform’s guidelines on “hate content. ” You can follow Allum Bokhari on Twitter and add him on Facebook. Email tips and suggestions to abokhari@breitbart. com.'"}, "time": 1742564028.8357635}