{"duration": 0.11943364143371582, "input_args": {"text": "'Europe Hopes for Clinton Win for More Deals With Iran November 01, 2016 Europe Hopes for Clinton Win for More Deals With Iran \\nAfter a year of disappointment, European businesses are hoping a victory for Hillary Clinton in the U.S. election next week may help break the logjam that has prevented large-scale Western investments in Iran since the opening of its economy. While no one in Europe is predicting a flurry of new deals should Clinton defeat her Republican rival Donald Trump on Nov. 8 A win for the Democrat would remove some of the political clouds hanging over last year\\'s nuclear deal between Iran and world powers. Business groups say this could help fuel a more aggressive push into the Iranian market in 2017, especially in the second half of the year, if a Clinton victory is followed by the re-election of moderate Iranian President Hassan Rouhani next May. \\n\"If Clinton and Rouhani win, then we will have a political window of opportunity that is much bigger than we have now,\" said Matthieu Etourneau, who advises French firms on the Iranian market for MEDEF International, the French employers group. \\n\"This is what the European banks and companies are waiting for,\" he said. \\nBack in January, when the United States and Europe lifted sanctions related to Iran\\'s nuclear program, the excitement in Europe\\'s business community was palpable. \\nWith a population of 78 million and annual output higher than that of Thailand, Iran was the biggest economy to rejoin the global trading and financial system since the 1991 break-up of the Soviet Union. \\nEuropean politicians flocked to Tehran with dozens of corporate executives in tow. Rouhani, a pragmatist elected in 2013 on a platform to reduce Iran\\'s isolation, traveled to Paris and Rome to promote his country to eager investors. \\nBut within months the euphoria had vanished, replaced by frustration on both sides. \\nBIGGEST OBSTACLE TO IRAN DEAL: US LAWS \\nThe biggest obstacle for European firms seeking to do business in Iran has been the reluctance of the continent\\'s largest banks to finance deals out of fear they could run afoul of U.S. sanctions and incur massive penalties down the line. \\nThe United States has taken steps to reassure the banks. Last month the Treasury Department\\'s Office of Foreign Assets Control (OFAC) issued new guidance to allay concerns about doing U.S. dollar transactions with Iran. \\nREAD MORE: DONALD TRUMP SAYS THAT HILLARY CLINTON\\'S FOREIGN POLICY WILL LEAD TO WORLD WAR THREE \\nBut Secretary of State John Kerry acknowledged at a think-tank event in London this week that banks remained skittish. German officials raised their concerns about the hurdles during a recent visit by U.S. sanctions coordinator Daniel Fried. \\nThis caution is likely to persist, regardless of who is sitting in the White House. Beyond the issue of sanctions, the poor state of Iranian banks after a decade outside the international financial system, the strong state role in the economy and a lack of clarity about the legal system are all deterrents to foreigners. \\n\"Everyone knows now that this will be a long, step-by-step process to build up our economic ties,\" said Friedolin Strack, head of international markets at the Federation of German Industries (BDI). \\nStill, a Clinton victory would be a reassuring signal to Europe. Her close adviser Jake Sullivan was a key figure in the secret negotiations in Oman that paved the way for the landmark agreement that curbed Iran\\'s disputed nuclear activity, and she has defended it during the election campaign. \\nTrump, by contrast, has called it \"one of the worst deals ever made\" and promised to renegotiate it if he is elected. Bankers say the risk of the deal unraveling under a Trump presidency has contributed to the reticence in Europe. \\nRecently however, there have been signs of movement. \\nSmaller German banks, pressed by their clients to support them in Iran, are beginning to offer limited financing and payment services. \\n\"Medium-sized banks that finance the German Mittelstand have a great deal of interest in Iran business and are preparing the groundwork intensively,\" said Siegfried Utzig, acting head of economic policy and international affairs at the Association of German Banks (BvB). \"We can see the light at the end of the tunnel but it\\'s still quite far away.\" Article by Doc Burkhart , Vice-President, General Manager and co-host of TRUNEWS with Rick Wiles Got a news tip? Email us at Help support the ministry of TRUNEWS with your one-time or monthly gift of financial support. DONATE NOW ! DOWNLOAD THE TRUNEWS MOBILE APP! CLICK HERE! Donate Today! Support TRUNEWS to help build a global news network that provides a credible source for world news \\nWe believe Christians need and deserve their own global news network to keep the worldwide Church informed, and to offer Christians a positive alternative to the anti-Christian bigotry of the mainstream news media Top Stories'"}, "time": 1742564611.8882656}