{"duration": 0.13551974296569824, "input_args": {"text": "'WASHINGTON  —   President Trump and his top aides coordinated their response to North Korea’s missile test on Saturday night in full view of diners at Mr. Trump’s    resort in Florida  —   a remarkable public display of presidential activity that is almost always conducted in highly secure settings. The scene  —   of aides huddled over their computers and the president on his cellphone at his club’s terrace  —   was captured by a club member dining not far away and published in pictures on his Facebook account. The images also show Mr. Trump conferring with his guest at the resort, Shinzo Abe, the Japanese prime minister. Shortly before the club member, Richard DeAgazio, who joined Mr. Trump’s club recently, took the pictures, North Korea   a ballistic missile into the sea off its eastern coast. Mr. DeAgazio posted his photographs to Facebook as the two leaders and their staff members reviewed documents and worked on their laptops, using cellphones as flashlights. “HOLY MOLY ! !! It was fascinating to watch the flurry of activity at dinner when the news came that North Korea had launched a missile in the direction of Japan,” Mr. DeAgazio wrote later on Facebook, describing how the two leaders “conferred and then went into another room for hastily arranged press conference. ” “Wow. .... the center of the action! !!” Mr. DeAgazio wrote in the post. The scene at    was first reported by CNN. Mr. DeAgazio did not respond to a call seeking comment. The fact that the national security incident played out in public view drew swift condemnation from Democrats, who said it was irresponsible for Mr. Trump not to have moved his discussion to a more private location. “There’s no excuse for letting an international crisis play out in front of a bunch of country club members like dinner theater,” Representative Nancy Pelosi of California, the Democratic leader in the House, wrote on Twitter. Senators Sheldon Whitehouse of Rhode Island and Tom Udall of New Mexico, Democrats who have called for Mr. Trump’s club to release a list of its members, denounced the president on Monday for discussing the North Korean missile launch in the open. “This is America’s foreign policy, not this week’s episode of ‘Saturday Night Live,’” the senators said in a statement. “We urge our Republican colleagues to start taking this administration’s rash and unprofessional conduct seriously before there are consequences we all regret. ” Republican senators also seemed puzzled by the president’s actions. Senator Marco Rubio, Republican of Florida, said, “Usually that’s not a place where you do that kind of thing. ” Senator John McCain, Republican of Arizona, could barely find words. “Can’t make it up,” he said. Michael J. Morell, a former acting C. I. A. director under President Barack Obama, said, “Every president with whom I have worked would have gone to a private room to have what was potentially a classified discussion. ” Mr. Trump was at his    resort in Palm Beach, Fla.  —   known casually as the Winter White House  —   for a     weekend with Mr. Abe, including time with the prime minister on the golf course and dinners with their spouses. Around 8 p. m. on Saturday, the two leaders appeared for a brief   together at the main entrance to the resort. Mr. Trump ignored a shouted question from a reporter about the North Korean missile test, which had occurred about an hour earlier. The president and his guests dined at the resort’s restaurant during the next two hours, eventually providing the flurry of national security activity that Mr. DeAgazio captured. Around 10:30 p. m. Mr. Trump and Mr. Abe made short statements to a small group of reporters brought to a separate room in the resort. Sean Spicer, the president’s press secretary, told reporters at the White House that Mr. Trump and Mr. Abe had not reviewed classified material on the resort’s patio. Mr. Spicer said the president was briefed about North Korea in a secure location on the property. It is against the law for officials to be handling classified materials in a nonsecure setting. Mr. Spicer said Mr. Trump and his aides were reviewing “news conference logistics” about the North Korean missile test. But national security veterans of past administrations still expressed surprise that Mr. Trump and his staff would not have excused themselves to be able to have candid conversations about the North Korean situation and to review sensitive or classified documents. Discussions about how to respond to international incidents involving adversaries like North Korea are almost always conducted in places that have   protections against eavesdropping, like the White House Situation Room. When presidents are away from the White House, they often conduct important business in a Sensitive Compartmented Information Facility, or SCIF, a location that can be made temporarily impervious to eavesdropping. Such facilities can be installed permanently in places that the president visits frequently, like   . And a communications team travels with the president wherever he goes to ensure that he can communicate securely regardless of where he is. There are examples from the previous administration. In 2011, the White House released a photograph of Mr. Obama and members of his national security team sitting in a secure tent while on a trip to Brazil. Mr. Obama had begun attacks on Libya and was conferring about the military operation. Two years later, Mr. Obama held a dinner with President Xi Jinping of China at the Sunnylands resort in Rancho Mirage, Calif. But the dinner between the leaders was out of sight of members of the public, in a private dining room. Mr. Trump and White House aides who joined him and Mr. Abe for dinner on Saturday, including Stephen K. Bannon, the president’s chief strategist, did not relocate the discussion to a secure location. Mr. Trump appears to enjoy presenting the spectacle of his presidency to those at his privately held club, where members pay $200, 000 to join. While the club is not open to the public, Mr. Trump’s dinner with Mr. Abe was in the club’s dining room, where members and their guests were likely to be. Individual club members can invite guests, submitting a list of names of table guests to security officials ahead of time. But none of that would give them clearance to see sensitive or classified material handled by the president or his aides. In addition to posting the pictures of the North Korea conversation, Mr. DeAgazio also published pictures of himself standing with a person he described as Mr. Trump’s military aide responsible for carrying the nuclear “football”  —   the briefcase that contains codes for launching nuclear weapons. After news reports were published about Mr. DeAgazio’s Facebook account, the account was deleted, along with the photographs. Representatives of the    resort did not respond to requests for comment about Mr. DeAgazio’s use of social media to post photographs of the president.'"}, "time": 1742563239.7938294}