{"duration": 0.06143593788146973, "input_args": {"text": "'This article is part of a series aimed at helping you navigate life’s opportunities and challenges. What else should we write about? Contact us: smarterliving@nytimes. com. Impressive doesn’t have to mean difficult. These five recipes are     cooking at its best. Fettuccine With Asparagus and Smoked Salmon This elegant pasta dish from Florence Fabricant is so easy, it feels like cheating. Make a quick    sauce then toss with pasta, smoked salmon and steamed asparagus. (Here’s a shortcut: Cook the asparagus with the pasta.) Frozen peas are a welcome addition, and dried dill will do if you don’t have, can’t find or can’t afford the fresh sort. Dutch Baby Also known as a German oven pancake, this giant popover is simple: Just dump the ingredients  —   eggs, flour, sugar, milk and a pinch of nutmeg  —   into a blender and give it a good whirl. (You can also whisk everything together in a bowl.) Then pour it into a hot, ovenproof skillet or baking dish that’s sizzling with melted better and bake for about 25 minutes. Serve with confectioners’ sugar, maple syrup or jam. If you’re serving it for dessert, a scoop of ice cream and a drizzle of chocolate ganache would not hurt. Salmon Roasted in Butter Here’s a    dish from Mark Bittman that makes a stunning meatless main course. In a hot oven, melt butter with a sprinkle of fresh herbs in a roasting pan or a large ovenproof skillet until it sizzles. Add the salmon, flip, remove the skin, then allow to roast a few minutes more. Shower with more fresh herbs and serve. Fifteen minutes from start to finish. Garlicky Chicken With   Sauce Get ready to file this foolproof recipe under “the dishes I return to again and again. ” It’s that good. Yes, there are anchovies, but don’t let that scare you. They dissolve, and in cahoots with the garlic, capers and lemon, they make an outrageously flavorful sauce. Melissa Clark calls for boneless chicken thighs here they’re more forgiving and cheaper. But you can use breasts. (Just reduce the cooking time by about 3 minutes.) Serve with rice, which absorbs the heavenly sauce in the most wonderful way. Bittersweet Chocolate Mousse With Fleur de Sel This recipe is like the party trick of desserts. Developed by the molecular gastronomist Hervé This, it requires only good bittersweet chocolate, fleur de sel and a strong arm. Melt the chocolate with a bit of water, then pour into a bowl submerged in an ice bath. Whisk for three to five minutes until it’s fluffy, garnish with a bit of salt and serve. Want more? You might also like: • How to throw a cheap (but elegant) dinner party • Five easy recipes you should know how to make • The best cookbooks for beginning cooks'"}, "time": 1742563201.4536505}