{"duration": 0.2363886833190918, "input_args": {"text": "'The Greatest Name shall do its things, O heart, be of good cheer For by wile and guile the demon shall never become Solomon. \\n~ Hafiz \\nIn 2014, a former, estranged disciple of Seyyed Hossein Nasr’s — an ex-Maryamiyyah member — told me that Seyyed Hossein Nasr and Russian fascist Alexander Dugin and his organization are on quite intimate terms, apparently sharing similar long-term political aspirations, and not just where their purported Traditionalism is concerned. At the time this revelation struck me as a bit odd since Nasr (and specifically his son Vali-Reza) are staunch Atlanticists –- Vali-Reza Nasr being the veritable prized subaltern ornament of Neoconservatism in America — whereas Dugin and his Eurasianism ostensibly (at least where the rhetoric is concerned) stand at the very opposite pole. The complex details of this Nasr-Dugin nexus is a discussion better left for another day, only to say that –- and as recently outlined in one academic monograph [1] — this unlikely fellowship may actually have something to do with Frithjof Schuon’s (d. 1998) underlying ideological “Aryanism” with its “de-semitization” of the theosophical Sufism of Ibn ‘Arabi: an ‘Aryanism’ and ‘de-semitization’ that Dugin’s brand of occult fascism would very much be in agreement with. But let us turn here to the checkered history of the Maryamiyyah Sufi Order itself, which Seyyed Hossein Nasr currently heads [2]. \\nThe Maryamiyyah Sufi Order \\nThe Maryamiyyah is the Sufi order created by the Swiss writer and esotericist Frithjof Schuon (d. 1998) which stems from an Algerian sub-branch of the Shadhiliyah Sufi Order [3]. After briefly visiting North Africa in the early 1930s to meet the charismatic Shaykh Ahmad al-Alawi (d. 1934) [4], from the mid 1930s onward Schuon attracted disciples of his own in his native Switzerland while as of 1936 he also began claiming to be the successor to this same Shaykh Ahmad al-Alawi. The actual successors of Shaykh Ahmad al-Alawi, however, have adamantly denied Schuon’s claims and instead maintain that Schuon only spent a sum total of a few days with their master in the early 1930s; that he was barely even initiated into their order, only authorized to transmit the Muslim confession of belief (i.e. the shahada ); let alone being the Shaykh Ahmad al-Alawi’s actual successor. This, and other related controversies, soon led to a bitter schism within the ranks of the Traditionalist school and specifically a personal falling out between Frithjof Schuon and the leading intellectual light of the movement, the Frenchman Rene Guénon (d. 1951). One recent study published in Iran suggests that Guénon’s premature death in Cairo in 1951 may have even been somehow orchestrated by the Maryamiyyah itself, thus making of Guénon’s demise possibly a murder at their hands since, had he lived longer, Guénon’s rivalry with Schuon would have certainly proven deleterious to Schuon and the Maryamiyyah’s long-term political interests [5]. \\nParticularly after Rene Guénon’s death, Frithjof Schuon’s Maryamiyyah Sufi Order (based at the time in Basle, Switzerland and now operating almost like a quasi-Masonic order) began spreading among some elite Western intellectual circles, claiming in its ranks some notable figures among the academic Islamic Studies as well as the Comparative Religious Studies establishments of the time (eg. Huston Smith, Victor Danner, Cyril Glasse, to name few). During the 1960s Schuon now claimed mystical visions of the “Divine Feminine” in the naked form of the Virgin Mary who anointed him the Avatar of the Age, the Imam Mahdi, the Return of Christ, the Fifth Buddha, the incarnations of Kalki and Vishnu, etc. Within its specific Islamicate context, Schuon’s claims, his ‘universalist’ teachings, and some of the details of his visions of the divine feminine are eerily similar to those claimed by the Baha’i founder Mirza Husayn ‘Ali Nuri Baha’u’llah (d. 1892), with other striking similarities existing between Bahaism and the Maryamiyyah that deserves a detailed comparative analysis in its own right. Today both also enjoy a very cozy relationship with the state of Israel — with the former also sharing a cozy relationship with the Gulf potentates as well as the Moroccan elite. \\nOne feature of the Maryamiyyah practice which they are noted for is that they pray to Schuon as well as the Virgin Mary; and, along with offering blessings ( salawat ) to the Prophet Muhammad and the Madonna, the order also offers daily blessings ( salawat ) to Frithjof Schuon –- a feature of their practice which would certainly scandalize any orthodox Muslim, Sunni or Shi’i. Much of the Maryamiyyah’s teachings and practices also seem to share common elements with the Indian Tantric Left-Hand Path tradition. Schuon’s ‘sacred nudity’ and his spin on the nature of the ‘divine feminine’ would be easily recognizable to any genuine Tantric initiate. Be that as it may, and even under the mountains of obfuscatory terminological mumbo-jumbo that the Maryamiyyah regularly use to conceal the fact, the Left-Hand Path is never mentioned nor is it remotely the ‘orthodoxy’ that Schuon insists upon in his books; but rather it is the very same ‘heterodoxy’ he incessantly decries. To date, the Maryamiyyah have never forthrightly acknowledged this fact or dealt with it in any honest manner. \\nThat said, in 1980 Schuon, his family, entourage and disciples moved from Switzerland to Bloomington, Indiana, and henceforth made it the Maryamiyyah’s headquarters. A series of scandals and public defections rocked the cult throughout the 1980s, and in the early 1990s Schuon was even briefly indicted by an Indiana Grand Jury. These scandals stemmed from Schuon’s “Primordial Gatherings” in Bloomington were scantily clad members of the Maryamiyyah –- with Schuon sometimes appearing completely naked donning only a Native American Lakota head-dress — would publicly engage in activities resembling something between a Native American pow-wow, a Sufi majlis and a Tantric maithuna ceremony. However, the scandals were very swiftly covered up and the public prosecutors and attorneys involved against the Maryamiyyah were eventually intimidated and browbeaten by unknown, behind the scenes actors to drop the case against Schuon: a case, I might add, involving allegations by ex-members of criminal sexual impropriety in the presence of minors (including paedophilia and related felonies). Schuon was also accused of forcing some of his leading disciples to divorce their wives, which he would then promptly re-marry as his “vertical” or ‘spiritual’ wives [6]. \\nSchuon died in 1998 and left a splintered, scandal-ridden organization in his wake with one group gravitating towards the figure of Martin Lings (d. 2005) in the UK — who had served as Guénon’s secretary in Cairo while also being among Schuon’s earliest disciples — with another group congregating around the figure of Seyyed Hossein Nasr in the Beltway area of the United States. More diehard Schuonites stayed in Bloomington, Indiana, and refused to recognize either Lings or Nasr as Schuon’s putative successors and continued with their syncretistic, nudist “Primordial Gatherings” as before. \\nThe Maryamiyyah After Schuon and Its Marriage to Empire \\nBoth Nasr and Lings brought the Maryamiyyah closer to the circles of Western elites. To some degree this was already a process in full swing during Schuon’s own lifetime. But Nasr and Lings each in turn made closer alliances with the British establishment and the American deep state, going so far on occasion to operate in the capacity of covert and clandestine fronts for Anglo-American ‘soft power’ in numerous locales throughout the Muslim world [7]. Seyyed Hossein Nasr himself was already a royalist insider in Pahlavi Iran, especially during the last two decades and a half of the Pahlavi regime, earning his post at Aryamehr (now Shahid Beheshti) University due to his intimate connections with the Shah’s royal court and Farah Pahlavi specifically. It was as a consequence of this royalist connection that he was forced to flee Iran in 1979 following the Islamic Revolution. \\nThat said, while not formally accounting himself among the ranks of the Maryamiyyah, Prince Charles, for example, considers himself to be some kind of (soft) Traditionalist as well as an avid fan of the writings of Guénon, A.K. Coomaraswamy, Schuon, Nasr and other Traditionalists. It should also be pointed out that the presence of Schuonian Traditionalists among assorted reactionary monarchist groups and organizations is a regular feature of their activities virtually everywhere around the world. This would also explain their proximity to the Moroccan royalty and elite. What is not widely appreciated is their alleged closeness to the various potentates and elites in the Gulf kingdoms (who are not usually known for their love of Sufism), and particularly those in the Kingdom of Saudi Arabia and the Hashemite Kingdom of Jordan. Due to his skills and vast connections, some ex-Maryamiyyah members even contend that Martin Lings himself may have been a life-long operative of the British SIS/MI6 [8]. Then there is Seyyed Hossein Nar’s long-time association and friendship with Henry Kissinger; the fact that prominent Turkish Maryamiyyah member Ibrahim Kalin has served as President Recep Tayyip Erdogan’s official spokesman in Turkey for some years now; not to mention the proximity of the Maryamiyyah to the Jordanian royal family and Prince Ghazi specifically who publishes “The Muslim 500” which regularly lauds the policies of the corrupt Gulf kingdoms and celebrates Anglo-American and Israeli policy against Iran and Syria [9]. Certainly the Russian occult fascist Alexander Dugin knows all about these linkages yet continues in his association with Nasr and the Maryamiyyah, which defies conventional explanation when he, his organization and the Russian state that Dugin advises pretend to stand as geopolitical adversaries to everything Nasr, his Maryamiyyah Sufi Order and these Atlanticist connections represent. \\nOn the ground in North America, the Maryamiyyah’s rank-and-file is predominantly composed of upper middle-class professionals (monied and college educated) with white upper middle-class converts being the most preferred among recruits. Liberal, left-leaning and anti-establishment members entering the order are often required to become apolitical and focus instead on the “inner life” and forgo all politics, but over time they are turned conservative (or, rather, reactionary) and instead made to support the establishment conservatism of the Republican Party. One former member has alleged that Seyyed Hossein Nasr was actively canvassing for George W. Bush among his acolytes during both the elections of 2000 and 2004 and for John McCain in 2008, proving that father and son share identical political views and that the proverbial apple does not fall far from the tree. Be that as it may, so much for the ‘Traditionalism’ that ostensibly seeks to shun the convoluted and corrupt materialist politics of the ‘Reign of Quantity’, especially the politics of the West which Traditionalists are supposed to believe represents the epitome of this ‘Reign of Quantity’ – or, as they elsewhere like calling it, “the system of the Antichrist.” The same contact also reported rampant classism, racism and similar discriminatory, elitist attitudes prevalent throughout the Maryamiyyah Sufi Order together with an almost “congenital hatred” for all forms of liberal/leftwing and social justice causes, issues and charities [10]. To deflect and smokescreen from his own role in the Pahlavi regime, Seyyed Hossein Nasr has even gone on public record recently besmirching the memory of Ali Shariati (d. 1977) and accusing him of having been a SAVAK mole [11]; this, while some former members have alleged that the FBI, DHS, NSA, CIA and other agencies of American law enforcement and the US deep state are crawling all over the Maryamiyyah Sufi Order as either full-fledged members, affiliates or sympathizers [12]. \\nAs a process that began under Schuon, the Maryamiyyah has also firmly entrenched itself within important segments of the Islamic/Mid East Studies establishment of the Western Ivory Tower as well as in parts of the Muslim world, strategically placing proverbial ‘gatekeepers’ in key places. Besides Seyyed Hossein Nasr himself, William Chittick, Terry Moore, Hasan Awan, Reza-Shah Kazemi and Alan Godlas are presently just a few of those names associated with the Maryamiyyah at its highest level [13]. The Iranian scholar Gholamreza Avani, who was also at one time a student of Henry Corbin’s — who, for his part, was either generally aloof, if not hostile, to the views of Guénon, Schuon and the Traditionalists — is the most eminent figure of the Maryamiyyah Sufi Order in Iran today. \\nIn recent times, allegations of abuse and cult-like behaviour continue to bedevil the Maryamiyyah’s reputation. A noteworthy incident is the one cited by Koslow (and reiterated by Shahbazi in his book) regarding the initial publication schedule for Mark Sedgwick’s ‘ Against the Modern World ’ [14]. Apparently the book was supposed to have been published by Oxford University Press earlier than 2004. Koslow claims that Sedgwick wrote to him in 2004 to say that Oxford University Press had been “…threatened by the Schuon cult with legal harassment [regarding its initial publication draft]. Rather than face the mafioso tactics thrown at him by the Schuon cult, Sedgwick…backed down and published a rather weak assessment of Schuon’s polygamous activities, criminal actions, visions of nude Virgins and delusions of grandeur…” [15] \\nWithal, it should be underscored that Sufism has not always been (nor is it in all present circumstances) in the service of First World imperial, neo-colonial agendas. Historically many individual Sufis and Sufi orders have actually stood against Western imperialism, colonialism and their lackeys. Amir Abd al-Qadir Jaza’iri (d. 1883) in Algeria, Shamil Daghestani (d. 1859) in the Caucuses, Umar Mukhtar (d. 1931) in Libya and those Iranian Sufi masters with their disciples who stood on the side of the people during the period of the Iranian Constitutional Revolution (1905-09) and later with the Islamic Revolution of 1979 are just some prominent examples of Sufis who have stood against both authoritarianism as well as the colonial powers of their day. \\nUnfortunately Western (and specifically Anglo-American) Sufism has increasingly gone in another direction, allying itself more and more with the agendas of Western establishments and the core interests of Empire in the Muslim world (the Naqshbandi-Haqqani Sufi Order is another notable example here). This turn to the darkside by organized Sufism in the West may also explain one of the heretofore unnoted factors in the growth of Islamist ideologies and organizations among countless disaffected, marginalized (immigrant) Sunni Muslim communities, since such a blatant infiltration of Sufism by the Western establishment, with the inevitable corruption it brings with it, is unquestionably as big a betrayal of the ‘Tradition’ as Islamism itself is. It certainly also explains why a country like the Islamic Republic of Iran is generally weary of the influence and activities of such organizations as the Maryamiyyah Sufi Order and similar. \\nNotes \\n[1] See Gregory A. Lipton, “ De-Semitizing Ibn ‘Arabi: Aryanism and the Schuonian Discourse ,” Journal NUMEN, forthcoming. \\n[2] Seyyed Hossein Nasr’s specific circle in Maryland is sometimes also hyphenated as the Maryamiyyah-Nasriyyah (private correspondence, 2014). \\n[3] Note that the order’s name ‘Maryamiyyah’ is a bow to the Virgin Mary since in Arabic Mary is Maryam . \\n[4] See Martin Lings, A Sufi Saint of the Twentieth Century: Shaikh Ahmad al-‘Alawi , Cambridge, 1993. \\n[5] Abdollah Shahbazi, maryamiya: az frithjof schuon ta seyyed hossein-i-nasr , Tehran, 1393 solar/2014: 101-2 and passim ; an article on the site regnabit.com vaguely suggests the same thing regarding the underlying reasons for Guénon’s demise. \\n[6] See Mark Koslow, Frithjof Schuon: Child Molestation and Obstruction of Justice , http://www.naturesrights.com/knowledge%20power%20book/frithjof_schuon.asp (retrieved 28 October 2016). \\n[7] Private correspondence, 2014. \\n[8] Private correspondence, 2014. \\n[9] Private, correspondence, 2016; see The Muslim 500 site online at, http://themuslim500.com/ (retrieved 30 October 2016). \\n[10] Private correspondence, 2014. \\n[11] See (in Persian) https://www.youtube.com/watch?v=KCf3ErXFjog (retrieved 30 October 2016). \\n[12] Private correspondence, 2014. \\n[13] Private correspondence, 2016. \\n[14] Against the Modern World: Traditionalism and the Secret Intellectual History of the Twentieth Century , Oxford University Press, 2004 \\n[15] Koslow, ibid.'"}, "time": 1742564338.6378381}