{"duration": 0.025832414627075195, "input_args": {"text": "'License DMCA \\nWalking away from a long-standing tradition of covering issues and presidential policies during campaign season, the network evening newscasts have all but abandoned that type of reporting this year, according to recent tabulations from Tyndall Report, which for decades has tracked the flagship nightly news programs. \\nSince the beginning of 2016, ABC\\'s World News Tonight , CBS Evening News and NBC Nightly News have devoted just 32 minutes to issues coverage, according to Andrew Tyndall. \\nDifferentiating issues coverage from daily campaign coverage where policy topics might be addressed, Tyndall defines issues coverage by a newscast this way: \"It takes a public policy, outlines the societal problem that needs to be addressed, describes the candidates\\' platform positions and proposed solutions, and evaluates their efficacy.\" \\nAnd here\\'s how that kind of in-depth coverage breaks down, year to date, by network: \\nABC: 8 minutes, all of which covered terrorism. - Advertisement - \\nNBC: 8 minutes for terrorism, LBGT issues, and foreign policy. \\nCBS: 16 minutes for foreign policy, terrorism, immigration, policing, and the Environmental Protection Agency. \\nAnd this remarkable finding from Tyndall [emphasis added]: \\n\"No trade, no healthcare, no climate change, no drugs, no poverty, no guns, no infrastructure, no deficits. To the extent that these issues have been mentioned, it has been on the candidates\\' terms, not on the networks\\' initiative.\" \\nThese numbers are staggering in terms of the complete retreat they represent from issues-orientated campaign coverage. Just eight years ago, the last time both parties nominated new candidates for the White House, the network newscasts devoted 220 minutes to issues coverage, compared to only 32 minutes so far this year. ( CBS Evening News went from 119 minutes of issues coverage in 2008 to 16 this year.) - Advertisement - \\nNote that during the Republican primary season alone, the networks spent 333 minutes focusing on Donald Trump. Yet for all of 2016, they have set aside just one-tenth of that for issue reporting. \\nAnd look at this: Combined, the three network newscasts have slotted 100 minutes so far this year for reporting on Hillary Clinton\\'s emails while she served as secretary of state, but just 32 minutes for all issues coverage . (NBC\\'s Nightly News has spent 31 minutes on the emails this year; just eight minutes on issues.) \\nIndeed, this approach used to be a hallmark of presidential campaign reporting; outline what candidates stand for, describe what their presidency might look like, and compare and contrast that platform with his or her opponents. i.e., What would the new president\\'s top priorities be on the first day of his or her new administration? \\nIt seems clear that the media\\'s abandonment of issues coverage benefits Trump since his campaign has done very little to outline the candidate\\'s core beliefs. Clinton, by contrast, has done the opposite.'"}, "time": 1742628516.599587}