{"duration": 0.1260523796081543, "input_args": {"text": "'Email \\nPerhaps it’s the stories about rampant Muslim-migrant violence in Germany and Sweden. Maybe it’s that, despite government claims to the contrary, it has been established that there’s no way to vet the Mideast migrants entering our nation. Or it could just be good old-fashioned common sense. Whatever the case, a Michigan town has sent the federal government a clear message: We have no interest in participating in your so-called “Refugee Resettlement Program.” As Breitbart reports : Waterford Township trustees in Oakland County, Michigan, passed a resolution on Monday telling the federal government not to resettle any refugees, including those from Syria, within the township’s boundaries, until the program “has been significantly reformed.” The resolution stated : “The Charter Township of Waterford will not actively participate in the Refugee Resettlement Program until the Program has been significantly reformed, and until it has been demonstrated that the Townships of Oakland County have the capacity to absorb refugees without diverting funds from needy residents or exposing their residents to unwarranted security risks.” \\nWaterford Township isn’t the first entity to cry foul over the feds’ migrant-resettlement social engineering scheme. In late September, Texas formerly withdrew from the government program, although the feds have not given up on trying to flood the state with migrants (informative video on this subject below). And Breitbart tells us of “Oakland County, Michigan, where County Executive L. Brooks Patterson has said he intends to sue the federal government for resettling refugees in the county while failing to comply with the ‘consultation clause’ of the Refugee Act of 1980 that requires the federal government and the director of the Office of Refugee Resettlement to consult with state and local government officials prior to the placement of refugees within their jurisdictions.” \\nThese state and local governments are right to be concerned about the Mideast migrants — especially since the feds have been less than honest. While the latter often claim the newcomers are thoroughly vetted, this is simply an impossibility. First, countries such as Syria don’t have comprehensive Western-style databases containing reliable information on the citizenry. Even more significantly, you can bribe public officials in Syria (and most Third World and Muslim countries) and get official government documents stating you’re whoever you want to be . This is why sources as varied as U.S. intelligence officials, the Greek government, and a NYC Syrian community leader have all warned that the Mideast migrants are unknown quantities . \\nIt is also clear that the current effort to place Muslim migrants in the West is a con. On this point I often quote Dr. Mudar Zahran, a Muslim refugee and Jordanian resistance leader living in Britain. While calling himself a “practicing Muslim,” he also has a warning for the West : \\nKeep the Muslim migrants out of the West. \\nHis reasoning? As Zahran pointed out in a 2015 interview, “Seventy-five percent of those arriving from Syria come from safe area[s]; actually, the ones in disaster areas cannot ... leave.” He pointed out that most of them arrive from safe places such as Turkey or Jordan and bypass poor European countries, instead settling in nations such as Sweden or Germany, “where there is a rich nation with a generous welfare system.” \\nJust as significantly, as of the publication date of this Daily Mail report, the five richest Arab nations — Saudi Arabia, Bahrain, Kuwait, United Arab Emirates, and Qatar — had refused to accept even one single Syrian migrant, despite these countries being far closer to the migrants’ native lands. These nations, despite sharing faith and ethnicity with the migrants, seem to believe they “won’t fit in.” Yet if this is so, why should anyone think they’d fit in (assimilate) in the West? \\nZahran spoke of this as well, saying that “in most cases they [Muslims] don’t seem to fully integrate” and, furthermore, warning of “people who want to turn Europe into a Muslim state.” And the writing may already be on the wall, as the makers of the below video on Dearborn, Michigan — called “Dearbornistan” by many — contend. \\nYet Dr. Zahran claims there’s something more insidious at work here than just unwillingness to assimilate and Arab nations’ indifference to coreligionist plight. As he put it, “You read Arab magazines and Arab newspapers; they are talking about, ‘Good job! Now we’re going to conquest [sic] Europe.’ So it’s not even a secret.” \\nZahran might be referring to the hijra , which in Arabic means “migration” or “journey”; this is a type of jihad conducted not via a hot war but a cold demographic war whose goal is the subsumption of a target people. This aim is sometimes stated, as by the Muslim migrant here , who said that his goal in going to the West was to “Islamize” Europeans. Zahran calls this “the soft Islamic conquest of the West.” \\nYet even Muslim migrants who don’t arrive as stealth- hijra jihadists (and logic dictates that most don’t), can still pose a problem. Germany is said to be “losing control of the streets” and Sweden is much the same , after absorbing large numbers of Mideast migrants. Migrants in Germany committed 142,500 crimes during the first six months of 2016 — amounting to 780 crimes a day (and note: political correctness prevents many such crimes from being reported; the number is no doubt higher). In Sweden, police are so overwhelmed and demoralized that three officers a day quit their jobs, a significant number in a small nation. Moreover, more than 50 Swedish areas are now considered “no-go zones,” places where authorities fear to tread and civil law has broken down. \\nThis migrant lawlessness isn’t hard to understand. British philosopher Edmund Burke noted, “Society cannot exist, unless a controlling power upon will and appetite be placed somewhere; and the less of it there is within, the more there must be without.” In Muslim lands, a great proportion is “without,” with Draconian punishment being the norm; the chopping off of hands and heads and the blinding of people are not uncommon. Yet a prerequisite for the Western norm of relatively light punishment is that a greater proportion of that controlling power will be within. And when the Mideast migrants enter the West, it’s often a “When the cat’s away, the mice will play” situation. Add to this Koranic verses labeling non-Muslims fair game for plunder, rape, and deceit, and it’s a toxic mix. \\nDespite this, the Obama administration forges on ahead with so-called “refugee resettlement,” having accepted 13,210 “Syrian” migrants thus far this year, a 675 percent increase over 2015. Note that Hillary Clinton has vowed to continue in this vein. And migrants of all kinds are now flooding into the United States , owing to our porous borders and Obama’s refusal to enforce immigration law. The result? Our immigrant population is now at an all-time high . \\nAnd further note: Clinton has been caught admitting that she believes in “open borders.” \\nThe question is, does the West have a collective mind so open that its brain has fallen out? If over time we accept one million Muslim migrants and just one-tenth of one percent are terrorists or become so, that’s 1,000 violent jihadists. Moreover, the current push to accept these migrants has nothing to do with compassion, but with importing socialist-leaning voters who can create an unassailable leftist voting bloc. Know that 85 percent of our new immigrants (and almost all illegal migrants) hail from the Third World and Mideast, and 70 to 90 percent of them vote Democrat upon being naturalized. It’s a left-wing “hijra.” \\nSo, yes, when the Left proclaims “Our strength lies in our diversity,” they literally mean their strength. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742563009.6112387}