{"duration": 0.05841803550720215, "input_args": {"text": "'Senate Minority Leader Chuck Schumer ( ) reportedly went on a tirade at a “swanky” Manhattan restaurant Sunday night, screaming at a wealthy patron over her support for President Trump. [Schumer lost his temper when dining at Upper East Side restaurant Sette Mezzo, the New York Post’s Page Six reported.  The top Senate Democrat was dining with friends when he ran into former U. S. Secretary of Health, Education, and Welfare Joseph A. Califano Jr. and his wife, Hilary, at the restaurant. Witnesses say that Schumer became incensed that Hilary, daughter of CBS founder and chairman William S. Paley, voted for Trump, though her husband is a prominent Democrat. “They are a highly respected couple, and Schumer made a scene, yelling, ‘She voted for Trump!’ The Califanos left the restaurant, but Schumer followed them outside,” one witness said of the encounter. “How could you vote for Trump? He’s a liar! He’s a liar!” Schumer reportedly yelled. Hilary confirmed the encounter with Schumer and called the senator’s actions “really rude. ” “Sen. Schumer was really rude   …     He’s our senator, and I don’t really like him. Yes, I voted for Trump. Schumer joined us outside and he told me Trump was a liar. I should have told him that Hillary Clinton was a liar, but I was so surprised I didn’t say anything,” Hilary said. Another witness told a different story about Schumer’s encounter with the couple, saying the senator approached the couple’s table first. “It was a pleasant conversation. Joe said the senator was doing a good job on health care. Joe joked that Hilary voted for Trump. The conversation continued outside because everyone left at the same time,” the witness said. In a statement, Schumer’s spokesperson denied that there was a heated encounter at the restaurant. “[He] and his wife ate at the café on Sunday, engaging in unremarkable conversation with patrons who approached their table. There were no heated exchanges with \\u200eanyone,” the spokesperson said. Schumer has railed against the Trump administration, saying Sunday that President Trump’s proposal for a border wall will not get votes from Republicans or Democrats. He also called on Speaker of the House Paul Ryan ( ) to replace House Intelligence Committee chair Rep. Devin Nunes ( ) and announced that Senate Democrats will filibuster Judge Neil Gorsuch’s nomination to the Supreme Court.'"}, "time": 1742628313.798416}