{"duration": 0.11697769165039062, "input_args": {"text": "'How do you deal with an opponent immune to the truth, whose appeal is atavistic rather than rational? How do you pick off enough of his constituents and prevent him from making inroads into yours? In Donald Trump, Hillary Clinton and her Democratic allies face a candidate for whom there is no precedent in presidential politics. It remains unclear whether Trump can be brought to his knees the way Mitt Romney was by ads like “Coffin” and “Firms,” which alleged that Romney’s investment firm, Bain Capital, closed factories and shipped jobs abroad. In April, during the primary campaign, Politico reported that Geoff Garin, a Democratic pollster currently working for the   “super PAC” Priorities USA Action, contended in a phone interview that Trump’s immunity to criticism worked only in the primaries among Republican voters: “Trump is not Teflon. ” Among all voters, Garin argued, “a majority has come to the conclusion that Trump is unfit for the job and that he would represent a significant risk as president. ” Polling and focus group testing, Garin said, have shown that one ad produced by Priorities, “Grace,” has been highly effective. It shows Grace, who was born with spina bifida, her parents, Chris and Lauren Glaros, and a clip of Trump ridiculing a disabled New York Times reporter. The ad concludes with the father on camera: I asked Garin, along with other strategists and political observers, how they would respond to a long list of Trump’s rambling, theatrical promises, which he would, in fact, be unable to keep. Just a partial list of these includes refusing to defend America’s NATO allies, returning 11 million undocumented immigrants to their home countries, saving $300 billion annually on a prescription drug program that spends only $78 billion a year, nationalizing concealed weapons permits and vowing that “If I become president, we’re gonna be saying Merry Christmas at every store . .. You can leave Happy Holidays at the corner. ” Should Democrats, I inquired, point to the infeasibility of Trump’s proposals and the damaging results of any attempts on his part to follow through? That approach would not work, Garin said, because voters, including many of Trump’s supporters, don’t really “believe he will build a wall, or get Mexico to pay for a wall”  —   they have already discounted many of Trump’s    assertions as hyperbole. “The real case has more to do with his character and temperament,” Garin said. “The biggest concern is that he is temperamentally unsuited to lead the country. ” Celinda Lake, a Democratic pollster unaffiliated with the Clinton campaign, argued in an email that there were risks in attacking specific Trump proposals as unrealistic: In an interesting warning to Democrats, Arthur Lupia, a professor of political science at the University of Michigan, wrote me: Making a related argument, a Democratic strategist who sought anonymity in order to protect his relationship with the Clinton campaign, wrote me: This strategist cited the futility of accusing Trump of hyping crime: Democrats have to negotiate a tricky path in communicating their candidate’s “identification with the main concerns of many of Trump’s voters” on such issues as immigration, the strategist argued. This empathy has to be Robert Borosage,   of the Campaign for America’s Future, a liberal advocacy group, described the problem of attempting to refute Trump   : Clinton’s task, in Borosage’s view, is not an easy one for a politician who has been in the national spotlight for more than a quarter of a century: “H. R. C. ’s challenge is to claim the future  —   one that is different than the past,” Borosage wrote. In his speech in Philadelphia on Tuesday, Bill Clinton sought to address the issue Borosage raises of how Hillary Clinton can plausibly “claim the future. ” The former president referred to his wife’s record of making “positive changes in people’s lives” and noted that his wife is a “woman who has never been satisfied with the status quo in anything. ” Borosage brought up a second point, that Hillary Clinton, who has campaigned on the theme that she will protect and enhance the Obama legacy, needs to jump an additional hurdle: “Her biggest challenge is to be different than Obama  —   bolder, challenging Wall Street, corporate trade and tax deals. ” Borosage’s argument  —   that the Trump campaign is based on attitudes and ingrained belief systems, not on a set of policies  —   points to the difficulty of addressing Trump’s   rhetoric. Douglas Massey, a professor of sociology at Princeton and the author of “Beyond Smoke and Mirrors: Mexican Immigration in an Age of Economic Integration” pointed out in an email, for example, that Similarly, The Wall Street Journal reported in July 2015 that numerous studies These facts are unlikely to dissuade voters convinced that immigrants are taking jobs, committing crimes and undermining American values. From their point of view, any crime by an illegal immigrant is one crime too many. There are many Democrats who believe that taking on Trump does not require nuance or calculation. “When 60 percent of voters say they’ll never consider voting for you and you have a 29 percent approval rating, you’ve got a serious image problem,” Jim Jordan, who managed John Kerry’s presidential campaign and served as executive director of the Democratic Senatorial Campaign Committee, wrote me in an email. “Trump is already gushing blood. This is just blocking and tackling for the Clinton folks. ” Jordan argues that “the two real imperatives” for Democrats are 1) “to deny Trump the ‘I’   ’ space,” and 2) “to keep hammering on how bizarre and dangerous he is to America and our interests around the world. His weird   on Putin and his invitation this week to Russia to invade the Baltics seem like good places to start. ” Despite Jordan’s confidence in Democratic presidential prospects, at the moment Trump has moved ahead of Clinton by 1. 1 percent in the RealClearPolitics aggregation of recent polling. Jonathan Haidt, a social psychologist at N. Y. U. told me in an email that Democrats need to adopt a more subtle strategy in dealing with Trump. This, Haidt argues, is because the The elephant “really runs the show,” Haidt said, Translating this analytic approach to the 2016 election, in Haidt’s view, means that To counter Trump, Democrats have to get into the electorate’s automatic, intuitive and unconscious level of responding to events before attempting a critique based on reasoned argument, according to Haidt. To do this, he wrote, the goal should be to portray Trump in ways that conflict with “deep moral intuitions about fairness versus cheating and exploitation. ” And how do you do that? The next step is to present a vision of Trump that violates “moral intuitions about loyalty, authority, and sanctity:” On Monday night in her speech, Michelle Obama tapped into this theme when she described “the kind of president that I want for my girls and all our children. ” The first lady declared: Haidt put it another way: I could not have said it better myself. Despite the overt chaos, the competing narratives of the fall campaign  —   each side’s attempt to define the other as weak or crazy and itself as tough and dependable  —   are clearly emerging from the conventions. The question is whether the Democratic Party can get emotional enough or reach deep enough into our brains to counter the sheer id of Trump’s primeval appeal.'"}, "time": 1742564540.1723747}