{"duration": 0.10004520416259766, "input_args": {"text": "'As mourners gathered on Tuesday for the funeral of the owner of a popular Brooklyn pizzeria, shot to death in front of his home last week, the authorities released a video of a man being sought in connection with the killing. The owner, Louis Barbati, 61, had been an institution at LB Spumoni Gardens, the restaurant started by his grandfather, an Italian immigrant who started out peddling ices from a   wagon, which is depicted in the company logo. On June 30, Mr. Barbati was shot five times outside his home in the Dyker Heights neighborhood, leaving behind a wife, two sons and the restaurant  —   a fixture on the Brooklyn street corner where it has sat since 1939, topped with fluttering Italian and American flags. St. Ephrem’s Church in Dyker Heights was thick with incense, grief and the unanswered question on every mourner’s face: Why was Mr. Barbati killed? He was best known for doling out spumoni, layered Italian ice cream in pistachio, vanilla and chocolate flavors that gave his family’s restaurant its name. “He was the best boss,” Efraim Meza, 46, a pizza maker who said he had worked for Mr. Barbati for the past 25 years, recalled outside the church. The restaurant was closed on Tuesday for the funeral, which Mr. Meza had attended with a group of six Spumoni staff members. On the restaurant floor, he said, workers were known by the nicknames bestowed by Mr. Barbati, whom Mr. Meza remembered for his playfulness. Mr. Meza’s nickname was Fraggle. Mr. Meza said the restaurant was “like an empty space” without the presence of Mr. Barbati  —   whose catch phrase, “Atta boy,” would fill the cafe. “He would always take care of you,” Mr. Meza added. The New York Police Department on Tuesday issued a video showing a person of interest in the case, with the hope it will generate tips and information from the public. “We’re treating it as a botched robbery,” said J. Peter Donald, a police spokesman. “There’s some other potential motives, but this is the leading theory. ” Mr. Barbati was shot as he returned for dinner with his family, carrying a loaf of Italian bread and more than $10, 000  —   which was not taken. Officials have said that Mr. Barbati carried that much cash home only five or so times a year, without saying why. Detectives are investigating whether his killer knew he was traveling with so much money when he left Spumoni Gardens. Mr. Barbati was wearing jewelry at the time, but that was also left behind, officials have said. In the footage, a man wearing sunglasses, a dark sweatshirt and shorts walks on a sidewalk. The police said investigators wanted to question the man. The assailant has been described similarly to the man in the video clip. Police officials believe he had been waiting for Mr. Barbati as he returned from work. The gunman fled by car as Mr. Barbati called for help before collapsing in his yard. “We don’t know who it is, but we are looking for the public’s help in identifying the shooter,” Mr. Donald said. At Spumoni Gardens, signs in the window memorialized Mr. Barbati, a throwback to an earlier era of Italian Brooklyn, who once had skirmished over the secret recipe for his pizza sauce and who was known as Lu Lu. Arriving at the locked doors, Deanne Smith, a parole supervisor visiting from New Braunfels, Tex. was trying to make sense of the news. She had brought a group of visitors to try the sauce. “It tastes just like my grandmother’s,” Ms. Smith said. “It’s the only place in all of America that does. This is shocking. ” Shortly before she arrived, a hearse bearing Mr. Barbati’s body was driven past the restaurant, according to people who had gathered to pay their respects in its courtyard on Tuesday. One onlooker put his hand on his heart.'"}, "time": 1742563126.4123647}