{"duration": 0.0319976806640625, "input_args": {"text": "\"Russian 'Train Surfers' Risk Their Lives for a Unique Thrill \\nRussian teenagers have long hitched rides on the back of underground trains travelling through Moscow \\nBut some thrill seekers are now taking the craze to new heights - riding on 155mph trains to St Petersburg \\nThe teenagers - who usually sport distinctive ski goggles and masks - cling on to the back of train carriages \\nDespite regular reports of youths being electrocuted and killed, the thrill seekers refuse to reign in their hobby Originally appeared at Daily Mail \\nRussian teenagers are risking their lives in a deadly new craze - surfing fast moving inter city trains. \\nIt has become a common sight in the capital Moscow to see the youngsters - usually sporting distinctive ski goggles and masks - clinging to the back of underground trains to hitch a free ride. \\nBut some thrill seekers are now taking the craze to new heights - mounting the roofs and standing between carriages of St Petersburg-bound locomotives travelling up to 155mph. 2ca20d51 578-3244929-image-a-57_1442936391337.jpg \\nSunset: It has become a common sight near the capital Moscow to see the youngsters clinging to the back of fast-moving trains \\nAlexander Nomernoy, 18, who regularly risks his life riding the inter city trains, said: 'Even the first time riding a train in this way was not scary. I wouldn't call it extreme in the slightest.' \\nThe brazen group of train surfers can be seen waving at the camera in footage as they lie on the roof, clinging on by holding metal jutting from the train's roof. \\nSome even dangle themselves off the side of the carriage as the locomotive gathers pace. \\nOther clips show them sneaking in between carriages at stations before the trains pull away. \\nAnd despite regular reports in Russian media of youths being electrocuted and killed following mishaps, the thrill seekers refuse to stop their dangerous hobby. 2ca20f97 578-3244929-image-a-77_1442936510512.jpg \\nThis Russian teenager clings a carriage as he sits only inches from the floor as the train hits speeds of up to 155mph \\nSpeaking of his hobby Mr Nomernoy said: 'I got interested after seeing a TV broadcast about a guy who died train surfing in Moscow underground. I wondered, how is it possible at all to do that? \\n'Then once when the underground was full of people and I just couldn't get into the train. I needed to get home ASAP, so I decided to give it a try...I jumped on to the back of the train and held on.' \\nMore often than not the train surfers go completely undetected, slipping away before authorities know they are even there. \\n'I actually like riding the long distance trains. It is more dangerous in terms of coming into contact with police to ride the underground - more chances to get caught,' Mr Nomernoy said. \\n'I have tried many different ways of surfing - trams, trolleybuses, buses, underground trains roof and back...I would love to ride the underground train in different cities,' he added.\""}, "time": 1742628582.7325897}