{"duration": 0.14673542976379395, "input_args": {"text": "'SAN FRANCISCO  —   Digital ads pop up online so frequently and ubiquitously that many people are using software to block them. But if you try to stop ads from showing up on Facebook’s desktop website, you will now be out of luck: The social network has found a way to block the ad blockers. On Tuesday, Facebook flipped a switch on its desktop website that essentially renders all ad blockers  —   the programs that prevent websites from displaying ads on the page when a user visits the site  —   useless. The change allows the Silicon Valley company to serve ads on its desktop site even to people who have   software installed and running. “Disruptive ads are an industry problem, and the rise of ad blockers is a strong signal that people just don’t want to see them,” Andrew Bosworth, vice president for Facebook’s ads and business platform, said in an interview. “But ad blockers are a really bad solution to that. ” Facebook’s move is set to add to a furious debate about the ethics of ad blocking. On one hand, many digital ads are a nuisance  —   they slow loading times of web pages and detract from the online experience. Yet the ads also serve as the business foundation for many digital publishers to provide content to readers. Ad blockers have become a threat to publishers including The New York Times and The Wall Street Journal, which are facing declining advertising revenue. About 200 million people worldwide use   software on their desktop computers, according to estimates from PageFair, an     . An additional 420 million use ad blockers on their smartphones, the company said. Several digital publishers, including Wired, Forbes and The Times, have begun experimenting with    techniques, including asking visitors who use ad blockers to “whitelist” their sites so that ads may still appear. “We need to spell this out clearly to our users. The journalism they enjoy costs real money and needs to be paid for,” Mark Thompson, president and chief executive of The Times, said at an ad industry conference in June where he addressed ad blocking. “Advertising is a vital part of the revenue mix. ” Mr. Bosworth of Facebook said ad blockers were “certainly bad for the publications who are robbed of half of the value exchange between users and publishers. ” But rather than blocking all ads, he said, Facebook needed to find a way to serve better ads. Facebook’s move is perhaps the strongest    measure taken by a major technology company, especially one that serves advertising to more than 1. 7 billion monthly users globally. The effort is risky for the company, which prides itself on delivering the best user experience, because it could alienate some people for whom ad blocking is an ideological stance on how they wish to gain access to the internet. To shut down the blockers, Facebook is taking aim at the signifiers in digital ads that blockers use to detect whether something is an ad. Facebook’s desktop sitewide changes will then make ad content indistinguishable from   content. For blockers to get around these changes, Facebook said they would have to begin analyzing the content of the ads themselves, a costly and laborious process. Still, Facebook will continue to let people have some control over the ads they do and do not see. On Tuesday, the company also introduced an overhauled version of its ad preferences tool, which lets people opt out of seeing certain types of ads on the site. That will help Facebook serve more relevant ads, rather than bombard people with ads they do not want. “We want people to help us do a better job with ads, rather than to fundamentally alter the way the service is rendered,” Mr. Bosworth said. The move against ad blockers on the desktop site will not affect blockers used to access Facebook on a mobile web browser, the company said. It will also not apply to Facebook’s mobile apps, which already include advertising that cannot be blocked by outside programs. Facebook did not announce plans to expand the changes to mobile browsers in the future. Executives in the   industry denounced Facebook’s decision, calling it a misguided waste of time that would harm the social network’s members. “It takes a dark path against user choice,” Ben Williams, communications and operations manager at Eyeo G. m. b. H. the company behind AdBlock Plus, wrote in a blog post after Facebook announced the change. The move also stoked the ire of those who support ad blockers because of their ability to prevent the use of tracking software, which is often employed to monitor users’ browsing habits across the web without their knowledge or express consent. But the advertising industry welcomed the change. “Facebook should be applauded for its leadership on preserving a vibrant value exchange with its users,” Randall Rothenberg, president and chief executive of the Interactive Advertising Bureau, said in a statement. “For hundreds of years, advertising and marketing have been central to the delivery of entertainment and services that are otherwise free to consumers. ” For Facebook, which is a member of the I. A. B. advertising forms the core of its business. The company generated $3. 69 billion in profit on $17. 93 billion in revenue in 2015, a majority of which came from paid advertising. In its most recent quarter, Facebook said mobile ads produced 84 percent of ad revenue. One of Facebook’s biggest advertisers recently called into question the effectiveness of some of the company’s ads. On Tuesday, Procter  Gamble told The Wall Street Journal it was scaling back on hypertargeted ad campaigns on the social network. A P. G. spokeswoman said the company would not be spending less money on overall Facebook ads. “Facebook has a history of going out of their way to keep advertisers happy,” said Ian Schafer, founder and chief executive of Deep Focus, an ad agency. “This plays into what advertisers demand in terms of accountability for publishers. ” Others said that Facebook was striking a middle ground by stopping ad blockers but still giving people some options over what ads they would see. “Many users rely on ad blockers because they are concerned about privacy or malware,” said Jules Polonetsky, chief executive of the Future of Privacy Forum, an industry think tank that is funded in part by tech companies, including Facebook. “Facebook’s change lets users continue to use ad blockers to protect themselves, while ensuring ads are displayed. ”'"}, "time": 1742564481.6547265}