{"duration": 0.12462091445922852, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Asia and the Pacific region: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at asiabriefing@nytimes. com. Here’s what you need to know: •   Donald J. Trump’s first appointment put a Washington insider  —   Reince Priebus, the chairman of the Republican National Committee  —   in the crucial gatekeeping role of chief of staff. He also named Stephen K. Bannon, the   media mogul, chief strategist. As Mr. Trump fills out his administration, the appointees will lend shape to a   chaotic agenda, offering the strongest signals yet on whether and how he will carry out campaign promises like deporting millions of illegal immigrants, scrapping trade pacts and   traditional alliances. An immediate question is how Mr. Trump will handle potential overlaps between his vast business dealings and his political role, given that his adult children are leading his transition team and also running his businesses. _____ • Protests against Mr. Trump’s election continued. In one of the largest, on Saturday, masses of marchers descended on Trump Tower in Manhattan, Mr. Trump’s   headquarters and home, some chanting, “Not my president!” More protests are planned, including one aimed at Mr. Trump’s inauguration in January. Facebook’s executives held meetings with staff members and the company’s policy team to try to assuage concerns that misinformation and fake news articles shared on the platform had influenced the election’s outcome. _____ • President Obama is on his way to Europe, where he will face leaders he had long assured that Mr. Trump could not be elected. Their meetings will now be shadowed by uncertainty over the United States’ commitment to NATO. Mr. Obama will visit Athens and Berlin before heading to Lima, Peru, for a summit meeting of the   Economic Cooperation forum. For about half the member states, the gathering will be clouded by the death of the   Partnership trade deal. Mr. Obama is expected to meet on the sidelines with President Xi Jinping of China, a major beneficiary of the pact’s demise, and Prime Minister Malcolm Turnbull of Australia. _____ • New Zealand is assessing the damage from a 7.  earthquake that hit near Christchurch, triggering multiple tsunami waves and forcing evacuations along a stretch of the coastline. At least two people were killed. Military helicopters have been deployed to coastal towns, such as Kaikoura, that have been cut off. _____ • “Did you vote for me to abolish corruption?” Prime Minister Narendra Modi bellowed in a speech, furious over criticism of his abrupt ban on India’s two largest bank notes. “If you asked me, should I do it or not?” His move crippled commerce at markets around the country and left millions standing in line for hours at banks and A. T. M. s. depositing about $45 billion in the devalued notes and taking out $7. 5 billion in new currency. _____ • Interviews with more than two dozen military medical personnel who served or consulted at the American military prison at Guantánamo Bay, Cuba, reveal how secrecy, mistrust and the shadow of interrogation limited doctors’ ability to treat detainees who became mentally ill, some after being subjected to torture or other harsh coercive practices. One was Ramzi bin   an admitted and unapologetic   in the attacks of Sept. 11, 2001. _____ • Alibaba reported $17. 73 billion in sales on Singles Day on Friday. The total was a 32 percent increase from 2015, about half the previous year’s increase, largely because consumers spent less per purchase. • Toyota Motors agreed to pay up to $3. 4 billion to settle a federal class action lawsuit accusing the company of inadequate rust protection on 1. 5 million pickups and sport utility vehicles sold in the United States. • Japan said its economy grew an annualized 2. 2 percent in the third quarter, exceeding estimates. • Here’s a snapshot of global markets. • Prosecutors are preparing to question President Park   over an   scandal, a first for a sitting South Korean president. [Yonhap] • The first female pilot of China’s   fighter jet, who was reported killed in a training accident, was remembered as a “golden peacock. ” [South China Morning Post] • Myanmar government troops burned Rohingya villages as tensions between Buddhists and Muslims escalated in restive Rakhine State. [The New York Times] • Analysts in Indonesia see the enormous Muslim protest this month against the governor of Jakarta as the camouflaged opening salvo in a political campaign to unseat President Joko Widodo. [The New York Times] • China recycles just 20 percent of its packaging material, leaving landfills overloaded in the aftermath of Singles Day. [Caixin] • The United States has agreed to take in refugees currently being housed on the Pacific island nation of Nauru in a   agreement with the Australian government. [The New York Times] • A year after the Islamic State attacks in Paris that killed 130 people and wounded nearly 500, survivors and witnesses shared their stories. [The New York Times] • Chinese women traditionally retain their surnames at marriage, but doing so is an expression of powerful patriarchal values, not, as in the West, of female empowerment. • Less than a week ago, it appeared that a woman would break the    gender barrier to the United States presidency. Here is a collection of stories from American women about the barriers they’ve faced. • Leon Russell, the   rock ’n’ roll songwriter and star, died in Nashville. He was 74. The baseball World Series and the United States presidential election were two possible     events this month. Look to tonight’s sky and you’ll be in for one more. The   supermoon makes a beaming return to the night sky. It’s the closest full moon to Earth since 1948. If you missed it early this morning, you can catch tonight’s rise in spectacular fashion. The moon tonight will appear significantly larger and brighter than usual. (Though some people, our science writer included, argue that the event is overhyped.) You may also hear references to the Beaver Moon, a moniker that the Old Farmer’s Almanac traces to Native Americans’ naming moons to track the seasons. In August, there’s the Sturgeon Moon, when the fish were readily available in the Great Lakes region of the United States. The Strawberry Moon rises in June when the fruit is at its ripest. This week’s moon rise coincides with the time of year beaver traps were set out, before the first freeze. “There are a lot of cool things to find in the night sky these days,” a NASA researcher, Noah Petro said, but tonight is the night “to enjoy the moon. ” Remy Tumin contributed reporting. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help. Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742563952.4840143}