{"duration": 0.17766427993774414, "input_args": {"text": "'Robert Scheer and Lizbeth Mateo Explore the Contradictions of U.S. Immigration Policy Posted on Nov 4, 2016 Lawyer and immigrant rights activist Lizbeth Mateo. (KCRW) \\nIn this week’s episode of “Scheer Intelligence,” the Truthdig editor in chief speaks with the lawyer and immigrant rights activist who self-deported in order to illuminate the plight of immigrants. \\nMateo came to the United States with her family at age 14 and attended college and law school. She returned to Mexico for several days in 2013 and was subsequently denied DACA (Deferred Action for Childhood Arrivals), calling into question her ability to live and work in the United States. \\nIn their conversation, Mateo tells Scheer why she decided to become an activist and self-deport, knowing it was a risky move. She discusses why President Obama has been called by some “The Deporter-in-Chief,” and tells Scheer that whatever happens in the presidential election, immigrants will not forget the politicians who remained silent while Donald Trump insulted them. \\nA rushed transcript follows. \\n—Posted by Alexander Reed Kelly \\nRobert Scheer: Hi. This is Robert Scheer. Welcome to another addition of Scheer Intelligence where the intelligence comes from my guests and in this case it is LIzbeth Mateo, a immigrant activist, who has had a rich history ever since she came into this country, dealing with immigration laws. She came in at the age of fourteen from Oaxaca, she went to local schools, graduated from Venice High School and actually, spent two years at Santa Monica College, where we are broadcasting from. Very proud alumni. Went on, then to Cal State-Northridge and another great local institution and then went up to Santa Clara College, a Jesuit institution in Silicon Valley and graduated from law school. \\nAll of which would now put her in position for a great career except there is a question about her documentation, which is actually the subject of this podcast. Everybody is now talking about immigration reform or getting rid of immigrants or what have you and there is a lot of hypocrisy around this issue but one of the bright spots, although maybe Elizabeth will disagree with me, is that at least here in the state of California, which has been ahead of the country, I think, on immigration reform as far as licenses. In one bill, Jerry Brown, our Governor, signed, you can actually get credentialed as a lawyer and function. \\nWhy don’t we begin with that? On the one hand, you represent the great achievement of the American melting pot. A person who did everything right and yet you could have been eligible for the Dream Act that Obama has proclaimed or seems to support. There is a bit of a mixed record there from Obama on this, which you can discuss, but you have a problem in your record in that you were an activist and one of your activist actions was to self-deport, so why don’t we talk about that. \\nLizbeth Mateo: Yes, first of all, thank you so much for inviting me, for having me here. I am essentially what a lot of people call a dreamer. I came to the US at a very young age. I went to high school, college in the area, I graduated from law school and yes, California has been, I think, at the forefront of immigrant rights issues for a long time. We are able to get in-state tuition, pay like everyone else who is a citizen. Also get certain financial aid and more recently, at least for me, the most crucial thing in my career is that I can actually get a license. I can take the Bar, get a license, and practice law. \\nThe issue is, now, I can’t work legally in the US. I don’t have a work permit because I do qualify, in my opinion, for deferred action for childhood arrivals or DACA as most people know it, which is a program that President Obama created in 2012. \\nHowever, as part of my activism, I left the country in 2013, briefly, with two other young people and we joined a campaign called the Bring Them Home Campaign. We essentially met with other young people in Mexico who had been deported, who had left for family reasons, for other emergencies, who wanted to come home. We came back , the nine of us, we were named the Dream Nine and we presented ourselves at the border and asked the government to allow us to come home, which they did after seventeen days in detention and so, I went on to law school, thinking I am going to remain in this country, I have been allowed to come home and I am going to apply for DACA eventually, which I did, only to receive not one but two notices of intent to deny from the government citing that exit. That is what I am dealing with right now and that is what I am fighting for. \\nScheer: So this is a situation that a lot of people fall into. That something has gone array in their papers either because they were really great citizens, like you, activists to try to make the country better or they had some technical difficulty. \\nSpeaking as a lawyer, what can be done now, not just in your case, where do we stand on the immigration issue? I know the Democrats are saying they are great on it and they are getting a lot of votes based on that. They weren’t always great and the Republicans are being led by an out and out neo-fascist, Donald Trump, who wants to just blame, when he is not blaming Muslims, he wants to blame immigrants, undocumented immigrants, for all of our problems. Of course, they have nothing to do with it. We are in a weird place where the good people haven’t always been so good. \\nMateo: Yes, and that is a problem. Especially during this election that has been very negative, where immigrants have been described with some of the most horrible words but I think, at least for me, not so much from the stand point of a law graduate or a future lawyer, but more from the stand point of an immigrant and an organizer, I think that we need to be ready regardless of who becomes President. Even if it is Hilary Clinton. She is saying some great things about immigrants now but she hasn’t always been on our side. She was the first one to call for the deportation of minors, refugee children from Central America. She has agreed with the policies of President Obama to deport almost three million people at this point, 2.5 million people, including many of those refugee children, many of who are still in jails across the country at this point. \\nTo me, that is just unacceptable that in this country we put kids in jails, in prisons. I think whoever becomes President, we have to be ready to keep organizing like we have so far and that is part of the reason why I am speaking out on my case and why the government wants to deny me a benefit that, one, I qualify for and two, that I think I have worked very hard for and have, in many ways, earned through my activism, through my work in my personal life and that is the kind of message that I am trying to send to the community at this point. \\nScheer: You know, living here in Los Angeles and running into a lot of people, students of my own at USC and elsewhere who have questionable status, they are a little angry with Obama and some of them, my students, have called him the Deporter in Chief. \\nMateo: He is the President who has deported more undocumented immigrants in the history of this country and that is ... \\nScheer: More than any other President.'"}, "time": 1742562123.322977}