{"duration": 0.17932605743408203, "input_args": {"text": "'POINT JUDITH, R. I.  —   There was a time when whiting were plentiful in the waters of Rhode Island Sound, and Christopher Brown pulled the fish into his long stern trawler by the bucketful. “We used to come right here and catch two, three, four thousand pounds a day, sometimes 10,” he said, sitting at the wheel of the Proud Mary  —   a   named, he said, after his wife, not the Creedence Clearwater Revival song  —   as it cruised out to sea. But like many other fish on the Atlantic Coast, whiting have moved north, seeking cooler waters as ocean temperatures have risen, and they are now filling the nets of fishermen farther up the coast. Studies have found that   of marine species in the Northeast United States have shifted or extended their range as a result of ocean warming, migrating northward or outward into deeper and cooler water. Lobster, once a staple in southern New England, have decamped to Maine. Black sea bass, scup, yellowtail flounder, mackerel, herring and monkfish, to name just a few species, have all moved to accommodate changing temperatures. Yet fishing regulations, which among other things set legal catch limits for fishermen and are often based on where fish have been most abundant in the past, have failed to keep up with these geographical changes. The center of the black sea bass population, for example, is now in New Jersey, hundreds of miles north of where it was in the 1990s, providing the basis for regulators to distribute shares of the catch to the Atlantic states. Under those rules, North Carolina still has rights to the largest share. The result is a convoluted workaround many fishermen view as nonsensical. Because black sea bass are now harder to find in their state waters, North Carolina fishermen must steam north 10 hours, to where the fish are abundant, to even approach the state’s allocation. Mr. Brown and other New England fishermen, however, whose states have much smaller shares, can legally land only a small fraction of the black sea bass they catch and must throw the rest overboard. And New England states like Maine, where fishermen are beginning to catch black sea bass regularly, have only a tiny allocation and no established fishery. “Our management system assumes that the ocean has white lines drawn on it, but fish don’t see those lines,” said Malin L. Pinsky, an assistant professor in the department of ecology, evolution and natural resources at Rutgers University, who studies how marine species adapt to climate change. “And our management system is not as nimble as the fish. ” The mismatch between the location of fish and the rules for catching them has pitted recreational fishermen against commercial ones and state against state. It has heightened tensions among fishermen, government regulators and the scientists who advise them and raised questions for fishery managers that have no easy answers. Reflecting these tensions, Senators Richard Blumenthal and Christopher S. Murphy, both Democrats of Connecticut, noted in a letter to the acting inspector general of the Commerce Department in June that fishermen in their state were experiencing “extreme financial hardship” because the apportionment of resources was so outdated. “We request that your office investigate how the current system impacts the region’s fishermen and whether the structure should be reformed to bring quota allocations in line with current data on actual fish population distribution,” the senators, joined by Representative Joe Courtney, also a Democrat of Connecticut, wrote. “As species of fish move north, the allocation levels should migrate with them. ” Although such shifts in allocations are possible, said Tom Nies, the executive director of the New England Fishery Management Council, in practice they are difficult to execute. “If you’re giving fish to somebody, you’re taking them away from somebody else,” Mr. Nies said. But, he added, fishery managers at state and federal levels are examining ways to take into account the effects of warming ocean temperatures. Those approaches include changes in how permits are structured and giving states with nascent fisheries representation in councils that oversee states where the fish are  . “I would be surprised if you find very many fishermen who will tell you that climate change is not happening,” he said. “I think there’s a clear recognition from everybody that this is a problem, and a lot of people are working on how to address it. ” One approach being actively pursued by scientists and managers is developing methods to incorporate temperature data and other characteristics of the environment into the surveys that regulators use to set fishing quotas. Richard J. Seagraves, the senior scientist for the   Fishery Management Council, said that in a series of surveys distributed and town   meetings held by the council, “the most pressing concern expressed by all parties was the failure to address ecosystem considerations, like a changing climate and the physical effects on fish stocks. ” The government periodically monitors fish species to see if they are thriving or at risk of extinction. The surveys are intended to determine how much fishing a given species can sustain, in order to avoid overfishing. But even in the best case, trying to estimate the size of fish populations is an uncertain proposition. And the migration of species in response to warming temperatures has made the task considerably harder. “From a scientific perspective, there are some really interesting questions,” Dr. Pinsky said. “Where did the fish go? Did we eat them? Or did they go somewhere else? Those are questions we haven’t really had to grapple with. ” A 2014 survey of butterfish  —   a small, silvery fish that provides food for many larger fish species and is popular in Japan  —   illustrated the problem with traditional assessment methods. A previous survey of butterfish had been unsuccessful at figuring out how robust the population was  —   there was too much uncertainty in the assessment’s sampling of the fish. Because regulators could not make a judgment about the status of the species, butterfish fishing was temporarily suspended. But when a team of scientists began talking to fishermen, they realized that the earlier survey had not taken into account the movements of the butterfish in response to changes in water temperature. “What we learned from working with the fishermen was that the animals were probably occurring outside the survey,” John A. Manderson, a research biologist at the National Oceanic and Atmospheric Administration’s northeast fisheries science center. Dr. Manderson and his colleagues developed a way to factor movement patterns and temperature shifts into models for assessing the fish. Once their work was incorporated into the next survey, which found that butterfish were still plentiful, the fishery reopened. Dr. Manderson said that listening to fishermen, who are often in the best position to know how many fish there are and where they are, was the key to understanding what was occurring. “What started out as an academic exercise turned into a collaborative one,” Dr. Manderson said. Yet it remains difficult to tease apart how much of the dip in a fish population is a result of climate change and how much is a result of overfishing, or even of a natural fluctuation in population numbers from year to year. “I think you’ve got to be careful when you react to these things,” Mr. Nies, of the New England fishery council, said. “You want to make sure you’re reacting to a signal and not to noise. ” He noted that there had been cases where regulators incorrectly concluded that a species had collapsed, citing the haddock population in the  . “Here we are 20 years later and we’ve got more Gulf of Maine and Georges Bank haddock than has ever been detected in the last 100 years,” he said. A growing number of scientists and managers favor moving eventually to what they call   management, a system that is focused on the environmental niche a species occupies, rather than individual species themselves. Under such a system, regulation would be aimed at making sure that there are enough fish available to maintain an ecological balance of predators and prey, and quotas might be based on a category of marine species, rather than specific fish. The West Coast has already adopted some version of this approach in the north Pacific, setting an overall quota for groundfish caught in the Bering Sea. Temperature affects fish species differently. “Climate change is going to make it hard on some of those species that are not particularly fond of warm or warming waters,” said Mr. Brown, who is the president of the Rhode Island Commercial Fishermen’s Association, a trade group. “But as the impacts of climate change descend upon us, there are also species that are going to be victorious, hugely victorious. ” Yet the changes are happening so fast that regulators will have to adapt quickly if they are to have any hope of keeping up. Marine species, Dr. Manderson said, are moving north at 10 times the rate of animals on land. “Our ideas of property rights and laws are purely ” he said. “But the ocean is all about flux and turbulence and movement. ” He added, “Even the science is too slow. ”'"}, "time": 1742562189.1421454}