{"duration": 0.2343616485595703, "input_args": {"text": "'Political analyst of the Daily Mail Introduced by Lasha Darkmoon with additional comments (includes historic 20-minute video) “Most European leaders can barely bring themselves to look at him.” — Dominic Sandbrook LASHA DARKMOON’S INTRODUCTION : Only yesterday an esteemed political commentator on my site had these prophetic words to say: “Whoever wins, it’s going to be a shock to end all shocks. Half of America will be shocked by jubilant rapture, the other half by black despair. I’ve never know any other election like this.” \\nLike so any others who have ended up with egg on their faces, the same commentator had confidently predicted a victory for Hillary Clinton. These false prophets, among whom we can number the author of this present article, Dominic Sandbrook, were convinced that Hillary Clinton would soon be installed in the White House. Here is what our esteemed commentator told us yesterday. How hollow and even ridiculous his words sound today! I quote them only because they are so typical. \\nListen buddies, you are my online friends and I hope you’re all gonna be made very happy tomorrow morning as Trump becomes the new Augustus of Pax Americana . But I have this sinking feeling in my gut that it ain’t gonna happen. Hillary is gonna win because all the cards are stacked in her favor. \\nRemember this, even if 70% of Americans vote for Trump, those Diebold voting machines are gonna turn real nasty and start spitting out fire and devil smoke. \\nAnd it’s gonna be Crazy Hillary and rapist Hubby Bill waltzing into the White House and up the gallery stairs into the hot tub on the top floor, with assorted nymphettes simpering among the bubbles and going “Oooh! . . . Ahhh! . . . take it easy sir, I’m only a Girl Scout!” \\nYa can’t make this up. 🙂 \\nSilly words? Obviously. If I’d said them myself, I’d now be blushing with shame for making such a fool of myself. \\nThe fact is, we have all made fools of ourselves, not least the Republican Party that took the unprecedented step of disowning their own candidate, Donald Trump, and giving their support to his Democratic competitor Hillary Clinton. Here was a man, they alleged shamefully, who was was in the pocket of Vladimir Putin and took orders from the Kremlin. He was closer to the Kremlin than he was to Nato. If America elected this man, they spluttered, the trump of doom —no pun intended—would soon be reverberating from Washington to Vladivostok. \\nThe man they spat upon and denigrated so treacherously is now their boss. Let’s hope he punishes them. Let’s hope he puts Hillary behind bars, as he promised . \\nIf he now does a U-turn and cuddles up to the Establishment, and if his first trip abroad is to Tel Aviv, his millions of supporters will know they have been cruelly betrayed. Just as Tony Blair betrayed Britain, turning into one of the greatest liars and war criminals in British history, it remains to be seen if Trump is not going to do a similar U-turn by cuddling up to the enemies of America: to the Rothschilds and Soroses and Adelsons and the neoconservative warmongers who put Israel before America and pay regular visits to the Wailing Wall. \\nAnd so we come now to this “prophetic” article by Dominic Sandbrook, political sage of the Daily Mail . I wish it were satire. It is not. It is written, three days before the election on November 5, with a straight face. Fasten your seat belts, dear readers, and get ready for a good laugh. Here is the mainstream media at its most fatuous and farcical, spewing forth imbecilities for the semi-moronic masses. Oh, how sad! and how deeply sobering. [LD] WHAT IF TRUMP DID WIN? by Dominic Sandbrook \\nThe 45th President of the United States reached his 1,000th day in office yesterday, and he marked it in characteristic style. \\nRising shortly before lunch, the most powerful man in the world took a congratulatory phone call from his closest ally, Russia’s Vladimir Putin, before strolling into the White House Rose Garden, where a group of swimwear models were waiting with an enormous white and gold cake. \\n‘Thank you, Mr President,’ they chorused, ‘for making America great again!’ \\nIf the impromptu party was overshadowed by the chanting of thousands of protesters outside the perimeter, the President showed no sign of being particularly worried. \\n‘Take care of them,’ he told the head of his Russian bodyguard, who had replaced the Secret Service a few months ago. Then he nodded meaningfully at the models: ‘I’ll see you girls later . . .’ \\nAccording to his spokesman, the President spent the afternoon closeted with his advisers in a private suite at his wife Melania’s $1,000-an-hour spa (formerly the White House’s East Wing), discussing the opening of his Senate impeachment trial in a few days’ time. Then he retired for the evening with some of his closest confidants, among them the actor Charlie Sheen, the former heavyweight champion Mike Tyson and the ex-wrestler Hulk Hogan. \\nTo look at the President’s beaming, orange-skinned face, you would hardly know that Washington is in meltdown, that he faces multiple congressional investigations into his finances and that, every day, rival mobs of demonstrators do battle only steps from the White House. \\nNor would you know that the American economy is in deep recession, its cities are ablaze after months of race riots, an undeclared war is raging on the Mexican border and a nuclear conflict now seems inevitable in the Pacific. \\nNever has the gap between image and reality been greater. Never has the world’s greatest republic plunged to such depths. \\nBut then what did you expect from President Donald Trump? \\nThe trouble started within moments of Mr Trump’s unexpected comeback victory in the election of Tuesday, November 8, 2016, when riots broke out in several cities, including Chicago, Boston, Miami and Los Angeles. \\nThousands of buildings were burned, but the new president-elect nevertheless maintained that it had been the ‘greatest night’ in American history: ‘The greatest. Period.’ \\nIn his victory speech he broke with the traditional courtesies by openly pouring scorn on his defeated opponent, Hillary Clinton (‘a major-league loser’), and promising his supporters that ‘Crooked Hillary’ would shortly be facing a ‘long stretch in jail’. LD : Wrong! See the 20-minute video below in which Trump, doing his first apparent U-turn, lavishes words of praise on Hillary and tells Americans how grateful they should be to her for all her hard work and dedication. So what happened to all that talk of putting her behind bars? \\nIn fact, Mrs Clinton remains very much at large. \\nEven though President Trump insisted that her criminal conviction would be one of his chief priorities, and immediately appointed a special prosecutor with a brief to investigate her activities dating back to the Seventies, the FBI are reportedly still trawling through thousands of emails, having unearthed yet another tranche last month. \\nThere were more signs of the new era, meanwhile, at his inauguration ceremony in January 2017, when Mr Trump appeared on the stage waving his ‘Make America Great Again’ baseball cap, in front of a mock-classical façade in which his own surname was spelled out in gigantic, diamond-studded letters. \\nUnusually, the 45th President broke with precedent by refusing to deliver a prepared speech, preferring to ‘speak from the heart’, as he put it. \\nReturning to some familiar themes, he told his audience that his predecessor, Barack Obama, was a ‘terrorist’ and a ‘Muslim’, that most Mexicans were ‘rapists’ and ‘murderers’, that China was ‘in for a shock’ and that Nato was ‘a complete waste of time and money’. \\nMost foreign leaders were appalled. But one man who clearly approved was Vladimir Putin, who had been the first head of state to telephone his congratulations to the new president-elect. \\nAfter only two weeks in office, Mr Trump rewarded his new friend by making his first overseas trip to Moscow, where he assured the press that Mr Putin ‘couldn’t have been nicer’ and promised that under his administration, the Russians would be ‘our number one ally. Number One. I mean that’. LD : It remains to be seen whether Trump’s first trip abroad is to Moscow or Tel Aviv. That would be the litmus test. \\nHis European tour later in 2017, however, was a disaster. \\nAfter Mr Trump was recorded making remarks about Germany’s Angela Merkel that cannot be repeated in a family newspaper, he moved on to London, where he told Theresa May that she had a ‘massive Muslim problem’ and urged her to redevelop Chequers as a high-end golf course. \\nToday, the American republic’s reputation in the world has never been lower. Even at the United Nations it has become a laughing stock, especially after Mr Trump’s UN ambassador, Sarah Palin, gave a speech in which she confused Iraq and Iran, suggested Africa was a single country and joked about dropping a nuclear bomb on Saudi Arabia. \\nOn the U.S.-Mexican border, however, things have gone well beyond a joke. \\nWork on what Mr Trump calls his ‘Great Wall’ began within days of his inauguration, though it is unlikely to be finished before he leaves office and will reportedly cost at least $25 billion. \\nAfter a series of sabotage attacks by Mexican protesters in mid-2018, Mr Trump abruptly lost patience and ordered the U.S. Marines to cross the border and occupy a strip some ten miles deep — which prompted the Mexican government to move its own troops to within a mile or two of the U.S. incursion. \\nAs yet, the two sides have merely skirmished, though the death toll currently stands at almost 400 — a figure that would have been unthinkable three years ago. \\nIt would take only one incident, one clash that gets completely out of hand, to trigger a full-scale war. \\nAt home, meanwhile, Mr Trump’s authoritarian measures, such as his shambolic and callous attempt to deport 11 million undocumented migrants, have provoked outrage. \\nThe summer of 2018 was marked by weeks of rioting in many major cities, while the President’s insistence on declaring the Left-wing activist group Black Lives Matter a ‘terrorist organisation’ sparked huge protests on campuses across the nation. \\nIt was at this point that Congress, already enraged by Mr Trump’s reliance on high-handed and arguably unconstitutional executive orders, began discussing impeachment proceedings against the President. \\nBut of course, this only enraged his loyal supporters, who maintain that he is the innocent victim of a conspiracy masterminded by Barack Obama, the Clintons and the American media. \\nMr Trump himself remains remarkably unruffled by the prospect of impeachment, though some experts claim his famously unearthly hair is a lot thinner than it used to be. \\nHe maintains his Congressional critics are ‘crooks’ and ‘liars’, and has made extraordinarily insulting remarks about the potency and masculinity of both the Democratic leader of the Senate, Harry Reid, and the Republican Speaker of the House, Paul Ryan. \\nRecently, Mr Trump’s attacks on Congress have reached new heights. He now appears to believe that many leading politicians, both Democratic and Republican, have secretly converted to Islam. \\n‘How do we know that the Bushes aren’t Muslims?’ he demanded last week. ‘Why else were they so keen on going to Iraq?’ \\nGenuine Muslims, however, have no place in Mr Trump’s America. He made that very clear within hours of taking the oath of office, when he signed an emergency executive order banning any Muslims from entering the United States. \\nSince he became President 1,000 days ago, attacks on Muslim Americans, including men and women who have worn their nation’s uniform, have reportedly increased tenfold. \\nThere have been arson attacks on mosques in Boston, New York, Chicago and Detroit, all of which Mr Trump refused point-blank to visit afterwards. \\nAll of this has naturally put him at odds with America’s traditional Nato allies. But Mr Trump’s disregard for Nato was well-known even before he took office. \\nMost European leaders can barely bring themselves to look at him. \\nTheresa May has reportedly not even said a word to him for more than a year. But as Mr Trump is fond of reminding people, ‘small-time’ countries such as Britain and Germany are ‘finished’. ‘My friend Vladimir,’ he says smugly, ‘is the strongest man in the world. Apart from myself, obviously.’ \\nAs it happens, the Russian President is scheduled to fly into Washington next week to express his solidarity at the beginning of his friend’s formal trial in the Senate. As usual, Putin is likely to arrive with a large military entourage, many of whom are expected to stay on in the U.S. capital as additional ‘security’ for his beleaguered ally. \\nAs Mr Trump remarked last week, he has already arranged a suitable welcoming committee of young American female interns for his Russian counterpart. \\n‘All gorgeous,’ he said proudly. ‘I just start kissing them . . . and when you’re a president, they let you do it, you can do anything.’ “I can’t stop kissing them. When you’re a president, you can do anything !” \\nThose last words have been something of a motto for Mr Trump. Since his election as President, he has indeed done anything he wants. \\nThe result, however, has not merely tarnished forever the image of the Presidency, driven the American economy into recession and destroyed relations between religions and races. It has shattered the Western alliance, allowed Vladimir Putin to rebuild the Soviet empire and left the United States on the brink of nuclear war with the world’s most populous country. \\nYet even as American cities burn and Congress attempts to drive him from office, Mr Trump remains undaunted. HISTORIC — TRUMP’S VICTORY SPEECH VIDEO : 20 mins'"}, "time": 1742563127.2762766}