{"duration": 0.12211966514587402, "input_args": {"text": "'We Are Change \\n\\nIn today’s political climate even our beer is up for debate. And why shouldn’t it be? This is America. We debate things here. That’s how democracy works. (At least when the issues aren’t taboo.) Recently, it’s shown up in the state of Pennsylvania with Eric Trump, Donald Trump’s son, garnering an endorsement for the Republican candidate from Yuengling, America’s oldest brewery.\\nAnd now the debate turns to political action.\\nWith the most recent statement from Richard “Dick” Yuengling Jr., the 73-year-old owner of D. G. Yuengling & Son’s, located in Pottsville, Pennsylvania — the seat of Schuylkill County — Yuengling said that his company was “behind” Trump. Inevitably, a lashing out occurred in the digital realm with regard to political correctness and expressively personal views. Customers weren’t pleased. They were offended. In fact, some even claimed that they’d never drink Yuengling again.\\nThis is what democracy is, and should be. Sure. And yet, something is lost in the politicized scramble of this ugly election year.\\nA Pennsylvania state representative, Brian Sims, announced on his Facebook page that he was saying “GOOD BYE” to Yuengling Brewery.\\n“I’m not normally one to call for boycotts but I absolutely believe that how we spend our dollars is a reflection of our votes and values! Supporting Yuengling Brewery, that uses my dollars to bolster a man, and an agenda, that wants to punish me for being a member of the LGBT community and punish the black and brown members of my community for not being white, is something I’m too smart and too grown up to do.” \\nSims represents the 182nd district of Philadelphia , which includes a majority of Center City, in addition to parts of Rittenhouse Square, Grays Ferry, and South Philadelphia. I live here. I walk those areas of the city.\\nAnd I see, feel, and hear other elements of our society that go unnoticed or receive little to no attention. To observe this sort of outcry against a presidential candidate is expectantly what democracy was birthed upon, as we know in the city of Philadelphia. We take action. (We like to think.) However, along the way I’ve seen the incessant results of many issues that get buried, in favor of political expediency and trending topics that ultimately define our aggressive actions towards “voting with our dollars”.\\nIf that’s the case, then what about all the other detriments to our standard of living? For instance, the opiate epidemic that is sweeping Pennsylvania and the surrounding states and the rest of the country by storm.\\nAccording to a June 2016 report from the Philadelphia Department of Public Health , entitled “The Epidemic of Overdoses From Opioids in Philadelphia”, drug deaths involving the fatal use of opioids, from 2000-2014, had tripled. In 2014, approximately 47,000 people died from overdoses in the U.S., according to the Centers for Disease Control & Prevention (CDC). Sixty-one percent of that total was attributed to the use of opioids.\\n“Since 1999, the number of prescriptions for pharmaceutical opioid pain relievers in the U.S. more than quadrupled.” \\nOpioid-related overdose deaths in Philadelphia were nearly three times higher in men than among women in 2015. Those deaths were also more than two times as high among whites, as opposed to deaths among African Americans.\\nBetween 2003 and 2015, in Philadelphia, cocaine and benzodiazepines were detected in overdose deaths in tandem with opioids at a rate of 70% and 90%, respectively. During that same period, overdose deaths related to heroin more than doubled in the city, with approximately 400 deaths reported in 2015.\\nIn that same year, there were nearly 700 drug overdose deaths in Philadelphia. That’s more than twice as many deaths from homicide in that same year.\\nFrom 2014-2015, 10% of the nearly 1,300 overdose deaths in Philadelphia were from non-residents. Most of those non-residents were people from New Jersey, Delaware, Maryland, and other parts of Pennsylvania.\\nOnce the president is elected, these issues won’t go away. In fact, they’re extant — some as a surrogate to the system we attribute to healthcare. (One of the most hotly contested issues of partisan bickering in the country.)\\nAdditionally, these effects are increasingly felt in Philadelphia hospitals.\\n“The percentage of Philadelphia hospital emergency department visits related to opioid overdoses increased from approximately 0.4% in 2007 to nearly 0.7% in 2015. In 2015, there were over 6,500 emergency department visits for opioid overdoses. For each opioid-related death, there were approximately 12 hospital emergency department visits.” \\nSo while the country politically corrects itself — whatever that means — myriad issues get buried beneath picking and choosing a side, in response to the emotional disturbances of partisan bickering.\\nRather than dealing with facts, the web of society becomes entangled with He Said, She Said.\\nUltimately, this coercive cultural backwardness and evolutionary substandard, the rattle-mouthed bickering of intellectual thought and deceptive, manipulative action, that matches up more closely with the reptilian species, rather than the spirit of the human heart and the cultural celebration of life and all its wonder, is exactly what gave rise to Trump.\\nAnd our opioid epidemic.\\nSomewhere along the way, the facts were buried beneath the lie. And the truth has become something else, entirely.\\n \\nSources\\nhttp://www.phillyvoice.com/beer-drinkers-disavow-yuengling-after-owner-shows-support-for-trump/ \\nThe post Political Correctness for Yuengling Brewery; What About Our Opioid Epidemic? appeared first on We Are Change .\\n'"}, "time": 1742561910.7350235}