{"duration": 0.11850786209106445, "input_args": {"text": "'With a supplemantry note by Lasha Darkmoon on the Transhumanist Depopulation agenda “We are now in a far worse condition than if Hitler’s clone were to become President on January 20, 2017…. Their plan is far worse than just cloning Hitler and making him President and Commander in Chief. The day of reckoning has arrived.” — Vid Rebel I never said I supported Donald Trump because I liked where he wanted us to go. I did say I was interested in the anger of the Bernie Sanders and Donald Trump voters. On election night a BBC reporter tried to explain how Hillary lost that state which has a huge black vote and lots of technically advanced people from out of state in what Americans call Research-Triangle Park. Obama went there in a last ditch effort to get out the vote. He was popular there amongst the college students. They had voted for him in 2012 but not so much for Hillary in 2016. The BBC reporter told us the people who lived there said they were all Bernie voters. They had zero enthusiasm for Hillary. \\nI previously quoted Mike Rivero who had said that if Hillary Clinton were running in November against Godzilla, the lizard would have his vote. We have seen the Hillary Kool-Aid drinkers go crazy after Donald won. They all live in Bubbles where it would have been career suicide to say you voted against Hillary’s Pay for Pay corruption. \\nI have seen a lot of domestic anti-Trump propaganda from the Far Right because Donald is a Zionist. I agree with Donald that we should stop funding ISIS and let Vladimir Putin take them down. It was Obama who armed ISIS and let a small band become an international menace overnight by allowing them to take Mosul in 2014 and refusing to let the USAF take them out on that highway from Syria. But I do disagree with Donald’s intention to confront Iran. For what? Resisting Zionism? \\nBut fortunately for Iran, what Trump and America’s rulers want will soon become irrelevant. Of course that is not Good News for Americans who blindly follow the people who think they own the government of the United States. \\nI have just now seen from Europe sheer post-election idiocy. Some are claiming that Donald Trump is the puppet of the Fourth Reich and is backed by the same industrialists and money men that had elevated Adolf Hitler to the Chancellorship in 1933. \\nIt is silly to think that the Rockefellers and the Rothschilds backed Trump. \\nI do admit that America is run by a criminal elite. I had written that Catherine Austin Fitts said the US Military and Intelligence Services had given Donald a Green Light to dish out dirt on Hillary. These men were on the inside of the vile Mechanism that runs America but even they thought Hillary was one Witch Too Far to go. \\nI have reported on the Elite End Game many times before. Their plan is far worse than just cloning Hitler and making him President and Commander in Chief. Far worse. \\nThe people who had owned the governments in the West until recently were the 30 Families and their 6,000 Minions. That is according to David Rothkopf, the former CEO of Kissinger Associates and author of Superclass. \\nFortunately for us, the people of the US and Europe are learning to resist. \\nI voted once in a Presidential election where the Democrat was a member of the Trilateral Commission headed by David Rockefeller in North America and Sir Evelyn de Rothschild in Europe. The Republican was a member of the Bilderberg Society headed by Sir Evelyn de Rothschild in Europe and headed by David Rockefeller in North America. You never read that in our Corporate Media. \\nPlease do not call those people who run Hollywood and our TV News Nazis. They are either Jewish or work for Jewish companies.The direct ties of those who thought they were born to rule over us are more to banking than to industry. They are not Nazis. — § — THE TRANSHUMANIST DEPOPULATION AGENDA LD : In a breakthrough interview on The Transhumanist Agenda and the 2016 Presidential Election, Catherine Austin Fitts, former US Assistant Housing Secretary and Publisher of the Solari Report, spoke of the engineered rise of autism, GMO proliferation, the expansion of Entrainment Technology, the rise of Artificial Intelligence and Robotics, and the dumbing down of American students with Common Core. (See here) . These were all, she argued, part of an overarching conspiracy to promote a massive Transhumanist Depopulation Agenda. This would be achieved by an engineered economic Armageddon, leading to mass starvation, food riots and race wars that would wipe billions of people off the face of the planet. How soon this apocalyptic scenario is likely to unfold is anyone’s guess. Any moment now, many doomsayers declare. The coming of Donald Trump is regarded by many as an omen of the End Days. (LD) Vid Rebel continues: \\nCatherine Austin Fitts said the Bankers stole $50 trillion from us. I think they stole a lot more. \\nThe Bankers gave themselves the right to charge us interest on money they created out of nothing in 1694 when they founded the Bank of England. America copied the Bank of England and the German Central Bank when they drafted the legislation for the Federal Reserve in 1910. It became law in 1913 just in time for America to create enough Unpayable Debt at Interest to fund WW I. \\nThe United States entered WW I because the Elite did not want the Allies to accept Germany’s offer to stop the fighting in 1915. The Elite wanted the war to last long enough to bankrupt Britain and France, to set up a Jewish Communist dictatorship in Russia and to make Palestine a British colony for the Jews. None of that benefited voters in Europe or America. And the Bought and Paid For Media cannot understand why we despise both them and the 30 Families that sent them. \\nWe are now in a far worse condition than if Hitler’s clone were to become President on January 20, 2017. \\nThe Elite stole all of our pensions and savings. They sold hundreds of trillions in bad bets otherwise known as Credit Default Swaps just so they could pocket tens of trillions of dollars in premiums. Don’t cry for them. They made people like you (i.e. taxpayers) liable for the inevitable consequences for their actions. Just add another few hundred trillion dollars onto the pile of Unpayable Debts to be taken out of your pension fund, your savings, your bank account and your paycheck. Their malfeasance will become your obligation in the very near future. At least, that is what they are planning. \\nThe Bankers gave you a system in which you cannot have money unless you go into debt. The Federal Reserve will not issue paper money until the Treasury gives them a bond obligating us to pay them interest on money they created out of nothing. You cannot have checking account money until someone takes out a loan and is willing to pay the Bankers interest on money they created out of nothing. \\nIf we had Lincoln’s non-interest bearing Greenbacks, we would not have $20 trillion in national debt and be paying $500 billion a year in taxes to pay the resulting interest. \\nThe recent sharp rise in the interest rate on 30 year Treasury bonds means our financial system is near collapse. \\nA Depression is a period in time when Unpayable Debts are cancelled en masse. Since we foolishly have a debt based system, that means money vanishes every time a debt is discharged in foreclosure or in bankruptcy court. It is this sudden sharp Contraction in the Money Supply that creates all the unemployment. \\nI have quoted Dr Steve Keen many times before. We are headed to the worst Financial Crisis in the past five centuries because we have more Unpayable Debts to cancel than at any time in the past 500 years. \\nSo what is worse than the Fourth Reich? Tens of millions of Americans starving to death or killing their neighbors because they have nothing to eat. \\nIn short, a Race War to end all wars. \\nOf course this is what America’s Elite had planned for them. They stole all of the pension funds and the savings. They created the Trade Deals that closed 58,000 manufacturing plants and sent millions of jobs overseas. They added 55 million people to the country’s population through legal and illegal immigration. They papered over unemployment by using Funny Money to hire 30.6 million federal, state and local workers making it appear like everyone was engaged in productive work. They used Funny Money to give out unearned benefits to tens of million of people to minimize starvation until the Day of Reckoning. \\nThe Day of Reckoning has arrived. \\nThe 30 year Treasury bond’s interest rate at 3% is at record highs for recent years. That means the crash and the Nationwide Food Riots and the Race Wars will soon be upon us. It was only Zero interest rates that kept the Ponzi scheme going this long. \\nThe only Exit Path I see, is for the US military to be asked to stop the Food Riots as soon as they begin to ravage the country. \\nAnd the junior officers in the military must respond by arresting Bankers and seizing their assets to fund Debt Cancellation. \\nOnly Debt Cancellation will provide a painless way out of the coming Financial Collapse.'"}, "time": 1742628489.746631}