{"duration": 0.17160582542419434, "input_args": {"text": "'Assad Says The \"Boy In The Ambulance\" Is Fake - This Proves It \\nDid the viral photo feature a child actor who has already been photographed \\'being rescued\\' before? Donate! Originally appeared at The Moon of Alabama \\nFrom an interview with the Syrian President Bashar Assad by the Swiss SRF 1 TV Channel published October 19 2016: Journalist: This young boy has become the symbol of the war. I think that you know this picture. \\nPresident Assad: Of course I saw it. \\nJournalist: His name is Omran. Five years old. \\nPresident Assad: Yeah. \\nJournalist: Covered with blood, scared, traumatized. Is there anything you would like to say to Omran and his family? \\nPresident Assad: There’s something I would like to say to you first of all, because I want you to go back after my interview, and go to the internet to see the same picture of the same child, with his sister, both were rescued by what they call them in the West “White Helmets” which is a facelift of al-Nusra in Aleppo. They were rescued twice, each one in a different incident, and just as part of the publicity of those White Helmets. None of these incidents were true. You can have it manipulated, and it is manipulated. I’m going to send you those two pictures, and they are on the internet, just to see that this is a forged picture, not a real one. We have real pictures of children being harmed, but this one in specific is a forged one. \\nAssad was half wrong. The picture, printed on page 1 of newspapers all over the \"western\" world, was not \"forged\". It is a real picture from a White Helmet \"rescue\" video distributed by the Aleppo Media Center (AMC) (which is funded by the French French Ministry of Foreign Affairs). But the scene was carefully staged and we immediately recognized it as staged when it appeared. It was staged like many other \"rescue\" scenes with \"kids saved\" by the U.S./UK/D/J/NL financed White Helmets and their associated media. \\nLook for yourself, trust your eyes. \\nThe \"boy in an ambulance\" scene features two identifiable kids. Omran and his sister. \\nBelow are pictures of what we believe are the same kids in different scenes. \\nHere is the girl at another occasion. We will call this scene 1: \\nThe Houston Chronicle reported about this scene and the picture carries this caption: An 8-year-old girl named Aya calls out for her father after an airstrike in Syrian on Monday, Oct. 10, 2016. \\nThis combined one is captioned: Left: 8-year-old Aya in her everyday life in Syria. Right: 8-year-old Aya after an airstrike in Syria. \\nNotice the age as well as the girl\\'s favorite colors - light turquoise and pink. Compared to the left picture the hair on the right looks powdered and artificially teased. While there is trickle of \"blood\" on her face and on her dress no wound is visible. \\nThe Chronicle story is sourced to CNN which includes a short (staged) video and adds: The video and images were posted online by a pro-opposition activist group, Talbiseh Media Center. \\nIt shows an 8-year-old girl in a medical facility, her hair and body covered with dust. There\\'s blood tricking down her forehead, her nose. She looks confused and scared and keeps calling out for her father....Aya was pulled from under rubble along with her family members when an airstrike hit their home in Talbiseh on Monday. Talbiseh, a large town in northwestern Syria, is about 10 kilometers north of Homs. \\nA screenshot detail from the video: \\nThe \"blood\" looks remarkably glossy, unlike natural blood which dries and looks dull pretty fast. The uni-color shirt the girl wears has no arms. \\nNow the same girl in a different \"rescue\" scene. We will call this scene 2. \\nwhstatist1-1.jpg \\nThe truck in the background has a \"White Helmets\" logo on the door. \\nA detail of the above picture. It is the same girl as in scene 1. The hair again seems powdered and teased: \\nNotice: Same habitus, same appearance, same wild hair as in scene 1; no visible wounds; turquoise shirt but with short arms; jeans with glitter \\nHere is the girl at scene 2 in an ambulance: \\nSame shirt and pants as above, no wounds, no pain and not attended to by anybody. Compare this with the video capture of scene 1 the Chronicle and CNN reported on. We strongly believe it is the same girl. \\nNow what seems to be a different take of scene 2. A \"White Helmet\" carries the girl and a boy. Notice the same clothing as in the other scene 2 pics above. The pic as well as some of the above from scene 2 was running in the Daily Mail on August 27. The incident is claimed to be the aftermath of a \"barrel bombing\" in the Bab al-Nairab neighborhood in east-Aleppo. \\nWhy would two different men carry and \"rescue\" the girl. She, like the boy, looks fine - same cloth as above, no wounds, no damage to the extremities, no crying - just curiosity. \\nA detail of the faces in that picture: \\nA detail of the boy\\'s face: \\nNow to the \"boy in an ambulance\" scene. The boy and the reportedly 8-year old girl on August 17 in the Qaterji neighborhood in east Aleppo introduced as \"Omran Daqneesh and his sister.\" (pic source ): \\nThe just \"rescued\" kids sit quietly but completely unattended to in a brand-new €100,000 ambulance. No shock therapy was initiated, no Trendelberg position or at least laying down flat. No one talks to them despite half a dozen photographers being around them. \\nDetails of the kids - here the boy has the powdered and teased \"wild hair\" look. \\nAre these the same kids as in scene 2 above? \\nPresident Assad believes they are. \\nWe agree. We also believe that all three scenes above are staged. The girl is the same in all three scenes. Her younger brother appears in scene 2 and 3. The White Helmets apparently \"rescued\" the girl in three different incidents on or about August 17, August 27 and October 10 in three different locations. \\nIsn\\'t that a remarkably elysian miracle? \\nOr is it all part of the serial production of elaborately staged anti-Syrian propaganda? Delivered by a marketing organization (vid) funded by \"western\" governments and various similar financed opposition \"media organizations\". \\nTrust your eyes.  '"}, "time": 1742562598.2555075}