{"duration": 0.36937522888183594, "input_args": {"text": "'L’influence des USA et de l’Otan dans les rapports de l’UE avec la Chine par Manlio Dinucci Intervenant dans un forum international, le géographe italien Manlio Dinucci synthétise son analyse des armes dont les États-Unis se sont dotés pour dominer l’ensemble du monde. Cet article est d’autant plus important que c’est cette domination clairement assumée, cette organisation unipolaire du monde, que la Syrie, la Russie et la Chine mettent aujourd’hui en cause les armes à la main.\\nRéseau Voltaire | Rome (Italie) | 27 octobre 2016 Je vais tout de suite au nœud de la question. Je pense qu’on ne peut pas parler de relations entre Union européenne et Chine indépendamment de l’influence que les États-Unis exercent sur l’Union européenne, directement et par l’intermédiaire de l’Otan.\\nAujourd’hui 22 des 28 pays de l’UE (21 sur 27 après la sortie du Royaume-Uni de l’UE), avec plus de 90 % de la population de l’Union, font partie de l’Otan, reconnue par l’UE comme « fondement de la défense collective ». Et l’Otan est sous commandement US : le Commandant suprême allié en Europe est toujours nommé par le président des États-Unis d’Amérique et tous les autres commandements clé sont aux mains des USA. La politique étrangère et militaire de l’Union européenne est ainsi fondamentalement subordonnée à la stratégie états-unienne, sur laquelle convergent les plus grandes puissances européennes.\\nCette stratégie, clairement énoncée dans les documents officiels, est tracée au moment historique où la situation mondiale change à la suite de la désagrégation de l’URSS. En 1991 la Maison-Blanche déclare dans la National Security Strategy of the United States : « Les États-Unis demeurent le seul État avec une force, une portée et une influence en toute dimension —politique, économique et militaire— réellement globales. Il n’existe aucun substitut au leadership américain ». En 1992, dans la Defense Planning Guidance , le Pentagone souligne : « Notre premier objectif est d’empêcher qu’une quelconque puissance domine une région dont les ressources seraient suffisantes pour engendrer une puissance mondiale. Ces régions comprennent l’Europe occidentale, l’Asie orientale, le territoire de l’ex-Union Soviétique et l’Asie sud-occidentale ». En 2001, dans le rapport Quadrennial Defense Review —publié une semaine avant la guerre USA/Otan en Afghanistan, aire de première importance géostratégique à l’égard de Russie et Chine—, le Pentagone annonce : « La possibilité existe qu’émerge dans la région un rival militaire avec une formidable base de ressources. Nos forces armées doivent conserver la capacité d’imposer la volonté des États-Unis à n’importe quel adversaire, y compris États et entités non-étatiques, de façon à changer le régime d’un État adverse ou occuper un territoire étranger jusqu’à ce que les objectifs stratégiques états-uniens soient réalisés ».\\nSur la base de cette stratégie, l’Otan sous commandement US a lancé son offensive sur le front oriental : après avoir démoli par la guerre la Fédération Yougoslave, de 1999 à aujourd’hui elle a englobé tous les États de l’ex-Pacte de Varsovie, trois de l’ex-Yougoslavie, trois de l’ex-URSS, et sous peu elle en englobera d’autres (à commencer par la Géorgie et l’Ukraine, cette dernière étant de fait déjà dans l’Otan), en déplaçant bases et forces, y compris nucléaires, toujours plus près de la Russie. En même temps, sur le front méridional étroitement relié à celui oriental, l’Otan sous commandement US a démoli par la guerre l’État libyen et a essayé d’en faire autant avec celui de la Syrie.\\nLes USA et l’Otan ont fait exploser la crise ukrainienne et, accusant la Russie de « déstabiliser la sécurité européenne », ils ont entraîné l’Europe dans une nouvelle Guerre froide, voulue surtout par Washington (aux dépens des économies européennes à qui les sanctions et contre-sanctions ont porté préjudice) pour casser les rapports économiques et politiques Russie-UE néfastes aux intérêts états-uniens. C’est dans la même stratégie qu’entre le déplacement croissant de forces militaires états-uniennes dans la région Asie/Pacifique dans une fonction anti-chinoise. L’U.S. Navy a annoncé qu’en 2020 elle concentrera dans cette région 60 % de ses forces navales et aériennes.\\nLa stratégie états-unienne est focalisée sur la mer de Chine Méridionale, dont l’amiral Harris, chef du Commandement US pour le Pacifique, souligne l’importance : c’est là que passe un commerce maritime d’une valeur annuelle de plus de 5 000 milliards de dollars, dont 25 % de l’export mondial de pétrole et 50 % de celui du gaz naturel. Les USA veulent contrôler cette voie maritime au nom de celle que l’amiral Harris définit comme une « liberté de naviguer fondamentale pour notre système de vie ici aux États-Unis », en accusant la Chine d’« actions agressives en mer Chinoise Méridionale, analogues à celles de la Russie en Crimée ». Pour cela l’U.S Navy « patrouille » la mer de Chine Méridionale. Dans le sillage des États-Unis arrivent les plus grandes puissances européennes : en juillet dernier la France a sollicité l’Union européenne pour « coordonner la patrouille navale de la mer Chinoise Méridionale afin d’assurer une présence régulière et visible dans ces eaux illégalement réclamées par la Chine ». Et tandis que les États-Unis installent en Corée du Sud des systèmes « anti-missiles » mais en mesure de lancer aussi des missiles nucléaires, analogues à ceux installés contre la Russie en Roumanie et bientôt en Pologne, en plus de ceux qui sont embarqués sur des navires de guerre en Méditerranée, le secrétaire général de l’Otan Jens Stoltenberg reçoit le 6 octobre à Bruxelles le ministre des Affaires étrangères sud-coréen, Yun Byung-se, pour « renforcer le partenariat de l’Otan avec Séoul ».\\nCes faits et d’autres encore démontrent qu’en Europe et en Asie la même stratégie est à l’œuvre. C’est la tentative extrême des États-Unis et des autres puissances occidentales de maintenir la suprématie économique, politique et militaire, dans un monde en forte transformation, dans lequel émergent de nouveaux sujets étatiques et sociaux. L’Organisation de coopération de Shanghai, née de l’accord stratégique sino-russe, dispose de ressources et de capacités de travail capables d’en faire la plus grande aire économique intégrée du monde. L’Organisation de Shanghai et les Brics sont en mesure, avec leurs organismes financiers, de supplanter en grande partie la Banque mondiale et le Fonds monétaire international qui, pendant plus de 70 ans, ont permis aux USA et aux plus grandes puissances occidentales de dominer l’économie mondiale à travers les prêts usuraires aux pays endettés et d’autres instruments financiers. Les nouveaux organismes peuvent en même temps réaliser la dédollarisation des échanges commerciaux, en ôtant aux États-Unis la capacité de décharger leur dette sur d’autres pays par l’impression de papier monnaie utilisé comme devise internationale dominante.\\nPour maintenir leur suprématie, toujours plus vacillante, les États-Unis utilisent non seulement la force des armes, mais d’autres armes souvent plus efficaces que celles proprement dites.\\n Première arme : les dits « accords de libre-échange », comme le « Partenariat transatlantique sur le commerce et les investissements » (TTIP) avec l’UE et le « Partenariat Trans-Pacifique » (TPP) dont le but n’est pas seulement économique mais géopolitique et géostratégique. C’est pour cela qu’Hillary Clinton qualifie le partenariat USA-UE de « plus grand objectif stratégique de notre alliance transatlantique », en projetant une « Otan économique » qui intègre celle politique et militaire. Le projet est clair : former un bloc politique, économique et militaire USA-UE, toujours sous commandement états-unien, qui s’oppose à l’aire eurasiatique en ascension, basée sur la coopération entre la Chine et la Russie ; qui s’oppose aux Brics, à l’Iran et à tout autre pays qui se soustraie à la domination de l’Occident. Comme les négociations sur le TTIP ont du mal à avancer à cause de divergences d’intérêt et d’une vaste opposition en Europe, l’obstacle est pour le moment contourné avec l’ « Accord économique et commercial global » (CETA) entre le Canada et l’UE : un TTIP camouflé étant donné que le Canada fait partie du NAFTA avec les USA. Le CETA sera probablement signé par l’UE le 27 octobre prochain, pendant la visite du Premier ministre canadien Trudeau à Bruxelles.\\n Seconde arme : la pénétration dans les pays cible pour les désagréger de l’intérieur. En s’appuyant sur les points faibles qu’a tout pays en mesure diverse : la corruption, l’avidité d’argent, l’arrivisme politique, le sécessionnisme fomenté par des groupes de pouvoir locaux, le fanatisme religieux, la vulnérabilité de vastes masses à la démagogie politique. En s’appuyant aussi, dans certains cas, sur un mécontentement populaire justifié quant à la conduite de leur gouvernement. Instruments de la pénétration : les soi-disant « organisations non gouvernementales » qui sont en réalité la main longue du département d’État et de la CIA. Celles qui, dotées d’énormes moyens financiers, ont organisé les « révolutions colorées » dans l’Est européen, et ont tenté la même opération avec la soi-disant « Umbrella Revolution » à Hong Kong : qui visait à fomenter des mouvements analogues dans d’autres zones de la Chine habitées par des minorités nationales. Les mêmes organisations qui opèrent en Amérique Latine, avec l’objectif premier de subvertir les institutions démocratiques du Brésil, en minant ainsi les Brics de l’intérieur. Instruments de la même stratégie : les groupes terroristes, type ceux armés et infiltrés en Libye et en Syrie pour semer le chaos, en contribuant à la démolition d’États entiers attaqués en même temps de l’extérieur.\\n Troisième arme : les « Psyops » (Opérations psychologiques), lancées à travers les chaînes médiatiques mondiales, qui sont définies ainsi par le Pentagone : « Opérations planifiées pour influencer à travers des informations déterminées les émotions et motivations et donc le comportement de l’opinion publique, d’organisations et de gouvernements étrangers, afin d’induire ou renforcer des attitudes favorables aux objectifs préfixés ». Avec ces opérations, qui préparent l’opinion publique à l’escalade guerrière, on fait apparaître la Russie comme responsable des tensions en Europe et la Chine comme responsable des tensions en Asie, en les accusant en même temps de « violation des droits humains ».\\nManlio Dinucci, et son épouse, Carla, devant la maison natale de Mao Tsé Toung, en 1965. Une dernière considération : ayant travaillé à Pékin avec ma femme dans les années Soixante, contribuant l’un et l’autre à la publication de la première revue chinoise en langue italienne, j’ai vécu une expérience formatrice fondamentale au moment où la Chine —libérée depuis à peine quinze ans de la condition coloniale, semi-coloniale et semi-féodale— était complètement isolée et non reconnue par l’Occident ni par les Nations Unies comme État souverain. De cette période restent imprimées en moi la capacité de résistance et la conscience de ce peuple, à l’époque 600 millions de personnes, engagé sous la conduite du Parti communiste à construire une société sur des bases économiques et culturelles complètement nouvelles. Je pense que cette capacité est également nécessaire aujourd’hui pour que la Chine contemporaine, qui est en train de développer ses énormes potentialités, puisse résister aux nouveaux plans de domination impériale, en contribuant à la lutte décisive pour l’avenir de l’humanité : la lutte pour un monde sans plus de guerres dans lequel triomphe la paix indissolublement liée à la justice sociale.\\nManlio Dinucci Traduction\\nMarie-Ange Patrizio'"}, "time": 1742561716.497871}