{"duration": 0.10603523254394531, "input_args": {"text": "'HOLLYWOOD, Fla.  —   The Republican National Committee is scaling back its financial commitments to some of the most hotly contested states because of flagging   the most concrete evidence yet of how the party’s divisive and protracted presidential race is threatening the party’s entire ticket in November. Committee officials outlined detailed plans in written “playbooks” distributed this year in the most competitive states about how they intended to assist Republican campaigns up and down the ballot with money and manpower. By July 1, Florida was to have 256 field organizers and Ohio another 176, for example, according to a state party chairman in possession of the strategy books who spoke on the condition of anonymity to discuss internal matters. But Sean Spicer, the committee’s chief strategist, acknowledged this week that the committee had begun informing state parties and statewide campaigns that fulfilling such plans would now be “slower. ” He said the pledges had been made with the assumption that Republicans would have “a presumptive presidential nominee by now. ” Just as revealing, the party is also taking steps to create a separate   entity dedicated to Senate races, an acknowledgment that many of the wealthiest contributors are increasingly focused on protecting Republican control of Congress rather than on a presidential campaign they fear is lost. Taken together, the party’s financial difficulties illustrate the considerable fallout Republicans are facing from a nominating contest that could last through   and that features two leading candidates, Donald J. Trump and Senator Ted Cruz, who are deeply troublesome to many leading Republican donors. “I think everything is up in the air,” said Matt Borges, the chairman of the Republican Party in Ohio, which in addition to being a perennial, and perhaps the   swing state is also home to a competitive Senate race this year. That sense of uncertainty, along with ample apprehension, loomed this week over the party’s spring meeting here. What is typically an organizational gathering and convivial reunion for Republican state chairmen and chairwomen and other committee members has been subsumed by an explosive presidential race in which the   is waging open war against the party and its longstanding nomination rules. More worrisome to many veteran Republicans than Mr. Trump’s complaints about the   process, though, is what his nomination could mean for the party’s prospects across the board this fall. Mr. Trump has no   donor network and has given little indication that he is willing to tap into his fortune to give the party the hundreds of millions of dollars it will require to finance its campaigns in the fall. In remarks to committee members here Thursday night, Mr. Trump’s new top strategist, Paul Manafort, sought to allay these fears without being overly specific. “He is prepared to work with the R. N. C. and the committees to raise the money necessary so that we will be well funded,” Mr. Manafort said. In the 2012 elections, the R. N. C. raised more than $409 million. The party has raised $135 million this election, but what is deeply concerning to many Republican candidates, contributors and strategists is that it only had a little more than $16 million on hand, along with nearly $2 million in debt, at the end of March. Mr. Spicer stressed that this was partly because the committee had already begun paying to send staff members to battleground states, well ahead of the same time four years ago. But the party’s modest cash availability underscores how much hangs in the balance with its nominee. “The minute Trump gets the nomination, the party is going to have to raise another three or four hundred million,” said Al Hoffman, a   Republican donor. “Trump should pay for it himself. ” Mr. Hoffman, a former R. N. C. finance chairman, is the sort of contributor who illustrates the party’s predicament. He said he had little appetite to raise money for a   party and would probably focus his efforts this year on helping a local House candidate and assisting the   of his friend, Senator John McCain of Arizona. And he emphasized that he was not alone. “All the donors I’ve talked to have said they want to sit out the presidential and just focus on the Senate and House,” Mr. Hoffman said. Ray Washburne, a Republican   from Dallas who also previously served as a national committee finance chairman, said, “There’s a big switch to doing the Senate races and trying to hold onto the Senate. ” Mr. Washburne said Mr. Trump, who has relied on mostly   contributors in addition to about $36 million of his own money, showed no sign of being prepared for the   demands of a presidential general election. “The Trump group has done nothing about putting together a finance team at all,” he said. And Mr. Washburne would know. A former finance chairman of Gov. Chris Christie’s presidential campaign, Mr. Washburne was brought backstage to meet Mr. Trump in February when Mr. Christie, of New Jersey, endorsed Mr. Trump. Mr. Washburne said Mr. Trump lavished him with praise  —   “he makes you feel like a million dollars”  —   but did not ask him for any help raising money or to connect him with other top  . In the months since, Mr. Washburne said, he has not heard from Mr. Trump, even as donors have asked him, because of his ties to Mr. Christie, how they could help Mr. Trump. “I don’t even know who the hell to tell them to call,” Mr. Washburne said. This sort of unease about Mr. Trump, along with the dislike many of the party’s   donors have for the   Mr. Cruz, has prompted the R. N. C. to begin privately assuring donors that it will create a   Senate Trust fund. Money earmarked for that fund will go entirely to initiatives aimed at retaining the Senate  —   including hiring field operatives and opposition researchers and bolstering digital efforts. “We want to be able to look a donor in the eye and say, ‘Yes, your dollars are going to help maintain the Senate,’ ” said Mr. Spicer, who confirmed the program’s creation. The idea rankled top officials at the National Republican Senatorial Committee, the party’s Senate campaign arm, who said they had not been informed of the R. N. C. ’s Senate plan. The money cannot come soon enough to strategists and campaign officials in the most contested states, many of which, feature a competitive presidential race and   campaigns for Senate and governor. The situation is particularly urgent in Florida, the largest of the traditional presidential swing states, which this year is holding a   contest for Senator Marco Rubio’s seat, the outcome of which could determine control of the Senate. The usually   Florida Republican Party has encountered financial difficulties since Gov. Rick Scott’s preferred candidate for state party chairman was rejected last year, making it more reliant on national assistance. What is more, the sort of     efforts that are typically funded by the parties are especially crucial in Florida, because many of its voters cast absentee ballots or take advantage of early voting. “We’ve never not had a robust absentee and   program in Florida,” said David Johnson, a longtime Republican strategist here. There is similar concern in North Carolina, where what may be the country’s most competitive governor’s race is being fought and where Republicans who have seen private polling say Mr. Trump is trailing Hillary Clinton. But, as in other battleground states, that appears to be delayed until the national party has more clarity about its finances. “The unspoken concern,” said Mr. Borges, the Ohio chairman, is that if Mr. Trump secures the nomination, “he, No. 1, won’t participate in   for the party, and, No. 2, donors won’t want to help the party if he’s the nominee. ” “So that would put a real damper on   in a number of ways. ”'"}, "time": 1742562394.5338209}