{"duration": 0.060259342193603516, "input_args": {"text": "'Budweiser has chosen the charged political issue of immigration as the subject of its Super Bowl LI commercial. [The   spot explains the origin story of the beer company’s immigrant   Adolphus Busch.  The ad, titled “Born the Hard Way,” begins with a young,   Busch being told, “You’re not wanted here! Go back home!” The big budget production eventually sees Busch land on the shores of St. Louis where he built his  . “This is the story of the original   man, one of the founders of the American Dream, making it the hard way, and his path that all came after him followed,” Laura Rowan, of Budweiser’s creative branch told Adweek. “We then see the words appear: ‘When nothing will stop your dream, this is the beer you’ll drink.’ We end with the Budweiser logo and [tagline] ‘This Bud’s for you,’” she said of the ad. Ricardo Marques, vice president and executive for the Budweiser brand in the U. S. says the company’s   Super Bowl ad is “relevant today,” in light of President Donald Trump’s executive order temporarily suspending the U. S. Refugee Admissions Program and his executive order intended to tighten security along the U. S.  border and enhance enforcement of U. S. immigration laws. “It’s true, Adolphus Busch made an incredible journey to this country, and that’s really what this is about. It’s about his vision, his dream, everything that he doest to achieve that,” Marques told AdWeek. “Even though it happened in the 1850s, it’s a story that is super relevant today. That’s what we’re honing in on it’s the pursuit, the effort, the passion, the drive, the hard work, the ambition, that’s really what this is about more than anything else. ” However, Marques insists that the ad’s placement during the Super Bowl is not an attempt at making a political statement. “There’s really no correlation with anything else that’s happening in the country,” he said. “We believe this is a universal story that is very relevant today because probably more than any other period in history today the world pulls you in different directions, and it’s never been harder to stick to your guns. ” Despite Marques’s assurance that the Super Bowl ad is not about making a political statement, his company has recently played politics with its commercials. Bud Light, another brand under the   InBev umbrella, hired and then fired   actors Amy Schumer and Seth Rogen, who starred in the beer brand’s “Bud Light Party” television  last year. One of the   ads enraged viewers, who slammed the Bud Light gender pay   commercial. What’s more,   InBev, which recently cut its revenue projections for the year after reporting a consistent sales slump, invested   levels on its short TV spot. Budweiser ads typically cost between $2 million to $3 million to produce. Add the record $5 million average cost for a   Super Bowl ad, and it’s easy to understand why the brewing company is hoping its $12 to $15 million commercial can spur growth in sales. Budweiser’s   ad will air on FOX during Super Bowl LI on Feb. 5. Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742562249.1834838}