{"duration": 0.07365226745605469, "input_args": {"text": "'Páginas Libres\\nBCRP: ¿economistas mudos ante ejercicio ilegal de la profesión? por Julio César Alba Bravo Socios | 2 de noviembre de 2016 BCRP: ¿economistas mudos ante ejercicio ilegal de la profesión? ¡Qué pintoresco nuestro Congreso! Las prácticas del franeleo, el reino de la informalidad, el descalabro del sistema jurídico, la dictadura de la necedad. En fin, el paraíso del subdesarrollo.\\nLos irresponsables congresistas que llenaron el BCR de mediocridad quizá no sabían que:\\n1. En cuanto los señores Chlimper y Rey se sienten en una butaca del BCR, tendrán altas posibilidades de ser acusados de “Ejercicio Ilegal de la Profesión”. Expliquemos:\\n2. Existe un mandato constitucional (Art. 20) que prescribe la Colegiatura para ejercer determinada actividad profesional. Por su parte, el Código Penal (Art.363) castiga con severas sanciones el “Ejercicio Ilegal de la Profesión” (léase prácticas profesionales sin contar con título y/o sin colegiatura). Las penalidades se hacen extensivas a quienes nombran al ciudadano bendecido por la simpatía del poderoso.\\n3. Ahora bien, para acceder a la colegiatura y desempeñar determinados cargos de evidente especialidad, las leyes 15488 y 24531 señalan con claridad meridiana las condiciones obligatorias que deben satisfacer quienes se desempeñan en la conducción económica del país. Esto en añadidura a lo que especifica la Ley Orgánica del BCR, que en los casos de Chlimper y Rey ha sido groseramente violentada.\\n4. Los defensores de la pareja fujimorista alegan que anteriormente han desempeñado cargos similares otros funcionarios sin especialidad titulada y, por tanto, sin colegiatura profesional. Citan varios personajes que supieron acomodarse a las circunstancias, y cerraron los ojos a la informalidad que cometían con la complicidad de politicastros de turno. Aceptar estos peregrinos argumentos significaría convivir cómodamente con la más grosera ilegalidad y admitir que la costumbre genera derecho por encima de la Constitución, las leyes y demás ornamentos inútiles que exhibe nuestra inefable República.\\nIgnoran que la economía monetaria es una disciplina que los jóvenes aspirantes a economistas califican como “muy tranca”, como para que amateurs como Rey digan que aprenderán rápido. En el caso del otro fujimorista, conviene remarcar que un desempeño impecable en el BCR va mucho mas allá de asistir a un Directorio y firmar sin leer ni entender. Una buena performance es mucho más que un lobbysmo puro y duro.\\nAnte tamaños antecedentes, el que escribe, un modesto economista, voy a intentar sanar enfermos y construir edificios sin preocuparme de leyes, especialidades, colegiaturas y demás sandeces. Como en Perú la ilegalidad es entusiastamente recompensada, y la informalidad es nuestro lema, no importará qué les suceda a mis clientes y pacientes. Firmaré planos e intentaré sanar el cáncer, sacándoles la lengua a los decanos de los Colegios de Ingenieros y de Médicos.\\nA propósito, ¿qué hace el relajado decano de los economistas? No hace nada y su pasividad seguramente la justificará diciendo que hace más de 40 años y mil funcionarios la ley no se aplicó para nada, así que “no jodan”.\\nJulio César Alba Bravo Fuente\\nSenal de Alerta (Peru)'"}, "time": 1742562955.8036225}