{"duration": 0.1275177001953125, "input_args": {"text": "'What would you do if you saw two boys of 6 years wrestling? Their shirts off, red and sweaty, they have a large group of peers around them, cheering, eyes wide and knuckles white. Would you stop them or give the young scraps some advice? Do you see a violent squabble or boys acting on natural impulses which will better equip them to defend their family and neighbours later in life? The answer you give is, in large part, dependent on your gender; so, the fact that this scenario would make an increasingly large number of men upset is a sign of a collapsing civilization. But, nil desperandum , Western civilization has the solution!\\nMere horseplay!\\nAs an early years professional, I saw education academics acknowledging the data—boys need ‘rough and tumble’ play for their mental and physical wellbeing! But they have no way of encouraging this in institutions where boys are immediately reprimanded for making finger-pistols at each other. Without saying it directly, they thought that the majority female teaching staff for younger age ranges were pushing our boys’ natural urge to fight like lion-cubs underground. What’s more, the boys were made to feel bad about themselves and their very nature.\\nTheir solution? They suggested that more men be encouraged to teach younger children and engage in rough play with them. Until the late 1800’s, education was male dominated and boys spent a lot of time with male mentors. But, of course, there has been no effort to bring back that environment. Instead, a compromise between boys being boys and boys being fairy princesses was achieved—playing superheroes.\\nAs though female teachers are going to tone down the disapproval as the boys shoot lasers and magic at each other. The treacherous political class present only feeble attempts to manage the symptoms of our societal masculinity problem; like sticking some tape over the burst pipe of our hemorrhaging testosterone as cultural marxism continues to swing the pick-axe of nth-wave feminism at it. So, it’s high time we took a few swings back.\\nBut, first, we need to teach our lads how to fight. At the age of 6 or 7, Viking children were taught the martial art of Glima. This was not just father and son play-fighting; boys and occasionally girls already wrestle with friends and family up to that age. This was more systematic, a group activity.\\nThe Greeks also taught their boys how to wrestle because our other ancestors could see the big picture. The Hoplites, for example, were individualistic free men of all ages who voluntarily came together to practise combat; this not only strengthened their communities but also allowed these farmers to fend off the Persian Empire. Yet, today, even isolated expressions of violence in computer games are questioned by SJW’s. Nevertheless, all the signs are there—our boys are yearning for the same activities practised by their forefathers.\\n\\nAt college, I started a unofficial fight club—men only. This based in large part on the book and movie of the same name, in which the narrator’s Nietzschean alter ego, Tyler Durden, describes the bubbling frustration inside the ever-increasing number of 30-somethings coming together for underground fights: ‘We’re a generation of men raised by women.’ Naturally, half the guys in my year were participating within a week. But, our young boys should be taught how to fight openly and without shame to avoid hidden expressions of violence and maybe even some mass-shootings by angry, loner teens. When they are young, it is the perfect time to teach them.\\nYoung lads have no intention of seriously injurying their friends; it’s just good fun and produces healthier attitudes towards violence and confidence in self-defence and the defence of one’s community. Furthermore, a recent study has shown that fighting helps to strengthen peer relationships, meaning less bullying and segregation. It is interesting to compare the codes of honour of ancient Greek wrestling etc. with those we intuit as wrestling children.\\nNo intentional hitting or kicking No gouging the eyes or biting No going for the balls! That’s precisely how I used to wrestle with my brothers and friends as a pup; it was just obvious. If someone took things ‘too far’, they were ostracised from the fun, at least until they calmed down and apologised. If someone got hurt, we stopped, checked whether they were just being a pussy or needed to get themselves mended; we kept calm and carried on.\\n‘We’re a generation of men raised by women.’ – Tyler Durden\\nThe data are screaming that men haven’t changed, especially our need to practise fighting. We still have the same natural impulses but their suppression, no, their demonisation has made our men weak and submissive. So much so, many are self-deprecating betas who believe masculinity is toxic, full of white guilt and ashamed of Western civilization. We have everything to be proud of and need to encourage our boys’ fighting spirit so they grow some balls, some confidence in themselves and their kin. That’s the spirit which has kept our enemies, foreign and domestic at bay for thousands of years and will do the same to cultural Marxism, malevolent immigrants and anyone else who wants to have a go. If we want to turn scrapping boys into men first and gentlemen second, we need to organise some fights, not break them up.\\nRead More: A Short History On The Masculinity Of Fighting \\nSave \\nSave \\nSave \\n'"}, "time": 1742564331.078515}