{"duration": 0.06406426429748535, "input_args": {"text": "'from Rogue Money : \\nThe Wolf’s sense of smell has been in confusion of late trying to figure out which way the winds blow. Are free markets about to make a come back, or have they been with us all along, once you fully factor in the effects of “cognitive dissonance” over the past couple decades? Meaning “cognitive dissonance” is also a part of the free market equation, and the markets have just been factoring them in appropriately. \\nOne thing is for sure, the biggest bubble in world history is starting to get “thin in the skin,” as in ready to pop. Which bubble, you ask? The western debt markets. Putting that aside for the moment, the good news of late is that nationalism is on the rise in the USA with a Trump victory, but it ain’t the only thing on the rise. “Yields” are as well folks. It would appear a debt funeral is “dead” ahead, along with an associated paper wake. In a rather timely fashion the professor Ken Schortgen Jr., just provided a top down analysis to a western paper funeral, with historical theories that are now becoming reality. \\nBefore getting into the meat and potatoes of this installment, I have to throw out a theory from an installment written over two years ago. A theory that will fit nicely, and one that states that the markets are actually free. “Free,” just like the international man Doug Casey has said. I know what you may be thinking, that with a supposed honest market filled with “informed” investors that the prior couple of sentences are totally incorrect, especially with respect to the hard asset markets. Incorrect except for one major thing. If free markets are truly free, and additionally allow for the “stupid/cognitive-dissonant” people to freely participate, then I suppose you have to factor in the unpredictability of “stupidity/cognitive-dissonance.” \\nAt least for a while, as it appears responsibility and intelligence may be taking hold in some corners. Witness the public’s uprising in the recent US election, but that same election has released a dose of “election victory cognitive dissonance.” The more things change, the more things stay the same! \\nThe time frames for “stupidity/cognitive-dissonance” (SCD) being an overdeveloped defining factor in free markets are typically limited. Decades apparently mark the political free market’s limits regarding the afore mentioned ‘SCD’. Again, witness the recent election. And the winds seem to be telling one Wolf Gray that we are about to see how Economic Mother Nature presides over the current limits to the time frame that will define the “Fiat King Dollar’s” life span. A life span fueled of late by the last fumes in the gas tank, the typical fumes of cognitive dissonance, plus a dose of stupidity. An ‘SCD’ that I am afraid to say may have just got a boost by the recent election. \\nThe Wolf’s and the Wolfpack’s sense of smell is somewhat confused and would seem to be alone on this bottom up view, so ‘I/we’ could use your guidance. To wit, those happy Trump voters that seem to think the US economic life boats are coming to their immediate aid are about to see a delay to their ‘pocket-book’ rescue, thanks to the ravages that will come with rising debt “Yields.” These rising “Yield” signs say the market is about to let each of us know, “it doesn’t suffer fools gladly.” WG \\nYield! The funeral cometh ! And, sorry folks it can’t be Trumped. There are limits to man’s abilities to forestall “nature” economic and or otherwise. \\nNews that…….Yields? \\nFirst please note the recent top down analysis of the overall business economic landscape by the professor, with reference to Dr. Jim Willie’s theories and analysis. \\nhttps://www.roguemoney.net/stories/2016/11/20/bond-markets-and-dollar-stength-screaming-for-a-savior-to-usher-in-a-currency-reset \\nThe above link leads us nicely to some of the “ground up” business/economic evidence to be witnessed in real time. That being said, no news beat would be complete without a rehash of the undeniable trends that continue asserting themselves….'"}, "time": 1742561754.3359928}