{"duration": 0.03917217254638672, "input_args": {"text": "'Creative Artists Agency (CAA) is set to host a political summit called “Take Action Day” on February 23, signaling that Hollywood is doubling down on political advocacy in the Trump era. [The summit will feature speeches from   U. S. Senator Kamala Harris ( ) and U. S. House Majority Leader Kevin McCarthy (  23) according to Variety. Clients and industry pros are encouraged to attend workshops and view presentations on issues ranging from immigration to civil rights and the environment, among others.  Other speakers include former U. S. Senator Barbara Boxer, Planned Parenthood president Cecile Richards, and Salam   president of the Muslim Public Affairs Council. CAA  —   one of the world’s largest talent agencies  —   represents some of Hollywood’s biggest stars, including directors J. J. Abrams and Kathryn Bigelow, actresses Jennifer Aniston and Emily Blunt and actor Jeff Bridges, as well as politicians like Joe Biden and Barbra Boxer. The agency also represents musicians like Bruce Springsteen, Beyoncé and Lady Gaga. CAA president Richard Lovett says he hopes the summit will offer its   attendees the tools to “take immediate action” on the political issues they are passionate about. “Since 1995, CAA has been committed to providing leadership and support in addressing numerous issues of our time,” Lovett said in a statement. “Our ‘Take Action’ event is meant to educate and inform, and, even more importantly, provide attendees the ability to take immediate action in support of causes about which they are passionate. ” Earlier this month, major Hollywood talent agency   (William Morris Endeavor Entertainment) announced its decision to form a federal political action committee along with plans to invest a “substantial” amount of money to develop “actionable public policy solutions. ” Also this month, United Talent Agency  —   another major Hollywood agency  —   announced plans to cancel its annual Oscar party in lieu of a rally in support of refugees at its Los Angeles office.   Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742562870.7091343}