{"duration": 0.047200918197631836, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. President Obama formally endorsed Hillary Clinton. “I don’t think there’s ever been someone so qualified to hold this office,” he said. He earlier secured a pledge from Bernie Sanders to work closely with Mrs. Clinton to unify Democrats against Donald Trump, though no promise to drop out. Senator Elizabeth Warren also backed Mrs. Clinton on Thursday evening and criticized Mr. Trump for his attack on a federal judge, Gonzalo P. Curiel. “You, Donald Trump, are a total disgrace,” Ms. Warren said in a speech to the American Constitution Society. _____ 2. Our analysis of voter data suggests Mr. Trump has a small but real chance of winning even without gains among nonwhite voters. Exit polls from 2012  —   the source of conclusions that the Republicans needed to broaden their appeal  —   obscured the existence of millions of white,   and older voters with limited education. Those are the very voters who tend to support Mr. Trump. _____ 3. A federal appeals court in San Francisco ruled that the Second Amendment did not guarantee the right to carry concealed weapons. The decision was sharply criticized by the National Rifle Association. But it is in keeping with decisions in other courts, which some analysts say minimizes the likelihood of a Supreme Court review. “This is a huge decision,” an expert in constitutional law said. “This is a major victory for gun control advocates. ” _____ 4. The World Health Organization advised millions of people across Latin America and the Caribbean to delay pregnancy, to avoid having babies with severe brain damage caused by the Zika virus. There is no vaccine against Zika, and efforts to slow its transmission have thus far failed. _____ 5. Politicians, rabbis and government ministers visited a Tel Aviv restaurant district to show solidarity and resolve a day after Palestinian gunmen fatally shot four Israeli civilians there. The terrorist attack, one of the most brazen in months of   Palestinian strikes, prompted Israel to impose controls on Palestinian movements. _____ 6. The San Jose Sharks thwarted Pittsburgh’s plans to hoist the Stanley Cup by hanging on for a   victory on Thursday evening. The Penguins led the Sharks   going into the game, an advantage that no N. H. L. underdog has overcome since 1942. _____ 7. “Warcraft,” the first film to emerge from the   franchise, will be in broad release on Friday. Our reviewer credits the director, Duncan Jones (David Bowie’s son) for imbuing “a Hobbesian war of all against all” with “a little romance and campy winks. ” It’s predictably heavy on cartoonish violence, she says: “Heads pop like grapes and so forth. ” _____ 8. Some symptoms of   stress disorder may have a physical cause. A prominent researcher of brain injuries among military personnel says his team has identified signs of tissue damage caused specifically by explosions. “We talk about PTSD being a psychiatric problem  —   how people responded to the horror of warfare,” said the neuropathologist. “But at least in some cases, no  —   their brain has been damaged. ” _____ 9. One of our   stories today offers a personal journey that illuminates New York City’s history of segregation. Nikole   an investigative journalist who has covered the nation’s struggle over integration, writes about how she and her husband chose to place their daughter in a segregated,   school. “True integration, true equality,” she writes, “requires a surrendering of advantage, and when it comes to our own children, that can feel almost unnatural. ” _____ 10. A law allowing assisted suicide went into effect in California, making it the fourth and by far the largest state to allow the terminally ill to determine the timing of their death. The other three are Oregon, Washington and Vermont. Above, a California woman who has Stage 4 colon cancer and intends to ask for drugs to end her life. _____ 11. Finally, good news: Scientists appear to have made a breakthrough in capturing and storing the greenhouse gas carbon dioxide. They dissolved the gas with water and pumped it into porous basalt in Iceland, where almost all of it adhered as calcite. It took a surprisingly short time, too  —   just two years. “It’s beyond all our expectations,” said an Icelandic project manager. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742628470.991485}