{"duration": 0.14111018180847168, "input_args": {"text": "' (Want to get this briefing by email? Here’s the  .) Good morning. Here’s what you need to know: • Who is the true New Yorker? It’s the day before the New York primary, and Bernie Sanders, Hillary Clinton and Donald J. Trump are promoting their local credentials. Who has the best case? We judge. Winning a majority of New York’s 291 Democratic delegates could give Mrs. Clinton a chance to claim mathematical victory in the nomination race, or it could deliver a significant lift for Mr. Sanders. We take a look at Mr. Sanders’s past campaigns, which reveal a willingness to play hardball. The Vermont senator, who briefly met Pope Francis at the Vatican on Saturday, also released his 2014 tax return. • In the courts. President Obama’s plan to shield millions of undocumented immigrants from deportation and allow them to work in the country legally was sharply questioned during arguments at the Supreme Court today. An appeals court affirmed today the $1 billion N. F. L. concussion settlement. • Powerful earthquakes. Hundreds of doctors and rescue workers are heading to Ecuador’s   areas after Saturday night’s 7.  earthquake. At least 272 people were killed and 2, 527 were injured. Aftershocks continued in Mashiki, Japan, after two quakes  —   with magnitudes of 6. 2 and 7  —   struck within just over a day last week and left at least 42 people dead. The Ecuador and Japan earthquakes, 9, 000 miles apart, are not related, scientists say. • Impeachment vote in Brazil. Legislators in the lower house of Congress voted on Sunday night to approve the impeachment of Dilma Rousseff, the nation’s first female president. The Senate will vote by a simple majority, most likely next month, on whether to hold a trial on charges that she illegally used money from   banks to cover budget gaps during the worst economic crisis in decades. Many of those accusing her are themselves suspected of fraud and graft. • Health care coverage gains. Hispanics accounted for nearly a third of the increase in U. S. adults with insurance in the first full year of the Affordable Care Act, according to our analysis. Immigrants of all backgrounds  —   including more than a million legal residents who are not citizens  —   had the sharpest rise in coverage rates. • Yahoo is accepting   bids for its core Internet business today. • Citigroup sold more than 60 businesses in the past seven years, and its holdings shrunk by $700 billion, illustrating the changing profile of the biggest U. S. banks. •  Amazon is introducing two monthly subscription options to its Prime membership service, a change that could make the company’s video service a tougher competitor to Netflix. • Today is the last day for most individuals to file their 2015 federal income tax returns to the I. R. S. or to request  extensions. Maine and Massachusetts residents have an extra day. • U. S. stocks are rising. . Here’s a snapshot of global markets. • After a trip to Greece, Pope Francis took 12 Muslim refugees from Syria with him back to Rome, where a Roman Catholic charity will help care for them. • A U. N. report said that nearly 2, 000 Afghan civilians have been killed or wounded so far this year, and that more than 80, 000 people have been displaced, record numbers for the   nation. • Nine Guantánamo prisoners from Yemen were sent to Saudi Arabia. • “The Jungle Book” was the U. S.   winner. • Catching up on TV: Episode recaps for “Outlander,” and the season finales of “Girls” and “Vinyl. ” • Amends for slavery? Members of Georgetown University’s community are pressing the school to confront  part of its history: In 1838, 272 slaves were sold to pay the school’s debts and to secure its financial future. Researchers are seeking their descendants. “Ebony and Ivy,” published in 2013, details the connections between slavery and elite U. S. universities’ beginnings. • Off the charts. Here’s a visual look at the    record of the Golden State Warriors’ Stephen Curry. He’ll be in action tonight (10:30 p. m. Eastern, TNT) in the N. B. A. playoffs. The N. H. L. ’s Stanley Cup playoffs continue, too. • On your marks   …     The 120th Boston Marathon is today, with a field of about 30, 000 runners. Roberta Gibb, the first woman to compete and finish the race, is the grand marshal. • In case you missed it   …     Last week, readers devoured articles about Julie Miller, a triathlete accused of cheating, a   account of life in a   and a cabdriver who’s traveled Rome’s roads for 50 years. Plus, “A New Map for America,” and Bono’s reports about his visits to refugee families and camps in Kenya, Jordan and Turkey. • Recipe of the day. This spaghetti carbonara is a deli        that has been  . The winners of the Pulitzer Prizes will be announced this afternoon. It’s the centennial year for the awards, which were created by the estate of Joseph Pulitzer to honor achievement in journalism and the arts. (Our newsroom has earned the honor 117 times.) Pulitzer, a native of Hungary, was paid by a recruiter to come to the U. S. and join the Union Army during the Civil War. After the war, he acquired and merged two newspapers in St. Louis to form the St. Louis  . In 1883, he bought The New York World, which gained a reputation as a champion of   journalism. He changed American journalism by introducing comics, illustrations and coverage of sports and women’s fashion. But Pulitzer also engaged in the kind of sensationalism that led to the term “yellow journalism,” a phrase inspired by the “Yellow Kid” comic strip that appeared in both Pulitzer’s newspaper and that of its chief rival, William Randolph Hearst’s New York Morning Journal. In one newspaper promotion, Pulitzer crowdfunded the money needed for a pedestal for the Statue of Liberty by offering to print on the front page the name of every person who donated to its construction. You may hear his name pronounced as   today. Pulitzer said his name as    and that’s what the Pulitzer Board follows. Your Morning Briefing is published weekdays at 6 a. m. Eastern and updated on the web all morning. What would you like to see here? Contact us at briefing@nytimes. com. You can sign up here to get the briefing delivered to your inbox.'"}, "time": 1742564432.5433798}