{"duration": 0.14362740516662598, "input_args": {"text": "'  => Credit: VDare.com. \\nA couple of remarks in Professor Susan McWillams’ recent Modern Age piece celebrating the 25th anniversary of Christopher Lasch’s 1991 book The True and Only Heaven , which analyzed the cult of progress in its American manifestation, have stuck in my mind. Here’s the first one: \\nIn the most recent American National Election Studies survey, only 19 percent of Americans agreed with the idea that the government, “is run for the benefit of all the people.” [ The True and Only Lasch: On The True and Only Heaven, 25 Years Later , Fall 2016] \\nMcWilliams adds a footnote to that: The 19 percent figure is from 2012, she says. Then she tells us that in 1964, 64 percent of Americans agreed with the same statement. \\nWow. You have to think that those two numbers, from 64 percent down to 19 percent in two generations, tell us something important and disturbing about our political life. \\nSecond McWilliams quote: \\nIn 2016 if you type the words “Democrats and Republicans” or “Republicans and Democrats” into Google, the algorithms predict your next words will be “are the same”. \\nI just tried this, and she’s right. \\nThese guesses are of course based on the frequency with which complete sentences show up all over the internet. \\nAn awful lot of people out there think we live in a one-party state—that we’re ruled by what is coming to be called the “Uniparty.” \\nThere is a dawning realization, ever more widespread among ordinary Americans, that our national politics is not Left versus Right or Republican versus Democrat; it’s we the people versus the politicians. \\nWhich leads me to a different lady commentator: Peggy Noonan, in her October 20th Wall Street Journal column. \\nThe title of Peggy’s piece was: Imagine a Sane Donald Trump . [ Alternate link ]Its gravamen: Donald Trump has shown up the Republican Party Establishment as totally out of touch with their base, which is good; but that he’s bat-poop crazy, which is bad. If a sane Donald Trump had done the good thing, the showing-up, we’d be on course to a major beneficial correction in our national politics. \\nIt’s a good clever piece. A couple of months ago on Radio Derb I offered up one and a half cheers for Peggy, who gets a lot right in spite of being a longtime Establishment Insider. So it was here. Sample of what she got right last week: \\nMr. Trump’s great historical role was to reveal to the Republican Party what half of its own base really thinks about the big issues. The party’s leaders didn’t know! They were shocked, so much that they indulged in sheer denial and made believe it wasn’t happening. \\nThe party’s leaders accept more or less open borders and like big trade deals. Half the base does not! It is longtime GOP doctrine to cut entitlement spending. Half the base doesn’t want to, not right now! Republican leaders have what might be called assertive foreign-policy impulses. When Mr. Trump insulted George W. Bush and nation-building and said he’d opposed the Iraq invasion, the crowds, taking him at his word, cheered. He was, as they say, declaring that he didn’t want to invade the world and invite the world. Not only did half the base cheer him, at least half the remaining half joined in when the primaries ended. ORDER IT NOW \\nI’ll just pause to note Peggy’s use of Steve Sailer’ s great encapsulation of Bush-style NeoConnery: “Invade the world, invite the world.” Either Peggy’s been reading Steve on the sly, or she’s read my book We Are Doomed , which borrows that phrase. I credited Steve with it, though, so in either case she knows its provenance, and should likewise have credited Steve. \\nEnd of pause. OK, so Peggy got some things right there. She got a lot wrong, though \\nStart with the notion that Trump is crazy. He’s a nut, she says, five times. His brain is “a TV funhouse.” \\nWell, Trump has some colorful quirks of personality, to be sure, as we all do. But he’s no nut. A nut can’t be as successful in business as Trump has been. \\nI spent 32 years as an employee or contractor, mostly in private businesses but for two years in a government department. Private businesses are intensely rational, as human affairs go—much more rational than government departments. The price of irrationality in business is immediate and plainly financial. Sanity-wise, Trump is a better bet than most people in high government positions. \\nSure, politicians talk a good rational game. They present as sober and thoughtful on the Sunday morning shows. \\nLook at the stuff they believe, though. Was it rational to respond to the collapse of the U.S.S.R. by moving NATO right up to Russia’s borders? Was it rational to expect that post-Saddam Iraq would turn into a constitutional democracy? Was it rational to order insurance companies to sell healthcare policies to people who are already sick? Was the Vietnam War a rational enterprise? Was it rational to respond to the 9/11 attacks by massively increasing Muslim immigration? \\nMake your own list. \\nDonald Trump displays good healthy patriotic instincts. I’ll take that, with the personality quirks and all, over some earnest, careful, sober-sided guy whose head contains fantasies of putting the world to rights, or flooding our country with unassimilable foreigners. \\nI’d add the point, made by many commentators, that belongs under the general heading: “You don’t have to be crazy to work here, but it helps.” If Donald Trump was not so very different from run-of-the-mill politicians—which I suspect is a big part of what Peggy means by calling him a nut—would he have entered into the political adventure he’s on? \\nThor Heyerdahl sailed across the Pacific on a hand-built wooden raft to prove a point, which is not the kind of thing your average ethnographer would do. Was he crazy? No, he wasn’t. It was only that some feature of his personality drove him to use that way to prove the point he hoped to prove. \\nAnd then there is Peggy’s assertion that the Republican Party’s leaders didn’t know that half the party’s base were at odds with them. \\nDid they really not? Didn’t they get a clue when the GOP lost in 2012, mainly because millions of Republican voters didn’t turn out for Mitt Romney? Didn’t they, come to think of it, get the glimmering of a clue back in 1996, when Pat Buchanan won the New Hampshire primary? \\nPat Buchanan is in fact a living counter-argument to Peggy’s thesis—the “sane Donald Trump” that she claims would win the hearts of GOP managers. Pat is Trump without the personality quirks. How has the Republican Party treated him ? ORDER IT NOW \\nOur own Brad Griffin , here at VDARE.com on October 24th, offered a couple more “sane Donald Trumps”: Ron Paul and Mike Huckabee. How did they fare with the GOP Establishment? \\nDonald Trump is no nut. If he were a nut, he would not have amassed the fortune he has, nor nurtured the capable and affectionate family he has. \\nProbably he’s less well-informed about the world than the average pol. I doubt he could tell you what the capital of Burkina Faso is. \\nThat’s secondary, though. A President has people to look up that stuff for him. \\nThe question that’s been asked more than any other about Donald Trump is not, pace Peggy Noonan, “Is he nuts?” but, “ Is he conservative? ” \\nI’m sure he is. But my definition of “conservative” is temperamental, not political. My touchstone here is the sketch of the conservative temperament given to us by the English political philosopher Michael Oakeshott : \\nTo be conservative, then, is to prefer the familiar to the unknown, to prefer the tried to the untried, fact to mystery, the actual to the possible, the limited to the unbounded, the near to the distant, the sufficient to the superabundant, the convenient to the perfect, present laughter to utopian bliss. \\nRationalism in Politics and other essays (1962) \\nThat fits Trump better than it fits any liberal you can think of—better also than many senior Republicans. For example, it was one of George W. Bush’s senior associates—probably Karl Rove—who scoffed at opponents of Bush’s delusional foreign policy as “the reality-based community.” It would be hard to think of a more un -Oakeshottian turn of phrase. \\nTrump has all the right instincts. And he’s had the guts and courage—and, just as important, the money —to do a thing that has badly needed doing for twenty years: to smash the power of the real nuts in the GOP Establishment. \\nI thank him for that, and look forward to his Presidency. (Reprinted from VDare.com  '"}, "time": 1742562293.2580445}