{"duration": 0.0978090763092041, "input_args": {"text": "'A    Imam is in court accused of telling his congregation to support Islamic State and carry out acts of terrorism. [“Influential” preacher Kamran Sabir Hussain faces eight   offenses in connection with his work leading a mosque on Tunstall high street in the northern town.  He is charged with two counts of addressing the mosque with the intent of “encourage support for a proscribed organisation, namely Islamic State, or to further its activities” the Stoke Sentinel reports. The other six counts relate to “publishing a statement” in the form of giving a sermon to a congregation, in which he “intended or was reckless as to whether members of the public would be, directly or indirectly encouraged or otherwise induced by the statement to commit, prepare or instigate acts of terrorism”. All of the charges relate to a   period between the 24th of June and 16th of September 2016. At a brief hearing, the   ’s defense lawyer Matt Foot said Mr. Hussain would plead not guilty to the two counts of addressing a meeting at the mosque and six counts publishing statements. Mr. Hussain, of Knightsbridge Way, Tunstall, was remanded in custody and will appear at the Old Bailey on the 17th of March. A   is currently being fought in the town, with UKIP looking to snatch the seat from Labour for the first time since the Second World War. During the campaign, it was reported that a Labour party activist claimed UKIP were “enemies of Islam” warning Muslim voters they will go to hell if they fail to vote Labour in the  . Navid Hussain said that voting for any party other than Labour would result in the electing of “an   and   MP” in a text message sent to Muslims in    Central. “Will you be able to answer for this in the Grave and on the Final Day? ?? ‘I helped the Enemies of Islam because  …    ” he wrote in the message, which was circulated via SMS and WhatsApp among the constituency’s Muslim community.'"}, "time": 1742562426.2009592}