{"duration": 0.15771746635437012, "input_args": {"text": "'BEVERLY HILLS, Calif.  —   It was Nov. 12, and Bill Maher was about to begin his comedy act at the City National Civic in San Jose when he did something he hadn’t done in many years. He brought a drink with him to the stage a standup roadie (tequila). “And boy did I miss it,” he joked with me last week. “What an idiot all those years  —   drinking’s fun. You hear that, kids? Drinking’s fun!” Actually, that’s not why he did it, he said during a marathon session of talking and drinking  —   and, in his case, a wee bit of pot smoking  —   that started at his house here and ended several hours later at the nearby Polo Lounge (oh, the indignities of this job). He says he considers drinking on stage unprofessional. But that night, so soon after the election, he needed something to calm his nerves. Donald J. Trump, who Mr. Maher said “lives for vengeance,” had just won control over the most powerful instruments of the government, like the Justice Department, and, more to the point, the F. B. I. And it was dawning on Mr. Maher that “no one’s been meaner to him than me. ” Mr. Maher has a unique perspective. He resides at that most treacherous intersection where free speech meets government power and political passion, dodging traffic from left and right. He also once accused Mr. Trump of being part orangutan by birth. But first, a refresher on how Mr. Maher became a   totem in 2001 with one provocative line on his   ABC show, “Politically Incorrect. ” He said the Sept. 11 hijackers couldn’t be called “cowards,” especially when the United States’ preferred method of attack at the time  —   before the wars in Afghanistan and Iraq  —   was to lob cruise missiles from afar (“That’s cowardly,” he said). The White House criticized him, sponsors fled and, a few months later, ABC canceled his show. Whatever you might think of his argument, the moment was a dark chapter in the annals of public discourse. It could have been a   too, if HBO hadn’t provided Mr. Maher with safe harbor and a new show, “Real Time,” which has an audience of about 4. 5 million viewers. Yet, Mr. Maher puts that episode within “the normal parameters of awful. ” He says he’s more worried about our new era, when no one knows what “normal” is going to look like. It’s amazing how much anxiety Mr. Trump’s imminent inauguration is stirring in the   business  —   but perhaps not surprising given his open hostility toward the press, his willingness to use his platform against any who cross him and his seemingly proud dismissal of the government and political norms that precede him. No one knows whether a year from now, we’ll see today’s fears as overblown, underblown, or on point. Mr. Maher is taking the    approach based on his own experience in the Trumpian combat caldron in 2013. That was when Mr. Maher launched a “birther” —   or, “ ”  —   campaign about Mr. Trump, to rival the one Mr. Trump had pursued about President Obama’s citizenship. Appearing on “The Tonight Show,’’ he joked that Mr. Trump was the product of   crossbreeding it was the only thing, he said, that would explain the “color of his hair. ” He said he would donate $5 million to a charity of Mr. Trump’s choice if he could prove this wasn’t the case. (Mr. Maher pledged $1 million in 2012 to a “super PAC” supporting Obama.) Mr. Trump’s lawyers replied with a copy of his   birth certificate and a demand for the money, which Mr. Maher ignored. Then Mr. Trump filed a lawsuit that ultimately went nowhere. “It was worth it in comedy material,” Mr. Maher told me, taking a couple of puffs from a pipe molded into a bust of his head (a gift from a friend) as we stood by the bar in his   living room. “But you definitely spent money. ” That is, Mr. Maher had the money to pay for the courage that another comedian may not have been able to afford. He takes it as a harbinger. “No one knows what this man is capable of,” Mr. Maher said. “I never, ever, ever felt worried  —   it never crossed my mind  —   that George Bush would do something crazy, even though I knew he hated me. He never sued me for a joke. ” Mr. Maher was particularly focused on reports that several F. B. I. agents were agitating before the election for more aggressive examination of Hillary Clinton, which Democrats feared was politically motivated to help Mr. Trump. (The Justice Department’s inspector general has announced a broad investigation into the F. B. I. ’s   performance.) “It is a very troubling idea that the F. B. I. is politicized,” he said. “When the internal police department is politicized, that’s a place I don’t want to be on the wrong side of  —   I mean, that’s fascism. ” You could chalk it all up to shticky paranoia, and it’s quite a slippery slope from there to outright fascism. But with so many sharing similar worries (at least among those who didn’t support Mr. Trump) and with Mr. Trump’s continued cage rattling, I turned to Mr. Trump’s adviser, Kellyanne Conway, for a response. It seemed especially fitting because she has been a longtime guest of Mr. Maher’s, dating to the 1990s when he was first blazing the   trail on Comedy Central. Given Mr. Trump’s preference for Twitter, Ms. Conway joked, using the F. B. I. would be “so last century  —   it’s so bureaucratic and paperwork laden. ” Turning more serious, she said, “He’s not going to use the ‘tools of state,’” repeating the wording of my question. I noted that there are, of course, guidelines, professional tenets and laws that are meant to preclude a president’s ability to use federal investigative power as a political weapon, and she agreed, saying “This is America. ” Ms. Conway acknowledged, though, that Mr. Maher’s fears were widely held, especially in Hollywood  —   witness Meryl Streep’s Golden Globes address. “Talk about a Hollywood story  —   folks are unnecessarily flattering themselves to think for two seconds that Donald Trump is going to call out the big dogs to make their lives miserable,” she said. She described some of the discomfort as a natural reaction by “the elites” to an incoming president who is merely responding to their continued attacks. “Where’s the respect  —   open ear and open mind? ’’ she said. “The same people who had hoped for and desired and absolutely assumed they were going to get a different election result never laid down their muskets,” she said. It was time, she said, to “take the poison out of the pen and keyboard. ” Mr. Maher has no plans to do that when his show comes back from hiatus on inauguration day, Jan. 20 (his birthday, and Ms. Conway’s). But he shares Ms. Conway’s view of the cultural stakes in the election. “We’re the losers now, so it behooves us to break out of that bubble more,” he said. Mr. Maher said speeches like Ms. Streep’s  —   calling actors, screenwriters and the news media to arms  —   weren’t going to solve anything. “It looks very insular,” he said. “Just the liberals talking to themselves, which they are very good at doing. ” Still the bane of conservatives, Mr. Maher has more recently drawn scorn from liberals for his own diatribes against Islamic extremism, for which he says liberals have too much tolerance. That’s part of what he considers a politically correct corralling of speech from the left. At the same time, his restaurant selection, the Polo Lounge, in the Beverly Hills Hotel, came in defiance of a Hollywood boycott that Ellen DeGeneres and Elton John helped start after the sultan of Brunei, whose investment agency owns the hotel, imposed a new penal code in his homeland based on Shariah law, making gay sex and adultery punishable by stoning to death. To join the boycott, Mr. Maher said as we walked through the hotel lobby, would be to submit to an ineffectual form of “tokenism. ” “As if the sultan of Brunei is up there looking at the receipts  —   we only sold two soups? Is Stallone still coming in?” he said. “But Sultan, your harem awaits  —   ‘I’m sorry, I’m still going over the receipts. ’” With that, we took our seats and the waiter approached. Surprised to see Mr. Maher, he asked “You’re not in hiding?” That got Mr. Maher all worked up again. “I can be scared,” he said, “and never pull a punch. ”'"}, "time": 1742561705.8974519}