{"duration": 0.10809969902038574, "input_args": {"text": "'Donnerstag, 10. November 2016 10 radikale Vorhaben, die Donald Trump sofort nach Amtsantritt durchsetzen wird Er wird der mächtigste US-Präsident seit Jahren: Mit republikanischen Mehrheiten im Repräsentantenhaus und im Senat kann Donald Trump die nächsten vier Jahre praktisch durchregieren. Doch welche Pläne will der sympathische Milliardär eigentlich genau umsetzen? Hier erfahren Sie, was Präsident Trump in den ersten 100 Tagen seiner Amtszeit vorhat: 1. Weißes Haus zu Weißem Hochhaus ausbauen \"Make America Great Again\" – so lautete Trumps Wahlslogan. Anfangen mit der Greatmakerei will der neue Präsident direkt bei seinem Amtssitz. Das Weiße Haus, auf dem künftig in großen, goldenen Lettern \"Trump White Tower\" stehen wird, soll direkt nach Trumps Amtsantritt im Januar 2017 um 345 Etagen aufgestockt werden. Den lukrativen Auftrag zur Errichtung des Weißen Hochhauses soll Trumps eigene Baufirma erhalten. 2. Austritt aus der EU (USAxit) Trump will die Vereinigten Staaten schnellstmöglich aus der EU austreten lassen. \"Es kann nicht sein, dass irgendwelche Bürokraten in Brüssel dem kleinen Mann diktieren, welche Krümmung sein Gewehrlauf maximal aufweisen darf! Ich sage raus aus dieser EU!\", so Trump im Wahlkampf. 3. Alles, was Obama je getan oder gesagt hat, rückgängig machen Darauf haben Republikaner lange gewartet: Trump will alle Gesetze und jede einzelne Amtshandlung Obamas so schnell wie möglich rückgängig machen. Doch nicht nur das: Auch Barack Obamas private Leistungen sollen nachträglich revidiert werden, darunter auch seine Doktorarbeit aus dem Jahr 1991. Zudem soll eine im Jahr 2005 von Obama gerettete angefahrene Katze ausfindig gemacht und getötet werden. 4. Rückzug aus Krisengebieten Donald Trump will, dass die Vereinigten Staaten aufhören Weltpolizei zu spielen und sich mehr auf sich selbst konzentrieren. Hierzulande wird das zur Folge haben, dass unsere Politiker behaupten, Deutschland müsse nun international mehr Verantwortung übernehmen, was zu mehr Aufrüstung und Kriegseinsätzen führen wird. Ganz anders sähe es aus, hätte Hillary gewonnen: Sie hätte Deutschland zu mehr internationaler Verantwortung gedrängt, woraufhin deutsche Politiker bereitwillig aufgerüstet hätten, um mehr Kriegseinsätze bewältigen zu können. 5. Burkapflicht für alle Frauen, die keine Sieben oder höher sind Diese Maßnahme liegt Donald Trump besonders am Herzen: Alle Frauen, die von dem Milliardär visuell weniger als sieben von zehn möglichen Punkten erhalten, sollen dazu verpflichtet werden, ihre unförmigen Körper künftig unter einer Burka zu verstecken. Wer der Verhüllungspflicht entgehen will, kann mit Schönheitsoperationen auf der Skala nach oben klettern. Verwechslungen mit Frauen aus der Gruppe der 3,3 Millionen in den USA lebenden Muslime sind ausgeschlossen, da sie am ersten Tag nach Amtsantritt geschlossen in Guantanamo interniert werden. 6. Alaska an Wladimir Putin abtreten Donald Trump will kein Kalter Krieger sein: Als Zeichen des guten Willens und der Zusammenarbeit mit Wladimir Putin will Trump den Bundesstaat Alaska an Russland abtreten. Trump ist an Alaska ohnehin nicht viel gelegen, weil die Frauen aufgrund des kühlen Klimas dort so gut wie nie sexy Klamotten tragen. Im Gegenzug wird Putin dann die Lösung sämtlicher Krisen im Nahen Osten übernehmen. 7. Umbau des Yosemite-Nationalparks in einen Luxus-Golfplatz Mit der Umweltpolitik seines Vorgängers Barack Obama hat Donald Trump nichts am Hut. Das erkennt man auch daran, dass er den über 3000 Quadratkilometer großen Yosemite Nationalpark in einen Luxus-Golfplatz mit dem Namen Trumpemite National-Golfplatz umwandeln wird. Den lukrativen Auftrag zur Errichtung des Golfplatzes soll Trumps eigene Baufirma erhalten. 8. Waffenpflicht für alle Als kleines Zugeständnis an seine Unterstützer von der NRA plant Trump schon in den ersten 100 Tagen seiner Amtszeit die Einführung einer Waffenpflicht (\"mandatory right to bear guns\") für alle US-Amerikaner, die imstande sind, eine Waffe zu halten. Säuglinge unter 6 Monaten sind ausgenommen, müssen aber eine Kuschelwaffe besitzen. Durch die Waffenpflicht sollen Amokläufe und Schießereien in den USA endgültig der Vergangenheit angehören, da bewaffnete Wahnsinnige sofort erschossen werden können. 9. Steuersenkung auf 0%, um den verdammten Staat endlich auszubluten Um die amerikanischen Bürger endlich vor der Tyrannei des raffgierigen Staates zu befreien und ein angenehmes Investitionsklima für Unternehmen zu schaffen, hat Trump angekündigt, alle Steuern auf 0 Prozent zu senken. Statt von einer milliardenschweren Bürokratiemaschinerie sollen alle Staatsgeschäfte dann von einem Büro mit maximal drei Mitarbeitern bewältigt werden, das sich über einen eigenen Limonadenstand in der Pennsylvania Avenue in Washington finanziert. 10. Mauer um die USA Eine Mauer zu Mexiko reicht Trump schon lange nicht mehr, seit er gehört hat, dass Flüchtlinge auch über das Meer oder Kanada in die USA einwandern können. Darum will er das gesamte Land entlang der Grenzen und der Küstenlinie mit einer 32.143 Kilometer langen und fünf Meter hohen Mauer umgeben. Das hat noch einen weiteren Vorteil: Nicht nur kann niemand mehr rein, es kommt auch keiner mehr raus. Den lukrativen Auftrag zur Errichtung der Mauer soll Trumps eigene Baufirma erhalten. ssi, dan; Fotos: Meistens Shutterstock; Foto Trump: Gage Skidmore , CC BY-SA 2.0 Artikel teilen:'"}, "time": 1742562227.4541793}