{"duration": 0.07899808883666992, "input_args": {"text": "'education , children , RBTH Daily Bella Devyatkina Source: Rossia One TV Channel \\nEarlier this month Bella instantly became famous thanks to \"Amazing People,\" a show on the Russian television. The video with the girl answering questions, singing songs and talking about herself in different languages went viral. \\n\"Compared with this child, I feel like an idiot,\" users wrote in the comments section. \\nVideo by YouTube \\nYulia Devyatkina, Bella\\'s mother, said her daughter is not a child prodigy; they just invested a lot of time and effort in her development. \"Not every child needs to speak six languages, but any kid can master two or three,\" the mother said. \\nBella\\'s parents understand that their daughter will not be using all these languages in every day life. \\n\"When school starts we will focus on English, French and Chinese,\" the mother said. \"We also don\\'t worry that Bella will not be interested in her classes. She has the same knowledge that any four-year-old child should have, but she is able to discuss these topics in different languages.\" French baby talk \\nBella\\'s mom is a linguist and has been teaching English to children for seven years. Her father works at the Radio Research and Development Institute based in Moscow. The family has an average income, but the parents decided that their daughter\\'s development is their main priority. Italian polyglot: ‘To understand Russians you must speak Russian’ \\nInitially, the parents wanted Bella to speak English like a native speaker, and the mother spoke with Bella in English and Russian from birth, alternating every other day. She made sure that the languages were not mixed, not allowing the girl to insert Russian words during a conversation in English. \\nWhen Bella was 10-month-old, her parents added French. She could not talk but could point her finger at things when adults referred to them. Bella mastered reading even before she began to talk, and her parents taught this using special cards from the age of five months. For example, when ten-month-old Bella was shown the word \"hand\" written in Russian or English, she showed her little hand. By the age of one, she and her parents mastered 60 such cards. Bella began to read easily at the age of two. Chinese cartoons \\nBy the age of two Bella learned to speak in short sentences and read fluently in three languages. When she was just under three, her parents added Chinese to her program. According to the mother, Bella showed great interest in the new language, and she asked to watch cartoons in Chinese. \\nAt the age of three years and two months, little Bella showed an interest in learning Spanish and German, as well as dancing, violin and vocals. Then Arabic was also added. Bella walks, plays hide and seek, and reads ordinary books for children – she just does it in different languages. All her classes are held in the form of a game. \\nThe parents organize small educational excursions with native speakers for Bella, she also attends an English theater club, studies drawing in French, dancing in Spanish, and attends figure skating lessons with a native German speaker. In addition, the parents regularly organize joint language classes for Bella and her friends who are also brought up in a multilingual environment. Brain power \\nScientists confirm that the ability to speak in different languages, and switch from one to the other, depends on the interaction of different areas of the brain. They are activated depending on the language\\'s phonetic characteristics, its grammatical system, imagery and even tonality. \\n\"Every new experience is reflected in the brain by the emergence of new nerve connections,\" said psychologist Tatyana Dyachenko. \"The hippocampus, responsible for memory, stimulates the growth of new neurons. The volume of certain parts of the brain literally grows.\\'\\' \\n\"Multilingualism has a positive effect on a child\\'s overall development, though it may cause a lag in the development of speech at an early stage in comparison with children who grow up with only one language,\" said Kira Ivanova, an expert at the Institute of Linguistic Studies (ILS) in the Russian Academy of Sciences. \\nEarly training, however, does not guarantee that the child will be fluent in the language in the future. \\n\"I know one mom who spoke with her child only in English until he was three,\" said Maria Molina, a researcher at the ILS. \"Now this boy struggles with the curriculum at an ordinary Russian school.\" Subscribe to get the hand picked best stories every week Subscribe to our mailing list Facebook'"}, "time": 1742561665.136384}