{"duration": 0.015739917755126953, "input_args": {"text": "'BOMBSHELL: Hillary Clinton’s Leaked Audio Proves She Rigs Elections Posted on October 30, 2016 by Dawn Parabellum in Politics Share This \\nAstonishing, newly released leaked audio of Democrat presidential candidate Hillary Clinton has just surfaced, and what it reveals is damning. In her own voice, we hear the corrupt Democrat telling reporters that elections can and should be rigged to ensure who wins. This throws the validity of every government on earth in the shredder because she isn’t only talking about rigging American presidential elections. \\nSince the FBI reopened their investigation into the criminal Democrat and Hillary seeks a powerful position to dictate the lives of others, it’s important to hear this audio. She is blatant when she say elections shouldn’t take place unless we make “sure that we did something to determine who was going to win.” \\nHear it from her own mouth: \\nHillary clearly said, “I do not think we should have pushed for an election in the Palestinian territories. I think that was a big mistake. And if we were going to push for an election, then we should have made sure that we did something to determine who was going to win. ” \\nThis conversation took place in 2006 during a discussion with Eli Chomsky, an editor and staff writer for the Jewish Press. At the time, Hillary Clinton was running for a “shoo-in re-election” as a U.S. senator. \\nHer trip, making the rounds of editorial boards, brought her to Brooklyn to meet the editorial board of the Jewish Press. Her conversation was secretly recorded, and the audio hasn’t been released until now. \\nAccording to Chomsky, this little audio clip has only been heard by the small handful of Jewish Press staffers in the room. He claims his copy is the only copy and no one has heard it since 2006 — until now. Election rigging Democrat, Hillary Clinton \\nIt proves she is willing to do whatever it takes to win. With massive amounts of voter fraud already being reported in favor of the most criminal and corrupt politician of our time, in combination with this audio, it’s hard to deny that Hillary wouldn’t rig the election to win. \\nLuckily, Americans are wising up to her disturbing antics. We all saw her cheat during the debates , and the proof came out in leaked emails, thanks to WikiLeaks. \\nIt’s important to hear this, coming directly from Hillary herself, and we can all tell that it is her voice. We all know she’s rigging this election to beat Donald Trump, but she obviously has had her hands in rigged elections before. \\nIt is hard to say how many elections across the globe she has influenced or just stolen. Hillary Clinton will stop at nothing to grab even a small amount of power, and she continues to prove she is as corrupt as they come.'"}, "time": 1742628529.0130658}