{"duration": 0.0737149715423584, "input_args": {"text": "'Support Us ‘Conspiracy Theorist’ Max Spiers Found Dead Days After Texting His Mother to Investigate if Anything ‘Happened to Him’ 0 \\nBritish conspiracy theorist and UFO expert Max Spiers was found dead on a sofa after vomiting ‘black liquid’. This happened only days after texting his mother about investigating if something happened to him. \\nMax Spiers, a 39-year-old father of two was found dead on a sofa in Poland, where he was invited to speak on conspiracy theories and UFOs. This happened in July and, since then, no post-mortem examination were carried out on his body. The death was ruled to be from ‘natural causes’. \\n– Advertisement – \\nDays before his death, Spiers texted his mom: \\n“Your boy’s in trouble. If something happens to me, investigate”. \\nSpiers, who claimed to be a survivor of a secret government ‘super soldier’ program, died suddenly after vomiting ‘black liquid’. His mother Vanessa Bates, an English teacher, told journalists: \\n“He was making a name for himself in the world of conspiracy theorists and had been invited to speak at a conference in Poland in July. He was staying with a woman who he had not known for long and she told me how she found him dead on the sofa. But I think Max had been digging in some dark places and I fear that somebody wanted him dead.”– The Telegraph, UFO expert Max Spiers’ death prompts conspiracy theories \\nBates believes that Spiers might have been poisoned. \\n“Max was a very fit man who was in good health. All I have is a death certificate from the Polish authorities that it was from natural causes, but no post-mortem was done so how can they tell that? \\nThey are also refusing to release any paperwork about it to me because, absurdly, I don’t have his written permission. \\nHe has a brother, Josh, and sister, Becky, who are both devastated, as are his two boys. We all want answers to this and I will continue to fight to get to the truth.”– Ibid. \\nSpiers’ financé Sarah Adams told Yahoo! News that he was about to expose ‘black magic’ and well known politicians and celebrities. “We were used to getting death threats or stuff like that from people but I think this time it seemed rather real. He’d been sent threats saying that him and me were going to die. He was going to expose black magic. He was going to expose some of the stuff that he was working on involving political leaders and celebrities. He planned on coming back here seeing his family and I was going to have his child. He had messaged me hours before. It definitely couldn’t have been anything like suicide or something like that.”– Yahoo! News, Here’s what conspiracy theorist Max Spiers was about to reveal before his death North East Kent coroner’s office said that an investigation into Mr Spiers’ death was in its “very early” stages. Was Spiers’ poisoned because he knew too much? Was he about to say too much? One thing is for sure, this death cannot be more suspicious.'"}, "time": 1742562620.732897}