{"duration": 0.04768848419189453, "input_args": {"text": "'Email \\nAs the jihad threat grows, so does the enemies’ war on our most effective leaders. The SPLC , traffickers in blood libel and incitement to murder, is a hate group that the left counts on to smear, defame and destroy those who are brave enough to oppose their totalitarian agenda. This Soros-funded opposition research smear machine has now produced a libelous “report” designed to destroy the most effective anti-jihad voices and mandate that our voices are never heard. \\nThe SPLC report says: “These propagandists are far outside of the political mainstream, and their rhetoric has toxic consequences — from poisoning democratic debate to inspiring hate-based violence. The Columbia Journalism Review has said as much, pointing out that misinformation and falsehoods in media ‘may pollute democratic discourse, make it more difficult for citizens to cast informed votes, and limit their ability to participate meaningfully in public debate.’” It advises reporters to “[u]se credible sources; don’t give credence to the fringe,” and sharply criticizes “the politicians and pundits who seek personal and ideological gain by starting or spreading false memes.” \\nThis is turning the truth on its head. The reality is this: it is the left and these well-funded Goebbels-inspired hate groups such as the SPLC that “pollute democratic discourse, make it more difficult for citizens to cast informed votes, and limit their ability to participate meaningfully in public debate.” They work furiously to silence dissent and impose a totalitarian straitjacket on the public discourse on these issues, only allowing voices that toe their propaganda line about Islam being a religion of peace and Muslims as the victims, rather than the perpetrators, of terrorism. \\nAnd they call us “extremists,” the same word the enemedia euphemistically uses of jihad killers — as if we were equivalent to those who blow themselves up and cut off heads while screaming “Allahu akbar.” \\nAll of their profiles are riddled with falsehoods, inaccuracies, and outright lies. In the one about me, their claim that I insist that Obama is the “love child” of Malcolm X is patently untrue. The SPLC also states that I “have spoken to a neo-fascist group in Germany,” when in fact I have never even been to Germany. Then they quote statements from me such as this one, “ Islam … is an extreme ideology, the most radical and extreme ideology on the face of the earth,” as if it were obviously false and offensive, when in reality it is true. The SPLC makes no attempt to prove that it is false. It just takes for granted that the far-left lemmings who swallow its lies will nod their heads and go along, without stopping to think that — as murderous jihad attacks become a near-daily occurrence in Western Europe and soon in the U.S. as well — that maybe I have a point. \\nThe SPLC also says: “In 2013, she and Robert Spencer were banned from entering the United Kingdom to speak to an EDL rally for fear of stirring ‘inter-community violence.’” This violence was going to come from one side only: the British government was afraid that if we were there, Muslims would attack, and so to appease them, they banned us. Our ban was a tacit recognition that there is a jihad threat, not a repudiation of that threat. But the SPLC includes this anyway, knowing that their readers will not put two and two together. \\nAs the SPLC is a patent and obvious foe of the freedom of speech, it is no surprise that they would hate our Muhammad Art Exhibit and Cartoon Contest (which they erroneously call “a ‘Draw the Prophet’ cartoon contest”). They say it was “an obvious provocation aimed at Muslims, who regard graphic depictions of Muhammad as blasphemous — which drew two angry U.S.-born jihadists who were killed when they attacked the event.” So even when jihadis attack and try to kill us, the SPLC is on their side, because what we were doing was “blasphemous.” The SPLC actually justifies murder in this case — but you can just imagine what they would be saying if a Jew or a Christian had reacted to blasphemy against his faith by deciding to murder the “blasphemers.” \\nSome of their claims are bitterly ironic. As Obama ships hundreds of billions of dollars to the mullahs in Iran, the SPLC excoriates me for saying that he seeks to “appease his Muslim overlords” and “wants jihad to win.” Do they not know that Iran will use those billions to fund terrorism? Or do they just not care? And they say: “An ardent defender of Israel, Geller has described the press there as largely ‘Jewicidal.’” After recent revelations about how Soros-funded groups paid for favorable coverage of the Iran deal and the Muslim migrant invasion, and the close collaboration between the mainstream media and the Clinton campaign, is the SPLC still pretending that the enemedia is made up of fair, objective journalists? \\nFacts are the enemy to these haters and destroyers. Facts, evidence, reality are tossed off by the SPLC like some out-of-date, old-fashioned idea. Truth is “hate.” Truth is islamofauxbic. Anyone who criticizes oppression, subjugation, supremacism is smeared, defamed, blacklisted. Posturing as humanitarians, vicious hate groups such as the SPLC are deemed legitimate authorities by cultural and political power players. \\nIn reality, the SPLC is not a group dedicated to the defense of human rights. It is a hard-left attack machine. Vets, patriots, and freedom’s defenders are in its crosshairs. Even Ben Carson was on their hate list for some time. They can’t win on the facts, so they must silence us. \\nArticle reposted with permission from PamelaGeller.com'"}, "time": 1742628546.6027231}