{"duration": 0.0959932804107666, "input_args": {"text": "' \\n\\n \\n\\nAgainst my better judgment, I often put my articles on Facebook. Lately, Facebook has been taking down my posts, particularily on topics related to World War III. One of my readers counted 14 sites saw my articles disappear. It is too late for me, but for most of you, you should consider not participating on Facebook. It is one more intelligence gathering tool designed to separate the sheep, from the independent thinkers!\\nNo matter how annoying Facebook’s censors may be, there are real dangers associated with posting and reading on Facebook.\\nFacebook’s Friends Are Not Nice People \\nFacebook is aligned with both the CIA and the NSA. I have several credible sources tell me that all data posted on Facebook goes into series of cataloged files which culminates with each person being assigned a “Threat Matrix Score”. The mere existence of a Threat Matrix Score should send chills up and the collective spines of every American.\\nWhen, not if, martial law comes to America, this Threat Matrix Score, of which Facebook data is used to help compile an “enemies of the state” list, your future longevity could be seriously imperiled. It is too late for people like Steve Quayle, Doug and Joe Hagmann, John B. Wells and myself to avoid being placed on this list. However, it is not too late for the average American to limit their exposure by NOT posting and participating on Facebook. Facebook participation should come with a black box warning:\\n“WARNING: The views expressed on Facebook can and will be used against you. Participation in Facebook could prove detrimental to the length of your life. All political dissident views are immediately reported to the CIA and the NSA. Risk of repeated exposure on Facebook could result in you and your family being hauled out of their homes at 3AM, separated from your family and sent to a re-education camp”. \\nBefore you dismiss this hypothetical black box warning as too much “tongue in cheek”, please consider that the NSA is presently extracting large amounts of Facebook data and I do not think they are compiling a Christmas card list.\\nFacebook’s Welcome Is Wearing Off Many of us in print and broadcast media are rethinking our association with Facebook. Several of our journalistic brothers and sisters have been censored and/or otherwise treated unprofessionally by this entity. Facebook has become replete with trolls who patrol the cyber corridors of this monolithic entity chastising and censoring whoever exposes the liberal, anti-human, depopulation agenda of the New World Order. Whether it is gun control, criticism of NWO puppet Obama or anything that the alleged grandson of David Rockefeller, Mark Zuckerberg, and his people disagree with, they will kick your Facebook account to the curb for daring to express a legitimate political opinion.\\n \\nFacebook’s Zuckerberg, The Self-Perceived Purveyor of Integrity and Morality Mark Zuckerberg, the creator of Facebook emphasized three times in a single interview with David Kirkpatrick in his book, The Facebook Effect “ You have one identity, and the days of you having a different image for your work friends or co-workers and for the other people you know are probably coming to an end pretty quickly. Having two identities for yourself is an example of a lack of integrity .” \\nWho appointed Mr. Zuckerberg to be the moral police and the judge of integrity? It sounds like Zuckerberg can take his place with Soros, Gates, Turner, et al., and the rest of the global elite who think they have the right to treat humanity as their own personal property and view the masses as a disposable commodity.\\nJulian Assange Assessment of Facebook Whistle blower, Julian Assange, once stated that “Facebook in particular is the most appalling spying machine that has ever been invented. Here we have the world’s most comprehensive database about people, their relationships, their names, their addresses, their locations and the communications with each other, their relatives, all sitting within the United States, all accessible to US intelligence. Facebook, Google , Yahoo – all these major US organizations have built-in interfaces for US intelligence. It’s not a matter of serving a subpoena. They have an interface that they have developed for US intelligence to use.” \\nNever before in American cyber-history do we see such an arrogant and agenda serving entity operating their propaganda so far in the open as we do with Facebook. This propaganda end of the New World Order is being blatantly exposed.\\nFacebook’s arrogance was on full display when highly respected journalist, Jon Rappoport was banned from sharing his articles on Facebook. In this instance of blatant censorship, Jon’s banned article was merely a review of certain aspects of American presidents ranging from Nixon to Obama. Like so many of us that understand history and can see the tyrannical path that Obama is taking us down, Rappoport identified Obama’s unconstitutional missteps. And for daring to tell the truth, Facebook banned Rappoport for the mere expression of a legitimate political opinion.\\nReaders may also recall when members of Infowars.com and the popular talk show host, Michael Rivero were banned in December of 2012, until the public outcry for Facebook to reinstate their respective accounts backed Facebook into a corner from which they acquiesced and reinstated the previously banned media figures.\\nRules For Thee but Not For Me Facebook does not apply their holier than thou attitude to their own corporate behavior. As Zuckerberg talks about rectifying Americans lack of integrity through timely Facebook exposure, Facebook fails to pay its own fair share of taxes as a result of tax loopholes and deductions. Facebook paid no income tax for the fiscal year 2012 , despite reaping $1.1 billion in U.S. corporate profits. While Americans have just been subjected to higher taxes, billion-dollar corporations like Facebook, General Electric, Boeing and Wells Fargo have all been able to avoid paying any corporate income taxes, reports the Citizens for Tax Justice .\\n\\nPLEASE SUBSCRIBE TO OUR YOUTUBE CHANNEL AND DON’T FORGET TO “LIKE” US \\n\\n\\nReddit Co-Founder Dissociates From Involvement With Facebook In an interview with CNN, Reddit.com co-founder Alex Ohanian explains that he won’t be investing in Facebook, the largest technology IPO in the history of the Internet.\\nFacebook founder, Zuckerberg, had stated, at the time that Facebook first made their public offering, that he expected to make billions of dollars. Ohanian further stated that he would not be investing in Facebook in order to enrich Zuckerberg. Ohanian’s reasons for avoiding Facebook as an investment vehicle is tied to the fact that he strongly believes that Facebook’s stance in favor of the Cyber Intelligence Sharing and Protection Act, CISPA, is very dangerous to the viability of the internet. In other words, Reddit.com’s founder has clearly stated that Facebook is at the vanguard of Internet censorship.\\nI applaud Ohanian’s stance as it is clear that Ohanian respects free speech. It is safe to say that Facebook and CISPA are two birds of a feather as they both support blatant censorship regarding political views which differ from their own.\\nTax evasion, legal or not, seems to be a trait of Facebook personnel, both past and present. Not only does Facebook not pay taxes while the rest of America is suffering under crushing tax increases, Zuckerberg’s former co-founder, Eduardo Saverin , renounced his U.S. citizenship back in August of 2012 in order to pay less tax. I guess that birds of a feather “Facebook” together.\\nCan it be said that Facebook is a shining example of duplicity and censorship? I think so and I welcome being banned by the monolith because soon Zuckerberg will learn the lesson the phrase “pride goeth before the fall.” I have long said that Facebook will face some very stiff competition and the millions who have been irritated by the trolls which send warning messages for sending simple personal messages could very well be looking for new jobs.\\nTechnology is fleeting and Facebook could someday go the way of Myspace. I have long advocated that the average citizen needs to avoid the globalist corporate chain stores (e.g. Walmart) and shop locally as much as possible. I think the same could be said about social media sites as well. Why in the world are we posting personal information and our political views on an NSA controlled social media site such as Facebook? To do so, is suicide!\\nConclusion \\nAlthough it is too late for me to avoid going on the “naughty list”, due to the fact that my work has been published in thousands of venues, I have come to the considered opinion that the average American is placing themselves on the equivalent of the East German Stasi political enemies hit list by posting political views on the NSA-controlled Facebook. My advice to all unpublished Americans is to immediately cease posting on Facebook, which is a direct conduit to being placed on the proverbial “RED LIST” and seek out alternatives which are not New World Order friendly.\\n \\nThe sane alternative to Facebook \\nSeen.Life-The Facebook alternative- no censorship, no spying–  \\n'"}, "time": 1742628360.011405}