{"duration": 0.14373278617858887, "input_args": {"text": "'By Robert Fisk on October 29, 2016 Robert Fisk — The Independent Oct 26, 2016 The rubble of the smashed town of Mouadamiya. Click to enlarge \\nFrom the moment you cross the bridge over the old steam train railway line to Deraa, you can see what happened to this little town south-west of Damascus . It’s not just the bullet holes, the smashed buildings, the toppled mosque with its minaret lying in pathetic chunks, nor the apartment blocks that have slid into the streets after two years of Syrian tank fire and helicopter bombing. Nor the underground hospital. It’s not even the women walking with their children again through the scarred streets, nor the street-sellers outside the blitzed buildings. \\nIt’s the young men, some bearded, eyes alert, the men of the old Liwa al-Fatah, the Liberation Brigade militia that fought the Syrian army, queuing up without their weapons to register at the checkpoint. Still proud but now working with the government to keep the government’s enemies out of Mouadamiya, they are a guarantee, of sorts, that their town will stay rebel-free. The regime still holds 800 of their relatives and friends in unknown prisons; another guarantee, of sorts, that they will remain loyal. \\nWhat also happened was a change of heart. And a phone call to the opposition from a man identified as a British “officer” called Ford. The government also realised it should never have taken the land from the people of Mouadamiya before the war, nor dismissed their peaceful protests with such arrogance in 2011. And then the men who took up arms realised, two years later, that they had been betrayed. \\nSuch a moment came to 27-year old Mahmoud Khalifa when he took a phone call in November 2013 from the “Military Operations Centre” in Jordan, whence the West’s agents and Arab allies have tried to direct, coerce and arm the tens of thousands of men who want to destroy President Bashar al-Assad. \\n“There was a Saudi on the phone and he handed me over to a British officer who said his name was Ford, Dr Khalifa recalls. “We asked for help, we called for arms, weapons, money. And the answer from Ford was: ‘We can send ammunition for light weapons. We can’t send heavy or sophisticated weapons.’ I asked why, and the answer came back: ‘You are in an area so close to the capital that we will not allow you to advance.’ \\n“They were playing with us. I insulted the two officers. I told them: ‘We will not allow you to use us like an instrument – and this is the last time you call us.’” Dr Khalifa, who is a medical doctor, narrows his eyes when he says this. His “allies”, it seems, wanted the war to continue – to destroy Syria rather than the regime. And he is a man with another burden. His older brother is one of the 800 prisoners, arrested in Damascus because the army realised his family connection to the doctor. \\nThe Military Operations Centre is real enough. Captured rebels have talked about the “MOC” in Jordan, and Syrian intelligence officers have for months monitored communications between the MOC and elements of Jabhat al-Nusra (aka al-Qaeda) and the febrile Free Syrian Army around the southern city of Deraa. The Syrian army believes it is located close to the Jordanian-Syrian border. It is a worthy subject of investigation. \\nBut when the war ended in Mouadamiya, promises were kept. The government agreed that Syrian militiamen in the town would remain free – and allowed to travel anywhere in Syria under government control, providing they surrendered their weapons. According to 45-year old Khaled Khodr – the head of the Liwa al-Fatah and nicknamed the Mayor by his fighting men – 600 fighters along with their families, a total of 1,500 who did not trust the government, were permitted to leave with their side-arms for rebel-held areas in Idlib province. \\nDr Khalifa has been told that 95 of them are now gathered near the Turkish border, keener to become refugees in safety than carry on the fight. \\nBut sides call this a reconciliation and it’s a miniature version of what the Syrian government must intend for eastern Aleppo: the surrender of their enemies and the expulsion of those who will not give up their weapons and the gradual restoration of life for the surviving civilians after months of ruthless bombardment. There’s even a “reconciliation committee” in Mouadamiya – one of dozens operating in other townships around Damascus and Homs – to oversee the new peace, with local mukhtars – town leaders – and former fighters and Syrian military intelligence officers on the committee. \\nPeace must come in stages. The electricity and water in Mouadamiya was never cut by the government, a smart move by someone in authority who realised that there were limits to a siege – albeit scarcely applied in Aleppo – which might lead to submission at a later date. Syrian troops have not entered Mouadamiya and the men who defended it believe the 800 prisoners will be freed after the new governor arrives to hoist the Syrian flag over the municipal buildings in a few days’ time and to declare the town safe. A Syrian intelligence man, a big beefy figure who refused to give his name or talk publicly, admitted that this was the intention: the prisoners would be freed “step by step”. \\nCould this be a model for eastern Aleppo if the slaughter ends? The ex-fighters here have their doubts. Too many of the armed groups in Aleppo are foreigners who would prefer to fight on. Too many are Islamists. In Mouadamiya, Khaled Khodr’s Liwa stepped in at once when Nusra Islamists arrived from the suburb of Ghouta and tried to join their fight – he told them to leave. But this did not spare the town. Among the buildings destroyed in the long battle was the largest school – never a rebel base, according to the former fighters – and in all 1,800 of its people were killed in the siege, most of them from the Liwa. Only just over 2,000 civilians lived on amid the wreckage. Mouadamiya’s mukhtar, Mohamed Jallab, reckons that 40,000 of its inhabitants who fled three years ago have now returned. \\nAnd reconciliation seems to work, at least publicly. The former Syrian fighters talk with government soldiers on the edge of the town, even sharing their cigarettes, queuing up to sign a register to visit Damascus and talking freely – in and out of the hearing of the soldiers — of their battle against the regime. They were, like all militiamen, civilians when there was no war to fight: I met a painter, two truck drivers, a barber, three students – one of them studying Arabic literature in Damascus, who was a nurse during the fighting – a car mechanic and a former government soldier who has agreed to rejoin the ranks of the army he fought against for so many months. \\nAlthough the “reconciliation opening” of Mouadamiya commenced less than two weeks ago, there had been a de facto truce holding – on and off – for two years, and many of the combatants knew each other. It’s always that way in a civil war – or “the crisis”, as both sides refer to the Syrian bloodbath here. There was a kind of honour during the siege. At the start, there had been Free Syrian Army men, mostly regime defectors with little heart in the battle, but the local fighters lost many of their comrades during the siege. Dr Khalifa says he lost 20 of his relatives and friends. \\nAt the hospital – operating rooms underground, wards one floor above – Dr Ratep Daoud displayed the three primitive tables with cardiac equipment and ventilators and green sheets and flaking walls where he and his internist and pediatrician and Dr Khalifa tried to save so many lives amid the bombardment. The hospital was never hit, but 1,600 of the doctors’ patients died in this cramped building. Eighty per cent of them were fighters. Just as in eastern Aleppo, the local civil defence men pulled wounded and corpses from the rubble. They did indeed wear “white helmets” – though they were not called that – and several of them could be found resting in their trucks and office near the hospital. For them, the war is also over. \\nMouadamiya is a curious town. The vegetable gardens that the 2,000 or so civilians nurtured to ward off starvation are still there. So are the plastic screens to prevent government snipers shooting at the people of Mouadamiya. There are massive ramparts of earth around the old front lines. Twenty years ago, most of this was rich farmland: prosperous families lived in the stone villas, the remnants of which stand on the outskirts. Ancient olive groves still snake their way into the town and stand behind scorched apartment blocks, their gnarled trunks and swaying branches a faintly ironic balm amid so much destruction. \\nThese were the lands appropriated before the war, when the townspeople demanded their restitution and a new state governor. The regime did not listen to them. The same happened in Deraa. And in Homs and other cities. And of course, eventually, protest turned into war. And foreigners, who neither knew nor cared where Mouadamiya was, sent in their guns and agents to keep it running.'"}, "time": 1742564378.733401}