{"duration": 0.1236417293548584, "input_args": {"text": "'For Rabbi Gerald Sussman of Temple   on Staten Island, the Obama administration’s recent confrontation with Israel was a stunning turn for a president who had enjoyed support from many members of his congregation. “The word ‘betrayed’ would not be too strong a word,” he said. But in Los Angeles, Rabbi John L. Rosove of Temple Israel of Hollywood, who is the chairman of the Association of Reform Zionists of America, felt differently. He applauded the speech delivered on Wednesday by Secretary of State John Kerry explaining the decision by the United States not to block a United Nations Security Council resolution that condemned the construction of Israeli settlements in the West Bank. Rabbi Rosove also suggested that many American Jews were broadly supportive of the Obama administration. “I felt Kerry was exactly right,” he said. “The people who will criticize him will take a leap and say he’s   just as some American Jews are saying Obama is an  . This is ridiculous. They recognize and cherish the state of Israel. ” The relationship between Israel and the United States, historically the Jewish state’s closest ally, has seen periods of strain and tension almost from the day of Israel’s creation in 1948. But rarely has the situation between the two countries been this stressed, with President Obama under attack not only from Prime Minister Benjamin Netanyahu, but also from   Donald J. Trump. The events of the past few days have renewed a longstanding debate over whether American Jews must always stand with the Israeli government, and under what circumstances should they criticize a friend. “There’s a very clear values clash going on,” said Rabbi Jill Jacobs, the executive director of T’ruah, a rabbinical human rights organization. “On the one hand, we have a small but vocal minority of American Jews who believe that supporting Israel means supporting the   agenda, the current government. And on the other, there is a larger percentage of American Jews who are committed to Israel and committed to democracy and want to see it as a safe place that reflects our values. ” This is a community that is hardly monolithic. For one thing, younger Jews are seen as less likely to identify themselves as religious or supportive of Israel, and do not share memories of the Holocaust or the wars with Israel’s Arab neighbors. American Jews are also overwhelmingly Democratic Jews voted for Hillary Clinton over Mr. Trump, 71 percent to 24 percent, according to exit polls. Yet the most influential and vocal organizations that represent Jews in Washington tend to be more conservative and supportive of Mr. Netanyahu, who has had a combative relationship with Mr. Obama, and has made little secret of his happiness over the changing of the guard that is about to take place in Washington. Mr. Trump has signaled that his administration would upend the nation’s policies toward Israel, promoting rather than discouraging settlement construction and moving the American embassy to Jerusalem from Tel Aviv. “These days the right wing has a louder voice in Israel, and, in some ways, it also has a louder voice in America, because the people who are most actively and publicly Jewish, sectarian Jewish, share the right wing point of view, and are very ” said Samuel Heilman, a sociology professor of at Queens College specializing in Jewish life. “But it’s not the mainstream point of view. ” Steven M. Cohen, a research professor at Hebrew Union College and a consultant to a recent Pew study of American Jews, said that Mr. Kerry’s speech represents the viewpoints of most American Jews. “On survey after survey, American Jews are opposed to Jewish settlement expansion. They tend to favor a   solution and their political identities are liberal or moderate,” he said. Some Jews said they thought Mr. Kerry’s speech, even if delivered in harsh terms, actually reaffirmed the best hope for a lasting peace in Israel: a   solution. “This administration has been ” said Paula Greene, 65, a retired nurse in Hollywood, Fla. “Like Kerry said, you can still be friends, still be allies and still have disagreements. ” But for others, even those who support a   solution and object to Israeli settlement policy, the decision by the United States not to shield Israel at the United Nations  —   which is widely viewed among many American Jews as hostile to Israel  —   was a mistake. Representative Debbie Wasserman Schultz of Florida, a Democrat with a large Jewish constituency, called the Security Council action unnecessary and inappropriate, adding: “I don’t think you can solve a problem with a friend by flogging them publicly. ” The Security Council’s    vote a week ago condemned Israel’s construction of settlements in the West Bank and East Jerusalem as a “flagrant violation under international law” and an obstacle to peace in the region. The United States chose to abstain rather than use its veto, as it has done in the past to quash resolutions it considered  . Rabbi Rick Jacobs, the president of the Union for Reform Judaism, the largest Jewish movement in North America, said it was “a miscalculation in our minds. I think a majority of American Jews would agree, no matter how one feels about settlements, that the idea that the U. N. is an honest broker when it comes to Israel is laughable. ” For Shira Greenberg, a public school teacher in Florida, Mr. Obama’s rebuke of Mr. Netanyahu confirmed her worst assumptions about the president. “Throughout the whole Obama administration, people were trying to guess where he stood,” she said after morning services at her conservative synagogue on Thursday. “At this point, it’s pretty clear. ” And at Sinai Temple in Los Angeles, a large and politically divided congregation, Rabbi David Wolpe said Mr. Obama had “pulled the rug out from under people who said the president’s intentions toward Israel was positive and strong. ” The public display of rancor is unsettling. “Nobody in the community can be happy when you have this public spat between the prime minister and the president, and the kind of language the prime minister has been using about the president,” said Daniel C. Kurtzer, who has served as the United States ambassador to both Israel and Egypt. David Zwiebel, the executive vice president of Agudath Israel of America, which represents   Jews, said that there is a general sense among Orthodox Jews, who tend to be more conservative, “that the outgoing administration is outgoing and should be outgoing, and it’s time for an approach that is more openly supportive of Israel. ” For all the controversy created by the vote, few Jewish leaders think there is any chance that Mr. Kerry and Mr. Obama might, in the next three weeks, strike the deal that has eluded negotiators for years. That said, some supporters of a   solution applauded Mr. Kerry for trying. “I think it’s a question of legacy,” said Jeremy   the head of J Street, a liberal Jewish lobbying group. “And you have to have the long view on this issue. Donald Trump will be president for X years. And then there will be someone else and the chances are it will go back to where we are today. And Bibi will lose someday,” he said, referring to Mr. Netanyahu. “Someday down the line this is the way it’s got to go. ”'"}, "time": 1742563194.8101358}