{"duration": 0.0672910213470459, "input_args": {"text": "'CAIRO  —   A bomb ripped through a section reserved for women at Cairo’s main Coptic cathedral during Sunday morning Mass, killing at least 25 people and wounding 49, mostly women and children, Egyptian state media said. The attack was the deadliest against Egypt’s Christian minority in years. Video from the blast site circulating on social media showed   floors and shattered pews among the marble pillars at St. Mark’s Coptic Orthodox Cathedral, the seat of Egypt’s Orthodox Christian Church, where the blast occurred in a chapel adjacent to the main building. As security officials arrived to secure the site, angry churchgoers gathered outside and hurled insults, accusing them of negligence. “There was no security at the gate,” one woman told reporters. “They were all having breakfast inside their van. ” A man asked, “You’re coming now after everything was destroyed?” There was no immediate claim of responsibility, although the attack bore the hallmark of Islamist militants fighting President Abdel Fattah   who have previously targeted minority Christians over their perceived support for his government. It was the second major attack in the Egyptian capital in three days, marking a jarring return to violence after months of relative calm. An Islamist militant group claimed responsibility for an explosion at a security check post on Friday that killed six police officers. Mr. Sisi’s strongman rule has come under economic pressure in recent months amid high inflation and a sharp drop in the value of the Egyptian pound. Threatened street protests last month did not materialize, but the surging attacks may be an attempt to stoke opposition through violence. Egyptian security officials, quoted by state media, said that an explosive device containing about 26 pounds of TNT had been placed in the chapel. It went off during Mass around 10 a. m. Most of the dead and wounded were women and children, Sherief Wadee, an assistant minister for health, said in a television interview. Mr. Sisi declared three days of mourning, state media said. Hours later, hundreds of angry worshipers gathered at the church gates to register their anger. “We either avenge them or die like them,” they chanted. Tarek Attiya, a police spokesman, denied accusations of lax security at the church, and said the police had been operating a metal detector at the church entrance as normal. A current of fury and frustration ran through the crowd gathered at the church gates, much of it directed at Mr. Sisi and his supporters and expressed in unusually strong terms. At one point the crowd broke into chants of “the people demand the downfall of the regime,” the signature call of the mass uprising in 2011 that led to the ouster of President Hosni Mubarak. The crowd pushed out three prominent television presenters seen as sympathetic to Mr. Sisi  —   chanting, “Leave! Leave!”  —   and called for the resignation of the interior minister, Magdy  . Many Egyptians reported that TV stations broadcasting pictures of the crowd had cut out audio feeds that carried the antigovernment chants. Such public anger toward the government has become rare under Mr. Sisi, who has imprisoned thousands of opposition figures, cracked down on civil society and demonstrated little tolerance for the mildest street protests. The blast coincided with a national holiday marking the birthday of the Prophet Muhammad. Shrapnel pockmarked religious icons and stone walls inside the church, where witnesses gave graphic accounts of bloodied bodies strewn across the broken pews. Hundreds of people streamed into nearby hospitals, frantically seeking news of the wounded. Officials said at least six children were among the dead. Egypt’s beleaguered Coptic minority, which makes up about   of the country’s roughly 90 million people, has been discriminated against for decades, and has come under violent attack since the uprising that toppled Mr. Mubarak. The leadership of the Coptic Church, under Pope Tawadros II, has been a vocal supporter of Mr. Sisi, who came to power in 2013. But that support has also made Copts a target for elements of the outlawed Muslim Brotherhood. Islamists attacked hundreds of Coptic churches and homes in 2013, in a backlash after the security forces killed hundreds of Muslim Brotherhood demonstrators in central Cairo in August of that year. The violence smacks of sectarian prejudice because Mr. Sisi’s support stems from Egypt’s Muslim majority. Tensions between Christians and Muslims are highest in Minya, the province in upper Egypt that saw the worst attacks on Copts in 2013. Coptic officials in Minya have counted at least 37 attacks in the past three years, including episodes of houses set on fire and Copts being assaulted on the streets. “Once again the lives of Egypt’s Christian minority are dispensed with as objects within Egypt’s violent and cynical battle over power,” said Timothy E. Kaldas, a nonresident fellow at the Tahrir Institute for Middle East Policy. After the blast on Sunday, dozens of anguished Christians, some wearing black, waited for news of the wounded and the dead outside El Demerdash Hospital. Noureen Grace, her face streaked with tears, waited for the remains of her    Madeline Michelle. “She was completely destroyed,” Ms. Grace said, describing the trauma of witnessing the mutilated body. “I spoke to her only yesterday. We spoke every day. ” Moments later a   woman, still heaving with grief, walked past. “They are all dead,” she said, declining to give her name. “They were all my friends. ”'"}, "time": 1742628352.246604}