{"duration": 0.031903743743896484, "input_args": {"text": "'WASHINGTON  —   President Obama said Monday that while the gunman in the Orlando massacre had declared allegiance to the Islamic State and appeared to have been inspired by extremist information on the internet, there was no clear evidence that he had been part of a wider plot directed by the terrorist group. “As far as we can tell right now, this is certainly an example of the kind of homegrown extremism that all of us have been so concerned about for a very long time,” Mr. Obama said, speaking in the Oval Office after a briefing with law enforcement, counterterrorism and Homeland Security officials. Mr. Obama said the mass shooting in Orlando  —   which he will visit on Thursday to pay his respects to victims’ families, the White House announced on Monday night  —   was being investigated as an act of terrorism. The president said the attack on Sunday by Omar Mateen, who killed 49 people and wounded more than 50, was similar to last year’s rampage in San Bernardino, Calif. in which the perpetrators claimed allegiance to the Islamic State beforehand but had no direct connection to it. The president said of Mr. Mateen that “we see no clear evidence that he was directed externally” by the Islamic State, although he declared fealty to the group “at the last minute. ” Still, Mr. Obama said the attack underscored the Islamic State’s power to inspire hateful acts. “One of the biggest challenges we are going to have is this kind of propaganda and perversions of Islam that you see generated on the internet, and the capacity for that to seep into the minds of troubled individuals, or weak individuals, and seeing them motivated then to take actions against people here in the United States and elsewhere in the world,” Mr. Obama said. Law enforcement officials were scrutinizing the material Mr. Mateen had come across online to better understand his path to murder, the president said. Mr. Obama, anguished by the latest mass shooting during his tenure  —   a period in which Congress has rejected calls to enact tougher gun rules  —   said the Orlando massacre should prompt Americans to “think about the risks that we are willing to take by being so lax in how we make very powerful firearms available to people in this country. ” “We make it very easy for individuals who are troubled, or disturbed, or want to engage in violent acts to obtain very powerful weapons very easily, and it’s a problem,” Mr. Obama said. He noted that it appeared Mr. Mateen had carried out the rampage with guns obtained legally, including an assault rifle he took out of the store the day it was purchased. But the attack highlighted how the politics of gun control has thwarted the president’s determination to enact stricter measures. The White House said Mr. Obama would be a “forceful advocate” for Congress to tighten gun restrictions. He supports legislation to bar firearms sales to people placed on “ ” lists because of suspected terrorism links and to require background checks for purchases at gun shows. But his aides strongly suggested that the president was out of options to impose additional limits on his own. “The president is quite intensely frustrated that we haven’t seen the kind of congressional action that we know would have an impact” on mass shootings, said Josh Earnest, the White House press secretary. “The responsibility right now lies with Congress. ” Mr. Obama also said the Federal Bureau of Investigation, which has faced some criticism for failing to stop the attack even though Mr. Mateen had been investigated in recent years for potential links to terrorist groups, had acted appropriately. The White House declined to respond to suggestions from Donald J. Trump, the presumptive Republican presidential nominee, on Monday that Mr. Obama had refused to acknowledge Islamic terrorism and might have ulterior motives for doing so. “When you are focused on something as big as safeguarding the country and combating violent extremism,” Mr. Earnest said of the president, “it’s important not to get distracted by things that are so small. ” He said Mr. Obama’s record “speaks for itself, and that record includes a lot of dead terrorists. ”'"}, "time": 1742628439.1009755}