{"duration": 0.1245729923248291, "input_args": {"text": "'“He’s either going to be fantastic  —   or dead. ” That was the verdict of some of opera’s keenest vocal judges a decade ago when they awarded Michael Fabiano, an explosively talented tenor who was 22 at the time and pushing himself hard, a   win at the 2007 Metropolitan Opera National Council Auditions. A decade later, he is one of the most exciting,   singers in the world  —   but the fatalistic warning was still ringing in my ears a few Sundays ago when Mr. Fabiano, who likes to pilot planes on his days off, took me for a flight. As we buckled into a small Piper Archer at Essex County Airport in New Jersey, near his childhood home, Mr. Fabiano rattled off a battery of safety instructions that went well beyond the usual flight attendant script: where to find the fire extinguisher, how to brace yourself over the instrument panel if necessary, how to unlatch the door in case of a crash landing. He cried “Clear prop!” then started the propeller, and up we went. I found myself wondering if I would have felt safer flown by a singer who was not quite as   for    —   or perhaps by a baritone, or anyone other than an impassioned tenor. “Safe never wins,” Mr. Fabiano, 32, said in an interview, explaining the philosophy that has guided everything from his choice of roles to his decision to act on a lifelong dream and get his pilot’s license, despite the dangers. “I’m very, very big on preparation. I take prepared gambles. ” These are heady days for Mr. Fabiano, whose voice abounds in the     pinging quality opera buffs sometimes call “squillo. ” He is currently singing in Verdi’s “La Traviata” at the Met opposite the soprano Sonya Yoncheva, a production that will be simulcast to cinemas around the world on March 11. This summer he will sing his first Don José in Bizet’s “Carmen” in a new staging at the    Festival in France. And, in a sign of his arrival as an international star, he will open the   season at the Royal Opera House in London, in a production to be announced next month. But at nearly every step, Mr. Fabiano has been dogged by questions like the ones that the National Council judges raised a decade ago  —   about whether he was biting off too much, too soon. It is a dilemma many young singers face: Push hard and risk damaging your voice, or err on the side of caution and chance missing your moment. I witnessed one of his more remarkable gambles two years ago. The Met phoned him one afternoon while he was home in Philadelphia and asked if he would step in for an ailing tenor in Donizetti’s “Lucia di Lammermoor” six and a half hours later, in a staging he had never seen, let alone rehearsed. I happened to be at the opera house that day reporting another article. Despite the pressure he was facing  —   he had zipped up on Amtrak  —   he let me tag along as he got hastily fitted for costumes and raced through a battery of   rehearsals. By 11:05 p. m. he was basking in a standing ovation, and nursing a head wound from a cut he got exiting the stage. His exploit made international news. Reminded of the old “fantastic or dead” paths suggested by the National Council judges (in a scene captured in “The Audition,” a documentary about the competition) Peter Gelb, the Met’s general manager, said, “He seems to have gone towards the fantastic. ” Mr. Gelb’s plans include mounting a revival of Verdi’s “I Lombardi,” which Mr. Fabiano has sung to tumultuous acclaim, for him in the   season. “Everyone wants to be the next Domingo,” Mr. Gelb said. “The question for him is being careful and selective, and not blowing his voice out by taking on roles that are too much for him. ” As the plane floated above New Jersey, the Willowbrook Mall visible down below, Mr. Fabiano turned toward Lincoln Park, where he lived as a child. “Do you see that red roof?” he asked, gesturing down below. “That was my home. ” Opera was not always in the cards for Mr. Fabiano, whose family moved to Minnesota when he was 11, but whose accent is still more Jersey than Twin Cities. He comes from a musical family  —   an aunt was an opera singer  —   and he sang in high school, but as a teenager he was more interested in debate, mock trial and being a baseball umpire. (Mr. Fabiano, who cuts a trim, muscular figure now, took to umpiring rather than playing in part because he was overweight in his youth he shed 80 pounds the year he turned 20.) It was not until he got into the University of Michigan and began studying with George Shirley, a tenor who was one of the first   men to sing leading roles at the Met in the 1960s, that he became serious about singing. Mr. Shirley said that Mr. Fabiano was on a fast track from the start. “He sings with such passion  —   that’s one of the things that makes people concerned,” he said in a telephone interview. “Because whatever Michael does, it’s 3, 000 percent. There’s no backing off. That’s his personality. But so far, so good. He walks to the beat of his own drummer, and so far, the beat is solid. ” Some of Mr. Fabiano’s advisers warned him against taking on the taxing title role in Verdi’s “Don Carlo” last season at the San Francisco Opera, one of his main artistic homes in recent years. But he studied the role for three and a half years and nailed it. During the run last June, we got together at the Presidio, at a favorite spot of his overlooking the Pacific Ocean. “I always think that the great performances are the performances where you think a singer is going right to the edge,” said Mr. Fabiano, who will return to San Francisco next season to star in Massenet’s “Manon,” opposite Nadine Sierra. “When a singer has gone right to the edge, either they just make it or they break slightly and you think, that’s it. ” A dramatic fog rolled in off the ocean as we spoke. Then we headed back to the War Memorial Opera House in his black BMW Mr. Fabiano, who is on the road 11 months a year, had it shipped across country as a taste of home. As the traffic thickened, he began aggressively weaving in and out, explaining that he did not believe in defensive driving. “There are a lot of defensive singers,” he said, a dismissive edge in his voice, “who pursue their careers defensively. ” These are tricky times for an    opera star. Many companies are struggling financially singers’ fees have been cut in many places the recording industry is not what it was. Mr. Fabiano said that when he decided to make opera his career, he carefully mapped out the steps he needed to succeed. “I felt like a businessman, not like an artist,” he said. “I know so many people don’t want to hear that. I’m a businessman at the core. ” Some gambles paid off, some did not  —   looking back, he said, it was a mistake to sing at the Teatro alla Scala in Milan at 23, saying he was “too green” to make it a success. But he is constantly trying new things: Last fall, he and some friends started a foundation, ArtSmart, to give free voice lessons to teenagers who lack access. Its pilot program, at Newark East Side High School in New Jersey, reaches about a dozen students, and he plans to expand the program to Philadelphia and San Francisco. “We teach the kids any genre of music that they want to focus on,” he said, “but we do give them a base curriculum  —   stretching, breathing, vocal exercises, how to read music. ” We began our descent, the runway getting closer and closer. “Get down, honey,” he said, and a few seconds later the plane’s tires hit the tarmac.  “If I only listened to my elders and did exactly what they prescribed, I wouldn’t be who I am today,” he said, after the plane had taxied to a stop. “I might not be flying a plane, because most people told me it’s too dangerous to do, and you shouldn’t do it, and blah, blah, blah. Well, I love to fly. I will never take the careful route. ” “I don’t want to live a kind of cloistered life,” he added. “There are singers that can sing for 50 years, and there are singers that sing for 30. I’ll fall somewhere in between that. Maybe not at the high end, maybe not at the low. But somewhere. ”'"}, "time": 1742562871.6991255}