{"duration": 0.051683902740478516, "input_args": {"text": "'Comments \\nEMERGENCY!! \\nHillary came out of hiding today to make a rare appearance and it was IMMEDIATELY showed why she has been off the campaign trail and hiding from cameras. It hasn’t even been 2 months since she dropped like a rock on 9/11 and had to be hurled into the back of the van by Secret Service, and she clearly isn’t any better… \\nThe video shows Hillary confronted with ONE ’12 INCH STEP that she would have to step up onto in order to speak, AND SHE WASN’T ABLE TO DO IT! Her campaign staffer RUSHED to her aid to grasp her hand and arm to push her up onto the riser to keep her from falling again! (Scroll down for video) \\nOkay, it wasn’t technically a “medical emergency” but it would’ve been if her staffer wasn’t there to grab her! Watch how he rushed to grab her so he could help her CONQUER this 12 inch step she had to take. \\nCAN REALLY ELECT SOMEONE AS PRESIDENT OF THE UNITED STATES WHO CANNOT CLIMB UP ONE 12 INCH STEP???? \\nIS THAT ‘SEXIST’ TO WANT A PRESIDENT WHO WILL BE ABLE TO WALK AROUND THE WHITE HOUSE WITHOUT A WALKER?? \\nWATCH for yourself: Hillary heads over to the overflow area to say hello to the crowd in Lake Worth, Florida. But ya know, no enthusiasm there. 🙄 pic.twitter.com/3cUDK245XK \\n— (⌐■_■)ノHillBro (@HillBroYo) October 26, 2016 \\nTHIS WOULDN’T BE THAT TROUBLING ON IT’S OWN, BUT CONSIDER WHAT WE ALREADY KONW ABOUT HILLARY’S HEALTH! \\nShe passed out cold on a sidewalk and was drug and then flung into a van like a slab of meat (then blamed pneumonia) \\nShe’s been coughing non-stop since 2008: \\nShe reportedly now has an ambulance in her motorcade. \\nA “stroke score” finger-squeeze test was administered the day she collapsed on 9/11. \\nOh yea, like we learned today she can’t walk up stairs… \\nSHARE on Facebook because we know the mainstream media won’t cover it! '"}, "time": 1742628383.6878946}