{"duration": 0.09594440460205078, "input_args": {"text": "'The power of song has run through Benita Rudolph’s life. At 8, she joined the choir at the church in Malvern, Ark. where her father was a pastor. By 11, she was composing her own music on a small keyboard her father had given her. “There’s a joy that you feel when you see people’s faces,” Ms. Rudolph said. “It was kind of amazing to me, really, to see them thinking, ‘No, that cannot be you.’ They didn’t connect my voice to the little girl. ” Ms. Rudolph, 44, enjoyed a mostly happy childhood, but a sadness seeped into her life after her parents separated when she was a teenager. She felt a disconnection from her mother, which became more pronounced after the separation. “The teenage years, a daughter needs her mother there are things they want to ask about, they are curious about,” she said. She said she struggled without her mother’s guidance, sought out love where she should not have. She became pregnant at 18 with her daughter Deandra. Ms. Rudolph’s father absorbed the news with his signature grace he was always a source of unconditional support. In her early 20s, Ms. Rudolph joined a production of the gospel musical “My Grandmother Prayed for Me,” as an understudy in two roles. The job took her to New York City in the 1990s. Deandra was left in the care of her paternal grandparents. Ms. Rudolph’s excitement was as fleeting as her success. After a few months, Ms. Rudolph returned to Arkansas. She married and had a second daughter, Dominique. Music remained her passion, but she embarked on a different career, a decision made after her father died in 2004 of congestive heart failure related to his diabetes. He had encouraged her to share her compassionate nature with others. For years Ms. Rudolph worked as a nurse’s assistant, with hopes of eventually pursuing a nursing degree. One of her patients was an elderly man with skin cancer. She soothed his pain with song he taught her about the stock market. In early 2014, after years apart, she returned to his side when his cancer returned. His family asked Ms. Rudolph to sing at his funeral in Atlanta. She not only honored the request, but Ms. Rudolph also decided to remain in Georgia with Dominque to see what opportunities they might find. She and her husband had separated in 2010, and money became so scarce that the family was on the brink of homelessness. She did not want Dominique to experience that despair, so she sent her to live with her father in Arkansas. “That was the hardest decision I ever made, to see her go,” Ms. Rudolph said. “But all I could think about was her opportunities to come. I wanted her to have the best in life. ” A short time later, a former producer called her to say that “My Grandmother Prayed for Me” was restarting a national tour in January 2015. Ms. Rudolph returned to the roles she played as an understudy years ago and added a third, on a tour that ended in New York. After the show ended, Ms. Rudolph faced a choice: Return to the South or stay in New York. “I’m not going back,” Ms. Rudolph said. “There’s something here for me to do. I don’t know what it is I’m going to figure this thing out. ” Without a place to stay, she wound up in a shelter in the summer of 2015. The decision to remain in New York came with consequences, especially missing holidays with her family, but she does not regret it. Through a caseworker, Ms. Rudolph learned about ACE Programs for the Homeless, a partner organization of Community Service Society, one of the eight organizations supported by The New York Times Neediest Cases Fund. With the help of an employment training program, she got a job as a street cleaner and spent that summer picking up trash on sweltering, smelly streets. “It kept me humble, what I was doing,” she said. In August 2015, Ms. Rudolph landed a   job as a customer service agent for an airline at La Guardia Airport. Ms. Rudolph also completed a   certified nursing assistant program. Community Service Society used $394 in Neediest Cases funds to pay for the nursing classes at the Manhattan Institute. It also gave her $62 for MetroCards to commute to school. In the spring, she will begin a yearlong licensed practical nurse program at AMG School of Licensed Practical Nursing in Brooklyn. But before that, her focus is on the next big career step. Ms. Rudolph recently accepted an acting role in an independent film, “A Way With Anger,” which is set to begin shooting in Charlotte, N. C. later this month. “Looking back on my life, it’s amazing that I kept the faith and kept the courage and just kept moving forward despite different things that might set you back,” she said.'"}, "time": 1742564371.3689382}