{"duration": 0.040529727935791016, "input_args": {"text": "'  Gold: End Of The Year Excitement”– Stewart Thomson \\nThe world gold community should probably fasten their seat belts now , and get ready for an end of the year upside ride! For gold investors, some days are more awesome than others, and I’ll boldly suggest that today is one of those days. Here’s why: \\n\\nSubmitted by Stewart Thomson, Graceland Updates: For gold investors, some days are more awesome than others, and I’ll boldly suggest that today is one of those days . Here’s why: Inflation is no longer near. It’s here. \\nMeasured by “ stuff used ”, China is the world’s largest economy. Producer prices there have surged steadily since the start of 2016, and the index has now crossed above the key 100 marker. China is poised to become the world’s biggest exporter of a product that most analysts have forgotten about; inflation! Also, gold stocks, which I call the canary in the inflationary coal mine, may be poised to start a fresh uptrend. Double-click to enlarge this Agnico Eagle chart. The “ Eagle ” just staged a one day close above the key round number of $50. This great company is one of my key lead indicators for the entire precious metals sector, and a three day close above $50 could indicate that a new intermediate term uptrend is underway. Agnico Eagle is sometimes able to cover its entire gold mining costs just from its silver production, and it’s an important component in the GDX ETF. Also, Friday is US jobs report day, and a post report rally could see Agnico Eagle stage a weekly close above that important $50 mark. To view some longer term good news, please click here now . Top Islamic financial organizations have teamed up with the World Gold Council to launch the new Shari’ah Standard. It will be launched December 6 , just two days after the upcoming Italian referendum. The new “ Standard ” will allow Muslims to invest in gold in accordance with shariah law , and the World Gold Council predicts the Standard will add a whopping 500 tons to global demand, over just the next four years! It’s going to become increasingly difficult for mining companies to grow their production enough to keep up with this kind of demand growth. It’s becoming very clear that investors who are looking for gold price discovery “ action ” won’t be bored in the last few months of this year. Chinese New Year buying also begins in another month or so, and the US election is now only about a week away. Bitcoin often leads gold bullion. I implore the Western gold community to view bitcoin not as a competitor with gold, but as a solid part of a diversified anti-fiat investment portfolio. Gold has no competition. It’s the leader of the anti-fiat team, but not the sole player. I cover the bitcoin price action in my juniors/high risk newsletter. I own it, and I’m extremely happy with the price action. A week ago, I predicted gold would rally straight to trend line resistance at $1285, and recoil from there. That’s exactly what happened. So, what now? Well, it’s going to take a few days of closing above $1285 to launch a serious rally, and even that technical action won’t be enough, without fundamental news that is positive for gold. The critically important jobs report will be released on Friday at 830AM, and the US election follows that just a few days later. Indian festival buying is also accelerating, which should act as good background support for a big fear trade oriented rally. Japan has one of the world’s biggest economies, but gold demand there has never been a big factor in price discovery. I’ve predicted that demand in Japan will grow surprisingly quickly, as more confidence is lost in the nation’s central bank and government. Clearly, some top Japanese economists are beginning to take that same view. The US stock market has a tendency to strengthen in the November to December time frame, but I would caution stock market enthusiasts from betting too heavily on that scenario this year. Seasonally, stock market crashes tend to be most likely in September and October, but the US election, a December rate hike, and the Italian referendum are all factors that may have moved the time frame for a crash to November – December. The bottom line is that the danger of a US stock market crash is actually greater now than it was in September and October. If there is a crash, gold could surge straight to substantial resistance in the $1425 – $1432 price zone. Silver tends to follow gold, but it can also lead gold at key turning points. \\nThere’s a clean upside breakout from an ascending triangle in play. There will be substantial battle at the sizable sell-side resistance at $18.50, a battle I expect to be won by the world gold community . It’s almost certain that the upcoming US election will be the catalyst that launches the battle. Newcrest is the biggest gold producer in Australia. Like Agnico Eagle, I use it as a bell weather for the entire sector. The price action is extremely positive right now; there are bull wedge and inverse head and shoulders bottom breakouts in play, and a run to the $27 area highs appears imminent. The world gold community should probably fasten their seat belts now, and get ready for an end of the year upside ride! \\n  \\nSpecial Offer For Website Readers: Please send me an Email to [email protected] com and I’ll send you my free “Golden Steaks & Yellow Cakes!” report. I cover 5 leading gold stocks and 5 interesting uranium stocks that are “must buy” stocks right now, with key entry and exit points for all of them! \\nThanks! Cheers Stewart Thomson Graceland Updates This entry was posted in World News and tagged gold update , hyperinflation , inflation , silver update , Stewart Thomson . Bookmark the permalink . Post navigation'"}, "time": 1742628439.554677}