{"duration": 0.1804032325744629, "input_args": {"text": "'If one were to count up the number of times any American  —   or maybe anyone anywhere  —   laughed in the last   the person responsible for more of those laughs than anyone else might well be Garry Marshall, who died at 81 on Tuesday in Burbank, Calif. It would be difficult to overstate Mr. Marshall’s effect on American entertainment. His work in network television and Hollywood movies fattened the archive of romantic, family and buddy comedies and consistently found the sweet spot smack dab in the middle of the mainstream. Indeed, Mr. Marshall was one of the forces directing that mainstream, working with   stars from the 1960s (Lucille Ball and Danny Thomas, among others) into the early years of the 21st century (Anne Hathaway, for instance, whom he directed in the      film “The Princess Diaries”). Beginning in the ‘60s, his television work alone included writing scripts for the     comedies “Make Room for Daddy” (with Mr. Thomas) “The Lucy Show” and “The Dick Van Dyke Show. ” In 1970, with Jerry Belson, a frequent early writing partner, he adapted Neil Simon’s play “The Odd Couple” into the ABC television series of the same name, starring Tony Randall and Jack Klugman as the mismatched roommates, the neatnik Felix and the slob Oscar. Mr. Marshall went on to create, in 1974, “Happy Days,” a fondly nostalgic parody of   life in the 1950s and early ’60s featuring a roster of stereotypical young people, including Ron Howard as Richie, the straight arrow, and Henry Winkler as the rebellious,   charmer known as the Fonz. (The lawyer Martin Garbus, who was a friend of Mr. Marshall’s from their early teens, and who confirmed the death, said in an interview that he was the model for Richie and that the other characters in the show were generally based on Mr. Marshall’s friends from the Bronx, though “Happy Days” was set in Milwaukee.) A hit in itself, the show begat other hits. One featured the charmingly innocent, logorrheic space alien Mork, from Ork, played by Robin Williams, who appeared in a “Happy Days” episode in early 1978 and became the central character in “Mork  Mindy,” a show created by Mr. Marshall with Joe Glauberg and Dale McRaven. They set Mork down in Boulder, Colo. where he befriends a young woman, played by Pam Dawber, who patiently teaches him the ways of earthlings and eventually marries him. “Happy Days” lent another   show, “Laverne  Shirley,” both a setting and its main characters. Created by Mr. Marshall with Lowell Ganz and Mark Rothman, it was about a pair of   single women  —   Laverne DeFazio, played by Mr. Marshall’s younger sister Penny, and Shirley Feeney, played by Cindy Williams  —   who work at a brewery. They had been introduced to the “Happy Days” audience when they went on a double date with the Fonz and Richie. “Garry Marshall had a feel for Everyman,   comedy that matched exactly the young,   audience that made up the base of ABC’s appeal,” Bill Carter, the former longtime television reporter for The New York Times and now a commentator for CNN, said in an email. “He was the dominant figure in the rise of that long downtrodden network to a run of ratings supremacy in the 1970s. It was the first time ABC had ever ascended to the top of television. ” Mr. Marshall began directing movies in the 1980s. Several were   star vehicles that dealt with mismatched pairs: “Nothing in Common” (1986) a reconciliation story with Jackie Gleason and Tom Hanks as cantankerous father and resentful son “Overboard” (1987) which proposes that a meanspirited heiress with amnesia (Goldie Hawn) can be persuaded to believe she is the wife of a carpenter (Kurt Russell) and, most famously, “Pretty Woman” (1990) a Cinderella tale  —   and a gigantic hit  —   set in contemporary Los Angeles, about a hooker with a heart of gold (Julia Roberts) and her Prince Charming, a ruthless corporate raider (Richard Gere). Mr. Marshall once confessed that he wanted to be “the Norman Rockwell of television. ” “I like to do very romantic, sentimental type of work,” he told The  Times as “Pretty Woman” was being released. “It’s a dirty job, but somebody has to do it. ” As an actor, Mr. Marshall appeared frequently in small roles, cast usually to take advantage of his casually blunt manner and distinctly nasal Bronx accent, perhaps best exemplified by a scene in Albert Brooks’s comedy “Lost in America” (1985) in which he played a Las Vegas casino manager whom Mr. Brooks harangues in an attempt to get him to return the money he lost gambling. When Mr. Brooks says the casino could be like the Gimbels department store in the Christmas movie “Miracle on 34th Street,” profiting from an act of beneficence, Mr. Marshall is the personification of flabbergasted. “In that movie, Santy Claus took care of everything,” he says in the film. “There was Macy’s, Gimbels, but Santy Claus came and he fixed the whole thing. We don’t have Santy Claus. ” Garry Kent Marshall was born in the Bronx on Nov. 13, 1934. His father, who was born Anthony Masciarelli but changed the family name, made industrial films. Mr. Marshall recalled them in an interview in 2000 with the Archive of American Television. “‘The Story of Zinc,’ ‘Smelting in the Pittsburgh Mill’  —   we watched them,” he said. “Not one laugh. ” His mother, the former Marjorie Ward, taught dance classes in the basement of their apartment building. She was also the family wit, Mr. Marshall said, who introduced him to   humor, “which became one of the great tools of humor throughout my career. ” “My mother was funnier than anybody I ever worked for,” he said in the 2000 interview, fingering his sport jacket. “My father was as funny as this coat. Not a laugh a minute, my father. ” As a boy, Mr. Marshall learned to play the drums, and he was a good athlete a shortstop, he admired Phil Rizzuto of the Yankees and was known as Flip, he said, for the way he tossed the ball. He used that nickname later when he performed in nightclubs. Adding his father’s former surname, he called himself Flip Masciarelli  —   a creative hiccup away from the name of one of his   characters, Arthur Fonzarelli, a. k. a. the Fonz. Mr. Marshall attended Public School 80 and DeWitt Clinton High School in the Bronx and graduated from Northwestern University, where, he recalled in an interview with The Wall Street Journal in May, “I realized words mattered and I studied journalism. ” When his mother died in 1983, Mr. Marshall and his family donated $1 million to Northwestern to name a building in his mother’s name: The Marjorie Ward Marshall Dance Center. Mr. Marshall joined the Army in 1956 and served in South Korea before returning to New York, where he worked briefly for The Daily News, did his comedy routines at night and wrote jokes for the comedian Joey Bishop and others. In the early 1960s he moved to Los Angeles, where he met a nurse, Barbara Sue Wells they married in 1963. In addition to her, his survivors include a son, Scott two daughters, Lori and Kathleen two sisters, Ms. Marshall, the actor and director, and Ronny Hallin, a producer and six grandchildren. Mr. Marshall wrote episodes for many of the shows he created, and he contributed to other   series, including “Gomer Pyle: U. S. M. C.,” a spinoff of “The Andy Griffith Show,” starring Jim Nabors the buddy adventure drama “I Spy,” with Robert Culp and Bill Cosby and the omnibus sitcom “Love, American Style. ” Not all of his series were big winners. Among his   and less successful were “Hey Landlord,” about a young man from Ohio who inherits a New York apartment building “Me and the Chimp,” about a dentist (Ted Bessell) and his family, who adopt, well, a chimp “Angie,” about a waitress (Donna Pescow) who marries a wealthy young doctor (Robert Hays) and “Joanie Loves Chachi,” another “Happy Days” spinoff, starring Erin Moran and Scott Baio. Mr. Marshall’s other films include “Beaches” (1988) a melodrama about the trials and tribulations of a   friendship between two women, played by Barbara Hershey and Bette Midler “Frankie and Johnny” (1991) based on a play by Terrence McNally, about the courtship of a waitress (Michelle Pfeiffer) by a persistent     cook (Al Pacino) “Runaway Bride” (1999) a   reuniting Ms. Roberts and Mr. Gere as a      repeat offender and the journalist who writes about her and, in his last few years, a handful of comedies with   ensembles telling a variety of stories revolving around holidays: “Valentine’s Day” (2010) New Year’s Eve” (2011) and “Mother’s Day” (2016). A theater buff, Mr. Marshall built a   performance space in Burbank, Calif. and opened it as the Falcon Theater in 1997 it began a   subscription series in 2002. He also tried his hand at playwriting, with limited success. His   play, “Wrong Turn at Lungfish,” written with Lowell Ganz, was a bittersweet   comedy about a dying, sightless and cantankerous old intellectual, a perky, uneducated young woman who volunteers to read to him, and her lunkhead of a boyfriend. It was presented at Steppenwolf in Chicago and in 1993 Off Broadway, directed by Mr. Marshall with George C. Scott, Jami Gertz and Tony Danza in the leading roles. Mr. Marshall is the author of two memoirs, both written with his daughter Lori: “Wake Me When It’s Funny: How to Break Into Show Business and Stay” (1995) and “My Happy Days in Hollywood” (2012). “Critics have knocked me for targeting society’s lowest common denominator,” Mr. Marshall said in the earlier book. “I believe that television was, and still is, the only medium that can truly reach society’s lowest common denominator and entertain those people who maybe can’t afford a movie or a play. So why not reach them and do it well? “When I produced a television show I didn’t just roll out of bed each morning and say, ‘I’m going to make some rich, smart and successful people laugh.’ I thought, ‘Let them get their own laughs.’ They have the money to pay for it. ”'"}, "time": 1742563952.3561249}