{"duration": 0.09556818008422852, "input_args": {"text": "'BEIJING  —   Zhou Yunfei, a technology executive who owns a villa in eastern China, did not have much in common with an impoverished farmer more than 500 miles away who was convicted of murdering a village chief with a nail gun. But when Mr. Zhou heard last week that the Chinese government had executed the farmer, Jia Jinglong, he was furious. He saw it as a sign that the ruling Communist Party was imposing harsh punishments on the most vulnerable members of society while coddling the   elite. “The legal system isn’t fair,” Mr. Zhou, 57, said, adding that local officials had “turned against the common people. ” President Xi Jinping has made restoring confidence in Chinese courts a centerpiece of his rule, vowing to promote “social justice and equality” in a legal system long plagued by favoritism and abuse. Since coming to power in 2012, he has led a   campaign against corruption, ensnaring thousands of   officials and even some of the party’s most senior leaders. But the furor over the execution of Mr. Jia, who had sought revenge on officials for demolishing his home, has raised doubts about Mr. Xi’s efforts, with people across the country publicly assailing inequities in the justice system and asking why   officials often escape the death penalty. “The perception is that the people are powerless and vulnerable against corrupt officials,” said Fu Hualing, a law professor at the University of Hong Kong. “What is surprising is that Xi Jinping has been in power for four years, and that narrative has not changed. ” The uproar has placed the party, which is working to tighten its grip on courts while promoting the idea of fairness, in an awkward position. Mr. Xi has cultivated an image as a champion of the people willing to take on corrupt officials of any stripe. Yet Mr. Jia’s case has reawakened concerns, especially among rural residents and members of the urban working class, that the Communist Party is protecting its own members. In fiery social media posts and   conversations, some have argued for making punishments against corrupt officials more severe. Others have suggested that China, believed to be the world’s top executioner, should substantially reduce its use of the death penalty against impoverished citizens. China’s leaders seem conflicted about how to respond to complaints of unfair treatment, which have plagued the judiciary for decades but have taken on new urgency as Mr. Xi attempts a    overhaul of the system. On the one hand, party leaders might be wary of exacerbating the anger felt by many Chinese people, who often side with villagers like Mr. Jia, seeing them as folk heroes standing up against venal forces. At the same time, Beijing might not want to be seen as endorsing an attack on a government official. And some party leaders may not like the idea of setting a precedent for using the death penalty against senior officials, at a time when critics of Mr. Xi say he is using the anticorruption campaign to go after political enemies. “There’s a strong incentive for the elite within the party to protect itself,” said Jerome A. Cohen, a New York University law professor. “People realize today they’re free, but tomorrow they could be the targets. ” In recent days, the party’s hesitation has seeped into public view. The government at first appeared to tolerate, and even encourage, debate about Mr. Jia’s case. Lawyers issued open letters pointing to flaws in the prosecution’s argument, and state media outlets published sanctimonious editorials calling for the court to show humanity. But as discontent spread on social media in the days leading up to Mr. Jia’s execution, the government reversed course and began censoring some online discussions about the case.   media organizations adopted a scolding tone, warning that public opinion had “hijacked” the case. People’s Daily, the party’s flagship newspaper, went a step further, arguing that citizens should not express contrarian views about court cases in public. “We can see that online public opinion can deviate from reason and even become a terrifying tool that kills humanity and conscience,” an editorial in the newspaper said. While the government has historically tolerated some debate about judicial decisions, Mr. Xi has generally sought to rein in dissent, especially when it gathers force online. Li Wei, an activist in Beijing who was imprisoned for two years under Mr. Xi for helping organize protests demanding financial disclosures from party leaders, circulated a   petition online in late October calling for Mr. Jia to be spared and for the government to adopt a “more humane” justice system. Soon his cellphone was buzzing with messages from university students, professors, security guards and others. He gathered 1, 274 signatures over a few days, he said, before the authorities shut down his social media accounts. “The   anticorruption campaign is not genuine,” Mr. Li, 45, said in an interview at a Beijing teahouse. “The reason why they were doing this is because they want to salvage the Communist Party regime. ” Chinese leaders appear to be working to counter perceptions that officials are being treated with kid gloves. Over the past year, party leaders have vowed to consider punishing officials who commit grave crimes, including stealing more than about $436, 000, with the death penalty. They have also introduced new forms of punishment aimed at corrupt officials, including lifetime jail sentences without the possibility of parole. But the government has yet to systematically invoke any of those punishments against prominent officials. And critics can point to a raft of recent cases in which powerful people and their families escaped the death penalty. There is the example of Zhou Yongkang, China’s former security chief, who was sentenced to life in prison last year for taking bribes and revealing state secrets he was the most senior leader to be jailed for corruption in more than 65 years of Communist rule. And many people note the case of Gu Kailai, the wife of one of China’s most prominent politicians, whose death sentence for the murder of a British business associate was commuted to life in prison last year. Fan Zhewang, 42, a teacher of Maoism at Xi’an University of Posts and Telecommunications in central China, said the treatment of Ms. Gu epitomized the inequities in the system. Mr. Fan said that while the government’s decision to execute Mr. Jia was legal, he was concerned that a lingering sense of injustice and resentment among villagers would prompt more violence against officials. “In the future,” Mr. Fan said, “I worry that people will just kill whole families of village chiefs. ” On Wednesday, a day after Mr. Jia was executed, a farmer in Yan’an, a northwestern city celebrated as a stronghold of the Communist revolution, was arrested and charged with killing a village official and several of his relatives, according to local reports. The man was said to be angry after officials seized his land. In the days after the execution of Mr. Jia, friends and relatives in his village in the northern province of Hebei circulated a poem he wrote while in prison in which he described being in a dreamlike state. “I’ll miss the smell of flowers,” he wrote, “and the serenity of grass, something I love. ” Villagers said they did not want to talk about the case anymore. A man who gave his last name as Li said residents had grown accustomed to suffering injustices at the hands of wealthy government officials. “Who do you turn to in order to vent your anger?” he said. “There’s no one we can seek help from. ” “Many people are angry,” he added, “but we don’t dare speak up. ”'"}, "time": 1742562729.1281846}