{"duration": 0.05184054374694824, "input_args": {"text": "'Speaking of “Big Little Lies,” HBO’s glossy new melodrama starring Reese Witherspoon, Nicole Kidman and Laura Dern, an HBO executive has said, “We’re not doing ‘Desperate Housewives’ here. ” Maybe they should have thought harder about that. Whatever surface advantage “Big Little Lies” may have in sophistication and seriousness over “Desperate Housewives,” it could have learned a few lessons from that   ABC potboiler in how to tell a story and keep an audience entertained. Like “Desperate Housewives” in its first season, “Big Little Lies” (which begins Sunday and was based on a novel by the Australian writer Liane Moriarty) juxtaposes the mystery of a suspicious death with the seemingly perfect everyday lives of a group of mostly prosperous women. The main characters, all suspects in the mystery, are linked because their children attend the same progressive elementary school in Monterey, Calif. which is said to be “a private school at a   price. ” Their lives, of course, are anything but perfect, and the show’s drama comes from unspooling the tangles of violence, infidelity and frustration just below the surface. It doesn’t come from the mystery, which, through six of the season’s seven episodes, hangs offscreen like a dead fish. The show’s writer, the veteran David E. Kelley, and director,   Vallée (“Dallas Buyers Club”) do not show the process of detection at all  —   no evidence, no clues, no cops showing up at inconvenient times. We don’t even know who’s dead, a cliffhanger (or red herring?) presumably saved for the last episode. What we do get are snippets of police interviews with a Greek chorus of minor characters  —   other parents from the school  —   who happily testify to the imperfections of the leads. Turning the mystery into such a complete MacGuffin as a way to foreground the domestic drama might make sense if that drama were, say, interesting. But the real problem with “Big Little Lies” is that the women’s stories, however well acted and artfully photographed, are just a compendium of clichés about    angst. Not interested in the mom who’s bored with her husband and mired in a midlife crisis because she can’t have it all? (The original big little lie.) Then how about the   Silicon Valley executive who goes ballistic when her daughter reports being bullied at school, the event that may or may not have led to the mysterious death? Or the abuse victim who’s reluctant to leave her husband, a subplot that’s more disturbing but also strays into “Fifty Shades” territory? Ms. Witherspoon, Ms. Kidman and Ms. Dern do everything they can to bring their stock characters and situations to life, and from moment to moment they can be fun to watch. Ms. Dern is particularly sharp as the tech hotshot  —   she has just been named to the board of PayPal  —   who melts down as she finds she’s unable to protect her daughter, or even to figure out what’s happening to her. All their characters, as well as that of a new, less wealthy mom played by Shailene Woodley, are   “rounded”  —   their Type A outbursts balanced by moments of humor and compassion. This is done so obviously that rather than making them more realistic, it just makes them more mushy and indistinct. If they’re so nice, why do they behave so badly to one another? The show is premised on the idea that that’s just the way it is these days for overstressed moms, which may be true in real life but isn’t, in itself, a satisfactory motivator for drama. Ms. Kidman and Ms. Witherspoon are executive producers of “Big Little Lies,” and you can see what they probably thought they had  —   a sexy   that would also be a commentary on issues important to women their age (40s). But the mystery is a sham, and the drama doesn’t have anything new or interesting to say. (The plot involving Ms. Kidman’s character and her violent, younger husband, played by Alexander Skarsgard, has a creepy energy, though. It’s as unoriginal as the other story lines, but it keeps you watching.) Still, there’s value in a series in which at least one of these accomplished actresses is almost always onscreen. And there’s no shame in enjoying the lifestyle pornography. Setting the story in Monterey, a   tourist town, may not make much sense  —   the characters portrayed here would be much more likely to live up the coast in Woodside or Atherton  —   but it allows for many scenes to be shot in gorgeous oceanside homes. Visually, at least, “Big Little Lies” is the perfect television beach read.'"}, "time": 1742628534.1812398}