{"duration": 1.2342298030853271, "input_args": {"text": "'Leave a reply Charles Hugh Smith – The sole output of America’s Establishment/Ruling Elite is self-serving hubris. America’s Ruling Elite is freaking out because a significant percentage of the American public is trying to fire them. The Ruling Elite has failed and deserves to be fired, and deep down, they know it–and this awareness of their self-serving failure fuels their panic and their loathing of the non-elite Americans who are trying to fire them. If you think this chart of soaring student loan debt is a sign of “success,” you are 1) delusional 2) protected from the dire consequences of this failure 3) getting your paycheck from this failed system. That in a nutshell is the state of the nation: those who are protected from the consequences of failure are loyal to the Establishment, as are the millions drawing a paycheck from systems they know are irredeemable failures. Let’s review the central institutions of the nation: 1. Healthcare: a failed system doomed to bankrupt the nation. 2. Defense: a failed system of cartels and Pentagon fiefdoms that have saddled the nation with enormously costly failed weapons systems like the F-35 and the LCS. 3. Higher Education: a bloated, failed system that is bankrupting an entire generation while mis-educating them for productive roles in the emerging economy. (I cover this in depth in The Nearly Free University and the Emerging Economy and Get a Job, Build a Real Career and Defy a Bewildering Economy .) 4. Foreign policy: Iraq: a disaster. Afghanistan: a disaster. Libya: a disaster. Syria: a disaster. Need I go on? 5. Political governance: a corrupt system of self-serving elites, lobbyists, pay-to-play, corporate puppet-masters, and sociopaths who see themselves as above the law. In Why Our Status Quo Failed and Is Beyond Reform , I explain why the only possible output of these systems is failure. The sole output of America’s Establishment/Ruling Elite is self-serving hubris. In the open market, failed leadership has consequences. Customers vanish and the enterprise goes bankrupt, or shareholders and employees rally to fire the failed leadership. In our state-cartel system, failed leadership only tightens its grip on the nation’s throat. The Deep State can’t be fired, nor does it ever stand for election. The two political parties are interchangeable, as are the politicos who race from fund-raiser to fund-raiser. It’s tempting to blame the individuals who inhale the wealth and power of our failed system, but it’s the system, not the individuals, though a more corrupt, craven, self-serving lot cannot easily be assembled. In broad brush, the Establishment and its Ruling Elite are still fighting World War II. The solution to the Great Depression and fascism was to cede complete control of the economy, the media and the social order to the central state. Tens of millions of people were aggregated into vast industrial corporations or the Armed Forces. Everyone heard the same “news” and had the same limited choices of work and consumption. It was easier for the federal government to control a handful of cartel-corporations and unions, and this cemented the state-cartel system that remains dominant today. But the world and the economy changed, and this model was no longer efficient or effective. Sprawling corporations with captive domestic markets started facing global competition, and networks of interchangeable suppliers were much more efficient than vertically organized corporations. Adding layers of government bureaucracy to manage increasing complexity was no longer effective or affordable as labor costs rose and the efficiencies of networks outpaced cumbersome hierarchies. People lost faith in their government and their cartel-corporations because the truth broke through the state-managed propaganda. Industrial corporations were revealed as greedy polluters; auto manufacturers churned out vehicles with scant care for safety, and the federal government lied to the citizens about the war in Vietnam, and much else. The Internet was the stake through the heart of this inefficient, ineffective state-cartel hierarchy. The Internet enabled a level of transparency that was impossible in the old state-cartel model in which everyone watched the same three TV networks and read the same managed “news.” Consumers could now access the experience of other consumers directly, bypassing the filtering mechanisms of a complicit state and the corporate PR/marketing machinery. Governments were pressured to (very reluctantly) make public all sorts of material that was safely private in the good old days of backroom dealing and sweetheart contracts with pals. The central state’s resistance to transparency only reinforced the public’s loss of trust. The more money and power the state grabbed, the greater the level of corruption and self-serving insider dealing. The more the state managed the private cartels of banking, Big Pharma, higher education, the military-industrial complex, healthcare insurers, etc., the more costs soared while the quality of the output plummeted. The current self-serving Ruling Elite deserves to be fired for its abject failure of leadership. The nation desperately needs leaders who understand the economy and nation are in the midst of a new industrial/digital revolution that favors networks over hierarchy and transparency over state-cartel corruption. Unfortunately, as I explain in Resistance, Revolution, Liberation: A Model for Positive Change , the central state has no mechanisms for devolving power to decentralized networks, or surrendering either power or budgets. The central state only knows how to aggregate more power and skim more money from the private economy. The last failed remnants of the state-cartel hierarchies left over from World War II must implode before we can move forward. Healthcare, defense, pharmaceuticals, higher education, the mainstream media and the systems of governance must all decay to the point that no one can be protected from the destructive consequences of their failure, and no paychecks can be issued by these failed systems. Only then can we face the reality that failure has consequences.'"}, "time": 1742562584.4178023}