{"duration": 0.06103157997131348, "input_args": {"text": "'CNN anchor Anderson Cooper says he regrets making a “crude” and “unprofessional” remark about President Donald Trump to Jeffrey Lord live   Friday during a segment on AC360. [Lord, a CNN political commentator, and Cooper were debating a dubious New York Times story that claimed, based on anonymous sources, that Trump reportedly told Russian officials that former FBI Director James Comey is a “nut job. ”  “I don’t care what he says to the Russians he’s the President of the United States,” Lord told Cooper. Cooper crudely replied, “If he took a dump on his desk, you would defend it. I don’t know what he would do that you would not defend”: ”If he took a dump on his desk you would defend it.” 💩@andersoncooper what? 😲 pic. twitter.   —   Salvador Hernandez (@SalHernandez) May 20, 2017,  Cooper’s remarks, made live   quickly caused controversy on social media. Actor James Woods said Cooper’s comments marked “a new low for #CNN”: #Scatologist #AndersonCooper sets a new low for #CNN #PooperScooper https:  .   —   James Woods (@RealJamesWoods) May 20, 2017,  This is a journalist? #AndersonCooper https:  .   —   James Woods (@RealJamesWoods) May 20, 2017,  ”Its not news, its #CNN” #ScatologistAndersonCooper #DeskDumpster #AndersonScooper https:  .   —   James Woods (@RealJamesWoods) May 20, 2017,  Other social media users ripped Cooper and CNN for “fake news” and their   bias: @andersoncooper Shame on you and your fake news #IfAlledgedDomeoneSaidTheySay #AndersonCooperWeWantRealNewsNotFantasyNews,  —   Mid Merica (@L0veAm0re) May 20, 2017,  THIS is JOURNALISM? Disgusting! #AndersonCooper to Jeffrey Lord: You’d defend Trump if he ’took a dump on his desk’ https:  .   —   Lady De’Plorable (@IncognitoPatrio) May 20, 2017,  Cooper quickly issued an   apology for his remarks and released a short statement on Twitter, apologizing for what he had said. “I regret the crude sentence I spoke earlier tonight and followed it up by apologizing on air,” the CNN host tweeted. “It was unprofessional. I am genuinely sorry. ” Lord, for his part, humbly accepted Cooper’s apology. “@andersoncooper is my colleague and a friend for whom I have the highest professional and personal regard. Message America? It’s ok 2 laugh!” Lord wrote on Twitter. @andersoncooper is my colleague and a friend for whom I have the highest professional and personal regard. Message America? It’s ok 2 laugh!  —   Jeff Lord (@realJeffreyLord) May 20, 2017,  The incident comes about a week after many media outlets and pundits accused Cooper of rolling his eyes at Trump senior strategist Kellyanne Conway while the two were debating Comey’s firing on CNN: Best. EyeRoll. Ever  …    . pic. twitter.   —   James Corden (@JKCorden) May 10, 2017,  Follow Jerome Hudson on Twitter @jeromeehudson.'"}, "time": 1742563877.8160348}