{"duration": 0.06178474426269531, "input_args": {"text": "'Voter fraud is all too real — particularly so in Chicago, Illinois, where it seems dead Americans have been voting for decades. \\nHow many dead Americans? A lot. \\nIn fact, an investigation by local news station WBBM showed that “119 dead people have voted a total of 229 times in Chicago in the last decade.” \\nHere are just a few examples: Susan Sallee, who died in 1998 but voted in 2010 … Victor Crosswell, who died in 1994 but has voted six times since his death … Floyd Stevens, who died in 1993 but has voted 11 times since his death … Earl Smith, who died in 1997 but has voted twice since his death … Tadeusz Cielsa, who died in 1998 yet managed to somehow cast a ballot in 2010 … \\nWho the heck is going to vote next, huh — Abraham Lincoln, George Washington, JESUS!? \\nThis sort of voter fraud exists because state governments refuse to do their due diligence and remove deceased voters from their records. Susan Sallee’s son would know. He claimed that despite having reported his mother’s death numerous times, she still remains on the voter roll. \\n“They’re just not taking her off the rolls,” he said. \\nWonderful … \\nObviously, 119 dead Americans voting 229 times seems like a small number, correct? Multiply that by 35,000 cities and towns, as estimated by The National Map , and suddenly those 119 Americans and 229 votes transform into 4.165 million Americans and 8.015 million votes. \\nSee the problem? \\nOf course, the easiest way to remedy this dilemma would be to simply implement voter ID laws across the board, thus making it nearly impossible for cheaters and frauds to cast ballots on behalf of deceased Americans. \\nUnless the fraudsters were to look identical to the dead individuals whose identities they desire to co-opt, they would simply be out of luck. Case closed. \\nExcept that liberals keep fighting voter ID laws tooth and nail, trying their hardest to prevent such laws from taking hold across the nation. \\nWhy? Because they refuse to even acknowledge the existence of voter fraud, claiming instead that it “is very rare” and “nearly non-existent,” in the words of the liberal Brennan Center for Justice . \\nJust like with every other issue that divides Republicans and Democrats, the left refuses to recognize the facts, which are that voter fraud is real, and voter ID laws represent a reasonable solution to this problem. \\nEven worse, they have taken to outputting phony arguments such as this: “Voter ID laws are racist!” \\nBull …'"}, "time": 1742564376.1375055}