{"duration": 0.15096426010131836, "input_args": {"text": "'JOHANNESBURG  —   When South African voters last month handed the African National Congress its   losses, seemingly chastened party leaders said they would engage in “introspection. ” They promised to reach out to South Africans disillusioned by the A. N. C. ’s apparent transformation from a celebrated liberation movement with cherished ideals to a corrupt party interested in   and  . But in the weeks since the Aug. 3 municipal elections, the A. N. C, which remains in power at the national level, has brushed aside calls from inside and outside the party to replace the   president, Jacob Zuma, before the end of his term in 2019. Instead of introspection, Mr. Zuma and his allies have moved aggressively to tighten their grip on the state’s coffers, surprising opponents and allies alike with their undisguised moves. With little explanation, Mr. Zuma announced that he would directly oversee the state enterprises that have long been the source of public corruption. And his allies have renewed their attacks on Mr. Zuma’s finance minister, Pravin Gordhan, who has built a reputation for probity and has tried to uproot malfeasance in government even one of the A. N. C. ’s closest allies, the South African Communist Party, has described the moves against the minister as intended to “weaken Treasury’s struggle against corruption. ” “This is further confirming the people’s suspicions about the A. N. C. ,” said Sasabona Manganye, the chairman of the Sefako Makgatho branch of the A. N. C. in Johannesburg, which has called on Mr. Zuma and the party’s top leaders to resign. “Unfortunately, the biggest loser out of all of this is the A. N. C,” he said. “If the A. N. C. leaves Zuma to remain president until 2019,” he added, “we should just accept that Zuma will be the last president that the A. N. C. had. ” The party’s reaction to the rebuke of voters has deepened doubts that, 22 years after winning power after the end of apartheid, it can fully transform itself from a liberation movement to a   political party. Will it suffer the fate of Africa’s other liberation movements, which, years after abandoning their original ideals, have clung to power through patronage, coercion or even force? The liberation movements that helped free much of southern Africa decades ago are still in power  —   in Zimbabwe, Namibia, Mozambique and Angola. Like the A. N. C. they have used their liberation credentials to maintain their grip on power and to fend off rivals. But their records in government have been mixed at best, or, in the case of Zimbabwe, deeply tarnished. “We’re in the lingering days of these liberation movements,” said Roger Southall, a professor emeritus at the University of the Witwatersrand in Johannesburg and an expert on liberation movements. “They’re not suddenly going to lose power,” he added. “They’ll go on organizationally. But they’ve certainly lost their shine, the hopes that they were embodied with, and, in South Africa, that process has been hugely accelerated by the Zuma presidency. ” Many African nations gained their independence in the 1960s after former colonial rulers withdrew from the continent. But the liberation movements took up armed struggle against colonial powers or white settlers, in that way gaining greater moral authority. In the constellation of liberation movements, none shone brighter than the A. N. C. and its most famous leader, Nelson Mandela. To liberation movement leaders like Mr. Zuma, who said last year that the A. N. C. “comes first,” even before the nation, nothing remains more vital than the movement. Many leaders have described their movement in religious terms, including Mr. Zuma, who until last month often said that the A. N. C. would rule “until Jesus comes. ” The qualities that were prized in liberation leaders and movements have often proved detrimental in government. “The A. N. C. is now being forced to change into a political party,” said Rekgotsofetse Chikane, a university student leader and A. N. C. member who is the son of a famous party leader, the Rev. Frank Chikane. “Even though it’s a political party in name, it is still a liberation movement through its actions  —   the way it thinks about how it’s going to deliver services, the way it builds its rhetoric and the way it defends itself. ” Because of its past as a liberation movement, the younger Mr. Chikane said, the A. N. C. practices a “centralized democracy” in which leaders simply give commands and are not used to a    with other party members or with voters. Given the strength of South Africa’s democratic institutions compared with those of its neighbors in the region, Mr. Chikane said he was optimistic that the party would successfully transform itself. But he said it would be an arduous process because many in the party, shocked by last month’s elections, were focused simply on retaining power through two more presidential elections, or through 2024. “Those who’ve been pillaging the state in one way or another will pillage as much as possible until the last possible moment, so that when the game is over, they will be set for the rest of their lives,” Mr. Chikane said. “That’s what we’re going to see with parastatals,” he added, referring to state enterprises. In Zimbabwe, the same liberation movement and leader remain in power 36 years after the end of white minority rule. In the first years after liberation, decades before Zimbabwe degraded into a kleptocracy, President Robert Mugabe and his   party were celebrated around the world, including by Western governments, as embodying the hopes of a new Africa. Over the weekend, Mr. Mugabe accused the West of continuing to plot to replace southern Africa’s liberation movements with “pliant puppet regimes. ” Zimbabwe’s economy is in free fall government workers, who make up most of the 10 percent of Zimbabweans fortunate enough to be employed in the formal sector, are being paid weeks late because of the government’s severe cash shortage. The fierce struggle to succeed Mr. Mugabe, increasingly frail at 92, has dominated the capital, Harare, in recent months. Zimbabwe’s political elites have focused their attacks on rivals’ liberation credentials  —   exhuming events that occurred generations ago. Joice Mujuru, a liberation hero known by her nom de guerre, Spill Blood, served as Mr. Mugabe’s vice president for a decade until she was expelled from the governing party in 2014.   officials, who once lauded her wartime heroics, have been calling her a fraud since she created her own party this year. They say that the act of heroism for which Ms. Mujuru became famous  —     shooting down an enemy helicopter  —   was a fabrication. In turn, Ms. Mujuru and her allies have said that Mr. Mugabe  —   an intellectual who was imprisoned for years before becoming one of the liberation movement’s political leaders  —   was not a war veteran. He did not see combat, they said, and did not even have a nom de guerre. “  and the A. N. C. will never change because their support is based on the history of their liberation struggles,” said Margaret Dongo, a former   politician who is now allied with Ms. Mujuru. “That’s their trump card. ” Ms. Dongo, who also fought during the war of liberation and was known as Tichaona Muhondo, or We Shall See in the War, led the latest riposte against Mr. Mugabe and his liberation credentials. The    has reinforced the popular impression that the country’s politicians make up a class out of touch with the nation’s problems. “People are concerned about the    issues of this country and not how this and that became a hero or turned into a villain,” said Richmond Gumbo, a student who was reading newspapers in the library of the University of Zimbabwe in Harare recently. He added, “Leaders need to bow down to the needs, the basic needs of the people, and not to brag about how they fought in the liberation war over 36 years ago. ”'"}, "time": 1742564327.210941}