{"duration": 0.03996133804321289, "input_args": {"text": "'Author and prolific Tweeter Joyce Carol Oates openly pondered the state of Christianity in America in a post to her Twitter account Thursday afternoon  —   and believes Christianity is now indistinguishable from white nationalism in many parts of America. [Those (of us) who could not believe in Christianity as a religion nonetheless believed that its tenets  ideals were noble, profound.  But,  —   Joyce Carol Oates (@JoyceCarolOates) January 13, 2017,   @JoyceCarolOates what has happened to Christians in recent years! Virtually synonymous   white nationalism in many parts of country.  —   Joyce Carol Oates (@JoyceCarolOates) January 13, 2017,  Of course, many of the    author’s 160, 000 social media followers (and presumably some Christians) took umbrage at the suggestion that their faith automatically makes them a white nationalist. @JoyceCarolOates so all those Yazidis massacred in Syria. White Nationalists?  —   ZendoDeb (@ZendoDeb) January 13, 2017,  . @JoyceCarolOates Country is full of black churches  packed every Sunday, they’re Christians. Or are you not aware Baptists are Christians?  —   Michelle (@1MonthLeft) January 13, 2017,  @JoyceCarolOates It’s only ”virtually synonymous” in your own head. And that’s about YOU, not Christianity. But don’t worry, you’re forgiven,  —   The Department of No (@SantasTavern) January 13, 2017,  @JoyceCarolOates I’m not even Christian and still find this a disgusting, bigoted generalization.  —   Cate (@ArmyofBlonde) January 13, 2017,  Then again, Oates has a long history of issuing questionable tweets in June of 2015, the National Book   expressed her outrage that director Steven Spielberg had posed for a photograph with what appeared to be a dead animal. So barbaric that this should still be allowed  …      No conservation laws in effect wherever this is? https:  .   —   Joyce Carol Oates (@JoyceCarolOates) June 9, 2015,    viewers, or anyone that has seen the 1993 film Jurassic Park, knew that Spielberg was posing with an animatronic dinosaur prop from the film. This guy thinks it’s cool to kill defenceless animals then take a selfie. Jerk. pic. twitter.   —   Chris Tilly (@TillyTweets) June 9, 2015,  In November, Oates was roundly mocked for issuing a tweet about ISIS. The author wanted to know whether there were any “celebratory or joyous” aspects of the murderous terrorist group, rather than the “puritanical and “punitive” aspects she had heard so much about.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742562552.5913167}