{"duration": 0.05107402801513672, "input_args": {"text": "'Click for full size (374K) picture. \\nThis photograph appears on pages 24 and 25. Taken by AP Photographer James Altgens, it clearly captures the moment when John Kennedy clutches his throat. Note the following. \\nJohn Connally is clearly turned to his right. Had he indeed been hit by the same bullet which has just exited Kennedy\\'s throat, his wounds would have traversed his body from right to left. Connally\\'s wounds were from back to front. NOTE: The claim has been made that Connally was facing forward when JFK was shot in the neck, before the photo was taken, but in order to then see the view in this photo, Connally would have had to twist to his right after being shot! \\nNote the turned heads of some of the policemen and Secret Service agents. Clearly, they have heard and are responding to the sound of gunshots. \\nNote the fourth car back, which contains Vice President Johnson\\'s Secret Service detail. The car doors are open as the agents rush to protect Johnson from the threat. Compare this with Kennedy\\'s Secret Service detail, who have not moved at all. Also note the man within Kennedy\\'s Secret Service car who is grinning ear to ear (tentatively identified as Dave Powers). It is interesting to note that in the book \"Mortal Error\" this photograph is deliberately cropped to hide the open doors of the car carrying V.P. Johnson\\'s Secret Service detail. \\nMost importantly, note the man standing in the ground level doorway of the Texas Schoolbook Depository (which is where he reportedly told the Dallas PD he was at the time). Mortal Error Version Of The Altgens Photo Click for full size (44K) picture. \\nThis is the Altgens photo as it appears in the book \"Mortal Error\". Note that the photo has been cropped to hide the fact that Vice President Johnson\\'s Secret Service detail has already opened their car doors while Kennedy\\'s Secret Service detail remains motionless. The Man In The Doorway \\nCompare these two images. The man in the doorway of the school book depository, and Oswald\\'s photo immediately after his arrest. \\n\\nThis is a photograph of Lee Harvey Oswald taken shortly after his arrest. Note the clear similarity in both appearance and dress to the man in the schoolbook depository doorway in the Altgen\\'s photo. \\nThe Warren Commission \"identified\" the individual as Billy Lovelady, a fellow Book Depository employee. But while Lovelady claimed the person in the Altgens\\' photo was himself, he also stated that he\\'d worn a red and white vertically striped shirt on the day of the assassination, which was confirmed by photos of Lovelady taken at the time of the assassination! \\nThe man in the doorway\\'s shirt in not striped and is open in front, exposing the tee shirt underneath. \\nIn color films taken from another angle, the color of the shirt worn by the man in the doorway was revealed to be orange-brown. When Oswald was arrested, he was wearing the identical shirt- an orange-brown tweed with missing buttons and tee-shirt underneath. \\nOther films taken on November 22, 1963 confirmed that Lovelady was in fact wearing a red and blue plaid shirt. \\nHence, the figure in the doorway is NOT Lovelady. \\n(Billy Lovelady died of a heart attack Jan 1979) \\nNEW! Higher resolution versions of the Altgens photo! \\nRaw image'"}, "time": 1742563977.8581033}