{"duration": 0.10445666313171387, "input_args": {"text": "'PHILADELPHIA  —   Forty times, city or state governments had proposed taxes on sugary soft drinks, failing each time. Then, in 2014, liberal Berkeley, Calif. passed such a tax, but most people saw it as an aberration. Several measures, including one in New York, never won much support. But on Thursday, a measure to tax sweetened drinks passed in Philadelphia, one of the country’s largest cities  —   and also one of its poorest. Indeed, raising revenue was the winning argument in Philadelphia. Jim Kenney, the mayor, took a different tack from that of politicians who have tried and failed to pass   taxes. He didn’t talk about the tax as a   measure designed to discourage   soft drinks. And he didn’t promise to earmark the proceeds for health programs. Instead, he cast the soft drink industry as a tantalizing revenue source that could be tapped to fund popular city programs, including universal prekindergarten. “This is the beginning of a process of changing the narrative of poverty in our city,” he said in a news conference after the vote. The advocates who have pushed for the policy say the victory is a sign of growing public acceptance of soft drink taxes and presages more such measures around the country. Though city officials didn’t talk much about the health consequences of soda, experts said that sugary drinks’ increasingly bad reputation made it an appropriate political target. “If we go five years ahead and look back, I think this is going to be a watershed moment,” said Jim Krieger, executive director at Healthy Food America, an organization that is helping cities around the country that are considering soda taxes. “This is going to really provide momentum. ” San Francisco Oakland, Calif. and Boulder, Colo. are considering soft drink taxes this year. Mr. Krieger said the list of interested cities included some that were as large and diverse as Philadelphia. Mr. Kenney said he hadn’t yet spoken directly with officials from other cities, but he had advice for them. “Tie your efforts to tangible initiatives that people care about,” he said in his news conference. “When it comes up, acknowledge that it is a good thing to drink less   beverages, but tie it to things that people care about. ” The Philadelphia tax of 1. 5 cents an ounce will apply to all sugary or artificially sweetened drinks sold by distributors in the city. It is expected to increase prices  —   the tax is about 30 cents for a   drink, or $2. 16 for a  . If passed on to consumers, the increase is expected to substantially reduce sales of sweetened drinks. The city finance department estimates it will raise $91 million a year. Sugary drinks have been linked to health problems, including obesity, diabetes and tooth decay, but the public health effects of the taxes are still unclear. Philadelphia is likely to become the site of public health research. Thomas Farley, the city’s health commissioner, said the city had already planned to measure the tax’s immediate effects on sales.   studies will measure any impact on obesity. The soft drink industry and its allies, including the Teamsters union and local grocers, spent nearly $5 million on lobbying and advertising to fight the tax in Philadelphia. They held rallies and demonstrations downtown and ran   ads on television and the radio, right up until Thursday’s final vote. They branded the drinks tax measure a “grocery tax,” suggesting that more food products were next. The soda industry has argued that Philadelphia’s politics are unusual and that the vote here can’t be seen as predictive. The American Beverage Association, a trade group, has vowed to fight the measure in the courts. “It’s still a bad idea,” said Lauren Kane, a spokeswoman for the group. “People still oppose it. Nothing has changed. ” Thursday, the industry and its allies vented frustration. Daniel Grace, the secretary and treasurer of the Teamsters local, said advocates had “snookered City Council,” and he described the tax as a “brazen cash grab from one industry. ” The promise of prekindergarten energized the city’s education advocates, who joined with public health advocates. The coalition spent about $2 million on advertisements, according to Kevin Feeley, a spokesman for Philadelphians for a Fair Future, a group supporting the tax. That total included $1. 6 million in donations from Michael R. Bloomberg, the former New York mayor, who has long supported soda taxes. But Mr. Kenney’s focus on revenue also allowed him to help cut deals with skeptical city councilors. Ultimately, the soft drink tax revenue won’t pay just for prekindergarten, but for a host of city programs, reflecting the priorities of the council members who voted for it.'"}, "time": 1742562272.4820101}