{"duration": 0.03156709671020508, "input_args": {"text": "'A new robot preacher allows users to receive automated blessings in different languages before it beams light from its hands. [“ ” is currently on display in Wittenberg, Germany, a town which has close ties to Protestant figure Martin Luther, and was created by the Evangelical Church in Hesse and Nassau, according to the Mirror.   “It consists of a metal box with a touch screen, two arms on the side, a head with eyes and a digital mouth at the top,” the Mirror explained. “After the robot wishes users a ‘warm welcome,’ it asks them if they want to be blessed by a male or female voice. It then asks the believer ‘what blessing do you want,’ which results in the robot making a mechanical sound as it raises its arms to the heavens and starts to smile. ” “Lights then start to flash in the robot’s arms as it says ‘God bless and protect you’ and recites a biblical verse,” the Mirror continued. “After the blessing, the user has the possibility to print the dictum,” similar to a fortune teller machine. The robot can communicate with users in five different languages, and the blessing can be printed out for them to take with them as well. Church spokesman Sebastian von Gehren claims that the new machine has attracted those who have very little in common with the church, but now routinely visit “every morning and evening” to receive an automated blessing. “It is an experiment that is supposed to inspire discussion,” he declared. “One half thinks it’s great  …     the other cannot imagine a blessing from a machine. ” Despite his praise of the robot, von Gehren added, “The machine should not replace the blessing of a pastor. ” “In the future, there will not be a blessing robot in every church,” he concluded. Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628303.405921}