{"duration": 0.05172562599182129, "input_args": {"text": "'Over the past week there has been an escalating feud between the executive and judicial branches of the U. S. government. When a Federal District Court judge in Seattle, James Robart, blocked President Trump’s travel ban, Trump went on the attack, calling Robart a “  judge,” the ruling “ridiculous” and the courts “so political. ” Even “a bad high school student would understand” why his ban should stay in place, the president said. Trump’s own nominee to the Supreme Court called the president’s comments “demoralizing” and “disheartening. ” When one story on the deepening drama ran on the home page, a reader noticed that its home page headline referred to the executive branch merely as the “U. S. ” The story’s digital headline read: “Justice Department Urges Appeals Court to Reinstate Trump’s Travel Ban,” while the home page version was: “U. S. Urges Court to Revive Ban Hearing Set for Tuesday. ” The public editor’s take: That’s a good catch. I’m sympathetic to headline writers, who are constricted by space limitations as they try to convey ideas clearly and accurately. And in most usage, referring to the executive branch U. S. is appropriate. In this case, it’s misleading. Trump also continued his onslaught of the news media, claiming that it plays down coverage of terrorist attacks. The White House even released a list of 78 attacks it claimed the media undercovered. Several readers wrote in to ask The Times to push back, which the paper did, publishing a compilation of the attacks that the paper has covered thoroughly. It did so, however, to the chagrin of some other readers. The public editor’s take: I am in full agreement. Playing defense is not the position The Times wants to find itself in  —   not over frivolous charges, anyway. If Trump or his administration challenges the thrust of a story based on anonymous sources, The Times has an obligation to explain itself to readers. Otherwise, taking such bait is just a distraction. Trump also targeted The Times specifically this week through his favorite medium, Twitter. This prompted several readers to ask whether The Times could take legal recourse against the president. The public editor’s take: I went out looking for answers from a pair of knowledgeable legal hands, and here’s what I found: The president has broad immunity from civil claims arising from the performance of his official duties. There is a convoluted legal argument over how broad. The matter of whether a judge would classify “tweeting” as an official duty remains untested. I’m guessing no lawsuit from The Times is coming anytime soon. Nor should there be one, in my view. That would be a waste of resources and would cast the news organization in opposition to the president. Its job is to cover him, fairly and aggressively. A line in a column about Kirsten Gillibrand and the   left raised the eyebrows of a couple readers for its perceived sexism. The public editor’s take: Hmmm. I’m alert to coverage with sexist overtones and I’ll be writing more in the future  —   so keep those letters coming. In this case, my antenna didn’t go off. I took Ginia Bellafante’s pudding reference as the wry commentary of a columnist  —   a category of journalist that enjoys more leeway. Several readers this week also took issue with The Times’s explanation for the rating of the film “Sophie and the Rising Sun”: “Rated R for interracial sexy time. ” We took this question to Stephanie Goodman, the film editor, for an explanation. The public editor’s take: A little levity in movie ratings? Seems like a little   fun to me. Finally, a lifelong reader of The Times passed away recently, and his granddaughter wrote in to tell us how much he appreciated the paper till his final day. Perhaps some reading indoors, in memory of Shanahan’s grandfather, would help those of us in the Northeast brave the snow. Updated 11:00 a. m. February 10, to include Trump’s latest attack on The Times, earlier Friday morning.'"}, "time": 1742563494.4823742}