{"duration": 0.1133565902709961, "input_args": {"text": "'Kenny Baker, the British actor best known for playing the robot   in six “Star Wars” films, died on Saturday at his home in northwest England. He was 81. His death was confirmed by a spokeswoman for Lucasfilm, the company that created and produces the enormously popular “Star Wars” franchise. The Associated Press reported that a nephew, Drew Myerscough, said he found Mr. Baker dead at his home in the town of Preston. Mr. Baker was a little person whose adult height was widely reported to be 3 feet 8 inches. He referred to his short stature as “my height difficulties” in an autobiographical sketch on his official website, but it would have been impossible for a taller man to play the role that made him famous. “They said, ‘You’ve got to do it we can’t find anybody else. You’re small enough to get into it and you’re strong enough to be able to move it,’” he said of  ’s cylindrical metal costume in a video interview in Stockholm that he shared on his site. “I was a godsend to them, really. ” Mr. Baker was born on Aug. 24, 1934, in Birmingham, England. He began his entertainment career in 1950 as part of a traveling troupe in Britain called Burton Lester’s Midgets. He soon left that act and toured the country for many years, performing in theaters, nightclubs and holiday resorts in a variety of roles: circus clown, performer in an   show and, later, part of a musical comedy and variety act alongside the performer Jack Purvis. (Mr. Purvis, who died in 1997, was also in “Star Wars,” as the cloaked Chief Jawa, who shoots and played roles in the second and third “Star Wars” films as well.) The traveling act brought Mr. Baker financial security and a measure of fame in Britain, but it was an entertainment ecosystem that was wiped out by the invention of television. Then came  . That role began with the first “Star Wars” movie, released in 1977  —   and now officially known as “Star Wars: Episode IV  —   A New Hope”  —   but it was a part he almost did not take. “This film came along and I turned it down,” Mr. Baker said in the Stockholm interview. “I said, ‘I don’t want to be stuck in a robot, what for, for goodness sake. ’” He ultimately relented and, he said, agreed to take the job as a favor to George Lucas. The role had no lines  —   the character’s signature beeps and boops were not voiced by Mr. Baker  —   and, seated inside the robot, he never showed his face. But   so changed his career that in later years he told an interviewer that if he could go back in time, he would do it again without pay. “Had I known I would have done it for nothing because he was broke at the beginning, he didn’t have a penny, George,” Mr. Baker said. But he might have asked for a share of the film’s profits, he added, referring to the celebrated British actor who played   Kenobi. “I’d be a millionaire like Alec Guinness was!” Mr. Lucas said in a statement on Saturday that Mr. Baker was “an incredible trooper who always worked hard under difficult circumstances. ” “A talented vaudevillian who could always make everybody laugh, Kenny was truly the heart and soul of   and will be missed by all his fans and everyone who knew him,” he added. Mr. Baker played   in six “Star Wars” films: the original, its two sequels, and the prequels released in 1999, 2002 and 2005. He also appeared in a number of other   movies, including “Mona Lisa,” “The Hunchback of Notre Dame,” “Time Bandits” and “Amadeus. ” No information about his survivors was immediately available. His niece Abigail Shield first reported his death to the British newspaper The Guardian.'"}, "time": 1742563516.7346833}