{"duration": 0.06871557235717773, "input_args": {"text": "'Samantha Bee: Who Gives A F**K About Trump, The ‘Dauphin Of Breitbartistan’ (VIDEO) By Carrie MacDonald   \\nWarning: This article contains direct quotes from Samantha Bee that may be unsuitable for children. \\nComedian and host of Comedy Central’s Full Frontal Samantha Bee never disappoints. Her most recent broadcast was one of her best. I mean, come on — how often do you get to hear the word “dauphin” on late night television? Bee: Trump Is The ‘Dauphin Of Breitbartistan’ \\nSamantha Bee, decked out in a “Nasty Woman” shirt, wasted no time getting the jabs in at Republican presidential nominee Donald Trump on her Monday night show. In her opening segment, she likened Trump to the cartoon Wile E. Coyote, ever-thwarted by the Road Runner, saying : “Oh, Donald. It’s like you spotted Hillary painting a tunnel entrance onto a mountain, called her on it, and then ran at it anyway.” \\nBee pivoted to Trump’s controversial statement from the last debate, in which he said he may not accept the election results. Bee’s response to that? “In case you haven’t noticed, you’re not the president. You’re just the Dauphin of Breitbartistan. Concede, don’t concede, we don’t give a fuck. We’ll be busy swearing in the 45th president.” \\nBoom. \\nBee was, of course, referring to the Breitbart News website – an online haven for neo-Nazis run by Trump’s campaign CEO, Stephen Bannon . She Didn’t Stop With Trump \\nSamantha Bee’s comic hammer came down on all Republicans, as it so often does. She ripped into them having the nerve to call out Trump’s statement as horrifying after eight years of unprecedented obstructionism. \\nHonestly, I don’t think my words can do Samantha Bee justice. Just watch her opening segment below and remember how lucky we are to have her voice. \\nWarning: This video contains graphic language that may not be suitable for all audiences. \\nFeatured Image via screenshot from YouTube video \\nNote: The character of Pepe the Frog was created in 2005 by Matt Furie and has been co-opted by the alt-right. Furie believes this is just a phase that will die out soon, returning Pepe to his “sly, lovable, and charming status.” About Carrie MacDonald \\nCarrie is a progressive mom and wife living in the upper Midwest. Connect'"}, "time": 1742563129.0881703}