{"duration": 0.031389713287353516, "input_args": {"text": "'Despite two separate ISIS bombing attacks on Christian churches in Egypt Sunday, the Vatican has confirmed that Pope Francis is moving forward with his plan to visit Cairo just three weeks from now. [On Monday, Archbishop Angelo Becciu, the number two of the Vatican Secretariat of State, confirmed that the Pope would still be traveling as planned to Egypt April   just as Egypt’s Cabinet announced a   state of emergency.  “There is no doubt that the Holy Father will stick to his plan,” Becciu told the Italian daily, Corriere della Sera. “What happened causes distress and great suffering, but it cannot prevent the Pope from carrying out his mission of peace. ” On Sunday morning, jihadists set off two separate explosions in the Christian churches of Mar Girgis (Saint George) in Tanta, and Saint Mark’s Church in Alexandria, killing at least 45 people and injuring scores more. The Islamic State terror group immediately claimed responsibility for the attacks in a statement from the organization’s Amaq news agency. “Islamic State squads carried out the attacks on two churches in Tanta and Alexandria,” the statement declared. The Pope was informed of the attacks during the celebration of Palm Sunday Mass in the Vatican, Becciu said, after which the pontiff publicly denounced the bombings in his weekly Angelus address at noon. Speaking before tens of thousands in Saint Peter’s Square, Francis prayed that the Lord “convert the hearts of the people who are sowing terror, violence and death, and also the hearts of those who make and traffic weapons. ” In his interview, Archbishop Becciu said that ever since the Islamic State appeared on the scene, the Pope “wanted to distinguish between terrorist acts carried out by zealous fanatics and the religion itself. ” “He has always refused to associate Islam with terrorism,” Becciu said. “Certain deviant Islamists might be terrorists, but not the religion. And this has earned him the gratitude of the Muslims, for the honesty of his positions. Many Islamic authorities have met with the pontiff to thank him and many others have written to him with admiration for his moral authority. ” Last summer, Islamic State representatives expressed deep offense at Pope Francis’ claims that their war was not being waged for religious motives, hastening to assure the pontiff that their sole motivation is religious and sanctioned by Allah in the Qur’an. ISIS censured the Pope for his naïveté in clinging to the conviction that Muslims want peace and that acts of Islamic terror are economically, rather than religiously, motivated. “This is a   war between the Muslim nation and the nations of disbelief,” the authors state in an article titled “By the Sword” found in their propaganda magazine, Dabiq. The article attacked Francis for claiming that “authentic Islam and the proper reading of the Qur’an are opposed to every form of violence,” saying that by doing this, “Francis continues to hide behind a deceptive veil of ‘good will,’ covering his actual intentions of pacifying the Muslim nation. ” Pope Francis “has struggled against reality” in his efforts to portray Islam as a religion of peace, the article insisted, before going on to urge all Muslims to take up the sword of jihad, the “greatest obligation” of a true Muslim. During his upcoming visit, Francis will meet the grand imam of Al Azhar University, Ahmed   the highest authority of Sunni Islam, as well as Egyptian government officials and prelates of the Coptic Church. Follow Thomas D. Williams on Twitter Follow @tdwilliamsrome'"}, "time": 1742628521.8634589}