{"duration": 0.08512306213378906, "input_args": {"text": "'\\n \\n\\nThursday, November 03, 2016 \\nMike Adams The Health Ranger\\n \\nNaturalNews) Natural News can now reveal that dozens of democrat operatives will be facing criminal indictment from damning email evidence that has been in the possession of the FBI for more than a year. The bad news is that such indictments may take months to formally announce, with criminal proceedings requiring years to reach a conclusion. The good news is that Hillary Clinton isn’t going to get away with her criminal racketeering for much longer, as the U.S. intelligence community is now determined to make sure she faces justice regardless of the outcome of next Tuesday’s election.\\nHere’s the evidence that supports these assertions:\\nFirst, FBI sources have told Fox News’ Bret Baier that an indictment is “likely.” From Real Clear Politics :\\nSources within the FBI have told him that an indictment is “likely” in the case of pay-for-play at the Clinton Foundation, “barring some obstruction in some way” from the Justice Department. No doubt Loretta Lynch is determined to engage in that obstruction in one form or another, which is probably why Lynch herself may be among those who are eventually indicted for criminal conspiracy .\\nSecond, this Oct. 28 announcement from Dr. Larry Kawa, working in partnership with Judicial Watch , reveals an astonishing discovery: That all of Hillary Clinton’s emails were backed up to a “Datto device” long before she started deleting emails (i.e. destroying evidence).\\nFrom the announcement:\\nCitizen Activist Dr. Larry Kawa of Boca Raton, Florida today announced that he has expanded the scope of his efforts to bring former Secretary of State Hillary Clinton’s hidden electronic communications to light. He is now calling for full disclosure of a hard drive that was turned over by Datto Inc. to the FBI as of 2015. According to CNN, the contents of the Datto hard drive are believed to contain all of Hillary Clinton’s backed up electronic communications from her time as Secretary of State. \\nThe “Datto device” backups are now in the hands of the FBI It turns out that Datto, Inc. is a data backup company which had real-time access to Hillary Clinton’s private email server for the purpose of backing up her emails. That backup data set was turned over to the FBI in 2015, but the FBI likely did not realize what they were holding at the time.\\nIt wasn’t until the Clinton Foundation email scandal began to unfold that FBI agents realized what they possessed. Now, it turns out the FBI has been sorting through those emails (and other evidence) for more than a year.\\nIn addition — and this is a real shocker for those who have been following this — the FBI did not destroy the laptops from Clinton’s co-conspirators. \\nVia Real Clear Politics:\\nThe Clinton Foundation investigation is far more expansive than anybody has reported so far and has been going on for more than a year. The laptops of Clinton aides Cherryl Mills and Heather Samuelson have not been destroyed, and agents are currently combing through them. \\nNow the FBI has at least FOUR sources of damning emails with overwhelming criminal evidence of Hillary Clinton’s racketeering enterprise What all this means now is that the FBI has four sources of emails that Hillary Clinton and her close associates attempted to destroy:\\nSource #1) Anthony Weiner’s laptop , which somehow seems to have held 650,000 of Huma Abedin’s emails, if reports are true, in addition to whatever child sexting pervert pics Weiner himself had collected (yeah, he’s a democrat).\\nSource #2) The non-destroyed laptops of Cherryl Mills and Heather Samuelson , which the media incorrectly reported had been destroyed as part of the FBI’s investigation “conclusion” earlier this year.\\nSource #3) The Datto, Inc. backup device which has already been turned over the FBI and likely contains all of Hillary Clinton’s emails that she attempted to destroy (via Bleach Bit).\\nSource #4) Wikileaks dumps of John Podesta emails which keep getting posted in large batches like clockwork, day after day, revealing astonishing layers of corruption and collusion among dozens of key players conspiring with the Clintons.\\nFrom these four sources of emails, an undeniable pattern of criminal racketeering emerges All this evidence isn’t just going to incriminate Hillary Clinton, by the way: This vast conspiracy of criminal collusion, corruption, pay-to-pay bribery and racketeering will ensnare dozens — if not hundreds — of DNC operatives and Clinton Foundation cohorts. (Can we please release some non-violent drug offenders from the prisons to make room for the Clinton brigade?)\\nIn case you didn’t already realize this, we’re now watching the uncovering of a massive criminal conspiracy involving hundreds of willing participants, spanning the DNC, the Dept. of Justice, the White House, the Clinton Foundation and of course the State Department. When it’s all said and done, this will be the largest criminal conspiracy ever uncovered in the history of the United States of America . And it was all masterminded by a woman who claims that her vagina gives her some sort of special privilege to ascend to power in America.\\nThe only downside to all this is that it might take years to fully prosecute the criminal cases against these Clinton criminals, and no doubt many of those who are guilty of committing these crimes will go free in exchange for testifying against their racketeering bosses. But the Clinton house of cards is now destined to fall, eventually ending one of the most shocking and dark chapters of American history and government corruption.\\nHillary Clinton’s private email server was hacked by FIVE foreign intelligence agencies, says FBI source Beyond everything mentioned above, Hillary Clinton’s illegal private email server has long since been compromised by multiple foreign intelligence agencies, allowing any of them to easily BLACKMAIL Clinton if she were to become President .\\nVia Real Clear Politics :\\nFBI sources say with 99% accuracy that Hillary Clinton’s server has been hacked by at least five foreign intelligence agencies, and that information had been taken from it. \\nThis means that from the very first moment Hillary Clinton might seize power in Washington D.C., she would be at the mercy of Chinese, Russian, North Korean or possibly even Iranian political leaders who would issue blackmail threats against her unless she granted them requested political favors.\\nNotably, the entire leftist media is communicating absolutely none of this to its readers and viewers, counting on the true fact that most Clinton supporters are too stupid or too self-deluded to understand the high stakes game of international geopolitics. As a result, people who continue to say they support Hillary Clinton are, astonishingly, helping elect a criminal kingpin into the highest office the land… even as she has already been deeply compromised by foreign enemies that seek the outright destruction of the United States.\\nThis is likely why the U.S. intelligence services — part of the “deep state” apparatus — has now turned against Hillary Clinton and has made a decision to take her down . What every informed person now realizes — both in government and outside it — is that Hillary Clinton poses a clear and present danger to the national security of the United States of America , and that allowing her to seize power in Washington would spell outright doom for the nation and its people.\\nWhy the Huffington Post is also a danger to America Remember this as you browse the internet: Every website that’s trying to get Clinton elected, including the Huffington Post, is working to place a seditious racketeering criminal into the highest office of the land. Such malicious acts are, in their own right, serious crimes against America, yet they characterize the entire delusional left-wing media and blogosphere, widely populated by academics who are so ignorant about the real world that they are incapable of recognizing the rise of a fascist, totalitarian regime even as it emerges in front of their very eyes.\\nUniversities no longer teach students anything about the real world, you see, so a person can emerge from a top-tier university with a PhD while being so ignorant and deluded about reality that they would gladly vote for another Adolf Hitler if he dressed up in rainbow colors, chanted “love wins” and claimed to be transgender. (Bonus question: Could a biological man with a penis claim to self-identify as a woman and run for office under the premise of being the first “woman” president? Cognitively obedient liberals — who are all completely insane morons — would no doubt vote for the “woman,” achieving the incredible distinction of placing the first female into the White House who also had a scrotum and could pee standing up. Liberal historians take note… this is somehow called “equality…”)\\nEvery website rooting for Hillary Clinton is blindly pursuing the total damnation of America , all under the guise of “social justice” or the silly pursuit of the “first female President” as if possessing a vagina is some sort of magical qualification for political superiority.\\nImagine their mutual surprise when they soon discover that a vagina-possessing liberal politician turned out to be the most corrupt, dishonest and dangerous presidential candidate in history… a woman who created a massive criminal cartel and collected hundreds of millions of dollars in illegal profits while selling government influence to the highest international bidders. No penis required. So much for the glass ceiling theory, eh?\\nIn summary, Hillary Clinton is a woman who once held the world by the balls… but then had to let go when the stank of her own putrid crimes was too much to stomach any longer. In the end, she will be remembered as nothing more than a crotchety old hag with a reptilian appetite for power and a sickening disregard for humankind. Prepare your in-flight vomit bags, folks, because this final approach to election day is going to involve nauseating turbulence and more than a few stomach-churning freefalls.\\nTo Learn more: \\n'"}, "time": 1742628447.2317815}