{"duration": 0.32767295837402344, "input_args": {"text": "\"Club Soda for Stomach Pain and Constipation VN:F [1.9.22_1171] Close Transcript Transcript: Club Soda for Stomach Pain and Constipation \\nBelow is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video. \\n“Natural bubbling or sparkling mineral waters have been popular for thousands of years.” Manufactured sparkling water has been around ever since a clergyman “suspended water over a vat of fermenting beer.”“For centuries, carbonated water has been considered capable of relieving gastrointestinal symptoms,” including tummy aches, but we didn’t have good data until this study was published. \\n“Twenty-one folks with dyspepsia [an upset stomach] and constipation were randomized into two groups in a double-blind fashion” to drink one-and-a-half quarts of carbonated water versus tap water, every day for two weeks. Dyspepsia was defined as “pain or discomfort located in the upper abdomen,” including “bloating and nausea.” \\nAnd, carbonated water improved dyspepsia, compared to still water (tap water), and improved constipation. “Drink more water” is a common recommendation for constipation, but they didn’t observe a clear benefit of the added tap water. Seems you need to increase fiber and water, rather than just water alone. But, sparkling water seemed to help. Now they were using sparkling mineral water. And so, whether these effects are due to the bubbles or minerals, we can’t tell from this study. \\nThere’s been a concern that carbonated beverages may increase heartburn, GERD (acid reflux disease). But that was based on studies like this, that compared water to Pepsi. Soda can put the Pepsi in dyspepsia, and contribute to heartburn. But, so may tea and coffee, in people that suffer from heartburn. That may be partly from the cream and sugar, though, since milk is a common contributor to heartburn, as well. Carbonated water alone, though, shouldn’t be a problem. \\nSimilarly, while flavored sparkling drinks can erode our enamel, it’s not the carbonation, but the added juices and acids. Sparkling water alone appears a hundred times less erosive than citrus or soda. So, a sparkling mineral water may successfully treat stomachache and constipation without adverse effects—unless you’re a teenage boy opening a bottle of sparkling wine with your teeth, especially on a hot day after you shake it up, placing one at risk for a “pneumatic rupture of the esophagus.” Please consider volunteering to help out on the site. Close Sources Video Sources water Doctor's Note \\nWhoa, what was that?! My little cameo was me playing around with a green screen. I’m trying to find ways for the videos to be more engaging than just showing study after study, but there may be a fine line between engaging and dorky :-). The goal is to widen the appeal to reach more people, without distracting from the scientific rigor. What do you think? Should I do more little bits like this with me on screen, or do you think that detracts from the professionalism? Please let me know in the comments section below. \\nFor more on combating acid reflux, see Diet and GERD Acid Reflux Heartburn and Diet and Hiatal Hernia . \\nOther videos on healthy beverages include: How Many Glasses of Water Should We Drink a Day? \\nIf you haven’t yet, you can subscribe to my videos for free by clicking here . To post comments or questions into our discussion board, first log into Disqus with your NutritionFacts.org account or with one of the accepted social media logins. Click on Login to choose a login method. Click here for help. Comment Etiquette stephaniehope \\nAre the “rock” minerals in these mineral waters absorbable by humans? It is my understanding that the minerals in water are, basically, little pieces of rock, and our body can not utilize them. Maybe they even cause harm? A lot of debate on this one, but proponents of water low in TDS (total dissolved solids) often claim that the minerals in food are of absorbable nature, yet with the mineral it water it is just picking up pieces of rock and residue from the streams, lakes, etc. Makes me wonder about possible bogus benefits of consuming minerals through pure sea salts. Wegan \\nApparently they are absorbed.“On its website, the National Osteoporosis Foundation (NOF) states that there is no connection between the carbonation in soft drinks and bone loss and that certain carbonated mineral waters (the ones rich in calcium and those that are more alkaline) have actually been shown to improve bone health.”Feb 18, 2013 stephaniehope \\nIt would be weird because we are an heterotroph specy like animals… Lisa \\nI like to see your face, and I think it personalises the whole thing. I like any info – articles are good, too, and they give you time to digest the content. (No pun intended.) Yes, changing things up from time to time is good, as long as the content is easy to understand and the links are visible – or placed under the video. And thank you a thousand times for your service to people. Julie \\nI’d like to see him at the end–maybe sending us off with a witty joke. Ellie Lee-wasson \\nI have been consuming at least a tablespoon of flax a day and following Dr. Gregor’s daily dozen recommendations, yet am still constipated and am having difficulty losing weight, which is a secondary goal of mine. Can anyone offer additional suggestions? EquaYona \\nSo you are on a plant based diet and constipated? How long have you been plant based? Do you still consume dairy? Ellie Lee-wasson \\nI have been vegan for 4 years, have been eating whole food plant based for about 3 months, previously consuming larger amounts of processed vegan foods. I only “go” at most every couple days. EquaYona \\nCan you increase your water consumption? Exercise is also an important factor for regularity. Are you following the exercise recommendations in the daily dozen? If you are getting plenty of fluids and exercise, you might try adding a little more fat(nuts, avocado) and try a bran cereal for breakfast or snack. It is startling that you have such a problem on a vegan, whole food diet. I generally have two BMs a day. Ellie Lee-wasson \\nI try to drink about 64 ounces of water or tea a day, but, I also work in aviation. I walk about 10000 steps a day, and try to get additional cardiovascular as my job allows. But, yes, I agree it is startling, unfortunately, my current situation is a vast improvement from when I was not eating vegan. susan \\nhi Ellie, I can’t add much to the excellent suggestions of EquaYona, other than to mention two things that helped me. I use 1 tbsp ground flax in my oatmeal in the mornings, but, if having issues, 1 tbsp in 1/4 cup water last thing at night before bed works wonders. The other thing is to avoid gluten free bread products if you use them at all.. I find one slice of this ‘bread’ at lunch with salad very effective. Best of luck \\nhttp://www.mannaorganicbakery.com/item/organic-sprouted-bread-banana-walnut-hemp.html maggie \\nHi Ellie, I can suggest brown rice, beans and steamed broccoli or kale. These are hi fiber foods, sweet potatoes especially the Japanese purple potato are great has well. Bean soups are great as well. I suspect you are not getting hi fiber foods during the day. I’m pretty regular with 2 BM a day Cheryl esben andersen \\nI would disagree with you . I do not think it is a lack of fiber since the person is already on a whole foods diet . It is a lack of peristalsis of the digestive tract , the contraction and relaxation of the digestive tract which moves the food or more correctly the waste products along . 2 or 3 glasses of water at body temperature first thing in the morning has helped a lot of people according to our naturepathic doctor we go too. For still sluggish movement sauerkraut juice or sauerkraut has helped the most stubborn cases . Darla Eaves \\nBlack coffee esben andersen \\nTook me a while to go from creamer in my coffee to black , oh yeah a lot of people I know swear by their coffee. Ellie Lee-wasson \\nI only drink black coffee :) susan \\nyes esben I agree with the peristalsis idea.. I was given buscopan for gall bladder pain, nausea etc, but then later with continuing issues I was given Domperidone to speed up the digestive process. I then felt a lot better. The coffee is definitly necessary though. I will give the sauerkraut a try too. thank you! Jean \\nI have a sluggish digestive tract caused in part by injuries to nerves and muscles; also migraine can slow down and sometimes even stop gut activity. When it doesn’t want to work properly nothing makes a difference. WFPB has made it less of a problem but there still are spells. Rebecca Cody \\nYour problem is much more extreme than mine, but this works for me: I put 1 tablespoon of chia seeds in about a cup of water every morning, stir and then leave it sitting on the counter for about 10 minutes. Then, not before, add a rounded teaspoon of magnesium citrate powder. I use one called Natural Calm, which is available in health food stores. Stir it up well, add a bit of stevia if you wish, and drink it down. I used to do the same thing an hour or so after dinner at night, but it was definitely overkill, so I dropped the evening dose. Andrea Reiman \\nConsider having your thyroid tested. Also, try Whole Husk Psyllium: http://www.healthline.com/health/psyllium-health-benefits#Overview1 Foroogh – NF Moderator \\nHi, Ellie Lee-Wesson, I noticed there are lots of helpful advice regarding your issue with constipation even though you are on PBWF. You mentioned you are in aviation, does your job entails traveling on plane and being on high altitude? Because that could be the issue since going on high altitute causes dehydration a lot. Hydrating 20 minutes before meal and one hour after meal.The suggestions of chia seeds, flax seed, psyllum and magnisum and dissolving in warm water are very good. Also pineapple juice, prune juice also 1 table spoon good extra virgin olive oil and coffee tend to help with the bowel movement. Also having fruit one hour before meal or two hours after meal can be helpful. Ellie Lee-wasson \\nYes, I am on planes 12-14 hours a day most days. I do drink a lot of water, both still and sparkling (as mentioned in the video). I do also drink a lot of black coffee. Do you have any suggestions for fruit that packs well for travel that I could bring with me on the plane? Or other good fibre rich foods that I could pack and can be eaten raw or in a microwave? Foroogh – NF Moderator \\nI would suggest dried organic figs and prunes and raisins in a little bag. Also what I usually do when I travel make my own bag of raw whole nut mixtures. I would also try organic herbal tea cleanse before flights and after your flights to cleanse your colon. I hope these suggestion are useful and wish you safe flights. esben andersen \\nWhy would you think its startling. Everybody I know who has tried whole foods diet has had problems with constipation . I now have known 4 people who went whole foods. 2 tablespoons whole flax in a cup of water in the morning, plus 2 cups warm water , will normally get some movement .Also half a cup sauerkraut twice a day has solved the problem for people even ones that have had a life long problem with constipation. EquaYona \\nIt is startling because whole PLANT foods(I assume that is what you meant) usually means a great increase in both fiber and fluids. Although I have rarely ever had constipation in my life, my vegan diet has increased my bowel movements to 2-3 times a day. I have never heard of anyone on a plant based diet having persistent problems with constipation. Until now. ;) Blair Rollin \\nI agree. I can hardly believe it would be possible. Jack Hall \\nInsufficient fat on my very low-fat whole foods plant based diet nearly killed my guts. Also, I did not adjust my fluid intake to accomodate for all of the additional fibre I began consuming, which added to the problem. I was hurting so bad that I couldn’t sit without severe pain and I looked as if I had swallowed a beach-ball for days at a time regardless of how many veggies or fibrous foods I ate. \\nAnyway, I hope it was the fat. My only overt fat was coming from oats and two tablespoons of flax a day. I was coming in at under 30grams fat per day. Now I have added about 1 ounce of nuts which seems to have helped. EquaYona \\nGlad to hear you are feeling better. I have always consumed a lot of fluids and peanut butter and whole peanuts have been important in my diet since I was in my teens. Lucky preferences, I reckon. Darla Eaves \\nAh yes. Sauerkraut! lisa c \\nMagnesium is magic. And calming. I’ve taken it in tablet and powder form, adjusting dose as needed. Rex Ashbaugh \\nEllie, I would suggest getting more ‘resistant starch’ foods in your diet. To feed the microbiome. The bulk of the stool is mostly composed of bacteria. That bacteria needs to be fed. \\nhttp://nutritionfacts.org/video/gut-dysbiosis-starving-microbial-self/ v \\nAre you being consistent in your efforts to follow Dr. Gregor’s Daily Dozen? I ask because he recommends 1.5 cups of beans per day, plus a serving of cruciferous vegetables (kale or broccoli or cabbage), plus a cup of cooked greens (more kale, or collards, romaine, etc.). Add to that some fruit and a serving of berries, plus more vegetables. When I manage to eat that way (I try to do it every day, but fall short of complying 100% most days) it makes a big difference. It’s a ton of fresh food, water, and fiber. Ellie Lee-wasson \\nI try, but, as I previously mentioned, I work in aviation so hitting all of the checkmarks in the app is difficult, but I consistently hit 20 of the 24 v \\nI find whole wheat pasta + cannellini beans + greens (broccoli raab or swiss chard or kale) in a garlicky vegetable broth to work very well in this department. \\nI think it’s because it has the fiber + liquid all together. Maybe give it a try? It’s delicious. Hope this helps! Ellie Lee-wasson \\nHow do you prepare the broth? bradf \\nI work in aviation as well, I travel with a thermal bag and several days of vegan food, rice/quinoa based grain salads travel well, you can call hotels ahead and check for a fridge, use happy cow to find vegan food on layovers. I use freezer packs, but this bag lets you throw in loose ice and doesn’t leak Ellie Lee-wasson \\nDo you work for a mainline or a regional? I also bring my food, but, don’t often have time to eat until the evening. During the day, I try to eat fruit, beans and greens etc. At night. bradf \\nmainline, typical flight is 2 hours or more so there is time to eat enroute. If you’re at a regional I could see that eating during your workday could be a problem. Ellie Lee-wasson \\nYeah, I work for a regional Gatherer \\nThis comment has little scientific evidence behind it. It is just a suggestion. \\nWith your current diet you probably eat at least the minimum recommended amount of fiber, but even that is about a third of our ancestral fiber consumption. Thus additional fiber in your diet isn’t going to hurt you. Further, if you drink some fiber before eating food you should feel full earlier during your meal. \\nAccordingly, I suggest that before lunch and dinner you disperse a tablespoon (15 ml) of psyllium husks into 10 oz (300 ml) of water and drink it. The fiber should help with the constipation by providing bulk, and may slightly reduce the amount of food you eat which will, over time, help with weight loss. \\nFor weight loss without counting calories or feeling hungry, try the Dr McDougall maximum weight loss advice. https://www.drmcdougall.com/misc/2005nl/050100pupushing.htm Panchito \\nNot everybody has the same body. There could be non dietary factors to constipation like genetic (asymmetry and development) or nervous (enteric nervous system) Jenny Barnes \\nHi Ellie, have you looked at your stress levels? A few years back I was only ‘going’ once a week, despite plenty of veggies, water and exercise. My doctor recommended looking at the stress in my life, and making sure I took time out to relax made a huge difference. Jenny Barnes \\nAlso, if you’re struggling to lose weight that can be due to stress – high cortisol levels make your body hold onto fat. I believe the idea is that historically if we were in a high stress situation this would make sense because this would often be accompanied by famine. EquaYona \\nI like the little Dr Greger, it was a cute way to interject your joke. Foroogh – NF Moderator \\nYes, I like the section that he appeared in the video! I like his sense of humor. OrToltecTal \\nThe little mini me popping up was hilarious and refreshing. I loved it! Robin Lewis Kane \\ndefinitely detracts and distracted me from what you were saying Rachel \\nYes, it distracted me, too. I prefer the straightforward, scientific Dr. Greger, with the occasional dry joke. Ishay \\nI’m afraid I’ll have to agree. If I were a new visitor on this website, I’d probably think the information presented can’t be very serious. \\nLuckily I know otherwise! Susan Guthrie \\nThese videos have changed my life! You do a great job keeping the data moving around so that it is easy to engage and stay focused. And your voice is unique with nice modulation and expression. Kourtnie \\nI enjoyed seeing your smiling face, the only thing I didn’t like was it looked like you were walking. You looked to be bouncing around a lot vs standing still and speaking. Not bad for a first attempt. Plantstrongdoc M.D.\""}, "time": 1742564586.307528}