{"duration": 0.031920433044433594, "input_args": {"text": "'Grammy   rapper Eminem called President Donald Trump a “bitch” and fantasied about sexually assaulting bestselling conservative author Ann Coulter in a song featured on fellow Detroit rapper Big Sean’s new studio album “I Decided. ”[“I’m anti, can’t no government handle a commando. Your man don’t want it, Trump’s A BITCH. I’ll make his whole brand go under,” Eminem says of Trump on the song “No Favors. ”  The      also raps about sexually assaulting conservative author and pundit Ann Coulter. “And fuck Ann Coulter with a Klan poster. With a lamp post, door handle, shutter. A damn bolt cutter, a sandal, a can opener, a candle, rubber. Piano, a flannel, sucker, some hand soap, butter. A banjo and manhole cover,” Eminem raps. This not the first time that Eminem has used sexually explicit language to attack a conservative woman. In 2009, Eminem’s   lyrics on the song “We Made You” saw the rapper imaging having sex with former Alaska Governor Sarah Palin. “And I’ll invite Sarah Palin out to dinner then. Nail her, baby, say hello to my little friend!” Eminem raps. In the song’s music video, Eminem cast a Palin    for a raunchy sequence in which the scantily clad woman is splayed out on an office desk wearing a skirt and bustier, and Eminem is seen rapping the aforementioned lyrics and dressed as Palin’s husband, Todd Palin. Eminem also praises Black Lives Matter on the new song. “Go ham donut or go Rambo, gotta make an example of her. That’s for Sandra Bland, ho, and Philando,” he raps, referencing two     deaths of black people. Rapper Big Sean took to social media earlier this week to give thanks to Eminem for being apart of his album, which was released on Friday. . @eminem No Favors feels like back to back homeruns, you fuckin destroyed this verse! Thank you for blessing the album   this! #Detroit pic. twitter.   —   Sean Don (@BigSean) February 3, 2017,  Big Sean recently appeared on New York radio station Hot 97 and fantasized about killing Donald Trump. “I know Jay proud of me, he put this ’round my neck. And I might just kill ISIS with the same icepick. That I murder Donald Trump in the same night with,” Big Sean rapped during a freestyle performance. Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563901.0418062}