{"duration": 0.12062644958496094, "input_args": {"text": "'Trump World’s Darkest Side November 8, 2016 \\nDonald Trump’s campaign has exposed and spoken to the real pain and profound alienation of many Americans, but the candidate also has exploited those emotions with lies and appeals to prejudice, says Michael Winship. \\nBy Michael Winship \\nWhen I grow up, I want to be Charlie Pierce , who covers politics for Esquire magazine and has toiled in our scrivener’s trade, as far as I can tell, since the late 1970s. \\nI know, technically, he’s a couple of years younger than I am, but he writes with the fierce wit and well-aimed anger to which I aspire, and as this wheezing milk train of a presidential campaign clanks into the final station, few have been as perceptive when it comes to trying to figure out just what the hell has happened to America this year. Donald Trump at the 2016 Republican National Convention. (Photo credit: Grant Miller/RNC) \\nCharlie Pierce has done so with great style throughout, but now, thanks to Donald Trump and just hours before Election Day, he has come to the end of his watchdog rope. He wrote on Saturday that Trump — to whom he refers as El Caudillo del Mar-A-Lago — had “managed to exceed even my admittedly expansive limits for political obscenity.” \\nPierce was talking about Trump’s reaction after President Obama responded to an elderly heckler wearing a military tunic at a Friday campaign rally in Fayetteville, North Carolina. \\nAs the crowd booed the man, Obama said, “Hey! Listen up! I told you to be focused, and you’re not focused right now. Listen to what I’m saying. Hold up. Hold up! … Everybody sit down, and be quiet for a second… First of all, we live in a country that respects free speech. Second of all, it looks like maybe he might’ve served in our military and we got to respect that. Third of all, he was elderly and we got to respect our elders. And fourth of all, don’t boo, vote.” \\nIn other words, the President showed poise, grace and yes, class. But shortly after, here’s how the moment was seen through Trump’s eyes at a rally in Hershey, Pennsylvania: “There was a protester and a protester that likes us,” Trump said. “And what happened is they wouldn’t put the cameras on him. They kept the cameras on Obama. … He was talking to a protester, screaming at him, really screaming at him. By the way, if I spoke the way Obama spoke to that protester, they would say he became unhinged.” \\nUnhinged? Really? We all know that Trump seems to get his news from an implanted electrode picking up propaganda signals from the Planet Mongo. But there comes a point when the lies piled upon lies become too much for even the fairest and most equable of us. Hearing Trump’s demonstrably false description of what happened at Obama’s rally, Charlie Pierce finally had it. \\n“Maybe it was because it was so ludicrously provable a lie,” he wrote. “[Trump] didn’t care. He never has cared. His contempt for the democratic processes and for the norms of self-government is matched only by the deep contempt he has for all the suckers who mistake his contempt for the American experiment for their deep disappointment in it. He has measured their intelligence by his heavily leveraged net worth and found them hilariously lacking. \\n“We are all the subcontractors who build his indomitable ego for him and, as such, he can stiff us according to his customary business plan. His campaign long ago became a sickening charade performed by a grotesque charlatan.” \\nThe Scene in Reno \\nAnd so it is. Look, too, at how Trump and his followers at a rally in Reno, Nevada, on Saturday responded to a man with a “Republicans against Trump” sign. Before someone shouted “Gun!” and the moment turned even uglier, Trump had looked down and said, “Oh we have one of those guys from the Hillary Clinton campaign. How much are you being paid, $1,500?” As the crowd booed, Trump said, “Okay. Take him out.” The run-down PIX Theatre sign reads “Vote Trump” on Main Street in Sleepy Eye, Minnesota. July 15, 2016. (Photo by Tony Webster Flickr) \\nThe protester, a Reno resident named Austyn Crites, described himself as Republican and a fiscal conservative. He told The Guardian he was grateful to the police who removed him from the auditorium for interrogation — they kept him from being further kicked, choked and pummeled by the gang of Trump supporters who surrounded him. \\nStill, he said, “The people who attacked me — I’m not blaming them. I’m blaming Donald Trump’s hate rhetoric, … The fact that I got beat up today, that’s just showing what he’s doing to his crowds.” \\nThroughout the campaign, whenever Trump has egged on his followers, I’ve thought of that line in Young Frankenstein, when the angry Transylvanian villagers are told by the local police inspector, “A riot is an ugly thing, and I think that it is just about time we had one.” \\nRemember what Trump said when a protester was dragged out of a February rally in Las Vegas: “I love the old days — you know what they used to do to guys like that when they were in a place like this? They’d be carried out on a stretcher, folks. … I’d like to punch him in the face.” \\nBy now, you’ve heard it all before and the litany of lies, outrageous claims and insults has climbed so high that many of us have become numb and weary from the sheer repetition of Trump’s buffoonery. You can only go to so many demolition derbies before the sight of flaming car wrecks becomes routine. \\nDog Whistles \\nWhat’s more, you can argue that far more insidious and frightening are the dog whistle attacks appealing to the baser instincts of the bigoted and ignorant. The latest: the closing ad from the Trump campaign that, with anti-Semitic overtones, points fingers at “a global power structure that is responsible for the economic decisions that have robbed our working class.” Former   speaking with supporters at a campaign rally in Phoenix, Arizona. March 21, 2016. (Photo by Gage Skidmore) \\nAs Josh Marshall notes at Talking Points Memo , “The four readily identifiable American bad guys in the ad are Hillary Clinton, George Soros (Jewish financier), Janet Yellen (Jewish Fed Chair) and Lloyd Blankfein (Jewish Goldman Sachs CEO)… This is an ad intended to appeal to anti-Semites and spread anti-Semitic ideas… This is intentional and by design. It is no accident.” \\nHere is something Charlie Pierce wrote back in May . Trump, he said, “is riding on a wave of pain that he never has felt.” \\n“He is riding on a wave of anxiety he never has encountered. Beyond their love of him, there is no indication that he is as deeply aware of what has powered his rise as the people whose fear, and doubt, and, yes, hatred has powered his rise. Their job is still to wait in line, cheer on cue, and give him the devotion that he has earned because, after all, he is He, Trump, and they’re not, and that will never change.” \\nAdd it all up and to me, this is what it comes down to: Do you want to live in a United States where anger, prejudice and fear rule, and dissent is viewed as treason, or in a country where we try to meet every issue from terrorism to education with clear eyes and a rational mind? \\nThis year’s choices are far from perfect, but nonetheless a choice must be made. To quote a founding father who believed in such things: liberty, once lost, is lost forever. This could be democracy’s last stop. Vote. \\nMichael Winship is the Emmy Award-winning senior writer of Moyers & Company and BillMoyers.com, and a former senior writing fellow at the policy and advocacy group Demos. Follow him on Twitter at @MichaelWinship .'"}, "time": 1742628312.9579694}