{"duration": 0.04023909568786621, "input_args": {"text": "'Pinterest \\nAttorney General Loretta Lynched promised this July that she would press charges against Hillary Clinton if recommended by the FBI. \\nAs more details emerge regarding Clinton’s use of a private server during her time as Secretary of State, and a new investigation by the FBI opening only days before the election, Lynch’s promise has taken on renewed significance. \\nThe Daily Caller reports: \\nThe New York Times reported Friday that the emails were obtained from a device belonging to either longtime Clinton aide Huma Abedin, or her estranged husband, former Democratic congressman Anthony Weiner, who is under investigation for sending illicit text messages to a 15-year-old girl. \\nSo far, Lynch has remained silent on Comey’s announcement regarding the newly discovered emails. \\nLynch was the subject of public scrutiny after it was revealed that she and Bill Clinton met for 30 minutes on an airplane runway at the end of June. \\nLynch admitted that the meeting “cast a shadow” over the investigation, before making her promise to accept the FBI’s recommendations. \\nWhen the FBI requested to open up a public integrity investigation into the Clinton Foundation, however, the Department of Justice (which is headed up by Lynch) declined, claiming there was insufficient evidence to open an investigation. \\nNew details have already emerged that prove relevant to the FBI’s investigation of Hillary Clinton. That, in fact, is why the case was re-opened yesterday. \\nIf those new details prove particularly damning for Hillary, the FBI could very well recommend criminal charges against the former Secretary of State and current Democratic nominee for president. \\nWorse yet, that FBI recommendation could come before the election. \\nWhether or not she intends to keep the promise she made four months ago, the spotlight will certainly then fall on Lynch to act and act fast. \\nWhat she’ll do next is anyone’s guess. \\nBut keep in mind Lynch is an Obama appointee. And if history is any indication, when given the choice between doing what is right and doing what is not right, Obama and his friends will choose the latter option every time. '"}, "time": 1742563388.5585425}