{"duration": 0.32547950744628906, "input_args": {"text": "'By Jonas E. Alexis on November 1, 2016 The good thing about morality or practical reason is that it doesn’t have a particular political affiliation. It transcends political ideologies and that’s what make things very interesting. …by Jonas E. Alexis \\n\\nYou’ve probably seen Megyn Kelly in action. You’ve probably watched her babbling weird things, crazy things, and incoherent things. You’ve also seen how she has prostrated before the Powers That Be for money, power, and fame. [1] In fact, she has been seeking for a salary of $20 million with Fox News. [2] \\nIn other words, Kelly is selling herself for the almighty dollar. If you haven’t noticed some of those phenomena, here is Kelly on the Howard Stern show talking about her husband’s genital, frolicking and other delicate things: YouTube - Veterans Today - \\nFor Kelly, it is perfectly fine for Howard Stern to talk about those issues on his show. It is also fine for Stern to sexually degrade Kelly. For Kelly, Stern is obviously doing a great job. \\nBut for people like Donald Trump to mention almost the same things on a private bus is an unpardonable sin. Sure, Trump’s remarks are disgusting and nasty. And there is no way to justify his immoral statement. It could even be conceived that Trump is just a nasty person who has been grabbing women, well, “by the pussy.” \\nBut do we honestly think that Trump is the only nasty and disgusting guy in town? Can Kelly really explain to us what was she doing on the Howard Stern Show about six years ago? And how again can the same sex culture itself slam Trump’s “grab them by the pussy” phraseology and at the same time praise people like Wilhelm Reich or even Alfred Kinsey? \\nYou see, the good thing about morality or practical reason is that it doesn’t have a particular political affiliation. It transcends political ideologies and that’s what make things very interesting. If you are looking at things from a moral point of view, then those who are condemning Trump ought to condemn the same sex culture which articulates Trump’s “grab them by the pussy” in a much subtle and interesting way. \\nKeep in mind that Wilhelm Reich, the man who coined the term “the sexual revolution,” was praised by the New York Times and other media outlets. Reich explicitly promoted and encouraged the sexualization of children and the clergy in his widely read text The Mass Psychology of Fascism . [3] \\nReich taught that “Sexual inhibition prevents the average adolescent from thinking and feeling in a rational way.” [4] Reich didn’t stop there. He’s got more insights: “If one succeeds in getting rid of the childhood fear of masturbation and as a result thereof genitality demands gratification, then intellectual insight and sexual gratification are wont to prevail.” [5] \\nThen, Reich dropped the ideological bomb: “The mechanism that makes masses of people incapable of freedom is the social suppression of genital sexuality in small children, adolescents, and adults.” [6] \\nNow we’re talking. Now things get really delicious. And it is here that our story gets very interesting because again Reich, like his contemporary Alfred Kinsey, was never condemned for his immoral posturing. The sex culture gave both men great accolades for spreading their own version of “democracy” and “freedom” and for polluting the social order. \\nKinsey, for his part, published “academic” books such as Sexual Behavior in the Human Male and Sexual Behavior in the Human Female , in which he forged data, pulled things out of thin air, [7] and deliberately selected samples of his “research” from male and female prostitutes to advance his wicked ideology. \\nKinsey’s other methods were so bias and fraudulent that statistician John Tukey of the American Statistical Association declared then that “A random selection of three people would have been better than a group of 300 chosen by Mr. Kinsey.” [8] \\nAcademic institutions such as Indiana University continue to protect Kinsey’s pedophilia. [9] Paul Gebhard, Kinsey’s protégé and former director of the Kinsey Institute for Sex Research, deliberately removed anything from the Institute that would even remotely implicate Kinsey as a pedophile and not a scientist. \\nSo, isn’t there a logical breakdown here? The sex industry complicated things when its advocates fired people for exposing Kinsey and documenting his immoral behavior. Are thing living in contradiction? \\nIndeed. \\nNow were are learning that the children of the same sex industry are implicitly sneaking in or even adopting moral themes by saying that “grab them by the pussy” is universally wrong. The sex industry shows that G. K. Chesterton was right all along when he said: “A man must be something of a moralist if he is to preach, even if he is to preach unmorality.” [10] \\nPerhaps this was one reason Kinsey died “a broken man” [11] in 1956. A sodomite and sadomasochist of the highest rank, Kinsey is indirectly the father of what is now “sex education.” \\nKinsey’s Sexual Behavior in the Human Male and Sexual Behavior in the Human Female contain chapter after chapter about pedophilia, group sex, orgies, etc. Kinsey was trained as a biologist, and it was no accident that he used his training to promote social engineering. [12] \\nObviously the ideology upon which the sex industry is based is irrational, incoherent, and ultimately worthless. And if had had to give the sex industry a different name from a book, it would be Smeagol, who later changed to Gollum, from J. R. R. Tolkien’s The Lord of the Rings . Gollum is the actual character who loves and hates the ring of power at the same time, “as he loves and hates himself.” \\nIn a similar way, the sex industry hates morality and fights against it in the cultural landscape, but the same industry always appeals to an implicitly moral code when someone else pursuits an immoral life. Hillary for example supported the Trotskyite group the Pussy Riot , a subversive band whose members deliberately performed orgies at a museum. \\nBut the same Hillary finds Trump’s “grab them by the pussy” disgusting. Trump is nasty for calling people overweight, but Hillary herself called people out for their weight and even went so far as to say that they are “shit-kickers.” [13] \\nSometimes, a “good morning, Mrs. Clinton” could drive her to say: “Fuck off! It’s enough that I have to see you shit-kickers every day…Do your goddamn job and keep your mouth shut.” [14] Judith Reisman \\nThere is more here than meets the eye and ear . Judith Reisman was inevitably fired at the American University for meticulously and methodically documenting that Kinsey was a pedophile masquerading as a researcher. \\nReisman, who has graciously sent me a copy of the fourth edition of her book, Stolen Honor Stolen Innocence: How America was Betrayed by the Lies and Sexual Crimes of a Mad “Scientist,” writes that Kinsey was “familiar with the work of Dr. Magnus Hirschfeld. Kinsey’s friend, Dr. Harry Benjamin, had brought Hirschfeld to America to speak against the social reform accomplishments of the Purity Movement.“ [15] \\nMagnus Hirschfeld (1868-1935), a German-Jewish physician and sexologist, used his medical training as a pretext to promote perversion and, in 1897, built his own system of “the Scientific-Humanitarian Committee, the first organization anywhere devoted to the protection of homosexual rights.” \\nHirschfeld was also “the primary inventor of marriage counseling, Gay Liberation, artificial insemination, surgical gender ‘reassignment,’ and modern sex therapy…His goofy persona and conscientiousness transformed Sexology from an anthropological curiosity into a popular German science. The Berlin monthlies, starting in the mid-twenties, referred to Hirschfeld solicitously as ‘the Einstein of Sex.” [16] \\nHirschfeld was the Einstein of sex because he “embraced a doctrine known as ‘sexual relativity.” [17] While the moral order dictates that there are only two sexes—male and female—Hirscheld postulated another doctrine, one more congruent with his subversive ideology. Hirschfeld “wrote that it was ‘unscientific’ to speak of two sexes. Between ‘full man’ and ‘full woman’ was an infinite string of sexual/gender possibilities.” [18] \\nThe only force that could hinder Hirschfeld was the moral order and a will to act on it, but he attacked it before proceeding with his sexual revolution. [19] Hirschfeld spent a large part of his 1200-page book The Homosexuality of Men and Women deconstructing moral principles about sex. [20] \\nThis began to take place in 1919 when Hirschfeld opened the Institute of Sexology in Berlin. Jewish scholar Mel Gordon of the University of California tells us that the institution \\n“quickly became one of the city’s most curious attractions. The Institute’s buildings, including a former mansion, were divided into areas for lectures, consulting offices, study rooms, laboratories, medical clinics, and a museum space devoted to sexual pathology.” [21] \\nPaul Johnson commented, \\n“The Foxtrot and short skirts, the addiction of pleasure in ‘the imperial sewers of Berlin,’ the ‘dirty pictures’ of sexologist Magnus Hirschfeld or the typical man of the times took on in the minds of the average citizen a repugnance that is difficult to recall in hindsight without some historical effort. \\n“In a number of highly celebrated provocations, the stage of the ‘20s dealt with topics like patricide, incest and other crimes and the deepest inclination of the times tended to self-mockery.” [22] \\nA number of Jewish icons such as George Gershwin, Ben Hecht, Douglas Fairbanks, and Sergei Eisenstein visited the school. [23] Eisenstein “enjoyed the Institute’s collection of sailor-dolls—homemade paper toys that German homosexuals fashioned during the Great War.” [24] \\nThe library of the school, “which contained the largest sex and pornographic book collection in Europe, remained accessible to all readers…Politically, the Institute provided a forum for progressive lawyers and government officials who sought to eradicate the laws against homosexuality and defend Germany’s legal abortion rights from the growing onslaught of fascist and religious parties.” [25] \\nThe building contained all sort of sexual devices in order to advance the sexual revolution in Berlin. Mel Gordon again writes: \\n“Glass cases of fetishistic objects and sex aids from preliterate, Asian, and European cultures filled two other rooms. In the open counters and boxes were collections of Mandigo dildos that squirted a milky solution, Moche water bottles with penis-shaped spouts, Sanskrit sex manuals, miniature shoes worn by bound-foot Chinese courtesans, medieval chastity belts, torture instruments from a German brothel, sadistic drawings and assemblages created by Lustmord convicts, an entire picture window of ankle boots donated by a local fetishist, antique steam-driven vibrators, fake rubber breasts and vaginas taken from transvestite prostitutes, lacy panties found on the corpses of von Hindenburg’s heroic officers, and other such incontrovertible evidence of Hirschfeld’s new calculus of desire.” [26] \\nMagus Hirschfeld left Germany during the rise of the Nazi Party, never to return. But he obviously had a tremendously powerful influence on Alfred Kinsey , who went on to open his own “sex research” at Indiana University, which was partly based on Hirschefeld’s questionnaires. [27] According to Kinsey, things such as child pornography, bestiality and even sex among children are natural and should be encouraged and promoted. Kinsey wrote: “It is difficult to understand why a child, except for its cultural conditioning, should be disturbed at having its genitalia touched, or disturbed at seeing the genitalia of other persons, or disturbed at even more specific sexual contacts.” [28] \\nHow did Kinsey bring this repulsive idea to the public, and who was he following? Reisman points out that Kinsey was an admirer and part-time disciple of the late Satanist Aleister Crowley, commonly known as “The Beast.” In fact, Kinsey made every effort “to acquire Aleister Crowley’s diaries for the Institute” at Indiana University. [29] He actually failed. \\nBut failure was obviously not an option for Kinsey, as he went on to perform the same sex and Satanic orgies that Crowley himself performed. Kinsey “made a pilgrimage to Thelema Abbey, the temple where Crowley had ministered. Crowley’s first book, the pornographic White Stains, advocated sexual magic and was much favored by Kinsey. In fact, Kinsey was photographed in Crowley’s “Chamber of Horrors,” while he and Clara appear together in a photo following Kinsey’s return from the Abbey.” [30] \\nKenneth Anger, a Crowley devotee, later admitted that Kinsey’s obsession with perversion was “highly reminiscent” of Crowley’s sex magic. [31] When Kinsey visited what one ought to call Crowley’s lab experiment in Italy at the Abbey, he saw depictions of children in “sado-sexual ceremonies,” and Kinsey never condemned the act. Kinsey “found Crowley’s savage child pornography, his homosexual magic, and his human sacrifice records to be ‘most open.’” [32] \\nWe are now facing an inevitable conclusion. No one with an ounce of moral sense should applaud Donald Trump for uttering disgusting words about women. But will the same mass media devote the same amount of time to dethrone people like Hugh Hefner, who incidentally articulated the same thing that Trump was saying? Hefner declared: “Censorship is the tool of totalitarianism and repression. If it is used today to prohibit sexually explicit words and images, it might be used tomorrow to prohibit other forms of expression. “It might be used to justify the oppression of women in such areas as abortion rights, and to foil other efforts to bring about equality between the sexes. Censorship is insatiable. “It can erode the freedom of expression until there is only one acceptable point of view left. If that were to happen in our society, whose point of view would survive? “Playboy celebrates sex because sex is one of the good things in life. The freedom to express oneself without fear of censorship is another.” [33] \\nHere’s the kicker: Hefner wrote his piece in the L.A. Times , the same organ that is now condemning Trump for following Hefner’s advice! \\nWhat the sex culture is basically saying here is that it is sexually permissible to “grab them by the pussy.” After all, “Censorship is the tool of totalitarianism and repression.” But when Trump actually grabs them “by the pussy,” what was sexually permissible has magically become morally impermissible. \\nIf these people cannot see the lunacy of their ideology, then I’ve got some hamsters to sell them in South Korea. \\n[1] See for example Erica Tempesta, “’She looks like she’s working for an escort agency!’ Megyn Kelly slammed online over risque low-cut dress she wore at the RNC, with critics claiming it looked like ‘lingerie,’” Daily Mail , July 22, 2016. \\n[2] Joe Flint, “Megyn Kelly Seeks Salary North of $20 Million in Contract Talks With Fox News,” Wall Street Journal , October 27, 2016. \\n[3] See E. Michael Jones, Libido Dominandi: Sexual Liberation and Political Control (South Bend: St. Augustine’s Press, 2000). \\n[4] Quoted in E. Michael Jones, The Catholic Church and the Cultural Revolution (South Bend: Fidelity Press, 2016), kindle edition. \\n[6] Ibid. \\n[7] See E. Michael Jones, Degenerate Moderns: Modernity as Rationalized Sexual Misbehavior (South Bend: Fidelity Press, 2012), chapter 5. \\n[8] David Leonhardt, “John Tukey, 85, Statistician; Coined the Word ‘Software,’” NY Times , July 28, 2000. \\n[9] For a study on this, see E. Michael Jones, Degenerate Moderns: Modernity as Rationalized Sexual Misbehavior (South Bend: Fidelity Press, 2012), 83-108. \\n[10] G. K. Chesterton, Heretics (Nashville: Sam Torode Book Arts, 2011), 103. \\n[11] Simon LeVay and Elizabeth Nonas, City of Friends: A Portrait of the Gay and Lesbian Community in America (Cambridge: The MIT Press, 1995), 51. \\n[12] See James H. Jones, Alfred C. Kinsey: A Public/Private Life (New York: W. W. Norton, 1997); Jonathan Gathorne-Hardy, Sex the Measure of All Things: A Life of Alfred C. Kinsey (Bloomington: Indiana University Press, 2000). \\n[13] Quoted in Christopher Andersen, American Evita: Hillary Clinton’s Path to Power (New York: HarperCollins Publishers, 2004), 90. \\n[14] Ibid. \\n[15] Judith Reisman, Stolen Honor Stolen Innocence: How America was Betrayed by the Lies and Sexual Crimes of a Mad “Scientist” (Orlando, FL: New Revolution Publishers, 2013), 22. \\n[16] Mel Gordon, Voluptuous Panic: The Erotic World of Weimar Berlin (San Francisco: Feral House, 2006), 153. \\n[18] Ibid., 153-154. \\n[19] Elena Mancini, Magnus Hirschfeld and the Quest for Sexual Freedom: A History of the First International Sexual Freedom Movement (New York: Palgrave, 2010), 13. \\n[20] See Magnus Hirschfeld, The Homosexuality of Men and Women (New York: Prometheus Books, 2000). \\n[21] Gordon, Voluptuous Panic, 126. \\n[22] Johnson, Modern Times , 115. \\n[23] Gordon, Voluptuous Panic , 164.'"}, "time": 1742563491.8176744}