{"duration": 0.07233905792236328, "input_args": {"text": "'  Party for Freedom (PVV) leader Geert Wilders, who stands a chance of being the Netherlands’ next prime minister, has said the demise of the European Union (EU) is now “irreversible” and that attempts by the bloc to punish the UK for leaving would backfire. [Speaking just five weeks before the Netherlands goes to the polls to decide on the composition of their next government, Mr. Wilders told The Telegraph he would seek to form a coalition government after the election if his vote share was comparable to the level presently being predicted by opinion polling. While the polls have failed to predict the outcome of major electoral battles in the United Kingdom and the U. S. in the past year, Mr. Wilders’ PVV had topped or tied every national poll for months.  Of the EU, Mr. Wilders said the nationalist “genie” was now out of the bottle and the European elite had not only totally failed to grasp what it was, but couldn’t now do anything about it. Comparing the crumbling political bloc to the final days of the Roman Empire, beset by decadence and lack of direction, Mr. Wilders said: “The days of the old Roman Empire, which the European Union is, are over. They know it and they have been fighting for the last few years to extend it a bit, but this process is irreversible. ” Mr. Wilders was bullish in the interview about his ambitions for the coming election, telling The Telegraph: “I want to be prime minister. The question is if they want me to be prime minister  …     The odds of me becoming prime minister, are perhaps not in my favour, but I’m confident that if we get the result, according to the current polls that it is a real possibility. ” If the PVV took power, they would prioritise taking back “the key to our own front door”  —   a reference to the present open borders with the rest of the EU. But Mr. Wilders admitted it was possible other parties could refuse to cooperate with him, opening the way for a minority coalition to rule although he could command the largest single party. A similar fate could await his colleagues in other European nations, he said, but even if Marine Le Pen in France and Sebastian Kurz in Austria failed to top the ballots in 2017 the populist revolution would carry on going. The PVV leader’s remarks come just days after he called on Rotterdam to allow his party to place political  on the sides of their trams in the   to the elections. The proposed design which features the phrase “Stop Islam” written in large letters along the sides of the vehicles was turned down by the authority, who told press, “We do not work with politically tinged statements. We never do. ”  '"}, "time": 1742563239.9455373}