{"duration": 0.3494091033935547, "input_args": {"text": "'NASHVILLE, Tennessee —  “We’ve got to get the health care done,” President Donald Trump told  an enthusiastic crowd of 8, 000 Tennesseans at the beginning of his address to a rally in the Nashville Municipal Auditorium on Monday night. [He turned to the theme of health care toward the very end of his speech.  “The House has put forward a plan to repeal and replace Obamacare based on the principles I outlined in my joint address,” the president said. “Let me tell you, we’re going to arbitrate, we’re going to all get together, we’re going to get something done,” he added. The president also blasted the culture of Washington and Democratic recalcitrance. “Remember this —  if we didn’t do it the way we’re doing it   …     we need 60 votes. So we have to get the Democrats involved. They won’t vote, no matter what we do,” he said. “We’re doing it a different way, a complex way, it’s fine. The end result is  —   when you have Phase One, Phase Two, Phase Three, it’s going to be great,” the president added. “And then we get on to tax reduction,” he concluded. While he heaped praise on a number of Tennessee Republican politicians in his speech, another name was noticeable for its absence in his talk: Speaker Paul Ryan. Ryan’s healthcare reform bill, referred to as   by some, has been panned by Democrats and conservatives alike. The president’s remarks in Nashville on Monday did little to suggest he is committed to the specifics of the Ryan proposal. In addition to his use of the term “arbitrate” he used another term to describe how he would approach getting a health care bill through Congress: “negotiate. ” While he firmly stood behind his campaign promise to repeal and replace Obamacare, the president made it clear that the healthcare bill currently on the table may be substantially different from the bill he finally signs. “The bill I will ultimately sign will repeal and replace Obamacare,” the president told the cheering crowd. Trump focused more on the failures of Obamacare than the specifics of the current proposals under consideration. “Remember all of the broken promises? You can keep your doctor, you can keep your plan? Remember the wise guy that essentially said   …     the   architect   …     the American people are stupid?” he asked. “Those in Congress who made these promises have no credibility whatsoever,” he told the cheering crowd. Trump also criticized “the level of hatred and divisiveness with the politicians” in Washington. “If we submitted the Democrats’ plan   …     we wouldn’t get one vote from the Democrats. That’s how much divisiveness and other things there are,” he added. “But we’re going to get it by,” Trump said of a revised health care bill. “I’ve talked to so many victims of Obamacare. At the very core of Obamacare was a fatal flaw. The government forcing people to buy a   product,” he added. Trump said that when health care has been fixed, Americans “will be able to purchase the health insurance plans they want, not the plans forced on them by our government. ”'"}, "time": 1742563065.8955743}