{"duration": 0.0652613639831543, "input_args": {"text": "'The ADT Corporation, the largest security company in the United States and Canada, announced Wednesday that it will pull its ads from CNN in the wake of the growing drama surrounding a photograph showing Kathy Griffin lifting up a bloodied decapitated head meant to resemble President Donald Trump. [A Twitter user sent ADT a message asking the   company to “drop CNN. ”  “We do not support these views,” ADT responded. “We’ve begun the process of pulling our ads from this network. ” We do not support these views. We’ve begun the process of pulling our ads from this network.  —   ADT (@ADT) May 31, 2017,  Griffin has   a live New Year’s Eve broadcast on CNN since 2007 alongside network anchor Anderson Cooper. The network said late Tuesday that it was “evaluating” its relationship with the    comedian. “We found what she did disgusting and offensive,” CNN said in a statement Tuesday. “We are pleased to see she has apologized and asked that the photos be taken down. We are evaluating our New Year’s Eve coverage and have made no decisions at this point. ” Cooper denounced Griffin’s photo in a short statement on Twitter. “For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate,” the AC360 host wrote. For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate.  —   Anderson Cooper (@andersoncooper) May 31, 2017,  ADT’s announcement comes as the Route 66 Hotel and Casino in Albuquerque, NM has canceled Griffin’s scheduled performance. “The performance by Kathy Griffin on July 22nd has been cancelled,” the casino wrote in a message posted to Facebook. A full refund to any guests who purchased a ticket was also promised. Griffin’s social media accounts were flooded with calls from social media users urging others to boycott her upcoming   comedy tour dates and venues to deny her a platform to perform. President Trump tweeted Wednesday morning that Griffin’s photo had been difficult for his children, including his    son, Barron. Kathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick!  —   Donald J. Trump (@realDonaldTrump) May 31, 2017,  While Griffin has issued an apology, admitting that the photo “went too far,” she has yet to apologize directly to the president and his family. The U. S. Secret Service, however, is reportedly investigating the “circumstances” surrounding the photo shoot. “The U. S. Secret Service has a critical mission. It is always unfortunate when people make statements that could be perceived as threats,” the agency said in a statement, according to ABC News. “We don’t have the luxury of knowing a person’s intent. Each alleged or perceived threat has to be investigated thoroughly which taxes Secret Service manpower and resources that could be utilized elsewhere. ”   Follow Jerome Hudson on Twitter: @jeromeehudson'"}, "time": 1742561874.1353161}