{"duration": 0.20472264289855957, "input_args": {"text": "'by Outis Philalithopoulos By Outis Philalithopoulos, who met an untimely end five years ago, and now “wears the chains he forged in life” as an economist. In our story so far , a cyclops challenged Outis to discover possibly inconvenient truths about liberalism, and proposed the help of three Spirits. Through the gloom, there sounded the deep, hollow, melancholy note of a bell. I turned, and there stood a strange figure. It seemed rather aged, and yet the face, and the smooth, hairless head, had not a wrinkle in it. The arms were very long and muscular, and the feet were bare. “Are you the Spirit, sir, whose coming was foretold to me?” I asked. “I am!” He spoke with a French accent, in a voice that was even and clear. “Who and what are you?” I demanded. “I am the Ghost of Liberalism Past. My name is Michel Foucault.” “Oh,” I said. “Should I know that name?” “What?” the Spirit exclaimed, with a flash of pride. Then he sighed. “I suppose,” he said, “it is better if my phantom no longer casts its shadow upon the world, as if I were some sort of great Astrologer surveying an atemporal sky, telling people what is good and what is not.” “But you were famous?” I asked, feeling bad that I had hurt his feelings. “Oh, sure,” he said with a trace of self-mockery. “Noam Chomsky once said that he had ‘never met anyone who was so totally amoral.’ I tried to teach people about madness, medicine, and sexuality, but most wrote me off as this radical anarchist with an absolute hatred of power.” “And that wasn’t true?” “No!” he exclaimed. “Power is not always repressive.” I struggled to understand. “By power, do you mean government? Or one social group oppressing another?” “These are only a few particular instances of power,” Foucault explained. “Power is anything that tends to render immobile and untouchable those things that are offered to us as real, as true, as good.” “That sounds kind of… bad,” I replied. “Listen, listen,” Foucault replied. “How difficult it is! I’m not a prophet. I’m not going to tell people, “This is good for you, this is bad for you!” I try to analyze a real situation in its various complexities, with the goal of allowing refusal, and curiosity, and innovation. Is it clearer, now?” I shook my head. “I find your world confusing. It’s like there are no points of orientation…” Foucault gazed at me mildly. “Perhaps, in time…” he murmured. Then he clasped me by the arm. “Rise! And walk with me!” I took a step – and found myself outside a snowy yard covered in red brick. “What?” I stammered. “Here is where I wrote my thesis…” “You remember it, then?” inquired the Spirit. “Remember it?” I cried. “I could walk this campus blindfolded.” “Let us go in, then.” We walked through the doors of the Kennedy School of Government, into the midst of a boisterous crowd of students. Seconds later, they fell silent, and the president of the Young Democrats announced the speaker. It was Al Franken, presenting his book Rush Limbaugh Is a Big Fat Idiot . I hadn’t heard Franken’s name in a while, but something tugged at my memory. I looked questioningly at Foucault. “1996,” was his only response, as laughter echoed from the audience. Franken had begun speaking. I soon found myself nodding along with Franken’s words. Franken pointed out that Limbaugh had “tapped into the resentments of the ‘angry white male,’” mentioning his “studio audience of rabid – but extraordinarily straight-laced – right-wing yahoos.” He went on to talk about some of the crazy religious people he had met while touring the country. “By now, you may be thinking I’m showing an anti-Christian bias,” Franken suggested, grinning. “Nonsense! Need I remind you that I married a Roman Catholic, whom I met in college, despoiled and then convinced to renounce the Pope?” The crowd roared with laughter. I joined them, although something about that word “despoiled” rubbed me the wrong way. Franken added that Limbaugh believes feminists think all heterosexual sex is rape. “The thing is,” Franken said, “I know a lot of women, almost all of whom consider themselves feminists, and I know of only one who actually holds this belief. And we’ve been married nearly twenty years.” As the room rocked with laughter, my jaw dropped. Making light of the victims of marital rape? What was Franken’s problem? Franken said that at one point, when Limbaugh had not been famous, he had been so poor that his wife had made him go file for unemployment. Franken addressed Limbaugh directly. “I swear, you must be the biggest pussy on God’s green Earth. My God, you are a sad, sad creature, aren’t you? Sort of a she-male?” I was sure Franken was right and Limbaugh was a horrible person, but how could he not see how problematic his statements were? Reinforcing gender normativity? Negative references to female anatomy? Why wasn’t anyone in the audience besides me concerned? Most likely people were concerned, but felt too marginalized to say anything. Franken had meanwhile moved on to the big picture. What was the fundamental issue with guys like Limbaugh and Newt Gingrich and Pat Robertson? “You know what I dislike most about these guys? They’re always so certain. They’re always 100 percent sure of what they’re saying.” He paused for a split second. “This is why I like being a Democrat. When we see a complicated, intractable problem, we have the only really genuine, authentic human reaction you can have: we’re confused.” I stared at Foucault. When Allan Bloom had claimed that liberals are terrified of people who think they are right, I had assumed he was describing a colony on Neptune. Maybe he was instead talking about people like Franken and Foucault. Foucault smiled back at me. Franken started to discuss various controversial issues. President Clinton’s crime bill paid for a lot of new prisons, and that’s good. Riiight. I have no problem frying a murderer. In some cases I’d even waive the cruel-and-unusual punishment. That is, as long as we know we have the right guy. Right. What kind of progressive/liberal was this guy, anyway? Wait, what was that about a “national Ponzi scheme currently scheduled to implode in a spectacular fiscal nightmare”? Pete Peterson, a co-founder of the Concord Coalition, did hit a home run with a very sobering speech about what will happen if we don’t reform social security. Okaaay. Franken talked about watching Pat Buchanan speak to members of the Reform Party. He counted six standing ovations, “although it’s hard to count when you’re cowering under your seat.” The biggest ovations had come on the crowd’s “red meat issues,” such as NAFTA and the 1995 Mexican bank bailout, on which Buchanan had said: Politicians of both parties sold us out in Washington, D.C. They took Citibank and Chase Manhattan and J.P. Morgan and Goldman Sachs off the hook, and they put us on. Well, […] when I get to the White House, NAFTA will be canceled! To me, the speech sounded like something Matt Taibbi would say. Why did it frighten Franken so much? An uncomfortable subject that’s not discussed enough is black on black crime. Jesse Jackson had the courage to talk about it in terms that most people can identify with. He said it pains him that when he’s walking down the street at night and hears footsteps, he’s relieved if it’s a white man and not a black man. I know exactly what he means. I was leaving NBC late one night and heard some footsteps. When I turned around, I saw it was Jesse Jackson, and it scared the living daylights out of me! The audience thought this was hysterical. Why hadn’t the real progressives organized to deplatform this guy? Franken returned to the topic of anti-establishment, anti-free trade Americans in his final windup. Some of them were crackpots, sure. But I thought about Hank from Michigan, a retired autoworker who was worried about jobs moving overseas. I thought about Louise from Washington state, who was scared for her children because wages for non-college graduates have fallen 20 percent in the last twenty years. I thought about how our political system appeals to the worst, not the best, in us. And I thought about this book. Maybe, I thought, I’m on the wrong track. Maybe I’m sowing the very seeds of distrust that I so decry. Perhaps, I thought, I should throw away the 200-plus pages of cheap, tawdry, mean-spirited (yet accurate) bile, and start over on a book whose humor heals rather than wounds. Then, as we flew over Manhattan, it occurred to me that my book was due in a week. Then we flew over my daughter’s private school. And then my son’s orthodontist. Followed by the bank that holds the mortgage on my apartment. And as the plane banked its wings, a stream of light pierced the window, bathing my face in the orange glow of the sun setting over the American continent. And I thought to myself, “You know, Rush Limbaugh is a big fat idiot.” “He sells out his principles to maintain his cushy lifestyle and then brags about it?” I wondered incredulously, as laughter and applause reverberated around me. “ Allez, viens ,” Foucault said, beckoning. A long line of students waited to talk with Franken, who beamed and autographed copies of his book. A rather earnest-looking young man and woman were walking towards us. “Did you like it, Outis?” she asked with an accent a bit like Foucault’s. “It was hilarious,” the young man said. “But Corinne, did you…” “Yes, it was good,” she said. “Rush Limbaugh really is a negative person and it’s scary that there are so many insane people in your country. But…” “Oh, yes,” said the young Outis. “The talk over in your department…” “I know you’re not thrilled about it,” Corinne began. Outis said, “The way they talk…” Corinne completed the thought. “It can be hard to understand. And honestly…” and her voice lowered, as if she were afraid of being overheard, “a lot of postmodernist scholars are just BS artists who spout the jargon to get good jobs.” The young Outis nodded. Corinne continued with some passion. “But sometimes people just use that as an excuse not to listen to the important things they say. And this speaker’s different.” “I suppose she’s not very well known…?” Corinne eyes danced. “Well, you are an economist…” “But that doesn’t mean I’m a complete illiterate,” Outis shot back. “Come on, I’m familiar with a lot of postmodernists – Derrida, Stanley Fish, Judith Butler, Edward Said…” “But you’ve never heard of her ,” Corinne finished. “Well, maybe she isn’t as chic as some of the others, but she’s very smart – and clearer than most of them.” “Sure,” Outis said uncertainly. Corinne frowned. Outis took on what he doubtless assumed was a cunning expression. “I’d be more excited to go if afterward we slip out for a walk down the Charles.” She smiled cunningly back at him. I looked desperately at Foucault. “Spirit,” I cried. “Show me no more!” * * * In the next episode, Outis becomes more certain that postmodernist liberalism was not a myth after all. Sources : For Foucault, see this interview . At one point, the interviewer remarks, “I have to admit, I find myself a bit lost, without points of orientation, in your world […]” All Franken statements are verbatim quotes from Rush Limbaugh Is a Big Fat Idiot (1996). 0 0 0 0 0 0'"}, "time": 1742563107.7426834}