{"duration": 0.13263583183288574, "input_args": {"text": "'  Finian Cunningham has written extensively on international affairs, with articles published in several languages. Many of his recent articles appear on the renowned Canadian-based news website Globalresearch . He is a Master’s graduate in Agricultural Chemistry and worked as a scientific editor for the Royal Society of Chemistry, Cambridge, England, before pursuing a career in journalism. He specializes in Middle East and East Africa issues and has also given several American radio interviews as well as TV interviews on Press TV and Russia Today. His interests include capitalism, imperialism and war, socialism, justice and peace, agriculture and trade policy, ecological impact, science and technology, and human rights. He is also a musician and songwriter. Previously, he was based in Bahrain and witnessed the political upheavals in the Persian Gulf kingdom during 2011 as well as the subsequent Saudi-led brutal crackdown against pro-democracy protests. The author and media commentator was expelled from Bahrain in June 2011 for his critical journalism in which he highlighted many human rights violations by the Western-backed regime. For many years, he worked as an editor and writer in the mainstream media, including ,The Mirror, Irish Times and Independent. Originally from Belfast, Ireland, he is now based in East Africa where he is writing a book on Bahrain and the Arab Spring. World Heaves Sigh of Relief after Trump’s Victory By Finian Cunningham on November 9, 2016 A reflection of how disconnected the Western political class are from their own people. \\nby Finian Cunningham \\nSPUTNIK \\nThe election of Donald Trump as the 45th president of the US certainly sent shockwaves around the world. But perhaps the uppermost sense is one of huge relief that Hillary Clinton was kept out of the White House. \\nFor most ordinary citizens around the world, Clinton, her multi-billion-dollar election campaign and the fawning corporate media coverage represented everything that is perceived as fundamentally wrong in Western politics. \\nHer cronyism goes so far that she would not hesitate to start a world war with Russia, or whoever, in order to appease her corporate sponsors and indulge her deluded notion of “exceptional liberalism”. \\nTrump’s stunning victory is a victory for common people and common sense. Despite the Western media’s systematic shielding of Clinton from criticism, a good number of ordinary Americans and other nationals around the world could clearly see her irredeemable flaws. \\nShe is a self-enriching puppet for Big Finance and the military-industrial complex. And, as her email scandal shows, a consummate liar on top. Donald Trump is a billionaire property tycoon with a big mouth and uncouth manner. He has never held an elected office before. It is unprecedented that he should become the president of the US. \\nDonald Trump is a billionaire property tycoon with a big mouth and uncouth manner. He has never held an elected office before. It is unprecedented that he should become the president of the US. \\nWill he really “make America great again”? Will he really deliver on massive infrastructure investments to regenerate impoverished working-class communities across America? We don’t know if he just an opportunist conman, or if he really does have a humble heart to reach out to all the “forgotten people” that he speaks about. One can hope. \\nBut one thing is for sure. Trump is no warmonger. And he doesn’t seem to be a puppet that can be pushed around. \\n“We will deal fairly with everyone” \\nIn one of the live TV debates with Clinton during the campaign, Trump surprised many viewers when he said, apparently sincerely, that he would never commit a first-strike nuclear attack against any nation. It took a lot of guts and moral integrity to say that. Clinton didn’t answer the question, but her past record as Secretary of State shows that she has no hesitation about launching illegal wars and murdering foreign heads of state. \\nTrump has also spoken several times about restoring friendly relations with America’s biggest nuclear rival Russia. He took a lot of heat for that from the Clinton campaign and the biased US media, who accused him of being a “stooge” for Russian President Vladimir Putin. To his credit, Trump did not cave in to the anachronistic “Russian baiting”, which has been a staple of American politics for decades. During his acceptance speech as President-elect, Trump repeated his oft-mentioned desire for the US to base its foreign relations on “partnership” instead of “hostility and conflict”. \\nNotably, Russia’s Vladimir Putin was one of the first world leaders to congratulate Trump on winning the White House. Reciprocating goodwill, Putin said he hoped to work with Trump so that Russia and the US can “restore relations from their current critical condition”. \\nSurely, this is the point. To replace outmoded ideological stereotypes and animosity with a pragmatic mutual respect to cooperate. Russia and its leader are not the enemy of the US, Europe nor the rest of the world – unless you are a terrorist network seeking illicit regime change. Architects of Endless “Regime Change” wars \\nRussia and its leader are not the enemy of the US, Europe nor the rest of the world – unless you are a terrorist network seeking illicit regime change. \\nThe people who have demonized Russia are ideologues in Washington and their surrogates among European governments and the Western corporate media. That negative image of Russia does not match reality as ordinary people perceive it, including many ordinary Americans. Russia did not destabilize Ukraine. It did not annex Crimea. Russia was not involved in shooting down a civilian airliner. It is not massacring civilians in Syria. In Syria, it is helping a sovereign state defeat terrorist mercenaries in a US-sponsored covert war for regime change. Russia is not a sports-drug pariah. It is not hacking computer systems nor subverting foreign democracies. These are all just false ideological constructs manufactured by the Western establishment and its subservient media. \\nOrdinary citizens around the world, especially those in the US, know that. Their real-world concerns are dealing with poverty, unemployment and crumbling societies. This stuff about “Putin being the new Hitler” and “threatening the free world” is just so much baloney. \\nMaybe because Trump is not a career politician or a Washington insider he knows all that too. And he knows that ordinary Americans are not being listened to by the establishment. That’s why Trump’s victory comes as such a shock. \\nThe political class have been so wrong on almost every issue, whether it was the Brexit and discontent with the European Union, or foreign relations with Russia, or Trump’s chances of winning the presidency. \\nThe Western political class have gotten it so wrong on so many issues because it is divorced from the reality as it affects most people. Aloof, elitist, out of touch and undemocratic. \\nYet this Western ruling class, as embodied by Hillary Clinton, would be prepared to start even more wars around the world than they already have, based on their own twisted self-serving logic. \\nConsider these figures just released by the Pentagon. Under President Obama – who advocated for Clinton – US military exports to Saudi Arabia and other Mideast despots are double the amount under George W Bush. This weapons supply has gone towards arming jihadi terror groups. Clinton approved of this arms bazaar for terrorists when she was in office as part of Washington’s regime-change schemes. Fooling the masses – Defeated \\nYet these people like Obama and Clinton spout all sorts of “humanitarian” and “moralistic” mumbo-jumbo. They are liars. And they are the most cynical of corrupt politicians. The very breed of politician-puppets that ordinary decent people around the world have come to despise. \\nTrump, for all his personal flaws, is in a different category. He is astute enough to know that the pain of ordinary citizens stems from a badly broken economic system. Can an arch capitalist like Trump fix chronic capitalism? It’s doubtful, unless he radically shifts to a new form of socialist policy. \\nBut the main good thing about Trump is that he is a pragmatist who at least appears to be on the side of ordinary people and on the side of restoring peaceful relations with other nations, Russia in particular. \\nThe prominent people dejected about Trump are the political class both in the US and Europe and their media echo chambers. It is notable that Germany’s Merkel and France’s Hollande both affected an air of disapproval over Trump’s victory – unlike Putin who magnanimously congratulated. Hollande said he would be “vigilant” in his future dealings with Trump. What is he talking about? \\nThat’s why Merkel and Hollande will be next to get kicked out of office in forthcoming elections. Like Obama, Clinton and the American establishment, the pro-US European ruling parties are so out of touch with reality. \\nThe demonization of Russia is a reflection of how disconnected the Western political class are from their own people. Ordinary people around the world want jobs, prosperity and peace. They know they can’t afford futile hostilities with Russia as have been foisted on them by their rulers, while such urgent social needs go neglected. Crazy as it may seem, Trump’s win may be a chance for the US to redeem. And for the world to heave a huge sigh of relief. \\nSee:'"}, "time": 1742564527.1637626}