{"duration": 0.11097598075866699, "input_args": {"text": "'The Obamacare repeal is “going to start happening in just a few days,” Vice President Mike Pence promised a crowd gathered on Friday at Blaine’s Farm and Fleet Distribution Center in Janesville, Wisc. [The goal, he said, is to “eliminate all its mandates and taxes and intrusion into your personal lives and into the lives of your business,” he said shortly after House Speaker Paul Ryan introduced Pence to the crowd.  “We both know the fundamental truth of our economy: when small business is strong, America is strong, and we’re gonna fight every day for small business America,” said Pence. Pence said states would be given the resources and flexibility needed to “take care of our most vulnerable,” he said. “When we repeal and replace Obamacare that we’re gonna allow states to have the flexibility to craft   solutions that will work for the people of their individual states,” he said. “The truth is is virtually every promise of Obamacare has been broken,” said Pence. Today Americans are paying $3, 000 dollars a year more on average for their health insurance than when Obamacare was passed into law and premiums are skyrocketing, last year by more than 25 percent on average around the country. Millions have lost their plans and lost their doctors. And not only that, Obamacare   …     is a job killer and everybody knows it. The Vice President cited   business   a company President Donald Trump spoke of during his Tuesday night address to a joint session of Congress. “After years of delays, for instance, President Trump authorized the construction of the Keystone and Dakota pipelines creating thousands of American jobs and strengthening our energy infrastructure,” Pence offered as evidence of Trump’s efforts to restart the American economy. Pence credited Trump with signing legislation to “roll back reams of red tape” while also thanking Congress, Speaker Ryan and Sen. Johnson for sending that legislation to Trump’s desk. He added that Trump has called on every government agency to roll back two regulations for each new regulation they want to issue any new regulations on businesses and entrepreneurs. “He’s taken decisive action to end illegal immigration once and for all, to strengthen our borders and uphold the laws of the United States of America,” Pence said of the President. He said that American businesses have responded to Trump’s calls to buy American and hire American. The Vice President heavily emphasized the weight placed on businesses and American families by the Affordable Care Act. “It’s just a long list of broken promises,” said Pence. He called Obamacare promises of the cost of health insurance going down, patients being able to keep their doctor and being able to keep their insurance, “not true. ” “I’m going to make you a promise, you heard the President say it and give direction to the Congress, and it’s just going to start happening in just a few days. We’re gonna repeal Obamacare once and for all and eliminate all its mandates and taxes and intrusion into your personal lives and into the lives of your business,” pledged Pence. He went on to promise it would be replaced with a better law that will lower health insurance costs without growing the size of government. Pence again referenced Trump’s Tuesday night speech, stating that the Trump Administration will end government mandated health insurance, allow it to be sold across state lines creating a national marketplace for health insurance that he said would be the catalyst to lowering health insurance costs. Pence went on to speak of select additional aspects of the Trump Administration agenda, “Jobs, jobs, jobs. ” He said that the President would be involved in overseeing the biggest tax relief package since President Ronald Reagan’s Administration. He promised to roll back regulations, rein in unelected bureaucrats, end wasteful spending and provide the best roads, airports, and highways through infrastructure improvements. “President Trump stands with the men and women who serve in law enforcement all across this country like no one I’ve ever met,” said Pence. He said they would make sure that those who come into the country don’t pose a threat to Americans. President Donald Trump and the leadership of this Congress will rebuild the military, make sure armed forces have the training and resources they need to protect this nation starting now, said Pence. Pence defined what it looks like to Make America Great Again, “Health care reform, tax reform, regulatory reform, taking steps to make America secure, ensuring that the highest court in the land upholds our highest ideals. ” The Vice President spoke of those “who want to stick with the status quo,” but said Trump would “deliver on this moment” for the people of the United States of America. “Whether it’s the media, the establishment insiders or the rest, They have no problem standing in the way of change. ” In closing, Pence said, “Whatever challenges we face today, we’re going to stay in the   business. ” Follow Michelle Moons on Twitter @MichelleDiana '"}, "time": 1742561966.0054998}