{"duration": 0.03168654441833496, "input_args": {"text": "'WATCH: Trump Gropes, Humiliates Miss Universe Just To Get REVENGE By Karen Shiebler   \\nIt is absolutely incredible that Republican presidential candidate Donald Trump is still trying to deny his sexual misconduct. \\nFirst the man brags about grabbing women and kissing them without consent, then he acts completely outraged that anyone would ever accuse him of doing just that. As a literal parade of women have come forward, one after another, to accuse the candidate of grabbing them, he has responded by threatening to sue them. \\nIt is hard to believe that anyone would believe Trump’s shallow denials, but if there is anyone out there who still needs convincing, here you go . \\nA video has surfaced from 2011 showing Donald J. Trump publicly humiliating a beauty pageant contestant with sexual jokes at her expense and an unwanted grope in front of thousands of corporate audience members. \\nNot only did Trump embarrass the woman and grab her in public, he did it out of a very twisted desire for revenge. \\nThe need for revenge moves Trump’s misogyny out of the realm of the creepy and into the realm of the truly sick. \\nHere’s what happened, according to reports . \\nTrump was speaking to a corporate audience in Sydney, Australia in 2011. As he often does in his corporate speeches, Trump talked about getting revenge on those who have slighted him. He said: “Get even with people. If they screw you, screw them back 10 times as hard. I really believe that.” \\nWhat a prince. \\nHe went on to give the crowd an example of how he gets even. He decided to single out a woman named Jennifer Hawkins. She was the 2004 winner of the Miss Universe Pageant, which Trump owned. He had asked the beauty queen, who is Australian, to introduce him at the corporate event, but there had been some type of miscommunication. \\nEither that, or she had simply declined to do so. \\nEither way, Trump was furious at Ms. Hawkins. He wanted the crowd to see how he handled his anger at a perceived snub. As he talked about getting revenge, he said : “I’ll give you an example: Jennifer Hawkins. Where’s Jennifer? Where’s she sitting? Get over here, Jennifer. First of all, how beautiful is Jennifer? This is about getting even.” Trump pulled Hawkins up on the stage, telling the crowd how angry he had been at her. When she tried to explain herself, Trump pulled the mic away from her and told the crowd how she had “dissed” him after he had made her a “big star” through his pageant. He disregarded her attempts to explain, instead choosing to make a sexual joke of her. “So what happens is ― and you know what? She came tonight, she came ― came, she came, she came.” When the audience dutifully laughed at Ms. Hawkins’ expense, Trump added: “See, so they have the same filthy minds in Australia.” Oh, ha,ha. What a sick adolescent mind. What an ass. It got worse, though. Trump grabbed the embarrassed woman and pulled her in for a clearly unwanted kiss. She managed to get an arm in between them, but Trump still managed to kiss her cheek. This is all on video, folks. This is right there for everyone to see. The disgusting sexual pervert who wants to be our next President can’t dismiss this one with a threat to sue. He can’t pretend that it didn’t happen. Because we can all watch it. Right here . \\n\\nFeatured image via YouTube Screengrab . About Karen Shiebler \\nKaren is a retired elementary school teacher with many years of progressive activism behind her. She is the proud mother of three young adults who were all arrested with Occupy Wall Street. To see what she writes about in her spare time, check out her blog at \"Empty Nest, Full Life\" Connect'"}, "time": 1742628524.4588008}