{"duration": 0.03328371047973633, "input_args": {"text": "'By Kadir A. Mohmand on October 30, 2016 \\n“SEARCH FOR THE AFGHAN GIRL”© Steve McCurry \\nI am writing on behalf of the Afghan villagers like Sharbat Gula because the U. S. installed Afghan administration only works on behalf of the occupiers and war profiteers. The Afghan administration does not care about Sharbat Gula. \\nShame on you Pakistan for imprisoning the national Afghan war hero, Sharbat Gula , who is again suffering because of the foreign occupier’s and its Afghan puppets’ bombardment of her village in Afghanistan. Sharbat Gula is now suffering at the greedy hands of Pakistan, who financially benefits from the U.S. war against the Afghans/Pashtun. \\nIn the 1980s, her young face on the cover of National Geographic embodied the strength, dignity and honor of the Afghan Pashtun women, who suffered for a decade at the hands of the Soviet invaders and Afghan communist puppets. \\nDuring both wars, Pakistan has profited from the Afghans’ suffering. After 9/11, the National Geographic editor/photographer located Sharbat Gula. He told her a lot of money had been made from the edition with her cover and what did she want. She did not want money. Sharbat Gula only wanted an education for her children and no bombardment of her village. She wanted education and peace without foreign invasion. \\nHer village has been bombarded by the U.S. and its puppets, her village’s water poisoned and her family has had to flee to Pakistan. Instead of honoring her, Pakistan imprisons her for not having the right papers. Also Pakistan punishes the Afghan Pashtun refugees because the Afghan Freedom fighters do not want Pakistan involved in peace negotiations. . The Afghan Freedom Fighters d o not want a repeat of the mistakes that occurred in the 1980s when Pakistan was involved in the peace talks between the Soviet Union and the Afghan Resistance. \\nSharbat Gula is again the face of the Afghan Pashtun women,. Despite the indignities of war, she keeps her honor and dignity. \\nPakistan needs to release her immediately. Perpetrators of war crimes committed against the Afghan Pashtun women need to be prosecuted and stopped. She is a victim. Sharbat Gula has human rights. The illegal war in Afghanistan must end now. Sharbat Gula has the right to live with dignity and security in her village in Afghanistan. She does not want to be forced to live in Pakistan. Enough of these greedy profiteers and this ugly war scape goating honorable Afghan Pashtun women like Sharbat Gula, who are the true national heroes. Sharbat Gula is an Afghan National Hero and not a criminal. The war criminals and war profiteers need to be imprisoned and not her. Free her now. \\nSincerely,'"}, "time": 1742628331.0872848}