{"duration": 0.08394169807434082, "input_args": {"text": "'Justin Peck stops short of calling it a protest dance, but his newest ballet, “The Times Are Racing,” is certainly of the moment. The dancers wear sneakers, and   and hoodies emblazoned with words like Unite, React, Act, Protest and Fight. (The costumes are by Humberto Leon for Opening Ceremony.) The electronic music is Dan Deacon’s     suite from “America,” a 2012 album written out of his frustration with the state of the country and the world. Mr. Peck, 29, started choreographing the dance before the presidential election, but after Donald J. Trump won, he said, the ballet changed course. A few days before its Thursday premiere at New York City Ballet, Mr. Peck, the company’s resident choreographer and a soloist  —   this time he even included a part for himself  —   spoke about the work, his love of tap and how his teenage obsession with the video game Dance Dance Revolution had not been in vain. Here are edited excerpts from that conversation. How did the political landscape shape this ballet?  We were working on this throughout the election. The day after the election was such an emotional and sobering moment. It felt like a turning point for the piece. Did the choreography change or become more focused after the election?  It changed. It’s a less optimistic piece than it could have been. But it’s also going back to the music. It’s such a cathartic piece, and I think the choreography and the arc of the whole ballet has that feeling of exhaustion and running in a way that doesn’t need to be spelled out too much. I feel people are going to be able to interpret it in whatever way they want to. How did the sneakers come in?  When I’m in sneakers, it changes my body carriage. I feel more in my own skin. I also think there’s less emphasis placed on line and accuracy and more freedom to dance with more energy and fullness and risk. I’ve done one piece with sneakers for L. A. Dance Project, and I really enjoyed working in that way and I wanted to explore it more at New York City Ballet. We have “[N. Y. Export:] Opus Jazz” and “West Side Story Suite,” and I’ve danced both. In this piece, you’re mixing tap with ballet and a little  ? It’s hard to describe. I would say you could even separate the tap influences: Rhythm tap and hoofing meets Fred Astaire   and Gene Kelly classical   movements meets ballet, which is definitely the backbone of the piece. And that meets   meets party dancing. But it’s mixed in the same way that Dan’s music is synthesized together. The ballet features a   number for you and Robert Fairchild. Savion Glover is one of your heroes, right? He is! The reason I started dancing in the first place was my dad took me to see “Bring In ’da Noise, Bring In ’da Funk” when I was 9. I was so enamored with his style and his athleticism and the intricacy of his tap choreography that I started training. Is the tap the reason you cast yourself in the dance? That was a big factor. I always really loved tap as an art form, and in this piece of music there was one section that is highly percussive and intricate. I felt the only way to express that through movement was using   techniques, and for me it was less about the sounds we were making and more about the physicality of the movement. It’s not on a lot of ballet dancers’ résumés to be able to tap in that way, and I knew Robbie had that ability as well. The duet also takes partial inspiration from when Robbie and I were roommates at the School of American Ballet. What happened? We were 17, and we got really into Dance Dance Revolution, the video game. We actually got a system for our dorms, and we started to play it obsessively, and we got really good and really in sync with our movement. We would play until superlate at night and then wake up the next morning with shin splints and not be able to go to class. [Laughs] I am loving this story.  I wanted it to almost be like we were both following along on the same Dance Dance Revolution video game level track. [In the game, standing players hit arrows with their feet in keeping with musical and visual cues.] That’s why the movement is completely identical. I love it when you go to an arcade and you see two people who are really good at that game and they’re moving completely together. I wanted to use it as the inspiration for this duet, too. Are there characters, loosely, in this ballet? Robbie is a standout protagonist figure. For Robbie’s role, his alternate is Ashly Isaacs. I don’t know if it’s a first time, but it certainly feels like it might be one of the first that there’s been a   principal role at New York City Ballet. She’s stepped in a few times, and she looks great. She’ll get to perform the ballet in the spring. Did you choose her for her tapping ability?  Yeah, that definitely needs to be checked off, but also she seems very suited to the role and it’s the exact same choreography  —   there’s no compromise in what she does when she performs it and I thought that was really cool. It’s amazing. Do you think Savion will see the ballet? Do you know him?  No. [Laughs] I think I met him once, but I don’t know if he knows who I am. I saw him perform last weekend at the Blue Note. He’s so good. He will just go for 45 minutes. This dance that Robbie and I do is, like, two minutes long, and we’re exhausted.'"}, "time": 1742628402.312986}