{"duration": 0.0465083122253418, "input_args": {"text": "'Anthony Weiner’s Alleged Teenaged Sexting Victim Pens SCATHING Open Letter To FBI Director Comey 786 Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nWith just a little over a week to go before election day, FBI Director James Comey took it upon himself to blatantly interfere with the process. \\nDuring a probe into Anthony Weiner’s sexting scandal, the FBI supposedly uncovered emails that may or may not (probably not) have something to do with Hillary Clinton’s use of a private email server, for which she has already been exonerated. Comey sent a vague letter to congress which he KNEW would start a shit-storm in the media, and now the race is closer than ever. And here Trump complains about a “rigged” election! \\nUnfortunately, while attempting to sway voters, Comey didn’t consider that there was someone else at the center of this — Anthony Weiner’s victim, who is only 16 years old. \\nShe was understandably upset and had a few words to say to the FBI director. You can read the entire letter on BuzzFeed , but here are a few excerpts: \\nI am the 15-year-old (now 16) who was the victim of Anthony Weiner. I now add you to the list of people who have victimized me. I told my story originally to protect other young girls that might be a victim of online predators. \\nYour letter to Congress has now brought this whole matter back into the media spotlight. Not even 10 minutes after being forensically interviewed with the FBI for seven hours, I received a phone call from a REPORTER asking for a statement. Why didn’t you communicate with the local FBI agents that I had just spoken to? They could have scheduled our interview sooner or scheduled a time to interview me later, or change locations of the interview. My neighborhood has been canvassed by reporters asking for details about me. \\n… \\nI thought your job as FBI Director was to protect me. I thought if I cooperated with your investigation, my identity as a minor would be kept secret. That is no longer the case. My family and I are barraged by reporters’ phone calls and emails. I have been even been blamed in a newspaper for causing Donald Trump to now be leading in some polls and costing Hillary the election. \\nAnthony Weiner is the abuser. Your letter helped that abuse to continue. How can I rebuild my life when you have made finding out my “story” the goal of every reporter? \\nShe signs the letter with, “Girl that lost faith in America.” \\nAnd that coming from a girl who is barely starting her life, but who is also approaching voting age is heartbreaking. \\nFeatured Image via Alex Wong/Getty Images Share this Article!'"}, "time": 1742628301.5136487}