{"duration": 0.019809961318969727, "input_args": {"text": "'posted by Eddie In a surprising twist to the Ebola outbreak story, the Liberian Government has accused the United States of purposely spreading the Ebola Virus in an attempt to test a weaponized form of the virus. An unfortunate unintended consequence. VERY REAL CONCERN OF A ZOMBIE OUTBREAK The crime against humanity is that victims of Ebola are now rising from the dead in this besieged African nation. Captured footage shows a man rising after mortally succumbing to the Ebola virus. The name of this victim is being withheld by the World Health Organization out of alleged privacy concerns. Some believe concerns for the safety of the Man’s. The family is the real reason for the embargo of his identity. It is believed the original form of the weaponized virus has mutated into what can only be described as a zombie virus. With Texas now struggling with an outbreak of Ebola, there is a fear of the undead evolving into a new form of an undocumented worker, and being a very deadly one at that. The State of Kansas is concerned not only about the Ebola outbreak of it’s neighbor to the South, but also is very concerned with regards to a resulting outbreak of Zombies. Sam Brownback, the Governor of Kansas, has issued an executive order declaring October “Zombie Awareness Month”. KANSAS ON HIGH ALERT OVER ZOMBIE OUTBREAK? The State of Kansas rests in a state of high alert over this very real concern of a zombie outbreak. Mailings of pamphlets are being sent out across Kansas warning its citizens how to prevent both Ebola and the resulting zombie attack. Note that this story is in its infant stage and is rapidly developing. It is expected that Ebola will overtake 5 million more victims in the next two months and left untreated will result in certain death. With this strain of the Ebola virus spawning zombies, it is unknown as to what catastrophe awaits the yet uninformed public. It is important to continue following this story in the media as to be better prepared for when this outbreak reaches your community. \\nsource:'"}, "time": 1742628486.479666}