{"duration": 0.12794065475463867, "input_args": {"text": "'RIO DE JANEIRO  —   The Olympics are as much about what warms the heart or initiates debate as who wins the medals. But what warms the heart or initiates debate can be a matter of perspective in a sprawling event that brings together more than 200 nations and territories. There was little division on Tuesday in the Olympic Stadium, when two runners  —   Abbey D’Agostino of the United States and Nikki Hamblin of New Zealand  —   offered a helping hand to each other after a collision in the 5, 000 meters and then urged each other on to the finish. “I mean, that girl is the Olympic spirit right there,” Hamblin said afterward, speaking to reporters about D’Agostino. But on Sunday in the women’s marathon, when the German twins and training partners Anna and Lisa Hahner decided  —   spontaneously, they insist  —   to join hands as they crossed the finish line deep in the pack and far from the medals, they quickly drew sharp criticism. German track and field officials accused them of publicity seeking and treating the Olympic marathon “like a fun run. ” This is not just a German point of view, of course, but it does reflect the range of expectations as athletes navigate the cultural norms that relate to competition and sportsmanship. The Egyptian judoka Islam El Shehaby, who refused to shake the hand of his Israeli opponent Or Sasson, was following his nation’s standards  —   one that Olympic officials expressly reject. He was ejected from the Games. There was no outcry, only amusement, when David Katoatau, an exuberant weight lifter from Kiribati, danced off stage on Monday with the goal of heightening awareness of the threat posed by climate change to his tiny nation in the central Pacific Ocean. The Hahner twins had no political agenda when they joined hands to end their race, but their move, to their surprise, was still polarizing. “Victory and medals are not the only goal,” Thomas Kurschilgen, sports director of the German Athletics Federation, said in an email on Tuesday. “Still, every athlete in the Olympic competitions should be motivated to demonstrate his or her best performance and aim for the best possible result. ” That approach, according to Kurschilgen, is what divides elite sport from   sport and what he thinks the Hahners failed to grasp. “Their main aim was to generate media attention,” he said. “That is what we criticize. ” The twins, who placed 81st and 82nd in the marathon, do not see it that way. Contacted on Monday, they initially declined to speak, but Anna Hahner later sent an email in which she said they had not planned on finishing    and had done their best individually. “In all the marathons we ran together before, there was a point in the race we had to split up,” Anna said. “This was also the case in the Olympic marathon. ” Anna said she started faster, and then Lisa’s group caught up with her at around the   mark, at which point Anna said they ran about three kilometers together. “But then I realized I couldn’t run this pace, and I had to let them go,” Anna said. “Lisa was always not far from me. After 40 kilometers, there was a turning point, and I knew, ‘Okay Anna, two kilometers to go to close the gap to Lisa.’ I invested all I had and 300 meters before the finish line, I was next to Lisa. It was a magical moment that we could finish this marathon together. We did not think about what we were doing. ” But Anna said the symbolism was not lost on either twin. “We trained the last four years to participate in this marathon,” she said. “Neither the time nor the position was what made us happy but to know that we did the best that was possible that day. ” And yet the sisters were well short of their best marathon performances. Anna’s personal best in the marathon is 2 hours 26 minutes 44 seconds. Lisa’s is 2:28. 39. In Rio, Anna finished in 2:45. 32, and Lisa in 2:45. 33 despite coming early to the Olympic city to acclimatize. Clearly, the large time gap between their previous performances and their Olympic performances made Kurschilgen and others only more convinced that they were not seeing the twins’ best effort. There is a school of thought at the Olympics and elsewhere that it can be better for an athlete’s profile and even their bottom line to lose memorably  —   however unintentionally  —   than to win routinely. D’Agostino and Hamblin would not have become global talking points on Tuesday if they had simply collided and soldiered on without interacting. Nor would the British runner Derek Redmond have become part of an “Olympic moment” if he had simply won his 400 semifinal at the 1992 Olympics instead of tearing his hamstring and insisting on continuing the race. His father came onto the track to assist him as he hobbled to the finish with the Barcelona crowd cheering him on. Even though Redmond was disqualified for receiving outside aid, the image and the memory were and remain powerful. It is the unexpected and uncalculated gesture that so often moves the masses most, no matter what the culture. “This is Olympism,” said Mary Wittenberg, former director of the New York City Marathon who has attended many Olympics. “Yes, athletes go as hard as they can to win the shiniest medals they can most of the time. We love that, and we want to see those medal dreams come true. That said, there are moments when it’s not all about that and most often, as in the case of the Hahners, it’s also because that’s not in the cards at a given event. So an athlete makes a conscious decision to make the most of the moment in a different way. ” It is worth noting that the Hahners were not the only twins to finish side by side on Sunday. Kim   and Kim   of North Korea finished 10th and 11th on Sunday in an identical time of 2:28. 36. No word from North Korea whether this was perceived officially or unofficially as an uncompetitive act.'"}, "time": 1742563988.161131}