{"duration": 1.6128003597259521, "input_args": {"text": "'By Lorraine Chow\\nEarth’s abundant inner heat, or geothermal energy, has incredible potential as a renewable energy source. For traditional geothermal projects, hot rocks produce steam for turbines. Over in Iceland, however, a consortium of researchers and companies want to dig much, much deeper into Earth’s crust in order to explore the renewable energy potential of molten magma.\\nThe Iceland Deep Drilling Project (IDDP) is drilling a 5-kilometer (3.1-mile) hole into old lava flows in the Reykjanes, a region in southwest Iceland filled with geothermal sites. Once drilling is complete by the end of 2016, the Nordic nation will be home to the hottest hole in the world with temperatures between 400 and 1,000 degrees Celsius (or 752-1,832 degrees Fahrenheit), according to New Scientist .\\nThis effort is being led by Icelandic energy companies such as Hitaveita Sudurnesja, Landsvirkjun and Orkuveita Reykjavíkur, as well as the National Energy Authority of Iceland.\\nSince Aug. 12, the IDDP’s rig—actually named “Thor” —has been drilling deep into a landward extension of the Mid-Atlantic Ridge, an underwater mountain range that extends above sea level through the center of Iceland.\\n“People have drilled into hard rock at this depth, but never before into a fluid system like this,” Albert Albertsson, assistant director of a geothermal energy company involved in the project, explained to New Scientist.\\nAt this depth, seawater that has penetrated the ocean bed has not only been superheated by magma, it’s also highly pressurized (more than 200 times atmospheric air pressure). The team expects to find water in the form of “ supercritical steam ,” aka “ dragon water ,” which is neither liquid nor steam but holds more heat energy than both.\\nCan ‘Dragon Water’ Power the Planet With Renewable Energy? https://t.co/P4wmMRVk61 @RenewablesNews @Good_Energy \\n— EcoWatch (@EcoWatch) November 6, 2015 \\n\\nAlbertsson said that a well capable of harnessing this steam has an energy capacity of 50 megawatts, about 10 times more than a conventional geothermal well. Theoretically, IDDP’s new well could power 50,000 homes compared to the 5,000 homes powered by a single geothermal well.\\n“If they can get supercritical steam in deep boreholes, that will make an order of magnitude difference to the amount of geothermal energy the wells can produce,” Arnar Guðmundsson from Invest in Iceland, a government agency that promotes energy development, told New Scientist.\\nIf this project this sounds a little dicey, as Motherboard explained, this isn’t the first time IDDP has tapped into Icelandic lava power:\\n“In 2009, an IDDP rig located in Krafla, northeast Iceland, accidentally struck a magma reservoir just over a mile underground. Excited about the prospects of new geothermal energy, the project partnered with Iceland’s National Power Company, and installed a perforated steel casing at the bottom of the well. This successfully allowed the flow of magma to create superheated, extremely pressurized steam at temperatures exceeding 800°F—at the time, a world record for geothermal heat.\\n“Power created by the Krafla borehole was never fed back into the grid, and the project was shuttered in 2012 after a critical valve needed repairing.”\\n“In the future, the success of this drilling and research project could lead to a revolution in the energy efficiency of high-temperature geothermal areas worldwide,” said Wilfred Elders, a professor emeritus of geology at the University of California, Riverside who was involved in an earlier IDDP project.\\nAccording to DeSmogBlog , New Zealand, Indonesia, the Philippines, the U.S. and Mexico already have commercial geothermal plants.\\nIceland, known for its numerous bubbling hot springs and geysers, already heats up to 90 percent of its homes and supplies about a third of its electricity with geothermal.\\nLorraine Chow is a reporter for EcoWatch. She tweets @lorrainelchow \\nSource: EcoWatch \\n'"}, "time": 1742564557.5707667}