{"duration": 0.038506269454956055, "input_args": {"text": "'RIO DE JANEIRO  —   The relics were arranged in a sphinxlike configuration, as in some type of ancient burial ground. Massimo Costantini, the coach of the United States table tennis team, called the formation “a sort of homage to the fallen. ” They appeared on the first day of the Olympics, in a far corner of the table tennis pavilion: 18 white balls, all of them crumpled or cracked, arranged ceremoniously in the center of a quartet of water bottles. It was a fitting symbol of the frustration that has festered at the tables this week at the Rio Games, where the table tennis balls are giving players fits. They do not bounce true, the players said. Their flight paths are unpredictable. And they frequently break. “I think this ball is very bad,” Li Ping of Qatar said after losing a match. The player who beat him, Dimitrij Ovtcharov of Germany, fumed that the official competition ball “makes it almost impossible to compete. ” Table tennis balls are capricious little things. Infinitesimal variations in size and imperceptible deviations in construction can have considerable ramifications for how they spin, fly and bounce. Casual players  —   people in suburban garages or fraternity houses  —   tend not to notice such details. But professionals obsess over them. The balls at the Olympics, then, are not the ones you find, cobwebbed, under the basement couch. They are not even the same balls used at the last Summer Games. Two years ago, the international federation that governs the sport switched the material of the official ball from celluloid to a different type of plastic. The federation also allowed the ball to be slightly larger. Some players are still struggling to adjust  —   and so, apparently, are some manufacturers. Many players criticized as subpar the specific quality of the balls from D. H. S. a Chinese equipment brand that became the official ball supplier after the 2012 Olympics in London. “I think many players are complaining because we have better balls,” said Timo Boll of Germany, who is at his fourth Olympics. “There are better balls on the market. We don’t use them at international tournaments. That’s a pity. ” The old celluloid balls were required to have a diameter of 39. 5 to 40. 5 millimeters the new ones can range from 40. 0 to 40. 6 millimeters. According to players, a bigger ball produces less speed and less spin. After the change, players had to recalibrate years of training and muscle memory. Those reliant on spin were disadvantaged more than athletic power hitters. The balls were changed shortly after the 2000 Olympics, increasing in size from 38 millimeters. Other past changes in equipment and rumors that more could be coming, like a rise in net height, have left players irked. “This is not good this is unprofessional,” Panagiotis Gionis of Greece said of the tinkering. “It’s your job. It affects you. Some players are destroyed about this. ” Gionis criticized the D. H. S. ball but was equally concerned about the lack of consistency from competition to competition. Different brands can be used in domestic leagues, regional tournaments and international competitions, and no two have felt alike in the past two years. “It’s like if you have to drive a different car than yours,” said Costantini, the United States coach, who was more concerned about this inconsistency than about the quality of any brand. “Maybe the brakes are not the same, the accelerating, and it takes some time to adjust. ” Players have to begin the adjustment process for the Olympics  —   the most prestigious competition in the sport  —   weeks or months before the Games to get comfortable with the ball. But that was tough to do this summer, some said, because of what they perceived as the poor quality of the D. H. S. ball. “We practiced with that ball months beforehand to get used to it, but you can never get used to it,” said Ovtcharov, who also said he felt the ball getting softer over the course of his games. (Certain competitions cycle multiple balls through a match, but not the Olympics.) Stefan Fegerl of Austria said: “This ball doesn’t jump so well. Many times it falls down very fast. When you hit them with the edge, maybe it’s broken. The quality is not good. ” In an interview Tuesday, Lou   the general manager of D. H. S. said he had not heard any complaints firsthand. Through an interpreter, Lou said the company was “quite satisfied” with its transition to the new ball. Still, he was sympathetic when informed of the concerns. He said the company was continuing research to make a better ball. “From one side, they give us information,” Lou said, “and from the other side, we improve the balls gradually. ” Thomas Weikert, the president of the federation that governs the sport, acknowledged in an interview that the balls used in the past two years had not been as good as they could be. But he said this was a symptom of the industry rather than of any individual company. “They’ve improved a lot,” Weikert said of the balls. “Let’s say it’s O. K. It’s not 100 percent. ” Lou and Weikert noted that some griping was expected. “If you use another ball, other players will complain,” Weikert said. To be sure, certain players seemed blissfully unaware of the complaints. Told about the multitude of players voicing frustrations with the ball, Paul Drinkhall of Britain smiled. “Did they lose?” he said. Boll, the German player, was eliminated in the fourth round of the singles tournament. The team competition begins Saturday. “I’m sure they want to produce now a better ball because they’re getting a lot of criticism,” Boll said. “It would have been nice if it was before the Olympic Games. ”'"}, "time": 1742628591.2943635}