{"duration": 0.015880584716796875, "input_args": {"text": "'Rep. Steve King ( ) blasted the angry left on Wednesday at the scene of a shooting earlier in the day that wounded House Majority Whip Steve Scalise ( ) an aide, and two Capitol Police. [“America has been divided,” King said, according to the Washington Post. “And the center of America is disappearing, and the violence is appearing in the streets, and it’s coming from the left. ”  Asked whether the shooting was politically motivated, he said he did not know why the gunman did what he did. However, King pointed at anger and demonstrations against Trump, according to the Post: King, in his remarks at the shooting scene, said it was impossible to separate the hyperpartisan climate in Washington  —   especially people protesting Trump  —   with Republican members of Congress being fired upon at a baseball practice. “The divisions within the country, people that can’t accept the results of the election that are determined to try to take this country down, take this organization down,” he said. “This city was filled up with demonstrations the day after the inauguration, where you couldn’t drive down the streets. And we’ve had demonstrations every week since then, sometimes different topics. ” King added: “We do need to focus on what’s happening to the culture in this country. ” The shooter has been identified as James T. Hodgkinson III, 66, of Belleville, Ill. by law enforcement officials. The shooting occurred early Wednesday morning at a park where Republican congressmen and their aides were practicing for an annual baseball charity game played against Democratic colleagues. Democrats were also practicing at the time, but in D. C. An FBI official told reporters at the scene that it was “too early to tell” if the GOP congressmen were targeted or not. Yet, a look at a Facebook page appearing to belong to Hodgkinson showed he was a Sen. Bernie Sanders ( ) supporter who bashed Trump several times and liked an   cartoon.'"}, "time": 1742628527.1332004}