{"duration": 0.11156606674194336, "input_args": {"text": "'The chairman of the House Permanent Committee on Intelligence told reporters at the Capitol Monday he has yet to see evidence of contacts between President Donald Trump’s campaign and individuals in the Russian government or part of its extensive network of affiliated persons. [“As of right now, we have no evidence, but we will continue to ask for evidence and look for evidence,” said Rep. Devin Nunes (R. .) who called the press conference to deal with a number of issues, including a New York Times report that the members of the Trump campaign were in contact with Russian intelligence and that he was pressured by the White House to call reporters to knock down the Times story. ”  Nunes said his committee had not concluded its probe into contact between Russian operatives and any of the presidential campaigns. “Not only the three Americans named in that story but also any Americans with the Russians. ” Trump’s national campaign chairman Paul Manafort was named in the Times report, but the other two individuals were not named. Manafort resigned from the Trump campaign Aug. 19, shortly after the Republican National Convention. The hauling of citizens before a congressional hearing based on media reports would bring back the days of McCarthyism, he said. “I am trying to be very careful,” he said. “We can’t have the government —  the U. S. government —    the Congress or another branch of the government chasing down American citizens, calling them before the Congress as if they are some sort of secret Russian agents,” he said. “That is what I am concerned about here —   that we go off on some witch hunt against American citizens just because they appear in a press story somewhere. ” The congressman said he has yet to see any sign that members of the Trump campaign or transition team broke any laws dealing with foreign governments. There were, however, contacts between the Trump camp and the Russians that were completely   he said. After President Barack Obama issued his Dec. 29 sanctions against Russia, retired Army Lt. Gen. Michael Flynn, then designated to serve as Trump’s National Security Adviser, spoke to Russian Ambassador Sergey Kislyak a number of times. Those conversations were wiretapped by the Department of Justice and transcripts of the conversations were given to media outlets. If anything, the FBI should focus on how a DOJ wiretap transcript that had to be approved by the classified Foreign Intelligence Surveillance Court went public, which is indisputably a crime, he said. Nunes said that even if Flynn discussed Obama’s December sanctions, he would have no problem —  even if Flynn told the Russians that the incoming Trump administration would ignore or ease that round of sanctions. Flynn has maintained that he did not discuss the sanctions. “If the discussions occurred around ensuring that there was no overreaction by the Russian government, so that the new administration could do like all the other previous administrations, who thought they could work with Putin, all three have been wrong,” Nunes said. “If that is just what General Flynn did, to try and keep the lines of communications open,” he said. “That did us a big favor. ” This comment incensed CNN reporter Jim Sciutto. Sciutto called out to the congressman: “Do you want an administration negotiating against another? Isn’t that one U. S. administration negotiating —  ” The congressman subdued a smirk as he cut Sciutto off, saying, “You want to investigate the Logan Act? You’re a Logan Act guy?” The 1799 Logan Act bans American citizens from negotiating with a foreign power without the approval of the federal government. Sciutto: “I didn’t mention the Logan Act, I’m just saying that if one administration —  ” Nunes cut him off again: “The Logan Act is ridiculous. You guys all know that. ” No one has ever been prosecuted for violating the Logan Act. The other contentious    was between the chairman and reporters, who kept insisting that there was something nefarious about the White House asking Nunes to talk to a reporter about the New York Times story. “It was kind of an odd story, I thought,” the congressman said. CNN reporter Manu Raju asked Nunes if he felt that his integrity was compromised when he spoke to the reporter at the behest of the White House. Nunes said he was not compromised at all. “If the White House asked me to talk to a reporter —     it was one reporter —  if the White House asked me to talk to you? Would that be OK or not OK?” Raju was silent for a long moment, then asked, “What is your response to that?” Raju: “You’re investigating this matter, the White House is urging you to knock down these stories that are leaving questions —  ” Nunes: “That doesn’t happen. That absolutely doesn’t happen. ” Following the press conference, Nunes met with other Republican members of the intelligence committee. As the committee moves forward with its investigation into Russian involvement in the 2016 election cycle, he pledged to hold regular press availabilities.'"}, "time": 1742561903.3670704}