{"duration": 0.047444820404052734, "input_args": {"text": "'By Robert Franek on Sun, Oct 30th, 2016 at 9:01 am Imagine if working to end rape culture were treated with the same attention as Hillary Clinton’s emails. This is one fire that is burning strong and is a true threat to personal and public safety, security, and well-being. Share on Twitter Print This Post \\nThe following post, written by The Rev. Robert A. Franek, is a part of Politicus Policy Discussion, in which writers draw connections between real lives and public policy. \\nEven after months and months of coverage blown out of proportion and at great expense to the public in dollars, psychic stress, and issue coverage ,it seems all one has to do is put Hillary Clinton and emails together in the same sentence with claims of lying and threatening national security and pandemonium continues to break loose throughout the mass media and social media worlds. And yet despite multiple investigations and repeated explanations the pandemonium persists, so much so that every time Republicans stir up some smoke the media assumes there must be a blazing fire. And sadly this is not going away anytime soon, as Republicans are promising more sham investigations in lieu of actually governing as Sarah Jones reported. \\nRepublicans are already planning how to avoid being grown ups who do their jobs if Hillary Clinton is elected president. Yes, there will be more toy-throwing and tantrums and best of all for the party of fiscal humiliations, more wasteful spending on political witch hunts. – Sarah Jones \\nMeanwhile, women continue to come forward with painful, heartbreaking stories of Donald Trump’s sexual harassment and assault. Yet, instead of being portrayed as survivors who have finally had enough of the Republican presidential nominee and his lies and as women who have the strength and courage to go public with their stories, they are being made into opportunistic victims and challenged for not coming forward sooner much sooner. Woefully, no mention is made of the many intersecting reasons that lead many women (and men) not to report these crimes, including that this is the only time when the victim is placed on trial. \\nAfter walking her readers through one incident of Donald Trump’s public sexual humiliation of a woman for revenge , Sarah Jones makes the following observation: \\nIf there is any good to come out of the total crapfest of the Trump candidacy, perhaps it is a raised awareness that women are people and that this kind of thing is horrific but it’s not all Trump’s fault. It’s the culture’s fault because it takes a willing audience to successfully publicly sexually shame a woman. \\nShe is right. Donald Trump is despicable. Still, there is cultural culpability in the perpetuation of rape culture where women are treated as objects, forced into silence, and placed on trial for their assailant’s crimes. \\nThis must change. \\nIt is unacceptable in a country that places such a high value on freedom that so many are not free from sexual harassment, assault, exploitation, and humiliation. More it is appalling that such behavior is often cheered, unchallenged, and dismissed. It is also inexcusable that survivors face unparalleled levels of scrutiny when they do finally come forward. \\nIt is also beyond tragic that people of faith who read the first chapter of Genesis can’t bear out the implications of men and women being created simultaneously and bearing equally the divine image. \\nSupposed Christian values champion and Republican Vice Presidential nominee, Mike Pence is more upset over an article he didn’t read regarding voter suppression efforts by the Trump campaign than any of the horrifying things Donald Trump has said including bragging about sexual assault. \\nThese are not Christian values nor are they values any civil society should hold. Failing to call out Donald Trump’s abhorrent behavior and speech is beyond deplorable. Additionally, supporting candidates like Donald Trump and Mike Pence gives validity to their wretched views and is especially shocking when done by people of faith and “family values.” \\nAs a society, we must challenge the pervasive and systemic sexism and misogyny that persists in our culture. As much as we need changes in our laws (and lawmakers!) at every level of government to reflect the equality and humanity of women, we need a moral revival in our collective conscience as a nation that decries every facet of rape culture from how we raise our children to the victim blaming and shaming that happens each time a survivor goes public with their story. \\nImagine if working to end rape culture were treated with the same attention as Hillary Clinton’s emails. This is one fire that is burning strong and is a true threat to personal and public safety, security, and well-being. \\nEmail Pandemonium and the Perpetuation of Rape Culture added by Robert Franek on Sun, Oct 30th, 2016'"}, "time": 1742628512.1004357}