{"duration": 0.16096210479736328, "input_args": {"text": "\"Ho'oponopono: Healing For Ourselves & Our World Nov 14, 2016 0 0 \\nWe live in a world that is guided by the universal law of cause and effect. What we as individuals, groups of people, communities, societies and countries put out into the world through our thoughts, manifests. What we put into our collective consciousness has an effect. The cause being the thought. Everything is energy. All things have an energetic effect. We are all responsible for the shape of our lives and our world. We are all connected and bound together through this principle. When we hurt one another, whether intentionally or not, it is truly important for us to find forgiveness and healing. “I am sorry. Please forgive me. I love you. Thank you.” \\nThis is Ho’oponopono. These four sentences. It is a healing tool we can utilize for forgiveness. At this time, we may offer it to our newly elected world leaders, friends, family or a situation such as the turbulent US presidential election. For those of us unfamiliar with Ho’oponopono, these four sentences offered to both Hillary Clinton and Donald Trump, as an example, may feel like an instant trigger of built up internal emotions as many people have been going through anger, fear, hurt, confusion, and sadness both during and after this election. This healing modality can help take us from those feelings to feelings of deep forgiveness, acceptance, love and peace. \\n“Forgiveness does not change the past, but it does enlarge the future.” – Paul Boese \\nIf there is a need to heal hurtful differences you have had with others around the issue of this election, then you are in right the place right now by reading this piece. What is Ho’oponopono? \\nHo’oponopono is the Hawaiian ritual of forgiveness, and it belongs to an ancient system of teachings called Huna (Hu=Knowledge, na=represents Wisdom). The Hawaiian islands also go by ‘The Land of Aloha’, the land of love. It is in this essence and spirit of Aloha that we find Ho’oponopono. \\nWe all share a common path. Along that path, there is only one great universal power that accompanies us, and that is the power of unconditional love. It is the essence of God, and the place where compassion and unity spring forth. Ho’oponopono also means “compassion in action”. It helps us move past the duality behind good and evil, which is where we become separate from one another through judgment and condemnation. Through 4 simple sentences, Ho’oponopono can bring us to inner peace, harmony and unity. It offers us a solution to solving a problem while returning us to our divine plan. \\nA paradigm shift: “I am sorry. Please forgive me. I love you. Thank you.” \\n“Ho’oponopono is a spiritual-soul method of purification that cleanses us from fears and worries, destructive relationship patterns, and any religious dogmas and paradigms that oppose our personal and spiritual development. It cleans out the blockages in our thoughts and cell structure, for our thoughts are made manifest in our body. This is the paradigm change.” \\nWhen we notice disturbances in our harmony and thought process because of a person, event or situation, then we can take this conflict and make a Ho’oponopono: I’m sorry (add the person’s name). We come to a stillness, and connect within our being. We contemplate, recognize and accept the problem, and ask for support through courage and peace. Please forgive me. We view the problem and all of its nuances, and we go within our own heart to seek out any part we may share in the problem. We take on 100% responsibility for the existence of the problem within us, another and our world. (100% responsibility=100% power). This could, for example, be in the form of a past experience where we have been hurt, and we are thus intensifying the current situation with the past. Perhaps we ourselves have made a judgement that has contributed to the conflict. These are all examples of things that require healing from within. I love you. Forgiveness takes place unconditionally, and we pardon ourselves and others. Thank you. With these words we express our faith and trust, and we let go. A prayer of gratitude may be offered to end. \\n“If we can accept that we are the sum total of all past thoughts, emotions, words, deeds and actions and that our present lives and choices are colored or shaded by this memory bank of the past, then we begin to see how a process of correcting or setting aright can change lives, our families and our society.” – Morrnah Nalamaku Simeona \\nIt has been through Dr. Ihaleakala Hew Len, who took over the leadership of the Foundation of I Institute, that Ho’oponopono became known throughout the world. \\nHe spent 4 years working in the psychiatric department of the state prison in Hawaii, which had conditions described as “the hell”. Thirty prisoners were confined there. There was a chronic shortage of security and staff. Many employees put in their notice as soon as possible after beginning employment, and even handcuffed prisoners were known to inflict violence upon staff. \\nWhile Dr. Hew Len worked there, he never met with a single prisoner. Instead, he spent his days in his office reading their case reports several times daily. With each prisoner’s report, he looked inward, and asked himself what darkness, negativity, power and hatefulness could possibly be within him that it too could be in another, and thus exist in his world. When he found something within himself, he did a Ho’oponopono. \\nAfter 1.5 years, the atmosphere and mood of the prison hospital had completely altered. After 18 months, none of the prisoners needed to wear handcuffs, and they walked freely. People came happily to work, and the illnesses declined. Therapeutic conversations could then be held with the inmates, and after 4 years all of the inmates, except for 2, were completely cured. The institution closed. \\nHow was this possible? Through Ho’oponopono, Dr. Hew Len worked to continually cleanse his own heart, and take 100% responsibility for the existence of the prisoners in his life. \\nThis study has been well documented, and Ho’oponopono is now an acknowledged therapy in the USA. There are also more than 50 studies for forgiveness at the diplomatic level. \\n“You are today where your thoughts have brought you, and tomorrow you will be where your thoughts will bring you.” – James Allen \\nAnother form to do the Ho’oponopono is to begin with I love you for unification at the beginning: “Before the sun goes down, forgive.”– Hawaiian Proverb \\nPlease, take the time to say it aloud. Some people have reported that it has had a miraculous effect when they even whispered it. Looking into your own eyes in a mirror while saying those 4 healing sentences can also be quite a testament to it’s extraordinary effect. \\n“Forgiveness is not a one-time thing, forgiveness is a lifestyle.” – Dr. Martin Luther King \\nIf we all practice Ho’oponopono, look within, forgive, heal and love, then perhaps we can begin to see a shift in our lives as well as in our governments. Through cleansing what we have witnessed during this election season, there is hope for a deep shift within and without. It’s time to love ourselves and each other more. We all need more love. Let’s open ourselves to Ho’oponopono as a way to heal our inner and outer world. \\nDeepest love and appreciation to Ulrich E. Dupree for writing the book, ” Ho’oponopono: The Hawaiian Forgiveness Ritual As The Key To Your Life’s Fulfillment”. This little book has been with me for 2 years now. Thus, a lot of the information I have shared in this article has come from it. I am grateful for the balance, peace and healing that it continues to bring into my life. \\nThis is the website of Dr. Ihaleakalal Hew Len. \\nTo read testimonials of peoples’ experiences during and after Ho’oponopono, click here . \\nFinally, Aloha International has a wonderful list of books and resources (some free) to help understand more about the Huna healing art of Hawaii and Hawaiian Shamanism. \\nIf you have other resources or references that may help people heal through Ho’oponopono and Huna, please leave a link in the comment section for us to all access and, thus, from which we can continue to heal and grow. \\nPeace begins with me. I am a part of the Universe. When I change, the world changes too. Peace begins with each and every one of us. \\n“There is only one corner of the Universe you can be sure of improving, and that’s your own self.” – Aldous Huxley \\nAloha, ‘I see the divine in you, and I see the divine in myself.’ May we all find the healing we need, and may we all treat ourselves and others with respect, dignity, compassion, acceptance and love. When we heal ourselves, we heal the world. Peace be with me, and peace be with you. \\nUlonda Faye is a certified wellness practitioner, holistic esthetician, and Rejuv Miracles Practitioner. Based in Santa Fe, New Mexico, she offers online and in-person education in holistic skincare, self-love, beauty rituals, and life coaching.\""}, "time": 1742563278.5429196}