{"duration": 0.09877705574035645, "input_args": {"text": "'Posted on November 4, 2016 by DavidSwanson \\nIn a time of division and disagreement, when people who all agree on something important sometimes spend more time bickering with each other than working on their collective cause, is it possible to craft an agenda that brings them together and adds to their numbers? \\nIt turns out, somewhat to my surprise, the answer is yes. \\nI discovered this by creating a petition that has very quickly been endorsed by RootsAction, the Future of Freedom Foundation, World Beyond War, the Libertarian Institute, DailyKos, Black Vietnam Veterans of Atlanta, Progressive Democrats of America, Veterans For Peace Chicago Chapter, Nuclear Age Peace Foundation, Code Pink, Massachusetts Peace Action, Maryland United for Peace & Justice, Upstate Ground the Drones and End the Wars, Pax Christi Seed Planters, The War and Law League, Environmentalists Against War, the PDA Reno Chapter, Voters Occupy, Bryn Mawr Peace Coalition, Vietnam Echos, Spokane Veterans for Peace, Benedictines for Peace of Erie PA, Tyneside East Timor Solidarity, Palouse Peace Coalition, Helfenstein Soup Council, Timothy Dawkins El Project, Green Party of Collin County, Brian Boortz Public Relations, A Green Road, We The People for Democracy, Peaceworkers of San Francisco CA, Green Party of Spokane County, Montrose Peace Vigil, Ecumenical Peace Institute, Pax Christi Southern California, Veteran for Peace 72, Peaceful Skies, Granny Peace Brigade Philadelphia, The Clueit Foundation, Office of the Americas, Veterans For Peace of Western Pennsylvania, Presentation Sisters Justice Commission, Women Against War, Farmington Maine Friends Meeting, Secular Student Alliance at LaGuardia Community College, Faith & Social Justice Alliance Dayton Ohio, The Oracle Institute & Peace Pentagon HUB, Peace Action Maine, Mt. Diablo Peace and Justice Center, Northeast Philly for Peace & Justice, Citizens International, National Department of Peacebuilding Committee through the Peace, White Rabbit Grove RDNA, North American Climate Conservation and Environment, The Grey Nuns of the Sacred Heart, Colonie des Pionniers de Developpement, Malu ‘Aina Center for Nonviolent Education & Action, the Carpe Diem Voice, Women’s International League for Peace and Freedom Corvallis, Mindfulness in Education, Brandywine Peace Community, Article V Convention for Our Children’s Future, and the Liberty Tree Foundation for the Democratic Revolution. \\nYes, some of those groups I’ve never heard of. A few of them may consist of three guys with misspelled signs who’ve been standing on a lonely street corner so long their town has planted bushes around them. But that’s sort of the point. A unifying effort should revive old organizations and give birth to new ones. It should also be uncomfortably large, bringing together people who want completely different policies on other issues but agree on this one. \\nSo, what is it that the above organizations and 17,241 individuals thus far agree on? This: \\nTell the next president: No more war! \\nPlease sign this petition to the 45th President of the United States: \\nWe call on you to end perpetual war by the United States Government. As signers of this petition, we commit ourselves to building nonviolent pressure to end continual U.S. warfare. We also reject our country’s bloated military spending and massive arms sales that make the USA the world’s leading arms trafficker by a huge margin. \\nSign as organization for which you are authorized to sign . \\nImportantly, this is a statement to whoever becomes U.S. president next year. It might be someone you considered a lesser evil or a wonderful national leader. It might be someone you believed would adopt a peaceful policy without any public pressure required. Or it might be someone you recognized would require a massive movement to restrain them from destroying the earth. It doesn’t matter. You believe that representative government requires that people communicate how they want to be represented. You believe that peace is possible and preferable. You are in that strong majority of the U.S. public that believes the wars of the past 15 years have made us less safe, and you want to end them. \\nAlso importantly — for both better and worse — this petition avoids the details of any particular war. Once a particular war is mentioned, many people expect a petition to be fairly lengthy, to list all the causes of the war, to mention all the criminals and profiteers on every side of the war, to stipulate exact relative levels of blame for each party involved, and to advocate for particular policies aimed at establishing justice. Yes, some of that will be necessary work. But it is also critical that we confront the problem illustrated by the sheer number of U.S. wars now raging and by the evil industry of weapons dealing that fuels so many sides of so many wars around the world. \\nIf the U.S. and lesser arms dealers can be brought to abandon their deadly trade, if the wars can be ended and resisted, each in its turn, opportunities and resources will open up for positive approaches. But clearly the first two steps are (1) recognizing we have a problem, and (2) ceasing to make it worse. The panicked cries of two years ago to “Do something!” about ISIS (where “something” meant: bomb people) has predictably (and many of us did predict it) made everything worse. And the general public, not just the full-time activists, knows it . \\nThere will be new opportunities to expand this coalition post-election and post-inauguration. But we should not miss the opportunity to spread it and expand it and make it known now as a movement of nonpartisan principled advocacy for peace. This entry was posted in General . Bookmark the permalink .'"}, "time": 1742562336.306811}