{"duration": 0.2325899600982666, "input_args": {"text": "'SAN FRANCISCO  —   Sitting in a basement office that she rents by the hour, Shannon Coulter ticks off the activities she gave up in defiance of President Donald J. Trump: renting movies with her husband on Amazon, and shopping at Nordstrom, Macy’s and other retailers that sell Ivanka Trump’s products. A Nordstrom bag sat on a nearby table. It represents a victory lap of sorts for Ms. Coulter, who has almost   spearheaded a retail revolt against the president and his family. She was wearing a new silver Elizabeth and James lariat necklace purchased at the department store soon after it scrubbed Ms. Trump’s name from its website. “The goal,” Ms. Coulter said, “came originally from a place of really wanting to shop the stores we loved again with a clear conscience. ” It’s been a wild ride these past few months for Ms. Coulter, who runs her shoestring movement from her home, or from cheerfully decorated work spaces like this one  —   surrounded by   furniture, clam chairs and decorative pillows that feel more Silicon Valley than   war room. Enraged by a video that emerged last October of Mr. Trump bragging about sexually assaulting women, Ms. Coulter began a boycott of any sort of product connected to Mr. Trump. At first, it was just a tweet  —   a list she had compiled of companies that sold Trump products  —   but the ember quickly turned into a    blaze. Thousands of people have contacted the stores Ms. Coulter has on her boycott list, including Macy’s and Amazon. Retailers including Nordstrom, Neiman Marcus and T. J. Maxx have backed away from products connected to Ms. Trump, the president’s oldest daughter, since Ms. Coulter’s efforts began. A herd of activists and celebrities, including the feminist writer Gloria Steinem, the Olympic diver Greg Louganis and the actress Lucy Lawless of “Xena: Warrior Princess,” have expressed support. The attention has transformed Ms. Coulter, 45, a digital marketing specialist, into the unlikely general of the digital army now supporting her campaign, Grab Your Wallet. “People describe me as an activist in media coverage, I don’t know who they’re talking about,” she said. “I’ve never done anything this organized or structured or purposeful. ” The new role has taken up much of her time, and has made her the target of criticism and attacks from Trump supporters. She’s lost count of how many times she has been called a “bully” or a “disgrace. ” The abuse gets more menacing with each victory a recent email included her mother’s name in the subject line, with threats to publish more of her personal information. In the latest twist, the boycott has drawn Ms. Coulter, a   progressive liberal, into a growing debate over whether targeting Ms. Trump is sexist. And she said she worries that people will think she is profiting from the venture. Ms. Coulter was particularly upset when a knockoff “Grab Your Wallet” group sold clothing and other merchandise on Facebook. “We don’t even have a   we don’t have stickers, nothing,” she said, adding that she does not accept compensation from companies, or donations. “I don’t think either of us envisioned that some of the things that have happened would happen,” said Sue Atencio, who helped Ms. Coulter get the site started. In many ways, Ms. Coulter has embraced her new position. She answers emails at all hours and scours Twitter for tips on companies to add, or remove, from the boycott list. Then there are the phone calls  —   lots and lots of phone calls  —   from angry Trump supporters or journalists or the companies that want to get off her list. There is no doubt that it has changed her life. She doesn’t sleep or socialize as often as she used to. Most of her work on Grab Your Wallet is done after she eats dinner with her husband, taking up what free time she has. “She went underground, basically,” said Amie Penwell, a fellow San Francisco resident who hasn’t seen much of her friend of seven years recently. The negative attention has made Ms. Coulter careful about her privacy. She insisted on meeting at the work space for an interview, to avoid having a reporter at her home, out of fear that it could be targeted. She would not let her husband, whom she met online in 2010, be interviewed. Born in Indiana, Ms. Coulter studied journalism at Penn State. She said she began her career by “piggybacking” on the Bay Area’s technology boom, helping   with their email marketing. A year ago she started her own agency, DoubleKnown, which helps executives and small businesses build their online presence through blog posts, social media feeds and other digital tools. The company has one other employee and a handful of education and technology clients, but has stopped taking on new accounts since Grab Your Wallet took off. Political activism has not been a big part of Ms. Coulter’s life since college, when she spoke at a rally raising awareness about violence against women. Her most recent organized effort came after the shooting at Umpqua Community College in Oregon in 2015, when she circulated a list of lawmakers who had voted against tougher gun control measures. “Maybe that gave me a taste of what something like this would be like,” she said, describing herself as a chronic list maker. “I like the efficiency of them. ” After becoming incensed by the video, Ms. Coulter began searching retailers’ websites for   products and collecting the names on a spreadsheet. Wondering who else might be interested in a boycott, she looked at Twitter, and found Ms. Atencio, who had tweeted “fashion not fascism. ”Ms. Coulter contacted her and suggested they announce the boycott together. Since then, most of the work has fallen to Ms. Coulter, though she refers to Ms. Atencio as her “spiritual guide” and sounding board. Ms. Atencio, 59, sees herself as the less visible half of a musical duo. “I feel like I’m the Garfunkel and Shannon is Paul Simon,” Ms. Atencio said. Grab Your Wallet now includes a list of places to shop and not shop, and a short script for people who want to call companies to complain. As many as 32, 000 people visit her site in an hour, Ms. Coulter said. When the women’s marches took place across the country in January, 350, 000 people arrived during a   period. In early February, Nordstrom and Neiman Marcus removed Ms. Trump’s name from their websites. Employees at T. J. Maxx and Marshalls were instructed not to display Ivanka Trump products and to throw her signs in the trash. None of the retailers credited Grab Your Wallet with their decision  —   the department stores blamed poor sales  —   and it is not possible to know to what degree Ms. Coulter and her followers have influenced the companies’ decision making. But in the waning days of January,   complaints, many of which mentioned Grab Your Wallet, were Nordstrom’s most common customer feedback, according to a person with direct knowledge who was not authorized to speak publicly. Nordstrom said it did not have “specific numbers” on the number of customers it had heard from. “I attribute it directly to the Muslim ban,” Ms. Coulter said, referring to the executive order on immigration that Mr. Trump issued on Jan. 27. “I can see when the numbers spike when certain news events happen. ” Monitoring those spikes, updating her list and responding to emails, tweets and press inquiries have become Ms. Coulter’s second   job. “My life is so completely here,” she said, gesturing to her MacBook, “that it all just sort of overlaps and is an endless stream of emails and tweets and Facebook posts. ” She does get some help from volunteers, like the woman who helps run the legitimate Grab Your Wallet Facebook group, which has more than 12, 000 members. But for the most part, Ms. Coulter is on her own. That means the threats and negative attention are also directed largely at her. People ask her why she’s “attacking another woman,” or call her a bully. People like the Fox host Jeanine Pirro have argued that Ms. Trump’s brand has nothing to do with the White House, and that she is being unjustly targeted. Defenders also point to a proposed maternity policy that Ms. Trump developed with her father’s campaign, and her brand’s hashtag, WomenWhoWork, as examples of how she promotes women. “We have to stop destroying women based on the men in their lives,” Ms. Pirro said during a recent episode of her show. S. E. Cupp, a conservative author and commentator, stopped short of calling the boycott of Ms. Trump’s products sexist. But in an email, Ms. Cupp said that it seemed “misdirected. ” “I’m never a fan of going after the kids, grown or not, of presidents,” she said. “Nor does it feel consistent with the   argument  —   that he’s ‘ ’  —   to economically punish his daughter, a working wife and mother. ” A spokesman for Ms. Trump’s brand declined to make someone at the company available for an interview. In a statement, the company said it had been “swept into the political fray, becoming collateral damage in others’ efforts to advance agendas unrelated to what we do. ” Ms. Coulter finds such comments perplexing. She pointed out that Ms. Trump moved to Washington and has taken on an informal advisory role in the White House. She frequently sits in on her father’s meetings with foreign leaders. Ms. Trump’s husband, the real estate developer Jared Kushner, is a top adviser to President Trump. In addition, Ms. Coulter said, Ms. Trump played a prominent role in the presidential campaign. “Someone who passionately campaigned for a man who likes to grab women by the genitals will never convince me that she’s on the side of women,” she said. “Ever. ” Ms. Steinem also said that Ms. Trump was fair game, particularly after the election, when it can no longer be argued that she is just doing her “filial duty” on the campaign trail. “It’s appropriate to boycott her not because he is her father,” Ms. Steinem said, “but because she supports his policies. ” Ms. Steinem specifically faulted Ms. Trump’s proposed   policy for its exclusion of fathers and   mothers. Despite the long hours, Ms. Coulter said she could continue running Grab Your Wallet indefinitely. She’s considering turning the campaign into a nonprofit and running it full time, and is struggling to figure out what to do with her fledgling business. “I’m trying to understand what the right next step is,” she said. “I think as long as he’s in office, this will be alive. ”'"}, "time": 1742562083.903195}