{"duration": 0.09473156929016113, "input_args": {"text": "'By Justin Gardner\\nEstablishment figures on the left and right, such as Marco Rubio , are beginning to publicly fret about Wikileaks and what it could do to them. For now, the attention is on Hillary Clinton, whose corruption and true positions have been exposed on a number of issues .\\nClinton’s long career in the highest levels of government has given Wikileaks plenty of material to publish, while Donald Trump’s character as an arrogant woman-groper is being revealed from his time in the entertainment business.\\nJulian Assange said he does have some information about Trump, but there is a strange reality there:\\n“I mean, it’s from a point of view of an investigative journalist organization like WikiLeaks, the problem with the Trump campaign is it’s actually hard for us to publish much more controversial material than what comes out of Donald Trump’s mouth every second day,” Assange said.\\nThe horrible prospect of Trump or Clinton – both highly disliked by the populace – becoming president is the result of a system that is indeed rigged into a two-party dictatorship with the illusion of choice. Ben Swann explains some of it here .\\nOne of the more worrying revelations – or should we say, “confirmations” – from the Podesta Emails is Clinton’s allegiance to the Israeli lobby . Her top foreign policy aide reminded her not to say anything publicly to offend “Bibi,” and she wrote a letter against the BDS (Boycott, Divestment and Sanctions) against Israel on behalf of her mega-donor, Haim Saban.\\nThis allegiance to the Israeli lobby means that Clinton’s position on the Israeli-Palestinian conflict will largely echo that of Israel’s government, including its settlements on Palestinian lands and its treatment of Gaza as a giant prison camp.\\nFor decades, various presidents have claimed to be working on “peace accords” with the Israelis and Palestinians, while the U.S. military-industrial complex reaps billions from Israel’s militarism and use of U.S.-made weapons in repeated Gaza massacres.\\nWhy wage peace when war is so profitable, in the monetary sense and in the enablement of absolute State power?\\nIn one email, we see the kind of deceit presidents will engage in to maintain the narrative of “pursuing peace.”\\nFrom MondoWeiss :\\n“ Here’s the context. In a March 2015 email, right after Netanyahu’s victory in the Israeli election, Clinton foreign policy aide Jake Sullivan passed along a Times article in which Netanyahu offered a mild apology for his racist election-eve warning to Jewish voters that Palestinians were coming out to the polls “in droves,” and in which he flipflopped on his promise that no Palestinian state would be established on his watch. Per the Times: \\nThe two-state solution “remains our goal today, because it is the only way to secure Israel’s future as a Jewish and democratic state,” [Netanyahu] added. \\nSullivan comments [from hacked Podesta emails]: \\nUnsurprisingly, Pragmatic Bibi makes an appearance. \\nClinton steps right in: This is an opening that should be exploited. A Potemkin process is better than nothing. ” For those who many not be familiar with the word, “Potemkin” or Potemkin village means constructing something to deceive others into thinking a situation is better than it really is. Merriam-Webster says, “especially one presented for the purpose or propaganda.”\\nAs Weiss points out, we’ve had a Potemkin process for 20 years already, so Clinton would merely continue using events to perpetuate the false hope of a “peace accord.”\\nMichael Omer-Man, former news desk manager for the Jerusalem Post, had strong words for Clinton :\\n“It’s hard to imagine a more troubling statement about Israel/Palestine from a politician who will in all likelihood be the next president of the United States, even if it represents only part of her thinking on the region…\\nwhen American politicians like Hillary Clinton say that the façade of a peace process is better than no process, they mean it is better for the United States and Israel, not for Palestinians. A Potemkin peace process expressly means maintaining the status quo of occupation and oppression while neutralizing any consequences Israel might face for its actions.”\\nFor establishment figures like Hillary Clinton, the illusion of a peace process is more important than actually pursuing peace. Maintaining the narrative while profiting from conflict is the modus operandi of the two-party dictatorship.\\nSource: The Free Thought Project \\n'"}, "time": 1742563562.5283284}