{"duration": 0.056258440017700195, "input_args": {"text": "'Sam Sifton emails readers of Cooking five days a week to talk about food and suggest recipes. That email also appears here. To receive it in your inbox, register here. Good morning. Here’s the plan for the week, not including breakfast because I’m on a farina kick and that’s not to everyone’s taste, and not including lunch because really when it comes to the midday hours you should get out of the office or the house and walk around. If you get something to eat, great, but the most important thing is to be outside where the stories are. There’s nothing happening at your desk but a screen. Anyway! I’m thinking chicken paprikash for dinner tonight, a nod toward the coming fall, served over buttery egg noodles, with green beans on the side. If you have the time, make an apple cake for dessert. On Monday night, it would be great to eat falafel, but that means you’ll need to get and soak some dried chickpeas this evening. Fry them on Monday, and eat cut watermelon for dessert. Then on Tuesday, you could simmer Melissa Clark’s outstanding recipe for a smoky fish chowder into existence, serve it with soda crackers, and offer ice cream for dessert. (You can make your own. We’ve been grooving on Gifford’s recently, for what that’s worth.) Wednesday, maybe try Mark Bittman’s recipe for scrambled tofu with tomatoes, scallions and soy sauce? (In keeping with Tejal Rao’s brilliant idea to pair vegan ranch dressing with grilled lamb, we’re thinking you could add some ground pork to the recipe and be happy indeed.) Dessert:   oranges, sliced into eighths. Thursday night is dealer’s choice: Either make Julia Moskin’s recipe for avocado fattoush with mint vinaigrette or choose one from our collection of recipes for healthy weeknight dinners. And then for dessert, try the chef Seamus Mullen’s recipe for peaches, pistachios, honey and ricotta. Finally, maybe you’re looking to button up your plans for Rosh Hashana, which starts on Oct. 2? It’s never a good idea to cook something for the first time for a holiday. So for Friday night dinner (Shabbat, don’t you know!) perhaps you could give Melissa’s new recipe for chicken with figs a run? Or try David Tanis’s new recipe for baked spinach rice? If those don’t suit you, we have an entire recipe collection devoted to the High Holy Days. Other ideas for what to cook this weekend are on our site and apps. Save the recipes you like to your recipe box and rate them when you’re done cooking. You can and ought to leave notes on recipes if you have a shortcut or substitution to suggest the conversation among us helps us all. If you run into technical trouble, please ask for help: cookingcare@nytimes. com. (If your issues are more metaphysical, or if you have a complaint about tone or content, or if you want to gush or have suggestions about what we might be doing more or less of, you can reach me at foodeditor@nytimes. com.) Now, did you read Dwight Garner on Robert Gottlieb’s memoir in The Times? Please do. They’re excellent together. Did you see that Prince Buster, the trailblazer of Jamaican ska, died recently at 78? If you’d like to see some cool old videos and listen to his music, there’s a pretty cool “bead” on Milq devoted to ska and rocksteady. Check that out. Finally, let’s see what Gao Gao, Bai Yun and Xiao Liwu are up to. Yes, it’s Panda Cam from the San Diego Zoo. You’ll like it. See you tomorrow.'"}, "time": 1742563198.1753798}