{"duration": 0.03223085403442383, "input_args": {"text": "'Samstag, 5. November 2016 Asterix-Comics wegen Verherrlichung von Doping aus dem Handel genommen Berlin (Archiv) - Ist das das Aus für die unbeugsamen Gallier? Wie der Ehapa-Verlag am Mittwoch mitteilte, werden alle Bände der beliebten Asterix-Reihe von Autor René Goscinny und Zeichner Albert Uderzo umgehend aus dem Handel genommen. Damit reagiert der Verlag auf eine Untersuchung der Nationalen Anti-Doping Agentur Deutschland (NADA), die jahrelanges flächendeckendes Doping bei den beliebten Comicfiguren nachweisen konnte. Bereits Ende letzter Woche hatte die NADA entsprechende Ergebnisse veröffentlicht. Demnach konnten die Kontrolleure die Verwendung einer euphemistisch als \"Zaubertrank\" bezeichneten Substanz in allen Heften nachweisen. Mit Hilfe des berüchtigten Doping-Arztes Miraculix aka \"Der Druide\" sollen somit sämtliche der Schlachten- und Prügelergebnisse der Gallier gegen römische Patrouillen, Feldlager und Legionen ganz offenkundig und ungeniert manipuliert worden sein. Unsportlich. Von einem fairen Wettkampf keine Spur. \"Wir befürchten, dass durch die Verherrlichung des Dopingmittels als Zaubertrank ohne Nebenwirkungen die Hemmschwelle für den Konsum leistungssteigernder Substanzen sinkt\", heißt es in einer Erklärung der Agentur. Gerade jüngere Leser seien gefährdet. Besonders erschütternd: Ein Charakter soll gar als Kind in das Dopingmittel gefallen sein und seitdem über übermenschliche Kräfte verfügen. Beim Ehapa-Verlag gibt man sich derweil zerknirscht und lässt die Zukunft der beliebten Comics offen. Zwar sei ein \"cleaner\" Neustart der Reihe in Planung, so ein Sprecher des Verlages. Doch ob der neue Band \"Asterix und die Zerstörung des kleinen Dorfs durch selbstverständlich haushoch überlegene Römer\" am Ende tatsächlich den Weg in deutsche Buchhandlungen finde, sei noch nicht sicher. dan, khi; Idee: khi; Fotos: Ehapa-Verlag; Hinweis: Erstmals erschienen am 31.7.14 Artikel teilen:'"}, "time": 1742562198.8475819}