{"duration": 0.032671451568603516, "input_args": {"text": "'Pinterest \\nStudents at Tufts University outside Boston are being told that if they wear Halloween costumes that anyone finds “offensive, they could get a visit from the police. \\nStudents in the school’s Greek system were told they could face “serious disciplinary sanctions” including an investigation by university police for wearing costumes that offend people or make people feel “threatened or unsafe,” The College Fix is reporting . \\nIn a letter to the presidents of all the school’s fraternities and sororities signed by council leaders, they seem to be cracking down on pretty much any costume at all that anyone, anywhere would find offensive. \\nGreek Brothers and Sisters have worn costumes that appropriate cultures and reproduce stereotypes on race, gender, sexuality, immigrant or socioeconomic status. Outfits relating to tragedy, controversy, or acts of violence are also inappropriate. … It is our mission to promote spaces that allow members of the Tufts community to have fun without feeling as though any part of their identity is being misrepresented or targeted. \\nIt then goes a step further and warns of the “consequences for wearing an offensive costume: \\nMary Pat McMahon, the Dean of Student Affairs, described the consequences as follows: “The range of response for students whose actions make others in our community feel threatened or unsafe, or who direct conduct towards others that is offensive or discriminatory, includes [Office of Equal Opportunity] and/or [Tufts University Police Department] investigation and then disciplinary sanctions from our office that could run a wide gamut depending on what is brought to our attention and the impact of these actions on others. Any complaints will result in full investigation by University officials and could result in serious disciplinary sanctions through Judicial Affairs.” \\nOf course, this kind of totalitarian behavior is only possible if fellow students tell on each other . And that’s exactly what they do. They encourage students to report someone wearing an “inappropriate or offensive” costume and provide a link to the school’s “ bias reporting form .” \\nThe letter was signed by the Inter Greek Council, Multicultural Greek Council, InterFraternity Council, and Panhellenic Council. It also reminds students to obtain consent before any sexual encounters during Halloween, citing a traditional increase in assaults during this time. \\nSchool officials insist that the students themselves wrote the letter and that the school does not have an official policy about Halloween costumes: \\n“The letter was written by students, for students, to encourage a thoughtful and considerate celebration of Halloween within our diverse and inclusive community and to stress the importance of alcohol safety and sexual consent,” campus Spokesman Patrick Collins said. “We commend the leaders of our Greek Life councils for proactively raising these important issues with their fellow participants in Greek Life and encouraging responsible behavior. As is the case at any time, students whose actions are discriminatory or threaten others can face a range of disciplinary sanctions. Depending on their seriousness, such actions, when called to our attention, can prompt investigations by the Office of the Dean of Student Affairs, the Office of Equal Opportunity or, in certain circumstances, the Tufts University Police Department.”'"}, "time": 1742628513.525155}