{"duration": 0.08403372764587402, "input_args": {"text": "'Michelle Obama Promotes Lewd Rappers\\nFrom Gerald Celente’s Trend Alert\\nMichelle Obama’s ‘rap’ more disgusting than Trump talk\\nKINGSTON, NY, 26 October 2016—Hitting the campaign trail for Hillary Clinton in New Hampshire, Michelle Obama made headline news lashing out at Donald Trump’s boast on a 2005 tape that as a star he could “do anything to women.” Calling Trump’s statements so “shocking and demeaning” that “I can’t stop thinking about this; it has shaken to me to my core,” Ms. Obama said she was campaigning against “hateful language about women.” \\nMs. Obama also chastised Mr. Trump for “speaking freely and openly about sexually predatory behavior,” and “using language so obscene that many of us were worried about our children hearing it when we turn on the TV.” \\nBad Rap\\nWhile Trump’s statements were offensive to women, they pale in comparison to the loud chorus of rappers’ filth and denigration of women that Michelle and Barack Obama have continually promoted, championed, wined and dined at the White House. And, while she has condemned Trump’s lewd remarks – including how “loving fathers are sickened by the thought of their daughters being exposed to this kind of vicious language” – the Obamas have hosted in the “The People’s House,” where their two daughters reside, rappers who obscenely rap about date rape and sexual predatory behavior.\\nIndeed, it is not the presidential race that “little girls” are tuned into to hear “about who they should look like, how they should act,” or hearing “language so obscene that many of us worry about our children hearing it when we turn on the TV,” as Obama claimed in her speech. Young people are not watching TV with mommy and daddy. They tune into the music/entertainment world that promotes “hateful language about women” performed by White House guest rappers such as:\\nRick Ross, “U.O.E.N.O.”\\nPut Molly all in her champagne, she ain’t even know it\\nI took her home and I enjoyed that, she ain’t even know it…\\n(Molly is a street name for ecstasy, a ‘love drug’) \\nBig Sean, “Mona Lisa” \\nI believe in God and rubbers\\nEven if we sex you are not my lover\\nHit you on the couch and not the covers \\nAnd if you bring you friend then we got to f#ck her…\\nWhen they go low, we go high\\nBeyond the rappers, Michelle Obama also has elevated Beyonce´ – a performer who dresses and dances in sync with her sexually explicit lyric library – as a “role model for young girls around the world,” and is “proud to have my daughter grow up in a world where she has people like you, to look up to.”\\nThus, while the first lady continually brags about raising the moral bar of integrity while condemning Trump’s words and deeds, the media have ignored the far greater of two evils: The blatant hypocrisy of Michelle Obama, who supports a deplorable, debased entertainment industry drenched in debauchery that is poisoning the planet.\\nPublisher’s Note: We are political atheists and support neither presidential candidate.\\nThe post Michelle Obama Promotes Lewd Rappers appeared first on PaulCraigRoberts.org .'"}, "time": 1742563257.4792871}