{"duration": 0.08816003799438477, "input_args": {"text": "'Steven Levenson’s passionate and provoking “If I Forget” is a family play, a political play and a   play. That kitchen definitely isn’t kosher, even though the family that gathers around it  —   the three adult children of an ailing father, Lou Fischer  —   are outspoken  . Irritable and animated, the Fischers come vibrantly alive in this young playwright’s funny, bruising, searching voice. The play, a Roundabout Theater Company production that opened on Wednesday night, begins in 2000 in an    neighborhood of Washington. The Camp David summit meeting has failed, ushering in the collapse of the   peace process. The renewed intifada seems removed from the    worries of Lou (Larry Bryggman) his children and their spouses and offspring. But world events have a funny way of inviting themselves into this   Colonial. Rocks thrown a world away encourage deeply personal reflections of what it means to be a Jew in America at the turn of the 21st century. The Fischers are a mostly secular clan, and Mr. Levenson doesn’t deck them with Jewish markers  —   there are no skullcaps and no bagels, no briskets and no bris. These characters don’t kvetch or kvell, at least not in those terms. The younger daughter, Sharon (Maria Dizzia) a teacher, used to take Lou to temple, but her observance has dwindled since she discovered her boyfriend and the cantor entangled on her new duvet. Her great regret: “Now I have to get it ” she tells her brother, Michael (Jeremy Shamos). The older daughter, Holly (Kate Walsh of “Private Practice”) a homemaker and design hobbyist, goes to services only on High Holy Days. Michael, a professor of Jewish studies, doesn’t go at all. If Michael is the least religious character, he is also the one most consumed by questions of Jewish identity. He has just finished writing an incendiary book arguing that the persistence of the Holocaust in the minds of American Jews has hollowed out Jewish life. Michael, who hurls his words like so many Molotov cocktails, insists that the Holocaust has made contemporary Judaism “a religion and a culture of, frankly, death and death worship,” and recommends forgetting it. (This point and others owe a debt to Norman G. Finkelstein’s 2000 book, “The Holocaust Industry. ”) These claims don’t sit well with Lou, a World War II veteran who helped liberate Dachau. In a   conversation with Michael, he describes, simply and feelingly, what he saw there and why he can’t and won’t forget. “For you, history is an abstraction,” he says. “But for us, the ones who survived this century, this long, long century, there are no abstractions anymore. ” This speech, poignantly delivered by Mr. Bryggman, elicited spontaneous applause. But so did the earlier and wholly contradictory tirade loosed by Mr. Shamos. No one in Mr. Levenson’s play gets to make the definitive statement. Not even Mr. Levenson. Like other intellectually rigorous plays about to open  —   J. T. Rogers’s “Oslo,” Paula Vogel’s “Indecent” and Lynn Nottage’s “Sweat”  —   “If I Forget” speaks to both the head and the heart. No condescending sense of    here. The problems of what we should remember and what we should forget, who we should be and how we should love seem to confuse Mr. Levenson, too. (The current renewal of   rhetoric and the threats to Jewish spaces have only made the play’s quandaries ring louder.) When it comes to big questions, and smaller ones, too, every character makes reasonable arguments  —   even flaky Holly, even   Sharon  —   and also unreasonable ones. Sorting through that welter of competing claims is a real hassle. And a great gift. But focusing too intently on the play’s stimulating politics risks scanting its humor and its family dynamics. Mr. Levenson has a longtime interest in strained relations between parents and children  —   you can find it in his debut play, “The Language of Trees,” and in his book for the hit Broadway musical “Dear Evan Hansen. ” Yet he has never created a clan as quick to wound and quick to reconcile as the Fischers. “If I Forget” isn’t perfect. The plot, which turns on a question of real estate, takes its time arriving and mostly hangs around to facilitate debate. (And in these debates all the most penetrating arguments go to the men.) That Michael would publish his controversial book just as he’s up for tenure strains credibility, and a later subplot about credit card fraud is even more unlikely. Under Daniel Sullivan’s sensitive direction, the ripe interstitial music nudges emotion too obviously and the ending, which shifts the play into magical realism, makes its themes too explicit. (Mr. Levenson has never been one to wear his metaphors lightly.) But the script and the remarkable actors make you embrace the Fischers  —   however quarrelsome and distractible and fumbling they may be. Watch Michael (in Mr. Shamos’s astonishing performance) and Holly (in a tough and comic turn from Ms. Walsh) play siblings who tear each other apart, then make the same wavering gesture to end the quarrel. Watch Michael and his wife (Tasha Lawrence) and Holly and her husband (Gary Wilmes) and son (Seth Steinberg) reveal layers of injury and devotion. Watch them all stand in the   and warble “Happy Birthday”  —   a family unable to agree on pretty much anything, yet still somehow in unison.'"}, "time": 1742562637.1707733}