{"duration": 0.038475990295410156, "input_args": {"text": "'WASHINGTON (AP)  —   Attorney General Jeff Sessions suggested Thursday that he would be open to the appointment of an outside counsel to review actions taken by the Justice Department during the Obama administration. [Conservative radio host Hugh Hewitt asked Sessions in an interview if the new attorney general would consider designating an outside counsel “not connected to politics” to take a second look at Justice Department actions that provoked Republican ire in the last eight years. Those include the Fast and Furious gun scandal and the decisions against bringing criminal charges over Hillary Clinton’s email practices or the Internal Revenue Service’s treatment of conservative groups.  Hewitt contended during his radio interview that the department had become “highly politicized” in the Obama administration and floated the idea of a special review by an attorney with the authority to bring criminal charges and “just generally to look at how the Department of Justice operated. ” Sessions was noncommittal but left the door open, saying he would do everything he could to “restore the independence and professionalism of the Department of Justice. ” “So we would have to consider whether or not some outside special counsel is needed,” Sessions said. “Generally, a good review of that internally is the first step before any such decision is made. ” The exchange reflected the lingering deep partisan anger over the Justice Department’s decision to close without charges the Clinton email investigation and a separate probe into how the IRS processed requests for   applications. Sessions said the outcome of the IRS case, in particular, remained “of real concern. ” The Justice Department in 2015 found mismanagement at the tax agency but no evidence that it had targeted a political group based on its viewpoints or obstructed justice. Democrats have called for an outside counsel to probe possible contacts between Russian officials and the Trump campaign. Sessions recused himself last week from any investigation that touches the campaign, and Rod Rosenstein, the prosecutor nominated as his deputy, would not commit at his confirmation hearing this week to step aside from any such investigation. During the campaign, President Donald Trump said he would appoint a special prosecutor to look into Clinton, though he expressed ambivalence about that idea after he won the election. It’s not clear how serious Sessions was about the idea of a special counsel to investigate past Justice Department decisions, or how such an undertaking might work.'"}, "time": 1742564307.3272064}