{"duration": 0.07891678810119629, "input_args": {"text": "'Regina Feltner, a retired nurse, was recovering from side effects of radiation therapy when she got the notice that her heat would be cut off. It was a   January day. The snow was so high that her daughter had to come over to take the dog out. “I have lung cancer and it’s the dead of winter,” she remembers thinking. “What am I going to do?” Help came in the form of a heating subsidy: money from the federal government, delivered by the Highland County Community Action Organization, a small nonprofit in rural southern Ohio, where Ms. Feltner lives. Now, that program is on the chopping block. It is one of many cuts in President Trump’s new budget proposal that would inflict the deepest pain on the most vulnerable Americans  —   a great number of whom voted for him. “I understand what he’s trying to do, but I think he’s just not stopping to think that there are people caught in the middle he is really going to hurt,” said Ms. Feltner, 57, who was a nurse for 25 years and voted for Mr. Trump. “He needs to make some concessions for that. I was a productive citizen. Don’t make me feel worthless now. ” As news of Mr. Trump’s budget begins to sink in across the country, Americans are trying to parse what the changes to the government’s spending plan might mean for them. It is only a proposal, an opening bid in what is likely to be a protracted public argument over national priorities. But it is important because it signals what the new president is thinking, his wish list for the size and shape of government. In two days of interviews with beneficiaries of programs at risk in 11 states, many people said they did not see themselves reflected in Mr. Trump’s vision for the government. And some felt surprise at what has been left out. Ms. Feltner said that without the heating subsidy she would probably have to move in with her daughter and two teenage grandchildren. “I’d still like to have a little dignity left, and not have to move in with someone else,” she said. “I used to be the one packing up the food in the food pantry for people,” she said. “Now I’m the one in line. ” Another proposed cut would defund the Appalachian Regional Commission, which was founded in 1965 to strengthen economic growth in a   swath of the country. Of the 420 counties in the commission’s footprint, 399 voted for Mr. Trump. “I hate to see him cut us,” said Chris Farley, 32, of Delbarton, W. Va. who was laid off from his job operating a drill at a surface coal mine in 2015 and is now in a jobs and education program partially funded by the commission. Mr. Farley worked in coal for 11 years. When he was 18, his father, a miner, helped get him a job driving a truck that carried rocks. The pay was good: He was making $20 an hour when he was laid off  —   a punch he did not see coming. The only work he found afterward paid minimum wage. With a wife and    daughter, he struggled to pay the bills. “I tried everywhere to get a job,” he said. “I mowed lawns. I cut weeds. I hauled trash. ” Last year, his mother texted him about a job in farming through a local nonprofit called the Coalfield Development Corporation, which is partially supported by the Appalachian Regional Commission. It pays him $11. 50 an hour for 33 hours a week growing cucumbers and raising chickens and pigs. It also pays for him to attend community college six hours a week where he working toward an associate degree. His grade point average is 4. 0. “I never dreamed I’d be going back to school,” he said. “I love it. It’s amazing. College is totally different than high school. Back then I was young and I didn’t care. ” The farm had its first full year last year: a good cucumber harvest, a lot of eggs sold. Mr. Farley was reminded of eating beans and tomatoes at his grandparents’ farm as a boy. “I blew up the mountains,” he said, “and now I’m reclaiming the mountains. ” Another worker in the Coalfield Development jobs program is Tracy Spaulding, 19, the son of a longtime miner. When his father was laid off after nearly 30 years, he made ends meet by buying an industrial saw and cutting lumber. The younger Mr. Spaulding has skipped the mine altogether: He works in a wood shop making things like TV stands, cabinets and headboards for beds. In November, Mr. Spaulding cast his first vote for president. He chose Mr. Trump, something he tries not to talk about with his friends who didn’t. “They get really sore about it,” he said. “Honestly, I like Donald Trump. That’s just how I feel, I like him. A lot of people don’t and I understand that. ” When asked what he thought about the proposed cut to the commission, he thought for a bit. “He ain’t pulled nothing on us yet,” he said. He thought more. “I believe I’d be a little bit mad about it if he made that cut and I lost my job and schooling, you know? But things happen. People get laid off every day. I’ll make it one way or another. ” In Staten Island, N. Y. Raymond DeNozzo, 53, a carpenter who has lived in Sutton, W. Va. for 28 years, was back home visiting his father on Friday. He, too, voted for Mr. Trump. He believes his adopted state’s coal industry was decimated under President Barack Obama. He supports increased spending on veterans and on the military, and, at least in theory, cuts to some social programs. He thinks that welfare discourages people from working, for instance. “We need to teach our children to work and go out and be independent,” he said. But his wife is a schoolteacher, their health insurance is through her job, and Mr. DeNozzo worries about the potential cuts to schools that could result from Mr. Trump’s budget. School consolidations are already overburdening teachers, he said. And they can also harm students, he said. “That’s a concern,” Mr. DeNozzo said. “Will he keep the little schools open?” Some of the programs in Mr. Trump’s sights are like unloved stepchildren, with alphabet soup acronyms unfamiliar to anyone except fiercely dedicated  . But they can have outsize effects on people’s lives. Money from a Community Development Block Grant helped pay to remodel Shantell Swenson’s bathroom and kitchen in Salt Lake City, making it easier for her to use a wheelchair in her home and allowing her to cook on a stove for the first time. There have been other benefits, too. “Now instead of spitting my toothpaste into a cup I can roll under the sink,” said Ms. Swenson, 33, who has cerebral palsy. Tired of lifting her legs into and out of a standard bathtub and begging landlords to change it, she scraped together her savings to buy a small house last May. The bathroom was finished in September, and the kitchen is on track for April. She calls the work life changing. “I would be old and gray and partially retired before I could have been able to afford this on my own,” she said. Ms. Swenson said she did not “rage toward” Mr. Trump “like some people I know. ” But when she heard about his proposed budget cuts, she said, she was “boiling with anger. ” One of those proposed cuts would kill the Legal Service Corporation, which funds 133 civil legal aid programs in the 50 states at a cost of $385 million. That funding stream makes up 40 percent of the budget for Legal Aid Services of Oklahoma, whose lawyers saved Paula and Joe Frye from losing their   home. The Fryes, who live in Warner, had missed a $14 tax payment four years earlier. They learned that their property had been put up for auction only when a man pulled up to their home and Mr. Frye asked him what he wanted. “The man said he wanted to look at the land for sale,” said Mrs. Frye, a retired turkey hatchery worker. They were unable to resolve the unpaid bill themselves, but the land was sold at a county auction for $5, 000. The Fryes could not match that, or afford a lawyer. Only when they turned to Legal Aid did a lawyer there discover a technical flaw in the county’s handling of the tax arrears and the Fryes got their home back. “This is all we had,” Mrs. Frye said. “If it hadn’t been for Legal Aid, I guess we’d just live in our car. ” The Fryes, who did not vote, said they were reserving judgment on Mr. Trump. Some things are probably beyond the president’s control, Mr. Frye said. Mrs. Frye said they would be watching. “I guess until we see exactly what he does do, then I’ll know if I like him or wish he had lost,” she said.'"}, "time": 1742628476.2989054}