{"duration": 0.1517353057861328, "input_args": {"text": "'WASHINGTON  —   The resignation of Michael T. Flynn as national security adviser caps a remarkably tumultuous first month for President Trump’s White House that has burdened the early days of his presidency with scandal, legal challenges, personnel drama and questions about his temperament during interactions with world leaders. Mr. Flynn, a retired Army lieutenant general, lasted only 24 days before his tenure was cut short by an admission that he had misled the vice president and other White House colleagues about the contents of a phone call with the Russian ambassador to the United States. The resignation on Monday night and the continuing turmoil inside the National Security Council have deeply rattled the Washington establishment. Senator John McCain, Republican of Arizona, railed against the administration on Tuesday, decrying the “dysfunction” of the country’s national security apparatus and accusing the White House of being a place where “nobody knows who’s in charge and nobody knows who’s setting policy. ” Gen. Tony Thomas, head of the military’s Special Operations Command, expressed concern about upheaval inside the White House. “Our government continues to be in unbelievable turmoil. I hope they sort it out soon because we’re a nation at war,” he said at a military conference on Tuesday. Asked about his comments later, General Thomas said in a brief interview, “As a commander, I’m concerned our government be as stable as possible. ” But Mr. Flynn’s   departure just added to the broader sense of chaos at 1600 Pennsylvania Avenue. In record time, the 45th president has set off global outrage with a ban on travelers from   countries, fired his acting attorney general for refusing to defend the ban and watched as federal courts swiftly moved to block the policy, calling it an unconstitutional use of executive power. The president angrily provoked the cancellation of a summit meeting with the Mexican president, hung up on Australia’s prime minister, authorized a commando raid that resulted in the death of a Navy SEAL member, repeatedly lied about the existence of millions of fraudulent votes cast in the 2016 election and engaged in Twitter wars with senators, a sports team owner, a Hollywood actor and a major department store chain. His words and actions have generated almost daily protests around the country. “I’ve never been so nervous in my lifetime about what may or may not happen in Washington,” said Leon Panetta, a Democrat who served as chief of staff, secretary of defense and C. I. A. director during a   career that spanned nine presidents from both parties. “I don’t know whether this White House is capable of responding in a thoughtful or careful way should a crisis erupt,” he said in an interview on Tuesday. “You can do    stuff over a period of time. But at some point, I don’t give a damn what your particular sense of change is all about, you cannot afford to have change become chaos. ” Mr. Trump’s allies note that the president has moved forward in areas that are more typical of the early days of a   administration. Mr. Trump nominated a Supreme Court justice 12 days into his tenure, and has issued a dozen executive orders, including ones to limit the influence of lobbyists, reduce regulations, pare the Affordable Care Act, move forward on pipeline construction, end trade deals and speed up deportations. Those accomplishments are catnip for the president’s most fervent supporters across the country, said Sara Fagen, who served as a senior aide and political director for former President George W. Bush. The perspective on the White House is very different far outside the interstate freeway that rings Washington, she said.’ ”“If you’re someone inside the Beltway, you think it’s been really rocky,” she said. “If you are outside the Beltway, you think, ‘That’s why we sent him there.’ There has been a lot of chaos and a lot of growing pains, but they have gotten a lot done. ”” ’Still, half of the president’s cabinet has yet to be confirmed by the   Senate, and several other key White House aides have become lightning rods for daily mockery by   comedians. It all has official Washington reeling and exhausted as it tries to make sense of  —   and keep up with  —   the nearly constant tornado of activity swirling around the president and his advisers. “If you had   Obama, you’ve got      Trump,” said John Feehery, a veteran Republican strategist, who compared the last several weeks to the chaotic start to Newt Gingrich’s tenure as speaker of the House in 1995. “Newt never settled down. It was always one crisis after another,” Mr. Feehery recalled. “This might be the new normal. People will start getting used to the new normal, but will also be exhausted by it. ” As a candidate, Mr. Trump promised to move quickly to stop illegal immigration, bring jobs back, end trade deals and reduce crime. Central to his campaign agenda was his pledge to be a disruptive force in Washington  —   and he has certainly done that. Since winning the election, Mr. Trump and his closest aides have embraced the turmoil, viewing it as evidence of their aggressive efforts to fundamentally reorient the government. The West Wing also uses the chaos as a tactical weapon, believing that the flurry of   presidential tweets, controversial statements during the afternoon briefing and surprise executive actions work to keep their adversaries, the media and others off balance. On Tuesday, Sean Spicer, the White House press secretary, happily kept reporters waiting while he did “a quick recap of the president’s activity,” proceeding to offer a long list of meetings and phone calls with foreign leaders, female entrepreneurs, local officials and educators. Yet the disruptions have come at a cost: the president has so far made little progress on legislation that would repeal President Barack Obama’s signature health care law. The White House has not proposed a promised infrastructure bill to repair deteriorating roads, bridges and tunnels. And the president’s aides have not yet drawn up plans for an overhaul of the nation’s tax code. “It’s pretty predictable,” Mr. Feehery said. “This guy has never been in government before and he promised to be disruptive. ” It may also have consequences for Mr. Trump’s ability to help Republicans win in the 2018 midterm elections. And Republican campaign experts acknowledge that his chances for winning   may hinge on his ability to contain the White House frenzy. “You are processing so much information in a day now. This stuff would have doomed anyone else, just one or two of them,” said Thomas M. Davis, a former Republican member of Congress from Virginia. “They have got to produce something. If all you’ve got is a bunch of executive orders and a Twitter feed, you don’t want to go into an election like that. ” Kevin Madden, who served as a senior adviser to Mitt Romney during both of his presidential campaigns, said Mr. Trump’s voters in 2016 wanted him to overhaul an establishment in Washington, which they view as long on promises, long on process but short on action. “Voters certainly asked for change. They certainly wanted to see disruption,” Mr. Madden said. “But if change begins to look like confusion and disruption morphs into disorder, you risk losing a certain level of confidence with voters. ”'"}, "time": 1742564090.0554166}