{"duration": 0.08879256248474121, "input_args": {"text": "'Vladimir Putin: The United States continues to sleep with al-Nusra ‹ › South Front Analysis & Intelligence is a public analytical project maintained by an independent team of experts from the four corners of the Earth focusing on international relations issues and crises. They focus on analysis and intelligence of the ongoing crises and the biggest stories from around the world: Ukraine, the war in Middle East, Central Asia issues, protest movements in the Balkans, migration crises, and others. In addition, they provide military operations analysis, the military posture of major world powers, and other important data influencing the growth of tensions between countries and nations. We try to dig out the truth on issues which are barely covered by governments and mainstream media. The Geopolitics of Russia-Egypt Relations By South Front on October 27, 2016 …from SouthFront \\nThe rapidly developing relations between Russia and Egypt have been overshadowed by the more prominent relationships between Russia and Syria, as well as Russia and Iran. Nevertheless, the Russia-Egypt relationship deserves closer scrutiny because, unlike the country’s relations with the other two Middle Eastern powers, it concerns a country that until recently appeared to be firmly in Western orbit. The abrupt shift of its geopolitical vector toward Eurasia therefore represents a far bigger change for the region than Russia’s successful support of the legitimate Syrian government, or the close relationship with the Islamic Republic of Iran, both of which have been on the Western “enemies list” for decades. The reasons for this shift are twofold, and have to do with the way Western powers interact with Middle Eastern powers in the context of a systemic economic crisis, as well as with Russia’s demonstrated attractiveness as an ally. \\nThe West’s systemic crisis clearly transformed how Western powers view non-Western ones. Whereas the “end of history” globalist rhetoric suggested a post-sovereignty utopia in which weak and strong powers interact on equal terms in a world without borders, in practice that rhetoric was a ruse to persuade non-Western powers to drop their guard and allow themselves to be penetrated by Western corporations and financial institutions and lose any possibility of charting their own, independent course. Alas, from Western perspective, assimilating “emerging markets” is still the cornerstone of economic policy, the only program of economic growth. Whereas during the 1990s this assimilation took relatively benign form, 9/11 had the effect of allowing initially the US to adopt a far more aggressive stance, to the point of overt military invasion. While EU initially did not follow suit, the severity of EU’s own problems prompted it to jump on the bandwagon of “regime change” in the case of Libya, Syria, and Ukraine. \\nEgypt, a long-time Western ally since the late 1970s, unexpectedly found itself on the receiving end of predatory Western policies which took the form of the Tahrir Square “color revolution” which ultimately led to the electoral victory of the Muslim Brotherhood, which in turn fell to a military overthrow once the danger of the country’s slide into a civil war became apparent. The fact that Muslim Brotherhood was financed by US-allied Persian Gulf states made Egypt aware it too was the target of state-sponsored jihadism, and that the US was incapable or unwilling to force its allies in region to refrain from targeting Egypt. While Syria is only a peripheral concern for Egypt, the civil war in Libya, where Islamist formations including ISIS enjoy Gulf Arab support, represents an immediate threat to Egypt for several reasons. The country can be used as a staging ground for launching attacks into Egypt and a sanctuary against retaliation and, in the longer term, should its government be a puppet controlled by hostile Gulf powers whose long term goal is the control of Egypt and of Suez Canal, which means that Cairo is keenly interested in influencing the outcome of that war. \\nRussia thus became an attractive partner because of its history of non-involvement in the internal politics of its allied states (almost to a fault, because unilateral restraint led to the Maidan revolution in Ukraine), because it can fill the security void left by the Western weakness, and, last but not least, because it can physically defend Egypt’s political and territorial integrity against every conceivable threat, an ability it is currently demonstrating in Syria. Egypt appears to be taking advantage of these capabilities. Cooperation now includes the possibility of establishing a Russian airbase in Egypt, visits by Russian paratroopers to Egypt, and special operations troops providing training to their Egyptian counterparts. Egypt is also shifting its military procurement plans toward Russia. The two Mistral-class ships that have been acquired by Egypt will receive the originally planned Russian electronics suite and will carry Russian helicopters; there are discussions of MiG fighter sales to Egypt, and the country received a Molniya-class missile boat. \\nFrom the Russian perspective, Egypt represents yet another bulwark of security against Western encroachment, a symmetric response to NATO expansion, “Eastern Partnership”, and color revolutions. Combined with the military presence in Syria, Cyprus’ general pro-Russian orientation, and the neutralization of Turkey which was also facilitated by an abortive West-promoted coup attempt, Egyptian bases would transform Eastern Mediterranean into a “Russian lake.” Last but not least, these bases and alliances could serve a launchpad for power projection into other unstable areas of the Middle East and, if Egypt’s control of the Suez Canal is guaranteed by Russian arms, this guarantee endows both countries with a very effective means of pressuring Western and Gulf Arab powers. Related Posts:'"}, "time": 1742563808.774071}