{"duration": 0.05006980895996094, "input_args": {"text": "'  \\n“America’s strategic and economic interests in the Mideast and Muslim world are being threatened by the agony in Palestine, which inevitably invites terrorist attacks against US citizens and property.” \\nEric Margolis Sun Media Sept 2 2001 (nine days before the Sept 11 attacks against New York and Washington DC.) \\nAs Americans enter the 15th anniversary of the 9/11 attacks on their nation, they still have not understood the true cause of these dreadful attacks. \\nWho can blame them? Our politicians and media have totally obscured the truth behind these and subsequent attacks that we call ‘terrorism.’ While we mourn 9/11, US B-52 heavy bombers are raining bombs on what’s left of Afghanistan in a futile attempt to crush tribal forces (aka Taliban) fighting western occupation. \\nWe did the same thing in Laos in the 1980’s, as President Barack Obama properly noted during his visit there last week. Laos has never recovered and Afghanistan won’t either. \\nSince 2015, the US has dropped at least 32,000 – 1,000-2,000 lb. bombs on Iraq, Syria, Libya, Yemen, Somalia, Pakistan and Afghanistan – all Muslim nations. US bomb inventories are running critically low as arms makers work overtime. \\n9/11 was a revenge attack conducted by mostly Saudi nationals who claimed they wanted to punish the United States for supporting Israeli oppression of Palestine, and for what they claimed was the US ‘occupation’ of Saudi Arabia. \\nThat’s as much as we really know. We have never gotten the full story about 9/11. The best we can do is ask “qui bono,” who really benefitted from the attacks? \\nThe 9/11 narrative was immediately twisted by President George Bush into a spurious claim that America had been attacked by Muslims because of its ‘freedoms’ and her ‘way of life.’ This deceit opened the Pandora’s box from which issued the rising wave of Islamophobia and Crusading fever sweeping over the US and Europe. \\nAmerica was attacked for what it had been doing all over the Muslim world, not for what it was. Most Americans don’t know that the first CIA ‘regime change’ in the Mideast occurred in Syria, way back in 1948. We’re still at it today. \\nEver since, the US, Britain and France – the imperial three musketeers – have been breaking and making regimes across the Mideast and Africa, and installing vicious dictators to do our bidding, earning enemies from West Africa to Tajikistan. \\nHillary Clinton said this week that if elected president she would advance ‘American exceptionalism’ and assure the new world order. These are code terms for imperialism and hegemony. If Clinton wins, look forward to foreign and military policy directed by Goldman Sachs and the neoconservatives. \\nDonald Trump vows a major increase military spending at a time when America’s infrastructure is rusting or collapsing and its debt soaring. Both Trump and Clinton warn of growing security threats to America from ISIS and North Korea. In reality, the greatest internal threat is the type of Saturday night gang shoot-outs in Chicago that have killed 500 people so far this year. \\nISIS is a military pipsqueak – a bunch of 20-something hooligans. North Korea only wants to be left alone to its misery. Washington, Paris, and London need the ISIS bogeyman today, just as they needed al-Qaida and the Soviet Union before, to justify budget-busting new arms spending and keeping the population whipped up with bogus war fever. \\nInternationally, the greatest threat to America’s security is, of course, nuclear armed Russia which has enough intercontinental and sea-launched missiles to wipe the United States off the map. Accordingly, Washington’s most important foreign and national security priority is maintaining calm, well-mannered relations with Russia and its leadership. \\nInstead, we have Hillary Clinton and her frantic war party neocons trying to provoke Russia at every turn and giving Moscow the impression that she will start a war with Russia. It was precisely such war talk and sabre rattling that in 1983 during the Able Archer crisis brought the US and USSR to within minutes of a full-scale nuclear war. \\nFor all Trump’s bluster and Islamophobia, he is absolutely right about seeking good relations with Moscow. The schoolyard demonization of Russian President Vladimir Putin by the Clinton camp and its tame US media is childish, shameful and unworthy of a great power.  '"}, "time": 1742628411.2601972}