{"duration": 0.12045836448669434, "input_args": {"text": "'National   leaders are celebrating mothers and motherhood as they also reach out to women experiencing the pain of the loss of motherhood through abortion. [The March for Life is celebrating Mother’s Day by inviting its supporters to share special qualities of their moms.  What makes your mother special? https:  .  #MothersDay pic. twitter.   —   March for Life (@March_for_Life) May 12, 2017,  The organizers of the world’s largest   demonstration  —   held in Washington, D. C. each year on the anniversary of the Supreme Court’s Roe v. Wade decision  —   shares tributes to mothers throughout the nation. ”When I was 6 weeks old I would have the first of many brain surgeries  …    my mom stuck with me through it all.”  —  &gt&gt https:  .  pic. twitter.   —   March for Life (@March_for_Life) May 12, 2017,  ”Her heart inspires me to be a better person every day, this is why I love my mom!”  —   Natalie: https:  .  #mothersday pic. twitter.   —   March for Life (@March_for_Life) May 11, 2017,  Thanks to our moms who give us roots and wings! Let us know what makes your mother special  —  &gt&gt https:  . . #mothersday pic. twitter.   —   March for Life (@March_for_Life) May 11, 2017,  After this girl scheduled an abortion, her mom  a lunch appointment changed her mind https:  .  @EmbraceGraceInc #prolife pic. twitter.   —   March for Life (@March_for_Life) May 11, 2017,  ”My mom is one of the most amazing people I know”  —   Adelaide: https:  .  #mothersday #motherhood pic. twitter.   —   March for Life (@March_for_Life) May 10, 2017,    leaders Family Research Council, Alveda King, and Students for Life of America tweet their Mother’s Day messages: This #MothersDay, let us thank God for the boundless blessings of all the mothers in our lives. https:  .  #moms,  —   FRC (@FRCdc) May 12, 2017,  For Mothers’ Day Celebrate Life! pic. twitter.   —   Alveda King (@AlvedaCKing) May 12, 2017,  #momsdontneed abortion. pic. twitter.   —   Students for Life (@Students4LifeHQ) May 11, 2017,  March for Life also acknowledges that, while many families will be celebrating Mother’s Day with gifts and expressions of gratitude for the women who brought them into the world, those who are experiencing loss and pain following an abortion may need hope and healing. There is hope and healing after abortion. https:  .   —   March for Life (@March_for_Life) May 12, 2017,  A Renewed Mother’s Day: Mothers Day History and Real Meaning  https:  .   —   Fr. Frank Pavone (@frfrankpavone) May 11, 2017,  Father Frank Pavone, national director of Priests for Life, also serves as pastoral director of Rachel’s Vineyard  —   the world’s largest ministry for healing after abortion. Pavone tells Breitbart News he is in touch daily with women who mourn their lost motherhood following abortion. ”Our society must not settle for leaving women who face unplanned pregnancy no hope but abortion.” https:  .   —   March for Life (@March_for_Life) May 10, 2017,  “Mother’s Day is for so many of them a time of particular pain, but also a time of particular healing,” he explains. “There are many sentimental trappings of Mother’s Day  —   and these, of course are nothing bad  —   the cards and flowers, the hearts and   greetings. But the woman who started Mother’s Day came to feel that sentimentality had obscured its original meaning. ” Pavone also provides pastoral leadership for the Silent No More Awareness Campaign, an effort to mobilize those who testify to the pain they have experienced through abortion. He relates the story of Anna Jarvis, the founder of the original Mother’s Day holiday, to those who are helping others heal after abortion: After the Civil War, Anna Jarvis, an activist from West Virginia, wanted to honor her late mother for her good work in her lifetime. Anna’s mother had started mothers clubs to help lower infant mortality. Anna carried on her mother’s work. With the outbreak of the Civil War, she created mothers’ clubs that tended to wounded soldiers on both sides. These concrete and organized actions of mothers involved hard work and sustained commitment geared toward saving lives, and often marked by the pain of losing those lives. In a sense, then, the current holocaust of abortion in which we are living, and the pain of so many mothers who have lost their own children, can be an occasion to recover deeper and more original meanings of Mother’s Day. Mothers can come together  —   as so many do through Rachel’s Vineyard and Silent No More  —   to strengthen one another to face the pain abortion brings, to walk the journey of healing, and to commit themselves to save as many lives as possible from this scourge of our day. And in that sense Mother’s Day becomes a holiday for all of us to renew our commitment to defend mothers and their children from something that is taking far more lives than war or disease has ever taken. On Mother’s Day,   leaders also remember women and girls who have continued an unplanned pregnancy and offered their babies for adoption. Adoption changes lives! #adoption #prolife #whywemarch pic. twitter.   —   March for Life (@March_for_Life) May 10, 2017,  ”A birthmom’s decision has nothing to do   giving up but everything to do   giving life. ”https:  .  #BirthMothersDay #Courage pic. twitter.   —   Radiance Foundation (@lifehaspurpose) May 12, 2017,  Dr. Grazie Pozo Christie of the Catholic Association reflects at Angelus of her own experience of the “miraculous grace of adoption”: [T]hose of us who have had the privilege of adopting feel it as a divine benediction. Sometimes we are praised for our generosity, but we know that the gift is all for the parents. Although adoption requires a trusting leap into the unknown and a conscious acceptance of any number of difficulties, the return in joy is dizzying. Often, though my daughter has been with me for nine years, I look at her and I am freshly struck with the utter unlikelihood of her person being mine to guard. What you really need to know about birth moms on Mother’s Day https:  .  #mothersday #chooselife @JettCallie @March_for_Life,  —   Catholic Association (@CatholicAssoc) May 12, 2017, '"}, "time": 1742564492.5896838}