{"duration": 0.08880019187927246, "input_args": {"text": "'NEW YORK (AP)  —   NBC News is moving ahead with plans to air Megyn Kelly’s interview with conspiracy theorist Alex Jones this weekend despite a backlash that has cost the show advertisers and led to Kelly being dropped as host for an event by an organization founded by parents of children killed at the Sandy Hook Elementary School. [The network has been taken aback by the response to booking Jones, the “Infowars” host who has questioned whether the killing of 26 people in 2012 at the school in Newton, Connecticut, was a hoax. NBC News Chairman Andy Lack said the story will be edited with the sensitivity of its critics in mind.  “It’s important to get it right,” Lack said. Reporters have interviewed controversial characters like Syrian President Bashar Assad and child molesters in the past without getting this kind of a reaction, Kelly said in an interview Tuesday. “What I think we’re doing is journalism,” she said. “The bottom line is that while it’s not always popular, it’s important. I would submit to you that neither I nor NBC News has elevated Alex Jones in any way. He’s been elevated by 5 or 6 million viewers or listeners, and by the president of the United States. As you know, journalists don’t get the choice over who has power or influence in our country. ” Sandy Hook Promise, an   violence group, said it had asked Kelly to step down as host of its   gala in Washington. The group cannot support Kelly or NBC’s decision to give a platform to Jones and hopes NBC reconsiders its plan to broadcast the interview, said Nicole Hockley,   and managing director. Hockley, whose    son Dylan was killed at Sandy Hook, founded the organization with Mark Barden, who lost his    son Daniel. Kelly said she understood and respected the decision, but was disappointed. NBC’s plans have cost it some advertisers for this week’s edition of “Sunday Night with Megyn Kelly. ” It was not immediately clear how many only the financial firm JPMorgan Chase has been publicly identified. “That comes with the territory,” Lack said. “It’s not unusual. We kind of know when we’re doing controversial stories, that’s going to happen. It doesn’t stop us from doing controversial stories. ” To some critics, NBC’s timing makes the decision worse  —   airing on Father’s Day an interview that has been publicly denounced by parents who lost young children at Sandy Hook. NBC said it was scheduled for competitive reasons, because Jones had been booked to appear on ABC’s daytime show “The View” next week. A representative of “The View” said Jones had canceled his appearance there and he will not be rescheduled. Lack noted that he had suggested approaching Jones for an interview to David Corvo, the NBC News executive who supervises the network’s newsmagazines. He said there’s nothing new about putting people on the air even if they’re unpopular or have views that are deplorable to many. “I’ve got tremendous understanding of why they’re so upset, as they have every right to be,” he said. “Of course we’re looking at it. We’re looking at the editorial process. ” The interview has put Kelly, who jumped to NBC from Fox News Channel earlier this year, squarely back in the headlines the New York Daily News called it “Nutwork News” on its front page Tuesday. She was one of Trump’s favorite targets during the presidential campaign because he was annoyed at tough questions she asked him at a   debate. Jones, for his part, has already denounced the interview as “fake news” and said it was purposeful hit job on him. “I knew in my gut this was going to blow up in their face,” he said on his show.'"}, "time": 1742564379.4769328}