{"duration": 0.13846230506896973, "input_args": {"text": "'Asra Nomani,   of the Muslim Reform Movement and author of Standing Alone: An American Woman’s Struggle for the Soul of Islam, joined SiriusXM host Alex Marlow on Tuesday morning. Her original goal was to discuss President Trump’s address to Muslim leaders in Riyadh, but she began by talking about the previous night’s horrific terrorist attack at the Ariana Grande concert in Manchester, England. [“It’s a grim morning,” said Nomani. “I know so many young folks who love Ariana Grande. It could be any concert, anywhere. It’s just another tragedy. ”  LISTEN: “I also feel the connection to the reality of the patterns of Islamic extremism and terrorism,” she continued. “We know that the U. K. has a history of radicalization. ” Referring to a news clip in which Prime Minister Theresa May said it was not known if the Manchester attacker acted alone or was part of a network, Nomani said, “At the end of the day, if it is Islamic extremism, we know that it’s part of a wider network of ideology. ” “That brings us to the speech in Saudi Arabia, and the connection between all of this,” she said. “It’s tragedy, more blood spilled on the streets of our world. I’ve always been saying we have to wake up to the realities of the ideological threat that we face. ” After speaking with a caller who doubted Islam is compatible with Western values, Marlow asked Nomani for her response. “I understand the sentiment,” she said. “I emerge from moments like this also very angry and very grim about the prospects of the capacity for our faith to integrate well with the West. ”  “What I say is I’m a Muslim who was born in India to a mother who had to wear the face veil, so you know that we came from a very conservative interpretation of Islam,” she recalled.  “I came to America. I grew up on Nancy Drew as my best friend. I was a    which many people don’t even know still exists. I was a Girl Scout. My mom didn’t want to sign the permission slip to let me go square dance because girls were not supposed to dance with boys. I forced her to do so and had my first dance with a young boy who came from a Jewish family in Morgantown, West Virginia,” she said.  “What is Islam? There is no monolithic interpretation of the faith, just like there is no one interpretation of Christianity or Judaism,” Nomani contended. “And so we sit, many of us in our Muslim community, as reformers challenging the hardcore conservative orthodox ideology that I do believe is the sort of impetus for the ire of folks like your caller, who don’t think there is a possibility for compatibility. ”  “What we argue is for values that are in sync with Western values. We use Islamic theology as our grounding. We are engaged in a struggle for the soul of Islam  —   in a struggle just like Catholics were in the Inquisition, trying to face a church that was burning and killing their own Catholics who thought differently. I just wish and hope that people would allow for the expanse that there is, that includes us as Muslims challenging that orthodoxy that also angers us,” she said. Nomani shared Marlow’s concern that the more hardline, and even radical, interpretations of Islam seem to be proliferating more quickly than the reformist approach she advocates. She said her mission was made more difficult by the left’s contention that “you can’t have this conversation and that you can’t talk about the extremism problem otherwise, you’re an Islamophobe or a racist or a bigot. ” “I literally said to my friend, ‘We need you. You have to have our backs. We can’t have you abandon us because we are facing so much,’” she recalled saying to a friend with whom she was arguing. “A while ago, just over a year ago, I started a petition to have a boycott of the government of Saudi Arabia. I knew, as a Muslim, that that was not going to happen. I voted for Donald Trump because I believed that he was going to be able to figure out some way that we could challenge the extremism. I knew that with bases in Qatar and Saudi Arabia that we’re going to have to cut some kind of a deal. We’re going to have to incentivize these guys in a way that was not going to be aligned with my ideas of a boycott against these exporters of extremism,” she acknowledged.  “This week, in a scenario that I could never have imagined, Donald Trump went there to Saudi Arabia, did the sword dance, got the golden necklace  —   all moments that turned my stomach as a Muslim, as a Muslim reformer especially,” Nomani said. “But then the next day, through the genius that he has figured out, he was able to have this audience in which he dared to call out Islamic extremism. ”  “Folks have tried to do this tap dance that he was tired and didn’t mean to say ‘Islamic.’ Well, he said Islamic. He said Islamist. He called it out, and he said what needs to be said, which is it needs to be destroyed. It needs to be rooted out of our communities, out of our mosques,” she declared.  “When I went to Rome some years ago, I did what I called the ‘heretic score.’ I went to all the places where people in the Catholic Church were burned and killed and hung and persecuted. But Catholics persevered, and now there is a very different church than there existed during the Inquisition,” she observed. “I don’t want to wait hundreds of years, trust me. I just want to have some hope that we can have transformation. Stand with us, please. ” In Nomani’s estimation, President Trump’s trip to the Middle East has been “genius. ” “In the seventh century, Prophet Mohammed flew on this mythical creature, the story goes  —   a winged horse, Buraq. This horse took him from Mecca to Jerusalem, to that place that’s the Dome of the Rock now. That’s what my name means. ‘Asra’ is that journey. I could never have imagined that a President of the United States would get flying rights to go from Saudi Arabia to Israel,” she said.  “That happened, and he even uttered the words ‘Israel’ and ‘Netanyahu’ in Saudi Arabia without somebody throwing off their shoe and flying it across the chandelier room to smack him in the face. It’s unbelievable,” she observed, humorously citing the Arab custom of throwing shoes to express severe disapproval.   “I actually think that if you talk    with these power brokers, who ultimately care about their bottom lines  —   including in the Palestinian territory, there could actually be deals cut that forge a   solution, that forge an acceptance of the state of Israel,” Nomani advised.  “My dream as a Muslim, as a human being, as a citizen of this world, is that before my    grows into adulthood, there will be a retreat by the government of Saudi Arabia from this poisonous ideology that has corrupted minds from Manchester, England, to Orlando, Florida, back to my home in the state of Virginia right now. It has to happen,” she said.  “I’m literally driving right now my son to school because he missed the bus, and we are just miles away from the mosque where the   hijackers preached, where they prayed, where Anwar   preached. This is a reality around each one of us and all of our communities,” she warned. “We have to stand strong with, I believe, compassion and kindness against the reality of this threat. That’s what I saw on this tour. It turned my stomach at points, absolutely. Saudi Arabia is the problem. But it also, unfortunately, has to be the solution. We have to negotiate in a way that they will come to the table and accept responsibility for the scourge that they’ve put out in the world,” Nomani urged. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. Listen to the full audio of the interview above.'"}, "time": 1742562101.5799828}