{"duration": 0.06211662292480469, "input_args": {"text": "'Islamists around the Arab world celebrated Turkish President Recep Tayyip Erdogan’s victory Sunday in a referendum to give the head of state expanded powers. [The referendum to go forward with executive presidency won with 51. 4% voting in favor.  Khaled Mashal, head of Hamas’ politburo in Gaza, spoke with President Erdogan by phone and congratulated him several hours after polling stations closed. A website belonging to Hamas reported that Mashal “wished Turkey and the Turkish people and their leaders continued success, progress and prosperity. ” Islamists and their supporters also celebrated the victory on social media, with many expressing hope that the successful referendum would result in increased support from Erdogan for the opposition in Syria, currently battling the government forces of President Bashar Assad. Abou Baker, a senior Syrian jihadist and commander of the Mujahadeen Army militia fighting Assad in Syria, wrote, “This is a divine reward for Erdogan’s good actions. Allah helped the good man Erdogan, guided his hand, supported him, strengthened his hands and granted him all the best. ” وماجزاءالإحسان الإحسان اللهم كن للرجل الطيب أردوغان ناصرا ونصيرا وعون ومعينااللهم أيده بنصرك وأجر الخير على يديه وهيئ له بطانة صالحةياالله,  —   المقدم أبو بكر (@bbakr70) April 16, 2017,  An Islamist activist known as Ahmad Abu Farha wrote, “The Caliphs were taken from us gradually and they will only return to us gradually, according to Allah’s plan. The human mosquitos won’t be able to delay it or interfere. ” الخلافة الراشدة سلبت منا بالتدريج و لن ترجع لنا الا بالتدريج وفق السنن الربانية في التغيير و ان نواميس الكون لا تعاند و لا تسابق,  —   أحمد أبو فرحة (@ahmadabufarha21) April 16, 2017,  Yasser Zaatreh, a journalist and Islamist in Jordan, wrote, “The strengthening of Erdogan in these delicate times is very important for the maintenance of Turkey’s power both on a regional and international level. At times like this, courage and wisdom are needed along with a lot of reason. ” قوة أردوغان في هذه اللحظة الحساسة على الصعيد الدولي والإقليمي، هي قوة لتركيا. في مثل هذه اللحظات لا بد من قوة وجرأة مع كثير من الحكمة.  —   ياسر الزعاترة (@YZaatreh) April 17, 2017,  Islamist journalist and author Muhamad Alshinqiti wrote, “Secularism in Turkey has been defeated by democracy  —   as it soon will be in the Arab countries. ” انهزمت العلمانية في تركيا على يد الديمقراطية.. عقبى للدول العربية #استفتاء_تركيا,  —   محمد مختار الشنقيطي (@mshinqiti) April 16, 2017,  Syrian jihadist Abou Rayan Almaasada wrote, “Today the Turks put an end to secularism. The legal changes put an end to what was left of the age of Ataturk and summon in a new age, or more correctly, an old age renewed. God guided their hands. ” اليوم ينجح الاتراك بانهاء العلمانيةتعديلات دستويه تعلن انتهاء ماتبقى من عصر اتاتورك وبداية عهد جديد او ربما عهد قديم يتجدداللهم يسر لهم,  —   أبوريان المأسدة (@alm2sda) April 16, 2017,  Another social media user, Anwar Alsaadi wrote, “The Sultan did this. Congratulations to Turkey which has been granted its Sultan. ” @MousaAlomar فعلها السلطان . مبروك لتركيا سلطانها,  —   anwar alsaadi (@AnwarSweed) April 16, 2017, '"}, "time": 1742564266.0277276}