{"duration": 0.02938365936279297, "input_args": {"text": "'Several Silicon Valley employees, including a software engineer for Twitter who made a $160, 000 salary, were mocked online after complaining about their living standards in an article for The Guardian. [In the article, entitled “Scraping by on six figures? Tech workers feel poor in Silicon Valley’s wealth bubble,” the employee complained that his   salary was “pretty bad” for the area.  “I didn’t become a software engineer to be trying to make ends meet,” proclaimed the employee. “Families are priced out of the market. ” “The biggest cost is his $3, 000 rent  —   which he said was ‘ultra cheap’ for the area  —   for a   house in San Francisco, where he lives with his wife and two kids,” reported The Guardian sympathetically. “He’d like a slightly bigger property, but finds himself competing with groups of twentysomethings happy to share accommodation while paying up to $2, 000 for a single room. ” “The prohibitive costs have displaced teachers, city workers, firefighters and other members of the middle class, not to mention   residents,” they continued. “Now techies, many of whom are among the highest 1% of earners, are complaining that they, too, are being priced out. ” The Guardian also covered other Silicon Valley employees in the piece who were earning “between $100, 000 and $700, 000 a year” but still allegedly had trouble “making ends meet. ” “One Apple employee was recently living in a Santa Cruz garage, using a compost bucket as a toilet. Another tech worker, enrolled in a coding bootcamp, described how he lived with 12 other engineers in a   apartment rented via Airbnb,” The Guardian reported. “It was $1, 100 for a fucking bunk bed and five people in the same room. One guy was living in a closet, paying $1, 400 for a ‘private room,’” one man complained, while a female employee added, “We make over $1m between us, but we can’t afford a house  …     This is part of where the American dream is not working out here. ” Several San Francisco residents mocked the employees for their complaints. “Scraping by in the Bay Area on a   salary sure must be difficult!” joked San Francisco Chronicle reporter Lizzie Johnson. Scraping by in the Bay Area on a   salary sure must be difficult! !1! 1! https:  .  pic. twitter.   —   Lizzie Johnson (@lizziejohnsonnn) February 28, 2017,  “Pity the poor tech worker who makes $700k a year, has an ‘unpalatable’   commute and spends $12 a day on juice,” added Molly Reilly, a reporter for the Huffington Post. Pity the poor tech worker who makes $700k a year, has an ”unpalatable”   commute and spends $12 a day on juice https:  .  pic. twitter.   —   Mollie Reilly (@MollieReilly) March 1, 2017,  Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742628556.4001577}