{"duration": 0.08486461639404297, "input_args": {"text": "'Enviar para um amigo No modelo chinês, ele é sustentado por um regime autoritário e pode se expandir livremente, sem quaisquer contestações. O ocidental, teoricamente, deve respeitar determinadas regras democráticas, embora em caso de necessidade, essas regras possam ser sempre flexibilizadas. O capitalismo ocidental, que nos diz mais respeito, não olha para a geografia mundial com os mesmos olhos de quem examina um mapa. Ele não enxerga países. Mercados produtores e mercados consumidores. Seu único objetivo é o lucro acima de tudo. E para alcançá-lo não existem mais barreiras nacionais. Sua bandeira é o livre comércio. Todas as fronteiras abertas, não para facilitar a circulação das pessoas, mas para garantir a compra e venda de bens de consumo. Quando alguns países teimam em resistir e procuram defender suas riquezas em proveito de seus povos, os meios de persuasão vão de guerras comerciais às guerras reais. O Iraque não aceitou as condições das grandes companhias internacionais para explorar o seu petróleo e para puni-lo, criou-se o governo dos Estados Unidos, como o principal representante desse capitalismo belicoso, praticamente destruí o País. Quando se precisou prejudicar as economias da Rússia e do Irã, baseadas na produção e exportação do petróleo, se forçou a baixa no preço do produto nos mercados internacionais, prejudicando por tabela a economia da Venezuela. Mas não é apenas pela ação armada, que se calam os que resistem a esse capitalismo internacional e ainda sonham com um outro modelo de economia. Veja-se o caso da América do Sul. Depois de derrubar os governos do Paraguai e Honduras com golpes parlamentares, os interesses imperialistas se voltaram para a desestabilização dos governos dos dois principais países sul-americanos, Argentina e Brasil. No caso da Argentina, com uma ampla campanha de denúncias através de uma mídia corrupta e venal, foi possível se chegar ao poder por via eleitoral e liquidar o projeto populista dos governos do casal Kirchner e colocar no poder um político sensível aos interesses imperialistas. No Brasil, houve uma conjugação de forças entre um parlamento extremamente corrompido, o judiciário e a mídia, para afastar uma Presidente que, de alguma maneira, não seguia todos os pontos do modelo neoliberal que interessa ao capitalismo internacional. Não é coincidência, que o processo de desestabilizou do Governo Dilma tenha se iniciado através de um assalto a Petrobrás, que com a descoberta do pré-sal se tornara uma forte concorrente ás grandes empresas petrolíferas internacionais. Em 2013, Edward Snowden, ao divulgar alguns documentos secretos da Agência Nacional de Segurança dos Estados Unidos (NSA), mostrou que esse serviço espionava há algum tempo o trabalho da Petrobrás. Agora, o alvo principal na América do Sul é a Venezuela, que teve sua economia abalada pela queda fabricada nos preços internacionais do petróleo A mídia internacional (na Zero Hora existe um jornalista com uma obsessão quase doentia de falar mal da Venezuela), com o apoio de lideranças políticas golpistas internas, procuram derrubar um governo constitucional usando todas as armas possíveis. Apesar disso, com o apoio da população mais pobre, o Governo da Venezuela resiste e continua executando sua política de melhorias sociais no País. Embora isso não seja publicado na mídia golpista, o governo do Presidente Maduro aprovou para 2017 a aplicação de 73% do orçamento nacional, estimado em quase 850 milhões de dólares em projetos sociais, principalmente em educação e saúde. A médio prazo, as experiências com governos reformistas, no Brasil, Uruguai, Paraguai, Venezuela, Bolívia e Equador, nascidos a partir de inéditas mobilizações populares, estão condenadas a ser sepultadas pelas novas exigências do capital monopolista internacional, cada vez menos produtivo e mais financeiro. A longo prazo, a única meta pela qual vale a pena lutar é a busca de uma sociedade socialista, pois como diz Istvan Meszaros sobre o capitalismo no século XXI, a opção continua sendo a mesma citada por Rosa Luxemburgo, há quase 100 anos: socialismo ou barbárie. Marino Boeira é jornalista, formado em História pela UFRGS'"}, "time": 1742564189.9724345}