{"duration": 0.048586368560791016, "input_args": {"text": "\"Posted on October 26, 2016 by Tony Elliott \\nIt appears Bill and Hillary Clinton are making plans to flee the country in the event Donald Trump wins this election. Reports are circulating that the Clintons have transferred 1.8 Billion dollars from the Clinton Foundation to the Qatar Central Bank , via a facilitation/abatement of JP Morgan Chase & Company for reasons not revealed. \\nThis move of such a large sum of money to the country of Qatar says in itself, Hillary Clinton knows she is going to lose the election, and she doesn’t plan to allow herself to be prosecuted for various high crimes and treason under a Trump Administration. \\nThe country of Qatar happens to be one of a handful of countries that does not have an extradition treaty with the United States , thus would be a perfect place for her to run to in escaping justice. \\nDonald Trump has said many times during his campaign and at the Presidential debates that once he gets into office, he intends to prosecute her on various high crimes from her latest crimes of sending classified material via a personal email server. All the way to gun running to terrorist groups in Syria resulting in the deaths of 4 Americans in Benghazi . \\nPresident Barack H Obama has also apparently been making exit plans with his purchase of a $4.9 million dollar seaside mansion in Dubai in January 2016 , another non extradition country. \\nSnopes and other supposed fact checking sites have debunked both the story of Obama’s purchase of the mansion and the firing of Rear Admiral Rick Williams. However, over the last several months, these sites have been busted for lying in trying to debunk such information as the before mentioned, when in fact the information is true . Snopes and other sites try their best to keep incriminating information from being believed, but the truth has a way of coming out on its own, as it always has. \\nThe Bush family has been quietly buying property, as well with the purchase of 100,000 acres in Paraguay in 2006, yet another country good for the Bush family since it does not allow extradition to any country if the death penalty is a possibility for the crime. If the corruption is found to go as far back as both of the Bush Administrations with any connections to them being the perpetrators of the events on 9-11 , the death penalty would surely be a stipulation of any extradition request. Apparently, if things get going with prosecuting the corrupt and treasonous, the Bushes plan on getting out of the country as well. \\nCourtesy of Freedom Outpost \\nTony Elliott is an established writer with articles in over 20 publications of differing topics. Political Commentary Columnist for the Cimarron News Press in Cimarron, New Mexico from 2001 to 2003. He was also a regular writer for several small coastal newspapers in Southern Oregon during the early 1990’s. BOOKS: Aura Visions: The Origin Prophecy , Enviroclowns: The Climate Change Circus , Strange Sounds: A Research Report Don't forget to follow the D.C. Clothesline on Facebook and Twitter. PLEASE help spread the word by sharing our articles on your favorite social networks. Share this:\""}, "time": 1742562970.7693105}