{"duration": 0.06612181663513184, "input_args": {"text": "'Tue, 25 Oct 2016 15:07 UTC © Getty Images The researchers compared believers in God to people with autism, saying both struggle to distinguish between the physical and the mental. Religious people are more likely to have a poorer understanding of the world and are more likely to believe objects like rocks and paper have human qualities, scientists say. Researchers at the University of Helsinki compared believers in God or the paranormal to people with autism after finding they tend to struggle to understand the realities of the world around us. Religious beliefs were linked with a weaker ability to understand physical and biological phenomenon such as volcanoes, flowers, rocks and wind without giving them human qualities. Believers were more likely to think that inanimate objects such as metal, oil, clothes and paper can think and feel, and agree with statements such as \"Stones sense the cold\". Marjaana Lindeman and Annika Svedholm-Häkkinen, who completed the study, said: \" The more the participants believed in religious or other paranormal phenomena, the lower their intuitive physics skills, mechanical and mental rotation abilities, school grades in mathematics and physics, and knowledge about physical and biological phenomena were... and the more they regarded inanimate targets as mental phenomena\" . The study defined \"mental\" as having human characteristics such as thoughts and sprit. Researchers said their findings suggest people\\'s lack of understanding about the physical world means they apply their own, human characteristics to the whole universe, \"resulting in belief in demons, gods, and other supernatural phenomena \". This confusion between mental and physical qualities \"has [also] been recognised mainly among ancient people and small children\", they added. The scientists compared religious believers to people with autism, saying both struggle to distinguish between the mental and the physical, although autistic people are at the opposite end of the spectrum because they often see the world as entirely physical and struggle to understand the mental state of others. Ms Lindeman and Ms Svedholm-Häkkinen asked 258 Finnish people to report how much they agreed that \"there exists an all-powerful, all-knowing, loving God\" and whether they believed in paranormal phenomena such as telepathy and visions of the future. They then matched their answers with a range of other factors, including exam results, survey answers and performances on different tests. They also found that people who believe in God and the paranormal are more likely to be women and tend to base their actions on instinct rather than analytical thinking. Previous studies have suggested religious people tend to have a lower IQ and are more likely to believe literally in what scientists called \"bullshit statements\" including phrases like \"Earth wants water\" and \"Force knows its direction\". However, they are also found to be happier and have greater life satisfaction than non-believers and are seen as more generous and trustworthy. Comment: Despite the overly materialistic view of the researchers (even quantum physics can seem a little mystical) the brains of religious people have bee found to work \\'differently\\'.'"}, "time": 1742562098.0801728}