{"duration": 0.09698963165283203, "input_args": {"text": "'For almost a decade, the combination of Jon Stewart and Stephen Colbert made Comedy Central destination viewing for fans of   comedy and barbed political commentary. But over the last 12 months, the   and   era has not been as easy for the network. On Monday, Comedy Central announced that it was canceling “The Nightly Show With Larry Wilmore” because of falling ratings and a distinct lack of buzz. The final episode of Mr. Wilmore’s 11:30 p. m. show  —   the slot formerly occupied by Mr. Colbert before he left for CBS  —   will be Thursday. Kent Alterman, Comedy Central’s president, said he informed Mr. Wilmore of the news late last week. The move, Mr. Alterman said in an interview, was made for a simple reason: The show “hasn’t resonated. ” “Even though we’ve given it a year and a half, we’ve been hoping against hope that it would start to click with our audience, but it hasn’t happened, and we haven’t seen evidence of it happening,” Mr. Alterman said. The awkward timing of the cancellation, just 12 weeks before the presidential election, ultimately came down to a contract, Mr. Alterman said. Mr. Wilmore’s deal, along with those of several of the show’s other staff members, was set to expire in a few weeks and the network had to decide now whether to renew or cancel. For the time being, Comedy Central’s 12 a. m. show, “@midnight,” will replace “The Nightly Show” at 11:30 p. m. “The Daily Show” with Trevor Noah remains at 11 p. m. Mr. Alterman said he hoped to name a   replacement for “The Nightly Show” sometime next year. The cancellation makes Mr. Wilmore, 54, an early casualty of a television   comedy slate that has been vastly reordered over the last two years. With the retirement of David Letterman, Jay Leno and Mr. Stewart, and Mr. Colbert’s move to CBS, a series of new hosts have stepped into the spotlight, including James Corden, Samantha Bee, John Oliver and Mr. Noah. Jimmy Fallon, the host of “The Tonight Show,” has most formidably filled the power vacuum left by his predecessors, earning the highest ratings of any   show. While Mr. Stewart was the host of “The Daily Show,” Mr. Wilmore became a fixture as the program’s “senior black correspondent,” offering wry observations on racial issues. In May 2014, Mr. Stewart tapped Mr. Wilmore to get his own show, and Mr. Wilmore formally became Mr. Colbert’s successor when “The Nightly Show” premiered in January 2015. “The Nightly Show” has been known for a signature segment, “Keep It 100,” (slang for telling the truth, no matter the consequences) and for Mr. Wilmore’s often stinging commentary on race and this year’s election. (He called the election to find Barack Obama’s successor “The Unblackening. ”) Though the   genre remains heavy on easygoing laughter, any one episode of “The Nightly Show” could occasionally go for prolonged stretches without a single joke, something that intrigued some critics but failed to attract a broader audience. “I’m really grateful to Comedy Central, Jon Stewart and our fans to have had this opportunity,” Mr. Wilmore said in a statement. “But I’m also saddened and surprised we won’t be covering this crazy election or ‘The Unblackening’ as we’ve coined it. And keeping it 100, I guess I hadn’t counted on ‘The Unblackening’ happening to my time slot as well. ” The move by Comedy Central is also the first concession that the transition from Mr. Stewart and Mr. Colbert  —   both pioneers of a certain kind of political comedy as media criticism and social commentary  —   to Mr. Noah and Mr. Wilmore has not gone as smoothly as the network had hoped. Though Mr. Alterman strongly defended Mr. Noah’s iteration of “The Daily Show”  —   next month will be his first anniversary as host  —   both Mr. Noah and Mr. Wilmore have failed to capture the critical praise that rivals like Ms. Bee, Mr. Corden and Mr. Oliver have enjoyed. This year, for the first time in 16 years, “The Daily Show” was not nominated for an Emmy in the best variety show category. Mr. Noah and Mr. Wilmore have also lost a good portion of the audience that used to tune in to Comedy Central between 11 p. m. and midnight. “The Daily Show” had an average of 2. 1 million viewers a night in Mr. Stewart’s final year as host, while Mr. Noah’s audience has averaged 1. 3 million, according to data from Nielsen. And Mr. Wilmore has lost more than half the audience that he inherited. In Mr. Colbert’s final year as host of “The Colbert Report,” he had an average audience of 1. 7 million viewers, but in Mr. Wilmore’s first year, that viewership fell to an average of 922, 000 viewers, according to Nielsen. This year, the total has fallen to 776, 000 viewers a night. Likewise, in the demographic most important to Comedy Central  —   young men  —   he has not made a dent. In recent months, Mr. Wilmore has even started losing to the show that is on after his, “@midnight. ” Mr. Wilmore’s most visible role in the last year may have been his turn as host of the White House Correspondents’ Association dinner. But reviews for his act were decidedly mixed, and the exposure did not result in a ratings bounce. Mr. Alterman said that he had hoped that there would be a ratings surge  —   particularly around the political conventions  —   and that the decision to cancel “The Nightly Show” was a recent one. “We were hoping that we would get a turnaround along the way including the wild, wild two weeks of the conventions,” he said. “We just haven’t seen it on any level from the general conversation to ratings to any sort of traction on social media platforms. ” That stands in contrast, he said, to what the network has seen regarding Mr. Noah. Calling the perception that Mr. Noah is struggling “a myth,” Mr. Alterman pointed to the show’s strong performance on Hulu  —   though he is not allowed to disclose figures, he said. Mr. Noah’s show is the No. 2   show among young adults ages 18 to 34, Mr. Alterman said, and his ratings have grown among   to    men. Mr. Alterman said he “couldn’t be happier” with Mr. Noah’s performance. “In the last couple of weeks  —   leading up to the conventions and especially the conventions  —   we feel like Trevor got to a whole new level in terms of having a strong voice and point of view,” he said. “It’s been no surprise to us. We expected him to take time to find his rhythm and find his way. ” It’s unclear whether Mr. Wilmore will stay on with Comedy Central  —   “We haven’t even addressed that,” Mr. Alterman said  —   but he is involved in other projects. In addition to developing ABC’s   comedy “” he is an executive producer for HBO’s coming comedy “Insecure. ”'"}, "time": 1742564530.0219514}