{"duration": 0.16233611106872559, "input_args": {"text": "'President Obama is so disciplined that his wife has teased that he eats precisely seven lightly salted almonds each night. George W. Bush was an exercise buff, obsessed with staying trim by mountain biking and clearing brush at his ranch in Crawford, Tex. But Donald J. Trump is taking a different approach: A junk food aficionado, he is hoping to become the nation’s fast food president. “A ‘fish delight,’ sometimes, right?” Mr. Trump told Anderson Cooper at a CNN    meeting in February, extolling the virtues of McDonald’s. “The Big Macs are great. The Quarter Pounder. It’s great stuff. ” Mr. Trump’s presidential campaign is improvised, undisciplined, rushed and  . And so is his diet. In an era of gourmet dining and obsession with healthy ingredients, Mr. Trump is a throwback to an earlier, more carefree time in American eating, when nobody bothered to ask whether the tomatoes were locally grown, and the first lady certainly didn’t have a vegetable garden, complete with a bee hive, on the South Lawn of the White House. But in Facebook, Instagram and Twitter posts, Mr. Trump has broadcast his culinary preferences to the nation  —   devouring a bucket of Kentucky Fried Chicken (while reading The Wall Street Journal) feasting on a McDonald’s burger and fries (to celebrate clinching the Republican presidential nomination) and chowing down on a taco bowl (in an effort to woo Hispanic voters). He is a lover of diner fare and fast food grub, of overcooked steaks (“It would rock on the plate, it was so well done,” his longtime butler once observed) and the bland nourishment of Americana. He prefers burgers and meatloaf, Caesar salads and spaghetti, See’s Candies and Diet Coke. And he shuns tea, coffee and alcohol. But his highbrow, lowbrow image  —   of the   mogul who takes buckets of fried chicken onto his private plane with the   seatbelt buckles  —   is also a carefully crafted one. If President George Bush revealed his patrician upbringing by requesting “a splash” more coffee at a truck stop in New Hampshire, and John Kerry helped reinforce his image as a New England blue blood by trying to order a cheese steak with Swiss in South Philadelphia, Mr. Trump’s diet also telegraphs to his   base that he is one of them. “There’s nothing more American and more    than fast food,” said Russ Schriefer, a Republican strategist and ad maker. “It is the peculiarity of the brand that he’s able to be on his   jet with the gold and black branding and colors, and at the same time eat KFC  —   and what makes it perfect is he does it all with a knife and fork, while reading The Wall Street Journal. ” Or, as Kellyanne Conway, a senior adviser and pollster on the Trump campaign, put it, “It goes with his authenticity. ” “I don’t think Hillary Clinton would be eating Popeye’s biscuits and fried chicken,” she said. Last April, Mrs. Clinton did, indeed, visit a Chipotle near Toledo, Ohio, stopping into the chain restaurant unrecognized, in black sunglasses, and ordering a chicken burrito bowl. And President Bill Clinton was perhaps the nation’s first fast food commander in chief, famous for ending his jogs at McDonald’s. (Mr. Clinton now adheres to a largely vegan diet.) Still, Mr. Trump seems to come by his appetite for fast food genuinely. While junk food has long been a staple of campaign trail life  —   Mitt Romney’s 2012 press corps coined the term “slunch” to refer to the unhealthy phenomenon of the “second lunch”  —   Mr. Trump’s reliance on   fare is driven more by a combination of speed, efficiency and, above all else, cleanliness. Though he often orders from the Trump Grill when working out of Trump Tower in Manhattan, he eats fast food several times a week while on the road because “it’s quick,” as he told The Daily Mail last year while munching on Burger King on his Boeing  . Mr. Trump has even suggested doing away with state dinners, in a fit of cost and time savings. “We should be eating a hamburger on a conference table, and we should make better deals with China and others and forget the state dinners,” he said. A man always prone to distraction and uninterested in small details, he has never approached food as anything other than a problem to be solved, quickly, as Gov. Chris Christie of New Jersey, an occasional dining partner, once told The Washington Examiner. As the two men ate at   in Manhattan in 2002, Mr. Trump ordered briskly and imperiously from the head chef and owner, Mr. Christie recalled. “  remember the appetizer you made for me last week when I was here?” Mr. Trump asked the owner. “We’ll take two of those. And remember that main course you made, the special thing you made for me? We’ll take two of those, too. ” Mr. Christie watched with confusion and a bit of awe, he recalled in the interview. Mr. Trump looked at him and said, “Don’t worry, you’ll love it. ” But Mr. Trump, who frets about germs and prizes cleanliness, also loves fast food because of its consistency and the promise, at least, of a basic level of hygiene. “One bad hamburger, you can destroy McDonald’s. One bad hamburger, you take Wendy’s and all these other places and they’re out of business,” Mr. Trump told Mr. Cooper of CNN. “I’m a very clean person. I like cleanliness, and I think you’re better off going there than maybe someplace that you have no idea where the food’s coming from. It’s a certain standard. ” Still, he added, “I think the food’s good. ” Mr. Trump’s dining habits also bespeak a certain lack of creativity, and parochialism  —   the kid from Queens who made it across the river to Manhattan’s glistening skyline, but never cottoned to the city’s haute cuisine. He once praised the “imagination” of his wife, Melania, in the kitchen  —   before citing, as examples of her culinary   spaghetti and meat sauce, salads and meatloaf. (He still keeps a copy of his mother’s meatloaf recipe.) Along with McDonald’s, his favorite fast food joint, a family member said, is Jackson Hole Burgers. He is also a stickler for manners, attacking his primary race rival, Gov. John Kasich of Ohio, for scarfing down meals during impromptu news conferences. “I’ve never seen a human being eat in such a disgusting fashion!” Mr. Trump told a crowd. And Mr. Trump, who sometimes sips his Diet Coke through a straw, once caused Manhattan foodies to weep into their quinoa when he took Sarah Palin to a Famous Famiglia pizza restaurant in Times Square  —   and then proceeded to cut his oversize slice with a plastic knife and fork. He has other pretensions, as well. Howie Carr, a Boston Herald columnist, recalled traveling on Mr. Trump’s plane and watching him rip the buns off his McDonald’s patties before plying the burgers with ketchup. (“Do you know how many calories you save that way?” Mr. Trump asked Mr. Carr.) And Mr. Trump also told US Weekly that he tries to save calories on pizza. (“I scrape the toppings off my pizza  —   I never eat the dough,” he said.) So pronounced are Mr. Trump’s fast food preferences that Philip E. Beshara, a   lawyer, joked on Instagram that, as president, his cabinet would probably be staffed by Colonel Sanders, the Hamburglar and the Taco Bell Chihuahua. And, of course, the Republican nominee’s dining whims also keep his team on its toes, with staff members worrying not just about the backdrop for his speeches  —   but also where to find the nearest  . “There’s never any real planning for food,” said one, between events on Friday. “It’s always just whatever he is craving, which is more often than not McDonald’s. ”'"}, "time": 1742563727.8699465}