{"duration": 0.09901309013366699, "input_args": {"text": "'BREAKING : Hillary Clinton Had her MAID Print CLASSIFIED INFORMATION BREAKING : Hillary Clinton Had her MAID Print CLASSIFIED INFORMATION Breaking News By Amy Moreno November 6, 2016 \\nThe ineptitude and dangerous, reckless behavior of this nincompoop Hillary Clinton grows stronger every day. \\nJust when you think her stupidity and carelessness can’t get any worse, it does. \\nWe’re now learning that Hillary Clinton HAD HER MAID PRINT OUT CLASSIFIED INFORMATION. \\nThat’s right – one more time….. \\nHillary Clinton had her MAID print out CLASSIFIED INFORMATION. \\nShe should be disqualified immediately. \\nFrom the NY Post: \\nAs secretary of state, Hillary Clinton routinely asked her maid to print out sensitive government e-mails and documents — including ones containing classified information — from her house in Washington, DC, e-mails and FBI memos show. But the housekeeper lacked the security clearance to handle such material. \\nIn fact, Marina Santos was called on so frequently to receive e-mails that she may hold the secrets to E-mailgate — if only the FBI and Congress would subpoena her and the equipment she used. \\nClinton entrusted far more than the care of her DC residence, known as Whitehaven, to Santos. She expected the Filipino immigrant to handle state secrets, further opening the Democratic presidential nominee to criticism that she played fast and loose with national security. \\nClinton would first receive highly sensitive e-mails from top aides at the State Department and then request that they, in turn, forward the messages and any attached documents to Santos to print out for her at the home. \\nAmong other things, Clinton requested Santos print out drafts of her speeches, confidential memos and “call sheets” — background information and talking points prepared for the secretary of state in advance of a phone call with a foreign head of state. \\n“Pls ask Marina to print for me in am,” Clinton e-mailed top aide Huma Abedin regarding a redacted 2011 message marked sensitive but unclassified. \\nIn a classified 2012 e-mail dealing with the new president of Malawi, another Clinton aide, Monica Hanley, advised Clinton, “We can ask Marina to print this.” \\n“Revisions to the Iran points” was the subject line of a classified April 2012 e-mail to Clinton from Hanley. In it, the text reads, “Marina is trying to print for you.” \\nBoth classified e-mails were marked “confidential,” the tier below “secret” or “top secret.” \\nSantos also had access to a highly secure room called an SCIF (sensitive compartmented information facility) that diplomatic security agents set up at Whitehaven, according to FBI notes from an interview with Abedin. \\nFrom within the SCIF, Santos — who had no clearance — “collected documents from the secure facsimile machine for Clinton,” the FBI notes revealed. \\nJust how sensitive were the papers Santos presumably handled? The FBI noted Clinton periodically received the Presidential Daily Brief — a top-secret document prepared by the CIA and other US intelligence agencies — via the secure fax. \\nA 2012 “sensitive” but unclassified e-mail from Hanley to Clinton refers to a fax the staff wanted Clinton “to see before your Netanyahu mtg. Marina will grab for you.” \\nYet it appears Clinton was never asked by the FBI in its yearlong investigation to turn over the iMac Santos used to receive the e-mails, or the printer she used to print out the documents, or the printouts themselves \\nAs The Post first reported, copies of Clinton’s 33,000 allegedly destroyed e-mails still exist in other locations and could be recovered if investigators were turned loose to seize them. Higher-ups at the Justice Department reportedly have blocked them from obtaining search warrants to obtain the evidence. \\nIt also appears the FBI did not formally interview Santos as a key witness in its investigation. \\nThis is a major oversight: Santos may know the whereabouts of a missing Apple MacBook laptop and USB flash drive that contain all of Clinton’s e-mails archived over her four years in office. \\nIn 2013, Hanley downloaded Clinton’s e-mails from her private server to the MacBook and flash drive. \\n“The two copies of the Clinton e-mail archive (one on the archive laptop and one on the thumb drive) were intended to be stored in Clinton’s Chappaqua and Whitehaven residences,” the FBI said in its case summary. \\nBut Hanley says the devices were “lost,” and the FBI says it “does not have either item in its possession.” \\nIn addition to Abedin, Santos worked closely with Hanley at Whitehaven and could shed light on the mystery — if only she were asked about it. \\nMy god. \\nAt this point, WHO hasn’t seen our classified information? \\nPerhaps that would be a shorter, more manageable list. This is a movement – we are the political OUTSIDERS fighting against the FAILED GLOBAL ESTABLISHMENT! Join the resistance and help us fight to put America First! Amy Moreno is a Published Author , Pug Lover & Game of Thrones Nerd. You can follow her on Twitter here and Facebook here . Support the Trump Movement and help us fight Liberal Media Bias. Please LIKE and SHARE this story on Facebook or Twitter. '"}, "time": 1742563814.8950534}