{"duration": 0.04735922813415527, "input_args": {"text": "'Email \\nThe mothers referred to in the title of Brit Bennett’s folksy novel are witnesses, observers but also communal biddies who narrate much of story from a self-righteousness of assumed superiority. They’re members of the Upper Room, a black church in San Diego, who clearly do much good helping the sick and the elderly. There’s no place for error (especially regarding sexual morality) in their eyes, which means that they are particularly hard on the younger generation that has grown up with a less rigid sense of promiscuity. Their harsh condemnation is strong enough to destroy the very church that has been the center of their friendships, their religious community. Since the time frame for the novel is contemporary—or quite recently—the women referred to in the title also represent a dying breed, presumably the final generation with such religious dedication. I felt the same way about The Mothers as I did about J. D. Vance’s Hillbilly Elegy (which I reviewed in CounterPunch , September 16 th ): another pocket of America that has been left behind. Hard to tell if this is reason for celebration or consternation. \\nThe adult male of major consequence in the story is Robert Turner, known “around Upper Room as the man with the truck, a black Chevy pickup that had become Upper Room’s truck because of how often Robert was seen driving from church, an arm hanging out of the window, the truck bed filled with food baskets or donated clothes or metal chairs.” He’s a good man, who can always be relied upon to lend a helping hand. Even Robert himself believed that his truck “had turned things around for him,” because his wife blew her brains out, and his truck made it possible for him to help others and get his mind off his own pain. No explanation is ever provided for the woman’s suicide. \\nThe Upper Room is successful, a bulwark for part of the city’s black population. Pastor Sheppard and his wife, Latrice (known as “First Lady”) are models of decorum. The story’s focus is not race but morality, though an occasional glib remark does place the story within a racial context. The first family’s son, Luke, is, indeed, the stereotypical wild young man, whose father is a preacher. Luke is described as “reckless,” followed by a remark that brings up race: “Black boys couldn’t afford to be reckless,” his mother told him. “Reckless white boys became politicians and bankers, reckless black boys became dead.” The major theme of the novel is extended a few paragraphs later. “A daughter grows older and draws nearer to her mother, until she gradually overlaps like a sewing pattern. But a son becomes some irreparably separate thing.” That’s some rather nice writing. \\nBennett illustrates her observation by shifting the narration to Luke and Nadia Turner, motherless because of her mother’s suicide. Luke was a star athlete, but a broken leg on the football field ended his scholarship and, hence, his academic career. He’s returned home, to live with his parents, and assist in their work at the Upper Room. Nadia, who is several years younger, has been awarded a scholarship to go to Michigan, but she earned the scholarship because of her intellect, not for athletics. The predictable occurs. Luke gets Nadia pregnant, which might not be such an awful thing were it not for Luke’s religious upbringing. \\nThereafter, the story probes numerous layers of guilt involving the characters already mentioned, in part because of Nadia’s decision to have an abortion. She leaves her community to attend the university in Michigan, then goes on to earn a law degree. Luke stays in San Diego, holding down various positions that are mostly unrewarding. Both of them were friends, at separate times, of another young woman named Aubrey, and the lives of all three become gnarled together, mostly because of deceit. It takes a number of years before the errors of the past become known to all three of them, and—when it does—new jealousies and additional guilt emerge. All three lives are also entwined with the Upper Room, which largely becomes a cage for them, not the liberating force it might have become. \\nThe attitudes toward religion in The Mothers (“Anyone knows a church is only as good as its women, and when we all passed on to glory, who would hold this church up”) are conflicting, largely because of the times in which we live. The novel has appeared with an enormous amount of hype that I’m not certain it deserved. The story itself peters out well before you turn the final page.'"}, "time": 1742628532.9554975}