{"duration": 0.06280159950256348, "input_args": {"text": "'Getty - Chip Somodevilla \\nApproximately 300 members of the media today followed Donald Trump to his Washington, D.C., hotel to watch the candidate and his family officially cut the ribbon on the Pennsylvania Avenue property. \\nPrior to the ceremonial cutting, the ever-effusive Trump had high praise ... for the scissors. \\n“I\\'ve never seen scissors that look this beautiful before,” he said, gazing at the gilded, oversized cutters. Donald Trump, Melania Trump, and Tiffany Trump cut the ribbon at the Trump International Hotel, Washington, D.C. today. Image Credit: Getty Images \\nTrump was taking a brief break from the campaign trail before heading to North Carolina Wednesday afternoon for a rally. \\nThe 263-room Washington Trump hotel is in the historic Old Post Office Building, which Trump\\'s organization, led primarily by his eldest daughter, Ivanka Trump, overhauled in a two-year, $200 million redevelopment. Ivanka Trump gets a congratulatory kiss from her father Wednesday at the official opening of the Trump\\'s Washington, D.C. luxury hotel. Image Credit: Chip Somodevilla/Getty Images \\nTrump\\'s speech today was focused mainly on the new property, but he did take a moment to needle the seeming demise of Obamacare, which was come under scrutiny this week for anticipated monstrous premium hikes. Trump talks politics: \"it was just announced #ObamaCare is in free fall … unaffordable, unusable, and cant use it if you can afford\" — Chris Snyder (@ChrisSnyderFox) October 26, 2016 \\nTrump also made sure to note the presence of Newt Gingrich in the audience at the event, congratulating him by name for the on-air verbal scuffle he had with Fox News host Megyn Kelly last night on the talk show host\\'s program. \\n“Congratulations, Newt, on last night. That was an amazing interview. We don\\'t play games, Newt, right?” \\nGingrich sparred with Kelly over her referring to accusations against Trump by several women claiming various degrees of sexual harassment and other incidents. Kelly shot back that Gingrich, former GOP Speaker of the House, should take care of his “anger issues.” For the record, @megynkelly was wrong, i don\\'t have anger management issues. I do have media bias issues! — Newt Gingrich (@newtgingrich) October 26, 2016 \\nMeanwhile, the White House also weighed in on the new Trump International Hotel in Washington—press secretary Josh Earnest was asked at the daily briefing about his thoughts on the proximity to the White House of Trump\\'s property. \\n“[It\\'s] not too far away. Well, in some ways, it\\'s a really long way away, depending how you look at it.” \\nThe hotel is literally a handful of blocks from Presidential headquarters at the White House. Earnest, however, was speaking metaphorically. '"}, "time": 1742563953.5467386}