{"duration": 0.5190210342407227, "input_args": {"text": "'Leave a reply \\nLisa Renee – This month, we learn more about Increasing Sentience and the main collective consciousness forces involved in spiritual warfare on this earth. Currently massive internal power shifts are occurring that reorganize the hierarchy of the main players, in the Controller groups, that have been exerting the dominate world power. \\nThe shake up within the Power Elite network is revealing the darkest underbelly of deception, corruption, bribery and disturbing abuses of power that include clear evidence of Satanic Ritual practices. \\nFor those unprepared for the layers of disclosure and revelations of the greater truth that exists in the highest echelons of the power brokers, such as those players in government, politics, finance, high society, and entertainment, these can be painful and desperate times. If we look to the surface, the deceptions of the 3D façade are crumbling away and those with the eyes to see, are observing how far down the rabbit hole really goes. These are the darkest areas filled with many different narratives of gross abuses of power and deceptions, being carried out through the mainstream media to brainwash people into believing that we live in a free society. \\nMany are breaking away from the mainstream now, desperate to find some truth or clarity in the alternatives. They have realized that they are being intentionally deceived by those people in power by those in whom they had placed trust. Humans are not living freely on this earth. This thrusts our focus to the unpleasant and painful truths of the crimes committed against humanity, and that as a species we must come to recognize and identify the cause. \\nIf we cannot see what it is and we cannot identify these crimes, this hidden scourge keeps using the same lies and manipulation to cover up the truth. We must do our best to stay awake through the Dark Night of the Planetary Soul, as this is what the stages of disclosure look like. However, as we observe these disturbing dramas, we must not overwhelm our emotions to polarize our consciousness into feeding the victim archetypes of hero, savior or enemy. This is the phase of dismantling the control system, and observing the shake down of what has been hiding behind 3D consciousness. As the internal fighting for control continues, it will reveal more to us every day, about the true nature of this reality. \\nThis is a time to be brave, courageous, calm and self-aware as truth seekers. A time to dedicate ourselves to serve our inner spirit with every breath and know which consciousness we want to co-create. We are in this together. \\nIt is a natural biological process for all human beings to have the ability to constantly evolve themselves and expand their individual consciousness, through experiences that awaken greater self-awareness. As a person grows to perceive levels of awareness beyond the survival needs and desires of the individual self, they begin to perceive the larger collective layers to which they are interconnected, which in turn, increases their level of sentience. Increasing Sentience increases our perceived connection to the whole and continually develops our self-awareness, which is relative to the reflection of the collective consciousness. \\nWhen we are Increasing Sentience into greater enlightenment, we have knowing that every thought and action we choose is directly connected to the whole, as we are co-creators of our world. As we gain embodiment of personal truth to expand consciousness, we gain more influence to help shape the collective consciousness we are interconnected with. \\nWhen we observe the state of the world today, all of humanity has to reflect on the causal chains and spiritual reasons for the current state of the collective human race consciousness. How did the people on the earth create the conditions to become the global reflection that is shown in the collective consciousness today? How are the World Leaders chosen and how do they remain in power? \\nHow did earthlings, become defined by those in the intergalactic community as mass murderers, war mongers, crucifiers, killers of life and nature, without remorse or empathy? When we ask these questions with a sincere heart, we will be confronted with many unpleasant truths about humanities true history. Sentience Redefined \\nScience defines sentience in the limited capacity of the personality’s ability to think and to feel, to perceive and directly experience something that exists purely in the realm of the subjective mind and physical senses. In our interpretation, sentience encompasses the consciousness existence of all living things. Whether in form or formless, this includes all beings and forces that have some level of consciousness. Thus, the term sentient beings may constitute many dissimilar classes of species, existing at different levels of consciousness. It will also include many diverse energetic forces, which characterize the nature of multidimensional existence. \\nAs an example the physical body, emotional body, mental body and spiritual body, all encompass multidimensional levels of sentience that correlate to the overall functioning of consciousness that make up an entire person. Each multidimensional layer of a person, whether physical, mental, emotional or spiritual, reveals sentient information that is intrinsically connected to the collective consciousness, yet remains energetically unique to that individual. \\nWhen we recognize our multidimensional identities, we start to see that all of these layers are energetically connected to larger bodies that make up the forces of collective consciousness memories. When we open the door to multidimensional consciousness, we go beyond individual consciousness or ego. We begin to sense the collective forces of nature; such as the animal collective, race collective, planetary collective, solar system collective, galactic collective and cosmic collective. \\nAll of these layers of collective consciousness and many more, can be contacted telepathically and made accessible from inside of our multidimensional consciousness body layers. When we know that these many layers of collective consciousness co-exist, it opens the dimensional doorway to explore all kinds of sentient beings. \\nWe progressively recognize that we are coexisting with many worlds teaming with life, beyond our wildest imagination. We can learn how to speak and communicate telepathically with any part of this collective consciousness, if we really care to devote the time to train our mind and set our heart based intention to do so. As we discern the existence of the collective consciousness, we learn who we truly are as multidimensional spiritual beings and how we co-create our reality. Discerning Collective Consciousness \\nAlthough the untrained mind can only sense direct physical attributes, the true morphogenesis of our multidimensional existence is generated through the multiple levels of sentience. Together these form into the entire collective consciousness identity, or that from which we gather to form the experience of a self. As we grow our capacity to perceive the collective consciousness layers that exist as interconnected to the self, we no longer define as being attached to an individual self. Because ultimately, the realization is reached that there is no individual self. We are multidimensional consciousness connected to many different streams of sentience that generate the entirety of the collective consciousness agreement, which we experience on the earth. \\nThrough continually increasing our sentience to gain enlightenment, we can discern the energetic quality of collective consciousness that we prefer to align with and express through our consciousness body. Thus, in the consciousness evolution process we gain spiritual sovereignty and free will choice. Whereby, removing ourselves from the superimpositional forces of the larger collective consciousness matrix that others have chosen to express, which are no longer congruent to our essential nature. \\nWithout exercising personal choice that comes from developed energetic discernment, an individual is left to express the larger impersonal forces of the collective unconsciousness and the controlled manipulation of impersonal forces in the environment. Through the physics of the energetic reality, the person expresses the core energetic resonance they embody, which harmonizes with the larger collective consciousness body, which they attract. \\nTo have choice beyond the collective unconsciousness matrix, one must develop higher sentience towards greater enlightenment, and begin to perceive how the layers of the collective consciousness function throughout creation. Enlightenment in this context refers to being released from the confines of service to self, suffering, dark ignorance, attachment to material things, and the state of soul disconnection. The same states that reinforce the continued cycles of death and reincarnation into the lower realms, without consciousness memories, identities or spiritual purpose remaining intact. It means we are released from the states of consciousness, which exist in the larger collective unconsciousness. \\nThe collective unconsciousness body of the earth is evolving to reflect the change in the collective consciousness consensus agreement, to shift human consciousness into the next harmonic universe. This consciousness shift reclaims the soul aspects in order to embody the entire collective soul matrix into the matter worlds. Imagine who you would be if you remembered all of your other lifetimes, had direct soul realization and could access that repository of knowledge at will. That is the groundwork being laid for the future direction for the ascending timelines, and the continued evolution of the human race on this planet. Self-Realization by Feeling what Others Feel \\nIncreasing sentience is a sensory quality of higher consciousness intelligence and refined thought, through which one can perceive the emotions, feelings and consciousness state of other living things. When the higher consciousness perception of feelings is sensed and directly experienced, the realized person develops the metaphysical understanding that we are energetically interconnected with all of life. \\nWe begin to feel and experience that which previously appeared separate and inanimate, as an actual living thing and thus, a sentient being. By focusing on increasing personal sentience, we greatly extend our higher sensory experiences, which include deeply feeling or perceiving the consciousness states and experiences of other people, things, animals and nature. When we gain access to our soul and spiritual forces, we start to feel our interconnectedness to the energetic reality of all existence and all things even more. This leads us to the next stage of perceiving information that exists within the sentience of group consciousness intelligence, which make up the many layers of collective consciousness to which we are connected. \\nSentience means that as we evolve to gain deeper knowledge about the true nature of our individual consciousness, we also realize that we are intricately and permanently linked into the collective consciousness. These dual states of existence can be observed inside ourselves, as both an individual aspect and collective self, while the body is in motion the observer is always witnessing. \\nThese simultaneous consciousness states are interconnected and forever entwined as a part of what we really are, as multidimensional consciousness. Through dedicated observation of the self and gradually discerning between these functioning aspects of the mind, one can attain the direct experience or gnosis, to gain knowledge of the collective consciousness they are connected with. One has to feel what others are feeling in order to truly know the collective consciousness, and discern the energetic subtleties, which transmit intelligent information. Collective Consciousness Co-Creation of Timelines \\nIncreasing sentience is also directly related to the quality of the energetic content that is recorded as the collective memory in the planetary body. The level of sentience we generally have is interconnected with the quality of memory that is available for us to recall that is recorded in the collective consciousness of the planet. However, humanities DNA has been unplugged and unable to read the information and content that is recorded in the collective consciousness of the planet. \\nThis is one reason Starseeds have come to earth, because many of us can read and sense the contents in the collective consciousness, and we know that which has been programmed with AI machinery to mind control the population, is not organic to creation. The human species blueprint has been undergoing erasure to gradually be replaced with new identities and archetypes created from AI software, that resemble the minds of criminals. The people of earth have been given historical records and religious books that are deceptions based upon the invaders alien approved architecture for takeover. \\nEssentially, as the result, the whole of the human species cannot remember who they are and where they come from and have adopted the false identity given to them by the invaders. This has generated an extreme amount of accumulated energetic confusion in the human species memories, recorded in the collective consciousness fields. Those memories became the general content for earth human consciousness expression and are organized into spectrums of frequency that form dimensions of time, or timelines. \\nThis overall content in timelines exists through the connection it has to those people, who co-created with these forces, in the fields that make up the collective consciousness. Every person that has lived on the earth is a co-creator with the world of forces that expresses itself in the collective consciousness. We all are responsible for what we co-create with the collective forces, what we express through our consciousness body. The NAA invaders and their human representatives have been working hard to erase their crimes against humanity in the collective consciousness records. However, the consciousness records cannot be erased because there are those from the founder lineages who are able to read them, even when the content has had many attempts to be destroyed. \\nAs we awaken to the reality of group consciousness, the question becomes, what force are we expressing? What are we co-creating with, and what is growing as the collective consciousness on the planet? The unawakened person expresses the forces the collective consciousness programming tells him to, until he awakens the choice, to be in consent with his own spirit. \\nThus, the timelines are formed by the blueprints that are created by the collective consciousness matrices and all the variances of co-creators that exist in the entire planetary body. During this cycle, the majority of humanity has been spiritually oppressed and enslaved to express the software machinery programming placed in the collective consciousness fields, thus, the role of right co-creatorship has been essentially stolen. \\nThese collective consciousness matrices include the sum total of unconsciousness, artificial intelligence machinery and software, and that energetic content that has been co-created from human, nonhuman and AI sources. Thus, the collective consciousness matrices have included those influences of genetic modification through mind control that have been shaped and formed by non-humans. \\nThose entities are not from the gene pool of the human species, and via interdimensional means, their agenda is hidden from the general human population. In order to understand bio-neurological mind control generated through psychotronic warfare and electronic harassment, it is imperative to comprehend the collective consciousness fields and how they operate in the earth as consciousness bodies. The planetary consciousness bodies, or collective consciousness matrices, directly impact the functioning of the individual human being’s consciousness bodies. \\nEssentially, the planet has been subjected to non-human co-creators that have decided to modify DNA in the morphogenetic fields, in order to use the true co-creators of this planet to shape the collective consciousness, to conform to their anti-human and anti-soul agendas. By controlling the collective consciousness fields on the earth with AI mind control, they manage to gain control over the direction of timelines by controlling what kind of consciousness is being fed into the collective. The bifurcation is splitting apart the areas they have gained AI control over on the earth. Their territory gets smaller as it moves away from the higher ascending regions. \\nWhat we can observe in the collective consciousness matrices currently, is the accumulative result of alien hybridization, refugee race migration, cloning, genetic modification and AI experimentation that has been made into the collective consciousness fields and the morphogenetic imprints of the planet. That which impacts the planet impacts the species of inhabitants, and so that interference has directly impacted the functioning of human consciousness and the original human DNA. Humanity has been genetically modified and socially engineered to be slaves, war-mongers, predatorial and violent, in order to remove the empathy and collective spirit that connects us with our own species and interconnects us directly with the Godhead. Collective Consciousness Gnosis \\nThe collective consciousness exists in the many multidimensional layers that can be perceived through spiritual gnosis as the historical events, or the many accumulated memories recorded over cycles of time. These unseen and unwritten historical events can be directly cognized through higher consciousness experiences. When a human expands consciousness through biological spiritual evolution, that person begins to potentially have the sentience to know how people and animals suffer, because they can experience the pain inside themselves that they simultaneously feel existing inside of others. \\nThe person that can identify and feel the pain of others, can feel the same pain inside themself, and thus knows, all humans suffer from the same source of pain and are not separate. This is the early stage of Gnosis, and one cannot know how it feels, until they are able to feel and experience what others are feeling inside themselves. As we gain the spiritual qualities of empathy, which are higher sensory abilities that allow us to feel the consciousness state of others, we may expand our sentient abilities to perceive the intelligent content that encompasses the records in the collective consciousness. \\nWe are only able to gain direct knowledge of the planet through gnosis, which occurs when an awakened person experiences what it feels like to be involved in some kind of event, circumstance or situation, from some vantage point in consciousness. Only people that have developed pure hearts of empathy are truly capable of the gnosis in which they gain intelligent information about the timelines, historical events on planet, and what is happening to the collectives of species, such as people and living things. \\nAs an example, an empathic person can meditate or stand in an area of ley lines, or nodal points on the planetary grid, and feel intelligent information relaying back to them from the collective consciousness records connected to that area. If we stand in an area of the earth that has been filled with tragedy, death and war, we can feel the incredible pain and suffering of all of the people, nature kingdoms and animals involved. \\nMany times the people that died in painful tragedies in the past are still earthbound and trapped in that pain, unable to evolve their spirit into a future timeline. That person’s soul or energy body has become trapped in time, trapped in the matter realms of the earth body. When an awakened person has empathic experiences and can feel the direct result of massive trauma and emotional pain that is created in the collective consciousness, that person has only one choice, to do what they can to be of service to others. \\nThese spiritual experiences cannot be translated to an unawakened person, because it is all about direct sensory experiences of communications that are held in the context of intelligent energy and sentient beings. These methods of higher sensory perception and telepathic communication are that which still remain invisible to the 3D person’s ego and linear mind. \\nTrue spiritual empathy is the key that gives the awakening person access to some layer of the Akashic records, and these memory records exist in every collective entity, structure, and person on the planet. \\nThe collective consciousness of any person, place or thing, will give access to memory records and layers of the Akashic, that are connected to those particular consciousness bodies. As many people awaken on this planet, they do not want to feel what has really happened to themselves and to the planet, because it is painful to witness. However, this is the only path that grants access, where we gain truth and empathy. We must see the truth of what has happened in the past, in order to know what the truth is and feel the impacts. The compassionate witness does not judge what has happened, but deeply feels the consciousness experience that is the truth behind the events. The truth of motivation is always seen in the intention of what event has transpired, and so even in deceptions, great truths can be revealed. \\nWe gain knowledge about ourselves, knowledge about others, knowledge about the history of our planet, knowledge of the Solar System and knowledge about the timelines in the Universe, by experiencing the direct sentient feelings of empathy, which is experienced as the consciousness reality that exists inside of ourselves. Love is the ultimate carrier wave of great knowledge, and through an awakened and open heart, pouring forth love, compassion and empathy for all of life, the esoteric mysteries are revealed to the true and sincere spiritual seeker that embodies empathy and compassion. Living in the Truth We Experience \\nThe process of empathizing with the emotions and the feelings of others, sensing the greater reality to which we are connected, is the process through which we begin to embody the quality of empathy. Empathy is a function of our soul, and as we gain sentience and knowledge about the sensory nature of reality, we connect to both subjective and objective states of our higher consciousness. \\nIf you cannot feel it, if you cannot empathize with an experience or feeling, you will not know it. Thus, that person is unable to embody that memory or knowledge because this has to be experienced directly by our consciousness, in order to gain Gnosis or truth. A person, who increases sentience through the feelings of direct sensory experiences, has gained knowledge through direct feeling, living or experiencing that content at some level in their consciousness. \\nOnce we have experienced Gnosis, we must live by our authentic knowledge and experience of truth, in order to be coherent and live in harmony with the natural laws. If we do not live in congruence with the knowledge we have gained that reveals the truth inside of ourselves not only will personal frequency digress rapidly but sentience will be lost through the disconnection that occurs between the mind and spirit. When we cannot express or live in our spiritual truth, we suffer greatly. \\nConceptual or intellectual knowledge taken from linear methods, acquired through books or academics is not true knowing. Once direct knowing is experienced in our higher consciousness, it is a truth. It cannot be permanently erased or taken away from the core body blueprint or Akashic record of that individual. \\nDuring the planetary ascension cycle, humanity is ascending into higher consciousness, but is actually descending the intelligent energy that exits within the Akashic blueprint of our higher identity. This is described as raising our frequency vibration, and as we learn how creation works, we connect to our higher consciousness or divinity to embody the purpose of our being into the physical vehicle. Morphogenesis \\nMorphogenesis means the generation of form, and it is used to describe the biological process that causes any organism or living thing to develop its shape and structure. In our world that is composed of pure vibrating energy, morphogenesis can also be applied to describe the process of resonance that causes any quality of energy to develop into its main form of expression, through its particular frequency. Everything has an energetic signature and is composed of spectrums of frequency that are arranged in form holding blueprints. \\nMorphogenesis describes the process of how the shape is being formed by the quality of energy being expressed, once the energy starts to become physical or change its form. Morphogenesis depends on the quality and state of the systems of energy that are being organized into the fields. In our context, when any kind of energy or level of consciousness is being generated into the physical, it can be in form or formless, and this is sensed from beyond the main physical senses. \\nMost people cannot visibly see the light and energy of the human soul entering the first breath of a newly born baby, as much as they cannot visibly see the light and energy of the soul leaving the body during the last breath. Yet, this event of consciousness morphogenesis, energy transitioning into another form, occurs in the natural cycles of life, all of the time. \\nIt is important to understand that in our world, and in all creation, that all systems of energy are connected to larger systems of energy, that help to organize and define what that consciousness energy will become. This means that all microcosmic systems of energy are directly connected to larger macrocosmic systems of energy. As an example, if one desires to change the morphogenesis process (how energy comes into physical) that existed in a microcosmic system of energy, the controller would first make changes to the morphogenesis process that exists in the macrocosmic systems of energy. \\nTo change something being manifested in the microcosm or at the individual creation level, one must first go to the macrocosm or collective creation level that influences it. Smaller systems belong to larger systems, and this applies to all energy and consciousness. Individual consciousness always belongs to some part of the macrocosm of a larger collective consciousness, and that larger collective field will organize, define and influence the person’s identity at the microcosm level. \\nThe collective field influence can easily take over the individual’s behavior and then the group’s behavior, especially when that individual and group has been stripped of their real identity. Without that clarity, the individual has no choice given to them, on which collective consciousness fields they form energetic consent to participate with, especially when their consciousness is being stolen from them and drained. The person believes they are in consent with the earth and the human race, without knowing that there is an alien AI influence siphoning their energy and controlling their mind in the collective consciousness programing. \\nThis is the reiteration of the earlier discussion that there really is no self, as the ego personality believes, because the ego is especially influenced and even controlled through the many assortments of collective consciousness forces, some benevolent, others not. Most people at this time are unaware that all energetic systems obey architecture, that personal and group consciousness function within the macrocosm of much larger energetic hierarchies, to which we are all interconnected. All cells come from other cells and all cells inherit fields of organization. Human bodies are the nerve cells of the planetary body and we inherited the larger fields of organization from the state of the world consciousness or Planetary Logos. \\nThis is also what influences the microcosm of our beliefs systems, archetypal expressions and standards of human behavior that organize into the macrocosm of societal structures. As humans living on this planet, we are inseparable from every single event recorded, as it transpires in the timeline histories, each one of us exist as the cellular memory recorded into the nerve cells of the planet. Thus, when we incarnate, we have the entire planetary history recorded in our nervous system and within the holographic layers of our consciousness body, even when we cannot remember them in our conscious mind. Energy and Intent produces Sentient Beings \\nEnergy is given form in the world through the expressions made in our body, from inner expressions of energy, we externalize the energy that we have created inside of ourselves. Through the level of consciousness and frequency we choose to be, which is defined by our choices moment to moment, the accumulated energy forms itself into a consciousness identity. \\nWe bring energy into matter by giving it some form of expression, through one or more layers of our consciousness bodies. All energy undergoes morphogenesis as it is expressed through our consciousness vehicle. Our energy is given form in matter through our mental thoughts, emotional feelings or through our physical actions. When we give expression to energy, that energy becomes conscious in matter and thus, it becomes a part of the world that we create for ourselves and for others. All humans generate energy expressions that can also become conscious creations, and even sentient beings, whether they are seen in matter or unseen. \\nMany people do not realize that the energy and intent behind thoughts, emotions and actions can generate things, and even creatures. Depending on the intention, strength of mind and emotion, as well as the power of spiritual intent, those ingredients will dictate the strength of the energy being generated, into some kind of form or creature. \\nAn angry and violent person who is unaware of ritual magik can conjure demonic entities that send negative curses or negative energies to another person, without having full conscious awareness they have done so. While black magicians use ritual magik for the intent of conjuring these types of creatures, out of the collective and individual energy streams that have been expressly created, or were specified by the intent of the ritual. \\nIt doesn’t matter if we are unconscious, awake or asleep, or do not believe spiritual forces or collective energies exist, we are all contributing, collaborating and co-creating with the many forces that exist in this world, in every possible shade and gradation of light and dark. The direction of energy or intent can evolve into some form of sentient being when it is fed into the collective consciousness, which animates it into some kind of form. That animated form can be used against us when we do not understand how we have created it from our own energy. \\nIf we send out the energy intent of hatred to another person, the frequency of hate through morphogenesis can take the form of an etheric weapon. Those etheric weapons will be cast upon the energy field or aura of that person, being directed with the energy of hatred. Further, the world of forces such as satanic or alien forces will see that etheric weapon and twist it into the person even further, to create more pain or etheric damage. This is an example of how our own energy can be used against us, without our awareness of what we are actually participating with. \\nThrough every thought we generate and every action we make, we are giving some form of expression to a quality of energy that exists in our consciousness and simultaneously, exists in the world consciousness. Every person on the earth, now and through all time and space is a nerve cell of this planet that contributed to the co-creation of content, making up the world consciousness. The world consciousness is what has been co-created through what we see reflected through the entirety of all of the collective consciousness expressions in all of the inhabitants of this earth. Discerning Bi-Wave (Polarity) or Tri-Wave Energy (Neutral) \\nThe kind of consciousness energy that we express through our body can be better understood by studying the natural laws that govern the forces of polarity through archetypes. The Natural Law of Polarity is also referred to as the Law of Pairs of Opposites. One will notice the same repeated pattern in absolutely every energetic force or form in matter. Every person, place or thing will have an energetic polarity that is balanced or weighted in one form of energetic polarity or it’s opposite. This is represented also within our gender bodies, which expresses as a polarity in matter form (male or female). While our physical body exists in one polarity form in matter, our internal energies exist in both male and female principles. \\nAs we evolve, we want to transmute the expression of the forces of polarity through our consciousness body, by choosing to unify them by expressing and holding neutrality. When we are conscious of the energetic polarity of forces to which we are being exposed, we can identify and internalize them by choosing the neutral association, which unifies the energy pattern to the most harmonious resonance. However, on the path of gnosis, we want to pay clear attention to what all energy feels like when it is being sensed or felt by our consciousness. \\nWe want to know what our consciousness is feeling when we are exposed to other people, groups or collective consciousness programs. It is very important to pay attention to how you feel when exposed to different qualities of energy, in order to become trained and able to identify how subtle forces of energy feel. As one develops this feeling sensory skill, it leads to more accurate assessments in identifying when energetic forces are either of light, dark or neutral qualities. When this is able to be identified, then one can move to discerning the frequency in the polarity that exists between light and dark, as bi-wave consciousness, or the neutral or zero point that exits in the tri-wave consciousness. \\nWhen you identify the quality of energy that you are being exposed to, that means you have a conscious choice of what energy you want to express and collaborate with in the collective consciousness. This is the path to gain spiritual sovereignty through self-awareness by participating with personal choice and responsibility. When a person cannot identify energy and choose the quality of consciousness they want to express, they become a vehicle for expressing the lowest possible frequencies in the collective unconsciousness. Thus, they are easily manipulated and possessed by dark forces, which lead them around in servitude through their base desires and impulses. \\nCan you feel when energy is artificial, parasitic, deceptive, or negative? Can you feel when energy feels natural, truthful, honest and positive? There is a tremendous complexity with energy signatures that hold both light and dark, however, the most important attribute is to discern personal resonance. What does it feel like, is it resonant or is it discordant to your consciousness? \\nHow much do you value truth and are willing to face the truth even when it’s painful or unpleasant? Unpleasant truths when stating accurate facts neutrally and in the interest of truthful transparency is positive energy. We have to remember that being purposely deceived in any way is negative energy, even when we are being fed lies that seem pretty and make us feel better temporarily. The truth spirit tells the truth no matter how unpleasant it may be, while the deceiving spirit tells lies no matter what the truth is, to gain the advantage. \\nBeing able to discern the quality of energy around us is called cellular telepathy, which is normal not paranormal, and natural not supernatural. Cellular telepathy is also common between people especially people who know each other well. Every human can develop this higher sensory ability by clearing their pain body, disciplining their ego and paying attention to it. \\nWe live in a world that is entirely made up of different qualities of consciousness energy, and that energy moves upwards in a spiral similar to playing musical notes that are written upon a harmonic scale. \\nUntil we develop the context that our world is conscious and alive with many kinds of sentient beings, we will miss the entire meaning of our existence that is interconnected with the collective consciousness. When describing that all energy as intelligent, this means knowing that all energy holds an incredible amount of information, or stored memory and knowledge that can be recalled through its energy signature. \\nThere are people on this earth that can read the energy signature and determine its quality in the spectrum of frequency that makes up a layer of the collective consciousness. While most people are being spiritually oppressed, they are unable to read energy signatures or sense them, because they have not been educated or made aware of how to do so. Morphogenetic Fields \\nMorphogenetic fields are a layered part of the consciousness architecture of the planet, which include the entire DNA and collective energy of humanities mental and emotional body. Those collective mental and emotional energies are responsible for what the entire planet manifests as its experience and mirrors it to the whole. This is the microcosm relationship to the macrocosm, they are one and the same. This reinforces and influences, belief systems, ego identity roles, memes and every psycho-social and cultural system existing on the planet today. \\nSo when it is discussed that the planetary architecture and DNA has been hijacked by alien forces, it means also that the mental archetypes and emotional symbols that many humans have been using as a belief system to identify with the ego personality, is actually dissonant to their metaphysical nature and harmful to the life force and inner spirit. \\nAll matter forms have a manifestation blueprint which is built upon the scalar standing wave patterns that are immovable. It appears to move but does not move. Like Christmas tree lights, they flash on and off into the expansion of the fission and fusion between the anti-particle and particle units that create the manifestation blueprints of form, as we know them. \\nFrom the quantum mechanics of the instruction sets of the blueprint fields, the laws of energy are reversed from the measurements of matter, which current science produces. This is because all matter forms at the quantum level have a projected negative, which is the energetic blueprint form holder of the actual matter form. This is similar to seeing undeveloped camera film, the photo negative of the film before it is processed into an actual photographic picture. \\nThis is actually a blueprint of the developed picture and by looking at the reversed negative one can see how the actual picture will develop. The same happens for all manifested matter bodies, everything that is in a form, has an instruction set or blueprint negative. This is also a construct of the spiritual light bodies, which are collective consciousness bodies holding instruction sets. These instruction sets are also called morphogenetic fields. The War of Bi-Wave Collective Consciousness \\nThe forces of polarity that exist in creation as a gender principle have taken on the bi-wave collective consciousness as the anti-life and fallen aspects of the Universal Mother and Universal Father. These fallen aspects are the Imposters of the original Universal Founders that operate as a trinity. \\nThere is a Reversal Mother alien aspect that works to grow the collective consciousness forces of Satanism to be expressed on the earth. There is a Reversal Father alien aspect that works to grow the collective consciousness forces of Luciferianism to be expressed on the earth. \\nThese larger gestalts of bi-wave consciousness have taken human and nonhuman forms in multiple dimensions of reality, and are dueling for complete control over the consciousness on the planet in order to continue to exist on the earth plane. These many varieties of bi-wave forces attempt to enslave humans to express their quality of anti-life reversals, made through the Satanic or Luciferian collective consciousness. Since humanity has the 12 Strand DNA imprint and potential of uniting with the eternal tri-wave consciousness of the combined Universal Mother and Universal Father Christos Trinity, the war is between bi-wave and tri-wave, or anti-life and eternal life. \\nEssentially, it is the bi-wave collective consciousness warring for survival by parasitizing the consciousness energy of humanity and the planet earth, seeded with original human 12 strand DNA. The Imposter Spirit forms, which many Negative Aliens have adopted in the role of False Alien Gods that intermediate on the earth, are connected to the False Parent Collective Consciousness that is referred to as Satanism and Luciferianism. \\nTo become Satanic or Luciferian means that consciousness body has lost its eternal connection to the Godhead, thus has to find sources of energy to feed upon to continue to exist. Satanism is a collective consciousness force field, and any kind of entity can embody the anti-Christ, and become an embodied Satan. Reversal Mother = Satanic \\nThe Reversal Mother is the anti-life hatred for the Godhead that exists in the anti-female collective consciousness of the Satanics. The interdimensional aliens in the Orion Group, such as the Black Sun Dragon Moth have primarily used the Reversal Mother principle of Satanism to spread their war and blood sacrifice ideology on the earth. \\nThose ideologies that endorse religious wars, genocide, eugenics, pedophilia, killing for God as a blood sacrifice, are specifically generated by the satanic collectives. They have accumulated the collective consciousness grids of the earth to be programmed with alien machinery running AI software for mind control, and that siphons energy off the planet to fuel other timelines and phantom realities. \\nThe planetary grid network is harvested by the NAA to gain energetic power from the dark matter of the earth grid, by hijacking and raping the vital essence of the female and mother principle energies. Thus, in order to gain full access to siphon the planetary consciousness energies, as well as the human soul energies, they have set up global misogyny and sexual misery programs, like pedophilia. \\nSexual energy harvested in anti-sex reversals are especially used to further spread the satanic forces to take power and control on the earth. Anti-life means reversal of life and reversal of sex. Reversal networks have been placed all over the planetary grid, in order to siphon the life force of the planet and take the creative forces away from the people. Anti-sex is to define the inability of the sexual partners to create the circuit of microcosmic orbit that allows the creative sexual forces to circulate the orgasmic energy into the heart flow, which expands the love that exists between them. \\nThe war over free energy is intrinsic to the war over the consciousness of the earth people. These entropic systems have been put in place by the Controller Pillars of Society, in order to continue to enforce the hijack of the aspects of the female principle consciousness in all of its permutations. The female principle can be extracted of its animating properties and core essence that animates creation in matter, which is called the Aether or Azoth. As a result, the Fallen Goddess consciousness Aether is used in anti-sex rituals to animate sentient beings in the satanic hierarchy. Further, this is enmeshed with the creation of the Baphomet and Leviathan fields used by the Satanics to infiltrate the 2D grail gates. \\nThe access to manipulate and siphon the creational and sexual forces of the earth and humanity, as well as carry out massive blood sacrifice genocidal wars, has allowed Satanic forces to carry out their enslavement agenda while remaining hidden from the masses. The Satanic Attributes and Impostor Spirit Qualities (Bi-Wave or Service to Self-Agenda) \\nThese are general energetic qualities of the Satanic Collective Consciousness Spirit and its archetypes, that one will find driving the motivation behind their predator mind system: Cloaks itself within the authority of False Mother God archetypes in the earth body to manipulate through domination and control, while shapeshifting its outward appearance in both physical genders. Black Magic is a form of Satanism. Until a person has knowledge of what Black Magic actually is and how it is perpetrated and represented in earth elemental energy, and black magic grids, that person is not protected from the effects of black magic. Practicing Rituals based in Service to Self, crafts and methods for personal gain and profit at the expense of others, stealing other people’s energy and resources while taking ownership. Sending Curses, hexes and negative energy patterns to people with intent to harm, such as making them sick, ill or wishing them dead. Practicing blood sacrifice or the killing of a living thing dedicated to blood ritual or cleansing. Practicing Black Arts for conjuring elementals and earthly demons to work for the practitioner. The use of Alien Implants, holographic inserts or etheric weapons to assault and harass another. Black Magic used in sexual acts to conjure forces and bind the soul into servitude through rape or forced sodomy. Any sexual act involving force, violence, or the lack of consent between adult parties and/or a child. Any actions or behaviors in which the Luciferian or Satanic force is called upon, conjured or embodied for possession, or to gain control over another. \\nSatanics are the barbarians on the planet, they are supreme experts at trauma based mind control SRA, torture disassociation methods, weaving webs of deceit, Gaslighting tactics, sociopathic lying when called out, superiority complexes, and using sodomy and rape to steal life force from their target. They have no respect for esoteric knowledge or hierarchy unless they are beaten into submission or they have something to gain from it. They epitomize blood lust and violence of every type, the gorier and more painful it is, the more they enjoy to feed upon it with delight. Reversal Father = Luciferian \\nThe Reversal Father is the anti-life male collective consciousness of the Luciferians, whose accumulated collective consciousness is harvested by the NAA to gain energetic power from the earth grid and from humanity, by hijacking and raping the male and Father principle energies. \\nThe interdimensional alien Annunaki Gods, Enki, Enlil, Thoth, and Yahweh and Jehovah from Saturn, have primarily used the Reversal Father principle of Luciferianism to establish the world religions on the earth, using patriarchal domination rhetoric to serve the false light, and the bi-wave consciousness, so they could gain full control over humans and exert themselves as the Gods. \\nThrough the energetic enslavement of the Seraphim consciousness, the Fallen Angelics were bound to play out the program of the Luciferian Rebellion as the Sons of Belial. And so they played their part as dictated by the planetary grid structures. This was further capitalized on by off planet Luciferian sources such as the Annunaki who understood what was happening, and many of these Negative Alien groups, such as those from Maldek joined forces. \\nLuciferianism is a collective consciousness force field, and any kind of entity can embody the anti-Christ through the False White Light of the False Father, and become an embodied Luciferian. A Satanic must evolve into Luciferianism in order to have rights to continue to progress, and many refuse to do so, unless they are absolutely left with no alternative. A person can embody Left path Satanism and Right Path Luciferianism, and express both male-female reversals simultaneously. Luciferian Attributes and Impostor Spirit Qualities (Bi-Wave or Service to Self-Agenda) \\nThese are general energetic qualities of the Luciferian collective consciousness spirit and its archetypes that one will find driving the motivation of the Negative Ego False Light systems: Cloaks itself within the authority of False Father God archetypes to manipulate through domination and control, while shapeshifting its outward appearance in both physical genders. Siphons spiritual light and rapes the Mother’s Holy Spirit through the feminine principle with Vengeance and Self-righteousness, while propping up a false spiritual parent of the Mother to the masses. Through False Parent Archetypes it can only use the Negative Ego constructs to produce false spiritual light for its creations. False Father can appear to be a benevolent God, until you question his authority, then he becomes hostile and violent. False Light is temporary and has to be consistently replenished through stealing from others inner resources of Light, therefore he needs followers and those who give energy to him. Has disdain for the creation power of the Mother’s spiritual principle and resents and blames her Son, Christos for his position, therefore has crucified him/her. Has a superior, hierarchal and elitist mental body belief system that tricks him to believe its position or ability is higher than it really is; self-entitled. Self-aggrandizement of personal leadership role through its negative ego, compels it to abuse power and authority believing the innocent are stupid, to be led deceptively and controlled. Promotes false hierarchy for domination and control through promotion of hive mind mentality. (Hive mind means carry out group-orders and do not question authority). Skillful to use manipulation techniques to avoid transparency, accountability to actions, works to continually deceive others through a divide and conquer strategy of winners or losers. Uses biblical deception and salvation models to promote seed fears of Armageddon software and Victim/Victimizer archetypes, to target any development of unity consciousness including attacking and destroying human values, for achieving unconditional love and peace. Steals access to paranormal ability or supra-luminal intelligence in order to use astral glamour as the way to pretend or provide proof to the enslaved human, in the display of its superior intelligence and authority over those who serve the Luciferian False Light System. \\nLuciferians value esoteric knowledge, mental intelligence, hierarchy and the Universal Laws much more than Satanics. Luciferians have in earnest created Mystery Schools for higher education. \\nHumans that have awakened and undergone spiritual battle are held in some kind of respect and given a higher status. Many times, people that have spiritually awakened and progressed in consciousness, the Fallen Angelics and Luciferians will leave them alone and respect their path. In contrast, they hold disdain for ignorance and asleep people – the men of clay. The general consensus seems to be that if a species is stupid enough to believe something ridiculous, then they have the right to gain control and use that person or group as underlings. The Christos Attributes and Truth Spirit Qualities (Tri-Wave or Service to Others Agenda) \\nChrist Consciousness is a collective consciousness force field of the Trinity Source of the Godhead, and any kind of entity can choose to embody the Inner Christos by becoming a human being, and evolve over time to become an embodied Christ. There are Ascended Christs embodied in male and female forms that have united their inner polarities through spiritual ascension to the zero point. \\nOne must inhabit an ascending planet in order to have the opportunity to spiritually evolve into a Christ and experience Cosmic Christ Consciousness, which is the status of a Cosmic Citizen that travels God-Sovereign-Free throughout the Universes. Eternal Love consciousness that is embodied in a form is unity intelligence, a tri-wave consciousness that is simultaneously recognized as the Inner Light of Christos. \\nThe Inner Light of Christos when actualized in a human form is the embodiment of the tri-wave consciousness that is an Eternal God Human. The practice of the Cosmic Sovereign Law of One and its first practice of unity consciousness directly reflects the image of God’s Love for all creation, and this trinity force is eternally protected in the Godhead. Every soul is taking the same journey, but each soul has evolved at a different level. \\nThe teachings of the Law of One describe the spiritual laws that govern our spiritual evolution for each dimension and it represents the ultimate path to achieve sovereignty in the Cosmic Christ Consciousness. It is a single philosophical system of World Humanism, which merges cosmology, science, human rights and spiritualism. Simply put, the Law of One is the Universal Truth that All Is One. It is the Truth taught by Christ when he proclaimed, “Love your neighbor as you love yourself.” Trinity Source of the Godhead \\nTo understand the tri-wave consciousness, think of the three sources of the original primal sounds of universal creation—The Threefold Flame. The first unit, as an energy matrix unit is a tri-wave, that which contains potentials for all polarities or no polarity. No polarity means this is the neutral charge, or zero point, the Godhead is that central point of all union, which this planet is moving into direct alignment with. \\nThe Three Flames are all One, and yet they are distinct tones on their own. This is the paradox of Trinity Source of the God Head. The Holy Mother, the Holy Father and the Holy Son (Christos-Sophia) are all One as the Godhead, however, the Mother is not the Father, nor the Son. There is an energy matrix comprised of frequency that is a tri-wave tone, and this tone is inter-dimensional and also a part of the core substance of our Universal Time Matrix. \\nWhen we come into understanding bipolar radiation; we understand the original trinity and completion of the source projecting out its consciousness units into a bi-wave polarity, which is the pair of opposites that manifest matter creations, through the masculine and feminine principles. The electromagnetic principles reflect the gender pairs, and this helps us understand the core manifestation structure from which all matter manifestation is built. In working with that bi-polar wave, it is the radiation unit that forms the electromagnetic scalar standing wave. \\nWe could say the bi polar wave is the sub tone of the tri-tone wave. Through that bi polar light wave projection, is the electromagnetism that creates the particle and anti-particle template of our universal structure. The particle unit represents the contraction phase of that tri-wave energy unit, thinking of a big circle which contains all potentials, and using the example of in-breath and its out-breath of source. \\nThe particle unit is represented as the in breath of the energy that is contracted and received by that omni-polar or tri-tone state, the complete energy matrix. This is the base magnetic tone of that tri-tone energy unit. The anti-particle unit represents the outbreath or expansion phase of anti-matter or anti particle energy and is considered the base electrical. Together, we know these units function as the female and masculine principles of energy. This is to help us to understand that this is much more than gender as we think of it, and that gender principles have relevance in the core mechanics of creation, that is based on electromagnetic energy. \\nGender principles, through the pair of opposites, create the continuing cycle of this tri-wave energy unit, projecting itself into a bi-wave spectrum of light. The energy thrust expands into an anti-particle vibration point, as an electrical force that, contracts into a particle vibration point, creating the magnetic pole. This is the third vibration or tone of the tri-wave that draws the entire composite energy back into the source. When the energy is drawn back into the source, the feedback loop of reciprocal source light is generated and expanded. \\nOur goal during these end cycle times is to create the tri-wave consciousness that draws the composite energy back into the zero point as a feedback loop, back into the source of all creation. This trinity field creates an eternal and perpetual supply of life force that regenerates the consciousness bodies. This eternal supply of life force is the Cosmic Christos light and the trinity principle that is the Cosmic Christ Consciousness. The Christ Consciousness is the Offspring of Hieros Gamos \\nWhat we have come to learn through the Guardian principle of Hieros Gamos is that the Christos Collective Consciousness is the child and offspring of the Holy Mother and Holy Father, and cannot be birthed into the physical world without both male and female principles and polarities equally unified to zero point. These principles of polarity, in both male and female, become unified between the internal and external manifestation, internally with the inner spirit and externally with the physical body. \\nI hope this is helpful as we try to stay balanced and increase our sentience in order to access truth. Please only take what is useful for your spiritual growth and discard all the rest. Thank you for your courage and bravery to be a truth seeker. \\nI am God, Sovereign, Free! \\nUntil next, stay in the luminosity of your Avatar Christos Sophia heart path. Please be kind to yourself and each other. GSF! \\nWith a Loving heart, Lisa SF Source Energetic Synthesis  '"}, "time": 1742628530.2019298}