{"duration": 0.12276816368103027, "input_args": {"text": "'People who try to live as members of the opposite sex damage their chances for normal romance and sex, according to a large new survey of attitudes towards transgender issues. [Just four percent of normal heterosexual Americans said they would be “very open” to dating a “transgender person,” and only a third would be willing to tell their parents about the relationship, according to the survey by YouGov. com.   The four percent number comes from a sample which excluded the one or two percent of heterosexual Americans who say they’ve had relations within the last 12 months with a woman or a man who is trying to change sex.  The February survey of 2, 191 adults also showed that transgender people are often unwelcome in the much smaller gay and lesbian communities, which together comprised only 5 percent of the survey. Only eight percent of lesbians and just 10 percent of the gay men say they did have sex with a transsexual in the prior 12 months. Just   percent of gay men who have not had a relationship with a transsexual said they would be “very open” to dating a transgender man, and only 47 percent of them would be willing to tell their parents, said the survey. Almost   of lesbians said they are “very open” to a relationship with a man who is living as a woman. The poll forcefully underlined the sexual unattractiveness  —   and the painful social isolation  —   facing most men and women who try to switch their sex, despite the glamorous coverage from many major media outlets, even including fashion and style magazines.   The sexual rejection, however, was accompanied by sympathy from many Americans. For example, the survey showed that 66 percent of sexually normal people were “very” or “somewhat” open to friendship with a person trying to change sex. Only 29 percent said they would oppose a friendship, according to YouGov, which declined to say who funded the expensive survey.  The survey’s results match complaints by many of the few people who are trying to live as members of the other sex. “The disappointing but unsurprising results [of the survey] reveal a sad truth about the transgender rights movement: Cultural acceptance has tended to lag behind formal recognition,” said Samantha Allen, a reporter at The Daily Beast who is living as a woman. The commonplace rejection of transsexuals is frequently described or shown on YouTube. For example, the British Mirror newspaper videotaped the rejection of three American transsexuals in 2015: Hoping on finding a boyfriend, [Claire] reveals that she doesn’t like telling people the truth and is desperate for an [expensive genital surgery] operation. She says: “In a lot of ways, I don’t like telling a guy. Once I tell him all respect goes out of the window. “Straight guys just can’t get over you having the male parts. “Once I’ve had or get the surgery, I think it will change a lot for me because right now if I meet a straight guy and he doesn’t know  —   we can’t get physical if I don’t tell him. “And then if he finds out, things just get so complicated, I can’t even begin to explain. ” Many people who are trying to change their sex also blame their exclusion on unfair social attitudes that need to be changed by civic pressure or government action. “We, as a society, have not created a space for men to openly express their desire to be with trans women,” Allen said, echoing the progressive claim that heterosexual males’ sexual preferences can be swayed by civic endorsement of transsexuality. The demand that male and female heterosexuals learn to sexually desire transsexuals reflects a key demand of the “transgender ideology”  —   that government should pressure ordinary Americans to fully accept other people’s claim about their maleness or femaleness, regardless of biology.  This political ideology was pushed by officials working for former President Barack Obama’s Department of Justice. “Transgender men are men  —   they live, work and study as men. Transgender women are women  —   they live, work and study as women,” Vanita Gupta, the acting assistant attorney general for the Justice Department’s civic regulation division, claimed in a May 2016 press conference. The ideology is built on the political claim that people can easily change their “gender identity” and so become members of the opposite legal sex  —   even without biological changes. That political claim is based on two more claims  —   that a person’s “gender” can be different from that person’s sex, and that peoples’ sex (and sexual preference) is “socially constructed” by social rules, not by biology, according to progressives. This transgender ideology has some sympathy from roughly   of Americans, but Obama has admitted twice that his push for “transgender rights” hurt Hillary Clinton’s 2016 race. Also, far fewer than one percent of Americans try to live as members of the opposite sex. In contrast, conservatives cite science and human experience when arguing that “gender” does not exist, and that a person’s sex is determined by their biology, which also deeply impacts their character across a wide range of masculine, feminine and   characteristics. For example, say conservatives, young female “tomboys” are still girls, regardless of their appearance or behavior. In February, President Donald Trump boosted the conservative argument by ditching an   rule which directed schools officials to enforce the “gender identity” claims of “transgender” children on normal children, regardless of the children’s’ privacy or their parents’ wishes. Since Obama’s departure, the push by transsexuals for sexual acceptance consists of social pressure, often via Hollywood, and often aimed at lesbians.  This push is especially   among some transsexual men who wish to sleep with lesbians. But many lesbians decline to sleep with men who have intact male genitalia, even if the men say they’re women. Sexual activists scornfully describe this rejection by lesbians as  “the cotton ceiling” As one   transsexual argued on Youtube:  So the cotton ceiling is a term that was coined basically referring to the idea that a transwoman’s identity as a woman would be respected within the lesbian community up until the point when a romantic or sexual relationship was being considered, at which point the lesbian would say “Sorry, not interested in transwomen,” which means that it you don’t regarded transwomen as women, regardless of their operative status [intact male genitalia] you don’t actually think of transwomen as women at all   …     At the end of the day, if your reason for not dating any transgender person is because of their   that doesn’t mean you’re not transphobic  —   because you are.  “You can unlearn your own prejudices [against sex with transsexuals] —   it just takes time and effort,” said Riley Dennis, a biological male who is living as a woman while preferring to sleep with women. Denis argues that a person’s “genital preferences” for   genitalia should be stigmatized like sexism because it prevents lesbians from dating people who claim to be women while still keeping male genitalia. “Some women have penises,” Denis claims.  But the heterosexual rejection of transsexuality is deep. When Bruce Jenner renamed himself “Caitlyn,” the popularity of the female name fell more than 400 places, right off the list of the top 1, 000 favorite names. The burden of trying to change sex  —   drugs, hormones, surgery, social exclusion, money, unemployment and much else  —   is so great that many people reverse their transgender attempt and try to live as a normal person, even after being mutilated by   surgery.    Nationally, the claim that government should enforce the gender ideology is having a large impact on civic society’s rules for helping males and females preserve their complementary, equal and overlapping private and public lives. For example, the   push has attacked the nation’s   social rules for   bathrooms and shelters for battered women, sports leagues for girls, hiking groups for boys,   curricula and university speech codes, religious freedoms, free speech, the social status of women, parents’ rights in childrearing, practices to help teenagers, women’s expectations of beauty, culture and civic society, scientific research, prison safety, civic ceremonies, school rules, men’s sense of masculinity, law enforcement, and children’s sexual privacy. Here are screenshots from the survey.   Follow Neil Munro on Twitter @NeilMunroDC or email the author at NMunro@Breitbart. com,            '"}, "time": 1742561769.3655143}