{"duration": 0.06759142875671387, "input_args": {"text": "'EMAIL US: CONTACT@GOVTSLAVES.INFO Home › MEDIA › 65 PRESSTITUTES WHO COLLUDED WITH THE CLINTONS TO DEFRAUD AMERICA AND STEAL THE ELECTION… CALL FOR THEIR ARREST 65 PRESSTITUTES WHO COLLUDED WITH THE CLINTONS TO DEFRAUD AMERICA AND STEAL THE ELECTION… CALL FOR THEIR ARREST 0 SHARES \\n[10/28/16] MIKE ADAMS -To even call this 2016 president election an “election” is a cruel joke. Democracy is supposed to be about open, fair and free elections, and those elections must be predicated on open, fair and free access to information so that voters can make an informed decision. Yet all we have today is a media that’s in the tank for Hillary, a justice system infiltrated by deep state corruption, a voting system rife with leftist fraud, a culture of extremist, violent intimidation of those who oppose Clinton and an Obama regime steeped in such criminality and fraud that it actively encourages illegal aliens to run across the border to America so they can vote. \\nThis isn’t an election… it’s a coordinated leftist coup d’etat . \\nThe aim of the coup is to occupy all the positions of power in America with radical leftists, communists and criminal democrat party loyalists. From those positions of power, the strategy is to systematically dismantle the American Constitution, Bill of Rights and Supreme Court while crushing the American middle class with punitive economic policies that keep the masses trapped in poverty (Obamacare, anyone?). \\nIt’s now abundantly obvious to nearly every thinking person that democracy has been ripped to shreds in America , and the deep state criminal regime in power exists solely to protect and enrich itself at the expense of everyone else. \\nGONE is the idea of representing the interests of the People. \\nGONE is any desire for government to operate with transparency and accountability. \\nGONE is any trust in voters by the powerful elite, who distrust the voters so much that they make sure every election is rigged in advance. \\nGONE is any economic policy rooted in sanity or mathematics. Now, numbers and dollars from Washington are all rooted in mental illness and delusion. \\nGONE is any semblance of the concept that justice is blind and that all laws apply to all the people just the same, no matter how powerful they may be. \\nGONE is any public trust in ANY institution of government, from Congress, to the federal courts, to the regulators like the EPA, to even the FBI. \\nGONE is any notion that the government should defend the nation’s borders and control the flow of immigrants into the country for all the obvious reasons. \\nAnd GONE is any concept of journalistic integrity across the mainstream media, an institution that now holds actual journalism in contempt (i.e. the work of Wikileaks or Project Veritas). Now, the media insists that no one question the government, no transparency is necessary, and government operatives have no obligation to explain any of their actions or cover-ups. Richard Nixon is rolling in his grave… The illusion of democracy \\nThanks to the complete abandonment of democracy and honest government in America, We the People now wake up each day as slaves living in a totalitarian dictatorship pretending to be a democracy , complete with a pretend press, a pretend judicial system, a pretend legislative branch and even a pretend central bank pumping out pretend currency. \\nWe turn on our televisions to watch pretend journalists named “Stephanopoulos” churn out pretend news that pretends Bill and Hillary Clinton are honest, affectionate, trustworthy elders instead of the phony frauds and crooks they’ve really turned out to be. And then we’re blasted with pretend polls that claim the most unpopular woman in America — Hillary Clinton — is somehow ahead of Donald Trump by 12 points. Nobody believes the polls anymore… \\nEvery time REAL news breaks through the surface, the establishment tells us that’s all fake. Wikileaks emails, we’re ridiculously told, aren’t real (even though they are). Project Veritas videos have been “edited,” we’re told, as if that somehow negates the very clear words caught on video as they are uttered by Clinton operatives committing serious crimes. The only news that’s “real,” we’re told, is the fabricated fake news planted in the New York Times by the Clinton campaign. A call to arrest and imprison the presstitutes that are defrauding America and destroying democracy \\nIn truth, the leftist media is staffed by presstitutes — media whores who have sold out to the Clintons in exchange for “access” to her bogus news releases (i.e. planted false narratives). As reported by The Free Thought Project , all the following “journalists” are seditious whores who should no doubt be arrested, indicted and prosecuted for engaging in criminal collusion and racketeering with the Clintons: \\n“Progressive Helpers”'"}, "time": 1742562483.7744005}