{"duration": 0.0948026180267334, "input_args": {"text": "'Gabby Douglas is a decorated Olympic gymnast who will bring home a gold medal from Rio. But her performance has not been enough to appease some observers on the internet. Douglas, 20, who won the women’s   during the London Olympics in 2012, lamented on Sunday that she had been picked apart by people on social media for everything from her appearance  —   right down to her hair texture  —   to her behavior during a medal ceremony while the national anthem was being played. “When they talk about my hair or not putting my hand over my heart or being very salty in the stands, really criticizing me, for me it was really hurtful,” Douglas, who is   said, according to The Associated Press. Even her mother, Natalie Hawkins, expressed frustration with the harsh attacks. “They said she had breast enhancements they said she wasn’t smiling enough, she’s unpatriotic,” Hawkins told Reuters. After some observers noticed that Douglas looked disappointed while watching her teammates succeed, “it went to not supporting your teammates,” her mother said. Hawkins added: “Now you’re ‘Crabby Gabby.’ You name it, and she got trampled. What did she ever do to anyone?” The Olympics have always been fertile ground for cutthroat competition and narratives about fallen heroes, but observers on social media can distort those stories and take them to extremes  —   while still expecting athletes to smile and act gracefully when they lose. In the pool, Lilly King of the United States made a point to emphasize her   win over Yulia Efimova of Russia, who had served a doping suspension and was booed every time she entered the Olympic Aquatics Stadium. And there has been no shortage of scrutiny of the    swimmer Missy Franklin, who won four gold medals in London only to fall short in Rio, prompting a slew of “What happened?” headlines. But the online criticism of Douglas has been relentless since her lackluster performance during the Olympic trials, she and her mother both said. After the United States women’s team took home the gold last Tuesday, Douglas’s failure to put her hand on her heart during the national anthem struck a nerve with viewers. Not everyone thought this was valid criticism. It is not as if Douglas has not been hard on herself, criticizing her   performance in the uneven bars. “In my head, I pictured it a little bit differently,” she said. “You want to picture yourself being on top and doing amazing gymnastics. ” Athletes have never been as accessible as they are right now  —   especially those like Douglas and Franklin who rely on social media to build a fan base and share sponsored posts from brands they endorse, like United Airlines and Gillette razors. That accessibility becomes a   sword when they do not perform as well as they should, or if fans catch a whiff of jealousy, bad behavior or team infighting. But if we have learned anything from social media’s power to tear down idols, it is that the same tools can be used to build someone back up. By Monday, #LOVE4GABBYUSA was being spread across Twitter by fans who wanted to help Douglas feel better despite the onslaught of abuse. It was an outpouring of support for an athlete that came days, if not years, too late.'"}, "time": 1742562289.4188068}