{"duration": 0.06774067878723145, "input_args": {"text": "'VIDEOS Hillary “attack dog” David Brock plotting with Soros, Steyer, Sussman to “kick Trump’s ass” If there is one thing that is missing from the most scandalous political election in recent history, it is an attempt to physically eliminate the president By Tyler Durden - Friday, November 18, 2016 9:42 AM EST \\nThe last time we encountered David Brock , Hillary Clinton’s so called media “attack dog”, was two months ago when we exposed a money laundering scheme involving over a dozen of his Pro-Clinton SuperPACs. Now, it appears that unable to concede defeat, the man who aligned his career with Hillary Clinton, is going for blood, and is soliciting the help, but mostly money, of Clinton’s top donors. \\nAccording to Politico , Brock is launching his own Koch-brothers-like donor network to finance attacks on President-elect Donald Trump and to rebuild the political left after Trump’s stunning victory over Clinton last week. In an email sent out on Thursday night, Brock emailed more than 200 of the biggest donors on the left, including finance titans George Soros, Tom Steyer and Donald Sussman all of whom invested millions of dollars in Clinton’s campaign with nothing to show for it, inviting them to a private retreat in Palm Beach during inauguration weekend to assess what Democrats did wrong in 2016, figure out how to correct it and raise cash for those initiatives. \\n“ This will be THE gathering for Democratic donors from across the country to hear from a broad and diverse group of leaders about the next steps for progressives under a Trump Administration ,” Brock wrote to the donors in an email. “What better way to spend inaugural weekend than talking about how to kick Donald Trump’s ass?” Brock said. The retreat, which is planned as the first in a series of regular gatherings, will feature appearances by an array of Democratic elected officials, operatives and liberal thinkers and group officials, Brock explained in an interview. \\nWhile it is unclear how many of the addressed billionaires confirmed their presence at this “secret” gathering, Brock predicted there would be significant interest, noting that the keynote address at his last major donor conference, back in 2013, was delivered by former President Bill Clinton. It is unclear how much Clinton received for one hours of his time. \\nBrock is a self-described “right-wing hitman-turned-Clinton enforcer ” who has used his relationships with some of the left’s wealthiet supporters and billionaire donors to build an armada of aggressive political outfits that have become pillars of the institutional left and that raised a combined $65 million during the 2016 cycle. As profiled previously, Brock’s groups include the conservative media monitoring non-profit Media Matters, the opposition research super PAC American Bridge and the legal watchdog Citizens for Responsibility and Ethics in Washington. \\nThat’s not all: other groups in his network include the liberal media-funding vehicle American Independent Institute, the media-training non-profit Franklin Forum and the for-profit social media operation ShareBlue, which The New York Times described as “Hillary Clinton’s Outrage Machine.” A seventh group, a super PAC called Correct the Record that was created to coordinate directly with Clinton’s campaign , is winding down, though Brock said that a number of its functions and personnel likely will be absorbed by his other groups. \\nAnd yet one wonders if Brock’s attempt to square things up with Trump isn’t too little, too late, especially for a many who like Huma Abedin, has been so closely associated with Hillary and her now defunct political career: Brock acknowledged in the interview: “There is no question that we poured our heart and soul into this election for Hillary, but these institutions were built before her campaign and were intended to outlast it.” \\nTo separate himself from the Clintons whom he serves so well over the years, Brock said in his email to donors that he created Media Matters more than a decade ago to help the left push back during George W. Bush’s presidency. \\n“In 2005, we were part of a successful progressive effort to regroup, retool and recover,” he wrote. “While today’s situation is more dire, media matters more than ever.” \\nBut the biggest problem for Brock is that he is likely stepping on the very toes of those whose money he is after: as Politico notes, the Palm Beach retreat seems to be a challenge to the 12-year-old Democracy Alliance, a club of liberal financiers that was started by Soros and a handful of other major donors to fund the institutional left . In fact, the club, which held its annual winter meeting this week in Washington, helped launch Media Matters, and many of Brock’s donors belong to its ranks. Brock said he’s inviting the president of the DA, as the club is known, to his Palm Beach retreat. \\nThere is one way Brock’s network hopes to differentiate itself: while the Democracy Alliance at its winter meeting discussed ways to push back on the Trump administration, many of the group’s members have tried to train its focus on pressuring Democrats from the left on issues like fighting climate change, money in politics and drug laws; Brock however is more overtly and aggressively political, and has been “largely agnostic on the philosophical divisions with which Democrats are grappling.” \\n“We don’t think of this as representing a faction of the Democratic Party, but a cross-section of it, so we’re not going to precook things ideologically,” he said. “It is very politically minded, and there is an urgency to it.” \\nAt this point two questions emerge: one of the main reasons why Clinton lost is precisely due to behind the scenes scheming such as this, where political “attack dog” operatives would meet with billionaires and strategize how to shift public perception on any number of items. That has now been proven to be a losing strategy. Have the democrats truly not learned anything from their most shocking failure in history? \\nThe next question is just how much more “overtly and aggressively political” will Brock, whose organizations have been alleged to be behind a number of the anti-Trump riots in recent months, be in his quest to take down, or rather “kick the ass” of Donald Trump. Because if there is one thing that is so far missing from the most scandalous political election in recent history, it is an attempt to physically eliminate the president. We can only hope that the “hitman-turned-Clinton enforcer” will not decide to go that far.'"}, "time": 1742628337.8362842}