{"duration": 0.1464827060699463, "input_args": {"text": "'He is the most successful and influential investor you have probably never heard of. His writings are so coveted and followed by Wall Street that a used copy of a book he wrote several decades ago about investing starts at $795 on Amazon, and a new copy sells for as much as $3, 500. Perhaps that’s why a private letter he wrote to his investors a little over two weeks ago about investing during the age of President Trump  —   and offering his thoughts on the current state of the hedge fund industry  —   has quietly become the most   reading material on Wall Street. He is Seth A. Klarman, the    value investor who runs Baupost Group, which manages some $30 billion. While Mr. Klarman has long kept a low public profile, he is considered a giant within investment circles. He is often compared to Warren Buffett, and The Economist magazine once described him as “The Oracle of Boston,” where Baupost is based. For good measure, he is one of the very few hedge managers Mr. Buffett has publicly praised. In his letter, Mr. Klarman sets forth a countervailing view to the euphoria that has buoyed the stock market since Mr. Trump took office, describing “perilously high valuations. ” “Exuberant investors have focused on the potential benefits of stimulative tax cuts, while mostly ignoring the risks from   protectionism and the erection of new trade barriers,” he wrote. “President Trump may be able to temporarily hold off the sweep of automation and globalization by cajoling companies to keep jobs at home, but bolstering inefficient and uncompetitive enterprises is likely to only temporarily stave off market forces,” he continued. “While they might be popular, the reason the U. S. long ago abandoned protectionist trade policies is because they not only don’t work, they actually leave society worse off. ” In particular, Mr. Klarman appears to believe that investors have become hypnotized by all the talk of   policies, without considering the full ramifications. He worries, for example, that Mr. Trump’s stimulus efforts “could prove quite inflationary, which would likely shock investors. ” And he appears deeply concerned about a swelling national debt that he suggests could undermine the economy’s growth over the long term. “The Trump tax cuts could drive government deficits considerably higher,” Mr. Klarman wrote. “The large 2001 Bush tax cuts, for example, fueled income inequality while triggering huge federal budget deficits. Rising interest rates alone would balloon the federal deficit, because interest payments on the massive outstanding government debt would skyrocket from today’s artificially low levels. ” Much of Mr. Klarman’s anxiety seems to emanate from Mr. Trump’s leadership style. He described it this way: “The erratic tendencies and overconfidence in his own wisdom and judgment that Donald Trump has demonstrated to date are inconsistent with strong leadership and sound  . ” He also linked this point  —   which is a fair one  —   to what “Trump style” means for Mr. Klarman’s constituency and others. “The big picture for investors is this: Trump is high volatility, and investors generally abhor volatility and shun uncertainty,” he wrote. “Not only is Trump shockingly unpredictable, he’s apparently deliberately so he says it’s part of his plan. ” While Mr. Klarman clearly is hoping for the best, he warned, “If things go wrong, we could find ourselves at the beginning of a lengthy decline in dollar hegemony, a rapid rise in interest rates and inflation, and global angst. ” Mr. Klarman is a registered independent and has given money to politicians from both parties. He has donated to Jeb Bush, Chris Christie, Marco Rubio, John McCain and Rudolph W. Giuliani as well as Hillary Clinton, Cory Booker and Mark Warner. While he has remained largely outside the public eye, Mr. Klarman surprised some of his friends and peers over the summer when he issued a statement after Mr. Trump criticized a judge over his Mexican heritage, saying he planned to support Mrs. Clinton: “His words and actions over the last several days are so shockingly unacceptable in our diverse and democratic society that it is simply unthinkable that Donald Trump could become our president. ” In his recent letter, he explained for the first time his decision to say something publicly. “Despite my preference to stay out of the media,” he wrote, “I’ve taken the view that each of us can be bystanders, or we can be upstanders. I choose upstander. ” From the letter, it is hard to divine exactly how Mr. Klarman is investing his fund’s money. His office declined to comment on the letter, which I obtained from a source. His fund currently has more than 30 percent of its funds in cash. He has lost money in only three of the past 34 years. What investors say publicly and what they do in the markets can be different things. Mr. Buffett campaigned publicly against Mr. Trump, but he has nevertheless invested in the market since his election  —   about $12 billion, according to a recent disclosure. George Soros, who also actively campaigned against Mr. Trump, bet  —   wrongly so far  —   that the stock market would fall he lost about $1 billion. Most hedge funds have found themselves on the losing side of trades over the past several years, a point Mr. Klarman addressed in his letter. Noting that hedge fund returns have underperformed the indexes  —   he mentioned that hedge funds had returned only 23 percent from 2010 to 2015, compared with 108 percent for the Standard  Poor’s index  —   he blamed the influx of money into the industry. “With any asset class, when substantial new money flows in, the returns go down,” Mr. Klarman wrote. “No surprise, then, that as money poured into hedge funds, overall returns have soured. ” He continued, “To many, hedge funds have come to seem like a failed product. ” The lousy performance among hedge funds and the potential for them to go out of business or consolidate, he suggests, may become an opportunity. Perhaps the most distinctive point he makes  —   at least that finance geeks will appreciate  —   is what he says is the irony that investors now “have gotten excited about   index funds and exchange traded funds (E. T. F. s) that mimic various market or sector indices. ” He says he sees big trouble ahead in this area  —   or at least the potential for investors in individual stocks to profit. “One of the perverse effects of increased indexing and E. T. F. activity is that it will tend to ‘lock in’ today’s relative valuations between securities,” Mr. Klarman wrote. “When money flows into an index fund or   E. T. F. the manager generally buys into the securities in an index in proportion to their current market capitalization (often to the capitalization of only their public float, which interestingly adds a layer of distortion, disfavoring companies with large insider, strategic, or state ownership),” he wrote. “Thus today’s   companies are likely to also be tomorrow’s, regardless of merit, with less capital in the hands of active managers to potentially correct any mispricings. ” To Mr. Klarman, “stocks outside the indices may be cast adrift, no longer attached to the valuation grid but increasingly off of it. ” “This should give   value investors a distinct advantage,” he wrote. “The inherent irony of the efficient market theory is that the more people believe in it and correspondingly shun active management, the more inefficient the market is likely to become. ” How Mr. Klarman wants investors to behave in the age of Trump remains an open question. But here’s a hint: At the top of his letter, he included three quotations. One was attributed to Thomas Jefferson: “In matters of style, swim with the current in matters of principle, stand like a rock. ”'"}, "time": 1742563577.3875449}