{"duration": 0.07103514671325684, "input_args": {"text": "'BEIJING  —   China set a slightly lower economic growth target for this year as the country’s lawmakers began their annual meeting on Sunday. The new target, while only a bit lower than last year’s, continues a long streak of China trying to dampen expectations as the country grapples with thorny problems like the maturing of its economy, its considerable industrial overcapacity, a growing debt load and pernicious pollution problems. At the meeting of the National People’s Congress, China addressed issues such as pollution, debt and foreign policy. Li Keqiang, China’s premier, called on Sunday for economic growth this year of “around 6. 5 percent or higher, if possible,” slightly more modest than last year’s target of 6. 5 to 7 percent. Actual growth last year, according to official data, was 6. 7 percent. Even with the slight drop in projected growth, many economists argue that China’s annual target remains too ambitious and is adding to its   problems. But Mr. Li defended the target. “The projected target for this year’s growth is realistic,” Mr. Li said in a report issued on Sunday before lawmakers convened. “An important reason to stress the need for stable growth is to ensure employment and improve people’s lives. ” In a separate report issued to the legislature, the National Development and Reform Commission  —   which helps steer the economy  —   said the growth target was meant to reassure the public at an anxious time. Later this year, the Chinese Communist Party will undergo a leadership   and officials have said that stability is essential. “This rate of growth is conducive to fostering healthy public expectations,” the commission report said. China, it added, was “facing complex and volatile” conditions this year. Since the global financial crisis in 2008 and 2009, China has rapidly expanded debt to stimulate the economy and to make sure that it hit fairly ambitious targets for economic growth. Reformers have called for lower targets that would not require so much debt to achieve. Mr. Li also tried to reassure a public that has grown increasingly angry about noxious air, water and soil left by decades of feverish industrial growth, and burning coal is a main culprit. “We will work faster to address pollution caused by coal burning,” Mr. Li said. Those steps would include trying to cut the amount of coal used for winter furnaces and heaters. “All key sources of industrial pollution will be placed under    online monitoring,” he said. But China’s appetite for coal remains enormous. Mr. Li said that China would keep cutting excess coal production this year, but more slowly than previously. He said that this year the government aimed to shut down at least 150 million metric tons of coal production. Last year, he said, the government cut 290 million tons. In terms of other pollutants, Mr. Li said that sulfur dioxide and nitrogen oxide emissions would be cut 3 percent this year and that fine particles of pollution in the air, which are of particular threat to health, would decrease “markedly” in “key areas. ” He also said that energy consumption would decline by 3. 4 percent per unit of economic output  —   a calculation that will still allow increases in emissions of global warming gases. Mr. Li did not mention President Trump, whose campaign language suggested a tougher stance against China on trade and regional issues. These annual reports by China’s prime minister are traditionally used for laying out generalities, not specific policies. But Mr. Li built on an effort by the president, Xi Jinping, to promote China as a reassuringly stable and mature power in uncertain times. “In the face of profound changes in the international political and economic landscape, China will always be on the side of peace and stability,” he said. On trade, Mr. Li said China will continue to oppose protectionism. “Economic globalization is in the fundamental interests of all countries,” Mr. Li said. “China will not shift in its commitment to promoting global economic cooperation. ” But Chinese officials were circumspect about the government’s latest increase in military spending. On Saturday, a spokeswoman for the National People’s Congress, Fu Ying, told reporters that the rise would be about 7 percent. But the documents released at the opening of the legislative meeting left people guessing about the exact size of China’s official defense budget for 2017, unlike previous years. Credit in China grew about 20 percent a year between 2009 and 2015, and the level of corporate debt in particular has alarmed economists who worry about a rising number of bad bank loans. Mr. Li said that the government was looking to lower debt loads in the economy from a splurge of bank lending, but he suggested it would be done a “prudent” way that would not risk an economic shock. But the Ministry of Finance budget report, issued alongside Mr. Li’s report, outlined a tougher approach to local governments that have collected debt to pay for infrastructure. “Higher priority will be given to preventing and controlling local government debt,” the budget report said. Provincial governments would develop “local contingency plans” to deal with debt risks, it said. Foreign companies have become increasingly vocal about business barriers, intellectual property theft and other problems in the Chinese market. Some are turning elsewhere to establish a base for production. Mr. Li held out an olive branch, promising to “make big moves to improve the environment for foreign investors. ” He said that service industries, manufacturing and mining would become more open to these investors. He also promised that, contrary to most expectations and previous experience, foreign companies would not be discriminated against on license applications, setting standards or government procurement. The country has laid out plans  —   called the Made in China 2025 initiative  —   for it to seize a global lead in a long list of key   and manufacturing industries in the next eight years. Legislators gave polite applause to most of Mr. Li’s plans. But one new policy drew vigorous clapping in a country where a national grid of   routes has quickly made   travel commonplace: Mr. Li said the government would end roaming charges on cellphones used outside the province in which the phone numbers were initially registered.'"}, "time": 1742628568.9733171}