{"duration": 0.09505057334899902, "input_args": {"text": "'Election Day is upon us, and that means (among other things) that the American voter is entitled to a bunch of free stuff: doughnuts, pizza, cheese dip, you name it. It is all provided by businesses looking to get a bit of publicity by encouraging everyone to fulfill their civic duty. The only problem? All those giveaways are technically against the law. “The basic line on this is in an election where a federal candidate is on the ballot, you cannot give anyone any reward  —   anything of any value  —   for turning out to vote,” said Rick Hasen, a professor of law and political science at the University of California, Irvine. “It doesn’t matter if it’s a civic pride thing or if it’s not about any one candidate. ” But companies are rarely penalized for Election Day freebies, he said. That means these kinds of giveaway offers pop up every four years, including today. At some businesses, an “I Voted” sticker is your ticket to free things. It will get you a free cookie at Great American Cookies and a red, white and blue   pin at Foot Locker. A sticker was also previously required by Krispy Kreme, which changed its offer (and deleted a tweet advertising it) on Monday evening. Now voters and nonvoters alike can get a free snack from the   which, perhaps reflecting political tensions, told its customers that a robust turnout can ensure that “democracy lives on. ” Other businesses require you to simply say you voted. Chuck E. Cheese’s will give you a free   pepperoni pizza if you say you voted or use a coupon code. You can also get free chips and cheese dip at California Tortilla by saying one of three   passwords (one is “Make Queso Great Again” another is a more Clintonian “I’m With Queso. ”) “This comes up every election because businesses have this   idea that they can promote their business and be patriotic,” Professor Hasen said. “It’s not intuitively obvious that it’s illegal to give things away to people who exercise their civic pride. I certainly understand the confusion. ” Some giveaways are acceptable, however. The big one is transportation: It is common for political groups, churches and others to provide voters a free lift to the polls on Election Day. In that spirit, Uber and Google have teamed up on a feature that lets voters find their polling place and then request a ride there.   Uber users will get $20 off their ride if they use the code “VOTETODAY. ” Lyft is offering a 45 percent discount on one ride (because the nation is electing its 45th president) between 7 a. m. and 8 p. m. in almost two dozen cities. Zipcar, a   service, is providing free use of its cars so people can drive themselves to the polls. Arrangements like that shouldn’t pose a legal problem, experts said. But when it comes to an election, everything is up for debate. “You can have an extended law school class discussion about exactly what is the difference between driving someone to the polls when it would cost them several dollars to get there versus just giving them $5 outright,” said Edward B. Foley, a professor of law and the director of the Election Law Program at Ohio State University’s Moritz College of Law. “That’s a slippery slope, to use a term law professors like to use a lot. ” Then there is Starbucks. Its civic engagement  —   and unease  —   has been on display since last week, when it released a special edition paper cup meant as a statement of national unity. On Tuesday, the company’s chairman and chief executive, Howard Schultz, sent a   pep talk to all Starbucks employees that began with an admission of his own   anxiety and an elegy for the lost “promise of America. ” He urged his employees to stay positive and be kind to one another and the people around them. “In the face of this epic, unseemly election and the concern we all share about the direction of our country and the lack of truth and void of leadership, we can still make a difference in the lives of the people we touch and influence every day,” he wrote. But will it be giving anything away? A spokesman on Monday night said the answer was no.'"}, "time": 1742562634.5409007}