{"duration": 0.031801462173461914, "input_args": {"text": "'British welfare system to blame for migrant crisis, claims Calais deputy mayor British welfare system to blame for migrant crisis, claims Calais deputy mayor By 0 151 \\nA French politician has blamed Britain for the crisis in Calais, claiming it was the UK’s welfare system that drove so many migrants to gather in the border town. \\nPhilippe Mignonet, the deputy mayor of Calais, believes the demolition of the ‘Jungle’ refugee camp will not stop the thousands of migrants from congregating in the French port town in the hope of crossing the English Channel. \\nRead more \\n“The UK government says it does not want any more migrants but it never expels migrants who get there,” Mignonet told the Daily Mail . \\n“They claim benefits and housing, and all we get is the British-funded wall and fences.” \\nFor Mignonet, the £2 million (US$2.4 million) British-funded wall being built around the loading area of the Eurotunnel, which allows goods trucks to come from France into Britain, is simply not enough. \\n“What English city would accept a fence and a wall being built by another country on their land? If the British government want to improve matters, they should come and talk to the city of Calais,” he added. \\nMignonet invited Prime Minister Theresa May to visit the town, and even offered to give her a covert ride from the airport. \\n“I have a car with dark windows, so she doesn’t have to be seen,” Mignonet said. \\n“Calais was once part of England, and we have often worked together in the past. We can work together again. The people of Britain made their choice about Brexit, and some of those choices mean they will face difficulty, but putting walls and fences up here is not right.” \\nThe wall, which is seen as a blight on the coastal town, could also affect the price of the land once occupied by the Jungle camp, which will soon be ready for private development. \\n“This is at the door of England, and near to the shuttle terminal for trucks,” Mignonet said. “What better place for British businesses to come?” Tighter border \\nThe British public appears unmoved by French concerns. A new poll suggests most Brits would rather see their borders tightly secured than stay in the single market. \\nAccording to a poll commissioned by ITV, 58 percent of Brits approve of May’s Brexit strategy of prioritizing immigration controls over the negotiation of the UK’s access to the single market. Only a quarter were against. \\nJust over 40 percent of those asked insisted EU trade benefits should be prioritized throughout the divorce. However, a similar Sky News poll found the opposite to be the case. \\nA breakdown of the data, however, showed twice as many older Brits support May’s ‘hard Brexit’ and immigration control policies as the younger demographic. \\nVia RT . This piece was reprinted by RINF Alternative News with permission or license.'"}, "time": 1742628542.3405275}