{"duration": 0.06674838066101074, "input_args": {"text": "'WASHINGTON  —   The director of the F. B. I. James B. Comey, told lawmakers at a Senate hearing on Tuesday that Russian hackers had penetrated the Republican National Committee’s computer records, but he called it a “limited penetration of old R. N. C. ” computer systems that were “no longer in use. ” Mr. Comey’s statement was significant because the committee said weeks ago that it did not lose data to the Russians because of its strong cybersecurity.   Donald J. Trump has repeated that assertion and has also said weaknesses in Democratic National Committee systems had opened the way for their systems to be hacked. While Mr. Comey did not go into detail, he appeared to be referring to a   attack on a contractor in Tennessee, Smartech Corporation, used by the Republican committee to host some of its websites and handle some lists of donors. Federal investigators have said that a single email server used by that contractor had been penetrated. But it was going out of service and contained outdated material that the Russians probably found to be of little value. People with direct knowledge of the server’s contents said it had been used by Senators Lindsey Graham and John McCain. An aide in Mr. Graham’s office said the hacking of the email server in question occurred in June. The Graham campaign was using the server to send news clips and campaign releases, the aide said. In an unclassified report released on Friday, the intelligence community reported that the Russians had attacked “ ” organizations but that they had chosen not to make any of that data public. The report made no specific reference to the Republican National Committee. Pressed on the issue by Senator Susan Collins, Republican of Maine, Mr. Comey said on Tuesday that there was “evidence of hacking directed at the state level” and at the Republican committee, “but that it was old stuff. ” He said there was no evidence “that the current R. N. C. ”  —   he appeared to be referring to servers at the committee’s headquarters or contractors with current data  —   had been hacked. There is no evidence that computers used by the Trump campaign or the Clinton campaign were also compromised, though the personal email account of John D. Podesta, Hillary Clinton’s campaign chairman, was copied and released as part of the   hack. The testimony on Tuesday was the first since the release of the declassified report on Russia’s interference in the 2016 presidential election, and it came four days after the findings were described to Mr. Trump. The panel, convened by the Senate Intelligence Committee, included James R. Clapper Jr. the director of national intelligence, and Adm. Michael S. Rogers, the head of the National Security Agency and of the military’s Cyber Command. John O. Brennan, director of the Central Intelligence Agency, and Mr. Comey also testified. Mr. Clapper largely repeated the conclusions of last week’s report, including that the goal of the Russian effort was to disparage Mrs. Clinton  —   whom the Russians hoped to weaken if she won  —   and over time to favor Mr. Trump. Under questioning, Mr. Clapper said he believed that President Vladimir V. Putin of Russia and his aides had actively ordered the operation that resulted in the hacking, though he left unclear how involved they may have been in the details. After receiving a briefing on the report on Friday, Mr. Trump acknowledged for the first time that Russia had sought to hack into the Democratic National Committee’s computer systems. But he insisted that the effort had played no role in his election, and he said nothing about the conclusion that Mr. Putin preferred him to Mrs. Clinton. Senator Mark Warner, Democrat of Virginia and the committee’s vice chairman, called the election hacking “one of the most serious events of my public life. ” At times, Democrats on the committee steered the conversation toward whether intelligence officials were investigating any link between the Russians and Mr. Trump’s campaign. But Mr. Comey declined to discuss it. “Especially in a public forum, we never confirm or deny any investigation,” Mr. Comey said. Many Democrats still blame him for Mrs. Clinton’s defeat, citing his ambiguous letter less than two weeks before the election disclosing new questions about emails on her private server. Senator Angus King, independent of Maine, who supported Mrs. Clinton, could not resist an aside. “The irony of your making that statement here I cannot avoid,” he said. Mr. Comey, seeking to establish a nonpartisan air, later joked, “I hope I’ve demonstrated by now I’m tone deaf when it comes to politics  —   and that’s the way it should be. ” Republicans, for their part, raised few doubts about the intelligence community’s conclusions, but they dwelled little on the report’s finding that Mr. Putin had a clear preference for Mr. Trump. Senator Marco Rubio, Republican of Florida, suggested that Russia had achieved its broader goal of sowing “chaos and disorder” in the electoral system.'"}, "time": 1742628335.5359726}