{"duration": 0.1161813735961914, "input_args": {"text": "\"(mis à jour 22:51 26.10.2016) URL courte 5 1033 2 4 Dans 15 à 20 ans, un tremblement de terre dévastateur pourrait secouer Téhéran. Selon Bahram Akkasheh, sismologue iranien qui a accordé une interview à Sputnik, il faudrait examiner la possibilité de transférer la capitale dans des régions moins dangereuses. \\nDéjà en 2009, en raison de la localisation de Téhéran dans une zone sismique, l'idée du transfert de la capitale iranienne avait été avancée par l'Ayatollah Khamenei. Suite à son initiative, le Conseil de discernement recommandait de se préparer au transfert de la capitale. © AP Photo/ Niranjan Shrestha Un tremblement de terre géant dans le Pacifique pour bientôt Ces derniers temps, cette idée a gagné en popularité, surtout en raison du scénario apocalyptique proposé par des scientifiques japonais qui mènent des recherches en Iran. Selon eux, le séisme pourrait atteindre sept ou huit sur l'échelle de Richter, ce qui pourrait faire plus d'un million de victimes et provoquer la destruction de 80 % des bâtiments. Les séismes, qui sont devenus récurrents aux alentours de Téhéran, témoignent de l'accumulation d'énergie dangereuse dans le sous-sol. « Le père de la sismologie iranienne », Bahram Akkasheh, a présenté en détail les conditions réelles dans lesquelles se retrouve actuellement la capitale de l'Iran. \\nD'après les recherches menées par M. Akkasheh, les tremblements de terre dans les alentours de Téhéran ont un caractère cyclique : le dernier de magnitude 7.1 a secoué Téhéran en 1830 ayant détruit les murs du Palais du Golestan et le bâtiment de la mission diplomatique du Royaume-Uni. Plus de doutes! Le phénomène du Triangle des Bermudes enfin expliqué Les tremblements de terre « ont lieu tous les 200 ans. (…) Si on se réfère au cycle, il existe une possibilité que dans les quinze prochaines années un tremblement de terre secoue Téhéran », a expliqué M. Akkasheh.\\nIl n'est possible de prédire le début du tremblement de terre que quelques jours ou heures à l'avance, voici pourquoi la menace est imprévisible : « Nulle part dans le monde, ni aux États-Unis, ni au Japon, un début de tremblement de terre n'a été prédit avec certitude. Une fois, en Chine, on a réussi à le faire par hasard », explique le sismologue. \\nSelon lui, la possibilité de tremblement de terre à Téhéran est assez haute : \\n« Chaque année, la crête d'Alborz grandit de quelques millimètres puisqu'annuellement, le plateau iranien s'étend de huit mm. Tout cela prouve qu'ici, l'écorce terrestre est en mouvement perpétuel ». Italie: ce chat survit après 32 jours dans les décombres après le séisme Il y a plusieurs régions en Iran qui sont exposées aux séismes de magnitude 7 sur l'échelle de Richter. Pourtant, il existe des régions où la magnitude peut atteindre 8 sur l'échelle de Richter et elles sont exposées à un plus grand danger. « Ce n'est pas par hasard que nous avons signé un accord de coopération avec les Japonais pour examiner l'activité sismique des lieux où se trouve Téhéran. Je me souviens que lors de cette recherche commune, le maire de Téhéran avait déclaré qu'à la suite d'un tremblement de terre à Téhéran, le nombre de victimes pourrait se chiffrer en millions. La ville peut être effacée de la surface terrestre », prévient M. Akkasheh. \\nLe président de l'Iran a chargé six ministres d'étudier les rapports préparés par M. Akkasheh, et par la suite un état-major de crise a été créé sous contrôle de la mairie. \\n« On a crééégalement ces états-majors dans toutes les provinces du pays. Plusieurs provinces, où le risque sismique est le plus fort, ont commencéà se préparer aux cataclysmes naturels. (…) Pourtant, on ne pourra vérifier le niveau réel de l'alerte qu'en pratique », conclut le sismologue. \\nSuivez Sputnik sur Telegram pour ne jamais manquer les actualités les plus importantes grâce à nos sélections du matin et du soir. Pour recevoir les actualités de notre chaîne, il suffit de télécharger l'application Telegram sur n'importe quel smartphone, tablette ou ordinateur puis cliquer sur le lien et appuyer sur « Join » ...\""}, "time": 1742563741.1811268}