{"duration": 0.04432058334350586, "input_args": {"text": "'Fri, 21 Oct 2016 21:32 UTC Clinton can\\'t draw crowds this large The question regarding the meaning of Trump is unlike questions concerning the person of Trump or what the Republican candidates stands for. The meaning of Trump is that, pretty much, half of the American people say enough is enough. Half of the American people are expressing a total fatigue of the system and their ruling elite. In the last few weeks we learned that Trump left behind a score of offended women. He was disrespectful and grossly misbehaved, allegedly. This may tell us something about who Trump is; yet the fact that all those embarrassing revelations had zero impact on Trump\\'s popularity suggests that we are dealing with a force of nature. No one else in modern politics would have survived a fraction of such bad publicity. Trump may be a horrid and disrespectful human being, and yet, he appears to be invincible. Trump is not as eloquent or as lucid as Hillary Clinton or President Obama but he manages to express in a just a few words the deepest and most profound philosophical ideas and criticisms of Western life. It was Trump who reminded us, once again, that true utopia is in fact nostalgia. Trump\\'s campaign slogan \\'Make America Great Again\\' is probably the most profound existential rejection of the progressive delusional mantra. It is an essentialist admission that the prospect of a better future is actually rooted in the past, in the soil, in manufacturing and agriculture -- pretty much the few things from which Wall Street\\'s mammonites were happy to divest . Trump hinted in the last debate that he may challenge the result of the US presidential election if he loses. \"I\\'ll keep you in suspense,\" is how he phrased it. Once again, Trump is not a philosophy graduate, yet, he manages to unleash an existential viper into the room. Secretary Clinton and President Obama were appalled by the man who doesn\\'t adhere to the great American democratic tradition. They were probably correct. Trump, puts into question the entire American or, more accurately, Western paradigm. Democracy is not sacred to him - it is a means rather than the end. Like the vast number of his followers, Trump believes that America and its democracy are currently rotten. American democracy is set up to serve its own oligarchy. It conveys the image that the dystopia in which we live is a product of our \\'free (democratic) choice\\'. While Clinton and Obama communicate persuasively within the symbolic order, Trump manages to revolutionize the discourse constantly. This is a quality that is usually associated with the artist and the Athenian spirit not with real estate moguls. But does Trump really mean what he says? Is he genuine or is he playing a game. No one knows. But far more interesting, no one really cares and it doesn\\'t really matter. And this is probably the real meaning of Trump. Donald Trump is merely a vehicle. It doesn\\'t really matter whether Trump will be the next president or not. The call for a radical social change has been established. It is now becoming aware of itself.'"}, "time": 1742561938.8365192}