{"duration": 0.11114740371704102, "input_args": {"text": "'Email \\nPresident-elect Donald Trump will be extremely busy during his first 100 days in office, fulfilling what he can of his “ contract with the American voter .” Before then, lame-duck President Barack Obama, on the other hand, will be concentrating on cementing into place as much of his healthcare and environmental agenda as he can. Neither is likely to succeed fully. \\nTrump has promised to “drain the swamp” in Washington, with plans to propose a constitutional amendment imposing term limits on all members of Congress. He promises to install a “hiring freeze” on all federal employees, letting natural attrition over time reduce the federal workforce. He intends to require that every new federal regulation include plans to eliminate two others simultaneously. \\nTrump intends in his first 100 days either to renegotiate or repeal NAFTA, and withdraw altogether from the not-yet-ratified TPP. And he plans to \"repeal and replace\" ObamaCare. \\nHe is promising to lift Obama administration restrictions on energy development and move ahead with the completion of the Keystone Pipeline. He intends to turn off the flow of funds to the United Nations’ climate-change programs and redirect those funds to various infrastructure projects at home. \\nAnd he has promised to “cancel every unconstitutional executive action, memorandum and order issued by President Obama.” \\nTrump has other plans as well, but those mentioned above are likely to keep him very busy during his first 100 days in office. \\nIn the White House there will be activity of a different sort between now and Trump\\'s inauguration: the outgoing president doing what he can to salvage all he can of his fading legacy. He had high hopes that Hillary Clinton would work to cement into place ObamaCare with various governmental “fixes,\" reopen negotiations over the TPP (despite her protestations against it during her campaign), and extend and expand various UN treaties sold as campaigns against global warming and climate change but actually giving up huge swaths of national sovereignty in the continued building of the New World Order. \\nWith Trump now breathing down his neck and determined to undermine as much of that “progress” as he can, Obama will be reduced to issuing executive orders (which Trump has promised to negate), commuting sentences of favorite insiders caught with their hands in the federal cookie jar, and pardons. Pardons for Hillary (and Bill), Hillary\\'s main man John Podesta, along with Huma Abedin and her estranged husband Anthony Weiner for crimes they haven’t yet been charged with are already being floated. Executive orders can be reversed; pardons can’t, and some are suggesting Obama still has plenty of business left undone and havoc that he can wreak during the final days of his unlamented administration. \\nAccording to William Howell, a political scientist at the University of Chicago, this anticipated burst of activity by Obama is predictable: \"What we’ve seen in the past is when the outgoing president is replaced by somebody from the opposition party, then in the waning months of their presidency there is a burst of regulatory and rule-making activity.\" \\nIn the days leading up to the inauguration of the new president, Obama is going to be relying heavily upon his “pen,” while in the days afterward Trump will be busy using an eraser to clear the decks for his new agenda. Photo: AP Images \\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742561934.0177822}