{"duration": 0.035230159759521484, "input_args": {"text": "\"Map to Wikileaks Podesta Emails - Alphabetical Index by Sender (Version 14 Updated 10/25/16) \\nSUPPLEMENT TO: Navigating Wikileaks: A Guide to the Podesta Emails (image by Charles Grapski) License DMCA \\nThe following is a lengthy list of the entirety of the Podesta Emails database as released by Wikileaks (updated as of 10/24/14 through the 14th dump of records). It provides a quick graphic representation of the structure of the database (which is organized alphabetically by the sender [see the Introduction to the Guide: Navigating WikiLeaks: A Guide to the Podesta Emails ]). In particular this view, which contains a set of documents by the Alphabetical set (one for each letter and a PRE and POST category for the emails that fall prior to A and after Z), can show the gaps in the records thus far released. It is thus a useful tool to see whether a particular sender may be missing or what further emails from a particular sender have yet been released. This can be done using the colored bands - the DARK ORANGE band highlighting the as yet unreleased emails. Each of the other colored bands represents the data dumps from the 7th through the latest. The second to last column (dump) indicates which dump the email was released in. I will present an alphabetical list at the start which provides a direct link to a PDF version (links not active) and a SPREADSHEET version (active links if download Excel file [Viewable online but doesn't work if open in Google Sheets]). The links provide a link to the Wikileaks page (Link) and to directly download the .eml email file (Get). This will be followed by an image representation of the entire alphabetical list. Unfortunately due to the limitations on using table formatting I have chosen to use the image rather than the data itself on this page. Thus the user might find the PDF and/or SPREADSHEET useful. I will also provide the links to the PDF and SPREADSHEET above each alphabetical section. \\nAlso useful is the General Map of the database showing the total number of released and unreleased emails by alphabetical set. See: MAP to Wikileaks Podesta Emails [Version 14 - Updated (10/24/16)] - Advertisement - \\nThe Introduction to this Guide including a narrative and an explanation of the methodology can be found here: Navigating WikiLeaks: A Guide to the Podesta Emails. \\n[UPDATE NOTE: Updates will be loaded shortly bringing this info up to date through the 19th data dump by Wikileaks on 10/26/16. In order to do so I will publish the PDF and SPREADSHEET in advance of the full page so it is available for use as soon as possible. You can check the Series Page on OpEdNews to see what updates have been posted. Unfortunately the site does not allow updates to these pages themselves so new pages will be created for updates.] MAP of Indexed Sender Email Information Files (Quick Links) LETTER - PDF - SPREADSHEET\""}, "time": 1742562237.2866647}