{"duration": 0.26961421966552734, "input_args": {"text": "'By Catherine J. Frompovich \\nThis is the continuation of the testimony I will present before the Pennsylvania Public Utility Commission’s Administrative Law Court November 2 and 3, 2016. \\nCurrently, Chairman Representative Godshall is allowing three more opt out bills to become sine die this session, which should amount to an impeachable offense for denying consumers their inherent and indefeasible rights, especially of redress to government, and also according to the Pennsylvania Constitution, I contend. \\nProbably nothing encapsulates and explains the EMF/RFR controversy or conundrum, if you may, from a scientific viewpoint than the 35-page report “ EUROPAEM EMF Guideline 2016 for the prevention, diagnosis and treatment of EMF-related health problems and illnesses ,” which is a Spanish language document and found online at https://listas.um.es/sympa/arc/anuncios/2016-07/msg00069.html This report cites 308 published scientific references, which leaves Frompovich to question why the PA PUC—and PECO in particular—are so daft in proffering that there is no updated science other than the 1940s era ‘safety’ THERMAL science regarding microwave electromagnetic energies based in ‘ancient’ radar studies the microwave industry always trots out as proof of ‘safety’. \\nThose ‘safety’ studies originated in Germany during World War II; are totally outmoded; but remain the present Federal Communications Commission’s rules regarding safety of cell phones and AMI Smart Meters. It is now 2016! How come 1940s microwave technology science is being applied as the ‘gold standard’ or ‘scientific criterion’ to meters that will become the key intelligence gathering technology for the Internet of Things? Frompovich has to question the credibility factor of both PECO and the PA PUC for depending upon 1940 science in today’s technology world of 2016. Where’s the science later than the 1940s? Please, may I have those studies PECO supplied to the PA PUC? \\nFrompovich, therefore, respectfully suggests that the PA PUC study the above-aforementioned European reports with medical and EHS health professionals, who are qualified to explain the diagnostics and varied modalities discussed, in order to issue updated regulations affecting AMI Smart Meters and their continuous RFR/EMF health-damaging electromagnetics, plus their fire-and-explosion-prone proclivities and occurrences, which definitely was not the case for all the decades utilities used safe and efficient analog meters. \\nChildren are the most vulnerable to EMF radiation and, therefore, I introduce Exhibit U-1 “Why children absorb more microwave radiation than adults: The Consequences,” and Exhibit U-2 “American Academy of Pediatrics August 29, 2013 letter urging the Food and Drug Administration Commissioner, the Federal Communications Commission and others to advise the public about Specific Absorption Rates (SARs) regarding EMF/RF exposures.” \\nAlso, I want to apprise every one of the fact that electromagnetic sensitivity (EHS) is a growing problem and according to recently reported statistics in the peer reviewed journal ECOPSYCHOLOGY, Professor Pamela Reed Gibson states the following: 26% of the USA population; 19% of the Swedish population; 27% of the Danish population; and 32 % of the German population are EHS compromised. See Exhibit V . However, other sources claim that as much as 5% of the entire world’s population is affected. \\nJust as chemical sensitivities were discredited and denied by medical doctors for years—now referred to as “sick building syndrome” or “Multiple Chemical Sensitivity (MCS)—so, too, is EHS now being recognized by many, including the World Health Organization. I introduce Exhibit W “Electrohypersensitivity: a functional impairment due to an inaccessible environment.” Printout available here https://docs.google.com/viewer?a=v&pid=forums&srcid=MDgxODkwOTk5NjU5OTU4ODQwNTYBMTU3NTIzMDA1MTQxNTY1NzI0NTcBTVRzdGFEOUNBUUFKATAuMQEBdjI \\nAs Exhibit X I introduce a study no one can refute, “A review on Electromagnetic fields (EMFs) and the reproductive system,” which outlines science the microwave industry, PECO and all utilities utilizing AMI Smart Meters, plus public utility commissions across the USA need to factor into the inevitable legal liability that they are assuming by committing crimes against humanity by exposing the population to unsafe microwave electromagnetics 24/7/365 from dirty electricity pulsed by AMI SMs onto home wiring and into private residences and all buildings retrofitted with AMI Smart Meters. \\nBefore I include my previously submitted testimony, I find it necessary to impress upon the court that it should not be Frompovich’s obligation to prove the medical consequences beyond a reasonable doubt, especially in light of the ADA Amendments Act as it applies to those receiving federal funding or even that the consequences of medical problems are more probable than not, since the ADAAA provides Frompovich with disability rights and protections, which PECO and the PA PUC must abide by. \\nFurthermore, it should be the indisputable duty of PECO and all Pennsylvania utility companies – but more specifically that of the PA Public Utility Commission’s stated mission for being – to provide safe and non-radiating innovations in utility technology and appliances with 100% certainty, which AMI Smart Meters fail on numerous levels, especially with their proclivity for “hot sockets,” fires and explosions, EMF/RF constant emissions and dirty electricity pulses as frequent as 9600 times a day! \\nNo medical-scientific testing has proved AMI Smart Meters EMFs safety regarding non-thermal adverse health effects that I know of. Where’s the science? \\nTherefore, Frompovich should not be forced to allow a proven-fire-prone AMI Smart Meter electric service on her property that would radiate dirty electricity into her residence with high RFR pulses every fifteen seconds. \\nJust to add more “salt to the wound,” as they would say, there are no assurances that monitoring is not part and parcel of the AMI Smart Meter agenda and an integral surveillance device of the Internet of Things, or that information will be shared with unknown third parties—for whatever reasons—and for which Frompovich does not approve nor give her permission to PECO, the PA PUC or any government agencies or agents. \\nTherefore, Frompovich feels her privacy, as well as her home and personal physiology, will be subjected to unlawful, unconstitutional and unnecessary interventions at various levels and, specifically, without proper legal processes, e.g., court-issued warrants, in order to surveil her home that automatically will occur from the two-way ZigBee radio transmitter system of AMI SMs and all “smart” appliances which are built to interact with the coming surveillance technology of the Internet of Things. The times Frompovich makes tea in the morning and shuts off her lights for the night are no one’s business but her own. \\nI’ve been researching consumer health issues and whatsoever affects human health negatively , including technologies, since the late 1970s. During my career, I was considered an expert witness providing testimony before several states’ legislature/legislative hearings on health issues. For numerous years I was ahead of both the popular curve and the allopathic paradigm of medicine regarding the role of diet, nutrition, epigenetics, and lifestyle issues in maintaining optimum health, avoiding disease and regaining health utilizing holistic health principles. \\nI am in my 78 th year, thank God. Since the early 1970s, when I almost lost my life due to unfortunate medical mistakes and had to remove myself from mainstream allopathic care in order to save my life, I’ve been immersed in what’s called the “holistic lifestyle.” I’ve beaten the odds, including being a breast cancer survivor, using holistic healthcare modalities. For the record, 38.3% of U.S. adults and 11.8% of U.S. children used what’s referred to as CAM in 2007 per NIH statistics[1]. Complementary and Alternative Medicine—CAM as it’s called, is popular throughout the world, while in the U.S. there is the National Center for Complementary and Integrative Health at the National Institutes of Health. \\nHowever, the allopathic paradigm considers it, quite frankly, a pain in its professional butt since CAM has become the “go to” healthcare system when allopathy fails one. \\nTherefore, I expect that I probably will educate misinformed individuals on the negative health consequences of electromagnetic frequencies from microwave energy producing technologies like cell phones and towers, Wi-Fi, ‘smart’ gadgets, and, in particular, AMI Smart Meters, which are being bully-forced onto electric, natural gas, and municipal water utility customers. Most state legislators, the media and the public are undeniably ignorant of the damage being done to their health. Fortunately, I am not one of those people, thus my refusing an AMI Smart Meter on my house. But, first I think you ought to know some of my background: I’m a well-informed, plus over 40 years published consumer health researcher, advocate-activist, journalist, and author. \\nThat I should be taken seriously, I offer some of my professional background: retired practicing natural nutritionist; former registered lobbyist with the U.S. Congress for five years representing holistic healthcare issues; executive director for the national Coalition for Alternatives in Nutrition And Healthcare (CANAH) for five years and, as such, presented FDA-solicited expertise input regarding holistic health practices for its 1990 OTA report OTA-H-405 NTIS #PB91-104893[2] “Unconventional Cancer Treatments” [3]; expert nutrition witness before a congressional subcommittee opposing food irradiation; government relations specialist for a consortium of natural nutrition supplement makers before the U.S. Food and Drug Administration; the first Government Relations specialist for the Life Extension Foundation, who set up LEF’s government relations department; a published journalist; author of numerous books regarding health and lifestyle issues with several books available on Amazon.com and my 2016 book, Eat to Beat Disease, Foods Medicinal Qualities. \\nAdditionally, I wrote and produced two TV shows. One called, “ Turn Off the Violence ” was nominated for a Telly Award. That hour-long show was instrumental in securing the Giraffe Award given to persons, who stick out their necks for the common good. The recipient was George Mason University staff member Connie Kirkland[4], who founded a 24-hour crisis center for rape victims and promoted on-campus non-violence educational campaigns specifically relating to rape and domestic violence. What I’ve shared is much less than half of my background. More would take too much of your time. However, I feel compelled to ask, “How many people can match my qualifications to discuss consumer health issues?” \\nFurthermore, I want to underscore upfront that IF I were a habitual drug addict, rather than an informed, concerned health-conscious researcher and consumer being harassed for trying to protect and preserve my health, I probably would be welcomed with open arms, plus there would be all types of programs and subsidies available for help. Because I am opposing faulty and health-damaging RF/EMF ‘science’, plus vested-interest snooping, surveillance, and customer data marketing agendas using AMI smart meters, I am harassed and even threatened with termination of electric service even though all my bills are paid in full. That leaves me with no options but to dutifully invoke and defend my state and federal constitutional rights to life, liberty, and the pursuit of happiness. Isn’t there something radically wrong with such a construct, especially in the USA, if I have to do that? \\nAttorney Ward Smith’s interrogatory requesting Frompovich’s cancer health records, quite frankly, leaves everyone with whom I’ve shared that fact, totally aghast and amazed! Why? Because Frompovich’s medical records are her personal information protected under HIPPA and I must protect them. Furthermore, since the PUC Administrative Law Court hearing is of public record, Frompovich does not want her personal medical records made public information during any level in these proceedings, as that is her fundamental right. \\nI respectfully bring to this court’s attention that my breast cancer and medical records are NOT the issue. What’s the issue, problem, and at stake not only for me, but for all Pennsylvanians, is the total callous disregard by utility companies—PECO included, the PA PUC, and the Commonwealth for health hazards, safety, and the wellbeing of all Pennsylvanians, especially those with health issues, compromised immune systems, disabilities, and especially young, growing children—fetuses in particular—whom RF/EMF and dirty electricity produced by AMI Smart Meters affect and impact negatively. \\nBefore presenting into the record additional reams of recent research with documentation and annotations—not 1940s vintage radar safety research—for RFs/EMFs and microwave electromagnetic energies impacts upon cancer and health, I feel it necessary to introduce something no one probably has thought about nor factored into the AMI Smart Meter hidden costs continuum , and that is, healthcare services and ancillary costs stemming from non-ionizing radiation RFs/EMFs Smart Meters impact upon human tissue. \\nThere are mounting underlying, long-term adverse health effects accruing as we speak from PA PUC-PECO forced AMI Smart Meter 24/7/365 RF/EMF electromagnetics, pulses, harmonics and dirty electricity, specifically adverse Non-thermal health effects, impacting children and an ageing PA population, which will generate dire fiscal consequences, plus responsibilities, upon Penna. Medicaid health cost line items in each year’s operating budget for the Commonwealth. \\nTo cement that forewarning, I offer the World Health Organization’s statistic, “Approximately 10% of reported cases of EHS [electromagnetic hypersensitivity] were considered severe,” which means specialized caregiving. That, however, does not include cancer-induced health issues from RFs/EMFs! What kind of budget shortfall will AMI Smart Meters adverse health effects eventually generate for PA’s legislature and governor to haggle about, when we’ve seen what’s been going on recently to get a state budget passed? Has anyone thought about that very real problem? \\nContinued in Part 3'"}, "time": 1742564356.8763862}