{"duration": 0.058824777603149414, "input_args": {"text": "'… from Sputnik News , Moscow We are led to believe that this blast photo has something to do with the photo below, which is a very poor hoax [ Editor’s Note : My, my… are rogue elements in the Pentagon running these strikes to keep wind in the sails of the US’ phony anti-terrorism campaign in Syria, or are Obama and Kerry in on it? The lead classroom photo used in mass media for this “bombing attack” was an obvious fake. From the size of the blast column, there would have been nothing left to photograph but a hole in the ground, since the blast column photo looks like a 2000-lb bomb. Our make-believe newswires are supposed to have talent to catch obvious hoax stories, and this is certainly one of those. Maybe they would want to put us under contract to help them out. There is no excuse for the UN doing its jump-on-the-bandwagon routine. It has access to a lot of talent, including photo analysts, for situations like this. And the UN must be aware of the history of faked attacks by the Jihadi media during the Syrian war. ISIS has been piecing together stock footage for several years now, whenever they need a headline grabber. Mass media is even worse. With their big budgets, they are supposed to have expert people to send images to for some reality smell-testing. Even an amateur could spot this hoax. Somebody is desperate to create a climate calling for attacks on the Syrian and Russian Air Forces. Gosh, who could possibly want that? … Jim W. Dean ] This was an instant fake. A bomb coming through that wall would have blown the desks to smithereens, plus would have penetrated the roof, not the side. – First published … October 27, 2016 – \\nRussian reconnaissance means have registered a US attack drone in the area where a school in Syrua’s Idlib had been bombed, the Russian Defense Ministry said Thursday. \\nA US’ MQ-1B Predator drone has been seen in the area, the ministry’s spokesman Igor Konashenkov said. No Russian aircraft entered the area over the Syrian Idlib, where the alleged strike took place, he added. Moreover, Russian UAVs have not registered any signs of the destruction of the school’s roof or shell craters, Maj. Gen. Konashenkov said. A Russian drone has been sent to the area Thursday morning. “According to a photo made by a Russian UAV, the school’s roof is not damaged and there are no bomb craters in the area near the school. Similar information may be requested from our American colleagues. Russian reconnaissance means registered a US’ MQ-1B Predator attack drone.” Video footage published in media showing the alleged strike on the Idlib school have been fabricated, the ministry added. “Video footage published by a number of foreign media outlets of an alleged strike on the residential area of Hass [in Idlib] consists of more than 10 pieces pasted together, being shot at different times of the day.” Moreover, Konashenkov added that the school’s fence has not been damaged at all, while if an aerial bomb exploded, “the fence and all the walls of the buildings would have been destroyed and damaged by shrapnel, while the furniture would have been swept away by the shock wave.” \\nAccording to the spokesman, the photo published by the AFP agency showed that the nature and the extent of the damage sustained by the school were not similar to the destruction caused by airstrikes. \\nEarlier in the day, the executive director of the United Nations Children’s Fund (UNICEF) Anthony Lake said that as many as 22 children and six teachers were killed in an attack on a school in Idlib. Russian Foreign Ministry spokeswoman Maria Zakharova condemned the attack on a school in Syria’s Idlib and called for an investigation into the bombing. She also said that international media “launched an attack” on Russia by claiming that Moscow and Damascus are behind the bombing without presenting evidence. \\nThe UNICEF has fallen victim to another hoax by the White Helmets NGO, the Russian Defense Ministry spokesman added. “Before making statements, UNISEF officials should check the sources of its information,” he said, adding that such a respected organization should not undermine its reputation.'"}, "time": 1742563009.3806465}