{"duration": 0.10338068008422852, "input_args": {"text": "'10 870 0 26 In den teilweise erschütternden Berichten geben die meist jungen Frauen zu Protokoll, wie sie in der Kölner Silvesternacht von Männern eingekreist, an Brüsten, zwischen den Beinen und am Gesäß angefasst wurden. \\nDie Tatverdächtigen – größtenteils junge Migranten aus Nordafrika – hätten sich wohl im Bereich um den Hauptbahnhof zum gemeinsamen Feiern verabredet, anders sei nicht zu erklären, warum sich über 1000 dieser jungen Männer gleichzeitig auf dem Platz befunden hätten, so der Kriminologe Prof. Dr. Rudolf Egg, der Aussagen von über 1000 Opfern analysiert hat. © REUTERS/ Benoit Tessier Nach sexuellen Übergriffen: „Wels darf nicht Köln werden“ \\nEr gehe aber nicht davon aus, dass sie von vorn herein den Plan verfolgt hätten, Frauen sexuell zu belästigen. Nach einzelnen Vorfällen habe sich vielmehr eine Eigendynamik entwickelt. „Es hat sich wie ein Virus in der Gruppe der Männer verbreitet, sodass ganze Spaliere entstanden – dass man etwa die Brücke, die über den Rhein führt, und den Fußgängerweg blockiert hat und man dort gar nicht mehr passieren konnte“, stellte er in einem Interview für die Sputnik-Korrespondentin Ilona Pfeffer fest. \\nDie Einsatzkräfte der Polizei seien auf eine solche Situation nicht vorbereitet gewesen. \\n„Die Polizei hat die Lage unterschätzt. Man hat gemeint, mit einer geringen Stärke und mit dem Gewährenlassen von weniger schweren Straftaten die Sache im Griff zu behalten. Das hat hier nicht funktioniert. Die Situation war nur auf den ersten Blick so ähnlich, wie das, was man an Massenbewegungen am Rande eines Fußballspiels kennt oder von politischen Demonstrationen. Man hatte kein Vorbild, es gab kein vergleichbares Ereignis. Das hat dazu geführt, dass man von vornherein zu wenige Polizisten vor Ort hatte und diese auch nicht viel ausrichten konnten.“ \\nÄhnlich sieht es Arnold Plickert, Stellvertretender Bundesvorsitzender der Gewerkschaft der Polizei (GdP): © AFP 2016/ DPA/Markus Boehm „Polizisten guckten und taten nichts“: Erkenntnisse zu Kölner Silvesternacht - Studie „Es war für keinen erkennbar, dass es zu Silvester zu solchen Erscheinungen kommt. Das geben übrigens auch die ersten Ergebnisse der SoKo in Köln wieder. Die meisten Personen, die wir als tatverdächtig ermittelt haben, waren erst seit drei bis vier Monaten in Deutschland. Es gab auch keine Absprachen, da hinzugehen, kein koordiniertes Vorgehen.“ \\nIn einigen Fällen habe man trotz Überforderung den Opfern helfen können, so Plickert gegenüber Sputnik. Eine große Zahl von Frauen hat aber laut dem Gutachten von Prof. Rudolf Egg von der Kriminologischen Zentralstelle in Wiesbaden auf ihre Notrufe hin keine adäquate Unterstützung durch die Beamten erhalten. „Bei der Anhörung im Landtag von NRW wurden auch Notrufe abgespielt, die Frauen und Männer abgegeben hatten, und es klang nicht so, als wenn man hochaufmerksam reagiert hätte. Da sagt eine Frau, sie sei begrapscht worden. Für sie ist es eine dramatische Situation und es heißt bloß„Bleiben Sie mal da, wir schicken jemanden vorbei.“ Das klingt, als wolle man die Person abwimmeln und würde sie nicht ernst nehmen.“ © AFP 2016/ Markus Boehm / dpa Auch direkt vor Ort angesprochene Polizisten hätten den Aussagen der Opfer zufolge die Frauen nicht ernst genommen und keine Hilfe geleistet.\\nErklärungsversuche seitens des Polizeigewerkschafters: „Die Kollegen, die dort im Einsatz waren, haben eine äußerst schwierige Situation vorgefunden. Es waren von Anfang an viel zu wenige Kräfte da. Ich kann mir vorstellen, dass Kollegen mit anderen Aufgaben beschäftigt waren und gesagt haben: Ich kann jetzt nicht, gehen Sie zur nächsten Wache. Wenn aber eine Frau, wie es geschildert wurde, von mehreren Personen angegangen wurde, zu zwei Beamten gegangen wäre und die sich nicht gekümmert hätten, weggeguckt hätten, dann wäre das nicht akzeptabel. Man kann die Person nicht mit dem Gefühl stehen lassen: Hier kümmert sich keiner, es ist uninteressant, was ich erlitten habe.“ \\nStatt eines aktiven Eingreifens seitens der Polizei sollen die Opfer mehrfach den Ratschlag bekommen haben, sich von den Stellen fernzuhalten, wo sie belästigt worden seien. \\n„Manchmal ist der Ratschlag, bestimmte Plätze zu meiden, so falsch nicht. Aber das kann nicht die Lösung des Problems sein. Man kann potentiellen Opfern nicht die Verantwortung dafür übertragen, dass nichts passiert. Die Politik und die Sicherheitsorgane müssen sich auf andere Weise darauf vorbereiten, denn die Schuld liegt nicht bei den Opfern, sondern bei den Tätern.“, kommentiert Egg. \\nMindestens fraglich ist auch, warum die Polizei angesichts der aus der Kontrolle geratenen Situation keine Verstärkung angefordert hatte. Polizeigewerkschafter Plickert bestätigt, dass es für die Silvesternacht Sofortverstärkungskräfte gegeben hätte, aber die hätten erst aus anderen Behörden angefordert werden müssen und wären zu spät gekommen, um an der Lage in Köln etwas ausrichten zu können. © REUTERS/ Wolfgang Rattay Kölner Silvesternacht: Schrecken vieler Frauen wird zu Schreck für Frau Merkel „Um 22:30 hat es eine Besprechung mit dem Polizeiführer und dem Führer der Bundespolizei gegeben und man hat gemerkt, es läuft aus dem Ruder, und sich dazu entschlossen, den Platz zu räumen. Zu dem Zeitpunkt hätte es keinen Sinn mehr gemacht, eine Hundertschaft anzufordern, denn sie wäre erst gegen 1 Uhr da gewesen. Um 23:25 hat man mit der Räumung begonnen und diese ist auch relativ unproblematisch verlaufen.“ \\nNun gelte es, unter anderem in dem Untersuchungsausschuss im Düsseldorfer Landtag, der bereits 49 Sitzungen hinter sich hat, bei denen Zeugen und Gutachter gehört werden, das Geschehene zu analysieren und die richtigen Schlüsse daraus zu ziehen. \\n„Wir werden uns zukünftig einsatzmäßig anders aufstellen. Es wird ein gemeinsames Sicherheitskonzept mit der Stadt geben. An solchen Plätzen gibt es eine Videoüberwachung und ich gehe davon aus, dass in solchen Tagen auch die Räume besser ausgeleuchtet werden. Letztes Silvester waren wir mit 130 Landespolizisten in Köln eingesetzt, dieses Jahr gehe ich davon aus, dass wir mit 1000 Polizisten präsent sein werden. Ich glaube, alle Bundesländer werden sich in der kommenden Silvesternacht kräftemäßig besser aufstellen, weil alle diese Szenarien von Köln vor Augen haben“, sagt Polizeigewerkschafter Arnold Plickert. \\nIlona Pfeffer'"}, "time": 1742562745.4124067}