{"duration": 0.05321097373962402, "input_args": {"text": "'(Adult Language Warning)  Liberal comedian Samantha Bee roasted the news media, past presidents, and President Donald Trump during a taped mock White House Correspondent’s Dinner Saturday afternoon in Washington, D. C. From the Hollywood Reporter: “As much as I might love poking fun at the media and as much as you kind of deserve it sometimes, your job has never been harder,” she said. “You’re basically get paid to stand in a cage while a geriatric orangutan screams at you.   …     You expose injustice against the weak and you continue to   the president as if he might someday get embarrassed! Tonight is for you. ”   …     The special’s commercial breaks were led with taped sketches of Bee roasting a handful of previous presidents like Woodrow Wilson and Bill Clinton, complete with   garb. “This story has more wrinkles than the president’s nutsack,” she said of Ronald Reagan and the   affair, while Richard Nixon “achieved John F. Kennedy’s two goals: landing a man on the moon and getting f —  ed by a deep throat. ” The final sketch of this series had Bee roasting Mike Pence, who became president after Trump died after “getting his head stuck in a jar of honey. ” She was shown wearing a chastity belt and a   turtleneck: “I attempted to cover my pillows but the slut shines through. ”   …     One   segment skewered Jeff Zucker and CNN. “Zucker’s greatest success besides The Apprentice  —   which, by the way, thanks for that  —   is filling airtime between car crashes with a reality show loosely based on the news where   hacks make us measurably dumber by spewing mendacious nonsense while a hologram of Anderson Cooper stand by,” said Bee, pleading for the network to “free” its journalists. “Anderson is a smart reporter! Give him his black   back and put him in front of a natural disaster!” She added, “CNN gives you news like your shitty boyfriend gives you orgasms: in the end, you wind up lying in the wet spot and he’s snoring. ” For the rest of the article, click here. The TBS program Full Frontal with Samantha Bee’s Not the White House Correspondents’ Dinner is set to air Saturday at 10 p. m. eastern.'"}, "time": 1742564577.6276765}