{"duration": 0.09881234169006348, "input_args": {"text": "'MONTREAL  —   The idea was to celebrate Montreal’s coming 375th anniversary with a Christmas tree bigger and grander than the famous one at Rockefeller Center in New York. Instead, downtown Montreal wound up with something only Charlie Brown could love. “It’s a bit of an eyesore,” said Noor Malick, who has a view of the tree from her office window. “It’s horrible, it’s completely awful,” said Georges Malouin, who was passing through the   Christmas market where the tree is displayed. “I’m so surprised. I saw it on the internet but now, live, it looks very  —   cheap. ” “It’s quite sad, really,” said Michaela van den Berg, a visitor from England whose husband, Jos, compared the tree to a matchstick. “Maybe it’s a joke. ” People certainly are laughing, both in the streets and online. The tree has two mock Twitter accounts, one mainly in French and one in English. Mélanie Joly, the federal minister of Canadian heritage who, among other things, oversees the national holiday decorations in Ottawa, tweeted that she loved the Montreal tree, but she added a winking emoji. A classic specimen, the tree is not. Its trunk is crooked, for one thing. And its other shortcomings are painfully obvious to  . “It doesn’t have a top. It looks like it’s missing branches it’s kind of ” Pierre Bourcier said after snapping a photo with his phone. And then there are the ornaments: The tree is covered with red plastic inverted triangles topped by green maple leaves, the logo of the Canadian Tire retail chain, which supplied its white lights. A small child standing at the base of the tree this week stumped her father by asking why it “looked like a store. ” How did a holiday celebration became a municipal punch line? Chalk it up to (perhaps too much) ambition, inadequate financing and Murphy’s law. “We have good intentions,” said   Pelletier, one of the principals of Sapin MTL, the company that came up with the idea of rivaling New York’s tree. “But the road to hell is paved with good intentions, and we had problems. ” Sapin MTL is in the business of     Christmas trees, and it proposed the big one as a promotional gimmick. Mr. Pelletier said the company had a more majestic, shapely tree in mind. It researched the typical height for recent Rockefeller Center trees  —   74 to 76 feet  —   and found a   in Ontario that Mr. Pelletier described as “amazing. ” But its narrow height advantage vanished in early November when Rockefeller Center announced that its 2016 tree would be a   Norway spruce. Mr. Pelletier and his partners then had less than a month to come up with a new, taller rival, and they appealed to the public, which suggested about 100 candidates. The balsam fir they chose came from the Eastern Townships of Quebec, near the border with the United States. “It’s not perfect, but it’s authentic and it’s a real tree that you find in the forests of Quebec,” Mr. Pelletier said. “We’re not pretending this is the most amazing, beautiful tree in the world. ” Facing a Nov. 30 deadline for unveiling the tree, the Sapin crew had to hurry. The tree was harvested, placed on a special flatbed truck and brought to Montreal under police escort within 72 hours. But a tight schedule and a tight budget meant that some corners were cut  —   and so was the tree. Somehow, the tree that reached the   section of St. Catherine Street where the market is held measured just 88 feet tall, six feet short of the one in Rockefeller Center. Mr. Pelletier’s brother Philippe, another principal in the company, said a bit sheepishly on Friday that they had simply settled for the tallest tree they could find in time. And there was no time or money to give it the extensive arboreal spa treatment that the New York tree gets all the workers could do was reattach, sometimes rather obviously, a few of the larger branches that had broken off in shipping. As for the decorations,   Pelletier said his company’s responsibility ended once the tree was in its bare steel stand on St. Catherine Street. Jane Shaw, a spokeswoman for Canadian Tire, said the company had not required the logo ornaments in exchange for donating the lights. She called them “a gesture from the organizers” of the Christmas market. The skinny, misshapen and widely unloved tree does attract some expressions of appreciation. Many seem to be of the ironic variety often reserved for   horror movies. But some seem sincere. As a reporter was interviewing Mr. Pelletier in the market, a woman interrupted to say the tree was “beautiful,” before swiftly walking away. This year’s debacle hasn’t deterred Mr. Pelletier. He said his company was determined to make sure that Montreal truly outdoes New York next year, now that his fellow citizens have had their fun at this year’s tree’s expense. “I think we can celebrate the Christmas magic and stop saying it’s ugly, ugly, ugly,” he said, as a family posed for a photo in front of the tree. “Now in Quebec, there’s Cirque du Soleil, Celine Dion and the naughty fir  —   we prefer that to ‘ugly.’ ‘Naughty’ is better. ” Gesturing up at the tree, he said: “Look at him. You’ll find something sympatique in him. ” So would Charlie Brown.'"}, "time": 1742561718.66661}