{"duration": 0.043506622314453125, "input_args": {"text": "'ST. PETERSBURG, Fla.  —   Along with the pomp, the circumstance and the     bunting that accompany the start of the baseball season, the Yankees have established their own   tradition: laying an egg. The Yankees lost their sixth consecutive season opener on Sunday as the Tampa Bay Rays rocked Masahiro Tanaka and the heart of the Yankees’ order got off to the meekest of starts in a   defeat at Tropicana Field. The loss means little over the course of a   season, but it did quickly wash away the warm feelings the Yankees had fostered in posting the best spring training record in team history, winning 24 of 33 games. “It doesn’t matter who you are  —   young, old  —   it’s always good to get off to a good start and get some confidence and momentum going,” said Matt Holliday, the designated hitter who arrived as a free agent from St. Louis. For that, the Yankees will have to wait another 48 hours until they return here on Tuesday night. The last two years, the Yankees have looked unprepared for the curtain to rise. Two years ago, Didi Gregorius was thrown out trying to steal third with his team far behind late. Last year, Dellin Betances bungled a throw to first base that led to a loss. But for the last six weeks, the Yankees looked full of promise as young hitters who are being counted on, Gary Sanchez and Greg Bird, shone and Tanaka, who seemed to put elbow worries behind him last season, dominated. “You want it to carry over as we move onto the season,” Manager Joe Girardi said before the game. “You know that everyone starts fresh. The records, spring training  —   that gets wiped away. But I really like where our club was at the end of spring training. ” If it is a fool’s errand to use spring training as a predictor of future performance, Exhibit A was Tanaka. He allowed just one run in 23 ⅔ innings during spring training, and on Saturday he said he was further along than he had been in previous seasons. A day later, he had one of the worst starts of his major league career. He lasted just two and   innings  —   the   start of his career and the only time he has failed to last five innings since opening day two years ago. He equaled career highs by allowing seven runs, six of them earned, and lost to the Rays for the first time in nine career starts. “Maybe I was a bit hyped up,” Tanaka said through an interpreter. He added that his arm was fine. Tanaka thrives when his fastball is at the knees because the two pitches that work off it  —   his slider and his splitter  —   both have deceptive late movement. “If he’s down in the zone, if he’s locating his fastball, he’s tough,” Rays first baseman Logan Morrison said before the game. “As a hitter, you want him to get the ball up. ” Tanaka obliged, and the Rays, who were sixth in the majors in home runs last season, feasted. Evan Longoria lined a hanging splitter just over the   wall down the   line for a   homer in the second, and Morrison hit a   fastball over the wall in right for a solo homer that gave the Rays a   lead in the third. By then, the Rays did not even need to hit the ball hard. They added their final run as Tim Beckham doubled and scored when Sanchez bounced Mallex Smith’s bunt into the   bullpen. “When he doesn’t pitch well, you’re surprised no matter what,” said the pitching coach Larry Rothschild, who lauded Tanaka’s ability to   problems with his command. “But it happens. He’s human. ” Clues that Tanaka was not in form arrived early. Corey Dickerson lined his second pitch for a single, and Kevin Kiermaier followed with a double. Longoria hit a sacrifice fly. Brad Miller drove in another run with a   grounder that ate up Bird at first base, and Miller later scored on Morrison’s single to put the Rays ahead,  . The Yankees would answer back, but it would be without the help of the heart of their lineup: Sanchez, Bird, Holliday and Jacoby Ellsbury, the No. 2 through 5 hitters. They went 0 for 16. Starlin Castro and Chase Headley hit   singles in the second, and Aaron Judge laced a double to left to score Castro. Ronald Torreyes hit a grounder to bring home Headley, but the Yankees did nothing else to trouble Rays starter Chris Archer over the next five innings. Archer retired 14 of 15 hitters before Castro  —   who had three hits  —   singled to begin the seventh. The Yankees, by then trailing,   had a chance to get back in the game when they loaded the bases with two outs for Sanchez. When Archer won a tense   duel by getting Sanchez to ground out to short, he let out a scream and knocked his own cap off as he bounced toward the dugout. It was the last of his 108 pitches. The Yankees loaded the bases again in the ninth, with a bit of good fortune: an error by Longoria, a liner that ticked off the edge of shortstop Beckham’s glove and Headley’s third single against the shift. The Rays then called on closer Alex Colome, who gave up a   fly ball to Chris Carter, struck out Sanchez and retired Bird on a fly ball to center  —   the last chance for the Yankees to make a good opening impression.'"}, "time": 1742628563.4533591}