{"duration": 0.09356856346130371, "input_args": {"text": "'Donna Hubbard, a flight attendant who lives outside Atlanta, has no problem speaking forcefully about the issue of human trafficking in the United States. But her voice begins to falter when she talks about her own life  —   how years of exploitation shattered her confidence and turned her life upside down. “For many years, I couldn’t talk about being an addict,” she said. “I couldn’t talk about being imprisoned. I couldn’t talk about getting on my feet, getting my life back, getting my children back. ” She paused to fight back tears. “I could not talk about that part of me where I was victimized. ” But having realized that airline employees are perfectly positioned to stop human traffickers and their victims in transit, Ms. Hubbard has found her mission: teaching other flight attendants to spot and report cases of human trafficking. The nonprofit organization she joined in 2015, Airline Ambassadors International, trains workers at airlines and airports how to spot, and report, cases of human trafficking. It also delivers humanitarian aid around the world and transports sick children who need medical care. It was founded in 1996 by Nancy Rivard, who was then a flight attendant. “We just did it on our own as a public service because we had the   personnel,” Ms. Rivard said, noting that the organization began focusing on human trafficking in 2009 and has held 52 training sessions in the United States and abroad since 2011. There were 8, 042 reported cases of human trafficking in the United States last year  —   the most ever, according to a report released last week by the nonprofit organization Polaris. Most of those came through calls to the National Human Trafficking Hotline, which was established by the federal government in December 2007 and is operated by Polaris in a   partnership. The number of reported cases has been rising every year since the hotline was established. But it is not all bad news, said Bradley Myles, Polaris’s chief executive. “We don’t necessarily want to give the impression that just because we’re learning about more cases, the crime is increasing,” Mr. Myles said. “It’s actually possible that the response is getting more sophisticated. ” Encouragingly, he added, more and more of these reports are coming directly from trafficking victims, which suggests a growing awareness among those who need it most that the hotline exists. Ms. Hubbard sees victim outreach as vital to her work, but she is hesitant to give details about her own ordeal. She entered an arranged marriage at 16, she said, but the worst abuses did not start until her early 20s, when she described being “bought and sold, traded and bartered. ” “Usually, the traffickers play on people’s ignorance and naïveté,” she said. “Traffickers exploit people who are vulnerable. ” That is part of the lesson she imparts to airline personnel, along with practical advice on how to spot people who may be traveling against their will  —   often young passengers who look disoriented, refuse to make eye contact or act oddly subservient to a traveling companion. American Airlines, Ms. Rivard’s former employer, offers free miles to the volunteers of Airline Ambassadors International. American’s employees already undergo training on human trafficking, led by the Department of Homeland Security, according to a company representative. Ms. Rivard said airlines’ existing programs are not enough. She cited instances in which she said airline staff failed to take signs of trafficking seriously, and added that she wished more resources were available to her organization. “It doesn’t cost much. We try to raise about $3, 000 per training” from individual donors, she said. An Airline Ambassadors International training session in late January in Houston, just before the Super Bowl there, was filled to capacity. “It was an amazing event,” Ms. Hubbard said. “I give kudos to the city of Houston and to the agencies that are doing the work on the ground. ” Though human trafficking gets more attention during major sporting events like the Super Bowl, there is little hard evidence  —   from Polaris or elsewhere  —   to suggest a major spike in trafficking during large events. “We don’t think it’s useful to somehow give the impression that there are new victims and new types of trafficking that only happen around that time,” Mr. Myles said, though he added that major events might lure criminals who were already operating in other areas. The Houston Police Department has been revamping its approach to human trafficking for years, said Capt. Dan Harris, of the department’s vice division. It now offers training on human trafficking for officers as well as assistance for survivors. “We had the processes, the procedures and the relationships already in place,” Captain Harris said. “The only thing we really did for the Super Bowl was work more hours in order to go after, mainly, the johns. ” While law enforcement agencies and charities work to address the problem on the ground, Ms. Hubbard and other flight attendants plan to keep an eye on things in the air. “If someone is being held against their will, then a crime is being committed inside my airplane,” she said. “So it is my responsibility to make sure that these people  —   whose lives are in my hands while they’re on board my aircraft  —   are safe. ”'"}, "time": 1742563213.8708148}