{"duration": 0.07794952392578125, "input_args": {"text": "'Sputnik reports: \\nAustralian Prime Minister Malcolm Turnbull said the government is set to present a parliamentary bill to amend the Migration Act , and prevent adults who are sent to Australia’s offshore immigration centers from receiving an Australian visa in the future. \\n“This will send the strongest possible signal to the people smugglers, it will send the strongest possible signal to those who are seeking to persuade persons currently on Nauru and Manus (the islands where Australia’s immigration centers are located) that the Australian government will change its mind and allow them to settle here,” Turnbull said. \\nAustralian barrister Greg Barns, spokesman for the Australian Lawyers Alliance, told Radio Sputnik that the proposal breaches the UN Refugee Convention. This declares that refugees are entitled to claim asylum regardless of their method of reaching a country, if they say they have been persecuted in their country of origin. The government’s plan would prevent migrants from visiting Australia many years later, while on business or as tourists, even if they have successfully settled in a third country and gained citizenship there. \\n“It’s the most draconian legislation the world has ever seen, it’s unprecedented in global terms, and it means that Australia puts itself, yet again, in the basket of pariah states when it comes to those sorts of issues ,” Barns said. \\nTurnbull’s Liberal Party will require the support of opposition parties to pass the legislation. While Bill Shorten, leader of Australia’s opposition Labor Party, said the proposal “seems ridiculous,” his party stopped short of rejecting it and instead promised to examine the plan closely. \\n“Unfortunately the opposition Labor Party in Australia has been very weak on these issues in recent years, and both the major political parties, the conservatives (Australia’s Liberal Party) and the Labor Party, have been able to force these sorts of changes on Australian policy,” Barns told Sputnik. \\n“There have been suggestions today that the Labor Party might finally get some backbone and oppose this legislation, because if the Labor Party, which is the major opposition party, supports this legislation, then it will become a reality.” \\nThe government’s claim that their proposal is compliant with international law is “laughable,” and “shows yet again that Australia snubs its nose at international law when it suits it,” Barns said. \\nBarns said that Australia’s immigration policy has become harsher as a result of public fears of migration, and the actions of successive government which have played on these fears. \\n“Some Australians have a xenophobic, racist view about the rest of the world, they have this ridiculous fear about hordes coming to this island continent and invading it, that’s been historic.” \\n“If you don’t have strong political leadership which says that we can do better, this will become politically popular,” said Barns, who contrasted the current policy with that of Malcom Fraser’s 1970’s Liberal government, which accepted large numbers of refugees who came on boats from Vietnam. \\nSince the government of John Howard from 1996 to 2007, “successive governments in Australia have pandered to the xenophobic, racist side of the country, and that’s precisely what Malcolm Turnbull is doing with this legislation.” \\n“Australia is a nation built on migration, and in fact some of the leading figures in Australian society came here by boat. Those very same people now would be banned under this law.” \\nTurnbull’s proposal has won the praise of Australia’s right-wing populist One Nation party, led by Pauline Hanson, who won re-election to Australia’s House of Representatives this year. Good to see that it looks like the Government is now taking its cues from One Nation. Just like last time. #auspol #PHON #Nauru #Manus https://t.co/c0GQew7vR8 \\n— Pauline Hanson (@PaulineHansonOz) 30 October 2016 \\nBarns said that Turnbull’s proposal is an effort to attract votes from Hanson’s One Nation to the conservative Liberal Party. \\n“Malcolm Turnbull’s party wants to try and take over some of its vote, and it seems to be that this is the way to do it. To pass outrageous, draconian laws that trash Australia’s reputation even further in world eyes when it comes to refugees, simply for short-term political gain.”'"}, "time": 1742562284.191405}