{"duration": 0.11638832092285156, "input_args": {"text": "'For All Democrats to Ponder: the Real Reasons Hillary Clinton Lost Beyond the media spin, the four reasons for this defeat. By Tony Brasunas / medium.com As the aphorism goes, if we don’t learn from history, we are doomed to repeat it. While the corporate media continues to peddle hysteria, the most important thing right now is to rationally understand why Clinton and the Democrats lost this eminently winnable 2016 race for the White House. Having taken some time to look back over the past six months, I list below what I believe are the four main underlying reasons for this defeat. As it turns out, none of the reasons is particularly complicated, but each will require consideration and systemic change by the party over the next two years. 1. The DNC subverted democracy. This was an anti-establishment year in politics, and there was an anti-establishment candidate running in both major parties. Trump was (barely) allowed to win the primary on the Republican side. On the Democratic side, despite Bernie’s obvious strength and the clear preference of the grassroots, the primary was rigged to put the less popular, establishment candidate forward. It was a colossal risk to take, but the party leadership in the DNC chose to advance their favored candidate so as to maintain their power inside the party and their fundraising with big banks and supranational corporations. The risk backfired. Free and fair democracy would have given Bernie the nomination, likely the White House, and even better, leadership in an expanding and exciting party positioned to win elections for years to come. 2. The media and the DNC deliberately elevated Trump. The wikileaks reveal that the DNC chose to deliberately use the Clinton campaign and the media to elevate Trump (as well as Ted Cruz and Ben Carson) as a candidate, thinking he would be the easiest to beat. They utilized this “pied piper” strategy for months. This was another colossal risk the DNC took, and it backfired horribly. Partly in tandem with the DNC — but largely of their own volition — the corporate media lavished hour upon hour of free coverage on Trump, daily, for a solid year. It is the height of irony today for corporate media pundits to bemoan with shock and consternation Trump’s victory, when his candidacy is truly their creation. If any candidate receives hours of coverage by the major media, for free, every single night, for a year, he or she will win elections, and possibly the presidency. 3. Clinton ran a weak and uninspired campaign. Once she had the nomination, Clinton ran a campaign without an inspiring message — other than perhaps voting for a woman for president. She courted conservatives like the Bushes, the Kochs, and Henry Kissinger, she picked corporate centrists for vice president and other prominent roles, she never connected with a base that after all of Bernie’s amazing campaigning was ripe for engagement, and she turned her back on progressive issues time and again. She stopped talking about climate change and racial justice and corruption in government, and she never addressed the pressing progressive issues of the day, such as Standing Rock and TPP. Seemingly she hoped to coast to victory with little more than platitudes and scare-tactics about Russians reminiscent of the 1950s. All of this while barely escaping two FBI indictments. She became a weak and unpopular candidate holding on to a narrow lead merely because Trump was so ridiculously bad. Trump’s inadequacy as a candidate masked the weaknesses in Clinton’s sinking campaign. For its part, as a slogan, “Stronger Together” never resonated with people who haven’t recovered yet from the Great Recession and who continue to get by with less everyday; indeed for poor and working class people who feel on the outside of the country’s latest wealth generation, this slogan seemed at best ironic and at worst to deliberately exclude them. 4. The complete failure of neoliberalism. This is perhaps the most important thing to understand. Trump didn’t win because of racism; that only got him, generously, 20% of the vote. Trump won by — like Bernie — offering everyday people an alternative to the utterly failed policies of neoliberalism. Not to scare you with this big word, but we are hearing (hopefully) the final death knell of the fancy idea, born under the Clintons, that the country could pass corporate-supremacy laws, call them “free trade” deals, and allow corporations to seek the cheapest, least regulated labor, anywhere in the world, and leave the country that supports these corporations high and dry. It’s a fabulous deal for corporations — their profits have soared — but it’s a wretched deal for working class people, the environment, unions, towns and cities, and long-term national sovereignty for the nations of the earth. People were bound to finally wake up to this, and now they have. If you don’t know what the TPP is, please go learn; Hillary and Obama want to pass this crown jewel of corporate supremacy; Bernie and Trump oppose it. There are your real reasons. Getting this right does matter, so let me know if I’ve missed anything. Honorable mentions not making the top four: Fraudulent voter purges in Florida and Ohio that favored Republicans. Voting machine election fraud. More research on this topic forthcoming. The electoral college. Clinton did win the popular vote nationwide but will lose the count of state delegates in this undemocratic system. Independent voters, progressive voters, and libertarian voters who didn’t vote, or who voted for other candidates because the DNC’s candidate didn’t inspire them should be considered symptoms of the above, not reasons unto themselves. If you run an unpopular candidate on a platform of failed policies and simultaneously elevate your opponent, you will lose any remotely fair democratic election. If you run an unpopular candidate on a platform of failed policies and simultaneously elevate your opponent, you will lose. The question now is whether the Democratic Party can right its ship and finally turn away from neoliberalism and corrupt corporate politics. Can the DNC, over the next two years, relinquish its corrupt role in guiding the party and allow the grassroots to return the party to its best historic role as genunine representatives for poor and working class people, the environment, democracy, and the rule of law? Personally I’m skeptical , but I am ready and happy to be proven wrong. Liberals, progressives, and peaceful revolutionaries of all stripes: There are many more battles ahead. Keep fighting, keep learning, and above all keep paying attention. We must learn from this election so as not to repeat it. Tony Brasunas - Where rationalism and idealism meet. 0.0 ·'"}, "time": 1742564380.6012056}