{"duration": 0.1665968894958496, "input_args": {"text": "'Posted on November 2, 2016 by DavidSwanson \\nIf you’re a fan of the Netflix show Black Mirror , go watch the episode called “Men Against Fire” before reading this. It’s the one about war. \\nIn this 60-minute science fiction show, soldiers have been (somehow) programed so that when they look at certain people they see them as freaky monsters with pointed teeth and bizarre faces. These people look frightening and non-human. They are thought of as objects, not as people at all. In reality they are themselves terrified, unarmed, ordinary looking people. And they have a tool with which to protect themselves, a stick with a green light. It doesn’t kill or injure. The stick deprograms a soldier so that when he looks at someone he sees them as they really are without the monstrous distortion. \\nOf course a deprogramed soldier is of no use to the military. In “Men Against Fire” the military offers a deprogramed soldier two choices. He can re-experience on an endless loop a recent reality in which he murdered helpless human beings, but this time experience it while seeing them as human beings instead of as “roaches” (what the military calls the intended victims made to appear monstrous), or he can be reprogramed and get back to the untroubled work of extermination. \\nWhile this story is more fiction than science, some reality breaks into the Netflix drama. During World War I, we’re told accurately, a commander beat troops with a stick to get them to shoot at enemies. Troops we’re also routinely drugged for the same purpose. During World War II, we’re told, also on the basis of actual studies, only 15% to 20% of U.S. troops fired at opposing troops. In other words, 80% to 85% of the Greatest Heroes of the Greatest War Ever were actually a drain on the killing campaign, whereas the conscientious objector featured in the new Mel Gibson movie or, for that matter, the guy who stayed home and grew vegetables contributed more to the effort. \\nKilling and facing killing are extremely difficult. They require the closest human reality to programing. They require conditioning. They require muscle memory. They require thoughtless reflex. The U.S. military had so mastered this programing by the time of the war on Vietnam that as many as 85% of troops actually fired at enemies — though some of them also fired at their own commanders. The real trouble came when they didn’t remember these acts of murder as the extermination of “roaches” but as the reality of what they were. And veterans remembered their acts of murder on an endless loop with no option to be re-programed out of it. And they killed themselves in greater numbers than the Vietnamese had killed them. \\nThe U.S. military has advanced not an inch in the matter of reconciling its killers to what they have done. Here’s an account just published of what that means for veterans and those they know and love. You can easily find another such account every day online. The top killer of members of the U.S. military is suicide. The top killer of the people who live in “liberated” nations during their liberations is members of the U.S. military. This is not coincidental. Veterans suffer from post-traumatic stress disorder (only a disorder from the perspective of those who’d like to suppress healthy inhibitions), moral injury (what a veteran friend calls “a fancy word for guilt and regret”), and neurocognitive disorder/brain injury. Often the same individual suffers all three of these types of harm, and often they are hard to distinguish from each other or to fully diagnose prior to autopsy. But the one that eats your soul, the one solved only by science fiction, is moral injury. \\nOf course science fiction only works when it overlaps with nonfiction. U.S. troops conditioned to kick in doors in Iraq or Syria and view every person inside as a non-human threat don’t use the term “roaches,” preferring “hadjis” or “camel jockeys” or “terrorists” or “combatants” or “military aged males” or “Muslims.” Removing the killers physically to a drone piloting booth can create psychic “distance” aided by reference to victims as “bugsplat” and other terms in the same vein as “roaches.” But this approach to producing conscience-free killers has been a spectacular failure. Watch the real suffering of the real drone killers in the current movie National Bird . There’s no fiction there, but the very same horror of the roach-killing soldier re-experiencing what he’s done. \\nSuch failures and shortcomings for the military are never complete failures of course. Many kill, and kill ever more willingly. What becomes of them afterward is not the military’s problem. It couldn’t possibly care less. So, awareness of what becomes of those who kill won’t stop the killing. What we need is the real life equivalent of a little stick with a green light on it, a magic tool for deprograming members of every military on earth, every potential recruit, every investor in weapons dealing, every profiteer, every willing tax payer, every apathetic observer, every heartless politician, every thoughtless propagandist. What can we use? \\nI think the closest equivalents to the stick with the green light are passports and telephones. Give every American a passport automatically and free. Make the right to travel inviolable, including for felons. Make the duty to travel and to speak multiple languages part of every education. And give every family in every nation on the Pentagon’s potential enemies list a phone with a camera and internet access. Ask them to tell us their stories, including the stories of their encounters with the rarest of species: the newly appearing Unarmed American. This entry was posted in General . Bookmark the permalink .'"}, "time": 1742562164.2876563}