{"duration": 0.0660245418548584, "input_args": {"text": "'President Rodrigo Duterte of the Philippines, overseer of a contentious and bloody crackdown on drug dealers and users, boasted on Monday about having personally killed criminal suspects when he was mayor of Davao City. “In Davao, I used to do it personally  —   just to show to the guys that if I can do it, why can’t you?” Mr. Duterte told business leaders at a meeting in Manila, explaining how he goaded police officers to gun down suspects. “And I’d go around in Davao with a motorcycle, with a big bike around, and I would just patrol the streets, looking for trouble also,” he said, according to The Manila Times. “I was really looking for a confrontation, so I could kill. ” Mr. Duterte is known both for his tough stance on crime and for controversial remarks. He has acknowledged killing before  —   in 2015, he said that he had killed at least three men suspected of kidnapping and rape in Davao City  —   but his remarks on Monday appeared to be his first such public admission since he became president. When he was mayor of Davao City, Mr. Duterte was known to carry a . 38 pistol and was accused of overseeing a death squad to kill people suspected of being criminals. As president, he has led a nationwide “war on drugs” by the police and vigilante groups, which has left more than 3, 000 people dead. Hours earlier on Monday, Mr. Duterte spoke at an awards ceremony in Manila, where he said, “I am not a killer,” and then threatened to kill police officers who disobeyed him. “I do not relish or enjoy a Filipino sprawled there with all the blood,” he said, according to the Philippine Star. “With regard to the killing of persons on bended knees, with hands tied behind their back, that’s not ours. Will that make you a better soldier or policeman? If they do that, I’ll shoot them. ” Though he has led a brutal crackdown on drug addicts, Mr. Duterte seemed to imply in his remarks to the business leaders that he had overused an addictive drug himself. Speaking in English, Mr. Duterte said he had been prescribed the powerful painkiller fentanyl because of chronic back pain and migraine headaches. “I was only given a fourth of that square thing,” he said, describing a patch containing the drug that was to be applied to the nape of his neck. “There was a time that if I took two  —   of course, my doctor learned that I was using the whole patch, because I felt better. ” The Philippine Star posted a video of the speech online. A   hit man told a Philippine Senate committee in September, as part of an inquiry into extrajudicial killings in Davao City, that Mr. Duterte had personally ordered the killing of citizens when he was mayor. In October, Mr. Duterte compared himself to Hitler, saying that he would be “happy to slaughter” three million drug addicts.'"}, "time": 1742561776.7347374}