{"duration": 0.14828085899353027, "input_args": {"text": "'Sunday night’s episode of “Keeping Up With the Kardashians” played less like a breezy record of the   demimonde than a   documentary. Early in the episode, Kim Kardashian West was called to action by her husband, Kanye West, after audio of him angrily referring to Taylor Swift as “fake” leaked in February. Over and over again, she reiterated how she felt that Mr. West was portrayed unfairly in public, by Ms. Swift and others. As the episode goes on, Ms. Kardashian West’s ire rises  —   clearly, she is plotting her moves. At the end, she seeks advice from her mother and manager, Kris Jenner. Ms. Jenner suggests calling Ms. Swift to smooth things over. Ms. Kardashian West says no, thanks. Just as the episode ended on the East Coast, Ms. Kardashian West released on Snapchat several video clips of a phone conversation between Mr. West and Ms. Swift in which he appears to get her support  —   mostly enthusiastic, perhaps slightly hesitant  —   for provocative lyrics that refer to her on his song “Famous,” from his album “The Life of Pablo,” released in February. Not long after, Ms. Swift released a statement on  Instagram stating that she had not approved of the song and that Mr. West had not delivered on a promise to play her the final version before its release. “While I wanted to be supportive of Kanye on the phone call, you cannot ‘approve’ a song you haven’t heard,” she wrote. These are the latest salvos in the running squabble between Ms. Swift and Mr. West, a gripping but unfortunate beef that puts two of the leading pop stars of the day at loggerheads. The first phase of their disagreement dates from the 2009 MTV Video Music Awards, when he crashed her acceptance speech for best female video, in a show of support for Beyoncé, whom she had beaten. They didn’t publicly reconcile until the 2015 Grammys, and the road since has been bumpy. On “Famous,” he rapped, in familiar hyperbolic style, that they “might still have sex,” and that he was responsible for her success. Shortly thereafter, she lashed out at him (without using his name) from the Grammy stage. The video for “Famous,” released last month, features a Swift   along with other celebrity   topless in bed with Mr. West and Ms. Kardashian West, an   jolt of beatific   erotica. Ms. Swift and Mr. West couldn’t be more different: Ms. Swift is a covert operator, Mr. West a namer of names. Ms. Swift is as careful a crafter of narrative, both in song and in life, as anyone in pop. Mr. West shoots from the hip it’s the source of much of his charm. Throughout this battle, each has accused the other of dishonesty. There is a fundamental layer of falseness and contrivance to all public images: Celebrity culture relies on that layer not being disrupted. Part of the power of the video Ms. Kardashian West released is it appeared to show that Ms. Swift’s public presentation and private machinations were at odds. The Ms. Swift in those video clips is    —   “I’m, like, this close to overexposure,” she said  —   in a way she often isn’t in public, and she is also willing to disrupt her image in unexpected ways. But her stern response to the song’s release served as a reassertion of the old order. It also extended a narrative in which Mr. West, who is black, is painted as the predator and Ms. Swift, who is white, as the prey, a story with uncomfortable racial overtones. In the excerpts, though, Mr. West is solicitous and warm. “I feel like me and Taylor might still have sex,” he says, enunciating each word of the lyric carefully, with Ms. Swift on speakerphone. Rhythmically, it sounds like perhaps he’s workshopping one of two options with her. Later, he says: “I want things that make you feel good. I don’t want to do rap that makes people feel bad. ” (The clips are short and choppy, and clearly excerpts. On Twitter in February, Mr. West said the call with Ms. Swift had been an hour long.) “I just really appreciate it,” Ms. Swift said. “I never would have expected you to tell me about a line in your song. ” “Relationships,” Mr. West tells her, “are more important than punch lines. ” Seeking permission for a lyric is an extraordinary step, especially for Mr. West, whose loose tongue is his greatest asset. Ms. Swift, by contrast, has generally avoided identifying the subjects of her songs, though after the 2009 V. M. A. s, she released the rather patronizing “Innocent”  —   including the words “Who you are is not what you  ’re still an innocent”  —   which she described in a 2010 interview with MTV as not a song about Mr. West but one “to” him. (Her song “Dear John” is widely believed to be about John Mayer, to whom Ms. Swift was romantically linked. It is one of the most effective and ruthless eviscerations of a fellow celebrity in pop history, and it seems unlikely that Ms. Swift ran it past Mr. Mayer for approval.) Given the seemingly genial nature of the conversation between Ms. Swift and Mr. West, what agitated Ms. Swift remains unclear. The release of video clips of the call is a clear violation of trust and raises possible legal issues. (The legality of recording phone calls varies from state to state a representative for Mr. West did not respond to an inquiry about where the rapper had been at the time of the call.) In an interview with GQ released last month, Ms. Kardashian West mentioned that Ms. Swift’s legal team knew about the recorded conversation “and then they sent an attorney’s letter like, ‘Don’t you dare do anything with that footage,’ and asking us to destroy it. ” The statement issued by Ms. Swift’s representative when Mr. West’s “Famous” came out said that Ms. Swift had “cautioned him about releasing a song with such a strong misogynistic message,” but that does not appear to be in line with what she expresses in these video clips. The statement also said, “Taylor was never made aware of the actual lyric, ‘I made that bitch famous. ’” The video clips on Ms. Kardashian West’s Snapchat do not show Mr. West asking about that line. And so, if this conflagration turns on the interpretation of that epithet, then what may be at play is a contextual misread, or perhaps a clash of value systems. Mr. West comes from the world of   where use of that term to refer to women can be so pervasive as to dull its pejorative meaning. In 2012, Mr. West unveiled the song “Perfect Bitch”  —   it was about Ms. Kardashian West, then his girlfriend. But though it has become a catchall term, it still carries undeniable historical baggage. Perhaps Ms. Swift didn’t like hearing herself referred to in that fashion, regardless of the context. Maybe she was concerned about her young female fan base and the word’s effect on them. Maybe she simply got cold feet. Whatever the case, both sides have opted for public escalation over private reconciliation. Mr. West and Ms. Kardashian West are armed with selectively edited documentation optimized for social media distribution. They are primed for battle. Meanwhile, Ms. Swift and her team increasingly transmit an air of fatigue. After Ms. Kardashian West’s GQ interview, Ms. Swift’s representative released a statement that concluded, “Taylor cannot understand why Kanye West, and now Kim Kardashian, will not just leave her alone. ” And Ms. Swift’s latest reply concludes with a similar sentiment, though this time from her directly: “I would very much like to be excluded from this narrative, one that I have never asked to be a part of, since 2009. ” But this bespeaks a misunderstanding of how public storytelling unfolds. It is crowdsourced, not written from the top down. In the past, Ms. Swift’s refusal to name the subjects of her songs or any of her personal antagonists also robbed them of their opportunities to respond, keeping the narrative tidy. But that’s not an option when the two main characters are equally famous. Ms. Swift’s revulsion only amplifies the situation: The farther from Mr. West she tries to pull, the more tightly they are bound.'"}, "time": 1742562232.7768302}