{"duration": 0.2192857265472412, "input_args": {"text": "'Pop music and fashion never met cuter than in George Michael’s “Freedom! ’90” video. Sure, other catwalk favorites starred in music videos during that era, and fashion photographers like Steven Meisel and Herb Ritts were recruited by stars such as Madonna, Chris Isaak and Janet Jackson to burnish their visuals. But the convergence of a   maker’s irresistible rhythms and lyrics, a group of models at the peak of their fame and a director on the verge of his own runaway success gave “Freedom! ’90” a jolt of stylish energy that has yet to fade after more than a  . Directed by David Fincher, who was at the start of his film career, and filmed over several days at Merton Park Studios in London, the video from Mr. Michael’s 1990 album, “Listen Without Prejudice Vol. 1,” brought together five models  —   Naomi Campbell, Linda Evangelista, Christy Turlington, Cindy Crawford and Tatjana Patitz  —   who were then the queens of fashion. It runs for six and a half minutes, and its production also gathered a team of novice professionals who would go on to become major forces in fashion, including the stylist Camilla Nickerson, the hairdresser Guido Palau, the makeup artist Carol Brown and the model John Pearson. Shot in moody, romantic   tones, “Freedom! ’90” had been viewed more than 37 million times on YouTube by the time of Mr. Michael’s unexpected death at 53 last Sunday. Reached by phone this week, some of the participants recalled their experiences on set, and some of the video’s most ardent fans reflected on its impact. Naomi Campbell, model. We’d done a British Vogue cover with Peter Lindbergh with all of us. I met George in L. A. and he said: “I’ve been told that I need to speak to you to get the girls for the video. What would it take to get you?” We were living in America, so I said you’d have to fly us in, basically. I said yes, and then Christy and Tatjana and everyone came in. The night before the video, I didn’t sleep at all, because we did five shows for Thierry Mugler in Paris. He had 76 models, and it was the big finale of him designing, although none of us knew that then. The last show finished at around 3 o’clock in the morning, and George was there. So from there I went back to my hotel, packed my bags and went on the first flight to London. David Fincher knew exactly what he wanted. He didn’t really give us parts, but he knew exactly which part of the song he wanted each and every one of us to sing. I was more the active one. Cindy was sultry. I don’t think any of us knew what it would become. We knew the song was a hit, but we didn’t know in any way what effect it would have in terms of videos, the way it would affect people. We were all really excited on the day it was going to be aired. They all had great premieres back in the day. They don’t have them anymore. Not that I’ve seen. MTV’s changed. Hasn’t it? I got to see George a little bit more after that because Kate Moss was neighbors with him. When we did the Olympics, he sang there in London. We all did the finale, and he was rehearsing and Kate and I went to watch him with this amazing choir singing “Freedom. ” After, he invited us all back to his home and he had this really nice   in the garden, and we all got to light these wishing lanterns and we all did that together. That’s the memory I’m going to keep. Guido Palau, hairdresser. I don’t know how I got the job. George Michael and David Fincher had seen some of my work in British Vogue. It was a different time then. It was a big, big production, a   video because they had to bring in all the girls. Every girl had a day, though Christy and Linda were there together. My part was to make the girls the best they could look as who they were. They weren’t playing characters. They were playing themselves. And each had their own personality: Linda the comedian, Christy much more classic, Cindy the pinup, Tatjana this kind of film noir, and Naomi a very strong kind of woman. We extracted that from them. They weren’t prodded at all, though there were some surprises, like Linda’s hair, which she’d done for a job for someone else. It wasn’t like I said, “Oh, dye your hair blond,” not at all. At the time, we really didn’t realize how iconic the video would become. I was probably a bit naïve about the whole thing seeing how it was a bit of a   job for me. What I remember most is the days being very long, and at the end of the day, the red wine would come out. There we’d be in the location van drinking and singing with George. Tatjana Patitz, model. I was in my own zone. I had to kind of slide up and down the wall for part of the day. The feel of the set was so   this big, loft kind of vibe. There was another setup with me laying on a chaise longue with a black smoking jacket. I think I may have had a bustier on. And I was smoking, even. People still smoked in videos then and even in films. George Michael wasn’t on the set the day I was there, but I’d met him a few times in L. A. Herb Ritts shot a cover of me and him for a magazine  —   I’m trying to remember what magazine it was. So many magazines have come and gone. Glamour was very present in fashion in those days, feminine glamour, people looking at inspiration from the movie stars of the ’40s and ’50s  —   Audrey Hepburn, Grace Kelly and Ava Gardner. A lot of magazines were pairing models with pop stars or movie stars to shoot covers. It was very different those days. The business was much smaller and wasn’t as saturated, not as fast as it is now. Models were known by their first names, and suddenly the glamour we embodied at that time crossed over to pop music videos and film. We were part of the entertainment industry, which made it really fun. George was very nice, almost a little shy. Maybe that’s the wrong word. He was mellow and kind. I was quite   at the time because I grew up with Wham and their music he was one of my first teenage crushes. In the five or so times I met him, he was always very pleasant and sweet but timid, not one of those vivacious,   people who take a room by storm. I remember the shoot being in fall or early winter. I flew in on the Concorde for the day and flew back to New York right after that. It’s funny. A lot of people were using models in videos then, but this one in particular stood the test of time. It’s not like you look at “Freedom! ’90” now and say, “Oh, my God, it’s so ’80s!” It’s not like “Working Girl. ” John Pearson, model. My agent called up and said: “Hey, do you want to do this video? All the big girls are doing it. ’” Of course I said yes. I was a big George Michael fan. I used to see him all the time in London at the clubs. I arrived at the studios at 3 o’clock in the afternoon and met David Fincher briefly, and then basically sat around all day and watched while Christy and Linda were being shot. There’s one shot where Linda puts her head underneath her sweater that’s amazing. That wasn’t rehearsed. Linda really knows how to use her body to communicate in an elegant way, never cheap and tawdry. George was there, very warm and nice but very shy. The day went long, and the producer said at the end of the day, “Can we shoot you tomorrow?” I didn’t have another job booked, so I said, “Sure. ” Then he said, “Do you mind doing it for nothing?” I said, “No way. ” It was a little bit bolshie of me, but I knew what the girls were getting. In the end, I was paid $15, 000 for the day, which is not bad to hang out with these fabulous, beautiful girls. But I’d been working nonstop for three years, and I wasn’t going to do it for free. And it turned out to be one of those fabulously easy,    jobs, everyone riding on this wave of semistardom and recognition for the models. I really didn’t realize how big it all was at the time. Candis Cayne, actress, model and former drag personality. There was a group of girls in N. Y. C. in the ’90s, and we didn’t want to model ourselves on anything other than the supermodels. Linda and Naomi and Christy. So when the video of “Freedom!” came out and they were all in it, we were obsessed. I used to do shows at Boy Bar, so I decided I was going to do “Freedom!” and got Lina and Mistress Formika and Sherry Vine to play the various parts. I was Linda. She was my favorite. We did the whole thing naked under white sheets. After the very last chorus, we dropped the sheets and were completely naked holding our groin areas. That song meant a lot to us. There were singers we knew were gay then, but no one really talked about it. We just grabbed onto songs and artists who knew who and what we were, whether it was Madonna with “Vogue” and “Truth or Dare” or George Michael with “Freedom!” I don’t know if he was openly gay or not, then. I guess not. But it was almost O. K. because we all knew and it was such a homophobic time. It was so oppressive, particularly when you factor in the AIDS epidemic. To be open would have been a career killer. But going to a club, listening to “Freedom! ,” it was an escape. Alan Hunter, one of the original MTV V. J. s. It was a funny moment in my life. I was driving my kid to day care on a day where I didn’t know where my career had gone. I’d left MTV. My agent wasn’t calling. I was depressed. And I turned on the radio, and on came George Michael’s new song. It was George Michael at the peak of his writing skills. It was such a brilliant   capstone I’d ever heard. It was his    song. He was saying, “Everything that brought me to pop stardom I now disavow. ” Then I saw the video shortly thereafter with all that iconography he’d used in his past, and he literally sets those things on fire and explodes them. The leather jacket he’d worn and the jukebox from “Faith. ” And he just steps away. He wasn’t even in the video. It showed how serious he was, even while he said it all with a lot of love. It was such a joyous song. I actually felt happy. Zac Posen, fashion designer. I was 10 years old, 10 or 11. I’d see it in my living room waiting for Madonna to come on. I probably wanted to be the child in “Open Your Heart. ” But what I remember about “Freedom!” was that it was kind of a seminal predecessor to grunge. Because you have these incredibly glamorous beauties in a very industrial, Corinne Day,   space. There’s water dripping down the walls and George Michael’s leather jacket is on fire, and the models are naked. It was really the glamour of the ’80s transitioning into something more raw that was to come.'"}, "time": 1742562061.7096536}