{"duration": 0.053169965744018555, "input_args": {"text": "'Authorities in two German states have expressed concern over official figures showing a huge rise in migrant crime, with the number of violent attacks having almost doubled in 2016. [“Refugees really entered onto the crime scene last year,” said   State Criminal Police Office (LKA) president Ralf Michelfelder.  “We are very worried about the rise in violence by asylum seekers,” the police official added. The comments come following the release of figures which reveal a 95. 5 per cent spike in the number of physical attacks carried out by asylum seekers and migrants. Around 60 per cent of the assaults take place in asylum accommodation but the other 40 per cent are carried out among the general public. This group of migrants are also heavily represented among people caught for theft and drug offences, according to this year’s statistics. But “they can now be found as suspects of crimes in almost every field” according to the police official. Of a total of 251, 000 criminal suspects across the state in 2016, 107, 417 were foreign, with 25, 379 of these being asylum seekers and refugees. Syria was the most frequently seen country of origin in the latter category, followed by Gambia, and then Afghanistan. In Bavaria, the number of crimes committed by immigrants rose 57. 8 per cent from the previous year, a development which the state’s Interior Minister Joachim Herrmann described as “worrying”. “The increase in crime in Bavaria in 2016 is mainly due to foreign suspects, especially immigrants,” the minister said. There had been a 3. 3 per cent overall rise in the number of crimes statewide (the figure adjusted to remove offences like illegal immigration). The number of homicides in Bavaria increased by 15 per cent in 2016, while violent crimes carried out by asylum seekers rose by 93 per cent to 3, 495 cases. Of thefts which occurred across the German state, 42. 8 per cent of suspects were of foreign origin  —   an almost 1 per cent rise from the previous year. Earlier this year, the Berlin Senate launched a formal inquiry to find out why migrants are overrepresented in the city’s police crime reports compared to Germans. According to Germany’s Federal Police, the influx of newcomers from the third world since Europe’s migrant crisis directly led to an increase in crime within their jurisdiction.  '"}, "time": 1742563166.2991197}