{"duration": 0.12139105796813965, "input_args": {"text": "'Thursday on San Antonio’s KTSA broadcast of “The Trey Ware Show,” Sen. Ted Cruz ( ) weighed in on a legislation expected to be passed out of the House of Representatives that would repeal and replace the existing Affordable Care Act, also known as Obamacare.  Cruz credited the House’s Freedom Caucus for taking the lower chamber’s first effort at taking on Obamacare and making it better this time. “I’m encouraged on Obamacare,” Cruz said. “The House has been working diligently, and it looks like they’ve reached an agreement. So, it appears that the votes are there to pass it out of the House today. I think that’s a positive thing. What we’ve seen between when it was first introduced and now, is the Freedom Caucus  —   the strong conservatives in the House have been pressing really hard to improve this bill and to make it better. And what they’ve been focusing on quite rightly is that we’ve got to lower health insurance premiums. But, that’s going to be the test of success or failure. Do premiums go up or do they go down? If we can lower premiums, it’s a victory. ” Cruz was skeptical of the legislation’s chances as it is of making it out of the Senate and said it was “incumbent” for the body to make the bill better. “[I]f it passes today and comes over to the Senate, then it’s going to be incumbent on us to work to make it even better,” he said. “Getting it out of the Senate is not going to be easy. Republicans have a very narrow   majority. Every Democrat is a no, so we start off with 48 nos. And with a   majority, it means we can lose at most two Republicans. Three Republicans go no, and the bill goes down. So that means we’ve got to have a bill that can bring together a majority  —   at least 50 of those 52. ” “Now what I’ve been doing, Trey, for over a month now, is I assembled a group of senators  —   Republicans across the ideological spectrum  —   and we have been meeting weekly, sitting down and trying to come to common ground, trying to come together and say ‘Where do we all agree on how we repeal Obamacare and fix the underlying problem?” he continued. “What are consensus ideas?’ And when there are disagreements, ‘How can we reach a resolution that satisfies that core objectives of each?’ And so we’ve got the full ideological spectrum. We have people who are conservatives, we have people who are much more moderate, and we’re sitting down  —   now meeting twice a week to try to work through and come to agreement. It, frankly, is the process I think the House of Representatives should have started with, and they didn’t. But we’re going to try to do it in the Senate and I hope we can get it done. My view is failure is not an option. We’ve been promising the voters we’d repeal Obamacare for seven years, and I think if we fail to deliver on that I think the consequences would be catastrophic. ” Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742563600.5401974}