{"duration": 0.0748739242553711, "input_args": {"text": "'While Americans are scrambling to meet the 2016 tax filing deadline, the number of illegal immigrants submitting their returns in the present climate are reportedly down significantly. Also, a Treasury Inspector General for Tax Administration (TIGTA) report exposing significant refund fraud has “most certainly contributed to it,” says the taxpayer advocate department within the IRS. [The Internal Revenue Service stated that millions of people who do not have Social Security numbers (SSN) most of these illegal aliens, filed federal tax returns last year, reported NPR the day before the tax deadline. Many of those who are ineligible for SSN use “ITIN,” or Individual Taxpayer Identification Numbers when filing.  The Taxpayer Advocate Service, an independent organization within the IRS, reports that “Without ITINs, approximately 4. 6 million taxpayers would not be able to comply with their annual tax filing and payment obligations, or receive tax benefits to which they are legally entitled. ” The advocate service states that ITIN applications and “associated return filings” “have dropped precipitously, down 58 percent between 2011 and 2014. ” They write that the “general economic climate and immigration trends” explain part of this drop, but the “IRS ITIN procedures have most certainly contributed to it. ” After the TIGTA report “alleging significant refund fraud connected to ITINS,” in 2012 the IRS made what its independent advocacy service calls “sweeping changes that require applicants to submit original identification documents (subject to a few alternatives). ” The IRS has also continued its policy of requiring applicants to apply for an ITIN with a paper tax return. The new requirements led to delays for the ITIN applicants and associated large backlogs, the Taxpayer Advocate Services says. The independent arm charges that “While concerns about refund fraud are legitimate, the IRS’s solutions do not effectively target the fraud nor do they balance the   regime with the taxpayer’s need for a process no more intrusive than necessary, part of a taxpayer’s right to privacy. ” Moreover, NPR reported that tax preparers in the sanctuary city San Francisco area told them there is approximately a 20 percent decline in the number of people filing with ITIN numbers. A tax law professor at the University of Nevada said that tax preparers in other parts of the United States are making similar claims. “Sending in a tax return with your current address and information is very unnerving to a population that wants to comply with the law and is actually leaving significant refunds on the table by not filing tax returns,” educator Francine Lipman said. The IRS is barred from giving information it has obtained to other United States agencies, including the Department of Homeland Security. They may share information only under “limited circumstances” NPR reported. The professor says that those bearing ITIN numbers must decide “whether to trust that firewall. ” “Many of our clients are telling us that in years past they felt more hope and more of ability to have a pathway toward citizenship and lately there’s a lot less hope,” Max   the head of a tax program at the Mission Economic Development Agency told NPR. Lana Shadwick is a writer and legal analyst for Breitbart Texas. She has served as a prosecutor and associate judge in Texas. Follow her on Twitter @LanaShadwick2.'"}, "time": 1742564429.5757318}