{"duration": 0.05719804763793945, "input_args": {"text": "'Dozens of Groups Call on Facebook to End Censorship Posted on Oct 31, 2016 \\nBy Deirdre Fulton / Common Dreams Facebook had more than 1 billion monthly active users in the second quarter of 2016. ( Flickr / CC 2.0 ) \\nAs Facebook comes under fire for its alleged censorship and tracking of activists and protesters, a coalition of more than 70 groups and individuals has demanded the social media behemoth “clarify its policy on removing video and other content, especially human rights documentation, at the request of government actors.” \\nA letter —whose signatories include the American Civil Liberties Union (ACLU), 350.org, Color of Change, and the Indigenous Environmental Network—sent Monday cites recent incidents including: the deactivation of Korryn Gaines’ account, the removal of iconic photographs, reports of suppression of Indigenous resistance , continued reports of Black activists’ content being removed, and the disabling of Palestinian journalists’ accounts. \\n“These instances of censorship clearly point to the gaps in Facebook’s automation and content guidelines,” said Nicole Carty of the consumer watchdog SumOfUs, which coordinated the letter. “In order to mitigate these issues, Facebook must recognize these broader policy failures as human rights and free speech issues. From Black Lives Matter in the United States to journalists in Palestine, Facebook’s lack of transparency has resulted in reports of censorship on almost a weekly basis, which proves that this is not an individualized ‘glitch’ but a broader policy problem.” \\nAdvertisement Square, Site wide \\nAt the same time, the letter notes that with the launch of the live-streaming video function Facebook Live, the site “is taking on an increasingly central role in controlling media that circulates through the public sphere. News is not just getting shared on Facebook: it’s getting broken there.” \\nIn turn, the letter reads, \\nwe believe that taking urgent action to increase transparency and protect users is the first step to reaching our shared vision of the world. It is important not only for the integrity of its platform and the trust of its community of users, but also for the future of our media. Because the stories that don’t get shared are as important as the ones that do. \\n“Social media platforms are increasingly becoming the avenues for free speech, which makes ending censorship by companies like Facebook all the more critical,” added Chinyere’ Tutashinda, national organizer at the Center for Media Justice. “We are calling on Facebook to create policies that protect the most marginalized voices on their platforms: communities of color and low-income communities in the U.S. and across the globe.” \\nSpecifically, the letter calls on Facebook to: Make policies about how Facebook makes decisions to censor content clear and accessible to the public: whether those requests are from third-party agencies or through its algorithm—especially with respect to live broadcasting and journalistic content. Create a public appeals platform where users can appeal content censored by Facebook. Undergo an external audit on the equity and human rights outcomes of your Facebook Live and content censorship and data sharing policies. Refuse to disclose customer content and data to third-party agencies unless required to by law. \\nNotably, the letter came on the same day that scores of Facebook users attempted to use the site’s “check-in” feature as a way to help shield Dakota Access Pipeline opponents by confusing law enforcement. While the fact-checking website Snopes largely debunked the strategy , it also quoted representatives from Sacred Stone Camp as saying that they “support the tactic, and think it is a great way to express solidarity.” TAGS:'"}, "time": 1742562863.1487262}