{"duration": 0.13237619400024414, "input_args": {"text": "'On the way to show an apartment in Windsor Terrace, Brooklyn, the real estate agent turned to the prospective renters and said something unnecessary. “Before we get here, I should tell you that the guy who lived here before committed suicide. ” The renters, Julia Dahl and her boyfriend, Joel Bukiewicz, shared an uneasy glance but decided to view the rental anyway. Besides, in 2007, it was a steal: a   in a prewar   for $1, 250 on the southern lip of Prospect Park. Despite the broker’s disclosure, and the portentousness of their   date, the couple signed the lease and settled in that Halloween. A short while later, neighbors introduced themselves, made the couple feel welcome, and talked about the former tenant, who had killed himself in the apartment a few weeks before it came on the market. “They did a good job cleaning it up,” one neighbor told the couple. Ms. Dahl, 39, who writes crime fiction, and her   Mr. Bukiewicz, lived in the cozy apartment for four years. Their situation was unusual, not because someone had died in the space, but because their broker had alerted them to it. Ms. Dahl and her husband might never have discovered the apartment’s grisly history had someone not told them about it. Throughout the city and state, buildings are often more than a century old in   homes especially, someone likely has died there. But in recent years, brokers say, an apartment touched by death is less of a deterrent, as the real estate market has become more competitive and good deals ever more elusive. People are also less likely to be fazed by spooky things, thanks to an overall cultural shift toward death acceptance  —   as evidenced by the opening of museums dedicated to mortality, exhibits for morbid curiosities and even the advent of living funerals. And prospective buyers and renters often come to the negotiating table already knowing everything about an apartment or home, brokers say, having conducted their own internet searches and reviewed public records online. Brokers call these homes stigmatized properties, but in New York State, disclosure is required only for material defects: leaky pipes, termite damage, lead paint, bedbug infestations. They do not have to reveal if a property was the site of a death  —   suicide or homicide  —   or of a crime. Of course, death has not always been a cause for real estate stigma. In fact, dying did not move out of family homes and into hospitals until the early 20th century. But today, “We’re removed from death,” said Karen S. Sonn, a real estate lawyer and founder of Sonn  Associates in Manhattan. Some people, however, might be more averse to the idea of living with the dead because of religious or cultural beliefs, Ms. Sonn said. But she added that clients are coming to her more prepared because, in the age of information, an apartment’s history is easy to discover. “I have young, smart people who ask me everything,” she said. “They Google names. Everything’s available. When they come to me, they’re so   they know what they’re buying. ” Are utilities included? Is there a lien on the property? Are pets allowed? These are the questions commonly asked by renters and buyers and expected by brokers. But some questions  —   Has anyone died in this apartment? Were felonious crimes committed here?  —   often go unasked, so unanswered. Disclosing a property’s macabre past may seem like the ethical thing to do, and buyers or renters are likely to discover it on their own anyway, but some argue that when marketing a home, brokers should keep certain things secret. “I think most Realtors actually think they have to disclose,” said Neil B. Garfinkel, a brokerage counsel for the Real Estate Board of New York who fields questions for its legal help line. “They can’t, they’re not supposed to at all,” he said. “The point is to make sure that the property is not stigmatized. It’s to protect the property. ” Randall Bell, an economist and an author of “Real Estate Damages” who has consulted on the appraisals of notorious properties, like the homes of O. J. Simpson and JonBenet Ramsey, said that a stigma can erase up to 25 percent of the value. He added, though, that as time passes and memories fade, the value eventually returns. “My advice for brokers is to tell the truth,” said Mr. Bell. “I generally advise to get the properties occupied. Don’t let them sit empty. ” Media reports  —   especially on a story covered nationally  —   can draw unwanted attention to a property. And simple pedestrian traffic generated by curiosity seekers can cut into home value. If a residence becomes a public showcase  —   like the house on Long Island that inspired the “The Amityville Horror” book and movies chronicling murders that happened there in 1974  —   privacy concerns might drive away potential owners and cause the property value to plummet. “The gawking question impacts both   and   cases, but it is more pronounced in the   situations,” Mr. Bell said. His advice: “Just let it happen. Just let people get it out of their systems. ” In other cases, the buildings are destroyed: The house where Adam Lanza murdered his mother before killing 20 children and six adults at a school in Newtown, Conn. was acquired by the town and razed. The Hartford Courant quoted a resident as saying the home had become “a constant reminder of the evil that resided there. ” Taking an apartment regardless of its history is a notable shift from renters’ mentality before the recession and the burst housing bubble in 2008, according to brokers. New York’s latest scramble for affordable housing has softened expectations, even as rents have increased. “When the market is very tight, these sort of things get overlooked,” said Jonathan J. Miller, the president of the real estate appraisal firm Miller Samuel. Most renters or buyers won’t think twice if they stumble onto a     deal besides, death and whatever stigma surrounds an apartment wane with time. “In a couple of years, it goes away, in terms of the stigma,” Mr. Miller said. “Especially if it’s an apartment that hasn’t been touched in 30, 40 years they’re going to gut it no matter what. ” Emma Grady, a writer living in Brooklyn, moved to New York in November 2008 after college. After living in a “  room” in Chelsea, she decided to move into what seemed like a typical Bank Street apartment in Greenwich Village. “I didn’t know much about the neighborhood or its reputation,” Ms. Grady said. “I was completely new to New York. ” The rental she moved into was 63 Bank Street, Apartment 2C, where the   musician John Ritchie, also known as Sid Vicious, had overdosed. Ms. Grady later learned of the apartment’s history when a neighbor shared the building’s lore with her. She didn’t think much of it at the time. For one, she did not know who Sid Vicious was. Second, she knew that it had happened more than 20 years before, and other people had lived in that space without issue. “The apartment was renovated, so it didn’t feel like it was the same apartment it had been years before,” Ms. Grady said. During the six months she lived there in her early 20s, Ms. Grady, now 30, changed the room where she slept a couple of times. Each time, she recalled the death and wondered whether she was then sleeping in the place where the performer had died. “But I never felt like the apartment was haunted,” she said. “There are plenty of people living in New York apartments that someone passed away in, they just don’t know it. ” She added, “I also think you have to accept a bit of the unusual on a daily basis to live in New York, so perhaps that’s why it didn’t surprise me. ” Things that go bump in the night and the prospect of hauntings are probably a fundamental part of living in the city, said Nikolai Fedak, the founder of New York YIMBY, a real estate website. “If I was an uninformed person, I’d think it was the spirits talking to me  —   but it’s just the building,” he said. “ ‘Ghosts’ are probably just noise pollution. And history is based on people’s collective misconception. “Just because there’s history,” Mr. Fedak said, “doesn’t mean it’s haunted. ” Though Ms. Dahl and her husband have since moved to the Gowanus neighborhood of Brooklyn and started a family, she credits her success as a writer to that Windsor Terrace apartment tainted by suicide. Had it not been for that, she never would have delved into Hasidism, which the former tenant had practiced, and which continues to figure prominently in her novels. Ms. Dahl felt her apartment in Windsor Terrace would have been a surefire place to meet a ghost, if ghosts were real. She did relish the hunt for spirits whenever the opportunity presented itself: when the cat was acting weird, or she was alone in a darkened apartment and found herself standing in front of her bathroom mirror. But nothing happened, and life moved on. “I never saw anything abnormal at all,” she said. “If he was a ghost, he was a friendly ghost. ”'"}, "time": 1742562333.5029032}