{"duration": 0.03148603439331055, "input_args": {"text": "\"(Before It's News)\\nGod spells out the choice we need to make in Duet 30.\\nby Jacqueline Hawkins\\nAt UNC Greensboro, a young woman told Deeper Still and GAP volunteer Debbie Picarello that she was a Christian who believed God gave her a “choice.” In her mind, God was fine with whatever she wanted to do with her own body, even if it meant destroying her baby’s body.\\nShe was failing the “choice” test, the test of life and death.\\nDebbie pulled out the ultimate life “cheat sheet,” the Bible. This is pretty good: In the most important test we will ever take, the test of life and death, God gave us the answers! Debbie showed her the answers she needed to know:\\n“For you created my inmost being; you knit me together in my mother’s womb. I praise you because I am fearfully and wonderfully made; your works are wonderful.” (Psalm 139:13,14)\\nIn other words, God made us. He put us together Himself.\\n“For you are bought with a great price. Glorify and bear God in your body.” (1 Cor 6:20.)\\nOur bodies are not our own; they belong to God. This is especially true for Christians purchased by the Blood of the Lamb.\\n“Consider that I have set before thee this day life and good, and on the other hand death and evil … I call heaven and earth to witness this day, that I have set before you life and death, blessing and cursing. Choose therefore life, that both thou and thy seed may live.” (Duet 30:15;19)\\nThe choice should be clear.\\nThis was not what the young woman wanted to hear. She told Debbie she felt judged. Debbie assured her that she was not judging her, but was giving her the Word of the very God she claimed to worship. Her belief, that she could do whatever she wanted with her own body and the body of her child, was wrong. Her assertions directly contradicted the Bible.\\nIt was indeed her choice to follow the Bible or not. But it was clear how God saw our choices. There are right choices and wrong choices. As followers of Christ, our choices are intended to be conformed to His likeness so that the whole world can know him. Pro-abortion Christians aren’t just dangerous for themselves and their children; they are dangerous for everyone on the planet.\\nGod gives us the answers to the test, so that we can correct our course and pass with flying colors.\\nUnderstanding what Debbie was saying, the young woman shook Debbie’s hand and thanked her for speaking with her.\\nThis is so important. Our most important outreach is not to the pagan world; we are taking truth to confused Christians led astray by complacent church leaders who work harder than Planned Parenthood to cover up the truth. Over and over again, your support is the difference between life and death. When you support CBR , you choose life.\\nJackie Hawkins is a CBR Project Director and regular FAB contributor.\""}, "time": 1742561789.9481707}