{"duration": 0.07905721664428711, "input_args": {"text": "'Victoria’s Secret’s annual “What Is Sexy” social media campaign has the women’s premium lingerie company fending off accusations of racism. [This year’s list of winners include Instagram models who specialize in fashion, fitness, and beauty. Other winners include celebrities like Taylor Swift, actress Vanessa Hudgens, and This is Us star Mandy Moore.   Give your favorite style star some ❤️! Go to Twitter  VOTE her to the top of our annual #WhatIsSexy List by 11:59pm ET on  ! Link in profile. A post shared by Victoria’s Secret (@victoriassecret) on Apr 7, 2017 at 11:43am PDT,   Thank your fave fitness stars for all the inspo —  go to Twitter  VOTE them to the top of our annual #WhatIsSexy List by 11:59pm ET on  ! Link in profile. A post shared by Victoria’s Secret (@victoriassecret) on Apr 7, 2017 at 12:26pm PDT,   Give props to your   beauty expert —  go to Twitter  VOTE her to the top of our annual #WhatIsSexy List by 11:59pm ET on  ! Link in profile. A post shared by Victoria’s Secret (@victoriassecret) on Apr 7, 2017 at 10:35am PDT,  The   brand revealed its honorees, many of whom were white and skinny. And it didn’t take long for social media users to accuse Victoria’s Secret’s of failing to include women of other ethnicities in its campaign. “Young, white and thin is what’s sexy according to VS. Where’s the racial diversity? Where’s the size diversity  …    . ” one Twitter user wrote. Young, white and thin is what’s sexy according to VS. Where’s the racial diversity? Where’s the size diversity  …    . https:  .   —   Jennifer Atilémilé (@jennatilemile) April 16, 2017,  The   brand was bombarded with similar scorn online. Victoria’s Secret decides to tell you #WhatIsSexy. Note: your odds of getting on this list go up if you’re young, thin, and white. pic. twitter.   —   Mike Sington (@MikeSington) April 15, 2017,  #whatissexy? Very white, thin, mostly blonde, and between 20 and 30ish according to this v. specific @VictoriasSecret list. pic. twitter.   —   Cori M. (@corimyles) April 14, 2017,  It’s not the first time Victoria Secret has been dragged online over issues of race and diversity. Last year, the Huffington Post called the womenswear brand’s What is Sexy” list “an arbitrary roundup of the ‘sexiest’ lips, legs, hair and eyeballs among women in the fashion and entertainment industries. ” “But telling us what a ‘sexy’ pair of lips looks like? Or worse, “sexy hair,” can only serve to make women without that lipstick or without a full head of long hair feel less adequate and less worthy of being called sexy in their own right,” HuffPo’s Suzy Strutner wrote. In December, the intimate apparel retailer was accused of cultural appropriation and of designing “racist lingerie by Cosmopolitan editor Helin Jung. “[D]on’t let yourself be hoodwinked by Victoria’s Secret’s brazen attempt to relabel what is clearly cultural appropriation by turning it into a celebration of ‘culture,’” Jung wrote in a   article about the brand’s use of different cultural aesthetics during its runway shows. “The brand and its creative leads shamelessly   imagery, breaking apart aesthetic references from wherever they wanted and stitching them back together again. They’re telling us it’s worldliness. It’s not it’s a hack job. ”   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742564197.5625813}