{"duration": 0.11119270324707031, "input_args": {"text": "'In perhaps the clearest signal yet that the era of the solo celebrity architect is behind us, three friends who hung out a shingle in their Catalonian hometown, Olot, Spain, 30 years ago and never left or parted ways have won their profession’s highest honor: the Pritzker Prize. Rafael Aranda, Carme Pigem and Ramon Vilalta on Wednesday became the first team of three to be selected for the prize, which will be awarded in Tokyo on May 20. “Their intensely collaborative way of working together, where the creative process, commitment to vision and all responsibilities are shared equally, led to the selection of the three individuals for this year’s award,” Thomas J. Pritzker, the chairman of Hyatt Foundation, which sponsors the award, said in a statement, adding, “Mr. Aranda, Ms. Pigem and Mr. Vilalta have had an impact on the discipline far beyond their immediate area. ” Ms. Pigem, who spoke for the group because her English is strongest, said in a telephone interview that the collaboration was integral to the practice. “For us, it’s very important to work together  —   one of the most important things we talk about is shared creativity,” she said. “It’s not a question of one person it’s all three. Sometimes we say six hands, one voice. ” The architects are not widely known they have not designed major public projects or worked much outside Spain. But they came to the attention of the Pritzker jury because their works, if modest, “admirably and poetically fulfill the traditional requirements of architecture for physical and spatial beauty along with function and craftsmanship,” the citation said. “But what sets them apart is their approach that creates buildings and places that are both local and universal at the same time. ” The team’s buildings include the Soulages Museum, in Rodez, France, featuring boldly modern metallic architecture (in collaboration with G. Trégouët, 2014) and a   complex in Barcelona, Spain (Sant Antoni  —   Joan Oliver, 2007) that incorporates a library, a center for the elderly and a children’s playground. The design features ample views of interior gardens and sky, and metal corridors that nod to the site’s industrial past as a candy factory. They also continue to work on projects in their Catalonian home turf, like the   athletics track, completed in 2000, and the covered   Les Cols restaurant in 2011, with plastic walls of trees, between which real trees grow. In 1988, one year after completing their studies in architecture at the School of Architecture in Vallès, the three won first prize in a competition sponsored by the Spanish Ministry of Public Works and Urbanism, to design a lighthouse in Punta Aldea. “We said, O. K.,” Ms. Pigem said. “Maybe we can do something good in architecture. ” They founded their firm that year, calling it RCR Arquitectes, after the initials of their first names. For the lighthouse, they had pondered “the essence of the typology,” according to their Pritzker biography. The team members have brought a   sensibility to their built projects, as well as their work as consultant architects to the natural park in the volcanic zone of La Garrotxa. “For us, what is very, very important is the relationship to the site,” Ms. Pigem said. “If the site is natural, or if the site is a building, or if the site is a city. What is important is to study the strong and unique relationship between the existing and the new. ” In 2007, they converted an    foundry into their office, Barberí Laboratory. They are the second Pritzker laureates to come from Spain Rafael Moneo received the award in 1996. Ms. Pigem, who is married to Mr. Vilalta, said she and her colleagues “feel very excited and very joyful. ” The Pritzker jury said it was important to reward a local firm in an increasingly globalized world. “More and more people fear that because of this international influence,” the citation said, “we will lose our local values, our local art and our local customs. ” “They help us to see, in a most beautiful and poetic way, that the answer to the question is not ‘ ’ and that we can, at least in architecture, aspire to have both,” it continued, “our roots firmly in place and our arms outstretched to the rest of the world. ”'"}, "time": 1742562792.5273066}