{"duration": 0.11100244522094727, "input_args": {"text": "'How they could steal the election from Trump even if he is announced the winner next Tuesday October 31, 2016 at 2:13 am \\nHow they could steal the election from Trump even if he is announced the winner next Tuesday \\nBy Dr. Patrick Slattery — There has been a great deal of talk recently about the “rigging” of elections. Trump talks about it, and then the media accuses him of being a threat to democracy by refusing to accept the will of the voters. Nobody asks Hillary if she will accept the will of the voters… \\nOf course, we know that our electoral system is unfair, biased, and even rigged at a variety of levels. Without going into detail, the media, which plays an absolutely crucial role in staging our elections, has abandoned even the pretense of neutrality. Ballot access is unfair. Campaign finance is corrupt. Electronic voting machines are vulnerable. Voting by foreigners and dead people exists, as does multiple voting by individuals. \\nBut one massive threat has so far gone completely unmentioned: the vulnerability of the electoral college to post-election shenanigans. \\nWhat people are not aware of is that, under the Constitution, the president is not elected on November 8. The Tuesday after the first Monday in November is designated for Congressional elections. It just so happens that over the years all the states decided to have their electors to the Electoral College selected by the voters on that day. In the early days of the Republic, it was actually more common for state legislatures to select the electors, and the Constitution allows the state legislatures to determine how the electors are selected. \\nIt is actually the Electoral College that elects the president, and that happens on the Monday after the second Wednesday in December, which this year will be December 19. On this day, the electors will meet in their respective state capitals to cast their ballots, which will then be sent to Washington to be opened by Vice President Biden before a joint session of Congress on January 6 of next year. Some of you may remember the scene from Michael Moore’s Fahrenheit 911 showing Vice President Gore reading votes that elected President Bush, ironically denying the objections raised by some Congressmen to Florida’s electoral votes, which Bush won over Gore amidst the greatest of controversy. \\nSo if this system is enshrined in the Constitution, what could possibly go wrong? Plenty. \\nUnless Hillary goes into complete meltdown over the next week, a Trump victory on November 8 will likely be a narrow one in terms of the electoral college map. One very plausible scenario has Trump losing Pennsylvania but winning the rest of the main battleground states plus one of Maine’s congressional districts. (Maine, along with Nebraska, allow for electors to be elected on a congressional district basis rather than winner-take-all.) Under this scenario, 270 Republican electors would be elected, a bare majority, while 268 Democrat electors would be elected. \\nNotice I did not say “Trump would get 270 electoral votes,” which is what we are used to hearing. The fact is that the electoral votes are not cast until December 19, and there is no guarantee that every single one of the 270 Republican electors would actually vote for Trump. Do you remember a few months ago how alarmed we were at the prospect of supposed Trump delegates to the Republican National Convention deserting Trump and voting for Cruz? It was only that Trump piled up such large victories in the final primaries that he had big enough majority of delegates to cause the Never Trump people in the Republican establishment to give up on rigging the convention. \\nSo who are these electors? Just as the method of electing the electors is left up to the states, the method for nominating the candidates for the electoral college is also left up to the states. Some states allow the presidential candidates to nominate their own slate of electors. Presumably, these people could be counted on to be loyal. But in other states the party’s slate of electors is chosen at state party conventions and even electoral district conventions. \\nAs a young man I attended one such convention and had my name put into nomination as a Democratic elector. Myself and the other three contenders then made short speeches to the convention. The other three talked about being precinct captains or hard-working party volunteers. Then I gave a speech calling for the direct election of the president and the abolition of the electoral college. I got a huge round of applause. I would have easily won, but as a matter of principle I withdrew my name from nomination. \\nThe point of the story is that most of the electors are unknown to the public, typically cogs in the party apparatus, and not even necessarily high-level ones, and some of them may even be smooth-talking slicksters like me, unknown to the party itself. \\nSo how likely is it that one or more Republican electors would betray Trump? Such a person is known as a “faithless elector,” and while faithless electors have never ultimately altered the outcome of a presidential election, there have been 179 faithless electors in our history. In fact, faithless electors caused the Congress to have to decide the 1836 election for Vice President. \\nIt is true that about half the states have laws punishing faithless voters, but in all but a few states the votes of faithless electors would still count. \\nThe nightmare situation would be after a close election the Hillary people, or the Never Trump people, could bribe or pressure Republican electors, some of whom may not like Trump anyway, not to vote for Trump. They could vote for Hillary, they could vote for Pence, they could vote for anyone else, or they could even abstain from voting. \\nThen what happens? If enough Republican electors are cajoled into voting for Hillary (in the above 270-268 scenario, it would only require two), then Hillary gets inaugurated on January 20. If it’s a tie, then the House of Representatives breaks the tie. Obviously, there have been Republican members of the House that say they won’t vote for Trump for president in November, so there is no reason to assume they would vote for him in January. \\nHowever, not only are Republicans likely to retain a significant majority in the House, but the voting for president by the House is not one vote for each representative, but one vote per state. This means that California, which currently has 39 Democratic representatives, would get only one vote, while Alaska’s single representative, who is a Republican, would also get one vote. This heavily favors the Republicans and means that if Hillary cannot flip enough Republican electors to herself to win a majority of the electoral votes, she is finished. There is no real prospect of the House of Representative electing Hillary. \\nBut what if enough Republican electors vote for other people, Paul Ryan for example, so that no candidate gets a majority? Then the House of Representatives gets to choose between the top three vote finishers in the electoral college vote. You could get a coalition between Democrats and Republican defectors that would deny Trump the presidency and give it to someone like Ryan. (The same applies in the case that Mormon ex-CIA operative and never-Trump independent presidential candidate Evan McMullen wins Utah , which some polls predict is possible.) \\nWhile none of the above scenarios may come to pass, we do have to face the fact that the establishment has so far stopped at nothing to try to defeat Trump, and so it is not too far fetched to think that they would try these tactics, especially if the November 8 voting produces a very narrow victory for Trump. The media could start inventing more reasons why Trump is uniquely unfit to become president and claim that the Constitution allows for these scenarios (which is the case), and that this in fact was why the framers of the Constitution created the Electoral College (which is not the case). \\nIt would then be incumbent on us to make it clear to the members of the Electoral College and the Congress that any violation of the people’s will would not be tolerated.'"}, "time": 1742563013.5975776}