{"duration": 0.0689389705657959, "input_args": {"text": "'Pinterest \\nAt a prestigious Boston school, they have a pretty strict dress code. No gang-related colors, no cut-offs, nothing too offensive or revealing. \\nWomen at Boston Latin School can’t wear skirts whose hemlines are more than four inches above the knee and their bra straps can’t be the “spaghetti” style, where they’re so thin they’re barely there. This is a middle and high school folks … not a college for adults. \\nIt’s a way of showing a little decorum – a little respect for yourself and for the school. \\nAnd it promotes rape culture . \\nBecause for radical feminists, telling them not to dress provocatively is telling them that men are sexist pigs who simply can’t resist the wiles of a woman. \\nThey call it “victim-blaming” and while there’s a point to it – you can’t blame a woman for being assault if she’s jogging alone in a park, but certainly you can bring up a woman’s attire if it is specifically designed to attract attention from the opposite sex. \\nLet’s be honest: Women sometimes dress for attention. They want guys to look at them. \\nBut under leftist-feminist theory, they shouldn’t. \\nSo, as HeatStreet reports, there’s a Change.org petition that claims this dress code sends the message that “we live in a patriarchal society where men can decide whether a female’s clothing is appropriate or inappropriate.” \\nThe dress code, they claim, creates a “a sense of shame towards girls [sic] bodies” and reinforces the notion that “yes, it is our fault when girls get raped because they should have covered up and avoided the situation by dressing in a way that does not attract another person.” \\nI’m not sure what these women want. Do they want to be able to attend school wearing micro-miniskirts and just bras? Pasties? Maybe we shouldn’t have a dress code at all? \\nIn reaction to the idiotic controversy, Boston Latin School changed their policy, allowing women to wear “leggings” as long as they’re not “see-through.” The rest of the policy will stay in place until Nov. 1 – then it will probably be changed again. \\nHere’s how their “petition” reads: By allowing the school to dress code us, we are telling the school several things: Yes, we still live in a patriarchal society where men can decide whether a female’s clothing is appropriate or inappropriate. Yes, a body should be covered in order to be attractive. Establishing a sense of shame towards girls bodies is okay and perfectly acceptable. Yes, a girl’s body is a sinful temptation that needs to be covered up at all costs for others to focus on their education. Yes, a female’s body is more tempting and sexual than a male’s body. Yes, it is our fault when girls get raped because they should have covered up and avoided the situation by dressing in a way that does not attract another person. Are these statements correct to you? Is it okay to assign a dress code in this manner? If the answer is NO! then sign this petition to tell Mr. Contompasis to reconsider his dress code restrictions. \\nWhat a bunch of nonsense. These are CHILDREN. They do not get a say in establishing a school’s dress code. PERIOD.'"}, "time": 1742564501.8318396}