{"duration": 0.09058594703674316, "input_args": {"text": "'“The public’s voice will be heard,” Poland’s president declared, as he vowed a referendum on the European Union’s (EU) migrant quota amidst growing pressure from Brussels. [Describing the question of whether Poland should be forced to accept a quota of migrants from the third world as “of vital importance” for its future security, Andrzej Duda said the referendum could be held during parliamentary elections in 2019.  “That would allow the new government to hear the clear voice of the nation on the issue,” said the president. The conservative Law and Justice (PiS) government’s position on the quota system is “clear and unambiguous” Duda said. He said maintaining the party “does not agree with the [plan] and asserted that “Poland does not consent to the forced relocation of refugees on our territory”. Holding a referendum will also enable the public’s voice to be heard over the voices of international organisations, Duda asserted. “If Brussels continues to raise [the issue of migration] attempting to exert pressure and force on the Polish authorities, then public opinion will be extremely important,” Duda promised. Poland’s latest display of opposition to the redistribution plan comes as the Czech Republic announced its withdrawal from the scheme, which has been fiercely contested in Central and Eastern Europe, with Hungary and Slovakia challenging the plans in court. In an interview with Czech tabloid Blesk published Tuesday, EU president   Juncker demanded all nations in Europe shoulder “solidarity and responsibility” when it comes to migration. Brussels was left humiliated last year when Hungarians were asked what they thought of EU plans to force on their nation migrants from the third world, as 95 per cent said they rejected the scheme. Earlier this month, Breitbart London reported that senior Polish MEP Ryszard Czarnecki announced the “only proven method” to avoid Islamist terror attacks is not to import Muslim migrants. “When it comes to reducing the chances of Poland being hit by [Islamist] terror attacks, the only proven method is to not allow in Muslim migrants,” the MEP told local radio after the London Bridge terror attack, which killed eight and injured at least 48 others.'"}, "time": 1742561628.027347}