{"duration": 0.0736839771270752, "input_args": {"text": "'FULING, China  —     mountains rise high in this sleepy Yangtze River district, best known for its crunchy pickled mustard tubers. But one of these mountains is not like the others. On the peak of Jinzi Mountain in Fuling, a single chimney stands sentinel over the adjacent Wu River. The chimney has been idle since it was built decades ago. Only in recent years has the public learned why. Fifteen years ago, the local government announced that inside the   mountain lay the remnants of what was once one of China’s most ambitious military infrastructure projects: the   816 nuclear plant. Initiated in the 1960s during the height of tensions between China and the Soviet Union, the 816 project was China’s first attempt to build a nuclear reactor that could produce   plutonium without Soviet involvement. But there was one catch. To reduce the possibility of an attack, Chinese officials and engineers made the unusual decision to place the reactor underground, complicating an already challenging engineering process. Over the next 18 years, more than 60, 000 workers participated in the risky project, and some died in the process. The result was what is said to be the world’s largest artificial cave, able to withstand the force of thousands of tons of explosives as well as a magnitude 8 earthquake. But when China began a sweeping civilian defense conversion of many of its military projects in the early 1980s, work on the nearly finished plant was abruptly called to a halt. For 26 years, it functioned partly as a chemical fertilizer factory before being revived for  tourism in 2010  —   an improbable twist of fate for this quirk of Cold War history. Still, for many former workers, the 816 project remains a source of bitter regret. Even as China charges ahead with an ambitious  —   if controversial  —   plan to build nuclear plants around the country and expand the use of nuclear energy,   military nuclear projects like 816 have all but been forgotten. “Back then, the project took so much from these young men, including our livelihoods,” said Chen Huaiwen, 69, a former soldier who worked on the excavation of the mountain from 1969 to 1974. “We need to make this clear to the public. Otherwise it will have been a huge waste of our efforts and manpower. ” To address these concerns, the 816 site recently underwent a year of renovations. Since it reopened in September, visitors  —   including, for the first time, foreigners  —   can now see about   of the cave, which contains nearly 13 miles of tunnel roads. On a recent afternoon, a group of tourists, led by an energetic tour guide who came dressed in military fatigues and combat boots, clambered onto a golf cart at the roadside entrance of one of the tunnels. From there, the cart burrowed straight into the belly of Jinzi Mountain, cool air whooshing by. At the tour’s first stop, a cavernous hall that once held the plant’s   facilities, ominous doomsday music blared while neon lights bathed the   room in blue, red and then pink. It was a scene that was perhaps more befitting of an underground rave than a Communist history education tour, apart from a display that showed, among other things, an image of a mushroom cloud from China’s first nuclear test at Lop Nur in 1964. Speaking into a microphone, Qi Hong, the tour guide, explained: “This cave represents not only the efforts of the 816 workers but also an important part of history in China’s national defense and nuclear development. ” Standing around Ms. Qi were 30 or so mostly older Chinese. Throughout the   tour, Ms. Qi led the group through a maze of empty reactor halls, exhibition rooms and dim staircases, stopping frequently to lecture so the elderly visitors could catch their breath. Although most in the group had not heard of the project until recently, they were old enough to recall the historical circumstances that led the government to single out this picturesque place in southwestern China  —   also the backdrop of the writer Peter Hessler’s   memoir “River Town”  —   as the site of a massive nuclear complex. It began, Ms. Qi explained, with the Third Front, the colossal defense program started by China in 1964 to create an industrial base in the country’s interior. China already had a nuclear reactor  —   the   404 project in the northwestern province of Gansu. But as concerns grew about that reactor’s vulnerability to attack, in 1966 Premier Zhou Enlai personally approved the plan to build a replica of the 404 project underground in Fuling. Soon after, scientists, engineers, soldiers and other supporting staff came from all around the country to this remote area  —   then reachable only by boat  —   to work on the 816 project. They represented some of the nation’s top talent, having studied at China’s leading universities, as well as in the Soviet Union and Japan. “The plant reflects the greatness of the Chinese people,” said Xia Renhui, 66, a retiree from the northeastern city of Shenyang who was touring the plant. “And now, China is even stronger. Obama’s Army is not good enough to fight us!” From the beginning, it was a   project. Locals and even many of the soldiers working at the site were unaware of the project’s true purpose. The complex included schools, a market and a hospital so the workers could live in total isolation. The nearby town of Baitao disappeared from the map. “All we knew was the code name 816,” said Li Tingyong, a local resident and later head of the Fuling tourism bureau, in a 2010 television program about the 816 plant. “But we had no idea what it was a code name for. It was very mysterious. ” Life was especially hard for the more than 20, 000 young soldiers. Many had enlisted thinking they were heading to Beijing, only to find that they had been assigned to work at the 816 project site. For a small monthly salary of around 6 renminbi, or $2. 44 at the time, the soldiers  —   whose average age was 21  —   were tasked with excavating the hard rock with only small drills, dynamite and shovels. It was dangerous work, and the pressure to finish the project was immense. Soldiers worked around the clock, urged on by the slogan “Fight the clock against imperialism, revisionism and counterrevolutionaries!” Many were injured or died. Today official figures put the number of fatalities at around 100. “But I don’t believe it,” said Ms. Qi, in a rare departure from her script, suggesting the real number was higher. “The environment was too harsh. ” By the time the project was called off in 1984, 85 percent of the construction had been finished. Over all, total investment in the 816 project is estimated at more than 746 million renminbi, or about $359 million at the time. But sunk costs aside, some experts say the decision to abandon the 816 project was ultimately a sound one. “The only good thing that happened with the project was that they didn’t finish it,” said Hui Zhang, a senior research associate at Harvard University’s Project on Managing the Atom. “In terms of the overall development of China’s nuclear program, the 816 project really did not contribute anything. ” Still, for many of the people like Mr. Chen, who gave years of their lives to the 816 project, a sense of loss and resentment lingers. “Ultimately we worked on the project because we thought we were working for the nation,” Mr. Chen said in a telephone interview as he traveled home to Shanxi Province after visiting the reopened plant. “If we knew that in the end it would be made into a tourist site, we never would have participated. ”'"}, "time": 1742628501.362034}