{"duration": 0.2555968761444092, "input_args": {"text": "'Welcome to Breitbart News’s livewire of the 89th annual Academy Awards. [The Oscars kick off at 5:30 p. m. PT, but Hollywood’s biggest stars have already begun arriving on the red carpet. Jimmy Kimmel hosts this year’s ceremony live from the Dolby Theater in Hollywood.  The storylines to watch:  —   How many wins can the musical La La Land rack up out of its record 14 total nominations? Director Damien Chazelle and leads Ryan Gosling and Emma Stone are all hoping for big nights in their respective categories, though Gosling faces stiff competition from Denzel Washington (Fences) and Casey Affleck (Manchester by the Sea).  —   Which stars will use the Oscars stage to launch   Trump tirades? Meryl Streep  —   up for a record 20th Oscar nom for Florence Foster Jenkins  —   is set as a presenter, so there is a decent possibility of a Golden   encore, but it could really come from all angles tonight. Look out for Kimmel to zing Trump in his opening monologue.  —   Mel Gibson’s Hacksaw Ridge is up for six awards, but don’t expect him to win Best Director. Chazelle is the overwhelming favorite in the category, though Kenneth Lonergan (Manchester by the Sea) or Barry Jenkins (Moonlight) could pull it out. Follow along with Breitbart News as the Oscars get underway in Los Angeles. Latest updates at the top. All times Pacific.   9:25 P. M.  —   That’s it for the livewire. Stay tuned for some   coverage, including what just happened with the Best Picture announcement, which was probably the most epic gaffe in Oscars history. So long for now,  . N.  . H. 9:13 P. M.  —   Good god. This has got to be the most surreal ending to an Oscars broadcast ever. Moonlight has won Best Picture. Warren Beatty and Faye Dunaway read the wrong title off the card, announcing La La Land as Best Picture. Kimmel blames Steve Harvey. No one in the audience can quite believe it. This is an epic  . More coming shortly. New rule: After that astonishing #Oscars gaffe, no one in Hollywood can make fun of @realDonaldTrump for anything over the next eight years.  —   Joel B. Pollak (@joelpollak) February 27, 2017,  9:03 P. M.  —   Warren Beatty and Faye Dunaway appear together on stage to present Best Picture. Awesome. 9:00 P. M.  —   One more big one to go. With 11. 9 seconds left in the fourth, Clippers: 113, Hornets: 113. 8:55 P. M.  —   Emma Stone wins her first Oscar, Best Actress for La La Land. An emotional Stone gives a heartfelt   to the other actresses in the category and thanks her family and the filmmakers. 8:48 P. M.  —   Casey Affleck wins Best Actor for Manchester by the Sea. Wow. I thought Denzel had this one on lock. Looks like Affleck got his   out of the way last night, though, because this acceptance speech is short and sweet. “I wish I had something bigger and more meaningful to say. ” We don’t, so thanks for keeping it short. 8:43 P. M.  —   At 32, Damien Chazelle becomes the youngest director ever to win the Best Director prize, for La La Land. 8:34 P. M.  —   Barry Jenkins and Tarrell Alvin McCraney win Best Adapted Screenplay for Moonlight. Both men wear ACLU ribbons, and get slightly political with their speeches. Jenkins vows to work over the next four years to inspire those who feel they’re not represented in films, while McCraney dedicates the award to boys, girls and “  conforming” young people. Barry Jenkins: ”For the next 4 years it will not be you alone. We will not forget you.” #Oscars pic. twitter.   —   Hollywood Reporter (@THR) February 27, 2017,  8:31 P. M.  —   Kenneth Lonergan wins Best Original Screenplay for Manchester by the Sea. Some observers thought this one was a lock for La La Land (Chazelle) or even Hell or High Water (Taylor Sheridan) so this is a big win for Lonergan. 8:28 P. M.  —   Ok, this is great. Kimmel is participating in the celebrity “inspiration” videos, talking about how his nemesis Matt Damon has inspired him. The movie that most inspired him is Damon’s We Bought a Zoo. The Oscars announcer introduces “Ben Affleck and Guest,” as Affleck and Damon take the stage. The music guy cuts off Damon every time he tries to speak. The camera pans back and it’s Kimmel directing the orchestra. Probably the funniest bit of the night. 8:26 P. M.  —   With 8:44 to go in the fourth, Charlotte has taken the lead. Clippers: 89, Hornets: 90. 8:20 P. M.  —   Sara Bareilles performs along with the “In Memoriam” segment. 8:18 P. M.  —   Justin Hurwitz is back onstage along with Benj Pasek and Justin Paul to accept the award for Best Original Song, for “City of Stars” from La La Land. 8:15 P. M.  —   Justin Hurwitz wins Best Original Score for La La Land. No surprises there. 8:04 P. M.  —   John Legend performs “City of Stars” and “Audition (The Fools Who Dream)” from La La Land. 8:00 P. M.  —   Linus Sandgren wins Best Cinematography for La La Land. Shouts out Damien Chazelle, who he calls a “poetic genius. ” 7:56 P. M.  —    Javier Bardem talks about how much Meryl Streep has inspired him in a   segment. “Meryl Streep is a goddess,” Bardem says. With 9:08 left in the third, Clippers: 68, Hornets: 53. 7:51 P. M.  —   Another shot at Trump. Kimmel is upset that Trump isn’t tweeting about the Oscars. He tweets Trump directly: “U up?” And then again: “#Merylsayshi. ” Jimmy Kimmel tweets at @realDonaldTrump during the #Oscars: ”Meryl says hi.” pic. twitter.   —   Hollywood Reporter (@THR) February 27, 2017,  7:49 P. M.  —   Sing wins Best Live Action Short Film. Not that Sing, the other Sing. 7:45 P. M.  —   The White Helmets, a film about aid workers in Syria, wins Best Documentary Short Subject. 7:43 P. M.  —   At the half: Clippers: 57, Hornets: 51. 7:34 P. M.  —   Seth Rogen describes how much he loves Back to the Future in a   segment, before stepping onstage with Michael J. Fox to present Achievement in Film Editing. Winner: John Gilbert, for Hacksaw Ridge. 7:30 P. M.  —   The Jungle Book wins Best Visual Effects. A   win. The CGI animals in that movie looked completely real. 7:18 P. M.  —   This is an interesting bit. A group of tourists on a guided tour of Hollywood are ushered into the Oscars, to their astonishment. The celebrities play along, including Denzel Washington and Mahershala Ali, who lets the tourists touch his Oscar. We’ll get video of the segment up shortly. Watch Denzel Washington marry two of Jimmy Kimmel’s surprise guests at the #Oscars. pic. twitter.   —   Hollywood Reporter (@THR) February 27, 2017,  7:14 P. M.  —   David Wasco and Sandy   win Best Production Design for La La Land. 7:11 P. M.  —   Byron Howard, Rich Moore and Clark Spencer win Best Animated Feature Film for Zootopia. In presenting the award, Mexican actor Gael   makes a political statement: “As a   as a migrant worker, as a human being, I’m against any form of wall that wants to separate us. ” 7:09 P. M.  —   Piper wins Best Animated Short Film. 7:05 P. M.  —   Ah, here’s the New York Times‘   Oscars ad, placed right in the middle of the broadcast: 7:02 P. M.  —   Sting performs a portion of his   song “The Empty Chair,” from the film Jim: The James Foley Story. 6:56 P. M.  —   Charlize Theron and Shirley MacLaine appear together to present Best Foreign Language Film. Winner: The Salesman.   Asghar Farhadi, the director of The Salesman, boycotted the Oscars over Trump’s temporary immigration ban. Instead, someone else accepts the award on his behalf, and reads a statement from the director in which he calls Trump’s executive order “inhumane. ” Full statement read on behalf of Asghar Farhadi, winner for Iranian film ”The Salesman.” #Oscars pic. twitter.   —   Washington Examiner (@dcexaminer) February 27, 2017,  “I’m sorry I’m not with you tonight. My access is out of respect for the people of my country and those of six other nations who have been disrespected by the inhumane law that bans entry of immigrants to the U. S.,” the statement read. “Dividing the world into us and our enemies categories creates fear. Filmmakers can turn their cameras to create and capture human qualities. They create empathy between us and others. These wars prevent democracy and human rights in countries which have themselves been victims of aggression. ” “6:55 P. M.  —   Kimmel jokes that Viola Davis was just nominated for an Emmy for her acceptance speech. Introduces a segment in which current stars talk about the stars of the past that inspired them. First up is Charlize Theron talking about Shirley MacLaine. Seems pretty late into the broadcast to be introducing a segment like this. This show is gonna go on for well over 3 hours. Get comfortable. 6:44 P. M.  —    Viola Davis wins her first Oscar, Best Supporting Actress for Fences. Davis was a lock for this category. An emotional Davis says when people ask her what stories she wants to tell, she points out that dead people in graveyards have stories that are never told. “We’re the only profession to celebrate what it means to live a life. ” Video of Davis’ speech: Viola Davis: ”I became an artist because we are the only profession that celebrates what it means to live a life.” #Oscars pic. twitter.   —   Hollywood Reporter (@THR) February 27, 2017,  6:29 P. M.  —   Kevin O’Connell, Andy Wright, Robert MacKenzie and Peter Grace win Best Sound Mixing for Hacksaw Ridge. Go see this movie. #HacksawRidge wins for Best Sound Mixing at the #Oscars! pic. twitter.   —   Entertainment Weekly (@EW) February 27, 2017,  6:28 P. M.  —   Syvain Bellemare wins Best Sound Editing for Arrival. This may be the only award the brainy   movie wins all night. 6:23 P. M.  —   Kimmel roasts Trump again by introducing Academy president Cheryl Boone Isaacs, “a president who believes in both arts and sciences. ” More Trump shade from Kimmel #Oscars pic. twitter.   —   Mashable (@mashable) February 27, 2017,  Boone Isaacs praises the Academy and the nominees’ increasing diversity in a brief speech. 6:15 P. M.  —     Miranda and Auli’i Cravalho perform their   song “How Far I’ll Go,” from the animated film Moana. 6:11 P. M.  —   Ezra Edelman and Caroline Waterlow’s O. J.: Made in America wins Best Documentary Feature. Oscar purists were upset that O. J. was allowed into the category, as it’s essentially an   miniseries. Edelman dedicates his award to “victims of police violence, police brutality,   violence and criminal injustice. ” Oscar winner for ”O. J.: Made in America” dedicates award to victims of police brutality #Oscars pic. twitter.   —   Washington Examiner (@dcexaminer) February 27, 2017,  Kimmel: “O. J. you get an extra slice of bologna on your sandwich tonight. ” 6:09 P. M.  —   Kimmel gets in a shot at Ben Carson by calling Dr. Strange the Secretary of Housing and Urban Development. The political jokes are flying fast and furious tonight. 6:01 P. M.  —   Colleen Atwood wins Best Costume Design for Fantastic Beasts and Where to Find Them. 5:59 P. M.  —   Suicide Squad‘s makeup and hair team wins Best Makeup and Hairstyling. “I’m an immigrant. I come from Italy. This is for the immigrants. ” 5:56 P. M.  —   Kimmel: “If there’s anyone here from CNN, or anyone from the New York or Los Angeles Times is here, please leave the building  …     We don’t like fake news here. ” 5:49 P. M.  —   No surprises with the night’s first award as Mahershala Ali wins Best Supporting Actor for Moonlight. 5:35 P. M.  —   Kimmel is on. “This broadcast is being viewed by millions around the world, and in 225 countries that now hate us. ” Kimmel says the country is divided, and that he’s been told he needs to say something to unite us. Says there’s only one “Braveheart” in the room, and he’s not going to unite us. Cue an awkward pan to Mel Gibson. Wow. Kimmel urges the audience to reach out to one person you have a disagreement with, not as a liberal or conservative, and have a positive conversation with them. That would be a way to “make America great again,” he says. But the moment is   as Kimmel calls President Trump a racist just one minute later. He thanks the president: “Remember last year when we thought the Oscars were racist?” The host also roasts the stars by saying (rightly) that no one came out to see their films. Gives a special   to Meryl Streep, who gets a standing ovation from the Oscars audience: “Nice dress. Is that an Ivanka?” Full video of Kimmel’s monologue: Jimmy Kimmel: ”I want to say thank you to President Trump   …     last year it seemed like the #Oscars were racist.” pic. twitter.   —   Hollywood Reporter (@THR) February 27, 2017,  5:30 P. M.  —   Showtime. Justin Timberlake kicks off the festivities with a performance of his Best Original   “Can’t Stop the Feeling,” from the movie Trolls. 5:21 P. M.  —   Mel Gibson on the red carpet: “As far as I’m concerned, the nomination is the win. ” Gibson says he’s not going to win, but he’s happy to be here. Calls Desmond Doss’s story the “pinnacle of heroism. ” If you haven’t seen Hacksaw Ridge yet, turn off the TV and go see it now. You’re welcome. 5:15 P. M.  —   Chatter says the night will kick off with the presentation of Best Supporting Actor. Barring a major upset, look for Moonlight‘s Mahershala Ali to win. 5:09 P. M.  —   20 minutes to showtime. Most of the stars have already arrived on the red carpet. If you’d like to see all the red carpet “looks,” check them out here, courtesy of the Hollywood Reporter. We’re not gonna post ’em. 5:00 P. M.  —   Meryl Streep has arrived. God herself blowing kisses #Oscars pic. twitter.   —   p. c 🍒 (@90sIover) February 27, 2017,  4:55 P. M.  —   TMZ reports that a stage prop toppled over and crushed a camera during rehearsals this morning. Jimmy Kimmel was reportedly working on a skit at the time but was off stage, and no one was hurt. 4:48 P. M.  —   The stars are arriving on the red carpet the ceremony hasn’t begun yet and we’ve got out first political statement of the night. Loving actress Ruth Negga  —   up for Best Actress  —   is sporting an ACLU ribbon on her dress. There will be undoubtedly be plenty more of these tonight Casey Affleck also rocked one on his lapel during the Independent Spirit Awards last night.  Yeah, looks like   Miranda (Best Original Song nominee) is wearing one too.   Follow Daniel Nussbaum on Twitter: @dznussbaum, Follow Jerome Hudson on Twitter: @JeromeEHudson'"}, "time": 1742564538.016722}