{"duration": 0.03179335594177246, "input_args": {"text": "'A    teacher is claiming that her strict Muslim childhood “repressed” her and contributed to her desires to have sex with students who attended a New Jersey high school, court records show. [Linda Hardan, a teacher at Manchester Regional High School in Haledon, New Jersey, was arrested and charged with sexual contact with at least two male students, one a    and another a   . Her contact began with explicit text messages and graduated to sexual contact, police said.  But Hardan’s defense counsel insists that her strict Muslim upbringing served to repress her, causing her behavior. He also requested therapy for his client instead of prison time, according to the Daily Mail. The    victim was “disgusted” and “upset” about the sexual encounter. Hardan began explicitly texting him and eventually got him in her car, drove to a secluded area, “and performed a sex act on him. ” The student reported he was so repulsed that he jumped out of the car and walked two miles back home. The convict reportedly perpetrated similar acts with the older boy, prosecutors proved in court. Prosecutors had worked out a deal with Hardan’s legal team, and she accepted a   sentence, which was then presented during the sentencing phase of her trial. But Passaic County Superior Court Judge Miguel de la Carrera decided on a lesser sentence, citing the mitigating factors of her childhood. Judge de la Carrera imposed a   sentence. “She had classmates and friends, but somehow, perhaps because of limitations on her dating life, she didn’t find the proper outlet among males of her own age,” the judge insisted during the sentencing. “She did not learn how to interact with guys her age,” de la Carrera added. Still, the judge refused to put her sentence off until she finished a college class she was taking at a local community college. Hardan will be eligible for parole, with good behavior, in a year. Follow Warner Todd Huston on Twitter @warnerthuston or email the author at igcolonel@hotmail. com.'"}, "time": 1742563586.4457774}