{"duration": 0.048804283142089844, "input_args": {"text": "'The White House Correspondents’ Association (WHCA) has tapped comedian Hasan Minhaj to headline the establishment media’s biggest annual event. [This year’s   dinner, which is set to take place April 29th, will feature members of Donald Trump’s administration and large swathes of media members. But the president, as he announced in February, won’t be attending the event.  Minhaj, however, a relatively unknown figure, has made a habit of hitting Donald Trump with personal insults. The Daily Show star called Trump “White ISIS” during last year’s primaries and was featured in a recent Daily Show segment that highlighted the president’s greatest tweet of all time. . @roywoodjr and @hasanminhaj announce the greatest Trump tweet of all time. pic. twitter.   —   The Daily Show (@TheDailyShow) April 6, 2017,  Minhaj also mocked President Trump in a statement thanking the WHCA for selecting him to host. “It is a tremendous honor to be a part of such a historic event even though the president has chosen not to attend this year. SAD!” Minhaj said. “Now more than ever, it is vital that we honor the First Amendment and the freedom of the press. ” While the WHCA dinner tends to feature a comedian who mocks the president and the press, the WHCA chief says picking an   host was not the message his organization wanted to send. “I was not looking for somebody who was going to roast the president in absentia. That’s not fair, and that’s not the message that we want to get across,” WHCA president Jeff Mason said Tuesday on MSNBC’s Morning Joe. “I was looking for somebody who is funny and who is entertaining, because I want the dinner to be entertaining, but who can also speak to the message that the whole dinner is going to speak to   …     the importance of a free press. ” Nevertheless, Minhaj’s being selected to headline the WHCA dinner will likely parallel the event’s past jeering of Trump. At 2011’s dinner, Trump was skewered by both Barack Obama and that night’s comedic relief Seth Myers. And if Minhaj goes full   while hosting, the WHCA dinner will likely intensify the hostility between the president and the media. Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742561905.0429175}