{"duration": 0.06442737579345703, "input_args": {"text": "'Share on Twitter \\nIt\\'s no secret just how much time HGTV stars Chip and Joanna Gaines spend together. They have four children together and run an entire Magnolia empire together, so needless to say their time apart is few and far between. \\nAs Joanna writes on her blog “Magnolia Market,” they don\\'t really want to be apart. Image Credit: Donna Ward/Getty Images \\nIn fact, she says that early on in their marriage they learned that they work better when they are together than when they are apart: \\n“One pretty amazing thing we learned early on was that the more time we spent together, the better our relationship was. We seem to give each other energy. We function better together than we do apart, and I don\\'t think either one of us has ever felt the urge to say, \\'I need a break from you.\\'” \\nAnd although the inspirational couple admits they have their little squabbles every now and then, they never find themselves in full-blown arguments... anymore, that is. A photo posted by Joanna Stevens Gaines (@joannagaines) on Aug 19, 2016 at 7:07pm PDT \\nDuring an interview with YouTube\\'s Jefferson Bethke , Chip described a fight they had as newlyweds that Joanna says ended all other fights: \\n“I remember when we were first newly weds, we had just bought our first little flip property and we were working at this thing till like two o\\'clock every morning for weeks at a time. When it got to basically the end of this sleepless endeavor that we were on, Jo and I got into some argument about something completely irrelevant.” \\nAt this point in the story, Jo chimed in saying that the fight started because of something Chip said, but never explained exactly what her husband said some 12 years ago. A photo posted by Chip Gaines (@chippergaines) on Oct 19, 2016 at 3:09pm PDT \\nThat\\'s when Chip continued by saying: \\n\"Jo slammed this gallon of primer down on the floor and the primer bounced back up and literally hit her on the face, as if she\\'s been egged in the face, so this primer is just falling of off her eye lashes, falling off of her nose and mouth. \\nIn my family, you know we are just average middle class American folks, when we would get into these knock-down-drag-out fights and something hilarious happens, we would all be like, \\'Timeout, you got primer on your face. That\\'s hilarious.\\' You know, it\\'s God\\'s way of telling everybody to calm down, you\\'re going to make it.\" \\nIn Jo\\'s family, however, having something like that happen during a fight changes the nature of the fight from simple argument to “ninja warfare.” \\n\"She started doing these roundabout high kicks toward my face and head. I remember, it was almost like a Matrix moment, where in slow motion, she is wheel-housing toward my face and for no reason I was doing these complete lateral bends that I didn\\'t even know I was capable of. \\nBut in that same moment I was like, \\'I love this woman, I think this is going to work.\\'\" \\nAs Joanna made sure to point out, that was the first and only fight of that intensity they have had as a married couple, and Chip agrees with Joanna that they got all of their fighting out in that one night. \\nHowever, there was one other time that Chip says Joanna pulled a knife out on him, but Jo didn\\'t want that story told. \\nIf they can get past all of Chip\\'s bad jokes, then this adorable, creative couple can get through anything. '"}, "time": 1742562384.6214292}