{"duration": 0.1294105052947998, "input_args": {"text": "'Robert Osborne, a onetime actor who turned his lifelong love of old films into a starring role as the marquee host of Turner Classic Movies, died on Monday at his home in Manhattan. He was 84. David Staller, a longtime friend, confirmed the death. For the last 23 years, the   Mr. Osborne brought a sophisticated, gentlemanly air to TCM, where he turned his   familiarity with films, their back stories and their stars into absorbing intros, outros and interviews. He typically introduced 18 movies a week, as well as marathons and special presentations, that provided an escape into a golden age when Fred and Ginger were dancing, Humphrey Bogart and Ingrid Bergman ruled and Marlon Brando was transforming acting. And, it turned out, his presence and storytelling helped turn TCM into a prime destination for movie buffs. “I get stopped on the street all the time,” he said in an interview with The New York Times in 2014. “People say: ‘You got me through cancer last year. You got me past unemployment. You take me away from my troubles.’ Exactly what movies did in the ’30s and ’40s. ” Mr. Osborne appealed as much to moviemakers as he did to moviegoers. In a statement, Steven Spielberg said, “He got us excited and reawakened to the greatest stories ever told with the most charismatic stars in the world. ” Mr. Osborne was a fan and historian with a special fondness for leading ladies like Olivia de Havilland, Gene Tierney, Kim Novak, Barbara Stanwyck and Bette Davis, some of whom became his friends. “I love those people,” he told “CBS Sunday Morning” last year. “They were so interesting to be around. These were people that once ruled the world. ” Ben Mankiewicz, another host on TCM, said he had witnessed the affection that actresses like Debbie Reynolds, Eva Marie Saint, Cher and Liza Minnelli showed Mr. Osborne. “There was a trust between them,” he said in a telephone interview. “You spend 20 seconds with Robert, you know you could trust him. They knew that he appreciated the legacy they were part of. They could let their guard down. He was the exact right caretaker of these movies that mean so much to so many people. ” But, Mr. Mankiewicz added, “He’d talk to you as much about Douglas Fairbanks, Tyrone Power and Cary Grant. ” In his West Side apartment at  —   yes, the Osborne  —   he kept a memorabilia collection that included a   pincushion from one of Elizabeth Taylor’s birthday parties ashtrays from show business landmarks like the Brown Derby in Hollywood and the Stork Club in New York two Golden Globe awards and the  statuette used in the awards ceremony scene in “All About Eve,” which Ms. Davis gave him as a gift. Robert Jolin Osborne Jr. was born on May 3, 1932, in Colfax, Wash. His father was a high school principal and coach his mother, the former Hazel Jolin, was a homemaker. Robert discovered his love of Hollywood when, in 1941, his mother brought him a copy of Modern Screen magazine with Lana Turner on the cover. He became so engrossed that he began jotting down, in a notebook, the details of every   movie he could find  —   a kind of human precursor to the Internet Movie Database. His love of movies led to his working as a young man at the Rose and Roxy Theaters in Colfax. (He later invested in another Rose Theater, in Port Townsend, Wash. which was renovated in the 1990s.) He studied journalism at the University of Washington and started acting after graduation, working for 20th Century Fox and for Lucille Ball and Desi Arnaz’s Desilu Productions. His screen credits were modest: uncredited roles (one in Alfred Hitchcock’s “Psycho”) and a guest appearance on the 1960s sitcom “The Beverly Hillbillies. ” Ms. Ball liked him and encouraged him to give up acting to write about Hollywood. And former stars in particular  —   untethered from the studio system, rarely working and often forgotten  —   welcomed him. “They were cut off like people on a desert island,” he told The Times. “Paulette Goddard, I got to know. Hedy Lamarr, I got to know really well. Nobody gave a damn about Hedy Lamarr back then. ” His book, “Academy Awards Illustrated” (1965) with an introduction by Ms. Davis, led to his becoming a critic and columnist at The Hollywood Reporter. His television appearances led to his being hired as a host on The Movie Channel before he moved to TCM in 1994. Mr. Osborne’s love of movies led him to invest in the Rose Theater in Port Townsend and he became instrumental in the growth of its film festival, now entering its 18th year. “With his connections, he brought us Eva Marie Saint and other stars,” said Rocky Friedman, the majority owner of the Rose Theater there. “They’d come and do interviews with Robert  —   and he was so gracious with the public. ” Mr. Osborne left no immediate family survivors. Mr. Friedman said he saw Mr. Osborne last month in Manhattan. “He was just Robert, with countless stories about Hollywood,” he said. “And he told me something I had never known. That every Sunday for 40 years, he has spoken to Olivia de Havilland. ”'"}, "time": 1742563815.1558602}