{"duration": 0.11391377449035645, "input_args": {"text": "'JINCHENG, China  —   America’s uncertain stance toward global warming under the coming administration of Donald J. Trump has given China a leading role in the fight against climate change. It has called on the United States to recognize established science and to work with other countries to reduce dependence on dirty fuels like coal and oil. But there is a problem: Even as it does so, China is scrambling to mine and burn more coal. A lack of stockpiles and worries about electricity blackouts are spurring Chinese officials to reverse curbs that once helped reduce coal production. Mines are reopening. Miners are being lured back with fatter paychecks. China’s response to coal scarcity shows how hard it will be to wean the country off coal. That makes it harder for China and the world to meet emissions targets, as Chinese coal is the world’s largest single source of carbon emissions from human activities. Among China watchers, the turnabout also has contributed to questions about the fate of China’s current crop of economic planners. Here in Jincheng, a smoggy city in China’s coal country, the   has led to a steady hum of activity. On a recent afternoon, other trains stopped to make way for two electric locomotives, their horns blowing, pulling more than 50 empty coal hopper cars ready to be filled. Large   trucks now form   lines. Allan Zhang, an electrician who works at a mine here, said his employer had raised monthly pay by nearly 50 percent since the summer. Two years ago brought “the autumn of coal, and 2015 and earlier this year were the winter of coal,” Mr. Zhang said. “Now is the springtime of coal. ” The revival of coal production shows the flaws in the country’s   evolution from central planning to the free market. China’s coal problems stem from a series of official decisions that ramped up activity from   industries even as they curbed mining output. Speculators in China’s volatile financial markets, already prone to producing bubbles, ran up the price of coal. Weather and other setbacks haven’t helped. Coal still produces almost   of China’s electricity, despite ambitious hydroelectric dam projects and the world’s largest program to install solar panels and build wind turbines. Coal use in China also produces more emissions than all the oil, coal and gas consumed in the United States. “I get a kick out of people in the West who think China is decarbonizing, because I see no sign of it whatsoever,” said Brock Silvers, a Shanghai banker who has previously served on the boards of two Chinese coal companies. Troubled by pollution and worries about rising sea levels, China moved in recent months to rein in coal. Coal production dropped 3 percent last year  —   a result of that effort, but also a sign of slowing economic growth as well as a gradual shift in the Chinese economy toward   consumer spending and away from exports and heavy manufacturing. That prompted the International Energy Agency to offer an optimistic reassessment this autumn: Chinese coal use peaked in 2013 and would now decline. China’s reversal now is prompting skepticism. “There is still a peak coming,” said Xizhou Zhou, the head of Asia and Pacific gas and power analysis at IHS Energy, a global consulting group. “It’s still going to increase. ” IHS Energy forecasts that Chinese coal demand will not peak until 2026. Johannes Trüby, a senior coal and power analyst at the International Energy Agency, said that   trends in the Chinese economy meant that China’s coal use would decline over all. But with China stepping up production now, he said, “We cannot exclude the possibility of a transient spike in coal demand in the next couple years that might take demand above 2013. ” The coal situation has put China’s powerful economic planning agency, the National Development and Reform Commission, under pressure. Many executives and Chinese political experts predict that coal problems could be the final straw in a long list of difficulties that could lead President Xi Jinping to replace the agency’s director, Xu Shaoshi. Mr. Xu is 65, an age at which Chinese ministers often retire, unless they are kept on to serve their terms or are promoted to vice premier. One of those experts, Christopher K. Johnson, a China specialist at the Center for Strategic and International Studies in Washington, said that such a move “would be consistent with other recent personnel changes” by Mr. Xi, who is chief of the Communist Party, to eliminate officials beholden to other factions. That could clear the way for Mr. Xu to be replaced by Liu He, a deputy director of the agency who is close to Mr. Xi. Agency officials did not immediately respond to a request for comment. As a matter of policy, China says it is still committed to global efforts to stem climate change. When environmental officials from around the world gathered in Marrakesh, Morocco, to discuss climate change this month, Xie Zhenhua, the leader of China’s delegation, took an indirect swipe at Mr. Trump, saying, “a wise leader will follow the global and historical trend. ” Two years ago, cutting emissions looked easier for Beijing to achieve. China’s electricity consumption was stalling, and many   power plants began operating only half the time. But   coal mining enterprises, flush with loans from   banks, kept building more mines, leading to losses and dropping coal prices. China began closing smaller, privately owned mines, cutting production while clamping down on some of the places that have made Chinese coal mining so dangerous. Just last summer, economic planners told mines they were not allowed to operate more than 276 days a year. But developments were coming together to push prices up. Chinese investors piled into Chinese commodities markets, betting prices would rise. This became a   prophecy, as more speculators rushed in and bought more coal when prices rose. An unusually hot summer and early autumn added to power demand. China’s banking regulators decided to let banks release a flood of mortgages to home buyers to bolster economic growth. That produced strong demand for electricity from the steel and cement industries. Along the way, China had a run of bad luck. Flooding disrupted mines and rail routes last spring. A government decision to withdraw many trains from service this year for a new safety improvement campaign made it difficult to deliver supplies quickly. As a result, Chinese coal prices almost doubled from the start of this year until early November. “It’s actually quite fascinating, how all of these things have come together,” said Arnoud Balhuizen, the president of marketing and supply at BHP Billiton, the Australian mining giant. In recent weeks, China changed course. It halted most coal trading on commodities markets and encouraged   mines to sign   contracts at low prices with power stations. This month, the National Development and Reform Commission raised the number of days that mines could operate to 330 days per year. China will most likely be able to avoid blackouts, said Chang Yijun, the president of Shanxi Fenwei Energy, a regional coal consulting firm, who added that remaining output caps like the   rule would still limit growth in emissions of greenhouse gases. Residents in mining towns are delighted. An avenue here in Jincheng is lined with huge billboards, each carrying the same cheery message: “Coal prices are going up, and miners are smiling. ” Mr. Zhang, the mine electrician, said that his mine’s work force had shrunk from 300 two years ago to a maintenance crew of eight early this year, but that it had now expanded to 60 and the mine was still hiring. The mine’s stockpile of coal has nearly vanished. As more coal is hauled up from far underground, it is trucked away within two hours. “Last spring, there were no lines of trucks,” he said. “Now there are so many. ”'"}, "time": 1742563586.0067487}