{"duration": 0.06595182418823242, "input_args": {"text": "'The political news cycle is fast, and keeping up can be overwhelming. Trying to find differing perspectives worth your time is even harder. That’s why we have scoured the internet for political writing from the right and left that you might not have seen. We would love to hear your thoughts on this collection. Send your feedback to ourpicks@nytimes. com _____ • From National Review: “To smear Neil Gorsuch, the Left has created and attacked a straw man. ” For originalists, there is a crucial distinction between “original intent” and “original meaning. ” This is a distinction that the writer David French believes gets erased by those who oppose the legal doctrine. _____ • From The Weekly Standard: “It is easier to decide who we don’t want here than who we do. ” What should United States immigration policy look like after some of the more contentious debates have been settled? Irwin M. Stelzer proposes a   solution. _____ • From The Federalist: “You thought Bane was a movie character turns out he’s a political avatar. ” Owen Strachan, a professor at Midwestern Baptist Theological Seminary, argues that at the root of the   movement is a group of young men who feel left behind by society. Troubled by the rise of the movement, but also critical of the progressive culture that he argues has silenced these young men, his prescription calls for, among other things, a “savior” who will call this group to maturity and  . _____ • From The American Conservative: “He apparently went to sleep shortly after Richard Nixon declared a ‘war’ on illegal drugs in 1971 and just recently awakened from his slumber. ” Attorney General Jeff Sessions recently equated marijuana and heroin use, arguing that the former was only “slightly less awful” than the latter. Ted Galen Carpenter, a senior fellow for the libertarian policy research firm The Cato Institute, argues that Mr. Session’s positions on marijuana make him the “Rip van Winkle” of drug policy. _____ • From Jacobin: “Originalist textualists are no less activist than their peers. They’re just less open about it. ” As Judge Neil M. Gorsuch’s Senate confirmation hearings draw to a close, Matt McManus explains why progressives should be wary of judges who consider themselves to be originalists. _____ • From Democracy: “It’s big, bold, and could fit on a bumper sticker. ” Here’s a policy plan we haven’t heard from the Democrats: Guarantee every American willing and able to work a job. That’s exactly what the writer Jeff Spross advocates in a piece that is part serious policy proposal, part theoretical mental exercise. _____ • From In These Times: “Heritage isn’t an appendage of the Trump administration’s radicalism. It’s the heart of it. ” Though President Trump is a Washington outsider, not all establishment groups viewed his victory in November as a defeat. In a cover story for the liberal magazine In These Times, Theo Anderson chronicles the   history of the conservative think tank the Heritage Foundation and connects its longstanding agenda to the current administration’s proposed cuts to the federal budget. _____ • From New Republic: “In declaring the media the ‘opposition party,’ Bannon may have actually done it a great favor. ” Leah Finnegan argues that the media should shed its “pompous air of  ” and reverence for objectivity in favor of a   opposition to the Trump administration. _____ • From Lawfare: “Why are so many judges being so aggressive here?” What is behind the slew of judicial responses to Mr. Trump’s executive orders on travel? Benjamin Wittes and Quinta Jurecic explore the possibility that the judiciary doesn’t quite trust Mr. Trump’s oath of office. _____ • From The Chronicle of Higher Education: “For at least two generations, it has been leftist professors who were supposedly addicted to tearing things down [. ..] But the habit now seems to be spreading. ” Welcome to Claremont McKenna College, the academic home of the   movement. _____ • From The Smart Set: “I have been reading about the damned Mondragon cooperatives since the 1980s. Enough with Mondragon!” Michael Lind has no patience for the “false utopias” of ideologues on either end of the political spectrum. Read his ringing endorsement for political pragmatism. _____'"}, "time": 1742561771.8782246}