{"duration": 0.06341099739074707, "input_args": {"text": "\"The Hidden Symbolism In Clinton’s Election Night Venue (TWEETS/VIDEO) By Natalie Dailey   \\nDemocratic presidential nominee Hillary Clinton has made history this year by becoming the first woman nominated to run for president by a major party. In less than two weeks, we will likely be celebrating our first female president. \\nHillary Clinton picked a beautiful place to plan to spend election night; the Jacob K. Javits Convention Center in New York. \\nShe will break a metaphorical glass ceiling under a real glass ceiling when that special moment happens. About the building : “The structure is an 840,000 square foot venue that sits on the Hudson River and has hosted numerous events. It’s most striking aspect is that most of it is made of glass.” \\nMore about the building : “Operated by the New York Convention Center Operation Corporation (NYCCOC), a public benefit corporation, the Javits Center helps drive the economies of New York State and New York City, generating an impressive $1.5 billion in economic activity and supporting 14,000 jobs. Nowhere in the country will you find a more sought-after, state-of-the-art facility—one with the extensive resources, services and staff of elite professionals dedicated to making every trade show, convention and special event a success.” Reminder: The Javits Center, where Hillary Clinton is holding her election night party, has a literal glass ceiling pic.twitter.com/RvGLDx9cAc \\n— Elliot Smilowitz (@SmiloTweets) October 26, 2016 \\nRepublican presidential nominee Donald Trump has a connection to this building. He wanted to build it, but the city ended up overseeing the project, so he decided it was just a terrible project altogether. What a sore loser. \\nExplained in Trump’s book, The Art of the Deal , he said : “What happened at that convention center is that the city and state took a great piece of property and a great project and ruined it through terrible planning and ridiculous cost overruns.” \\nThe GOP is not as optimistic as Clinton is. In fact, the Michigan GOP has decided to cancel the election night rally they were going to have. \\nMichigan GOP communications director Sarah Anderson said : “It is a costly endeavor and we are using all available resources to elect Republicans.” \\nHere she is talking about glass ceilings in a video from the 2008 campaign after she lost the primary to Barack Obama: \\nFeatured Image: Screenshot Via YouTube Video . About Natalie Dailey \\nHi, I'm from Huntsville, AL. I'm a Liberal living in the Bible Belt, which can be quite challenging at times. I'm passionate about many issues including mental health, women's rights, gay rights, and many others. Check out my blog abravealabamaatheist.com. Check out my other blog weneedtotalkaboutmentalhealth.com Connect\""}, "time": 1742563018.760257}