{"duration": 1.7482805252075195, "input_args": {"text": "'WASHINGTON  —   A new batch of State Department emails released Tuesday showed the close and sometimes overlapping interests between the Clinton Foundation and the State Department when Hillary Clinton served as secretary of state. The documents raised new questions about whether the charitable foundation worked to reward its donors with access and influence at the State Department, a charge that Mrs. Clinton has faced in the past and has always denied. In one email exchange, for instance, an executive at the Clinton Foundation in 2009 sought to put a billionaire donor in touch with the United States ambassador to Lebanon because of the donor’s interests there. In another email, the foundation appeared to push aides to Mrs. Clinton to help find a job for a foundation associate. Her aides indicated that the department was working on the request. Mrs. Clinton’s presidential campaign, which has been shadowed for 17 months by the controversy over the private email server she used exclusively while at the State Department, said that the emails released Tuesday had no bearing on the foundation’s work. The State Department turned the new emails over to a conservative advocacy group, Judicial Watch, as part of a lawsuit that the group brought under the Freedom of Information Act. The documents included 44 emails that were not among some 55, 000 pages of emails that Mrs. Clinton had previously given to the State Department, which she said represented all her “ ” emails. The document release centers on discussions between Mrs. Clinton’s aides and Clinton Foundation executives about a number of donors and associates with interests before the State Department. Tom Fitton, the president of Judicial Watch, charged that Mrs. Clinton “hid” the documents from the public because they appeared to contradict her official pledge in 2009 to remove herself from Clinton Foundation business while leading the State Department. The documents indicate, he said in a telephone interview, that “the State Department and the Clinton Foundation worked hand in hand in terms of policy and donor effort. ” “There was no daylight between the two under Mrs. Clinton, and this was contrary to her promises,” he added. A number of the email exchanges released Tuesday included Huma Abedin, who was a top adviser to Mrs. Clinton at the State Department and later worked at the Clinton Foundation. In April 2009, Douglas J. Band, who led the foundation’s Clinton Global Initiative, emailed Ms. Abedin and Cheryl D. Mills, another top adviser to Mrs. Clinton, for help with a donor. Mr. Band wrote that he needed to connect Gilbert Chagoury, a   billionaire who was one of the foundation’s top donors, with someone at the State Department to talk about his interests in Lebanon. “It’s jeff feltman,” Ms. Abedin answered, referring to Jeffrey Feltman, who was the American ambassador to Lebanon at the time. “I’m sure he knows him. I’ll talk to jeff. ” Mr. Band asked her to call Mr. Chagoury immediately if possible. “This is very important,” he wrote. In a separate email exchange, Mr. Band passed along to Ms. Abedin and Ms. Mills a request for “a favor” from an associate who had recently been on a Clinton Foundation trip to Haiti and was apparently seeking work at the State Department. The State Department deleted much of the information about the associate, including his name and the outcome of the job referral, in turning over the emails to Judicial Watch. In one undeleted section, however, Mr. Band wrote that it was “important to take care of” the associate’s request. A short time later, Ms. Abedin wrote back to say: “We all have him on our radar. Personnel has been sending him options. ” The Clinton campaign suggested that Mr. Band was acting in his capacity as former President Bill Clinton’s personal assistant, not in his role overseeing the Clinton Global Initiative. Regarding the exchanges between Mr. Band and Mrs. Clinton’s aides, the campaign said in a statement: “Neither of these emails involve the secretary or relate to the foundation’s work. They are communications between her aides and the president’s personal aide, and indeed the recommendation was for one of the secretary’s former staffers who was not employed by the foundation. ” The campaign did not elaborate. The F. B. I. spent more than a year examining Mrs. Clinton’s use of a private email account, but it is not clear how the work of the Clinton Foundation figured into that investigation. James B. Comey Jr. the F. B. I. director, was noticeably circumspect in an appearance last month before the House oversight committee when Republicans questioned whether the investigation had looked at the Clinton Foundation. Twice, he declined to say.'"}, "time": 1742563005.3394792}