{"duration": 0.026719331741333008, "input_args": {"text": "'Zach Cartwright | November 6, 2016 \\nPresident Obama is relentlessly mocking Donald Trump in the wake of news that the candidate has had control of his Twitter account usurped by staffers. \\nWhile on the campaign stump for Hillary Clinton in the battleground state of Florida, Obama poked fun at the GOP presidential nominee’s campaign revoking exclusive access to his Twitter account, which he has used for years as a platform to blast unfiltered 140-character missives at his political opponents and pop culture figures. The 44th President of the United States made the point that presidents require a larger degree of self-control than what Trump has shown throughout the election cycle. \\n“In the last two days, they had so little confidence in his self control, they said: ‘We’re just going to take away your Twitter.’ Now, if somebody cant handle a Twitter account, they can’t handle the nuclear code,” Obama said. “If somebody starts tweeting at three in the morning ’cause SNL made fun of you, then you can’t handle the nuclear code.” \\nThe New York Times recently reported that Trump now has all of his tweets pre-screened by campaign staffers like Hope Hicks, who handles media relations for the Trump campaign. The billionaire real estate developer’s days of tweeting tirades at former beauty pageant stars are over, for the time being, with his campaign aides working overtime to keep the candidate on message in the remaining 48 hours before Americans cast their ballots on Tuesday. \\nWatch video of Obama’s mocking of Trump in Kissimmee, Florida below: \\nFlorida is a contentious, must-win state for both Hillary Clinton and Donald Trump. The latest polling average from RealClearPolitics shows Clinton with a paper-thin 0.9 percent advantage over Trump. \\n\\nZach Cartwright is an activist and author from Richmond, Virginia. He enjoys writing about politics, government, and the media. Send him an email at [email protected] '"}, "time": 1742563257.507863}