{"duration": 0.047598838806152344, "input_args": {"text": "'Home / Blue Privilege / Police Officer’s Wife Caught Faking a Robbery In a Scheme To Frame Black Lives Matter Police Officer’s Wife Caught Faking a Robbery In a Scheme To Frame Black Lives Matter The Free Thought Project October 30, 2016 1 Comment ( RT ) A Boston police officer’s wife has been charged with faking a robbery which she attempted to frame the Black Lives Matter Movement for. \\nMaria Daly reported a burglary at her home in Millbury on October 17 and claimed her jewelry and some money had been stolen. She told police her home had been graffitied with the letters, “BLM.” \\n“Something wasn’t quite right,” Millbury Police Chief Donald Desorcy said . “I think that was pretty obvious and as a result of that investigation, the officers did their due diligence and followed through with the investigation that we had.” This is white supremacist Maria Daly, the wife of Boston cop Daniel Daly.She staged a fake robbery of her home, and tried to blame #BLM pic.twitter.com/vrdqg1cM6r \\n— Tariq Nasheed (@tariqnasheed) October 29, 2016 \\nCBS Boston reports Daly took to social media soon after the fabricated robbery, saying, “We woke up to not only our house being robbed while we were sleeping, but to see this hatred for no reason.” \\n“If you would of [sic] asked me yesterday about this blue lives and black lives matter issue my response would of [sic] been very possitive [sic],” the now private Facebook account continues. “Today on the other hand I have so much anger and hate that I don’t like myself. This is what we have to deal with these days and it makes me sick that this is what was on the side of my house.” \\nDespite Daly’s best efforts, the police were able to tell no robbery took place. @crystalhaynes The poor lady just needs some help.. \\n— Mark Scanlon (@markscanlon50) October 28, 2016 \\n“Basically we came to the conclusion that it was all fabricated,” said Desorcy. “There was no intruder, there was no burglary.” \\nPolice concluded Daly fabricated the robbery due to financial difficulty. Daly confessed and returned the items she claimed were missing, which amounted to $10,000 in jewelry. \\nDesorcy told reporters, “We weren’t going to sweep this under the rug,” and that he felt sorry for the family. \\nDaly’s husband Dan is not suspected of being involved in his wife’s crime. Share Google + The Cat’s Vagina (Nasty Woman) \\nSo, is she going to be brought up on the same charges that any one of us would be for staging a crime and lying to police, or will she avail herself of Blue (Dick Holster) Privilege? Social'"}, "time": 1742562014.8577511}