{"duration": 0.03879833221435547, "input_args": {"text": "'Lieutenant Governor of California and former San Francisco Mayor Gavin Newsom wants to fight the technology that’s replacing human jobs around America, according to The Guardian. [At a commencement ceremony for students of Computer Science, Newsom warned an audience that the “plumbing of the world is radically changing. ”  “The tech industry that would make them rich, Newsom declared, was also rendering millions of other people’s jobs obsolete and fueling enormous disparities in wealth,” reported The Guardian. “‘Your job is to exercise your moral authority,’ he said. ‘It is to do the kinds of things in life that can’t be downloaded.’ “That is not the kind of message computer engineers tend to hear. But Newsom, who has been waiting in the wings as California’s lieutenant governor for the past seven years, has put the consequences of automation at the center of his campaign,” they continued. During an interview with The Guardian following his speech, Newsom called the increasing dependency on technology “code red, a firehose, a tsunami that’s coming our way. ” “We’re going to get rolled over unless we get ahead of this,” he declared. Newsom, however, considers some of the top technology leaders as friends, including Mark Zuckerberg and Elon Musk. “I’ve grown up in and around this world. I could tell you 10 founders who I did their weddings, quite literally married them,” he claimed. “Very, very close a number of them are godparents to my kids. ” He is also “not opposed” to the popular Silicon Valley policy of a universal income. “I’m struggling to figure it out,” Newsom proclaimed during his interview. “So I don’t have the damn answer. ” Charlie Nash is a reporter for Breitbart Tech. You can follow him on Twitter @MrNashington or like his page at Facebook.'"}, "time": 1742563725.5945435}