{"duration": 0.019656658172607422, "input_args": {"text": "'Financial Markets , Gold , Housing Market , Market Manipulation , Precious Metals , U.S. Economy fake news , housing collapse , stock bubble admin \\nThe widespread, systematic implementation of propaganda dates back to at least the World War 1 era when Edward Bernays – the nephew of Sigmund Freud and the Father of Propaganda – began working with Woodrow Wilson. The dissemination and proliferation of “fake news” for the purpose of “thought control” is a form a fascism that is seeded in the Totalitarian creep that is engulfing the U.S. political system. \\nThe commentary published by John Whitehead of the The Rutherford Institute is a must-read in order to put the “fake news” problem into its proper context. \\n[T]the “news” we receive is routinely manufactured, manipulated and made-to-order by government agents. Not when six corporations control 90% of the media in America. And not when, as Davies laments, “news organizations which might otherwise have exposed the truth were themselves part of the abuse, and so they kept silent, indulging in a comic parody of misreporting, hiding the emerging scandal from their readers like a Victorian nanny covering the children’s eyes from an accident in the street.” The Pentagon has now designated “information operations” as its fifth “core competency” alongside land, sea, air and special forces. Since October 2006, every brigade, division and corps in the US military has had its own “psyop” element producing output for local media. This military activity is linked to the State Department’s campaign of “public diplomacy” which includes funding radio stations and news websites. \\nYou can read the rest of this here: When It Comes To Fake News, The Government Is The Biggest Culprit \\nThe manipulation of economic data and the markets is yet another insidious form of propaganda and implementation of political/economic control. I’ve detailed ad nauseum evidence of the fraudulent economic data across a wide range of Government reports – employment, GDP, housing, inflation, etc. \\nThis is going to get worse regardless of who or which party occupies the White House. It’s about control and power. Ultimately the Government has no control over the laws of economics. When the majority of the population feels the pain of economic distress in spite of the misleadingly optimistic economic reports, the Government has no choice but to implement control policies in order to maintain its power. \\nThere is nothing we can do about this but you can prepare accordingly if you at least recognize the truth. If you want to see who this plays out, I would suggest re-reading “1984” and “Atlas Shrugged.” Share this:'"}, "time": 1742628441.874831}