{"duration": 0.15895581245422363, "input_args": {"text": "'“Tech” Malaise Pricks San Francisco Office Space Bubble   \\nWolf Richter wolfstreet.com , www.amazon.com/author/wolfrichter Tough business decisions loom. \\nThe rumored second round of layoffs at Twitter – which in 2011 was granted by the befuddled city of San Francisco the “Twitter tax break” on employment taxes – comes at a very inopportune moment for the glory of commercial real estate. These layoffs would amount to 8% to Twitter’s workforce, or about 300 people, according to Bloomberg . \\nAlready, Twitter has thrown 183,642 square feet of vacant office space at its two-building Mid-Market headquarters on the sublease market, thus bringing it to 1.51 million square feet (msf). \\nThis comes at a time when, according to the “ snapshot ” from Cushman & Wakefield, leasing activity nearly ground to a halt in the third quarter, with only 875,000 sf leased – the lowest since 2001! \\nThere was only one major lease deal over 100,000 sf: Amazon’s live streaming video platform Twitch, which took 178,000 sf. The next largest deal was less than half that size: WeWork leased 78,000 sf. \\nLeasing activity for the three quarters this year plunged 30% from the same period last year, to just 4.7 msf, according to a report released this week by commercial real estate services firm Savills Studley , which added dryly, “The competition for space has calmed dramatically from several quarters ago.” \\nAnd there is a lot of new supply coming on the market, according to Cushman & Wakefield: currently, 3.8 msf of office space are under construction, with 31% preleased. \\nOverall vacancy rose 0.7 percentage points from the prior quarter to 9.0% in Q3, according to Savills Studley. In Class A buildings, availability jumped 1.1 percentage points to 10.4%. Some areas were still red-hot, but others are turning cold: In the SOMA area, there were practically no vacancies (1.0%). But at the other end of the spectrum, vacancies at the Financial District South spiked 2.5 percentage points to 12.3%. \\nOverall, the San Francisco office market, though it has turned the corner, is still tight, compared to the 17.9% vacancy rate of the US index \\nAs leasing activity has ground into slow-motion, with demand fizzling and companies waiting for rates to drop, while landlords still try to hold on, overall office rents edged up 1.4% to $65.20 per square foot. For Class A buildings, rents rose by 0.9% to $66.75/sf. \\nIn some submarkets, rents are still rising: at one end of the spectrum, Financial District North, rents rose 2.3% from a year ago, very tepid by San Francisco’s explosive standards. But in other submarkets, rents are coming down: at Jackson Square (the area just north of the Transamerica Pyramid, one of the oldest commercial areas) rents fell 4.7%, and at Rincon/South Beach rents fell 2.4%, with Class A rents down 5.2%. \\n\\nHow tough is it for businesses to make these sky-high rents work? Charles Schwab’s entire 435,000 sf headquarters building is up for lease. The lease expires in May 2018, and Schwab hasn’t renewed it yet. It’s contemplating moving at least some of its operations to cheaper areas and states, including North Texas. Other companies have already moved out of San Francisco, and others are working on it, including Uber, which is moving across the Bay. \\nThe rate of $65.20/sf in San Francisco is about double the US index of $33.82/sf. And that’s part of the problem. Because it’s not a perfect world anymore. \\nThe office sector in San Francisco is dependent on the startup boom, the stock market, the IPO market, the rush of global money, and exuberant optimism in the VC community that this is going to work out somehow, that these startups in bio tech, medical devices, social media, ad tech, fin tech, travel tech, and beer-home-delivery tech are going to be unicorns someday, and that enough of these unicorns are actually going to fly. \\nThat’s where the money comes from to fund companies with big cash drains that hire lots of people and lease a lot more office space then they’ll ever need in the hope of growing into it as they soar along their exponential growth curve on their way to disrupting dinner as we know it. \\nBut when VCs and other investors suddenly get skittish, as they did last year and earlier this year as IPOs were drying up, they tighten their purse strings, and some startup shut down while others are laying off people and are putting expansion plans on hold. Valuations have fallen from crazy levels to still crazy levels. More mature companies, like Twitter, have run into the wall of reality where dreams go POP. And others are moving to cheaper pastures. \\nBut all the fretting appeared to settle down this spring and summer. Stock markets became perky again, some IPOs started flying once again off the shelf in September, mid and later-stage startups were able to secure funding, thus creating some support for office space, and the hope is that the office sector would escape a total rout this time. \\nLandlords are trying to navigate this new era, and they’re piling on concessions. Savills Studley: \\nThey continue to lock in creditworthy tenants over the long-term by boosting concession packages for relocating tenants and current tenants extending their lease term. The rise in concessions is a direct response to a very sharp drop-off in leasing over the last several quarters. \\nAs recently as mid-year 2015, tech firms were making pre-emptive strikes on space well before they had the staff to fill it. Bidding wars for space have become few and far between. Additionally, some companies are delaying space-use decisions, either due to lightened budgets or a belief that rent will be lower in the immediate future. \\nAnd the new fancy office towers and other buildings coming on the market are facing a widening gap between their $80/sf asking rents and the “growing pool of sublet space now available under $60/sf.” \\nThis is how office markets turn. Activity plunges as demand suddenly fizzles, while new supply floods the market. Exuberance evaporates. Suddenly companies and landlords go into a standoff, and not much happens until rents come down. But once rents start coming down, companies are holding out for even more concessions and lower rents. Rather than bidding wars, tough negotiations set in, now that vacancies are rising for everyone to see. And the whole bubble mentality collapses into something resembling rational and focused business decision making.'"}, "time": 1742564188.953595}