{"duration": 0.06943511962890625, "input_args": {"text": "'on February 15, 2015 11:17 am · \\nIt’s a common stereotype that food stamp recipients, and those who abuse it, are black, Hispanic, or any other race but white. According to the USDA in their report for fiscal year 2013, 40% of recipients are white and 26% are black. Courtesy of Travissonno.com \\nWhile the media and America’s culture will have you believe that black people (or anyone who isn’t white) account for copious amounts of fraud, there’s a story breaking that you won’t hear on Fox “News” anytime soon (or you might, because any chance to crush the SNAP program, they will take). \\nAccording to WCAX News in New York: \\nMore than 30 people have been nabbed for food stamp fraud in the North Country. \\nInvestigators say over the past couple month’s people used their food stamps to get food or alcohol at the Old Time Butcher Block store in Brushton. \\nPolice also say it’s not the first time the owner of that store, Dennis Sauve, has been charged with allowing such fraud. \\nPolice say more arrests are expected. \\nNow here’s the kicker: they’re all white. Brushton, New York, where this bust happened, has a population of roughly 480 people. Approximately 99.83% of the population is white, and 0.42% are black. These demographics are eerily similar to the food stamp capital of the country , Owsley Country, Kentucky, which is 99.22% white and 95% Republican. Maybe we should investigate them. \\nI just wish we could get the political affiliations of those arrested in Brushton. \\nAccording to WPTZ News: \\nPolice say the arrests are the result of a year-long investigation, initiated by the Franklin County Department of Social Services Fraud Unit. Franklin County District Attorney’s Office, the United States Department of Agriculture, and the New York State Office of Temporary and Disability Assistance helped with the investigation. \\nThe store owner, Denis Sauve (also white), has been charged with third-degree grand larceny and misuse of food stamps. \\nThis really isn’t a racial issue so much as it is an, “I told you so,” issue. While the food stamp program has one of the lowest rates of abuse than any other welfare program, a lot of people buy into this misconception that it is the “lazy blacks” who account for all the fraud and woes of government assistance. Well, here we are, a major food stamp “bust” and every criminal involved is white. \\nIt might be time to rethink today’ stereotypes. Share this Article! Author: Ryan Denson Living blue in a red state (hopefully it will be purple in the next 10 years). You can reach me at [email protected] Search'"}, "time": 1742563613.8476427}