{"duration": 0.10369873046875, "input_args": {"text": "'After more than five years of investigations and negotiations, the curious case of MF Global is finally closed. On Thursday, federal regulators announced a $5 million settlement with Jon S. Corzine, who ran MF Global when it collapsed into bankruptcy in 2011 and lost more than $1 billion in customer money. The settlement, reached unanimously at the Commodity Futures Trading Commission in the waning days of the Obama administration and approved by a federal judge this week, caps a   spectacle that derailed Mr. Corzine’s career and spurred a number of congressional, criminal and regulatory investigations. The regulatory case arose in 2013, when the commodities agency sued Mr. Corzine, a Democratic former New Jersey senator and governor, saying he had failed to “diligently supervise” the firm as it jeopardized the clients’ accounts. The agency did not directly link Mr. Corzine, 70, to the missing money, but it did accuse a   employee in Chicago, Edith O’Brien, of “aiding and abetting” the misuse of customer money, saying she allowed it to be used to plug holes in MF Global’s own accounts. To resolve the case, Mr. Corzine has agreed to pay the $5 million penalty out of his own pocket. While the sum is manageable for someone who reaped many millions of dollars as a top Goldman Sachs executive before pursuing a career in politics, it is an unusual step. In other federal cases involving Wall Street, insurance money often covers settlement amounts, sparing the executives themselves. While Mr. Corzine was willing to settle the case, Ms. O’Brien nearly took it to trial. But in recent weeks she, too, agreed to settle, striking a deal that has imposed a $500, 000 penalty and an   prohibition on her associating with a futures broker like MF Global. Mr. Corzine agreed to a harsher undertaking  —   accepting a lifetime prohibition from leading a futures broker or registering with the Commodity Futures Trading Commission. In effect, that means he will not personally trade other people’s money in the futures industry, except for smaller trades under certain threshold limits. Mr. Corzine, in theory, could still operate a hedge fund that does futures trading, and he could trade for his own account. The settlement also does not prevent him from trading in other markets. “This resolution demonstrates the importance that the commission attaches to customer protection, which has long been a hallmark of our mission,” Aitan Goelman, the head of the Commodity Futures Trading Commission enforcement division, said in a statement announcing the settlement. The settlements, the contours of which were reported by The New York Times in October, bring a   close to the MF Global ordeal. The criminal investigations ended with the conclusion that MF Global employees did not intentionally break the law. Just last year, Mr. Corzine settled much of the private MF Global litigation. And a trustee has long recovered the missing customer money (much of it wound up at MF Global’s banks and clearinghouses) and made whole the farmers and hedge funds whose accounts were raided in the firm’s final days. In a statement on Thursday, Mr. Corzine said, “As the C. E. O. of MF Global in 2011, I have accepted responsibility for its failure, and I deeply regret the impact it had on customers, employees, shareholders and others. ” He added: “I remain gratified that several years ago all customer money was recovered and returned to MF Global customers. ” His lawyer, Andrew J. Levander, said: “Mr. Corzine has given more than 10 days of testimony under oath, and these matters have been investigated exhaustively by two U. S. attorney’s offices, the F. B. I. the S. E. C. the C. F. T. C. Finra and Congress. ” (Finra is the Financial Industry Regulatory Authority.) And yet, Mr. Levander said, “None of these investigations have led to allegations that Mr. Corzine engaged in any kind of intentional misconduct or fraud, or that he was at any time not truthful in his many hours of testimony. ” The case also concludes a   political challenge for the commodities agency, which came under fire for not preventing a breach of customer money at a firm it regulated. Compounding the pressure, Mr. Corzine was a sensitive target, a prominent Democrat who has been a confidant of leaders in Washington and on Wall Street. Against that backdrop, the agency extracted the $5 million payout from Mr. Corzine, a sum far greater than what it could have expected to win if he had been found liable at trial. During negotiations with Mr. Corzine last year, the commission also strengthened aspects of the deal after some of the agency’s commissioners questioned it, The New York Times reported at the time. The case against Mr. Corzine was among the agency’s biggest enforcement actions in the Obama administration. And after MF Global’s demise, on Halloween in 2011, the commodities agency used the episode to tighten the rules for protecting customer money. The disappearance of the money from MF Global unnerved the futures industry and raised broader concerns about the safety of customer funds across Wall Street. Further review showed that MF Global’s financial straits left it vulnerable to a breach. Mr. Corzine joined MF Global as chief executive and chairman in 2010 after the firm had lost money in each of the previous three years. In hopes of returning the firm to profitability  —   and perhaps transforming it into a miniature Goldman Sachs  —   Mr. Corzine placed a large wager on European sovereign debt at a time when investors feared defaults in the eurozone. Although his bet ultimately would have been profitable for MF Global, and the European bonds paid out for other firms that bought the debt, it was not enough to save the firm from unrelated woes. MF Global’s auditor, for example, made the firm write down the value of a significant future tax benefit, a move that appeared to unnerve MF Global’s investors as well as ratings agencies. And after a series of ratings downgrades, the firm started to unravel. In MF Global’s final days, it overdrew an account at JPMorgan Chase, one of its banks, and scrambled to patch that hole. That is when the improper transfers of customer money accelerated, according to the Commodity Futures Trading Commission’s complaint. Minutes after learning of the overdrawn account, Mr. Corzine told Ms. O’Brien that meeting the bank’s demands was “the most important thing” she could get “done that day. ” Ultimately, in the chaos and confusion of those final days, customer money was transferred to JPMorgan. And yet, Mr. Corzine was not accused of instructing Ms. O’Brien to use customer money for this purpose. According to court records submitted by his lawyers, Mr. Corzine was not told that the firm was at risk of violating the rules until the eve of the bankruptcy, after the breach had happened. In an email, Ms. O’Brien told Mr. Corzine that the transfer to JPMorgan was a “house wire,” meaning it came from the firm’s accounts. In the years since, Mr. Corzine has visited Central America for a humanitarian project and has traded with his own money. His philanthropic efforts have included working with Covenant House, a nonprofit focused on helping homeless children. “With this matter resolved,” he said, “I am eager to move forward and plan to spend my time focused on issues that have always been important in my life: my family, community and philanthropic causes, and markets. ”'"}, "time": 1742563563.4887168}