{"duration": 0.18903326988220215, "input_args": {"text": "'Just how   is Hillary Kerr, the    founder of a   digital media company in Los Angeles? She can tell you what song was playing five years ago on the jukebox at the bar where she somewhat randomly met the man who became her husband. It was “These Days,” the version sung by Nico, the German   made famous by Andy Warhol and the Velvet Underground. Actually, the song had been playing just before she met Jonathan Leahy, now 38, on that December night in 2011 at the 4100 Bar in the Silver Lake district of Los Angeles. Ms. Kerr can’t remember exactly what was playing when they met because at that moment she was jumping up and down “like Tigger,” as she put it. In answering the usual     questions, Mr. Leahy told her he was a music supervisor for “Girls,” the HBO show created by and starring Lena Dunham. That was enough to get Ms. Kerr bouncing. “Your music has changed my life!” she told Mr. Leahy. Mr. Leahy, who is quiet but not shy (at least he doesn’t jump up and down upon meeting people) was mesmerized. “My main reaction,” he said, “was it’s a lot easier to talk to beautiful women in a bar when you’re working on a hit show. ” They exchanged email addresses, more an act of politeness than promise. Then their soundtrack went quiet for almost a year. Both Mr. Leahy and Ms. Kerr had active social lives, but they were focused on their careers. Mr. Leahy, who grew up in Laconia, N. H. graduated from the College of William and Mary in Williamsburg, Va. in 2000 and landed in Los Angeles later that year. Now he is a music supervisor with Aperture Music and is joined by Manish Raval and Tom Wolfe in being responsible for the music on “Girls. ” The team has also worked on films including “Trainwreck” and television series such as “New Girl. ” In addition, Mr. Leahy is the music supervisor for “Survivor’s Remorse” on Starz. Ms. Kerr grew up in the La Jolla section of San Diego, graduated from the University of Southern California in 2000 and eventually made her way to New York, where she took a job as an assistant at Elle magazine. In 2005 she moved back to the West Coast, to Los Angeles, and with a fellow Elle alum,  Katherine Power, created a company best known for its website, Who What Wear, which casts an eye on celebrity culture and fashion it now has 13 million monthly unique visitors. Ms. Kerr and Ms. Power also started the Who What Wear clothing and accessories line sold at Target. It was nine months after their initial meeting that Mr. Leahy emailed Ms. Kerr. He had a friend who wanted to get into the fashion industry. Ms. Kerr, Mr. Leahy and his friend met for a long, boozy brunch. They began to email and text a bit. “There was banter,” Ms. Kerr said, but neither knew the interest or intention of the other. A few months later, she texted to ask if he could help her score a ticket to see the band Lord Huron. Mr. Leahy happens to be a friend of Ben Schneider, the band’s lead singer, and had an extra ticket. “This was one of those moments where the universe conspires to make you seem cooler than you actually are,” Mr. Leahy said. He and Ms. Kerr met up at the show. That is when Mr. Leahy and Ms. Kerr moved into the ambiguous “mixtape era,” in which for months they emailed and texted each other with coy “are we just friends or what” texts revolving around music. For example, Ms. Kerr was visiting New York and texted Mr. Leahy a request for “walking around SoHo music. ” He sent her a link to “Love Me Again,” by John Newman. It has a club vibe but romantic lyrics. “I wanted to read into it,” Ms. Kerr said, but she figured (correctly, it turns out) that her new friend was a bit of a clueless guy who didn’t spend much time thinking about how a woman might react to such a song being shared with her. Another time he emailed her a link to a Fleetwood Mac version of “Need Your Love So Bad. ” After listening to it, Ms. Kerr said, “I called my friend Katie. ” “At that time,” she continued, “I just referred to him as ‘the supervisor.’ She knew I had a crush on him. She said, ‘How can it not mean something? ’” Mr. Leahy acknowledged that it might be difficult for a person to think he was not sending Ms. Kerr a message with this song. “I sort of thought, ‘Maybe it’s too much. ’” But he shared it with her anyway. (This is the same man who sent her the song “BedBedBedBedBed, Vacationer Remix,” by Deleted Scenes, “during the friend phase,” Ms. Kerr said.) Ms. Kerr played the game, too. She made Mr. Leahy a mix CD (handwritten liner notes and all) that she titled “Feynman Diagrams for All,” after Mr. Leahy told her in a text conversation that he thought the idea of Feynman diagrams  —   in which physicists map out the interactions of subatomic particles  —   was romantic. On the mix, Ms. Kerr included the Mazzy Star song “I’ve Been Let Down. ” It was “a bit of an Easter egg of my actual feelings,” she said. Around this time, Ms. Kerr texted Mr. Leahy a photo of the drink menu from a bar,  the Roger Room. She had focused on a drink named for the song “Christmas Card From a Hooker in Minneapolis,” which happens to be Mr. Leahy’s favorite Tom Waits tune. “This made me rethink things a bit,” he said, adding, “Hillary Kerr was clearly not to be trifled with. ” In early 2014, Mr. Leahy invited her to a Bleachers concert. The band’s lead singer is Jack Antonoff, who is Ms. Dunham’s boyfriend. Ms. Dunham was at the concert as well, and on meeting Ms. Kerr, she said, “I’ve heard so much about you. ” Ms. Kerr and Mr. Leahy shared their first kiss that night. He proposed to her on Polihale Beach in Kauai, Hawaii, on Jan. 1, 2016. On Dec. 10, 125 friends and relatives gathered in Palm Springs, Calif. at the Colony Palms Hotel, which was opened in 1936 by the reputed mobster Al Wertheimer and whose poolside guests have included Frank Sinatra, Ronald Reagan, Kirk Douglas and Zsa Zsa Gabor. Ms. Kerr walked down a grassy aisle in a   courtyard wearing a structured lace Reem Acra dress, strapless with a bustier and a full skirt. Four musicians played “Once, With Feeling,” an instrumental song Mr. Leahy wrote for Ms. Kerr. . Just minutes into the cocktail reception, a few of Ms. Kerr’s best friends descended upon her. Jen Atkin, the celebrity hairstylist and social media star, started fussing with the flower she had sewn into the bride’s hair. Joey Maalouf, the celebrity makeup artist who is a creator of the       service the Glam App, whipped out a tube of lip gloss and reapplied it to the bride’s pucker. He had done her makeup. “The look we went for is sickeningly stunning and perfect,” he said. Guests mingled over drinks by the pool, which was framed by banquette tables lit from above by strings of bulbs. The sky turned pink before the stars appeared, and guests snapped photos and shared them with the hundreds of thousands who follow these members of the   illuminati (#imwithkerr and #letsgetleahyed). “This looks like it’s art directed,” Eva Chen, the head of fashion partnerships for Instagram, said as she took it all in. She had worked as an assistant at Elle with Ms. Kerr. Friends of both the bride and the groom celebrated what they saw as a great match, based on passion not only for each other but also for music. Leigh Belz Ray, the features and news director at InStyle, was another former Elle colleague who made the trip. “Hillary loves music, and it’s not just a casual thing,” Ms. Ray said. “We used to say the ultimate fantasy was to become a music director, and now she’s married to one. ” After a romantic first dance to Solomon Burke’s “If You Need Me,” Mr. and Mrs. Leahy (she will use her maiden name professionally) settled into several hours of serious dancing to songs spun by a D. J. And before they left for their Hawaiian honeymoon, Mr. Leahy completed his first important act as husband. He pulled together many of the songs that could be considered the soundtrack to their romance and made his wife a mixtape. When Dec. 10, 2016 Where Colony Palms Hotel, Palm Springs, Calif. Flora The bride and groom were married under a white birch trellis, because white birch is the state tree of New Hampshire, where Mr. Leahy grew up and where his parents, Richard and Marie Leahy, reside. The structure was wrapped in white peonies, Sahara roses and camellia greens. Readings Mr. Leahy’s family is Roman Catholic Ms. Kerr’s parents, John and Carole Kerr, are more spiritual than religiously observant. Many of the guests had an artistic bent. The bride and groom planned accordingly. Marshall Goldsmith, an executive coach, author and lifelong family friend of Ms. Kerr, officiated. Friends and relatives stood to read poems from James Kavanaugh and Mary Oliver, as well as a passage from the Supreme Court’s 2015 ruling legalizing   marriage. “A little Catholic priest, a little lesbian Pulitzer Prize winner, a little equal rights for all,” Ms. Kerr explained after the ceremony.'"}, "time": 1742563229.2681959}