{"duration": 0.047496795654296875, "input_args": {"text": "'Share This \\nDespite being dead for over 7 years, it seems that Michael Jackson’s name has just been dragged back into the spotlight once again. Unfortunately for his family, it looks like bad news for the star’s estate as a woman leaked the $900,000 sex secret he had kept quiet for a whopping 30 years – and she has proof. \\nMost people are aware of Jackson’s depraved past involving children – specifically, little boys. However, the most recent person to come forward is actually a woman, who states that the deceased star had molested and sexually assaulted her about 3 decades prior. \\nAccording to LA Times , “The alleged abuse started in 1986 and occurred in such iconic locations as Neverland Ranch, the set of ‘Moonwalker,’ Jackson’s Encino mansion, and in the back of the singer’s limousine, according to papers filed Tuesday in Los Angeles County Superior Court.” Unfortunately for the family and Jackson’s estate, her word isn’t all the accuser was armed with . Stock image of Michael Jackson’s “Neverland” ranch \\nAmong the court filings are scanned copies of checks purportedly paid to her from Jackson or his entertainment companies, which she says were issued to pay her off in exchange for her silence. In all, the checks totaled a whopping $900,000 – a damning number to say the least. \\nFurthermore, the largest sum, a check for $600,000, was dated in late 1993, which just so happens to be three months after Jackson found himself in yet another lawsuit, that time with a 13-year-old boy saying he had been molested by the King of Pop. Of course, the payment comes at a time where Jackson would have wanted to ensure that all of his other skeletons remained perfectly quiet in his closet. \\nOddly enough, this is the only time a female victim has come forward to allege a Jackson sexual assault. In addition to that, the woman’s lawyer, Vince Finaldi, said the case offers the first evidence that Jackson and his production company — not an insurance carrier — made direct payments to an alleged abuse victim. Michael Jackson (Source: LA Times ) \\nThe abuse allegedly lasted for over 3 years, beginning when the girl was merely 12 years old and ending just after her 15 th birthday. LA Times adds: \\nThe woman alleges that for about three years, Jackson fondled her, forced her to orally copulate him, and attempted to have sexual intercourse with her, which caused her to bleed, the lawsuit states. \\nJackson also supplied her with gifts and letters, and two of the notes were attached to the lawsuit. One of the letters ends, “I’m crazy about you. … All my love, Michael.” \\nOf course, the Jackson family lawyer is saying that the entire ordeal is a made-up claim meant to do nothing more than leech off of the star’s estate. As the woman – being a sex assault victim – and her identity are being kept quiet for the time being, it’s hard to say whether she’s looking for a payout or something more. \\nAlthough this man is dead and buried, and under most circumstances should be left to rest in peace, no sex assault victim should ever go without justice. Although money is a good way to buy silence, it certainly does not equate to anything near justice. In fact, it represents the exact opposite as it proves that if you have enough money, you can get away with anything – even sexually abusing a child. This woman deserves her day in court, and it certainly doesn’t look like the Jackson family is going to like the end result.'"}, "time": 1742561668.7525475}