{"duration": 0.039728403091430664, "input_args": {"text": "'NEW YORK CITY  —   Convicted terrorist Oscar López Rivera made his controversial appearance at the annual National Puerto Rican Day Parade Sunday  —   and was met by a mix of cheers and boos from the polarized crowd. [The parade had been overshadowed for months by the parade committee’s decision to honor López Rivera, a key member of the radical Marxist Armed Forces of National Liberation (FALN) in the seventies and eighties, who fought for Puerto Rican independence. The group conducted more than 100 bombings in the United States, killing five people, injuring dozens, and causing millions of dollars’ worth of damage. López Rivera was convicted.  President Obama commuted López Rivera’s sentence, and he was released this year after serving 35 years for transporting guns and bomb materials. The committee’s decision to honor the militant as a “national freedom hero” led a wealth of sponsors,  including   the New York Yankees, and Univisión, to pull out, along with NYPD and FDNY officials and Democratic Gov. Andrew Cuomo. López Rivera, who has denied being a terrorist, eventually said he would forgo the honor but would march as a “humble Puerto Rican and grandfather. ” But the New York Daily News  reported that, while some at the parade cheered López Rivera and held signs calling him “our Mandela,” others booed and jeered the convicted terrorist. According to the paper, one Bronx resident yelled, “Fuck Oscar! Fuck him! He’s no hero!” as the   leader passed. Nearby cops reportedly shook their heads in agreement. Several cops gave López Rivera and Democratic City Council Speaker Melissa   who was on the float with him,  “sour looks,” according to the Daily News. “I wouldn’t be here if I wasn’t working. We gotta do our jobs, man,” said one officer. “This really pisses me off,” Bronx resident Mark Rivera told the New York Post. “This is a day for honoring the Republic of Puerto Rico, not honoring a terrorist. This man has no place in our parade. He makes me ashamed to be a Puerto Rican. ” Adam Shaw is a politics reporter for Breitbart News based in New York. Follow Adam on Twitter: @AdamShawNY.'"}, "time": 1742562027.2419426}