{"duration": 0.0382840633392334, "input_args": {"text": "'In a    interview with the Washington Post’s Daily 2020 Live on Tuesday, Hillary Clinton’s former campaign chief John Podesta said he does not see any indication that President Donald Trump will be impeached, despite the fact that so many in his party are calling for it. [“I see no sign that there’s any likelihood that he’ll be impeached,” Podesta, who recently joined the Washington Post as a columnist, told the publication’s Karen Tumulty. Issuing an indirect testament to the loyalty of the GOP, Podesta added:  The Republican leadership has decided we’re in the boat with him, and the boat’s gonna sink, and we’re gonna sink with it. But we can’t really throw him out of the boat. So they’ve decided to, as I’ve said before, velcro their fate to him. I think they must be waking up in a sweat at night thinking about what the prospects of that are, but I think there’s no chance that the House would mount the kind of serious investigation that would lead to impeachment. Rep. Maxine Waters ( ) has been openly leading calls for the president to be impeached. Several Democrats have invoked the 25th Amendment as a springboard to introduce legislation that would allow former presidents and vice presidents to determine if Trump is mentally unfit for office. Addressing Tumulty’s question on the 25th Amendment, Podesta said, “Do you really think Mike Pence and Betsy DeVos are going to sign that paper relieving the president of his duty? I don’t see that either. ” In an interview with Breitbart News, Los   cardiologist and internist Dr. Afshine Emrani said he thinks it is wrong for people, and especially politicians, to “belittle mental illness because they have a political agenda,” adding, “psychiatric   and bullying is against their professional code. They should be exposed for what they are. I can guarantee an overwhelming majority of them voted against Trump. ” Adelle Nazarian is a politics and national security reporter for Breitbart News. Follow her on Facebook and Twitter.'"}, "time": 1742562076.7114549}