{"duration": 0.04689812660217285, "input_args": {"text": "'As a filmmaker, Alexandra Pelosi is a friendly Michael Moore. Or maybe a Michael Moore who went to finishing school and learned how to charm rather than intimidate the people she talks to. In “Meet the Donors: Does Money Talk? ,” her 10th documentary for HBO (where it makes its premiere on Monday) she’s often in the frame, and her appearances grow more frequent as the hourlong film progresses. A characteristic shot is of Ms. Pelosi conducting an interview while holding a camera herself  —   a selfie by proxy  —   so that we can see her while she playfully hectors her subjects. Those interviewees are mostly rich white men who donate enormous amounts to political, specifically presidential, campaigns. You may think that “Does Money Talk?” is missing a “Duh!” at the end, and watching the film won’t change your mind, as Ms. Pelosi asks one financier after another why he gives away so much money and hears a series of variations on “because it’s the right thing to do. ” But investigation isn’t what Ms. Pelosi’s film is really about. As in earlier works like “Journeys With George” and “Diary of a Political Tourist,” she uses her sense of the absurd and her access  —   gained in part through her status as a daughter of the California congresswoman Nancy Pelosi  —   to present the American political system as a mostly lighthearted farce. She’s worried about what’s going on, but her tone is more    than   . More than half the film is taken up with her series of interviews with “megadonors” to both parties, who disburse the money they’ve made in finance, oil, broadcasting and other industries. Some of them are evidently serious thinkers committed to sincere ideologies, but the film perks up when Ms. Pelosi zeros in on unbridled ego or vanity. Foster Friess, a Republican donor intent on “restoring the   value system that made our country great,” acknowledges his detractors and   compares his tribulations to those of Jesus. The New York grocery mogul John Catsimatidis, an   giver, positively glows as he shows off his wall of photos of presidential candidates visiting his apartment. There is periodic affirmation that giving millions of dollars to politicians gets your phone calls answered, and a few stark admissions that money gets laws made and regulations rewritten. (These tend to involve anecdotes about the Koch brothers, who declined to be interviewed.) But even the biggest fish Ms. Pelosi interviews project a rueful sense of being small cogs in the machine, and in a brief coda she agrees with them, hurriedly making the point that real power lies with lobbyists and industry consortiums, not rich individuals. Ms. Pelosi begins “Meet the Donors” with scenes of Jimmy Stewart as the   senator in “Mr. Smith Goes to Washington” and ends it with archival,    film of people voting. She’s invoking a   ad,     era, but it leaves her sounding a little like the megadonors she interviews, who uniformly couch their giving as an attempt to reinforce “traditional” American values. We could all get along if we could all just live in the past.'"}, "time": 1742564044.1505537}