{"duration": 0.07587647438049316, "input_args": {"text": "'House Minority Leader Nancy Pelosi told a Lebanese Muslim immigrant Trump’s executive order permanently banning Syrian refugee resettlement “has not made us more safe,” calling it “reckless. ”[“You opposed President Trump’s plan to stop refugees from coming to the U. S.,” said Nedal Tamer to Pelosi during Tuesday’s town hall hosted on CNN. “Countries like Syria. I am Lebanese American Muslim. There are countries that harbor radical Islamic groups, and [teach] teenagers to hate anyone who is not Muslim. ”  That’s all it takes for some to “come as a refugee and create a problem here,” Tamer continued. “How can you guarantee the safety for all Americans  …     If we let these refugees to come [in]?” Every refugee or “newcomer” who arrives in the U. S. with “hopes, dreams, aspirations” makes “America more American,” Pelosi said. “The reason I oppose this specific thing that President Trump did was the following: Refugees have the most stringent vetting of all newcomers to our country. The most stringent vetting,” she said. “And so, when he cuts off Syria, largely those are refugees coming, the most stringent vetting. We take an oath to support the American people and the Constitution of the United States. It’s our responsibility. So we’re not casual about our reasons to, our need to protect the American people. ” “But we have to be strong, and we have to be smart. We don’t have to be reckless and rash,” she said. “And we don’t have to discriminate against people because of their religion. And so, that’s why I oppose what he’s done with the seven countries. He has no case, in my view, with the refugees. ” While thanking Tamer for his question, Pelosi also revealed she believed that billions of foreigners around the world have a “right” to emigrate to America, a common leftist talking point. She said she had visited Lebanon and hoped “the way things go, I hope people can enjoy staying home and enjoying their lives there, as well as exercising the right to come to America. ” Trump’s executive order “has not made us more safe,” Pelosi told Tamer. Tamer has been profiled by the media before: He’s a   Lebanese Muslim immigrant living with his wife and children in heavily Muslim Dearborn, Michigan, where he works in real estate. Last April, The New York Post quoted his praise of Trump and his proposals to control immigration: “I like the fact that he’s a little nuts. He’s got the good heart, he cares about America. ” In another interview last May, Tamer strongly opposed further Islamic immigration into the U. S.: “We don’t want these groups to come in here, or anyone with these refugee groups to come in here, and create any problem here,” he said to Al Arabiya English. “We’re going to pay the price, and that’s why the Muslim community and the Arab community have got to understand, every time we step forwards, we take 10 steps back because of these problems. ” “If you love this country, then you support this man. I will say this to any Arabic Muslim: if you love this country then you support this man,” Tamer added.'"}, "time": 1742563788.8682785}