{"duration": 0.09016895294189453, "input_args": {"text": "'I’m not part of Disney’s target audience for its latest princess movie, “Moana,” but I don’t care. I’ve been excited about this film since Dwayne Johnson previewed it last year at the D23 Expo for all things Disney. As much as the new   Miranda music sounds promising, what’s really exciting is the chance to see a Disney princess who doesn’t look like those we have already. I was already aging out of the children’s movie demographic when my mom took us to see Robert Rodriguez’s “Spy Kids” in 2001. Yes, it was a silly story: Children turn into spies to save their   agent parents. But my sister and I became obsessed. The suave   father was played by Antonio Banderas with a pronounced Spanish accent. The children were named Carmen and Juni (Alexa Vega and Daryl Sabara) and the implication was that they were   or   Americans. As a daughter of Cuban immigrants who once struggled with her accent, I had never seen characters who looked or sounded like us as the heroes of their own story. “Spy Kids” is still one of the few positive examples I hold onto, 15 years later. I’m not alone. There are many nonwhite women and girls who don’t see movie characters who look the way they do, and the omission can affect their  . That’s why the issue of diversity in movies for young people is just as important as pushing for inclusion across Hollywood, both behind, and in front of, the camera. So much of nonwhite representation in cinema is trivial at best, stereotypical at worst  —   the wisecracking sidekick or the background player stuck there as a token. I remembered feeling that something was amiss about Tito the Chihuahua in Disney’s “Oliver   Company” (1988). Why did the only dog with a Mexican accent (voiced by Cheech Marin, who has a less embarrassing part in “Spy Kids”) have to   cars? I wanted to see more of the mechanic tomboy Audrey Ramirez (Jacqueline Obradors) in “Atlantis: The Lost Empire” (2001) and wished I could forget that “Cars” (2006) has a barely visible lowrider named Ramone (Mr. Marin, again) that happens to be the only vehicle in Radiator Springs with hydraulics. I forgot that “The Emperor’s New Groove” (2000) was set in the Inca Empire, because none of the main voice actors (David Spade, John Goodman, Eartha Kitt and Patrick Warburton) sounded as if they spoke our language. Yet one of the   videos in our home was “The Three Caballeros,” a Disney animated guide to South America from 1944. Donald Duck is the American protagonist, joined by the Mexican rooster Panchito (Joaquin Garay) and the Brazilian parrot José (José Oliveira) on a   tour of Latin America. More than just a Technicolor spectacle (akin to “Fantasia,” in terms of trippy animated musical sequences) “The Three Caballeros” was a cultural explainer that didn’t entirely reduce our stories to cheap tropes. As an indirect product of the Good Neighbor Policy, by which the United States invested in South American ties, the movie had incentive to avoid negative portrayals. When it came to Disney princess movies, my sister and I had very different experiences. It was always easier to find a princess who looked the way I do, because I was born with much paler skin than anyone in our family. My younger sister, Cristina, didn’t decide to be Jasmine from “Aladdin” during playtime friends assigned her the character. Back then, that was the animated figure that looked closest to her, and she didn’t have many others to choose from. Luckily, the Disney renaissance of the 1990s gave us many more diverse heroines to treasure. Cristina adored Pocahontas’s free spirit and modeled herself on the strong Mulan. But they often weren’t the main princesses featured in Disney advertising or merchandise. And once their movies faded from store shelves, so would the dolls and the rest of their products. In those days, the newer princesses weren’t stocked   like those of the classic era: Snow White, Cinderella, Aurora from “Sleeping Beauty. ” In this sense, “Moana” is another step in the right direction. Native Hawaiians are entering a rarefied pop culture circle, inclusion in a movie that will reach viewers around the world. Considering how women, and especially women of color, are rarely shown as leaders onscreen, this is no small victory. The evolving arc of Disney princesses  —   from the damsel in distress Snow White in 1937 to the entrepreneurial dreamer Tiana in “The Princess and the Frog” in 2009  —   gives hope that we’ll see more animated stories starring young female characters who look as if they could be from anywhere around the world. Then again, no tickets have been sold to a Disney movie starring a Latina princess. She doesn’t exist yet. The company started a TV show, “Elena of Avalor,” about such a character, but that series lacks the production values and marketing heft of a   movie. It seems like a halfhearted concession to Latinas  —   half a Disney princess  —   but it’s more than other girls still waiting to see themselves on the big screen have received. There are many still waiting for a “Moana” to call their own, a movie to pass on to their children that speaks to them about their culture. My sister ended up working for a few months this year as a performer at one of Disney’s theme parks. After several frustrating auditions, she was told she was too dark to play any character not covered in fur. She tried out to greet guests as Elena of Avalor, and she received the same answer: too dark. (She ended up playing characters while fully covered in costumes.) Not even as an adult does she fit in Disney’s kingdom. But I’m hoping that those days are numbered, and that she and other women and girls like her will never have to feel as if they didn’t belong in the Happiest Place on Earth.'"}, "time": 1742564328.5422466}