{"duration": 0.044283390045166016, "input_args": {"text": "'A strong earthquake struck Japan on Nov. 21, 2016, at about 20:59 UTC, also causing the issuance of a tsunami alert. The United States Geological Survey has reported that a magnitude 6.9 quake, originally reported as a level 7.3 tremor, struck near Honshu. This is on the country’s east coast. The seismic activity was geographically located at 37.392 north latitude and 141.404 east longitude.\\nThis quake was near Fukushima region and arose from about six miles deep in the earth. The closest area was the city of Namie, about 150 miles northeast of Tokyo.\\nThe location of the strong earthquake that rocked Japan caused a tsunami alert to be issued. Namie lies almost directly on the Pacific coast. Initial reports about the strong earthquake that rocked Japan and caused the tsunami alert have not been accompanied by reports of casualties, although reports may be scarce. At the time of publication, no further information was available.\\nEarthquakes are generalized as minor to great. Any tremor of a magnitude between 6.0 and 6.9 is considered strong and capable of doing much damage in populated areas. Despite the quake severity, scientific estimates reveal about 100 of these occurring each year throughout the world.\\nThe movement of the earth can create a tsunami or tidal wave. The National Weather Service Pacific Tsunami Warning Center in Hawaii issued the alert. Estimates are that waves could reach up to one meter above tide level. Uncertainties exist in providing a more accurate forecast because of local weather situations and oceanic conditions that cannot be adequately accounted for, such as reefs and atolls.\\nWritten by Bob Reinhard\\nEdited by Cathy Milne\\nSources:\\nUnited States Geological Survey: M6.9 – Near the East Coast of Honshu, Japan (Updated)\\nPacific Tsunami Warning Center, Ewa Beach HI: Tsunami Threat Message\\nMichigan Tech University: Earthquake Magnitude Scale/Classes\\nPhoto Courtesy of Bryan Jones’ Flickr Page – Creative Commons License    earthquake , fukushima , Japan , tsunami'"}, "time": 1742562072.8140295}