{"duration": 0.07244372367858887, "input_args": {"text": "'DUBLIN  —   An assembly of Irish citizens convened by Parliament is considering changes to one of the most divisive policies in the country: the   ban on abortions, which has been enshrined in Ireland’s Constitution since 1983. The group, a   Citizens’ Assembly led by Mary Laffoy, a Supreme Court judge, does not have the power to change the law. But its mandate from Parliament  —   to examine the full range of medical, legal and ethical issues surrounding abortion  —   suggests a willingness to revisit the ban, one of the most stringent in the Western world. Over the last three months, the assembly has received more than 13, 500 comments from the public  —   more than 1, 000 of which have been published online so far. It pored over these submissions at the Grand Hotel Malahide over the weekend, along with testimony from experts, and is scheduled to issue a report later this year. Abortion was already illegal in Ireland before 1983, but the Eighth Amendment gave “the right to life of the unborn” equal status to “the right to life of the mother” under the Constitution. The amendment was enacted through a voter referendum, and can be altered  —   or abandoned  —   only via another referendum. Several highly publicized cases since then have contributed to and reflected a shift in the public’s mood, however. In 2012, a    woman, Savita Halappanavar, died from septic shock while having a miscarriage, after a hospital denied her an abortion that might have saved her life. And last year, a United Nations committee ruled that Ireland had violated a woman’s rights by forcing her to travel abroad for an abortion even though severe congenital defects had been diagnosed in the fetus. Legal uncertainty over how to define “the unborn” has long dogged the amendment, and the assembly was seen as one response to the panel’s criticisms. It is common for women in Ireland to travel to countries such as Britain and the Netherlands for abortions. Figures from Britain’s National Health Service showed that more than 3, 400 women gave Irish addresses to British abortions clinics in 2015. That said, Ireland remains a conservative society, and the Roman Catholic Church opposes any change in the law. “We believe that every unborn child, irrespective of his or her medical condition or the circumstances of his or her birth, has the right to be treated equally before the law,” the bishops’ conference said in a statement. Submissions posted online expressed a wide range of views, with many of them offering deeply personal perspectives. Leslie Spillane, a woman in her 20s from Cork, in southwestern Ireland, wrote that several of her friends had traveled abroad to terminate their pregnancies. “These friends of mine are also the lucky ones, they have been able to borrow the money for the travel, and they have had friends they could tell,” she wrote. “Abortions happen, everyday. Making them illegal doesn’t stop woman needing, or wanting them, or inflicting them on themselves  —   there will always be coat hangers, broken bottles, painkillers, stairs to fall down, fists to hit, medicines to swallow. ” In a phone interview, she said that “even if you don’t agree with abortion, it’s not morally acceptable to force your views onto others. ” Defenders of the law were equally adamant. “Abortion, in our firm belief, is the taking of human life irrespective of the stage of pregnancy,” wrote Kathleen Gleeson and her husband, Raymond Gleeson, from County Kerry, in southwestern Ireland. Valerie Marjoram, a woman in her 30s in County Kildare, just west of Dublin, described herself as a feminist who opposed abortion on religious grounds. “I find it appalling that a certain brand of feminism would put more effort into obtaining the legal sanction of murdering one’s own child than fighting for the right to carry a child to term without losing one’s pay, career path, promotion, college place,” she said in a phone interview. “The fact that abortion is legal in any country has led to a culture of selfishness where even life can be rescheduled if it happens at the ‘wrong time. ’” The Eighth Amendment has been subject to legal and political challenges over the years. In 1992, Ireland’s highest court upheld the right to an abortion if the mother’s life is at risk, including from suicide, but how to interpret that right remains in dispute. In 1992, voters approved an amendment to the Constitution to allow women to travel abroad for abortions and to receive information about abortion services abroad. And in that year, and again in 2002, voters rejected amendments that would have removed the threat of suicide as grounds for a legal abortion. Conor O’Mahony, a lecturer in law at University College Cork, says the continued contentiousness reveals problems with the wording of the ban. “The Eighth Amendment doesn’t work as a means of regulating abortion, whether you are coming from the   or abortion rights perspective,” he said in a phone interview. “And the evidence I would give you is that neither side has ever been happy with how that amendment has been interpreted and applied over the years. ” He said that public opinion had been gradually shifting in favor of legalizing abortion  —   particularly in cases involving severe fetal abnormalities or rape  —   but predicted that the debate would continue for years even if a referendum was to take place in the near future. Gerard Whyte, a professor of law at Trinity College Dublin, said in a phone interview that it would be unwise to simply repeal the amendment, as some   advocates seek. “If there is no constitutional protection for the unborn, then there is a problem and we’re into uncharted territory,” he said. “I’m simply warning about a situation whereby people decide to repeal the Eighth but don’t add anything else. ”'"}, "time": 1742561766.0779257}