{"duration": 0.0709373950958252, "input_args": {"text": "'November 6, 2016 Greatest Basketball Player Of Our Era To Help First Woman President Beat Biggest Asshole Of All Time Google Pinterest Digg Linkedin Reddit Stumbleupon Print Delicious Pocket Tumblr \\nHe is perhaps the greatest basketball player of all time, certainly of the current era, and he’s with her. \\nCleveland’s LeBron James has announced that he will be stumping for Hillary when she makes a stop in the crucial city in one of the most hotly contested battleground states in the country. James and Clinton will appear together at a get-out-the-vote rally at the Public Auditorium in Cleveland, Ohio in the late afternoon. This will be James’s first appearance with Clinton. In fact, a source says, the two have never met. James – a hero to many Ohio sports fans, especially in the African American community – could prove helpful to Clinton’s effort to win the state’s 18 electoral votes. While Clinton is handily beating Donald Trump among African American voters, she is struggling to gin up enthusiasm. According to the 2010 census, 53 percent of Clevelanders are African American. \\nThe stakes could not be higher. If Clinton can win Ohio, there is almost no scenario in which Trump can win. If Ohio goes for Trump, then he has a real shot of becoming president. As Ohio’s biggest star (sorry, John Kasich), James has a lot of power to motivate people to get out and vote. It could be a difference-maker in a tight election. \\nJames’ decision to stump with Hillary comes after other big-name celebrities publicly expressed their support for her campaign. Just days ago, musical power couple Beyonce and Jay Z held a concert in support of Clinton. The star power has spooked Trump’s campaign, as evidenced by the fact that they are claiming the celebrities backing Hillary give her an “unfair” advantage. Trump, a man who once okay’d a DJ calling his daughter a “piece of ass” and who bragged about grabbing women “by the pussy,” went so far as to lament the language used in some of Jay Z’s songs. \\n“He used every word in the book last night,” Trump said. “He used language last night that was so bad and then Hillary said, ‘I did not like Donald Trump’s lewd language.’ My lewd language. I tell you what, I’ve never said what he said in my life.” \\nEye roll. \\nMeanwhile, in related news, Trump will be campaigning with his own star power tonight. The cream of the crop. The best of the best. The A-lister…Ted Nugent. A man who once “ joked ” about shooting Hillary Clinton with a machine gun. \\n“Obama, he’s a piece of shit. I told him to suck on my machine gun. Hey Hillary,” he continued. “You might want to ride one of these into the sunset, you worthless bitch.” \\nYeah, Trump sure seems concerned about what language musicians use. \\nFeatured image via Jamie Sabau/Getty Images Share this Article!'"}, "time": 1742564081.5988994}