{"duration": 0.407611608505249, "input_args": {"text": "'VOROKHOBINO, Russia  —   A dedicated pacifist who has never even held a gun, Andrei Sivak discovered that his government considered him a dangerous extremist when he tried to change some money and the teller “suddenly looked up at me with a face full of fear. ” His name had popped up on the exchange bureau’s computer system, along with those of members of Al Qaeda, the Islamic State and other militant groups responsible for shocking acts of violence. The only group the    father of three has ever belonged to, however, is Jehovah’s Witnesses, a Christian denomination committed to the belief that the Bible must be taken literally, particularly its injunction “Thou shalt not kill. ” Yet, in a throwback to the days of the Soviet Union, when Jehovah’s Witnesses were hounded as spies and malcontents by the K. G. B. the denomination is at the center of an escalating campaign by the authorities to curtail religious groups that compete with the Russian Orthodox Church and that challenge President Vladimir V. Putin’s efforts to rally the country behind traditional and often militaristic patriotic values. The Justice Ministry, in a preliminary adminstrative strike last month, put the headquarters of Jehovah’s Witnesses in Russia, an office complex near St. Petersburg, on a list of the bodies banned “in connection with the carrying out of extremist activities. ” Whether it stays there will depend on Russia’s Supreme Court, which is scheduled to meet on Wednesday to hear a request from the Justice Ministry to outlaw the religious organization and stop its more than 170, 000 Russian members from spreading “extremist” texts. Extremism, as defined by a law passed in 2002 but amended and expanded several times since, has become a catchall charge that can be deployed against just about anybody, as it has been against some of those involved in recent   protests in Moscow and scores of other cities. Several students who took part in demonstrations in the Siberian city of Tomsk are now being investigated by a special   unit, while Leonid Volkov, the senior aide to the jailed protest leader Aleksei A. Navalny, said he himself was detained last week under the extremism law. In the case of Jehovah’s Witnesses, the putative extremism seems to derive mostly from the group’s absolute opposition to violence, a stand that infuriated Soviet and now Russian authorities whose legitimacy rests in large part on the celebration of martial triumphs, most notably over Nazi Germany in World War II but also over rebels in Syria. Jehovah’s Witnesses, members of a denomination founded in the United States in the 19th century and active in Russia for more than 100 years, refuse military service, do not vote and view God as the only true leader. They shun the patriotic festivals promoted with gusto by the Kremlin, like the annual celebration of victory in 1945 and recent events to celebrate the annexation of Crimea in March 2014. Mr. Sivak, who says he lost his job as a physical education teacher because of his role as a Jehovah’s Witnesses elder, said he voted for Mr. Putin in 2000, three years before joining the denomination. He added that while he had not voted since, nor had he supported   activities of the sort that usually attract the attention of Russia’s   version of the K. G. B. the Federal Security Service, or F. S. B. “I have absolutely no interest in politics,” he said during a recent Jehovah’s Witnesses Friday service in a wooden country house in Vorokhobino, a   village north of Moscow. Around 100 worshipers crammed into a long, chilly room under fluorescent lights to listen to readings from the Bible, sing and watch a video advising them to dress for worship as they would for a meeting with the president. “From the Russian state’s perspective, Jehovah’s Witnesses are completely separate,” said Geraldine Fagan, the author of “Believing in Russia  —   Religious Policy After Communism. ” She added, “They don’t get involved in politics, but this is itself seen as a suspicious political deviation. ” “The idea of independent and public religious activity that is completely outside the control of  —   and also indifferent to  —   the state sets all sorts of alarm bells ringing in the Orthodox Church and the security services,” she said. That the worldwide headquarters of Jehovah’s Witnesses is in the United States and that its publications are mostly prepared there, Ms. Fagan added, “all adds up to a big conspiracy theory” for the increasingly assertive F. S. B. For Mr. Sivak, it has added up to a long legal nightmare. His troubles began, he said, when undercover security officers posed as worshipers and secretly filmed a service where he was helping to officiate in 2010. Accused of “inciting hatred and disparaging the human dignity of citizens,” he was put on trial for extremism along with a second elder, Vyacheslav Stepanov, 40. The prosecutor’s case, heard by a municipal court in Sergiyev Posad, a center of the Russian Orthodox Church, produced no evidence of extremism and focused instead on the insufficient patriotism of Jehovah’s Witnesses. “Their disregard for the state,” a report prepared for the prosecution said, “erodes any sense of civic affiliation and promotes the destruction of national and state security. ” In a ruling last year, the court found the two men not guilty, and their ordeal seemed over  —   until Mr. Sivak tried to change money and was told that he had been placed on a list of “terrorists and extremists. ” He and Mr. Stepanov now face new charges of extremism and are to appear before a regional court this month. “There is a big wave of repression breaking,” Mr. Stepanov said. In response to written questions, the Justice Ministry in Moscow said a yearlong review of documents at the Jehovah’s Witnesses “administrative center” near St. Petersburg had uncovered violations of a Russian law banning extremism. As a result, it added, the center should be “liquidated,” along with nearly 400 locally registered branches of the group and other structures. For the denomination’s leaders in Russia, the sharp escalation in a long campaign of harassment, previously driven mostly by local officials, drew horrifying flashbacks to the Soviet era. Vasily Kalin, the chairman of Jehovah’s Witnesses’ Russian arm, recalled that his whole family had been deported to Siberia when he was a child. “It is sad and reprehensible that my children and grandchildren should be facing a similar fate,” he said. “Never did I expect that we would again face the threat of religious persecution in modern Russia. ” In Russia, as in many countries, the    proselytizing of Jehovah’s Witnesses often causes irritation, and their theological idiosyncrasies disturb many mainstream Christians. The group has also been widely criticized for saying that the Bible prohibits blood transfusions. But it has never promoted violent or even peaceful political resistance. “I cannot imagine that anyone really thinks they are a threat,” said Alexander Verkhovsky, director of the SOVA Center for Information and Analysis, which monitors extremism in Russia. “But they are seen as a good target. They are pacifists, so they cannot be radicalized, no matter what you do to them. They can be used to send a message. ” That message, it would seem, is that everyone needs to get with the Putin program  —   or risk being branded as an extremist for displaying indifference, never mind hostility, to the Kremlin’s drive to make Russia a great power again. “A big reason they are being targeted is simply that they are an easy target,” Ms. Fagan said. “They don’t vote, so nobody is going to lose votes by attacking them. ” Attacking Jehovah’s Witnesses also sends a signal that even the mildest deviation from the norm, if proclaimed publicly and insistently, can be punished under the   law, which was passed after Russia’s second war in Chechnya and the Sept. 11 attacks in the United States. Billed as a move by Russia to join a worldwide struggle against terrorism, the law prohibited “incitement of racial, national or religious strife, and social hatred associated with violence or calls for violence. ” But the reference to violence was later deleted, opening the way for the authorities to classify as extremist any group claiming to offer a unique, true path to religious or political salvation. Even the Russian Orthodox Church has sometimes fallen afoul of the law: The slogan “Orthodoxy or Death!”  —   a rallying cry embraced by some   believers  —   has been banned as an illegal extremist text. To help protect the Orthodox Church and other established religions, Parliament passed a law in 2015 to exempt the Bible and the Quran, as well as Jewish and Buddhist scripture, from charges of extremism based on their claims to offer the only true faith. The main impetus for the current crackdown, however, appears to come from the security services, not the Orthodox Church. Roman Lunkin, director of the Institute of Religion and Law, a Moscow research group, described it as “part of a broad policy of suppressing all nongovernmental organizations” that has gained particular force because of the highly centralized structure of Jehovah’s Witnesses under a worldwide leadership based in the United States. “They are controlled from outside Russia, and this is very suspicious for our secret services,” he said. “They don’t like having an organization that they do not and cannot control. ” Artyom Grigoryan, a former Jehovah’s Witness who used to work at the group’s Russian headquarters but who now follows the Orthodox Church, said the organization had “many positive elements,” like its ban on excessive drinking, smoking and other unhealthy habits. All the same, he said it deserved to be treated with suspicion. “Look at it from the view of the state,” he said. “Here is an organization that is run from America, that gets financing from abroad, and whose members don’t serve in the army and don’t vote. ” Estranged from his parents, who are still members and view his departure as sinful, he said Jehovah’s Witnesses broke up families and “in the logic of the state, it presents a threat. ” He added, “I am not saying this is real or not, but it needs to be checked by objective experts. ” Mr. Sivak, now preparing for yet another trial, said that he had always tried to follow the law and that he respected the state, but could not put its interests above the commands of his faith. “They say I am a terrorist,” he said, “but all I ever wanted to do was to get people to pay attention to the Bible. ”'"}, "time": 1742561625.5481653}