{"duration": 0.06560111045837402, "input_args": {"text": "'Biased? Probably. Oppositional? Maybe. Essential? In theory. But the enemy? Not so much. President Trump last week called the news media “the enemy of the American people. ” But in interviews around the country this week, Americans of varying political affiliations, even those with serious misgivings about the media, largely allowed that the president’s characterization had gone too far. “I think that was a bit much,” said Mark Huizingh, 67, a Trump supporter and furniture store owner in Grand Rapids, Mich. “That was a little too strong. ” Mr. Trump’s presidency has exacerbated already deep ideological divisions in the country, and Americans on one end of the political spectrum increasingly find themselves unable even to look their counterparts in the eye. But if there has been one instance in the last month when the rift has not seemed quite as large, perhaps it has been the response to Mr. Trump’s harsh rebuke of the media. Still, the feeling toward the news media among those interviewed was far from warm and fuzzy. Many said they believed the media was flawed in general, and certainly when it came to the coverage of Mr. Trump and his administration. “Trump may be exaggerating,” said Jodi Littell, 55, an English teacher from Miami, who was strolling around a shopping center with her husband. But, she added, “to some degree he’s right that the media is out to get him. ” Mr. Trump’s attempts to demonize the mainstream media are nothing new. He has referred to the news media as the “opposition party” and repeatedly called legitimate news organizations “fake news. ” He and his aides have also consistently attacked the media’s credibility, calling out factual mistakes made by organizations sometimes even after corrections were made. But if the tactics were meant to convince the public that the media was a deceitful adversary, they did not appear to be having quite the desired effect. According to a Quinnipiac University poll released on Wednesday, 61 percent of respondents said they disapproved of the way Mr. Trump talked about the media.   percent said they trusted the media more to tell the truth about important issues, while 37 percent said they trusted Mr. Trump more to do so. The political divide, however, is stark: Among Democrats, 86 percent said they trusted the media more to tell the truth, while 78 percent of Republicans said they trusted Mr. Trump more. A Fox News poll released last week showed respondents about evenly divided on whom they trusted more to tell the truth. “Nobody is perfect,” said Nick Lortie, 24, a plumber from Merrimack, N. H. who voted for the Libertarian candidate, Gary Johnson, in the presidential election. “It’s like if the weatherman says it’s going to rain and it doesn’t  —   if someone tells them something and it turns out to be wrong, it’s not their fault,” he said, referring to the media. Charles Mellison Jr. 77, a retired   truck driver and registered Democrat in Miami, said he thought Mr. Trump’s comments were intended to “throw people off. ” “He should be more respectful,” he added, as he sipped a cup of coffee. “The media are not liars. ” Rick Rutter, 56, a pastor and executive director of a local rescue mission from Nashua, N. H. chuckled at the idea that the media was the enemy of the American people. But he, like many others interviewed, said he did see a litany of problems with the press. “It’s like that quote,” he said. “‘If you don’t read the paper, you’re uninformed. If you do, you’re misinformed. ’” The news media, however, was acting like an enemy in at least one respect: It was exhausting him. During the   to the election, Mr. Rutter said, he had cut the cord in part because keeping up with different interpretations of current events on television had become fruitless. Not everyone was so quick to dismiss Mr. Trump’s comments as outlandish, however. (Half of the respondents to the Quinnipiac poll said they disapproved of the media’s coverage of Mr. Trump.) “I think it’s right and wrong,” Ted Friedman, 59, a   furniture upholsterer in Grand Rapids, said about likening the media to the enemy. “I think the media definitely is out there to stir the pot up and see what comes out of it. ” But he added that his complaints were directed at national news outlets, not his local media. “I think what we’re seeing in the mainstream  —   we’re talking CNN, Fox and so forth  —   I think we’re seeing the kids are on the playground,” he said. “Donald Trump’s on the playground, the media’s on the playground, and they’re all fighting for that one little swing. ” Gary Abernathy, 61, the editor and publisher of The   in Hillsboro, Ohio, which endorsed Mr. Trump for president, said part of the problem with the mainstream media’s coverage of Mr. Trump was that reporters at major newspapers ”don’t really get other parts of the country. ” “I do think it’s a failure to understand, and also a failure to respect the opinions of Trump voters,” he said. “I’m just a big believer in good journalism, and that’s what I hate seeing fall by the wayside in the coverage of Trump,” he added. “I think Trump should be critically covered, but he should be covered with fairness  —   not with animosity, not with a point of view. You want the press to simply be fair. ” Often, a negative perception of the media reflected a deeper frustration with coverage unrelated to coverage of Mr. Trump. “Holy moly  —   in my opinion, I believe they’re pretty biased,” Amber McDowell, 37, who owns a flower shop in Broadus, Mont. said about the news media. Still, Ms. McDowell, a registered Republican who said she had never voted for a Democrat in a presidential election, said she “wouldn’t go as far as ‘the enemy’ ” in describing the news media. “It’s just a lot of the bad events. You don’t ever see any of the good stuff with the soldiers and the good stuff with the police,” she said, adding, “In small town U. S. A. I believe that’s probably how a lot of us feel. ” Charles Funderburk, 46, a contractor in Little Rock, Ark. and a conservative Republican, said he felt he was “only getting  ” from the news media. “The media has its own agenda, just like the Democrats and Republicans do,” he said, as he loaded supplies into his pickup truck at Home Depot. “They want to tell us what they want to tell us when they want to tell us, if they want to tell us. ” Cindy Lyons, 40, who helps her husband run a tent rental business in Grand Rapids, also stopped short of siding with Mr. Trump’s characterization of the media but allowed that he might not be that far afield. “I don’t know if I agree with it, but I see where it’s coming from,” she said. Ms. Lyons, a mother of five boys who described herself as “kind of in the middle” in terms of her political leanings, said that while she did not think the media was untruthful, she, too, was put off by the frequent negative coverage. “You turn on the news, and you very rarely hear the good,” she said. “I know that’s the norm, because people aren’t really out reporting on things that are going great. ” But even those critical of the news media and its coverage of Mr. Trump appeared ready to give it all a rest. “People already voted him in,” said Richard Bryant, 48, a construction project manager in Little Rock. “Let’s move on and make America great again. ”'"}, "time": 1742628555.8235114}