{"duration": 0.13372278213500977, "input_args": {"text": "'Posted on March 22, 2014 by Mike | 45 Comments \\nWhy Do Progressives and Democrats Hate America? \\nIt’s a loaded question, I know. But please, bear with me for just a moment and put aside all the rhetoric you’ve heard about political correctness. I ask only that you approach the question from a position of pure logic. \\nProgressives and Democrats want to change America. That’s no secret. They boast about it openly, and base their political campaigns entirely on the premise of change. I’m sure we agree so far. \\nNow consider this: Why does anyone want to change anything unless they’re unhappy with it? If you’re happy with your job, would you change? If you loved your dog, would you trade him in for a new model? How about your spouse? Does anyone ever leave their spouse who isn’t tremendously unhappy and no longer in love? \\nI’m sure we can also agree that change stems from disappointment and unhappiness. \\nNow back to America. Your children won’t hear it from their teachers or read about it their school books, and you certainly won’t see it in your newspaper or anywhere on television, but the United States of America has done more good for more people than all the other countries of the world put together. \\nAmerica began as a haven for those seeking religious freedom and fought a war to preserve that freedom. \\nAmerica fought a war to end slavery and won. (Democrats supported slavery. Republicans opposed it. After the war, the defeated Democrats formed the Ku Klux Klan. Funny how white Americans today are still blamed for the slavery of a hundred and fifty years ago, yet never thanked for sacrificing their lives in order to end slavery.) \\nAmerica won two World Wars, and put an end to Hitler’s socialist Nazi party. \\nAmerica stemmed the tide of communism and provided safety for thousands of Vietnamese refugees who would have been murdered by the communists of North Vietnam. \\nFor centuries, America has given freedom and hope to the oppressed; hope and joy to the suffering; and liberty and opportunity to people of all races and nationalities. The proof of her greatness can be found every day in the millions of immigrants who flock to her shores seeking the freedom that America offers. \\nYet Progressives and Democrats want to change America. Doesn’t that make you just a slight bit suspicious? \\nIndeed, Progressives and Democrats want not just to change America, but to fundamentally transform it. And they seek to do so under an ideology that has killed more people in the last one hundred years than have died in all the wars in the history of the world combined: Socialism. \\nSocialism under Hitler murdered millions and set the entire world at war. \\nSocialism under Stalin murdered upwards of forty million people. \\nSocialism under Mao murdered over sixty million people. \\nSocialism under Castro continues to murder people today. \\nEverywhere socialism goes, it kills. \\nYet Socialism is what Progressives and Democrats want for America. Doesn’t THAT make you a tad bit suspicious? \\nJust what could cause so many people to despise a country so great as America? Let’s examine the question a little more closely. \\nHave you ever seen a man get rejected by a beautiful woman? At first, he criticizes her, looking for whatever flaws he can find, then he despises her, and eventually he hates her. Why? Because he can’t have her. His hatred is actually a form of self-hatred. He feels unworthy of the woman who rejected him and projects his hate onto her and others. His future attempts at seduction become a means of revenge, a perverted attempt to escape his own self-loathing. \\nThe same thing happens when a woman is rejected by a man. There’s a reason why William Congrave wrote the famous words “nor hell a fury like a woman scorned.” The scorned woman condemns and sets out to destroy the man she cannot have. Like the rejected man, she suffers from extreme self-hatred. It’s self-hatred that fuels feminism and its constant attacks on heterosexual men. If we can’t have them, we’ll destroy them. \\nProgressives and Democrats are no different in their hatred of America. \\nAmerica was born a religious, God-loving country and it remains so today. Progressives and Democrats, on the other hand, have rejected God and embraced lives of sin. They support and encourage abortion, racism, intolerance, promiscuity, homosexuality, government theft, and a host of other ills, and then project the guilt and self-hatred they feel for embracing these sins onto a hatred of America and its religious heritage. Because Progressives and Democrats falsely believe that God has rejected them, they reject God. \\nAmerica has offered opportunity and economic freedom to anyone who is willing to risk and work hard. Progressives and Democrats have risked once or twice in their lives, failed, and are now terrified at the prospect of competing with other risk-takers. Their fear leads to a sense of entitlement that extends to food stamps, housing allowances, “free” health care, and personal and corporate welfare. The stronger their self-hatred, the stronger they feel they are above hard work. They hate America, because it reminds them of their own failures to provide for themselves and their families. \\nAmerica stands for strength, independence, honor, and compassion. Progressives and Democrats are so frightened by life and have developed such a dependence on government for survival, that they have lost all of these qualities. And they hate themselves for it. \\nNo self-respecting man can call himself a man if he’s beholden to government entitlements for his survival. Progressive and Democrat men know this and they hate themselves for it. \\nNo self-respecting woman can call herself a woman if she rejects the honor and compassion of motherhood by embracing abortion and feminism. Progressive and Democrat women know this and they hate themselves for it. \\nTogether, Progressive and Democrat men and women hate America, because it reminds them of all the positive qualities of strength, self-reliance, and kindness they lack the courage to develop in themselves. Like rebellious children who must depend on their parents for survival, but hate their parents because of it, Progressives and Democrats live in a state of suspended adolescence, forever running from the responsibility of motherhood, fatherhood, and limited government. \\nThey hate America, because they hate themselves. \\nWhich brings us to socialism. \\nProgressives and Democrats embrace socialism, because it represents everything they long for: the complete eradication of the individual. With all of society reduced to lowly pawns, they no longer have to fear being reminded of their own inadequacies. Everyone can be as miserable as they are. Everyone can feel the self-hatred they feel. \\nWith no one to remind them of their sins, Progressives and Democrats believe their guilt and intense self-hatred will finally be removed. What they fail to realize is that the solution to all their ills lies within them. By embracing America, they can embrace God. And by embracing God, they can eliminate their guilt, their self-hatred, and all the factors that contribute to their misery. It’s a solution so simple and so easy that their own leaders are forced to spend billions of dollars, and destroy millions of lives in order to hide it from them. \\nIf you support Progressivism or the Democratic Party, then you also support socialism. And if you support socialism, then, by definition, you also support the socialism of Hitler, Stalin, Mao, Castro, and many others. Is that something you can live with? Are you ready and willing to forgive yourself and return to the One who calls you? \\nHe’s waiting. He’s been waiting. The first step is simply to say, “Please, God, forgive me…” Rate this:'"}, "time": 1742561955.279575}