{"duration": 0.11097836494445801, "input_args": {"text": "'Leave a reply \\nThis is intended to be a vision for the 11-11-2015. I am going to discuss the vision I had regarding how the old paradigm can transition into a new paradigm easily, safely, joyfully. The vision I had is that all the organizations in which people live and work — all the ones that they have come to depend upon, that they would be confused and bereft if they were to suddenly disappear. \\nAll the organizations can transform into their higher dimensional versions. And that transformation is initiated by a vibrational shift among the populace that gets them to the level which they can understand the transition and integrate it very easily into their hearts and minds and in their physical existence. \\nLet’s take these organizations one by one just as samples. \\nWe see corporations turning into cooperatives being owned and operated by the people who are the employees. And therefore they have a vested interest in these organizations. Going to work is fun and inspiring; everyone works in the position that they are most challenged and inspired by and that they feel the best at. And they can easily move from position to position, according to what they desire at the time. \\nThe army becomes the army corps of engineers. Instead of an underlying intent of destruction, its underlying intent transforms to construction— reconstruction. They still use the same organization, the same kind of hierarchy in the beginning of the transition, and that makes everyone feel comfortable and happy, but their underlying intent has completely changed. So the same organization can be used for construction instead of destruction. So that makes a very easy way to transform the army into a much higher dimensional entity. \\nThe navy becomes the oceanographers whose job is to protect the ocean and to help restore it to pristine natural beauty. So each one of these things is its higher dimensional [version]; its underlying intent has changed. And that intent is aligned with the higher self of the Earth as well as the higher selves of all the humans and the other sentient beings and all the beings on Earth; that intent is aligned with the new Earth. \\nThat is the transitional phase. \\nMoney becomes a means of appreciation because everyone is starting to realize that they don’t have to work to live on the Earth; they don’t have to pay to live on the Earth. People don’t have a real need to be greedy or to have more than anyone else as a form of protection because survival-based thinking is replaced by inclusion and love, which is the higher dimensional version of the base-level programming. \\nThe base-level programming of survival thinking is what supports the old matrix. The new matrix is based upon love and inclusion: higher dimensional. And it requires that everyone get on board with that kind of thinking. So money might be necessary in the transitional phase, but it is only going to be returned to its original intent, which is a medium of exchange. So it [will] help to “grease the wheels,” so to speak. \\nThe vision that I have for the component of the New Earth that I want to create is an online as well as physical—it has physical versions of it—and it is basically a creative center, and people can volunteer to do work in different places according to the needs of those places. So, for instance, there is a village in Africa that needs a better supply of water. [The site would supply experts] who know how to supply water. So the village in Africa that needs water. \\nYou have this huge internet community: I call it the ImagiNation. It is made up of [creative] people who have the ability to imagine a new future, to imagine different constructs, who can make new things. And with this new thinking and the new intent underlying everything, people understand that when they go to help someone else, that they will be provided for while they are there. This village in Africa that needs a new water supply, people that are experts in this, or have a vision, they would go there, they would spearhead the project. The resources of the area would be used, the people that are the workers, would be the [labor force] from the area, the tribe, the community. \\nEverything would be local as much as possible. And if companies had to come in to help with this they may be able to make money from this, but the primary purpose of this is to support the community. \\nThese creative people would then be going from community to community; they would be able to travel and to be supported in these communities and be supported while they are there. Their reputation is their currency so the creative [experts] are known for what they do, and their reputation precedes them, and they are “hired” to do this, but they can live anywhere in the world according to what they want and what they can do. \\nI see this as a very easy and fun and enjoyable transition. We have the ability to do this; we need the support of our higher selves to anchor this into reality. We are holding the intent for this— the vision for this. We know that every part of society can be changed overnight; this [transition] can be like wildfire spreading across the Earth where people jump on board because it is so much fun. It is so much more fun to create something than to destroy something. It is so much more fun to live in community and harmony than it is to be constantly battling with each other; at odds and having to eek out your existence or defend your property. That’s the old paradigm that no longer needs to exist. \\nSo we are holding the space for this [vision] and as women we are bringing it through our bodies into the Earth. [Breathing] Bring it in… anchor it…”Let it be real” — that’s the phrase I am getting…”Let it be real.” Let the vision be real. People with money are going to start to realize that they can turn around and support this instead of supporting what they are supporting. They can turn around and support the growth of the New Earth, now, because it is needed now. They have the contacts, they have the money; they can help make this transition much, much, much easier. We are asking them—their higher selves—to release, to release the greed, to release the need for self-protection. And to join the party. Aliyah Marr is a Contributing Writer for Shift Frequency SF Source Infinite Shift  '"}, "time": 1742563547.2273746}