{"duration": 0.048032522201538086, "input_args": {"text": "'DARLING DAYSBy iO Tillett WrightIllustrated. 385 pp.   Publishers. $26. 99. Those of us who were raised the only child of a single parent know how intense the relationship can be. Different days you may play the role of child, parent, sibling or emotional crutch  —   some days all at once. As you get through it, you try to find space for yourself, to become someone outside the   world that your parent has provided. This is the main struggle driving iO Tillett Wright’s debut memoir, “Darling Days. ” Tillett Wright was raised in the bohemian East Village of the 1980s and ’90s by Rhonna, a sometime model and   “glamazon” who preferred spending money on dance classes rather than on bills or groceries. In this household, Tillett Wright knows love but also instability. “Sleep doesn’t happen much in the house, what with the plays and things late at night, plus Ma is in a real bad way,” the child observes. “It’s like she has a night personality and a day personality. ” Tillett Wright grows up skinny and scrappy, able to score meals off neighborhood friends, then shimmy up the side of a building to get into the apartment undetected. Born female, Tillett Wright also grows up identifying as a boy. At 6 he turns to his dad, tells him he’s now a boy and, for the next eight years, dresses and passes as such, avoiding   bathrooms and locker rooms for fear of being found out. Neither parent objects to this rewriting of gender. “Ma doesn’t think it’s strange that I live as a boy. Boys have all the fun, girls have tons of restraints,” Tillett Wright observes. But classmates bully him, with one student wrapping a hand around his neck in a stairwell to check for an Adam’s apple. Tillett Wright, an L. G. B. T. activist and host of MTV’s “Suspect,” now identifies as a transgender man. It’s Ma’s benign neglect that is at the source of Tillett Wright’s malnourishment and general malaise, yet she’s the one who fights hardest for her “kitty. ” Their relationship, though later strained by brutal fights, is always close. “We are some kind of twins,” Tillett Wright tells his mother in the letter that prefaces the memoir, “able to see each other in a room of closed eyes, able to hear each other in a world of silence. ” Twins or not, as a child Tillett Wright longed for regular meals and a real bed, not the broken army cot his mother finds for him on Canal Street. He fantasizes about finding a way to live with his “Poppa” in Europe without “stabbing my mother, my best friend, in the throat” by ratting her out to a school counselor. The emotional heart of the book lives within this tension  —   between taking care of his controlling and needy mother and taking care of himself. In this struggle, Tillett Wright is cleareyed but compassionate. “Darling Days” begins strong. The East Village of Tillett Wright’s childhood is especially vivid: “Our building repels ‘normal’ people. They’d have to love cockroaches, scalding radiators and thin walls . ’u2008. ’u2008. they would have to establish their own niche in the zoo and defend it. ” The menagerie includes an emaciated recluse who collects pianos, a pair of retired porn stars who reign over the building and his mother’s rotating cast of boyfriends “with broken teeth and crooked minds. ” But as we move further into the narrative, and deeper into the trials of Tillet Wright’s adolescence, his perspective narrows. Though passionately felt and described, his struggles can feel overdetailed they’d benefit from the insights of an older, wiser narrator. To make reference to Vivian Gornick, it’s too much situation, not enough story. I sometimes wished Tillett Wright would step back from the roller coaster of new schools and, later, new lovers to give us a broader view on the changes to his city, his community and especially his fallible but fascinating parents. While he was living his life, history was also happening, and the inclusion of that history could enlarge his memoir. Nevertheless, it’s hard not to root for Tillett Wright when he finally comes into his own, and especially as he finds love with women, accepting a queer identity he’d long feared and resisted: “I don’t want to wear my tragedies on my skin, in my teeth, in my walk. I want something different than what I’m inheriting, but I’m going to have to make that happen for myself. ”'"}, "time": 1742628348.2983298}