{"duration": 1.3264355659484863, "input_args": {"text": "'Sudan, Africa and the Mosaic of Horrors 27.10.2016 \"What could be the most striking image, one that would clearly illustrate the destructive involvement of the United States in Sudan?\" I ask. \"In short, what should I photograph, that could show the suffering of the Sudanese people?\" \"Let\\'s go and photograph what is left of the Al-Shifa factory,\" I am told. \"It is terrible, and truly symbolic.\" It is actually close to impossible to photograph just about anything in Sudan. For right or wrong reasons, the government is paranoid. Elaborate permits have to be issued for traveling outside the main urban areas, and for taking photos and videos even inside the capital city of Khartoum itself. If one dares to at all, one has to work fast and clandestinely, even if one is not planning to do anything damaging to Sudan. by ANDRE VLTCHEK Print version Font Size Why was I here? After making my films, after covering the horrid wars of the African Great Lakes, after witnessing the awful devastation of the Democratic Republic of Congo (DRC), I had to finally come to Sudan, which for me represented that remaining, that last piece of the \\'puzzle\\'; a part in the mosaic of the horrors which are now covering almost the entire continent of Africa. I thought that I had to be here, in order to understand all the subtle nuances of how Western imperialist designs have been fragmenting and ruining this entire continent. I convinced one of my friends in Khartoum to accompany me, and on my third day in Sudan, we drove towards the \\'legendary\\' sight of the former Al-Shifa pharmaceutical factory in Bahri, Khartoum North. The path we took led through relatively affluent neighborhoods, full of large houses, even villas, some of which, I was told, belong to Omar al-Bashir himself, and to his relatives. Our car passed near the bizarre complex of Al-Noor Mosque, which is built in a Turkish style. \"This may be the only mosque in the world, which has a supermarket behind its walls,\" my guide explained, smiling sarcastically. \"The investment and idea came from our President; from al-Bashir himself.\" A few minutes later we see what we came here for: the site, the rubble, the devastation . A surviving chimney of the factory is right in front of us. On the left-hand side of the road, it is just pure destruction. 18 years after the \\'event\\', nothing grows here, and nothing, no structures have replaced what has been converted into debris. I work fast. I don\\'t want to get caught. I came here in order to document the brutality of the Western global regime, but somehow here I feel like a thief, like an intruder. At this point I still don\\'t know why. US missile destroyed factory: Clinton The Al-Shifa factory was hit and destroyed by US Tomahawk cruise missiles in 1998, just a few days after the terrorist attacks on the American embassies in both Kenya and Tanzania. President Bill Clinton ordered the attack, arguing that the compound was storing nerve gas, something that was strongly denied by both the Sudanese government and the owner of the plant. On October 20 th , 2005, The New York Times reported in its uncommonly critical article: \" American officials have acknowledged over the years that the evidence that prompted President Clinton to order the missile strike on the Shifa plant was not as solid as first portrayed. Indeed, officials later said that there was no proof that the plant had been manufacturing or storing nerve gas, as initially suspected by the Americans, or had been linked to Osama bin Laden, who was a resident of Khartoum in the 1980\\'s... no apology has been made and no restitution offered, which has Sudan\\'s government steaming, even seven years after the ground shook and the dark sky over Khartoum turned light as the plant was hit. On the most recent anniversary of the bombing, Sudanese authorities did what they always do and repeated their call for a United Nations investigation of the American attack on the factory, which, if nothing else, was a major provider of medicines for humans and animals at the time it was destroyed. Mustafa Osman Ismail, who was foreign minister until recently, also raised the issue at the United Nations summit meeting in New York last month, saying the bombing \"damaged the development efforts of my country and deprived my people of basic medicines.\"\" \"It is thoroughly paradoxical,\" I am told, as we are driving away. \"The Americans ruined Sudan\\'s most important medicine supply. They bombed a private factory that actually belonged to a person with extremely close business ties to the United States.\" But this is not the only paradox that I will encounter in this country. And it is not the only paradox in its relationship with the arch tormentor - the United States. *** In Khartoum, I met dozens of people: Sudanese people, Eritrean people, Europeans as well as Asians. I kept putting the same questions to everyone: is Sudan really at odds with the West, particularly with the United States? Or is \\'the game\\' actually much more complex than that? Western media again distorts the truth If Sudan is really a brutal dictatorship, then Sudanese people are shockingly outspoken. Those who are opposing the government are speaking against it openly, even in front of a total stranger like myself. This would be unthinkable even in today\\'s Egypt or Turkey. \"But no names, please, no names,\" I am told. I understand. I take notes, but do not write down any names. A man working for an international organization is laughing, as we are having dinner: \"In Sudan, people can meet and say whatever they want. Nobody cares. But god forbid if they begin to organize.\" He is talkative and friendly. But later I find out that he thinks (and tells his colleagues) that I am a \\'spy\\', which, in turn, is explained to me, is quite the usual way of looking at each other here. It is enough to be half Eritrean or Ethiopian to be suspected of spying. All Westerners are flatly considered to be professional spies, no matter how strong their anti-imperialist credentials are. This constant suspicion is what made me uncomfortable in Sudan, from the first moment I stepped off the plane. I never felt like this in Eritrea or in Zimbabwe. There, they knew who I was and what I do: they read my books and have watched my films, and consequently they trusted me. Here, one paradox piles on top of another. There is this brutal embargo, and open confrontation between the West and Sudan. Already, many years ago, the ICC issued an arrest warrant against the President. It is almost impossible to get a Sudanese visa with a US passport. But, as I am told, half of the Sudanese parliamentarians are holding US citizenship and regularly \\'commute\\' between Sudan and North America. Bizarre? Yes, thoroughly. Is it even possible? Apparently it is: welcome to Sudan! In the meantime, over one of the tastiest steaks I have ever had in my life, my acquaintance spills his heart out to me (allegedly a foreign spy): \"We have some of the best meat in the world... The embargo means, no chemicals, everything is organic. Sudanese are herders... Beef, sheep... Such a rich land! We have plenty of water below the ground. Our people are nice, they are peaceful, welcoming... We want to be friends with everybody in this world.\" At the end, he helps to arrange a car for me, for the following day. He is not supposed to, as I am not allowed to drive anywhere in this country. Especially if he thinks that I\\'m a spy. Things are slightly confusing. But I am quickly getting used to it. *** Several African and foreign analysts now believe that the events in Sudan, the West\\'s desire to destabilize it, to overthrow its government and ultimately to break the country into pieces, are closely linked to the horrific past and present of the rest of Central Africa, particularly to Rwanda, Uganda and the DRC. Others dispute it. The disagreements are often only over whether the main booty of the West was actually supposed to be the Democratic Republic of Congo or Sudan. In his legendary work, first published in 2004, CENTRAL AFRICA: 15 YEARS AFTER THE END OF THE COLD WAR. THE INTERNATIONAL INVOLVEMENT, Dr. Helmut Strizek, a German academic, argues: \" Most people expected that Clinton with his \"leftist\" leanings would pressurize the Bashir-Turabi regime into a process of democratization in line with the Bush-Mitterrand approach that had been adopted after the end of the Cold War. But things took a different course. Clinton and Madeleine Albright, the new American Ambassador to the U.N., considered Sudan to be a \"rogue state\" and the number one enemy in Central Africa. They therefore opted for a proxy approach (\"get others to fight your war\"), a well known strategy that had been applied during the Cold War. Mitterrand was unlikely to comply with the intended \"regime change\" in Khartoum. He was apparently not informed about Washington\\'s Sudan policy and could not understand the effects this new policy had on the Rwandan problem. After the Somalia disaster of 3 October 1993, Madeleine Albright used all the tricks in the book to minimize a U.S. contribution to the UNAMIR peacekeeping force envisaged in the Arusha Agreements. These activities were the first signs that the U.S. wished to reduce its commitment in favour of power sharing in Rwanda, help Museveni and his friend, Paul Kagame, to win the Rwandan war, and find other anti-Khartoum allies.\" The horrors in Rwanda occurred in 1994 and then the US-backed Tutsi RPF took power almost immediately there (or one could say almost simultaneously), the same year. One year later, Rwanda and Uganda began one of the most brutal and genocidal wars in the history of the 20 th Century - the one against the people of the DRC. The war continues until now, and is fought on behalf of several Western powers and business interests. By the recent count, at least 10 million people have already lost their lives. The West was interested in chipping off several resource-rich parts of Sudan, including the then so-called southern Sudan. Neighboring Uganda was extremely interested in the \\'project\\', too. It was enjoying full impunity and was clearly emerging as a brutal regional power. It had already supplied, trained and hardened the RPF cadres, (before the RPF took power in neighboring Rwanda). It was already helping with plundering the DRC, and it felt suddenly ready to play and to think big. Not everyone was impressed. But the stakes were extremely high, and rebellious heads, those that did not want to support the West\\'s Machiavellian designs, began to roll. Helmut Strizek continues: \" UN Secretary-General Boutros-Ghali was considered in Washington to be a \"French and Sudanese sympathizer\". He became a prominent victim of the approach to Sudan. Richard Clarke reveals a strange deal: \"Albright and I and a handful of others (Michael Sheehan, Jamie Rubin) had entered into a pact together in 1996 to oust Boutros-Ghali as Secretary-General of the United Nations, a secret plan we had called Operation Orient Express (...). The entire operation had strengthened Albright\\'s hand in the competition to be Secretary of State in the second Clinton administration.\" (CLARKE 2004:201/202). This pact was forged after an attempt - attributed to the Khartoum regime - to kill Egypt\\'s President Mubarak during a conference of the Organization for African Unity in Addis Ababa in June 1995. \"Following that event, Egypt and we (joined by other countries in the region) sought and obtained the United Nations Security Council\\'s sanctions on Sudan.\" Well, Egypt was always on the side of the British colonialists, when it came to the wars against Sudan. Similar to his predecessors, Mubarak faithfully served the Empire. In 1998, Bill Clinton organized a \\'meeting\\' in the Ugandan city of Entebbe, in order to amalgamate a group of the proxies - those willing to launch a war against Khartoum. Helmut Strizek again: \" Rather than promoting democracy the meeting was intended to prepare for war against Khartoum with the help of this so-called \"new generation of African leaders\". But the war never took place. Shortly after Clinton left Africa, an absurd war broke out between Ethiopia and Eritrea. Laurent Kabila, whose anti-democratic record - according to different reports in the press - had made Clinton feel very uneasy in Entebbe, used this war as an excuse to leave the anti-Khartoum alliance and try to get rid of his Rwandan \"protectors\" in late July 1998. As a result the anti-Khartoum alliance collapsed.\" \" While the planned war failed to materialise, the joint U.S.-U.K. policy initiative to topple the Sudan government continued. Although Richard Clarke would like to make the world believe that the bombing of a chemical plant in Khartoum on 20 August 1998 in retaliation for the Al Qaida attacks on the American embassies in Nairobi and Dar-es-Salaam was a success story, in fact it was a failure. This attack only exacerbated anti-American feelings, because the Sudan government had apparently not supported Osama bin Laden after he left Sudan in 1995. The failed attempt to kill bin Laden the same day in Afghanistan reinforced his belief that he was protected by \"providence\" and so he stepped up the fight against the \"American devil\".\" \" Despite the improved relations between Sudan and Egypt, there was no change in the policy to bring about a regime change in Khartoum before the end of the Clinton era. Even Jimmy Carter, who cannot be suspected of excessive sympathy with Muslim fundamentalism, disapproved of this inflexible approach in 1999. \"The people in Sudan want to resolve the conflict. The biggest obstacle is U.S. government policy. The U.S. is committed to overthrowing the government in Khartoum. Any sort of peace effort is aborted, basically by policies of the United States. Instead of working for peace in Sudan, the U.S. government has basically promoted a continuation of the war.\" What Jimmy Carter said is definitely correct, but it does not, of course, apply exclusively to Sudan. It could be traced to almost all the conflicts in which the Empire has some involvement (therefore, to almost all of them), from those in Africa to those in the Middle East, including Syria. Helmut Strizek believes that the wars in the African Great Lakes Region were directly connected to the US attempt at destabilizing Sudan, that they were actually ignited by the West, for Sudan to be destroyed or conquered in the end. But many others, including a legendary Canadian international lawyer, Christopher Black, who has been deeply involved in the events of the region (where he was working for the ICTR in Arusha, Tanzania), disagree. Chris wrote to me, shortly after I sent to him Strizek\\'s report: \" Strizek... He testified for the defense in our trial at the ICTR and put forward this thesis about Sudan. I think most of what he says is correct but found then and still find his theory that the war in Rwanda was about Sudan a little difficult to accept. It may have been one of the considerations for Museveni and the US and UK etc. but it was not the primary one. The primary one was the war on Zaire, to kick out Mobutu and break Congo into pieces, That was the central plan for the RPF, US, UK, Belgium etc. re Rwanda and I have a letter from Kagame saying so. Strizek was used by an opposing defense team in my trial to try to make it look like I forged that letter from Kagame and I went after him about that. I think he fell into a trap about that - that is that other defense team, who I am sure were working for the prosecution, tricked him into doing. We discussed it later and he admitted perhaps he had been wrong but would not totally retreat. But we are in touch still... So in my opinion, the rest of his paper is basically correct re the geopolitical situation and he is correct on who invaded Rwanda and is responsible for that war, but I disagree that Sudan was the central objective of that war - that objective was Zaire. I agree re Sudan\\'s importance but I fail to see how the take over of Rwanda had any effect on the attempt to break up Sudan. It is not on Sudan\\'s border, Uganda is. No doubt Museveni etc. wanted that result - but I could never quite see how Rwanda fitted into that picture except in general terms - that is the US etc. wanting to take over all central Africa which would make them stronger further north in Sudan etc. But it is clear from all the other evidence at the trial and that of the French expert Dr. Bernard Lugan and others that the main objective of the Rwanda war was to take over Rwanda so they could use it to attack and break up Zaire, which is what they did.\" My comrade, a Ugandan opposition politician Arthur Tewungwa, agrees with Christopher Black, but he also thinks that the West \\'drenched in blood\\' the entire region, whatever have been its \\'primary goals\\': \"Sudan, Uganda, Rwanda and the DRC have all been the victims of a cross-Atlantic foreign policy that has left the region disfigured and drenched in blood. While the motives have been presented as altruistic, the net result has been dreadful. Loud Western propaganda based on simplistic interpretations has been the order of the day. Sadly this approach has drawn celebrities and other well-intentioned individuals who have contributed to suffering equaled only during WWII. Darfur, Luwero, Eastern Congo and Rwanda have narratives built that don\\'t stand the test of objective scrutiny. Who will repair the damage visited on these places? The only answer is the victims. The do-gooders have done enough bad to warrant their exit left of stage!\" *** I then asked my close friend and a dedicated internationalist, Mwandawiro Mghanga, Chairperson of (Marxist) Social Democratic Party of Kenya (SDP), to comment on the situation in Sudan. He expressed, in his letter, a strong opinion and his support for the Sudanese people, against the sanctions and against Western imperialism in general: \"The economic and political sanctions imposed against Sudan by Western countries have existed for many years. However, despite disrupting the development of the country they have not succeeded into forcing the people with a long and proud history and culture to surrender its freedom to Western imperialism. Western countries imposed the sanctions against Sudan ostensibly for its violation of the human rights of South Sudan which until recently was part of Sudan. But even after the government of Sudan participated in the democratic process that gave birth to the Republic of South Sudan (RSS), still the West continued with its hostilities and sanctions against Sudan. Sudan is now accused by the West of gross violations of human rights in Darfur. Yet despite its propaganda, the West is not actually interested in solving the problem of Darfur but in undermining the government of Sudan, compromising its sovereignty and carving another country out of Sudan. After RSS and Darfur the West will encourage another region of Sudan to demand to split and so on until Sudan is left into a tiny country like Rwanda. In fact, until the RSS was created, Sudan was the largest country in Africa in terms geographical size and ethnical diversity. This did not please Western imperialism that was imposed into Africa through the partition and balkanization of the second largest continent in the World and sharing it among the European colonial powers. Colonialism then existed in Africa through the notorious tactic of divide and rule that it continues today. The goal of Pan - Africanism and African Union for regional integration and eventual political union of African countries has always been seen as a threat to imperialist\\'s interests in Africa. In this context, Sudan like Democratic Republic of Congo (DRC) with it rich natural resources is seen to be too big by the West to dominate and therefore all means possible are used to balkanize it. They do not even care that the creation of RSS from Sudan has escalated inter-ethnic violence, violations of human rights and undermined real freedoms. The national liberation hero of Sudan and leader of South Sudan John Garang was assassinated by the West ´with the connivance of the Ugandan government under President Yoweri Museveni because he was leading the struggle for the liberation of the whole of Sudan and not the creation of RSS. In the meanwhile, the sanctions against Sudan have only made the country more determined to safeguard its freedom and independence, to explore and implement self - reliance strategies and to search for alternative development partners - Russia and China. And so Sudan struggles and lives on.\" Not everyone in Africa feels deep solidarity with Sudan, though. The country has an extremely complex history and relationships with its neighbours. My close colleague from Eritrea, usually very outspoken and passionate about the West\\'s devastating involvement in Africa, this time just commented, simply and dryly: \" The only thing I can say is that in Sudan it\\'s not similar to Eritrea - ours is a clear case of economic sabotage, injustice, and double standards.\" *** The last day before my departure, I ended up working with a lady, an acquaintance of mine, who spent a long year working in Darfur. Are things there really as they are described by the Western mass media? We sit in the lobby of my hotel, drinking coffee, and I\\'m taking notes. No names, of course, no names here... But she speaks freely, confidently, and what she describes is actually not much different from the nightmares occurring in many other parts of Africa: \" It is extremely tiring working in Darfur. You don\\'t realize it when you are still there; at some point it all becomes somehow \\'normal\\', but then when you leave the place, it all comes back to you, and it is hard to keep living a normal life afterwards. You are asking whether it is it as horrible there, as we are told? Yes it is, and perhaps worse... Killings and rapes, refugees and despair, and great suffering of the people... But it is not happening, honestly, just because of this government, and the state-backed Janjaweed militias... although they can be blamed for many terrible acts, of course. But the other side is not blameless either. And local people almost never report crimes committed by the rebels, and the Western media hardly mentions them...\" What I want to know is what role the West is actually playing in Darfur? \" The West is definitely trying to encourage Darfur to leave Sudan. The West, even Israel, is supporting Abdelwahid rebels from Fur African tribe. It is not unlike what it did in South Sudan. Darfur is rich in uranium and other raw materials. The conflict in Darfur, and brutality of it, is actually being fuelled from outside. The UN peacekeeping force UNAMID is thoroughly ineffective in Darfur. It hardly interferes on behalf of the local people. One has to wonder, what are their mandates and true goals there. I asked and was told that they are there \\'to report\\'. It often appears that the so-called international community is doing everything for the conflict to continue, so it could justify its push for separation. In the meantime, the refugees are flowing into neighbouring Chad, and elsewhere. In the camps in Chad, they are often screened and interviewed, by foreigners, even Israelis... I don\\'t know what happens there, in those camps, afterwards.\" As we speak about Chad - its top military brass is having a joint meeting with local, Sudanese commanders. The entire hotel lobby is filled with men in various uniforms. Some are armed. I then ask to be taken to the so-called \\'open areas\\' outside Khartoum; places inhabited by the South Sudanese refugees. Like Darfur now, South Sudan had been, in the past, destabilized and encouraged to leave the Republic of the Sudan. The West did its best to create this the \\'youngest country on Earth\\', rich in oil and many other resources. As I was already explained to on several occasions by foreigners who have been based in South Sudan, the place has been, from the beginning, an ungovernable, and an artificial country, ruled by local warlords but above all, by countless international organizations and NGOs. That was actually the plan of the West from the outset. The situation in South Sudan is now so terrible, that people are fleeing across the newly marked border, to the Republic of the Sudan. Before the breakup, the exiles would be processed simply as IDP\\'s, but now they are \\'true refugees\\', as they are technically coming from a different country. We drive slowly to one of the \\'open areas\\' called Altakamul, in Alhag Youseif town. My acquaintances are feeding me with the latest data from UNHCR and other sources: \"there are now 7 camps for South Sudanese refugees in White Nile State, with a population of 101,495. And there are 35,507 refugees located in the open areas, in and around Khartoum.\" How are they treated here? \"Right after the separation, there was a lot of talk about South Sudanese people being our \\'brothers and sisters\\'. We were told to treat them exactly as we would treat our own people. Some actually have relatives here, even houses. But now, with the economical difficulties that Sudan is facing, things are becoming very problematic.\" Altakamus is a tough, miserably poor area, covered by sand and dust. As with everywhere else, I am not supposed to photograph here. And as with everywhere else, I do. Garbage covers almost entire alleys and the sides of roads. The whole area consists almost exclusively of only two colours with some varieties of shades: yellow and grey. Only very few economic activities could be detected. At this hour, children should be in school, but many are not. So this is where the increasing number of South Sudanese people are now ending up; this is the result of yet another \\'glorious\\' Western experiment on human beings: of mingling with the borders, creating new states that should serve the Empire\\'s political and economic interests. How many more are \\'planned\\' for this area? We know of at least of some others: Goma (the DRC), Darfur (Sudan), Jubaland (Somalia). *** I don\\'t know where Sudan is heading. Despite many problems, despite its clearly capitalist leaning, corruption and economic troubles, I am impressed with many things here. Khartoum looks definitely much cleaner and safer than Nairobi or Kampala, two cities in countries that are fully supported and often loudly glorified by the West. In Nairobi, more than half the people live in desperate, deadly, even \\'toxic\\' slums. In Khartoum, poverty has a much gentler face. Despite sanctions, despite everything... Sudanese leaders have many new grand plans for their country: new housing developments, a new international airport, new office towers, hotels, riverfronts, office buildings and shopping malls. Some of these projects are now delayed, or even cancelled, but others are ongoing and on target. Life is tough here, and much tougher in the provinces. Because of the sanctions, many goods and basic equipment (even those for the hospitals) are missing. No credit cards are accepted here. Inflation is mounting. Goods and services are often calculated in dollars, but there are two parallel exchange rates in place: official and the black market one. Several times a day I hear the same question: \"Do you like Sudan?\" I don\\'t know. It is a complex place, but inhabited by warm, courteous people. Honestly, this is not my fight. Here I don\\'t see a struggle, an attempt to build an egalitarian country based on social justice. But Sudan is, to a great extent, a victim. A place which has been placed on that horrid hit list of the Empire and selected for demolition. And as such, I feel, it deserves to be supported. I wandered through the National Museum, with its exquisite artefacts. Two local schoolgirls wearing headscarves approached me, demanding to take selfies with me, on their phone. At times, life appears to be almost \\'normal\\', but there is always some tension. As we drive through the city of Omdurman, I ask my friend: \"Is it true what one reads in Western press; that they amputate hands for theft, that they are nailing people on the cross?\" She laughs, mockingly: \"Of course not! They got rid of these practices a long time ago! If they kept up with them, half of the government would be running around without hands!\" *** But who is who here, and who works for whom? I am told that imaginary \\'spies\\' are really everywhere. One day, I was sitting with a friend and with a local filmmaker in a cafe, discussing the possibility of my returning here and making a documentary film. The filmmaker was offering to drive me to Port Sudan if I come back, even to arrange my visa and all the necessary permits. At one point, we began discussing my latest novel \"Aurora\" . He asked about the plot. I told him that the book is about the European cultural institutions, which are funding young artists and thinkers in almost all developing countries, then using the arts and \\'culture\\' as a vehicle for spreading capitalist and pro-Western propaganda, silencing almost all rebellious voices. At first interested, the filmmaker became gradually very edgy, and towards the end of my explanation, he apologized and ran away from the cafe, faster than the speed of light. I never heard from him again. \"You hit the nail on its head,\" my friend began laughing, right after he vanished. \"He is funded by all those organizations that you mentioned. You scared him witless.\" Before I left the country, all my notes \\'mysteriously\\' disappeared. Someone entered my hotel room and took both notepad and my Mont Blanc pen, which was attached to it. The Mont Blanc had been, for many years, one of my dearest writing tools. Practically, it was not easy to depart Sudan. At the airport, my passport was endlessly scrutinized, and in the end I was ordered to produce my \\'registration paper\\'. I was told that registration is not required for stays under 30 days. I began expecting the worst. But in the end, the security apparatus allowed me to leave. But which security apparatus was harassing me, really? Who is in charge in this country? I will most likely never find out. In 1898, during the Battle of Omdurman (and later in 1899 during the Battle of Umm Diwaykarat), British imperialism debilitated, and eventually ruined the entire Sudan. British forces relied on their alliance with the Egyptians. In modern history, the West has never really left this proud nation in peace. All the terrible attacks came in the name of higher principles. The West has always claimed that it has been liberating Sudan from someone or something. In the end, the Sudanese people have suffered immensely. Those who were supposed to be \\'freed\\' were actually mercilessly sacrificed. Some things never change! \\nAndre Vltchek is a philosopher, novelist, filmmaker and investigative journalist. He has covered wars and conflicts in dozens of countries. Three of his latest books are revolutionary novel \"Aurora\" and two bestselling works of political non-fiction: \" Exposing Lies Of The Empire \" and \" Fighting Against Western Imperialism \" . View his other books here . Andre is making films for teleSUR and Al-Mayadeen. After having lived in Latin America, Africa and Oceania, Vltchek presently resides in East Asia and the Middle East, and continues to work around the world. He can be reached through his website and his Twitter . Sent to Pravdareport by the author'"}, "time": 1742562605.9292438}