{"duration": 0.05219316482543945, "input_args": {"text": "'When the creator of ‘Dilbert’, Scott Adams, sat down to decide who he would endorse for President, it didn’t take him very long. His method of deciphering right from wrong was pretty simple… he looked for the truth. \\nThe question he asked himself was: “What common traits bind Clinton supporters together?” \\nYou’re going to fully support the answer he came up with… \\nCheck this out! \\n“I’ve been trying to figure out what common trait binds Clinton supporters together. As far as I can tell, the most unifying characteristic is a willingness to bully in all its forms. Have a Trump sign in your lawn? They will steal it. If you have a Trump bumper sticker, they will deface your car. \\nIf you speak of Trump at work you could get fired. On social media, almost every message I get from a Clinton supporter is a bullying type of message…We know from Project Veritas that Clinton supporters tried to incite violence at Trump rallies. The media downplays it. We also know Clinton’s side hired paid trolls to bully online. You don’t hear much about that…” \\nSee what happens for people that actually “think” things through? They come up with logical answers and start off on whatever endeavor they are facing on the right foot! \\nHe’s absolutely right! Clinton followers tend to yell and judge everyone else for “sins” that they themselves are living in as they are pointing the finger at others! All things racist, sexist, bigoted, and telling us all we are these things because we lack tolerance, when in fact, that isn’t the case at all…is BULLYING! \\nWhich is rather IRONIC don’t you think? Because they also go on and on about how they are against bullying and we all need to be tolerant. Yet are constantly inciting violence, and condoning intimidation towards ALL who do not agree with them. \\nHere’s the endorsement, and it’s glorious. \\n“I endorse Donald Trump for President of the United States because I oppose bullying in all its forms. I don’t defend Trump’s personal life. Neither Trump nor Clinton are role models for our children. Let’s call that a tie, at worst. Today I put Trump’s odds of winning in a landslide back to 98%. Remember, I told you a few weeks ago that Trump couldn’t win unless ‘something changed.’ Something just changed.” \\nThat’s right. Trump is no angel, but Hillary is Satan. Trump loves America and for now, in the state we are in, that’s going to do a WHOLE lot of good. Some feel this election is about picking your poison, which is the least potent. I believe, it’s about picking what’s best for America. First step…would be choosing someone who loves this country. After 8 years of being under the reign of someone who hates this country, this should be clear. \\nBecause this is the alternative… Related Items'"}, "time": 1742562716.3519855}