{"duration": 0.07136893272399902, "input_args": {"text": "'Heath Mello, a rare Democrat on the national stage who is opposed to abortion, was defeated by incumbent Jean Stothert, a Republican, in Tuesday’s election for Mayor of Omaha, Nebraska, striking a blow to the hopes of the few remaining moderates in the party of FDR, JFK, and LBJ that a candidate who is not far left can generate support from the base. [On election night, the Associated Press called Mello’s loss a “setback for supporters who argued that the Democratic National Committee and abortion rights groups were wrong to attack the   former state senator. ”  Mello, a    Catholic from Omaha’s   south side, had become a flashpoint for the internal Democratic battle over whether a candidate’s position on reproductive rights should disqualify him from support by the national party after its crushing losses around the country last year. Tuesday, Mello acknowledged the “completely different dynamic” the campaign took on in the closing weeks, but noted what he described as unified support across ideological lines. “We tried to run a campaign that was inclusive from the beginning regardless of political affiliation, regardless orideology under the banner of change,” Mello told hundreds in a west Omaha hotel ballroom. Democrats hope for a victory in the race appear to have been hurt, rather than helped, when the Democratic National Committee’s unity tour featuring new chairman Tom Perez and former Presidential candidate Sen. Bernie Sanders ( ) stopped in Omaha on April 20. Rather than boost Mello’s candidacy, the subsequent comments by The National Abortion and Reproductive Rights Action League criticizing the Democratic National Committee for backing Mello apparently had the effect of lowering Democratic turnout for Mello in the Omaha municipal election: Responding to the criticism, Democratic party chair Tom Perez declared that, “every Democrat, like every American, should support a woman’s right to make her own choices. ” His comment sparked a fierce debate within the party over whether there should be an abortion litmus test, with Mello caught in the middle. “It’s astounding that our party chairman would say   Democrats are not welcome,” Nebraska Democratic Party Chairwoman Jane Kleeb told The Associated Press Tuesday as Mello conceded. A CBS News poll taken in January found 15 percent of Democrats nationally believed that abortion should not bepermitted. On election night after conceding the race, Mello’s comments suggested he would consider other political races in the future. Despite high levels of energy displayed by far left activists within the Democratic party since the election of President Trump, most of their electoral efforts since January have failed. In Kansas, a Republican candidate held off a Democratic challenger to win CIA Director Mike Pompeo’s former Congressional seat, and in Georgia, the   national efforts to give Democrat Jon Ossoff a jungle primary victory also failed. Ossoff now faces a runoff election in June against Republican candidate Karen Handel.'"}, "time": 1742563201.9420815}