{"duration": 0.04891538619995117, "input_args": {"text": "\"'Racist and sexist’ complaints against Aussie lamb advert rejected   18:36 Get short URL The ad recieves complaints of being sexist and racist against white men. © We love our Lamb / YouTube The Advertising Standards Board of Australia (ASB) has rejected complaints that an advertisement for lamb is offensive to white males. Several complaints were lodged about the ad which producers say attempts to be all-inclusive with the people it features. \\nProduced by Meat and Livestock Australia (MLA), the ad titled “You Never Lamb Alone” features a white TV presenter quickly being switched with a Bengali-Australian actor Arka Das who introduces a range of ethnicities and sexual orientations as he moves towards a barbeque cooking lamb - “the meat that doesn’t discriminate”. \\nhttp://giphy.com/gifs/bJJo3n1aUke1G \\nMost of the complaints to the Advertising Standards Board of Australia centered on the opening switch of white TV presenter Luke Jacobz to Das, after Jacobz utters the line “I’m here to address concerns that too many perky white males are contributing to the lack of diversity on our screens.” \\nhttp://giphy.com/gifs/7nzEvHhZ1zI52 \\n“This advertisement clearly states ‘too many WHITE people’ in its commercial which is highly offensive,” one complaint read, according to Bandt . “Pointing out someone’s race and gender in an advertisement and then denigrating such race or gender is both racist and sexist,” another read. To whoever wrote this lamb ad, thank you for all the tongue-in-cheek jokes about 'diversity' in Australia. https://t.co/E87jCXMFr3 — she stress@pax prep (@ChattyAnny) October 26, 2016 \\nMLA explained that the line was “simply a nod to the common criticism that Australian television lacks diversity,” with the ASB rejecting the complaints on similar grounds. Well done MEAT & LIVESTOCK AUSTRALIA for “You’ll never lamb alone” winning the Marketing Communications: B2C and B2B award. #AMI #AMIAwards \\n“The Board considered that the advertisement did not portray or depict material in a way which discriminates against or vilifies a person or section of the community on account of race or gender,” they said. \\nCurrently the video has more thumbs down than thumbs up on YouTube, with comments now disabled.\""}, "time": 1742563357.2347436}