{"duration": 0.1621992588043213, "input_args": {"text": "'Bill White November 23, 2016 Are We Seeing The End Of Progressive Liberalism? \\nThe 2016 presidential elections were more than an upset; they were a defining moment in American history. \\nFor the first time in living memory, the American people rose up in a united effort to throw off their political “masters” and show the politicians and media who really owns this country… We the People. \\nThere are many reasons why Donald Trump won the presidential election , and you can find articles galore proposing one theory or another. Of course, those articles are coming from people who are on the political right. \\nFor Democrats, the mainstream media and other liberals, the verdict is in; Trump won because of racism and sexism. In their world view, it would be impossible for anyone to beat out their anointed candidate, were it not for those “isms” and any other “ism” they can find. \\nBut the fact of the matter is that the average conservative or moderate rarely thinks about race, unless it is merely as a means of describing one’s appearance. \\nWe might identify someone as “Black” or “Hispanic,” but in our minds, that’s no different than saying that they are “blond” or “brunette.” It’s merely a way of identifying the person, not as part of an ethnic minority or part of a group to hate, but merely as a person who looks a certain way. \\nYet to people who are focused on race (the true racists), the color of one’s skin is everything. The ability to lump people in a group, because of their skin color, provides liberals with a way of dividing the country. Thus divided, it is easier for them to influence and control certain parts of it. \\nThe liberal cries of “racism,”“sexism” and “islamophobia” have become so common as to have dropped to the level of becoming a joke. Few, other than those who are already in the progressive liberal camp, even listen when those accusations come out. Rather, they see it as the left’s standard trump card, when they see that they are losing the argument. \\nSomehow or other, a cry of “racism” beats out any argument in their minds, no matter what the facts or logic say about the issue at hand. \\nSadly, there are still way too many people who are willing to take that emotional argument and run with it; accepting that as their opinion on any person or issue, without thinking it through for themselves. \\nYet those political masters have just been slapped in the face by a thing called reality. While they regularly call themselves the majority and refer to conservatives as “fringe,” the recent elections prove otherwise. \\nIn fact, according to a poll by Pew Research, there are more conservatives in the country than there are liberals. Perhaps that’s why Trump managed to beat Clinton, even though the media spent 18 months touting her as the next president. \\nWhile there are many reasons why Trump beat Clinton, including the way the two candidates ran their campaigns and Hillary’s many scandals, the crux of the matter boils down to mainstream Americans being tired of the last eight years of Obama’s liberal agenda. \\nLiberals like to claim that they represent the ideals of the majority of American citizens. Between outspoken Democrat politicians, the left-leaning mainstream media and the fact that liberals are much more likely to demonstrate when they don’t like something, their argument is almost convincing. \\nBut this election proved them wrong. Not only did they lose the presidential election, but both houses of Congress are in Republican hands as well. \\nWhat did all that? Basically, it boils down to progressive liberals pushing their agenda too hard and too fast. They have literally tried to change the social fabric of American society by force, rather than by more organic means. They overplayed their hand and this forced the silent majority to stand up and say “Enough!” and I’ll have to say, they said it quite well. \\nThe liberals have lost control of two branches of our government, and over the next few years, we’ll see them losing control over the third branch as well. \\nAs Trump has already presented the list of conservative judges he plans on picking from to fill Supreme Court vacancies, we can rest assured that liberals will not gain control of the Supreme Court anytime soon. \\nThis was probably the biggest issue at stake in this election. Had Hillary Clinton won the presidency, she would have been able to select the replacement for Justice Scalia, as well as two to four more Supreme Court Justices. That would give firm control of the Supreme Court to the liberals for the next 20 years or more. \\nDoes a Democrat Loss Mean That the Liberals Have Lost Their Steam? \\nDoes it mean the end of progressive liberalism as we know it? Are we finally going to see our country go back in a rational direction, returning to our roots? Sadly, no, in my opinion. \\nOh, the liberals have definitely been dealt a serious blow and their agenda has been slowed down. \\nIf Donald Trump is able to come through and fulfill his campaign promises, we might even see some serious reversals of liberal policies in the course of the next few years. But this doesn’t mean an end to liberalism, merely a delay for them. \\nLiberalism is alive and well, although at the moment they’re confused and crying. They will eventually get over their collective hissy fit and take a good look at the way things stand. \\nIf they can actually look beyond their own preconceived notions and see things as they are, they might even learn a few things about how the world works and come out stronger. They will be back and they will try to make us rue the day we voted Donald Trump into office. \\nDemocrats face two serious problems right now. The first is that they have lost their leadership. Part of the reason why Hillary Clinton became the Democrat Party’s candidate for president, is that they didn’t have anyone else who was a strong enough figure on a national level that they could put forth. \\nBernie Sanders was probably defeated more because he was an outsider, than any other reason. The Democrats never trusted him, because he wasn’t one of them. He changed parties shortly before the primaries, just so that he could run as a Democrat, and once he lost the primaries, he left the Democrat Party and went back to being an independent. \\nThe Democrat Party’s cupboard is pretty bare in the leadership department. It’s serious enough that they’re going to have a challenge finding a candidate to float for the next presidential election. As soon as they get over their crying spell, they’re going to have to start working on that. \\nThe second problem that the Democrats have right now is a need to reevaluate their tactics and strategies. Even with pushing illegal immigration, allowing illegal aliens to vote, and massive amounts of voter fraud in at least 16 states, they lost the election. \\nWorse than that, at least for the Democrats, is that the voter fraud they’ve propagated during this election cycle has been so obvious, that people across the political spectrum are noticing. \\nA national cry for cleaning up our voting process is rising up. While the means for doing that are still under hot debate, people are crying out for a honest, transparent process. The Democrat Party has already promised to fight President-elect Trump at every turn. They’ve actually threatened him, trying to tell him that he had better toe their line. \\nThat just shows how little they understand the man himself. Those threats, like all the other threats that have been made against him, will merely be exposed to the voting public and then ignored for the hot air that they are. \\nThe only chance that liberals have is to regain control of the White House or Congress. But that’s not going to be easy. The legacy of Obama’s overriding liberal agenda, manifested through his executive orders and massive regulations, is not going to be forgotten quickly. \\nIn fact, I’d have to say that the greatest hope that the Democrat Party has right now, is that Republican lawmakers will invariably disregard the voting public. It might take several years for that to happen; but it will. \\nThen, when it does, there will be another chance for the Democrats to preach their message of “hope and change,” this time, against an entrenched Republican Party. While that battle will be a hard one to win, I can almost guarantee you that it will be won. \\nSo the key now is for Congress and the President Elect to accomplish as much as they can, as quick as they can, to turn our country back towards its roots. That will probably all be undone eventually, but in the meantime, it will slow down the inevitable crawl to becoming a more and more liberal (read socialist) society. \\n  Bill White for Survivopedia. \\nReferences:'"}, "time": 1742562106.8030164}