{"duration": 0.13032746315002441, "input_args": {"text": "'Michael Kitces sees it regularly in his financial planning practice: clients who are close to retirement but haven’t saved. “They fall into two groups  —   either they don’t focus on it, or they are despondent,” says Mr. Kitces, director of wealth management for   Pinnacle Advisory Group and publisher of the popular Nerd’s Eye View blog, which focuses on financial planning. “They think their retirement is doomed  —   it’s a real   scenario. ” Mr. Kitces’ clients are not alone. Among workers age 55 or higher and nearing retirement, 48 percent have saved less than $100, 000, according to the Employee Benefit Research Institute. A third have less than $25, 000. The savings shortfall means many Americans face the prospect of retiring solely on Social Security, which replaces just 39 percent of   income for the average worker retiring at 65, according to the Center for Retirement Research at Boston College. But   do have some opportunities to improve their retirement math. Mr. Kitces encourages clients facing shortfalls not to give up on saving. That is particularly true for   who may be able to redirect income formerly devoted to raising children and paying college tuition. He recommends creating a household budget while the children are still on the household payroll that tracks   spending specifically. That can help people reallocate that spending to retirement saving once their children are out of the house. Mr. Kitces usually suggests maximizing savings contributions in workplace 401( k) accounts that offer the incentive of tax deferral and employer matches, or an I. R. A. Savers over the age of 50 also benefit from higher “ ” limits on tax deferred savings than their younger counterparts. This year, the combined limit for 401( k) accounts is $24, 000 for I. R. A. s, it is $6, 500.   contributions later in life can still yield a significant nest egg: Mr. Kitces calculates that if a couple earning a combined $100, 000 started saving 30 percent of their income at age 51, they could accumulate more than $1 million in savings by age 65. For most households, waiting to file for Social Security offers the best opportunity to increase retirement income. Benefits  —   which are adjusted annually to account for inflation  —   can be claimed as early as age 62, but monthly benefits rise 8 percent for every year that you wait (credits for delay are available until age 70). “There’s nothing you can put your money into today that will create a better rate of return,” says David Blanchett, head of retirement research at Morningstar, an investment research and management company. Yet nearly half of American workers file at age 62, data from the Social Security Administration shows. “We see a real tendency among our clients to take Social Security early,” says Kevin Dorwin, managing principal at Bingham, Osborn  Scarborough in San Francisco. “They feel they need the income right away and don’t want to get shortchanged on it. ” Delayed claiming is especially beneficial for married couples, since one spouse is likely to live well past the   “  date,” or the point at which a claimant will have made back the benefits forgone while delaying a claim. Moreover, the Social Security survivor benefit allows a surviving spouse to step up to 100 percent of a deceased spouse’s benefit, and married couples often do well with a delayed filing for the   spouse. “The impact of delaying is even more profound for someone with less savings,” says William Meyer, a founder of Social Security Solutions, which offers online software that helps claimants optimize their benefits. “The additional cumulative benefits represent a larger proportional amount if you have $200, 000 in saving instead of $3 million. ” Working longer offers a retirement math triple play by reducing the number of years a retiree must rely on savings, permitting more years of retirement account contributions and setting the stage for a delayed Social Security claim. “The combination of minimizing withdrawals from investment portfolios and allowing for greater compounding can make a very big difference,” says Mr. Dorwin. He calculates that a    couple with combined income of $150, 000 could bolster their retirement income by 30 percent if they worked an additional three years, rather than retiring immediately, as a result of higher Social Security benefits and drawdowns from a larger portfolio. Of course, working longer isn’t always possible  —   health problems and job loss often get in the way. But American workers do seem to be getting the message that it’s a worthwhile goal. A Gallup poll reports that today’s workers expect to retire at 66, on average. By contrast, the average retirement age for those who have already retired is 61. Retirement planning models often rely on rules of thumb that don’t always apply in individual situations. Standard planning, for example, holds that retirees need to replace 70 to 80 percent of   income to maintain their standard of living. But Mr. Blanchett’s research suggests that the actual replacement rates vary from 54 percent to 87 percent of income. His review of actual retirement expenditure, based on data from the United States Bureau of Labor Statistics’ Consumer Expenditure Survey, also suggests that spending falls over the course of retirement. That is especially true for older retirees, who tend to spend less on travel, entertainment and other discretionary items. Households facing saving shortfalls should consider cutting back on discretionary spending, Mr. Blanchett says: “It might not be easy, but it could be done. ” Empty nesters facing retirement income challenges should also consider moving to a smaller home or relocating to a less expensive part of a metropolitan area. Along with extracting equity that can be invested to produce income, substantial savings come from eliminating (or reducing) mortgages, and reducing home maintenance and property tax costs, according to Mr. Kitces. “More often than not, people do it because the house feels large and empty, but it can produce a lot of savings,” he says. Taxation of retirement income plays an important role in determining how long retirement savings will last. Conventional wisdom instructs retirees to draw money first from taxable accounts, and then from   401( k) and IRAs. But Mr. Meyer recommends a more nuanced approach by withdrawing from multiple accounts to minimize taxes. He acknowledges that an initial focus on taxable accounts makes sense because they are the least  . But the   approach is especially beneficial for retirees who delay their Social Security claim: They will be in lower tax brackets during the early years of retirement  —   an ideal time to take at least some income from   accounts. That can trim tax bills later on, when income Social Security (and required minimum distributions after age 70. 5) push many retirees into higher tax brackets. “Strategically tapping your savings leaves you more to spend in retirement,” Mr. Meyer says.'"}, "time": 1742562247.727147}