{"duration": 0.19010186195373535, "input_args": {"text": "'RIO DE JANEIRO  —   Late in 1983, months before they announced a boycott of the Los Angeles Olympics, sports officials of the Soviet Union sent detailed instructions to the head of the nation’s track and field team. Oral steroid tablets were not enough, they said, to ensure dominance at the Games. The team should also inject its top athletes with three other kinds of anabolic steroids. Providing precise measurements and timetables for the doping regimens, the officials said they had a sufficient supply of the banned substances on hand at the Research Institute of Physical Culture and Sports in Moscow, a division of the government’s sports committee. The potent drugs were critical to keeping up with the competition, they wrote in the instructions. The document  —   obtained by The New York Times from a former chief medical doctor for Soviet track and field  —   was signed by Dr. Sergei Portugalov, a Soviet sports doctor who went on to capitalize on a growing interest in new methods of doping. Now, more than 30 years later, Dr. Portugalov is a central figure in Russia’s current doping scandal. Last fall, the World   Agency named him as a key broker of   drugs in Russia, someone who in recent years injected athletes personally and made a business of covering up drug violations in exchange for money. Revelations of the recent schemes, which antidoping authorities said dated back at least a decade, compelled the international governing body for track and field to bar Russia’s team from the Rio Games, the most severe doping penalty in Olympic history. At the track and field events here this week, no one will represent Russia, a nation that is usually a fixture on the medals podium. The 1983 document and the account of Dr. Grigory Vorobiev, the former chief medical doctor, who spent more than three decades with the Soviet track team, provide new evidence of how far back Russia’s   doping stretches. At 86 years old, Dr. Vorobiev still stands more than six feet tall. Before finishing medical school in St. Petersburg, then known as Leningrad, he played for the Soviet Development Basketball Team in the 1950s, choosing not to pursue a professional athletic career because he thought it unstable. He was coached, he noted proudly, by the man who later led the Soviet Union to an upset victory over the United States at the 1972 Olympics. His career in Russian sports medicine lasted through the 1990s. In deteriorating health, Dr. Vorobiev left Moscow five years ago for Chicago, where his son and grandchildren live. Over two days of interviews there, in an   complex with   newspapers lying around the lobby, Dr. Vorobiev wore a blue Soviet tracksuit with “CCCP” on the back as he recounted his career. He spoke at the encouragement of his son, who had accompanied him to the hospital in recent weeks and said he wanted his father’s life documented in light of the recent doping revelations. Dr. Vorobiev, speaking Russian that was translated by his son, recalled some details more vividly than others, relying on journals, documents and    photographs of athletes in motion to trigger memories dating to 1959, when he was hired as one of the Soviet Union’s first   sports doctors. He specialized in improving coordination, strength and flexibility among elite athletes, with expertise in foot injuries. With little emotion, he described a system in which winning at any cost without getting caught was paramount. He projected loyalty to his country while plainly wrestling with contradictions: As a member of the medical commission of track and field’s global governing body, he policed doping at international competitions while knowing that many of Russia’s top athletes were using banned substances. Russia’s sports ministry and sports science institute did not respond to telephone and email requests for comment. Dr. Vorobiev said he was not sure whether the doping scheme detailed in the 1983 document was carried out. Regardless, the communication captures the   mentality of the nation’s sports committee, which he said intensified over time as athletes became preoccupied with drugs. By the 1970s, he said, most of the several hundred athletes with whom he worked were asking about   drugs, particularly after traveling to international competitions. When athletes sought advice in individual consultations, he said, he told them to take “as low a dose as possible,” cautioning them to watch for cramps or changes in voice as signs that they had overdone it. Most of all, he stressed that drugs were not a substitute for rigorous training. Not everyone chose to use illicit substances, he said, defending Soviet sports as not uniformly tainted. He was unable to estimate how many athletes had used drugs, adding that some who had shown drastic physical changes had denied doping during private consultations with him. But low doses of oral steroids were common among top track athletes, Dr. Vorobiev said, asserting that if he had dissuaded them from taking drugs, he would have been blamed for poor results and summarily fired. East Germany, later found to have run an aggressive doping program, was a particular motivator after the 1976 Olympics, in which the country won nearly as many gold medals as the Soviet Union. The antidoping movement was in its infancy at that time the World   Agency, the regulator of drugs in sport, was not created until more than 20 years later. Still, sports officials were conscious of the need to combat drugs at major competitions. Anabolic steroids had been banned by the International Olympic Committee, and testing for them debuted at the 1976 Games, making the regimen that Soviet officials proposed for Los Angeles unambiguously prohibited. Dr. Vorobiev said he had consistently opposed steroid injections  —   typically administered with a shot in the thigh or buttocks. He considered that method too concentrated and too dangerous, he said. The 1983 letter  —   addressed to Dr. Vorobiev’s boss, the head of Soviet track and field  —   cited competition as a main motivation for adding injections to the “special pharmacological profiles” already developed for national athletes following a meeting of the country’s sports committee on Nov. 24, 1983. (The letter was translated independently from the original Russian by The New York Times.) The three additional drugs were Retabolil, Stromba and   forms of the steroids nandrolone decanoate and stanozolol. The officials had enough Retabolil in their possession, they said. “A range of data,” the letter said, “proves that the main opponents of Soviet athletes will use the aforementioned injection form of anabolic steroids at the upcoming Olympic Games. ” The letter  —   signed and archived by Dr. Portugalov, and bearing the signature of a colleague at the Institute for Physical Culture, Roshen D. Seyfulla  —   said that top athletes with chances of winning medals were prime candidates for injections. It suggested paying particular attention to those who had performed well while taking oral steroids. Three to five vials of 50 milligrams each should be injected into those athletes, the officials instructed, with the final doses administered 145 to 157 days before the Olympics. Drawn into the plot, according to the document, was the Soviet antidoping lab, which the officials  —   mindful of Olympic    —   had recruited to determine how long the steroids in question would linger in the system. “There is only one basic reason to reject the injection form  —   the lack of definite data about how much time it takes to clear the body,” the letter said. “We will have the official recommendation and conclusion no later than Dec. 15, 1983,” it continued, suggesting that national sports officials and antidoping authorities were colluding to cover up doping. Such collusion happened in Russia as recently as last year, antidoping investigators said in a report last month, detailing how the national   lab helped formulate special drug cocktails for Russian athletes and covered up drug violations on orders from the country’s sports ministry. In May 1984, about five months after the document outlining a doping plan was circulated, the Soviet Union withdrew from the Los Angeles Games, citing the “  actions of the U. S. authorities and organizers of the Games” in a statement. “Chauvinistic sentiments and an   hysteria are being whipped up in the country,” it said. But the fixation on beating the competition by using banned substances did not end, Dr. Vorobiev said. He described an atmosphere in which winning was supremely important, in which drugs displaced training as the primary method of preparation, and in which Dr. Portugalov’s profile continued to rise. For decades, Dr. Portugalov was a   figure outside Russia. Inside the country, however, he was a “fairly authoritative and very knowledgeable” figure who was not shy about advertising access to the best   substances, according to Dr. Vorobiev. Dr. Vorobiev said that his own philosophy on developing elite athletes was not aligned with that of Dr. Portugalov’s, and that he preserved the document over several decades because he considered it proof of how Dr. Portugalov was masterminding the Soviet   program. Dr. Portugalov came to global prominence in 2014 when two Russian   identified him as a linchpin distributor in Russia’s   doping scheme. Yuliya Stepanova and Vitaly Stepanov, a married couple  —   she a   runner and he a former employee of Russia’s antidoping agency  —   told the German public broadcaster ARD that Dr. Portugalov had provided Ms. Stepanova with   drugs and outlined a tiered payment system whereby he received a   percentage of winnings, depending on whether an athlete won gold, silver or bronze medals. “He bragged to Yuliya that over the past few decades, he had made so many Olympic champions,” Mr. Stepanov said in an interview this summer, describing Dr. Portugalov as “arrogant” and more interested in turning a profit than seeing athletes succeed. An investigation commissioned by the World   Agency confirmed Ms. Stepanova’s account and concluded that Dr. Portugalov’s enterprise stretched much wider. In the wake of a damning report published by the antidoping agency last fall, Dr. Portugalov was suspended from Russian track and field and from his post at Russia’s sports research institute. Dr. Portugalov could not be reached directly by The New York Times. Neither the track organization nor the government institute responded to emailed requests for information about his employment status or ways to reach him. His name is no longer listed on the website of either organization. A spokesman for WADA said the Russian ministry of sport had told the agency that Dr. Portugalov no longer worked for the government. Investigations into his work, meanwhile, are continuing last month, the global governing body for swimming appointed a lawyer to look into claims that Dr. Portugalov provided drugs to Russian swimmers. Richard W. Pound, the former president of the antidoping agency who led last year’s investigation into doping in track and field, called the 1983 document an unsurprising indication of the long history of Russia’s doping program. “It shows the foundation on which a lot of this has been built,” he said. “The system we encountered is not new. It’s a continuation of the Soviet days. ” Russia has responded to the charges of systematic,   doping with a mix of defiance and contrition. President Vladimir V. Putin has criticized scrutiny of the country as being politically motivated, but he has also suspended implicated officials and announced broad efforts to change Russian attitudes toward doping in sport. “It’s a problem of culture and education,” Russia’s sports minister, Vitaly Mutko, said in an interview this summer, noting that he had told Mr. Putin in 2009 that doping was a “black spot” on the country. “Our aim is to have a healthy nation,” Mr. Mutko said. “We’re moving away from the old Soviet legacy. ” Dr. Vorobiev’s career with the national team ended after he was blamed for an athlete’s drug violation in the  . The violation in question, he said, involved the drug Phenotropil, which was used by Russian astronauts and military members to combat fatigue. He is characteristically pragmatic about the terms on which his   tenure ended. “That’s life,” he said, expressing a steady loyalty to the ministry while criticizing people like Dr. Portugalov who, he said, corrupted sports and shifted focus away from skillful coaching. “Am I happy now that the problems have surfaced 20 years later?” he said, referring to his 1996 departure. “It was inevitable. ” Well into his retirement, Dr. Vorobiev remains intensely interested in discussing physical preparations for competition, asking a reporter for her exercise routine. “Do you agree that training is more important than steroids?” he said after four hours of discussing doping, during which he often pounded his fist and foot for emphasis. Dr. Vorobiev is blind in one eye and has weak vision in the other. He rarely turns on the television, which sits atop a small piece of furniture that holds   athletic socks. He did, however, plan to watch the track and field events in Rio this week, and he neither condemned nor condoned the recent doping scandals that had precipitated the ban on Russia’s team. He expressed a statesmanlike support of “the Olympic movement” and of decisions about who could compete. “Obviously, it would be better with Russia,” he said, shrugging    in his Soviet team uniform. “I hope this will be a lesson to train harder, and maybe there will be less steroids as a result. ”'"}, "time": 1742562925.5394673}