{"duration": 0.10844993591308594, "input_args": {"text": "'After a swelling tide of protests, the president of Yale announced on Saturday that the university would change the name of a residential college commemorating John C. Calhoun, the   white supremacist statesman from South Carolina. The college will be renamed for Grace Murray Hopper, a trailblazing computer scientist and Navy rear admiral who received a master’s degree and a doctorate from Yale. The decision was a stark reversal of the university’s decision last spring to maintain the name despite broad opposition. Though the president, Peter Salovey, said that he was still “concerned about erasing history,” he said that “these are exceptional circumstances. ” “I made this decision because I think it is the right thing to do on principle,” Mr. Salovey said on a conference call with reporters. “John C. Calhoun’s principles, his legacy as an ardent supporter of slavery as a positive good, are at odds with this university. ” Mr. Salovey and the other members of the Yale Corporation, the university’s governing body, made their decision after an advisory committee unanimously recommended the renaming. The school is still determining when exactly the change will be carried out, but Mr. Salovey said it would be by fall at the latest. Students reacted with joy to a change many said was long overdue. “There’s a huge sense of relief and celebration,” said Rianna   21, a senior from Ann Arbor, Mich. who was involved in the protests. “Students of color have been fighting for this change for decades and it’s hard to believe this day is finally here. ” Online, some students found inspiration in a quotation from Ms. Hopper, who died in 1992. “Humans are allergic to change,” she once said. “They love to say, ‘We’ve always done it this way.’ I try to fight that. ” Calhoun, the nation’s seventh vice president, attended Yale and was its valedictorian. The name of the college incited controversy almost as soon as it opened in 1933. Many black students staged demonstrations and referred to the college, which was decorated with depictions of slaves carrying bales of cotton, as the “Calhoun Plantation. ” Opposition may have peaked in 2015, after the massacre of nine worshipers at a black church in Charleston. The killings, by an avowed white supremacist, prompted protests that led to the removal of the Confederate battle flag outside the South Carolina Statehouse and elsewhere. Yale was seized that fall by a series of demonstrations from students, faculty and alumni who objected to the Calhoun name, as well as to what they saw as a larger climate of racial inequality on campus. Many universities, domestic and abroad, have faced similar pressure in recent years to eradicate names and symbols of racism and colonialism on campus. That resistance notwithstanding, Mr. Salovey announced last April that Yale would preserve the Calhoun name. At the same time, he revealed that the university’s two new residential colleges would be named for Benjamin Franklin and Anna Pauline Murray. The honoring of Ms. Murray, a legal scholar and civil rights activist who graduated from Yale Law School in 1965, was widely hailed as the first such distinction bestowed on either a woman or an  . But the selection of Franklin, who was once a slaveholder himself, was derided by many students, particularly after it became clear that he was chosen in deference to a suggestion by Charles B. Johnson, a businessman who donated $250 million for the new buildings  —   the largest gift in the school’s history. Addressing a related concern, the school also decided then that the leaders of the residential colleges would no longer use the title “master,” and would instead be called “heads of college,” a recognition of the discomfort many students felt toward the previous honorific’s evocation of slavery. The Calhoun and Franklin decisions reignited protests from student activists, who held a “renaming ceremony” in front of the college in which they called it “the college formerly known as Calhoun. ” At a town   meeting soon after, students showered Mr. Salovey with fake $1 million bills, a protest against what they saw as the university prioritizing its financial interests over their concerns. The dissent did not come only from students. Over the summer, a black dishwasher in Calhoun smashed a stained glass windowpane that depicted slaves working on a plantation, because he said he found the image degrading. And on Friday, four demonstrators protesting the Calhoun name were arrested for blocking the street. Still, despite their delight about the renaming, many students hope that the university will continue to move beyond symbolism to address more pressing issues of racial inequality on campus, like the dearth of black faculty members. During the fall 2015 protests, the university announced that it was committing $50 million to a   initiative to confront the fact that less than 3 percent of its arts and sciences faculty is black. But since that time, several prominent black professors have left the university. About 11 percent of Yale’s roughly 5, 400 undergraduates identify themselves as black or  . “This is definitely a victory, but we’re not done fighting,” Ms.   said. “It’s our job to keep pushing Yale in the right direction. ”'"}, "time": 1742563085.1141348}