{"duration": 0.07909584045410156, "input_args": {"text": "'by Jerri-Lynn Scofield \\nJerri-Lynn here: This short post by Jack Gao of the Institute for New International Thinking (INET) highlights a pressing problem afflicting the world economy: the slowdown of international trade. As the post summarises, there’s no consensus among economists on the causes for that slowdown. \\nOne major quibble with the post. Gal’s passing statement below, “The desire of those hurt by globalization to shield themselves from foreign competition via protectionist or retaliatory policies is a growing influence in the political life of a number of countries, including the world’s most advanced democracies,” seems to fail to grasp the true basis for widespread opposition to pending so-called “trade agreements”. Opposition movements are not necessarily motivated by opposition to trade per se, but by concerns over transparency, how the gains from these agreements have and will be distributed, and limitations on sovereignty and regulation imposed by procedures such as the Investor-State Dispute Settlement mechanism. And the responses to such concerns under discussion are not what I would describe as traditionally protectionist or retaliatory, but instead combine calls for greater transparency, attention to distributional issues, and a halt– or at minimum, profound rethink– of measures that constrain sovereignty or stymie effective regulation (e.g., threats to the European Union’s precautionary principle). To be fair, these issues are peripheral to Gao’s major aim in the piece, which is to account for the slowdown in international trade. \\nI should also remind readers who’re only familiar with Paul Krugman through his New York Times column that his initial academic work concerned international trade. \\nBy Jack Gao, who is a Program Economist at the Institute for New Economic Thinking (INET), with interests in international economics and finance, energy policy, economic development, and the Chinese economy. He previously worked in financial product and data departments in Bloomberg Singapore, and reported on Asian financial markets in Bloomberg News from Shanghai. Jack holds a MPA in International Development from Harvard Kennedy School, and a B.S. in Economics from Singapore Management University. Originally published at the Institute for New Economic Thinking Website . \\nChallenged by mathematician Stanislaw Ulam to name one idea in economics that was both true and non-trivial, Nobel economics laureate Paul Samuelson famously nominated comparative advantage — the notion that even a country less productive in producing everything, could still benefit from international trade by specializing in the commodity it faces the least disadvantages in producing. But comparative advantage fails to explain why international trade, which has underpinned the global economy for much its modern history, is showing signs of a slowdown. \\nOriginally attributed to the English classical economist David Ricardo and later formalized by generations of economists including Samuelson, trade theories rooted in comparative advantage hold that free trade should raise the overall welfare of all nations that engage in it. Wages of Chinese workers should rise, as would income levels of American capital owners, if the two countries open up to trade. And any negative impact domestically could be ameliorated by making the necessary transfers to compensate those hurt by trade. The remarkable rise in the living standards of citizens in Japan, the four “Asian Tiger” economies, and most notably China, are testaments to free trade working its magic. \\nHowever, many find the marked slowdown in global trade since the 2008 financial crisis as puzzling as the tepid GDP growth that has accompanied the recovery. \\nFirst, some facts. In the heyday of its economic expansion, China’s current account surplus stood at more than 10% of its GDP; that figure was a mere 2% for the first half of this year. The IMF has documented a 3% annual expansion of global trade since 2012, less than half of its annual growth rate in the previous three decade. This trend holds within developed countries, as well as between developed and developing countries. \\nExperts are debating the underlying causes of the trade slowdown. The most obvious explanation may be to point to the disruption caused by the 2008 financial crisis, and the prolonged weakness in subsequent economic activities. With the collapse of the western financial system, world economic growth dipped into negative territory for the first time in recent history — from its pre-crisis level of around 4% — and global trade decline ensued. Since then, however, trade, which has historically grown at twice the rate of GDP growth, has grown more or less in tandem with the sluggish output recovery. Clearly, something else is causing the breakdown. \\nAnother explanation frequently offered has been the restructuring in China. The world’s second largest economy, which in recent decades powered the world’s economic activities, had been an even more important driver of growth in world trade. But after 2008, Beijing put more emphasis on domestic economic concerns instead of promoting foreign trade. This rebalancing, however, represents a response to the fall in external demand rather than a deliberate strategy to turn away from trade, and thus is unlikely to be causing the global trade decline. \\nThe WTO warned that these trends could damage an already weak world economy. The desire of those hurt by globalization to shield themselves from foreign competition via protectionist or retaliatory policies is a growing influence in the political life of a number of countries, including the world’s most advanced democracies. But while they may pose serious threats to the future of globalization, protectionist policies have not been implemented on a time frame that could have caused the trade slowdown. Nor is the decline in trade restricted to commerce between countries where populist influence is strongest. \\nEconomist Paul Krugman sees the answer lying in the relative speed of technological progress in transportation and the rest of the economy. Real transport costs could rise, according to Krugman, if the technological advances in transportation are slower than the economy-wide technological changes. Economists in the IMF believe believe changes in the pace of international vertical specialization, the decision to use domestic versus imported inputs, are causing the lackluster expansion of trade. All of these explanations, however, seem unlikely in the context of a world of such great differences in cost and technology — precisely the conditions under which, through the logic of comparative advantage, free trade promised such universal benefits. \\nIf the causes of a slowdown in global trade remain a matter of ongoing debate, its impact and implications for the global economy are unmistakably real and increasingly urgent. 0 0 0 0 0 0'"}, "time": 1742562244.0706153}