{"duration": 0.16874194145202637, "input_args": {"text": "'The Psychopathic and Insincere Jihad Islam’s natural appeal to “criminals, psychopaths, and murderers.\" October 28, 2016 \\nRaymond Ibrahim is a Shillman Fellow at the David Horowitz Freedom Center. \\nWhenever Muslims engage in behavior that ostensibly contradicts Islam—from taking drugs and watching porn to killing fellow Muslims —Islam’s apologists loudly proclaim “Aha, see, they’re not true Muslims!” Or, in the words of CIA head John Brennan on the Islamic State: “They are terrorists, they’re criminals. Most—many—of them are psychopathic thugs, murderers who use a religious concept and masquerade and mask themselves in that religious construct.” \\nOverlooked is that many self-styled jihadis are indeed “psychopathic thugs, murderers”; some may not even believe in Allah at all. Yet this does not exonerate Islam, for its “religious construct” was designed to entice such men. \\nAs usual , this traces back to the prophet, Muhammad. After telling his followers that Allah had permitted Muslims four wives and limitless concubines (Koran 4:3), he later claimed that Allah had delivered a new revelation (Koran 33.51) permitting him, Muhammad alone, to marry and sleep with as many women as he wanted. In response, his young wife Aisha quipped: “I feel that your Lord hastens in fulfilling your wishes and desires.” (Apostates from Islam regularly cite this episode as especially disenchanting them with the prophet.) \\nBut it is the concept of jihad that especially comports with those who seek to indulge their carnal appetites. For whoever fights in the name of Allah and/or seeks to empower Islam—that is, jihadis/terrorists—is exonerated of all blame and, if he dies fighting, guaranteed the highest levels of paradise (where more sex awaits). \\nThat’s because Allah made a “pact” with them. According to Koran 9:111: “Allah has bought from the believers their lives and worldly goods, and in return has promised them Paradise: they shall fight in the way of Allah and shall slay and be slain…. Rejoice then in the bargain you have struck, for that is the supreme triumph.” Muhammad elaborated: “Lining up for battle in the path of Allah [jihad to empower Islam] is worthier than 60 years of worship.” Moreover, The martyr is special to Allah. He is forgiven from the first drop of blood [that he sheds]. He sees his throne in paradise…. He will wed the ‘aynhour [supernatural, celestial women designed exclusively for sexual purposes] and will not know the torments of the grave and safeguards against the greater horror [hell]. Fixed atop his head will be a crown of honor, a ruby that is greater than the world and all it contains. And he will copulate with seventy-two ‘aynhour. \\nAs for those Muslims who reject jihad, Muhammad said “they will be tortured like no other sinful human.” (For many more Islamic scriptures depicting jihad as the greatest undertaking, one that earns unconditional forgiveness and paradise, see here .) \\nThere is no denying that the historic growth of Islam is related to its carnal incentives. After more than a decade of preaching in Mecca, Muhammad had about 100 followers, mostly relatives. It was only when he became a successful warlord and caravan raider that his followers grew and multiplied. So long as such fighters helped spread the banner of Islam into infidel lands, they were deemed good and pious Muslims—regardless of their true intentions, priorities, or even faith. \\nMany of the original jihadis now revered in Islamic hagiography were by modern standards little more than mass killing psychotics. Consider Khalid bin al-Walid: a Meccan pagan, he opposed Muhammad for years; but when the prophet seized Mecca, Khalid—like many of Muhammad’s foes, such as his archenemy, Abu Sufyan—expediently converted, proclaimed the shahada , joined the winning team, and then went a-jihading—mutilating, plundering, raping, enslaving, crucifying, and setting people on fire in the process. But because he did so under the banner of jihad, this serial killer and rapist is today one of Islam’s most revered heroes. \\nThe reason for this is that nowhere in Islam is there talk about the “condition” of the jihadis’ “heart,” or if he’s “right” with God. Allah is not God: he is not interested in “hearts and minds” but in fighters and swords. So long as his fighters proclaim the shahada —“There is no god but Allah and Muhammad is his messenger”—and fight under the banner of Islam, they can take, plunder, murder, and rape the infidels; and if they die doing so, they go to paradise. \\nSuch was the genius of Muhammad: in the Arabian society he lived in, members of one’s tribe were as inviolable as non-members were free game, to be plundered, enslaved, or killed with impunity. Muhammad took this idea and infused it with a pious rationale. Henceforth there would be only two tribes in the world: the umma —which consists of all Muslims, regardless of race—and the “infidels,” who deserve to be plundered, enslaved, or killed with impunity for rejecting Allah. \\nThis explains why other tribal/nomadic societies—Turks and Mongols/Tatars, whose way of life consisted of preying on everyone outside their tribe—also converted to Islam and, under the banner of jihad, continued preying on the other, the infidel, but now as venerated “champions of the faith.” \\nChristian Europe was aware of Islam’s true appeal from the very beginning. Theophanes the Byzantine scholar (d. 818) wrote the following about Muhammad in his chronicles: He taught those who gave ear to him that the one slaying the enemy—or being slain by the enemy—entered into paradise [see Koran 9:111]. And he said paradise was carnal and sensual—orgies of eating, drinking, and women. Also, there was a river of wine … and the women were of another sort, and the duration of sex greatly prolonged and its pleasure long-enduring [e.g., Koran 56: 7-40, 78:31, 55:70-77]. And all sorts of other nonsense. \\nCenturies later, St. Thomas Aquinas (d. 1274) made similar observations: He [Muhamad] seduced the people by promises of carnal pleasure to which the concupiscence of the flesh urges us. His teaching also contained precepts that were in conformity with his promises, and he gave free rein to carnal pleasure. In all this, as is not unexpected; he was obeyed by carnal men. As for proofs of the truth of his doctrine…. Muhammad said that he was sent in the power of his arms—which are signs not lacking even to robbers and tyrants. What is more, no wise men, men trained in things divine and human, believed in him from the beginning. Those who believed in him were brutal men and desert wanderers, utterly ignorant of all divine teaching, through whose numbers Mohammed forced others to become his follower\\'s by the violence of his arms. \\nThere is, finally, another group of Muslims who should not be overlooked. These do not give a fig for Allah nor wish to be “martyred” in exchange for paradise, but they rely on Islam to justify robbing, enslaving, raping, and killing non-Muslims, as many Christian minorities in nations like Pakistan and Egypt will attest. Because their victims are just “infidels”—and it’s a sin to aid a non-Muslim against a Muslim (that is, a non-tribal member against a tribal member)—Muslim criminals target non-Muslim minorities precisely because they know Muslim authorities will not do a thing on behalf of the victimized infidels. \\nIn short, enough of these claims that this or that jihadi is, in the words of the CIA’s Brennan, “terrorists,” “criminals,” “psychopathic thugs,” and “murderers.” Yes, they are. But that doesn’t change the fact that one group of them is convinced that no matter how immoral or perverse their behavior is, as long as they continue fighting and dying in the name of jihad, paradise is assured them; and another group doesn’t care a bit about the afterlife, but knows that, as long as they only victimize “infidels,” no Muslim will hold them accountable. In both cases, Islam aids and abets their behavior.'"}, "time": 1742563612.349259}