{"duration": 0.08494281768798828, "input_args": {"text": "'For more than half a century, Hubert Edward Spires has lived with the painful memory of being kicked out of the Air Force as a young gay sergeant in the 1940s. The word “undesirable” was printed on his discharge records. But now, at 91, Mr. Spires said he can finally be at peace with that part of his life. On Friday, he was awakened by a phone call to his Connecticut home and learned that the Air Force Board for the Correction of Military Records had agreed to change his status. This time, his discharge would be described as “honorable. ” “It was a long haul,” Mr. Spires said on Tuesday in phone call from his home in Norwalk. “I got the confirmation that I had been looking for. ” Said his husband, David Rosenberg, whom he met in 1956 and married eight years ago: “His first words were, ‘It’s about time.’ ” Mr. Spires is one of the hundreds of gay former military personnel who have been emboldened by the 2010 repeal of the United States military’s Don’t Ask, Don’t Tell policy, which prohibited gay men and lesbians from serving openly in the military. In 2011, the federal government allowed changes to veterans’ military records, some of which had been labeled “undesirable” or “other than honorable. ” The incentives for doing so were sometimes financial. Such designations could make it difficult for the men and women who had served to get employment, loans or access to veterans benefits. But there was another, more important reason. “The respect factor,” said Matt Thorn, an executive director at   Legal Defense Network, which helps veterans with the application process needed to reverse such designations. “I served my country honorably I want that respect. And they should have that. ” Mr. Thorn said many go through an application process that can take up to 18 months. But for Mr. Spires, who recently recovered from pneumonia, it took years of effort that will now allow him to have a burial, when the time comes, with military honors. “I have to quietly go back into my shell now,” he said. “Because I am 91 years old, and my health is not all it should be. I can’t take on jobs that require energy because I don’t have it anymore, but I had it long enough to fight the G. D. Air Force and win,” he said. Brooke Brzozowske, a spokeswoman for the Air Force, said the service branch had denied 27 out of 157 requests for upgrades since the policy was repealed. “We were not necessarily discharging people for just being gay,” she said. “It was associated with misconduct if it was a dishonorable discharge. ” The military corrections board first received Mr. Spires’s application to get his status upgraded in 2014, but some of his discharge records had been destroyed in a fire in 1973 that also consumed those of other veterans of World War II, the Korean War and the Vietnam War, according to a copy of the records board statement about his case. Other documents found in 2016 showed he served in the military from 1946 to 1948, when he was discharged from Lackland Air Force Base in San Antonio. To help his case, Mr. Spires also filed a lawsuit in Federal District Court for the District of Connecticut in November, assisted by the Yale Law School’s Veterans Legal Services Clinic. The lawsuit asserted that Mr. Spires’s rights had been violated after he encountered unreasonable delays in the Air Force review to change his discharge status to “honorable. ” According to the lawsuit and to Mr. Spires account, his life as a young chaplain’s assistant at the base included playing the organ at services and typing letters to distressed families. He attended social events with gay men outside of the base, he said. At a Halloween party in 1947, Mr. Spires dressed in a costume inspired by a sparkly laundry soap. Someone at the party informed his superiors that he was in drag, the lawsuit said. He was interrogated by military officials, threatened with a   and sent to hearings and psychiatrists, the suit says. He signed a statement saying he had engaged in “homosexual acts” to end an interrogation, the lawsuit said. “I never did anything on the base in uniform,” he said. “I had a whole slew of very good friends who were gay and lived off base. We partied together we had wonderful meals together and went to the opera together. We lived a very normal life. I did not dishonor the Air Force in any way by my actions,” Mr. Spires said in the interview. He was discharged and sent home to Lancaster, Ohio, in civilian clothes. Over the years, he destroyed his military records for fear his Catholic family would find out, he said. He found work in department stores and other jobs. He met Mr. Rosenberg in 1956 at a séance in New York. They have been companions ever since, marrying in 2009, Mr. Spires said. The court did not rule on Mr. Spires’s lawsuit, as the Air Force board resumed its review of Mr. Spires’s application. It finally said in its letter last week that he had no misconduct in the military and concluded there was “the existence of an injustice. ” Its recommendation: an honorable discharge dating to March 17, 1948. “I had a terrible time,” Mr. Spires said. “But now I have been able to put so much of that behind me, and now that I have got my honorable discharge, I hope these negative thoughts will leave me permanently. ” He added, “It has allowed me to not have to look over my shoulder all the time. ”'"}, "time": 1742561968.7840683}