{"duration": 0.053792476654052734, "input_args": {"text": "'This post was originally published on this site \\nsott.net/news \\n© Murad Sezer / Reuters An armored police vehicle drives past by the headquarters of Cumhuriyet newspaper, an opposition secularist daily, in Istanbul, Turkey, October 31, 2016. \\nTurkish PM Binali Yildirim has responded to concerns expressed by Ankara’s EU partners over the situation with the freedom of expression in the country, saying that European standards apparently have no importance for Turkey. \\nFollowing Monday’s arrests of the editor-in-chief and other top staff of Turkey’s opposition Cumhuriyet daily, European Parliament President Martin Schulz harshly criticized Ankara’s actions, having called it a part of a “purge… motivated by political considerations, rather than legal and security rationale.” \\nTurkey has once again crossed the “red line” against freedom of expression, the politician wrote on Twitter. \\n“Brother, we don’t care about your red line. It’s the people who draw the red line. What importance does your line have. We draw another red line on top of yours,” Yildirim told members of his ruling AK Party in a parliament speech. \\nImplying that its only the people of Turkey who can hold the government “accountable” for its actions, Yildirim said Ankara would not be intimidated by EU’s “threats”. \\nCrowds gathered by the Cumhuriyet offices during the night, to express their support for the media, Reuters reported. According to Turkey’s journalists’ association, 170 media outlets have been shut down following the attempted coup. \\n“We are not going to learn from you what press freedom is. We support it all the way,” Reuters quoted Yildirim as saying. \\nThe new wave of arrests and investigations of the Cumhuriyet staff come under accusations that the media – which has been critical of President Tayyip Erdogan, had assisted a failed military coup in July. Alleging that the journalists played their part in the coup by publishing “subliminal messages” in their columns, according to Turkish Anadolu agency, prosecutors accused them of supporting Kurdish militants and US-based cleric Fethullah Gulen. The latter is blamed by the government for orchestrating the coup. \\n“[Our European friends] always bring up press freedom when we take steps in our fight against terrorism,” the prime minister said, adding that Turkey has “no problem with press freedom.” \\n[embedded content] '"}, "time": 1742564487.7199683}