{"duration": 0.08863496780395508, "input_args": {"text": "'FMs of Iran, Syria, Russia meet in Moscow Fri Oct 28, 2016 9:48AM Politics Foreign Ministers from Iran, Russia, and Syria, from left, Mohammad Javad Zarif, Sergey Lavrov, and Walid al-Moallem attend their meeting in Moscow, Russia, on October 28, 2016. (Photo by AP) \\nForeign ministers of Iran, Russia and Syria have started trilateral talks on a political solution to the Syria crisis besides a serious fight against the Takfiri terror groups operating in the Arab country. \\nOn Friday, Iranian Foreign Minister Mohammad Javad Zarif and his Russian and Syrian counterparts, Sergei Lavrov and Walid Muallem, gathered in Moscow for a three-way meeting. \\nAhead of the meeting, Lavrov said the three nations are acting as a united front against terrorism, saying their talks are mainly focused on ways of seriously tackling terrorism, particularly in Syria. \\nThe three sides, Lavrov added, will exchange views on humanitarian operations as well as efforts to stop the flow of weapons and military equipment to the foreign-backed militants operating against the Damascus government. \\nPrior to the three-way discussions, Zarif held a bilateral meeting with Lavrov to discuss regional issues and the further enhancement of bilateral Tehran-Moscow ties. Russian Foreign Minister Sergei Lavrov (R) welcomes his Iranian counterpart Mohammad Javad Zarif during a meeting in Moscow on October 28, 2016. (Photo by AFP) \\nUpon his arrival at Vnukovo International Airport in Moscow on Friday morning, Zarif said a political solution besides a serious fight against terrorism is the only way out of the crisis gripping Syria. \\n“Unfortunately, some countries have always pursued war and a military solution in Syria. This is while the solution to this crisis is of a political nature and also [entails] battles against Takfiri groups,” said Zarif. \\nHe added, “We have always emphasized the need for the establishment of an all-out ceasefire, humanitarian operations and efforts to find a political solution to the Syrian issue.” \\nFollowing the trilateral talks, the three ministers attended a joint press conference. \\nDuring the presser, Muallem slammed the US-led coalition purportedly fighting Daesh, saying the alliance has never been fighting terrorism despite its claims. \\nHe said the Washington-led campaign was in fact encouraging Daesh terrorists to move from Iraq’s Mosul to Syria’s Raqqah. \\nMosul and Raqqah have served as the main Daesh bases in the Middle East over the past years. Iraqi and Syrian armed forces are engaged in large-scale military offensive to drive the terror group from the two cities. \\nThe Syrian foreign minister further said his country would continue cooperation with Iran and Russia in efforts to eradicate terrorism. \\nMuallem described the atmosphere of the talks in Russia as “positive” and “very comfortable.” \\n“We in Syria have become convinced of the sincerity of the Russian and Iranian efforts in helping us rout terrorism,” he added. Russian Foreign Minister Sergei Lavrov (C), Syrian Foreign Minister Walid al-Muallem (R) and Iranian Foreign Minister Mohammad Javad Zarif attend a news conference in Moscow, Russia, October 28, 2016. (Photo by Reuters) \\nZarif, in turn, described the talks in Moscow as “very productive,” saying Iran and Russia have developed “very close” relations in different areas. \\nCommenting on the situation in Syria, the top Iranian diplomat said Syria’s sovereignty and territorial integrity must be protected, adding that it is up to the Syrian nation to determine its own destiny and that the voice of the Syrians must be recognized. \\nHe further highlighted the need for a political settlement of the crisis, adding that Tehran backs the resumption of peace talks between the Syrian government and opposition. \\nThe Iranian minister called for a ceasefire in Syria, joint battles against terror groups as well as efforts to facilitate aid delivery to Syrian civilians in besieged areas. \\nHe said the global community must unite in the battle against terrorism, which poses a threat not only to Syria, but the entire world. \\nZarif added that supporting terrorism would serve the interest of no one, warning that the terror groups would eventually “bite the hands that feed them.” \\nFor his part, the Russian foreign minister also touched on the Mosul battle in Iraq, saying that Iraqi city’s liberation from Daesh would have a significant impact on the balance of power in neighboring Syria. \\nLavrov said the political settlement in Syria should be achieved through dialogue according to the Security Council resolutions, welcoming Syria’s readiness to resume the stalled talks with the opposition. \\nReferring to the situation in Aleppo, Lavrov said terrorists blocked the exit routes opened as part of a Syrian humanitarian pause and prevented the civilians from leaving the eastern neighborhoods of Aleppo City. \\nThe senior Russian official also criticized the international organizations for failing to fulfill their duties towards the locals of eastern Aleppo. \\nLavrov emphasized that the fight against terrorism in Syria will continue, adding that “future common steps” in this regard during the Moscow talks. Loading ...'"}, "time": 1742564586.8510997}