{"duration": 0.04102325439453125, "input_args": {"text": "'Chronicles: A Magazine of American Culture October 28, 2016 \\nPerhaps one of the most used and abused political expressions in recent years has been that of “American exceptionalism.” Politicians and commentators routinely invoke it as a high principle and accuse their opponents of insufficient devotion to it, or contrariwise blame it for all the ills of the world. \\nFor example, in 2013, Russian President Vladimir Putin ruffled many Americans’ feathers: \\n“It is extremely dangerous to encourage people to see themselves as exceptional, whatever the motivation. . . . We are all different, but when we ask for the Lord’s blessings, we must not forget that God created us equal.” \\nHillary Clinton weighed in on exceptionalism in an August speech before the American Legion, in which she also took a swipe at Donald Trump : \\nThe United States is an exceptional nation. . . . But, in fact, my opponent in this race has said very clearly that he thinks American exceptionalism is insulting to the rest of the world. In fact, when Vladimir Putin, of all people, criticized American exceptionalism, my opponent agreed with him, saying, and I quote, ‘if you’re in Russia, you don’t want to hear that America is exceptional.’ Well maybe you don’t want to hear it, but that doesn’t mean it’s not true. \\nIt needs to be asked, though: when people praise or criticize “American exceptionalism,” are they always talking about the same thing? \\nAmerica, like any country, has its own distinctive history, culture, and traditions. America’s unique founding principles—consent of the governed, due process, a constitutionally limited division of powers, representative government—justly have been an inspiration to the world for over two centuries. Thomas Jefferson wrote of the “palpable truth, that the mass of mankind has not been born with saddles on their backs, nor a favored few booted and spurred, ready to ride them legitimately, by the grace of God.” \\nThis “exceptional” idea was new in human history. Any American worthy of the name justly takes pride in it. This is the genuine American exceptionalism of Washington, Jefferson, and Madison, lately championed by Reagan. The fact that we have strayed so far from it, both domestically and internationally, is shameful. \\nThe unique moral revolution to which the Founding Fathers pledged their lives, their fortunes, and their sacred honor has little connection to the bastard term (usually capitalized as “American Exceptionalism”) that describes post-Cold War U.S. global behavior, by which policymakers in Washington assert both an exclusive “leadership” privilege and unsupportable obligation to undertake open-ended international missions in the name of the “Free World” and the “international community.” This is the counterfeit “Exceptionalism” of a tiny clique of bipartisan apparatchiki —GOP “neoconservatives” and Democrat “liberal interventionists” and their mainstream media mouthpieces —who have little regard for our country’s oldest traditions or the security and welfare of the American people. Tags: Edward Lozansky is president of the American University in Moscow.'"}, "time": 1742562982.9828422}