{"duration": 0.03193807601928711, "input_args": {"text": "'U.S.Army 4.7mm anti-aircraft gunsare lined up in the final assembly area of the Grand Rapids stamping division of Fisher Body in Detroit on June 1, 1944, prior to shipping.\\nMUNICH — World War II marked a crucial turning point for U.S. empire building and the growth of global capitalism, according to the historical analysis of noted political philosopher and scholar Noam Chomsky.\\nChomsky examined U.S. domination of world affairs in “ Who Owns The World? ,” a speech he delivered at the University of Massachusetts Amherst in 2012. In May, he published a book, “Who Rules The World?,” which examines similar themes.\\nWatch ‘ Noam Chomsky: Who Owns the World? Resistance and Ways Forward ‘ :\\nHe revisited the topic in a recent conversation with Zain Raza, a senior editor at the independent media outlet acTVism Munich. An excerpt from that conversation was published on Tuesday as part of acTVism Munich’s “Reexamining History” series .\\nMuch of the U.S. government’s global strategy both during and after World War II was based on a plan proposed by the State Department and the Council on Foreign Relations , which Chomsky describes as the “major, non-governmental institution concerned with foreign affairs” whose membership “draws from a wide range of elite elements, business, politics, academics, and so on.”\\nBetween 1939 and 1945, the State Department and the Council on Foreign Relations held regular strategy meetings to develop a post-war economic plan. These meetings led to proposal under which the United States would dominate a vast swath of the globe that came to be known as the “Grand Area,” Chomsky said. Explaining that the “Grand Area” would include “the Western Hemisphere,” Chomsky said:\\n“It included the former British Empire, which the U.S. was intending to largely take over, maybe Britain would be a junior partner. And as much of Europe, the commercial and industrial center of Europe, as much of that as possible. Certainly Western Europe, its industrial, technological, commercial center.”\\nWithin the “Grand Area,” Chomsky continued, “the United States would have pretty much complete economic and political control.”\\nWith the collapse of the German economy after the war, and amid the beginnings of the Cold War with Russia and China, the United States was in a unique position to implement this plan. Chomsky said:\\n“The war was very beneficial to the U.S. economy. Its industrial production virtually quadrupled, wartime spending ended the Depression, which had not been ended before — enormous stimulus to the economy. The technology that was developed just laid the basis for post-war growth. In that context ‘Grand Area’ planning of the kind I described was by no means unrealistic.”\\nFar from a Pentagon pipedream, the “Grand Area” became concrete U.S. foreign policy, and its effects linger to this day.\\n“If you look at the policies implemented and developed in the early post-war period, they follow these prescriptions pretty closely,” Chomsky said.\\nAs Chomsky and other historians have observed, Washington’s plans to dominate the “Grand Area” led directly to the Vietnam War. They were also crucial in the development of the International Monetary Fund , which continues to disrupt global economies for the benefit of multinational corporations and the military-industrial complex.\\nWatch ‘ Reexamining History with Noam Chomsky: New World Order & the Grand Area ‘:'"}, "time": 1742628557.2576942}