{"duration": 0.12628889083862305, "input_args": {"text": "'Chief among my favorite Facebook memories is the time that a   journalist of my acquaintance breezily informed us all that he was at the Grill Room of the Four Seasons with Ted Danson, tucking into some sea urchin. To which one friend responded, “That’s funny, because I’m at the Midtown tunnel with Rhea Perlman, eating shawarma. ” While some frequent users of social media are merely fabulous, others savvily buff their fabulousness to a dazzling gleam, becoming fahvolous. At no point in the year is this more evident than in August and early September, when Facebook and Instagram swell with the plump, juicy,   harvest of summer: vacation photos. What prompts the excessive posting of these pictures? William Haynes, a    comedian who hosts the SourceFed show “People Be Like,” said: “I like how my generation is all about sharing. What’s the point of having a vacation unless you can tell people about it immediately? If you can get a few Instagram photos out of it, you’ve made your money back. ” Indeed, the motivation behind many fahvolous vacation photos would seem to be a rationalization of large expenditures for the purpose of recreation: a $6, 000 beach rental ought to bring you $6, 000 worth of pleasure, and maybe posting a photo will get the dopamine flowing. But one can detect other motives, too: a   attempt at   a neurotic attempt to thank your host, a need for constant scrutiny. Noxious selfie sticks now seem like nothing compared to the sophisticated camera filters that can turn an   strawberry patch into a brooding welter of   chiaroscuro. Some people even hire professional photographers to take their vacation snaps for them. In the future, it may be unsurprising at a lakeside picnic to hear a   nephew turn to his Aunt Marjorie and ask: “What’s your day rate?” Equally jarring, some Instagram and Facebook users seem to want us to know that their summer is more inherently summery than ours: more barefoot, more glistening, more  . These folks are biting into the fresh fig of life, and this biting produces carefree laughter. My natural habitat is an oceanside bonfire where a Viggo Mortensen   strums a weathered guitar! All backyards are enlivened by a spray of    girls in sundresses! Everything I eat in August is cooked on a stick! While it’s fairly easy to categorize the photographically incontinent under the headlines Narcissistic and Insecure, or some combination thereof, the   folks may not have the same clarity about themselves. “People often don’t know that they’re the culprit,” said Marla Vannucci, a clinical psychologist who is an associate professor at Adler University. “I have a client who really wants Likes, so he posts a lot of photos,” Dr. Vannucci said. “When people don’t respond to them, he feels very alone. So he posts more. It’s a cycle like any interpersonal cycle in which we’re doing something that people hate but we’re doing it to try to make people like us. With that type of client, I try to find out what the motivation for posting is: What are the feelings around it? What is he looking for? Then I try to help him find other outlets. ” For those on the receiving end of such founts of images, the critical factors are frequency and tone. On the frequency front, young Mr. Haynes had a good suggestion: “I think you get three photos per location. ” If you can’t remember whether you already posted a picture of that covered bridge, you are in danger of overestimating other people’s interest in covered bridges. The question of tone is more nuanced. In 2014, the software company CyberLink sponsored a poll of 2, 268 adults in the United States, “with the hypothesis,” the company’s senior vice president for global marketing, Richard Carriere, told me, “that some people have a tendency to post photos on social media just to gloat and annoy their friends and colleagues. ” The study found that one in seven who own a smartphone and who use social media would unfollow or block someone who posts what they perceive as boastful vacation pictures. Moreover, one in four will attempt to share a photo within one hour of arriving at their destination  —   which makes many of us want to summon from deep within us the   drama teacher who gets two syllables out of “Breeeeathe. ” The top reasons that those sampled said they would Like or Favorite a picture were: if it showed friends and family sharing a special moment (63 percent) they look happy (58 percent) or they look genuine and natural (48 percent). I expressed surprise to Mr. Carriere that the poll didn’t break down the specifics of bothersome photos. I said, “I’m going to guess that the most troublesome one would be a vacation photo in which your ex is dating someone who’s essentially you, but 15 years younger, and it’s a picture of the two of them in the tiny fishing village in Portugal that you turned your ex on to in the first place. ” Mr. Carriere said, “I would definitely unfriend my ex for that. ” In some instances, people exposed to what they perceive to be a surfeit of photos will express their ire offline. In 2014, the Milwaukee Journal Sentinel published an article about a couple who received an anonymous letter in the mail about their Facebook posts. The letter read, in part, “It’s a little upsetting seeing, hearing and reading about someone’s vacations all year while we all can’t afford one. ” The letter concluded with: “Go have some kids and don’t be so selfish as to only think of yourselves all the time. ” Yet one of the trips the couple had taken was a trip to New York that they had bought at a breast cancer benefit, not to mention the fact that the wife of the couple works as a psychotherapist who specializes in helping sexually and physically abused children. Equally odd were the facts that the letter’s envelope was emblazoned with a bright yellow smiley sticker and that the postmark was Miami, a city that none of the couple’s friends live in. So maybe the letter writer was on vacation at the time. The wife of the couple put the letter on Facebook with the instruction: “Please feel free to unfriend us from Facebook as we clearly are not ‘friends.’ If you’re unsure how to unfriend someone, go to the ‘Help’ menu. ” The couples’ friends rallied with support in the post’s comments section. “Maybe if they spent less time on FB stalking you,” one wrote, “they could work more, make more money and go on a vacation, too. ” In certain rare instances, too many vacation photos are not enough. Dr. Vannucci said that after one of his clients had his wedding canceled at the last minute, he “was really struggling. ” He posted that it was called off but that he was still going to “enjoy the honeymoon. ” On came a cavalcade of photos of one man’s painful efforts at readjustment, all of them captioned, Dr. Vannucci said, “with funny, raw but heartbreaking comments. ” One groom’s Stations of the Cross. Conscious that my own trickle of   emotionally stifled summertime photos on Facebook is its own version of fahvolousness, I spent a recent trip to Spain   myself. While, yes, I did share a picture of an outpost of the restaurant chain Museo del Jamon, I did not post a slew of others. Not the stylish dog walker and her dachshund that I intended to caption “Tiny pants, tiny dog: Madrid. ” Not the gorgeous   ceilings of the Alhambra. Not the   trip home when my boyfriend clutched his   neck pillow to his chest and referred to it as “comfort bosoms. ” But am I being immodest when I tell you that I now see these omissions as a disservice to my friends and colleagues, who may have loved them. I am trying to calibrate my photographic output. As we all should. In the meantime, let us all delicately start a conversation about one of this topic’s thorniest issues. Indeed, let us try to find some common ground with respect to photography’s one essential verity. I’ll start us out here: All sunsets are kitsch.'"}, "time": 1742562263.3602421}