{"duration": 0.06252264976501465, "input_args": {"text": "'Former Breitbart Senior Editor MILO celebrated Cinco de MILO today where he announced a number of new Milo, Inc. ventures. [MILO entered his Meme Mansion, packed to the rafters with anxious fans just waiting to get a glimpse of the Dangerous Faggot, with a large snake wrapped around his shoulders and accompanied by a number of large black men, “Welcome to Cinco de Milo! I’m Milo Yiannopoulos!” announced MILO, “I already have my own holiday, October 18th, is celebrated internationally as World Patriarchy Day. But that has been superseded now by Cinco De Milo. ”  MILO briefly discussed the events that lead to his exit from Breitbart before continuing, “now you may have heard that I made a couple of phone calls after all that happened, after I’d been sufficiently contrite for a while. And you may have heard that I have raised twelve million dollars. ” the Dangerous Faggot said to the crowd that had begun chanting “MILO” over and over. “I want to tell you all what I’m going to do with that money so we can get back to getting trashed,” said MILO, “first of all, Simon  Schuster. I am going to spend the next year making the name Simon  Schuster synonymous with censorship. I am going to spend the next year giving out as many free ‘Fuck Simon  Schuster’ shirts as I can. ” MILO continued, “do not worry about the scolds and the nannies. So we’re suing them  …     I am suing Simon  Schuster for $10 million dollars. ” “But we’re taking it a step further,” said MILO, “I am going to take not just all of their best authors but all of the best authors of all of the conservative imprints in this country and launch my own imprint called Dangerous Books. We are going to publish every mischievous, dissident, hellraising guy you have ever heard of  …     We’re going to be going live in the next seven days. ” MILO then announced the return of his touring career stating that he would be launching a student and commercial tour called “Troll Academy. ” MILO stated that Troll Academy would be accepting applications on Monday from venues or colleges that wished to host him. MILO stated that personally would “determine whether you deserve a visit from me. ” In his final announcement of the night, MILO discussed his Free Speech Week at UC Berkeley, which will take place in the fall.  '"}, "time": 1742562107.8035083}