{"duration": 0.12796354293823242, "input_args": {"text": "'Lloyd Billingsley \\n“Presidential debates between Donald Trump and Hillary Clinton included a third participant: Vladimir Putin, standing in the background, stealthily inserting himself in the process.” Putin’s Russia “uses deniable cyber-hooliganism to actively prank the American political system. And it’s taking a toll. . . This is the Putin Playbook. Steal, cheat, attack, disrupt, mislead, confuse. If caught, lie and deny.” And it gets worse. \\n“Unfortunately, the Republican presidential nominee reinforces this narrative, referring to a ‘rigged’ system and an indictable opponent. His outbursts follow years of domestic political discord, where comity is history, crazy seems the new normal, and a sitting president can be heckled with ‘You lie!’” \\nAll told, the piece reads like a Clinton press release, but it’s actually “Putin’s powerful playbook: Hack, steal, disrupt, mislead, confuse,” in the October 30, Sacramento Bee , two days after the Comey email bombshell. The author is Markos Kounalakis, billed as “a senior fellow at Central European University and visiting fellow at the Hoover Institution.” That doesn’t quite capture the man and his connections with the Clintons, which have shown up in Wikileaks. \\nMr. Kounalakis’ author line fails to reveal that he is married to Eleni Tsakopoulos-Kounalakis, daughter of real-estate tycoon Angelo Tsakopoulos. According to Greek USA Reporter , Angelo is a “top political donor to the Clintons as well as the Democratic Party,” whose “donations to former President Bill Clinton were rewarded with a night in the prestigious Lincoln Bedroom.” In 2013 Tsakopoulos, “confirmed that Hillary Clinton will seek the Democratic nomination in the next Presidential election.” \\nAngelo’s daughter Eleni, a protégé of Nancy Pelosi and Barbara Boxer , raised more than $1 million for Hillary Clinton in 2008 , and that money found its reward. On January 7, 2010, U.S. Secretary of State Hillary Clinton swore in Tsakopoulos-Kounalakis as U.S. Ambassador to Hungary. In that capacity , she condemned Wikileaks for releasing secret diplomatic cables, but declined comment on the authenticity of the material. Tsakopoulos-Kounalakis served as ambassador until 2013 but as Wikileaks confirms, she continued as a key Clinton supporter doing her best to beat back a presidential run by Joe Biden. \\nIn a June 11, 2015 email, Eleni Tsakopoulos Kounalakis tells John Podesta that a Bay Area bagman “swears Biden is running. He said he took him on Air Force Two, and he’s getting emails.” Last July, Tsakopoulos-Kounalakis emailed Clinton confidant Jake Sullivan that “HRC indicated her view that it would be best to avoid Grexit” and a July 9, 2015 email to Sullivan, John Podesta and Huma Abedin, she supports “terms that will allow Greece to stay in the Eurozone.” \\nOn October 11, 2015, Tsakopoulos Kounalakis emailed Podesta that “there is a Greek American love fest going on with Joe Biden, very boy-club.” The same day she emailed Podesta and Huma Abedin that “we had a David Brock dinner with Annie Karni from Politico. She asked to use four quotes from me (see attached). I told her the first two could be with attribution, and the second two without.” \\nAs the emails to John Podesta and Humba Abedin reveal, “Ambassador Eleni Kounalakis,” as she styles herself, remains part of Hillary Clinton’s inner circle. Tellingly, the McClatchy-Tribune newspapers that run her husband’s columns, do not acknowledge the strong Clinton connection. \\nThe New York Times proclaimed Kounalakis a “White Knight” for rescuing Washington Monthly , where he served as publisher and teamed with editor Paul Glastris. This tandem made the publication a “progressive must-read,” according to Clinton strategist James Carville. Kounalakis reported for Newsweek in East Germany and ran their bureau in Prague. He also worked in Moscow for NBC Radio and Mutual news. \\nKounalakis’ books include Hope Is a Tattered Flag: Voices for the Post-Bush Era , with Peter Laufer, and Beyond Spin: the Power of Strategic Corporate Journalism with Drew Banks and Kim Daus. It remains something of a mystery how the leftist Kounalakis became a visiting fellow at the Hoover Institution, known for strong conservative writers and scholars such as Thomas Sowell, Victor Davis Hanson, and Bruce Thornton. \\nOnly one time, as this writer recalls, has Kounalakis acknowledged in print his wife’s strong Clinton connections. Even after the Wikileaks revelations, and with a presidential election only days away, Kounalakis did not acknowledge his wife’s key role in HRC’s inner circle with John Podesta and Huma Abedin. His October 30 Sacramento Bee piece suggests Markos is right at home in those circles. \\nKounalakis attacks “the Republican presidential nominee,” implying that he is “crazy,” and a tool of the evil Putin. On the other hand, the Clinton email scandal gets zero attention and the author piles on the ad copy: “American society has made great strides in LGBTQ rights, women’s rights and minority rights, and has a relatively strong and resilient globally innovative economy.” \\nThe author gives readers good cause to regard this article as pure Clinton campaign propaganda from a camouflaged Clinton crony. Maybe Markos will join his wife, Huma Abedin, and John Podesta in the Wikileaks revelations. For many observers, the issue is not where the leaks came from but whether the revelations are true and authentic. If Markos Kounalakis believes they are bogus, maybe he can write about what’s in the real ones.'"}, "time": 1742563367.8855026}