{"duration": 0.015930891036987305, "input_args": {"text": "'California Assemblyman Kevin McCarty ( ) is pushing legislation to take away school administrators’ power to allow teachers with a Carry Concealed Weapon license (CCW) to be armed in classrooms for  . [McCarty’s bill —  AB 424 —  was introduced months ago and is snaking its way through the legislative process.  He introduced the bill on February 13 and in   Bakersfield. com reported that it was being pushed as a way “of closing a loophole in the Gun Free School Zone Act. That act, also known as SB 707, barred firearms on school grounds, but made exceptions for anyone granted permission by local superintendents. ” AB 424 would take away superintendents’ powers to allow teachers with CCW’s to be armed for  . Gun Owners of California’s Sam Peredes talked to Breitbart News on May 12 and said, “Two years ago, California passed a bill saying a concealed carry permit holder could not carry on any school campus unless they had the authorization of the school administrator. Well, out of the one thousand school districts in California, five of them decided to allow concealed permit holders to carry on their campuses. That so ticked off the legislature that now they are going to take away the authority of even administrators to allow CCW holders to carry on their campuses. ” Breitbart News previously reported that that five school districts which chose to allow CCW holders to carry on campus for   are Kern High School District, Kingsburg Joint Union High School District, Folsom Cordova Unified School District, Anderson Union High School District, and Palo Cedro’s North Cow Creek School District, McCarty justified his push to disarm teachers, saying, “A safe learning environment is essential for our children to be successful in the classroom. That’s not possible if a school district allows armed civilians to roam California school campuses. ” Missing from McCarty’s appraisal is the fact that Sandy Hook Elementary was a safe learning environment until a mass attacker ignored the   zone signage, and once he was in the building no one was armed to stop him. McCarty and other Democrats must realize that attackers who refuse to heed a “gun free zone” sign will have no one to stop them once the teachers and staff are disarmed in California either. AWR Hawkins is the Second Amendment columnist for Breitbart News and host of Bullets with AWR Hawkins, a Breitbart News podcast. He is also the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart. com.'"}, "time": 1742628475.3160877}