{"duration": 0.16409063339233398, "input_args": {"text": "'Hillary Clinton’s presidential campaign, her network of super political action committees, and the liberal establishment relished a matchup against Donald Trump. However, her campaign failed to put forward an alternative for voters that would combat a candidate that tapped into the vast amount of disillusionment among citizens. Tsunamis of voters unaccounted for in state polls, who do not identify with either the Democratic or Republican Parties, made President Trump a reality.\\nClinton’s concession speech indicated the campaign and many of its supporters are unwilling to confront the hubris of her presidential run. Yet, citizens, especially those on the left, must in order to find the clarity to move onward with fights for social, economic, racial, and environmental justice.\\nThe Democratic Party rigged parts of the party’s primary for Clinton, and it helped stave off a decisive challenge from Senator Bernie Sanders. The senator addressed the material conditions of the working class, including people of color. He warned the Democrats of wealth inequality, destructive free trade agreements, and some of the negative effects of global capitalism on the common man or woman. He connected with disaffected people who the Clinton campaign effectively wrote-off and performed well in states that Clinton lost in the general election.\\nHowever, the Democratic Party elites survived and coerced Sanders and his supporters into falling in line at their national convention. The party leadership enforced unity in Philadelphia to make it appear as if all was well when that was not the case.\\nMost progressive groups, like all presidential elections, demobilized or essentially became mechanisms for the Clinton campaign to mobilize voters from August to Election Day. This allowed the message of “Never Trump” to dominate as the only challenge to Trump, and without a real vision for lifting up the many Americans enticed by Trump’s campaign, the nation ended up with an end result similar to Senator John Kerry’s campaign, which ran primarily on the fact that he was not President George W. Bush.\\nIt did not help the Clinton campaign that she had a reputation for supporting regime change wars, which have greatly destabilized parts of the world. Her fingerprints were all over the Libya disaster. She voted for the Iraq War, which created the conditions for the rise of the Islamic State. And, although it is questionable whether Trump really ever opposed the Iraq invasion, he insisted he was against the Iraq War during debates to undermine Clinton and fueled the perception that Clinton was somehow responsible for ISIS. Trump held himself out as someone who would not plunge the country into reckless military engagements.\\nClinton’s closing argument included the following, “Is America dark and divisive or helpful and inclusive? Our core values are being tested in this election, but everywhere I go, people are refusing to be defined by fear and division. Look, we all know we’ve come through some hard economic times, and we’ve seen some pretty big changes. But I believe in our people. I love this country, and I’m convinced our best days are ahead of us if we reach for them together.”\\nThat may have sounded good in the office of a campaign’s headquarters, but there was nothing specific in this buzzword-laden pablum. Multiculturalism does not help anyone pay their mortgage or find a job. As wrong as it is for millions of white Americans to take out their frustrations on people of color, the system failed them and keeps failing them. Additionally, establishment politicians like Clinton wrote off many of these people, believing if they focused on emphasizing diversity they would overcome the painful intertwined realities of class and race in the U.S. They were wrong.\\nLet us go back to the belief that a candidate like Trump would be perfect for Hillary Clinton. In April 2015, a strategy memo for the DNC was drafted by the campaign two months before Trump announced his candidacy. The goal was to “make whomever the Republicans nominate unpalatable to a majority of the electorate.”\\n“Force all Republican candidates to lock themselves into extreme conservative positions that will hurt them in a general election,” the campaign recommended. “Undermine any credibility/trust Republican presidential candidates have to make inroads to our coalition or independents.”\\nIt advocated against marginalizing “more extreme candidates.” The campaign wanted to make “Pied Piper candidates,” like Trump, Senator Ted Cruz, and Ben Carson, into representatives of the Republican Party. “We need to be elevating the Pied Piper candidates so that they are leaders of the pack and tell the press to [take] them seriously.” (The memo was attached to an email published by WikiLeaks.)\\nIn the same month, Clinton campaign manager Robby Mook pushed for a primary schedule, where the red states held their primaries early. It would increase “the likelihood the Rs nominate someone extreme.”\\nEssentially, the Clinton campaign engaged in steps that would help ensure Trump was the Republican presidential nominee. Their acts enabled the rise of Trump, and they lost to the opponent they wanted to face because they made the same mistakes Democrats make time and time again. They clung to failed corporate Democratic policies that have devastated this country for the past two decades, and in some ways, this election can be viewed as a referendum on those policies. And they treated the candidate who had answers for Americans as “unrealistic,” a “hapless legislator,” an “Obama betrayer,” and a socialist independent who was not a real Democrat. As in, he was not one of them, and they did not want him in their club.\\n* \\nOn June 26, Sanders warned Democrats what happened with Brexit in Britain could happen. He shared what he saw on the campaign trail. He noted the tens of thousands factories closed over the past 15 years. “More than 4.8 million well-paid manufacturing jobs have disappeared” as a result of trade agreements. Forty-seven million Americans live in poverty. Millions have no health insurance or are underinsured. Just as many struggle with student debt. “Frighteningly, millions of poorly educated Americans will have a shorter life span than the previous generation as they succumb to despair, drugs and alcohol.”\\n“Meanwhile, in our country the top one-tenth of 1 percent now owns almost as much wealth as the bottom 90 percent. Fifty-eight percent of all new income is going to the top 1 percent. Wall Street and billionaires, through their “ super PACs ,” are able to buy elections,” Sanders added.\\n“On my campaign, I’ve talked to workers unable to make it on $8 or $9 an hour; retirees struggling to purchase the medicine they need on $9,000 a year of Social Security; young people unable to afford college,” Sanders shared. “ I also visited the American citizens of Puerto Rico, where some 58 percent of the children live in poverty and only a little more than 40 percent of the adult population has a job or is seeking one.” \\nIt is important to note the Clinton campaign engaged in a calculated act of deception by supporting the Service Employees International Union’s “Fight for 15” while refusing to support a $15 minimum wage. All the states with minimum wage ballot initiatives passed wage increases yesterday. The campaign could have mobilized so more states had this sort of thing on the ballot. The possibility of more economic security may have increased enthusiasm. But the Clinton campaign did no such thing.\\n“The notion that Donald Trump could benefit from the same forces that gave the Leave proponents a majority in Britain should sound an alarm for the Democratic Party in the United States,” Sanders concluded. “Millions of American voters, like the Leave supporters, are understandably angry and frustrated by the economic forces that are destroying the middle class.”\\n“In this pivotal moment, the Democratic Party and a new Democratic president need to make clear that we stand with those who are struggling and who have been left behind. We must create national and global economies that work for all, not just a handful of billionaires.”\\nEfforts to process what unfolded on Election Day must recognize the warning of Sanders and millions of his supporters went unheeded. Clinton practically ran as an avatar of the billionaire class, albeit a potentially benevolent caretaker of the masses if they just stood with her. Had more in the establishment media and institutions of power taken the time to reflect on what transpired in the Democratic primary, they would have feared the worst and taken more steps to prevent a Trump primary by trying to shift the dynamic of her campaign.\\nLest one forget, the Clintons are New Democrats. They aligned with business forces in the early 1990s. They stood with conservative Democrats, who broke with labor, civil rights, and other liberal causes. They pushed the North Atlantic Free Trade Agreement (NAFTA). They backed welfare repeal, bills which fueled the rise of mass incarceration, and signed a 1997 budget that slashed millions for social programs like Medicare and Medicaid. They put corporate interests over environmental protections. They encouraged the deregulation of industry, which greatly boosted Wall Street. Altogether, the Clintons enabled the right as it decimated the liberal class and expanded unfettered capitalism. (For more, read Lance Selfa’s book, “The Democrats: A Critical History.”)\\nFinally, the outcome confirms what many expressed months ago. The Democratic Party was willing to do whatever it took to nominate Hillary Clinton, even if it meant working against the very forces behind Bernie Sanders, which could help them succeed against Donald Trump, because the last thing they wanted was a major shift toward more socially democratic policies. Also, Clinton was next in line. Whether voters viewed her as a weak candidate or a dishonest and untrustworthy politician did not matter. They would go to battle for her and gladly lose this war.\\nThe post The Hubris of Democratic Elites, Clinton Campaign Gave Us President Trump appeared first on Shadowproof .\\n'"}, "time": 1742561915.6613643}