{"duration": 0.0441279411315918, "input_args": {"text": "'Share on Facebook Upon learning this, you will think that happened long ago, but no. There is still a place to live, and not say for its scenery, but for their ideals as a society who do not follow the standards to which we are accustomed. In this town there is no money, no religion, no politics. This is truly a paradise to live. Think only in a place where there are none of these factors, where you can finally live in peace. This place exists and is called “Auroville”! It was founded in 1968 and was hailed as an international city by UNESCO, as its inhabitants are over 50 nationalities and different cultures. They coexist without any problem, since they have a political system, have no religion, and on top, do not use money and getting all living through the system of exchanges. Auroville is located in South India, 150 kilometers from Chennai in Madras. In this epic city, the buildings are made based on an experimental architecture, as they are constantly changing. This is because these structures seek to optimize the use of renewable energies and their main objective: reuse and recycling. The person who designed and managed to found this wonderful city was: Mirra Alfassa, better known as “Mother”. \"There should be a place on Earth that no nation could claim as their own; where all human beings of good will who have a sincere aspiration could live freely as citizens of the world, obeying one single authority, that of the supreme truth. A place of peace, concord and harmony where all the fighting instinct in man were used exclusively to overcome the cause of their sufferings and miseries, to overcome their weaknesses and ignorance, and to triumph over their limitations and disabilities. A place where the needs of the spirit and interest of progress precedence over the satisfaction of desires and passions or the pursuit of pleasure and material enjoyment,\" was the idea of Alfassa. From this hypothesis, we now have this amazing international city. This city is positioning itself as a model of sustainable eco-city. It is a method developed by the multi-cropping, combining fruit trees, cornfields and orchards, organized into 15 farms, reaching an area of 160 hectares. In this way, they ensure much food, so supply the population. In these farms work 50 villagers and 300 neighbors, producing 2% of rice and cereals consumed and 50% of vegetables. Also, the village is also self-sufficient in milk and dairy products, and fruits in season. Despite not being the only city that takes this model itself is special for receiving protection by UNESCO, and is a clear example of how it will be our way of life in a few more years, when Earth begins to manifest the consequences our mistreatment of her. Definitely this city is an example, where one of its principles is healthy, both mentally and physical life. We have nothing more to congratulate and wish all follow that model of life. Would you be in agreement with this new style of society? Related:'"}, "time": 1742562052.7263637}