{"duration": 0.3496534824371338, "input_args": {"text": "'Seattle Times \\nHere’s what’s happening : Seattle Times environment reporter Lynda Mapes and Times photographer Alan Berner are on the ground through the end of the week to report on protests of the Dakota Access Pipeline near Bismarck, N.D. Hundreds of protesters have joined the Standing Rock Sioux tribe in their effort to block construction of the pipeline they say threatens water supplies and sacred sites. On Thursday, protesters clashed with police officers who began to push them from land owned by the pipeline developers. More than hundred people were arrested, authorities said. One woman allegedly fired shots at officers while being placed under arrest, according to the North Dakota Department of Emergency Services. Read our primer on what’s going on with the oil pipeline. And here’s what we’re reading about the project and the region’s history. Here’s what happened on Wednesday . \\nUpdate, 10:25 p.m. \\nMore than 12 hours after protesters started clashing with authorities Thursday, the disturbance is still going. No serious injuries have been reported. \\nNumerous law-enforcement agencies are involved. In addition to the Morton County Sheriff’s Department, other North Dakota city and county agencies have responded, as well as the highway patrol. Also, officers from Wisconsin, South Dakota, Wyoming, Minnesota, Nebraska and Indiana are in the area. \\nThe Bureau of Indian Affairs is here to assist tribal nations. \\nThe Associated Press captured this video footage of authorities making arrests earlier in the day. \\n— The Associated Press and Lynda Mapes, Seattle Times environment reporter \\nUpdate, 10:05 p.m. \\nThe Morton County Sheriff’s Department now say 141 people have been arrested. \\nThe total number of arrests has grown throughout the day, since authorities began pushing protesters from private land owned by the pipeline developers. \\nThe department said protesters set fires to numerous vehicles, three pieces of Dakota Access Pipeline equipment and a bridge. The extent of total damage was unknown. Protesters also reportedly threw rocks, bottles, logs and homemade firebombs at officers. They also locked themselves to items. \\nSome people were arrested on suspicion of reckless endangerment, the department said. Others were arrested on suspicion of conspiracy to endanger by fire or explosion, engaging in a riot and maintaining a public nuisance, according to the department. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 8:20 p.m. \\nAuthorities’ operation earlier Thursday to move protesters off private land, which the pipeline developer owns, included agencies from six states, as well as from the local area. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 6:50 p.m. \\nAuthorities say 117 people have been arrested as of 6:15 p.m. PST. \\nDonnell Hushka, a spokeswoman for the Morton County Sheriff’s Department, said Morton County will use other jails to house people. \\nThose who were arrested on suspicion of misdemeanors can bond out, she said, but those facing felonies will be held for initial court appearances. \\nEarlier, protesters started two fires on a bridge and threw Molotov cocktails at authorities, according to the North Dakota Department of Emergency Services. \\n— The Associated Press and Lynda Mapes, Seattle Times environment reporter \\nUpdate, 6:15 p.m. \\nNear the clashing scene between protesters and authorities — which resulted in more than a dozen arrests Thursday and one woman allegedly firing shots at officers — residents nearby are giving their take on the demonstration. \\nKen Wressler, 66, a retired steelworker, says he was glad to move back into the house in which he was born here after working in the steel mill in nearby Mandan for more than 30 years. \\nEarlier Thursday, standing on his porch to have his morning coffee, he said he doesn’t much see the sense of blocking the $3.8 billion oil pipeline under construction through four states by Energy Transfer Partners of Dallas, Texas. It cuts a swath of freshly-turned ground just a mile from his house. \\nThe construction is protected by razor wire on a highway overpass, a reminder of the protests that have drawn international attention, about a half hour from Wressler’s house near the Standing Rock Sioux reservation. \\n“They ain’t bothered us here in St. Anthony,” Wressler said. “But I’m afraid something is going to happen for the worst. If they are not going to move and they are going to get moved,” he said of protesters now encamped in the path of construction. He said the sheriff “should have taken a stronger stance from the beginning, but who knows?” \\nNorth Dakota needs the pipeline, he said. As a former steel worker, he knows the value of the oil industry. \\n“During the first boom, in 1989, we made tanks and more oil tanks and more tanks.” Today? “What good is oil to North Dakota if we can’t send it somewhere? What do we want to get it from the Arabs? We see how many problems that gave us.” \\nIt’s been a good life, Wressler said, in this faded town, that used to have two schools, a lumber yard, grocery store and a post office. The bigger town of Mandan, up the road, sucked off the jobs and population. But he values the roots he feels deep in this ground. His father used to work in the shed next to his Wressler’s house, as a blacksmith, fixing farmers’ tools. “He pounded and fixed everything, until they moved to throwaway scythes, throwaway everything.” \\nWressler’s red plaid flannel shirt with white plastic pearl snaps was all he needed to be comfortable on this fall morning. “Everybody wanted an early winter. The pipeline people wanted it, so the Indians would leave, the Indians wanted it so they couldn’t put in the pipeline. Instead, we’ve got this.” \\nHe shook his visitors’ hands goodbye with a meaty hand. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 5:20 p.m. \\nA woman allegedly fired three shots at law enforcement officers during their operation to force protesters off private land, according to the North Dakota Department of Emergency Services. \\nCecily Fong, a spokeswoman for the department, said the woman was being placed under arrest when she pulled out a .38-caliber pistol and fired, narrowly missing a sheriff’s deputy. Officers did not return fire, Fong said. \\nIt wasn’t immediately clear exactly when the incident happened. \\nAuthorities took the woman in to custody. \\nPopping noises that some in the crowd thought was gunfire can be heard in this Facebook Live video produced by Atsa E’sha Hoferer during the protests. It’s unclear whether this video captures the shooting incident reported by police. Popping noises that some in the crowd thought was gunfire can be heard in this Facebook Live video produced by Atsa E’sha Hoferer during the Dakota Access pipeline protest. \\nUpdate, 5 p.m. \\nA spokesman for protesters said they will continue efforts to block the project, despite being forced from a camp Thursday afternoon. \\nCody Hall says protesters likely will set up a new camp to the east, on federally-owned land that’s also in the path of construction. \\nThe main camp of the protesters is on land owned by the Army Corps of Engineers. That agency has taken no steps to evict protesters from that camp, citing free speech reasons. \\nThursday’s eviction by authorities targeted protesters on private land owned by the pipeline developer. About 200 law enforcement officers launched the operation midday Thursday. On Wednesday, the demonstrators refused to leave voluntarily from the camp. \\nHall believes it won’t be as easy to move the protesters off a new camp, if it’s on federal land. \\n— The Associated Press \\nUpdate, 4:25 p.m. \\nAuthorities say they have ousted the protesters from a camp they had set up on land owned by the pipeline developer. \\nMorton County Sheriff Kyle Kirchmeier says authorities will maintain a presence in the area to keep protesters off private land and prevent them from blocking a nearby highway. \\nLate in the afternoon, Kirchmeier said the camp was secure, though officers were still dealing with some protesters in the surrounding area. \\nNorth Dakota Gov. Jack Dalrymple said the effort was “well-handled from start to finish” and resulted in no serious injuries. He said the protesters were given “more than ample time” to move on their own, and that those who didn’t leave voluntarily needed to be dealt with “as we have.” \\n— The Associated Press \\nUpdate, 4:05 p.m. \\nMedics say they have treated a tribal member who was hit by an ATV, as well as tribal members who were hit by pepper spray. \\nAlso, medics said they have helped a tribal member who was hurt by a falling horse. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 3:50 p.m. \\nAn estimated 250 demonstrators are still at the north camp and about 80 more, with a dozen horses, are at county road 134. \\nOn that road, protesters have set an area on fire near a bridge, according to the Morton County Sheriff’s Office. They also have burned tires on Highway 1806, the office said. \\nIn a prepared statement, Cass County Sheriff Paul Laney said, “Law enforcement has been very methodical in moving ahead slowly so as not to escalate the situation.” \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 3:22 p.m. \\nSixteen protesters have been arrested, according to the Morton County Sheriff’s Department. No further details on the arrests were immediately available. \\nLaw enforcement officials are using pepper spray, bean-bag shot guns, concussion grenades and mace to move the demonstrators out of a camp that sits on private land. They have also deployed Long Range Acoustic Devices (LRAD), which make piercing noises. \\nThe Dakota Access Pipeline purchased the private land to complete its nearly 1200 mile-long pipeline. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 2:59 p.m. \\nProtesters have set tractors on fire. \\nAmbulances from the Standing Rock tribe are standing by to help protesters hurt in the clashes with law enforcement. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 2:45 p.m. (Pacific Time): \\nA herd of buffalo was seen surging over the prairie, bringing cheers from the demonstrators. They flowed over the ground like fast moving water, finally disappearing over the distant hills. \\nMeanwhile, a man named Tubs, of northern Ohio, said he was maced four times and struck with a club. He headed to the medical tent. \\nPolice on all-terrain vehicles are chasing demonstrators on horseback, kicking up a cloud of dust. A helicopter also pursued. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 2:32 p.m.: \\nAlfred Kills His Horse, 27, of the Lakota Nation, said he was standing on the front lines and was shot by a bean bag from a shotgun. \\n“The water is everything to us. I don’t understand why this chaos is coming to us. We all drink water,” he said. “I don’t want the violence. I don’t want to get shot. We don’t know any other way. We have been fighting the U.S. government for hundreds of years.” \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 2:09 p.m.: \\nProtesters on horseback are galloping toward the front-line of the demonstration, wearing gas masks. \\n“They started advancing on our lines,” said Dana Yellow Fat, Standing Rock Sioux tribal councilman. “They opened up a big gash on a man.” \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 1:58 p.m.: \\nPolice are advancing with armored-personnel vehicle and ATVs. Campers are surrounded and outnumbered. Seven empty buses are en route while police move in. \\nSome protesters have locked themselves onto a pickup truck. \\n“You will be pepper sprayed if you do not get off of the pickup,” an officer said through a megaphone. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 1:42 p.m.: \\nPolice continue to work to clear the protesters’ camp on land owned by the Dakota Access Pipeline developer. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 1:23 p.m.: \\nDarryl Lies, from Douglas, North Dakota, said he came to the standoff “because of the violation of private property rights. And the use of one right to trample another is an abuse of our God-given and our country-given rights.” \\nLies is president of the North Dakota Farm Bureau. “They are using the First Amendment right to trample private property rights,” he said. \\nLies said the protests have harmed the relationship between farmers and ranchers and the tribe. \\n“We just want this to go away,” he said. \\nTrent Loos, 50, of Loup City, Nebraska, said the protesters crossed the line when they went onto private property. \\n“The sheriff has executed his rights as he should. He has not caved to federal pressure,” he said. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 12:46 p.m.: \\nPolice continue to push demonstrators south down the highway toward the protesters’ main camp about a half mile away. The front-line camp is owned by pipeline developers. Opponents began moving the camp there in the path of construction last weekend. \\nThe first arrest on Thursday was made there as police encircle the camp, moving closer and closer, foot by foot. \\n“We need as much people as possible. They started spraying (pepper spray). They are pushing tents down,” said Devin Blackcloud, a Standing Rock tribal member. “No one is budging. There are 150, 200 people willing to be arrested.” \\nSome campers are running. Police pursued. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 12:30 p.m.: \\nPolice are moving protesters south on Highway 1806. Over the megaphone, police are saying: “Please move to the south. I am going to sound the alert tone. You guys are too close to the vehicles. Please move. … We do not want to arrest anyone. We are moving forward a few feet.” \\nA line of demonstrators has formed, facing the oncoming riot gear-clad officers and their armored-personnel carrier. Police are also fanned out in the surrounding fields and many more are standing by a short distance away up the hill. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 11:57 a.m.: \\nBack at the main camp, south of the confrontation with police, the mood is hushed, subdued. Black smoke is still rising from the highway barricade that was set on fire. The camp dogs have begun howling. \\nTimes photographer Alan Berner cut his head on barbed wire during the flurry of activity earlier. Medics assisted, and his wound was cleaned. He declined stitches or staples and is headed back to the front line of demonstrations near the property owned by the pipeline developers. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 11:30 a.m.: \\nField medics have arrived to the scene of the faceoff between protesters and riot gear-clad police. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 11:15 a.m.: \\nA helicopter is circling low. Police in armored-personnel carriers and in riot gear are moving in and a showdown is coming. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 10:57 a.m.: \\nPolice officers in riot gear ordered protesters to leave their camp, erected on private property. The protesters then set aflame the barricade they had built on the highway. Thick black smoke billowed from the blockade. \\nChildren were being taken back to the main protester camp nearby, on U.S. Army Corps of Engineers property. Bulldozers are at the ready. \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 10:22 a.m.: \\nThe Morton County Sheriff’s Office has warned protesters at their new camp erected on property owned by the pipeline developers to leave — or be arrested. No one is leaving. Demonstrators are rushing to the front line of the protest. A helicopter is circling overhead. \\nA police officer shouted over a megaphone, over and over, that protesters should take their personal belongings and leave: “Walk to the main camp; 0pen the road block. We will not hurt you. You need to come out with your hands raised. Come onto the road. Do not go into the field. Do not approach us with horses. Do not approach us with vehicles.” \\nProtesters are locking arms, praying and drumming and burning sage, waiting to be arrested. \\n“Disperse now or you will be arrested under North Dakota laws,” police ordered, as protesters sing. \\nLive videos from the scene show a line of officers approaching the protesters’ highway blockade, which appeared to have been set on fire. Thick, black smoke billowed from the barricade. This is what cops are walking toward on 1806 #NoDAPL #DAPL pic.twitter.com/F0khkRPSeT \\n— wes enzinna (@wesenzinna) October 27, 2016 \\n— Lynda Mapes, Seattle Times environment reporter \\nUpdate, 9:46 a.m.: \\nThe Dakota Access Pipeline slicing through four states of the U. S. also creates small-town divisions, where some business owners near the protest camp have plenty to say on the subject. They declined to give their names publicly, though, for fear of sending away customers. \\nIn the tiny town of Solen, which is on the Standing Rock Sioux Reservation and about a half hour’s drive from the protest camps, some business owners are walking a difficult line. \\nFor instance, a non-Indian garage owner is married to a Sioux woman who sides with the opponents — while he finds the whole controversy a nuisance. \\n“I think most of the people around here, Native and non-Native, would like to see it end. It’s a big inconvenience. All the traffic, the cops. I am for the pipeline. North Dakota is an oil-producing state,” he said. “And it’s the safest way to transport it.” \\nAt home, the dividing line is clear. “She is convinced the pipeline is going to break and people are going to die,” he said of his wife. “She’s got her view, and I’ve got mine.” \\nUp the dirt road, off the main highway, is the Last Chance Saloon, decorated with branding irons, large, longhorn cattle horns and solid advice on a bumper sticker stuck on the wall: “When in doubt, let your horse do the talking.” \\nThe barkeeper, age 89, was similarly opinionated with the couple — yet circumspect. \\n“I wish it would end; I’m sick of it,” she said, pouring fresh coffee for visitors into Styrofoam cups. “And they keep coming, more and more.” \\nA lifelong resident of this farming hamlet, she comes in to clean the bar every day for her son and mind the counter during the slow hours. \\n“What else am I going to do, sit and look out the window? I like to stay busy.” \\nAs for the coffee, it was hot, fresh and free. She wouldn’t take payment, no. Not from out-of-town visitors. \\n“Don’t make me argue,” she said. \\nOther nearby residents fear the pipeline protests will turn violent, like Ken Ressler, of St. Anthony, N.D., who’s worried someone will be hurt. Ken Ressler in St. Anthony, N.D., is worried the protests will become violent. (Alan Berner / The Seattle Times) \\n\\nJust outside St. Anthony, the Dakota Access Pipeline is in the ground — and guarded by razor wire. The $3.8 billion pipeline is about 60 percent complete. The Dakota Access Pipeline in North Dakota is more than halfway finished. (Lynda Mapes / The Seattle Times) \\n\\nUpdate, 8:45 a.m.: \\nWhile protests against the $3.8 billion oil-pipeline project draw people from around the country, the Standing Rock Sioux and developers of the Dakota Access Pipeline are also clashing in court. Here are the key legal issues . Dave Archambault II, chairman of the Standing Rock Sioux Tribe, on Oct. 5 in Washington, D.C., where federal appeals-court judges heard his tribe’s argument for an emergency halt to construction of the Dakota Access Pipeline. The request was denied Oct. 9. (Jessica Gresko/ The Associated Press, file) \\n\\nUpdate, 6:40 a.m.: \\nMorton County Sheriff Kyle Kirchmeier and other law-enforcement officials confronted protesters at their new camp Wednesday, requesting that the demonstrators remove their roadblock on Highway 1806 and their camp on private property. \\nThe protesters refused. \\n“Protesters’ escalated unlawful behavior this weekend of trespassing onto private property and establishing an encampment has forced law enforcement to respond,” Kirchmeier said in a news release. “I can’t stress it enough, this is a public safety issue. We can not have protesters blocking county roads, blocking state highways, or trespassing on private property.” \\nRoy Murphy, 22, of the Muckleshoot Indian Tribe, has been at the Standing Rock encampment since Aug. 22 and says he is staying “until the pipeline is defeated.” His tent, shared with two others, is winterized. Roy Murphy, of the Muckleshoot tribe, on why he is protesting with the Standing Rock Sioux Tribe against the Dakota Access Pipeline in North Dakota. (Alan Berner / The Seattle Times) Roy Murphy, 22, of the Muckleshoot Indian Tribe, arrived at the Standing Rock encampment on Aug. 22. He says he is staying “until the pipeline is defeated.” (Lynda Mapes / The Seattle Times) \\n\\nUpdate, 6:15 a.m.: \\nFor the Standing Rock Sioux tribe, the battle over the Dakota Access Pipeline recalls a bitter history the tribe does not want repeated. \\n“We want to protect our land, and we want to protect our water,” said Dave Archambault II, tribal chairman. “Our concerns and interests don’t matter and this is how we have been treated for over 150 years.” \\nOnce roaming the Great Plains, living in teepees and hunting buffalo, the Sioux leaders such as Sitting Bull, Red Cloud and Crazy Horse are household names. Their bloodiest battles are too: Wounded Knee. Custer’s Last Stand. \\nThe history of the Sioux people and the United States is one of broken promises and seizing land for white settlement, gold mining and development. Those lands were reserved for the Indians’ sole use, in peace treaties that were supposed to be the highest law of the land. \\nRead more about how the Standing Rock Sioux tribe has lost ancestral lands in broken treaties and in theft.'"}, "time": 1742563142.097976}