{"duration": 0.15381479263305664, "input_args": {"text": "'  galleries are making their debut at Art Basel Miami Beach  on Thursday, out of some 600 dealers who applied for the fair and 269 who were accepted. The lineup is determined after much debate on the merit of each and how individual galleries contribute to the overall balance of the show. The New York Times asked Noah Horowitz, the fair’s director, to highlight several newcomers. The sprawling fair is divided into multiple sectors, which can help visitors make sense of its size. Galleries is the main event, intended for top dealers from around the world. Nova is for works done in the last three years. Positions displays   projects and is intended to be an incubator for new talent. Survey tackles historical projects, while Public stages outdoor sculptures and installations in Collins Park. Owned by Mara McCarthy, the daughter of the noted contemporary artist Paul McCarthy, this is one of the galleries fueling the rapid ascension of the Los Angeles art scene. Its program, strong in artists of the 1960s and ’70s, is part of a trend, Mr. Horowitz said: “Younger galleries looking at the past. ” The Box is focusing on Barbara T. Smith, 85, an important feminist figure on the West Coast who pioneered   and sexuality related performance art. The collective gallery she and her fellow artists founded in the early 1970s,   was the site of “Shoot,” the notorious Chris Burden performance piece in which he had himself shot in the arm with a rifle. “Barbara Smith is a legend, and her work has great resonance,” Mr. Horowitz said, though he added that she perhaps was not a household name for collectors. “This is what Survey does so well, provide a place for rediscovery. ” The gallery will show video and sculptures related to her work “Field Piece” ( ). For the original installation, a field of tall resin forms, Ms. Smith asked participants to experience the work naked. Founded by Emmanuel Di Donna, a former Sotheby’s executive, the Upper East Side dealer specializes in Surrealist and Modern art, as well as other postwar works. Not only is this Di Donna’s first showing at Art Basel Miami Beach, it is the gallery’s first art fair. “He’s a great example of a young but superserious,   dealer,” Mr. Horowitz said, using the industry term for works that have been previously bought and sold. “He does formidable research on these shows. He’s someone we think will be on the scene for many years to come. ” The mix of works includes “La Joconde” (1967) an    bronze by the Belgian Surrealist René Magritte, and “Femme, oiseau, étoiles” (1942) a work in gouache, charcoal and pastel by the Catalan Surrealist Joan Miró. Also on hand is a sculpture by the   Italian Fausto Melotti, “La rivoluzione dogmatica” (1969) made of brass and fabric.   art is always a strong component of Art Basel Miami Beach, given the fair’s proximity to Central and South America and Miami’s distinct Latin flavor. “We try to emphasize great projects coming from the region,” Mr. Horowitz said, and there are 31   galleries exhibiting this year. Simões de Assis Galeria de Arte was founded in 1984 by the architect Waldir Simões de Assis Filho, who has an unusual family connection to the fair: His son, Guilherme S. de Assis, participated in the Positions sector last year with his SIM Galeria. The father’s gallery, participating in its first international art fair, has made a specialty of secondary market work by South American artists, and this year will feature 16 works made from the 1930s to the 1950s by the Uruguayan artist Carmelo Arden Quin ( ). Quin, who lived in Paris for much of his life, made geometric works, often on irregularly shaped canvases, and is considered an influential modern painter of the type Survey highlights. Vigo is a    gallery in London’s West End, founded by Toby Clarke and Thomas Williams, that shows a variety of contemporary artists, including Derrick Adams and Leonardo Drew. For the Miami Beach fair, the gallery is exhibiting more than two dozen drawings and paintings by the Sudanese artist Ibrahim   including the ink on paper “Study of a Boy’s Head” (1960) and “Illustration no. 2 for Tayeb Salih’s novel Maryoud” (1977). Mr.   known for a gestural approach to works often done in a limited palette of black and white, is a former politician and diplomat who was imprisoned without charges in Sudan in 1975 and has taken inspiration from his time in jail. Two years ago, Mr.   became the first African artist to have a retrospective at Tate Modern in London, a show that featured more than 100 works. “He’s having an amazing moment of discovery,” Mr. Horowitz said. “Now he’s really in the international consciousness. ” And the   match of dealer and painter is significant, he said. “A London gallery showing an African artist demonstrates that Survey is quite the global program. ” The city of Bologna does not have a big presence on the international fair scene  —   that tends to be a role filled by Milan or Rome  —   but Galleria d’Arte Maggiore has developed a strong reputation for showing   masterworks across a wide spectrum, from Paul Klee to   Basquiat. It was founded in 1978 by Franco and Roberta Calarota and it is now being run by their daughter, Alessia. “It’s a real family affair,” Mr. Horowitz said. For its first Miami Beach appearance, the gallery is focusing exclusively on the Italian painter Giorgio Morandi (1890 —  1964) who became an icon largely after his death for his paintings of deceptively simple tabletop scenes. He imbued clusters of vases and bottles with metaphysical heft. A solo show of his work was presented at the Metropolitan Museum of Art in 2008. “Anything to do with the Morandi estate, it starts and ends with Maggiore,” Mr. Horowitz said. “They have access to an extraordinary cache of material. ” Given the sometimes cacophonous nature of   contemporary art, the Maggiore booth may provide a respite for visitors to the fair. Four of the paintings in the booth have the title “Natura morta” (“still life”) and were done between 1940 and 1960. “It’ll be a beautiful slow presentation in a hectic fair,” Mr. Horowitz said. This is a young gallery showing new works. The show’s title, “Shanghai: A New Ballardian Vision,” has a literary slant and refers to the dystopian urban vision of English novelist J. G. Ballard (  “Empire of the Sun”) who grew up in the Chinese city. The installation will include works by Aaajiao (the nom d’art of the new media artist Xu Wenkai) the painter Cui Jie, and Liu Shiyuan, who works in photography among other media. Ms. Cui’s fantastical oil paintings of imagined buildings, including “Building of Eagles” (2014) are among the works on display. Mr. Horowitz said the gallery’s founder, Leo Xu, a curator and writer, had“risen to the fore of the next generation of Chinese gallerists,” noting that he had exhibited at Art Basel Hong Kong show since it began. (Leo Xu Projects has also participated in Frieze New York and other international fairs.) “It’s a wonderful example of how our presence in Hong Kong has helped us cultivate relations with these Asian galleries,” Mr. Horowitz said. “We don’t take them for geographic reasons  —   it’s just that great things are being done in China right now. ” Hong Kong is known for being a hub of the art trade, but not so much its production or display. Edouard Malingue Gallery has been participating in Art Basel Hong Kong, and for its first Miami Beach outing is mounting a show of the video artist Wong Ping. Mr. Wong is known for   animations that touch on what the gallery’s website calls “repressed sexuality, personal sentiments and political limitations. ” Mr. Wong is also a Hong Kong native. “It’s nice to see a Hong Kong artist,” Mr. Horowitz said. “There’s not an infinite pool of them. A local scene is developing there that goes beyond merely the commercial aspect of a market center. ” Of “Jungle of Desire” (2015) the main work in this solo presentation, Mr. Horowitz said, “Our committee totally loved this video. ” The gallery is also exhibiting a work in the Public sector, which is displayed outdoors in Collins Park, in front of the Bass Museum of Art. Eric Baudart’s “Atmosphère” (2016) is a tank filled with peanut oil that, powered by a fan, will ripple and move. “It’s great to see a new gallery not only do a booth, but contribute an ambitious project to another sector, too,” Mr. Horowitz said.'"}, "time": 1742561766.7689233}