{"duration": 0.13135933876037598, "input_args": {"text": "'Can an elite,   TV network based in Manhattan find a comfortable home at a Dallas telecommunications company led by an executive who is also the Boy Scouts of America president? Richard Plepler, the head of HBO, considered the question at his regular lunch spot  —   a corner table at The Lambs Club in New York. It had been a whirlwind few days for Mr. Plepler, and while the restaurant may have been familiar, little else about the week was business as usual. Five days earlier, HBO’s parent company, Time Warner, agreed to be taken over by ATT in an $85 billion deal that startled the media world. Mr. Plepler met his potential new boss, the ATT chief executive Randall Stephenson, for the first time last Monday, and they spent 30 minutes chatting at HBO’s headquarters overlooking Bryant Park. Still, Mr. Plepler said he was comfortable with this shotgun marriage, and for one big reason: He believes he will be able to run things the way he always has. “Randall made very clear to everybody that what they are buying they look at with enormous respect and admiration, and the last thing they have any interest in doing is messing with a winning game,” he said on Thursday. Will it be that simple? HBO, which also has operations in Los Angeles, is a creature of its coastal milieu and creates shows like “Game of Thrones” and “Westworld,” the kind of   entertainment that appeals to viewers with a tolerance for amoral protagonists and graphic violence. It is also home to the liberal   host Bill Maher, and the British comedian John Oliver, who delights in skewering powerful corporate interests on his show “Last Week Tonight. ” The premium cable channel is an unabashed big spender, too, throwing lavish parties and dinners at places like the Museum of Modern Art in New York City or the Hotel du Cap in Cannes, and flying actors, directors and writers across the country. ATT, though, will have $175 billion or more in debt on its balance sheet if the proposed merger is completed. “One is a connectivity sales company and another is an entertainment provider,” said Gary Arlen, the head of Arlen Communications, a research firm that examines the media and telecommunications industries. “ATT has a history as being a public utility. It’s bland and very vanilla. HBO is showbiz all the way. ” Over a plate of chicken paillard last Thursday, Mr. Plepler acknowledged that assimilation would take some time. “Obviously when you get to know people, there’s a learning curve on both sides,” he said. But he said that for HBO and other parts of Time Warner to thrive, “you have to have a Chinese wall between the creative process and everything else. ” For its part, ATT has contended it would stay out of the way. “I know they’re different cultures, and we’ll be protective of the cultures to ensure we don’t destroy the business,” Mr. Stephenson said at a conference conducted by The Wall Street Journal last week. “We’ll have the experts that know to run these businesses running these businesses. ” If the deal is not blocked by regulators, ATT will acquire not just HBO, but also CNN and entities like TBS, TNT and Warner Bros. which earn billions in revenue. But HBO is the crown jewel of Time Warner’s media properties, having won more Emmys than any other network for 15 consecutive years. Now, however, HBO faces increased pressure to find new hits and pick up new subscribers when there is more competition than ever in television. There are examples of peaceful transitions when a nonmedia company acquires a content company  —   like Comcast’s ownership of NBC Universal, which has gone smoothly  —   but others have created headaches. Universal Pictures, for instance, has endured many owners, including bankers (Standard Capital) liquor moguls (Seagram’s) and cable pioneers (Comcast). When it was owned by General Electric, about a decade ago, executives at the film studio were required to attend Six Sigma sessions  —   which involve meticulous business analysis exercises  —   in Crotonville, N. Y. to their extreme displeasure. When Columbia Pictures was owned by   in the 1980s, it had hits like “Ghostbusters” and “Tootsie,” but the studio was banned from showing   soft drinks, and executives chafed under Coke’s expectations about profit margin, according to “Hit and Run,” a 1996 book about the movie industry by the entertainment reporters Nancy Griffin and Kim Masters. Still, the   ATT is certainly no stranger to enormous acquisitions  —   and bringing in a company, however different, is nothing new. “At ATT, there’s a culture within consumer marketing and there’s another culture in the engineering area, but there is mutual respect,” said James Cicconi, a former longtime ATT executive who ran external affairs and retired last year. “The same thing would be true for more creative areas or companies like an HBO. ATT is pretty sophisticated in terms of acquisitions and the importance of being able to integrate. ” As a subscription service that does not rely on ratings for revenue, HBO depends on generating excitement, striving to place its shows at the center of the cultural mainstream. It willingly approves big budgets to ensure high production quality and attract top talent, a practice that has allowed it to forge strong relationships with prominent actors, writers and directors. While many television networks now shoot in Canada because it is cheaper, for instance, HBO does not. The reason? Most actors prefer to avoid making the trip. When HBO made the film “Clear History,” Larry David’s 2013 comedy, the comedian requested that the network add a few million dollars to the budget. They gave it to him. He asked if the movie could be shot on Martha’s Vineyard, where he has a home. They did it. “If we make an investment, whether it’s a screening or an event, it’s about enhancing our brand and elevating our brand,” Mr. Plepler said. He said he would “be very surprised” if ATT did not embrace that. There are other questions about melding the two cultures. HBO has a proudly progressive view of the world, and its prominent dramas feature plenty of violence and sex. It is also willing to take risks. Michael London, a producer of “Confirmation,” an HBO original movie that recreated the Anita Hill and Clarence Thomas hearings, said in an interview this year that the filmmakers “knew it would be difficult and challenging to tell the story within a corporate environment with legal threats and telephone calls. HBO is fearless. ” If ATT gets someone complaining on the phone, will there be bigger problems? “HBO has succeeded on their terms, but ATT plays a much larger game,” said Bill Miller, a prominent lobbyist based in Austin, Tex. “HBO plays to their hometown, but ATT plays to a national audience where half of them aren’t progressive, and that puts them in a bit of a bind potentially. As soon as people feel unhappy or victimized, they’ll hear a lot about it. That’s what elected officials do: They complain. But for now, it is time for the honeymoon, with Mr. Stephenson, the telecom executive and Boy Scouts president, and Mr. Plepler, the consummate media executive, developing a relationship in real time. At the conference in California last week, Mr. Stephenson said he would visit the Warner Bros. studio later that day. And then, making light of their distinct sartorial preferences, he quipped: “I’m going to unbutton my shirt like Richard’s over there. ”'"}, "time": 1742564337.2642293}