{"duration": 0.11221671104431152, "input_args": {"text": "'«El arte de la guerra»\\nCómo decir «No» a las armas nucleares por Manlio Dinucci Estados Unidos acaba de imponer a sus aliados en la Comisión de Desarme y Seguridad de la Asamblea General de la ONU el rechazo a una proposición favorable a la eliminación total de las armas nucleares. En el caso de los países cuyos gobiernos aceptan almacenar ilegalmente en sus territorios las bombas atómicas estadounidenses, es posible exigir la retirada del armamento nuclear invocando el Artículo 2 del Tratado de No Proliferación (TPN).\\nRed Voltaire | Roma (Italia) | 3 de noviembre de 2016 français italiano English « Gracias, presidente Obama. Italia mantendrá con gran determinación su compromiso con la seguridad nuclear », eso escribía el primer ministro italiano, Matteo Renzi, en un histórico mensaje transmitido a través de Tweeter.\\nSin embargo, seis meses más tarde, el propio Renzi votaba « Sí » a las armas nucleares. Alineándose tras Estados Unidos, el gobierno italiano se pronunció contra la resolución, adoptada por amplia mayoría en la Comisión de Desarme y Seguridad de la Asamblea General de la ONU, que estipula la realización en 2017 de una conferencia de las Naciones Unidas para « negociar una herramienta legalmente vinculante [o sea de obligatorio cumplimiento] para una prohibición de las armas nucleares, que conduzca a la eliminación total [de ese armamento]. »\\nEl gobierno italiano se tragó así su promesa de hace 2 años, en la Conferencia de Viena, a los movimientos antinucleares « exigentes », a los que garantizaba entonces su voluntad de trabajar a favor del desarme nuclear desempeñando un « papel de mediador con paciencia y diplomacia ».\\nCae así en el vacío el llamado « Exijamos el desarme total », donde se pide al gobierno « la continuación coherente del compromiso y de la lucha por la prohibición de las armas nucleares » siguiendo un camino « humanitario y jurídico hacia el desarme nuclear », en el que Italia podría desempeñar « un papel más que activo, posiblemente de vanguardia ».\\nTambién caen en el vacío las mociones parlamentarias sobre ese tema. Lo que sucede es que los llamados genéricos al desarme nuclear resultan fáciles de instrumentalizar: basta recordar que el aún presidente de Estados Unidos, artífice de un rearme nuclear de 1 000 millones de dólares, recibió el Premio Nobel de la Paz « por su visión de un mundo libre de armas nucleares ».\\nLa manera para Italia de contribuir concretamente al desarme nuclear, enunciado en la resolución de la ONU, consistiría en comenzar por liberar el territorio italiano de la presencia de armas nucleares estadounidenses. Para lograrlo no hay que recurrir a la buena voluntad del gobierno italiano sino exigirle que respete el Tratado de No Proliferación, firmado y ratificado por Italia, cuyo Artículo 2 estipula:\\n«Cada Estado no poseedor de armas, que sea Parte en el Tratado, se compromete a no recibir de nadie ningún traspaso de armas nucleares u otros dispositivos nucleares explosivos ni el control sobre tales armas o dispositivos explosivos, sea directa o indirectamente (…)» [ 1 ]\\nTenemos que exigir que Italia no siga violando el Tratado de No Proliferación, que exija a Estados Unidos la retirada de todas las armas nucleares que tiene en territorio italiano y que detenga el despliegue en Italia de sus nuevas bombas atómicas B61-12 , punta de lanza de la escalada nuclear de Estados Unidos y la OTAN contra Rusia. Tenemos que exigir igualmente que se detenga el entrenamiento de los pilotos de la fuerza aérea italiana en el uso de armas nucleares bajo las órdenes del mando estadounidense.\\nEse es el objetivo de la campaña que ha emprendido el Comité No a la guerra, No a la OTAN con el respaldo de otras organizaciones y asociaciones. La campaña ya obtuvo un importante primer resultado: el Consejo Regional de Toscana aprobó por mayoría, el 26 de octubre, una moción presentada por el grupo Sì Toscana a Sinistra (Sí, Toscana a la izquierda) que « compromete el Consejo a solicitar al Gobierno que respete el Tratado de No Proliferación de armas nucleares y que haga que Estados Unidos retire inmediatamente del territorio italiano todo armamento nuclear y que renuncie a desplegar en suelo italiano las nuevas bombas B61-12 así como cualquier otro armamento nuclear ».\\nIniciativas como esas pueden contribuir a la creación de un amplio frente que, gracias una fuerte movilización, obligue el gobierno italiano a respetar el Tratado de No Proliferación.\\nHace 6 meses preguntábamos desde estas mismas páginas del diario Il Manifesto si había en el Parlamento [italiano] alguien dispuesto a exigir, invocando el Tratado de No Proliferación, la retirada inmediata de todas las armas nucleares estadounidenses desplegadas en Italia. Todavía estamos esperando una respuesta.\\nManlio Dinucci Fuente\\nIl Manifesto (Italia)'"}, "time": 1742563582.6811683}