{"duration": 0.0786445140838623, "input_args": {"text": "\"Videos UK Police Six Times More Likely To Stop And Search Black People Black people in Britain are more likely to be stopped and searched by police than white people, according to new official figures. | October 28, 2016 Be Sociable, Share! Stop and search has always been a controversial method used by police officers in England and Wales and has always disproportionately targeted black and minority ethnic (BME) communities in Britain. \\nAccording to official figures released in 2013, 27 percent of stop and searches were not based on reasonable grounds for suspicion and concerns, as well as disproportionately targeting young people from BME backgrounds. \\nIn 2014, then-Home Secretary Theresa May, decided to crack down on stop and search, penalizing police forces who used it and imposed restrictions on officers in 2014. \\nA year later in 2015, the head of London’s Metropolitan Police blamed an increase in knife crime on the home secretary’s stop and search reforms. In the same year, the number of fatal stabbings increased by 18 percent in London. \\nLondon knife crime is now at a four year high, according to a report published by the Police and Crime Committee which suggests violent crime, including knives, guns, sexual assaults and robbery have all risen year on year, with knives increasingly becoming a weapon of choice amongst young people . 2 Officers assaulted whilst detaining person with a knife. Glad to hear they are ok! Thank you #dedication #proactivepolicing #stopandsearch https://t.co/UnpIZ1wSEe \\n— Nick Downing (@NickDowningMPS) October 26, 2016 \\nWhile the latest figures released by the Home Office, reveal that the use of stop and search by police had reduced by more than a quarter across the board — stopping white people fell more sharply. \\nThe statistics reveal that people from BME backgrounds were still three times more likely to be stopped and searched than white people in 2015/16 and black people are six times more likely to be stopped and searched than white people. \\nAmber Rudd, Britain’s relatively new home secretary, says the statistics are “unacceptable” yet added that the powers are “vital” for police to fight crime. \\n“A similar story has been seen for the black group, which fell from over six times more likely to just over four times more likely between the years ending March 31, 2011 and 2015, before rising again to over six times more likely in the year ending March 31 2016,” the Home Office report said. \\nShadow Home Secretary Diane Abbott, said: “The decline in stop and search clearly shows there is some effort to use these police powers more reasonably. But there are clear signs that some communities are being disproportionately targeted.” \\nAmber Rudd, the same home secretary who suggested companies draw up a list of their foreign workers, said that, “no one should be stopped on the basis of their race or ethnicity.” \\nFour years later and another report into police use of stop and search, young black men are still being disproportionately targeted by officers, suggesting more needs to be done to tackle racism issues in the Met. College of policing launches anti bias guidelines on stop + search. Map shows where it's needed most pic.twitter.com/3UkaosKyZa \\n— simon israel (@simonisrael) October 27, 2016 \\nBritain’s police, in particular Scotland Yard, has been plagued with accusations of institutional racism for decades. The high profile racially motivated murder of black teenager Stephen Lawrence , and the subsequent conviction of his killers 20 years later in 2012, forced the Met to investigate claims of institutional racism.\""}, "time": 1742562279.6062186}