{"duration": 0.08594322204589844, "input_args": {"text": "'PARIS  —   The Italian director Saverio Costanzo has signed on to direct and to help write a   television series based on the four Neapolitan novels by the author who publishes under the pseudonym Elena Ferrante. The novels, published between 2012 and 2014, have developed a cult international following. They are “My Brilliant Friend,” “The Story of a New Name,” “Those Who Leave and Those Who Stay” and “The Story of the Lost Child,” and trace the lives of two friends, Elena and Lila, from their childhoods in postwar Naples to the present. Mr. Costanzo, best known for “Private” and “Hungry Hearts” (which   Adam Driver) said in a telephone interview that the biggest challenge to adapting the novels for television was how “to convey the same emotions as the books in a cinematographic way. ” He added that he was writing the script with the Italian writers Francesco Piccolo and Laura Paolucci, and that Ms. Ferrante was also expected to contribute to the screenplay. (He expects to communicate with the author via email.) The series will be filmed in Italy in Italian. The first season will cover the first book, with eight episodes of 50 minutes each. Filming is expected to begin in Naples this year and the first season is expected to air in the fall of 2018. A spokeswoman for Wildside, an Italian producer making the series with Fandango, confirmed that talks were in the final stages with a major American producer, as well as with the RAI state broadcaster. Wildside also   Paolo Sorrentino’s “The Young Pope,” starring Jude Law as the first American pope, a coproduction with HBO, Canal+ and Sky. Last fall, an Italian investigative journalist said financial records indicated that the Italian literary translator Anita Raja was behind Ms. Ferrante’s books, prompting an international outcry among the novelist’s protective fans. Ms. Raja has previously denied she was the author. Mr. Costanzo said he wasn’t interested in the author’s true identity. “It’s her literary reality that counts,” he said. “I’m one of those people who don’t care who she is. ”'"}, "time": 1742563655.1308382}