{"duration": 0.19220256805419922, "input_args": {"text": "'MEXICO CITY  —   The Mexican government has refused to release an internal review that found investigators broke the law in their search for 43 missing students, a conclusion that threatens the legal foundations of a case that has roiled Mexico. The report says crucial suspects were arrested and moved illegally, throwing into question any evidence they provided. The investigators’ conduct, in the words of the government report, violated “the right to truth” and damaged the victims’ right to justice. The students’ disappearance from the southern city of Iguala in September 2014 remains an open wound in Mexico, evidence of the country’s failure to protect its citizens and impunity within a corrupt criminal justice system. Now the report provides the first evidence from inside the attorney general’s office showing how the case was mishandled. The internal review was completed four months ago, 177 pages printed out and ready for delivery to the students’ parents. The families arrived expectantly for a meeting with the attorney general on Aug. 18, bearing posters of their missing sons. But the inspector general of the attorney general’s office told them that his superiors needed to approve the report first, which he said was a simple formality. That approval never came. Instead, the report is still under study, according to the attorney general’s office, which gave no indication when it would be finished, if ever. The inspector general who prepared the review, César Alejandro Chávez Flores, abruptly resigned four weeks after that meeting. A copy of the report obtained by The New York Times suggests why it remains in bureaucratic limbo. It depicts a series of violations, including the government’s top investigator’s taking a suspect to identify the supposed crime scene without a defense lawyer present. A record of that visit was never placed in the case file, and the site was left unguarded overnight. The existence of the internal report, and that of the first draft of a broader audit by the inspector general’s office, were first made public by the magazine Proceso and by the investigative journalist Anabel Hernández in a book about the case. The choice not to approve the report and release it to the families “was a clear sign of a lack of political will, not only from the attorney general’s office but from the federal government, to finish the internal investigation,” said Santiago Aguirre, deputy director of the Miguel Agustín Pro Juárez Human Rights Center in Mexico City and the families’ legal representative. “It showed us that the inspector general tried to do honest work and that he couldn’t find the political and institutional conditions to carry his work to its final consequences,” Mr. Aguirre added. But the attorney general’s office said legal reasons prevented it from releasing the report. The inspector general who succeeded Mr. Chávez Flores did not “recognize” the report’s conclusions because it lacked unspecified required formalities. “As such, it is a document that is legally nonexistent,” a spokeswoman, Natalia Briseño, wrote in an email. She added that the review was continuing. The possibility that the report will be suppressed is a worry for the   Commission on Human Rights, which is evaluating the case’s progress and has pressed the government to open new lines of investigation. “We’re quite concerned and disturbed about the allegations raised recently,” said the commission’s president, James L. Cavallaro. He added that the review was “clearly an important document, and we hope and expect to receive it. ” The students were part of a larger group of young men who were studying to become rural teachers at a college in the village of Ayotzinapa, in the Pacific state of Guerrero. They had arrived in Iguala on Sept. 26, 2014, to commandeer buses to travel to Mexico City a few days later. But as the five buses left the city, municipal police officers attacked them and three students were killed. The police also attacked a bus carrying teenage soccer players, killing three more people, apparently mistaking their bus for one of the students’ buses. During a chaotic night, students traveling on two buses disappeared, hauled off by the police and, officials have said, handed over to the local drug gang, Guerreros Unidos. The government’s account of what happened next rests on a series of confessions from suspected drug hit men who said they had killed the students and burned their bodies on a giant pyre in a remote garbage dump. The next day, they scooped the ashes into plastic bags and threw them into the nearby San Juan River. Only one student’s remains have been identified from the charred bones found at the riverbank. But the inspector general’s report describes how six suspects, picked up in different locations in one day, spontaneously confessed with identical wording that they were members of Guerreros Unidos, and admitted to having killed the students and burning the remains. The subsequent arrests, based only on those statements, were arbitrary and illegal, the review said. Under the Mexican Constitution, an illegal arrest nullifies any evidence obtained as a result. There were other problems. Dates were muddled, records missing. An investigating prosecutor signed documents in two different places on the same day. What the report describes is not uncommon in Mexican criminal investigations, experts say. In their zeal to close cases, the Mexican police and prosecutors have long skirted the law. Suspects are picked up to give a statement and then held on the slimmest of proof on suspicion of ties to organized crime. Although the police are adapting to a broad overhaul in Mexico’s justice system intended to eliminate those practices, “old habits die hard,” said Agustín Acosta, a prominent criminal defense lawyer who is not involved in the students’ case. The day after the arrests, one suspect was released to the lead investigator, Tomás Zerón de Lucio, who flew him to the river. There, the suspect later said, he was told to point to a spot on the riverbank. None of the activities of that day  —   Oct. 28, 2014  —   were included in the case file. Mr. Zerón’s presence at the river with the suspect, Agustín García Reyes, was first noted by a group of outside experts from the   Commission on Human Rights. Among the experts’ findings, which they presented in April, was detailed evidence that 17 suspects were tortured, including Mr. García Reyes and two other suspected gang members detained the same day. The inspector general’s internal investigation was a response to the experts’ report. The attorney general at the time, Arely Gómez, also asked the inspector general to begin the broader audit. The Times has obtained a copy of the audit’s first draft. Ms. Gómez is now the federal comptroller. Mr. Zerón has said the riverbank visit was appropriate police procedure. The omission of that visit in the case file was inadvertent, he said. In September, he resigned as the head of criminal investigations at the attorney general’s office. But Mr. Zerón, who has worked closely with President Enrique Peña Nieto for almost a decade, was immediately appointed as the technical secretary of the National Security Council. The first draft of the broader audit raises many of the same questions that the experts from the   Commission on Human Rights first identified. It asks why the federal police and the local military battalion stood by while the municipal police attacked the students’ buses. The draft calls for further investigation and interrogations to determine whether that negligence amounts to obstruction of justice. One of the enduring mysteries of the case is why the municipal police were never stopped by the state and federal authorities in Iguala. If the state police had acted, the students and others who were attacked that night “would not have been injured or killed” the way they were, the draft concludes.'"}, "time": 1742562083.6658185}