{"duration": 0.09478378295898438, "input_args": {"text": "'The scenery may have shrunk, but that face  —   oh, that face  —   looms larger than ever. So does the ego that animates it, both indomitable and irreparably broken. “With one look,” indeed, to borrow a song lyric that describes such unsettling presence. That outrageous,    desperate old lady shedding sanity on the stage of the Palace Theater still has the poetry in her gaze to break every heart. Yes, Hollywood’s most fatally narcissistic glamour girl, Norma Desmond, is back in town, in the   revival of Andrew Lloyd Webber’s “Sunset Boulevard” that opened on Thursday night. It is a show that exists almost entirely to let its star blaze to her heart’s content. The light she casts is so dazzling, this seems an entirely sufficient reason to be. Miss Desmond is embodied by Glenn Close, the   movie actress who won a Tony in the same part 22 years ago. And what was one of the great stage performances of the 20th century has been reinvented, in terms both larger and more intimate, that may well guarantee its status as one of the great stage performances of this century, too. Ms. Close is even better than when I first saw her  —   more fragile and more frightening, more seriously comic and tragic. Part of this presumably involves the insights an artist accumulates over the decades. It is also to Ms. Close’s advantage that she is no longer required to compete with an elephantine,   set. For this latest incarnation of “Sunset Boulevard,” directed by Lonny Price and first seen in London last year, is a close cousin to the   productions from Encores! of vintage musicals in concert at City Center. As in such presentations, the orchestra (40 pieces strong) is onstage and visible. James Noone’s set, anchored by tiered industrial scaffolding, conjures 1950s Hollywood through suggestive visual accents  —   a giant chandelier here, a floating corpse there  —   rather than   scenery. Yes, a car still shows up onstage. And our Miss Desmond still gets a workout walking up and down the stairs. But the   opulence of John Napier’s original designs has been scrubbed away. Such relative minimalism allows us to see Norma and “Sunset Boulevard” plain. The good news is that Norma has never looked bigger. (And no, I’m not forgetting about Gloria Swanson, who immortally created the part in the 1950 Billy Wilder film on which this show is based.) The musical, on the other hand, seems and sounds thin, despite the velveteen lushness of its excellent orchestra. Don Black and Christopher Hampton’s book is just fine when it hews to the   dialogue of the original screenplay. But “Sunset,” being a musical, spends most of its time singing, and Mr. Black and Mr. Hampton’s lyrics have a way of turning   cynicism into taunting schoolyard jingles, with rhymes that land as emphatically as children on hopscotch squares. (“You know I’m right.  It’s there in black and white. ”) Mr. Lloyd Webber’s music often inhabits a similar zone of singsong insistence, with certain melody lines repeated so often you fear surgery may be necessary to have them removed from your memory. Only the swirling, ominous overtures evoke the shades of noir of Franz Waxman’s original film score. For long stretches, you may even forget you’re inhabiting one of the darkest visions that Hollywood ever summoned of itself. This is a story, after all, that begins with a talking dead man. That’s Joe Gillis, the    screenwriter who narrates in sustained flashback. On the lam from a collection agency, Joe (Michael Xavier) winds up in a scary old mansion at 10086 Sunset Boulevard, playing editor, house pet and eventually lover to the reclusive Miss Desmond, a nearly forgotten   diva, who is planning her comeback. We also spend far too much time with Joe in the less exotic world of Hollywood hopefuls, where he falls for an ambitious studio worker, Betty Schaeffer (Siobhan Dillon) his best friend’s girl. Betty, to put it bluntly, is a bore, and so is Joe when he’s with her, since she has the effect of making them both sing like sweethearts out of Victor Herbert. Mr. Xavier is glib, handsome and charmingly  . But he’s lightweight, lacking the tortured conscience that William Holden brought to Wilder’s movie. Fred Johanson, looking like Lurch from “The Addams Family,” finds more substance and shadow as Max, Norma’s fanatically loyal  . The large ensemble, choreographed into flailing friskiness by Stephen Mears, is serviceable. But we’re just marking time until Norma’s back. Whenever she makes an entrance, the adrenaline that surges through the house is palpable. Swathed in   ensembles of sequined black, shimmering gold and assorted animal prints (the great Anthony Powell did Ms. Close’s costumes) her face as white and exaggeratedly expressive as Marcel Marceau’s, Norma should by rights be merely a drag queen’s fantasy. And, yes, on one level, the lady is a camp. But Ms. Close deploys the declarative physical vocabulary of   acting to convey a genuine grandeur of spirit and an equally outsize force of will. Watch Norma watching herself onscreen in a state of mimetic rapture, or seesawing violently between little girl coquettishness and iron imperiousness with her captive lover. The audacity of this performance is matched by its veracity. This is   acting of a singularly sophisticated and disciplined order, one of those rare instances in which more is truly more. Her singing voice is reedy and at times  . But her delivery, her stance, her very presence are operatic in the richest sense of the word. I won’t even try to describe the brilliant spiderlike dance  —   superhuman and pathetically human  —   with which Ms. Close concludes the show. You have to (and I mean have to) see it in person. Her interpretation of the show’s one great song, “As If We Never Said Goodbye,” in which Norma visits her old studio lot, is a  . Watching it from its beginning (when a set worker trains a spotlight on Norma’s face) to its end (when she steps to the edge of the stage to absorb the applause like an unquenchable sponge) is to understand with all your senses the addictiveness of stardom. “Feel the magic in the making,” sings Norma. You can only nod your head in   agreement.'"}, "time": 1742561883.0118568}