{"duration": 0.11169075965881348, "input_args": {"text": "'The explosion of violence against conservatives across the country is being intentionally ginned up by Democrats, reporters, TV hosts,   comedians and celebrities, who compete with one another to come up with the most vile epithets for Trump and his supporters. [They go right up to the line, trying not to cross it, by, for example, vamping with a realistic photo of a decapitated Trump or calling the president a “piece of s —  ” while hosting a show on CNN.  The media are orchestrating a bloodless coup, but they’re perfectly content to have their   shock troops pursue a bloody coup. This week, one of the left’s foot soldiers gunned down Republican members of Congress and their staff while they were playing baseball in Virginia. Democratic Socialist James Hodgkinson was prevented from committing a mass murder only by the happenstance of a member of the Republican leadership being there, along with his   Capitol Police protection. Remember when it was frightening for the losing party not to accept the results of an election? During the third debate, Trump refused to   agree to the election results, saying he’d “look at it at the time. ” The media responded in their usual   style: A ‘HORRIFYING’ REPUDIATION OF DEMOCRACY  —   The Washington Post, Oct. 20, 2016, DENIAL OF DEMOCRACY  —   Daily News (New York) Oct. 20, 2016 DANGER TO DEMOCRACY  —   The Dallas Morning News, Oct. 20, 2016, ONE SCARY MOMENT IT ALL BOILED DOWN TO   …     DEMOCRACY  —   Pittsburgh   Oct. 21, 2016, “(Shock) spiked down the nation’s spinal column last night and today when the Republican nominee threatened that this little election thing you got there, this little democratic process you’ve got here, it’s nice, it’s fine, but he doesn’t necessarily plan on abiding by its decision when it comes to the presidency. ”  —   Rachel Maddow, Oct. 20, “Trump’s answer on accepting the outcome of the vote is the most disgraceful statement by a presidential candidate in 160 years. ”  —   Bret Stephens,   editorial page editor at The Wall Street Journal, “I guess we’re all going to have to wait until Nov. 9 to find out if we still have a country  —   if Donald Trump is in the mood for a peaceful transfer of power. Or if he’s going to wipe his fat a —   with the Constitution. ”  —   CBS’s Stephen Colbert, Oct. 19, 2016, “It’s unprecedented for a nominee of a major party to themselves signal that they would not accept  —   you know, respect the results of an election. We’ve never had that happen before.   …     This really presents a potentially difficult problem for governing   …    ”  —   MSNBC’S Joy Reid, Oct. 22, 2016, “This is very dangerous stuff   …     would seriously impair our functioning as a democracy.   …     This is about as serious as it gets in the United States. ”  —   CNN’s Peter Beinart, Oct. 20, 2016, “Obviously, it’s despicable for him to pretend that there’s any chance that he would not accept the results of this election it would be  —   in 240 years you’ve never had anybody do it.   …    ”  —   CNN’s Van Jones, Oct. 20, 2016, Then Trump won, and these very same hysterics refused to accept the results of the election. Recently, Hillary announced her steadfast opposition to the winning candidate using a military term, saying she’d joined the “Resistance. ” Imagine if Trump lost and then announced that he’d joined the “RESISTANCE. ” He’d be accused of trying to activate   militias. Every dyspeptic glance at an immigrant would be reported as fascistic violence. But the media seem blithely unaware that the   “Resistance” has been accompanied by nonstop militaristic violence from liberals. When Trump ripped up our Constitution and jumped all over it by failing to concede the election three weeks in advance, CNN ran a segment on a single tweet from a random Trump supporter that mentioned the Second Amendment. Carol Costello: “Still to come in the ‘Newsroom,’ some Trump supporters say they will refuse to accept a loss on Election Day, with one offering a threat of violence. We’ll talk about that next. ” In CNN’s most fevered dreams about a violent uprising of Trump supporters, they never could have conceived of the level of actual violence being perpetrated by Americans who refuse to accept Trump’s win. (See Hate Map.) It began with Trump’s inauguration, when a leftist group plotted to pump a debilitating gas into one Trump inaugural ball, military families were assaulted upon leaving the Veterans’ Inaugural Ball, and attendees of other balls had water thrown on them. Since then, masked, armed liberals around the country have formed   organizations to beat up conservatives. In liberal towns, the police are regularly ordered to stand down to allow the assaults to proceed unimpeded. The media only declared a crisis when conservatives fought back, smashing the   beta males. (“Battle for Berkeley! ”) There is more media coverage for conservatives’ “microaggressions” toward powerful minorities   —   such as using the wrong pronoun  —   than there is for liberals’ physical attacks on conservatives, including macings, concussions, and hospitalizations. And now some nut Bernie   confirms that it’s Republicans standing on a baseball field, before opening fire. In the media’s strategic reporting of the attempted slaughter, we were quickly told that the mass shooter was white, male and had used a gun. We were even told his name. (Because it was not “Mohammed. ”) But the fact that Hodgkinson’s Facebook page featured a banner of Sanders and the words “Democratic Socialism explained in 3 words: ‘We the People’ Since 1776” apparently called for hours of meticulous   by our media. Did reporters think they could keep that information from us forever? The fake news insists that Trump’s White House is in “chaos. ” No, the country is in chaos. But just like Kathy Griffin and her Trump decapitation performance art  —   the perpetrators turn around in   innocence and blame Trump.'"}, "time": 1742562139.057924}