{"duration": 0.1265723705291748, "input_args": {"text": "'NILES, Mich.  —   When Jennifer Purucker, 31, was asked on Saturday morning what she thought of the Women’s March on Washington, she took a sip of coffee and shook her head. “Never heard of it,” she said. Crystal Mangold, 38, paused as she carried her young daughter down Main Street. “No idea what it is,” she said. Angie Searles, 45, perked up at the mention. “Oh, I just saw that on the news,” she said. “I don’t know anyone who’s going. ” The march galvanized hundreds of thousands of women across the country who packed buses and airplanes to flock to the nation’s capital to fight for reproductive and civil rights under the Trump administration. Across the country, they rallied en masse on Saturday in downtowns, wearing pink   knit “pussy hats,” waving handmade signs and sharing pictures on social media with the hashtag #WomensMarch. But as conversations unfolded in Niles, a riverfront town of 11, 000 in southwest Michigan, it was a reminder of how the country has become a split screen on issue after issue. “Those women don’t represent me or my viewpoints,” said Leta Nielsen, 66, a retired teacher, who added that she hoped that demonstrators would not start fires like the ones she saw on the news from the protests surrounding the inauguration on Friday. In Niles, the biggest draw of the weekend was the annual ice festival, which attracted people from all over the region to admire elaborate ice sculptures lining the sidewalks, participate in a 5K race and sample the tall, spicy bloody marys at the Brass Eye cocktail lounge. “I don’t think my husband would support me going,” said Stephanie Palmisano, 26, a medical worker who supported Hillary Clinton but whose husband voted for President Trump. “Trump winning has caused a lot of tough conversations in our marriage. I have two little girls. For a president who thinks so low of women, it just breaks my heart. ” Lucy VandenHeede, 79, said that her    and two granddaughters had taken a bus to Washington from Kalamazoo, Mich. to attend the march and that she was cheering them on from afar. Women’s rights have come a long way, she said, recalling the days when she worked in the newspaper business selling advertising and was paid far less than her male colleagues. “They earned commission, and I didn’t,” she said. “And I was always called ‘Mrs. John VandenHeede.’ I didn’t even have a name. ” “She was the best salesman in the bunch, too,” said her husband, Mr. VandenHeede. Other women sharply questioned the notion of protesting a president whose administration had begun only the day before. “It’s kind of offensive,” said Linda Hine, 56, an accounting manager who voted for Mr. Trump. “People are just criticizing because they didn’t get their way. All it did was force another reason for people to be divided. ” Ms. Hine interpreted Mr. Trump’s inaugural speech on Friday as a generous, uplifting call to bring people together, contradicting the belief of others that it had painted an overly dark and gloomy picture of the country. “It was about unity,” she said. Her friend Kim Redman, 48, said that as opponents of abortion, they would not have felt welcome at the march anyway, echoing a frequent complaint that only women who favor abortion rights were encouraged to attend. If women would just give Mr. Trump a chance, he might not be as bad as they expect, she said. “He’s our president no matter what,” she said. Why do women need a march at all, some people asked, when they have made so many gains in the past few decades? “Women have equal opportunities in the workplace now. We’ve got minorities in jobs. The glass ceilings have opened up all across the nation,” said Tammy Chesney, 53, a carpenter, adding that she had never experienced discrimination on the job. She shrugged off Mr. Trump’s comments that he had grabbed women’s genitals without asking permission. “It wasn’t nice,” she said. “But he apologized, and it was in the past. It was blown all out of proportion. ” There are bigger concerns in Niles than expanding the rights of women, many people said. They worry about the state of local schools, the cost of health care and the town’s economy, which has struggled with the loss of manufacturing jobs. Mr. Trump’s campaign promise to “Make America Great Again” had special resonance in Rust Belt towns like Niles, said Tracy Guetterman, 49, a retail manager, as she stopped to show her    granddaughter Melanie an ice sculpture in the shape of “U. S. A. ” “Personally, I’d love to see our country go back to one parent working, like the good old days,” she said. “I want to be able to quit my job. ” Ms. Guetterman saw the marches as nothing more than complaining from liberals. “Quit blaming everybody for your problems,” she said. “Get out there and do it yourself. ” Yet many of the sentiments from the Women’s March were echoed in the voices of people in Niles, about 600 miles from Washington. Diane Kellenburger, 69, a retired executive for a nonprofit organization who had purple streaks in her gray hair, showed off a gold medal from the 5K race, where she had the fastest finish in her age group. She had friends who went to a nearby march in Valparaiso, Ind. and she shared their disgust at Mr. Trump’s attitude toward women. “Personally, that’s why I didn’t vote for him,” she said. “We’ve come so far with women’s rights. I have a high level of concern that we’re stepping backward. ” Kim Shelton sat behind the counter of her memorabilia shop downtown, a business that she said is dependent on tourists, as local people have so little to spend these days. Michigan flipped to Mr. Trump, she insisted, because its residents believe he is a successful businessman who can turn things around. Ms. Shelton is not so sure whether he will pull that off, she said, but she is convinced that he does not respect women like her. “I keep hoping, but I don’t think he’s going to change,” she said. “I think women are going to take a few steps back with Trump. ”'"}, "time": 1742561845.0938542}