{"duration": 0.04765939712524414, "input_args": {"text": "'The once and future coach  —   Bruce Arena  —   will try to make it sound simple. Even at 65, he will roll his eyes and sneer at complicated questions about strategy and formations. This masks his feel of the game, buys him time and distance. Don’t overthink it  —   that’s the message, conveyed in a Lawn Guyland accent that he blessedly has never lost in his wanderings. Now he has been hired to return to coach the United States men’s national soccer team, which hit bottom this month with    losses in World Cup qualifying play. “He’s a wonderful guy  —   just what we need right now,” Doug Logan, the first M. L. S. commissioner, said Monday. In the early years of the league, Logan fined Arena early and often, hiding his respect and friendship. Once, Arena criticized the league, and Logan went public, saying that Arena “frequently only opens his mouth to lace his shoes. ” The owners were aghast Arena was probably less so. “I’m his biggest fan,” Logan said. “I think the world of him. He is one of the finest American coaches  —   in any sport. ” What makes Arena succeed? “First, he’s smart,” Logan said. “Second, he understands the theater of sport, like Casey Stengel. Third, he knows it’s a game that young people play. He coaches during the week and doesn’t think he’s running the game on Saturday or Sunday. ” Logan has compared Arena to Arsène Wenger, the French coach of the English club Arsenal. “He doesn’t overcoach,” Logan said. Keep it simple. Back in 2002, in South Korea, Arena was about to coach in his first World Cup game. Reporters were fretting about the new ball, a typical FIFA marketing device intended to sell stuff rather than represent a breakthrough in aerodynamics. The ball was rumored to be a mixture of  ’   and cannonball, impossible to control. When reporters asked Arena about this fearsome new missile, he replied. “It’s a bawl,” he said. But Bruce, the new ball bends and swerves. Scores will be in double figures. It’s the end of the world. “It’s a bawl,” he repeated in that accent of his, rolling his eyes. He begins most answers with the word “obviously. ” He will no doubt try to simplify the task of resurrecting the wretched national team after its   walking surrender at Costa Rica last week. U. S. Soccer, which removed Jurgen Klinsmann as coach on Monday, on Tuesday appointed Arena  —   the best person on the planet for the job at this point. Arena has been here before, having coached the United States team in the 2002 and 2006 World Cups. The first effort was a raging success: The Yanks came little more than one noncall by the referee from beating Germany and reaching the semifinals. The second was    for the team and for Arena. So it goes. In the process, Arena has become a legend, a member of the National Soccer Hall of Fame and the architect of what may be the best game ever played by the United States  —   the humiliation of its old tormentor, Mexico, in the round of 16 at the 2002 World Cup. The score  —   oh, but you already know  —   was dos a cero. For that game, It’   Bruce realigned his team, shifting Claudio Reyna, his conservative   toward the right side and giving Tony Sanneh, the right back, instructions to barrel upfield when the opening was there. Take it to them. Those two, and others, played the game of their life. Arena sighed and said it’s a simple game. He was already a legend in so many places. He comes from a family that moved from Brooklyn to the suburbs, and he hoped to follow two older brothers into football. He was too small, so he picked up soccer in the fall. Soccer was no ethnic heritage, just a sport he could play while waiting for lacrosse in the spring. He became a goalkeeper in soccer and a midfielder in lacrosse, winning two national titles for Nassau Community College and then playing for Cornell University (and for the national team for one game, a friendly against Israel). Soon he was coaching soccer at the University of Virginia, where he discovered that his coaching cubicle backed up to the visiting basketball locker room. By pressing his ear to the wall, he could eavesdrop on the strategy and exhortations by the earnest Dean Smith of North Carolina and the garrulous Jim Valvano of North Carolina State (another Lawn Guyland guy). Arena never tried to emulate other styles, but he won five national titles before moving to M. L. S. then a new league, in 1996. In the league’s 21 years, there have been two dominant teams: D. C. United in the early years and, recently, the Los Angeles Galaxy. As it happens, both teams have been coached at times by the very same person: Arena, who won titles with D. C. United in 1996 and 1997 and three more with the Galaxy, in 2011, 2012 and 2014. (He also briefly coached the Red Bulls, who have zero titles.) Arena has dominated M. L. S. sharing the Galaxy’s stadium in Carson, Calif. with the national team but giving the distinct impression that he and Klinsmann did not spend quality time together. “He has a camp here, but he does most of his work out by the beach he has his own thing,” Arena said dryly a few years ago. While Arena was critical of his former star Landon Donovan for taking walkabouts from the sport, I got the feeling that Arena did not agree with Klinsmann’s shunning of Donovan as he put together the 2014 World Cup roster. Klinsmann was a charismatic coach during Germany’s   run at home in 2006, but many Germans insisted that the tactics came from his assistant Joachim Löw, who went on to win the 2014 Cup in Brazil as head coach. Now the American team sorely needs a reboot, after losses to Mexico and Costa Rica to open the final qualifying round. The   players with United States passports are not working out the defense is lethargic the midfield of Michael Bradley and Jermaine Jones is shot and Christian Pulisic, 18, is not Cristiano Ronaldo or Lionel Messi just yet. During the Americans’   loss to Costa Rica, the   broadcaster for NBC Universo said the United States team “no tiene alma”  —   did not have soul. He was exactly right. Now Arena will try to put the team back together. He will insist there is no magic formula just go out and play better. It’s a bawl.'"}, "time": 1742628576.2517955}