{"duration": 0.06042361259460449, "input_args": {"text": "'The above information is also available in PDF format here: https://www.documentcloud.org/documents/3192131-Podesta-Stats-20-Rev.html \\nThe full database is provided in the following formats: SPREADSHEET (EXCEL): https://1drv.ms/x/s!AjOxRSb63cIggwp9czI2Wfz6c8H7 (Due to the large file size I have had to utilize OneDrive for this file rather than Google Docs) - Advertisement - \\nPDF: (File Uploading - Check Back) \\n[NOTE: By necessity this is a very long PDF document - nearly 500 pages - and I have tried to squeeze as much data as is useful per page while keeping the data on a single page format. You can enlarge the text by enlarging the Acrobat reader window.] \\nI have made this spreadsheet so that you can filter and sort the data. For example you can use the sender information (as received) using the \"From\" Column (L). In addition I have separated out the email address and the sender name into two columns at the end of the spreadsheet. What you will find is that some email addresses are associated with multiple user names. Sorting according to these columns will provide a means to determine all emails from a particular email address which will not be visible if you only use the alphabetical sort order of the file names. (This data is only in the spreadsheet. I kept it out of the PDF for presentation). I also include a number which corresponds to how many instances of each (the email address, the user name, and the third (last column) is the number of instances of the original \"From\" column (which combines both email address and user name). This extra data is essential to determining how many emails were sent from particular individuals rather than just one email address and vice versa. \\nThe first column (C) is the actual file name - an eight digit number - of the original .eml file. This is followed by the second column (E) which contains the Email ID - this is a number assigned by Wikileaks and can be used in their search engine and is essential to identify the URL to the Wikileaks page for that email. The \"Get\" column will allow you to download the original .eml file from the Wikileaks database. The \"Link\" column will open the Wikileaks page to that email on their website. \\nThe information is presented with a series of colored bands. This is useful for getting a visual image of the whole. Each different colored band represents a different set of emails by data dump (the number of the dump provided in the column of that name ). The DARK ORANGE bands stand out the most - as they represent emails that have yet to be released . This provides a quick visual guide to what is remaining and gaps within a particular sender\\'s set of emails (the emails are listed from the first 1.eml to the last in numerical order - which generates a sort based on the first letter recognized from the \"From\" column - and this is thus listed alphabetically. This can be confusing, however, as while most names are listed with the first letter of the first name some use the first of the last name (i.e. Paul Begala can be found in the \"B\" set toward the beginning of the list when sorted by file name (number)).'"}, "time": 1742564065.22646}