{"duration": 0.09843945503234863, "input_args": {"text": "'The LPWAN: The Future of Powering the IoT? November 4, 2016 Google + As the predictions for the number of IoT devices worldwide edges into the billions, the question is becoming less about whether and how to connect devices, and more about how to sustain so many devices on existing networks.\\nConnectivity is a key to the function of the IoT, so many engineers are working on alternatives for getting data from point A to point B. But sustaining those billions of connections requires a wireless technology that can handle long distances, use minimal power, and cost less than what is being used for IoT devices now. \\nCurrently, short-range wireless connectivity isn’t necessarily an issue, as connectivity technology like Wi-Fi, Bluetooth, ZigBee, and Z-Wave. Longer range connectivity is effectively managed by 2G, 3G, and 4G LTE, with 5G wireless not too far off in the future. However, these tools for long-range wireless connectivity are not designed for the typical IoT device, that doesn’t require the same amount of power as a cellphone or other mobile device. These tools are better suited for larger devices, that contain larger batteries and can be regularly recharged, rather than a smaller, sensor-based device that either doesn’t have a battery or has a very small battery that cannot be recharged, or doesn’t need recharging on a regular basis. \\nAs developers continue to create devices using efficient, low-power microcontrollers and applications , it’s becoming increasingly clear that connectivity also needs to focus on implementing lower power options as well. Current connectivity options for IoT devices eat up too much battery life. One potential solution that is getting a lot of attention is a new kind of low-power, long-range wireless network: Low-Power WAN (LPWAN). ‘Help Us, LPWAN, You’re Our Only Hope’ \\nLPWAN may not be the only hope for a solution for the power problems facing the IoT, but it is showing the most potential. \\nThe idea of LPWAN is not a new one, either. Typically designed for machine-to-machine networking environments, LPWANs have lower power requirements in addition to a longer range, at a lower cost, than traditional wireless connectivity options. As a result, LPWAN is believed to be a better choice for IoT applications, since it transfers data at lower rates while also reducing power consumption. Since most home equipment offers more bandwidth than the typical IoT device needs, it uses more power than necessary, but a LPWAN network allows for more devices to be connected over a larger area, and offers improved machine-to-machine communication. \\nLPWANs also offer a longer range of connectivity than the usual home solutions, such as Wi-Fi — in some cases, the connectivity even extends for miles. This allows for connections at longer distances, which is important for the operation of some IoT devices. Drawbacks to the LPWAN \\nWhile the LPWAN holds a great deal of promise for the IoT going forward, there are some drawbacks. For starters, LPWAN technology was not initially designed for the IoT, so there is some question as to how it will actually work for IoT-connected devices in the long term. Because there are still questions about how to design devices to be as low-power as possible, there is no guarantee that LPWAN will end out as the best solution. \\nThere are also questions about how useful LPWANs will be once 5G technology is released; in other words, will 5G be able to handle the needs of the IoT better than any existing technology now? Not to mention, the idea of an LPWAN is relatively new, so there isn’t truly enough data to support claims about their cost, data rate, and battery life in terms of IoT devices. As more applications are deployed on the networks, it will be easier to see whether they can handle large-scale deployment and handle IoT applications effectively, but for now there are still questions. \\nThe explosion of the IoT is creating new challenges for companies that are still exploring the technologies and skills necessary to make everything work. However, choosing the right wireless network for connected devices is one of the most important priorities for any company, as they attempt to balance the myriad conflicting requirements. So for now, then, it appears that LPWAN has the most potential as a solution for wireless connectivity, and will be the best option for the foreseeable future. '"}, "time": 1742562590.419443}