{"duration": 0.2579615116119385, "input_args": {"text": "'Imagine a world with no boundaries, it is not hard to do, there is even a word for it, globalism.\\nRecently, in a feverish nightmare, I realized I am a globalist. Ultimately, I do see the world without countries. That is about as much intellectual use as one can glean from John Lennon’s famous song about a hippy commune utopia. He and I, though, are both globalists indeed, at least in a technical sense. I believe that the ultimate goal of humanity should be to live under a global tent in unity with a shared understanding, total integration, and one economy.\\nI believe in an objective moral truth, that I am certain others agree with when they truly think about it internally. Morality is the foundation of all that is good in the world, and one day it will be the beginning of a global community. So I agree with Hillary Clinton, with Leftists who want open trade and open borders, not only in this hemisphere but worldwide.\\nI agree that one day, the laws and values I hold, will be the same all over the world. Then all people can come together and live in peace. Christians, Muslims, Buddhists, Atheists, and Clinton want this too. Even Adolf Hitler was smart enough to see that there is no utopia where there are still nations with goals that do not perfectly align with each other. Hitler, despite all his obvious flaws and hate, was attempting to shape the world in his image, which he believed would bring peace and prosperity.\\nEven Adolf Hitler was smart enough to see that there is no utopia, where there are still nations with goals that do not perfectly align with each other. Despite his obvious flaws and hate, he was attempting to shape the world in his image, which he believed would bring peace and prosperity.\\nPeople disagree on how to achieve a global society and how it will look. Most agree that Hitler’s means were not justified, and his ends looked a bit too white-washed. Regardless of his disgusting views on how to achieve it, he believed that a society and government focused on globalism was not only achievable but inevitable. So who in their right mind would not want this? – Damned dirty conservatives.\\nWait, there are conservatives who might be thinking, “Hey! I want that, too!” Those who prefer peace and accept people of all races and religions. Those who would appreciate the opportunity to visit other lands without the hassles of obtaining a passport and exchanging currency. Why not damned dirty Atheists, or Clinton, or all the other things listed? Because conservatives are mentally defective, obviously. People are even worse than Hitler, in fact, he would have cleansed them at Auschwitz, after the mentally handicapped and just before the Jews and POWs.\\nPeople are reactionary, scared of change, of Islam and homosexuals, scared of a little competition. They are stupid, too. How stupid? More stupid than Hitler.\\nAlright, calm down. The truth is, conservatives believe in globalism, too. The problem is, people do not like the means of achieving a global state and asserting a generalized morality, which is the great irony of the age.\\nFundamentally, there are two basic ways of achieving a globalism, though it is more of a spectrum: the Force Method and the Hearts and Minds Method. Hitler was obviously an advocate of using force to achieve his goals and it almost worked. The clear weakness of the Force Method is, as one could guess, the force. People do not like to be coerced or threatened into doing something. Even if the moral reasoning is sound, coming at a person and forcing certain values upon them, does not work.\\nPeople are resigned to compromise their convictions in order to rule a force-based empire. The Romans had a particular problem forcing the Jewish people to let go of the God of Abraham and bow to the Emperor. So, Rome left them alone, for a time. China currently is trying to rid\\nChina is currently trying to rid their country of Christianity. Some provinces are working harder than others in this attempt. They value not only a secular government but a secular citizenship, yet they are bending their values because Christians are pesky and rebellious. They are finding ways to worship in secret. This is a simple truth in rulership, even in democracies, governments will bend in the ways they have traditionally allocated resources, but in their moral values toward minorities to keep the peace.\\nThere is an objective moral truth, and it will never change. Though people may disagree on some of the nuances. Values change, but morality does not. Murder is wrong, regardless of what the culture says. Real morality is objective, regardless of cultural values.\\nThe Spartans would kill babies they deemed unfit to maintain their ideals of physical prowess. Some will argue against casting judgment, that is wrong, as morality is subjective. Who are humans, to tell a culture how to behave? A culture does not need to be told how to behave to believe their actions are immoral. This is one of the great ironies of America and part of why limiting government is such a foreign concept to some of the nation’s citizens.\\nA large segment of the American population believes they should not be told how to behave by society. These same people want the government to tell others to bake a cake for people, who they believe are committing an act against God. They are confused between their God and the nation’s encouragement for other nations to become democratic, or when the country intervenes with genocide.\\nDemocracy is encouraged and is proven to give citizens more power and greater stability, which is good for everyone. Encouraging democracy is like a Christian encouraging Christianity. Intervening in genocides or the use of chemical weapons is upholding of ideals most of the world has agreed upon, despite vast differences in religious values.\\nThe group I am referring to are Leftists, not liberals nor democrats in general, specifically Leftists (The alt-right is guilty of this to an extent, too). Their confusion is understandable, though indicative of a lack of thought, at least in this area. This leads them to think the government can intervene whenever they perceive an injustice, they are wronged, or they perceive their world as unfair. They fail to see the market correcting for racism and bigotry, as competition increases.\\nIf the local baker will not bake a cake for a gay wedding. There are plenty of liberal bakers that want more business. Leftists fail to see personal responsibility as a higher moral position than sanctioning abortion. Why advocate for abortion before personal responsibility? That seems incredibly foolish.\\nThe freest countries have been the most disciplined, and the ones that fail give into hedonism and selfishness. Individuality is important, but individuality and selfishness are entirely different things. Individuality is merely recognition that I am an individual with perspectives and desires unrelated to others and I can pursue them so long as I respect others. Selfishness is putting your individualism above a neighbor’s. This is also an ignorant and hypocritical view considering people are forced to apply this morality selectively. However, others choose to apply it when they think a baker should make a cake for someone but ignore it when someone tells them to donate some of their money to pay reparations.\\nLeftists like the force method, as it applies to their ideals, even when they conflict with basic American ideals written in the Constitution. It is shocking that people believe the Founding Fathers did not know what the future would hold, therefore, their morality and philosophy needs to be adjusted, and must be.\\nThere is nothing new under the sun, every reason society has collapsed are the same ones constantly being fought against in society. Overspending, overextending, underproducing, the breakdown of societal norms in favor of selfish endeavors.\\nLeftists believe globally, people are beyond these problems. Sometimes I do too, but I recognize that I have been lulled into a false sense of security by the media and the ease with which I have attained creature comforts. Modern life is a struggle, but I do not have to work hard to find a means to put a roof over my head. That roof might not be as great as the American dream described, but it is strong.\\nThe Hearts and Minds Method is much harder to achieve than the Force Method, and that is its biggest weakness. The strength is that convincing someone through reason is a far better way to get them on board with like-minded goals and keep them there. If the Third Reich wore short-sleeved button down shirts, black ties, and black slacks while using unrelenting reason to convince the Jewish people they are a scourge on the world, thus they should all kill themselves, I do not think I would have a problem with Nazism. If they could use irrefutable reason to prove their claims, then sure, but how does one even begin to reason that genocide is okay?\\nOne of the greatest things about the Hearts and Minds Method is that it incentivizes people to act as role models. It is difficult to convince a foreign nation to try democracy when my own democracy is impregnated by a face-hugging creature and is currently in the throws of a painful, internal c-section birth, a la the movie “Aliens.” Democracy is easy to promote when people can see what it has accomplished.\\nAs a young nation, people marveled at American universities and churches and how well established they were. They knew these institutions were the backbone and muscle of the nation, even if they disagreed with Christianity.\\nDemocracies are rather young and do not seem to have as long a lifespan as other governments. Why is holding on to it so hard? Pure democracies and republics do not seem to last as long as kingdoms and empires with oligarchic, plutocratic, monarchic, and dynastic rules. The simple explanation is that in other governments, rulership can drastically shift to hold things together and still adhere to their morality. A king can change his rule to fit his country’s needs and values at the time. Nevertheless, when his son succeeds the throne with entirely new ideas, suddenly ruling with an iron fist, the morality of divine right still holds. A constitution is not quite so malleable. When the constitution fails, the democracy fails.\\nOne would think it would be easier to hold on to democracy in the U.S. Most of the people believe these rights afforded by the Constitution are inalienable, they are rights regardless of whether people adhere to them or not. Americans believe them to be objectively moral. The difficulty is that these rights are unflinching, people are the opposite. When a few stories about horrible mass murderers fill the media, for weeks at a time, people flinch. Everyone knows what it feels like to flinch, but what is it really? It is that momentary lapse in reasoning and sudden reliance on instinct.\\nIn that moment, people are unable to override natural instincts with reason. I can tell someone that I am going to go through the motions of punching them in the face but stop just before hitting them. They can keep telling their body that I will not hit them, however, when I pull back my fist and get ready, the body will start naturally tensing up, and when the punch comes, the body takes over, even though there should be no fear of pain. That is flinching.\\nSo, in moments when Americans are particularly afraid, naturally, morals shift to fit the feeling of the moment. Despite the morality of the Constitution. It is a time to be as unflinching as the Constitution, in order to uphold it. Americans need to trust that these ideals are ultimately in line with the Constitution, even when there are moments in history that it seem to hinder, or it seems the nation has evolved past it.\\nBased on the relentless history of empires rising and falling, and accurately map out what steps lead to a collapse, it is easy to prove that the rate of failure is directly related to how far the people strayed from the morality established in their youth. Sometimes those moral shifts were rightly made, however, it was made in haste opening the door for exploitation.\\nFor example, I think most agree women and minorities should have the right to vote, so long as they are citizens. Nevertheless, what happened as the country correctly shifted morality to include them as equal voters? Once, the only people allowed to vote were landowners who were white men. Therefore, remove the “white man” part and decide what it means to only let property owners vote. It essentially guarantees that the people at the polls are at least somewhat informed on the issues. They at least understand the topics that will protect their personal assets.\\n  anyone can vote, the uninformed, the infirm, even the dead from time to time. These people are not informed enough or sometimes even capable of making an intelligent choice. Nevertheless, they are bussed to polling stations and encouraged to vote for politicians, regardless of whether those politicians really have their best interests at heart. This is not meant to blame a particular party for this practice, it is merely meant to point out that the exploitation is possible because of a shift in morality. The consequences not fully comprehended, at the time.\\nIt is foolish to have so many people vote, who have little idea what they are actually voting for. I do not advocate taking their votes away. It would be far better to educate people, so they can make informed decisions. Clearly, though, the moral shift toward a greater good, left the door open to exploit America’s election process. This also led to a reduction in the quality of political discourse. It incentivized pandering and dishonest rhetoric.\\nIn the wake of the Great Depression, the United States gave more power to a centralized bank, which the Founding Fathers advised against. After the Cold War, Americans gave the CIA more power than perhaps they should have. In the wake of terrorism, citizens gave up protections for their privacy. Every time the nation is threatened, Constitutional morality is challenged and people flinched, giving up rights or the protection of those rights.\\nThis is how empires begin to crumble, and this is also why conservatism is failing. Conservatives want to conserve ideals but even they sometimes flinch. As these ideals give way to legitimate worries about threats to the American ways of life, conservatives began to look like the group standing in the way of progress. Conservatives have been painted into a corner by the nation’s fears.\\nHow does this make globalists like everyone else? What would the nation look like without all those historical threats to society and subtle shifts in morality? It is pretty simple, people would state their cases with reason. Spread the message by openly debating and convincing people honestly. America would not force these ideals on other nations but openly express the belief that democracy is better. It would be proven through success and testimonies from a citizenship freer than any nation has ever been.\\nAmerica would remain with the free market economy and intelligently make trade deals that maintain it and be competitive. When another country, like Mexico, failed and wished to model their new government closer to the U.S., the nation would do more business with Mexico. Maybe one day, if ideals aligned close enough, they would ask to come under the Constitution. Again, this is in a perfect world. If the nation could hold it together long enough, the American way of life and governance would spread globally. It would be a glorious world where ability, hard work, and discipline would ensure a better life. Unity would be strong due to naturally aligned morality that came through reason and observation, rather than aggressive annexation and expansion.\\nConservatives are indeed globalists, but they want to maintain sovereignty over themselves and will not willingly give that up. Globalism would only be accepted if it came from a mutual respect for American ideals and it came through natural processes of the free market and democratic ways of this nation.\\nThis is by far the hardest government to achieve globally because it has the slowest burn. It necessitates nations advocating it and not actively pursue it. Allow other nations to meet America where it is and choose to be part of it, only if the nation believes they are true. It advocates expansion due to choice, not war. The time involved makes this impossible, yet it is something I still want to strive for. What makes this strategy strong is its moral foundation, what makes it weak is how strictly people must adhere to American ideals from generation to generation in order to achieve it.\\nThat is why conservatives are so fervently fighting for their ideals because they believe this is the how globalism has promise in achieving world peace without becoming tyrannical. Even if American morality is not exactly right, this same strategy, when followed strictly by another nation should convince people to join them because the nation would be convinced rationally they have the better ideas. This is only after America has scrutinized their views meticulously against the Constitution and determined, beyond all doubt, that their way is better. This is the only intellectually honest way to govern, but it is the most difficult. Leftists will never agree to this because their frame of reference is so short-sighted, but more traditional liberals I’m sure can agree with this principle even if they disagree that it is worth following such an ideal so strictly. Leftists seek to destroy this ideal, they may not realize it, but they seek power before identity and control before peace. They are intellectually enemies to the ideals of the Constitution, but they are our brothers and sisters under the Constitution, and reason can win them over.\\nThis is the only intellectually honest way to govern, but it is the most difficult. Leftists will never agree to this because their frame of reference is so short-sighted. More traditional liberals, I am sure can agree with this principle even if they disagree that it is worth following such an ideal so strictly. Leftists seek to destroy this ideal, they may not realize it, but they seek power before identity and control before peace. They are intellectually enemies to the ideals of the Constitution, but they are brothers and sisters under the Constitution, and reason can win them over.\\nOpinion by Michael Phillips\\nImage Courtesy of Neil Hester’s Flickr Page      global , globalism'"}, "time": 1742562172.312702}