{"duration": 0.11337423324584961, "input_args": {"text": "'Asra Nomani, a former Georgetown University professor,   of the Muslim Reform Movement, and author of Standing Alone: An American Woman’s Struggle for the Soul of Islam, joined SiriusXM host Alex Marlow on Tuesday’s Breitbart News Daily. [Marlow professed his admiration for Nomani’s recent column, “The  ’s Cyber Jihad Against Trump and His Supporters,” which covered what Marlow described as “the most significant news event of the year so far, aside from the Trump inauguration”: the    riots at U. C. Berkeley.  “Being a journalist, I believe in the power of words, and I also study propaganda. I feel like we’re in the middle of a fierce propaganda war,” Nomani said. “The one word that I think is important for everyone to know is ‘agitprop.’ It’s an old word for agitation propaganda. As you know, working at Breitbart, the concept of ‘ ’ is thrown at you all the time. It’s being used today as a way to try to immediately discredit folks. I thought to myself, ‘Well, what do we have happening on the Left? ’”  “I write in the piece about how I’ve been a lifelong liberal,” she explained. “Just to let your listeners know, I came from India at the age of four and grew up in Morgantown, West Virginia, in a college town and absorbed all the strong liberal politics, really absorbed it into my heart. So I’ve been really distressed these last months. Another confession I had written a while ago in the Washington Post was that I had voted for Donald Trump, as a lifelong liberal. ” Nomani recalled the impact of seeing Milo Yiannopoulos of Breitbart News under assault by   at a speech in Chicago and then again at U. C. Berkeley.  “I watched this happening on my TV screen, and I thought to myself, just like we do with anything in journalism, ‘Where did it begin? ’” she recalled. “I had the good fortune to have met this really great   named Eric Feinberg, who works out of New York City, and basically what we noticed was the hashtag that was being used to bring people to the streets there in Berkeley was hashtag #ShutDownMilo. And so what Eric did was track it, track the hashtag back to months before the actual protest happened against Milo, to a kind of odd website called ItsGoingDown. org. ” As chronicled in her latest essay, Nomani worked from that website to trace the outlines of a “  radical movement that is causing mayhem in our streets today. ” “I call it a cyber jihad because, as a Muslim, I’ve been well familiar with the agitation propaganda by my Muslim extremists,” she explained. “I see how what’s happening here is this very dangerous intersection  —   ‘intersection politics’ is such a popular word  —   between the far Left in America and the far Right in my Muslim community. That’s why I now see this as a cyber jihad that’s now trying to really claim America. ” Marlow noted the grim irony that the new “Antifa” ( ) movement is “just about the most fascist force in the West,” and he argued this intersection of totalitarian ugliness and   politics is more widespread than the “ ” fringe Nomani describes in her work. “I hear you, and you won’t get a fight from me on this one because, honestly the disturbing reality for me as a liberal is exactly this dynamic you’re talking about,” Nomani replied. “I use this concept of ‘ ’ really as a   to the use of  . It’s a linguistic tool on my part as a writer. But intellectually, absolutely what you’re saying has been my experience and my observation in my reporting. ”  Marlow asked Nomani about the most controversial action taken to date by the president for whom she voted: his executive order temporarily banning immigration from seven   countries. “I do call it a ‘  Muslim ban,’ as I also called the women’s march a ‘  women’s march,’” Nomani said. “They are all examples of ‘hashtag intifada,’ as I also talk about  —   an attempt to try to exaggerate reality, to make it agitprop. I as a Muslim and a member of the Muslim Reform Movement recognize the extremism problem that we have in the world and want us as a country to develop pragmatic solutions. ” “The ‘Muslim ban’ did not work because of this framing that was done, this propaganda that was done against the executive order,” she said, stressing that she uses the term ‘Muslim ban’ for Trump’s executive order sarcastically.  “What I also ultimately think we have to do is, in your community and in America, really walk the middle path with solutions,” she urged, warning that extreme expressions from the far Right would lead to the same sort of angry but ineffectual dead end as the  . “Everything that has to happen in our country going forward, I think, has to be done with sensibility but also a sense of compassion to each other as human beings. I hope that does not sound too far liberal to you, but I think you know what I mean, in terms of trying to draw people at their heart also,” she said. Nomani said it broke her heart to declare that America has become embroiled in a civil war, but she added, “There is an insurgency that’s trying to claim America from the far Left. ” “We have to have a balanced and rational response from all circles. And that’s what I just want to continue to appeal to people to be, is civil and human, remembering the humanity of each other  —   because where we see that lost from the far Left, we cannot replace it with inhumanity,” she said. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742563645.4708378}