{"duration": 0.10190749168395996, "input_args": {"text": "'in: General Health , Organic Market Classifieds , Organics Nothing tests your willpower like Halloween. Everything at hand is both delicious and terrible for you. And since it’s just one day, is a day-long sugar binge really all that bad? Unfortunately, yes—because it’s never just that one day. The holiday season is upon us and Halloween marks the beginning of our collective descent into the depths of seasonal, socially-acceptable gluttony. All those surreptitious snacks add up in a big way, and not just in terms of empty calories. They’re full of synthetic dyes, preservatives, artificial flavors, and inflammation-promoting refined sugar. My strongest craving is for peanut butter cups. It just doesn’t feel like Halloween without peanut butter cups, but if you’ve ever read the label, you know better than to eat the store-bought kind. You can do so much better by making your own vegan peanut butter cups instead. Homemade peanut butter cups can have healthier chocolate, and less than half the calories (that doesn’t mean you should eat twice as many!). These peanut butter cups taste great and will satisfy any craving for sweets. In this recipe, I used 60% cocoa dark chocolate and the results were incredibly rich and satisfying, especially if you’re generous with the organic natural peanut butter. Once you’ve eaten peanut butter cups made with high quality (not to mention antioxidant-rich) chocolate, you won’t even want the cheap, mass-produced faux-chocolate and peanut-butterish polyglycerol polyricinoleate products the big candy manufacturers make. The Origin and Politics of Peanut Butter Peanut butter seems to be a uniquely American phenomenon, but peanuts, which are actually a legume, are eaten throughout the world. Originating in eastern Bolivia, the plant spread throughout South America and the Caribbean well before Spanish explorers first noted the “discovery” of peanuts in 1502 on the island of Hispaniola. From here, peanuts traveled back to Spain and then on to Africa. [ 1 ] In the 1700s, peanuts were introduced to the United States by way of the African slave trade. Peanuts were even a food ration for slaves during the treacherous Middle Passage. [ 2 ] Once in the US, peanuts were still regarded as a food for slaves, the poor, and livestock. The peanut didn’t shake this reputation until the Civil War, at which point undernourished Confederate soldiers relied on the humble, fatty, high-protein food. Peanuts became an essential part of Confederate soldiers’ diets, but they did not eat peanut butter. Instead, southerners enjoyed roasted peanuts which are still a favorite southern snack. [ 3 ] We actually have John Harvey Kellogg, known for Kellogg cereal, to thank for expanding the popularity of peanut butter in the 19th century. [ 4 ] Crushed, steamed peanut paste was originally intended as a no-chew, protein-rich food for sanitarium patients. It became popular among the upper classes when wealthy former patients returned home. At this point, peanut butter still hadn’t reached the masses. [ 5 ] This changed with hydrogenation, however. In 1923, Heinz became the first food manufacturer to add hydrogenated oil to peanut butter, which improved shelf stability and solved the oil separation problem. Peanut butter was finally available to everyone, but the hydrogenated oil content kept increasing. Some brands contained as much as 25% hydrogenated oil and only 75% peanut butter. [ 6 ] For 12 years, the FDA and food manufacturers argued over the appropriate percentage of peanuts that peanut butter must contain. Ultimately, peanut butter was defined as a product that contained at least 90% peanuts, and not more than 10% optional ingredients, such as salt, oil, and sugar. As we all now know, the trans fat content in hydrogenated oil is terrible for heart health. [ 6 ] Since trans fats are on their way out of the American food supply, we’ve seen a shift back to “natural” peanut butter, which should only contain crushed peanuts and a little salt. Unfortunately, many peanut butter makers are now adding palm oil, a saturated fat , into their no-stir peanut butter. [ 7 ] I strongly recommend the old-fashioned peanut butter, the kind with oil separation—all you have to do is stir it. It has a better texture and a more peanutty taste than hydrogenated or palm oil peanut butter. Not only is palm oil ecologically unsustainable and mired in controversy, [ 8 , 9 ] it also makes peanut butter greasy and less palatable. I used natural peanut butter (just peanuts and salt) in this recipe and it worked like a dream. Read This Before Working With Chocolate First and foremost—wear an apron, you won’t regret it. Chocolate stained clothes are no joke! Try to avoid using a cloth kitchen towel. Chocolate can be very messy and once it solidifies it’s difficult to wash out; you’re better off using paper towels and lining your work surface with wax paper. Take care that you don’t get ANY water in your chocolate—water ruins chocolate. If you do make this mistake, DO NOT MIX the water into the chocolate, it will get ugly and strangely chunky. Just quickly grab a spoon and scoop out all the water and the afflicted chocolate. Vegan Peanut Butter Cups Recipe Prep time: 20 minutes Cooling time: 15-20 minutes, depending on the chocolate Total time: 35 minutes'"}, "time": 1742563615.0230207}