{"duration": 1.7270643711090088, "input_args": {"text": "'Murder squad. sgtkillgood \\nEvery one of those F.B.I. pricks should face murder charges . That was a set up by the sheriff they were on the way to see . The F.B.I. already knew he was going to die . Premeditated murder from the agents all the way to the top man who came up with this idea . bdtwilson \\nHas to be more video state police have body cams.. 2nd What would a person that keeps his gun on his right hip have it on his left pocket? Curtrena Webster \\nsame dumbasses crying for these criminals cheer when an unarmed teenage black kid is killed. Only one I feel sorry or is the girl, who obviously had no clue how seriously a game was being played. They were told to exit the vehicle and LaVoy chose to speed off. Sad that a life was lost for some fantasy world of wild wild west, but 2 yrs of playing nice by the Feds was enough. john smith \\nthis last comment brought to you by the NDAA © Corum \\nYou dumb cow you don’t know your ass from a hot rock. Yes there were wrongs on both sides if he had simply gotten out of the pickup he may still be alive but the simple fact is for many many years the federal government has and continues to over step it’s bounds they steal money land and freedom from us all at an alarming rate and every time someone stands up for them selves and there freedoms guess what here comes the jack booted thugs and shortly after there is another ” justified shooting” of a citizen who is just trying to defend there way of life . and as for your comment about the UN armed black kid go piss up a rope If you look at the majority of those cases the person shot did one of two thing they attacked the officer or charged the officer. But if you want to live in your coma of liberal guilt and perpetual blindness be my guest Charge61 \\nThe man was murdered in a pre-set trap. If he wanted to ram them he WOULD have, so saying he was driving a vehicle as a deadly weapon was a lie. They fired 3 shots before he swerved to avoid the trap. He exited with hands up and they executed him. Those on here defending the feds are coward scum who deserve the totalitarian regime you will be getting. Too cowardly to protect your freedoms, you make me sick by your ignorance. You WILL be next fedsuckers. And I will rejoice. COWARDS. Jeff Ex \\nOh puhleze. Tarp man? Not exactly the sharpest tool in the shed AND a home grown terrorist. Weak minded uneducated idiots are who support this cretin. Debbie Truitt Earley \\nBy your comment, it’s obvious you are anti-God and anti-American. Your communist mindset is what’s wrong with America. That’s why we are no longer a free nation. Wake up, comatose weasel. Jeff Ex \\nGood lord, do people like you actually exist? How are people as stupid as you able to actually feed themselves? I’m anti stupid asshats like you, a hillbilly tart… Debra \\nWhat free country does this to peaceful unarmed protestors that are standing up for the rights of America…. It’s not the United States. We are NOT a free people. We are living under dictatorship! Wake up, America! Jeff Ex \\nThis entire comment section has been taken over by people with an average IQ of 30. It’s sad to see what this country has come to, low information religious zealots and ammo sexual nutjobs…. Josh White \\nYou sir, are a shill. You Come into a forum questioning everyone’s IQ, use a stupid made up disorder analogy. In which I can only speculate is your way of saying you appose the second ammendment. In which I can only assume you feel the Agents where justified in exercising their second ammendment right, and yet the man in question never fired a single shot. Debbie Truitt Earley \\nLaVoy carried revolvers. The 9mm was a planted stolen gun from two years ago planted by the officers. Serial #54119868 Adam Ruff \\nTrue – he carried a 45 revolver from what I understand. I would love to know Debbie if you have any information about the 9mm which I also believe was planted. Is the serial number you posted legit and where did you get the information? Please let me know so I can pass the information on to the right people. Marine1954 \\nshooting a unarmed person is just being a pussy . all fbi that shot should be up on charges Thom* \\nThe Oregonian Is as much responsible for his murder as the thugs that pulled the triggers and shot the unarmed rancher and then turned their automatic rapid fire rifles on the 3 unarmed persons who were in the pickup . 2 of whom were women. They sure did release a video which they claimed was unedited (Lie #1) poor quality and behind the cover of pine trees undeliberate (lie #2 and 3) No sound making it impossible too tell who fired first and only. They say different (lie #4) Then they say there was no dash cams (lie#5) No (lapel cams???) The pickup truck LaVoy was driving with his three passengers was later after dark towed to an enclosed lot with locks on the gates and covered with a tarp. (Why cover it)??? They said LaVoy was shot 3 times, the coroner said he was shot 9 times once in the face (lie #5, 6,or 7) I lost count. The FBI said they found a gun on LaVoy the returned data on the gun said it was a gun that had been stolen 2 years ago???? LaVoy didn’t even so much as have a traffic ticket. That gun was planted I would bet my life on it. The Oregonian sold this story to its readers like it was a “hole in the wall gang ready to blaze away at the cops and forcefully taking over a gov’t compound” . The Oregonian lied just to sell their lousy newspapers. The Oregonian could have prevented this murder but they were more interested in selling newspapers. This was just the last of many confrontations between the BLM and the ranchers with more to come and I expect them to get more violent per incident. Now the ranchers know that the FBI and BLM have no problem shooting unarmed civilians. Lot more to this story and you really need to do your homework. It started years ago. Wendy J. Colby \\nIt wasn’t what the FBI wanted only because those in the truck survived thanks to LaVoy Finicum an absolute hero and patriot. Jim Richardson \\nWho was Jim Dunakin? Chuck Fluharty \\nMaybe they should have used a little bit of that kind of Justice on the rioters in Ferguson that where looting stealing and burning down a town for a month but no some ranchers take over a abondon wildlife refuge building and you kill them maybe next time there’s a riot a bunch of good old boys should saddle up and show them how to end a riot oh but wait the blacks and the wannabees can get away with what they want because they where slaves theres a difference between peaceful protest and tearing down a whole city unbelieviable Adam Ruff \\nLaVoy Finicum was assassinated by the US government because he was exposing their illegal land grabs all over the west and his message was catching fire with ranchers all over the country. They killed him to keep him quiet. He and the others were on their way to give a talk to hundreds in the next county about the illegal land grabs. Those who participated in the murder of LaVoy Finicum are traitors to their country and to the oath to the Constitution they took. Those who participated in this murder are the terrorists, they are the criminals, they are the killers. To any of you who think this was in any way justified, you can go straight to hell, you are traitors to your country too. Mike Bonnett \\nAnd today the US military admits they have been using combat drones inside the US in violation of the Constitution….. That is where that aerial footage is from… Robert Capa \\nA guy runs over a blockade, is known to be armed and reaches for gis gun (no, he was not wonded at that time). Shoot me! He said. Gets shot by the police. I guess all those who post here that the police were murders, are active members of Black Lives Matter. Because those guys on the city are not given tha chance to surrender. ANON \\nPlay those games, win those prizes. angry bird \\nAfter watching the synchronized videos, it is apparent that The killing of Mr. Finicum was a planned and staged execution. I can only hope those involved receive what they have dished out. \\nHeartfelt prayers shine on the Finicum family so sorry for your loss and May Lavoy be blessed in heaven and honored righteously here on earth Amen Social'"}, "time": 1742563822.8534222}