{"duration": 0.03168058395385742, "input_args": {"text": "'President Donald Trump devoted Friday’s weekly White House address to praising Judge Neil Gorsuch, his nominee to fill the seat of beloved conservative Justice Antonin Scalia, and pushing for his speedy confirmation by the Senate. [“Judge Gorsuch is incredibly qualified, he has a sterling record, he was confirmed unanimously to the Court of Appeals,” the President said, making his case to the nation as a showdown over Senate cloture rules draws closer. “Judge Gorsuch’s nomination is about more than his incredible qualifications. It’s about preserving our republic,” he continued.  The Senate fight over confirming Gorsuch has reached a   over the last week, with the two parties running out of room for compromise. As the Trump Administration and Senate Republicans have signaled their willingness to confirm Gorsuch by any means necessary, increasing numbers of Democrats have insisted they will filibuster any attempt to allow an    vote on the nominee, making it ever more likely Republicans will move to change Senate rules to allow a simple majority to close debate on Supreme Court nominees. Democrats, who under current rules need only   votes to block a vote on Gorsuch, themselves used the “constitutional option” to allow simple majority confirmations for   Court nominees in 2013. Four more Senate Democrats, Sen. Tammy Duckworth ( ) Sen. Brian Schatz ( ) Sen. Catherine   ( ) and Sen. Claire McCaskill ( ) confirmed Friday they will move to filibuster and force the constitutional option. Senate Democrats are finding themselves under immense pressure to close ranks for this unprecedented filibuster of a Supreme Court nominee, first called for by Senate Minority Leader Chuck Schumer ( ) last week. Friday, CREDO, a   “” and a bevy of other progressive activist groups put their names to a letter to be delivered to the Democratic Senatorial Campaign Committee demanding any Democratic Senator who fails to join the filibuster against Gorsuch be stripped of all funding from the national Democratic Party apparatus. “Democrats who refuse to defend the Supreme Court from Donald Trump’s racist, fascist agenda should not receive support for their ” CREDO told supporters on its website. Only nine Democratic and independent Senators remain who have yet to announce their intentions on the Gorsuch Confirmation, by Breitbart New’s count. In order to confirm Gorsuch without changing traditional Senate rules, six of these would need to join the chamber’s   Republicans and Senators Joe Manchin ( ) and Heidi Heitkamp ( ) Democrats who have expressed their support for Gorsuch. Republicans have responded with more open insistence that they will do whatever it takes to confirm Gorsuch. Sen. John Cornyn ( ) in a CNN   urging his Democratic colleagues to reconsider their filibuster, was unequivocal. “Judge Gorsuch will be confirmed as the next Supreme Court justice. The question is whether Democrats will give him the    vote he deserves,” he wrote. Even Sen. John McCain ( ) who had as recently as Thursday held out hope a compromise might be reached to preserve the Senate’s traditional cloture rules, walked back from reports of a “deal” Friday. “I’ve had conversations with my colleagues on both sides of the aisle. That’s all. There’s no gang. There’s no negotiations. Just having some conversations. No deal. No negotiations,” he told the Daily Caller. Gorsuch’s confirmation vote is now set for April 7.'"}, "time": 1742628609.0378196}