{"duration": 0.33364391326904297, "input_args": {"text": "'A Cry for Help: Texas Homeschooled Children Continue to Suffer in State Custody and Public School \\nby Health Impact News/Medical Kidnap.com Staff \\nClaire and William Rembis say they are heartbroken. They say their children are heartbroken also. Their 10 children are remaining in Texas State custody, even though there are no abuse or neglect findings, and even though the children are suffering and want to come home. The children remain in public school and State custody, despite Judge Hart’s previous ruling to allow the children to be homeschooled. See previous story: Texas Judge Allows Mother to Homeschool Her Own Children – Denies Request to Vaccinate Children While in State Custody \\nJudge Hart ruled on September 20th that the Rembis children should continue to homeschool while in State custody “for purposes of consistency – to keep the children in the same school setting they were in before entering state custody – since they will continue to be homeschooled once they go home,” and added that the children would be going home “quickly,” according to Claire. \\nWhen CPS defied Judge Hart’s ruling to allow the Rembis children to continue to homeschool, the Rembis’ were certain that Judge Hart would have no option but to send the children home on October 5th, and punish the social workers who defied his ruling. See previous story: Texas CPS Defies Judge’s Order to Homeschool, Keeps Rembis Children in Public School \\nBut when they went to court on October 5th, the Rembis said it was like Judge Hart was a “completely different person” than he had been during the Adversary hearing in September, and rather than dealing with CPS’ refusal to homeschool the children, the hearing focused only on presenting a lengthy list of “services” the Rembis’ must complete before they can get their children home and out of public school and State custody. William Rembis with some of his children during a CPS supervised visit. \\nClaire and William maintain that their children should never have been taken into State custody in the first place, and that the list of “CPS services” they must now complete are a not only a waste of tax-payer money, but also a waste of time, since there never was any abuse or neglect, and CPS allegedly never even substantiated any of their allegations. \\nAlthough there were some “supervision concerns” since their 2-year old “escape artist” got into the front yard momentarily without their knowledge, the Rembis say that their daughter getting into the yard alone was an accident (and could happen to any family), and once they learned of it, locks were immediately added to the garage doors to prevent any further “escapes.” \\nThe Rembis’ are outraged that their family’s lives have been turned upside down, their children abused and traumatized in state custody, their reputation slandered in the media, and the main “eye-witness” who called CPS and started this entire ordeal is not even a credible witness, according to Claire: \\nThe caller that called CPS to begin with, ended up changing her story several times under oath & was discovered to be a meth manufacturer who sells it, is a felon with a 12-yr long criminal record that may have been on drugs when she made that CPS report that started this nightmare. Rembis Children Remain in Custody as Retaliation? \\nClaire recalled that at the close of the Adversary hearing on September 20th, Judge Hart declared that he saw “nothing to necessitate Terminating Parental Rights,” and that his only concerns were some “supervision issues that could be easily fixed.” \\nYet, even though there was no substantiated “abuse or neglect,” Judge Hart ruled that the children had to remain in custody, saying “ his hands were tied ” because the Rembis family left Lubbock in August, before bringing the children in for CPS interviews, even though there was no court order preventing the family form leaving the state, and they allegedly did nothing illegal by doing so. \\nThe Rembis’ explain that they left Texas to protect their children from the overzealous CPS worker Kris Stecklein who was harassing them at home and traumatizing the children. The Rembis’ also contend – and they have spoken with attorneys who agree – that the children were illegally extradited from Colorado back to Texas. According to the Rembis’, CPS has defied judges’ orders, broken laws, and committed perjury over and over, yet they suffer no consequences. The Rembis family, who claim their only wrongdoing was “making a mistake” and not noticing when their 2-year-old followed William Rembis outside, continue to suffer at the hands of a corrupt system. \\nAre the Rembis’ being “made an example of” because they left Texas and exposed corruption within Lubbock CPS? The Rembis family believes that Judge Hart’s ruling to keep the children in State care is retaliation because the they continue to expose the corruption of CPS and the Family Court system. \\nStudies have shown that children are worse off in foster homes than if they remained in a “troubled home,” and many argue that foster care itself is a form of “child abuse,” causing long-term emotional trauma for children. \\nIn despair for her children, Claire cries: \\nI didn’t think my body could make this many tears. Their joy is gone. Their happy faces are sad now. Oh Lord, Heavenly Father, please Lord PLEASE don’t let anything happen to them! \\nAre they living with genuinely abused kids that are acting out towards them? \\nMy husband & I are supposed to just sit back, hands tied & NOT HELP THEM? We’re to hang tight knowing that abused kids & possibly sicko adults are living amongst them in the heavily populated group home? \\nFor more information on grim foster care statistics, see: The U.S. Foster Care System: Modern Day Slavery and Child Trafficking No Consequence for CPS Defying Homeschool Ruling? \\nIt was shocking to the Rembis’ that CPS could get away with “defying” the Judges’ previous ruling about homeschooling their children. According to Claire: \\nCPS said that they tried to find a homeschool curriculum but were unsuccessful. They mentioned something about a schooling option to do at the foster homes but that each kid had to have a laptop in order to do it so it was not an option they say. They also said that they spoke to Texas Homeschooling Coalition & that they didn’t offer anything that would allow CPS to take the kids to for their schooling. They said that they couldn’t find a foster family willing to homeschool the children. \\nThey said that the kids are doing really well in school. They said that they aren’t having any behavioral issues. They said that the schools have reported that the kids, “brighten up the school”& that they enjoy having them as students. They said that the kids are enjoying school, except for Sebastian. \\nClaire was heartbroken that Judge Hart would not even let her discuss any of the options she had written down to present in court as to how to make homeschooling work, and she was even more heartbroken that her children were remaining in State custody: \\nMy heart hurts too bad. I feel like I’m slipping away. I don’t even know how to describe this. It feels like I’ve been thrown into a room with a crowd of people with dementia & Alzheimer’s. Then the room is locked from the outside so I can’t get out. Then I’m listening to these people discuss what to do to the kids, how to do it, when to do it, etc… \\nAnd then they point at me & talk about me as though I’m a strange, non-human, defected being that they must bind up & put into a strait jacket with duct tape on my mouth. All the while I can still see & they force me to watch our kids being hurt & crying out in pain, suffering & miserable. Their arms reaching out to me, them crying out to me but I can’t do anything but sit in a chair, unable to move & unable to talk. Can CPS Lie in Court without Consequence? \\nClaire says she was appalled at how CPS workers could lie in court on October 5th, without any repercussion: \\nJudge asks for case plan. He asks why we haven’t started it since CPS says we received it on 9/23. \\nI told him that we hadn’t received it & that we were told that it would be emailed to us on 9/27. CPS argued that I wasn’t told this. I told the judge that the meeting in which we were told this was recorded. \\nI also told him that the attorneys (my husbands & the standby one for me) hadn’t received it until the morning of the hearing. He didn’t have a response to this. \\nI pointed out that the CPS attorney & CPS workers lied about the case plan. I said to him, ‘I need to point out to you that these (pointed to the CPS, “team”) CPS workers just told you that we received the case plan on September 23rd.’ Then I said to him, ‘This case plan states on the front page that it was created on October 3rd.” \\nThe CPS team were visibly annoyed, one tapping her foot, the other rolling her eyes. There was silence as he looked at the papers. He didn’t acknowledge what I had just said, just moved on & started asking someone else questions. Claire Claims Judge Hart Insulted Her in Court – Asking if She Knew How to Read and Write Meme supplied by Rembis family. \\nClaire was disheartened at the treatment she received from Judge Hart on October 5th: \\nAfter we had a recess of 15 minutes to look over the case plan, I told the judge that I needed more time to look at the case plan; he told me that I needed to put my concerns in written format to submit for another hearing – A hearing simply to go over the case plan. \\nThen he asked me if I could read & write! \\nI asked him to repeat it. He said the same thing, & I said, ‘Are you serious?!’ & sorta chuckled. He said that he was because he wanted to make sure that if I needed any, ‘special accommodations’ he wanted to provide me with them. \\nIn hindsight, maybe he was being sarcastic. He is the judge that we had to file a complaint on for violating Williams’ disability rights. He laughed at Willie when he told him that he needed to get closer to the stand in order to hear the judge. Then the judge called him a liar when William explained that he was legally deaf. New Attorney Says Case Should Never Have Gotten This Far \\nClaire was reluctant to accept the court-appointed standby attorney Bill de Haas, but after talking to him, she and William are hopeful that de Haas will actually fight for them, and not just be a Family Court puppet-attorney. Claire reports that the attorney has told them that this case should have ended at the first hearing, and the children should never have been taken into custody. \\nWilliam fired his other court-appointed attorney, and he and Claire have now accepted de Haas as their legal counsel. They say that de Haas has been very helpful, explaining that it was illegal for Texas to extradite the children from Colorado, and he has been advising them about how they can get the case moved to Colorado, where William has been offered a good-paying job. Alex’s Outcry for Help \\nAt their October 17th visit, Claire’s 15-year-old son made an “outcry for help,” through a poem he wrote describing his group home, which he gave to his parents. “Dearest String,” a poem by Alex Rembis, given to Claire at a visit. Concerns Over Son Alex Escalate – Suffering in Group Home \\nThe parents are very concerned about their son Alex: \\nAlex is at the end of his rope. He is in the darkest frame of mind that we have ever seen him in. We have asked Andrew to tell us what is happening. The last time I asked him he told me that he couldn’t say – he was staring at a CPS worker when he said this. \\nWe have the impression that the kids are too afraid to say anything because all of our visitations are monitored by CPS workers. They listen to EVERYTHING we all say. About 5 visitations ago, Aurora was weeping the entire time. She kept stopping to whisper to us that she didn’t want to tell us why because the CPS workers were listening to her. Before we had to leave that day, she just curled up in a ball & screamed, while crying, “I want to go home!!!” \\nSo, their ability to report & escape abuse is very much hindered. I’m also very concerned about them being manipulated & threatened into keeping quiet about the abuse. “Meet Alex Rembis in happier times. Alex was illegally kidnapped for Texas CPS on 8/24/16. He was taken from a Christian, homeschooling family on false allegations of neglect.” – Claire Rembis \\nOn October 18th, Claire learned that Alex had a seizure at school: \\nAlex was in the hospital. He had a seizure at school this morning. The CPS worker was there but not us. They didn’t take care of him the way that his neurologist told us to if he had another seizure. Jennifer tried to say the seizure was mild and no big deal, but from what she described to me on the phone, it did not sound like a mild seizure. Tragically, the lack of adequate response by CPS/fostercare/school workers could’ve had devastating consequences on his health. \\nOn October 26th, Alex had a follow-up neurology appointment, where she says she learned that the reason for Alex’s seizure the previous week was because the “group home” failed to give him his daily medication. \\nClaire says that during the appointment, she was informing Alex of his rights to talk to the Judge or his attorney, and wrote down some information for him on a note. Claire reports that Garlett wouldn’t let Alex have the note, and when he tried to record his mother’s advice “for his record,” Garlett allegedly put her hand over the recorder and called for security. Social Worker Jennifer Garlett. Photo taken at the recent neurology appointment for Alex Rembis. Boys Depressed and Abused – Want to Come Home \\nClaire says that the children have told her that “for some reason the people at the home are being really mean to the boys and that the boys are being abused.” \\nClaire and William are very worried for their children’s safety, saying that two of the boys, who live in a group home, confided in her at the October 24th visit that they are depressed and want to come home: \\nHolding back tears, Alex shared that he’s depressed because he can’t come home. His brother (14), in the same cottage as him, confided in me that he feels the same way & that he cried himself to sleep because he couldn’t go home. \\nThis isn’t our son. Alex is a very sweet, joyful, intelligent young man who loves to make people laugh. I told Alex that everyone is praying for him. – I reminded Alex that Jesus’ price paid for healing also includes the healing of the mind. I encouraged him to pray for healing from the depression. I reminded him to seek Jesus who is w/him 24/7 & that Jesus will comfort him. \\nI told him how everyone loved his poem & that we ARE listening. Please pray for Alex & his siblings to be returned to their loving home where they belong, before Christmas. The children write and draw on a board during visits. Alex wrote on the board at the 10/24/16 visitation, “I wanna go back to my real home! – Alex” (Photo provided by family) Children Continue to Suffer in Foster Care \\nClaire continued to report to Health Impact News about how her children are suffering in state care: \\nThe kids have been so sick ever since they were taken. The CPS worker says that she is their advocate & the one looking out for their healthcare needs. However, not only is she not getting them the medical care that they need, she is LYING TO US about their health. \\nWe are POWERLESS over this. We have to sit back, hands tied, mouths shut, forced to watch them suffer but not being able to alleviate it. They need help! That is why God chose our family for them; He’s equipped us to care for them. THEY NEED US NOW. \\nAt one visit, Aurora had a severe stomach ache and was crying. At the next visit, Aurora was so sick, she couldn’t talk during the visit. Claire writes: \\nWhen the CPS worker Jennifer was answering my questions, Aurora was writing down the answers & correcting her. \\nAfter I asked her why Aurora couldn’t talk, Jennifer said that Aurora wasn’t sick. She then said that Aurora wasn’t on any medication. To that Aurora wrote the response below.[I’m taking meds to make me better] \\nWhen I questioned Jennifer about Aurora not seeing a doctor after complaining about intense abdominal pain the week before at visitation, Aurora wrote down that she had thrown up a few days prior to the visitation. \\nDuring one visit, when Claire changed her toddler’s diaper, she was distressed when she discovered a rash on her daughter’s body from her chest to her feet. Even more troubling, was the fact that the social workers allegedly tried to dissuade Claire from even changing her child’s diaper, saying they would do it later. (Many families have reported that CPS would label parents with “abuse and neglect” had the child been in the family’s care, and wonder, “why is not abuse and neglect when it happens in State care?” ) Editorial: What is R eally Going On with Texas CPS and Foster Care? \\nUnfortunately, there are still many readers who read stories like this one incredulously, thinking, “there must be more to the story,” and “CPS would not take children away from good parents without just cause.” While it’s nice to believe that CPS only rescues truly abused and severely neglected children from awful parents, sadly, this just isn’t the case. \\nOver 75% of CPS cases nationwide are “neglect cases” due to poverty, simply based on the biased opinion of the caller or social worker that some “basic necessities are being denied.” Once children are moved into foster care, the State’s CPS system can start receiving federal funds for foster care, social workers, judges, medical doctors, attorneys, psychiatrists, therapist, counselors, etc. – for all those who derive a living from this industry. Are we punishing poverty at the expense of future generations, using children as a commodity to create job security for CPS and Family Courts? \\nSee: Child Kidnapping and Trafficking: A Lucrative U.S. Business Funded by Taxpayers Called “Foster Care” \\nHave we allowed the State the dictate the standards for material possessions each member of a family must possess for “life, liberty and the pursuit of happiness”? \\nThe Rembis’ and their supporters agree that the removal of their children is not only a violation of their Civil and Constitutional Rights , but has caused unjustifiable trauma and abuse to their children and unnecessary stress and hardship to their family. \\nThis is the type of CPS’ abuse that many families across the country who contact us face every day. Until CPS is exposed for what it truly is – a federally-funded multi-billion-dollar child-trafficking and adoption business – and until families across the world demand that those they elect defund CPS, no family is safe from the tyranny which CPS agents can unleash on them should their family ever come into CPS’ sights. \\nClaire shares: \\nSo many things are uncertain right now. So much fear, so much scary & crazy stuff. We can’t understand how something so terrible can happen. We don’t understand how it can happen to so many families and continue without massive outcry. But what we DO know, is that God is a solid rock. We know that we can trust Him. We know that our time here on earth will be spent allowing Him to work through us. Our eternity will be in paradise, with our Savior, safe & tucked away for His glory. So, as always, we must obey God, rather than man. \\nThe abuses in Texas CPS and Foster Care have been exposed repeatedly, even in the mainstream media in Texas. For more information see:'"}, "time": 1742563288.005895}