{"duration": 0.03774571418762207, "input_args": {"text": "'October 29, 2016 \\nIt was the award a few wanted but only one could have. In the end, it was disappointment for Buckinghamshire, the borough of Chorley and everywhere within a five-mile radius of Motherwell as Northamptonshire won the nomination as the UK’s first Area of Outstanding General Mediocrity (AOGM). \\n‘Neither quite vile enough for it to be funny, nor possessed of anything that might induce visitors to stay longer than it takes to use a toilet, this most nondescript of counties was a natural choice,’ said Lord Melvyn Bragg, chairman of the judging panel. ‘Its highest point is a mundane 738 feet. Its county flower is the cowslip. Even when Corby ceased to be the largest town in Britain without a railway station in 2009, Irthlingborough succeeded to the title. I could go on, but, you know, life’s too short, isn’t it?’ \\nClassification as an AOGM enables a region to apply for EU grants in order to preserve itself from the commercial pressures that might otherwise make it slightly less shit. Many local luminaries had feared that Northampton Saints’ victory in last year’s Rugby Premiership, coupled with Princess Diana being buried there, might draw in the odd few hundred visitors, some of whom might even have settled and complicated the local gene pool. Now, those fears have been allayed. \\n‘Northamptonshire is synonymous with shoe-making, except fortunately the last factory closed down in the 1980s, otherwise we might have had to open a museum about it,’ said John Caswell, Mayor of Northampton. ‘Now we just make Weetabix and being the largest settlement anywhere in Britain without a unitary authority is the most interesting fact I can think of about this God-forsaken hellhole. And if you think we’re crap, try hanging out in Kettering for an evening. Fucking hell.’ \\nThe county’s seven metropolitan authorities are now thinking about meeting some time before the end of the year to discuss how to spend the £20,000 grant. Corby, a former steeltown that attracted thousands of Scottish migrants but which is now ranked Britain’s ninth worst place to live, wants to use it to bribe Alex Salmond into annexing it, while Northampton itself wants to put a blue plaque on the site of the first car chase involving the police in 1899 and Wellingborough will only turn up if the meeting doesn’t clash with Corrie. Share this story... \\nPosted: Oct 29th, 2016 by Oxbridge Click for more article by Oxbridge .. More Stories about: From The Archives 0'"}, "time": 1742628606.1451848}