{"duration": 0.05361628532409668, "input_args": {"text": "\"November 12, 2016 213 Donald Trump's election victory ends Al-Qaeda hopes of Western military intervention in Aleppo and ends Western media campaign to condemn Russian bombing there. Share on Facebook One place where Donald Trump’s election victory has had an immediate effect is in the battlefield around Aleppo. Reports from the area of the battlefield speak of a total collapse of morale amongst the Al-Qaeda led Jihadi forces which have been attacking the city from the south west, as whatever lingering hopes there were of a Western military intervention following a victory by Hillary Clinton in the US Presidential election have turned to dust. The result is that the Jihadi forces have been rapidly losing ground in the south western suburbs of Aleppo over the last three days, a fact which has apparently obliged Al-Qaeda to draw on its last reserves in order to rush reinforcements to the front to prevent a total collapse there. As always the situation is confused, but it seems the Syrian army has now entirely liberated the strategically located 1070 housing complex and the Minyan and Al-Assad districts, and that it is starting to develop an offensive towards the strategically important town of Khan Tuman, which is the base from which the Al-Qaeda led Jihadis launch their attacks on south west Aleppo. Importantly these Syrian army advances are taking place despite the continued absence of Russian bombing in the area of Aleppo. In the meantime there are reports that the Russian fleet which includes the carrier Admiral Kuznetsov and the nuclear powered missile battlecruiser Pyotr Veliky has moved closer to the Syrian coast. There have even been scattered reports that some of the Kuznetsov’s aircraft have been spotted flying over Syria on what appear to be reconnaissance missions. There are also reports that the Russian fleet is preparing to launch heavy cruise missile strikes against the Jihadis forces concentrated in south west Aleppo, and that these will happen within the next few hours. Reports that such attacks were imminent have in fact been circulating for around a week. It appears the Russian fleet has taken longer to deploy to the Syrian coast than was expected despite being present in the eastern Mediterranean for several days. Even allowing for a possible political decision by the Russian leadership to delay the attack until after the US Presidential election, it is still not clear why there has been a further delay given that the election took place several days ago. Possibly there have been technical problems, though there are no reports of any problems with Kuznetsov’s engines. Alternatively, the Russians might have felt the need to take additional security precautions after the strange incident several days ago involving the Dutch submarine . It does however seem that an attack on the Jihadis attacking Aleppo from the Russian fleet in the eastern Mediterranean is indeed now about to happen, and that this attack may now be only hours away. Regardless of when the attack happens, the key point is that following Trump’s election any idea of the West intervening directly in the fighting in Aleppo is now finally and conclusively dead. Already the West’s media campaign against the Russian bombing of the Jihadi districts of eastern Aleppo, which was dominating the news just a few weeks ago, seems like an age away, whilst the demands for Russia to be further sanctioned or prosecuted for war crimes because of its actions in Syria have been quietly dropped.\""}, "time": 1742561877.8413534}