{"duration": 0.07448482513427734, "input_args": {"text": "'On Friday’s broadcast of the Fox News Channel’s “Special Report,” House Speaker Representative Paul Ryan ( ) stated that the drafting of the Obamacare replacement is “precisely the most transparent, and normal way of doing business, which is the opposite of what the Democrats did when they crammed Obamacare through. ” He added that Senator Rand Paul’s ( ) criticism of the   process and accusations that the plan is “Obamacare light” are untrue and simply Rand “looking for a publicity stunt here. ”  Ryan was asked [relevant exchange begins around 5:10] when the rollout of the replacement would be, and whether it would be rolled out next week, Ryan answered, “Yeah, I’ll let the committees of jurisdiction make the announcement on that. But our committees that write these bills are working very, very closely with the administration, are   the legislation.   …     When they’re done with their   they’ll make that announcement and then they’ll tell us when they’re ready to go and move on the legislation. So, they’ll make that announcement pretty soon I think. ” When asked about critics who say that he’s doing what the Democrats did and jamming legislation through without transparency, Ryan responded, “Are you kidding me, Bret? Give me a break. Seriously?” He elaborated, “Last year, in early 2016, we rolled out an Obamacare repeal and replace plan. We called it A Better Way. You can go on the Internet and read it. We ran on that plan. That plan resembled Tom Price’s legislation, that so many people in Congress were   of. Then, after the election came, and we won the election, we started putting that plan into legislative text, having hearings, all these hearings on repealing and replacing Obamacare were in the Congressional committees. So, we’ve been doing hearings all year long. Now, we’re translating the findings of those hearings, that plan into legislative text. That’s the    …    that’s occurring. And then guess what? This bill’s not being written in my office like it was in Harry Reid’s office on Christmas Eve in 2009. This bill is written  —   being written by the committees that are in charge of healthcare, which is the regular order process. This bill will go through the committee process, go through the Budget Committee, then go to the floor of Congress, under what we call regular order. That is precisely the most transparent, and normal way of doing business, which is the opposite of what the Democrats did when they crammed Obamacare through. ” After being played Rand Paul’s criticism of the   process and his accusation that he thinks there’s “a lot of Obamacare light” in the replacement, Ryan countered that Rand’s accusations weren’t true. He added, “I like Rand, but I think he’s looking for a publicity stunt here. What’s happening is, the committees of jurisdiction are drafting legislation and getting feedback from their members. That’s exactly how legislation is supposed to be written. The things he described are just not accurate, and like I said, when the committees write their bills and put their bills out there to mark up, everybody will see what they’ve done. ” Ryan further described “in general” what the replacement would look like. He said, “We’re talking about giving the states control of the Medicaid program, which is something that conservatives have been fighting for for years.   …     And then on the tax fraud, we’ve long been saying that we need equalize the tax treatment of healthcare for everybody in America. Right now, the tax code discriminates against people who do not get healthcare from their jobs. There’s a huge tax benefit if you get taxpayer  —   if you get healthcare at work. If you’ve got to go buy your health insurance, there’s no tax benefit for you. So, what conservatives have long said is, let’s equalize the tax treatment for healthcare, so that if you  —   it doesn’t matter whether you get it  —   healthcare at work, or not at work, let’s give you the same kind of tax benefit. So, that you can go buy what you want to buy. You go into a free market as a consumer, and buy the plan of your choosing, with health savings accounts as well. This is what we have long stood on as conservatives. It is the plan that we ran on in all of 2016, that we said, if we get the chance of having a Republican president, a Republican House, and a Republican Senate, we’re going to repeal and replace Obamacare and this is what we’re going to replace it with. Well, guess what? We are keeping that promise, and that is exactly what we are doing here. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742562342.4541852}