{"duration": 0.06163382530212402, "input_args": {"text": "'NYT credibility DESTROYED by 7 simple questions from Newt Gingrich share in: Editorials , Journalism , Trump \\nThe New York Times publisher and executive editor have promised to rededicate the paper to its fundamental mission — to report America and the world honestly, without favors and fear. The paper claims they will strive to understand and reflect all political perspectives and life experiences in stories brought to the public. This announcement is almost considered an apology to its readers for providing a year and a half of unbalanced and unhinged coverage of the presidential race. \\nSean Hannity suggests that Trump must ignore the media and trust his gut instincts. He was sad to see the 165-year-old paper destroy their credibility over the election season. It was obvious to dedicated readers that the Times had abandoned its old coverage standards. Stories were unrelentingly hostile towards Trump and his supporters. Reporters were including their personal opinions and political analysis in the news coverage. This allowed animosity toward Trump to be spread all over social media by political reporters. Front page stories on The New York Times were accusing Trump of lying, but the paper never published the same findings in reference to Hillary Clinton . The paper’s liberal readership has even gotten tired of reporting that resembles state controlled propaganda of totalitarian regimes. Newt Gingrich destroys the New York Times credibility with seven simple questions. \\nThe New York Times has struggled mightily to answer some serious questions posed by the former United States House of Representatives speaker. Gingrich, a Republican, has asked the times whether they have any reporters, editors or columnists that will say they voted for Trump. He elaborated to ask if they have since hired any Trump supporters to work those positions for the Times. The paper struggled to say whether or not it has hired any Republican reporters at all. \\nGingrich has also asked if the New York Times has changed its policies allowing journalists to express their opinions about events and people they are covering. The fourth question asked by Gingrich wondered if the Times reporters would surrender any Pulitzer Prizes awarded for news stories containing personal opinions. Here are the final questions that the Times struggled to address. “Have its editors retracted misleading news headlines that expressed opinions — such as the paper’s coverage of Trump’s tax returns?” “Has it fired reporters who admitted to writing politically motivated ‘news’ stories and encouraged interview subjects to talk to them so they could stop Trump?” “Has it retracted its shameful election-eve front-page story ‘reporting’ on Trump’s innermost thoughts and feelings, virtually every sentence of which is filled with reporters’ opinions and speculations–featuring claims like ‘he is struggling to suppress his bottomless need for attention” \\nSources: '"}, "time": 1742563809.5210607}