{"duration": 1.748180627822876, "input_args": {"text": "'Your head feels like it’s inside a bass drum, your mouth is cottony and the contents of your stomach might not stay put. Maybe you partied hard and had a little too much to drink  —   or maybe a lot too much  —   so you turn to the internet to search for cures to a hangover. To spare you the bleary   research, here’s what you should know before you drink. If you have to ask, count yourself lucky not to have experienced one. Not surprisingly, the more alcohol you consume, the better your chances of getting a hangover. Binge drinking of four or more drinks for women and five or more drinks for men during any one episode increases the likelihood of a hangover, Laura J. Veach, an associate professor of general surgery at Wake Forest Baptist Medical Center in   N. C. said in an email. Dr. Veach said a hangover occurs when the concentration of alcohol in one’s system is decreasing. It is at its worst when all the alcohol has been eliminated. “Addiction specialists have often noted that a hangover is technically a form of alcohol withdrawal at its most benign,” she said. The scientific community does not completely understand what causes hangovers, Dr. Preston R. Miller, a surgeon at Wake Forest, said in an email. Alcohol is a diuretic that causes dehydration and irritation of the gastrointestinal tract, leading to nausea and dilation of blood vessels, which can cause the headaches associated with hangovers. Unless you are going to abstain or drink in moderation, the answer is no, experts said. Some commercial products promote themselves as surefire remedies but Dr. Robert Glatter, an emergency physician at Lenox Hill Hospital in Manhattan, said in an interview: “The bottom line: When you get the hangover, there is nothing clinically proven to make it go away. There is no magic pill. ” A detailed survey of medical literature and research in 2005 concluded, “No compelling evidence exists to suggest that any conventional or complementary intervention is effective for preventing or treating alcohol hangover. ” Among the commercial products promoted as cures: IV drips with a blend of saline solution and electrolyte replacement fluid, patches that are said to replenish the vitamins and acids lost when consuming alcohol, and a “natural dietary supplement,” only one dose of which is required to “prevent” a hangover, its manufacturer says. Dr. Miller said most cures treat the symptoms, such as a headache or dehydration, “but the only way to truly get over a hangover is time. ” Dr. Marc I. Leavey, a primary care physician in Lutherville, Md. who writes a blog, “String of Medical Pearls,” said in an email that the products were “gimmicks” that either relied on a placebo effect or were no more effective than slowly sipping ice chips or an electrolyte sports drink. “Alcohol consumption is a   market,” he wrote. “It would seem logical that attempts to cash in on the inevitable aftermath would spawn any number of products claiming to help, despite the lack of any foundation for those claims. ” Dr. Glatter recommended staying away from   liquors such as bourbon and whiskey. They contain more congeners, complex organic molecules that give the liquors their color and taste but also generate more intense hangovers. Better to drink clearer liquors, such as vodka and gin, which have fewer congeners, he said. Once the damage is done, Dr. Reed Caldwell, an assistant professor of emergency medicine at the Ronald O. Perelman Department of Emergency Medicine at NYU Langone Medical Center, recommended hydrating with water, electrolyte drinks or coconut water, getting proper nutrition and exercise and taking a cool shower. He added that caffeine may help relieve symptoms from poor sleep but it will not reverse the effects of alcohol or a hangover. Before you start drinking, eat some food (it slows the absorption of alcohol) and have something nonalcoholic between drinks. Before bed, take a nonsteroidal pain reliever and drink water, Dr. Glatter said. Hangover cures remain a hotbed of research, he said, adding: “I think we’re going to get there. We’re not there yet. ”'"}, "time": 1742564254.4801793}