{"duration": 0.13101530075073242, "input_args": {"text": "'Site Map \\nSelect Page Ammon Bundy’s lawyer tackled, Tasered by U.S. Marshals in a surreal ending to the Oregon standoff trial [w/ VIDEO] \\nBy Maxine Bernstein \\nMoments after the Oregon standoff defendants’ acquittals were announced in court Thursday, Ammon Bundy’s lawyer Marcus Mumford stood before the judge, and argued that his client should be released from custody immediately and allowed to walk out of the courtroom a free man. \\nAmmon Bundy, who chose to wear blue jails scrubs throughout the trial, was dressed in a gray suit Thursday. \\nU.S. District Judge Anna J. Brown told him that there was a U.S. Marshal’s hold on him from a pending federal indictment in Nevada. \\n“No, he’s released on these charges. He’s acquitted. Nevada doesn’t have jurisdiction,” Mumford yelled, standing before the judge. “If there’s a detainer, show me.” \\n“Mr. Mumford, you really need to never yell at me now or never again,” the judge responded. \\nBrown told Mumford that she’s releasing Bundy on all federal holds in the Oregon case, but he’ll have to take up any questions about the federal holds from the Nevada case with the U.S. Marshals Service. \\n“If they want him, they know where to find him,” Mumford told the judge. “I don’t see any paper proving their authority to hold him.” \\nSuddenly, a group of about six to seven U.S. Marshals, who had been either standing or seated around the perimeter of the courtroom, slowly moved in and surrounded Mumford at his defense table. The judge directed them to move back but moments later, the marshals grabbed onto him. \\n“What are you doing?” Mumford yelled, as he struggled and was taken down to the floor. \\nAs deputy marshals yelled, “Stop resisting,” the judge demanded, “Everybody out of the courtroom now!” \\nMumford was taken into custody by the Federal Protective Services. \\nHe was cited for failure to comply with a federal lawful order and disturbance and released with a Jan. 6 date to return to federal court, said Eric Wahlstrom, supervising deputy of the U.S. Marshals Service. \\nAccording to Wahlstrom, Mumford was shocked with a stun gun in what’s called a dry-stun mode, meaning no probes were fired into his body but a Taser was placed up against his body. \\nWahlstrom, who was not in the courtroom, said the actions were taken because Mumford was resisting and preventing marshals from taking Ammon Bundy out of the courtroom and back into custody. \\nWahlstrom said the stun gun was used because deputy U.S. marshals “attempted to handcuff him and he continued to resist.” \\nBut observers who were close to the arrest decried the use of force against a lawyer in court. \\n“What happened at the end is symbolic of the improper use of force by the federal government,” Mumford’s co-counsel J. Morgan Philpot said. Philpot explained that Mumford was attempting to point out that since the judge previously had said in court that she had no authority over detention orders made by the court in Nevada, she couldn’t now maintain the right to order his client held. \\n“I grew up on a dairy farm, so am I used to some rough treatment, sure?” Mumford told reporters, after his release. But he said the actions of the U.S. marshals were uncalled for. \\n“All I was asking for was papers. Just show me you have the authority to take Mr. Bundy into custody,” Mumford said. \\nDefense lawyer Per C. Olson, who represented co-defendant David Fry, called the physical confrontation “a complete overreaction. Utterly disgusting.” \\nOlson said Mumford was getting animated, but he did nothing physical. He didn’t charge the bench, or block marshals from his client. “He raised his arm as if to say, what the hell…And they grabbed him, Tased him and took him down. It was just shocking. It was completely inappropriate,”Olson said. \\nDefense lawyer Matthew Schindler, standby counsel for defendant Kenneth Medenbach, said he was disappointed by Mumford’s challenge to his client’s return to custody, considering he faces more serious federal charges in Nevada. \\nSchindler said Mumford was exhausted, having “put out everything he had,” during the past six weeks of the case. \\n“Unfortunately he let his passion and desire and belief in his client overcome his good judgement,” Schindler said. \\nMargaret “Margie” Paris, a University of Oregon law professor and former dean, said she couldn’t believe what occurred when she learned of the confrontation. \\n“It just blows my mind,” Paris said. “To have a lawyer who’s making an argument in court physically restrained and taken down is extraordinary. He’s entitled to make these arguments. If he was repeating himself over and over, the more typical response is to hold him in contempt. But to physically accost him is just shocking.” \\nOregonian Staff Writer Jeff Manning contributed to this story. \\n— Maxine Bernstein Share: Rate:'"}, "time": 1742563987.738201}