{"duration": 0.06339216232299805, "input_args": {"text": "'Nouvelles sanctions européennes contre la République arabe syrienne Réseau Voltaire | Bruxelles (Belgique) | 28 octobre 2016 Décision d’exécution (PESC) 2016/1897\\ndu Conseil du 27 octobre 2016\\nmettant en œuvre la décision 2013/255/PESC concernant des mesures restrictives à l’encontre de la Syrie L’Union européenne a ajouté 10 personnes à la liste des « personnes et entités faisant l’objet de sanctions à l’encontre du régime syrien » (sic), c’est-à-dire de la République arabe syrienne.\\nCette décision porte à 217 personnes et 69 entités les objets de sanctions.\\nNuméro Nom Informations d’identification Motifs Date d’inscription 207 Adib Salameh (alias Adib Salamah ; Adib Salama ; Adib Salame ; Mohammed Adib Salameh ; Adib Nimr Fonction : général de division, directeur adjoint de la direction du renseignement de l’armée de l’air à Damas Membre des services de sécurité et de renseignement syriens en poste après mai 2011 ; directeur adjoint de la direction du renseignement de l’armée de l’air à Damas ; ancien chef du Service de renseignement de l’armée de l’air à Alep.\\nMembre des forces armées syriennes ayant le rang de colonel ou équivalent ou un grade supérieur, en poste après mai 2011 ; a rang de général de division.\\nResponsable de la répression violente exercée contre la population civile en Syrie, en ce sens qu’il a planifié des attaques militaires à Alep et y a participé, et qu’il a autorité pour faire arrêter et emprisonner des civils. 28.10.2016 208 Adnan Aboud Hilweh (alias Adnan Aboud Helweh ; Adnan Aboud) Fonction : général de brigade A rang de général de brigade des 155e et 157e brigades de l’armée syrienne, en poste après mai 2011.\\nEn sa qualité de général de brigade des 155e et 157e brigades, il est responsable de la répression violente exercée contre la population civile en Syrie, notamment en raison de sa responsabilité dans le déploiement et l’utilisation de missiles et d’armes chimiques dans des zones civiles en 2013 et de sa participation aux vagues d’emprisonnement à grande échelle. 28.10.2016 209 Jawdat Salbi Mawas (alias Jawdat Salibi Mawwas ; Jawdat Salibi Mawwaz) Fonction : général de division A rang de général de division, officier supérieur à la direction de l’artillerie et des missiles de l’armée syrienne, en poste après mai 2011.\\nEn sa qualité d’officier supérieur à la direction de l’artillerie et des missiles, il est responsable de la répression violente exercée contre la population civile en Syrie, y compris l’utilisation de missiles et d’armes chimiques par les brigades placées sous son commandement dans des zones civiles densément peuplées, en 2013, à la Ghouta. 28.10.2016 210 Tahir Hamid Khalil (alias Tahir Hamid Khali ; Khalil Tahir Hamid) Fonction : général de division A rang de général de division, chef de la direction de l’artillerie et des missiles de l’armée syrienne, en poste après mai 2011. En sa qualité d’officier supérieur à la direction de l’artillerie et des missiles, il est responsable de la répression violente exercée contre la population civile en Syrie, y compris le déploiement de missiles et d’armes chimiques par les brigades placées sous son commandement dans des zones civiles densément peuplées, en 2013, à la Ghouta. 28.10.2016 211 Hilal Hilal (alias Hilal al-Hilal) Date de naissance : 1966 Membre d’une milice affiliée au régime connue sous le nom de “Kataeb al-Baath” (milice du parti Baas). Soutient le régime par le rôle qu’il joue dans le recrutement et l’organisation de la milice du parti Baas. 28.10.2016 212. Ammar Al-Sharif (alias Amar Al-Sharif ; Amar Al-Charif ; Ammar Sharif ; Ammar Charif ; Ammar al Shareef ; Ammar Sherif ; Ammar Medhat Sherif) Homme d’affaires syrien influent exerçant ses activités en Syrie, actif dans les secteurs des banques, des assurances et des soins hospitaliers. Partenaire fondateur de Byblos Bank Syria, principal actionnaire de Unlimited Hospitality Ltd, et membre du conseil d’administration de Solidarity Alliance Insurance Company et de Al-Aqueelah Takaful Insurance Company. 28.10.2016 213 Bishr al-Sabban (alias Mohammed Bishr Al-Sabban ; Bishr Mazin Al-Sabban) Gouverneur de Damas, nommé par Bashar Al-Assad et lié à celui-ci. Soutient le régime et est responsable de la répression violente exercée contre la population civile en Syrie, notamment sous la forme de pratiques discriminatoires à l’encontre des communautés sunnites dans la capitale. 28.10.2016 214 Ahmad Sheik Abdul-Qader (alias Ahmad Sheikh Abdul Qadir ; Ahmad al-Sheik Abdulquader) Gouverneur de Quneitra, lié à Bashar Al-Assad et nommé par celui-ci. Ancien gouverneur de Latakia. Soutient le régime et en tire avantage, notamment en soutenant publiquement les forces armées syriennes et les milices favorables au régime. 28.10.2016 215 Dr. Ghassan Omar Khalaf Gouverneur de Hama, qui a été nommé par Bashar Al-Assad et est lié à celui-ci. Par ailleurs, il soutient le régime et en tire avantage. Ghassan Omar Khalaf est étroitement lié aux membres d’une milice affiliée au régime présente à Hama et connue sous le nom de brigade de Hama. 28.10.2016 216 Khayr al-Din al-Sayyed (alias Khayr al-Din Abdul-Sattar al-Sayyed ; Mohamed Khair al-Sayyed ; Kheredden al-Sayyed ; Khairuddin as-Sayyed ; Khaireddin al-Sayyed ; Kheir Eddin al-Sayyed ; Kheir Eddib Asayed) Gouverneur d’Idlib, lié à Bashar Al-Assad et nommé par celui-ci. Tire avantage du régime et le soutient, notamment en soutenant les forces armées syriennes et les milices favorables au régime. Lié au ministre des Awqaf, Dr. Mohammad Abdul-Sattar al-Sayyed, qui est son frère. 28.10.2016'"}, "time": 1742628577.782417}