{"duration": 0.11863255500793457, "input_args": {"text": "'Days after several of his colleagues were awakened in their hotel rooms by the police and arrested on corruption charges last year, Sepp Blatter, the longtime president of FIFA, made an important decision. He decided he deserved a raise. With soccer in crisis and an unprecedented scandal beginning to boil, Mr. Blatter  —   who had just won   to a record fifth   term  —   signed a new employment contract that increased his salary to $3 million a year and guaranteed him a $12 million bonus if he completed his mandate. That arrangement, completed just as FIFA was plunging into organizational chaos, was one of many instances in which three of FIFA’s top officials arranged over five years to pay themselves more than $80 million, according to an internal investigation of world soccer’s governing body by the American law firm Quinn Emanuel. It was the latest in a series of   accusations about a culture of corruption pervading FIFA. For years, top soccer officials have been accused of using bribes and payoffs to profit from their roles overseeing the billions of dollars FIFA and other governing bodies generate through tournaments like the World Cup. But in the past year, dozens of soccer officials  —   though not the three accused Friday  —   have been charged with fraud, racketeering and money laundering in a broad corruption investigation led by the United States Justice Department. On Friday, lawyers from Quinn Emanuel, which was hired by FIFA in the wake of last year’s arrests, published a synopsis of some of the findings of their own investigation. In it, they identified three former FIFA officials  —   Mr. Blatter and his former deputies Jérôme Valcke and Markus Kattner  —   as having mounted a “coordinated effort” to enrich themselves through a series of raises, bonuses and other payments. The three were also accused of modifying the termination clauses in their employment contracts to ensure that they would receive   payouts even if they were fired for cause. “They had the authority they needed,” Quinn Emanuel investigators wrote of Mr. Blatter, Mr. Valcke and Mr. Kattner, “and they simply told payroll and HR, the department generally in charge for employment contracts at FIFA and which reported to Mr. Kattner, how much should be paid out and to whom. ” In a statement responding to the accusations, Mr. Blatter’s lawyer, Richard Cullen, said Friday, “We look forward to showing FIFA that Mr. Blatter’s compensation payments were proper, fair and in line with the heads of major professional sports leagues around the world. ” Mr. Valcke and Mr. Kattner did not immediately respond to FIFA’s statement. None of the three men currently work for FIFA. Mr. Blatter was barred from soccer by FIFA in December and replaced by a new president, Gianni Infantino, in an election in February. FIFA suspended Mr. Valcke, Mr. Blatter’s longtime deputy, last fall and fired him in January amid accusations of corruption. Mr. Valcke was replaced temporarily as secretary general by FIFA’s finance director, Mr. Kattner. That effectively placed Mr. Kattner in control of FIFA’s finances in the months leading to this year’s presidential election, but he, too, was fired, in May, after FIFA said it had discovered he had breached his fiduciary duty to the organization. The accusations by FIFA and its lawyers seemed intended to paint a picture of a leadership group operating outside FIFA financial controls: ■ In 2010, Mr. Blatter, Mr. Valcke and Mr. Kattner were awarded $23 million in retroactive bonuses for the 2010 World Cup in South Africa that FIFA said were not called for under their employment agreements. ■ In 2011, with Mr. Blatter in a contested election for the FIFA presidency, Mr. Valcke and Mr. Kattner were given   contract extensions that included guarantees that they would receive full payment of their salaries if they lost their jobs, a likely outcome under a new president. ■ That same year, Mr. Blatter received a bonus of 12 million Swiss francs (about $12 million) for overseeing the 2014 World Cup. ■ In May 2015, only days after the arrests of several of their colleagues in Zurich, Mr. Blatter, who signed a contract in 2008 that paid him 2 million Swiss francs (about $2 million) a year, executed a new contract that increased his salary to about $3 million and included the prospect of another performance bonus of $12 million if he completed his term. A day after that, Mr. Kattner’s contract was extended four years  —   through December 2023  —   and modified to include a clause that he be paid in full even if he was fired. In its statement, FIFA dryly labeled the timing of that contract extension “noteworthy. ” The details of Quinn Emanuel’s investigation deflected attention  —   at least momentarily  —   away from two other FIFA stories this week: the news that the Swiss attorney general’s office had conducted a new raid on FIFA headquarters in Zurich on Friday as part of a continuing investigation into possible corruption, and recent issues regarding transparency that have plagued Mr. Infantino. Earlier this week, a German newspaper reported that Mr. Infantino had worked behind the scenes to marginalize FIFA’s independent auditor in a leadership power struggle. That situation came to light when the auditor, Domenico Scala, abruptly resigned at FIFA’s recent Congress in Mexico, saying that Mr. Infantino and others had orchestrated a change in FIFA’s bylaws that shifted the power to hire and fire the independent ethics officials with FIFA’s new governing council  —   a body led by Mr. Infantino. FIFA has defended Mr. Infantino by saying the shift was done to protect the organization against the possibility it might be unable to separate itself from individuals who come under investigation, but the assertion seemed to run counter to Mr. Infantino’s professed support for reform and his stated goal of greater separation of powers at FIFA. Then this week came the German report, which said that Mr. Infantino had instructed FIFA staff members to delete recordings of an executive session in which removing Mr. Scala had been discussed. Mr. Scala, as part of his role leading the audit and compliance committee, also was responsible for setting Mr. Infantino’s salary  —   a process that reportedly had gone poorly, with Mr. Infantino describing Mr. Scala’s initial proposal of a $2 million salary as “insulting. ” All of this comes as FIFA tries to emerge from the worst corruption scandal in its history, a period which began just over a year ago when more than a dozen soccer and sports marketing officials with ties to soccer’s global governing body were arrested in predawn raids before a FIFA meeting in Zurich. Several have pleaded guilty to corruption charges in the United States, including more FIFA executives arrested in a second Zurich raid in December. Many of those executives held top posts in the FIFA led by Mr. Blatter, Mr. Valcke and Mr. Kattner, so it was not surprising that more detailed allegations against the three men might emerge. In its news release on Friday, FIFA and its lawyers accused Mr. Blatter, Mr. Valcke and Mr. Kattner of working together to bulk up their compensation in agreements as far back as 2007. The evidence, the lawyers said, revealed breaches of fiduciary duty and also raised questions about FIFA’s internal financial controls, especially the role of its compensation subcommittee. It was unclear whether all the salary and bonuses were paid and if FIFA would seek to recover any of it. FIFA said that all of the contracts would face further investigation, and that it had shared its findings with the Swiss attorney general’s office and would do the same with the Justice Department.'"}, "time": 1742563575.5582871}