{"duration": 0.12244033813476562, "input_args": {"text": "'WASHINGTON  —     Donald J. Trump said on Wednesday that Mitt Romney, the 2012 Republican presidential nominee, was still in the running to become his secretary of state despite their bitter differences during the campaign, as he narrowed his choices and planned an announcement next week for the crucial post. “We had some tremendous difficulty together, and now I think we’ve come a long way,” Mr. Trump said of Mr. Romney in a telephone interview on NBC’s “Today” show, where it was announced that Time magazine had named the   its “Person of the Year. ” Mr. Trump said the   selection process and highly publicized flirtation with Mr. Romney was not intended to torment a campaign nemesis but rather to find the right person to serve as the nation’s chief diplomat. “It’s not about revenge, it’s about what’s good for the country, and I’m able to put this stuff behind us,” Mr. Trump said. Nearly a month after his stunning election upset ended a bitterly divisive presidential race, Mr. Trump flatly refused any responsibility for the rifts, saying, “I’m not president yet, so I didn’t do anything to divide. ” But in the interview with Time, Mr. Trump repeated some of the harsh talk that marked his unorthodox campaign, and he declined to criticize or contradict President Rodrigo Duterte of the Philippines, who has called President Obama a “son of a whore” and has been accused of waging a campaign of extrajudicial killings of thousands of people suspected of being drug dealers. Told that his promises to crack down on undocumented immigrants who kill and rape Americans echo Mr. Duterte’s talk about annihilating drug dealers and users, Mr. Trump did not dispute the comparison. “Well, hey, look, this is bad stuff,” he told Time. “They slice them up, they carve their initials in the girl’s forehead, O. K.? What are we supposed to do? Be nice about it?” He also rejected the conclusion of United States intelligence officials who had said Russia was behind the hacking of the Democratic National Committee and Clinton campaign emails released on WikiLeaks, saying he thought that conclusion was driven by politics. “I don’t believe it. I don’t believe they interfered,” Trump said of the Russians. The interview came as Mr. Trump continued to fill out the ranks of his administration with loyalists who will play pivotal roles. He told donors at a private   at the restaurant Cipriani in Manhattan that Terry E. Branstad, the governor of Iowa and an early supporter of his campaign, would be the United States ambassador to China, a crucial post managing a complex relationship that Mr. Trump has indicated he is willing to shake up even further. Mr. Trump also said he would have more “big announcements” on personnel on Wednesday and Thursday. Another contender for secretary of state, he said on “Today,” is Rex W. Tillerson, the president and chief executive of Exxon Mobil, whom he called a “great, great gentleman” who has “built a tremendous company over a period of years with great style. ” He said he had ruled out “in my own mind” other prominent candidates who have been considered for the post  —   a group that includes Rudolph W. Giuliani, the former mayor of New York Gen. David H. Petraeus, the former C. I. A. director Senator Bob Corker of Tennessee and John R. Bolton, a former ambassador to the United Nations  —   but he declined to say which ones. One day after picking a fight on Twitter with Boeing over the cost of developing the next generation of Air Force One, Mr. Trump said he had spoken to officials at the company and would insist on a   aircraft or cancel the contract. “We’re going to work it out, but you know that’s what I’m here for,” Mr. Trump said. “I’m going to negotiate prices, and the planes are too expensive, and we’re going to get the prices down, and if we don’t get the prices down, we’re not going to order them. ” He also explained his apparent decision in June, divulged by a member of his transition team on Tuesday, to sell all of his stock holdings, a move he said he made to avoid “tremendous” potential conflicts of interest in the event he won the election. “I don’t think its appropriate for me to be owning stocks when I’m making deals for this country that maybe will affect one company positively and one company negatively,” Mr. Trump said. Time magazine’s article branded him the president of the “divided states of America,” a characterization Mr. Trump denounced as “snarky. ” “When you say divided states of America, I didn’t divide them,” Mr. Trump told NBC. “They’re divided now, there’s a lot of division, and we’re going to put it back together, and we’re going to have a country that’s very well healed. ” In the interview with Time, he suggested he was willing to moderate some of his   campaign stances and adjust others to appeal to a broader portion of Americans. Mr. Trump, whose campaign was fueled largely by promises to build a wall on the country’s southern border and deport those who came in illegally, said he would like to find an accommodation for the undocumented young people  —   often referred to as Dreamers  —   who were brought to the United States as children. After Mr. Obama took executive action to create a program granting them legal status, many of those who came forward to register now worry that they could be easily found and deported. “We’re going to work something out that’s going to make people happy and proud,” Mr. Trump told Time. “They got brought here at a very young age, they’ve worked here, they’ve gone to school here. Some were good students. Some have wonderful jobs. And they’re in   land because they don’t know what’s going to happen. ” On economic policy, Mr. Trump suggested that a major new infrastructure and tax package could serve as stimulus  —   “You have to prime the pump” to create jobs and accelerate growth, he told Time  —   just as Mr. Obama’s $787 billion economic recovery package was intended to do when he took office in 2009. Mr. Trump told NBC that he had developed a tight rapport with Mr. Obama, with whom he has had a “very good dialogue” about policy ideas and personnel choices. “I take his recommendations very seriously,” Mr. Trump said of Mr. Obama.'"}, "time": 1742561983.3545926}