{"duration": 0.051346778869628906, "input_args": {"text": "'Lithuanian Prime Minister Saulius Skvernelis has taken a leaf out of   Donald J. Trump’s book, announcing a   euro border fence to “ensure credible control of [the] eastern border of the European Union”. [EurActiv reports that the €30 million project will be funded largely from the European Union (EU) budget, to which the UK contributes a net £200 million every week.  Skvernelis claims the fence, which will be erected against the Russian exclave of Kaliningrad, will “first of all, ensure our economic security” while “also solving issues when it comes to illegal migration”. Far from being disappointed by the project, Russian state media reports Kaliningrad’s governor as being eager to secure contracts for the building materials which the   project will require. The Baltic republic is not a popular destination for migrants, with asylum seekers resettled there from camps in Greece and Turkey complaining that state benefits are not so generous as in Germany or Sweden and attempting to escape to wealthier EU members. Lithuanian President Dalia Grybauskaitė has predicted an increase in the number of migrants taking alternative routes into western Europe now that the EU signed a controversial six billion euro deal to stem the flow from Turkey. The Turkey deal has been a partial success in terms of reducing overall numbers, but the transfer arrangements it included have seen more than three times as many migrants forwarded to the EU as have been returned to Turkey, and the Turkish president looks set to terminate it if his own EU membership bid is not accelerated. “One should not be afraid to say that Europe has to be closed, at least temporarily, especially for economic migrants,” Grybauskaitė told broadcaster LRT. “The protection of the EU’s external borders should be the European solution. ” Lithuania’s announcement on the fence comes as the United States’s incoming president denounced the migrant crisis as a “catastrophic mistake” on the part of German Chancellor Angela Merkel, congratulating the British public on their decision to leave an EU which he sums up as “basically a vehicle for Germany”. Prior to Trump’s election victory, Merkel’s foreign minister commented that “building walls is a very bad idea  —   no matter who pays for them”.'"}, "time": 1742561771.9374495}