{"duration": 0.24484920501708984, "input_args": {"text": "\"Home / Badge Abuse / Community Outraged After Video Shows a Cop Throwing Down a 16yo Girl Community Outraged After Video Shows a Cop Throwing Down a 16yo Girl Matt Agorist September 8, 2016 32 Comments \\nAsheville, NC — A video posted to Facebook this week has the internet in an uproar as it shows an Asheville police officer allegedly assaulting a 16-year-old girl. \\nThe video shows a short interaction between 16-year-old Kacee Fleming and officer Shalin Oza. According to Cherrell Mooney, the woman who took the video, Fleming approached police as they were arresting her brother, Dominic Fore. According to APD, they had a warrant for Fore’s arrest. \\n“She was asking them, ‘Why are y’all arresting my brother?'” Mooney said. “The officer was being rude, they didn’t want to talk to them.” \\nThe video apparently shows the aftermath of this questioning as the officer grabs Fleming and throws her to the ground. \\nAccording to police, Fleming yelled at officers and allegedly reached into her brother’s pockets to retrieve his personal items as he was being arrested. Fleming’s actions then caused officers to have to “deal with” her. The video is the result of Fleming apparently being dealt with. \\nAccording to police, Fleming was arrested and charged as an adult for resisting, obstructing or delaying an officer. Sgt. Noland Brown, who was on the scene, also told News 13 that she is charged with misdemeanor assault on a government official. \\n“I have no trust in the police anymore,” said Crystal Fleming , Kasee’s mother. According to News 13, she says her daughter was trying to communicate with police before the incident, to tell them that Fore had just gotten “out of (the) ICU.” \\n“She is not trying to be disrespectful,” said Crystal Fleming. “But y’all are not listening. They were not listening.” \\n“You wonder why people are running around here saying ‘Black lives matter,'” she continues. “That’s why. Because they really don’t think our lives matter, because he could have pulled her to the side, talked to her. He didn’t even do none of that.” \\nAccording to police, they were there for another incident, but when they saw Fore, they decided to arrest him too. \\nThe Asheville Police Department released the following statement: \\nThe Asheville Police Department has viewed the video circulating on social media regarding the arrest of a 16-year-old female on the evening of September 5, 2016. \\nThe nine second video is only a small portion of a much longer incident. \\nThe Asheville Police Department is in the process of conducting a full administrative investigation that will review all evidence, including the video circulating on social media and body worn camera footage, in our review. \\nThe Asheville Police Department is dedicated to providing the best possible police service and upon completion of the review will take appropriate action, if deemed necessary. \\nAnyone with additional video footage or information regarding this incident is encouraged to contact our Professional Standards Office at (828) 259-5907. \\nAccording to News 13, when they requested the body cam video from the scene that night, they were denied. Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Follow @MattAgorist on Twitter and now on Steemit Share Google + Keysbum \\nooooh…. the adrenaline rush that brave heroic cop must have enjoyed after overpowering that dangerous villainous little girl. he can proudly puff his chest out after that one! Nishi \\nThe disturbing thing is that they actually do that. They feel good about doing this kind of thing. They are convinced that what they are doing is morally just and necessary. Reminds me of Hobbes:“To this war of every man against every man this also is consequent, that nothing can be unjust. The notions of right and wrong, justice and injustice, have there no place. Where there is no common power, there is no law; where no law, no injustice. Force and fraud are in war the two cardinal virtues.” Jonathan Sabo \\nThis is NOT about black ! It is about getting involved in a legal arrest ! Razedbywolvs \\nNo it’s about black, because if it wasn’t white people might get pissed enough to do something about it. That would not work out to well for the officers involved in “legal” arrests. James Michael \\nShe had every right to require he state why he was being arrested ……and the officer had no lawful arrest……. she also had every right to free the man from being kidnapped by a traitor you retard….. \\nNOW why was HE being arrested…. bruismenot \\nWhat a lovely mouth that mother has! No wonder the kid has no respect for the law. Also, it looks like the kid was resisting including standing/stepping/stomping on the cop’s left foot. Oh, well… gininitaly \\nI looked at that video 4 times and never saw her ‘stomp’ on his precious foot… she was 16 and hardly 100lbs soaking wet, you’re telling me that a big adult male couldn’t contain her ‘threat’ without shoving her to the ground? bruismenot \\nUnfortunately, Cops aren’t psychic and they have to react quickly to protect themselves. The girl was obviously highly emotional when she approached the situation. One of the most dangerous times to interfere with police activity is during the arrest of a family member. \\nIt’s easy to sit back and criticize the cop, but he doesn’t know her intent, nor if in the dim light, she’s carrying a weapon of some sort. You can’t just go stomping up on an arrest situation, ignoring orders to stay back. \\nHave you ever fought an emotionally charged 16 year old girl? They fight like wild cats! Just watch a video on you tube some time if you haven’t. Age doesn’t always matter and 16 year olds are adult sized. \\nCops don’t put on the uniform to get hurt. Teach your children to respect the law, show respect yourself, and you won’t have to worry about adult sized teenagers being thrown down by big mean cops. \\nAlso, maybe your device is better than mine, but it looks to me like the girl’s foot lands on his left foot. I could be wrong in that. I’ll look at it, again. gininitaly \\nHogwash, spoken like a cop of today who needs an excuse to brutalize, for profit or the pleasure of being a bully against the defenseless. \\nLumberjacks, farmers, EMTs, firemen and fishermen have more dangerous jobs than cops and I happen to be old enough to see my towns 30 years of service police chief retire without ever having fired a shot at a human being… and that was 30 yrs of drunks with guns, broken bottles or knives, belligerent, mouthy kids, family disputes and all the rest. So what’s the difference between then and now, his talent and yours? ATTITUDE and the desire to deescalate situations, NOT intensify them to the point of murder. \\nSince 9/11 and the Patriot Act they seem to have been given permission to make US citizens their victims instead of their friends, family and neighbors that they were once supposed to protect and serve. \\nYou will get no get out of jail free or pity cards from me. Cops today… or rather what’s left after the good cops get fed up and quit or were drummed off the force. Because those that remain are drunk on their own power over people and revel in the violence that they create. \\nhttps://www.youtube.com/watch?v=6xF7AIf_a_E bruismenot \\nI didn’t say the cop did a great job. I didn’t say that I would have reacted the same way. I didn’t say that I thought the video looked fine. I was simply trying to give an explanation for what we saw on the video. gininitaly \\nAnd just who gave you that job or why you thought that cop needed defending? You invented an aggression by that 16 yr old, complained about language, defended the cop no matter what the video actually showed and projected your prejudices onto the entire situation…. in my book that makes you a worthless witness who deals in fantasy not fact. No different than a lot of chicken chit Americans who think defending the police or government will get you a free ticket off of the Auschwitz express. You should never defend the indefensible. \\n“All it takes for evil to prevail is for a few good men to do nothing.” bruismenot \\nI take it we can’t be friends, then? Stir up the SJWs all day long if you must. Who does anyone call if they get jacked, shot, stabbed or whatever? Next time you are the victim of a REAL crime, go ahead and call those same SJWs to save your bacon. See how many show up and how far you get. \\nLady, don’t assume you know me. You don’t know my story. If you did,we might could be friends. gininitaly \\nI have no idea what a SJW is….. is that police jargon? I know one thing, I wouldn’t be calling an American cop, they’d end up shooting my dog, my kid or me if they even managed to make it to the right address.. in some steroid induced adrenaline rush… I don’t need those kinds of jacked up people in my life. You/they’ve lost all credibility as anything that could or would ‘help’, I’d ask a bystander for assistance before calling a cop any day. \\nYour words are quite indicative of where your loyalties lie and if you think I’m assuming, then you should come clean and tell your story and at that point I might reevaluate my take on who you are and why you seem to need to defend the indefensible in what used to be the formerly free USA. \\nhttp://killedbypolice.net/ Free_Willey \\nYour explanation is bogus and it clearly indicates that you are the problem. The cop should have been arrested on the spot for assault. This is what makes ALL cops criminals. They fail to arrest and charge crimes against their buddies in blue. You included. It astounds me that you guys continue to make your job, on a daily basis, more and more dangerous. Putrid ignorance and arrogance and a complete non caring attitude for people in general is what is on display at today’s PD’s. This is not the “service” that we hired you for. Cops work an entire lifetime to avoid disdain for the people they have sworn to serve only to have PD’s hire the lowest of IQ and then train them to see the public as the enemy. Once you start to justify the violent actions of today’s cops, you need to leave the force. Furthermore you do not have to be a psychic as you claim to see that the cop simply became upset, lost control and used violence to assault this less than 100 lb person. bruismenot \\nSure! Arrest all the cops! Then, whose going to keep all the people safe who don’t have or know how to defend themselves from the predators in the world? \\nWhat would you do? James Michael \\nKops have NO duty to keep anyone safe moron…Look up the hundreds of cites…..Stating exactly that…. James Michael \\nIf you have respect for xops these days you either have your head up your ass or are stupid. Badcopwatch \\nThis cop should be taught a lesson bruismenot \\nWhy, for doing his job? And just what “lesson” would you have him “taught”? Do you know him, his training, or his history? If so, please enlighten us. elropo \\nHis job my ass! I am in complete agreement with gininitaly in my town we have the same situations with no brutality from the police. They are pretty much respected here, some rare exceptions. It all depends on the mayor, chief, council, hiring policies and just whether they keep assholes on the job gininitaly \\nThx and glad to see that you are blessed with a rational community… good to know there are a few left out there ;-). bruismenot \\nOk. So you can tell this cop is an ass hole from this short clip? You can tell that this upset girl is an angel? Bravo for you, then. Bravo for you! \\nFine, now I’ve wasted enough time on here. Time to go to work. Peace. James Michael \\nShe asked why her brother was being kidnapped the cop is required to inform her why….or it is unlawful….We the People she is one…Him sworn servant…..MORON…. haauwnk \\nYou need to be strung up for fellating pigs. It’s against your religion. James Michael \\nThe Nzis were doing their jobs committing treason and murder also moron…. Ibcamn \\ncops are such cowards and pussys,…”step on my feet and im gonna arrest ya’ll”…cowards,cops only feel like real men when they are beating up women…all cops are just plain criminals.. gina \\nYou all make me sick. The problem today is that we raise children to disrespect authority, and then feel we can call moral high ground against those that are in place to help. \\nOur youth need to be taught that they are not able to do whatever they want. They need to understand that laws apply to them, and if not followed, prepare for consequences. \\nThe point of no return that I see in this video is a 16 year old female that feels she has the right to interfere in an arrest in progress. \\nAnd before anyone touts unlawful bull, it is clearly stated that a warrant was in place for the arrest, and as such, she was wrong for interfering. \\nMom is equally to blame, filming it hoping to make a quick buck or news scandal, instead of correcting her daughter for her behaviour. Ibcamn \\nso is what your saying is bow down to these retarded criminals and follow orders without question and raise our children to be just like you and never question authority and be a slave……sucks to be you StopKingObama \\nHere’s an idea. DON’T INTERFERE WITH THE COPS WHEN THEY ARE TRYING TO ARREST SOMEONE. You fucking creampuff libtard crybabies just don’t get it. Fucking morons think they can adjudicate a case in the streets while the arrest is taking place. Try protesting real abuse instead of cases like these, where morons get what they deserve for being stupid. James Michael \\nYou have the RIGHT and the duty to stop any sworn servant unlawfully arresting someone…..That is an act called aggravated kidnapping and is an act of treason….. StopKingObama \\nYou have the right to resist an UNLAWFUL arrest. They had a warrant for her idiot brothers arrest. Even resisting an unlawful arrest is a good way to get killed. Let them cuff you, and if they were acting as egregiously as you think they were, tell it to the judge. If you have video to support your probably unfounded claim, all the better. \\nAll you fucking limp-wristed cream puff milquetoast libtard cop-hating social justice warriors with no respect for law and order should just be rounded up and shot, or at least sent to Iran. It would make THIS country a hell of a lot better off. James Michael \\nResisting and obstructing are non sequiturs for we have nothing because there can be NO resisting or obstructing without a real charge to resist or obstruct…Another aggravated assault and battery kidnapping false imprisonment by a another traitor felon with a badge… Ten thousand videos of the same exact thing on youtube alone….Dallas was deserved no cop can be trusted…. Social Trending Breaking: Podesta Told Mills ‘Dump All Those Emails’ on Day News of Clinton’s Private Email Server Broke November 1, 2016\""}, "time": 1742563782.2922895}