{"duration": 0.016954898834228516, "input_args": {"text": "'Israeli opposition leader Isaac Herzog told the Jerusalem Post conference in New York on Sunday that President Donald Trump’s support for peace “gives an aura of optimism to the region   …     a spirit of change that needs to be seized. ”[Herzog, who leads the Zionist Union party, was commenting on Trump’s recent commitment to achieve peace between Israelis and Palestinians, which has proceeded through visits by the administration’s emissaries to the region, a visit by Israeli Prime Minister Benjamin Netanyahu to the White House, and a similar visit last week by Palestinian Authority President Mahmoud Abbas.  “The realities are the realities,” Herzog said, arguing that while the Palestinians were “extremely difficult” to deal with, there was no alternative. Regarding Netanyahu’s own commitment to peace, Herzog said that the Israeli leader’s intentions were unclear, and vowed to build a political bloc to oppose him politically if he did not follow through. Herzog was viewed as close to President Barack Obama, who used the State Department to send funds to Israeli opposition groups in an effort to defeat Netanyahu in the 2015 elections. Trump has been praised by other Arab leaders in the region, as a broad, if tacit, alliance emerges between the Sunni Arab states  —   particularly the monarchies  —   and Israel. All are facing the common threat of a potentially   Iran, and some are grappling with the dangers caused by its terrorist proxies. Herzog was scathing in his criticism of French presidential candidate Marine Le Pen, whom he accused of forgetting the history of the Holocaust. French voters were at the polls Sunday. Joel B. Pollak is Senior    at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the   of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.'"}, "time": 1742628590.1898124}