{"duration": 0.1133580207824707, "input_args": {"text": "\"=By= Ekaterina Bilnova Editor's Note Does Soros count as a non-state or a quasi-state actor? I am not sure sometimes, but it is indeed worrisome that an individual has the resources and connections to even attempt a color revolution. However, a similar “rocking of the boat” has been taking place in the U.S. with Ayles and the Koch brothers bankrolling a deep right revolution of the government. W ikileaks’ Podesta Files shed light on US billionaire George Soros’ deep concerns about the lack of “freedom” and “constitutional democracy” in Malaysia under Najib Razak. Soros’ concerns may serve as a prelude for a series of “color revolutions” in Southeast Asia, Mathew Maavak of Universiti Teknologi Malaysia assumed in an interview with Sputnik.\\nThe latest set of documents released by Wikileaks indicates that George Soros and his Open Society Foundation are very concerned about the situation in Malaysia, one of the US’ longstanding allies in Southeast Asia. \\nA memo , sent by Michael Vachon, US billionaire George Soros’“right hand,” on March 6, 2016, to Chairman of Clinton’s presidential campaign John Podesta shed light on the Malaysian “corruption crisis” and blamed the country’s Prime Minister Najib Razak for “damaging the US’ credibility in the region.” \\n“Malaysia could one day be a good ally of the United States in countering Islamic State [Daesh in Arabic] extremism, but not before it has achieved the freedom and constitutional democracy that its people have been denied,” the memo read. However, it seems that the US financial and political elite have yet another reason to be dissatisfied with the Malaysian prime minister, besides his alleged involvement in corruption scandal. “Malaysian Prime Minster Najib Razak heads to China next week to build closer ties and seek investment, which may further dent US aims in Southeast Asia after a push by President Rodrigo Duterte of the Philippines to bolster China ties,” Reuters reported Thursday. Both Malaysia and the Philippines have long been in dispute with China over the South China Sea . However, Kuala Lumpur may follow in the footsteps of Manila, seeking to ease tensions with Beijing in exchange for economic benefits, the media outlet assumed. So, what did Soros mean by highlighting the need for democratic change in Malaysia? ‘There is no Business like the Revolutions Business’ “First and foremost, one needs to understand Soros and his business model,” Mathew Maavak, a doctoral researcher in Risk Foresight at Universiti Teknologi Malaysia (UTM) and regular contributor to CCTV told Sputnik. “There is no business like the ‘revolutions business.’ It is more lucrative than the show business which can flop due to an unforeseen shortcoming. Revolutions, on the other hand, only need to tap into the evergreen market of public discontent. NGOs and the West-friendly media constitute a major subsidiary of the global social revolutions enterprise. Together, they seek out, identify and amplify public discontent in nations not aligned to the United States. Such US-engineered activisms have never led to more equitable societies; rather they have engendered endless bloodshed and global terrorism,” the researcher emphasized. Maavak dubbed these human rights entities and philanthropists “agitprop entrepreneurs.” “To the agitprop entrepreneur, the returns on revolutionary investments are immense,” he underscored. “A wealthy hedge fund manager can short a targeted market before executing a pre-planned ‘revolution.’ The resultant stock market and currency meltdown would provide self-evidentiary ‘proof’ to an anxious public, exerting more pressure on the government of the day to either capitulate or concede to ‘popular demands’ that are actually drafted abroad, likely by the IMF!” “Therefore, even if a revolution fails, the subsequent economic fallout would render local assets cheap for foreign acquisition,” the researcher remarked. Soros’ Alleged Role in Asian Financial Crisis of 1997 Maavak referred the Asian financial crisis in 1997, which started in Thailand with the financial collapse of the Thai baht, the country’s national currency. “That seemed like Soros business plan for Malaysia and the ASEAN region during the 1997 Asian Financial Crisis,” he noted. Indeed, some observers blame George Soros for the slump. South China Morning Post’s columnist Zhou Xin went even further, stressing that Soros, “whose aggressive currency trades were blamed for destroying the Thai and Malaysian economies” in 1997 made yet another attempt to destabilize Asia’s economies by targeting Hong Kong markets in 1998. “The entire region was in turmoil, and the name of George Soros featured prominently in this sordid saga. The ‘Reformasi’ [protest] movement led by sacked [Malaysian] Deputy Prime Minister Anwar Ibrahim — who had close to ties to Washington hawks — failed to topple the government of the day,” Maavak recalled. The Reformasi, kicked off in September 1998, consisted of civil disobedience, demonstrations, sit-ins, rioting, occupations and online activism, involving thousands across Malaysia protesting against the government. However, despite execrating Soros for his role in shorting the Malaysian currency, the ringgit, and for supporting the Reformasi movement, former Malaysian Prime Minister Dr. Mahathir Mohamad did little to stem the vast NGO and alternative media networks that were being built by the Open Society Foundation and its affiliates, backed by the US State Department, Maavak pointed out. “There was a good reason for Mahathir’s lack of decisiveness, apart from the occasional arrests and police raids,” Maavak suggested, “Upon stepping down from power, he used these same networks to oust his successor Abdullah Ahmad Badawi, and is now using the same Fifth Column to attempt the ouster of current Prime Minister Najib Razak.” A Series of Domino ‘Color Revolutions’ in Southeast Asia “Without chaos in ASEAN, Soros and the transnational capitalist class may stand to lose a lot of money,” the researcher suggested. “They need Najib ousted as a prelude to a series of domino ‘color revolutions’ in the region. In Malaysia, the color chosen was yellow and it is used by the Bersih (Clean) coalition that probably sees [Democratic presidential nominee] Hillary Clinton as the paragon of virtue and transparent governance,” he assumed. Maavak’s prognosis is by no means groundless, given the fact that ASEAN countries have signaled their willingness to strengthen their ties with China, drifting away from Washington. “Washington has suffered geopolitical setbacks in virtually every nation in Asia Pacific,” Tony Cartalucci, a Bangkok-based geopolitical analyst, noted in his recent article for New Eastern Outlook, stressing that the US’ influence is rapidly waning across the Asia Pacific region . \\nBidding for hegemony in Asia Pacific US financial and political elite will do whatever it takes to curtail China’s influence and pressure ASEAN economies into obeying Washington, according to Maavak. \\nNote to Commenters Due to severe hacking attacks in the recent past that brought our site down for up to 11 days with considerable loss of circulation, we exercise extreme caution in the comments we publish, as the comment box has been one of the main arteries to inject malicious code. Because of that comments may not appear immediately, but rest assured that if you are a legitimate commenter your opinion will be published within 24 hours. If your comment fails to appear, and you wish to reach us directly, send us a mail at: editor@greanvillepost.com \\nWe apologize for this inconvenience. Nauseated by the Had enough of their lies, escapism, omissions and relentless manipulation?\""}, "time": 1742563267.9751925}