{"duration": 0.04186701774597168, "input_args": {"text": "'Leave a reply \\nKatie Gallanti – Some say that the nation is divided. However as you can see, the nation is very united – and it is not united in a “republican way”, but in an anti-globalist and anti-corruption way. The people have decided that business as usual will not go on. \\nIf Hillary Clinton had won, TPP would have been enacted lickety split. Obamacare, which is a financial nightmare for many middle class and working class families, as well as the doorway for the elites control over your health (microchipping, vaccinations) would have stayed in place. Many of the policies that have, by design, been implemented to weaken the USA, so that it was more easily absorbed into a future one world government, would have been enacted. George Soros, and all the tentacles of the satanic cabal would have continued undisturbed with their plans. \\nI know that many are not convinced that The Donald is sincere, but we know for a fact that HRC was not sincere. With this outcome there is at least the possibility of a new opening. \\nThis is also the only election outcome that delays and pulls the USA from the implementation of the NWO timetable. And there was a reason for this timetable, as they are working against the rapidly approaching collective shift in consciousness and the galactic clock. There will a point, soon, where the dark forces will no longer be able to anchor here, and they know it. When we clearly understand the energetic of this planet and the ways in which energy grids (both light and dark) have operated and still function, the timing issue becomes 100% clear. I feel that The Donald pulls in a direction distant enough from their plans, to set them back in their timeline considerably. And this is very good news. \\nSo at the very least we now have a delay of that clock, and in my view a delay that is sufficient to derail their plans to a degree that their plans may indeed, eventually, flop for good. \\nOn an energetic level also note, that regardless of The Donald, this was a vote of humanity that said “Screw you dark cabal. Screw you George Soros. Screw you FBI that does not do its job. Screw you voter fraud and Podesta emails. Screw you manipulative dark powers” And the collective energy reacts to that vote by anchoring the reality that we choose of our free will. Even if The Donald turns out to be a Jesuit fake, this collective energetic stance will go a long way. Also it is my sense that the awakened sleeping giant that The Untamed We The People has become, is not about to go back to sleep any time soon. If The Donald gets up to no good, he will soon be replaced. \\nSo here we are. We are moving steadily away from the elite plans into a world that we, now, have the responsibility to create. And this is the first step in that direction for the USA. Brexit was the same energy. And soon the whole world will follow. And this, although remaining always vigilant, is a cause for celebration. \\nOver and out'"}, "time": 1742628447.5140464}