{"duration": 0.09904241561889648, "input_args": {"text": "'November 21 - Fort Russ News -  \\n\\n-  Mikhail KOTOV  in LIFE.ru, translated by Tom Winter - \\n\\nForeign shores: why the Russian military base in Syria \\n\\nViktor Ozerov, Chairman of the Defense and Security Committee of the Federation Council, told RIA \"Novosti\" that the base in Tartus should become a full-fledged overseas base of the Russian Navy in half to two years after the signing of the agreement on it and its ratification. \"Proceeding from his impression of the base, and of plans to improve infrastructure, which we reported to the leadership of our group in Syria, I can say that we are not going to put off the modernization of Tartus, with the most modern requirements,\" said Ozerov.  \\n\\nLIFE\\'s journalist Mikhail Kotov understands why Russia needs this base. \\n\\nWe\\'re leaving, we\\'re leaving, we\\'re leaving \\n\\nFor two decades, the Russian military presence in the world has consistently been declining. Beginning with the last years of the Soviet Union there have been fewer military bases under the red and then white-blue-red flag on the map. Since 1972, as if someone had started a countdown: the Egyptian Port Said, Berbera, Nosra. In 1991 Russians left the military bases in Germany (Rostock), Germany, and the Polish one at Swinoujscie. In 2002, Russia lost its naval base at Cam Ranh Bay in Vietnam, and after the beginning of the \"Arab Spring\" had to hastily withdraw troops from Tripoli in Libya. Against the background of a gradual retraction -- that didn\\'t slow the growth of NATO for a minute, it seemed an utter loss. \\n\\nAnd now the statement of the Council of Federation of the Defense and Security Committee and the previously announced Ministry of Defense plans sound like a bombshell. Is this a new renaissance of Russian troops, or just one of the episodes of the Syrian conflict? Do we need this base? Can we keep it? To find answers to these questions, it is necessary to go back and try to understand on what the principles in the world such military outposts exist in the territory of other countries. \\n\\nEchoes of war  \\n\\nThe newfound bipolar world was clearly manifested already in the last days of World War II. The threat, which temporarily united countries, was destroyed, and it became clear that there is a \"we\" and \"they.\" And let no one be misled by the triumvirate of leaders at the Yalta Conference, the world is henceforth split in two. NATO, created in 1949 and the countries of the Warsaw Pact, concluded six years later, began struggling to make friends against each other. \\n\\n\\nThe more active a country\\'s foreign policy is, the more it needs assistants in all corners of the world. Not for overt fighting, rather for denoting the presence and serving as an active extension of diplomatic aspirations. [Suppose] a satellite falls in the wrong place, an uprising starts in a friendly contry, intelligence calls for support -- All these questions are much easier to solve, if you have at hand a military base closed to prying eyes. Naturally, they were differently assigned: in Cuba, the Soviet Union had the radio-electronic center and in Vietnam [the base was a] pied-a-terre for the logistics fleet. \\nOf course, that the Soviet Union was not the only country seeking to extend the hands of the military. The United States of America created their own bases no less actively. At the same time the United States managed an almost unprecedented situation: they do not pay for the land leased by the base, almost anywhere. Instead it is represented as a contribution to the host country\\'s overall security. More than thirty countries, more than one hundred sites around the world. Maximum operating room. \\nDo not think that in each of these countries the locals are just happy to see the Yankees. The main example - the naval base in Okinawa. The island was captured by US troops in 1945, and since then, the US military base is almost 18 percent of its territory. The local population, whom the \"invaders\" treat as second-class citizens, regularly go to protests and demonstrations.  \\nIn total since 1972 in Okinawa, the US Army was committed 5,800 crimes, 571 of which can be categorized as serious. E.g, in 1995, twelve Japanese schoolgirls were raped by US soldiers. And nothing - the military presence is more important. \\nUnderstood, of course, that it is not that way everywhere; many European countries, including the Baltic republics, are themselves willing to provide territory for overseas military deployment. A key factor in this is skillful American diplomatic work, and many regularly asserting about possible aggression from Russia. \\nReturn to former position \\nMilitary bases should not be taken as an outpost of the country, where one might expect an attack any time. In most cases (especially when we are talking about Russia) it is only the indicator of strength and presence in the region. But the main goal - a logistics center, giving the opportunity for a quick response to any problem that might arise in the region. So another way to think of them in Soviet times: a group of military advisors and specialists. They maintain the presence, but at the same time the money spent for the maintenance of such a mobile group is much less. \\nIn many ways, such numerically small bases relate to the lack of funding. Even the budget of the USSR was greatly strained, containing all the foreign assistance centers, to say nothing of Russia. That is why a return to the old policy has caused so much talk. \\nBy itself, a military base in Syria (officially the 720th logistics of the Russian Navy) was established to support the Soviet naval operations in the Mediterranean, namely the repair of ships and vessels of the 5th Mediterranean operational squadron, with their fuel supply, water and consumables. Founded in 1971, it has never been particularly great, just a few berths and facilities on the territory of the Syrian naval base (63 brigades of the Syrian Navy crew). \\nRussian portions of Syrian Naval base marked in red. \\n\\nAfter 1992, when the Soviet Mediterranean Squadron, which was created as a visible and tangible rival the US Sixth Fleet, was disbanded, there began a slow fadeout of the base. In the best years more than two thousand soldiers and sailors, with marines guarding. In 2002, there were only 50 military personnel on the base, and by 2012 this number was down to only four people. \\n\\nAfter the beginning of the participation of Russian armed forces in the Syrian civil war, the base contingent increased again. In 2015, it amounted to 1,700 people, who assisted in unloading, ship supply, and repair, and the delivery of Russian military hardware to Syria. Therefore, to talk about the creation of the base is not entirely correct, but rather, it has been a return. \\n\\nA Base without a squadron \\n\\n\\nGeographically, Russia does not have normal access to the Mediterranean. The only way to leave the enclosed Black Sea is through the Turkish Bosporus Strait, the Sea of Marmara and then the Dardanelles, and then exit to the operating space of the Mediterranean. But, firstly, the outlet of all ships through the Bosporus is tightly controlled by Turkey, a NATO member, and, secondly, the passage of vessels costs money. The Turkish side collects the so-called \"light dues\" for passage through the strait, depending on the vessel class. Sometimes it can reach significant values. That is why the Russian bases in the Mediterranean are needed even in the absence of a permanent fleet in the region. \\n\\nThere have been discussions in the Naval Command about the desire to revive in full the base in Libya (Tripoli), which lasted until 2011. But the current political situation pushed the process of returning to the Mediterranean with the Syrian base. It is expected that after the modernizations are finished, it will be able to accommodate large vessels. In addition to direct military purposes, the base in Tartus is of great importance for external intelligence operations, including electronic ones. \\n\\nAccounts and mutual settlements   \\n\\nIt remains a question of the cost of all this. Most likely, in view of the current relations between Russia and the Government of Bashar al-Assad, rent at Tartus will be zero. As regards the funds that will be spent from the budget on the presence of Russian troops and support staff in Syria, earlier the Ministry of Finance decided to increase the relevant articles of the Russian budget to 678 billion rubles. It is highly likely that the money will be used to service the Russian naval base. \\n\\nIn addition, screenshots from Syrian TV recently appeared on the networks. In them one might well discern medium range Russian air-to-air missiles, RVV-AE (R-77). This means that Russia has quietly upgraded Syrian MiG-29 to the MiG-29SM variant. These missiles can hit an air target at speeds of up to Mach 3. The cost of each of these missiles is very high. In 2012, Malaysia bought 35 missiles RVV-AE for US $ 35 million. It is possible that this upgrade is also an integral part of the Russian-Syrian relations that resulted in the revival of the naval base in Tartus. \\nSyAAF MiG-29 armed with R-77!!!!\\n\\n\\nBack in the saddle? \\n\\nSpeaking frankly, one base in the Mediterranean without a constant fleet in the Mediterranean doesn\\'t work. This step does not carry with it geopolitical changes. Those who wish can consider the composition of the United States Sixth Fleet, to understand that we will not threaten them from Tartus, separately, in no way. \\n\\nRather, it is a sign for the world and NATO, showing that Russia wants to return to the world stage and that its aspirations do not end with the borders of the CIS, where most Russian foreign military bases are now.  \\n\\nHowever, it should be remembered that, by investing in Tartus, Russia once and for all stands with Assad, is not trying to be above the situation, but is clearly taking one side of the game. Indeed, in the case of a Syrian Government defeat, this base would go the way of the base in Tripoli, which had to quickly fold in 2011 after the beginning of the \"Arab Spring\" and the death of Muammar Gaddafi. \\n\\nThis is a risky bet, but in the case of a successful conclusion of the war in Syria, it could be a serious step on the way of Russia\\'s return to big geopolitics. Military action - this is just a continuation of political aspirations, and if the base is such a handy instrument, it should be used. \\n\\n     Follow us on Facebook!                                                   \\n                                                   \\n\\n       Follow us on Twitter! \\n                               \\n\\n             Donate! \\n'"}, "time": 1742628462.2243352}