{"duration": 0.09551334381103516, "input_args": {"text": "'Philippines President Rodrigo Duterte repeatedly threatened to impose martial law on his nation and threatened to killed hostages taken by Islamic State affiliate Abu Sayyaf to eradicate the jihadist group. [Duterte, who has called the observance of human rights norms in the context of a war on terror “bullshit,” has launched a new initiative against Abu Sayyaf, a radical jihadist group primarily concentrated in Duterte’s native southern Mindanao island. Abu Sayyaf has pledged allegiance to the Islamic State.  Armed Forces Chief of Staff Gen. Eduardo Año announced Tuesday that the military had six months to eradicate the terrorist group completely. “As pronounced by our president, we have a very tall order to do. And we have six months to totally decimate the Abu Sayyaf group and the other terror groups here in Western Mindanao,” Año told reporters. Duterte himself said on Saturday that Abu Sayyaf terrorists should not assume that their lives will be spared if they use hostages as human shields. “They say, ‘What about the hostage?’ Sorry, collateral damage,” he said. “Then if they are blasted everyday [sic] that [kidnappings] would stop   …     so, better not get yourselves kidnapped. ” Duterte had previously vowed to “eat” Abu Sayyaf terrorists “in front of people.   …     I will eat you alive, raw. ” He has also admitted that he has “cousins” who fight for the Islamic State, the Moro Islamic Liberation Front (MILF) and other terrorist groups in the area. The Philippine military issued a report in October estimating that Abu Sayyaf had generated $7. 3 million in kidnapping ransoms between January and June of 2016. While the Philippines has an official policy of not paying ransom to Abu Sayyaf, foreigners have paid to free their relatives, primarily Indonesian nationals. Duterte announced his plan to ramp up the campaign against Abu Sayyaf after visiting the wake of a Philippine soldier killed in a Special Forces operation against the terrorist group, leaving behind a    daughter. The soldier was the nation’s first military loss of 2017. While announcing the new initiative to eradicate Abu Sayyaf, a spokesman for the Armed Forces of the Philippines (AFP) clarified that Duterte had not given any orders to disregard loss of hostage lives in operations against the terror group. The presidential office also clarified that Duterte’s repeated mentions of martial law did not mean he intended to impose it. “The president has categorically said no to martial law. He even made a pronouncement saying that martial law did not improve the lives of the Filipinos,” Duterte’s spokesman Martin Andanar said this week, calling it “misreporting” and “the height of journalistic irresponsibility” to claim this. “If I have to declare martial law, I will declare it  —   not about invasion, insurrection, not about danger. I will declare martial law to preserve my nation  —    period,” Duterte had said on Friday night. “I will declare martial law if I wanted to. No one will be able to stop me. ” Multiple Philippine senators have implored Duterte to leave martial law off the table in the case of Abu Sayyaf. “President Duterte should just shut up on these martial law threats and just govern our country the way any responsible leader should,” Sen. Antonio Trillanes IV said on Monday, according to the Philippine Star. “There is no basis to declare martial law,” said Senate Minority Leader Ralph Recto. “No foreign army is steaming toward our shores to invade us. And as the President himself likes to brag, crime is down and the people are safe in their homes and communities. ”'"}, "time": 1742564155.0220385}