{"duration": 0.11016321182250977, "input_args": {"text": "'Former Alaska Governor Sarah Palin is considering suing the New York Times for libel after the Times published a Wednesday editorial falsely accusing her of inciting Jared Lee Loughner to shoot Rep. Gabby Giffords in 2011 even though it has long been established that there has never been any evidence whatsoever linking Palin to the attempted assassination.  Palin tweeted that a journalist suggested to her on Thursday that the Times “has fulfilled the two criteria for libeling a public figure” —  a reckless disregard for the truth and malice. She said she is “talking to attorneys this AM and exploring options. ” ( ) @nytopinion  —   commonsense suggestion by a journalist, am talking to attorneys this AM and exploring options. BTW, wonder.. pic. twitter.   —   Sarah Palin (@SarahPalinUSA) June 15, 2017,  ( )   …    WHY someone would no longer be in public eye? Think constant libel  slander have anything to do with it?   —   Sarah Palin (@SarahPalinUSA) June 15, 2017,  After James T. Hodgkinson, who supported Sen. Bernie Sanders ( ) and hated President Donald Trump and Republicans, shot House Majority Whip Steve Scalise ( ) and targeted other Republicans as they were practicing for their Congressional baseball game, the Times decided to publish an editorial on Wednesday in which it falsely blamed Palin for the assassination attempt on Giffords: Was this attack evidence of how vicious American politics has become? Probably. In 2011, when Jared Lee Loughner opened fire in a supermarket parking lot, grievously wounding Representative Gabby Giffords and killing six people, including a    girl, the link to political incitement was clear. Before the shooting, Sarah Palin’s political action committee circulated a map of targeted electoral districts that put Ms. Giffords and 19 other Democrats under stylized cross hairs. In addition, despite plenty of evidence to the contrary (Hodgkinson asked at least two Representatives whether the players on the baseball diamond were Republicans or Democrats before he started shooting) the Times added that “there’s no sign of incitement as direct as in the Giffords attack” As Breitbart    Joel Pollak pointed out, “the Times‘ false equivalence between the two shootings provides a sick excuse for what Hodgkinson did by making it appear to be partially Republicans’ fault. That is worse than ‘fake news.’ It is an effort to exploit a horrific act of violence for the purpose of stoking political divisions, reinforcing the hysteria in which Hodgkinson was steeped. ” Palin linked to Pollak’s article in a Facebook post and slammed the Times‘ “sickening editorial” that attempted to “destroy innocent people with more lies and more fake news” to advance the Times‘ preferred narrative at all costs, facts be damned: With this sickening NYT’s editorial, the media is doing exactly what I said yesterday should not be done. Despite commenting as graciously as I could on media coverage of yesterday’s shooting, alas, today a perversely biased media’s   blame game is attempting to destroy innocent people with lies and more fake news. As I said yesterday, I’d hoped the media had collectively matured since the last attack on a Representative when media coverage spewed blatant lies about who was to blame. There’s been no improvement. The NYT has gotten worse.  —   SP, As Breitbart News has extensively reported, hours after Giffords was shot on January 8, 2011, outlets like CNN immediately tried to implicate Palin. It turned out that Loughner, the murderer who killed six people and shot 18, did not have any political leanings whatsoever. He actually spoke to Giffords at a town hall event years before and may have been upset that Giffords brushed off his question with a  . In any event, authorities definitively concluded that Loughner was “in no way influenced by Tea Partiers, conservative media, or Palin. ” After the Giffords shooting, Zach Osler, Loughner’s friend, told ABC that Loughner was apolitical and did not even watch television. “He disliked the news. He didn’t listen to political radio. He didn’t take sides. He wasn’t on the left. He wasn’t on the right,” Osler added. Another friend, Bryce Tierney, told   Mother Jones that Loughner was not political. As the   outlet noted: Tierney notes that Loughner did not display any specific political or ideological bent: “It wasn’t like he was in a certain party or went to rallies  …    It’s not like he’d go on political rants. The Times‘ editorial was so outrageous and egregious that even mainstream media journalists, some of Palin’s most vicious haters on the right, and those on the left like Chris Hayes agreed that the Times had to issue a correction. Yep. If editorial board has any intellectual honesty they’ll issue a correction for the    claim. https:  .   —   Jonathan Swan (@jonathanvswan) June 15, 2017,  On Thursday morning, the Times finally issued a correction that read: “An earlier version of this editorial incorrectly stated that a link existed between political incitement and the 2011 shooting of Representative Gabby Giffords. In fact, no such link was established. ”  '"}, "time": 1742562302.52659}