{"duration": 0.12197566032409668, "input_args": {"text": "'Babies of obese mothers at high risk of brain damage, stroke, heart attack and asthma \\n  Daniel Barker Tags: parental obesity , children , health risks (NaturalNews) The growing number of babies born to obese mothers throughout the world face a higher risk of developing serious health problems in adulthood, according to several recent studies. Children of obese mothers are prone to brain damage, heart disease, stroke and asthma in adulthood, warn health experts.Obese parents pass on the tendency towards obesity to their children, creating a \"vicious cycle\" that warrants urgent action on the part of health officials, said the researchers of the new studies.The list of health risks is surprisingly long, including diseases like cancer, and conditions such as ADHD and autism .From The Guardian :\"Four studies published in the Lancet Diabetes and Endocrinology make clear that the risks of maternal obesity include stillbirth, dangerously high blood pressure in pregnant women, diabetes in the mother or child, and complications during childbirth.\"The scale of obesity in women of childbearing age and the consequent dangers to health were so great that urgent action was needed to ensure women were a normal weight before they conceived, the authors say.\"Mothers being very heavily overweight could lead to their children having autism or attention deficit hyperactivity disorder or developing cancer in later life, the researchers say.\"Between 2011 and 2012 in the United States , nearly a third of women at peak childbearing age (20 to 39) were obese, and 60 percent of American mothers were either overweight or obese at the time they conceived.In Britain, where obesity rates among women are the highest in Europe, 20 percent of mothers were already obese when they became pregnant. In 2013, 26 percent of women in England between the ages of 35 and 44 were obese, as were 18 percent of 24- to 35-year-olds. Global obesity has reached \\'pandemic proportions\\' \"Obesity has reached pandemic proportions globally and its origins start in the womb,\" said Professor Lesley Regan, the president of the Royal College of Obstetricians and Gynaecologists.Regan pointed to the fact that more than 25 percent of men and women in the UK are obese, and that the one in five pregnant women who are obese face an increased risk of \"miscarriage, stillbirth and neonatal death as well as gestational diabetes, blood clots, pre-eclampsia, more complicated labours and severe bleeding after the birth.\"The researchers involved in the studies are concerned that the global obesity problem will only worsen, particularly in the developing world. It is estimated that more than 20 percent of women throughout the world will be dangerously overweight by 2025.One research paper warned of long-term \"profound public health implications,\" while another called for governments to begin treating obesity as a global public health priority.There is increasing evidence indicating that obesity during pregnancy can lead to a child being predisposed not only to developing diseases like type 2 diabetes and asthma, but also neurodevelopmental disorders like cerebral palsy.The complex interaction of \"neuroendocrine, metabolic, immune and inflammatory\" factors in obese women are believed to affect hormonal exposure and nutrient supply to fetuses, leading to possible brain damage in unborn children. Searching for solutions in a world dominated by fast food and sedentary lifestyles The experts all agree that something should be done, but there are no simple solutions. Increased education and guidance may be part of the answer, but a number of aspects of modern day-to-day life are increasing the tendency towards becoming obese.Among these are an \"increasingly commercialised food supply\" (i.e. junk food), reliance on cars and public transport, dangerous and overpopulated urban environments, and the tendency to sit in front of TV and computer screens for unhealthy periods of time.Ultimately, it is the responsibility of parents to lose weight before giving birth to children and to set a healthy example for children as they grow and develop. But in a world of fast food and smartphones, this may not prove to be so easily accomplished. Sources:'"}, "time": 1742562932.8275502}