{"duration": 0.0555415153503418, "input_args": {"text": "'Friday on his nationally syndicated radio show, conservative talker Rush Limbaugh warned President Donald Trump of “playing the swamp’s game” in governing.  According to Limbaugh, Trump was elected to “drain the swamp,” but has been bogged down in taking on the Justice Department’s investigation of his alleged ties to Russia and how that investigation had taken on other aspects. Limbaugh argued although he was playing “the swamp’s game,” he had other tools at his disposal that he has yet to use. Partial transcript as follows (courtesy of RushLimbaugh. com): He could fire Rosenstein, and he could fire Mueller. There’s nothing stopping him from doing it, nothing legally. He could go to Rosenstein right now. He would be perfectly within his bounds to go to Rosenstein and say, “Look, this investigation can’t be wide open for anything. You’ve gotta limit what these people can look for. You’ve gotta limit it to actual felonious crimes. You can’t have them subpoenaing anybody they want financial records, text records, tax records. There has to be a limit. ” He would be perfectly within his bounds to do that because he is the executive branch. And if he wanted to fire these people, he could. When you see in the media, “There’s no way he can do it,” they’re talking politically. But since the independent counsel, special counsel’s been named, and now since they made sure to leak that Trump is under investigation, that is supposed to tie his hands, but it cannot tie his hands legally. If he wants to fire these people, he can. And if he wants to endure the excrement show that happens, he can. If he wants to drain the swamp, he could keep doing it. Now, the point is that once Trump’s inaugurated, already under a cloud of suspicion that it limits his ability to drain the swamp because when he begins it taints what he’s doing as rather than draining the swamp he’s getting rid of people who could put him in trouble. That’s what Josh here is saying. And all that is true. But it need not stop him. What is being relied on, therefore, is conventional    thinking. Look, the Constitution has devised, for every branch of the government  —   the Founding Fathers were smart people, folks. They anticipated that there would be a   quest to consolidate power. They understood human beings. They understood that the executive branch was gonna try to become dictator. They understood legislative branch was gonna be trying to overthrow the executive. They understood that the judges are gonna try to trample over everybody. And so they gave every branch defense mechanisms against various forms of attack in order maintain the separation of powers. And these are still in place today. These various mechanisms that the branches can constitutionally use to rein in, say, an overzealous executive. Or that a president can use to rein in overzealous members of the executive branch. The executive branch cannot run anything legislatively and  . Now, Obama was able to take over the legislative branch ’cause they ceded it to him. The Democrats ran it, and they said, “We’re more than happy because we believe in centralized    and since we love Obama, since he’s God, since he’s Mr. Perfection, we are happy to cede our power to him. ” And they did. Republicans have no desire to cede their power to Trump. They’re holding onto it so Trump’s in a battle with his own party for power, and of course the DOJ is not equally powerful as the executive branch. It is part of the executive branch. It does not have independent powers. The   defense mechanisms are what are being employed now. Okay, we’ve announced the special counsel and he’s announced that the president’s under investigation, and so the political reality, the political consequences of using his executive power to broom all these people out of there is designed as a deterrent. But he could still do it. It’s not constitutional or legal prohibitions stopping him. It’s pure politics. And it’s the politics of the swamp, folks. The swamp has got Trump playing the swamp’s game right now. And that’s not what Trump was elected to do, and that’s not what Trump wants. Trump does not want to play the swamp’s game. I think the effort to get health care passed in the House was Trump playing the swamp game. And by swamp game, I mean the traditional way to get legislation passed. Somebody in the House comes up with a bill working with the White House and you got people that are for it and against it. You bring the detractors up to the White House, you wine and dine ’em, you cajole ’em, you beat ’em on the head. You do whatever, you try to get the bill passed, exactly the way it’s always been done in the swamp. That first health care bill that ended up not being voted on because it never had a chance, I never thought it was gonna have a chance because it was “all swamp all the time. ” Now, you might say, “Well, I mean, Rush, the swamp’s the swamp. There’s no other way to get a bill passed. The president’s not a dictator. ” I understand that. But Trump has many more tools at his disposal than he is aware of. I shouldn’t say that. He’s got more tools at his disposal than he is using. The power vested in the president by the Constitution in the executive branch is awesome. Now, there are limits to it. Separation of powers. But he hasn’t gotten close to utilizing it. It’s just politics that is the obstacle to getting rid of Mueller since Mueller has now leaked that Trump is under investigation. You’ve heard the media say if he gets rid of him now that takes us right back to Nixon. It takes us back to Nixon only because the media loved getting rid of Nixon. Nobody has any evidence Trump did anything yet. There isn’t a shred of evidence even now, folks. If you read the Washington Post story on the latest examples of the independent counsel looking into financial  —   there’s no evidence of anything. It’s a wild good chase. Trump would not be throwing out any evidence if he fired these people and shut down this investigation. If Trump thought the investigation was needlessly harming the country and derailing us at a time we needed to be focused on real dangers and enemies, he could do it. There would be hell to pay in the media, don’t misunderstand. I mean, it would dwarf what’s happening. But he could do it, is the point. Now, he won’t probably choose to do it because of the political ramifications of it. But the idea that he’s been hamstrung since the beginning because he was inaugurated under investigation, and at that time we didn’t even know what it was. It was just the FBI looking into Russia and collusion. Some of us have known that that was bogus from the  . Some of us have known that it was purely manufactured, invented by the Hillary campaign 24 hours after she lost. Some of us have never believed a single word of it and would have been happy if Trump acted that way as well. But he didn’t. Why? He’s new. He wants to calm their fears. He wants to show them that the things they thought about him were not true, that the reasons they hated him were not grounded in any reality. He wanted to show them that he could work with them, be a good guy, we could all come together. I’m sure that’s what he wanted to do. And of course they want no part of that ’cause they don’t want any part of Donald Trump succeeding in anything, anytime, anywhere. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742628515.240029}