{"duration": 0.061805009841918945, "input_args": {"text": "\"Foreign Policy US Secretary of Defense Ashton Carter (Photo by AFP) \\nUS Defense Secretary Ashton Carter says the Pentagon is planning a ground offensive to oust the Daesh (ISIL) terrorist group from the Syrian city of Raqqah, the terror group’s stronghold in the country. \\nSpeaking to NBC News on Wednesday, Carter said Washington was ready to equip Syrian and Kurdish fighters to launch the assault in the near future. \\n“It starts in the next few weeks, hat has long been our plan and we will be capable of resourcing both [groups],” the Pentagon chief noted. \\nCarter, who was in Iraq earlier this week amid the ongoing battle to retake the city of Mosul from Daesh, said the Raqqah offensive would begin when Iraq’s second largest city is cleared. \\nThe Iraqi army, backed by volunteer forces, has been engaged in a large military offensive to cleanse Mosul of Daesh terrorists since last week. A coalition of US-led countries has been reportedly providing air support to the operation. \\n“It's been long a part of our plan that the Mosul operation would kick off when it did. This was a plan that goes back many months now and that Raqqah would follow soon behind,” Carter added. Iraqi forces gather in the al-Shura area, south of Mosul, October 24, 2016. (Photo by AFP) \\nCarter acknowledged that US forces won't be directly involved in any of the operations. \\nMore than 5,000 American soldiers are currently stationed in Iraq, tasked with providing training and intelligence to Iraqi forces, according to US military officials. \\nThe US-led coalition has also been carrying out airstrikes against purported Daesh positions in Syria since 2014. \\nHowever, the ongoing Western efforts in Syria have a different nature. Washington and its allies have come under fire for openly seeking to remove President Bashar al-Assad from power. \\nAmnesty International, a UK-based rights group, said Wednesday that the US-led airstrikes have killed hundreds of civilians across Syria. \\nCarter’s remarks came only a day after British Defense Secretary Michael Fallon said UK special forces will soon resume training “moderate” militants in Syria to bolster the fight against Daesh. \\nThe new effort would be an extension of a failed $500 million program by the Pentagon that was supposed to “train and equip” up to 5,000 militants every year, but was discontinued in November last year, after failing to attract enough volunteers. \\nRussia, which has been pounding Daesh across Syria upon a request from Damascus, says the Western-trained militants’ only use is to oust Assad. Loading ...\""}, "time": 1742561988.5049589}