{"duration": 0.10967874526977539, "input_args": {"text": "'The international climate mob have made President Trump an offer he can’t refuse: “Stay in Paris  —   or the U. S. gets it! ”[Among the threats made so far, should the president honor his election trail promise to quit the UN Paris climate agreement.  The U. S. will lose $6 trillion worth of jobs in “clean” energy. The U. S. will become a “rogue country”. The U. S. will be removed from Angela Merkel’s Weihnachtskarte list. The U. S. may become the victim of further weaponized handshakes and other typically Gallic “your mother was a hamster and your father smelt of elderberries” insults from prepubescent Mummy’s little tough boy President Macron of France. The U. S. presidential administration may become subject to further awkward rifts between those who want a “seat at the table” in Paris  —   Tillerson Jared Kushner Ivanka Gary Cohn Rick Perry  —   and those who want out. The U. S. may add to “global warming” by 0. 3 degrees C,  causing the world to boil and melt or, if not that, then at least provoking much bitterness and resentment among all the countries that haven’t yet quit Paris even though they’d all secretly like to. Quite how Trump will respond to these threats is still anyone’s guess. On the one hand, he has reportedly told various allies that he intends to pull out. On the other, he is known for changing his mind at the last minute. What we do know is that the climate gravy train is trundling on regardless. And that as far as the U. S. climate negotiators are concerned, the current president might still just as well be Barack Obama. Yup, that’s the inside gossip from EU news specialist Euractiv: But, according to our sources, the US team are exploiting the vacuum to press ahead with the agreement, which was signed by Trump’s predecessor Barack Obama. They told   officials, “We are following the Obama procedure. As long as there are no new instructions, the old ones are still valid. ” They agreed a limited budget increase to plans in Bonn. Diplomats told their opposite numbers that they should seize the opportunity to get as much agreed before Trump makes up his mind, awestruck sources gossiped. Another source blasted that “climate should be humanity’s number one concern and this guy hasn’t found the time to sit down with his climate negotiators in more than 120 days in office”. This international determination to keep the U. S. in the Paris Agreement at all costs sits slightly at odds with reports that several other signatory nations are privately desperate to escape. According to Climate Home,  former Eastern Bloc countries Poland, Czech Republic, Slovakia and Hungary are trying to “gut, block or water down” the Paris accord’s   promises because they interfere with their economic growth and commit them to useless, expensive renewable energy. Europe’s steelmakers  —   among them,    Germany’s Thyssenkrupp and Austria’s Voestalpine  —   have written to EU leaders begging not to be burdened with any of the carbon emissions costs they say would make them uncompetitive against foreign rivals. Meanwhile a report produced by the Commission on Carbon Prices claims that says the carbon dioxide price needs to rise   or twentyfold if it is to meet Paris pledges. This would  —   to coin a phrase  —   cause electricity prices necessarily to skyrocket  …     As Cliff Forrest notes in the Wall Street Journal, the ‘business case’ for Paris is bunk. The economic merits of the Paris Agreement take on a different air when more fully considered.   advocates’ bizarre premise is that economic gains will come from restricting access to the most abundant, reliable and affordable fuel sources. Never mind that this defies the experience of many European nations that have invested heavily in renewable energy. After “Germany’s aggressive and reckless expansion of wind and solar,” for example, the magazine Der Spiegel declared in 2013 that electricity had become “a luxury good. ” Apparently this time will be different. Which is why  —   as I remarked yesterday  —   it is so absurd and wrong and dishonest of the President’s   Economics Adviser Gary ‘Wormtongue’ Cohn to be pretending otherwise. No one is pretending Trump won’t get a lot of stick from the Climate Industrial Complex, from the Euro weenies, from the globalists, the Bilderbergers, the eco Nazis and Davos Man if he does the right thing and pulls out of Paris. No one is pretending that pulling out of Paris won’t earn him an even stiffer handshake from President Macron and even dirtier looks from Mrs Merkel next time they meet. But increasingly  —   at least from this Englishman’s perspective  —   whether President Trump pulls the U. S. out of Paris boils down to one very simple question: “Are you a man or a mouse, Mister President?”'"}, "time": 1742561975.4867713}