{"duration": 0.0634617805480957, "input_args": {"text": "'White House social media director Dan Scavino tells Breitbart News he is “not surprised” that President Donald J. Trump’s address to a joint session of Congress on Tuesday evening shattered records on social media in terms of engagement with the American public. [On Twitter, for instance, a whopping three million people Tweeted about President Trump’s address —  a record that even former President Barack Obama’s team could not hit. The previous record, under Obama, was 2. 6 million Tweets, according to Twitter per an Associated Press report. Facebook had millions of people engaged as well, a spokesman told Breitbart News. “7. 5 million people on Facebook generated 20. 5 million likes, posts, comments and shares about President Trump’s address to Congress,” Facebook’s Andy Stone said in an email.  None of this surprises Scavino. He said in an emailed statement: President Trump loves communicating with the American people. I was not surprised to see him not break, but shatter the record of most Tweeted Joint Session or State of the Union address ever. Pundits and ‘experts’ have underestimated President Trump’s social media platforms from day one —  the President’s numbers have outperformed those of Fortune 100 companies since all the way back when we began in the primaries. History in the making for social media has just begun. What’s more, the highly inaccurate network CNN —  which the president has called a “very fake news” outlet, is attacking President Trump by literally running a countdown clock since the president has criticized someone on his Twitter account. How long has it been since Donald Trump attacked someone on Twitter? https:  .  pic. twitter.   —   CNN Politics (@CNNPolitics) March 1, 2017,  CNN is one of the leading “fake news” outlets in the country, and a leader in what the president calls the “opposition party” which is an “enemy of the American people. ” FAKE NEWS media knowingly doesn’t tell the truth. A great danger to our country. The failing @nytimes has become a joke. Likewise @CNN. Sad!  —   Donald J. Trump (@realDonaldTrump) February 25, 2017,  The FAKE NEWS media (failing @nytimes, @NBCNews, @ABC, @CBS, @CNN) is not my enemy, it is the enemy of the American People!  —   Donald J. Trump (@realDonaldTrump) February 17, 2017,  CNN is so bad, in fact, that the administration will not provide Vice President Mike Pence for an interview on the network —  even though the Trump White House is making the vice president available for an interview on other networks. ”Trivial fights” should be ”behind us,” but hours later WH offers @VP Pence interviews to every major US TV broadcaster except @CNN https:  .   —   Jake Tapper (@jaketapper) March 1, 2017,  But none of this from CNN will get President Trump down, Scavino says. If anything, the president plans to expand on his success on social media and continue doing what works. “The President has no plans of changing a thing on Twitter, Facebook or Instagram,” Scavino told Breitbart News. “In fact we will expand with some other platforms in the near future —  as we begin to build out a great team. We are only just getting started. ” President Trump has been a giant on social media platforms, and during the campaign —  Scavino previously detailed for a Breitbart News exclusive back in November —  he generated tens of billions of impressions on various social media networks. Scavino has, after overseeing the president’s social media team during the campaign, taken over as the White House’s director of social media. It’s worth noting too that these   performances during Trump’s speech come with just a   social media team in the White House, much smaller than former President Obama’s   team.'"}, "time": 1742561838.8667252}