{"duration": 0.2213282585144043, "input_args": {"text": "'It’s a nice problem to have, but it’s still a problem. Stocks have soared so high that a cautious person might start worrying about oxygen supply. In January, the Dow Jones industrial average reached 20, 000 for the first time. It crossed the 21, 000 mark on March 1, and while it slipped on Thursday and then had a late surge on Friday, it still seems to have plenty of power left in it. That means that if you’ve been in the market for a while, you are likely to be perching on a mountain of profits. Should you stay where you are and hope for further gains, or is it time to declare victory and move your money to safer ground? That’s an eternal question, one that returns whenever the market rises spectacularly. The answer depends, of course, on your analysis of two very different issues: the current situation in the markets, and the one in your own life. The raw numbers for the stock market are astonishing: Even without counting dividends, the Standard  Poor’s index has risen more than 6 percent since New Year’s Day, nearly 20 percent in the last 12 months and roughly 250 percent since the start of the bull market in March 2009. Market history shows how remarkable that performance is. The current bull run is now the second longest since 1928, according to Bespoke Investment Group, a research firm. It is surpassed in duration only by one that ran from December 1987 to March 2000. In terms of strength, it ranks third, well behind that   bull market, which had an   gain of 582 percent, but not very far from one that lasted from June 1949 until August 1956, in which the market rose 267 percent. The current rally has lasted so long and has gone so far that precedents from past markets may not be very helpful in understanding it. “My attitude is, the market is likely to continue to do better, though I can’t point to historic metrics to prove my case the way I usually can,” said Laszlo Birinyi, president of Birinyi Associates, a stock market research and money management firm in Westport, Conn. Mr. Birinyi is a veteran strategist and a longtime bull. Back in 2009, he told me that we were at the very start of a classic bull market, and he reiterated his bullish view periodically, particularly in 2013, when many investors were growing pessimistic about the prospects for stocks. In a telephone conversation, he said that while some of the market’s recent action has been very strong  —   “a huge move” upward on Wednesday after President Trump’s speech to Congress, for example  —   the stock market’s path since 2009 has generally “been a series of slow, grinding moves” with little evidence of irrational exuberance. Clearly, though, market fundamentals are less auspicious than they were eight years ago, when stocks had been battered in the ferocious downturn of the great financial crisis, and investors with foresight and audacity could buy at   prices. For example, one widely followed metric, the    ratio of the Standard  Poor’s   index  —   which tells you how much money is being paid, on average, for $1 of corporate earnings  —   has become much less favorable. It has climbed to 22, well above its   average of 18. 2, according to data from Bloomberg. Consider that in February 2009, the ratio plummeted to 12. 1, a paltry level reflecting widespread fear that both corporate earnings and stock prices would plunge. That moment was a turning point for the market, which has surged upward ever since. It may not be at a peak now, but investors are inhaling rarefied air, whether they know it or not. Yet it can be argued, as Mr. Birinyi does, that corporate earnings are rising, the economy is expanding nicely, and investors have been reacting fairly cautiously, keeping valuations within reasonable, if not optimal, bounds. On the other hand, prices have certainly leapt since Election Day in response to the possibility that the Trump administration and Congress will agree on legislation that could enrich American companies: corporate tax cuts, defense and infrastructure buildups, and changes in the Affordable Care Act. But, Mr. Birinyi says, the market hasn’t risen all that much, and if earnings keep rising, stock prices probably will, too. “It makes sense to stay involved in the stock market and to be positioned for the possibility that it will rise a lot further,” he said. The increasing likelihood of a Federal Reserve interest rate increase would have been a problem a year ago, Mr. Birinyi said, but it is a positive portent at this stage, because it signals that the central bank is convinced that the economy is in good shape and will keep expanding. That said, he also warned that in the current market, restraint and agility are important. “I wouldn’t go all in on stocks,” he said. “I’d be careful. ” Mr. Birinyi sits in front of a terminal all day, trading individual stocks whenever the prices tell him it makes sense to do so, which most people couldn’t and shouldn’t attempt. “We get out of a stock if the price is no longer right,” he said, “and we will buy it again when it’s better. We’re ready for whatever happens. ” Most of us aren’t steady stock traders, and need to be prepared for downturns in other ways. And if little is accomplished in Washington to fulfill investor expectations  —   or if there is an external shock, such as an international crisis  —   the market could fall sharply, Mr. Birinyi acknowledged. Furthermore, if the economy falters in such situations, the long rally in stocks could end violently. One way to deal with this is to try to take a cosmic view, as I suggested in a recent column, ignoring the market’s ups and downs entirely and remaining a consistent investor for a horizon that lasts decades. That can be accomplished by allocating your portfolio appropriately between stocks and bonds, depending on age and tolerance for risk, perhaps using diversified,   mutual funds or   funds, in which professional managers do the work for you, merely by tracking broad indexes or by picking a variety of individual securities. If you don’t need the money for a long while and are able to retain your equanimity in a protracted crisis, you may be able to avoid paying attention to the stock and bond markets. But even if you’re a very   investor, it’s smart to take inventory. If, for example, you will need a chunk of your portfolio for a down payment on a house or to pay a tuition bill or to replace a roof or buy a car, you may want to liquidate some of it now, congratulating yourself on your gains. In addition, even if you don’t need to use the money, selling securities that have incurred losses may be a good move, Mr. Birinyi said. Losses will offset gains when it’s time to pay your taxes, and many investors these days are fortunate in having plenty of gains. In any case, it is surely wise to make sure, after a remarkable run in the stock market, that you will be able to handle a sharp downturn when it eventually comes. Personally, I’ve salted away my savings in broad stock and bond indexes with money that I don’t expect to need for years, and I’m careful to limit my own stock allocation. I don’t ignore the market. I examine it daily, and if I become convinced that it is shaky, I will reduce my own holdings  —   and say so  —   but haven’t taken much off the table lately. We all have to live with our own choices. I’m choosing to celebrate but also to be very careful.'"}, "time": 1742561664.978201}