{"duration": 0.0861504077911377, "input_args": {"text": "'by Jon Rappoport, Activist Post : \\n“If Donald Trump can help her [Hillary] heal, then perhaps that’s a good thing to do.” —Kellyanne Conway, former Trump campaign manager \\nDonald Trump achieved two great things in his presidential campaign: he stopped Hillary Clinton from occupying the White House, and he ran against the media by attacking them mercilessly. \\nEverything else is up for grabs. We will see. \\nAlready, he has made some “errors.” The appointment of Mike Pompeo as CIA director is a bad move. Pompeo, as a congressman, introduced the Dark Act, which now prevents the states from requiring GMO labels on food. And he favors the death sentence for Edward Snowden. \\nMultiple media outlets are reporting that Trump will not attempt to prosecute Hillary Clinton. This is on the level of lowering the window shades for a vampire as dawn breaks. Hillary was certainly guilty in the email case, and the Clinton Foundation is a pay-for-play money laundering operation of global proportions—a private and parallel State Department, in which cash is the only standard for “diplomacy.” And these charges are mere low-hanging fruit on the Clinton crime family tree. \\nPursuing justice is supposed to be a Trump hallmark. \\nPolitics in the Matrix is a tap dance and a shuffle. Deals and compromises are made all the way along the line. Washington and its media allies suck their very life juices from those deals. Like some fungus, they thrive in the dark every-day corruption of This traded for That. In many ways, Trump exclaimed he was above the game. The deals he was going to make would all be on the side of benefiting America—so he has a price to pay for asserting he was most definitely a different character on the political scene. \\nThat unbridled assertion was what drove huge numbers of people to show up at his rallies all over the country. They wanted an outsider who had a serious ax to grind with Washington and the media. They wanted him to be angry and outraged—because they were, too. They didn’t want a great healer, because justice comes before healing. \\nMany of them had felt the effects of Globalism and its grotesque trade treaties. They were out of work, and he was going to bring back jobs. But that wasn’t their only motivation. They knew their jobs had been stolen by anti-American elites, and they wanted the sword of justice to fall on those elites. They knew Hillary Clinton was an arch-Globalist. \\nFor these millions of Trump supporters, forgiving and forgetting and moving on isn’t presidential. It smells bad. They were never part of the glazed-over New Age crowd, and they aren’t now. The cheese-glob “coming together” isn’t in their lexicon. They don’t view anger as a character defect or a “compensatory” response that traces back into early childhood. They want bad people to pay for their crimes. \\nHillary Clinton would be at the top of their list. Helping her heal is a sick joke. They want her in prison where she belongs. They know her constant vapid calls for “national unity” during the campaign were a straight-out con, a cover for her lust for power. \\nThey see nothing redeeming about her. It’s simple: she fights the good and embraces evil. Therefore, she should be punished. \\nDoing so would set an example and a course for the Trump administration: we don’t back away, we don’t back down. We aren’t separating “campaign talk” from presidential action. We’re not trying to make that phony distinction. \\nIf Trump prosecuted Hillary to the full extent of the law, then of course the owls would come out hooting: he’s vengeful; he can’t let go; he’s mean; he’s spiteful; he’s a cruel sadist; this goes beyond any civilized sense of propriety befitting a real leader. \\nYes? And? So? \\nSo what? \\nIs Trump the same man now that he was when he was campaigning? \\nEven asking that question seems naïve, because of course we know all politicians rearrange themselves after they win a victory. But Trump portrayed himself as very, very different. He stood on that difference. He celebrated it. He reveled in it. He took great pleasure in it. \\nNow, he has to pay the price. \\nHis supporters don’t want to hear some garbled nonsense about how prosecuting Hillary would create a giant distraction from the job of leading the country. Trump’s whole campaign was a distraction from politics as usual. That’s what gave him strength. \\nProsecuting Hillary Clinton now would be counter-intuitive and outrageous, and therefore it would be the most Trumpian thing Trump could do. \\nIt would give him more support from his millions of people. \\nAnd it would be right and correct and it would deliver justice where justice has been needed for a very long time. \\nAnd when the whole host of sordid details about Hillary’s crimes came spilling out into the light, people who pride themselves on being in the camp of the “beautiful and virtuous” would realize who they have been defending. \\nIt would provide a valuable lesson, and the price of admittance to that show would trump the decades of waiting America has endured in the case of The People vs. Hillary Clinton. \\nThis case has now been canceled. \\nDonald Trump achieved two great things in his presidential campaign: he stopped Hillary Clinton from occupying the White House, and he ran against the media by attacking them mercilessly. Failing to prosecute Hillary is not a great thing. It is a very bad thing.'"}, "time": 1742561985.9678493}