{"duration": 0.1389906406402588, "input_args": {"text": "'Good morning.  We’re trying something new for our readers in Asia and Australia: a morning briefing to   your day.  What do you like? What do you want to see here? Email us with your feedback at asiabriefing@nytimes. com. Here’s what you need to know: • The surprise election of Donald J. Trump, a real estate    television star with no government experience, upended the political order in the United States and around the world. Global markets stabilized after an initial plunge. But uncertainty over Mr. Trump’s agenda, his embrace of the kind of white populism rising in Europe, and his distrust of trade pacts and climate change, raised international concerns. _____ • Mr. Trump marshaled   white and   voters disaffected by globalization and multiculturalism, waging a campaign that traded in derision and attacked the legitimacy of the political process. Both Hillary Clinton and President Obama were stung by the voters’ repudiation, but reinforced the importance of a peaceful, orderly transition of power. Mrs. Clinton, who said the loss was “painful, and it will be for a long time,” also insisted that the nation owed Mr. Trump “an open mind and a chance to lead. ” _____ • One party, the Republicans, will now control the White House and both houses of Congress, setting the stage for sweeping policy changes. The stunning outcome was unforeseen, undercutting the credibility of much of the American news media. Like the “Brexit” referendum, much of the polling, analysis and prominent coverage failed to capture the level of popular fury or foresee the coming revolt against the interests of what the British politician Nigel Farage derided as “big business and big politics. ” _____ • Both Russia and China have portrayed the tumultuous American election as a validation of their own authoritarian approaches. Vladimir V. Putin expressed hope for a “constructive dialogue” with Mr. Trump, whose lack of foreign policy experience and friendly positions toward Russia could play into the Kremlin’s hands. Asia greeted the election cautiously. China sent a short congratulatory note, but made no mention of Mr. Trump’s campaign promises to confront it on trade and currency issues. Shinzo Abe, Japan’s prime minister, could meet with the   as early as next week. • Newspapers across the globe scrambled to create front pages that conveyed the stunning upset. [The New York Times] • If Mr. Trump scraps the   Trade Partnership, a proper counterweight to China’s expansion may never emerge. [The Straits Times] • Asian analysts fear that Mr. Trump will overhaul bilateral defense pacts with Japan, South Korea, the Philippines and Australia. [Nikkei Asian Review] • Mr. Trump has said he will “end forever” the use of the   visa that is employed by American companies to hire skilled workers from India and other countries. [Times of India] • Weeks before the election, President Rodrigo Duterte named Mr. Trump’s business partner in Manila as a special envoy to the United States. [The New York Times] • Silicon Valley’s reaction to Mr. Trump’s victory was beyond grim. “We didn’t do enough,” said one tech leader. [The New York Times] •  California and Massachusetts legalized recreational marijuana use, reflecting a national shift in attitudes toward the drug. [The New York Times] • The one American institution that predicted Mr. Trump’s presidency: “The Simpsons. ” [Entertainment Weekly] • The markets have recovered from a wild ride, with stocks trading higher in the U. S. and in early trading in Asia. Gold pared earlier gains. Here’s a snapshot of global markets. • The Mexican peso took a beating, dropping more than 12 percent against the dollar before recovering to 8 percent. • In other news, Prime Minister Narendra Modi of India arrives in Japan today for a   visit during which the two countries may complete negotiations on a nuclear energy deal. • Disney reports quarterly results today, which could offer a look into the performance of the massive new resort it opened in Shanghai this year. • In Hong Kong, highly competitive “cramming centers” for exam preparations are turning their tutors into celebrities, plastering their faces on buses and billboards. • Sharbat Gula, the   Afghan who appeared as a girl on a National Geographic cover, was welcomed home by Afghanistan’s president after Pakistan deported her. She has come to symbolize the plight of hundreds of thousands of Afghan refugees and migrants being forced to return. • President Xi Jinping’s attitudes toward law and sovereignty were apparent in China’s decision to target two   politicians in Hong Kong who used the term “ ” in taking their oaths of office. • At least seven people died and dozens were injured when a tram derailed south of London. The cause was unclear, but the driver was arrested. • Roughly 50, 000 years ago, the Neanderthals and modern humans encountered one another and interbred. So why didn’t a   hybrid prevail? Two new studies focus on this question and find that a principle of population genetics applies: In small populations, natural selection is less effective. We recently told you how autumn  —   or is it fall?  —   got its identity crisis. But what about summer, spring and winter? Where do their names come from? Etymologists link “winter” to the    word wed, meaning “water. ” That gave way to the old German wintar, or “the wet season. ” Water also leads us to the source of spring’s name. In this case, the word was a verb before it was a noun. In the Middle Ages, “sprinc” was German for “leap” and it came to mean “source of water. ” Eventually “springing time” replaced the Old English “lent,” which had signified the entire spring season, not just the period from Ash Wednesday to Easter. It shrank down to “springtime,” then “spring. ” And while autumn now has two names, summer may originally have had none at all. Thousands of years ago, early   cultures are thought to have divided the year into just three seasons. At some point, the Sanskrit “sáma,” or “season,” appears to have traveled north from the Indian subcontinent  —   a place that knows a thing or two about sweltering months  —   and became summer. P. S.: The storied firearm we told you about in our Back Story on Wednesday  —   an 18th century musket made for the Qianlong emperor  —   was sold by the Sotheby’s auction house to a private collector for more than $2. 4 million. Giovanni Russonello contributed reporting. _____ Photographs may appear out of order for some readers. Viewing this version of the briefing should help.  Your Morning Briefing is published weekday mornings. What would you like to see here? Contact us at asiabriefing@nytimes. com.'"}, "time": 1742564394.5490193}