{"duration": 0.10112428665161133, "input_args": {"text": "'Through nearly five seasons of “Veep,” we’ve seen Selina Meyer suffer embarrassments galore and absorb loss after loss, to the point that some may wonder how anyone so   and ineffectual ever wound up in the Oval Office. This week’s episode answers that question: It’s because Selina can be vicious. “Veep” can rarely be called triumphant, but toward the end of this episode, when a dazzlingly attired President Meyer is demolishing her enemies with devastating words and a killer smile   …     well, for a few moments she actually is the most powerful person in the free world. She’s stunning, in every sense of the word. Selina’s ballroom blitz is especially satisfying given that “Congressional Ball” lines it up alongside the spectacular flameout of congressional candidate Jonah Ryan. Most of this episode cuts between the annual White House nondenominational holiday party and a typical New Hampshire campaign stop for Jonah, where his quick temper results in a possible   blunder. Riding high in the polls after essentially making “Jonah Ryan: He’ll Yell at Women for You” into his slogan, the hulking   lashes out at his old bully Teddy Sykes, not realizing that his opponents have angled their camera phones to make it look like he’s hollering insults at a bowling alley employee with Down syndrome. Without making too big of a deal about it, this episode delivers a cogent point about using rage as a political weapon. In Selina’s experienced hands, anger is a live grenade. The difference between her and the wannabes is that she knows when and where to throw it. Once again, kudos go to the “Veep” writers who came up with the idea to have Jonah run for Congress. Nothing in “Congressional Ball” measures up to last week’s brilliant campaign ad  —   with Jonah chasing a child around a playground in super creepy slow motion  —   but even before his alley accident, this episode spins a lot of gold from his   stump speeches, each ending with an instrumental version of “I Won’t Back Down. ” (According to Richard Splett, they’ve been getting increasingly angry letters from Tom Petty. But, hey, who hasn’t?) The highlight of the Jonah half of this episode  —   aside from the little Howard Dean scream he gives at the end of the list of New Hampshire towns he hopes to win  —   comes early, in his mock debate with Richard. Dan Egan and uncle Jeff try to keep Jonah from relying too much on his trademark “zingers,” like when he answers a question about the debt ceiling by quoting “the late Lionel Richie” (who’s not actually dead). The   Mr. Ryan responds by saying it’s not fair that Richard “gets to be the easier person, and I have to be me. ” So yes, it’s fun to see Jonah get knocked down hard yet again at the end of this episode, even if its at the hands of political operatives as odious as Teddy and Bill Ericsson. On the flip side, in classic “Veep” style, multiple characters get comeuppances they don’t deserve. Poor Mike McLintock drops awkward hockey metaphors into his news conferences, in hopes of schmoozing his way into a gig as a director of communications with the N. H. L.  —   thus escaping the toxic White House atmosphere before he and his wife start their family. Instead, he finds out at the ball that a former Meyer administration scapegoat has already landed the job. Meanwhile, when Gary’s unexpectedly included on the list of Washington’s “50 Hottest Staffers” (at No. 21!) he lords it over his colleagues, only to find out later that the publication confused him with another Gary. As viewers, is the abject humiliation of two basically decent guys mitigated by Selina’s success? That’s always the question with “Veep. ” Make no mistake: Selina is not a good person, something we again see in the way she treats her daughter, Catherine: first by asking if she’s planning to be “Ellen or Jodie Foster” in her level of openness about her new lesbian relationship, then by constantly insulting her hair at the ball. (Nothing better encapsulates Selina’s casual cruelty to Catherine than the way she criticizes her daughter’s loose hair “tentacles” in one scene, and after the strands are secured, gripes, “Except it’s still just a rat’s nest in the back. ”) The brilliance of “Veep,” though, rests in how it elicits sympathy for Selina simply by showing what she has to deal with every day. In “Congressional Ball” she spends an evening sucking up to congressmen and congresswomen, who all make dopey demands in exchange for their support in the tiebreaking presidential vote. She promises the same cabinet appointments to multiple people, and has to nod approvingly when one Montanan makes his pitch for a Sept. 11 memorial in Bozeman (to salute the local first responders who were traumatized by what happened to the first responders in New York). And while she’s   this bunch, she’s always keeping one eye on Tom James, her presumptive vice president who’s also working the room, trying to get those backing Selina to abstain from the vote. His plan is to manipulate the House vote into another tie, which would throw the election to the Senate, where procedural arcana could catapult him to the presidency. That’s what sets up the episode’s thrilling bit of political jujitsu as Selina sidles up to each of her backstabbers one by one, letting them know just how badly she could hurt them if they disappoint her. She saves her most savage takedown for Tom, whom she literally dances with in front of the news media while quietly whispering in his ear all the dirt she has. Then she takes him back to her office, yells at him some more and has sex with him. The speed, fury and totality of Selina’s power move is a joy to watch, even though  —   if we’re being honest  —   Tom would probably make a better president. This series toys with our sympathies in that way, pushing us to root for the undeserving and all because when the narrative of politics gets reduced to a horse race, we can’t help but cheer a win. A lot has been written about what “Veep” has to say about the destructiveness and pettiness of American governance. But in episodes like this one, the show is just as revealing about our basest instincts as voters.'"}, "time": 1742561680.723526}