{"duration": 0.09191250801086426, "input_args": {"text": "'posted by Eddie “…Out of the middle of its division, a burning torch sprang, throwing out a long way, flames, coals, and sparks. As well, the moon’s body which was lower, twisted as though anxious, and in the words of those who told me and had seen it with their own eyes, the moon palpitated like a pummelled snake. After this, it returned to its proper state…” The moon is without a doubt, one of the most enigmatic objects in the sky. Thousands of years ago, ancient civilizations observed the sky, watching in awe Earth’s faithful companion. Since time immemorial, the moon has also been the subject of numerous myths and conspiracy theories. All kinds of strange ‘things’ are connected t. Interestingly, in 1178, a group of monks from Canterbury observed how the moon ‘suddenly exploded’ into ‘sparks’, taking a ‘blackish appearance’. If we look history history, we will realize that man times have astronomical events been mistaken for supernatural signs. In ancient times, these events were considered omens, and from time to time, strange lights observed in the sky were interpreted as evil signs. Mysteriously, on June 18th of 1178, monks in Canterbury observed a fascinating sighting. As they looked up to the sky, they witnessed a fascinating event which they described accordingly: “…This year on the Sunday before the Feast of Saint John the Baptist, after sunset when the moon was first seen, a marvelous sign was seen by five or more men sitting facing it. Now, there was a clear new moon, as was usual at that phase, its horns extended to the east, and behold suddenly the upper horn was divided in two. Out of the middle of its division, a burning torch sprang, throwing out a long way, flames, coals, and sparks. As well, the moon’s body which was lower, twisted as though anxious, and in the words of those who told me and had seen it with their own eyes, the moon palpitated like a pummelled snake. After this, it returned to its proper state…” So what did they observe in 1178? Did the moon really blow up? According to researchers, they didn’t actually witness the moon exploding, but they observed a massive impact of a large body that smashed into the moon, forming what we today know is the Giordano Bruno crater. However, there are others who disagree saying that an impact od such magnitude would have sent towards Earth debris that would have resulted in sightings observed by more people on Earth, and not just a few monks. However, studies have shown that the impact would have launched 10 million tons of ejecta into the Earth’s atmosphere in the following weeks. According to a report from NASA , such an impact would have triggered a blizzard-like, week-long meteor storm on Earth –yet there are no accounts of such a storm in any known historical record, including the European, Chinese, Arabic, Japanese and Korean astronomical archives. Withers reported his analysis and other tests of the hypothesis in this month’s issue of Meteoritics and Planetary Science . According to many, if we want to explain what the monks saw from a scientific perspective, then the most plausible explanation is that the monks probably witnessed a massive meteor blow up in the atmosphere. From the monk’s observational point –and only from there— It would have looked as if the moon had exploded, while people from elsewhere would have spotted the phenomenon but only as a bright shooting star. “I calculate that this would cause a week-long meteor storm comparable to the peak of the 1966 Leonids,” he said. Ten million tons of rock showering the entire Earth as pieces of ejecta about a centimeter across (inch-sized fragments) for a week is equivalent to 50,000 meteors each hour. And they would be very bright, very easy to see, at magnitude 1 or magnitude 2. It would have been a spectacular sight to see! Everyone around the world would have had the opportunity to see the best fireworks show in history.” “I think they happened to be at the right place at the right time to look up in the sky and see a meteor that was directly in front of the moon, coming straight towards them.” “That would explain why only five people are recorded to have seen it. Imagine being in Canterbury on that June evening and seeing the moon convulse and spray hot, molten rock into space.” “The memories of it would live with you for the rest of your life.” Source:'"}, "time": 1742562234.0789914}