{"duration": 0.050194501876831055, "input_args": {"text": "'Tuesday 22 November 2016 by Neil Tollfree Woman faces jail for dismal selection of office birthday cakes \\nAn Essex woman is facing prison for providing a dismal selection of cakes for the office to celebrate her birthday. \\nThe incident took place at the offices of Hadley and Kemp Solutions in Hatfield Peveral yesterday. It was Eileen Plankton’s birthday and anticipation was high as she entered the office with several Marks and Spencer bags. \\n“Oh yeah, everyone was really impressed,” said a colleague who wished to remain anonymous. \\n“I mean – Markses; I thought we were in for a real treat. They do a lovely cream horn.” \\nAfter several hours of playfully tormenting her colleagues with amusing comments like ‘these bags? No, they’re just lunch. I’m a bit peckish today,’ Mrs Plankton finally sent the following email: \\n21 again, and if you believe that you’ll believe anything. Some sweet treats on Len’s desk (he’s off having his prolapse sorted, so he won’t mind). \\nHowever, excitement turned to disappointment as the true nature of the cakes became clear. \\n“Well, she might as well have just shat all over the desk,” continued Mrs Plankton’s colleague. \\n“They weren’t Markses cakes at all, she’d just reused the bags. There was a box of Poundstretcher’s broken biscuits, some cheap cheese straws and six boxes of Value jam tarts. \\n“I mean, I didn’t know what to do with myself. This horrible silence descended as everyone saw what she’d done. \\n“I just ate nine jam tarts without looking at her and walked off not even bothering to say ‘Thank you’.” \\nShortly afterwards the police were called, Mrs Plankton was arrested and she is expected to be sentenced to between 18-24 months for her crimes. Get the best NewsThump stories in your mailbox every Friday, for FREE! There are currently '"}, "time": 1742564487.6637304}