{"duration": 0.1123361587524414, "input_args": {"text": "'Email \\nMidday last Thursday, the price of crude oil for delivery in December touched $50, and it’s been all downhill since then. At noon on Wednesday crude oil futures touched $45 a barrel on news that inventories soared last week by the most in 34 years. \\nThe market wasn’t expecting that. It was bad enough that the American Petroleum Institute (API) reported a supply increase nine times greater than analysts and observers were expecting last week. Those market seers were betting on an increase of a million barrels. Instead the API reported the increase was 9.3 million — a miss of gigantic proportions. \\nOn Wednesday, however, the Energy Information Administration (EIA) reported that the API’s estimate was far too low: Inventories last week jumped by 14.4 million barrels, forcing one of those observers, Bob Yawger, director of the futures division of Mizuho Securities USA, to exclaim: “You could easily make the argument that [the EIA report is] the most bearish ... of all time.” He added, “There’s nothing to support the market.” \\nThe futures market is driven by expectations. Ever since OPEC promised in September that it would have a working plan in place by November to cut production in order to “balance” the market, crude oil futures have slowly inched up. The market managed to resist the temptation to sell off on news that the rig count in the United States was increasing, that the majors were increasing their capital expenditures for 2017, and that DUCs (wells developed but not completed) were coming into production. \\nWhat it couldn’t do was shrug off the news that Goldman Sachs, in a private memo to its customers (and revealed to Irina Slav at OilPrice.com), suggests that oil is headed for $40 a barrel: \"The lack of progress on implementing production quotas and the growing discord between OPEC producers suggests a declining probability of reaching a deal on November 30.\" \\nThis is the same company that “suggested” that oil could drop into the 20s late last year, which it did, touching $26 a barrel in February before rebounding. \\nOn top of that was the distressing news — at least to those banking on higher prices and betting on that outcome — that U.S. refiners are operating at only 85 percent of capacity, especially at a time when increased demands over the holidays would usually drive prices higher. \\nAdd to that the news that OPEC members, while meeting privately to hammer together some sort of deal to cut — or at least freeze — production, are increasing production at the same time. Iran is exempted from any participation in the proposed cuts, and is raising its production back to pre-sanction levels as quickly as it can; Iraq is demanding the same exemption as Iran, claiming that it needs increased revenues to fight ISIS; Russia is going its own way as it isn’t a member of the cartel; and Libya and Nigeria are merrily ignoring the charade, adding another 800,000 barrels to global supply last month. \\nThe so-called “balance” of the oil markets between supply and demand is many months off, while the futures market is likely to continue its breathtaking selloff to $40 and perhaps even lower. \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. . Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there.'"}, "time": 1742561981.2715652}