{"duration": 1.2458665370941162, "input_args": {"text": "'Email \\nThe boat, along with other means of travel, are often undertaken as matters of freedom. Movement keeps one alive in times of peace, and in conflict. The Australian government, and those backing its practices, have wished over the years to limit, if not halt such movement altogether. \\nSince the last decade, extreme measures have been implemented that effectively qualify Australian sovereignty while singling out a particular breed of asylum seeker. The former aspect of that policy was specifically undertaken to excise the entire mainland from being qualified as territorially valid to arrive in. \\nThe entire policy effectively assumed a military character, most conspicuously under the Abbott government’s embrace of a creepily crypto-fascist border protection force, equipped with uniforms and patriotic purpose. Operation Sovereign Borders effectively meant that the refugee and asylum seeker were fair game – not to be processed and settled equitably with a minimum of fuss, but to be repelled, their boats towed back to Indonesia, and people smugglers bribed. \\nAn entire intelligence-security complex has also been created, fed by private contractors and held in place by the promise of a two-year prison sentence for entrusted officials in possession of “protected” information. \\nSuch statements as those made today by Prime Minister Turnbull, announced with note of grave urgency at a press conference, tend to resemble a typical pattern in Australian politics since the Howard years. \\nThe borders, even if supposedly secure, are deemed to be in a permanent state of siege, forever battered by potential invaders keen to swindle Parliament and the Australian people. Yes, boasted the Abbott, and now Turnbull government, the boats laden with desperate human cargo have stopped coming. Yes, all is well on the sea lanes in terms of repelling such unwanted arrivals. But for all of this, the island continent is being assaulted by characters of will, those keen to avail themselves of desperate people and their desire for a secure, safe haven. \\nThe policy has also received international attention from such establishment institutions as The New York Times. “While that arrangement,” went an editorial this month, “largely stopped the flow of boats packed with people that set off from Indonesia weekly, it has landed these refugees – many from Iran, Myanmar, Iraq and Afghanistan – in what amounts to cruel and indefinite detention.” \\nAs the editorial continued to observe, “This policy costs Australian taxpayers a staggering $US419,000 per detainee a year and has made a nation that has historically welcomed immigrants a violator of international law.” \\nWhile this obscenity has been powdered and perfumed as humanitarian, designed to halt the spate of drowning cases at sea, the latest announcements have abandoned the stance. “They must know,” claimed Prime Minister Malcolm Turnbull, “that the door to Australia is closed to those who seek to come here by boat with a people smuggler.” \\nFinally, an honest statement twinning two perceived demons in Australian refugee policy: the people smuggler and the asylum seeker, both equivalently horrible to Australian authorities. To that end, not a single asylum seeker arriving by boat will be permitted to settle in Australia. This policy will also affect arrivals from July 2013. \\nSuch a stance of finality seems little different to pervious ones made by Abbott’s predecessor, Kevin Rudd. What is troubling about it is the element of monomania: never will any asylum seeker, who had arrived after a certain date, will be permitted to settle in Australia. \\nThe intention there is to make sure that those designated refugees on Manus Island and Nauru, facilitated by Australia’s draconian offshore regime, will have the doors shut, effectively ensuring a more prolonged, torturous confinement. Absurdly, they will then be permitted to slum away indefinitely in such indigent places as Nauru, with a population hostile to those from the Middle East and Africa. \\nTurnbull’s stance may also suggest a degree of desperation. Not all has gone swimmingly with the offshore detention complex. The PNG Supreme Court rendered an aspect of the Australian refugee policy redundant in finding that detaining individuals indefinitely on Manus Island breached constitutional rights. \\nPeter Dutton, the hapless Minister for Immigration, has struggled in managing what can only be described by the border security obsessives as an administrative disaster. Rather than admitting to the realities that searching for refuge over dangerous routes will always find a market, the Australian government persists in a cruel delusion that continues to deny international refugee law while punishing the victims.'"}, "time": 1742563238.1665723}