{"duration": 0.3479270935058594, "input_args": {"text": "'Michelle Wallace kisses her baby. Photo source: Love Eva Rose Facebook page . \\nby Health Impact News/MedicalKidnap.com Staff \\nA couple in West Texas was devastated when they were accused of abusing their 6 week old daughter. Michelle and Elliot Wallace began seeking answers after the explanations given by doctors placed the blame on the parents and landed their baby in foster care. They have since learned that baby Eva sustained injuries at birth, injuries which are known complications of the kind of difficult birth that their baby had. These injuries were overlooked at the time of her birth, but are now the very injuries that doctors are claiming are caused by Shaken Baby Syndrome. \\nHere is their story: \\nOn Jan 29, 2016, Michelle came home from the grocery store when Elliot met her at the door with their six-week-old daughter Eva, who was crying—a high-pitched, wailing type of cry. Her eyelids were fluttering, and her eyes were pointed left and upward, not focusing on anything. \\nSuddenly, Eva’s body went limp, and she passed out. \\nWhen they placed Eva on the bed to examine her, she woke up crying but quickly passed out. While lying there, the baby woke up crying, and passed out again. The couple loaded Eva in the car and took her to the Shannon Medical Center emergency room in San Angelo, Texas. \\nThe hospital staff ran tests, took x-rays, and did a CT scan. While waiting for the results, Michelle fed Eva a bottle. But, Eva could not keep it down. She projectile vomited. \\nThe hospital staff began a round of antibiotics, which is standard protocol in an infant presenting with a fever. Also, a CT scan showed she had a blood clot in her brain. The hospital staff determined that Eva needed a specialist, so they airlifted her and Michelle to Cook’s Children’s Medical Center in Fort Worth. Elliot drove the 4 and 1/2 hours to join them. Hospital Staff Stopped Looking for Cause of Injuries \\nThat night Eva suffered from intermittent fevers. A lumbar puncture was done to check for meningitis. However, it failed—no fluid was drawn. The staff said that they would hydrate Eva for up to 24 hours and try again. However, when Michelle inquired about it later, she was told that they were not going to try the lumbar puncture again because they had ruled out meningitis as the cause of Eva’s injuries. \\nAfterwards, an MRI was done which showed a ligament injury to her upper neck. The staff believed that it was also a result of abuse. \\nReportedly, the consensus among hospital staff was that Eva’s injuries were trauma-related, and they stopped looking for other causes. \\nWhile waiting on the neurologist, Eva had another seizure and was moved to the intensive care unit. There, she was sedated and given anti-seizure medication. Throughout the night Michelle never left Eva’s side, and she looked on as Eva was inundated with hospital staff handling her. \\nDuring the night, a CPS worker approached Michelle and pointed at a light-colored bruise on Eva’s cheekbone that Michelle had not seen before. Michelle’s thoughts went immediately to the hospital staff checking on the thrush in Eva’s mouth, and that their fingers were placed in the exact location of the bruise on Eva’s cheekbone. Michelle wondered if the bruise had come from the hospital staff handling her face. \\nWhile the family awaited Eva’s diagnosis, Child Protective Services (CPS) separated everyone present, including their guests, and interrogated them. Then they asked for information to run background tests, as well as names of people with whom they could place Eva. Michelle approached a CPS worker, saying that this was premature and uncalled for, since they had yet to receive a diagnosis. But, Michelle said that she was told that this was to get “ahead of the game.” Michelle holding baby Eva. Photo source: Wallace family. \\nMichelle requested a conference with the Child Advocacy Resources and Evaluation (CARE) team to ask questions. In the meeting, Neurologist Dr. Adrian Lacy said the staff would look at the birth records the following day. He said that Eva had “bilateral subdurals, areas of stroke, bruising on her head, [and] retinal hemorrhaging,” but that the skeletal survey showed no broken bones. He informed them that the ophthalmology department said that the bruising was “consistent with shaken baby or child abuse.” \\nHe said that Eva had multiple bleeds of different ages in her brain, alleging that Eva had been abused repeatedly over time. \\nMichelle asked if Eva’s injuries could have been caused by vacuum extraction delivery. Dr. Lacy said, “Talking to neurosurgery [department]…they don’t believe that it’s from any kind of vacuum delivery.” He said that this is because “retinal hemorrhages” could not possibly be result of vacuum extraction. Dr. Lacy went on to say that Eva had undergone “a significant trauma.” \\nHis assertion is contradicted in the medical literature regarding vacuum extraction. Many medical journals and medical resources mention that retinal hemorrhaging is a known complication of birth via vacuum extraction. An article in Reviews in Obstetrics & Gynecology lists retinal hemorrhaging in the list of neonatal complications: \\nVacuum-assisted vaginal deliveries can cause significant fetal morbidity, including scalp lacerations, cephalohematomas, subgaleal hematomas, intracranial hemorrhage, facial nerve palsies, hyperbilirubinemia, and retinal hemorrhage. \\nAs Michelle pondered the possible events that could have occurred to cause Eva’s injuries, Dr. Lacy interjected, “These are things that are severe enough [that] you would have told me. You know, [like] she was in a bad car wreck.” He went on to say that, the children who come to the hospital emergency room who were in car wrecks “don’t have the degree of retinal hemorrhages” that Eva had. He and the hospital staff suspected that Eva had been repeatedly shaken. Michelle said that they equated it with “the force equivalent to being in a car crash at 40 mph.” \\nDr. Lacy concluded, “There’s nothing in the story, as far as the history, her history, that explains the history that we see.” He said that there was no other explanation but Shaken Baby Syndrome. \\nNot long after that, Cook’s Children’s Medical Center Child Abuse Specialist Dr. Sophia Grant said that Eva’s injuries must be non-accidental trauma. She said that she found the “classic Shaken Baby Syndrome triad.” The accusation of abuse came despite Michelle informing the hospital staff that Eva had been born via vacuum extraction. Further, reportedly, Dr. Grant expressed concern over the scratches on Eva’s face, and said that a child at six weeks old was not capable of inflicting them upon him or herself. \\nIt was at that point that the staff stopped looking for other causes, Michelle said. CPS arrived and served her and Elliot an order for emergency removal. The couple was then escorted out of the hospital by security guards. \\nAfterwards, Eva was discharged from the hospital wearing a c-collar. It left a large dent in the back of her head, and she had to wear a helmet for a couple of months to reshape her skull. \\nEva now suffers from dysphasia and is at risk of choking. She also only has 20% of her peripheral vision. Currently, Eva is in therapy and is walking and crawling. Eva still faces challenges today. Photo source: Wallace family. Difficult Birth \\nDuring pregnancy, Michelle experienced excessive fatigue, swelling, discomfort, nausea, etc., but she was told it was normal. Also, under doctor’s orders, Michelle received the Tdap and flu shots while pregnant. \\nOn December 13, 2015, the OB/GYN, reportedly “roughed up” her cervix in an attempt to bring on labor. Two days later, at 8:30 pm, Michelle was admitted to Shannon Medical Center Women and Children’s Labor and Delivery Unit with excessive bleeding. The next day, around 2:00 am her doctor administered Pitocin and an epidural. \\nDuring labor Michelle was shaking a lot, and Eva’s heartrate kept dropping. About ¾ of the way in, Michelle was given an oxygen mask and was told to keep it on because the baby was not getting enough oxygen. Eva’s medical records indicate that she had hypoxic ischemic encephalopathy, which meant that she was oxygen deprived. There was no mention of staff attempting to change the mother’s position in order to help facilitate oxygen flow to the baby. \\nAfter about eight hours, the placenta began detaching prematurely. She had a 30% placental abruption. The doctor opted for vacuum extraction instead of an emergency C-section. Eva was born at 7:00 am, after about eight hours of labor and 15 minutes of pushing, weighing 5 lbs. 11 oz. \\nBirth records indicate that Eva’s hands and feet were blue, and her coloring was gray. Eva’s pathology reports indicated infection, as well as inflammation of the fetal membranes and connective tissue of the umbilical cord. \\nPhotos taken after her birth indicate a red, bruised and molded head with vacuum marks. They also reveal swollen eyes with cuts on and above them, as well as bruising that started over her right eye. Also, at birth Eva received Hepatitis B and Vitamin K shots and erythromycin eye drops. Pattern of Medical Concerns \\nWhen Eva’s pediatrician, Dr. Elizabeth Young, came by during her rounds, Michelle mentioned that Eva slept poorly the night before. However, reportedly, Dr. Young dismissed it and said that “it was normal for a newborn to do that.” \\nMichelle attempted to breastfeed Eva for three days, but it was unsuccessful. As a result, Eva was put on formula. \\nAt Eva’s one-week checkup, everything seemed normal. Eva had been sleeping well, as well as feeding every two to three hours. That day she received the standard vaccines. Afterwards, Eva’s fussiness escalated. She had a lot of gas and was sleeping poorly. Eva with sunglasses during a visit. Photo source: Wallace family. \\nMichelle suspected an allergy to formula, so she changed brands—to one that was for sensitive digestive systems. However, it did not seem to make a difference. Eva began sleeping poorly and crying excessively, as if she was in pain. Even talking and soft noises were waking her. \\nMichelle called Medical Exchange Hotline and was told by the nurse that it sounded like constipation. The nurse advised Michelle to add a bit of Karo Syrup to her bottle and use glycerin suppositories when needed, and then follow-up with the doctor the next business day. \\nThe nurse’s suggestions helped some. Once Eva would have a bowel movement, she would settle down some. But, within few hours, she would begin crying again. She seemed to be in pain. Michelle also gave Eva gripe water, which sometimes brought some temporary relief. \\nAt the follow-up appointment with Dr. Young, Michelle was told to try putting Eva on soy formula with an extra ounce or two of water to help with constipation. The doctor also showed Michelle how to lay Eva down on her stomach to help ease gas pain. \\nThe soy formula helped for a few days, and then the colic-like symptoms returned “as bad as ever.” \\nAt Eva’s one month checkup, Michelle told the doctor that Eva was not sleeping and had inconsolable crying spells, severe constipation, and gas. Also, she told the doctor that she had seen Eva making “jerky, circular arm movements,” and that she had seen Eva’s chin quivering. When Michelle expressed concern, the doctor said that there was nothing to worry about. \\nEva was prescribed Zantac for possible acid reflux. The doctor sent them home with a sample of another formula that was hypoallergenic. After about five bottles of it, Michelle discontinued using it because it gave Eva “explosive diarrhea” and worsened her gas problem. \\nMichelle tried other formulas, in hopes that she would find one that agreed with Eva’s system, but the problems only worsened. Eva’s sleeping deteriorated, as well. Even the slightest sound would wake her, and she rarely slept for more than an hour at a time. \\nMichelle and Elliot continued giving Eva gas drops, gripe water, glycerin suppositories, and adding water to her formula. They tried giving her Zantac, but they could not get Eva to swallow it. Eva began spitting up with more frequency. \\nThe morning of January 29, 2016, Eva started getting very fussy and crying inconsolably. Michelle got her to settle down for a nap. But, within half an hour, she awoke. When Michelle went to pick her up, she noticed that Eva had two little scratches on her face, with a bruise behind each of them. She figured that Eva had scratched herself. \\nLater that day, Michelle went to the grocery store to get formula. She returned to find Elliot trying unsuccessfully to comfort Eva, and that’s when they saw her go limp with the strange cry and fluttering eyelids. Father Charged but Not Indicted \\nBecause Elliot was the last person to be around Eva when the symptoms occurred, he was arrested in April and charged with first degree felony assault on an infant with a $75,000 bond. Though he has been charged, there has been no indictment. A no-contact order has been issued against him. Elliot adores his daughter, but he can no longer see her. Photo source: Wallace family. \\nElliot has been out on bond. He would like to meet with his court-appointed attorney to make a plan to fight the charges and to challenge the no-contact order. However, since there is no indictment and no case file opened by the district attorney, his attorney will not meet with him. \\nMeanwhile, he is banned from seeing his daughter. Foster Care Placement Is Five Hours Away \\nWhen Eva was discharged from the hospital, she was placed with family friends, who live five hours away from her home. Michelle and Elliot have been trying to get Eva placed with blood relatives instead who live closer to them. It has been a difficult road for the Wallaces because of Eva’s special needs. Since coming off the anti-seizure medication, under doctor’s orders, the baby must have 24/7 care for a year. \\nBecause Eva’s placement is five hours away, and visitation must be supervised with a CPS staff, the only time available for visits has been during the week, when Michelle was working. She is only able to go once a month for a three hour supervised visit. Michelle has to abide by strict attendance guidelines by her employer. She would readily visit Eva more often if it were possible. Missing and missed by her parents. Photo source: Wallace family. \\nAdditionally, Michelle has had to be the breadwinner since Elliot’s ability to find work has been hindered by the criminal charges against him. He has been working as a contractor laying cable, and his last contract finished at the end of August. \\nAt their recent hearing, on November 2, 2016, the Wallaces were given a reprieve, and the judge removed the supervised visit requirement and approved visits with a caregiver. This was met with opposition from CPS. However, the Guardian ad Litem (GAL) and Court-Appointed Special Advocate (CASA) volunteers recommended it, stating that it was in the child’s best interests to have the opportunity to bond with her mother. This means that Michelle is not restricted to weekday visits and can be with Eva on her birthday and Christmas. CPS Seeks to Terminate Parental Rights \\nDespite the fact that Elliot and Michelle have faithfully worked their service plan, last July CPS notified the couple that they are seeking to terminate their parental rights. This is allegedly because they believe that Elliot is guilty. Additionally, the couple had agreed to separate, if it meant bringing Eva home to live with Michelle. However, CPS will not consider the option, since Michelle still believes that Elliot is innocent and that Eva has been misdiagnosed. \\nFurther, the Guardian ad Litem and CASA volunteer are parroting CPS’ recommendation of termination of parental rights because the “medical professionals” say that Eva was shaken. This is especially concerning to the Wallaces because neither the GAL nor the CASA volunteer has met with Elliot and Michelle to interview them or discuss their daughter. Medical Expert Says This is a Birth Injury \\nEva was born via vacuum extraction, which is the use of a cup that attaches to the baby’s head and creates suction. According to Healthline , the risks of vacuum extraction or vacuum-assisted delivery, “range from minor scalp injuries to more serious problems, such as bleeding in the skull.” It lists the following injuries: \\nhematoma, cephalohematoma, subgaleal hematoma, intracranial hemorrhage, retinal hemorrhage, and neonatal jaundice. \\nEva suffered from a retinal hemorrhage, something that Dr. Adrian Lacy said could not be a result of vacuum extraction. She also had intracranial hemorrhaging as well as a subgaleal hematoma. \\nAccording to Medical Child Abuse Investigator Anne Renk-Bernardo of Ohana Advocacy Center , who was obtained by the parents to look at this case: \\n“This is a birth injury case, plain and simple,” and “vacuum extraction could’ve easily caused the injury.” \\nShe said that the cup is required to be in a “very specific position,” and as a result, “any excessive or repetitive pressure” or incorrect position could easily cause injury to the infant. Michelle holding newborn Eva. Photo source: Wallace family. \\nRenk-Bernardo said that the Pitocin that Michelle was given caused the baby’s oxygen levels to drop, and then go back up again, making it difficult for the baby to regulate the oxygen going back into its system. She said that amount of Pitocin was “too much, too fast,” causing hyper stimulation. As a result, she said that it produces a “constant squeezing,” which can cause complications while the baby’s head is engaged in the birth canal using vacuum extraction. Additionally, medical records show that Eva experienced a couple of episodes of severe bradycardia, which is a slowing of the heartbeat caused by a deficiency of oxygen. \\nAnother contributing factor to the complications is the placental abruption. According to the Mayo Clinic : \\nPlacental abruption can deprive the baby of oxygen and nutrients and cause heavy bleeding in the mother. \\nWith regards to the scratches on Eva’s face, she said that Eva could have done that herself, and that they are “not significant enough” to warrant abuse. She said that Dr. Sofia Grant said in her affidavit that Eva had bruising on her forehead, two 0.5 cm bruises, and a small scratch, which were a result of abuse. \\nRenk-Bernardo said that Dr. Grant’s opinion was issued without reviewing Eva’s records. Further, she said that the bruising she is referring to is actually on Eva’s cheek. Further, she describes it as “superficial” and “over the fatty part” of her cheek, not on Eva’s head. She said that Eva, at the time, “was moving her extremities,” and that she could have easily scratched herself. \\nRenk-Bernardo said that the wide fluctuations in autonomic functions during labor and significant feeding intolerances correlate with those types of complications, indicating that she was in pain. Additionally, her eyes were swollen. \\nShe said that hematomas are not atypical with vacuum extraction, including progressive bleeds. It is possible that Eva had a bleed that could have been slowly bleeding since birth. She pointed out that Eva was irritable and had trouble feeding from birth, including choking episodes. Renk-Bernardo said that the choking episodes are a result of the hypoxia from the subdural hemorrhages and cerebral edema. \\nRenk-Bernardo believes that Eva’s ligament injury was probably a result of the vacuum extraction. She referred to the fact that the baby was “high up” in the pelvis and “never progressed” out of the birth canal. As a result, she said that the baby had to be forcefully pulled out. According to American Family Physician , this is a risk factor for complications while giving birth. \\nLastly, with regards to the multiple bleeds on Eva’s brain, Renk-Bernardo said that they are a result of “probably a bleed from birth that re-bled.” She pointed out that there are several things that can cause a re-bleed, such as choking, coughing, and illness. She said that vacuum extraction injuries can manifest up to three months after birth. If This is Abuse, “How Did They Shake the Baby?” \\nAfter examining Eva’s medical records, Renk-Bernardo said that the accusation of Shaken Baby Syndrome begs the question, “How did they shake the baby?” She pointed out that Eva had no fractures or bruising on the arms, chest, etc., that would be evidence of such abuse. She also said that, to her knowledge, there was no soft tissue damage. Further, Renk-Bernardo said that if there were blunt force trauma, then there would have been evidence, such as significant bruising. “Miniscule bruising is not from impact,” she said. \\nLastly, in her expert opinion, there is no evidence that Eva has been violently shaken. She pointed out that when the Wallaces took Eva to the emergency room, both the trauma and neurology department refused to admit Eva because they said that the cause of her injuries was not trauma-related. “Problems All Along, but Nobody Paid Attention” \\nAccording to Michelle, about a month after Eva’s release from the hospital, new bleeding was found in a follow-up MRI that the doctor ignored. Further, he did not relay the information to anyone, not even the foster mother. \\nFurther, nowhere in the medical records from Cook’s Children’s Medical Center does it say anything about a chronic bleed. However, during the CARE team meeting, Dr. Adrian Lacy told the family that Eva had multiple bleeds. \\nMichelle had expressed concerns since Eva’s birth, but they were dismissed. She said, “There had been problems all along, but nobody paid attention.” For instance, Eva was born with meconium in the amniotic fluid, which means that she is at risk for developing Meconium Aspiration Syndrome (MAS). MAS is associated with neonatal seizures and chronic seizure disorders. Renk-Bernardo said, “Normally, it’s a concern. But, they [medical professionals] didn’t seem concerned.” Further, Eva’s family history includes heart problems, bleeding and bruising disorders, as well as nephrotic syndrome, which involves seizures. \\nNow, Elliot and Michelle want to share their story to “help spread awareness of the plague of false allegations based on junk science that destroys innocent families.” Eva – her parents’ little Superhero. Photo source: Wallace family. \\nAt the November 2, 2016, hearing, the CPS attorney told the Wallaces that she had contacted the district attorney about Elliot’s criminal charges and that his case is to go before a grand jury in the next month or two. She went on to say that CPS had secured their own medical expert to testify against the Wallaces. Elliot and Michelle plan to request assistance from the court for securing their own medical expert testimony. \\nThere is a pretrial hearing on December 12, 2016, and a permanency hearing on February 15, 2017. There is a family court bench trial date set for March 23-24, 2017. However, the Wallaces are considering requesting a jury trial instead. If granted, it will take place in late April of 2017. How You Can Help \\nThere is a Facebook page set up for the family called Love Eva Rose where supporters can follow the Wallaces’ story and help. \\nSupporters are asked to contact legislators on behalf of the family. \\nTexas Governor Greg Abbott may be reached at (512) 463-2000 or contacted here . His Facebook page is here , and here is a link to his Twitter page. \\nThe Texas state representative for the Wallaces’ district is Rep. Drew Darby. He may be reached at (512) 463-0331, or contacted here . \\nThe US representative for the Wallaces’ district is Rep. Mike Conway. He may be reached at (325) 659-4010, or contacted here . \\nCharles Perry is the Senator for their district. He may be reached at (512) 463-0128, or contacted here . \\nCourts and judges across the U.S. are increasingly overturning Shaken Baby abuse convictions, as most of these cases do not present the science against “Shaken Baby Syndrome,” and the medical evidence that can support injuries apart from parental abuse. \\nComment on this article at MedicalKidnap.com. \\nSee:'"}, "time": 1742562219.2812726}