{"duration": 0.06512093544006348, "input_args": {"text": "'BUSTED: Clinton Foundation Directly Tied To Plot To Steal Election Posted on October 27, 2016 by Prissy Holly in Politics Share This \\nEver since early voting began, numerous reports are claiming that the electronic voting machines are rigged, as votes for Donald Trump are automatically switched to Hillary Clinton. We’ve all begun to suspect that Hillary is behind the scam, and now, we have further proof that Democrats are the ones tampering with these machines as part of their intricate plan to steal the election. \\nWe recently reported how Hillary’s evil billionaire funder George Soros owns the voting machines in 16 key states, which immediately set off warning bells nationwide. Disturbingly, the massive fraud taking place is not just confined to those 16 areas, as another crooked player in Hillary’s election-stealing plot has just been revealed. \\nIn a bombshell just unearthed by independent researcher Micro Spooky Leaks , A Canadian company by the name of Dominion Voting provides the voting machines to 600 jurisdictions in 22 states and is directly linked to the Clinton Foundation as one of their massive donors. \\nOn their homepage, the company alludes to how they help rig elections, stating “ we strive to change elections for the better!” which is a chilling statement considering they supply 50% of the electronic voting machines on the U.S. voting market. \\nRight after this startling information was revealed, however, it appears as though Democrats immediately began white-washing the information, as the link to the statement on the Wikipedia page that corroborated the bombshell information was mysteriously removed. \\nHillary has played dirty for years, and it appears as though her antics aren’t stopping now. After murdering many people close to exposing her scandals as a way to prevent them from ruining her presidential bid, the only thing left now is to steal the election through massive voter fraud. \\nThe picture at this point is becoming bleak. There’s no doubt that Donald Trump can defeat Hillary, as evidenced by his early lead in many historically blue states, and the recent bombshell that Hillary’s lead across many polls is completely fake. \\nHowever, fighting back against electronic voting machines that have been calibrated by Hillary operatives to switch votes from Republican to Democrat will be extremely difficult. The only thing we can do at this point is demand a paper ballot when we vote. Dominion Voting machines that will be used in 22 states \\nWe are coming down to the wire here. Every day, more information surfaces on Hillary and the Democrats’ crooked scheme to steal the election. Continue to share stories like this and help fight back and spread the information. \\nKnowledge is power, and with the ability to instantly share information with the internet, we can help expose what’s going on by constantly barraging our clueless friends and family members with the truth.'"}, "time": 1742562208.3544245}