{"duration": 0.1534733772277832, "input_args": {"text": "'For more information and media requests , please contact Mr. Thibaut Guillet (+41 22 917 9674 / ) or write to For media inquiries related to other UN independent experts: Xabier Celaya, UN Human Rights – Media Unit (+ 41 22 917 9383 / ) — U.N. Rights Expert Urges Nations Not to Sign ‘Flawed’ CETA Treaty GENEVA (28 October 2016) – The trade deal set to be signed by the European Union and Canada is a corporate-driven, fundamentally flawed treaty which should not be signed or ratified without a referendum in each country concerned, a United Nations human rights expert says. Alfred de Zayas, the UN Independent Expert on the promotion of a democratic and equitable international order, deplored the pressures brought on the Belgian regional parliament of Wallonia, which initially said it would not approve the treaty but later said its concerns had been met. “A culture of bullying and intimidation becomes apparent when it comes to trade agreements that currently get priority over human rights,” the expert said. In his reports to the Human Rights Council and General Assembly Mr. de Zayas has previously warned that CETA is incompatible with the rule of law, democracy and human rights, and substantiated how and why before the Parliamentary Assembly of the Council of Europe. He believes that both CETA and TTIP – the Trans-Atlantic Trade and Investment Partnership currently being negotiated by the EU and the US – give undue power to corporations at the expense of national governments and human rights, and deplores that the mere existence of investor-state dispute settlement generates a regulatory chill. “The danger of CETA and TTIP being signed and one day entering into force is so serious that every stakeholder, especially parliamentarians from EU Member States, should now be given the opportunity to articulate the pros and cons. The corporate-driven agenda gravely endangers labour, health and other social legislation, and there is no justification to fast-track it” Mr. de Zayas said. “Civil society should demand referendums on the approval of CETA or any other such mega-treaty that has been negotiated behind closed doors,” he noted. The expert said the EU should have heeded expert warnings and strong civil society opposition to CETA. His specific concerns include provisions which he says could hamper States’ regulatory powers and could allow investment companies to sue over legislation affecting profits, even in cases where the laws were designed to protect workers’ rights, public health or the environment. States should not sign the agreement unless their powers to regulate and legislate in the public interest are fully safeguarded and the so-called “investment protection” chapter is removed. “This chapter creates privileges for investors at the expense of the public,” said Mr. de Zayas, noting that the new text may slightly amend this chapter but adding that the Investment Court System (ICS) is similarly incompatible with the International Covenant on Civil and Political Rights, which requires legal cases to be heard by transparent, accountable, independent public tribunals. “The associations of German and Spanish judges have already decried this kind of investor-State dispute settlement, which is a one-way street, and also discriminates against domestic enterprises, Moreover, ICS is not necessary when all participating States are parties to the ICCPR and already have public courts that are independent, transparent and accountable,” he said. “CETA – along with most trade and investment agreements – is fundamentally flawed unless specific provision stipulates that the regulatory power of States is paramount and must not be impacted by a regulatory chill. It must also be clear that in case of conflict between commercial treaties and human rights treaties, it is the latter that must prevail.” The expert said there was now a strengthened case for a legally binding instrument on corporate social responsibility, obliging transnational corporations not to interfere in the internal affairs of States, and imposing sanctions when they pollute the environment or shift their profits into tax havens. The Human Rights Council has established an inter-governmental working group on transnational corporations, which is holding its second session this week. Mr. de Zayas, who has participated in this working group, urges the prompt adoption of a treaty that makes the Guiding Principles on Business and Human Rights legally binding and enforceable. He also said it was time to discuss the secrecy surrounding the drawing up of the CETA treaty, and the anomaly that much of the information about it became available only through whistleblowers, in violation of State obligations to ensure open access to information. “The constitutionality of the CETA and TTIP agreements should be tested before the European Court of Justice in Luxembourg, and the human rights aspects before the European Court of Human Rights, which could be called upon to issue interim measures of protection,” said Mr. de Zayas. “National courts should also test the compatibility of the agreements with national constitutions,” the Independent Expert stated. “There is a legitimate fear that CETA will dilute environmental standards, food security, and health and labour protection,” he said. “A treaty that strengthens the position of investors, transnational corporations and monopolies at the expense of the public interest conflicts with the duty of States to protect all people under their jurisdiction from internal and external threats.” Mr. de Zayas said the EU should have paid greater attention to a warning from a committee of Members of Parliament from the Parliamentary Assembly of the Council of Europe. The Committee on Social Affairs, Health and Sustainable Development said earlier this month that CETA imposed unacceptable restrictions on the legislative powers of national parliaments, and called for the signing to be postponed. NOTE TO EDITORS: The UN Independent Expert devoted his 2015 report to the UN Human Rights Council to the adverse human rights, health and environmental impacts of so-called free trade agreements such as CETA, TPP, TTIP and TISA. Check the report (A/HRC/30/44): http://www.ohchr.org/EN/Issues/IntOrder/Pages/Reports.aspx Mr. de Zayas focused his 2015 report to the UN General Assembly on the incompatibility of Investor-state-dispute-settlement arbitrations with fundamental principles of transparency and accountability. Check the report (A/70/285): http://www.un.org/en/ga/search/view_doc.asp?symbol=A/70/285 ENDS Mr. Alfred de Zayas (United States of America) was appointed as the first Independent Expert on the promotion of a democratic and equitable international order by the Human Rights Council, effective May 2012. He is currently professor of international law at the Geneva School of Diplomacy. Learn more, log on to: http://www.ohchr.org/EN/Issues/IntOrder/Pages/IEInternationalorderIndex.aspx The Independent Experts are part of what is known as the Special Procedures of the Human Rights Council. Special Procedures, the largest body of independent experts in the UN Human Rights system, is the general name of the Council’s independent fact-finding and monitoring mechanisms that address either specific country situations or thematic issues in all parts of the world. Special Procedures’ experts work on a voluntary basis; they are not UN staff and do not receive a salary for their work. They are independent from any government or organization and serve in their individual capacity. For your news websites and social media: Multimedia content & key messages relating to our news releases are available on UN Human Rights social media channels, listed below. Please tag us using the proper handles:'"}, "time": 1742564233.9007075}