{"duration": 0.07962799072265625, "input_args": {"text": "'On the campaign trail, long before he called the news media “the enemy of the American people,” President Trump pledged to curtail press freedom. “We’re going to open up those libel laws,” he said. The statement was puzzling, not least because opening up laws is not a thing. And if it were a thing, it would be done by legislatures or courts, not the president. Read generously, though, Mr. Trump’s statement may have meant that he intended to appoint Supreme Court justices who would vote to overturn precedents that make it hard to sue for libel. On this score, at least, Judge Neil M. Gorsuch, Mr. Trump’s Supreme Court nominee, seems destined to disappoint his patron. Judge Gorsuch’s decisions in libel and related cases show no inclination to cut back on protections for the press. Some plaintiffs, he wrote in a 2011 opinion, have reputations so poor that even serious accusations cannot damage them. Libel law, he said, is “about protecting a good reputation honestly earned. ” Judge Gorsuch added that minor inaccuracies in a news report can never serve as the basis for a libel suit, calling that “a First Amendment imperative. ” Press lawyers who have reviewed Judge Gorsuch’s decisions said they liked what they saw. “In a handful of opinions where he has weighed in on the subject, Judge Gorsuch shows no indication that he will ‘open up libel laws’ to muzzle the press, as the president appears to hope,” said Gayle C. Sproul, a lawyer with Levine Sullivan Koch  Schulz in Philadelphia. Eugene Volokh, an expert in First Amendment law at the University of California, Los Angeles, said Judge Gorsuch’s commitment to free speech was not guarded or grudging. “Sometimes when judges apply the rules, you can see that they’re holding their nose,” Professor Volokh said. “He didn’t seem to be. ” The question in the 2011 case was whether a Colorado prisoner, Jerry Lee Bustos, could sue the makers of a cable television show for calling him a member of the Aryan Brotherhood, a prison gang, when Mr. Bustos had merely conspired with the gang. Judge Gorsuch said there was no reason to think that Mr. Bustos’s “standing in the public eye would be improved at all by more careful explication of the true particulars of his involvement with the Brotherhood. ” A version of this issue arose during Mr. Trump’s presidential campaign, when his lawyers asked for a retraction of an article in The New York Times reporting on complaints from two women who said Mr. Trump had touched them inappropriately. Mr. Trump’s lawyers called the article libelous and seemed to threaten to sue. David McCraw, a lawyer for The Times, responded much as Judge Gorsuch had. “The essence of a libel claim, of course, is the protection of one’s reputation,” Mr. McCraw wrote. But Mr. Trump’s reputation in this area, Mr. McCraw said, could not have been harmed by The Times’s report in light of, for instance, Mr. Trump’s own statements about groping women. “Nothing in our article has had the slightest effect on the reputation that Mr. Trump, through his own words and actions, has already created for himself,” Mr. McCraw wrote. So far, there has been no lawsuit over the article. Gregg Leslie, the legal defense director for the Reporters Committee for Freedom of the Press, said Judge Gorsuch did not have “an extensive history of speech and press cases. ” But the judge “consistently applied established First Amendment protections when he did get them,” Mr. Leslie said. “He also showed a willingness to uphold protections for speech rights even in controversial cases. It’s always good to see a judge do the right thing in tougher circumstances. ” Ms. Sproul said Judge Gorsuch had voted in favor of news organizations in    cases, even when they involved “classically sympathetic plaintiffs, like a victim of sexual assault and by cops cleared of wrongdoing. ” In a 2007 case concerning the broadcast of a videotape of a rape, Judge Gorsuch joined an opinion dismissing a lawsuit by the victim. The court ruled that the news report concerned “a matter of legitimate public interest. ” He joined a second 2007 decision dismissing a case brought by undercover police officers on similar grounds. “Courts have generally treated allegations of police misconduct as worthy of public interest,” the decision said, refusing to carve out an exception for disclosing the identities of police officers working undercover. “We can find no precedent for such an exception, and we are not inclined to create one here merely on policy grounds,” the decision said, “despite our concerns about the safety of undercover officers and the need to avoid disincentives for entering their profession. ” Judge Gorsuch has also read other protections of the First Amendment broadly, including the right of citizens “to petition the government for a redress of grievances. ” That clause, he wrote in a 2007 case involving an unhappy taxpayer, “does not pick and choose its causes. ” “The minor and questionable, along with the mighty and consequential, are all embraced,” Judge Gorsuch wrote. Ronald K. L. Collins, a First Amendment specialist at the University of Washington, said the Supreme Court would benefit from Judge Gorsuch’s “  and informed devotion to free expression. ” “If confirmed,” Mr. Collins said, “Neil Gorsuch will be a   First Amendment player  —   an intellectual and rhetorical force to be reckoned with. ” But Judge Gorsuch seems unlikely to use his skills to advance Mr. Trump’s agenda in libel cases, said Professor Volokh, who has known the judge for decades. “To the extent people are worried that President Trump has an    project,” Professor Volokh said, “there’s nothing to suggest Neil would share that project. ”'"}, "time": 1742563505.1213205}