{"duration": 0.0629723072052002, "input_args": {"text": "'Financial Times Fumbles Trump’s Central Banking Criticism   \\nPopulists stick to tradition of central bank-bashing … If anyone still doubts the affinity between support for Trump in the US and for Brexit in the UK, they should look no further than the two movements’ attitude to monetary policy. –Financial Times \\nThe “populism vs. globalism” meme is increasingly evident in the mainstream media just as we predicted, and analyzing it can generate considerable insight into elite plans and societal positioning. \\nThis Financial Times article provides us further information in a short editorial. Interestingly, it is not by any means persuasive propaganda. It would have been far more effective in the 20 th century than today when so many more people are beginning to be educated about free-market economics. \\nMore: \\nDonald Trump has accused the Federal Reserve of keeping interest rates too low for what is healthy for the economy in order to make the Obama administration, and by extension Hillary Clinton, look good. Theresa May, more elegantly but no more justifiably, used her party Conservative party conference speech to attack the Bank of England’s policy of quantitative easing. \\nIn both cases, the technocrats at central banks are accused of making policy that helps rich elites and hurts the more deserving common people, be they small savers or hardworking families. \\nSo far so good. But toward the end of the article we are – unfortunately for the argument – provided with more specifics. This is where the article’s logic weakens and then disintegrates. \\nA cursory search of “populism” or “populism vs. globalism” will reveal a tremendous amount of commentary in a short period of time. In fact, this particular dominant social theme seems to be a foundational feature of upcoming arguments in favor of globalism. \\nBut it is fatally flawed – as this article offers in a few sentences that are meant to be damning but instead reveal the basic bankruptcy of this rhetorical approach: \\nTraditionally, populists have berated central banks for their obsession with “sound money”: tight monetary policy, high interest rates and the gold standard. ¨ \\nIn about 25 words, the article seems to sabotage its entire argument and by extension the larger meme. \\nIs this the best that can be done? Probably so. It provides terrible testimony as to the state of elite memes generally. \\nFor one thing, central bank criticism in the past few decades has not focused on central bank “obsession with sound money.” \\nOn the contrary, most modern criticism regarding central banking focuses on the endless debasement of the fiat currency monetary facilities spew relentlessly. \\nAdditionally, critics of central banking in the past decade or more have been sounding the alarm regularly about too-low interest rates. Rates so low, in fact, that they have now gone into negative territory. \\nFinally, in addition to mischaracterizing modern central bank criticism, the article doesn’t even attempt to grapple with cogent criticisms of central banking that are common on the Internet today. \\nThese criticisms are rooted in the free-market economics of the Austrian School, which is in many ways the basis of all modern economics. \\nMarginal utility shows us clearly that markets create valid prices. Yet central banks “fix” the value and volume of money via interest rates and in other ways. \\nThis cognitive dissonance is at the heart of the disaster of modern central banking. \\nAsk a central banker if he believes in price fixing, and you should receive a credible, necessary response: Price fixing destroys prosperity by substituting dictates for market competition. And yet … price-fixing is central banking’s significant – sole – methodology. \\nIn the Internet era, memes have to be convincing and logical to have an impact with the intelligentsia that elites have traditionally sought to propagandize – as they are thought leaders. But here we have one of the most important dominant social themes – populism vs. globalism – being presented in a major financial newspaper in a most unpersuasive way. \\nThis is probably why the fallback position when it comes to reasserting a necessary matrix of elite propaganda increasingly focuses on censorship. \\nThe kind of comprehensive effort necessary to reestablish the once-commonly accepted disinformation of the 20 th century is probably beyond the scope of even the most authoritarian propagandizing short of genocide. \\nConclusion: Bur wait, is that a potential world war staining the horizon? …'"}, "time": 1742563120.021355}