{"duration": 0.04502415657043457, "input_args": {"text": "'Newly confirmed EPA Administrator Scott Pruitt told Tea Party activist and conservative commentator Dr. Gina Loudon in an interview conducted on the main stage at CPAC Saturday that the country needs to get back to the rule of law. [Pruitt predicted: “I really believe that at the end of eight years [of the Trump administration] we’re going to have better air quality, we’re going to have better water quality because we’ve invested in a partnership,”  The partnership between the states and the federal government, Pruitt said, is one “that exists legally, that exists constitutionally. ” Pruitt also focused on two of the themes that he addressed last month during his confirmation hearings: (1) The actions of the Environmental Protection Agency must be guided by the rule of law. (2) The goals of environmental quality and energy production are not incompatible. “I think when we have a mutually exclusive kind of approach  —   that if you’re   you’re   when you’re   you’re    —   what that means is that we’ve been used to serve political ends,” Pruitt told Loudon. “We as a nation are better than that,” he added. “Because we do both. We grow jobs we also take care of our air, our water we also take care of our children,” the former Oklahoma Attorney General added. “How can the people here at CPAC help you take that message to their peers, their work environments, their schools as they go back out into the real world?” Loudon asked. “Another key term is trust. There’s distrust right now that exists between the states and Washington, D. C. as it relates to the environment,” Pruitt responded. “We need to do what we can to restore trust. I’m going to be spending time in West Virginia and Ohio with the state governors and the executive branches of government there,” Pruitt promised. “I’m going to send a message. Let’s join    to do what’s important for the environment,” he concluded.'"}, "time": 1742562922.7952352}