{"duration": 0.10875439643859863, "input_args": {"text": "'Watching “This Is Us” is like getting beaten up with a pillow soaked in tears. The pilot, which airs on NBC on Tuesday, keeps the emotional gas pedal floored from the opening scene, scored to Sufjan Stevens’s melancholy “Death With Dignity,” to the end, set to Labi Siffre’s anthemic “Watch Me. ” And all the way in between, this   and shameless dramedy is a   theater of the verklempt. It presents, in one hour, birth, death, reunion, career crisis,        reconciliations. It wants to make you weep and it does not play fair. It will leave no button on your psychic control panel unmashed. “This Is Us” belongs to a genre that used to be more common on   TV:   dramas, those    series about ordinary people with ordinary problems, like “thirtysomething,” “Once and Again” and “Friday Night Lights. ” “Parenthood,” the most obvious comparison to “This Is Us,” turned in its keys to the waterworks in 2015. Lately, family and love  —   those tiny, enormous matters  —   have been relegated to cable and streaming   like “Transparent,” “Casual” and “Togetherness,” leaving broadcast TV the histrionics of superheroes, lawyers and political fixers. “This Is Us,” created by Dan Fogelman, does have a gimmick. It’s built around four characters who share the same birthday. The first is Jack (Milo Ventimiglia) a nervous expectant dad whose wife, Rebecca (Mandy Moore) is on the verge of having triplets. The second is Kevin (Justin Hartley) a hunky actor who’s landed a   role in a terrible sitcom that requires him to spend much of his time shirtless. Next is his sister, Kate (Chrissy Metz) who is fighting a serious weight problem with the help of a support group, in which she meets the cheerfully acerbic Toby (Chris Sullivan). And finally there’s Randall (Sterling K. Brown) who has just tracked down the biological father who left him, as an infant, at a fire station, “probably because he couldn’t think of something more cliché. ” As that line suggests, “This Is Us” is aware when it dips into the commonplace, but it’s not above doing so when that tactic is effective. It deploys the pathetic fallacy promiscuously, dipping heartwarming scenes in honeyed light, and turning on the rain spigot during a fraught confrontation. Yet the first hour works its way efficiently through an   box of tissues with cleverly turned dialogue and   performances. Mr. Brown displays the tightly wound, complicated passion that just won him an Emmy for “The People v. O. J. Simpson: American Crime Story. ” Gerald McRaney also gives a striking guest turn as a wry, wise obstetrician (which sounds hackneyed even as I type it, yet the character somehow works). The series’s forebears worked best because of the dynamics among a large ensemble. The “This Is Us” pilot, which is the only episode screened for critics, keeps the central characters mostly separate (though an elegant ending twist suggests that that will change, going ahead). Some of the story lines are weak. It’s refreshing to see a broadcast series spotlight an overweight character who’s not a sitcom dad with a hot wife, but Kate is characterized almost wholly in terms of her weight. The acting subplot, meanwhile, relies on   about vapid network TV that comes across as  . For all that, the opening episode delivers a gorgeous climax I ended it feeling happily, mistily manipulated, willing to let “This Is Us” pull my strings for at least another episode. Maybe it’s my    concussion talking. Maybe I just want there to be more room on network TV for this kind of   drama. “This Is Us” is not a great pilot it could easily become mired in its own sap. But it has enough engaging moments for me to want to see if the series can master the difference between a good cry and an easy one.'"}, "time": 1742561973.046481}