{"duration": 0.10017228126525879, "input_args": {"text": "'Aditi Ashok is only 18 years old, but like any aspiring pro golfer, she knows the story of Ok Hee Ku and Se Ri Pak, who in the 1980s and ’90s changed women’s golf by starting the South Korean wave. Ashok may be that trailblazer for India. She was among the early leaders in the women’s tournament at the 2016 Rio Olympics and parlayed that experience into two victories in the fall on the Ladies European Tour, where she earned top rookie honors for 2016 and finished second in earnings with seven   finishes. Golf is an emerging sport somewhere behind cricket, soccer, field hockey and tennis in India, a nation of more than 1. 3 billion people. But that may change soon, thanks to players like Ashok. Anirban Lahiri is the only native of India with full status on the PGA Tour. Currently ranked 86th in the world, Lahiri has been ranked as high as 33rd. Arjun Atwal, currently ranked 969th, remains the only Indian winner on the PGA Tour, with his victory at the 2010 Wyndham Championship. Daniel Chopra, winner of two PGA Tour titles, grew up in India but is a Swedish citizen. But no Indian woman has ever won an L. P. G. A. Tour event. Ashok, at No. 100, is the   Indian woman since Simi Mehra, who played on the tour for several years beginning in 1997 and attained a   ranking of No. 17 in 1998. Only six Indian women are currently world ranked, compared with 148 Indian men. “Golf is definitely growing in India, but for the number of people we have, we still don’t have enough players, especially women players,” said Ashok, who is from Bangalore. Ashok found herself in the spotlight when she returned home as an Olympian last summer. Weeks later, she won the Ladies European Tour event in India and added a second win the next week in Qatar. “There was clearly a huge sense of pride from the local crowd when Aditi won the Hero Women’s Indian Open,” said Bethan Cutler, who handles communications for the Ladies European Tour. Cutler called Ashok’s win a “game changer for female golfers” in India. When asked what she thought it would take for her country to embrace golf, Ashok was pragmatic. “It’s not just about golf, and it takes more than talent,” she said. “It’s the culture. It’s about sports in general, and once the   changes and girls start picking up sports, there will be more players in golf. ” The Professional Golf Tour of India offered 25 tournaments last year for male professionals, many of whom also competed on the Asian Tour and the European Tour. But Indian women had fewer opportunities, with 16 tournaments on their Hero Women’s Professional Golf Tour. With significantly fewer women playing the game in India, it took more than a decade for the small professional Women’s Golf Association of India to grow to 30 members. Champika Sayal, secretary general of the association, and Mehra helped establish a professional tour for Indian women. Mehra organized a Skins Game in 2005, inviting three L. P. G. A. players to India to play an exhibition. A young Indian pro also competed in the event, alongside Mehra. “I remember it being quite historic and emotional for everyone involved,” said Heather   one of the invited pros and now the L. P. G. A.’s chief tour operations officer. Mehra won 25 amateur tournaments throughout Asia before turning professional and becoming the L. P. G. A.’s first Indian player by qualifying for the tour in 1996. She won three times on what is now the   Symetra Tour and posted two   finishes on the L. P. G. A. tour, where she played until 2008. Professional sports for women was a foreign concept in India in the 1990s, when Mehra began her golf career. She had no support from her country on any level and was encouraged only by her peers on the L. P. G. A. Tour. “I felt completely alone and a bit lost during my first few years on tour,” said Mehra, now 44. “But I had amazing women as my idols and friends who made me feel like I belonged there. ” Those L. P. G. A. peers donated their used golf equipment and balls to Mehra, who shipped the golf gear to India to help girls get started in the game. She would travel back and forth between the United States and India, shuttling equipment, playing in tournaments to support fledgling Indian events, and reminding her compatriots that opportunity existed. “It’s a little easier when you see someone else do it,” Ashok said when asked about India’s history in golf. “I still listen to Simi because of all she’s gone through. ” The number of Indian women playing professional golf still lags behind the number of female pros in many other nations, but it has grown from Mehra’s early roster of one. At last year’s Hero Women’s Indian Open, now sanctioned by the Ladies European Tour, the field of 113 players included 17 Indians. The growth of the Women’s Indian Open has become a visible milestone since the first national championship for Indian women was started in 2007 by Sayal, Mehra and others  —   43 years after the men’s inaugural national championship. Another sign is the increase in girls playing golf. “There were three or four girls between ages 7 to 12 when I was a junior,” Ashok said. “Now, there are between 15 to 20 girls. That’s not a lot, but it’s getting better. ” Access to golf is also an issue in India, Ashok said, adding that there were six courses within one hour of her Bangalore home. “We don’t have a lot of space in India, but even if there were more driving ranges, it would help make golf more accessible and help promote the game,” she said. Ashok embraced golf at 5½ while having breakfast with her parents at a golf club in Bangalore. Their breakfast table overlooked the driving range, where players were hitting balls. After breakfast, the family walked over to the practice green, where Ashok was handed a putter and some golf balls. Two hours later, she left in love with a new game. She and her parents began taking lessons and playing golf together. “We were very intrigued,” said her father, Pandit Gudlamani Ashok, who works in real estate. Aditi played her first round of golf when she was just over 6. Her father thought she would be tired, but was surprised when she wanted to play more. Her mother, Mash Ashok, said: “We played regularly as a family, but as soon as she was keen and started playing it competitively and started to set her goals, we couldn’t play as often because of her schedule. It was more about being her support than playing golf ourselves. ” India did not offer separate tournaments for girls when Ashok began playing, so from age 7 to 12, she competed with boys. She could not outhit the boys in distance, so she sharpened her short game as the equalizer. Ashok captured attention in her homeland for the first time at 13 when she went head to head against Mehra in a 2011 professional event. She beat Mehra in a playoff. “That was huge,” Ashok said. “Simi is a fierce competitor, but she encouraged me. When I won that event, I knew I wanted to be a professional. ” When Ashok won the Women’s Indian Open in November, she edged out the L. P. G. A. veterans Brittany Lincicome and Belen Mozo. In Qatar, she won by three shots over the European Solheim Cup player Caroline Hedwall. “Aditi has a bright future, and India has an iconic young female golfer,” Sayal said. “Golf is finally coming of age for women in India. ” Ashok passed another milestone in early December when she earned high conditional status at the L. P. G. A.’s annual qualifying tournament in Florida, which will allow her to play in a number of tour events and give her the opportunity to move up should she play well. Now the second Indian member of the L. P. G. A. Ashok plans to play at least six European Tour tournaments this year, and as many L. P. G. A. events as possible. “What she has achieved is truly remarkable,” Mehra said. “I wish her all the success in a wonderful journey. ” Others hoping to follow Ashok’s success include seven Indian women who competed in the recent Ladies European Tour qualifying tournament in Morocco. When Ashok won the 2015 event, there were only two Indians in the field. “I think our country never thought that we could have contenders in golf,” Ashok said. “But if golfers from a small country like Korea can have success, it can be done by top players from India. ”'"}, "time": 1742628318.60847}