{"duration": 0.07975172996520996, "input_args": {"text": "'Financial Markets , Gold , Market Manipulation , Precious Metals , U.S. Economy Comex gold manipulation , GLD , mining stocks , silver eagles admin \\nOut with the old, in with the old. Wall Street and the Fed wants to make nice with Trump so as soon as he accepted the next Presidency, the market manipulators went to work on pushing stocks higher and gold lower. \\nWhat happened with the threat issued by the media that if Trump were elected the stock market would crash? Yesterday Stanley Drunkenmiller issued a proclamation that he sold gold because inflation was coming. I do not believe that I have EVER come across any reference to the notion that gold in inversely correlated with inflation. Someone must’ve slipped Drunkenmiller some LSD in his scotch. But, then again, Drunkenmiller is part of the Soros family, which means he’s the enemy of the people and the truth. \\nThe economic thesis connected to Trump is infrastructure spending and inflation generation. The insanely overvalued, over leveraged “infrastructure” stocks like Caterpiller and Terex screamed higher the last few days. But if Trump has his way with his economic ideas, corporate taxes will be cut and the Government will re-do the work Obama did on the infrastructure. Bridges to nowhere funded by more Government debt. \\nI’m sure most market participants with at least two brain cells to rub together – which de facto would exclude Larry Kudlow from this human demographic – have figured out that Trump’s game-plan would widen out the Federal spending deficit and further accelerate the issuance of more Treasury debt. It is likely that the Fed will have to monetize some of this new debt issuance. This is the perfect recipe for higher gold and silver prices. \\nWhat is occurring right now in the markets is nothing more than a knee-jerk response by the hedge fund algos to the overt intervention by the PPT (the Fed + the Working Group on Financial Markets). The PPT steps in to get stock and precious metals futures moving in opposite directions and the hedge fund black box computers pile in. \\nThe massive take-down in gold is designed to make everyone feel better about Trump as the new president. But the price-smashing can only occur in the fraudulent paper gold markets in NY and London. Drunkenmiller is a fan, not surprisingly, of GLD – the quintessential postcard for fraudulent paper gold derivatives. \\nToday gold traded flat to up in the physical gold clearing eastern hemisphere markets. It wasn’t until the Comex opened that the real party for the criminal manipulators began. At one point, from 11:30 to noon EST 48,239 paper gold contracts were dumped on the Comex: \\n48,239 contracts represents 4.8 million ozs of paper gold – over 150 tons. Close to $6 billion worth of paper gold in 30 minutes. From 11:30 to the 1:30 Comex close EST, a little over 103,000 contracts were sold, representing 10.3 million ounces of paper gold, or 321.8 tons. The U.S. produces about 200 tons annually. Make no mistake, it is no coincidence that this hit on the price gold was gold timed to occur on a Friday holiday after the rest of the world had shut down their trading systems and went home for the weekend. This is standard modus operandi for the criminals running our system. \\nThe Comex vaults are reporting a little over 2 million ounces available for delivery. If an imbalance between the futures and the underlying available physical commodity were this wide in any other CME market, the Government regulators would be cracking down on it immediately, no questions asked. Why is gold different? The gold and silver markets are the most manipulated markets in the world and the same people doing the manipulation will kept in place under Trump. \\nThe good news is that the physical accumulation going on in the eastern hemisphere will accelerate next week with the lower price of gold. This always occurs. This will be the catalyst that will put a floor under the ability of the western elitists to push gold much lower. \\nI personally bought some physical gold this morning via Bitgold and reloaded some call options on some high quality large cap mining stocks and added to positions in my existing junior mining stock portfolio. The subscribers to my Mining Stock Journal were given my gameplan last night, including some names of other high quality mining stocks that have been beaten up and are overdue for big bounce. Share this:'"}, "time": 1742562754.6688745}