{"duration": 0.0324709415435791, "input_args": {"text": "'TEL AVIV  —   Israel’s   daily Haaretz published a column this week claiming President Donald Trump’s    Jared Kushner, boasted that his knowledge of the Middle East was picked up while waiting for ski lifts. The source for this gem of information? A satire column written for the New Yorker. [Amir Oren, Haaretz’s senior correspondent, columnist and a member of its editorial board, published a column Sunday entitled “From the Passport Stamp Controversy to Trump’s   . ”  In it, Oren wrote: Foreign visitors stream to the White House, but there is an embarrassing emptiness there behind the power of Trump’s    adviser, Jared Kushner, who boasted that, while waiting to board ski lifts on vacation, he read up on the Middle East on his smartphone. As blogger Elder of Ziyon noted, the basis of Oren’s claim comes from a hilarious  —   and very     —   column written in the New Yorker by comedian and satirist Andy Borowitz: BAGHDAD (The Borowitz Report)  —   Jared Kushner said on Tuesday that he became “incredibly  ” on the Middle East by reading up on the region while waiting for the ski lift on a recent trip to Aspen. “There would be times when you’d have to wait five or even ten minutes for the ski lift, and that’s when I’d take out my phone and read up on the Middle East,” he said. “I really got into it. ” Kushner said that the Middle East was a “truly fascinating region” because of “all the countries that they have there. ” “There is Israel, and Egypt, but there is also Yemen and places like that,” he said. “Sometimes I would start learning about a new country, but then the ski lift would come. ” Kushner said that, during a meeting on Monday in Baghdad, he “wowed” the Iraqi Prime Minister, Haider   with knowledge that he had gleaned about the nation while waiting for the ski lift. “I told him that Iraq’s main agricultural products include wheat, barley, corn, and rice,” he said. “He seemed really surprised that I would know things like that. ” “Something else that’s interesting about the Middle East is there is a country called Jordan,” he added. Haaretz later updated the aforementioned paragraph to read thusly (emphasis added): Foreign visitors stream to the White House, but there is an embarrassing emptiness there behind the power of Trump’s     Jared Kushner. The senior adviser boasted that (according to reports that some say were satirical) while waiting to board ski lifts on vacation, he read up on the Middle East on his smartphone. Later still the article was updated a third time (it’s worth noting that none of the amendments were mentioned in an disclaimer endnote) this time reading: Foreign visitors stream to the White House, but there is an embarrassing emptiness there behind the power of Trump’s     Jared Kushner. The senior adviser was ridiculed as ostensibly taking a crash course on the Middle East while waiting for ski lifts on vacation. The last sentence hyperlinks to another Haaretz article that has no mention whatsoever of Kushner’s   habits. The   version sticks to amendment number two, perhaps assuming that its readers won’t know or won’t bother to find out who Andy Borowitz is.'"}, "time": 1742628434.0243359}