{"duration": 0.13392019271850586, "input_args": {"text": "'Email \\nDirector of the Federal Bureau of Investigation (FBI) James Comey is again under fire, this time by supporters of Hillary Clinton for permitting the re-opening of the investigation into her use of personal servers to store and send classified material, the second round of a scandal that could prove fatal to the Democratic nominee\\'s chance to occupy the Oval Office in January. \\nRepublicans had their own go at Comey when he declared after the original investigation of Clinton\\'s mishandling of classified documents and information that there was insufficient evidence to charge her with any criminal violation. \\nComey, it seems, has become a punching bag being worked over by partisans on both sides of the political aisle. \\nRegarding the sound and fury coming out of the Clinton camp, they don\\'t see that their candidate has fallen into a pit she dug for herself. She knew, or should have known, that there are rules governing the treatment and transmission of data that could place U.S. national security in danger. \\nShe broke those rules, and despite what Comey claimed, whether she did so knowingly or not is irrelevant, as the requisite mental state codified into the regulation is \"negligence.\" That is to say, in order to be in violation of the relevant statute, one need only fail to take reasonable care in the behavior in question. \\nIt is beyond dispute that there was a duty of care, and Hillary Clinton\\'s behavior fell well below that bar. \\nWhat is also beyond dispute is that neither the Republicans — when Clinton was exonerated — or the Democrats — when the whole affair was brought back into the light of investigation — ever questioned the authority of the FBI to carry on as a federal police force. \\nThe larger question, the constitutional question, is why does the federal government have an armed police force with nearly unlimited authority (at home and abroad) and with the power to conduct most of its work in secret, beyond the oversight of the American people, whose interest they ostensibly serve? \\nPerhaps Ryan McMaken has hit upon the answer to that question in an article published on the Mises Wire blog. McMaken writes of the federal government\\'s law enforcement agency: Of all federal police forces, the FBI is the most romanticized, and every FBI agent is assumed to be the modern embodiment of a fictionalized version of Eliot Ness: incorruptible, professional, and efficient. Decades of pop culture has driven this home with TV series and movies such as The Untouchables , The FBI Story , and This Is Your FBI have long perpetuated the idea that when local police fail, the FBI will step in to be more effective and simply better than every other law enforcement agency. Corruption cannot touch the FBI, we are told, and they apply the law equally to everyone. \\nAccording to a piece penned in 2012, \"A Stasi for America,\" reporter James Bovard painted a darker, less egalitarian picture of the FBI\\'s application of the law: A ripple of protest swept across the Internet in late March after the disclosure that the Federal Bureau of Investigation was teaching its agents that “the FBI has the ability to bend or suspend the law to impinge on the freedom of others.” This maxim was inculcated as part of FBI counterterrorism training. The exposure of the training material — sparked by a series of articles by Wired.com’s Spencer Ackerman — spurred the ritual declaration by an FBI spokesman that “mistakes were made, and we are correcting those mistakes.” No FBI officials were sanctioned or fired for teaching lawmen that they were above the law.... At least the FBI has been consistent. Since its founding in 1908, the bureau has rarely let either the statute book or the Constitution impede its public service. Tim Weiner, the author of a superb exposé of the CIA ( Legacy of Ashes ) has delivered a riveting chronology of some of the FBI’s biggest crimes with his new book, Enemies . \\nThere\\'s no question that in its roughly 100 years of existence, the FBI has seen its reputation rise and fall. \\nMcMaken recites a bit of recent history in support of his assertion that the creation and the continuation of the FBI as a federal secret police force is an assault on the liberty of the United States: The reality and the romance, of course, have always been two totally different things, and it\\'s helpful to remind ourselves that it was the FBI that was in charge of the Waco massacre where 26 children were killed. It was the FBI that led the raid on Randy Weaver\\'s house where an FBI sniper shot a woman dead while she was holding a 10-month old baby. It was the FBI that spied on Martin Luther King, Jr., and targeted peaceful anti-war organizations for political reasons during the 1960s and 70s. It was the FBI that came of age arresting opponents of the First World War. Naturally, in all of these cases, the FBI has actively covered up the facts and denied wrongdoing. \\nNext, the history lesson looks further back to the beginnings of the FBI to illuminate the transformation of the FBI from crime-fighting force (albeit no less unconstitutional) to powerful partner in the surveillance state: Thanks to war hysteria during World War I, the FBI rose to prominence as Woodrow Wilson\\'s shock troops against \"dissidents\" (i.e., peaceful opponents of the war). Indeed, persecuting and prosecuting political enemies of the American state would become something of the forte of the FBI, with the role of the agency being expanded ever more during times of perceived national crisis. The idea of the FBI as a crime-fighting organization — the primary message of fawning treatments of the FBI such as The Untouchables and The FBI Story — for decades served as cover for the FBI\\'s political activities. As Foreign Policy pointed out in 2014, though, the FBI quietly dropped its claims of being a crime fighting organization and began declaring itself a \"national security\" organization. Down the memory hole goes the FBI\\'s original claimed raison d\\'etre. \\nThis point is borne out in the FBI\\'s own description of its purpose. On the \"Questions and Answers\" section of its official web page, the agency describes itself as \"an intelligence-driven and threat-focused national security organization with both intelligence and law enforcement responsibilities.\" \\nWhere, one wonders, does the Constitution grant the federal government or any of its associated agencies any intelligence gathering and federal law-enforcement power? \\nFinally, not only is the FBI\\'s assumption of its current role as federal police force and armed branch of the federal surveillance apparatus unconstitutional and a persistent threat to freedom, but it represents yet another example of the inability of the government to perform any task on par with a privately owned entity with the same or similar objective. Again, from the Mises Wire: \"The unreliability of metropolitan police, with their strong local and partisan ties, prompted major businesses and industrialists to establish the Pinkertons and other private police forces. The Pinkertons ultimately functioned as a de facto national detective and policing service until the 1920s, when the FBI finally came into its own.\" \\nAs one scandal blends into the next, and as each generation sees the occurrence of some serious act of FBI abuse of power, perhaps it is time to consider the abolition of the agency and the return of its assumed duties to the private sector. Please review our Comment Policy before posting a comment \\nThank you for joining the discussion at The New American. We value our readers and encourage their participation, but in order to ensure a positive experience for our readership, we have a few guidelines for commenting on articles. If your post does not follow our policy, it will be deleted. \\nNo profanity, racial slurs, direct threats, or threatening language. \\nNo product advertisements. \\nPlease post comments in English. \\nPlease keep your comments on topic with the article. If you wish to comment on another subject, you may search for a relevant article and join or start a discussion there. '"}, "time": 1742563620.5253186}