{"duration": 0.13735389709472656, "input_args": {"text": "'\\nThis election proved the power of the Internet, and of the people who used their voices to the fullest.\\nBut now, they will pay for it.\\nWill it mean the end of free speech?\\nClearly, the deep state was not defeated overnight, but a loose network of hackers, researchers, alternative media outlets and long-term constituents of the “vast rightwing conspiracy” did manage to overpower the establishment’s choice of Hillary for president – and managed to embarrass the mainstream media while they were at it.\\nEven if they won’t get everything they wanted under President-elect Trump, they proved that a number of leading websites, and quite a few underground blogs, aren’t just promoting fringe views, but have become influential and often damning, even to the most high profile players. The Internet, and in particular, the alternative media, counterbalanced the mainstream effectively in 2016, and defeated their narrative.\\nAnd now, those who control the corporate-dominated flow of information want to end that competition.\\nAs SHTF just reported :\\nWhat this year’s Presidential election has proven is that alternative media is a force to be reckoned with, and the establishment is scared shitless. \\nBut they won’t let it happen again.\\n[…] Today’s actions by Google and Facebook provide further evidence that the establishment media and Deep State politicians are preparing a digital lock down on any and all information that has not been approved by an as of yet unknown Truth Panel. \\nA Facebook spokesman said it will explicitly ban sites that traffic in fake news from using the Facebook Audience Network… Google said it plans to prevent Google ads from being placed “on pages that misrepresent, misstate, or conceal information [as well as] sites that distribute false news.”\\nThough this effort may be subtle, there is every reason to think it will be brutal for free speech. It could prove to be the last laugh for Hillary Clinton, who blames her media opponents, Wikileaks hackers and even the failure of her own friends and presstitutes in the media for destroying her campaign with piles of Clinton family dirt.\\nMajor outlets are now circulating a list of websites that have been deemed to be “fake news” and worthy of censorship that was compiled by… you guessed it… a random community college assistant professor trolling websites they’d like to have removed because they disagree with it.\\nAs The Daily Sheeple reported , these sites comprise of many of the biggest alternative news sites on the Internet:\\nLike clockwork, floating around on the Internet now is a list of these “fake” sites authored by Melissa Zimdars, assistant professor of Media and Communications at Merrimack College.\\nShe has deemed all of these sites as “false, misleading, clickbait-y, and/or satirical ‘news’ sources”.\\nJust to name a few examples, The Daily Sheeple, The Free Thought Project, Infowars, Breitbart, Lew Rockwell, Before Its News , Intellihub and even CoastToCoastAM.com were flagged as “fake news” sites that should be blocked, removed and/or censored.\\n\\n\\n\\n\\nAs many online account holders know, there are many subtle ways of suppressing or blocking accounts, including demonitization that takes away an author’s incentive. That is what Google is attempting right now by denying ad sense revenue to sites they disapprove of, while they are still the masters of quietly de-listing sites in the algorithm so that fewer people will find their links – and those being targeted may never know what happened.\\nMeanwhile, the State Department just refused to recognized reporters from RT at a press conference. Spokesman John Kirby got testy over a question about Syria hospital bombings and retorted: “I’m not going to put Russia Today on the same level with the rest of you who are representing independent media outlets.” \\nA major blowback is underway by the corporate, establishment media in retribution for their embarrassing failure in stage-managing a cakewalk election for Hillary Clinton. CNN’s parent company Time Warner (recently bought out by AT&T) was in the top ten of Hillary’s donor list , along with most of the largest Wall Street banks, Google’s parent company Alphabet, Inc. and Microsoft. It is no surprise to see many of these players acting in accordance to de-list dissenters.\\nConsidering that Donald Trump has also teamed up with Facebook board member Peter Thiel to sue critical journalists , and have proposed new legislation to make defamation laws stronger, his administration may not prove much better, despite the strong backing for his campaign by the “alt right.”\\nWill these next few years be the most difficult yet for online free speech? There certainly seems to be a lot of pressure coming down from above.\\nRead more: \\nDigital Lock Down: Google and Facebook Take Aim At ‘Fake News’ Websites: “The Establishment Is Scared Sh*tless” \\nList of “Fake” News Sites for Google to Target Released; Every Alt Site You Know (Including The Daily Sheeple) Is On It \\nMake No Mistake: “Everyone Who Is Warning About Clinton Is A Target and They Are Marked” \\n'"}, "time": 1742562375.5661757}