{"duration": 0.1303403377532959, "input_args": {"text": "'Friday night, the Facebook   Mark Zuckerberg went on his vast social network to convince an expanding chorus of critics  —   including the departing president of the United States  —   that he    wants to combat the “fake news” that is running wild across his site and others, and turning our politics into a paranoiac fantasy come to life. “We’ve been working on this problem for a long time and we take this responsibility seriously,” he wrote. “We’ve made significant progress, but there is more work to be done,” he continued, listing various steps Facebook was taking, like making it easier to report bad information and enlisting   organizations. It was heartening to hear, especially after his earlier assertion that it was “crazy” to believe that misinformation on Facebook had affected the presidential election in any real way  —   despite copious evidence that it was disturbingly in the mix, whether it directly swung the result or not. But as Mr. Zuckerberg went on to say that Facebook had to be careful not to mistakenly block “accurate content,” he added this: “We do not want to be arbiters of truth ourselves,” which was why he said Facebook would continue to rely on “our community and trusted third parties. ” His statement pointed up how much Facebook struggles to find the balance between its mission to be a   utopia for its 1. 8 billion users and its responsibility to protect them from all that is defamatory, dangerous (like terrorist propaganda) and untrue. But more to the point, it appeared to buy into the notion that truth is relative at a time when that notion has to finally go away. Do you really need an outside arbiter to determine whether a video suggesting  —   without basis  —   that Hillary Clinton was involved in John F. Kennedy Jr. ’s fatal plane crash in 1999 should be allowed to stand? Really? Truth doesn’t need arbiters. It needs defenders. And it needs them now more than ever as the American democracy staggers into its next uncertain phase. With a mainstream news media that works hard to separate fact from fiction under economic and political threat, Facebook  —   which has contributed to that economic threat by gobbling up so much of the online advertising market  —   is going to have a special responsibility to do its part. Just imagine what things will look like if the unsavory elements that tore through the 2016 election  —   false narratives, fake news and aggressive efforts to delegitimize traditional journalism  —   come back into play as Donald J. Trump presses to enact his agenda. If the past week provided any indication of where politics are going, the next four years are going to require an     effort to keep the national conversation honest. The national security adviser Mr. Trump named last week, Michael T. Flynn, a retired Army lieutenant general, has subscribed to the conspiracy theory that Shariah law is taking root in the United States (it isn’t) contributing to his insistence that Americans have every reason to view Islam as “a threat. ” He recently used Twitter to circulate a fake news item that the Federal Bureau of Investigation was sitting on evidence from Anthony Weiner’s laptop that would “put Hillary and her crew away for life. ” Mr. Trump’s nominee for attorney general, Senator Jeff Sessions of Alabama, has falsely claimed that hundreds of thousands of undocumented immigrants are successfully crossing the border annually. Then there was the announcement by the conspiracy theorist Alex Jones that Mr. Trump had called to thank him and his radio and internet audience for their support in the campaign. Add to that the fact that Mr. Trump was the most prominent promoter of the false notion that President Obama wasn’t born here, and didn’t hesitate to repeat the outrageous suggestion that the father of Senator Ted Cruz was linked to the assassination of President John F. Kennedy. Then consider what it may look like when Mr. Trump pursues policies regarding Muslim immigrants and undocumented immigrants. It’s not so outlandish to envision Mr. Trump’s attempts to sell his plans getting a lift from the likes of Mr. Jones or a fake site out of Macedonia  —   perhaps claiming that Democrats are working with ISIS to use undocumented immigrants to poison local water supplies or some such. President Obama seemed to have had something like that in mind when he told reporters in Germany on Thursday, “If we are not serious about facts and what’s true and what’s not,” and “if we can’t discriminate between serious arguments and propaganda, then we have problems. ” Mr. Obama knows of what he speaks. He had to muddle through the first wave of this. You might remember how his health care plan was marred by a false accusation that the plan included   death panels that would decide who lived and who died based on their “level of productivity to society,” as former Gov. Sarah Palin put it (on her Facebook page! ). The false “death panel” allegation was partly based on proposals to reimburse doctors for optional consultations with families over    care decisions. The accusations took on such power that even Newt Gingrich signed on to the falsehood despite the fact that he had previously expressed bullish support for    planning. (He explained himself in a 2009 letter to The New York Times.) News organizations, including this one, debunked the myth. But the bill’s authors stripped out the provision just the same. And by then the “death panel” fiction had negated any shot at a reasoned, ideological debate  —   you’re joining the Democrats’ plan to kill our infirm children and parents?!  As Dan Pfeiffer, who was the president’s chief communications strategist at the time, so grimly put it to me last week, “The faux death panels were the canary in the coal mine about the coming death of truth. ” Things have advanced since then. Today’s fake news is limited only by the imaginations of its inventors and the number of shares it can garner on Facebook or Twitter. (To wit: The one million shares of the preposterous notion that Mrs. Clinton secretly sold weapons to ISIS. BuzzFeed News  —   which has excelled at illuminating the fake news problem  —   highlighted that example in its alarming analysis  showing that during the campaign cycle fake news was shared among Facebook users more often than real news was.) That’s why people who care about the truth  —   citizens, journalists and, let’s hope, social media giants like Facebook, too  —   will have to come up with a solution to this informational nihilism, fast. It’s easier said than done. The combination of attacks seeking to delegitimize serious news organizations and a drop in overall trust in the news media has made many people wary of legitimate  . And, as my colleague John Herrman noted last weekend, politicized voices can easily drown honest journalism all too easily on social media. There is growing talk of an ambitious journalistic collaboration to beat back the tide. Industry thinkers and leaders are coming together online to brainstorm solutions, as Jeff Jarvis, the City University of New York journalism professor, and Eli Pariser, the Upworthy   have done. (Check them out online.) And I’d say it’s high time that television news  —   with its   audiences  —   gets into the act with more than just token gestures at  . But this much seems clear: The moment calls for some sort of hyperfactual counterinsurgency that treats every false meme as a baby Hitler to be killed in its crib with irrefutable facts. So hey, Zuck, let’s roll.'"}, "time": 1742563562.0227635}