{"duration": 0.047666072845458984, "input_args": {"text": "'Several mainstream media outlets have linked sluggish first quarter economic growth to President Donald Trump, who presided over just seventy of the first ninety days of the year. But back when the economy shrank considerably during the first quarter of the Obama administration, there was no attempt to link the contraction to the president. [The Commerce Department reported last week that Gross Domestic Product only grew 0. 7 percent during the first quarter of 2017, following a gain of 2. 1 percent in the fourth quarter of 2016.  The Associated Press claimed that the slow GDP growth in the beginning of 2017 “marks the first quarterly economic report card for President Donald Trump, who has vowed to rev up the U. S. economy. ” “Americans say they feel more optimistic about the economy since President Trump was elected,” The New York Times wrote on April 28, “but they certainly are not acting that way, and that is shaping up to be a challenge for his administration. ” Bloomberg added to the chorus of outlets that expressed pessimism about the economy under President Trump’s first 100 days. “The U. S. economy is in better shape than Friday’s   figures will probably indicate,” Sho Chandra and Patricia Laya wrote, “but getting the growth that President Donald Trump wants is becoming even more difficult. ” But the media was singing a different tune during President Obama’s first 100 days. Despite the slow growth that occurred at the outset of 2009, the outlets that linked President Trump to poor GDP performance failed to hold President Obama to the same standard. “The Commerce Department reported last week that Gross Domestic Product only grew 0. 7 percent during the first quarter of 2017, following a gain of 2. 1 percent in the fourth quarter of 2016,” the New York Times reported in 2009. The only mention of President Obama in the article was a reference to Paul Volcker that identified him as an adviser to the president. In early 2009, Associated Press reporter Liz Sidoti, and likely in response to concerns over less than desirable economic performance, heaped lavish but meaningless praise on President Obama. “It didn’t take long for Barack Obama  —   for all his youth and inexperience  —   to get acclimated to his new role as the calming leader of a country in crisis,” she wrote. “Rookie jitters? Far from it. ” He spoke in “firm, yet soothing tones. ” He used a “  approach. ” He “displayed wonkish tendencies, too,” and “engaged in witty batter,” and on foreign policy, he “struck a statesmanlike stance. ” On April 29, 2009, The Washington Post, without mention of the slow GDP growth, said Obama had “moved quickly to strengthen the U. S. economy, refine the American strategy in two foreign wars and reverse   detention and interrogation policies that have drawn condemnation at home and abroad. ” An extensive blog prepared by The New York Times that covered President Obama’s first 100 days in office failed to mention GDP growth even once. The blog, which was written by five presidential biographers, covers a wide range of topics including foreign policy, the economy, and the president’s interactions with congress. Investor’s Business Daily was unable to “find mainstream media critiques of Obama’s policies early in 2009,” claiming that “there were virtually none. ” Although the economy was contracting in the early months of Obama’s presidency,  “no one blamed him for that. Instead, there was lavish praise, even as he stumbled from error to error. They blamed Bush. ” If anything, “lavish praise”  may be an understatement. On February 20, 2009, ABC Nightline   Terry Moran argued that “in some ways, Barack Obama is the first President since George Washington to be taking a step down into the Oval office. ” Katie Couric came out in full support of Barack Obama’s early stimulus package proposal, citing a survey that claimed that slightly more than half of Americans supported the proposal. Couric used this survey to ask   Leader John Boehner why congressional Republicans wouldn’t support the policy. “A recent CBS News poll shows that 53 percent of the American people fully backs the stimulus package, 63 percent of people we polled thought the Republican opposition to the stimulus package was for political reasons. So, are you out of touch with the American people?  …    Do you think the Republicans are digging themselves in a hole by not being more supportive of the President’s proposals?” Couric asked. The policies enacted in President Obama’s first 100 days cost a whopping 141 times what President Trump’s first new policies have cost. According to an analysis from the American Action Forum, President Trump’s new regulations have cost a mere $28 million in comparison the $4 billion enacted by President Obama in the same period. Tom Ciccotta is a libertarian who writes about economics and higher education for Breitbart News. You can follow him on Twitter @tciccotta or email him at tciccotta@breitbart. com'"}, "time": 1742628512.756057}