{"duration": 0.07975268363952637, "input_args": {"text": "'The thing celebrity magazines never mention about Johnny Depp’s current problems  —   the foreclosures on his homes, how he was said to have cut off his fingertip in a marital dispute, the fact he may need to  sell a small French village to cover debts associated with the subsequent divorce  —   is how his challenges are relevant to the Trump administration. Mr. Depp has appeared in some of the   (“Pirates of the Caribbean”) and weirdest (“Yoga Hosers”) films of the past 30 years, earning him an estimated $650 million. Being a rich movie star, however, does not necessarily bring great financial savvy. Over the past decade, Mr. Depp has paid more than $5. 6 million in interest on overdue taxes, has lent millions of dollars to people unlikely to pay him back and has unwisely splurchased a number of questionable investments, not the least of which is that town near St. . These money missteps, Mr. Depp says, are not his fault. Back in 1999, you see, Mr. Depp hired a firm named the Management Group to oversee his finances. But instead of protecting his fortunes, those financial advisers “engaged in years of gross mismanagement,   and at times, actual fraud,” according to a lawsuit Mr. Depp filed against the company. (The Management Group filed a countersuit on Tuesday denying wrongdoing and arguing that it “did everything possible to protect Depp from his own irresponsible and profligate spending. ”) The alleged fiscal malfeasance visited upon Mr. Depp occurred over 16 years, but the actor was unaware of this skulduggery, his lawsuit asserts, because he simply wasn’t paying much attention to what was going on. Mr. Depp, by his own admission, often had no idea what was occurring in his bank accounts and would regularly sign whatever documents the Management Group put before him, without bothering to read what they said, on the assumption that his financial adviser “was behaving as a loyal fiduciary and prudent steward of his funds and finances,” his lawsuit asserts. And this is where the Trump administration comes in, because that word  —   fiduciary  —   is at the heart of a battle raging within the federal government over how much responsibility we ought to bear in managing our own finances, and how much we should trust the people giving us advice. (Fair warning: The next few paragraphs are wonky, but I promise we’ll get back to Johnny Depp.) In 2015, President Barack Obama asked the federal government to force most of the nation’s financial advisers  —   those people who tell us which stocks to buy for our 401( k)’s  —   to abide by what’s known as the fiduciary standard, a set of rules that would require advisers to give their clients the best possible advice (rather than, say, advice that pays those advisers the highest fees). “It’s a very simple principle,” Mr. Obama said at the time. “You want to give financial advice, you’ve got to put your client’s interests first. ” For most financial advisers, becoming a fiduciary was no big deal, because they had been giving good advice anyway. For instance, the investment firm Merrill Lynch said it would voluntarily hold its retirement advisers to the new standard. “We view the Department of Labor Fiduciary Rule as a positive step for the industry and great news for investors,” reads a company web page. Other investment firms, however, were less enthusiastic about the new rules and began furious attacks. Their objections ranged from the ridiculous (suggesting that tens of thousands of financial advisers would retire en masse to protest the new rule) to the legitimate (profits of some advisers are likely to fall, and the fees paid by some investors may rise under the new rule what’s more, there will most likely be some lawsuits against a small number of advisers as everyone tries to figure out how the new rules work). When Donald J. Trump was elected president, the new fiduciary rules weren’t complete, and now some of his advisers are urging him to freeze or overturn them. The fiduciary rule might be “the dumbest decision to come out of the U. S. government in the last 50 to 60 years,” Anthony Scaramucci, an investment manager and newly appointed White House official, said at a conference, vowing to “repeal it as soon as we can. ” Republicans in Congress have introduced legislation to kill the rules. In truth, this battle is part of a broader clash within the federal government that is likely to shape Mr. Trump’s presidency. At the core of those who oppose the new fiduciary rules is a basic belief: People ought to bear more responsibility for monitoring their finances and lives. The fiduciary standard, its critics claim, does a disservice to the nation by placing the burden of financial accountability on advisers, rather than on us, the people who should be paying attention to what occurs with our bank accounts. We should be expected to scrutinize the advice we receive, these critics say, rather than accept it unthinkingly. A fiduciary protection enfeebles us by guaranteeing we’ll receive only good advice. That argument might seem preposterous  —   what’s the point of seeking advice if you can’t trust the advice giver?  —   until you consider situations like Johnny Depp’s. (See, I promised we’d get back to him.) Mr. Depp’s situation is so complicated that, in most ways, the federal fiduciary rules don’t apply. And his lawsuit will be unaffected by whatever President Trump proposes, because it has been filed in state court. Nonetheless, his suit is illuminating, because it demonstrates that instead of glibly dismissing the rules’ critics, we ought to acknowledge the challenges they voice. Consider, for instance, the claims made by Mr. Depp’s lawyers that the Management Group never once paid the actor’s taxes on time in 16 years (which the company disputes). That’s not great, but at the same time, how many years should a tax adviser miss a deadline before it’s the client’s responsibility to replace him? What’s more, according to the countersuit filed by the Management Group, Mr. Depp’s financial distress was a result of his tendency to overspend  —   at a rate of $2 million a month  —   on items like 14 homes, a chain of islands in the Bahamas, $30, 000 per month on wine, and $3 million to blast the ashes of Hunter S. Thompson from a   cannon. “I need to give my kiddies and famille as good a Christmas as possible,” Mr. Depp wrote to his financial advisers when they counseled him to “take it easy on holiday spending,” according to the firm’s countersuit. “On those few occasions when Depp said he was ready to change his ways, he never did,” the countersuit continues, “and he always went back to his uncontrolled spending. ” For its advice and services, the Management Group was paid $28 million out of Mr. Depp’s accounts. And this is where questions regarding the fiduciary standard come into play, because while Mr. Depp is clearly prone to some very bad financial choices, just as clearly the Management Group has allowed those decisions to occur. If the Management Group were held to the fiduciary standard, his advisers would probably have had more of an obligation to stop Mr. Depp from doing foolish things with his money, like giving it away or impulsively buying a French town. And, if Mr. Depp disregarded that advice, the Management Group might have had an obligation to cut ties with the actor, or at the very least, stop paying itself millions of dollars from his accounts. But, by the same token, Mr. Depp should also have paid at least a little attention to what was going on. Being a movie star shouldn’t excuse you from the obligation of balancing your checkbook once in a while. And that’s the rub for observers like me (and perhaps you) who believe Mr. Obama’s fiduciary rules are good policies and should become established law: We don’t like having to defend the irresponsible choices of people like Johnny Depp. We don’t want citizens to be encouraged to think less about their finances and retirement rather, we want them to think more. Mr. Trump’s advisers have a point when they argue that these new rules might make it easier for average Americans to pay less attention to what’s going on. But that doesn’t mean we shouldn’t have these laws. In the movies, you can assume that everything will work out in the end. Real life, unfortunately, is more messy. Relying on personal responsibility often isn’t enough. And so though we might be annoyed by the whimpers of movie stars, listening to their complaints about the agony of having too many houses is a small price to pay to make sure good advice stays that way. There are no clear heroes and villains in this story, or most others. Let’s hope the president chooses the right script.'"}, "time": 1742628536.813685}