{"duration": 0.12764430046081543, "input_args": {"text": "'Leave a reply \\nJennifer Hoffman – As we end another rather challenging month it’s tempting to ask when it will all be over. That’s not a good question to ask right now because it implies that we’re the passenger on this ride and we have no control over the outcomes. But we are the driver and we have all of the control, as we’ll see in November. \\nFrom October’s 1 energy we move into the 2 of November but this is 2 reduced from 11 (November is the 11th month) which is the integration of spirit and matter, of human and divine. Are we ready to reap the rewards of our efforts now, or are we waiting for permission to sit at life’s victory banquet? It’s up to us and we’ll find out in November that the rewards are there but we have to step up to the podium and claim them for ourselves. November can be a ‘joy ride’ if we’re willing to let go, lift off, and shine on. \\nNovember begins with a new moon which happened at the end of October. Nevertheless, the energy is still resonating with us and this was a very busy new moon. It really brings forward November’s theme of spiritual integration, with the Sun, Moon, and Mercury all trine (120 degrees) Neptune in Pisces. Here we have both lights (sun and moon), as well Mercury, the planet of karma, all interfacing with Neptune in Pisces, the final house of the zodiac. The message for us is to become spiritually mature – accept ourselves as powerful spiritual masters and let go of any thoughts or beliefs about not deserving or being ‘good enough’. \\nBut it gets better because Jupiter is close by (it’s the traditional Pisces ruler) so it amps up the spiritual energy we have to use for our transformation and transition to the ascension vibe. This continues the Jupiter effect from September 2015 as we move forward into phase two of our spiritual awakening cycle that began then. \\nThe November 2016 Energy Mastery class is November 4, 2016, where you’ll learn how to best use November’s energy (and what to avoid), along with energy exercises and our energy meditation. Click here to sign up, the call is live and recorded, worksheet is included too. \\nThen there is the tricky Venus/Saturn conjunction happening too. What happens when you put the planet of beauty, love, and partnership in the same small space with the zodiac’s disciplinarian and reality teacher, Saturn? Either a lot of heated discussion or stony silence. The energy of this union is a reality check for us in the relationship area, starting with the one we have with ourselves, as well as our relationships with others. \\nAre we being ‘real’ with ourselves, giving ourselves the same level of caring, compassion, and consideration that we give others? \\nWhere are we focusing our energy and what do we want to create in our lives, separating our needs, wants, and desires from those of others? \\nVenus wants it all and not always in a balanced or achievable way. Saturn strives to focus our enthusiasm on what we really want and to eliminate the limitations, distractions, worries, and fears that prevent us from realizing our dreams. Venus is like the 3 year old who wants the cookie, and Saturn is the mother who says “No, not before dinner”. The mother is doing it to benefit the child but it doesn’t feel that way. Our response here is important, to do we keep pushing against the ‘no’ or do we figure out why the ‘no’ is there and then make other plans? Are we in denial of anything in our reality or are we willing to take off the ‘rose colored glasses’ and start doing what we need and want to be happy? \\nHave you been feeling less motivated, a little slow and unconsciously taking a very deep, detailed look at your life? You can blame Mars for that during the past several months as he has been aspecting the heavy hitters, Saturn in September and Pluto in November, as well as squaring the Uranus/Eris conjunction this past week. We’re used to Mars energy being very fast moving (except when it was moving back and forth through Scorpio from January to August this year) and jumping over hurdles. But we have had to adapt to a new, more mature Mars energy this year, that takes its time, digs deeply, considers, reconsiders, and assesses the terrain before moving forward. While this is a more deliberate Mars energy, we prefer the fast moving Mars, although we won’t have it until 2017. \\nThe Mars/Pluto action ends the first week of November but its energy has been rather depressing lately. And here’s why, we have Mars, which rules the firgrandparents-1017825_1280st house of the zodiac, Aries, walking with Pluto, which is (supposedly) the last planet in our solar system (ignore the planetary demotions and astronomy games) and rules Scorpio. \\nMars is also the traditional Scorpio ruler, so we have double Scorpio energy here. (yes, the Scorpio energy just continues). But, the Mars/Pluto conjunction is like what happens when a little child spends time with an elderly grandparent – the child slows down to accommodate the grandparent’s age, while the grandparent adjusts their conversation to the child’s age. It’s the best of both worlds, the slowing down to reflect, consider, assess, and connect on a shared level. \\nBut when that’s happening in your personal life and you need things to be done or to get done, and don’t have any time for esoteric ‘navel gazing’ because you need action happening now, it can be frustrating. And yet, this is part of taking action because we must get used to aligning energetically before we leap into unknown territory without ensuring that it’s right and best for us and is something we want to integrate with and put into our reality. \\nAll of this activity in October, the ‘1’ month, had a purpose, to bring us into the ‘2’ of November. This is not about relationships, romance, and revelry, although there is an opportunity for that. This is first and foremost about our central relationship, with ourselves. We are either alone in our humanity or partnered with our divinity, where the human ‘1’ becomes the ‘2’ divine human. \\nWhat do we need to embrace about ourselves, including our beauty, perfection, wisdom, and potential, to allow this to happen?divinity-is-your-destiny \\nWhat do we need to release, shed, and turn away from, including our need for approval and validation, beliefs in unworthiness, fears about the future, and inability to acknowledge our power, to make room for our divinity? \\nThe opposite of divinity is not evil (which is the word ‘live’ backwards), it is profanity, which is the absence of divinity. A profane reality is not one filled with four letter words; it is one which has no room for the divine; therefore, it will always feel incomplete because divinity makes us whole, complete, and congruent in our individual energy and brings us closer to being in congruence collectively. \\nMany things in the past few months, including the ridiculous antics of the US presidential election, have shown us what a ‘profane’ world resembles and this has pushed many people in the opposite direction, seeking the wisdom and empowerment of divinity. ‘Every dark potential does have a light purpose’, when we remember that the light is always there and the darkness always gives way to it. If the events of this year have revealed the profane to you, make an intentional choice to integrate the empowerment of divinity into your life. This is the month to do that. \\nMoving the profanity of 3D to the divine energy of 5D in November compels us to take action, which begins energetically. The process starts with the intention to allow new beliefs, new perspectives, and new alignments to become our energetic partners. Do we desire to have higher frequency energies, like joy, in our life? These are created when we agree to align with 5D energies. \\nI do have to mention the full moon of November 14, which is involves the Sun/Moon in Taurus/Scorpio and it’s at 22 degrees, echoing the eclipse degree of November 13, 2013, just after Saturn first entered Scorpio. If it feels like that pesky Scorpio energy won’t go away, it will hang around through the end of the year. It is part of the profound transformation that is in place to push us through these final stages of resistance to our ascension. \\nThen in 2017 we will have the occasional Scorpio reminder (it is, after all, one of the zodiac signs) but it won’t be the same intensity we have experienced since 2012. This is a very special full moon because the moon will be closer to the earth than it has been since 1948, so it will have extra impact. If you’re out and about you may want to pay extra attention to your driving and people may be very emotional and distracted. \\nWe have the usual ongoing energies happening this month too, including the ongoing Uranus/Eris square, and the wounded healer Chiron energy, but with a new focus, how do we put things together to create the new paradigms we have been wanting to align with and integrate? So much of our time has been spent in taking things apart this year, now it’s time to put them together – not in the same way, unless that’s what we want, but in new and different ways that serve our intention for joy, peace, love, abundance, fulfillment and, our theme for 2016, congruent harmony.November is a month for spiritual maturity, where we set aside the regrets of the past and begin to look forward to taking action in new directions, fully embracing our power to create a reality, and a world, in which spirit and human work together, in partnership, which is the only way we’re going to allow 5D energies in to stay. If we keep our focus on 5D integration – 3D is not disappearing or going away, ascension is an integration, not a takeover – we will start seeing progress this month. \\nBut November is not all work and no play, it’s also a month for joy and it can be a ‘joy ride’ if we are willing to stop working so hard to get the rest of humanity to align with the ascension energies and have some fun. That is going to be one of our missions in 2017, to lead from the lighter energy and frequency of joy, to be less of a light ‘worker’ and more of a light ‘beacon’, enjoying our own journey while we do the work of fulfilling our individual and collective transformation and ascension missions. \\nAnd remember we are already in the energy of 2017, the switch began in September so you don’t have to wait until January for your joyful new beginnings and fresh starts, you can put that into action right now. Ready, set, and let’s soar into our new 5D paradigms, it’s all set to go. And get in the driver’s seat, you are not a passenger in these new paradigms. Plus, being the driver means you control the speed and how fast you get to your destination. Time to put the ‘pedal to the metal’ and put all of our learning into action. Have a wonderful month. \\nThe November 2016 Energy Mastery class is November 4, 2016, where you’ll learn how to best use November’s energy (and what to avoid), along with energy exercises and our energy meditation. CLICK HERE to sign up, the call is live and recorded, worksheet is included too. \\nCopyright (c) 2016 by Jennifer Hoffman . All rights reserved. You may quote, copy, translate and link to this article, in its entirety, on free, non-donation based websites only, as long as you include the author name and a working link back to this website. All other uses are strictly prohibited. SF Source Enlightening Life Nov. 2016 Share this:'"}, "time": 1742628583.8131588}