{"duration": 0.03249716758728027, "input_args": {"text": "'Obama’s Team List: Muslims Named for Top Jobs – Christians Purposely Removed   \\nThe latest from top Clinton family friend and political aide John Podesta, courtesy of hacked emails released by WikiLeaks, is that President Obama’s transition team – the officials tasked with helping the then-senator move into the White House and set up executive shop, in the 2008-09 time period – made and maintained lists of Muslims who would be great for top jobs in the administration. \\nBut what’s more worrisome than this special interest revelation was that the emails seem to show the transition team members went out of their way to also keep off Christians. \\nTalk about preferential treatment. \\nThe Daily Caller reports: \\n“According to an email chain from 2008, John Podesta received lists of exclusively Muslims and Asians to be considered for jobs in the Obama administration. The email chain revealed that in this process, Middle Eastern Christians were purposefully excluded, or set aside in a separate list, with an aide writing, \\n“‘In the candidates for top jobs, I excluded those with some Arab American background but who are not Muslim (e.g., George Mitchell). Many Lebanese Americans, for example, are Christian. In the last list (of outside boards/commissions), most who are listed appear to be Muslim American, except that a handful (where noted) may be Arab American but of uncertain religion (esp. Christian).’ \\n“Also notable, there was concern that some of the Muslims suggested would not survive media scrutiny, with one aide writing, ‘High-profile Muslim Americans tend to be the subject of a fair amount of blogger criticism, and so the individuals on this list would need to be ESPECIALLY carefully vetted.’ \\n“She continues, ‘I suspect some of the people I list would not survive such a vet — but I do personally know, at least in part, virtually all of the candidates in the 1st two categories (but I know very few of those listed for outside boards/commissions).’ \\n“Within the lists themselves, candidates were further broken down \\nFOR ENTIRE ARTICLE CLICK LINK'"}, "time": 1742562526.1941025}