{"duration": 0.015833139419555664, "input_args": {"text": "\"Persian Gulf A protester throws a glass bottle containing paint at a police armored personnel carrier during anti-regime clashes in the village of Sitra, south of Manama, on February 14, 2016. (Photo by Reuters) \\nA court in Bahrain has imprisoned and revoked the citizenship of more than a dozen people after convicting them of terror charges as the ruling Al Khalifah regime continues with its heavy-handed crackdown on political dissidents in the tiny Persian Gulf kingdom. \\nOn Thursday, the Fourth High Criminal Court convicted two defendants to 15 years in jail and three others to 10 years behind bars each on charges of “forming a terror cell, running it and recruiting new members.” \\nSeven other people were slapped with seven years in jail each. Three others, namely Sheikh Mohammad Ali al-Tal, Mohammad al-A'ali and Ismail Abdulaziz, were sentenced to life imprisonment. \\nThe trio were also ordered to pay a cash fine of 200,000 Bahraini dinars (over $530,000). \\nThe court later revoked the citizenship of all the 15 defendants. \\nSeparately, Bahrain's Supreme Criminal Court sentenced two civilians to 5 years in prison on charge of holding an anti-regime protest in the small village of Jurdab earlier this year, and setting scrap tires ablaze. \\nThousands of anti-regime protesters have held numerous demonstrations in Bahrain on an almost daily basis ever since a popular uprising began in the kingdom on February 14, 2011. \\nThey are demanding that the Al Khalifah dynasty relinquish power and a just system representing all Bahrainis be established. \\nManama has spared no effort to clamp down on the dissent and rights activists. On March 14, 2011, troops from Saudi Arabia and the United Arab Emirates were deployed to Bahrain to assist the Manama government in its crackdown on peaceful protesters. \\nScores of people have lost their lives and hundreds of others sustained injuries or got arrested as a result of Al Khalifah regime’s crackdown on anti-regime activists. Loading ...\""}, "time": 1742628575.815341}