{"duration": 0.08843517303466797, "input_args": {"text": "'Megyn Kelly will leave her position as one of Fox News’ top anchors to take on a role at NBC News. [Kelly will headline her own afternoon news program at NBC News as well as a primetime “ ” Sunday night news show, according to the New York Times. The    anchor will also appear on NBC News panels during coverage of marquee political events.  “While I will greatly miss my colleagues at Fox, I am delighted to be joining the NBC News family and taking on a new challenge,” Kelly wrote Tuesday in a post on her Facebook page. “I remain deeply grateful to Fox News, to Rupert, Lachlan and James Murdoch, and especially to all of the FNC viewers, who have taught me so much about what really matters. More to come soon. ” In leaving Fox, Kelly will turn down Lachlan and James Murdoch’s reported $20 million per year contract offer, a figure that other networks have said they are unable to match. Kelly’s new salary at NBC News was not disclosed, but she is likely to remain one of the   journalists in television news. In a recent interview with the Washington Post, Kelly hinted at dissatisfaction with her current role at Fox, where she has consistently ranked among TV news’ highest ratings drivers, along with fellow anchor Bill O’Reilly. Kelly told the Post that she wanted a job with more amenable hours to ensure she could spend more time with her children: “My next deal is all about greater balance,” she told the paper’s Erik Wemple. A source close to the negotiations told the New York Times that NBC News chairman Andrew Lack won what was reportedly a network bidding war for Kelly’s services by asking her what she wanted from a new job instead of simply explaining what his network could offer her. The move to NBC caps a tumultuous year for Kelly at Fox News, the network she joined in 2005. During the first GOP presidential debate, the anchor “became the story,” as she put it to the Post, when she challenged    Donald Trump with a question about his past treatment of women, which led to months of headlines and an eventual reconciliation. In her   first memoir, Settle for More, Kelly accused former Fox News chief Roger Ailes of sexually harassing her shortly after she arrived at the network in 2005. In the book, Kelly accused Ailes  —   who resigned from the network over the summer after multiple women, including former anchor Gretchen Carlson, made similar accusations  —   of engaging in a “cat and mouse” game with her and making “sexually charged comments” toward her. She also accused Ailes of at least one incident in which he allegedly grabbed her and tried to kiss her on the lips. Ailes has vehemently denied all of the allegations. The anchor has also increasingly butted heads with O’Reilly, the other star at Fox News and host of the   O’Reilly Factor. In November, O’Reilly criticized the anchor for publicizing the sexual harassment allegations against Ailes. “If somebody is paying you a wage, you owe that person or company allegiance. You don’t like what’s happening in the workplace, go to human resources or leave,” he told CBS This Morning, without mentioning Kelly by name. O’Reilly later backtracked, calling Kelly a “very smart, talented woman. ” Kelly, for her part, said her relationship with O’Reilly had grown more “competitive” over the years: “We are both Irish, we’re both Catholic, and we’re both very competitive. So the dynamic has changed. But I really will always be grateful to Bill,” she told the Hollywood Reporter in November. In December, a source at Fox News told Breitbart News exclusively that staffers inside the network’s headquarters were growing increasingly irate with the media focus on Kelly and her possible career moves. “Everybody in the building is sick of it. We absolutely can’t stand it anymore,” the source said. It was not immediately clear when Kelly’s new position at NBC News would commence. The anchor’s contract with Fox News is set to expire this summer. A representative for Kelly did not immediately respond to a request for comment.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564318.1066356}