{"duration": 0.03165149688720703, "input_args": {"text": "'¿Quién es Mariano Rajoy, el nuevo presidente de España? TODO LO QUE DEBES SABER SOBRE EL POLÍTICO QUE DIRIGIRÁ ESPAÑA Presidente del Gobierno \\nEl próximo presidente de España es, ante todo, el hombre de confianza de los socialistas. El PSOE ha aupado su candidatura pese a tener un perfil poco conocido por los españoles. Muchos ignoran, por ejemplo, que este individuo ha sido presidente del Ejecutivo durante los últimos cuatro años. Aquí está todo lo que necesitas saber sobre nuestro próximo presidente. \\nNombre : Su nombre es Mariano Rajoy, aunque en Pontevedra, donde se crió, se le conoce también como ‘El rompehuesos de Pontevedra’, ‘El Martillo’ o ‘El trumpito guasón’. \\nEsposa : No. \\nPartido político : Partido Popular, PSOE, Ciudadanos, Convergència i Unió, Asociación de Lucha Canaria Pontevedra. \\nMúsica : ‘Mi gran noche’ de Raphael. \\nNacimiento : Pese a que él mismo considera que su tierra natal es Pontevedra, nació en Albania en 1467. \\nFamilia : Se cree que tiene cinco hijos que se llaman Amanda, Kevin, Señor José, Alejandro y El Bebé. Su perfil familiar ha sido del agrado de los grandes partidos españoles, motivo por el que se creyó que su candidatura podría llegar a buen puerto. Su hijo mayor, Kevin, es animador del videojuego EA Sports. \\nSegún ciertos rumores, tiene un primo que es Premio Nobel de Física. \\nHabilidades : Sabe pilotar helicópteros. \\nTwitter : Es un tuitero activo en @marianokrystal. \\nMayor miedo : Los hombres atractivos y seguros de sí mismos. \\nProfesión : Ocupa el cargo de registrador de la propiedad en Santa Pola. Según dicen los que le conocen, este cargo para él es mucho más que una afición. Lo considera su auténtica profesión y saca adelante las tareas de presidencia durante la hora de la comida o los fines de semana. \\nEslogan de campaña : ‘Tsh, tsh, espera… dónde vas… a ver… espera. No… bueno, déjame a mí. No, ahora no. Tú déjalo y yo, cuando eso, pues ya… Vale, como quieras, yo qué sé’. \\nControversias : Esparció hilillos de plastilina por toda la costa gallega. Es persona non grata en Pontevedra porque propinó un puñetazo a un adolescente durante un examen de lengua. \\nAficiones : Fuma cigarros puros de fuerte olor a arenque. \\nPolítica : En 2015 hizo alcalde a un vecino. \\nOcupación previa : Presidente de España. \\nFirma :'"}, "time": 1742628586.6271226}