{"duration": 0.21608948707580566, "input_args": {"text": "'The main reason for the gender gaps at work  —   why women are paid less, why they’re less likely to reach the top levels of companies, and why they’re more likely to stop working after having children  —   is employers’ expectation that people spend long hours at their desks, research has shown. It’s especially difficult for women because they have disproportionate responsibility for caregiving. Flexibility regarding the time and place that work gets done would go a long way toward closing the gaps, economists say. Yet when people ask for it, especially parents, they can be penalized in pay and promotions. Social scientists call it the flexibility stigma, and it’s the reason that even when companies offer such policies, they’re not widely used. A new job search company, Werk, is trying to address the problem by negotiating for flexibility with employers before posting jobs, so employees don’t have to. All the positions listed on the Werk site, including some from Facebook, Uber and Samsung, are highly skilled jobs that offer some sort of control over the time and place of work. People can apply to jobs that let them work away from the office all the time or some of the time, and at hours other than    part time or with minimal travel. Another option gives workers the freedom to adjust their schedules, no questions asked, because of unpredictable obligations, like a sleepless night with a toddler or a trip to the emergency room with an older parent. “Nobody wants to be the female in the department who says, ‘My kid threw up on me this morning I can’t come in,’ ” said Annie Dean, who worked as a lawyer before starting Werk with Anna Auerbach, a former consultant. “Eighty percent of companies say they offer flexibility, but it’s a black market topic. You raise it and you’re not taken seriously. ” For now, Werk is a limited experiment. Most of the employers are small companies, and it is aimed at an elite group of women  —   highly educated and on a leadership track. But it could provide lessons for how to improve work and make it more equal for a broader group. Women who have less education or are paid hourly wages have significantly less flexibility than professional women to begin with. It makes working and caregiving that much harder. Motherhood presents a different challenge for the elite women that Werk was made for. The careers that pay the most and require the most education, like business and law, also have the most gender inequality. Why? Economists have found it’s a result of the long hours and limited flexibility. When educated mothers leave their jobs, it’s often because they feel pushed out by inflexible employers, according to sociologists. It’s a big reason the top of corporate America is still so male 4 percent of the chief executives of companies in the S. P. 500 are women. “They want top leadership roles,” said Ms. Dean, who thought of the idea for Werk with Ms. Auerbach after they each had children. “The only reason they’re not getting there is they’re going through this phase in their life where working 16 hours at a single desk is incompatible with their life. ” Seventy percent of working mothers say having a flexible work schedule is extremely important to them, according to a Pew survey. So do 48 percent of working fathers. Workplace flexibility reduces turnover and   conflict, according to much of the research, including a study by 10 researchers from seven universities published in December. Yet when people get flexible work arrangements, they’re generally isolated cases  —   for longtime employees whom companies trust and don’t want to lose. The employers using Werk say they get access to highly skilled employees who might not otherwise apply. Gerard Masci, founder and chief executive of Lowercase, a   eyeglass maker in Brooklyn, just hired a vice president for communications on Werk. She works   and remotely, except for monthly   meetings. “I don’t care if this week you work less if in a month you work more, and whether they work in the space or not is irrelevant,” Mr. Masci said. “All I care about is the productivity in the end. ” “The happier she is in her flexibility,” he said, “the more engaged she’s going to be in her work. ” Erin Fahs turned to Werk after her husband was transferred to Fort Myers, Fla. and she needed to find a new job. She wanted to work part time and from home because she was pregnant and the primary caregiver for their    daughter. She found three jobs on Werk that would let her do that, and took one as the business manager for the Collective Good, which does consulting for nonprofits. “Getting to have those direct conversations with the C. E. O. about what matters made it so much different from when I was applying for jobs earlier in my career,” Ms. Fahs, 33, said. She has a baby sitter 10 hours a week and works the other 10 hours when her daughter is sleeping. She has a few set meetings, which she attends via Google Hangouts  —   and gives her daughter an iPad for a diversion if there is a work emergency. She plans to expand to   work after maternity leave. This type of flexibility, while valuable, would not magically solve workplace problems. For one, any solution would need to be for both women and men. Some jobs have to be done at a certain time and place, like teaching and food service. And even at companies where it’s possible to let employees work at the time and place of their choosing, a different type of manager is required. Best Buy tried it for corporate employees, then revoked it. “There are a vast number of jobs that could be handled in an    way, but it’s just easier to measure performance by presence,” said   Slaughter, the chief executive of the think tank New America, who has written about gender and work and advises Werk. “So it is a real adjustment for managers. ”'"}, "time": 1742564378.3806627}