{"duration": 0.15155482292175293, "input_args": {"text": "'Why Donald Trump Must Shut Down The Federal Reserve And Start Issuing Debt-Free Money By   16th, 2016 \\nIf Donald Trump truly wants to fix the economy, he must shut down the Federal Reserve. If he just tries to patch up our current system, he will fail, because it has been fundamentally flawed from the very beginning. A little over a century ago, very powerful forces on Wall Street convinced Congress to completely restructure our financial system. An immensely powerful central bank known as the Federal Reserve was created, and the goal was to transform the U.S. dollar into a debt-based currency that would continuously be inflated and to create an endless debt spiral from which   could never possibly escape. Sadly, they were successful on both counts. Since the creation of the Federal Reserve, the value of the U.S. dollar has declined by approximately 98 percent and our national debt has gotten more than 5000 times larger . \\nAmericans tend to give most of the credit or most of the blame for the performance of the U.S. economy to our presidents, but the truth is that an unelected, unaccountable group of central bankers has far more power over our economy than anyone else does. The Federal Reserve has become known as “ the fourth branch of government “, but unlike the other branches of government we are told that the Fed’s decisions are “above politics” because they are “too important”. Fed officials fiercely guard their “independence”, and they fiercely resist any “interference” from Congress, the President, or the American people. \\nDonald Trump can try to lower taxes and reduce regulations, but what he will be able to do to influence the economy pales in comparison to the immensely powerful tools that the Fed wields. The Fed controls interest rates, the Fed controls the money supply, and the Fed regulates the banks. \\nTo give you an idea of how enormously powerful the Fed is, I want you to pull out a dollar bill. \\nAs you look at that dollar bill, I want you to notice that it says “Federal Reserve Note” right at the top. \\nIn the financial world, a “note” is an instrument of debt, and the truth is that our system was designed to create as much debt as possible. \\nSo why are we using debt-based “Federal Reserve Notes” in the first place? Shouldn’t Congress have control over our currency? \\nAccording to Article I, Section 8 of the U.S. Constitution , it is Congress that has the authority to “coin Money, regulate the Value thereof, and of foreign Coin, and fix the Standard of Weights and Measures”. \\nSo how did the Fed get involved? \\nWell, it is a very long and convoluted story, and if you are interested in the history behind it I would commend to you an excellent book by C. Edward Griffin entitled “ The Creature from Jekyll Island: A Second Look at the Federal Reserve “. Basically, big money interests on Wall Street got their hooks into the White House and Congress, and they rushed through legislation right before Christmas in 1913 that created this insidious central banking system that was designed to slowly but surely take wealth from the American people and put it into their hands. \\nSadly, most Americans don’t even realize that we have a debt-based currency, nor do they understand where our money comes from. In a previous article , I discussed how money is normally created by the Federal Reserve under our current system… \\nWhen the U.S. government decides that it wants to spend another billion dollars that it does not have, it does not print up a billion dollars. \\nRather, the U.S. government creates a bunch of U.S. Treasury bonds (debt) and takes them over to the Federal Reserve. \\nThe Federal Reserve creates a billion dollars out of thin air and exchanges them for the U.S. Treasury bonds. \\nThe Federal Reserve takes the U.S. Treasury bonds that it receives in exchange for the “Federal Reserve Notes” that it gave to the government and it auctions off those bonds to the highest bidder . But of course this process always creates more debt than it does money… \\nThe U.S. Treasury bonds that the Federal Reserve receives in exchange for the money it has created out of nothing are auctioned off through the Federal Reserve system. \\nBut wait. \\nThere is a problem. \\nBecause the U.S. government must pay interest on the Treasury bonds, the amount of debt that has been created by this transaction is greater than the amount of money that has been created. \\nSo where will the U.S. government get the money to pay that debt? \\nWell, the theory is that we can get money to circulate through the economy really, really fast and tax it at a high enough rate that the government will be able to collect enough taxes to pay the debt. \\nBut that never actually happens, does it? \\nAnd the creators of the Federal Reserve understood this as well. They understood that the U.S. government would not have enough money to both run the government and service the national debt. They knew that the U.S. government would have to keep borrowing even more money in an attempt to keep up with the game. \\nSo our debt just keeps going up and up and up. While Barack Obama has been in the White House our national debt has risen by more than 9 trillion dollars, and at this moment it is sitting just under the 20 trillion dollar mark . \\nBut we shouldn’t be surprised by this, because this is precisely what the Federal Reserve system was designed to do to us. \\nMany conservatives still hold to the mistaken illusion that we could somehow pay all of this debt back someday, but as I have shown in a previous article, this is mathematically impossible to do . \\nIf the government went out today and grabbed every single dollar in existence we could not pay back the national debt, and of course we have   of household debt,   of corporate debt and   of state and local government debt that we need to pay back as well. \\nUnder the current system our only hope is to keep the wheel spinning by continuing to devalue the dollar and by continuing to go into even greater amounts of debt. \\nAnd of course it isn’t just the United States that is in this predicament. At this point, almost every single nation on the entire planet has a central bank. \\nEven though there are extremely sharp disagreements among nations on virtually everything else, somehow central banking has achieved nearly universal adoption. \\nAs you read this article, well over 99.9% of the population of the globe lives in a country that has a central bank. \\nDo you think that is just a coincidence? \\nOf course there are still a few very small countries such as the Federated States of Micronesia that do not have a central bank, but the only big nation not to have one is North Korea. \\nAnd you would literally have to be insane to want to live in North Korea. \\nBut now we have an opportunity to get free from this insidious system. The truth is that we don’t have to have a central bank. In fact, the greatest period of economic growth in U.S. history was when there was no central bank . \\nWe don’t need central planners to set our interest rates and to manipulate our money supply. They will never admit this, but the reality of the matter is that their interference in the economy often creates tremendous economic busts. \\nSince the Federal Reserve was created in 1913, there have been 18 distinct recessions or depressions : 1918, 1920, 1923, 1926, 1929, 1937, 1945, 1949, 1953, 1958, 1960, 1969, 1973, 1980, 1981, 1990, 2001, 2008. \\nConsidering their track record, isn’t it time for a change? \\nAnd we don’t have to have a debt-based currency. In fact, not too long ago we had a president that decided to start issuing debt-free “United States Notes”. \\nBack in 1963, President John F. Kennedy issued Executive Order 11110 which authorized the U.S. Treasury to issue debt-free “United States Notes” which were directly created by the U.S. government. \\nHe was assassinated shortly thereafter. \\nMost Americans don’t realize this, but many of the debt-free United States Notes that were issued under President Kennedy are still in circulation today , and President Trump could do something similar. \\nBut will he? \\nIt has been said that the borrower is the servant of the lender, and the Federal Reserve system has turned all of us into debt slaves. \\nDebt is a form of social control, and the global elite use all of this debt to dominate the planet. The total amount of debt in the world just hit   of 152 trillion dollars , and the longer we allow the central banks to control the system the bigger this debt bubble will become. \\n  here in the United States that starts with shutting   issuing debt-free currency. It would take someone very bold to make a move like this, and so let us hope that the man that we just elected is up to the task.'"}, "time": 1742561886.2502356}