{"duration": 0.038543701171875, "input_args": {"text": "'Posted on October 30, 2016 by DCG | 2 Comments \\nAin’t multiculturalism grand? \\nFrom Express UK : The Ethiopian vicar was visiting the town of Raunheim on the outskirts of Frankfurt when the pre-teens started throwing stones at him. \\nDressed in traditional priest’s gear and wearing a cross around his neck, the 47-year-old was walking to the Russian Orthodox chapel in Frankfurter Straße with a local priest, who wished to remain anonymous, when he was attacked. \\nThe three children, aged between 10 and 12-years-old, shouted “Allahu Akhbar” as they threw the stones , the other priest who was visiting from a nearby church said. Both priests tried to take photos of the children with their mobile phones, but the youngsters were too quick and managed to escape. \\nAlexandra Rang, a Russian Orthodox hotel owner who built the chapel a few years ago, said she could not believe what the two priests told her at first. She said to be pelted with stones is the “worst thing a priest can imagine”. \\nRaunheim social worker Dr. Isack Majura said he was going to do everything possible to get hold of the children. He said: “What happened is absolutely unacceptable.” \\nMunicipal staff said different religious groups in Frankfurt are generally on good terms and they are treating the incident as isolated . He said there has been a strong Christian-Muslim dialogue between the local mosque and church communities which has been cultivated over many years. \\nGermany is facing a crisis following Chancellor Angela Merkel’s open-door migrant policy which saw more than 1.1million refugees entering the country last year. \\nShe is now backtracking on the policy, closing up some of Germany’s borders, but in some areas the impact is being heavily felt. \\nYesterday, Express.co.uk revealed pupils at a girl’s primary school in the German ski resort of Garmisch-Partenkirchen are being forced to chant “Allahu Akhbar” and “there is no God but Allah”. A father of a pupil claimed his daughter had been “ forced ” by teachers to memorise the Islamic chants. \\nWeeks before, parents complained their children’s nursery was refusing to acknowledge “Christmas rituals” such as putting up a Christmas tree or singing carols to accommodate the “diverse cultures” of other pupils. \\nThe school said they made the decision because the majority of children at the kindergarten are not Christian. \\nMigrants now outnumber native children in many Germany schools. \\nDCG'"}, "time": 1742628505.1462271}