{"duration": 0.04893231391906738, "input_args": {"text": "'The New York Times Magazine recently ran a story declaring Silicon Valley to be the “center of   resistance. ”[The article, written by Farhad Manjoo, is titled “Can Facebook Fix Its Own Worst Bug?” and poses the question: “Mark Zuckerberg now acknowledges the dangerous side of the social revolution he helped start. But is the most powerful tool for connection in human history capable of adapting to the world it created?”  The article discusses the mood in Silicon Valley days before Donald Trump’s inauguration, describing the general mood as “grim. ” But Facebook founder Mark Zuckerberg was reportedly quite positive about the future, describing 2016 as an “interesting year for us [Facebook]. ” The article later describes Silicon Valley’s detachment from real world events, saying, “In Silicon Valley, current events tend to fade into the background. The Sept. 11 attacks, the Iraq war, the financial crisis and every recent presidential election occurred, for the tech industry, on some parallel but distant timeline divorced from the everyday business of digitizing the world. ” But the election of Donald Trump caused many in Silicon Valley to suddenly take notice of the political world, “Then Donald Trump won. In the 17 years I’ve spent covering Silicon Valley, I’ve never seen anything shake the place like his victory,” Manjoo writes. “In the span of a few months, the Valley has been transformed from a politically disengaged company town into a center of   resistance and fear. ” “A week after the election, one   founder sent me a private message on Twitter: ‘I think it’s worse than I thought,’ he wrote. ‘Originally I thought 18 months. I’ve cut that in half,’” Manjoo recalls. “Until what? ‘Apocalypse. End of the world. ’” The description of Silicon Valley as the “center of   resistance” is unsurprising, Google employees and executives previously held rallies at Google offices across the United States in protest of President Trump’s temporary travel halt from nations associated with terrorism.  yo Breitbart, stop being racist, sexist, and xenophobic. #NoBanNoWall, A post shared by JLR II (@jimmyramirez) on Jan 30, 2017 at 7:13pm PST,  Google CEO Sunar Pichai spoke to the crowd about the difficulties that the company faces when attempting to deal with visa complications that many of their foreign employees encountered. “Every step, I felt the support of 65, 000 people behind me,” he said. “There are some values that you should never be compromising on, we need to stand together. The fight will continue. ” In documents released by WikiLeaks, Eric Schmidt, the executive chairman of Google parent company Alphabet, expressed interest in acting as “head outside advisor” to the Clinton campaign during the presidential election. WikiLeaks founder Julian Assange previously characterized Google as “directly engaged” in the campaign. Specifically, Assange claimed, “The chairman of Google, Eric Schmidt, set up a company to run the digital component of Hillary Clinton’s campaign. ” Lucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan_ or email him at lnolan@breitbart. com'"}, "time": 1742562344.053225}