{"duration": 0.10847997665405273, "input_args": {"text": "'MEXICO CITY  —   For months, President Trump warned Mexicans that the Nafta they had enjoyed for decades would soon be a thing of the past. He cowed manufacturers into shifting their investments from Mexico to the United States. He told Mexican leaders that he would cancel the trade agreement and levy punishing tariffs unless they capitulated to his demands in overhauling it. So, when a draft letter suggesting a softening of his views began circulating among members of Congress this week, Mexicans expressed a range of reactions, from welcome relief to cool, wonky reason to dark mistrust. The draft letter, signed by the acting United States Trade Representative, Stephen Vaughn, seemed to propose keeping much of the agreement in place. The language was bureaucratic and technical, devoid of the emotion and invective that has characterized many of Mr. Trump’s comments about Nafta, which he has described as “the worst trade deal” ever signed by the United States. Some Mexicans welcomed the shift in tone and viewed the document, however provisional, as a constructive step in the right direction. “The tone has changed and that should calm us all,” Fernando Ruiz, head of the Mexican Council for Foreign Trade, Investment and Technology, said Friday. The generic nature of the document “helps cool the waters, it gives us more tranquillity rather than uncertainty. ” But some also warned that the draft was by nature bureaucratic, not political. They cautioned that with months to go before negotiations could begin, and with the mercurial Mr. Trump at the helm, anything could happen. “I don’t think anyone really has a clue what’s really going to happen,” said Agustín Barrios Gómez, a former Mexican congressman and the president of the Mexico Image Foundation, which is dedicated to promoting Mexico’s reputation abroad. “There’s this entire optimism that the wolf isn’t going to blow the house down, but it could be toppled over in one tweet. ” Trump administration officials seemed to encourage this caution, perhaps as a negotiating ploy, emphasizing that the draft was just a draft. Sean Spicer, the White House press secretary, even went so far as to seemingly disavow the document as a reflection of the administration’s objectives in the negotiation. “That is not a statement of administration policy,” he told reporters on Thursday. “That is not an accurate statement of where we are at this time. ” Mr. Spicer’s comments only replenished Mexico’s deep reservoir of wariness and resentment toward Mr. Trump, sentiments that took root with force starting with the debut of his presidential campaign, when he took shots at Mexican immigrants. His vow to build a border wall  —   and make Mexico pay for it  —   became a rhetorical motif of his candidacy, firing up his supporters and inflaming   sentiment. And he has long accused Mexico of “taking advantage” of the United States under Nafta, or the North American Free Trade Agreement. This history has given some officials and business leaders pause when considering the draft letter this week. “We don’t want to let our guard down,” said Moisés Kalach, who is in charge of trade issues for Mexico’s main business alliance, the Business Coordinating Council. The Mexican business community, he added, was preparing for all negotiating proposals. The administration of Mexico’s president, Enrique Peña Nieto, did not comment publicly on the letter. The Mexican government has said it is committed to preserving Nafta and protecting the $1. 4 billion in bilateral trade that crosses the border every day, though it has said it is open to modifications. The Peña Nieto administration has argued that any renegotiation of the deal be accompanied by talks over a range of bilateral issues, including border security and immigration. Mexican officials and business leaders have also said that if negotiations go downhill, they are prepared to walk away from Nafta. In the meantime  —   mindful of Mr. Trump’s   threats  —   Mexico has been exploring new trade deals with other countries and updating old ones. Several seasoned trade specialists in Mexico, among them former government officials, said the document circulating this week was encouraging. “I think it’s good news for Mexico,” said Beatriz Leycegui, a partner at the consultancy SAI and a former undersecretary for foreign trade in Mexico who participated in the Nafta negotiations. “I think this is a responsible letter, something that is indicating a willingness to cooperate, to work together in the competitiveness of the region, and this is extremely important for Mexico at a time when Mexico needs to have clarity and make progress on this front. ” Others, however, said there were items in the draft letter that could be particularly difficult for Mexico and could provoke a strong response here. Antonio   a senior adviser at Albright Stonebridge Group, an international consulting firm, and a former head of economic affairs at the Mexican Embassy in Washington, said he had concerns about several items in the letter, including a proposal for new tariffs if a surge of imports from one country threatens a domestic industry in another  —   which could be imposed if, say, one country’s goods flooded the other’s markets. “It could lead to    protectionism,” Mr.   said. “That particular issue would keep me up at night. ” Luz María de la Mora, professor of international studies at CIDE, a Mexico City university, and head of a consultancy focused on international commerce, said she found nothing in the letter that was “out of context, aberrant or particularly worrying. ” But she was troubled by Mr. Spicer’s comments. “Because when are we really going to know what the stance of the White House is?” she asked. “That is where all the uncertainty lies, more so than in the substance of this draft. ”'"}, "time": 1742563176.4300106}