{"duration": 0.23085665702819824, "input_args": {"text": "'Leave a reply \\nSimon Vorster & Jennifer Langstone – With the winds of change blowing full force, our experiences since mid-October’s Full Moon have reflected in stark clarity just how much of ‘the shift’ has already occurred within us, what is still left for us to emotionally and energetically integrate. In particular, the combined frequency of Uranus in Aries square Mars in Capricorn have served not only to bring to the surface any unhealthy stagnancy and energetic dis-ease within, but to make those feelings erupt from within in a way that cannot be ignored. This has created great change within and around us. \\nUnlike other shifts we have endured in recent years, the energy pattern throughout October brought not a subtle shift but an electric shock; a perceptual upgrade that changed the course of our lives and altered our energetic blueprint in ways that our logical minds may have struggled to comprehend. However, as this cycle comes to an end, today’s New Moon in Scorpio offers us great clarity into the deep transformation we have just experienced, as we find ourselves in new energetic territory. This is a place of completion and total renewal. Old cycles and patterns have now run their course, and in their absence, new directions are not only available for us but are now inevitable — and manifesting fast. \\nLet’s look at the astrological alignments that are currently reflecting our spiritual evolution. Venus and Saturn Conjunction in Sagittarius Square the Lunar Nodes \\nRe-establishing Balance and Forming New Emotional Directions \\nGenerally speaking, Squares reflect a change in direction and create the necessary evolutionary adjustments in our awareness to make it happen. \\nWith Saturn and Venus in conjunction, we can expect to feel very responsible and serious about what we value, what we stand for, and what we feel we need. Although this energy pattern and the inner process it reflects can bring great rewards for us on an emotional level, both Venus and Saturn squaring the Karmic Nodes of the Moon can create the dynamic of feeling emotionally ‘sea sick’, as we are literally changing the course of our lives. \\nSo what growth is this experience offering us? The process of transmuting the consciousness here on Earth is about balance between seemingly opposing forces. It is a process of integrating our higher awareness into this physical reality, and simultaneously breaking down the layers of energetic density in which we have previously resided. \\nWe are learning to experience life with our heart open and our being pulsating with creative power, and as a result, we must learn for the first time to see beyond the boundaries of our previously-held beliefs, limitations and emotional struggles. Nothing is actually as we once perceived it, and the current energy pattern is helping us to release the fears and programs that have steered our past, creating new and empowered new spaces within us that will enable us to experience more of the cosmic universe — and experience ourselves as the cosmic beings we are. \\nAs we move through this pattern we will begin to see shifts in our values, and in particular, where our personal attachments to the ideals and habits of the past no longer serve us. These shifts will become (and are already becoming) the foundation of unimaginable change in our life’s path. Although we may feel a little ‘sea sick’ through this process, or completely lost at sea, hold on tight and ride the wave. It can be difficult to recognize while sailing in uncharted territory, but over time we will see that this period is reshaping our direction in the most profound of ways. Jupiter in Libra Square Pluto in Capricorn Inconjunct Neptune in Pisces \\nFinding Your Center of Gravity \\nFurther reflecting this change in direction, this profound energy pattern will bring us clarity about the chaos we are seeing in the world today and, equally, a deep insight into the meaning and purpose of our lives here on Earth. In essence, these current alignments of Jupiter in Libra (square Pluto inconjuct Neptune) bring our awareness toward finding our natural, sustainable balance. This can be a tough process at times, as we release our fears and transcend our past ideals, and shake off what we thought was right for us and what no longer serves us — so finding our own center of gravity is essential during this time. \\nThe last quarter square Jupiter (natural philosophy) in Libra is making to Pluto (evolution) in Capricorn shows us the need to trust the process and find excitement (not fear) in our new direction. The tension underlying the collective unconsciousness is a by-product of mass fear propaganda and social engineering, which cultivates deep uncertainty around how we will move forward and indeed, around what is even possible. \\nThe key to navigating this period is to acknowledge that we have been conditioned to find our sense of security in the external; we place our comfort and therefore our power into external manifestations and hierarchical constructs. But, if we can learn to see our lives and our fate as our co-creation, supported and governed by natural and universal law, and influenced by situations and shifts more profound that we can’t yet understand or control, we learn to hold a secure space within us. We cultivate a stillness and a knowing inside us that comfortably rides the flow or life, and cannot and will not be drawn off that path and into darkness. \\nUltimately, that stillness becomes our security, the base line from which we create, influence and interact with the world around us. We no longer have to resist darkness, but rather, we create from our inner light. Linked to the energetic archetype of Capricorn (self-determination), this is not an easy feat. It may begin slowly and take time to integrate, however Mars (also in Capricorn) is currently adding the fire and drive we need as we move into this important process of integration. New Moon and Mercury in Scorpio Trine Neptune in Pisces \\nFinding Clarity in Chaos, and Integrating Stillness \\nThe New Moon in Scorpio (evolution and regeneration) phase can bring profound inner awakening experiences, as the frequency of Scorpio pulls our awareness into the undercurrent of subtle emotions and energies within our psyche. Today’s New Moon in Scorpio trine Neptune and the South Node in Pisces alignment adds an extra sensitivity to this New Moon, bringing even more heightened awareness to our current situation (both internal and external) and, equally adding uncertainty and chaos to the equation. \\nAgain, we can see the theme of needing to find balance in our lives and hold our emotional security within. The external world is changing very quickly, and it all seems like madness! Shifting your awareness back into yourself helps you to find stability. It is in this space that you can begin to see the metamorphosis taking place around us — from within us, and right from under us! Energetically, we are moving forward at an unprecedented rate, finding center — our center — helps us remember the core of what really matters, and therefore, what we do next. \\nAs Mercury also trines Neptune, we will have opportunities to clearly see (with ‘real eyes’) that what we comprehend with our minds is mostly conditioned but what we see with our inner vision comes from a much deeper place — one of higher knowing, of cellular remembrance. It is in this place that we find the answers, gifts and purpose we truly carry. \\nAt the heart of this New Moon is the theme of transcendence and metamorphosis. We are beginning to shift out of the struggle of fighting for something and we will begin to look what aspirations we want experience in our lives. It is no longer about resisting darkness, but creating from our inner light. This is a powerful new direction; it will begin to shift our awareness toward understand the deeper meaning of the evolutionary path we are on as a collective, and the amazing untapped potential we are just beginning to explore within ourselves. Individually, as we navigate this shift, each of us is altering the way we emotionally relate to the new world, and as a result, we are beginning to take active steps in new, future-creating ways. And the only way we can do this, and liberate ourselves from the mind-trap of the fear program, is by finding stillness and security within. New Moon Message – Emerging from the Cocoon \\nEach and every one of us has spent the past couple of years struggling in one way or another, and fighting for what we believe in. Pushed beyond our limits, we have all been broken numerous times, only to continue the struggle, to keep moving through, and to keep surviving. We have been learning about the deeper meaning of life and about what is worth standing up and fighting for. Most of us have had to face ourselves more deeply than we knew we could handle, and lost more than we knew we could live without, leaving us deeply aware that we are not the sole dictators of our destiny. \\nNow, that cycle has ended and we are now looking toward what gives our lives true meaning. There is a profound energetic shift occurring around us, and within us, which our conditioned minds (when left in the driver’s seat) struggle to comprehend, and yet, here we are, learning to live it and to make manifest our newfound meaning. We are being asked to look beneath what we have been struggling with and find the underlying reason for the struggle. We are seeing that there is a natural ending to everything; that everything in our physical reality will be exhausted at some point, everything will break down, or be lost, and yet the cycle of life and evolution will continue. \\nMost of all, we are realizing that we are not here to survive – none of us will! We are here to live ! Right now! It takes great courage to open one’s heart fully, and to live and love with the knowledge that we can, and ultimately will, lose everything. But remember: We are here to transcend the limitations of the conditioning that tells us we are powerless in physical 3D world. We are here to stand in the face of adversity, to ride the flow of this shift with all our being, and engage a new energy here on Earth. And most of all, we are here to experience consciousness in form; to know that the true meaning of our lives is found in our experiences, and our energy; and to know that the experiences we aspire in our hearts to create, and the energy with which we engage them, and not the physical things we can hold onto, and keep. \\nNo matter where you are, or what you have been facing in your life, it is now time to connect to the original dream that gives it all meaning; to the dream that has been there with you all along, bubbling beneath the surface of your daily challenges. Believe in the love and the passion you carry in this life, no matter how far from it you have traveled or how many times your luck has been broken along the way. These are moments to be cherished! \\nThis weekend, we connected with an old butterfly. His wings were aged and crumbling but he was magnificent and proud. He beautifully displayed the wisdom of the message we are sharing with you today — which is to live life to the fullest despite the odds that are seemingly against us, and despite the challenges, suffering and pain we might endure along the way. He reminded us of the nature of transformation and evolution. The butterfly has already once lost everything through a painful process of transmutation — of dissolving and recreating — and yet, it is only through that experience that he gains his wings to fly and the beautiful markings of his maturity. Then, emerging from his cocoon for the first time, he confronted that moment within himself before that first flight where he had to take the leap of faith. He had lived until then having never flown before — but he trusted the inner voice that told him to fly. And he is magnificent. \\nThat is a perfect symbolism of where we collectively find ourselves at this point in time. We have just been through the natural but agonising process of metamorphosis and lost all that we knew life to be. Now, like the butterfly, we are emerging from our cocoon, renewed and yet extremely raw — and we are being called by our deepest knowing to step out into the next cycle of our lives, and to embody the true beauty of our existence. \\nExperience every new moment with all that you have. Move on, let go of what has happened, and don’t fear what you have lost. Dream, and dream BIG! Aspire to experience greatness through the physical form, but not limited to it. We are taking our first flight in a new way of being, and we will only find the trust we need to do it in the stillness and security within. \\nBlessings, Simon & Jennifer \\nSimon Vorster is an evolutionary astrologer and teacher who has been practising astrology for over 11 years. Together with his partner and co-founder of Raising Vibrations, Jennifer Langstone , their work is rooted in helping souls de-condition the self and empower the soul into making new conscious choices. Through the website, Raising Vibrations Astrology , and the consulting services they offer, Simon and Jennifer share their thoughts and insights and, using the powerful tool of evolutionary astrology, help and guide others to find their own spiritual paths, live authentically in the moment and understand ways they are able to positively effect their own spiritual evolution. SF Source Wake Up World Nov. 2016 Share this:'"}, "time": 1742561950.2263956}