{"duration": 0.08159708976745605, "input_args": {"text": "'Waking Times \\nIn the background of modern life, as people go on debating politics and working for a living, something dreadful is happening to the eco-systems which support us. Major disasters like the ongoing radioactive leak at Fukushima , the apocalyptic fires burning throughout Indonesia , even bee colony collapse disorder , seem to fall out of view in day-to-day life, as we seem to have lost our power and will to directly participate in the stewardship of planet earth. \\nA new crisis is now happening all around us affecting trees. It appears that millions, hundreds of millions even, of trees are dying in North America and around the world from a basket of reasons, promising to completely and permanently alter the landscape and environment around us. \\nTree are among the most abundant and the most critical organisms on planet earth, and only recently have we been able to assess just how many trees inhabit planet earth. A study published in 2015 gave us this picture: \\n“A new study published in Nature estimates the planet has 3.04 trillion trees. The research says 15.3 billion trees are chopped down every year. It also estimates that 46% of the world’s trees have been cleared over the past 12,000 years.” [ Source ] \\nNow in 2016, alarm bells are ringing and in California alone, the problem has become incredibly severe: \\n“The U.S. Department of Agriculture (USDA) announced today that the U.S. Forest Service has identified an additional 36 million dead trees across California since its last aerial survey in May 2016. This brings the total number of dead trees since 2010 to over 102 million on 7.7 million acres of California’s drought stricken forests. In 2016 alone, 62 million trees have died, representing more than a 100 percent increase in dead trees across the state from 2015. Millions of additional trees are weakened and expected to die in the coming months and years.” [ Source ] \\nA New York Times feature on trees in California warns us that many of the state’s trees were already dead before forest fires moved in, thereby making the fire situation worse. Beyond California \\nMany of the tree deaths in Northern California have been linked to Sudden Oak Death in addition to an ongoing drought, but, the tragic die-off of trees is far from limited to California. In 2010, Hawaii’s well ohi’a trees began to die on the Big Island due to a disease now referred to as ohi’a disease, and scientists still don’t understand its origins or how to treat it. These are just a few examples of many in a wave of issues killing trees in many parts of America and around the world. \\n‘The plight of the ohi’a is not unique – it’s part of a quiet crisis playing out in forests across America. Drought, disease, insects and wildfire are chewing up tens of millions of trees at an incredible pace, much of it driven by climate change.” [ Source ] \\nEntire mountainsides are dying off in short order, leaving a bleak future for wildlife and residents. Some speculate that the widespread loss of trees due to such a wide conflagration of issues is a sign that trees, the most rugged of all plants, are in general weakened from an environment under complex attack by pollution and even climate engineering projects. \\n“In California and in other parts of the world, many are making the connection between climate engineering these tree die-offs. Also known as geoengineering , this is the modification of the earth’s atmosphere with the supplementation of compounds and chemicals, ostensibly as a means of favorably influencing the climate.” [ Source ] \\nCould be, although there is nothing like a consensus on the issue of why trees are in such a weakened state that so many are succumbing to so many issues. Thousands of trees killed by mountain pine beetles in western Rocky Mountain national park. \\nA Planet Out of Balance “Natural ecosystems have been altered in various ways by nitrogen, sulfur, and mercury deposited in rain, snow, or as gases and particles in the atmosphere. Through decades of scientific research, scientists have documented how local, regional, and global sources of air pollution can produce profound changes in ecosystems. These changes include acidification of soils and surface waters, harmful algal blooms and low oxygen conditions in estuaries, reduced diversity of native plants, high levels of mercury in fish and other wildlife, and decreased tolerance to other stresses, such as pests, disease, and climate change.” – Issues in Ecology , Fall 2011 Edition –“Setting Limits – Using Air Pollution Thresholds to Protect and Restore U.S. Ecosystems” The web of life cannot be damaged in one area without the effects being felt elsewhere. Just as bees and other insects are dying off en masse by a number of causes, some known and unknown, trees are also harbingers of the health of our planet. With such little attention given to the state of this earth and so much attention given to the human and political dramas that occupy our attention 24/7, will the human race wake up and react in time to avert a major planetary crisis? What are your thoughts on this important and pressing issue? Please leave your comments below, and share this article far and wide. Read more articles by Alex Pietrowski . About the Author \\nAlex Pietrowski is an artist and writer concerned with preserving good health and the basic freedom to enjoy a healthy lifestyle. He is a staff writer for WakingTimes.com and Offgrid Outpost , a provider of storable food and emergency kits . Alex is an avid student of Yoga and life. \\nThis article ( Not Just Bees, Trees Are Dying Off at an Alarming Rate With Little Public Attention ) was originally created and published by Waking Times and is published here under a Creative Commons license with attribution to Alex Pietrowski and WakingTimes.com . It may be re-posted freely with proper attribution, author bio, and this copyright statement. \\n~~ Help Waking Times to raise the vibration by sharing this article with friends and family…'"}, "time": 1742564479.7374196}