{"duration": 0.016020536422729492, "input_args": {"text": "'Britain’s new terrorism watchdog Max Hill has expressed “enormous concern” about returning jihadis, warning that Islamic terrorists have UK cities in their sights for future attacks. [Mr Hill, who was unveiled last week as the new independent reviewer of terrorism legislation, told the Sunday Telegraph that there was an “enormous ongoing risk which none of us can ignore”.  One of Britain’s leading prosecutors, he said the risk of terror in Britain is at its highest since the 1970s. He cautioned that “it would be wrong to draw a simple comparison between Irish republicanism and the ideology of   Islamic State. “But in terms of the threat that’s represented, I think the intensity and the potential frequency of serious plot planning  —   with a view to indiscriminate attacks on innocent civilians of whatever race or colour in metropolitan areas  —   represents an enormous   risk that none of us can ignore. ” Mr Hill, whose appointment follows a 30 year legal career, also expressed concern over the imminent return to Britain of hundreds of jihadis who have been fighting with Islamic State in Iraq and Syria. “It’s an enormous concern that large numbers  —   we know this means at least hundreds of British citizens who have left this country in order to fight  —   are now returning or may be about to return,” Mr Hill said. “Of course the imminent fall of Mosul and perhaps the prospective retaking of Raqqa are both bound to lead to a higher instance of returning fighters. Does that mean that the British public need to be immediately alarmed at a spike in terrorist activity within this country? “The answer to that is, I don’t know, but it doesn’t follow as a matter of fact that those who chose to go to live or fight abroad will bring that fight back to this country. ” Mr Hill further cautioned that British teenagers are being “radicalised by hate speech online”. But he defended ministers who approved the reported £1 million payout to Ronald Fiddler  —   the former Guantanamo detainee who this month carried out a suicide bomb attack. Figures disclosed by the Home Office in May last year showed that just one in eight jihadis who fought in the Middle East for extremist groups had been successfully prosecuted. Earlier this week a National Front member was sentenced to five years jail after making a series of offensive posts online, and distributing racist stickers and posters near his house. “We are as committed to apprehending and prosecuting far right extremists who commit terrorist offences and promote hatred as we are those who support and promote Islamic State. Both are intent on destroying communities and pose a real risk if they are allowed to continue” said Dean Haydon of the Counter Terrorism Command following the verdict.'"}, "time": 1742628553.0300515}