{"duration": 0.03161931037902832, "input_args": {"text": "'Tuesday on his nationally syndicated radio show, conservative talker Rush Limbaugh expressed his frustration with what he perceived to be a “cave” by President Donald Trump on securing funding for his   border wall.  The Trump administration had proposed $1 billion for the wall in a spending bill, which if passed by Congress and signed into will by Friday, will prevent a government shutdown. However, Democrats have said they would not vote for a bill that included such funding, and reportedly the White House has backed off of its push for that funding because of it. Limbaugh warned against caving to Democrats out of fear that Republicans would be blamed for the shutdown and insisted if there were such a cave this   Democrats would use similar tactics against the White House and congressional Republicans in the future. Transcript as follows: I’m not happy to have to pass this on. I’m very, very trouble to have to pass this on. And I want to say at the outset that I hope my interpretation is wrong and I hope this is not the case but it looks like from here, right here, right now  —   it looks like President Trump is caving on his demand for a measly $1 billion from the budget for his wall on the border with Mexico. The Democrats are threatening a government shutdown. It’s the same old, same old and I was hoping that Trump would throw this shutdown thing right back in their face and have everybody realize they’re the ones engineering these shutdowns that nobody would notice anyway unless a big hullaballoo was made about it. The Democrats seem to have successfully used this stupid silly threat of a government shutdown to get their way. What Trump is saying is if we need to get this done, I’ll delay the spending on the wall until September. And it’s just a measly billion dollars. But the problem here is folks  —   is one of politics. If this happens  —   if Trump does, and I use the word ‘cave’ guardedly  —   Trump I am not sure think he caves on anything. But outward appearances are what they are and the bottom line is if he is willing to withdraw a demand of his for a measly billion dollars, for the wall because the Democrats are threatening a shutdown, then the Democrats will just have learned that this threat works on Trump, too  —   not just all the other Republicans. We know of the threat of a government shutdown  —   once it’s even whispered in the   media, paralyzes the Republican Party. And then they spring into action trying to assure everybody that we’re not going to shut down the government. And whatever the Democrats need  —   the Democrats, the losers in the last election  —   whatever they need is what we’re going to do if we have to avoid a government shutdown because the Republicans think the media is going to blame us even though we’re not responsible for it and the country is going to hate us and we can’t afford this. And we can’t afford a government shutdown and not having a shutdown has been the single focus of Republican policy for I don’t know how many years now. And it has translated into the Democrats from being able to deny Republicans most of what they want and Democrats to get what they want. And once they get away with it, they’re going to keep trying to get away with it. They’re just going to keep using it. I would hope  —   the key here is the filibuster again. This   thing, as it was with Supreme Court nominations  —   if they want to nuke the filibuster in this sense and certain elements of the budget  —   you can use reconciliation because the budget by law has to be done on a date certain and so it is exempt from the   rule in some instances, but not all. But I would like to see somebody take this on and reverse this and so if the government gets shutdown, the Democrats get blamed for it. I know, I know  —   you’re saying, “But Rush, the media will never blame the Democrats. ” That’s OK. We’re here. We can blame the Democrats. The country is ready to blame the Democrats for crying out loud. Look at the election results. The country blamed Obama. The country blamed Democrats. That’s why Trump was elected. But look, we have until Friday for this to play out. This is only Tuesday, so we’ll bide our time and be patient on this. Follow Jeff Poor on Twitter @jeff_poor'"}, "time": 1742628506.8997536}