{"duration": 0.023849964141845703, "input_args": {"text": "'The Chicago Tribune has issued a correction to an article by columnist Heidi Stevens in which she falsely described MILO as a “white nationalist” without providing any evidence to back up her smear. [Stevens, whose article lavished praise on feminist author Roxanne Gay, after Gay decided to pull her book deal from Simon  Schuster in protest at the publisher awarding MILO with a $250, 000 book deal for his upcoming book ‘Dangerous.  Having described Gay as “feminist champion” who deserves a “standing ovation,” Stevens went on to say that “Gay pulled her upcoming book from Simon  Schuster this week because the publisher signed a book deal with Breitbart editor Milo Yiannopoulos, the white nationalist who was banned from Twitter for his targeted harassment of actress Leslie Jones. ” However, an editors note at the bottom of the article now states that the “article has been corrected to delete a reference to Yiannopoulos as a white nationalist. ” During his talk at the University of Colorado Springs, MILO outlined why any form of ‘white identity’ is not the answer to the problems of identity politics. “The reality is, if you force everyone to play identity politics, if you insist in pitting whites against blacks, women against men, straights against gays, the reality is you guys are gonna win and the left isn’t going to like it very much. But there’s a better way. Don’t fight identity politics with identity politics,” he said. “White pride, white nationalism, white supremacy isn’t the way to go. The way to go is reminding them and yourselves that you should be aspiring to values and to ideas,” he continued.  Other news organisations forced to issue corrections for falsely using the term ‘white nationalist’ include the LA Times, NBC News and USA Today. You can follow Ben Kew on Facebook, on Twitter at @ben_kew, or email him at bkew@breitbart. com'"}, "time": 1742562363.5476835}