{"duration": 0.03851771354675293, "input_args": {"text": "'President Donald Trump is praising the school voucher program for   students in the nation’s capital that former President Barack Obama regularly defunded. [At the White House on Wednesday morning, Trump, Vice President Mike Pence, and U. S. Education Secretary Betsy DeVos welcomed   parents and their children from Washington, D. C. who have been able to attend private and religious schools because of school voucher scholarships in the D. C. Opportunity Scholarship Program.  Excited to join @VP to highlight how school choice benefits students  families. Join us live at 9:30 am EDT: https:  .   —   Betsy DeVos (@BetsyDeVosED) May 3, 2017,  The nation’s capital is one of three areas in which the federal government  —   rather than state and local governments  —   has constitutional jurisdiction over education policy. The other two areas are schools located on U. S. military bases and those on Native American reservations. In an unscheduled visit to the event at the White House, Trump said the GOP spending bill is “a win for the American people,” and added, “This is what winning for young children and kids from all over the country looks like. ” “The opportunity scholarship program that we’re funding allows families in the inner city of our nation’s capital to leave failing public schools and attend a private school, making an extraordinary difference in these incredible young lives,” the president said. Trump said the results of the Opportunity Scholarship Program “speak for themselves,” noting that 98 percent of scholarship recipients “represent their high school diplomas, and they’re really very, very special. They go into tremendous successes. ” “During my campaign for President, I promised to fight for school choice  —   very important,” Trump said, continuing: It was featured in my Joint Address to Congress. And today, I’m calling on all lawmakers to work with us to help extend school choice to millions more children all across the United States of America, including millions of   Hispanic and African American children who deserve the same chance as every other child in America to live out their dreams and fill up their hearts and be educated at the top, top level. In closing remarks, Trump said DeVos is “doing such a great job. ” In his remarks, Pence said that DeVos “is fighting every day to give America’s children the   education that every American child deserves. ” The vice president also praised student Tseganesh Tadele who spoke about the impact the Opportunity Scholarship Program had on her ability to pursue an education that has enabled her to go on to college. “You really are a wonderful example of why President Trump is fighting so hard to expand educational opportunities for all of our families in the country, and we thank you for being here,” Pence said to her. The vice president noted that leaders and students from three private, one charter school, and one public school were present at the event. “Now, we’re here today because this week Congress is poised to pass legislation that President Trump will sign into law, a spending bill that will give new life and funding to the D. C. Opportunities Scholarship Program, which is the only federally funded voucher program in the country,” Pence said. “It’s a case study in school choice success. ” The spending bill will extend the Opportunities Scholarship Program for three years, the vice president explained. “Since its creation in 2004, the Opportunities Scholarship program has given parents and families hope by giving them a pathway to take their children out of schools that too often are failing to meet the needs of children here in our nation’s capital, give them a chance that other families have to put their children into a private school,” he added. Pence observed that over the past 13 years, some 20, 000 students have applied for the program, with 7, 500 students having been accepted. He also noted that though “only 69 percent of D. C.’s public school students graduated from high school last year, 98 percent of D. C. scholarship students walked across the stage and received their diploma last year  —   98 percent. And get this: 86 percent of those kids were accepted into college to continue their education and climb the ladder of success. ” In 2015, Akash Chougule, a senior policy analyst at Americans for Prosperity, noted at National Review that Obama proposed defunding the D. C. Opportunity Scholarship Program during seven consecutive years: [T]he president  —   who recently stressed “opportunity gaps” in inner cities  —   has never missed a chance to try to end this program that benefits almost exclusively poor, minority,   children. Of course, there is no speech,   or press release to go along with this annual tradition of his.   …     So why are conservatives standing with poor   families, while President Obama and his liberal allies try to take away their opportunity? Well, it is probably not a coincidence that many liberal campaigns are huge beneficiaries of teachers’  largesse  —   and teachers’ unions feel threatened by   programs, which create competition and accountability in education (rather than monopolizing the system and trapping kids in   schools). Of course, the union leaders don’t say this. When defending their actions, they claim that school choice strips funding from public schools. Chougule also noted “a degree of hypocrisy” in Obama’s opposition to the Opportunity Scholarship Program. “While he sends his own children to the elite, $   Sidwell Friends School, poor students who live just a couple of blocks away from 1600 Pennsylvania Avenue would have no choice but to attend failing,   schools if the Opportunity Scholarship Program were shut down,” he wrote. “Should these kids not have the same educational opportunities as President Obama’s daughters?”'"}, "time": 1742628433.9602387}