{"duration": 0.08266353607177734, "input_args": {"text": "'We Are Change \\nLeaked audio from 2006, shows Hillary Clinton suggesting that the U.S. should have rigged a foreign countries electoral process. Eyebrows should be raised high to your forehead when hearing Clinton suggest the U.S. should have “made sure that we did something to determine who was going to win” rigging the Palestinian election. The leak comes less then a week away from when voters take to the polls.\\n“I do not think we should have pushed for an election in the Palestinian territories. I think that was a big mistake. And if we were going to push for an election, then we should have made sure that we did something to determine who was going to win.” \\n~Hillary Clinton, 2006, said. \\nThe audio was leaked to the Observer , by Eli Chomsky who was an editor and staff writer for the Jewish Press at the time. Chomsky recorded Hillary speaking to the Jewish Press January, 25, 2006 about the second Palestinian Legislative Council on an old cassette tape.\\nSpeaking to the Jewish Press about the January 25, 2006, election for the second Palestinian Legislative Council (the legislature of the Palestinian National Authority), Clinton weighed in about the result, which was a resounding victory for Hamas (74 seats) over the U.S.-preferred Fatah (45 seats).\\n~ Ken Kurson , writes.\\nChomsky held onto the tape all these years and was told by his bosses at the time in 2006, that they didn’t think it was “newsworthy” at the time. Chomsky also expressed that the Jewish Press had a mindset that they would not want to say anything offensive about anybody in a position of influence.\\n“I went to my bosses at the time, the Jewish Press had this mindset that they would not want to say anything offensive about anybody even a direct quote from anyone in a position of influence because they might need them down the road. My bosses didn’t think it was newsworthy at the time. I was convinced that it was and I held onto it all these years.”\\nGiven the absurd amount of primary fraud in favor of Hillary Clinton this should open another Pandora’s box.\\nThe potential that she may knowingly have setup the election fraud so she could win against Senator Bernie Sanders. The collusion with the DNC, the media and the dirty tactics used by her campaign and the Democrats in general that Project Veritas exposed . With a statement like that in 2006, Hillary may have known about all the illegal practices taking part now in the U.S. 2016 election cycle making her a direct participant in the conspiracy. Whether it’s violating FEC regulations, criminal laws, morals or ethics. Hillary doesn’t care that’s what this tape shows it shows the further moral depravity of a presidential candidate less then 2 weeks away from the election. It shows that Hillary doesn’t give a damn about democracy even in a foreign country where the U.S. has no business meddling in other countries internal election affairs. And here she is suggesting that the U.S. should have “made sure that we did something to determine who was going to win.”\\nHillary has proven time and time again that she has absolutely no conscience what so ever. Whether it’s lying about Bosnia snipers or lying about her email investigation, lying about Benghazi, or having a public and private opinion on issues directly deceiving voters Hillary has shown what difference does it make? Here’s Hillary lying for 14 minutes straight and that’s not even counting the lies she told to the American people while making deals with Goldman Sachs, Wall St and foreign donors.\\n2006 audio emerges of Clinton proposing election rigging in Palestine; censored by Israeli press for past 10 years https://t.co/LsMYcUzJR4 \\n— WikiLeaks (@wikileaks) October 28, 2016 \\n\\n \\nThe post LEAKED AUDIO: HILLARY CLINTON PROPOSED RIGGING PALESTINIAN ELECTION appeared first on We Are Change .\\n'"}, "time": 1742564582.6354146}