{"duration": 0.10266709327697754, "input_args": {"text": "'Many people believe that there has been a wave of individuals being born in order to change the old ‘Iron’ and industrial way of life to more ‘enlightened’ and spiritual. You’ve probably heard about ‘ Indigo Children ’ and ‘ Lightworkers ’ across the internet.\\n\\nLightworkers are just a consequence the ways of the modern world have brought to the human psyche.\\n\\n\\nA Lightworker is a person who can sense that there’s a lot of healing to be done on a large scale to the world. The modern ways of life are disharmonious and harmful to ourselves and Nature, which we are all a part of. This results in subconscious awareness that something needs to be done, especially in people who are born into the modern society.\\n\\nNewer generations are unbound from ‘the chains’ people who were constructing the modern society have been imprisoned with. The chains I am referring to are actually their investment of energy, their mindset and character developed in a different era, with far less available information. These new generations can clearly see the bigger picture and what doesn’t work. That’s why they have a heightened sense to fix the world.\\n\\nJust like there are popular terms in the science community addressing these new generations as ‘generation x’, ‘generation y’and ‘generation z’, there are terms in the spiritual movement addressing these generations as ‘ Indigo Children ’, ‘ Crystal Children ’ and ‘ Rainbow Children ’.\\n\\n\\nWHAT KIND OF LIGHTWORKER ARE YOU? \\n\\n\\nCheck what kind of lightworker you are. \\n\\nWhat aspect has most traits that describe you? \\n\\nINDIGO CHILDREN: \\nBorn between the 1960s and the 1990s; Rebellious and warrior in spirit; Despises the system; Loves to isolate; Fond to addictions; Stubborn; \\nCRYSTAL CHILDREN: Born between 1980s and 2000s; Strong and pure hearted; Highly developed imagination and creativity; Extremely empathetic and emotional; Passionate about supernatural phenomena and superheroes; Easygoing; \\nRAINBOW CHILDREN: Born after the new millennium; Positive and happy; Technologically advanced and easy in understanding new gadgets; Loving and hard to contain; Loves animals, Nature and possibly vegan; Free; \\nTHIS IS WHAT THESE LABELS MEAN: \\n\\nIndigo children are born between the 1960s and the 1990s really similar as the baby boomers of the generation x.\\n\\nThey are rebellious and unable to conform to dysfunctional situations at home, work, or school. They are warriors in spirit.\\n\\nThey want to rage against the corrupted system that governs society and this trait projected itself into the art, the music, the movies, the movements and the lifestyle of their youth.\\n\\nThey experimented with psychedelic substances, they forced their mind to be opened.\\n\\nAll of this resulted in creation of new businesses and inventions that changed the future forever, like the internet.\\n\\n\\nCrystal children are most likely to be the children of people from generation x. They are born around 1990s and 2000s slightly differing from generation y which addresses people born between 1980s and 2000s. However, the characteristics of crystal children and generation y individuals are almost exactly the same.\\n\\nThey are intuitive, spiritually aware and passionate about supernatural subjects. They have highly developed imagination and creativity. They understand things easily, they are extremely empathetic and very easy going. This contradictive schism between their emotions forces them to use drugs, to visit psychiatrists, feel high levels of anxiety, have panic attacks and sometimes even more serious issues with their mental health.\\n\\nThey are born in a transition time, in a period where humanity made its biggest leap with technological advancement which affected all areas of society. They grew up in times without internet and times when you cannot imagine how you lived without internet. This transition happened in only 10 years period, which is REALLY small amount of time for such great change. This affected their way of seeing the world. It’s like they were forced to raise their consciousness in an accelerated rate. But that’s ok because they are strong enough, like crystals. They always see the world with pure eyes, which additionally adds to their ‘crystal children’ description.\\n\\nBecause of their imagination, purity of heart and strength, they are attracted to the superhero phenomena. Their art, music, movies, businesses, even their lifestyles are inspired and driven by various superheroes they idolized while they were growing up.\\n\\n\\nRainbow children are the newest generation of people, or generation z, born after the new millennium.\\n\\nThey are modern and more technologically advanced than generation x and y because they are raised in a period where humans are more connected than any time in the known human history. They had almost all of the information in the world available to them while they were growing up, only by pushing few buttons.\\n\\nThese kids are happy and positive. They are like a breath of fresh air. They are bringing happiness and joy to the whole world through various inventions, platforms and mediums that the generation x has developed and generation y perfected.\\n\\nTheir light and positivity makes them freer than any generation in modern history. They love traveling, they hate being tied up to one person and they cannot stand the old conformistic ways. It feel like prison to them. Think of them like light; they give warmth, life and cannot be captured. Their whole being is pure and that’s why most of these kids are vegan.\\n\\n\\nTHE GREATEST DIFFERENCE BETWEEN THESE 3 GENERATIONS IS THIS: \\n\\n\\nThe Indigos are here to destroy what’s not working and pave the way for a better world.\\n\\nThe crystal children are the ones who need to create, develop and build the new ways uniting the best from the old and the new.\\n\\nThe rainbow children are here to give life and fertilize the new and improved world that’s in harmony with Nature and the human potential.\\n\\nAll of these 3 spiritual archetypes need to work together so there will be a real change to the way humanity further develops.\\n\\nHowever, it doesn’t mean that if you are an indigo you cannot be a crystal or a rainbow child. You can evolve through all of these 3 archetypes depending on your environment, understanding and purpose. And a lot of people do.\\n\\nThese are simply 3 different aspects of one larger program called being a ‘Lightworker’ which works to heal the world.\\n\\nHERE IS HOW WE ARE ALL A PART OF THIS SPIRITUAL REVOLUTION: \\n\\nThis spiritual revolution is a consequence of the collective human psyche. To understand this you must understand how we are all connected. You must grasp the fact that EVERYTHING connects to everything else, even our thoughts.\\n\\nÉmile Durkheim first introduced the collective conscious back in 1893 and described as the set of shared beliefs, ideas and moral attitudes which operate as a unifying force within society. However, just like our collective conscious Carl Jung called a phenomena ‘Collective Unconscious’ which is the subconscious mind shared by all of humanity.\\n\\nThis is how we are all connected. This is how all of us, unintentionally created the perfect environment for ‘Lightworkers’ to be developed and act as an antidote to the virus that could have destroyed us. Maybe that was the defensive mechanism of our collective subconsciounsess or a higher plan of our collective psyche to help us thrive together as species.\\n\\nLife Coach Code \\nSOURCE '"}, "time": 1742562405.6880271}