{"duration": 0.05452251434326172, "input_args": {"text": "'Bernie Promises To Keep Fighting, Hold Clinton Accountable After She’s Elected (VIDEO) By Richard Marcil   \\nBernie Sanders is lending his full support to Democratic presidential contender Hillary Clinton – for now. But how long will he and Clinton remain allies? \\nIn a new interview , Sanders said he plans on extending his political revolution. He also intends to hold Clinton – who is expected to win the presidential election next month – to her campaign promises. The Primary and the Platform \\nThe Vermont senator put up a long and contentious fight against Clinton during the primary season, capturing 22 states and over 13 million votes. His populist message and democratic socialist platform proved especially popular among Millennials. \\nAfter the primary season ended, Sanders and his cohorts were able to channel his popularity into the most progressive Democratic Party platform in history. The new platform includes support for a $15 minimum wage, aggressive action on climate change, and the dissolution of banks deemed “too big to fail” – all of which were cornerstone issues in Sanders’ campaign. Still Fighting \\nNow an independent, Sanders has pledged to continue working to ensure Clinton and Congress act on the new platform. “I expect her to appoint people who will head agencies in a way that is consistent with the Democratic Party platform, and if not, I will do my best to oppose those nominees.” \\nClinton did not embrace many of the platform’s elements in her primary campaign, but has since expressed her support for them. Now Sanders and other senators are brainstorming legislation to ensure progressive policies are enacted in Washington. Elizabeth Warren, another darling of the modern progressive movement, has been “informally” working with Sanders on this legislation. Reining in Wall Street \\nSpecifically, he expects that Clinton will close the revolving door between Wall Street and Washington. “I personally believe that a billionaire corporate executive is frankly not the kind of person that working families want to see as secretary of treasury. We need somebody who has a history of standing up to Wall Street and is prepared to take on the financial interests whose greed and illegal behavior has done so much harm.” No Compromise \\nSanders also expects that Clinton will not try to placate Republicans in an effort to bridge the political divide. Barack Obama made that mistake when he was inaugurated in 2008, and only ended up with even steeper opposition to his plans and policies. Sanders said: “It’s not good enough for me, or anybody, to say, ‘Well, look, Republicans control the House: From Day One, we’re going to have to compromise.’ The Democratic Party, before they start compromising, has got to rally the American people around our ideas and make it clear that if Republicans do not go along with reasonable ideas to benefit the middle class and the working class, they are going to pay a very heavy political price.” \\nAnd if Clinton doesn’t follow through on Democratic platform policies and a progressive agenda? “I will be vigorously in opposition, and I will make that very clear.” \\nFeatured image: Screengrab via New York Times video. About Richard Marcil \\nRichard Marcil is a freelance writer. Connect'"}, "time": 1742628310.183813}