{"duration": 0.04213285446166992, "input_args": {"text": "'\\nIt still ain’t over…\\nIt now appears that John Podesta and teams of voting rights lawyers are combing over Pennsylvania, Wisconsin and Michigan election results with a fine-toothed comb, county-by-county and are now suggesting possible vote fraud via “irregularities.”\\nThese are the three rust belt states that traditionally swing blue, but went red for Trump in 2016, perhaps in large part due to his message on economy on jobs.\\nIt remains to be seen whether or not the Clinton Team will officially challenge these results or demand a recount, but it is clear that many of Clinton’s fiercest establishment allies will not be lying down.\\nvia MSN.com :\\nHillary Clinton is being urged by a group of prominent computer scientists and election lawyers to call for a recount in three swing states won by Donald Trump, New York has learned. The group, which includes voting-rights attorney John Bonifaz and J. Alex Halderman, the director of the University of Michigan Center for Computer Security and Society , believes they’ve found persuasive evidence that results in Wisconsin, Michigan, and Pennsylvania may have been manipulated or hacked. The group is so far not speaking on the record about their findings and is focused on lobbying the Clinton team in private.\\nLast Thursday, the activists held a conference call with Clinton campaign chairman John Podesta and campaign general counsel Marc Elias to make their case, according to a source briefed on the call. The academics presented findings showing that in Wisconsin, Clinton received 7 percent fewer votes in counties that relied on electronic-voting machines compared with counties that used optical scanners and paper ballots. Based on this statistical analysis, Clinton may have been denied as many as 30,000 votes; she lost Wisconsin by 27,000. While it’s important to note the group has not found proof of hacking or manipulation, they are arguing to the campaign that the suspicious pattern merits an independent review — especially in light of the fact that the Obama White House has accused the Russian government of hacking the Democratic National Committee.\\nTheoretically, if all three of these states were declared for Hillary rather than for Trump, it would swing the electoral college count towards another Clinton presidency.\\ngroup of prominent academics & election lawyers held conference call w/ Podesta and Elias last week lobbying recount https://t.co/EnHq9woAcw \\n— Gabriel Sherman (@gabrielsherman) November 22, 2016 \\n\\nIf that won’t work, there are still electors out there who may dissent when casting their electoral college ballots by mail before December 19th.\\nSome people never quit.\\nIt’s hard to believe, but there remains an outside chance that the election is still up in the air – at least in the minds of her angry and disillusioned staffers, donors and supporters.\\nRead more: \\nIt’s Not Over Yet: “They Are Probably Still Trying To Steal The Election” | Calls For Electoral College To Ignore Will Of People \\nStill Not Over: Two Electors Launch Effort To “Flip the Electoral College” And Block Trump’s Win \\nClinton Insider Confesses: Trump Protests Are Just More Pre-Paid “Soros Riots” to Stir Unrest \\n“Beware of the Shadow Government”: Ron Paul Advises President-Elect \\nTrump Surrounded By Bankers, Wall St. Insiders Banging on the Door to Get In: “Draining the Swamp?” '"}, "time": 1742561826.412713}