{"duration": 0.09456777572631836, "input_args": {"text": "'20 Foods That Naturally Unclog Arteries and Prevent Heart Attacks http://blogs.naturalnews.com/20-foods-naturally-unclog-arteries-prevent-heart-attacks/ \\nBy Twain Yobra \\nPosted Tuesday, November 1, 2016 at 03:53pm EDT \\nArteries play a vital role in the body. They transport nutrients and oxygen throughout the body. And they can cause heart attacks if they’re clogged. Well, you can unclog them naturally by eating foods rich in antioxidants, soluble fiber and healthy fats. \\nHere are 20 foods that will unclog your arteries and prevent heart attacks. \\n1. Pomegranate: Pomegranate is rich in antioxidants which prevents the arteries from being damaged. Research also shows that pomegranate improves heart health by reducing bad cholesterol. \\n2. Spirulina: Spirulina is regulates fat levels in the blood. And it’s rich in omega 3 fatty acids, which studies show prevents heart disease. \\n3. Asparagus: This vegetable is rich in vitamins and minerals that prevent blood clots and lower blood pressure. \\n4. Turmeric: Inflammation is one of the main causes of arteriosclerosis, and as you may know, turmeric fights inflammation. \\n5. Cranberries: The potassium in cranberries can lower blood pressure and reduce risk of heart disease by up to 40 percent. \\n6. Watermelon: One study found that L-citrulline (found in watermelon) can widen blood vessels and lower blood pressure. This can actually benefit men with mild erectile dysfunction. \\n7. Avocado: Research shows that eat avocados every day can clean your arteries, lower bad cholesterol and increase good cholesterol. \\n8. Broccoli: Broccoli contains vitamin K which prevents calcium from damaging the arteries. It’s also rich in soluble fiber which lowers cholesterol. \\n9. Cinnamon: This spice unclogs the arteries of plaque build-up. Its antioxidant properties also improve cardiovascular health. \\n10. Green tea: This powerful herb contains catechins which prevent absorption of cholesterol. This consequently prevents blockage of arteries. Drink 2-3 cups a day. \\n11. Coconut oil: Taking coconut oil regularly can unclog the arteries and even convert bad cholesterol to good. \\n12. Persimmon: Persimmon has antioxidants that reduce blood-lipid. It’s also rich in fiber which helps clean the arteries. \\n13. Coffee: Research shows that drinking 2 cups of coffee a day can lower risk of heart disease by 20 percent. But excess consumption can increase blood pressure and cause anxiety. \\n14. Cold-water fish: Eating these fish will fight inflammation and unclog your arteries. They include, mackerel, tuna, salmons, and sardines. \\n15. Olive oil: Studies show that olive oil can reduce risk of cardiovascular disease by 41 percent. This is attributed to its ability to reduce oxidative stress and cholesterol. \\n16. Spinach: This vegetable unclogs arteries because of its folate, potassium and fiber content. \\n17. Orange juice: Oranges are rich in vitamin C which cleans the arteries and prevents oxidation of blood. \\n18. Flaxseeds: Flaxseeds have been proven to fight inflammation, lower blood pressure and improve heart health. \\n19. Raw nuts: Nuts like almonds will reduce blood pressure and fight inflammation. Use them to keep hunger at bay. \\n20. Whole grains: Whole grains are rich in soluble fiber which lowers cholesterol and risk of high blood pressure. \\nFor more information on eating healthy and staying fit, download your FREE 3 Weeks Flat Stomach Guide to help you improve your health and physique. And like our Facebook page . You might also like…'"}, "time": 1742561643.8737736}