{"duration": 0.07316374778747559, "input_args": {"text": "'The Fake News About Central Banking By Daily Bell Staff - November 22, 2016 \\nTrump Shouldn’t Bully the Fed … U.S. President-elect Donald Trump repeatedly criticized Federal Reserve Chair Janet Yellen during his campaign. British Prime Minister Theresa May has questioned the Bank of England’s recent actions, for a while putting Governor Mark Carney’s tenure in doubt. The long-cherished principle of central-bank independence seems to be under attack. – Bloomberg \\nThe mainstream media is up in arms over “fake news” but the reality is that almost everything the mainstream reports is in a sense fake. Global warming is fake. Vaccines do not work as advertised. Central banking is fake too. \\nOn and on. Truth has been overtaken by propaganda. We call these fake notions “dominant social themes.” They are inevitably intended to reinforce the idea that a very few must have control over the many. \\nCentral banks fix the volume and value of “money” – and price fixing inevitably creates disasters. But you will never find this simple fact stated in almost any mainstream media article about central banking. \\nThis Bloomberg article is no exception. Seldom do we see all the fallacious reasons for a central bank gathered together in one short editorial, but Bloomberg has done us this favor. \\nIn this case, Bloomberg is trying to justify why central banks should be “independent.” \\nMore: \\nThe standard case for leaving central banks alone to conduct monetary policy rests on three points. \\nFirst, a government that controls the central bank might be tempted to finance unaffordable budget deficits by printing money. (See Zimbabwe.) Second, to provide economic stability, a steady hand on the monetary controls is required, which demands some insulation from day-to-day politics. (Would anybody want to put Congress in charge of interest rates?) Third, monetary policy done right is a technical thing, like running a utility. It’s basically apolitical. \\nAll three of these points are fallacious. First, central banks, independent or not, over-print money on a regular basis. Western central banks have a goal of creating price inflation, which institutionalizes this overprinting, usually via too-low interest rates. \\nSecond, the idea that an independent central bank can provide “a steady hand on monetary controls” is laughable. Central banks the world over are cartelized via the Bank for International Settlements in Switzerland. Central bank policy is created via a secret monopoly and anyone looking over the past 20 years of central bank existence can easily see that the current “steady hand” has yielded up a series of global monetary disasters. \\nEven Bloomberg has trouble with the third reason being cited, that central banking is “apolitical.” \\nThe editorial admits that “Changes in interest rates hurt some and help others,” and thus central bank policy-making is innately political. But because it is political, the predictable argument is made by Bloomberg that central banking ought to be “independent.” \\nBloomberg states, “Disagreement is OK. Intimidation is not.” \\nThe argument here is that statements by Donald Trump regarding the endless and ruinous low-rate regime of the Federal Reserve are “worrying” because Trump is bullying the Fed rather than criticizing it. \\nThe larger argument, and it’s one that Trump is surely familiar with, is that central banking cannot be justified at any level. As soon as individuals or groups attempt to manipulate the money supply, prosperity is inevitably affected and wealth is endlessly consolidated. \\nThis is just what’s happened around the world and especially in the West. Wealth has been gathered into fewer hands and the financial industry itself has grown without stopping until it has virtually taken over the larger economy. \\nConclusion: Money needs to be regulated by markets, not by a handful of individuals. There is plenty of free-market economic theory that illustrates logically why this should be so. Bloomberg’s argument is wrong, but at a more fundamental level, Bloomberg is addressing the wrong issue. The problem with central banking is not whether it should be independent, but whether it should exist at all.'"}, "time": 1742562282.9242623}