{"duration": 0.10183835029602051, "input_args": {"text": "'(Want to get this briefing by email? Here’s the  .) Good evening. Here’s the latest. 1. It’s official. Simone Biles, the gymnast some call the best in history, was crowned the   gymnastics champion at the Rio Olympics. Her teammate Aly Raisman came in second. Here’s a   of two of Biles’s signature moves. With a win in the   individual medley, Michael Phelps earned his thirteenth individual gold medal, surpassing Leonidas of Rhodes, who won 12 gold medals in the ancient Olympics. Another achievement for the books: Simone Manuel became the first   woman to win an individual event in Olympic swimming. Our full coverage of the Games is here  —   including the odd version of the U. S. national anthem being played at medal ceremonies. _____ 2. Hillary Clinton rejected the economic agenda Donald Trump laid out this week, calling him an enemy of “the little guy. ” He wants to “give trillions in tax cuts to people like himself,” she said, while deepening the financial pain of the middle and working classes. Neither candidate, however, has said much about helping people who are not working  —   many of them living in abject poverty. _____ 3. Mr. Trump faced down critics of his unorthodox campaign style, telling an interviewer, “It’s either going to work or I’m going to, you know, I’m going to have a very, very nice long vacation. ” After weeks of hearing detractors saying a Trump presidency would be a grave threat to national security, Mr. Trump has begun portraying Mrs. Clinton and President Obama as   of the Islamic State. He held a rally in Kissimmee, Fla. in the evening. _____ 4. The F. B. I. has widened its investigation into what officials believe was a Russian cyberattack directed against the Democratic Party. The attack appears to have been far larger than first thought, raising the possibility of more damaging disclosures like the emails published recently by WikiLeaks. After a   impasse that has kept the WikiLeaks founder, Julian Assange, holed up in the Ecuadorean Embassy in London, Sweden has agreed to question him there over rape accusations. _____ 5. Almost 55 miles a gallon  —   that’s what U. S. regulators say automakers’ fleets must average by 2025. Engineers, racing to meet the mark, are working with new batteries for hybrids. Some cars are going on a superglue diet:   adhesives, like the one being used on the GMC Acadia above, can stiffen seams and allow components to be made of thinner steel. _____ 6. The animated “Sausage Party,” opening nationwide this weekend, sends   foodstuffs ranging through the supermarket for 89 minutes of bawdy, silly humor  —   and a deeper layer. Characters voiced by Seth Rogen, Kristen Wiig, Edward Norton, Michael Cera, Bill Hader and others end up in a classic confrontation between comforting religious beliefs (weekend shoppers are gods who will liberate them) and scientific thought (their actual fate). Our reviewer saluted “the intellectual rigor of a project that probably didn’t require it” and called the movie “fun pretty much all the way through. ” _____ 7. Fox News has not managed to put a   scandal behind it, despite rapidly forcing out its chairman, Roger Ailes. More women have come forward to describe a culture of intimidation and misogyny, including a former Fox host, Andrea Tantaros, above. Top Ailes deputies who remain are being accused of abetting Mr. Ailes’s behavior. _____ 8. “I found the numbers heartbreaking. ” That was a senior U. S. health official, commenting on a new study that found high rates of rape, bullying, depression and other harms suffered by gay, lesbian and bisexual teenagers. The survey found that they make up about 8 percent of the high school population, or 1. 3 million students. Future studies are likely to include an option for students to identify as transgender. Above, a youth contingent at Miami’s gay pride march in April. _____ 9. U. S.  forces seized most of the coastal Libyan city of Surt, a stronghold of the Islamic State. But in Syria, the battle between government forces and rebels has left two million people in the city of Aleppo  with critical shortages of food and water. If the turmoil in the Mideast seems too overwhelming to grasp, this could help. A   team spent more than a year charting the catastrophe that has befallen the Arab world since the invasion of Iraq in 2003. At   words, it’s not a quick read, but it is a remarkably clear account that connects the region’s history and the Arab Spring uprisings to the creation of the Islamic State and the global refugee crisis. _____ 10. One of our   articles today focuses on the pharmaceutical giant Abbott Laboratories and its operations in India’s highly competitive drug market. A Times investigation found that managers pushed workers to pursue sales in violation of Indian law, medical standards and the company’s own ethics guidelines. One of the country’s top salesmen jumped in front of a train last month, leaving a note that said he was committing suicide because of the pressure. Above, his daughter. _____ 11. Finally, Mongolia, a sparsely populated country with nomadic traditions, will be pioneering a novel   system next month. The country is adopting an app created by a British   What3Words, that looks up a unique   code (dissident. sloth. ploy, for instance) for every    patch of the earth’s surface  —   all 57 trillion. Users enter an address or position a pointer on a map to retrieve the code, which the postal service can then use for deliveries. _____ Your Evening Briefing is posted at 6 p. m. Eastern. And don’t miss Your Morning Briefing, posted weekdays at 6 a. m. Eastern, and Your Weekend Briefing, posted at 6 a. m. Sundays. Want to look back? Here’s last night’s briefing. What did you like? What do you want to see here? Let us know at briefing@nytimes. com.'"}, "time": 1742562768.9916153}