{"duration": 0.21202707290649414, "input_args": {"text": "'Sun, 23 Oct 2016 00:00 UTC Heather Ann Thompson\\'s book \" Blood in the Water : The Attica Prison Uprising of 1971 and Its Legacy\" is a detailed study of the inner workings of America. The blueprint for social control employed before and after the crushing of the Attica revolt is the same blueprint used today to keep tens of millions of poor people, especially poor people of color, caged or living in miniature police states. Thompson meticulously documents the innumerable ways the state oppresses the poor by discrediting their voices, turning the press into a megaphone for government propaganda and lies, stoking the negative stereotypes of black people, exalting white supremacy, ruining the lives of people who speak the truth, manipulating the courts and law enforcement, and pressuring state witnesses to lie to obstruct justice. Her book elucidates not only the past but also the present, which, she concedes, is worse. \"America by the early twenty-first century had, in disturbing ways, come to resemble America in the late nineteenth century,\" Thompson writes near the end of her book. \"In 1800 the three-fifths clause gave white voters political power from a black population that was itself barred from voting, and after 2000 prison gerrymandering was doing exactly the same thing in numerous states across the country. After 1865, African American desires for equality and civil rights in the South following the American Civil War led whites to criminalize African American communities in new ways and then sent record numbers of blacks to prison in that region. Similarly, a dramatic spike in black incarceration followed the civil rights movement—a movement that epitomized Attica. And just as businesses had profited from the increased number of Americans in penal facilities after 1870, so did they seek the labor of a growing captive prison population after 1970. In both centuries, white Americans had responded to black claims for freedom by beefing up, and making more punitive, the nation\\'s criminal justice system.\" On Sept. 9, 1971, prisoners at the Attica Correctional Facility in upstate New York rebelled in the face of intolerable conditions . They were sick of the racist-fueled violence of the white, rural guards; angry at poor medical care and the dearth of vocational and educational programs; underfed (the prison allocated only 63 cents a day to feed a prisoner); unhappy about their mail being censored, or destroyed if it was in Spanish; living in poorly ventilated cells with little or no heat or stifling heat; unable to buy basic commissary items on salaries that averaged 6 cents a day; and tired of being given only one bar of soap and one roll of toilet paper a month and allowed only one shower a week. The uprising was not premeditated. It took place when prisoners, trapped inadvertently by guards in a tunnel that led to the yard, thought they were going to be given another beating by sadistic correction officers. The spontaneous uprising took place \"because ordinary men, poor men, disenfranchised men, and men of color had simply had enough of being treated as less than human, \" Thompson writes. Four hundred fifty prisoners had previously staged a peaceful sit-down strike in the prison\\'s metal shop to protest wages that, as a witness later testified at a New York state hearing, were \"so low that working at Attica [was] tantamount to slavery.\" Prisoners had formed committees and sent respectful letters to prison authorities asking them to address their concerns. The requests were largely ignored. Despite authorities\\' promises that there would be no retribution, those who organized the protests were put in isolation or transferred to other prisons. The callousness of the officials was especially unconscionable in light of the fact that the state had netted huge sums for sales of products made by the prisoners. Comment: The slave labor system continues to this day, forcing inmates to begin hunger strikes and work stoppages to end prison slavery: End prison slavery!\\' 24,000+ inmates join nationwide jail strike causing lockdowns (VIDEO) After three days of negotiations, in which the prison authorities refused to grant the rebellious prisoners amnesty, 550 New York state troopers, 200 sheriff\\'s deputies and numerous Attica prison guards were issued high-powered weapons, including rifles loaded with especially destructive bullets that expanded on impact, bullets banned in warfare under the Geneva Conventions. The prisoners had no firearms. The assault force members were fed a steady diet of lies and unfounded rumors to stoke their hatred of the prisoners. Black radicals were coming, they were falsely told, to the town of Attica to kidnap white children, a rumor that led to the closing of the schools. Through clouds of CS gas , the assault force stormed the yard, where some 1,200 prisoners held 42 guards and civilian staff members. It unleashed a blizzard of gunfire, shooting 130 people. Twenty-nine prisoners and nine hostages died. (One guard beaten by prisoners in the first moments of the uprising died later in a hospital.) The assault force, which had done all the killings that day, immediately began to hide evidence of its crimes. State officials told the press outside the prison that seven or eight of the hostages had died when the prisoners slit their throats. They claimed that the genitals of one of the guards were cut off and stuffed in his mouth. These reports were untrue, but they dominated the news coverage. Meanwhile, inside the retaken institution, many prisoners were suffering from gunshot wounds that would not be treated for days. Some were stripped and made to run gantlets in which they were beaten by guards with ax handles, baseball bats and rifle butts. Those singled out as the leaders of the rebellion were marked with Xs on their backs, forced to crawl through mud, tortured and in few cases, it appears, executed. New York Gov. Nelson Rockefeller and the Nixon White House feared that the rebellion presaged armed revolution. The scores of dead and wounded were, for them, a message to the rest of the country— defy us and we will kill you . Today, any citizen who seriously resists the corporate state can expect the same response. Comment: A perfect example: Private security mercenaries pepper spray and sic dogs on Dakota Access Pipeline protesters Thompson writes, \"All of those assembled in the president\\'s office agreed that while the morning\\'s events made a particularly \\'gruesome story,\\' news of the slashings and castration would go a long way toward discrediting America\\'s \\'bleeding hearts\\' like \\'the Tom Wicker s of the world.\\' \\'I think this is going to have a hell of a salutary effect on future prison riots,\\' Nixon said. \\'Just as Kent State [the May 4, 1970, shooting by National Guardsmen of unarmed students that left four dead and nine wounded] had a hell of a salutary effect. ... They can talk all they want about force, but that is the purpose of force.\\' \" The avalanche of government lies permeates the narrative —not a surprise to anyone who has reported on the inner workings of power or spent time in our prisons and marginal communities. There are heroes in the narrative. Their fate, which is almost universally bleak, is also instructive. The prisoner Sam Melville, who was serving an 18-year sentence in Attica for setting off explosives in government buildings to protest the Vietnam War, who taught classes to other inmates and who researched prison operations to show how the institution cruelly exploited prisoner labor for profit, was executed by guards after the uprising, according to other prisoners. So, apparently, was Elliot \"L.D.\" Barkley, who was in prison for violating parole by driving without a license and who, although he was only 21, was one of the most articulate spokespeople for the prisoners. Prisoners such as Frank \"Big Black\" Smith, savagely tortured by guards after the uprising, and Bernard \"Shango\" Stroble rose up majestically during the revolt to protect hostages and maintain order, and they fought for justice long after their release from prison. Civil rights attorneys such as Ernie Goodman and William Kunstler came to the prisoners\\' defense. A few within the governmental system exhibited rare moral courage. Among them were Dr. John Edland of the Monroe County medical examiner\\'s office, who refused to falsify autopsy reports and told the public that the hostages had been killed by state gunfire; Attica guard Michael Smith, who defied his own fraternity to speak the truth about state abuse; and government attorney Malcolm Bell, who exposed the state cover-up of the killings by the state troopers, sheriff\\'s deputies and prison guards. However, most who knew the truth remained silent. Edland was especially singled out for condemnation. He was attacked as incompetent by state officials and called a clown and, although a Republican, a radical left-winger. (State troopers were dispatched to local funeral homes to prevent morticians from informing families of the cause of death of hostages.) Edland received death threats and other hate mail, was shunned by the local community and saw state troopers menacingly idle their automobiles in front of his home. Edland called the day he released the autopsy findings \"the worst day of my life.\" When the state decides to isolate, discredit and crush you it has innumerable ways to do so. The press often is manipulated. Employers blacklist you. A gullible population is made to believe the caricature of you as a traitor or an enemy . Such smear campaigns are now directed against Julian Assange, Chelsea Manning and Edward Snowden. New York State Police Capt. Henry \"Hank\" Williams oversaw the investigation into the 1971 assault. This meant that, in Thompson\\'s words, \"the main investigators of the crimes of Attica were those who may well have committed them.\" Williams made sure that \"nothing related to the shooting—shell casings, the weapons themselves—was collected.\" No chalk outlines, usually required at a crime scene, were drawn to indicate where the bodies had fallen. No calculations were made regarding bullet trajectories. The yard where the killings took place was cleaned up under Williams\\' supervision as quickly as possible. Prisoners were threatened with violence or indictment if they refused to incriminate the leaders of the uprising. The goal was not justice; it was to punish and isolate the prisoner leadership and protect law enforcement. \"When strong-arm tactics still proved ineffective,\" Thompson writes concerning one interrogation, \"they switched their approach: should this witness help them, investigators suggested, they would, in turn, help him get paroled. In addition to enticing the witness with the possibility of parole, they also promised to make prison life easier for him in the meantime.\" Scores of prisoners were indicted in connection with the uprising; only one member of the assault force was charged, with a minor offense. The state\\'s entire case when it went to the courts was built on a scaffolding of lies designed to exonerate the assault force and punish prisoner leaders. Jurors, who saw doctored films and photographs, never knew they were being presented with fabricated and tainted evidence, including photos of crude knives that had been planted next to slain prisoners. Witnesses recited stories fed to them by government investigators. The state has never admitted wrongdoing for the Attica assault, and important parts of the record —autopsies, ballistics reports, trooper statements, and depositions— remain sealed nearly five decades later . Thompson stumbled onto Attica files in the Erie County courthouse and the New York State Museum, but since her discovery, she writes, they have vanished or \"been removed from anyone\\'s view.\" \"American voters ultimately did not respond to this prison uprising by demanding that states rein in police power, \" she concludes. \"Instead they demanded that police be given even more support and even more punitive laws to enforce. Comment: And despite the curent wave of police brutality, the sheeple continue to support them: Respect for police among Americans surges to highs not seen since late \\'60s \"Indeed, the 1960s and 1970s were all about the politics of the ironic. At the Democratic National Convention protests of 1968, Kent State in 1970, and Wounded Knee in 1973, unfettered police power each time turned protests violent, and yet, after each of these events, the nation was sent the message that the people, not the police, were dangerous. Somehow, voters came to believe that democracy was worth curtailing and civil rights and liberties were worth suspending for the sake of \\'order\\' and maintaining the status quo.\" Though immediately after the Attica uprising there were minor reforms, these improvements were soon rolled back. Conditions in prisons today are worse than those that led to the 1971 revolt. Control of prison populations is more brutal, more sophisticated and more inhumane. It is doubtful that the press, unlike at Attica in 1971, would ever be allowed inside a prison during an uprising to air the voices of the prisoners. Much of the worst damage was done during the Clinton administration . President Bill Clinton signed into law, with Republican support, the draconian 1994 Violent Crime Control and Law Enforcement Act. It provided $9.7 billion to build more prisons. By 1995 the prison population exceeded 1 million. It would soon double. \"The fact that so many of these people now in prison had been arrested because they were drug addicts, mentally ill, poor, and racially profiled concerned few if any politicians , whether in a statehouse or in Washington, D.C.,\" Thompson writes. \"Then, to make sure that this now enormous group of the incarcerated did not resist their deteriorating conditions of confinement via the nation\\'s legal system as they had done so effectively both before and after the Attica uprising, in 1996 legislators passed the Prison Litigation Reform Act (PLRA).\" The PLRA made it difficult and often impossible for prisoners to use the courts to protect their Eighth Amendment right not to endure cruel and unusual punishment. The New York Times columnist Tom Wicker, who was part of the negotiating team that tried to resolve the Attica uprising without bloodshed, singled out white fear as the central issue in the 1971 case. \"White fear fixed itself upon the literal presence of black human beings. Black people, to whites, were the symbolic representation of the evil in man and thus were also the handy instruments by which white people could hold themselves symbolically innocent of that evil.\" Wicker concluded, \"The heart of the matter was the fear of blackness.\" This white fear remains unexamined in America. It allows us to stand by passively and watch the daily murders by police of unarmed black men and women. It allows us to maintain a prison system that holds a staggering 25 percent of the world\\'s prisoners, the majority of them poor people of color. This white fear condemns us as a nation. It perpetuates the evil of white supremacy. Poor people of color have been robbed of the most elemental forms of justice and basic constitutional rights. But the state, in the age of deindustrialization, has no intention of stopping there. These forms of social control, so familiar to poor people of color, will bear upon all of us.'"}, "time": 1742562461.2050078}