{"duration": 0.3703587055206299, "input_args": {"text": "'Carmela Tyrell November 11, 2016 10 Problems That Kill Your Rural Survival \\nIf you are a rural town dweller, or live on a farm or off-grid, you already have an expanded set of survival skills. Your isolation along with these skills are the keys to your survival, but you still must expect the unexpected. \\nHere are ten problems that you may not even give much thought but they still can cause a lot of troubles in turbulent times. \\n1. Lack of Key Supplements for Livestock \\nModern farming methods can feed their livestock any number of things that might have been out of the question in the past. For example, today, many farmers think that it is safe to feed alfalfa to cattle because they also include a supplement in the feed. \\nWithout this supplement, cattle and other sensitive animals will suffer from stomach bloat and die. You have a big pile of these supplements for now, but you will run out of them. \\nTherefore, be aware of the natural nutritional needs of all livestock in your care, and know exactly why you are giving various supplements to livestock. \\nMake it a point to see if you can replace these supplements with something you can make on your own or find out how to eliminate them altogether. \\nAdjust farming methods so that you no longer need antibiotics or other chemicals that won’t be available after a crisis hits. \\nYour animals will be healthier , and your body won’t be absorbing all those chemicals and toxins through animal based meat, milk, and eggs. \\n2. Insufficient Genetic Material for Plant and Animal Based Sources of Food \\nIf you do some research, you will find that many animal based industries are already having problems with lack of sufficient genetic variation. For example pedigree dogs and thoroughbred horses are rapidly becoming a point of scandal and derision because of the serious genetic defects that lead to disease and early death. \\nNow consider a situation where you have just one bull and 5 or 6 milk cows, and that the cows are from all different blood lines. Even though the bull may be different from them, within just a few generations the animals produced will be sicker and weaker. \\nNo matter whether you are raising chickens, cattle, goats, sheep, cats, dogs, horses, or other animals, make sure that you have enough genetic variation in both the males and females . \\nWhile one gender may not be as valuable as the other in terms of producing meat or eggs, the genetic variance is truly far more important than the inconvenience of keeping a few extra animals for the sake of genetic diversity. \\nThis is also very important to consider when growing plants for food . Always use heirloom seeds, and try to get them from as many different places as possible. As long as the species and strain are the same, you can keep the plants strong and genetically viable from one generation to the next. \\nThe last thing you will want to do is be ten, or even twenty years into a survival scenario only to realize that major staple plants are less robust or becoming weaker despite proper care of the water and soil. Needless to say, you should also store away triple, or even quadruple the number of seeds that you plan to use during an active crisis scenario. \\nAt the very least, if genetic viability proves to be a problem, you will still have some to start over with, and then look for resources in other locations. This may include studying wild plants in the local area and cultivating them on a larger scale if needed. \\n3, Inadvertent Hybridization of Key Food and Medicine Bearing Organisms \\nIf you currently use hybrid seeds because they offer more disease resistant plants or other benefits, you may not be thinking about the long term consequences of hybridization. \\nA hybrid is defined as a cross between two species that are close enough to produce viable offspring, however the offspring usually cannot produce a viable next generation. \\nFor example, if you have two fields of heirloom corn or plant two strains close together, hybridization will occur. From there, the next year’s crop may grow, however, the seeds for the third year may not even sprout let alone produce a mature plant. \\nWhen growing plants , be very careful about where you plant different strains as well as which pollinators can create hybrids without your knowing. This includes bees which can carry pollen for miles as well as the wind itself which can transmit pollen from one field to another. \\nIf at all possible, only grow one strain of a plant per year. It is also very important to be aware of: wild plants from a related species that might provide pollen plants grown by other survivors in the area that may be of a different, but related strain \\n4. Loss of Soil Fertility \\nTogether with soil erosion, loss of soil fertility is a huge problem and apt to get worse in a survival situation. \\nMany farmers today rely on a range of fertilizers to enhance the soil . While this may produce edible plants, the lack of micronutrients is showing up in poor health and increased risk for disease for consumers. \\nSince you will be using the same soil over and over again to grow foods, this problem may cause serious health problems sooner than expected. \\nTake the time now to know how the soil on you farm differs from undisturbed land nearby. Make sure that you know how it differs in key nutrients that you expect to absorb from the foods. \\nIf you find lacking nutrients, then look for ways to naturally recondition the soil in order to restore those nutrients. Some options may include: expand the types of plants used on composting to include wild plants and leaves from surrounding areas find ways to add animal bones and other parts in order to create a natural fertilizer. For example, eggshells are an excellent soil conditioner that you can get from chickens being raised on the farm research safe ways to compost human excrement. It should be noted that there is a good bit of controversy on this matter as human feces and urine carry diseases that have left your body. While animal excrement can also be very dangerous to your health, at least the pathogens are not already established and accustomed to the human immune system, and therefore readily able to evade it. \\n5. Loss of Key Species Due to Overhunting or Overfishing \\nMany people think that as long as they live in a country setting, all they will have to do is go out into the woods and shoot a deer or some other animal for food. Aside from the fact that larger populations of people will easily cause animal depletion, there are some other problems with this idea: Overhunting and over fishing can also occur when injured animals get away. Not only is the meat from them lost, the hunter will more than likely go out and shoot at one or more animals until they catch one. \\nIf the person in question is not a very good hunter , this means dozens of animals may be knocked out of the gene pool and also made unavailable to people that need the food from these animals. As the gene pool of target species becomes less diverse, illness and fewer offspring will result. \\nJust take a look at the changes in deer spot patterns and white deer that signal pending collapse of a herd. Unknown stresses from social collapse may impact vital species. Consider a situation where you are in a rural area that is surrounded by mines or factories. Even though they may appear far enough away to prevent damage to the land in your area, they can still pose a hazard during a collapse. \\nIn particular, waste from factories and mines can be carried for hundreds of miles down a river, or seep into the air and soil via other means. Once these toxins get into the deer, rabbits, and other animals of interest, these animals will die off and leave you with very few, if any to hunt. \\nIn order to mitigate these problems, you must always be aware of how many animals are being taken from the land for food as well as make sure you know how many got away and were never found. \\nIt is very important to keep security patrols going through hunt areas so that you can stop strangers and prevent them from interfering with the wild herds you depend on. \\nYou should also have longer ranging scouts take periodic trips to factories, rivers, and other water features that may impact your local area. \\nAt the very least, if you know that a mine or factory has released a dangerous toxin, you may just have enough time to drive animal herds to another area where they can continue to live and reproduce. \\n6. Loss of Key Habitats \\nNo matter whether you chop down trees to provide wood for fires or use a nearby pond for potable water and irrigating crops, your activities will change the land around you. This, in turn, can lead to the loss of forests and other key habitats that you depend on for raw survival materials. \\nAs rural families expand or more people find their way out of the cities, this problem will get even worse. You have only to look at the mess of an inner city to see what becomes of areas that were once as filled with trees and other natural landmarks. \\nAs with protecting wild animals used for food, you must also protect the trees and other natural resources that you rely on. Do your best to patrol areas where loggers or scavengers may be looking to cut trees and take them away. Make sure that you know who is coming into the local area and how to keep them away from valuable land so that it is not destroyed. \\nWhile you may be inclined to share some of your resources, remember that you can never truly own a tree or the land it grows on. Be careful with these resources so that they will be available to future generations. \\nSince clearing land is unavoidable, you must replace what was taken. For example, if you cleared some land for farming, look for abandoned areas nearby that no longer have trees or other plants. You can always take tree seeds or even hand started seedlings and plant them in these areas. \\nIf the soil in these areas is toxic or has many contaminants, you can try growing carrots, certain mushrooms, and conifers to clean the soil as quickly as possible. Once the soil is cleared of heavy metals and other contaminants, then you can plant maple trees or other forest bearing trees that will be of use to you. \\n7. Inadequate Sewage and Sanitation Systems \\nIf you currently have a septic tank and leach field, then you may not realize just how easily your sewage system can become useless in a crisis situation . Among other things, if you don’t have a pump system to clean out the tank, then backing up toilets, sinks, and tubs, can easily force you out of your home. Some things you can do to avoid these problems include: keep a good supply of sludge destroying organisms on hand. These can eat way materials that do not go out into the leach lines and buy you at least a few years before the next cleaning is required. Have an outhouse and other outdoor plumbing ready for use. Know how to make slit trenches and other short term sanitation options. Do some research on composting toilets and how best to use the materials from it. \\n8. Lack of Common Vaccines \\nAs with people trying to survive in a city setting, you will also be faced with a lack of vital vaccines. This includes those used to fight off tetanus and diphtheria. Many people today are misinformed about vaccines and believe that all of them are bad. \\nWhile many vaccines use Thimerisol as a preservative (which contains Mercury), that does not mean every single person that gets the shots will be poisoned or rendered permanently disabled. \\nIn fact, thousands of people (including members of the military) take dozens of vaccines at a time without many long term problems. On the other hand, if you contract tetanus, it will kill you despite access to the best modern medicine. \\nIt is very important to make sure that tetanus, diphtheria and other critical vaccinations are kept up to date. Aside from that, if you are part of a survival community, or have a survival doctor as a friend, ask them to store away these vital vaccines for long term needs. \\nEven though these vaccines supplies will run out one day, they can still be very important. You can also do some research on how Jonas Salk and other early vaccine developers created their products. \\nSome of those methods may be within reach of local doctors that may be able to use them in a time of need. \\n9. Lack of Fuel for Farm Equipment or Other Vehicles \\nAs a prepper, you are sure to be very aware of the problems associated with loss of gasoline and diesel supplies. On the other hand, if you have been putting off converting your farm equipment to run on natural gas or biodiesel, then you may not be as ready as you though you were. \\nIt is also very important to note that biodiesel and natural gas options aren’t completely free of problems. This includes creating long lasting and viable storage solutions as well as making sure that you have enough plant matter to make fuel. \\nIf you have been following the ethanol saga , then you may already know that the loss of arable farm land for the sake of making fuel can be a huge problem. \\nAside from expanding the range of fuels that your farm equipment can use, it is very important to have alternative farm equipment on hand. This includes plows and other equipment that you can pull on your own or use a horse, donkey, or oxen to pull them. \\nEven if you never use these tools, they may still be of use to future generations that may not be able to produce farm equipment to replace machines that wear out or break down. \\nHere are some other things you can do to manage the lack of fuel problem as well as some others that are likely to come up over time: Consider building either a hydroponics or aeroponics farming system. You can usually grow a good bit of food in a very small space without the need for complex farm equipment. Since water and air based growing systems require very little soil, you can also have peace of mind knowing that you won’t have to worry about soil depletion. If you choose to use fish as the source of nutrition in the hydroponics system, then you can also use them for food once they become large enough to eat. Video first seen on WeLikeShootingVideos . Look for ways to reduce plantings only to plants that will be needed for making new seeds. Instead of allowing so many plants to reach full size, you can get a good bit of benefit from consuming micro plants. Not only will this make it easier to grow food indoors, you will also have access to more nutrients in a limited space. \\n10. Lack of a Bug Out Plan \\nToday, the vast majority of preppers tend to see forests, farms, and small towns as the ultimate bug out location. If you are already in this type of setting, then you may also feel that there is no place else to go. \\nIf you do not have a viable bug out plan, then you may be at a bigger disadvantage than expected. No matter whether you need to navigate to another rural area, or to a smaller city that has little damage from a large scale crisis, you will have a lot of problems without a well designed bug out plan. \\nHere are some things that you should at least have on hand in case you need to leave your bug in location: A bug out bag that includes a complete navigation kit. Maps and other materials that can help you get from one place to another as quickly and safely as possible. Some means of transport other than a motor vehicle and a cart for carrying your bug out supplies. A radio and means of communication so that you can always know what is going on in the area you are about to enter. From military patrols to roving bands of thieves, you are best served by knowing where the highest risks are so that you can skirt around these areas instead of going through them. \\nBefore a crisis hits, it is very important to have reliable sources of information. This goes well beyond how to carry out certain tasks or manage any given project. Rather, you will need real-time information from people in areas you intend to enter. \\nThis includes information on the nature of the crisis in the area, how badly it is damaged, and what the biggest threats are. If you need to build a weapon or change your travel plans, it is best to have up to date information that will help you make the best decisions. \\nInvariably, there is nothing like trusted contacts in the location to tell you what is really going on. \\nThere is no question that many people see a return to nature or homestead farming as the ultimate form of prepping. \\nOn the other hand, a nuclear bomb in the right place, a hurricane, tornado, or even an earthquake can make all your hard work go to waste. \\nThese are just a few reasons why you need to consider more than basic survival when planning for rural area bugging in. \\nAt the very least, if you consider the ten points listed in this article, you will have a chance to avoid them, and also use them as a basis for looking into other parts of your bug in plan that might need some additional work. \\nTo survive you need to learn the lost ways and skills that helped our forefathers survive during harsh times. Click the banner below and learn how to live without our modern days technologies and gadgets. \\nThis article has been written by Carmela Tyrell for Survivopedia. 28 total views, 28 views today'"}, "time": 1742563875.6028676}