{"duration": 0.053689002990722656, "input_args": {"text": "'Comedian and talk show host Steve Harvey pushed back against critics he says attacked him for meeting and agreeing to work with Donald Trump’s administration. [“On a personal note, a lot of ya’ll hurt me. You really did. I didn’t expect the backlash to be so fierce,” Harvey told his radio audience Monday.  “Change can only happen when we sit at the table. If we sit at the table, then we can have a say as to what’s to be eaten on the menu,” Harvey said defending his decision to work with Trump. “I have an obligation to take a seat at the table when invited. ” Harvey met with   Donald Trump on Friday at Trump Tower in Manhattan, telling reporters, “I stepped from behind my microphone and I came and talked to the guy who is going to be the 45th president. ” The Family Feud host said he found Trump “both congenial and sincere,” and announced plans to partner with Trump’s Department of Housing and Urban Development nominee Dr. Ben Carson on restoring America’s inner cities. But not everyone was supportive of Harvey’s efforts to join forces with the incoming administration. Morehouse College professor and CNN commentator Marc Lamont Hill said Harvey and other “mediocre negroes being dragged in front of TV as a  ” are allowing themselves to be “being used by folk like Donald Trump. ” “Again, his intention is just to have a seat at the table. But when you’re at the table, you should have experts at the table,” Hill added. “You should have people who can challenge the president at the table. ” Harvey, however, said Monday “If I’m going to keep getting stabbed at, then at least while you’re stabbing me, you should understand my intent for taking the meeting in the first place. ” “When I walked away, [I was] feeling like there might be a real chance for some positive to come out of what so many people think is all gloom and doom,” he said.   Follow Jerome Hudson on Twitter @jeromeehudson'"}, "time": 1742563941.2580328}