{"duration": 0.2854163646697998, "input_args": {"text": "'Home News Ukraine Trump’s Possible Path Out of Ukraine Crisis – Consortiumnews Trump’s Possible Path Out of Ukraine Crisis – Consortiumnews \\nExclusive: The U.S.-backed coup in Ukraine in 2014 sparked a New Cold War with Russia, but a President Trump could roll back tensions with a creative strategy for resolving the Ukraine standoff, writes Jonathan Marshall. \\nBy Jonathan Marshall \\nIf Donald Trump wants to make a decisive and constructive mark on U.S. foreign policy early in his presidency, there’s no better place to start than by helping to end the brutal war in Ukraine that has claimed some 10,000 lives. President-elect Donald Trump \\nThe Obama administration helped ignite that war by attempting to yank Ukraine out of Russia’s orbit and into the Western security and economic sphere. Working alongside the European Union, Washington fanned mass street protests that led to a violent putsch against Kiev’s elected government in February 2014. Moscow responded by annexing (or, depending on your point of view, reunifying with) Russian-speaking Crimea, which is also headquarters of Moscow’s Black Sea Fleet, and backing pro-Russia separatists in the eastern regions of Donetsk and Luhansk. \\nSince then, the two sides have fought to a bloody stalemate. Besides killing thousands of civilians, the war has sunk Ukraine’s economy and fostered rampant corruption. U.S. and E.U. sanctions have dragged down Russia’s economy and derailed cooperation between Washington and Moscow in other theaters. Rising tensions between NATO and Russia have greatly raised the odds of an accidental military confrontation between the world’s two largest nuclear powers. \\nThe best hope for Ukraine — and renewed East-West cooperation — is the Minsk Protocol, signed by Ukrainian, Russian, and European parties in the capital of Belarus on Sept. 5, 2014. The agreement provided for a ceasefire, an exchange of prisoners, and a framework for a political settlement based on giving the Donetsk and Luhansk regions a “special status.” \\nThat agreement broke down amid renewed fighting until the parties signed the Minsk-2 Agreement on Feb. 12, 2015. It provided for constitutional reforms, elections in the two republics, and restoration of Ukrainian sovereignty over its borders. But Kiev has made no serious move to recognize the special status of its breakaway regions, and the two sides have engaged in sporadic hostilities ever since. \\nFinal Words \\nPresidents Obama and Putin exchanged what may have been their final, desultory words on the subject at the Asia-Pacific Economic Cooperation summit in Peru this month. Obama “urged President Putin to uphold Russia’s commitments under the Minsk agreements,” while a Russian spokesman said the two men “expressed regret that it was not possible to make progress in Ukraine.” President Barack Obama meets with President Vladimir Putin of Russia on the sidelines of the G20 Summit at Regnum Carya Resort in Antalya, Turkey, Sunday, Nov. 15, 2015. National Security Advisor Susan E. Rice listens at left. (Official White House Photo by Pete Souza) \\nAs current foreign policy messes go, however, the Ukrainian imbroglio may offer the greatest opportunities for a rewarding cleanup. Doing so will require both sides to acknowledge some fault and find creative ways to save face. \\nFortunately, President-elect Trump has created an opening for such a settlement by reaching out to Putin during the election campaign and explicitly declining to bash Russia for its annexation of Crimea (which followed a hastily arranged referendum in which the official results showed that 96 percent of the voters favored leaving Ukraine and rejoining Russia). \\nThere are also small signs of progress that give hope. A limited demilitarization accord signed in September led to a mutual retreat by the Ukrainian army and pro-Russia separatists from a small city in eastern Ukraine. The withdrawal was verified by observers from the Organization for Security and Cooperation in Europe (OSCE), a party to the Minsk accords. Meanwhile, Ukraine, Germany, France and Russia are working on a new roadmap to strengthen the ceasefire. \\nConditions for Peace \\nIn a June 2015 interview with Charlie Rose, Putin laid out clear and reasonable conditions for making the Minsk accord stick: Ukraine’s anti-Russian President Petro Poroshenko speaking to the Atlantic Council in 2014. (Photo credit: Atlantic Council) \\n“Today we primarily need to comply with all the agreements reached in Minsk … At the same time, I would like to draw . . . the attention of all our partners to the fact that we cannot do it unilaterally. We keep hearing the same thing, repeated like a mantra – that Russia should influence the southeast of Ukraine. We are. However, it is impossible to resolve the problem through our influence on the southeast alone. \\n“There has to be influence on the current official authorities in Kiev, which is something we cannot do. This is a road our Western partners have to take – those in Europe and America. Let us work together. … We believe that to resolve the situation we need to implement the Minsk agreements, as I said. The elements of a political settlement are key here. There are several. . . . \\n“The first one is constitutional reform, and the Minsk agreements say clearly: to provide autonomy or, as they say, decentralization of power. . . \\n“The second thing that has to be done – the law passed earlier on the special status of . . . Luhansk and Donetsk, the unrecognized republics, should be enacted. It was passed, but still not acted upon. This requires a resolution of the Supreme Rada – the Ukrainian Parliament – which is also covered in the Minsk agreements. . . . \\n“The third thing is a law on amnesty. It is impossible to have a political dialogue with people who are threatened with criminal persecution. And finally, they need to pass a law on municipal elections on these territories and to have the elections themselves. All this is spelled out in the Minsk agreements. . . . \\n“I repeat, it is important now to have a direct dialogue between Luhansk, Donetsk and Kiev – this is missing.” \\nFuture of Crimea \\nAny lasting settlement will also require some compromise over Crimea, which Putin has vowed never to relinquish. A map showing Crimea (in beige) and its proximity to both the Ukrainian mainland and Russia. \\nAs Ray McGovern, the CIA’s former chief Russia analyst, has noted, the annexation of Crimea did violate a pledge that Russia made in 1994 — along with Great Britain and the United States — “to respect the independence and sovereignty and existing borders of Ukraine,” as a precondition to Ukraine giving up its nuclear weapons. Of course, the United States and the E.U. had already violated the same pledge by supporting a coup d’état against the country’s elected government. \\nMcGovern cited other “extenuating circumstances, including alarm among Crimeans over what the unconstitutional ouster of Ukraine’s president might mean for them, as well as Moscow’s not unfounded nightmare of NATO taking over Russia’s major, and only warm-water, naval base at Sevastopol in Crimea.” \\nIn support of annexation, Russian and Crimean authorities also pointed to the hasty referendum that was held in Crimea in March 2014, which resulted in 96 percent support for reunification with Russia, a relationship dating back to the Eighteenth Century. Subsequent polls of Crimean opinion, conducted by Western firms, have largely confirmed support for the 2014 referendum on rejoining Russia. But the referendum did not have international observers and was not accepted by the United States and other Western nations. \\nCondemning the annexation in a soaring speech about the “rule of law” and America’s dedication to universal principles, President Obama contrasted Crimea with Kosovo, which NATO forcibly broke away from Serbia in 1999. \\nObama said, “Kosovo only left Serbia after a referendum was organized not outside the boundaries of international law, but in careful cooperation with the United Nations and with Kosovo’s neighbors. None of that even came close to happening in Crimea.” \\nActually, none of that came close to happening in Kosovo, either. Obama’s story was a myth, but it confirmed the powerful legitimacy offered by popular referenda, like those in Great Britain over Scottish independence or Brexit. \\nYet, as part of a permanent settlement of the larger Ukraine crisis, the Minsk signatories could agree to hold another, binding referendum in Crimea under international supervision to decide whether it stays under Russian rule or returns to Ukraine. \\nTo get Russia’s buy-in, the United States and its European allies should agree to lift sanctions if Moscow abides by the referendum and other terms of the Minsk accord. They should also agree to rule out the incorporation of Ukraine into NATO, the original sin that sowed the seeds of crisis between Russia and the West. Russia, in turn, could agree to demilitarize its border with Ukraine. \\nObstacles to Settlement \\nPresident Putin has signaled his willingness to compromise in several ways, including firing his hardline chief of staff, Sergei Ivanov, and welcoming the presence of armed observers from OSCE to monitor the Minsk agreement. The neo-Nazi Wolfsangel symbol on a banner in Ukraine. \\nBut major obstacles still impede progress. One is President Petro Poroshenko’s stalling in the face of opposition to the Minsk accord by Ukrainian nationalists. Kiev needs to be given a firm choice: go it alone, or compromise if it wants continued economic support from the United States and Western Europe. The Obama administration has quietly urged the Poroshenko government to honor the Minsk agreement, but has never put teeth behind its entreaties. \\nThe other major obstacle is hostility from militarist hardliners in the West who propose arming Ukraine to ratchet up conflict with Russia. Prime examples include the State Department’s chief policy maker on Ukraine, Victoria Nuland; former NATO Commander Gen. Philip Breedlove, who became infamous for issuing inflated warnings about Russian military operations; Senate Armed Services Committee Chairman John McCain; and Stephen Hadley, Raytheon board member and former national security adviser to President George W. Bush, who chairs the Orwellian-named United States Institute for Peace. \\nBut Trump will have great leeway as commander-in-chief to reject their advice and set a new direction for NATO’s policy on Ukraine and Russia more generally. He has everything to gain by breaking the cycle of political conflict with Moscow. \\nAn ally in the Kremlin will immeasurably improve his chances of making deals in the Middle East, finding a way out of Afghanistan, and managing China. \\nThe next few months should tell us whether Trump has the independence, imagination, and gumption to do the right thing. \\nJonathan Marshall is author or co-author of five books on international affairs, including The Lebanese Connection: Corruption, Civil War and the International Drug Traffic . Some of his previous articles for Consortiumnews include “Nazi Roots of Ukraine’s Conflict,” “Escalations in a New Cold War,” “European Union’s Imperial Overreach,” and “Kosovo Chaos Undercuts Clinton ‘Success.’”'"}, "time": 1742561892.9840071}