{"duration": 1.2812378406524658, "input_args": {"text": "'The Canadian government may legally remove children from families that refuse to accept their child’s chosen “gender identity” thanks to new legislation passed by the Ontario province. [Bill 89, “Supporting Children, Youth and Families Act, 2017,” was approved on June 1 by a vote of 63 to 23.  The Minister of Children and Youth Services, Michael Coteau, who introduced the bill, said earlier this year that a parent’s failure to recognize and support a child’s gender   is a form of child abuse, and a child in these circumstances should be removed from the situation and placed into protection. “I would consider that a form of abuse, when a child identifies one way and a caregiver is saying no, you need to do this differently,” Coteau said. “If it’s abuse, and if it’s within the definition, a child can be removed from that environment and placed into protection where the abuse stops. ” The new bill replaces the Child and Family Services Act, or Bill 28, which governed child protection, foster care and adoption services. While “gender identity” and “gender expression” are included in the new legislation as important factors to be considered in determining “the best interests of the child,” the religious faith in which the parents are raising the child —  present in former laws —  has been removed from consideration for assessing the child’s best interests. Child protection agents, adoption service providers and judges are now required to take into account and respect a child’s “race, ancestry, place of origin, color, ethnic origin, citizenship, family diversity, disability, creed, sex, sexual orientation, gender identity and gender expression. ” The former law stated that the parent of a child in care has the right “to direct the child’s education and religious upbringing. ” The new law has removed that consideration, saying parents can direct the child’s education and upbringing “in accordance with the child’s or young person’s creed, community identity and cultural identity. ” Some Christians have reacted strongly to the new bill, calling it a violation of parents’ primordial rights to educate their children and a direct assault on Christian beliefs. “With the passage of Bill 89, we’ve entered an era of totalitarian power by the state, such as never witnessed before in Canada’s history,” said Jack Fonseca, senior political strategist for Campaign Life Coalition. “Make no mistake, Bill 89 is a grave threat to Christians and all people of faith who have children, or who hope to grow their family through adoption. ” Canadian child protection services are no stranger to invasive micromanagement of   according to a predetermined worldview. In April of this year, a Christian couple filed a lawsuit against Hamilton Children’s Aid Society after two foster children were removed from their care because they refused tell the children that the Easter bunny is real. “We have a   policy,” said Derek Baars, one of the foster parents, as the motivation for disobeying a child support worker who ordered him and his wife to tell the two girls in their care, aged 3 and 4, that the Easter bunny is real. “We explained to the agency that we are not prepared to tell the children a lie. If the children asked, we would not lie to them, but we wouldn’t bring it up ourselves,” Baars said. Follow Thomas D. Williams on Twitter  Follow @tdwilliamsrome'"}, "time": 1742564382.2444859}