{"duration": 0.02557086944580078, "input_args": {"text": "'U. S. Education Secretary Betsy DeVos was a guest at the Conservative Political Action Conference (CPAC) Thursday, stating that she is working to “find common ground” with the teachers’ unions that were vocal opponents of her nomination and confirmation. [During an interview with CNN’s Kayleigh McEnany at CPAC, DeVos said she had a “great conversation” with Randi Weingarten, president of the American Federation of Teachers (AFT). McEnany mentioned that DeVos has not had the same type of exchange with Lily Eskelsen Garcia, president of the National Education Association (NEA).  “I think it’s imperative that we work together to find common ground,” DeVos said. “If students represent 100 percent of our future, we need to be focused on what’s right for them and doing what’s right for them. ” “My conversation with Randi was great, and we’ve agreed to visit schools together,” the secretary added. “I will visit a school she selects  —   a traditional public school  —   and she will visit a choice school. So I look forward to that opportunity. ” However, Weingarten tweeted that DeVos was attempting a “divide and conquer Schtick”: . @BetsyDeVosED tried a divide conquer Schtick at #CPAC2017, today. .regardless of whether we talk to u, both unions believe 1000% in pub ed,  —   Randi Weingarten (@rweingarten) February 23, 2017,  Eskelsen Garcia released a statement last week: Education Secretary Betsy DeVos called me the other day saying we should talk. But this seems premature. I’m still struck by the lack of clear answers she gave the public at her Senate hearing. There is no doubt where we stand on issues critical to supporting students and public education, but Americans have a right to know where she stands. So I sent her a letter, asking for the answers that we didn’t get from her confirmation hearing. I have yet to receive a response  …     Weingarten rebuked protesters who attempted to block DeVos from entering a public school in Washington, D. C. just days after her confirmation: Just heard a protester blocked  almost knocked Secy @BetsyDeVos down at Jefferson. We don’t condone such acts. We want her to go to pub schls,  —   Randi Weingarten (@rweingarten) February 10, 2017,  “We don’t condone such acts,” Weingarten tweeted. “We want her to go to public schools. ” At CPAC, DeVos spoke from prepared remarks for about ten minutes and then sat down for an interview with McEnany, who said she was “thrilled” for the secretary’s visit. She added, “The nation is so blessed to have you as secretary of education. ”'"}, "time": 1742628427.3697624}