{"duration": 0.04719662666320801, "input_args": {"text": "'CNN’s brand continues to go in a downward spiral, according to a poll. [A YouGov poll shows that CNN falls behind MSNBC and Fox News in brand perception, the Daily Caller reports.  The poll asked respondents, “If you’ve heard anything about the brand in the last two weeks, through advertising, news or word of mouth, was it positive or negative?” Of the three cable networks, Fox News was the only network to score a neutral brand perception. CNN and MSNBC both scored negative on brand perception. “CNN’s negative acceleration point happened in   2016, around the time Anderson Cooper interviewed Melania Trump, notably discussing her husband’s famous ‘Access Hollywood’ tape,” YouGov’s Ted Marzilli notes. “Also at that time, a local North Carolina Republican office was firebombed, causing   media to pounce on CNN for suggesting Trump’s rhetoric spurred the incident. ” Marzilli adds that particular news events and President Trump’s bashing of the network’s news coverage have taken a toll on CNN. Trump has consistently called CNN “fake news,” along with the New York Times, for its    coverage of his administration and its penchant for making several mistakes when reporting on the administration: FAKE NEWS media knowingly doesn’t tell the truth. A great danger to our country. The failing @nytimes has become a joke. Likewise @CNN. Sad!  —   Donald J. Trump (@realDonaldTrump) February 25, 2017,  On Tuesday, CNN’s Jim Acosta inaccurately claimed that Trump made no mention of the “administrative state” in his speech to a joint session of Congress. Trump alluded to the “administrative state” while talking about his lobbying ban for executive branch officials and hiring freeze for   federal government workers. CNN dedicated much airtime in January to memos alleging that Trump’s presidential campaign was in communication with Russian officials. The reports turned out to be false.'"}, "time": 1742563317.035367}