{"duration": 0.09240579605102539, "input_args": {"text": "'LOS ANGELES  —   During new pressure on Viacom to turn around Paramount Pictures, the studio misfired again over the weekend: “” which cost Paramount and    about $100 million to make, not including marketing expenses, arrived to a disastrous $11. 4 million in domestic ticket sales.   flops are no longer uncommon in Hollywood. What is unusual is the patience that Paramount’s corporate owner has afforded the studio. In addition to “” “Teenage Mutant Ninja Turtles: Out of the Shadows,” “Whiskey Tango Foxtrot” and “Zoolander 2” failed to find audiences for Paramount. “Star Trek Beyond” has been a hit. But domestic ticket sales for that film trail its series predecessor by 36 percent. (“Star Trek Beyond” is still rolling out in major markets overseas.) On Friday, as Viacom ousted its chief executive, a media analyst, Michael Nathanson, called Paramount a “truly shocking” problem, noting in a report that the studio may lose $350 million this year. Paramount did protect itself financially on “ ” by teaming with    which paid for 80 percent of the production costs. Paramount also believes that “ ” can take in $100 million overseas. “Movies like ‘Ghostbusters,’ ‘Independence Day’ and ‘ ’ certainly looked like they were going to be big going into the summer, but audiences, especially in the world of remakes, have been very tough,” Rob Moore, Paramount’s vice chairman, said in a phone interview on Sunday. Directed by Timur Bekmambetov and counting Mark Burnett as a producer, “ ” appeared to run into several problems. It was a poorly reviewed remake of a celebrated classic for which few were clamoring. Moviegoers have also generally ignored    epics in recent years. In terms of turnaround efforts at Paramount, Mr. Moore pointed toward coming films like “Jack Reacher: Never Go Back,” with Tom Cruise “Arrival,” a   thriller and “Fences,” an adaptation of the August Wilson play starring Denzel Washington and Viola Davis that is seen as an Oscar candidate. For the weekend, “Suicide Squad” (Warner Bros.) was again the No. 1 ticket seller. It took in about $20. 7 million, for a   domestic total of $262. 3 million, according to comScore. (Overseas, “Suicide Squad” has taken in $310. 4 million.) Among new   the   comedic drama “War Dogs” (Warner Bros.) performed the best. Costing at least $45 million to make, “War Dogs,” which received mediocre reviews, collected an estimated $14. 3 million. The animated movie “Kubo and the Two Strings” (Focus Features) which delighted most critics and cost Laika Entertainment $55 million to make, arrived to about $12. 6 million in ticket sales.'"}, "time": 1742563388.1668675}