{"duration": 0.07390975952148438, "input_args": {"text": "'By Stephen Lendman\\nVenezuela’s oil-dependent economy suffers greatly from low crude oil prices and US economic warfare – waged to destabilize the country, create enormous hardships, mobilize majority opposition to President Nicolas Maduro’s leadership, and end nearly 18 years of economic and social progress. The collapse in the price of crude oil was the result of a carefully designed speculative operation. \\nNeocons in Washington want control over Venezuela’s vast oil reserves, among the world’s largest. With full US support and encouragement, the right wing opposition which controls the National Assembly want Maduros ousted – its latest tactic by recall referendum as constitutionally permitted. \\nOn October 18, Venezuela’s Supreme Court ruled valid signatures of 20% of voters in each of the nation’s 24 states must be collected to proceed with a process against Maduro.\\n“(F)ailure…will render the call for the presidential recall referendum as nullified,” the High Court said in its ruling.\\nOn October 21, Venezuela’s National Electoral Council (CNE) suspended the referendum until further notice, following Supreme Court allegations of fraud. Over 30% of signatures collected had irregularities – including listing over 10,000 deceased persons.\\nA previous article explained how Venezuela’s recall referendum works. Article 72 of Venezuela’s Constitution states “(a)ll magistrates and other offices (including the president) filled by popular vote are subject to revocation.”\\n“Once half (their) term of office…has elapsed, 20% of (registered) voters (by petition may call for) a referendum to revoke such official’s mandate.”\\n“When a number of voters equal to or greater than the number of those who elected the official vote in favor of revocation (provided the total is 20% or more of registered voters), the official’s mandate shall be deemed revoked…”\\nSignatures collected must be verified for authenticity before proceeding further with the recall process. If achieved, it’ll be organized within 90 days. Removing Maduro requires support from more than the 50.6% of voters supporting his 2013 election.\\nTiming is important. If held by January 10, 2017, a new election will be called if Maduro loses. If things go against him after this date, Vice President Aristobulo Isturiz will serve as president until January 2019, when his term expires.\\nIn response to CNE’s suspending the recall process, the factions controlling the National Assembly barely stopped short of urging coup d’etat action to remove Maduro forcefully.\\nLast Sunday, they said they’ll impeach him for “violating democracy.” The body has no legal standing after ignoring the Supreme Court’s October 18 ruling.\\nUnited Socialist Party of Venezuela (PSUV) leader Hector Rodriguez mocked them, saying parties violating the “rules of the game come and talk about democracy…There will be no recall referendum in 2016 because of fraudulent signatures collected.”\\nViolent demonstrations may follow, similar to what occurred in 2014 – perhaps another US coup attempt.\\nOn October 24, WaPo editors disgracefully headlined “How to derail Venezuela’s new dictatorship.” What followed was a disgraceful litany of misinformation, exaggeration and Big Lies.\\nWaPo: Maduro “made clear (he and his government are) prepared to shred what remained of the country’s constitutional order…(They) stripped the opposition-controlled national assembly of its powers, imprisoned several top leaders and tried to slow” the recall process.\\nFact: Maduro and Venezuela’s CNE observe the letter of constitutional law. No opposition powers were “stripped.” Their imprisoned officials plotted to remove Maduro by coup d’etat.\\nCollecting fraudulent signatures “slow(ed)” the recall process, not administration officials.\\nWaPo: Opposition National Assembly members “issued a declaration saying Mr. Maduro had staged a coup. That is accurate – and it ought to provoke a consequential reaction from the United States and Venezuela’s Latin American neighbors.”\\nFact: No Maduro “coup” occurred, nor is one in prospect. WaPo calling for “consequential” action sounds ominously like urging Washington to oust him forcefully.\\nWaPo: “The recall referendum the opposition was pursuing offered a democratic way out of what has become one of the worst political and humanitarian crises in Latin America’s modern history.”\\nFact: US dirty tricks and economic manipulation leading to disruptions in the distribution of food, bear much responsibility for hard times in Venezuela. Real problems exist. Hunger isn’t one of them. WaPo lied claiming “(t)he vast majority of low-income families say they are having trouble obtaining food.”\\nVenezuelans changed their dietary practices because of the scarcity of commonly eaten foods, at times consuming less than earlier. Profiteers hoarding and diverting foodstuffs for resale are responsible, along with high inflation resulting economic manipulation.\\nWaPo: “(T)he United States should be coordinating tough international action.”\\nFact: Neocon WaPo editors want Maduro toppled and replaced. Do they mean by coup d’etat by calling for “tough international action?”\\nStephen Lendman lives in Chicago. He can be reached at lendmanstephen@sbcglobal.net . His new book as editor and contributor is titled “Flashpoint in Ukraine: How the US Drive for Hegemony Risks WW III.” http://www.claritypress.com/LendmanIII.html Visit his blog site at sjlendman.blogspot.com . \\nSource: Global Research \\n'"}, "time": 1742563037.656527}