{"duration": 0.026113271713256836, "input_args": {"text": "'Videos UN Expert: Israel Has Entrenched ‘Colonial-Style Regime’ In West Bank “The diminished geographic territory available to Palestinians is directly linked to Israel’s extensive and expanding settlement project, including its network of highways, adjacent lands and extensive military-security apparatus.” | November 1, 2016 Be Sociable, Share! Israeli soldiers check the IDs of Palestinians near an Israeli checkpoint near Nablus, in the Israeli occupied West Bank, Tuesday, June 3, 2014. \\nA United Nations human rights expert has slammed “Israel’s entrenchment of a colonial-like regime in the Occupied Palestinian Territory”, citing “two separate and unequal systems” with respect to laws, road network, justice system, access to water, freedom of movement, civil rights, and more. \\nMichael Lynk , the UN Special Rapporteur on the situation of human rights in the Palestinian territories occupied since 1967, made the remarks in his new report, presented to the UN General Assembly in New York on Friday. \\nLynk described the Palestinian economy as “without parallel in the modern world.” \\n“No other society in the world faces such an array of cumulative challenges that includes belligerent occupation, territorial discontinuity, political and administrative divergence, geographic confinement and economic disconnectedness”, he said. \\nThe official highlighted a number of Israeli violations of human rights, including administrative detention: “The numbers are staggering”, Lynk wrote, “and are suggestive of an overarching policy that aims to intimidate and significantly restrict the freedoms of Palestinians.” \\nLynk also referred to the Israeli government’s use of punitive home demolitions, which he noted was used on 11 occasions in 2015, displacing 85, while as of July 2016, there had already been 16 demolitions, displacing 92 people. \\n“Punitive demolitions, the purpose of which is to harm the family members of someone suspected of a crime, are in clear violation of the basic tenets of international law.” \\nTaking a look at the big picture, Lynk described “separate and unequal development in the West Bank, and particularly in Area C,” leading “to the creation of two starkly different legal, economic and political universes within one territory.” \\nIsraeli settlers enjoy “a vastly superior system of laws, roads, judicial systems, personal mobility, security, economic opportunities, civil and political rights and living standards than the West Bank Palestinians among whom they live.” \\nWith the 50th anniversary approaching, Lynk said the “the duration of the occupation has lasted well beyond any reasonable length for any Occupying Power acting in good faith.” \\n“The diminished geographic territory available to Palestinians is directly linked to Israel’s extensive and expanding settlement project, including its network of highways, adjacent lands and extensive military-security apparatus.” \\nIndeed, he continued, “without Israel’s settlement project, there would be no rationale for the continuing occupation.” \\nThe Special Rapporteur was unable to visit the OPT due to Israeli non-cooperation, and he pointed out “the duty of Member States to cooperate with the UN human rights mechanisms as a fundamental obligation.” Lynk met with civil society groups and relevant organisations in Amman. \\nThe full report can be read here . \\nThis work by Middle East Monitor is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License . If the image(s) bear our credit, this license also applies to them. Be Sociable, Share!'"}, "time": 1742628444.341273}