{"duration": 0.0242767333984375, "input_args": {"text": "'President Obama said Monday that Colin Kaepernick, the San Francisco 49ers quarterback, was “exercising his constitutional right” by refusing to stand during the national anthem, a decision that has fostered considerable controversy since he first took the action on Aug. 26. While noting the significance of the flag and the national anthem, the president said there was a long history of sports figures making political statements. “I think he cares about some real, legitimate issues that have to be talked about,” President Obama said during a news conference in China. “And if nothing else, what he’s done is he’s generated more conversation around some topics that need to be talked about. ” It was the first time that the president had weighed in on Kaepernick’s actions, which many have criticized as being disrespectful to the United States. Kaepernick, who is biracial and was adopted by white parents, first caused an uproar late last month when he remained seated before a 49ers preseason game with the Green Bay Packers. He said afterward that he would not “stand up to show pride in a flag for a country that oppresses black people and people of color. ” Last Thursday, before the team’s final preseason game, in San Diego, Kaepernick chose to kneel during the anthem. He later said he intended to continue his protest into the regular N. F. L. season. The 49ers play their first   game next Monday. “Once again, I’m not ” Kaepernick said Thursday. “I love America. I love people. That’s why I’m doing this. I want to help make America better. I think having these conversations helps everybody have a better understanding of where everybody is coming from. ” Not long ago, Kaepernick was one of the game’s top players, leading the 49ers to the Super Bowl in the 2012 season and to the N. F. C. championship game the next year. But he was benched halfway through last season and will start the 2016 season as the backup to Blaine Gabbert. Kaepernick was frequently booed during the team’s final preseason game, and the police union in Santa Clara, Calif. has threatened to stop working 49ers home games this season because of Kaepernick’s actions. Donald J. Trump, the Republican presidential nominee, is among those who have denounced him. Nevertheless, his stance has also led to numerous expressions of support, with backers arguing that his protest is a worthy statement on the troubled status of race relations in the United States. And even though he is a backup quarterback, his jersey is now the   seller at the N. F. L. ’s official online store. Seattle defensive back Jeremy Lane said he would continue to sit for the national anthem when the Seahawks’ regular season begins Sunday at home, The Associated Press reported. After Lane sat during the anthem in the Seahawks’ preseason game last Thursday, he said, Kaepernick reached out to thank him for his support and his gesture. Megan Rapinoe, one of America’s most prominent soccer players, knelt during a National Women’s Soccer League match on Sunday in support of Kaepernick. She told espnW that she was disgusted by how Kaepernick has been treated, and would continue to kneel throughout the season. “Quite honestly, being gay, I have stood with my hand over my heart during the national anthem and felt like I haven’t had my liberties protected, so I can absolutely sympathize with that feeling,” she said. Tim Kaine, the Democratic   nominee, told ABC News that Kaepernick’s rationale “didn’t really make that much sense to me,” but supported his right to protest. “You’ve got to respect people’s ability to act according to their conscience, so I wouldn’t presume to tell him what to do,” he said.'"}, "time": 1742628596.2476683}