{"duration": 0.07167339324951172, "input_args": {"text": "'Probably the best way to experience “Warcraft,” a generally amusing and sometimes visually arresting absurdity, is stoned. If watching the big screen through a cannabis cloud isn’t your idea of a good movie time, though, I suggest that you do what I did and just go with the incoherent flow. You may not grasp who the   creatures with simian arms and woolly mammoth tusks are or why they seem permanently engorged with rage. But there’s more to movies than narrative coherency, as anyone who has sampled the cinema of Michael Bay or certain art films well knows. There is in this movie, for starters, the visual appeal of those Blutoesque beings, lovingly fabricated and ornamented   creations who share their name with the creatures that J. R. R. Tolkien called orcs. Tolkien borrowed orc from the Old English, citing “Beowulf,” one of the many tales of blood lust and vengeance, heroes and monsters that are woven into the “Warcraft” DNA. The ruler here is King Llane (Dominic Cooper) a rather progressive monarch who fights the invading orcs with a multihued army, a rakish    (Travis Fimmel) a token chick (Paula Patton) and a magical twosome (Ben Foster and Ben Schnetzer). If there’s a mythology here, I missed it, much as I also missed the charm and periodic lightness of Tolkien’s world, with its hobbits and Shire. “Warcraft” by contrast weighs in as a Hobbesian war of all against all, though it does allow for a little romance and campy winks. It also, more surprisingly, offers some   notably with Durotan (Toby Kebbell) an orc chieftain with hands as big as Volkswagen Beetles and a pregnant mate, Draka (Anna Galvin). He has qualms as well as enemies, which surface amid battles and exposition. Stuff happens in one part of this world, and other stuff happens elsewhere: Jaws clench, bodies fall, and scenes oscillate  —   ’twas ever thus, genrewise. Even so, despite the incessant clashing and clanging, you can hear the tremulous pulse of a heartbeat. That faint thrumming belongs to Duncan Jones, the director who, against the odds, has mined a watchable movie out of an entertainment franchise that started with a video game and now includes novels, comics and assorted schlock (toys, costumes, a   set). That Mr. Jones even factors into this production counts as some kind of actual achievement given that “Warcraft” is such an obvious bid at brand expansion, which may be why no one bothered with an intelligible story. Apparently, branded content (i. e. the characters, their world) was meant to be enough. Whether you see more here will depend on your mileage and patience, though moviegoers habituated to   (and the perfunctory she) pulverizing one another for 100 or so minutes are likely to have greater tolerance for this diversion than others might. As suggested, trying to figure out who’s doing what to whom and why  —   or how orcs dress with such huge hands or how they chew steak with those tusks  —   is often pointless when it comes to spectacles. In cinema’s earliest years, moviegoers thrilled not to stories but what the scholar Tom Gunning calls “the cinema of attractions,” with its   shocks and tricks we’re still getting pummeled, story or no. Mr. Jones doubles down on the action, though without any real shocks (or awe) but he also modestly complicates the question of the monstrous. The orcs in “Warcraft” prove somewhat more psychologically complex than any number of cartoon Hollywood villains  —   they’re sincere, for one  —   and they’re generally better company than the king and his crew. It says something about Mr. Jones’s choices that he gives Durotan so much screen time and that Mr. Kebbell, with the help of the   wizards, makes good use of that time with a nuanced,   turn that evokes   gladiators like Victor Mature. Durotan is a beautiful brute, and all the more human for it. “Warcraft” is rated   (Parents strongly cautioned). Heads pop like grapes and so forth. Running time: 2 hours 3 minutes.'"}, "time": 1742561719.6768928}