{"duration": 0.03374767303466797, "input_args": {"text": "'On Thursday’s broadcast of the Fox News Channel’s “America’s Newsroom,” Polk County, FL Sheriff Grady Judd stated that illegal immigrants committing felonies is a phenomenon that is at an epidemic level “across the United States. There’s not a day goes by that we all don’t arrest a lot of illegal aliens that are out here preying on the people in this country. ”  Judd was asked about his prior comments that illegal immigrants committing felonies are an “epidemic. ” He said, “It is at that level across the United States. There’s not a day goes by that we all don’t arrest a lot of illegal aliens that are out here preying on the people in this country. And they’re committing felonies, violent felonies, and they’re trafficking in narcotics. And if that’s not enough, we deport them, they come back, and pick up doing the same thing again. ” He added, “We’re seeing a total[ly] different attitude by Immigration and Customs already. And what we have to do is pick them up, keep them locked up until they’re deported to their home country of origin. And I can tell you this, the community will be safer, less drugs will flow on our streets, and there will be less weapons violence. Every day my detectives go out, and they seek out and arrest people for violating the drug laws. Many of those folks are illegal aliens, here, with guns, posing a specific danger to our deputies, to our law enforcement officers, and to the community. But I have a simple question for those who think there’s a problem with that: Why don’t you take them home with you? Why don’t you rent them a home next door to you? Because you know they’re living next door to somebody in our community, and they’re terrorizing them. ” Judd also stated that he didn’t think what he proposed would result in economic losses, and “The people we arrest, they’re not harvesting any vegetables, or any citrus. ” Follow Ian Hanchett on Twitter @IanHanchett'"}, "time": 1742561706.3525136}