{"duration": 0.04207968711853027, "input_args": {"text": "'Dandelion roots are tenacious and normally thought of as nasty weeds that destroy lawns. \\n\\nYet herbalists love dandelions as a food and medicine. Their long roots dig deep into the earth and pull vitamins and minerals into the plant. Fresh dandelion roots have a sweet and slightly bitter taste and they make great nutrient-dense food. \\n\\nHerbalists use dandelion roots to support liver health. Since it improves liver function, the root has many other benefits that stem from this. It can help eradicate symptoms associated with poor liver health, including acne, boils, and premenstrual syndrome (PMS). \\n\\nHow to Harvest \\n\\nDandelions are small herbaceous perennial plants that grow in disturbed soils, from lawns to gardens to farms to roadsides to abandoned lots. \\n\\nWhen harvesting dandelion roots for eating, be sure to harvest them in an area that has not been sprayed with herbicides or insecticides. Harvest away from areas that are likely contaminated with pollutants (don’t harvest dandelions from roadsides). \\n\\nLook for dandelions with good clumps of leaves because this will mean that they will have large roots. \\n\\nWhen using dandelion root for medicine, it is good to harvest them in the fall. However, these roots are fine to use any time of the year and still offer a plethora of health benefits. \\n\\nHarvest the roots with a digging stick and dig around the outermost edges of the leaves to loosen the soil. Avoid cutting into the root. Once the soil is sufficiently loosened, reach down to gently break up the soil and free the root. If the root is still firmly attached to the soil and you pull too firmly, you will break the root. \\n\\nIf the leaves of the roots you are harvesting are young, you can use them in salads of put them in a pesto. \\n\\nBe sure to wash your roots well before using them in this recipe. \\n\\nSubmerge them in a bowl of water and stir the water.'"}, "time": 1742628419.2416492}