{"duration": 0.08664059638977051, "input_args": {"text": "' Western \\x93Culture\\x94 is Wrecking Entire Continents\\nBy Andre Vltchek You say \\x93European cultural institutions\\x94, and what should come immediately to mind are lavish concerts, avant-garde art exhibitions, high quality language courses and benevolent scholarships for talented cash-strapped local students.\\nIt is all so noble, so civilized!\\nOr, is it really? Think twice!\\nI wrote my short novel, \\x93Aurora\\x94 , after studying the activities of various Western \\x91cultural institutions\\x92, in virtually all the continents of the Planet. I encountered their heads; I interacted with the \\x91beneficiaries\\x92 of various funding schemes, and I managed to get \\x91behind the scenes\\x92.\\nWhat I discovered was shocking: these shiny \\x91temples of culture\\x92 in the middle of so many devastated and miserable cities worldwide (devastated by the Western imperialism and by its closest allies \\x96 the shameless local elites), are actually extremely closely linked to Western intelligence organizations. They are directly involved in the neo-colonialist project, which is implemented virtually on all continents of the world, by North America, Europe and Japan.\\n\\x91Culture\\x92 is used to re-educate and to indoctrinate mainly the children of the local elites. Funding and grants are put to work where threats and killing were applied before. How does it work? It is actually all quite simple: rebellious, socially-oriented and anti-imperialist local artists and thinkers are now shamelessly bought and corrupted. Their egos are played on with great skill. Trips abroad for \\x91young and talented artists\\x92 are arranged, funding dispersed, scholarships offered.\\nCarrots are too tasty, most would say, \\x91irresistible\\x92. Seals of approval from the Empire are ready to stamp those blank pages of the lives of still young, unrecognized but angry and sharp young artists and intellectuals from those poor, colonized countries. It is so easy to betray! It is so easy to bend.\\nSome, very few countries are almost incorruptible, like Cuba. But Cuba is a unique country. And it is intensively demonized by the Western propaganda. \\x93Patria no se vende!\\x94 they say there, or in translation \\x93One does not sell Fatherland!\\x94 But one, unfortunately, does, almost everywhere else in the world: from Indonesia to Turkey, from Kenya to India.\\n***\\n\\x93 Aurora\\x94 opens in a small cafe in an ancient city in Indonesia (which is not called Indonesia). Hans, the German head of an unnamed cultural institute is talking to his local \\x91disciples\\x92. He loves his life here: all the respect he gets, those countless women he is sexually possessing and humiliating, the lavish lifestyle he is allowed to lead.\\nA woman enters; a beautiful woman, a proud woman, an artist, a woman who was born here but who left, many years ago, for far away Venezuela. Her name is Aurora. Her husband is Orozco, a renowned revolutionary painter. Aurora\\x92s sister was killed in this country, because she refused to give up her revolutionary art. She was kidnapped, tortured, raped, and then murdered. Hans, the head of a European cultural organization, was involved.\\nAurora confronts Hans, and in reality, the entire European culture of plunder and colonialism.\\nAnd that night she is joined, she is supported, by Wolfgang Amadeus Mozart, or more precisely, by his merry ghost, who is thoroughly disgusted of being used as one of the symbols of the \\x91culture\\x92 which destroyed him personally, which destroyed the very essence of the arts, and which has been in fact destroying, for centuries, this entire Planet.\\n***\\nWhen I recently shared the plot of \\x93Aurora\\x94 with a local \\x91independent\\x92 filmmaker in Khartoum, Sudan, he first listened attentively, and then with horror, and in the end he made a hasty dash towards the door. He escaped, not even trying to hide his distress. Later I was told that he is fully funded by Western \\x91cultural institutions\\x92.\\nAfter reading it, my African comrades, several leading anti-imperialist fighters, immediately endorsed the book, claiming that it addressed some of the essential problems their continent is facing.\\nThe cultural destruction the Empire is spreading is similar everywhere: in Africa, Asia and in Latin America.\\nI wrote \\x93Aurora\\x94 as a work of art, as fiction. But I also wrote it as a J\\x92accuse , as a detailed study of cultural imperialism.\\nMy dream is that it would be read by millions of young thinkers and artists, on all continents, that it would help them to understand how the Empire operates, and how filthy and disgraceful betrayal is. Andre Vltchek is a philosopher, novelist, filmmaker and investigative journalist. He has covered wars and conflicts in dozens of countries. Three of his latest books are revolutionary novel \\x93 Aurora \\x94 and two bestselling works of political non-fiction: \\x93 Exposing Lies Of The Empire \\x94 and \\x93 Fighting Against Western Imperialism \\x94. View his other books here. Andre is making films for teleSUR and Al-Mayadeen. After having lived in Latin America, Africa and Oceania, Vltchek presently resides in East Asia and the Middle East, and continues to work around the world. He can be reached through his website and his Twitter .'"}, "time": 1742563968.9854364}