{"duration": 0.08409905433654785, "input_args": {"text": "'Religions tend to invent ideas and concepts just like every other creative human enterprise, and they have unleashed some remarkably bad ideas onto humanity . Most of these are centered around the notion of telling people what to do and how to live their lives, with the aim of convincing people that conformity to church guidelines will bring some intangible reward in the afterlife.\\n\\n\\nOne example of many is the Christian belief that the one and only way not to eternally burn in Hell is to accept Jesus Christ as the savior, as if no other deity or religious experience is valid to the human experience.\\n\\nThe concept of heaven and hell has been so ingrained into the human psyche that many people cannot see beyond this limiting paradigm to any other possibility. Retired Episcopal bishop John Shelby Spong , however, doesn’t seem to believe in the myth of Hell, and during a nationally televised interview he shared his opinions on why he thinks convincing the flock to believe in the concept of ‘Hell’ is absolutely critical to the Church’s survival.\\n“I don’t think Hell exists. I happen to believe in life after death, but I don’t think it’s got a thing to do with reward and punishment. Religion is always in the control business, and that’s something people don’t really understand. It’s in a guilt-producing control business. And if you have Heaven as a place where you’re rewarded for your goodness, and Hell is a place where you’re punished for your evil, then you sort of have control of the population. And so they create this fiery place which has quite literally scared the Hell out of a lot of people, throughout Christian history. And it’s part of a control tactic.”  Many people turn to religious teachings for solace and guidance in life in our insane world, but, Bishop Spong seems to think religion helps people be less responsible for their own life and the world we live in, offering a unique perspective from the typical doctrines of Christian belief. “The church doesn’t like for people to grow up, because you can’t control grown-ups. That’s why we talk about being born again. When you’re born again, you’re still a child. People don’t need to be born again. They need to grow up. They need to accept their responsibility for themselves and the world.” No one can really confirm where human souls are bound after death, so why do religions create stories of places like Heaven and Hell? The answer is simple: to control people and keep the Church alive.\\n\\nIf even some of the most religious men, such as Bishop John Shelby Spong, are starting to publicly expose the motivations behind these stories, perhaps it is time for the masses to critically evaluate the value of religion over the importance of direct personal spiritual experience .\\n“Every church I know claims that ‘we are the true church’ – that they have some ultimate authority, ‘We have the infallible Pope,’ ‘We have the Bible.’… The idea that the truth of God can be bound in any human system, by any human creed, by any human book, is almost beyond imagination for me. \\nGod is not a Christian. God is not a Jew or a Muslim or a Hindi or Buddhist. All of those are human systems, which human beings have created to try to help us walk into the mystery of God. I honor my tradition. I walk through my tradition. But I don’t think my tradition defines God. It only points me to God.” WATCH THE  VIDEO: \\n\\n\\nWaking Times SOURCE '"}, "time": 1742563350.5460553}