{"duration": 0.04734468460083008, "input_args": {"text": "'— Good Ideas Vs Bad (@BadIdeasVs) October 30, 2016 \\nSince the story broke on Friday that the FBI is renewing the investigation into Hillary Clinton’s emails, Huma Abedin suddenly became strangely absent from Hillary’s campaign. In fact, it seems she has vanished. The next tweet features another “missing person” style meme and notes, “ According to the Clinton Foundation, she was recently believed to be suicidal, however, Huma has no history of depression. ” Clearly, the creator was taking a sarcastic jab at the impossible coincidence that so many people close to the Clintons have committed suicide. \\n— Ben Dihya (@bendyhya) October 30, 2016 \\nSome reports assume that she’s dropped out of the public eye and is holed up with lawyers, trying to come up with a plan to save her own ass. Others wonder if she’s fled the country or is otherwise in hiding in fear of Hillary’s retaliation. Meme created for the #SaveHuma internet campaign. (Source: Facebook) \\nWhile the former is most likely the truth, the internet is exploding with memes and tweets, which have been created by users who were obviously inspired by the rumored “Clinton Body Count” list and have added in a good amount of sarcastic humor too. Meme created for the #SaveHuma internet campaign. (Source: Facebook) \\nThe tongue-in-cheek memes and the #SaveHuma and #PrayForHuma hashtag campaigns are spreading like crazy, likely because of their underlying “karma’s a b*tch” Â kind of tone. The idea of poetic justice being served up to Hillary Clinton and any person who aided and abetted her criminal actsÂ is a very popular notion these days. \\nNow that the FBI hasÂ what is most likely the missing 33,000 emails, we can be reasonably sure that actual, lawful justice is on the horizon as well, and there isn’t a hashtag on Earth that will be able to save Crooked Hillary or her favorite minion, Huma, from facing the consequences of their actions.'"}, "time": 1742563484.105576}