{"duration": 0.1119527816772461, "input_args": {"text": "'\\nSo you want to talk to Mark Cuban on the latest Hillary email thing eh? \\nYou ought to try someone with a bit of credibility. You see, Mark Cuban is not ignorant and his appearance this morning on CNBC did not contain “mistakes.” \\nHe was lying. \\nThis “newly discovered” laptop is very likely to be literal nuclear waste for Hillary and everyone around her, including the Clinton Foundation and all of Hillary’s “advisers” such as Podesta. \\nMark Cuban said that Huma used Outlook and IMAP (for Yahoo and similar.) True.\\nBut then he said this was unlikely to lead to “new” evidence in the form of the emails.\\nThat’s a lie .\\nIt’s a lie because Cuban knows he’s full of crap; he knows enough about the technologies involved to be fully aware that he was peddling nonsense.\\nIMAP and Exchange are email protocols. (So is POP3, but that’s pretty much deprecated everywhere for good reason.) Exchange, when available, is often preferred by business people because it syncs not just email but also calendars and contact lists, which can (and does) include both phone numbers and email addresses.\\nIMAP is typically used by clients like Thunderbird because it doesn’t know to speak Exchange. There’s a plug-in for calendars using the davical protocol and another (the SoGo connector) for contacts, but no integrated Exchange support.\\nOutlook can use IMAP, but where the server supports it (like Clinton’s “homebrewed” email server) Exchange would normally be used instead as a preferred choice. It both does more and also does a far better job of threading conversations (which is very convenient) and thus is almost-always preferred when it is available.\\nHere’s the problem for the Clintons: Both of these protocols will sync any folder they are told to monitor and can be told to pull local copies of emails . By default both will typically do so on a desktop or laptop environment because WiFi is usually available and it has enough bandwidth to make that efficient. Mobile devices sometimes are configured to only grab email headers by default but increasingly, with 4g service, they’re set up to get full messages too, sometimes including all attachments. \\nThe reason to do this is that it is a lot faster to search messages locally than over the wire, and it’s convenient to be able to search messages. In addition pulling full copies (including attachments) allows you to work offline (when there’s no WiFi or other network available), and then re-sync when you get back in range.\\nHere’s the problem for Hillary — when the server had emails deleted and then was “Bleached” it had already been taken offline and was never returned to service . As such the laptop client would have been unable to connect back to it and thus it would never be told to remove anything. \\nWithout that machine (Weiner’s laptop) being under remote administration such as Domain Policy control (which we can reasonably assume it was not as Huma claims “she didn’t know about it” and it was allegedly a private laptop) there is no remote capability to wipe or otherwise get into said computer and remove the emails either. In fact there’s a decent chance it’s running an operating system edition (if Windows) that lacks domain control capability entirely. \\nThis means that the odds are extremely high that all of the deleted emails to which Huma was a participant are on that computer. \\nEvery.\\nSingle.\\nOne. \\nIf that examination shows that work product, or worse, classified information was sent and/or received and the evidence intentionally destroyed via the “Bleachbit” process then everyone involved is cooked. Remember, the claim was that the emails deleted were nothing more than yoga chat and similar; all “personal” content that the government had no right to and implicated no national security interest. Further, Huma claimed twice (once during her exit from State, and again under oath when questioned) that she had turned over all devices that might or did have US Government work product on them and had retained no copies .\\nIf that is proved to be a lie, or worse, proof of felony conduct such as influence peddling or (God forbid for them) something like the rumored link to Epstein’s Lolita Express is found in those archives then a whole bunch of people are going straight to prison not only on the original acts evidenced in the emails themselves but also on felony obstruction of justice and perjury charges. \\nYes, folks, this is a very big deal because it is the first discovery of a computer that appears to have been sync’d against the Clinton server but was neither tampered with or destroyed , and thus it likely contains all of the pertinent evidence to which Huma was a part.\\nI argue that the media is lying and soliciting others to lie. Mark Cuban knows all of this as he’s well-aware of how email works on the Internet. I’m aware of it too, having run an ISP during the early 1990s, having run corporate, personal and ISP-level email servers both before and since up to and including the present day, and I can confidently state that unless someone took affirmative action to alter the record the odds are extremely high that every single email chain Huma participated in is likely on that laptop, whether Hillary and her friends tried to delete it or not. \\nI’m a subject matter expert in this regard folks. \\nYeah, CNBC, I’m not your biggest fan. But you (and the rest of the media) know damn well I can get to a studio in about an hour and a half and if you call I will be happy to don a suit (ok, at least the top half that the camera can see) and scoot on over to correct the record from a technical level on exactly what has been found and what is likely now in both the FBI’s and the NY State Police/NYPD’s hands. \\nConsider this an open invite to any of the MSM folks to do exactly that; you folks all still have my phone number and I can only conclude it hasn’t rung because you are not interested in the truth from someone who has the technical competence to explain it to your viewers. \\nReport the news, media wonks, instead of trying to shape it. Delivered by The Daily Sheeple \\nWe encourage you to share and republish our reports, analyses, breaking news and videos ( Click for details ). \\nContributed by Karl Denninger of Market Ticker . \\nKarl Denninger is the author of Leverage: How Cheap Money Will Destroy the World . You can follow his daily commentary on capital markets at The Market Ticker and his weekly Ticker Guy Blog Talk Radio broadcasts. '"}, "time": 1742562676.240891}