{"duration": 0.015775680541992188, "input_args": {"text": "'In March, Natalie Angier reported some of the latest findings about parrots, nature’s most colorful birds in more ways than one. Along with the article, we asked readers to submit videos of their feathered friends showing what makes them unique. We received hundreds of replies. Many of the videos demonstrated a longstanding fascination with the capabilities and intellects of these amazing birds. As it turns out, that fascination has a long history in The Times. A tour of our archives shows that journalists here have been reporting on what parrots can do since the   century. In 1859, a look at a book called “An Illustrated History of the Animal Kingdom” noted the capabilities of parrots. Some birds could recite the Lord’s Prayer and the Apostles’ Creed, The Times reported. In 1876, an article headlined “Anecdotes of Parrots” recounted the tale of a parrot who died in Britain in 1802 after years spent impressing her owner with her musical ability. She “beat time with all the appearance of science. ” You’ll see these capabilities echoed in the videos submitted by readers, as birds warble tunes they’ve heard people sing and keep beats as steadily as that celebrated musical prodigy. But it wasn’t always the case that parrots were thought of favorably in The Times. An article on the editorial page in 1877 attacked parrots the way the birds themselves tear into food. The polemic was prompted by a Philadelphia man’s proposal to gather the most intelligent parrots and to breed them in a program that sounds a bit like avian eugenics. “There are few persons or things that are more objectionable than the parrot,” the article began. The editorial continued, “That offensive style of bird is either kept by misanthropic old ladies or by malignant persons with a special grudge against their neighbors. ” After watching the videos submitted by readers, it’s hard to believe such charming birds could belong to people so terrible. Consider our opinion of parrot owners to be fully reformed.'"}, "time": 1742628589.9435542}