{"duration": 0.06537389755249023, "input_args": {"text": "'Our Own Mandelas: Former Black Panthers Call for Release of Their Comrades Our Own Mandelas: Former Black Panthers Call for Release of Their Comrades By 0 61 \\nSome members of the Black Panther Party have been behind bars for more than four decades and are now suffering from poor health. In some cases, court documents show they were punished essentially for being in the black liberation struggle. Many continue to face parole board denials based on their relationship with the party. We discuss their cases with Sekou Odinga, a former Black Panther who was a political prisoner for 33 years and was released in November 2014. \\nTRANSCRIPT \\nAMY GOODMAN: Sekou Odinga, while you’re out of jail, you’re very much focused on those who are still in prison. Can you talk about some of those cases? \\nSEKOU ODINGA: Yeah. We have a number of brothers left in the prisons, about 15 of them. And for the most part, they’re in bad condition. Most of us are getting older, you know. I believe all of them is 60 years or older. They’ve been in prison for long periods of time. Many of them should have never been in prison at all. They were framed and illegally convicted. So, I’ve been trying to, as well as many of the other brothers—I know all three of the other brothers that’s on this program with us have been advocating for the release of these other political prisoners, prisoners like Mumia Abu-Jamal, Sundiata Acoli, Mutulu Shakur, Robert Seth Hayes, Kamau Sadiki, Veronza Bowers. It’s another—like I say, it’s 15 from the party itself, and there’s many other political prisoners in this country. \\nYou know, this country maintains that there is no political prisoners, that everybody is criminals, but it’s just not true. You know, the same—the same things that we hurray and support in other places, like people like Nelson Mandela, our prisoners were doing the same thing, and they were captured and convicted of the same things. And we should remember them and treat them like the heroes they are. They earned that respect. Most of them, like I said, are getting older. A lot of them are sick. \\nYou know, a lot of them are being held even after the courts have…'"}, "time": 1742561748.1183264}