{"duration": 0.1521601676940918, "input_args": {"text": "'Los BRICS plantan cara a la guerra financiera de Estados Unidos por Ariel Noyola Rodríguez Para hacer frente a la guerra financiera de Estados Unidos, es urgente que los BRICS fortalezcan sus vínculos de cooperación en los ámbitos de la economía y las finanzas. El nuevo banco de desarrollo de los BRICS debe aumentar su volumen de créditos, lo mismo el Acuerdo Contingente de Reservas. Adicionalmente, los BRICS deben poner en marcha lo más pronto posible su propia agencia de calificación. Para intensificar su cohesión económica, la implementación de un área de libre comercio echaría abajo las barreras arancelarias y, con ello, incrementaría sustancialmente los intercambios comerciales entre ellos. En definitiva, si no se toman cuanto antes las medidas pertinentes, los BRICS corren el riesgo de naufragar durante el próximo huracán financiero.\\nRed Voltaire | Ciudad de México (México) | 27 de octubre de 2016 français русский italiano El 15 y 16 de octubre se llevó a cabo en el estado de Goa (India) la octava cumbre de los BRICS, acrónimo de Brasil, Rusia, India, China y Sudáfrica. Hay que reconocer que el encuentro se desarrolló en medio de una situación profundamente crítica para la economía mundial. Sin embargo, los BRICS pusieron de manifiesto, una vez más, su extraordinaria capacidad para transformar un mal momento en una oportunidad para profundizar los vínculos entre ellos desde una perspectiva estratégica.\\nDespués de que las economías de los BRICS gozaran de una ’época dorada’, en los últimos años sus tasas de crecimiento han sufrido una drástica desaceleración. Frente a esta difícil coyuntura, hoy más que nunca los BRICS necesitan echar mano de las instituciones financieras que presentaron ante el mundo hace un par de años en Fortaleza (Brasil) durante su sexta cumbre [ 1 ].\\nEn abril pasado, su nuevo banco de desarrollo realizó sus primeros préstamos [ 2 ] por más de 800 millones de dólares y para 2017 se calcula que los créditos otorgados podrían alcanzar los 2 500 millones de dólares [ 3 ]. Asimismo, esta entidad financiera llevó a cabo en julio de este año una histórica emisión de ’bonos verdes’ (’green bonds’) en yuanes por un monto equivalente a 450 millones de dólares [ 4 ]. Estos títulos financieros, a la vez que incrementan la influencia de la moneda china a escala mundial, sirven para el financiamiento de grandes proyectos de inversión.\\nPor su parte, el Acuerdo Contingente de Reservas (CRA, por sus siglas en inglés), dotado de 100 000 millones de dólares, ya está listo para otorgar sus primeras líneas de crédito con el objetivo de estabilizar las balanzas de pagos de los BRICS, según anunció el ministro de Finanzas de la India, Arun Jaitley [ 5 ]. Toda vez que la Reserva Federal (FED) de Estados Unidos amaga permanentemente con subir la tasa de interés de los fondos federales (’federal funds rate’) y, con ello, detonar una nueva turbulencia financiera mundial, urge que los BRICS incrementen cuanto antes los recursos monetarios de su fondo de estabilización pues, de lo contrario, corren el riesgo de padecer serios estragos por las apuestas especulativas de los grandes bancos de inversiones.\\nDe forma simultánea, los BRICS necesitan abrir nuevos frentes de batalla que desafíen de modo abierto la hegemonía de Estados Unidos y el dólar en el sistema financiero mundial [ 6 ], no solamente a través de los intercambios comerciales en monedas locales sino, por ejemplo, a través de la acumulación de reservas en yuanes entre sus bancos centrales, más todavía luego de que ’la moneda del pueblo’ (’renminbi’, en chino) ingresó oficialmente el pasado 1º de octubre en los Derechos Especiales de Giro (’Special Drawing Rights’), la canasta de divisas de élite creada por el Fondo Monetario Internacional (FMI) a finales de la década de los 60 [ 7 ].\\nPor añadidura, los BRICS tienen la capacidad de articular una gran alianza financiera con poderosos eslabonamientos geopolíticos entre América Latina, Asia, África y el Medio Oriente. Los bancos regionales de desarrollo, que están conformados en su mayoría por los países periféricos, bien pueden servir a este objetivo: el Banco Asiático de Inversiones en Infraestructura (AIIB, por sus siglas en inglés), el banco del ALBA (Alianza Bolivariana para los Pueblos de Nuestra América) e incluso el Banco del Sur que, finalmente, arrancará antes de que termine este año.\\nAsimismo, se ha vuelto una imperiosa exigencia para los BRICS la puesta en marcha de una agencia de calificación propia que rompa con el predominio aplastante que Estados Unidos mantiene a través de Fitch, Moody’s y Standard & Poor’s [ 8 ]\\n. Estas tres agencias de calificación, más que realizar evaluaciones que se guíen por criterios de tipo técnico, actúan fundamentalmente bajo impulsos de carácter político; esto es, como auténticas máquinas de guerra: degradan las notas de los bonos de deuda soberana y, con ello, elevan dramáticamente los costos de financiamiento de países como Grecia, Rusia o Venezuela.\\nLa cohesión económica es otro de los grandes retos, si bien es indudable que se ha venido intensificando de forma sustantiva durante los años recientes: entre 2001 y 2015, el comercio entre los BRICS como proporción de sus intercambios totales se duplicó del 6 al 12% [ 9 ]. China es, por mucho, la economía que está más integrada con los demás BRICS. En contraste, los vínculos entre países como la India y Sudáfrica son marginales. Lo mismo sucede entre Brasil y Rusia. Por eso es muy pertinente la próxima implementación de un área de libre comercio entre los BRICS [ 10 ]. Sin embargo, además de echar abajo las barreras arancelarias entre ellos, los BRICS necesitan promover la construcción de cadenas de valor de forma conjunta; esto es, integrar sus aparatos productivos para incentivar la industrialización de las economías menos aventajadas.\\nEn conclusión, son muchos los desafíos en el horizonte para estas cinco potencias emergentes. Estoy convencido de que, en lo sucesivo, el éxito de los BRICS dependerá de la capacidad que tengan para reinventarse, de su creatividad para articular nuevas dimensiones de cooperación con vistas a cumplir metas de más largo alcance. Frente a la nueva guerra financiera que prepara Estados Unidos, es momento de que los BRICS vuelvan a la carga…\\nAriel Noyola Rodríguez Fuente\\nRussia Today (Rusia)'"}, "time": 1742563321.57212}