{"duration": 0.06959843635559082, "input_args": {"text": "'Donnerstag, 17. November 2016 Krankenhaus führt Operationen nur noch nachts durch, um Narkosemittel zu sparen Berlin (Archiv) - Ob dieses Konzept Schule macht? Als erstes deutsches Krankenhaus hat das Pantaleon-Klinikum in Berlin angekündigt, operative Eingriffe nach Möglichkeit nur noch zwischen 22 und 5 Uhr durchzuführen. Weil Patienten um diese Uhrzeit in der Regel ohnehin schlafen, kann auf eine Vollnarkose und damit auf teure Sedativa verzichtet werden. Den natürlichen Schlaf des Menschen für chirurgische Eingriffe zu nutzen, ist laut Chefarzt Dr. Jürgen Michels ein eigentlich naheliegender Ansatz: \"Narkosemittel sind ja dazu da, den Patienten in einen künstlichen Schlafzustand zu versetzen, bedeuten aber gleichzeitig jede Menge Stress für den Organismus. Nachts hingegen schlafen die meisten Menschen ganz ohne Sedierung, was es uns abseits der gesundheitlichen Vorteile außerdem ermöglicht, auf lange Sicht eine Menge Geld zu sparen, das wir an anderen Stellen gezielt einsetzen können.\" \"War was?\": Aufwachen am Morgen nach der OP Die Vorteile der neuen Methode liegen auf der Hand: Viele Patienten schlafen nachts bis zu acht Stunden, was auch komplizierte, langwierige Eingriffe ohne Vollnarkose ermöglicht. Kleinere Routine-Eingriffe können aber auch nachmittags während des Mittagsschlafs durchgeführt werden. Der Ablauf einer solchen OP unterscheidet sich kaum vom bisherigen Prozedere: Nachdem alle Vorbereitungen getroffen sind, wird lediglich gewartet, bis der Patient selbstständig eingeschlafen ist. In schwierigen Fällen hilft ein Anästhesist mit warmer Milch und Schlafliedern nach. Sobald der Patient auf Fragen wie \"Hallo? Schlafen Sie schon?\" nicht mehr reagiert, kann er aufgeschnitten werden. Operationen am schlafenden Patienten müssen möglichst leise durchgeführt werden. Anweisungen an das medizinische Personal (\"Skalpell\", \"Tupfer\", \"Zigarettenpause\") haben nur noch in Flüsterlautstärke zu erfolgen. Außerdem ist stets dafür zu sorgen, dass das Licht im Operationssaal auf ein akzeptables Maß gedimmt ist. Lediglich bei Not-OPs sollen nach wie vor herkömmliche Sedativa zum Einsatz kommen, weil schwerverletzte Unfallopfer in der Regel aufgrund ihrer Schmerzen nur mühsam in den Schlaf finden. fed, dan, ssi; Fotos: Shutterstock; Hinweis: Erstmals erschienen am 13.11.15 Artikel teilen:'"}, "time": 1742562086.4868195}