{"duration": 0.08356142044067383, "input_args": {"text": "'Donald Trump’s   immigration reform is getting strong majority support from the public, despite the left’s portrayal of the policy as hateful and incompetent, and despite Democratic voters’ determination to obstruct the new president. [Reuters commissioned the poll and then tried to hide the resulting good news for Trump under a misleading headline, “Exclusive: Only a third of Americans think Trump’s travel ban will make them more safe. ”  But the most direct question in the poll showed a   advantage for Trump’s policy, of 48 percent support to 41 percent opposition.  However, that      “blocking refugees and banning people” question is an unreliable guide because most Americans want to help both their fellow Americans and foreign strangers. Also, Americans’ generous attitude ensures that they are often reluctant to display favoritism to their fellow nationals or opposition to foreign migrants, so pollsters often use indirect questions to tease out their hidden views. One indirect question used by Reuters’ pollster asked if the United States should “limit the number of refugees allowed into the country. ” That question scored 66 percent support to 26 percent opposition, showing overwhelming yet hidden support for Trump’s new policy of welcoming a limited inflow of refugees while excluding hostile migrants.  Better still for Trump, the “strong” support for his   policy was three times as large as the “strong” opposition, 32 percent to 10 percent, and the GOP voters’ response was very similar to the response from   independents. Trump’s policy has ignited a debate on refugee inflows from Muslim majority countries. But the core part of Trump’s policy is a shift towards rejection of   migrants whose culture and ideas are hostile to Americans’ traditions of personal independence and small government. Here is the critical passage from Trump’s   immigration policy: In order to protect Americans, the United States must ensure that those admitted to this country do not bear hostile attitudes toward it and its founding principles. The United States cannot, and should not, admit those who do not support the Constitution, or those who would place violent ideologies over American law. In addition, the United States should not admit those who engage in acts of bigotry or hatred (including “honor” killings, other forms of violence against women, or the persecution of those who practice religions different from their own) or those who would oppress Americans of any race, gender, or sexual orientation. The American public’s contradictory emotions slide in various directions, depending on minor changes to questions. For example, when asked by Reuters’ pollster if the U. S. should “open our borders to refugees of foreign conflicts,” the percentage of respondents strongly supporting an apparently unlimited number of refugees jumped up to 19 percent, almost double the 10 percent in the prior “limit the number of refugees” question.  That question and answer suggests that Americans do not recognize the “open borders” term as a     for mass migration by 100 million people from Africa, Arabia and Asia. The new poll was conducted by Ipsos polling, from Jan. 30 to Jan. 31, on behalf Thomson Reuters. It included roughly 1, 201 adults, with 453 declared Democrats, 478 declared Republicans, and 149 declared independents. Many polls show that the public wants the federal government to cap or shrink immigration. For example, a September poll by Ipsos showed that only 12 percent of respondents strongly opposed plans to “change the legal immigration system to limit legal immigration. ” Four times as many, or 57 percent, back reductions in legal immigration, while 13 percent did not take a position. In 2016, under policies set by President Barack Obama, roughly one new immigrant or foreign   joined the U. S. workforce for every two Americans who entered the workforce.   Follow Neil Munro on Twitter @NeilMunroDC or email the author at NMunro@Breitbart. com'"}, "time": 1742561908.225286}