{"duration": 0.0995631217956543, "input_args": {"text": "'Long dark highways and thin white lines fire roads and Interstates the skeleton frames of   Chevrolets barefoot girls sitting on the hoods of Dodges pink Cadillacs   power drives men who go out for a ride and never come back. Bruce Springsteen’s song lyrics have injected more drama and mystery into the myths of the American road than any figure since Jack Kerouac. He knows this, of course. So it’s one of the running jokes in his big, loose, rangy and intensely satisfying new memoir, “Born to Run” (what else was he going to call it?) that he didn’t begin to drive until he was well into his 20s  —   around the time he landed simultaneously on the covers of Time and Newsweek. His brooding and violent father had been too impatient to teach him and, anyway, he couldn’t afford a car. When Mr. Springsteen was forced to sneak behind the wheel, licenseless, to handle some of the driving on his earliest tours, his ineptitude terrified his band members. He did not exactly, when young and virile, ride through mansions of glory on suicide machines. He mostly stuck out his thumb. He’d been born to hitch. “Every sort of rube, redneck, responsible citizen and   the Jersey Shore had to offer, I rode with ’em,” he writes in “Born to Run. ” These rides matter because Mr. Springsteen’s songs, like the   poems of Philip Levine, are intensely peopled. Wild Billy and Crazy Janey, Johnny 99, Mary from “Thunder Road,” Wayne from “Darlington County,” Jimmy the Saint and Bobby Jean had to come from somewhere. This memoir suggests Mr. Springsteen met many of them while cackling over there in the shotgun seat. The headline news in “Born to Run,” to judge by the early news media tweets, is that Mr. Springsteen, who turns 67 on Friday, has suffered periodically from serious depression. I will admit that this information shook me. If Bruce Springsteen has to resort to Klonopin, what hope is there for anyone? But these sections are not the reason to come to “Born to Run. ” The book is like one of Mr. Springsteen’s shows  —   long, ecstatic, exhausting, filled with peaks and valleys. It’s part séance and part keg party, and then the house lights come up and you realize that, A) you look ridiculous dancing to “Twist and Shout” and, B) you will be driving home in a minivan and not a Camaro. His writing voice is much like his speaking voice there’s a big, raspy laugh on at least every other page. There’s some raunch here. This book has not been utterly sanitized for anyone’s protection, and many of the best lines won’t be printed in this newspaper. Most important, “Born to Run” is, like his finest songs, closely observed from end to end. His story is intimate and personal, but he has an interest in other people and a gift for sizing them up. Here’s just one example, chosen nearly at random. When Mr. Springsteen meets a future girlfriend on the boardwalk in Asbury Park, N. J. (one of innumerable girlfriends on display here) he delivers this electric introduction: “She was Italian, funny, a beatific tomboy, with just the hint of a lazy eye, and wore a pair of glasses that made me think of the wonders of the library. ” Well, hello, you think. Much of the writing in “Born to Run” is this fresh  —   the sound of a writer who could have phoned his book in but did not. There are dollops of pretension and   in “Born to Run. ” Springsteen wouldn’t be Springsteen without homilies, a few of them leaden, about fathers and sons and love and work and community. But this book mostly gets away clean, leaving behind the scent of lightly scorched rubber. Mr. Springsteen’s father was a frequently unemployed bus driver, among other   jobs his mother a legal secretary. They were fairly poor. In their houses  —     more often  —   there was generally no telephone and little heat. Meals were cooked on a coal stove. “Born to Run” is potent on the subject of social class. In Mr. Springsteen’s part of New Jersey it was the “ ” (preppies) versus the greasers, and there was no doubt which side of that line he was on. At some of his early shows, guys in chinos spat on him. “I could still feel the shadow of that spit that hit me long ago when I moved to Rumson in 1983, 16 years later,” he writes. He’d found fame and bought a decent place. Yet: “At 33 years old, I still had to take a big gulp of air before walking through the door of my new home. ” He suggests there’s a freight of psychic payback in “Darkness on the Edge of Town,” his most fully realized album. “For my parents’ troubled lives I was determined to be the enlightened, compassionate voice of reason and revenge. ” Mr. Springsteen got his first guitar, a rental, after seeing Elvis on “The Ed Sullivan Show. ” He had a serious work ethic, and went on to play in a string of   bands with names like Child and Earth and Steel Mill. When his   first record, “Greetings From Asbury Park, N. J.,” appeared in 1973, he was lumped with the   New Dylans, folk singers like Loudon Wainwright III and John Prine. But there was a crucial difference. Unlike those performers, Mr. Springsteen onstage, thanks to his long   apprenticeship, could blow audiences backward. Mr. Springsteen writes that he’s never thought much of his singing voice. As good a guitar player as he is, others were better. It was his songs, he realized early, that would have to put him over the top. If this book has one curious blind spot, it’s that we never quite understand how those words came into being. He studied the songwriting of people like Mr. Dylan, Donovan and Tim Buckley, he writes. But so did many others. If his early reading was an influence, he doesn’t say. The words were apparently just there, available, on tap. And they stayed there, even when his lyrics became pared down. Songs like “The River” and “Stolen Car” are as evocative in their details as are Raymond Carver’s best short stories. “Born to Run” takes us, album by album, through his career. These chapters sometimes feel clipped and compressed, as if he’s wedged the data in his heart onto a thumb drive. The book takes us through his many stabs at romance, which tended to end badly. (He once gave his father the crabs after they’d shared a toilet seat.) He details the failure of his first marriage, to the actress Julianne Phillips, and the success of his second, to Patti Scialfa, whom he describes, in a childhood photo, as “a   Raggedy Ann of a little girl. ” He raised his three children without   mementos in the house. “My kids didn’t know ‘Badlands’ from matzo ball soup,” he writes. “When I was approached on the street for autographs, I’d explain to them that in my job I was Barney (the   purple dinosaur) for adults. ” His eldest son says, in shock, “Dad, that guy has you tattooed on his arm. ” Mr. Springsteen’s work ethic has never abandoned him, or he it. “I’m glad I’ve been handsomely paid for my efforts,” he writes, “but I truly would have done it for free. ”'"}, "time": 1742628360.1938374}