{"duration": 0.05358576774597168, "input_args": {"text": "'Montag, 7. November 2016 Türkei: Kritischer Journalist interviewt Oppositionspolitiker in gemeinsamer Gefängniszelle Ankara (dpo) - Es ist ein starkes Stück Journalismus und zeigt, dass in der Türkei trotz aller Buhrufe aus dem Ausland immer noch exzellente Pressearbeit möglich ist: Ein Journalist der regierungskritischen Zeitung Cumhuriyet hat über Tage hinweg einen wichtigen Oppositionspolitiker interviewt, mit dem er sich eine Gefängniszelle teilt. In dem daraus entstandenen preisverdächtigen Politiker-Porträt, das Cumhuriyet-Redakteur Aydiner Korkut mit einem Stück bunter Seife auf einem Fladenbrot-Packpapier verfasste, finden sich mehrere aufschlussreiche Aussagen des HDP-Abgeordneten Erdal Ozbilgin zur Presse- und Meinungsfreiheit sowie zur aktuellen Menschenrechtslage in der Türkei. \"Ich freue mich, dass ich Herrn Ozbilgin endlich für ein ausführliches Gespräch gewinnen konnte\", heißt es in einem Statement Korkuts, das dessen Anwalt bei seinem bisher einzigem Besuch aus dem Gefängnis schmuggelte. \"Vor ein paar Jahren hatte er eine Anfrage meinerseits noch aus Zeitgründen abgelehnt.\" Dass dieses Interview nun doch zustande kam, sei daher allein Erdogans Verdienst. \"In meiner gesamten Journalistenlaufbahn war es mir noch nie möglich, so viel Zeit für einen Artikel aufzubringen und so ins Detail zu gehen\", so Korkut weiter. \"Ich bin meinem Interviewpartner seit Wochen nicht von der Seite gewichen und das merkt man auch.\" Einzig Fragen zu seinem Privatleben habe der Politiker abgelehnt, weil er keine aktuellen Informationen über seine Familie habe. Noch ist nicht klar, in welcher Publikation das Interview erscheinen soll. \"Mein Mandant erwägt derzeit, das Interview unter einem einschlägig bekannten Stein im Gefängnishof zu veröffentlichen\", teilt Korkuts Anwalt mit. ssi, dan; Foto [M]: Shutterstock Artikel teilen:'"}, "time": 1742561771.2377894}