{"duration": 0.09979104995727539, "input_args": {"text": "'Forrest Gump was right on! By Philip A Farruggio Posted on November 3, 2016 by Philip A Farruggio \\nIf one remembers the 1994 film Forrest Gump, one should recall his famous quote: Stupid is as stupid does. Well, he must have been clairvoyant as to our Amerikan public, as least those of us who vote. Factoring out we who refuse to support this Two Party con job, we are left with the overwhelming numbers who will ‘follow the herd’ and vote for either of the two scoundrels running for president. \\nThe Trump supporters are made up of millions of angry white males, with a smithering of angry white females to join them. Many of these folks, and this writer sees them throughout my town of 60,000, live in substandard housing (many in mobile home parks ) and drive older vehicles. Yet , they are aroused and volunteering for a spoiled rich guy who never had to worry about his housing or any living expenses. They are standing on street corners holding signs for a megalomaniac billionaire who only played by the rules of the corporate empire and never the needs of working stiffs. They are so angry at the so-called system that they support a man who has represented it his entire adult life. Sadly, these angry white folks buy into Trump’s populist rhetoric, caring not for the fact that he supports what Eisenhower warned us of: The Military Industrial Complex, a.k.a. empire! Trump will spend more and more of their working stiff hard earned tax money on the military, surpassing even what the Bush cabal and Obama ‘hope and change’ phonies have spent: over 50% of federal tax revenues!! \\nNow we come to the other Stupid is as stupid does electorate: The Ms. Killary supporters. This is a person who has supported her husband’s welfare reform bill, which incidentally, hurt millions of poor people of color. She supported his NATO bombing campaigns in what was once Yugoslavia, which helped to nurture the very fanatical Islamic jihadists that were the precursor to Al-Qaeda and ISIL. Ms. Killary supported NAFTA and GATT and WTO (Google them for references to trade deals that destroyed American jobs), which is one of the things that the idiot Trump rightfully is against. During her days as secretary of state for the stooge Obama, Ms. Killary actually pushed him to sign onto the NATO carpet bombing of Libya, taking out Gaddafi (remember her famous ‘We came, we saw he died’ laughter after they tortured Gaddafi by sticking a bayonet up his rectum and then killing him? ). She then supported the coup that took out the socialist and truly populist president of Honduras, and the coup that did the same for the president of the Ukraine (who committed the sin of being pro Russia), replacing him with obvious neo fascists (why quiet about that Mr. Netanyahu of Israel? ). Ms. Killary publicly states, with compunction, that the war criminal Henry Kissinger ‘is a friend and I relied on his counsel while I was secretary of state.’. This is the war criminal that so many working stiffs of all colors will be supporting November 8, who, by the way, will continue her New Cold War with Russia rhetoric into the White House and also, like Trump, sally up to the Military Industrial Complex, a.k.a. empire. \\nSo, there you have it. The circus has truly come to town . . . but who are the clowns? Are they the ones who tell me all the time that my vote for Jill Stein of the Green Party or my conservative friend’s vote for the Libertarian Party’s Johnson are ‘wasted votes’? Is that what they call pragmatism, voting for the lesser of two evils or voting not for someone, rather voting against someone else? To this writer a pragmatist is the guy facing the firing squad who asks for a blindfold. Either way, he’s gonna be dead!! \\nPhilip A Farruggio is son and grandson of Brooklyn, NY, longshoremen. A graduate of Brooklyn College (class of ’74 with a BA in Speech & Theater), he is a freelance columnist posted on World News Trust, Nation of Change Blog, Op Ed News,TheSleuthJournal.com, Intrepid Report, Information Clearing House, Dandelion Salad, Activist Post, Dissident Voice, Counterpunch and many other sites worldwide. Philip works as an environmental products sales rep and has been a street corner protest activist leader and Green Party member since 2000. In 2010 he became a local spokesperson for the 25% Solution Movement to Save Our Cities by cutting military spending 25%. Philip can be reached at .'"}, "time": 1742562183.5046082}