{"duration": 0.04490995407104492, "input_args": {"text": "'During his confirmation hearing on Thursday, Treasury Secretary nominee Steven Mnuchin said the unemployment rate reported by the Bureau of Labor Statistics does not capture the reality of the conditions facing American workers. [Mnuchin’s   comment was “The unemployment rate is not real,” but he doesn’t seem to have been questioning the validity of the statistics produced by BLS.   U. S. News and World Report, for example, swiftly accused Mnuchin of repeating a “claim that has rankled economists” about how “government statistics have been politicized and aren’t accurate,” but that’s not what Mnuchin said. Rather, he made the case to Senator Maria Cantwell ( ) that the official unemployment statistics suggest the job market has healed to a degree most actual workers and   would disagree with, because there’s so much happening that isn’t captured by that narrow statistic. There was a bit of ideological jousting in the exchange, as Cantwell was basically trying to push Mnuchin into saying his primary focus should be preventing another “major implosion” in the financial markets, while he galloped in the opposite direction and talked about   Donald Trump’s commitment to the forgotten middle American.  Democrats want the 2008 financial crisis to be seen as an impossible,   challenge President Obama was still coping with on his last day in office. Mnuchin turned that around by talking about how the American workforce has suffered under Obama’s policies. “Let me just tell you, from having traveled with the   for the last year, I absolutely understand why he got elected,” Mnuchin said. “And that is because, as you point out, the average American worker has gone nowhere. ” “The unemployment rate is not real,” Mnuchin continued. “The average American worker has gone nowhere. And the   is committed  —   as am I, as his economic adviser  —   to work for the American people and grow the American economy, so that the average American worker does better. ” “That’s why I’ve been willing to sell all my investments, okay?” he said. “I’ve been willing to give up my businesses. My desire is to work for the American people, to create a better economy. And I understand that. I’ve traveled for the last year. I’ve seen this, and the   understands that very clearly. ” The Hill notes that   Trump himself has criticized the unemployment rate as “phony numbers” and “totally fiction. ” He’s not alone in that critique, especially in questioning how only one of the many numbers compiled by BLS gets media attention (at least, under Democrat presidents) and it doesn’t count people who have exited the workforce entirely. The Wall Street Journal’s MarketWatch noticed Trump transition team member Anthony Scaramucci stepping forward on Twitter to back Mnuchin’s play: He’s right. Wage growth stagnant, labor force participation at   low,   unemployment rate high for this stage in economic cycle https:  .   —   Anthony Scaramucci (@Scaramucci) January 19, 2017,  The numbers are accurate, but they have been cherry picked and spun dry. Headline   unemployment rate is basically a useless statistic https:  .   —   Anthony Scaramucci (@Scaramucci) January 19, 2017, '"}, "time": 1742564349.9519753}