{"duration": 0.10606503486633301, "input_args": {"text": "'Leave a reply Charles Hugh Smith – Correspondent Bart D. (Australia) captured the entire global economy in three words: The Landfill Economy. Stuff is manufactured, energy is consumed shipping it somewhere, consumers buy it and shortly thereafter it ends up as garbage in the landfill. This is of course the definition of “economic growth”: waste, inefficiency, environmental destruction–none of these matter. Only two things matter: maximize “growth” by any means necessary, and maximize profits by any means necessary. The Landfill Economy now encompasses the entire planet. The swirling gyre of plastic trash the size of Texas between Hawaii and California: it’s just one modest example of the planetary trash dump that “growth” and profit generate as byproducts/blowback. The planet’s oceans are one giant trash dump. Everything from plastic water bottles to abandoned fishing nets to radiation to containers that fell off ships is floating around even the most distant corners of the seas. Seabirds nesting in remote islands die of starvation as their guts fill with plastic bits of “permanent growth.” Globalization has turned the planet’s land masses and rivers into trash dumps.Want to make a quick profit along a tropical sea coast? Dig some big holes near the coast, dump in baby prawns, food and chemicals to suppress algae blooms and diseases and then harvest the prawns to ship to the insatiable markets of the developed world. Once the prawn farms are poisoned wastelands, move on and despoil another coastline elsewhere. Globalization has greased the slippery slope from factory to landfill by enabling the global distribution of defective parts. Whether they are pirated, designed to fail or just the result of slipshod quality control, the flood of defective parts guarantee that the entire assembly they are installed in–stoves, vacuum cleaners, transmissions, electronics, you name it–will soon fail and be shipped directly to the landfill, as repairing stuff is far costlier than buying a new replacement. QE/ZIRP Is Crushing the Global Supply Chain, Product Quality and Profits (October 17, 2016) The Keynesian Cargo Cults that rule global economics love The Landfill Economy because it means more “growth”. Never mind the poisoned seas, rivers and land, or the immense waste of energy, commodities and labor that result from the global manufacture and distribution of shoddy products: if it adds to “growth,” it’s all good in the warped view of the Keynesian Cargo Cults. We got your “growth” right here. People are also tossed on the trash heap with careless abandon. The health of workers is a cost that reduces profits, so it’s ignored unless it can be turned into a profit center via state funding for managing preventable diseases, i.e. sickcare. A worker sickened by industrial waste or lifestyle illnesses who becomes a profit center is a wonderful source of “growth” and profits. A worker who can’t generate a corporation or state a profit is dumped on the trash heap as a matter of routine. A worker who can’t generate somebody a profit or “growth” by taking on more debt to spend spend spend is worthless. If a robot or software can do the same work, then it is self-destructive for an enterprise to pay a human worker: if profits fall, Wall Street will crucify the enterprise and competitors will eat it alive. This “maximizing growth and profits is the highest good” mode of production is insane. It doesn’t have to rule the world. As I outline in my book A Radically Beneficial World: Automation, Technology & Creating Jobs for All , other more efficient, sustainable and humane modes of production are within reach if we escape from the global grip of the destructive “growth by any means” cult. Charles Smith is a Contributing Writer for Shift Frequency SF Source Of Two Minds Nov. 2016 Share this:'"}, "time": 1742562200.7667894}