{"duration": 0.023972749710083008, "input_args": {"text": "'FBI Director James Comey highlighted his agency’s   female genital mutilation arrests in his testimony to the Senate Judiciary Committee Wednesday. [“This is among the most important work we do, protecting children especially,” Comey said in his prepared remarks.  Comey described the shocking case of Doctors Jumana Nagarwala and Fakhruddin Attar, which made headlines around the world last month as the very first prosecution for FGM in the United States: For the first time since Congress passed a statute making it a crime in the United States to engage in female genital mutilation, to mutilate little girls  —   it’s been a felony in the United States since 1996  —   we made the first case, last week, against two doctors in Michigan for doing this terrifying thing to young girls all across the country. FGM, a practice most popular among certain parts of the Muslim world, had not been   before recently in the United States. The practice involves cutting a   girl’s genitals in a ritual designed to make her “clean” before her eventual marriage. There are differing forms of mutilation, some more extreme than others, but all involve the removal of varying amounts of a young girl’s clitoris, labia majoria, and labia minora. The most extreme form of FGM is called “infibulation,” in which virtually all external genitalia is removed and the wound is sewn together, leaving only a single tiny hole from which to urinate and menstruate until the girl is married. It is unclear how prevalent FGM is in the United States, but Comey’s FBI believes Nagarwala and Attar’s FGM operation has been operating for over a decade and has mutilated girls from across the American Midwest. Both the doctors and their named victims are part of the Dawoodi Bohra Muslim sect, named only as a “particular religious and cultural community” in the complaints. Dawoodi Bohra is based in India and boasts over a million members across the world, with increasing numbers in the United States. The sect’s leadership has made clear time and again that FGM is absolutely necessary as an “act of religious purity” and “a religious obligation for all women and girls. ” Director Comey closed his remarks by praising his agents who made these arrests possible. “It was done by great work that you don’t hear about a whole lot all across the country by the FBI,” he told the committee.'"}, "time": 1742628438.7224782}