{"duration": 3.074305772781372, "input_args": {"text": "'How Many People Will Have To Migrate Out Of California When All The Water Disappears?   April 2nd, 2015 \\nThe drought in California is getting a lot worse. As you read this, snowpack levels in the Sierra Nevada mountains are the lowest that have ever been recorded . That means that there won’t be much water for California farmers and California cities once again this year. To make up the difference in recent years, water has been pumped out of the ground like crazy. In fact, California has been losing more than 12 million acre-feet of groundwater a year since 2011, and wells all over the state are going dry. Once the groundwater is all gone, what are people going to do? 100 years ago, the population of the state of California was 3 million, and during the 20th century we built lots of beautiful new cities in an area that was previously a desert. Scientists tell us that the 20th century was the wettest century in 1000 years for that area of the country, but now weather patterns are reverting back to normal. Today, the state of California is turning back into a desert but it now has a population of 38 million people. This is not sustainable in the long-term. So when the water runs out, where are they going to go? \\nI have written quite a few articles about the horrific drought in California, but conditions just continue to get even worse. According to NPR, snowpack levels in the Sierra Nevada mountains are “just 6 percent of the long-term average” … \\nThe water outlook in drought-racked California just got a lot worse: Snowpack levels across the entire Sierra Nevada are now the lowest in recorded history — just 6 percent of the long-term average. That shatters the previous low record on this date of 25 percent, set in 1977 and again last year. \\nCalifornia farmers rely on that water. Last year, farmers had to let hundreds of thousands of acres lie fallow because of the scarcity of water, and it is being projected that this year will be even worse … \\nMore than 400,000 acres of farmland were fallowed last year because of scarce water. Credible sources have estimated that figure could double this year. \\nFortunately, many farmers have been able to rely on groundwater in recent years, but now wells are running dry all over the state. Here is more from NPR … \\nLast year was already a tough year at La Jolla Farming in Delano, Calif. Or as farm manager Jerry Schlitz puts it, “Last year was damn near a disaster.” \\nLa Jolla is a vineyard, a thousand-or-so acres of neat lines of grapevines in the southern end of the San Joaquin Valley. It depends on water from two sources: the federal Central Valley Project and wells. \\nUntil last year, Schlitz says, wells were used to supplement the federal water. \\n“Now, we have nothing but wells. Nothing. There’s no water other than what’s coming out of the ground,” he says. \\nLast year, one of those wells at La Jolla dried up. The farm lost 160 acres — about a million dollars’ worth of produce, plus the wasted labor and other resources. \\nAre you starting to understand the scope of the problem? \\nDespite all of the wonderful technology that we have developed, we are still at the mercy of the weather. \\nAnd if this drought continues to drag on, it is absolutely going to cripple a state that contains more than 10 percent of the total U.S. population. \\nIn an attempt to fight the water shortage, Governor Jerry Brown has instituted statewide water restrictions for the first time ever … \\nCalifornia announced sweeping statewide water restrictions for the first time in history Wednesday in order to combat the region’s devastating drought, the worst since records began. \\nGovernor Jerry Brown issued the declaration at a press conference in a parched, brown slope of the Sierra Nevada mountains that would normally be covered by deep snow. \\n“Today, we are standing on dry grass where there should be five feet (1.5 meters) of snow,” Brown said. “This historic drought demands unprecedented action.” \\nSo what will these restrictions include? \\nThe following is a summary from Natural News … \\n• A ban on non-drip irrigation systems for all new homes. \\n• A requirement for golf courses and cemeteries to “reduce water consumption.” (And yet, the very idea of green golf courses in the middle of a California desert is insane to begin with…) \\n• Force farmers to report more details on their water usage so that the state government can figure out where all the water is going (and where to restrict it even further). \\n• Outlawing the watering of grass on public street medians. \\n• Discussions are also under way to throw “water wasters” in jail for up to 30 days, according to another LA Times article . The most likely source of intel for incarcerating water wasters will be neighborhood snitches who monitor water usage of nearby homes and call the authorities if they see too much water being used. \\nIf the drought does not go on for much longer, these restrictions may be enough. \\nBut what if it continues to intensify? \\nThe following graphic shows the U.S. Drought Monitor map for the state of California for each of the last five years in late March… \\nIt doesn’t take a genius to see the trend. \\nAnd scientists tell us that this might just be the beginning. There have been megadroughts in that area of the country that have lasted more than 100 years in the past, and there are fears that another megadrought may have begun. The following comes from National Geographic … \\nCalifornia is experiencing its worst drought since record-keeping began in the mid 19th century, and scientists say this may be just the beginning. B. Lynn Ingram , a paleoclimatologist at the University of California at Berkeley, thinks that California needs to brace itself for a megadrought—one that could last for 200 years or more. \\nAs a paleoclimatologist, Ingram takes the long view, examining tree rings and microorganisms in ocean sediment to identify temperatures and dry periods of the past millennium. Her work suggests that droughts are nothing new to California. \\n“During the medieval period, there was over a century of drought in the Southwest and California. The past repeats itself,” says Ingram, who is co-author of The West Without Water: What Past Floods, Droughts, and Other Climate Clues Tell Us About Tomorrow . Indeed, Ingram believes the 20th century may have been a wet anomaly. \\nIf this is a megadrought, it is just a matter of time until massive migration will become necessary. \\nIn fact, one UN official is already talking about it … \\nIf the state continues on this path, there may have to be thoughts about moving people out, said Lynn Wilson, academic chair at Kaplan University and who serves on the climate change delegation in the United Nations. \\n“Civilizations in the past have had to migrate out of areas of drought,” Wilson said. “We may have to migrate people out of California.” \\nWilson added that before that would happen, every option such as importing water to the state would likely occur— but “migration can’t be taken off the table.” \\nSo how many people will ultimately have to leave if this drought continues for many years? \\n5 million? \\nAnd where will they go? \\nPlease feel free to share what you think by posting a comment below… If Anyone Doubts That We Are In A Stock Market Bubble, Show Them This Article » Eric Rasbold \\nIt is as bad as they say. I am lucky enough to live in the forested Eden of the Sierra Nevada mountain range, just a bit south west of Tahoe. We have water. We are one of four purveyors of water in El Dorado County. We are okay as far as water goes, but the rest of the state is in great danger. We are mostly worried about fire. Last year, we had two major fires: The Sand Fire almost took my home from the south, the King Fire (the largest ever) almost burnt us down from the north. I think dead center is next. Rough winds and crappy seas doth follow. \\nGood Luck and May Your Dow Never Jones. David Almanza \\nAll I see day after day and night after night here in Kansas is a sky full of toxic spray that resemble cobwebs . I guess the thing has to eat itself and lay waste to nature in the process . No one can own the Earth and Sky ,,,have faith in Nature within Us and Nature outside of Us and protect it as much as we can. It is all We have . Erik Bergum \\nThe state of California desperately needs the rain of course MIchael in Chicago \\nThe entire state needs rain just about everyday for several years to start to catch up. Needs an insane amount of snow too. GSOB \\nPerhaps the Lord is telling Californians to get out before His earthquake swallows them up? He is a merciful God. alan \\nHum, doesn’t sound very nice to me. H8Religion \\nHe is a merciful God Like he has mercy on his Child Raping Priests!!!! JI \\nYes, homosexuals/pedophiles infiltrated the church and the church failed to excommunicate them. For that, the church is indeed being punishes. If you are a victim, and you sound like one, seek counseling and help. MIchael in Chicago \\nMuch like the US economy everyone seems to have this false hope things will eventually get better. Water restrictions and importing more water are not all that different from QE. Seems like everything is an illusion these days. Bill \\nIn the old days if you wanted to seek your fortune you would hear,”go West young man, go West.” Now days those who live in the West are told ” go East if you want to survive.” \\nNo matter where Californians go it will put tremendous pressure on the infrastructure of other areas. Then add the demand on a decreasing food supply. The hand that fed us may not be so welcome when it looks to be fed. John \\nNot to mention that many of those Californians are going to demand government assistance like they’ve had in CA wherever they settle. John \\nInteresting. The Sooners migrated there in mass from Oklahoma in the 1930’s. Now their great grandchildren may migrate the other way. Also, it wouldn’t be the first time a civilization collapsed in that area of the country. Take the Anasazi Indian civilization for example. XSANDIEGOCA \\nExcellent point. SunnyFlaSnotress \\nYou’re comparing a rustic civilization to a far more progressive civilization. Migration is the probability. Only massive destruction in the form of land upheaval would cause collapse. John \\nThe Anasazi also likely moved elsewhere when their society could no longer be supported by the local environment/climate. Anyway, they apparently abandoned their dwellings in northern AZ for unknown reasons. Severe drought is one possibility. The Clovis people were an even earlier people group in the SW USA whose society appeared to vanish too. Mexifornia Taxpayer \\nThe Grapes of Wrath (in reverse) Marine68 \\nThe UNs Agenda 21 requires the concentration of Population into large urban centers. They hope that the people on top of each will kill themselves off by disease, addiction, and murder. Shutting off access to open lands and suburbs is the Master plan to do this. pmagn \\nbut what about Agenda 99… the control of all by the 1%? Jessy S. \\nBut this isn’t Agenda 21 doing this. If we are in for another 100 year mega drought, this will be the work of nature instead of man. Tatiana Covington \\nDesalination and fusion power. Graphene sieves and waterchips. Use science and engineering. Those are all we have. T. \\nNo. That’s what Got them in the mess they are in. Tatiana Covington \\nYou couldn’t be more wrong. Ray \\nDesal solves the problem for the upper 5-10%. The rich have had water shipped in by truck for years already. No sweat off their backs. Malcolm Reynolds \\nThe rich have had water shipped in by truck for years already What on Earth are you talking about? Ray \\nThese days, tankers can be seen barreling down Montecito’s narrow country roads day and night, ferrying up to 5,000 gallons of H20 to some of the world’s richest and thirstiest folks. \\nFusion power? Right. We’d be better off trying to harness the power of politicians hot air. JB \\nI agree…. cold fusion is the future and it can be done. Rufus T Firefly \\nScientists estimate we are 40-50 years away from cold fusion. And you can be sure the enviro-whackos will oppose it when it happens. They fear mankind having energy and want to eliminate people, except themselves Priszilla \\nThen let’s just wait 50 years and everything will be fine. John Higson \\nNot cold fusion,hot fusion.And it would be a nightmare,because with free energy the planet is flocked.100 degrees at the surface in 200 years,that’s the way economic growth takes us.Luckily Fusion will never happen,too many technical impossibilities. tone \\nDan Zazlavsy’s Energy Towers was proven to be the answer by a team of international scientist at least a decade ago and yet have not been brought to fruition! GSOB \\nMan in the 21st Century USA \\nMoments of blank misgiving in which he finds that the civilization of which he is a part, leaves a dusty taste in his mouth. \\nHe may be very busy with many things but he discovers one day that he’s no longer sure that they are worth doing. He has been much preoccupied but he’s no longer sure he knows why. He has become involved in an elaborate routine of pleasures and they do not seem to amuse him very much. \\nHe finds it hard to believe that doing any one thing is better than any other thing, or in fact is better than doing nothing at all. It occurs to him that it is a great deal of trouble to live and that even in the best of lives, the thrills are few and far between. \\nHe begins more or less to seek satisfaction because he is no longer satisfied and all the while he realizes that the pursuit of happiness was always a most unhappy quest. T. \\nIf this drought continues for many years – Then perhaps 20 to 25 million people or more would eventually have to leave California. Don’t forget all the Radiation which is hitting the Left coast from Fukushima and has already started decimating the marine life in the Pacific. Where would They go? Mostly East. Go East young man – Go East. Tom \\nInstead of “Oakies”, we will have “Calies” alan \\nCommies. Philip Botwinick \\nIt’s a game of musical chairs. Who is going to get stuck in homes that can never be sold. Priszilla \\nGo North. Global Warming will melt the Arctic. Philip Botwinick \\nAh Priszilla and I had such high hopes for you. \\nGo north and do what. It is clear you’ve not been practicing gardening, or permaculture the last decade. The soil up north can’t and will never have the time to evolve to the point you could plant the crops and food necessary to live as we have over the last 10,000 years. \\nPeople think they are going to plant Banana trees in the Arctic. Ain’t gonna happen. Priszilla \\nYou need compost. My dad used manure in the garden. We didn’t grow bananas. But peaches tomatoes, apples, pears, beans, cucumber and other veggies. Priszilla \\nThat go north was more sarcasm to those who think global warming is good. I prefer planting trees. For shade, wind break, fruits, flowers. Deciduous trees that shed their leaves and give those nutrients to the soil. GSOB \\nMany people would have no choice but to endure and ration to the max. A new show, urban homesteading pending I’m sure. Sad thing, only a certain amount, if any, of the rain God sends to the just and the unjust is ‘authorized’ by the usurper for you collect of the rain God sends. \\nSuch a display of impudent audacity, but they report of no other way. In subtle rebellion, our news casters and meteorologists have the platform to conform our thinking to suggest without a doubt, that ‘Mother Nature’ needs to send us more moisture. \\nOn the other hand, TBTB increase cost no one really wants but because of getting boxed in they have to, so they say. Someone here suggested that the usurper will tax the air next. Someone else suggested that it will get so bad that the great usurper will usurp everything with such attractive and wonderful propositions, you’d wouldn’t want to resist, so add your name to the measures provided by our bureaucrat workers that use the MSM to appeal to the collective that together “We are the World”. Take the autonomous stand with us! \\nThey’ll raise the costs to conserve what little there is that remains. Those who can afford the expense of picking up to relocate where water is plentiful are in pursuit of simple happiness. Our welfare ‘state’ is out of control when you can not open your mouth to drink water from the Lord who created all there is. why bother \\nWhere could they afford to go? Most of them are one paycheck from bankruptcy. They are underwater in their loans. Their $800,000 houses will be worthless and abandoned, and they have no savings. There are no jobs for them outside California. They have no manual labor skills and they have kids to feed. They would not last a week outside California before they start stealing food and property of those in other states. Philip Botwinick \\nYou get it. T. \\nI agree. In all honesty there will be No “Go East”. Most will go to their Grave. Jordan Helwig \\nWe need to spend our money domestic problems like these. Not over seas wars that we have no business being involved in. GSOB \\nJesus Christ is God’s wisdom to us, both righteousness, sanctification and redemption. \\nGet a hold of that! That’s like drinking from a fire hose \\nWOW \\nDrink the blood of Jesus and you’ll never be thirsty? \\nIf there is no water you can still drink Californian wine? Ray \\nSan Fran has the most expensive real estate for a reason. Nobody is moving from SF. Nobody there is worried about the earthquake risk or some water shortage. Money buys you lots of water. jaxon64 \\nGood post–you made me remember something…. In the movie “Soylent Green”, everyone remembers that it turns out the wafers were made from corpses, but that movie had several other-almost prophetic now- things that were creepy. One was the euthanasia centers where people who reached older age, even though healthy, would be asked to go to termination centers and be euthanized for the greater good and population control…. Another one, was that things like strawberries, wine, real food and HOT SHOWERS WITH WATER–were still available, but only for the wealthy. Apartments could be rented with all of the amenities ( including house girls who catered to all needs of the wealthy businessmen.) All of those old, apocalypse movies are a little creepy now–Omega Man with the global virus….Planet of The Apes with the transhumanism we are seeing experimented with…….Terminator with all of the advances in robotics and AI thinking machines…..very interesting times we live in. I fear for my grandchildren….. Ferris \\nJaxon64, I think you have just connected the dots. Bingo ! \\nNow those in the inland empire and majorly hosed. Nonanon25 \\nYou mean, Las Vegas? Yup! K \\nFrom what I hear the middle class Californians are already resettling in Texas. I would expect the rich to head for Florida. It will sure hurt the retirees. Such an influx, will drive prices out of sight. Don’t Want ‘Em \\nGood. Keep their libtard ideas out of Tennessee. Paul \\n“The most likely source of intel for incarcerating water wasters will be neighborhood snitches who monitor water usage of nearby homes and call the authorities if they see too much water being used” Glad I don’t live in California. If someone held a grudge against me or did not agree with my political views they could say I was using too much water. Even if I was innocent, it would be very difficult to deal with the authorities. Yawn \\nlate at night water their yard and call on them.toss some high nit fert and ironite. the greenness will be a dead give away.hehehehehehhe evoval \\nWhat the snitches claim has to jive with the meter. pmagn \\nwhere do you live? Chances are your going to have issues with #climate too… John \\nAll they would have to do is go to your house late at night, run a hose from your spigot to a sprinkler in your front yard and turn it on. You’d be in jail before breakfast… Philip Botwinick \\nYeah, because you think, ‘Oh those poor people in CA.” that’s not going to happen to me. \\nReminds me of the saying “they came for the Jews, they came for the Communists, etc., etc.” and then they came for me and there was no one there to stand with me. \\nOh, wait. A rise in temperature from 2 – 16 degree F is looking more likely by 2050. So where are you going? Oh, yeah your are a friend of Richard Branson and have your ticket for that colony on Mars. \\nLOL> Illegal \\nThe water restrictions are almost laughable.It would seem if there is a true emergency then all non essential uses of water would be banned.Throw someone in jail is the police state answer to every problem, How is every other country that is mostly desert surviving? This mess was created by the elites and ruling class in Sacramento and Washington. \\nMy advice to the gental folk of California – leave now and avoid the line-ups at the FEMA camp. alan \\nNorth Korea sounds like a good place for them. Communist utopia, lots of taxes, State telling you how to breath, they’ll be in heaven. libsarescum \\nAnd NK is a gun free zone. Liberals should be in heaven there. Priszilla \\nThey sing the hymn there too every morning, and they have to swear allegiance in every free minute. Philip Botwinick \\nSorry Sean, but those FEMA camps (if they actually come into existence) will be all over the country. \\nIt appears, that most, but especially those still with Internet connections seem unable to fathom that Climate Change is all over the planet. It knows no boundaries. \\nWhere ever those people leaving CA go will not be far behind in looking like Sao Paulo and Detroit in the next few years. \\nDo not. I repeat do not even feed into the illusion that we’ll find free energy, or solar and wind will come along. That’s a Hollywood delusion. If energy were really free than no corporation would be able to lock up the rights to it in a vault. Read “Green Illusions” by Ozzie Zehner. sean carter \\nAgree with everything you said. I live in Alberta and the common mythology is we’ll dig up tarsands forever. Not gonna happen. Once once the cheap energy run out our society will be sliding back towards something resembling the mid-1800’s ranging/farming dominated lifestyles. \\nAnd I’m fine with that. Ray \\n“Look, Israel was a bona fide desert,” argues Hazard, who has been pushing for desalination. “Now they run the whole country on four desal plants.” egore \\nThe really bad part is all those liberals gushing out of the state into the rest of the US like diarrhea. Buckle Up! Ted Kennedy \\nHopefully they’ll migrate into Mexico. Will Mexico accept our liberal refugees? Richard O. Mann \\nMexico does not want them. They are too busy trying to export their population to the US. Mexifornia Taxpayer \\nHow about they learn some birth control! SunnyFlaSnotress \\nYou’re right. If we keep a strong dollar and water prices are elevated, more companies will migrate south and many of California’s immigrants, which number somewhere around 10 million, will likely follow Mexico’s new prosperity. Priszilla \\nIt’s not just California where there is a problem with water usage. \\nSince 1950, agricultural irrigation has reduced the saturated volume of the Ogallala aquifer by an estimated 9%. Depletion is accelerating, with 2% lost between 2001 and 2009 alone. Once depleted, the aquifer will take over 6,000 years to replenish naturally through rainfall. \\nIn the United States, the biggest users of water from aquifers include agricultural irrigation and oil and coal extraction. \\nThe United States Geological Survey determined the water level in the aquifer has dropped more in Texas than in any other state in the basin. \\nWasting natural resources is an American problem. Ken Swan \\nyeah those inland cities with millions of people using the ground water has nothing to do with it does it? California created this problem (NOT nature) by demanding that 90% of the states water be pumped to LA for use there, so what did they think was going to happen? Priszilla Liberty First \\nJust do not come to Texas. PLEASE! \\nI do not feel very sorry for California, in truth. They have fought desalinization projects like bats out of hell. And converted sea water could make a massive difference in stemming this drought. Environmental concerns, they say. Oh well. Irresponsible people tend to reap negative results. Mike \\nI already applied to three jobs in Texas, haha! Maybe I’ll be your neighbor. Liberty First \\nWell unlike in CA we are friendly to almost anyone down here. Mike \\nDesalinization won’t work anyway. It doesn’t remove 100% of the salt and in a desert region like cal it would evaporate too quickly depositing the trace amounts of salt in the soil rendering it unsuitable. Liberty First \\nOrange County has desal. It works just fine. Don’t Want ’em here \\nI feel sorry for you if you get an influx of those lunatics! Kurt \\nThey can just give the State back to Mexico, let them worry about it. Lol VegasBob \\nTo be fair, about 3/4 of California water usage is for agriculture. Without adequate water, I would look for steep increases in the price of fruits and vegetables and depopulation of agricultural areas. Maybe persistent drought will finally stem some of the mass migration from South of the Border into the US. \\nAs for the leftists, they can stay in the Bay Area. They’re probably not going to be forced out. AntonioOssa \\nCALIFORNIA NEEDS TO PUT A STOP TO AGRICULTURE IMMIDIATELY! Mike \\nPeople and animals need to eat drama queen. nobody \\nIf only we could import food from other places… mar1950 \\nDoes anyone know what % of the economy (GDP) comes from California? I seem to recall that if Cal. were a nation it would be the 6th largest economy in the world. If it did dry up and no one could live there, what would it do to the nation as a whole? \\nI would like to see the governor call the state to pray for rain (and snow in the mountains) but then the Bible declares: “He (man, state, or nation) that turneth away his ear from hearing the law, even his prayer shall be abomination.” (Proverbs 28:9) \\nCalling on God to intervene while the abortion mills are still doing business, we are busy passing gay “marriage” laws, and have a brutal militaristic foreign policy that spreads death and destruction around the world we would only be mocking God and adding abomination on top of abomination. XSANDIEGOCA \\nSome 90% of the winter vegetables consumed in the US comes from California. We are now talking foodstuffs. Costs will skyrocket. Gay Veteran \\ndon’t like “gay marriage”? then don’t marry someone of the same gender GSOB \\nMan proposes, but God disposes. Proverbs 19:21 \\nyet more parroting of bible verses. \\nPolly want another cracker? Malcolm Reynolds \\nJust remind him he thinks the Puritans founded America on burning witches when he gets really irritating. Ron Gilbert \\nThat’s rich. Don’t like someone opposing gay marriage? Then don’t try to force them to accept it as normal behavior. Or, even better, don’t try forcing them to participate in your immoral festivities by having them bake a wedding cake or cater it. Go to a business that supports immorality. Gay Veteran \\nwho knew baking a cake was a religious activity! bet you wish businesses didn’t have to serve them darkies, or them Jews, or Catholics, or Muslims Ron Gilbert \\nLOL! Who knew your rights super ceded the right of someone refusing to participate in your immoral activities? You demanding that people serve you goes back to slavery. Do you think slaves really wanted to serve a master that made them do things against their will? Way to put people back under the thumb of totalitarian rule all so you can have a happy gay wedding. Your immoral behavior does not even begin to compare with blacks being enslaved, one who makes victims of everyone. Gay Veteran \\n“LOL! Who knew your rights super ceded the right of someone refusing to participate in your immoral activities?….” \\nnot that long ago, 1967 in fact, many states had laws banning interracial marriage and your religious bakers could refuse service to those interracial couples. \\n“…You demanding that people serve you goes back to slavery. Do you think slaves really wanted to serve a master that made them do things against their will?….” \\nwho knew bakers worked for free! \\n“…Your immoral behavior does not even begin to compare with blacks being enslaved, one who makes victims of everyone.” \\nyou’re partly right about comparing slavery with the treatment of Gays, although in the past Gays have been beaten and murdered in this country with impunity (just like your good old Jim Crow days). And let’s not forget the slaughter of Gays in the concentration camps by those who also thought they were “exceptional” Ron Gilbert \\nSorry pal… cannot claim the race card here. Not even close to the same thing. Homosexuality is not a race nor is there a gay gene. You are a group of people, and a very small percentage at that, who engage in an immoral activity and spew nothing but hatred and revenge to those that stand against this unGodly activity. Sorry that your “people” were slaughtered by whomever did this to them (not me, did not have anything to do with it so stop blaming everyone for it), but that changes nothing as to what you are doing. \\nGod was quite clear when he said he hates the workers of iniquity. Do you know who those are? They include those that would pervert his words and then push a belief that something he says is wrong is not wrong and that he never said it. \\nAnd one more thing, you should really invest in some history reading. Your attributing of Jim Crow laws to my beliefs is completely uneducated (retarded comes to mind but with your sensitivities to PC, I didn’t say that…). As soon as you can, please look up who endorsed, promoted and pushed for Jim Crow laws and fought against their repeal. Then after that, really check into whether or not the Dixie Crats of the South actually became Republicans (cause that’s where I see this going next – and then after that…. more Leftist talking points with absolutely no substance). Please stop twisting things to support your hatred and stereotypes and I will at least try not to stereotype you. Gay Veteran \\n“…You cannot claim the race card here. Not even close to the same thing. Homosexuality is not a race nor is there a gay gene…..” \\noh yes, that tired argument. You know what else is not a race or involves a gene? Catholics, Baptists, Lutherans, etc. ALL of whom are protected by anti-discrimination laws. \\n“…You are a group of people, and a very small percentage at that, who engage in an immoral activity and spew nothing but hatred and revenge to those that stand against this unGodly activity….” \\nYou know who else is a small percentage? Jews, and they are protected by anti-discrimination laws. \\nAnd immoral? you can go F yourself with a rusty chainsaw because I don’t take lectures on morality from smug self-righteous Pharisees like YOU. \\n“…Sorry that your “people” were slaughtered by whomever did this to them (not me, did not have anything to do with it so stop blaming every heterosexual for it), but that changes nothing as to what you are doing….” \\nWhat we are “doing” is fighting for legal equality. \\n“…God was quite clear when he said he hates the workers of iniquity. Do you know who those are? They include those that would pervert his words and then push a belief that something he says is wrong is not wrong and that he never said it….” \\nh , would that be the same “god” in the Bible who couldn’t flat out condemn slavery? \\n“…And one more thing, you should really invest in some history reading. Your attributing of Jim Crow laws to my beliefs is completely uneducated (retarded comes to mind but with your sensitivities to PC, I didn’t say that…)….” \\nhey Einstein, slavery AND Jim Crow laws were supported by people who used the BIBLE to justify their actions. \\nsorry if that hurts your sensitivities \\n“…As soon as you can, please look up who endorsed, promoted and pushed for Jim Crow laws and fought against their repeal. Then after that, really check into whether or not the Dixie Crats of the South actually became Republicans (cause that’s where I see this going next – and then after that…. more Leftist talking points with absolutely no substance)….” \\nsee above, it was YOU Christians that “endorsed, promoted and pushed for Jim Crow laws” and I love how you historical revisionists try to deny that racist southern democrats became racist southern republicans, like the GOP’s southern strategy never happend \\n“…Please stop twisting things to support your hatred and stereotypes and I will at least try not to stereotype you.” WOW, such projection, such massive hypocracy coming from a “Christian” who supposedly believes in the Golden Rule. now don’t you have a street corner to pray loudly at? Ron Gilbert \\n“And immoral? you can go F yourself with a rusty chainsaw because I don’t take lectures on morality from smug self-righteous Pharisees like YOU.” \\nAnd the hypocrisy continues. It’s wrong for me to dictate morals but not wrong for you to tell me to go… f myself. Also, I don’t pray in public. If you knew anything about God, you would know that those doing so are not praying to him, they are praying for praise from others. \\n“WOW, such projection, such massive hypocracy coming from a “Christian” who supposedly believes in the Golden Rule.” The Golden Rule is applied when you tell someone that they are doing something wrong. It is done so that they can better themselves by stopping their behavior. Kind of like waking your neighbor from a deep sleep while his house burns. Smugness never entered my mind but it sure did show from your tirade. My ending statement is rescinded. I will continue to believe that you are a willing participant in evil. Gay Veteran \\n“And the hypocrisy continues. It’s wrong for me to dictate morals but not wrong for you to tell me to go… f myself….” \\nhey junior, it’s wrong for you to dictate morals for OTHER people, which is precisely why I told you to go F yourself you smug self-righteous theocrat. \\n“…Also, I don’t pray in public. If you knew anything about God, you would know that those doing so are not praying to him, they are praying for praise from others…..” \\nif the shoe fits………… \\n“…The Golden Rule is applied when you tell someone that they are doing something wrong. It is done so that they can better themselves by stopping their behavior. Kind of like waking your neighbor from a deep sleep while his house burns….” \\nbecause YOUR interpretation of the bible is the ONLY valid one, not like there are tons of Christians who disagree with you. \\n“…I will continue to believe that you are a willing participant in evil….” \\nthat is your opinion, and opinions are like a**holes, everyone has one \\n“…Please, by all means, show me where God ever condoned it [slavery]. He allows it just like he allows people to sin without immediate death. He allows us to make our own decisions but when those decisions are against what he tells us to do, they come with consequences….” \\nwow, so all those southern slaveowners weren’t quoting the Bible to justify slavery? see, there’ s that historical revisionism again \\n“…speaking of revisionism…. all Dixie Crats did not become Republicans no matter how much you insist history says they did. That was a revisionism from your buddies in the DNC years ago, so that they could point their crooked little fingers at Conservatives and claim that we are the racists, much like you are doing….” yeah, the democratic party in the south just mysteriously declined after passage of the Civil Rights Act of 1964 and the Voting Rights Act of 1965. btw junior, I detest the democrats as much as the republicans, if fact more so because so many liberals are hypocrites (whereas the republicans actually believe their BS)“…According to every single bit of research done, only a handful of Dixie Crats switched over to the Republican Party while the VAST majority of them stayed in the DNC. Nice try though.” every single bit of reseach, eh? odd you didn’t provide any Ron Gilbert \\nBut you can dictate them to Christians? Gay Veteran \\nhow so? Ron Gilbert \\nReally? You have to ask that after stating that Christians have no right to push their morals on you? Have you ever taken into account that when you tell someone that they have no right to tell you what to do, you are doing exactly what you are protesting? It’s just like saying “Don’t tell me what to do!”. You are telling the other person what to do. Really? And you see nothing hypocritical about that? Of course you don’t. Why would you? You see things through a clouded vision of love right? Gay Veteran \\noh I see, we gays must shut up while smug self-righteous Pharisees like you give us a lecture on “morality”. that’s what wannabe theocrats like you want \\nsorry junior, but we ALL have freedom of speech. You can lecture me all you want and I can tell you to stuff it Ron Gilbert \\nOh I see… we Christians must shut up while the immoral acts of gays are being force upon the population. Sorry gay dude, but freedom of speech does not just apply to you and those that you agree with. Gay Veteran \\nacts of gays being forced upon the population, eh? what, did a gay guy come up and French kiss you? you know, it sounds like you need to move to a country where there are lots of people just like you! try Saudi Arabia Ron Gilbert \\nRound and round we go. Gay Veteran \\n“Round and round we go” \\ntranslation from trollspeak: I just got whipped yet again Ron Gilbert \\nRound and round we go. Gay Veteran \\nwhat an utter retard you are! \\nyou want to tell me what to do but I can’t say “Don’t tell me what to do!” \\nyou’re such a knuckle dragging mouth breather that it’s amazing you haven’t drowned in your own shower Ron Gilbert Gay Veteran \\nyeah, I was speaking of you. \\nbtw, is that you Malcolm? because you sure write the same kind of drivel he writes Ron Gilbert \\nRound and round we go… Ron Gilbert \\nRound and round we go.. Gay Veteran \\n“Round and round we go” \\ntranslation from trollspeak: I just got whipped again! Ron Gilbert \\nRound and round we go… Gay Veteran \\n“Round and round we go” \\ntranslation from trollspeak: I just got whipped again!! Ron Gilbert \\nRound and round we go….. Gay Veteran \\ngod supposedly gave you a brain, try using it occasionally Ron Gilbert \\nRound and round we go…. Ron Gilbert \\nAnd facts are not what you are looking for. Revenge is…. keep up the good work for your masters. They will be your undoing in the end. Gay Veteran \\na , somebody has a problem with legal equality for minorities. so sad you can no longer discriminate against them fa** ots, ni** ers, ki kes, etc. Ron Gilbert \\nYou are not a race. You cannot claim that you are within the definition of minorities. Take a hike you justifier of hate. Gay Veteran \\nhey Einstein, Mormons aren’t a race either but anti-discrimination laws protect them Ron Gilbert \\nThen stop using examples of racial discrimination to support you being discriminated against. Gay Veteran \\noh, so you agree that Mormons aren’t a race but anti-discrimination laws protect them Ron Gilbert \\nOf course, that is a religion and as do the laws protect sexual orientation in the area of employment, housing, and being served in a restaurant. But being forced to bake a cake for a gay wedding, or cater a gay wedding, is not the same as you people perpetuate it to be. You are telling people to PARTICIPATE in that activity. It does not mean you won’t be served by them in their establishment, as you tried to tie in discrimination against blacks for not being served by whites in the South. Again, and for the last time, if you don’t support traditional marriage values from Christian business owners, go somewhere else. Freedom of choice is what you Libs want, isn’t it? But no… instead of wanting equality in laws (such as the pursuit of happiness for your opposition) you believe your rights super cede the rights of others to tell you no. Totalitarianism comes to mind with the logic that you push…. but you keep up that line of reasoning as you continue to believe that I am the stupid one… round and round we go… Ron Gilbert \\nRound and round we go Gay Veteran \\n“Round and round we go” \\ntranslation from trollspeak: I just got whipped again Ron Gilbert \\nRound and round we go.. Gay Veteran \\ngod supposedly gave you a brain, try using it occasionally. Ron Gilbert \\nRound and round we go… Gay Veteran \\nyou’re spewing yet more garbage Ron Gilbert \\nRound and round we go…. Ron Gilbert \\nExactly! Undecider \\nEverything is going according to plan. From the geo-engineering to Agenda 21. California will be brought to its knees. Once broken and fully under control by the New World Order, the rain will suddenly reappear. VigilanteCaregiver \\nYou can’t really fix up nature, only mess it up even more. Illegal \\nThere are people who believe Geoengineering techniques are being used to create this crisis. Least we forget we are dealing with information that is manipulated or is very one sided and incomplete.Like climate cooling/warming/change we are being feed an orthodoxy so we have our freedoms taken away. Force the small farmers out of business. Let the big ag corporations be handed the bankrupt farmers land. Poof! End of the drought. \\nI think I’m glad I moved out last year! (PS: NOT liberal) Philip Botwinick \\nClimate Change and probably your God doesn’t give a hoot if you are liberal or conservative. \\nNature Bat’s Last. \\nClimate Change is occurring in every single corner of the planet. There is no place to run where it will not have an impact. Hart Shepherd \\nBut it was climate change that forced our hand at coming down out of the trees in the first place and evolving to the point that we could even be having this conversation. We were born in that briar patch. Linda Starr \\nSorry, Philip, but my comment was in part a response to egore’s comment 3 days ago: “The really bad part is all those liberals gushing out of the state into the rest of the US like diarrhea. Buckle Up!” Climate has always changed and has always had an impact…bet your God knows that, too! Captain Canuck \\nJust to put this into perspective. The population of California alone is roughly the same as the entire country of Canada. We have the same problems as California as our snowpack is also dwindling rapidly. This is a continental crisis, and we are going to have to get very creative generating potable water locally, as there really is nowhere to escape to. Yawn Hugh \\nJunior Canuck; Come to northern Ontario. We have had lots and lots of snow the last few years and this year I have about 3′ still remaining in our yard as I write this on Easter. Lots of cold and snow paints the picture of Northern Ontario. Just came back from 4 months in Yukon……hardly any cold and snow there this winter. Scott \\nThe snow pack in the James Bay area and throughout SE Canada is still over 2 feet, which produces a tremendous amount of fresh runoff water. Yermomandeye \\nThey should go wherever Obama goes next year. James Hammett \\nhawaii and feed them to the volcanoes as human sacrifice? Matibob \\nNo thanks. Mike Smithy \\nBuild a nuclear power plant in the Mojave Desert and dedicate the power to desalinate water drawn from the Pacific. In the unlikely event of a nuclear disaster, the only creatures at risk will be scorpions and rattlesnakes. Win/Win either way. Problem solved. nobody \\nHardly, you will still have to source the uranium fuel and dispose of the waste.. And please tell me that you really don’t think that a disaster will limit itself to a very tiny region. Mike Smithy \\nThe USA already has a deep geological repository for nuclear waste at Yucca Mountain, Nevada. Unfortunately, President Zero closed it down in 2011 for political reasons. I.E. The environmental wacko nutjob lobby. \\nYucca mt is full. U can’t keep storing that stuff forever. Mike Smithy \\nKim, the U.S. Government spent millions of dollars constructing the Yucca Mountain containment facility. However, the facility does store any nuclear wast at the present time due to decades of legal red tape and political hurdles. That’s right, it’s a massive, yet empty man made cave. nobody \\nActually no, it has already wasted all the easily available uranium ore and what we still have costs a fortune to refine. BTW that deposit has been closed because it has been proved to be situated in an insecure location – the mountain is heavily cracked and they discovered that only halfway thru building it. ” The environmental wacko nutjob lobby”– that clearly indicates your level of intelligence so i have no hope of convincing you with reasonable fact-based arguments. Please carry on. Irma Johnson \\nI live in Las Vegas and the thought of all of them coming here really is scary. We already have water problems as it is. nobody \\nYou are kidding, right? Because you are already living in a desert. SunnyFlaSnotress \\nOh no.. Vegas has it’s own drought happening. It’s economy is based on luxury spending which is likely going to drop. Just look at Atlantic City Casinos. We can blame neighboring state casinos for that, buy it likely isn’t the total story. Mexifornia Taxpayer \\nWait until you cannot get cheap Hydro Power from the Colorado River and then you will be thirsty and in the dark! Philip Botwinick \\nyou sure do and it’s going to get worse fairly rapidly. \\nWhere does your food come from now and what will you do when it doesn’t come? Tom \\nThe Grapes of Wrath Part 2?? alan \\nA lot of the southern part of the state is desert, so kind of a fail on their part. But it sounds like it might be good news for the South, Florida specially. I am sure what they will do is just import everything from Mexico and let the farms die. Priszilla \\nOh well, the US has about the size of China, much more greenery but only a fourth of its population. Let China open her borders to enable the emigration of 300 million Chinese to America. Bruce David \\nDecades ago many of those Californians began migrating to where I lived in AZ. They had already screwed things up with their LA smog drifting to our valley. Once transplanted they planted so much CA-style vegetation our average humidity rate raised from 6% to 26% and our realty prices skyrocketed. Then even more illegals filtered into the valley…in other words, I know where they’ll head and they’ll try to screw up AZ [they are even trying to overturn our gun laws to resemble CA style communism]. Priszilla \\nThe greens will create a forest garden or permaculture. They will grow trees and bushes and herbacious plants and root plants. The trees and shrubs will reduce evaporation and soil erosion by wind. The monoculture farmers will go crashing. They just need a virus to destroy what they still have left. \\nNature is showing us forever how things are done. We are just too proud to watch and listen. XSANDIEGOCA Kim \\nWe went up to mt hood in Oregon last Sunday to mushroom hunt. There’s no snow up there. Palmer is the only lift that’s open, as far as I’ve heard There is no snow at Mt Hood Meadows or Snoqualmie up in Washington. I saw it like this a few years ago, but never this bad. Winter skipped the northwest this year. We had, maybe, one or two days of freezing temps and that’s about it. Southern Oregon and eastern Washington is dying on the vine with California. LAWD \\nLake Powell is going down fist along with the glen canyon dam K2 \\nwhat? since when has this been happening? why bother \\nI shared a shuttle bus to JWA with a group of skiers Friday morning. They obviously had skis and snowboards in the long bags. I asked them where they found snow. They said Colorado. libsarescum \\nPlease move to Washington or Oregon, and take your illegals with you. We don’t need Californians to ruin our the rest of the country. True Grit \\nWe could get rid of ten million if we just deported the illegals! SunnyFlaSnotress \\nCalifornia’s immigrants number around 10 million, not its illegals. Bruce Wayne \\nthere will likely be plenty of more Mexican Migrants only to happy to take up residence anywhere in California SunnyFlaSnotress \\nNot if the jobs tank, and water bills go up along with other basic costs of living, as would be likely in a prolonged drought scenario. 1fifty \\nYes. And the reason is that climate change models show Mexico and Central America also going thru a mega drought. True story. \\nAnd California migrants will move where they want to, not necessarily where other people think they should move to. Also, people in the pacific nw should realize that if the mega drought really settles in, then here comes California for Columbia River water. \\nFinally, it’s not just California, but New Mexico, Arizona, west Texas, and Nevada that will also have the same mega drought. And, possibly, Utah. Elmo Fudginputz \\nClimate change models? Is that a type of slot machine Vegas? They aren’t worth horse poop except to insane people. Philip Botwinick \\nWell Elmo, you seem to be one of those “educated” USA citizens that Morris Berman and Chris Hedges write about. \\nBet you believe that water doesn’t really boil at 212 degrees F. \\nWhether you believe in Climate Change or not doesn’t matter. Climate/weather could give two craps about what or if you are even capable of thought. Your just a piece of gum stuck on the body of Nature’s foot. Squish. Squish. \\nHistory is full of people like you and on an overpopulated planet (just try to live by putting all the world’s population in the state of Texas and then see how that works out) the reduction in the human species could only be a benefit to all other species on the planet. Elmo Fudginputz \\nThere is no science supporting man-made global warming. Its a delusion. That probably suggests you are also a progressive who believes in lots of other delusions. All the climate models to date have been wrong. None of them work. 10’s of thousands of scientists and engineers reject man-made global warming. In fact, during the last 15 years the Earth has been cooling – all notwithstanding your delusional addiction to fantasy and scientists having been repeatedly discovered to have adulterated data to support man-made global, for the benefit of the organizations who fund their research; making it a criminal enterprise as well . When a liberal uses the word “science” in support of an argument, its not science at all but delusion, fairy tale and fantasy. You also probably believe Obama was born in Hawaii…HaHaHa! afchief \\nYou are right! Global warming has nothing to do with science. It has to do with CONTROL. Controlling us!!! P’od Accountant \\njust because you can’t understand or comprehend the science doesn’t mean human activity isn’t changing the earth at a global. you sound like a blind man railing against light because you can’t see it. airedale \\nHuman activity warming the planet makes no logical sense. Humanity is like atomic particles dancing on the shell of an egg, while the shell is like the earths crust floating on a mass of magma (the egg white) which surrounds a core of molten iron (the yolk). It is like saying your breath will warm a volcano. joe oberr \\nPlease prove that human activity is changing the earth (I presume you mean on a global basis). Since carbon is way less than 0.05% of greenhouse gases and is NOT a poison or pollutant but is necessary for life (human, animal and plant) how is it that climate changers somehow conclude human activity is bad for the earth and life? Water vapor constitutes 95% of greenhouse gases. There is no historical evidence indicating warming periods followed increases in co2 emissions or in the atmosphere. How do you explain “The Pause”? (The Pause is the documented fact that there has been no global warming for the past 17 years). Briarpatch \\nThere you go again with the water only boiling at 212 degrees F again how many times, moron are you going to use that INCORRECT statement. Go look in an eighth grade science book. joe oberr \\nPB – If you and all others who share this view are logical the next step would be for you and the others to end your lives in order to benefit all the other species on the planet. But since I do not see that happening I can only conclude you are not being truthful and/or you really do not believe what you just said. Fat Hubie \\nLet’s start the reduction with you… DixieAngel_76 \\nGood, why don’t you go first? 1fifty \\nAlways glad to read thoughtful, insightful responses from an intelligent commenter. pmagn \\nhey your going to be a migrant soon. show some compassion. sherlock32555 \\nNot if we grow a set and put a stop to these idiots that put illegals first and we the people last. But what can you except from the brain washed people. It’s going tot take people that want to save us! Elmo Fudginputz \\nLet’s invade Mexico and oust the rich and Catholic Church officials, and then make it into our 51st state. Let’s finish the work Zachary Taylor started. gleb glebster \\nIf anyone wanted Mexico, they wouldn’t be flocking here by the thousands. simoin \\nMexicans were actually in California first! but in the end no one should invade anyone. And seeking a better life is not invading. what rich catholic church officials? mexico is a poor place. And why target catholics? obviously the liberals are the ones with all the money in this country. They own the media,hollywood,government,corporations and even the main internet sites like youtube/google. But following Jesus Christ and waking people up is what matters not ousting people. And stop tearing Christians apart by attacking Catholics who are Christians. Catholic church atleast has teachings that never change unlike unfortunately many protestant churches who are siding with liberalism and evil. Christians need to stick together to make the world a more peaceful and loving place with Jesus Christ! Ron Gilbert \\n“Catholic church atleast has teachings that never change” \\nThe Catholic Church has adopted many teachings from other religions through out history in order to make their religion more palatable. Take for example purgatory. You won’t find it in the Bible but you will find it in other religions. How about when they taught that the Earth was both flat as well as the center of the universe (Galileo was excommunicated for teaching the opposite and then was “allowed” into Heaven when the Catholic Church finally admitted their mistake – wouldn’t God know his own creation?)? I could go on with this but it would only be rubbing salt into a wound. Needless to say, the Catholic Church does not represent God, never has. Their method of salvation is one of works while God says salvation is by grace through Jesus Christ alone. We work BECAUSE of our salvation not for it. True Catholic \\n“There are not a hundred people in America who hate the Catholic Church. There are millions of people who hate what they wrongly believe to be the Catholic Church.”– Bishop Fulton Sheen. Centurion53 \\nAnd look at the third world S h i t hole the Mexicans have created with their wonderful country….Round up the criminal invaders and ship them ALL back to that Hell hole!! jamessrq \\nI am not going to address ‘who was first’ but I will THANK YOU for advocating Christian people not antagonize each other. VigilanteCaregiver \\nWOW! Who knew obeying the law has benefits! BabylonUSA \\nThe Pilgrims, they came to America seeking religious freedom rather than “obeying the queen of England”… VigilanteCaregiver \\nWell yeah. I was being a little sarcastic… \\nAt the same time, if you look at English legal tradition there’s always been a sense of the people having an established basis of liberty. Before the Roman invasion many communities elected their Chieftain for a set period of time. Before feudalism came in 1066, the English monarchy was more of an elected office with elected officers and magistrates. The Scottish Clan system was the same way. Whenever the monarch became a tyrant, the citizens usually ran him out or died trying. The idea of the Round Table came through this tradition. \\nThe Pilgrims (or Saints as they called themselves) were part of the Brownist Reformation movement. The King assumed Church and State powers during Henry VIII’s bloody, psychotic reign and was continuing this non-traditional practice; throughout almost all of English history the King was subject to God, not able to pretend he was the spokesman for God and could force the people to his beliefs. In this view, the King was in violation of English legal tradition. user z \\nYou are comparing leaving a country to entering it illegally? Have trouble with common sense much? Ed \\nSo immigrating to America and exterminating the indigenous Indian population was legal? user z \\nWould you have preferred that the indigenous exterminated your ancestors? Another lacking common sense. What exactly do you propose against those wearing animal skins projecting arrows and hatchets at you? h ? jamessrq \\nHold up. Both of you need to realize that you are addressing two different subjects. Pilgrims did not conquer the south or the west so they had nothing to do with exterminating Indians. They enjoyed good relations with the majority of ‘locals’ they encountered. Remember Thanksgiving? \\nNow, if you want to go after those who did commit the crimes you describe, make sure you do not generalize and ascribe guilt to all Anglos. Instead, state which people were responsible because not every settler was some ‘evil land grabber’. How about starting with Andrew Jackson who infamously proclaimed the only good Indian was a dead one? How about getting Barry Hussein to take Jackson off the $20 instead of Hamilton, who opposed slavery, off the $10? That would be more productive. Or, try to address James Polk who pushed ‘manifest destiny’. Stay specific and you can have a meaningful conversation. Get caught in generalities and you will only sow the seeds of insults. Get it right \\nYou bet, that was then this is now! Get out of my country deadbeat, get out of the USA deadbeat, stay out. puchache \\nYeah, user z. It looks like you are proving the old adage that common sense is not so common. Look who is talking. \\nWhere did the pilgrims obtain their immigration permits from? From the Sioux? From the Wampanoag? user z \\nCommon sense would indicate that there was no established law or government when the pilgrims got here. Good luck getting some common sense. puchache \\nIn addition to a lack of reasoning, you exemplify typical ignorance. I bet you’re the type that can’t point to where Alaska is, much less, say Chile. \\nThe natives had their laws, their constitutions and their civilizations. eejit. user z \\nI have been around the world in Asia and Europe. Its a shame you can’t even refute the fact that your example was asinine as there was no government when the pilgrims got here. Changing the subject is a total fail. Greling Jackson \\nYour “history” sounds like something a bunch of self-serving land-hungry white men dreamed up before pulling out their quill pens to write. user z \\n“Of, by, and for the people” IS a VERY self-serving” phrase. It serves every self for which it was established and it’s called civilized FREEDOM. So until you can come up with your own “more perfect union” government why don’t you just shut your ignorant, history deficient pie hole or go live somewhere else where the government owns your land, tells you where you can work, and forces you to live in abject poverty, because your bedwetting here is stinking the country up. Maybe you would prefer Kenya since it wasn’t formed by white men. P’od Accountant \\nthen you will also have no food in addition to no water, idiot. DixieAngel_76 \\nOh yeah, because people never ate until the illegals came along to ‘save us all’ from ourselves. Nicholi Hel \\nIn the Bay Area Alone! user z \\nYea Kalifornia, enjoy your over-populated and illegal diversity Kees Roma \\nIn a way, though, it’s kind of poetic justice…the illegals flood California, the U.S. Government refuses to stop them and the California government (including the Governor Brown) betray our own nation and create laws to welcome them and, in the end, they will get nothing but desert…you have to love the irony…and I kind of like the scorched earth policy…if we can’t have it, neither can they… LAWD \\nStart with: If it’s yellow, let it mellow, if it’s brown flush it down. I had to pack in a bucket every drop I used growing up, and I can tell you, I respect water. That’s something California never learned. Matibob \\nCali could start by flushing Gov Skidmark Brown. PhDProfessor \\nToo bad California didn’t plan ahead for this eventuality by building water desalinization plants with the plentiful Pacific Ocean water trough right off their coast. Instead they wasted billions on dubious social programs with little to show for it. TrainsOverDesalinizationBad \\nAnd spending billions on a slow train to nowhere that could be spent on desalinization plants instead. Matibob \\nWhen you vote in Gov Skidmark Brown AGAIN one does not have to look far as to why preparations where not a first priority. Philip Botwinick \\nYeah, that’s the ticket. Two examples of what our highly touted education system believes is critical thinking. \\nLet’s build more desalination plants (of course how will they be powered, oh by nuclear) which will produce more water so we can grow more food and use more fertilizers and create more dead zones. More food means more people so that we can stress out the planet even more. \\nWatch Albert Bartlett’s Exponential Function on youtube and open your minds. \\nAnd don’t believe the hype about fitting all the people on the planet in the state of Texas. Just take a breath and think about what that would be like. guest \\nHow does Saudi Arabia get water? PhDProfessor \\nThey smartly built desalinization plants to provide a stable supply of fresh water. Ronald D Morrison \\nCalifornia should start with recycling the water back into the dry lakes that is released by its sewer treatment plants. In our area the water released into the ocean is pure enough to drink when it comes out of the plants. In Hampton Roags Virginia we put about 180 million gallons of water back into the ocean every day. We have a population of about 1.8 million. To supplement its recycled water, California should establish desalinization water plants. Also, California might find it advantageous to change its life style and to repent. Black \\nI Pay for my water just like I pay for my gas. I’ll let my 3, 12 mpg SUV’s idle in the driveway all day and turn on all the faucets in the house and watch the water flow down the drain if I damn well please. I’m an American and its my god given right Michael Montgomery \\nIts comments like yours that make logical people face palm. Poor choice of words. Its like those that open carry in front of a school because they can-Dumb! K2 \\nThe more water you waste, the more your fellow americans will suffer. Richard O. Mann \\nYep. That’s a fact. But, when ya turn on that faucet, and nothing comes out, that is whey you will have to load up the SUVs with whatever you can pack into them, and move some where else. Bad thing is, no one is going to want all those people from California, moving into their state/communities. I can see armed citizens waiting at the state line, looking for license plates from California. Either turn back, or be shot. Let the good times roll. Doug_B \\nCalifornia – the big warm and easy – I don’t want these people and the illegals in my state! Agua \\nThe people will head south of the border as planned. Chemtrails and the North American Union. Thanks NWO. Doug_B \\nHow about a machine that turns illegals into water? Just a thought. Matibob \\nThere is no way I would drink that! Idahocntryboy! \\n“If my people who are called by my name will humble themselves and pray and seek My face and turn from their wicked ways, then will I hear from heaven and will forgive their sin and heal their land”. 2nd Chronicles 7:14 God’s patience wears thin. Devastation will continue to come on this country until this country repents and turns back to God! goldminer \\nLOL! Well you can thump your bible all you want. But it aint gonna stop the flood of thirsty caifornicators that will be headed to your part of the country. There wont be no healing of your land then. They aint thirsting for salvation. Just more money and sin. Idahocntryboy! \\nIt will not be just California that suffers the entire US is going to have major catastrophic situations where men’s hearts will fail as fear grips their thoughts. Laugh all you want at my Bible but this Bible predicted over 2500 prophecies and 2/3’s have a 100% accuracy rate and more coming true each day. Israel experienced it’s disobedience to God as will this country that has completely turned it’s back on God. 2smooth \\nAmen brother ! Hallaluja to the lamb ! chilller \\nPraise God from whom all blessings flow….or suffer the consequences at your own peril…. Paul Patriot \\nAmen. All we can do is pray that the scoffers wake up and repent before their window of opportunity for salvation is closed. Gay Veteran \\nTruth! suss \\nwell, what he said is true……….think about it for a change. everyones so wrapped up in phones, games, lifestyle, and not od. you reap what you sow….. user z \\nIf there “won’t” be “no” healing, then there will be some healing. pmagn \\nHey you dont need God to let you know that. Climate scientist have been say this would be coming for the last 30yrs or so. Idahocntryboy! \\nIt will be far worst that just climate change! The ground will crumble at your feet, the moon will be as blood, famine, pestilence and it is coming soon to a town near you. Sunny \\nBut the million dollar questions are – CAN they save you? \\nIsn’t everyone will be busy to save their own as**? DixieAngel_76 \\nAnd the Bible said it thousands of years ago. suss \\nAMEN!!!! DixieAngel_76 \\nFinally, a word of wisdom; but don’t expect the scoffers to listen. Christ Himself warned that in the last days they would just about outnumber everyone else. gillyking \\nEliminate sanctuary cities, strictly enforce immigration laws, rid the state of all the societal parasites sucking California dry! Utilize the ocean! De-sal plants up and down the coast! Cease the political global warming hoax hogwash and use our resources much smarter! Yawn \\nwhy is the un involved this is a US problem…please dont come to my state… underaged \\nLame excuse for an article – no thought, just hyperbole. Joss Smith \\nNobody with any Brains at this moment is factoring into the U.S. Economic situation that if California doesn’t get substantial rain in the next 18 to 24 months it will be “dire Straits” financially, economically, and socially on top of each current problems because we never seem to do anything until its broke and to late. \\nThe ramifications will create a tremendous strain on the U.S. Economy and will probably cause an eventual collapse in the coming years. Just imagine large parts of California without water because at this stage that is the forecast from the experts. \\nReal Estate Prices would CRASH . . . . Agriculture, the Dairy Industry and Wine Production would collapse . . . . and Hollywood well that’s another story ! What would happen to Silicon valley ? This would be devastating on the entire country. Let’s hope the Rain is coming Soon ! Mystic Dog \\nLose the agriculture, lose the golf courses, lose the green lawns, lose the car washes, utilize 1 gallon toilet tanks (and remember if it’s yellow let it mellow, if it’s brown flush it down). And there should be just about enough drinking water for 38 million people. Lorungee \\nLose the golf courses…MY GOD…what would Bob Hope think New Man \\nso cal will not be affected because of measures that have been taken and a new desalinization plant coming online called “Poseidon” but the exodus from mid cal has already begon in earnst Danny Straw \\nIn stead of spending Millions on illegals they should be turning sea water into fresh water..but libtard are just that to stupid to do anything so smart.. pmagn \\nerr they are. One coming on line now. 19 in the pipeline. \\nDo you know how much desal water cost? Philip Botwinick \\nIt appears that pmagn is asking the right questions. Too bad Danny Straw (Strawman) is typical of the level of critical thinking we have in the world and especially in the USA. \\nHas to turn things into Liberal/Conservative debate instead of being able to see beyond those limited thinking skills. \\nHe ought to try to learn how to grow food (and spend less time on the net) to see how hard it is to do without water. \\nGuess Danny hasn’t watched Ken Burn’s “The Dustbowl” or he might be concerned that the Ogallal Aquifier will be depleted by 2050, so every part of the USA west of the Mississippi will be worse than the Dust Bowl of the 30’s. \\nGuess Danny ought to buy that one way ticket offered by illusionist Richard Branson for that colony on Mars. \\nNot only is the cost of desalination going to make it prohibitive, but without energy to run the plants (fracking is imploding so the Obama fantasy of the USA being the Saudi Arabia of the world again was short lived) makes them a waste of effort, time and energy. \\nHey, Danny, read “Green Illusions” by Ozzie Zehner. Briarpatch \\nWhat no comment in all that slop you typed about water boiling only at 212 F Ed \\nTuning sea water into fresh water requires energy. Fossil energy is depleting as fast as water. California, like Mexico is in population overshoot. mark mc \\nDuring the Dust Bowl, California government sent the the highway patrol to Blockade the highway at Blythe to keep out the Refugees from the Midwest. I say turn about is fair play. Send Arizona Highway Patrol to seal off the Colorado River crossing points. God help us in Arizona. Mondobeyondo \\nThis drought will have long term effects on not just California, but the west of the U.S. as well. (And also the REST of the U.S…. intentional typo, heh.) \\nIf you want to, you can forget the old saying “As California goes, so goes the rest of the nation”– but much of the nation’s fruits and nuts come from the Golden State (not the political kind, but the kind you eat.) It is a huge producing state for avocados, lettuce, citrus, Napa Valley wine, pistachios and many other products. The drought will have a severe effect on California’s produce. \\nNot to mention. a lot of people will go thirsty, too. The whole West and Southwest is parched. The Colorado River’s flow is way below normal. Los Angeles already has water restrictions in place. Las Vegas and Phoenix may be next . evoval \\nBy their own admissions the science of cloud seeding is a factual reality. They can make it rain or they can make it not rain. If they have the technology to make it rain why aren’t they? Because they’re using the technology to stop it from raining. Look up at all those hi flying aircraft spraying everyday, even when the clouds are black and it looks like rains coming it doesn’t. Turn off the spigot, dry everything up, destroy property values, buy up all the real estate dirt cheap then turn the spigot back on at a time of their choosing. Diabolically ingenious! DJohn1 \\nCalifornia needs to follow the example of Israel. Using the water you got which is the Pacific Ocean. Use toilets that use little water. Up and down the entire Pacific Coast, figure out why rain is not coming. Then change the conditions causing the drought. Conservation might help in the planting of as many trees as is practical. Leaves from trees tend to preserve what water there is. Disney put together a project in which they drip feed water to plants. It needs to be put into place in California to preserve vegetation where possible. Everything done is accumulative and eventually it might even solve the problem. I look at it that it didn’t just start suddenly. It has gone on for years. Now it is getting critical. The problem of drought will not go away suddenly either. It will take years to solve the problem. When natural things reverse then the state could end up flooded. Remember, who is really in charge. God can do miracles. California and surrounding areas needs to change. The change is going to be somewhat painful but necessary. There is some hidden cause that is preventing the rain from falling. That is what California has to discover before anything will work. jakartaman \\nAn angry GOD on the sodimites Gay Veteran \\nThe road of the Godly leads upward, leaving hell behind. Proverbs 15:24 \\nmore parroting of bible verses. Polly want a cracker? \\nSaid it before and I guess it bears repeating… California is led by politically correct morons. \\nThey are spending billions on a train nobody wants, instead of investing in what? Solar powered DESALINATION Plants everywhere. They have the biggest body of water in the world, right in front of their eyes and they cannot see… Philip Botwinick \\nYour are still drinking the Kool Aid laced punch. \\nRead Ozzie Zehner’s “Green Illusions” and take the red pill. \\nRealize finally that Solar and Wind cannot and I repeat cannot power industrial civ and definitely can’t provide a “middle class” American lifestyle to the entire planet (which would need 5 other planets like Earth to do so). \\nSolar and Wind are fossil fuel extenders. You understand what and extender is? Hart Shepherd \\nPhilip, solar collection for boiling water is not the same as converting solar energy into electricity. It is a much more efficient process and is totally viable. It does, however take up a lot of real estate, so the ocean water would need to be pumped into collectors in the desert, and the fresh water pumped back into the city. I think you were confused by the word powered. Either pay closer attention or try not to be so sanctimonious. Reminds me of a joke. What do you get when you cross Albert Einstein with a streetwalker? You get a f*#king know-it-all. Piper Michael \\nYes Philip, in the general case, I agree. But this is a specific case for a specific task, and yes, I was being bit flippant… 😉 Generally the comment was about common sense, and mistaken priorities of the leftist idiots running things. The whole problem is Kalifornia, overpopulation, and Illusions that we can keep our current level of technocratic civilization running. That is a problem I and many others have been working on since the first oil crisis in the 1970’s. There are no solutions, except Malthusian. Is that the answer you wanted to hear? Joe Burbinski \\nWell look, if this drought is actually natural, what do you expect, the majority of California has always been a desert …period. it has only developed for human habitation because they stole water from other parts of the nation. As I said, if this drought is natural let it reclaim the land the sooner the better. There are lots of spaces and housing for all those California’s in Michigan especially Detroit, it has lots of housing that is empty and I hear you can get homes at a fantastically low price, plus lot of water in Lake Michigan for them. Mexifornia Taxpayer \\nJust exterminate the two legged vermin and their spawn that infest the city, burn everything down and start over Joe Burbinski \\nWell from what I have read, that is a possible option that the so called power brokers of this world are looking into so they can have it all for themselves and only keep a small number of us simple folk to do work so they won’t have to.After all us simple folks are just a drain on the resources that apparently I am told belong all to them Alleged Comment \\nYou wanted gay abomination, you wanted a foreign illegal king, you wanted abortion genocide, you wanted prayers out of schools, government, and your lives. \\nYOU WANTED TO DEFY GOD!!! \\nWell guess who owns the water there? \\nDrink waters out of thine own cistern, and running waters out of thine own well. (Prov 5:15) H8Religion \\nChild Raping Priests DEFY GOD or does GOD condone it? After all he has remained silent about it!!!! 2smooth \\n@hater, Why dont you mention the head cutting off muslums. Are you scared of them or are you one of them. Sunny \\nThey too are screwed up, and the ones who didn’t got yet, will be soon. Wait & watch! 😉 Alleged Comment \\nAre you talking about Moslems? Please state your cause. 2smooth \\nAmen !brother amen ! hallauluja to the lamb, give him praise and glory in the house ! God is is not pleased with the way they have strayed away from the faith and shook their fist in his face ! Gay Veteran \\nbilge from a tired old bigot Mark Odenbach \\nHigh End Solar drought solution for The Golden State. \\nThere is a technological solution to this problem. I don’t even need credit for it, but it is my idea. \\nThe three, one mile square solar concentrating steam generating, electric power stations that are operating along Interstate 15 south of the state line between CA and NV are the way out of this mess. The boilers need to be modified to use ocean/salt water and to continually wash the concentrated brine with fresh salt water so as not to clog the boiler with salt. An area of perhaps 50 square miles should be set aside in the low area of the southwestern central valley, where there used to be a lake and the farmland is not as good as elsewhere. The brine handling solar power generating plants should be built in this area with the already existing piping and canals from the delta used to supply them with salt water from further out into the ocean. The solar plants boil the salt water and use the steam to make power from the sun, which makes the “Greenies” happy; the steam from the turbines is then condensed into pure water with the cold salt water coming into the plant which is warmed up a bit; the continuous flow of highly concentrated brine flushed out of the boilers is placed into evaporation ponds for salt and other mineral mining operations. A small fraction of the power generated by the plants is dedicated to run the delta pumps, the remainder is injected into the grid. The fresh condensed water is piped throughout the central valley to eliminate the water shortages CA will be experiencing. This is basically, solar desalinization with many additional benefits. This system is scalable and even more value can be derived with new technologies and innovations. \\nMark Odenbach \\nI have a house in phoenix i can let someone buy for 700k frank1569 \\nThere is only one solution: 1/2 the population needs to voluntarily move to another state ASAP. Of course, said 1/2 can’t afford that, so our govt is going to have to declare a state of emergency and provide relocation assistance for both people and businesses. \\nSaid assistance could easily be offset by, say, our not bombing 6 countries in the Mid East for five damn minutes. \\nOf course, what will really happen is ‘Grapes of Wrath, Part 2,’ because when the going gets tough, Americans start hatin on each other big time… you know, because we’re an awesome Christian nation and stuff. CharlesH \\nI just posted signs at all entrances. DELAWARE IS CLOSED! Bill \\nNo Dams, no water reserves. There was a huge anti-dam movement to preserve the environment. Now the environment is dying because we didn’t build water reserves. Bill \\nChange your username. Ken Swan \\nIt’s called WEATHER you asshat… go read your HISTORY BOOKS ( pre 1980) and maybe you would learn something real… and who believes that lying POS Gore anyway ( yeah the guy with the $12K/month powerbill) Pete \\nOh, and what happens if at the same time San Francisco or the L.A. area gets hit with a major earthquake? It’s look out below.. Lorungee \\nFish and other wildlife disappearing from the Pacific ocean and Cali coast and NOBODY in officialdom (dumb) wants to talk about the connection between Sea Lions with the symptoms of radiation poisoning and Fukishima. Truly amazing. goldminer \\nI have said this before here and say it again. It aint just about watering crops. lawns, and swimming pools. Its about power! The west runs on cheap hydroelectric power. We have about 1 year of cheap power left in the west’s lakes. After that. Out go the lights! AND air conditioning. Can you imagine what LA, Las Vegas, Phoenix, ect would be like without AC and cooling. The words hell hole comes to mind. I laugh at all the people who talk about Desalination plants. They take huge amounts of power. Where are they going to get that? Go nuculear? in Kalifornia? LOL fat chance. They would plant a useless windmill on every square foot of ground first. Don’t you just love it when a good plan goes to hell. Dale Graley \\nI say lets get that billion dollar bullet train built through Cali so we can move water around faster! TheTruthBurns \\nCrapipornia – Glad I left. It was the Golden State maybe until the late 80’s or early 90’s but has really gone down hill so now it is The Golden Toilet Bowl. Too Many Illegal Mexicans, Indians (On Work Visas-Yeah Right), Mainland Chinese (Rude, Money Grubbers). Every kind of Lifestyle is OK especially Rapists & Child Molesters (Again See Illegal Latinos). I have told my relatives who live there if you don’t leave Cali – then when the Big One Hits or you can’t find anyone who still Speaks English or there is No More Water Left then Look in the Mirror & Realize YOUR STUPIDITY for Staying – Sorry No Sympathy Here. A few Good Nukes could Solve a lot of problems – Can you Hear Me San Francisco, L.A. & San Diego – Buh-Bye! The Conservanator \\nCall me crazy, but wouldn’t all the money that has/will be wasted on benefits for illegal wetbacks and Jerry “Moonbeam” Brown’s cho cho train, been better served by being used for the development of a desalinating system? Do you need a better example of liberal lunacy? Briarpatch \\nWhat a tool. Al Gore knows NOTHING about weather patterns or anything that pertains to earth sciences. Al Gore was only trying to cash in on the “Glo-bull warming” scam to make more money. Idiots believed him and the rest is history. Philip Botwinick \\nObviously neither Ken nor Briarpatch understand the difference between climate and weather. \\nDo some research guys and learn that you’re not going to heaven. \\nHere’s some help, if you’re open: \\nAlbert Bartlett – exponential function on youtube \\nCheck out Guy McPherson’s Climate Change Summary. \\nBet you believe that water can be made to boil at any temperature other than 212 degree F. Briarpatch \\nHey Einstein, what kind of background do you have in science? of any sort? Not that satellite imaging of the Antarctic shows an INCREASE in ice coverage. Oh and YES!! I do know (not believe) that water can be made to boil at a temp other than 212 degrees F. You must have been asleep in you freshman high school science class dumbass. Water will boil at LOWER temps with an increase in elevation. At 5000 ft. above sea level water WILL boil at 198 degrees F. Trusting you and your friend, Al Gore with any matters of science is a losing bet to be sure. Go back to watching Dancing with the Stars. Marine68 \\nThe lack of rain and Snow is not a Catastrophe; there is much Water underground that can and is pumped up. The problem is that the Government redirects overflow into the Ocean rather than down to the south of the water’s sources. pmagn \\nits not just CA, its the whole SW.. and parts of Mexico and Central America. And thats exactly what #climate predictions where. These regions are now bust. We should have been planning on how to cope with this. Maybe you can really plan for this… Its going to be ugly. Lucretius Laskaris \\nLovin’ the comments here. There are some real pieces of work. More Flatlanders stuck in their ideological prejudice than I can shake a stick at. Love it!!! Hart Shepherd \\nYour avatar is apropos. Hart Shepherd \\nOh, and the so-called flatlanders are much brighter than the tard with the pointy end of the ice-cream cone stuck in his eye. 2smooth \\nPraise the lord, he is coming soon !!! GSOB \\nPraise the Lord! JI \\nOh no, this is a disaster for the western US!! A mass migration of Californians! Wherever they go, they quickly vote for the type of people and policies that screwed up California in the first place. Bill \\nHi Michael – The Great Drought is being engineered through Geoengineering – Aerosol Particulates and EMF frequencies (HAARP and S Band Radars) – see documentation in videos by Mike at The HAARP Report YouTube channel jack_foobar \\nWe’re going to dig a moat around California and set it on fire. Any other stupid questions? Patrick Adrien Varencaus \\nAdios amerika . Your sins are exposed you ve rejected God time to pay European American \\nThe Pacific NW got massively sucker punched by the “invasive species with an attitude” from the south, back in the 80’s. This time we’ll be waiting for them. Locked and Loaded. clay mills \\nBut this time, He wants us to help ourselves! 😉 GSOB \\nMy Deliverer is standing by. UCSPanther \\nFrom what I have heard and read thus far, the 20th century was the wettest known time in California, but the later 19th century was quite dry (Including the great drought of 1886 that scuttled any plans to raise cattle in the Central Valley). \\nI think we are seeing a return to the “dry” cycle of the past century. Ironic, considering that many people from the prairies migrated there during the Great Depression to escape the Dustbowl Droughts of the mid ’30s. I wager we will see the reverse now… NoWorldOrder.com \\nDesalinization technologies are starting to come to the forefront to save California. Do a search for the Carlsbad desalinization plant, and check out Okeanos Technologies new desalinization process that could change everything. Edward Kirby \\nAs I’ve been saying for a few years: Detroit real estate is the biggest bargain in history right now. Located on the greatest source of freshwater on the planet — the Great Lakes — there will be a massive migration to this area as Latin America empties out along with everything west of what is currently known as the Mississippi River. \\nIf I had any money at all, I’d be picking up a few empty lots in an impoverished area near downtown. In a decade or so, that kind of investment will have increased by several orders of magnitude as the lands around the Great Lakes see their population increase to over a billion people. Naughty Goy \\nWhat may actually happen is farmers will leave the state. Most of the water is used by the farmers. I believe it’s about 80% of the water that is used by farmers. If a bunch of farmers leave the water usage should go down a lot and it should solve the drought problem that way. Catman \\nWhy are all the article sources leftist like NPR, National Geographic, Jerry Brown, and the UN? That alone make the stats suspect. This is great climate change fodder, but it doesn’t tell the whole story. What about the pumps that have been idled that put water in the aqueduct because some smelt got caught up in the machinery? What about all the illegals using water in California? Will this lack of water be used by the Obama administration to force other states to take in all these illegals? If this has been such a critical issue for decades why is the next desalination plant five years from completion? Where are California’s priorities? Since so much domestic produce is grown in California why hasn’t a pipeline of water been constructed from say water-rich Wyoming to supply the need? Certainly investors would pile into that project if there was really a need. I suspect the need is not that critical, or they would ban swimming pools at least. And I really believe the left wants to use this issue/crisis to further it’s nefarious agenda of advancing man made global warming, and continue its wealth transfer schemes. Orange Jean \\nWhat most surprises me is that California wasn’t expecting this. They have always had a tenuous hold on water… with parts in the north often getting far too much at the same time as the south getting too little. \\nThat’s why they built (as who knows what cost) the CA Aqueduct system (which is how the Central Valley gets it’s water for crops) as well as the flood control dams. That’s why back in the late 80s (during a 5 year drought) they passed new plumbing ordinances requiring “low flow” toilets and showers. \\nThat’s why LA robbed the farmers of Owen’s Valley of their water. That’s why the St. Francis dam failed and killed over 500 people back in the 20s. And in East of Eden (set in Salinas, CA) Steinbeck wrote: \\n“And it never failed that during the dry years the people forgot about the rich years, and during the wet years they lost all memory of the dry years. It was always that way.” JB \\nNow that they have ruined their state, it looks like many of the Califonians are coming to Texas to drain it of everything, including water. But we have the same problem here. The lakes are drying up at an alarming rate. DON’T COME TO TEXAS, especially Austin. dasgeiss \\nAbout 30 million to get back close to 100 year ago figures. They would go to the East coast, Chicago, Detroit and Southern states. AndreaNY \\nIf the governments of China, and Russia are able to come to the aid of their farmers/citizens by seeding clouds to produce rain, why is our government not doing the same. Just google”China seeds clouds to relieve drought-hit wheat”. Just seems to me something is really of kilter here when our government acts like they have no knowledge of this technology that we helped perfect. Scott \\nBuild the Grand Canal project. JWM \\nThe hasn’t been a natural weather pattern in this country for well over 20 years. All of America’s weathe, and much of the globe has been manipulated, and is controlled. When California runs dry, it will cause a large designed population shift out of the State. Many farmers will quit due to lack of crop water. (Actually this is a ready happening to my own family). My Granddaughter just moved out of California with her husband and family. Her husband has lived in Cal. all his life. Now they live in Washington State (great for us). \\nThis move out of California by the masses will allow big GMO food corporations to come in and buy up huge rich farming lands for pennies on the dollar, and that will eventually result in huge increase in food prices. Once done, the Government powers controlling the weather patterns will attempt to restore the ground water tables and weather in the state. The end result, more for the Corporations, and control by Government of the people. Control the water and you control the food, control the food and you control the people……That’s the end result, and a very simple plan. Done gradually so as to fool the masses, although it doesn’t look very gradual to me if you look at the results of moving the weather toward the Eastern half of America. why bother \\nThe problem is “we the people,” reproducing to create much more of us. Add to that the hideous large stucco boxes. And the fallacious idea that our houses and quality of life either will keep improving or at least stay the same, forever. Then I say: Detroit. The number one reason against planning on staying in any one community for a generation is the Detroit example. It can happen anywhere. I like the song “Tom Sawyer,” by Rush for many reasons. But one of my favorite lines is appropriate here. “He knows changes aren’t permanent but change is.” So if you cannot expect living conditions to remain idyllic for more than twenty years then why should someone buy California real estate? A Dodgy Bloke \\nOnly an American would think of putting a water fountain in a desert. As I said several times the South West of the US was never designed to support this number of people. I was only a matter of time before the water ran out. Even if the wet period had continued it was only a matter of time before reality reared it’s ugly head. Now it California next it will Las Vegas, Phoenix, Reno so on. Walter Ruggieri \\nAs long as jobs are here, people will stay and they will import water or finally build a desalinization plant. But… once the jobs dry up and real estate prices drop, they will begin to move in mass. Maybe other states need to begin to develop California migration contingencies? David Wilson \\nTime to get serious, California. First thing I’d do right now is make lawns illegal, unless they’re made of plastic. And that includes parks, golf clubs and all those road side verges in suburbia. People should replace them with something more appropriate to a Mediterranean/semi-desert climate. If you don’t get radical now the economy could implode in a few years time if the drought continues and water supplies run out. Philip Botwinick \\nThe Israelis are also good at behaving towards the Palestinians much like the Germans/Nazis did towards the Jews prior to the implementation of the Final Solution in 1941. \\nCan Israel function without the funds from the USA, the Christian Right and many of the fearful Jews? No. \\nJust consider me a self hating Jew along the lines of Norman Finkelstein. Dan \\nThey will likely try to make any conservatives stay and then redistribute the liberals to all the swings states….. SMH2much \\nSo, where is the Calvary to rebuild our dams that were destroyed for the smelt? Richard \\n“Are you starting to understand the scope of the problem?” No, actually I’m not starting. I understood the problem a long time ago. How about a question for the likes of us? When you write those kinds of question, it just looks like fea-rmongering to me. The emotive, overwrought silly questions just assume we’re fools. We ALL know how serious this is. We don’t need to be asked if we’re “starting” to understand, thank you. Joel \\n“How about a question for the likes of us?”— Really? What about stopping using yourself as a reference of the good way of writing or speaking? Stop playing the Mother Teresa of the Grammar & Spelling World. Your comments are, as usual, out of context of the topic… you just want to show to all of us how great you are at using English… get over yourself. why bother \\nI work and rent in Orange County, California. I notice Irvine is all green still. Is the Irvine Company immune from the water rules? I am a legal resident in Arizona and I cannot imagine where Californians could afford to go. They need jobs. Their employers would have to move first before the Californians can move. For instance, the national HQ of Toyota moved from California to Texas. Some other big corporation (I am not at liberty to say) employing at least 10,000 people in California has been talking about consolidating in Texas out of California in five years. I am thinking the plans might move quicker than five years, because of the severe drought. I have a place to stay in Arizona, but no job there. I do have a lot of savings because I prepared for crises, and am 12 years from retirement. So I can sit out a few years and find some way to make money again after the drought finishes off what the socialists destroyed in California. Philip Botwinick \\nNot only is Irvine exempt, for the time being (I’m being sarcastic), but big ag and big oil are completely exempt (this I’m being serious about). \\nGot to keep those walnuts growing. Discipleof Jesus \\nAll those microchips and still don’t know how to design a viable de dalizination plant ? See what happens when you trust in man California ? Gwen Johnson Koskinen \\nWhen they have to migrate, maybe this time, when the Californians have to leave and go to Oklahoma, Oklahoma will welcome them with more hospitality than they were greeted with back in the 30s. MeMadMax \\nAh heck, mexico wants california back, let em have it….. \\nAs long as they get to keep all the libtards there too… \\n^.^ Elmo Fudginputz \\nWhy aren’t a series of pipelines already under construction to move water from the Great Lakes to California and other states being effected by drought? Call it the Interstate Drought System, similar to the Interstate Highway System. Is everybody in California just stupid? All that water in the Great Lakes, and golf courses in California will soon be brown. And the amount of fresh water in Canada is staggering. Somebody out there should try and business develop a solution. Philip Botwinick \\nYeah, that’s right. The Great Lakes where fertilizer run off have created an algae situation. \\nMy god where are the critical thinkers? Elmo Fudginputz \\nCritical thinkers? Well you aren’t one of them, notwithstanding your fantasy and personal problems. Algae situation? Almost all fresh waterer lakes have algae. Did you know most municipalities actually treat their water pathogens and impurities before sending it on to the public? They let folks like you over at Oaklawn sanitarium actually have access to computers? Briarpatch \\nCritical thinkers…………THAT’S rich coming from you! Dave Wilbur \\nThe solution for water in California. ALL accurate economic, gastronomic, medical, political and military thinking has to be based on government having unlimited funds while no money goes to Washington as taxes. How can this be? Nobel Laureate, Paul Samuelson said the Federal Reserve is an “omnipotent counterfeiter” and the Federal Reserve in 1977 and 1979 said their system “works only with credit.” They also said: “The Federal Reserve in cooperation with the federal government has the inherent power to create money. This power makes technical bankruptcy out of the question.” They should just create whatever amount of credit needed to build sufficient desalinization plants to convert sea water to drinking water without use of taxes. The facts stated here make continuous wars possible. Let’s stop the destructive wars and construct all of the pure water plants needed. Philip Botwinick \\nLike that’s really going to happen. \\nGet real. nobody \\nNice, you can’t even paste a working link. Nevermind, i found your source by myself. But unlike you i checked who they are and surprise surprise, they are one of the mouthpieces of the industry. So yea, about that source, time for a new one unless you still want to be seen as a gullible moron. May i suggest the official government statistics? BTW, i thought that the picture on my account would be enough to clarify its origin, apparently you aren’t smart enough for that. Oh well, nothing new here. Hart Shepherd \\nBecause we all know how accurate and honest government statistics are. nobody \\nYou probably don’t, but the rest of us do. Priszilla \\nCoors light is just like water, and cheaper too. Infidel51 \\nCalifornia is chock full of amoral liberal d-bags so maybe this is a cosmic smackdown. Guest \\nImmorality is not confined only to ‘liberals’, ffs. But yeah, imo CA’s getting some just dues for serious misdeeds. DC’s next. Philip Botwinick \\nHaving know Mike personally I’m well aware that he was not a supporter of LaRouche. \\nThere are no solutions. We in the midst of the Sixth Extinction event, and that includes the species known as humans. The window closed back in 1972 despite what propaganda you hear. \\nRemember, we’d need 5 other planets like earth to provide a lifestyle that the average American lives for everyone on the planet. \\nLook up Albert Bartlett on youtube as well as read Guy McPherson’s Climate Change Summary. We’re at over 40 feedback loops. \\nMike interviewed Guy numerous times and deferred to him on Climate Change issues. Philip Botwinick \\nYeah, that’s right Ken show how much like the Dulles brothers you are. You do know that we overthrew a democratically elected government in Iran in 1953. \\nMake this into a liberal/conservative issue. As if Nature gives a flying crap what you are. \\nCome back when your taps run dry and ask me if I’ll give you a drink from my well. I’ll be holding a weapon at the time so what will you offer me for a drink of cool, wet, refreshing water. \\nI’ll let you turn the other cheek. Perez Piedad \\nTake spanish lessons…water…. agua JulietteofOhio \\n“Moonbat” strikes again. Maybe this will save the U.S. by diluting the power of the Looney Left. How nice not to have to care about what California thinks, and I use the term loosely. Hart Shepherd \\nPhilip, followed the link and read the article. Seems like a valid reductionist point of view. However any dichotomy between free will and determinism is a false dichotomy at best as is all of existence. You just have to learn to take the good with the bad. As they say, every dying dog has it’s day. John Blythe \\nLet me tell you Michael about the situation in my home town of Lake Isabella which is just about 30 miles due northeast of Bakersfield, the most southern city in the central valley. Lake Isabella, once the largest lake in the southern California region with 40 miles of shoreline has become nothing but a puddle of water now. There are a few factors including the drought situation as well as the fact that the lake’s main dam has to be retrofitted for state earthquake seismic requirements, however the lake levels have had a huge damaging affect on the local economy. Lake Isabella (sometimes referred to as Kern Valley if you count all eight towns that surround the lake) was a nice rural area and a getaway destination for city folks in L.A., Orange County and the Inland Empire. People used to love to come up to the lake every summer to wind surf, boating, jet ski, fish, camp etc.. We’re also a popular tourist destination for European travelers because the lake is a gateway to the Giant Sequoia Tree Monument and Death Valley National Park which foreigners love to visit. \\nBut now all that has drastically changed. The valley recently had its annual Lake Isabella Fishing Derby (one of the largest trout derbies in the U.S.) and admissions were down substantially which they anticipated anyway and last summer was some of the worst on record for local businesses and it is no doubt going to be an even worse summer season come June. Because the rapid decline in tourism and recreation that feeds the local economy every year, we now have a bigger problem: drug addicts and criminals are moving into the area. Even worse, because of Kern County’s budget problems, Lake Isabella’s police force has been drastically cut. In the last year, people have had their property vandalized, homes that have been broken into, property stolen. \\nPeople who see the decline in tourism due to the lake level going down are now moving out of the area and their vacant homes they put up for sale are now being “moved in” by squatters and meth addicts, as Kern County has a major meth epidemic. As a result, real estate companies in Lake Isabella are loosing money on homes that were originally valued for the market. I can’t tell you how awful this has impacted a once quiet rural area and popular summer destination in Southern California. Its like Lake Isabella has become a ‘mini version’ of Detroit. Vacant homes are now decaying and crumbling, drug users are now out on the streets, we’ve had a larger influx of transients and obvious criminals from Bakersfield and Delano that were released due to State budget problems with the penal system recently; and businesses that have been here for decades are now closing and moving out. The local police and even media in Kern County are reluctant to admit this stuff, in fact the police department I think is so ashamed of what has been happening lately, they seldom even report some of the most obvious drug busts or arrests that should be reported in the local papers, but they don’t report, in fear of what the public would think. But the truth is, the public already knows what is really going on. Hart Shepherd \\nYou think California is on the Atlantic ocean and we’re stupid? Hart Shepherd \\nAl Gore is a douchebag. AGW is a myth. Yes, the climate changes but the primary driver is the sun’s movement around the periphery of the galaxy, and it looks more like we are heading for much colder temps than any of us have seen in our lifetimes. piccadillybabe \\nToo bad they did not get on the desalinization band wagon a long time ago. If they had, they would have developed technology that produced beautiful pure water, was energy efficient and affordable by now. In America, we are real good at wasting our resources without thinking about the future. Chuck \\nEveryone will eventually move out of california since they will will run out of all water. Hot Rain \\nI’ve been hearing this for 30 years. In Vegas we’re always “gonna run out of water”. It was just political BS. There has to be a clever way to raise food prices. And water prices. Unfortunately, food commodities are now traded and investors want returns. That, coupled with weather anomalies around the globe will make basic food unaffordable. The Feds know all of this, that is why they hold off on raising interest rates. When interest rates start going up, food will shoot the moon. As will everything else. Scared Economist \\nHave you taken a drive out to Lake Mead lately? Have you seen how low the water level is? And it’s dropping further by the day. Steve Hansen \\nPeople can move / migrate to another place, thats not the big problem! But California produce a lot of food they Export around the World… apeiron \\nCan’t the ocean water be de-salinized? Or is that one of those ideas that turn out to be more inputs than the output justifies? PaulPaterakis \\nJerry Brown is spending fifty billion dollars on a Bullet Train to Nowhere but California hasn’t built a new reservoir to conserve water in twenty years. \\nCalifornia dumps fresh water into the ocean to keep San Francisco Bay from getting too salty and making the Delta Smelt uncomfortable. \\nThis is a man-made disaster which has nothing to do with Global Warming. This is caused by liberal pressure groups electing incompetent liberal politicians. Andy Stunich \\nPerhaps desalination plants? Probably too expensive other than for residential water. Gay Veteran \\n“… I speak of separation of religion and state….” \\nsounds like you would feel right at home in Saudi Arabia. \\nbtw, YOU adopt any unwanted babies? Gay Veteran \\ninteresting how all those tornadoes hit the Bible Belt GSOB \\nThe Godly have a refuge when they die, but the wicked are crushed by their sins. Proverbs 14:12 \\nstill parroting those bible verses. \\nPolly want a cracker? Lazarovic \\nKentucky can take some, especially farmers. Kentucky can produce vegetables too, plenty of water in Kentucky. cactusue \\nCalifornia the once golden state created some of this through urbanization and illegal immigration growth through liberal policies. LA ran out of water in the early 1900’s but they kept building acquaducts and importing from the Colorado River as does Nevada and Arizona. This is the arid West and much inhabitable. In the end the earth always wins over mans folly. Rebel in Idaho \\nthey could go back to mexico and take the liberals with them. quercus454 \\nIt’s the numbers. Something that the politicians can’t seem to grasp. Immigration both legal and illegal is the driving force behind US population growth. Immigrants and their children are near 80% of California’s increase of people. For every new added person it takes during their lifetime the development of 25 acres of undeveloped land. Those acres include expansion of waste facilities, infrastructure /roads/schools, consumer outlets, food production and increased government facilities. As one does the math, the amount of land needed to support the additional people becomes staggering. Increased numbers also drive up the cost of other dwindling resources. Energy, water, food, taxes also increase. Services like healthcare become stretched beyond their capacity. The ability of the US to increase it’s population and sustain current levels of quality of life is impossible. California is the canary in the mine. If we do not stop the current rate of population growth, the US will see horrific conditions unheard of in this country before. Like a life boat, once filled to capacity, the addition of more people make conditions for everyone worse. Fat Hubie \\nSeal the border of California and force them to move to Mexico…! Can’t have the liberalism disease spreading….. Tara Connor \\nCalifornia CANNOT get water from OREGON. WE ALSO have a really bad drought, NO SNOW PACKS, NO SNOW this year, and not enough rain to grow our crops.Our farmers are desperate, BUT I recommend that drought states start to regularly SEED OVER CAST CLOUDS to get rain! START to use science on the weather! WE HAVE THE SCIENCE. They seeded over cast clouds in the past to get rain; do it again. Science is far enough ahead, we can fiddle with the weather; California needs to use it’s technology, and start getting rain, clouds, atmospheric changes and we KNOW the chemistry.Oregon in the Willamette Valley has much over cast clouds; make them rain! And CA, get your science companies to conjur up chemically made weather. It CAN be done. Tom \\nWhy doesn’t our government invest in plants that remove salt from ocean waters. Don’t some mid East countries already do this? DixieAngel_76 \\nI’ve got a few questions for Governor Moonbeam, Lynn Wilson and the UN; first off, why are we allowing in new immigrants when there’s not enough water for those of us who were here first? Second, will those people be the first to be made to leave, and will it be back over the border? Third, and most important is who gets to decide who leaves and who stays, and what happens to people who do not wish to leave their property behind? Fran \\nSend them to Mexico! Nicholi Hel \\nThe water situation should be exponentially worse in a few months as the mentally deranged politicians of California and this country allow a few million more Mexicans to swarm into the state. Nicholi Hel \\nDo you think Nancy Pelosi will be fined for wasting water while washing the feet of illegal immigrants? She can wash my backside and gargle with the water, spit it into a bowl, then have it filtered and sold off to LA for drinking water. F$%K California. Colin Nunn \\nI’m wondering if any of the brainiac politicians have ever heard the word ‘infrastructure’ and if they did, ever considered the resulting strain on resources of mass immigration in the millions? Hey, Government, like DUH!!! Jessy S. \\nThey can turn HARPP on and off on a whim. With that said, they tried getting water out to California, but that didn’t happen. Joe \\nI’m sure they’ll be coming to where the water is. HAARP \\nWhy doesn’t the U.S. Government implement the HAARP program for weather manipulation? HAARP \\nMake Mexico the 51st State! Randy Smith \\nGive it back to Mexico. Lyla cavanaugh \\nThe illegals are coming up here because there is a drought in Mexico. They won’t be going back. They will be moving north. Lyla cavanaugh \\nNo one will be leaving. The first thing is to stop all the high density housing that is being built. As soon as those new people turn on their taps and flush their new toilets its causing the situation to be worse for us all. Mary \\nMy concern is what happens to desperate people who will be forced to migrate east- no jobs, no money. What happens to the communities and infrastructure of peaceful and relatively crime-free towns as these people descend upon them? Let’s say only 10% leave Cali- that’s still almost 4 million people looking for a new place to live. Who will leave- the richest or the poorest? What happens when a half million dollar home is now worth nothing? \\nI imagine the poor have the least to lose, will hop on the California Zephyr et al, and start being deposited across the rest of the US. drleonus \\nWhere are the savvy investors who will create the jobs needed to build three massive pipelines stretching across the country- this is a national problem after all – bringing snowmelt from the eastern seabboard, rain runoff from the midwest, and water from the Great lakes to dump all of it into the Lake Mead Sistern. The Pipelines will have giant logos on them, built from private investments funders: Koch Brothers, Google, Bill gates, Chevron,Netflix. Every state gets a chunk of the profits as the water passes through their states. Think of the billion of dollars invested and reaped from a massive project like this. Seems like a crazy proposition, no more crazy than a Las Vegas sucking up all the water to be an artificial city in the desert built on 1930’s hubris? O, and powering our homes with water? That’s go to stop immediately. Another 1930’s infrastructural by gone way of doing things. Thankyou. It is time to solve this and stop jawing about it. robert hutchens \\nLets face it, if there is a SEVERE water shortage and little drinking water, there will be chaos and riots. Anyone that says differently is living in a dream world. I havnt washed my car in three months, and YET I see MORONS washing their PRECIOUS car weekly! THOSE same morons will be the ones I TAKE from when the CHAOS and RIOTS hit. Stock up on Ammo AND firearms! MeJane \\nThe so called mega drought is being advanced by the very same people as the climate alarmism community, which we know is more of a hoax and political movement of taxation and control than science. I’d like to see the science used and I am sure it is “climate models”, which are predictions and not reliable “science” given the poor performance of climate models to date, we should be very skeptical of any climate modeling projections — and we certainly should not be basing any policy on the models. Plus a rainy winter \\nI say this because I live in So. Cal and we had not even heard of this drought until two years ago and when we did it hear about it was touted “suddenly” by our very liberal Governor as “the worst drought in history”. There is no doubt that the last four years had been dry but we’ve had other periods that had been just as dry and for much longer without the hysterical doom saying. If the drought was so severe was the why didn’t he insist on conservation when drought first began? Why is he NOT appropriating and supporting dam building that is already voted on as a priority over the idiotic and wildly expensive high speed rail if this were such a deadly emergency? Water is a necessity of life, railroads to nowhere are not, this does not add up. Plus we’ve had a rainy winter and spring, but there is never a dent in the drought? Why aren’t desalination plants going up, we are next to an ocean. Brown ordered mandatory water use reductions for the four year drought by 25 percent reduction on the state’s 400 local water supply agencies, the state’s agencies will be responsible for coming up with restrictions to cut back on water use and for monitoring compliance to enforce punitive measures, including FINES. Brown wants to fine big water wasters up to $10,000 per day. I have no problem with conserving and do so even when we aren’t in a drought but something is off here when for 4 years this has been a problem but not one plan other than conservation and fines in the fourth year of a mega drought has been addressed or will be addressed. This is about revenue, alarmist global warming BS, we’re in a drought, it is not the end of the world. Centurion53 \\nDeport the MILLIONS and MILLIONS of illegal aliens back to wherever the H e l l they came from. And while we’re at it deport, Obama and every Demo Rat politician and radical environmentalist who’ve been instrumental in Helping to create this disaster!! And for the rest of these Liberal/Progressive California fruitcakes….Stay out of MY STATE Let them all go to H E L L Athena Lis \\nthey better not come to texas. We like guns and our streets and highways are already littered with too many people that have no business being here.'"}, "time": 1742562595.6704278}