{"duration": 0.05833315849304199, "input_args": {"text": "'Email \\nAs Janet Reno formally ended her public career following her failure to win a primary for governor of Florida in 2002, she quoted George Washington about her legacy: “If I were to write all that down I might be reduced to tears. I would prefer to drift on down the stream of life and let history make the judgment.” \\nHer stream of life ended on Monday at age 78 when she passed away following complications from Parkinson’s disease. History will remember her for one thing: ordering the FBI to end the siege at Mount Carmel — the home of the Branch Davidians headed up by David Koresh — near Waco, Texas, by force, using tear gas and gunfire to end it, along with the lives of nearly 80 individuals including 25 children. \\nClinton nominated her for the position after two other women withdrew their acceptances, and she became attorney general in March, 1993. She was immediately thrust into the middle of the FBIs\\'s siege against the Branch Davidian compound that began after ATF agents were involved in a shootout while trying to serve arrest warrants on Koresh and his followers for alleged firearms violaions. After 51 days, the FBI asked for permission to attack the compound and end the siege. Reno granted it, 76 people died, and the event has remained a black mark not only on her legacy but on the history of federal law enforcement ever since. \\nFollowing the atrocity, Reno appointed former Senator John Danforth to look into charges that FBI agents started the fires, fired randomly into the building, and illegally used military forces to end the siege. When Danforth’s report exonerated the government and Reno, Koresh’s attorney called it a “whitewash” while former AG Ramsey Clark added, \"History will clearly record, I believe, that these assaults on the Mt. Carmel church center remain the greatest domestic law enforcement tragedy in the history of the United States.\" \\nFor her part, and to her credit claim some of her supporters, Reno took full responsibility for allowing the FBI to end the siege with prejudice: “I made the decision. I’m accountable. The buck stops with me.” \\nOver the following eight years, Reno was involved in other controversies: \\n• Investigations into President Clinton’s sexual dalliances with his intern, Monice Lewinsky; \\n• Her approval of the use of federal force to retrieve Elián Gonzalez, who was living with some relatives in Miami, and return him to his father in Castro’s Cuba, generating in the process a photograph of an armed federal agent seizing the six-year-old boy, providing millions with a visual warning of the dangers of the excessive use of force; \\n• The capture and conviction of Theodore Kaczynski, the Unabomber; \\n• The capture and conviction of Timothy McVeigh and Terry Nichols for their roles in the Oklahoma City bombing; \\n• The capture and conviction of Sheik Omar Abdel-Rahman and four other conspirators involved in the 1993 World Trade Center bombing; and \\n• Her roles in other controversies and scandals during the Clinton administration, including Whitewater, Filegate, the Chinese spying on American nuclear technology, the questionable campaign financing in the 1996 Clinton-Gore reelection campaign, and her support for the 1994 Brady Bill which, for ten years, banned so-called assault rifles. \\n\\nAn Ivy League graduate and former investment advisor, Bob is a regular contributor to The New American magazine and blogs frequently at LightFromTheRight.com, primarily on economics and politics. He can be reached at This email address is being protected from spambots. You need JavaScript enabled to view it. .  '"}, "time": 1742564611.9516795}