{"duration": 0.03970766067504883, "input_args": {"text": "'Posted on October 28, 2016 by Edmondo Burr in Health // 0 Comments A man diagnosed with cancer 50 years ago and told by doctors that he had not got long to live, drank wine to forget his sorrows and found that it saved his life and cured his cancer. \\n98-year old Stamatis Moraitis who had refused chemotherapy and expensive medical procedures for his lung cancer decades ago lived long enough to share his story. \\nHe even outlived his doctors before dying at the ripe old age of 100 from natural causes in 2013. \\nUnderground Reporter : \\nThere are now many studies proving chemotherapy can make cancer more malignant (deadly). \\nSome attest that chemotherapy and radiotherapy are both intrinsically carcinogenic treatments — so if a 98-year old man can live through a cancer diagnosis, without resorting to these treatments, what can we learn from him? \\nThe answer is surprisingly simple. \\nStamatis Moraitis was diagnosed with lung cancer in his 60s, and wanted his doctors to tell him how long he had to live. He was surprised by the diagnosis, but even more by the prognosis — that he was to live only six to nine months, according to medical ‘experts.’ \\nMoraitis hails from the Greek island of Ikaria, known as a place where people ‘forget to die,’ as they have such high longevity rates. He opted to forgo chemotherapy and other medications, not because this was the Greek way, necessarily, but because he considered funeral costs to be too exorbitant in the U.S. where he had moved in 1943 to seek treatment for a combat injury. Upon learning he had little time, he opted to return to his native Ikaria. \\nMoraitis simply continued to work, and drank two to three glasses of wine every day, waiting for his certain death. At about age 50, he started to question the doctor’s prognosis, and at 98 years of age he says, “ I’m no doctor, but I think the wine helped. I’ve done nothing else except eat pure food, [drink] pure wine, [take] pure herbs. ” \\nHis actions to cure his cancer are decidedly simple, but that’s what makes them so surprising. Americans have been taught to believe they need to spend thousands of dollars on chemotherapy drugs, and practically go into bankruptcy while also killing their healthy cells with chemo and radiation, instead of simply changing their lifestyle habits. \\nMoraitis is living proof that eating right, working in fresh air , and giving the body the proper nutrients — that scavenge free radicals and create an environment in which cancer cannot thrive — might be all it truly takes to live well and prosper. \\nMoraitis may not be a doctor, he quipped, but there are over 2,200 peer-reviewed scientific studies suggesting that his lifestyle was very conducive to his recovery. \\nInstead of spending more than $120,000 on pharmaceutical ‘cures’ which don’t necessarily work, he likely spent a few bucks every week on wine, fruit, and vegetables. He also happened to avoid the cost of an American funeral . \\nSo, in essence, he spent less to live, than to die at the hands of modern, Western medicine. \\n“ I found my friends in the village where I was born, and we started drinking. I thought, at least I’ll die happy, ” he said when first given his death-sentence.'"}, "time": 1742562483.8676996}