{"duration": 0.01581573486328125, "input_args": {"text": "'Aparece un Terminator del futuro para preguntar “qué cojones” hemos tocado SEGÚN DICE, HA TENIDO QUE SER ALGO QUE HEMOS HECHO EN LOS ÚLTIMOS DÍAS viajes en el tiempo \\nUn robot T-800 ha aparecido de la nada esta mañana en Estados Unidos con la intención de averiguar si la Humanidad ha hecho algo este 2016 porque el futuro se ha arruinado de golpe y no saben qué ha podido ocurrir, según han informado diversos medios estadounidenses. “Estábamos bien y de repente se ha jodido todo ahí delante”, ha declarado el robot en referencia al tiempo del que procede, el año 2056. \\n“La gente está como loca y el planeta es un páramo, ¿habéis hecho algo fuera de lo normal últimamente? Tiene que haber sido algo de hace dos días como mucho”, ha preguntado la máquina. Ha sido enviada por los hombres del futuro a fin de averiguar qué es lo que hemos podido modificar que ha cambiado el transcurso de la historia. \\n“La gente está flipando, en serio, ¿habéis inventado un robot súper destructivo? ¿Habéis tirado bombas? Creemos que quizá, probablemente sin querer, hayáis hecho algo gordo”, ha dicho el robot según diversos testigos que han podido hablar con él. \\n“¿Qué cojones habéis tocado?”, ha preguntado la máquina del futuro. \\nSegún ha explicado, es posible que a lo largo de este año la Humanidad haya tomado una serie de decisiones clave “que quizá parecen insignificantes y razonables” pero que han desencadenado una hecatombe en el futuro. “En mis tiempos estamos jodidos y ha pasado de golpe”, reitera la máquina. \\n“Pensad, tiene que haber algo que hayáis hecho”, ha insistido el autómata. \\nSegún las fuentes, el robot ha pasado unas horas repasando la prensa y, al acabar, ha exclamado “Ah coño, habéis votado a este” y se ha autodestruido.'"}, "time": 1742628566.3020015}