{"duration": 0.015711545944213867, "input_args": {"text": "\"By Gordon Duff, Senior Editor on November 4, 2016 Tabloid owner American Media agreed to pay $150,000 for story from 1998 Playmate of the Year, but hasn’t published her account with Bruce Willis MICHAEL ROTHFELD and LUKAS I. ALPERT \\nThe company that owns the National Enquirer, a backer of Donald Trump , agreed to pay $150,000 to a former Playboy centerfold model for her story of an affair a decade ago with the Republican presidential nominee, but then didn’t publish it, according to documents reviewed by The Wall Street Journal and people familiar with the matter. \\nThe tabloid-newspaper publisher reached an agreement in early August with Karen McDougal, the 1998 Playmate of the Year. American Media Inc., which owns the Enquirer, hasn’t published anything about what she has told friends was a consensual romantic relationship she had with Mr. Trump in 2006. At the time, Mr. Trump was married to his current wife, Melania. \\nQuashing stories that way is known in the tabloid world as “catch and kill.” In a written statement, the company said it wasn’t buying Ms. McDougal’s story for $150,000, but rather two years’ worth of her fitness columns and magazine covers as well as exclusive life rights to any relationship she has had with a then-married man. “AMI has not paid people to kill damaging stories about Mr. Trump,” the statement said. \\nMs. McDougal expected her story about Mr. Trump to be published, people familiar with the matter said. American Media didn’t intend to run it, said another person familiar with the matter. Ms. McDougal didn’t return calls for comment. \\nRead more at WSJ Related Posts: Afraid of What? The Woman Who Accused Trump of Raping Her at 13 Just Dropped Her Lawsuit The views expressed herein are the views of the author exclusively and not necessarily the views of VT, VT authors, affiliates, advertisers, sponsors, partners, technicians, or the Veterans Today Network and its assigns. LEGAL NOTICE - COMMENT POLICY Posted by Gordon Duff, Senior Editor on November 4, 2016, With 36 Reads Filed under WarZone . You can follow any responses to this entry through the RSS 2.0 . You can skip to the end and leave a response. Pinging is currently not allowed. FaceBook Comments \\nYou must be logged in to post a comment Login WHAT'S HOT\""}, "time": 1742628528.9816751}