{"duration": 0.13406848907470703, "input_args": {"text": "'The World Is Actually Becoming A More Peaceful Place Nov 17, 2016 0 0 Is it too good to be true? Is the world actually becoming more peaceful? With the advancement in technology and the rise of alternative media continuing to spread, we are now witness to many things we previously were not. With that, some might reject the statement that the world is becoming a more peaceful place, however, it is simply that we are now catching on camera and video some acts of violence that then spread on social and alternative media. We see that it is not that the world is becoming more hostile and violent, it is just that we are now catching these things on camera more than ever. As Harvard psychologist Steven Pinker says , “The news is a systematically misleading way of viewing the world.” In fact, there is statistical and real-world evidence to support the statement that the world is becoming a more peaceful place. As we can see in the image below, the amount of deaths around the world due to war has trended downward for quite some time, outside of the small uptick in the past couple years. Data comes the Peace Research Institute of Oslo. In his 2011 book, “ The Better Angels of Our Nature ,” Harvard psychologist Steven Pinker states that the decline of violence is, “the most significant and least appreciated development in the history of our species.” He also stated that between 1945 and 1990 there were 30 wars that killed over 100,000 people each, which included wars in Tibet, Uganda, Greece, China, Mozambique, Algeria and Guatemala. Pinker adds , “With the exception of last year’s small wars in Ukraine, the zone of war has contracted to a crescent from Central Africa through the Middle East into South Asia.” The Harvard psychologist also said that in his book, The Better Angels of Our Nature, he has proven statistically that other forms of violence has also declined, including murder, capital punishment, torture and domestic violence. In regards to violent war, it is happening in fewer places than what we might believe due to the media’s influence. Recent Examples of Peace In somewhat recent years, wars in Iran, Peru, Chad, Angola, Sri Lanka and Lebanon have ended, which is another positive and continuing trend. While it is on shaky grounds, there also still exists a ceasefire in Ukraine. Additionally, the Afghanistan government in late September signed a peace deal with Hezb-i-Islami, which is the first peace deal signed by the Afghanistan government since war with the Taliban broke out in 2001. In October, thousands of Palestinian and Israeli women marched together for two weeks on a peace march which they called March of Hope. The march ended in front of Israeli Prime Minister Benjamin Netanyahu’s home in Jerusalem, which was done in attempt to get peaceful dialogue started again between Israel and Palestine. Just a few weeks ago a United Nations resolution was passed in which 123 nations voted for (38 against) a ban on destructive nuclear weapons, which will be discussed starting in March of 2017. As Kate Hudson, the chairwomen for the Campaign for Nuclear Disarmament said, “It’s very encouraging to see so many countries say loud and clear it’s time for the world to move on from nuclear weapons.” Also, less than one week ago, the Colombian government and the FARC Rebels signed a revised peace treaty, which is ending a war that has been occurring there for over the past 50 years. What We Can Do As Dr. Martin Luther King Jr once said, “Those who love peace must learn to organize as effectively as those who love war.” Synchronized meditations is an easy way to effectively organize. One way to “effectively organize” is to participate in synchronized meditations, which is meditating with other people at the same time. Before this is dismissed as fantasy and wishful thinking, it must be remembered that group intention and synchronized meditation has been studied over 600 times, in 33 countries and by over 250 independent research institutions. The result of synchronized meditations has been labeled the “ Maharishi Effect .” It’s most notable study was when 7,000 individuals meditated over a period of three weeks each morning and evening, which lowered global terrorism by 72%. While it might sound unbelievable to some, in the fields of social science, social psychology and quantum physics, it is a very serious and respected topic. While there are numerous things we can do to cultivate more peace in our lives and the world around us, such as using non-violent communication, smiling more often, gardening, connecting with ourselves in a deeper way, or being more grateful, synchronized meditations are an extremely beautiful and powerful way for people to organize and create ripples of peace in the fabric of our world. What can you do in your life right now that creates more peace within yourself and with the world around you? Lance Schuttler graduated from the University of Iowa with a degree in Health Science-Health Coaching and offers health coaching services through his website Orgonlight Health. You can follow the Orgonlight Health Facebook page or visit the website for more information on how to receive health coaching for yourself, your friend or family member as well as view other inspiring articles.'"}, "time": 1742563139.1463246}