{"duration": 0.03142189979553223, "input_args": {"text": "'Democrats are reportedly fed up with Hillary Clinton’s litany of excuses for losing the 2016 election and are asking her to step out of the limelight. [The consensus among former Clinton aides, former Obama aides, and Democratic strategists is that Clinton’s remarks blaming the Democratic National Committee and others for her election loss are hurting her image and the image of the Democratic Party, the Hill reported.  “She’s apparently still really, really angry. I mean, we all are. The election was stolen from her, and that’s how she feels,” one longtime Clinton aide said. “But to go out there publicly again and again and talk about it? And then blame the DNC? It’s not helpful to Democrats. It’s not helpful to the country, and I don’t think it’s helpful to her,” the aide added. Former DNC Data Director Andrew Therriault was a lot less restrained in his criticism of Clinton, calling her accusations against the DNC “fucking bullshit. ” Clinton has also gone    blaming former FBI Director James Comey, the Russians, the press, her primary and general election opponents, and even sexism for her election loss. Some aides and strategists think Clinton needs to step out of the spotlight entirely and let new leaders in the party take up that role. “If she is trying to come across as the leader of the angry movement of what happened in 2016, then she’s achieving it,” said one former senior aide to Obama. “But part of the problem she had was she didn’t have a vision for the Democratic Party, and she needs to now take a break and let others come to the forefront. ” Despite those in the party calling on Clinton to leave the public eye, her aides and advisers say she will probably remain in the public spotlight to discuss the 2016 election to promote her book that will be released this fall. Democratic strategist Jamal Simmons says that she should talk more about where she went wrong in the election as opposed to blaming others for her elections. “It would be nice to hear a little more about the things she did wrong, which I believe mattered more than what she has discussed,” Simmons said.'"}, "time": 1742628509.0614662}