{"duration": 0.08167219161987305, "input_args": {"text": "'Former Breitbart News National Security Editor Dr. Sebastian Gorka, now a White House national security adviser, discussed the situation in North Korea with SiriusXM host Alex Marlow on Wednesday’s Breitbart News Daily. [Gorka said that “things have changed fundamentally” in the   impasse over North Korea’s nuclear weapon and ballistic missile programs, “because America is back, and because you have the master of the ‘art of the deal’ as the   . ”  “If you just look at the statements coming out of Beijing, if you look at the decision with regards to purchasing U. S. coal over North Korean coal, things have fundamentally changed,” he said. “North Korea is probably the most Stalinist state that has ever existed, probably more Stalinist than Joseph Stalin’s Soviet Union,” he elaborated. “As such, it’s simply economically unviable. As a result, it has been propped up by China for decades, but at this point after our recent decisions to act in Afghanistan and Syria, the regime in China is starting to reassess just how much it is in its national interest to maintain that client state in North Korea. That’s why this isn’t just the     news, Alex. ” Gorka said the usual national security debate lacks strategic sophistication. “That’s one of the reasons I came on board with Breitbart all those years ago, because the national security debate in D. C. and in general was just sophomoric. It was either you’ve got to be a neoconservative and invade other people’s countries, or you’ve got to be Ron Paul and you’ve got to be an isolationist,” he recalled. “Well, the world’s a little bit more complicated that that,” he contended. “This president is not an interventionist, but he understands that without leadership, without America showing the way the system should work, then we have anarchy, and we have bad actors exploiting the vacuums created. Nothing’s changed about Donald J. Trump. He’s not different since before the election, as opposed to being the president. But the fact is, without leadership in the world, you have the chaos that we inherited after the last eight years. ” Marlow professed initial skepticism of the missile strike on Syria as the gateway to further intervention, but said that if it proved to be an isolated “one and done” action, it sent an important message to the world’s bad actors. Gorka said both the Syria strike and the detonation of a huge MOAB munition in Afghanistan should be understood “not simply in terms of what we did physically on that day. ” “It’s not just about 59 cruise missiles, or that   bomb. It’s about the philosophy that statecraft, running the ship of state, can never be done purely based upon diplomacy and just words. If you’re not prepared to back it up with force  —   that doesn’t mean invading other people’s countries, but using force where necessary  —   then all it is, is just pieces of paper,” he said. “The president understands that all the levers of national power must be used together, if we are to secure America and the interests of American citizens. It’s much more than about that event. It’s about understanding what it takes to be America again,” said Gorka. Marlow cited Secretary of State Rex Tillerson’s statement that Iran is complying with the nuclear deal, and asked if this was an indication the Trump administration would not scrap the deal, as Trump said before the election. “No, I wouldn’t go that far,” Gorka replied. “Right now it means simply that there are certain aspects of the deal that are being held to, but the deal itself, and all U. S.  policy, is being reviewed right now. ” “Don’t read too much into that, because everything is on the table in terms of reviewing the JCPOA,” he advised, referring to the nuclear deal by its formal acronym. Responding to reports that the first illegal alien protected by President Obama’s Deferred Action for Childhood Arrivals program has been deported, Gorka said it was a question of reinforcing the rule of law. “We have incredibly clear language coming out of the Attorney General’s office himself, but listen to what General Kelly said as well: We have laws on the books. It is not   it is not divisive to actually implement those laws and make them real. If somebody doesn’t like that, we have a republic, we have a democratic republic. Those laws need to be changed, if you can change them. But right now, they’re going to be implemented, and that applies to anybody who is an illegal alien. Looking ahead to next month’s scheduled meeting between President Trump and President Recep Tayyip Erdogan of Turkey, Gorka expected them to discuss “all the obvious questions there are for common concerns to both countries,” including Syria, terrorism, and the Kurdish question. “There are no simple answers to any of those, but remember: if you just look at the history of the 20th Century, Turkey is a geostrategically important nation,” he said. “Geography is destiny. Look at the size of the country, look at where it is. So that meeting is an important meeting. ” Finally, with respect to Tuesday’s murders in Fresno by a man who professed to hate white people and shouted “Allahu akbar!” when he was captured, Gorka said he looks at the fact that “since the caliphate was declared by Abu Bakr   in 2014, we have arrested more than 130 people linked to ISIS in America. ” “This is not a joke. There is no front line in this war. The front line is when you leave your house in the morning. Unfortunately, this threat has been allowed to expand. We are going to take it seriously, and we are going to knock it on the head,” he promised. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a. m. to 9:00 a. m. Eastern. LISTEN: '"}, "time": 1742562994.74617}