{"duration": 0.11741852760314941, "input_args": {"text": "'Maybe it was the ski masks that did it. Or it could have been the steely look in the eyes of Lake County, Fla. Sheriff Peyton Grinnell as he deadpanned: “We are coming for you. Run. ” Perhaps it was the muted background music: an eerie melody that wouldn’t have been out of place in a Batman movie. In the end, what could have been an unremarkable public service announcement about opioid abuse in Lake County spread widely on the internet, garnering about a million views on the Facebook page of the sheriff’s office, where it was first posted Friday. It sparked concerns about police militarization and drew more than a few comparisons to Islamic State recruitment videos. But many residents of Lake County seemed to respond positively, thanking the sheriff for drawing attention to a deadly scourge that has altered communities beyond recognition. In the   clip, Sheriff Grinnell, who was elected in November, stood at a podium flanked by four deputies wearing black face coverings. The sheriff addressed his Lake County constituents, saying he was aware of the “serious issue” of heroin abuse in the area. He encouraged people to call the office with tips. He added: “To the dealers that are pushing this poison, I have a message for you. ” And the camera began to zoom in. The sheriff warned drug dealers that the police were waiting for some arrest warrants to be finalized. “Enjoy trying to sleep tonight, wondering if tonight’s the night our SWAT team blows your front door off the hinges,” he said. “We are coming for you. If our agents can show the nexus between you, the pusher of poison, and the person that overdoses and dies, we will charge you with murder. We are coming for you. Run. ” At the end of the video, Sheriff Grinnell and the four others walked offscreen in a silent, single file. “It makes the Lake County Sheriff’s Department look like they’re about to go to battle in Falluja,” said Ezekiel Edwards, director of the American Civil Liberties Union’s Criminal Law Reform Project. SWAT teams, he added, should be used only when there is an imminent threat to human life. “That video suggested that they are using SWAT inappropriately, and in a way that is going to escalate violence and danger to all involved. ” But Lt. John Herrell, a spokesman for the sheriff’s office, said responses from residents had been positive. “I would say that the critics are off the mark and have missed the whole point of the message,” he said. “The sheriff wanted to let the community know that he’s aware of this problem. ” Lt. Herrell added that the video’s tough tone was aimed at dealers, not addicts. And as for the men in black masks, he explained: “They are undercover deputies, and state statutes require that their identities be protected. ” Kim Mousette, 52, said it was time for the police to take a tougher approach to heroin abuse in the county. She said her neighborhood in Pine Lakes, once a quiet refuge, had lately become a haven for drug users where people no longer felt safe leaving their doors unlocked. “We were in one of the most pristine, protected areas of Florida, and now this is going on,” she said in a phone interview. “You could be walking along and have a syringe go through your foot. ” Ms. Mousette, who said the police had largely been unresponsive to complaints, voted for Sheriff Grinnell last year. Now, she feels she made the right choice. “I was very happy to see that video,” she said. Heroin abuse surged in Lake County after Florida’s state legislature cracked down on loosely regulated pain clinics  —   known as “pill mills”  —   in 2011, said Lt. Herrell. As a result, people lost easy access to prescription drugs like OxyContin and turned to heroin. The opioid scourge is national in scope the Centers for Disease Control and Prevention found that nearly 13, 000 people died of heroin overdoses across the country in 2015, up 20. 6 percent from 2014. Audrianna Nicole Boone, 27, watched family members suffer from addiction in her hometown, Lady Lake. She moved to North Carolina in 2012, and has long felt that the Lake County police never did enough to fight opioid abuse. “When I see this video, it’s kind of like the sheriff’s office declaring war on the drug addiction and the criminals,” she said. “I love it, and I hope it continues to go viral. ” Still, she added, the video was only a starting point. “Instead of arresting these people for the drug use, how about enacting some type of system that helps these people get clean and reintroduces these people to society?” she said. As the clip began to find audiences across the country, it encountered sharper criticism. Some compared it to Islamic State recruitment videos, which often feature militants wearing black ski masks. Others poked fun at the melodramatic production. Still others said it was a clear case of an   of police forces across the United States. Mr. Edwards of the A. C. L. U. acknowledged that opioid addiction was a serious issue in need of redress  —   but not like this. “Even though it’s just one local video, it does, in a very short amount of time, encapsulate much of what is wrong with policing today: militarization, using force inappropriately, and continuing to fight a drug war that has proved to be a failure,” he said. Some in Lake County agreed. “It’s a good example of how overly militarized police in the U. S. are,” said Robert Vibert, 35, who lives in the town of Tavares, where the county sheriff’s office is. He said he found the video overly dramatic, as if Sheriff Grinnell were trying to make a name for himself. “I’m sure he means well, but his approach is lackluster and a waste if he doesn’t tackle the totality of the problem,” Mr. Vibert said. “Without attacking supply lines, and helping addicts and users get clean, it won’t ever really solve the problem. ”'"}, "time": 1742562268.1157696}