{"duration": 0.17831039428710938, "input_args": {"text": "'Readers who picked up The New York Times on March 13, 1852, might have seen a small advertisement on Page 3 for a serial tale set to begin the next day in a rival newspaper. “A RICH REVELATION,” the ad began, teasing a rollicking story touching on “the Manners and Morals of Boarding Houses, some Scenes from Church History, Operations in  . ,” and “graphic Sketches of Men and Women” (presented, fear not, with “explanations necessary to properly understand what it is all about”). It was a less than tantalizing brew, perhaps. The story, which was never reviewed or reprinted, appears to have sunk like a stone. But now comes another rich revelation: The anonymously published tale was nothing less than a complete novel by Walt Whitman. The   “Life and Adventures of Jack Engle,” which was discovered last summer by a graduate student, is being republished online on Monday by The Walt Whitman Quarterly Review and in book form by the University of Iowa Press. A   tale of an orphan’s adventures, it features a villainous lawyer, virtuous Quakers,   politicians, a sultry Spanish dancer and more than a few unlikely plot twists and jarring narrative shifts. “This is Whitman’s take on the city mystery novel, a popular genre of the day that pitted the ‘upper 10 thousand’  —   what we would call the 1 percent  —   against the lower million,” said David S. Reynolds, a Whitman expert at the Graduate Center of the City University of New York. But it also, Mr. Reynolds and other scholars who have seen it say, offers clues to another mystery: how a workaday journalist and mostly conventional poet transformed himself into the author of the sensuous, philosophical, wildly experimental and altogether unclassifiable free verse of “Leaves of Grass. ” “It’s like seeing the workshop of a great writer,” said Ed Folsom, the editor of The Walt Whitman Quarterly Review. “We’re discovering the process of Whitman’s own discovery. ” That transformation was one that Whitman himself wished to obscure. He said little about the early 1850s, when he hung a shingle as a carpenter in Brooklyn and published almost nothing, working instead on what became the 1855 first edition of “Leaves of Grass. ” Later, he all but disowned his successful 1842 temperance novel “Franklin Evans or The Inebriate,” and had little interest in seeing his short fiction revived. “My serious wish,” he wrote in 1882, “were to have all those crude and boyish pieces quietly dropp’d in oblivion. ” In 1891, when a critic was planning on republishing some of his early tales, he was blunt: “I should almost be tempted to shoot him if I had an opportunity. ” That doesn’t faze Zachary Turpin, the graduate student at the University of Houston who found the “Jack Engle. ” In fact, this is the second time archival lightning has struck Mr. Turpin. Last year, he announced the discovery of “Manly Health and Training,” a previously unknown     treatise that Whitman published in The New York Atlas in 1858. “A friend joked that that’s what would be on my gravestone,” Mr. Turpin said. The library of lost American literature includes many “known unknowns,” as Mr. Turpin put it (channeling Donald H. Rumsfeld) like Herman Melville’s “The Isle of the Cross” (the eighth and final novel he may, or may not, have finished) and Whitman’s “The Sleeptalker,” a seemingly completed 1850 novel he discusses in his letters, but which does not survive. Mr. Turpin has made a specialty of looking for the “unknown unknowns,” using vast online databases that compile millions of pages of   newspapers. One day last May, he entered some names and phrases from fragmentary notes for a possible story concerning an embezzling lawyer named Covert and an orphan named Jack Engle  —   one of many entries in Whitman’s voluminous notebooks that the online Walt Whitman Archive had deemed to have no clear connection to any known published material. Up popped the advertisement that included the name Jack Engle. The serial was to run in The Sunday Dispatch, a New York paper Whitman was known to have contributed to. “My   was really tingling,” Mr. Turpin said. Mr. Turpin ordered a scan of the first page from the Library of Congress, which held the only known (and as yet undigitized or microfilmed) copy of that day’s Dispatch. A month later, he was stunned to open a file showing a yellowing page containing “Jack Engle” and other names from Whitman’s notes. “I was at my  ’ setting up a Pack ’n Play, when the email arrived,” he recalled. “From that day until now, I’ve had this simmering inside me. ” The   tale, published in six   installments, may not belong in the American literary canon. “It’s not a great novel, though it’s not a bad read either,” said Mr. Reynolds, the author of “Walt Whitman’s America. ” Mr. Turpin called it “rollicking, interesting, beautiful, beautiful and bizarre,” with antic twists, goofy names and suddenly revealed conspiracies that recall “a   Thomas Pynchon” or even, he ventured, “It’s a Mad, Mad, Mad, Mad World. ” This may sound a long way from “Leaves of Grass. ” But Jack Engle and the other raffish young male characters, Mr. Reynolds said, are reminiscent of the     persona  —   “Walt Whitman, an American, one of the roughs”  —   he created with “Leaves of Grass. ” And then there’s Chapter 19, which Mr. Folsom called “a magical moment. ” Here, Jack enters the cemetery at Trinity Church in Lower Manhattan, and the madcap plot grinds to a halt in favor of reveries about nature, immortality and the oneness of being that strikingly echo the imagery of Whitman’s great work. “Long, rank grass covered my face,” says Jack, the   narrator. “Over me was the verdure, touched with brown, of trees nourished from the decay of the bodies of men. ” Jack wanders among those bodies of men, copying out the inscriptions of the tombstones of Alexander Hamilton, the War of 1812 hero Capt. James Lawrence (of “Don’t give up the ship!” fame) and other lost lives. Then, he exits onto the streets, where “onward rolled the broad, bright current”  —   and quickly and rather indifferently wraps up his own story. “Throughout the novel, you constantly see Whitman wandering off the plot, looking for life in all the nooks and crannies of the city,” Mr. Folsom said. “With the visit to the cemetery, where all plots end, it’s as if he’s suddenly lost interest in all plots  —   or at least this plot. ” Today, we think of the radically expansive free verse of “Leaves of Grass,” with its wandering “I” who “contains multitudes,” as one of the fixed signposts in American literary history. But in his notebooks from the early 1850s, Mr. Turpin noted, Whitman was toying with other forms for his great work. “You see him asking, Should it be a novel? Or a play, with thousands of people onstage, chanting in unison?” he said. “It’s amazing to think that ‘Leaves of Grass’ could have taken a different form entirely. ” Mr. Turpin said the graveyard chapter put him in mind of “Crossing Brooklyn Ferry,” one of the most famous poems in “Leaves of Grass,” where Whitman declares, “I am with you, you men and women of a generation, or ever so many generations hence. ” But when asked how it felt to be the first in many generations to read Whitman’s   novel, Mr. Turpin reached for another   line. “Whitman said something really great: ‘Nothing is ever really lost, or can be lost,’” he said. “You really do start to believe it after a while. ”'"}, "time": 1742562566.4120238}