{"duration": 0.20839643478393555, "input_args": {"text": "\"Judge warns of dangers of appointed judiciary 'Unelected and unaccountable' ... rule on 'their empathetic feelings' Published: 5 mins ago Bob Unruh About | | Archive Bob Unruh joined WND in 2006 after nearly three decades with the Associated Press, as well as several Upper Midwest newspapers, where he covered everything from legislative battles and sports to tornadoes and homicidal survivalists. He is also a photographer whose scenic work has been used commercially. Print \\nA member of the increasingly divided and disputatious Alabama Supreme Court is warning that judges need to be elected and thus accountable to the voters or their decisions end up being based on “their empathetic feelings” instead of the law. \\n“Alabama’s judges are elected and accountable,” wrote Justice Tom Parker this week. “Federal judges, as recently noted by Chief Justice Roberts in his dissent in Obergefell v. Hodges … a case in which ‘five lawyers’ on the United States Supreme Court announced a fundamental right to same-sex marriage, are ‘unaccountable and unelected.’ \\nHe pointed out that three of the four dissenting U.S. Supreme Court justices in Obergefell “noted on eight different occasions that the ‘five lawyers’ who decided Obergefell were unelected. Chief Justice Roberts said on two occasions that those unelected ‘five lawyers’ were, consequently, unaccountable.” \\nParker previously commented that the “five lawyers” failed to “base their decision ‘on legal reasoning, history, tradition, the court’s own rules, or the rule of law, but upon the[ir] empathetic feelings.'” \\n“Obergefell is the product of unelected and unaccountable judges,” he said. \\nHe was arguing over a decision by the state court on its next move in a case brought by Chief Justice Roy Moore, who was suspended for his actions regarding a marriage-based case that the court was reviewing when the Obergefell case, which created same-sex “marriage” nationwide, was announced. \\nMoore, who is challenging the punishment, insisted that the state court justices who previously were involved in his case recuse themselves. They did, with the exception of the acting chief justice who was allowed to work with the governor to pick a panel of retired judges to hear Moore’s arguments. \\nParker said active judges should have been included in the panel, because retired judges, too, are “unelected and unaccountable.” \\n“Unelected and unaccountable judges are empowered to impose their agenda, instead of faithfully applying the rule of law,” Parker warned. “Obergefell is not the first case concerning same-sex marriage to prove this principle true. Before the United States Supreme Court decided Obergefell, the constitutionality of state laws defining marriage as between one man and one woman had been litigated before numerous courts throughout the United States. \\nDon’t miss Phyllis Schlafly’s book, now available autographed at the WND Superstore: “Who Killed The American Family?” \\n“Before Obergefell, 40 states passed laws affirming traditional marriage. In 37 of those states, the traditional marriage laws were challenged in the courts as unconstitutional. Of the 37 state laws affirming traditional marriage that were challenged in the courts, 24 of those laws were struck down by the judiciary as unconstitutional. Each of the 24 courts that struck down the traditional marriage laws as unconstitutional was composed of judges who were unelected and thus unacountable.” \\nHe explained what happens when activist judges are held to account, citing the situation that developed in Iowa. \\n“The Supreme Court of Iowa was one of the unelected courts that struck down Iowa’s traditional marriage law as unconstitutional. The judges of the Supreme Court of Iowa are appointed by the governor of Iowa. However, although the judges are initially appointed, they must stand for retention elections once their initial term expires.” \\nHe explained that after the Iowa Legislature adopted one-man-one-woman marriage as law, in April 2009, in “a decision largely viewed as judicial activism, the Supreme Court of Iowa unanimously overruled the democratic will of the people of Iowa and held [the law] unconstitutional.” \\n“The very next year, three of the judges … who had concurred in Varnum had to stand for a retention election; all three were removed from office by vote of the people of Iowa. This was the first time since Iowa adopted its retention-election system that any judge had ever failed to be retained. The people of Iowa held accountable those judges who failed to uphold the rule of law.” \\nMathew Staver, chairman of of Liberty Counsel, which is representing Moore, said huge questions remain of impropriety regarding the judicial system’s handling of Moore’s case. \\n“Chief Justice Moore is merely asking for the same thing any citizen is entitled to receive – equal justice under the law. He wants his case to be heard by an objective and fair panel of judges who will adhere to the rule of law,” he said. \\n“The people of Alabama have increasingly called upon their judges to be accountable. At every turn, this case presents new twists and turns that have never occurred in the history of Alabama. Never has there been a requirement that replacement judges all be retired. We hope this case moves quickly to a final and just resolution. The Court of the Judiciary violated the law when it suspended Chief Justice Moore for life even though it lacked the 9-0 vote. Never before under the unanimity requirement of COJ Rule 16 has any judge ever been suspended for the rest of the term. A sexting judge gets six months and a judge who writes a four-page order that is not unethical or unlawful gets suspended for life. This is not right.” \\nSupporters of Moore also have filed an ethics complaint against Lyn Stuart, who has been acting as Alabama’s chief justice. \\nShe is accused of “violating multiple cannons of ethics in her mishandling of the cases surrounding Chief Justice Roy Moore.” \\nThe complaint comes from the Sanctity of Marriage Alabama organization. \\n“If the Judicial Inquiry commission really cares about ethics, fairness and upholding the integrity and impartiality of the Alabama judiciary, they will no doubt take our complaint seriously, as will organizations which filed ethics complaints on Chief Justice Moore,” said Tom Ford, a spokesman for the group. \\nThe complaints, the group said, outline “how acting Chief Justice Lyn Stuart has repeatedly failed to avoid impropriety or the appearance of impropriety, failed to perform the duties of her office impartially, failed to avoid conduct prejudicial to the administration of justice that brings the judicial office into disrepute, and failed to conduct herself at all times in a manner that promotes public confidence in the integrity and impartiality of the judiciary.” \\nParker was not the first to cite the dangers of the judiciary. \\nDaniel Horowitz , senior editor at Conservative Review, told WND that the nation is going through a “social transformation without representation.” \\n“It is the unelected branches of government that are deciding our most important issues, whether it’s the bureaucrats, whether it’s the courts, and as it relates to even religious liberty, even property rights, immigration, our voting rights, who gets to vote,” he said. \\nHorowitz tackles the topic of “social transformation without representation” in his book “Stolen Sovereignty: How to Stop Unelected Judges From Transforming America.” \\n“How did we get here?” Horowitz asked rhetorically. “And the sad reality is nobody ever voted for this. This was all foisted upon the people by unelected judges, the legal profession, and unelected bureaucrats. That is social transformation without representation, which, as Scalia warned, is something much worse than even taxation without representation that served as the impetus for our first American Revolution.” \\nSame-sex marriage was mandated for the nation in 2015 by the bare 5-4 majority made up of Anthony Kennedy, Ruth Ginsburg, Stephen Breyer, Sonia Sotomayor and Elena Kagan. John Roberts, Clarence Thomas, Samuel Alito and the late Antonin Scalia opposed it. \\nThe majority found in the Constitution a right to same-sex marriage, overturning millennia of established legal precedent regarding marriage as well as the will of tens of millions of voters in dozens of states. \\nIt elicited remarkably harsh criticism of the five justices in the U.S. Supreme Court majority. \\nFor one, two of the justices in the majority, Kagan and Ginsburg, were asked to recuse themselves from the case because they had openly advocated for same-sex marriage, apparently violating standards to preserve judicial impartiality. Without their votes, the case would have gone the other way. \\nThey refused. \\nThen there was the U.S. Supreme Court’s own opinion just two years earlier, in the Defense of Marriage Act case, in which the court said states have exclusive power over marriage. \\nAnd there also are those who point out that the Constitution doesn’t mention marriage but does dictate that everything not mentioned in the document is left to the states and the people. \\nAs WND reported , Ginsburg, who voted in favor of same-sex marriage, has performed same-sex wedding ceremonies and made supportive public statements. Justice Elena Kagan also has performed same-sex weddings and promoted “gay” rights at Harvard’s law school while she was at its helm. \\nCritics contend the two justice appear to be violating judicial ethics rules that require recusal from a case in which there is even the appearance of a conflict of interest. \\nThe Foundation for Moral Law asked the justices to excuse themselves from the case, but they refused to acknowledge the request. The Foundation explained that Canon 3A(6) of the Code of Conduct for United States Judges provides: “A judge should not make public comment on the merits of a matter pending or impending in any court.” 28 U.S.C. sec 455(a) mandates that a justice “shall disqualify himself in any proceeding in which his impartiality might reasonably be questioned.” \\nRabbi Jonathan Cahn, author of the New York Times bestseller “The Harbinger” and the inspiration behind the “Isaiah 9:10 Judgment” movie, has criticized the Supreme Court’s assumption that it has the authority to redefine marriage. \\nAt a prayer event in Washington, he said: “The justices of the Supreme Court took up their seats [in a hearing] on whether they should strike down the biblical and historic definition of marriage. That the event should even take place is a sign this is America of [George] Washington’s warning … a nation at war against its own foundation.” \\nWashington warned the smiles of heaven can never be expected on a nation “that disregards the eternal rules of order and right which heaven itself hath ordained.” \\n“Justices, can you judge the ways of God? There is another court and there is another judge, where all men and all judges will give account,” he warned. \\n“If a nation’s high court should pass judgment on the Almighty, should you then be surprised God will pass judgment on the court and that nation? We are doing that which Israel did on the altars of Baal,” he said. \\nSee Jonathan’s Cahn’s message at Washington: Man of Prayer event at the Capitol. \\nThe United States Conference of Catholic Bishops is calling “same-sex marriage” an “intrinsic evil.” \\nAnd officials from several counties in Tennessee have adopted statements opposing the Supreme Court. \\nWND also reported when dozens of top legal scholars from the likes of Washington & Lee, Boston College, Kansas State, Notre Dame, University of Texas, Villanova, Vanderbilt, Hillsdale, University of Nebraska, Catholic University and Regent University issued a statement encouraging all state and federal officials to treat the Supreme Court’s recent creation of “same-sex marriage” as “anti-constitutional and illegitimate.” \\n“It cannot … be taken to have settled the law of the United States,” said the statement from the American Principles Project . \\n“We call on all federal and state officeholders: To refuse to accept Obergefell as binding precedent for all but the specific plaintiffs in that case. To recognize the authority of states to define marriage, and the right of federal and state officeholders to act in accordance with those definitions. To pledge full and mutual legal and political assistance to anyone who refuses to follow Obergefell for constitutionally protected reasons. To open forthwith a broad and honest conversation on the means by which Americans may constitutionally resist and overturn the judicial usurpations evidence in Obergefell.”\""}, "time": 1742564395.7781966}