{"duration": 0.06314682960510254, "input_args": {"text": "'Donald J. Trump has faced a chilly reception from the Republican Party’s major donors: Some of the party’s most generous benefactors have said they are undecided about supporting him, while others have flatly said they will never give to his campaign. We found more than a dozen donors who have given millions to Republicans who say they will not give money to Mr. Trump. They explained why, through interviews, emails, their representatives or associates. Who He Is: New   investor, gave big to John Kasich Why He Matters: Has given about $1. 9 million to Republicans since the 2012 campaign, embodies Wall Street’s distrust of Mr. Trump Why He Won’t Donate: “Not sure why anyone would give money to Mr. Trump since he asserts he is worth $10 billion. ” _____ Who He Is: Florida health care investor, gave big to Jeb Bush Why He Matters: One of the most prolific donors in a key swing state, has given more than $4 million to Republicans in recent elections Why He Won’t Donate: He took out newspaper ads during the primaries comparing Mr. Trump to Hitler and Mussolini. He said he would donate to Mr. Trump “when hell freezes over,” adding, “Oh no, but is that not where he resides?” _____ Who She Is:   of Herschend Family Entertainment, a     company, had been an enthusiastic supporter of Mike Huckabee Why She Matters: Has given over $1 million to Republicans Why She Won’t Donate: She said that Mr. Trump had degraded politics. “I’m just very disappointed in our whole country,” she said. “Our company is built on families, making people happy, and we just go down lower and lower every day. ” _____ Who He Is: Missouri businessman, runs Tamko Building Products, a roofing company, former Marco Rubio supporter Why He Matters: Has given about $2. 8 million to Republicans, part of a group of Midwestern business executives who have traditionally been generous with conservative presidential candidates Why He Won’t Donate: “I just can’t see myself supporting his announced positions on immigration and foreign policy  —   at all,” he said. “The whole idea of building a wall and shutting down the border is absurd. ” _____ Who She Is: New   investor, strong supporter of the Club for Growth, a conservative advocacy group Why She Matters: Has given about $3. 3 million to Republicans in the last few elections, part of a group of ideological donors who distrust his policies Why She Won’t Donate: “I don’t think he’s very conservative. ” _____ Who He Is: Boston finance executive, C. E. O. of the Baupost Group, donated to Mr. Bush, Mr. Rubio and Chris Christie Why He Matters: A leader in the   world, has donated about $5. 5 million to Republican candidates and causes since the 2012 campaign with his wife, Beth Why He Won’t Donate: His spokeswoman said simply that he would not donate to Mr. Trump in the general election  —   or even vote for him. _____ Who He Is: New York finance executive, founder of CAM Capital, former Bush and Christie supporter Why He Matters: Has given Republicans over $3 million, said that a Trump versus Clinton race presented an unappetizing choice Why He Won’t Donate: “I believe his boorish behavior throughout the campaign suggested to me that he did not have the character to be president. ” _____ Who He Is:   investor, supported Mr. Bush Why He Matters: Has given over $3 million to Republicans since the 2012 race, one of    West Coast donors that national Republicans have typically relied on Why He Won’t Donate: He said he considered Mr. Trump such an unacceptable candidate that he would vote for Hillary Clinton instead. _____ Who They Are: He’s a founder of TD Ameritrade, a   online   company. Why They Matter: He has spent nearly $30 million in federal races since the 2012 campaign with his wife, Marlene, largely through their “super PAC” Why They Won’t Donate: They spent heavily against him in the primary and associates say they will sit it out this fall. Mr. Trump threatened the family when they opposed his campaign, writing on Twitter, “They better be careful. ” _____ Who He Is: Head of the New   hedge fund Elliott Management, known for his hawkish foreign policy views and support for gay marriage Why He Matters: Has directed almost $28 million to Republican candidates and causes over the last three elections, backed Mr. Rubio Why He Won’t Donate: He said in a recent speech that neither Mr. Trump nor Mrs. Clinton represented his conservative values, calling this a “bleak time in the political life of America. ” _____ Who He Is: Arkansas biotechnology executive, chairman of the Club for Growth, a conservative group that spent heavily against Mr. Trump in the primaries Why He Matters: Has given about $3 million to conservative and Republican candidates and causes in the last few elections, a leader among the country’s most ideologically conservative political donors with his brother, Warren Stephens Why He Won’t Donate: “Unless the Club endorses Donald Trump, I will not be giving to him. ” _____ Who He Is: Connecticut investor Why He Matters: Has given nearly $5 million to Republicans at the federal level since 2014, said he would not only avoid giving to Mr. Trump, but that he might actually give to Mrs. Clinton  —   potentially a major defection Why He Won’t Donate: “He is too selfish, flawed and unpredictable to hold the power of the presidency,” he said. _____ Who He Is: Libertarian investor,   of Susquehanna International Group, former Rand Paul supporter Why He Matters: Has given $3. 5 million to Republicans in recent elections, prominent in groups that favor small government Why He Won’t Donate: He said a choice between Mr. Trump and Mrs. Clinton was a   situation, paraphrasing Simon and Garfunkel: “Anyway you look at it you lose. ” Source for donation data: The Center for Responsive Politics and the Federal Election Commission'"}, "time": 1742628473.752387}