{"duration": 0.03197669982910156, "input_args": {"text": "'Friday on MSNBC’s “Morning Joe” House Minority Leader Rep. Nancy Pelosi ( ) said when Republicans voted for President Donald Trump they were voting a “certain way,” almost like “any mammal will do. ”  When asked if Trump was a dealmaker, Pelosi said, “I will give you this as an example, the first meeting we had, House and Senate, Democrats and Republicans leadership in the White House, this is a big deal. I mean it feels you with some pride to have a seat at the table and a new president, I have been at that meeting with President George W. Bush as a leader and same thing with President Obama, and now here we are with a new president. The first thing he says, ‘You know I won the popular vote.’ Well, I thought since he’s being unconventional so will I. Because I was respectful with President Bush and we worked closely with him  —  ” Joe Scarborough interjected, “I bet you are missing him now? Pelosi replied, “He told me I would. He said, ‘You’re going to miss me.’ That was a long time ago. I wish he were president now. I wish Mitt Romney were president. I wish John McCain were president. As far as the Republicans, the people that voted, it’s almost like any mammal will do. They were just voting a certain way. ” She continued her story, “When he said that, I said, ‘That’s not true, there is no evidence to support what you just said.’ If we were going to work together, we have to stipulate to a certain set of facts. When we work with President Bush or when we work across the aisle, we all have to start at a place where we are dealing with facts, evidence, and data and you can compromise. You cannot make things up. He said, ‘Well 3 or 4 million people voted illegally.’ I said, ‘Well, that’s not true.’ And he said ‘and I am not counting California.’ That was pretty sad because he didn’t understand his place in history. ” Pelosi also said Trump does not sleep enough, adding, “I’m concerned about his fitness for office. ” Follow Pam Key on Twitter @pamkeyNEN'"}, "time": 1742628424.6765723}