{"duration": 0.17940974235534668, "input_args": {"text": "'The key concerns of Russian foreign policy heading into 2017 RD Interview: Chatham House expert James Sherr explains how a variety of global crises, particularly in the Middle East and Ukraine, are impacting Russian foreign policy RD Interview: Chatham House expert James Sherr explains how a variety of global crises, particularly in the Middle East and Ukraine, are impacting Russian foreign policy. One big variable to consider: the results of elections in the U.S., France and Germany. \\n\\nRussian Foreign Minister Sergey Lavrov in Athens, on Wednesday, Nov. 2, 2016. Photo: AP \\nMajor international actors are currently preoccupied with all kinds of regional crises: crises in the Middle East – including Syria , Iraq, Yemen and Libya, the rise of radical extremism, the refugee crisis , the crisis of European integration after Brexit and the rise of right-wing political parties in Europe. Moreover, the situation is exacerbated by the ongoing tensions between Russia and the West, which could take on a new dimension after elections in the U.S., France and Germany.\\nWith that in mind, Russia Direct talked with James Sherr , an associate fellow and former head ;of the Russia and Eurasia Program at the Royal Institute of International Affairs (Chatham House), about the possibilities for a change in Europe’s Russia policy, the prospects of the Minsk agreements and Russia’s aims in Syria.\\nRD: Given the crisis in the European Union, which is considered the most serious since its very beginning, how do you assess the prospects for the rise of a more independent foreign policy decision-making process within the European Union? How could a potential change of the political elites, keeping in mind elections in France and Germany, affect Europe’s Russia policy? James Sherr: Against the backdrop of uncertainty, the only thing we can say with confidence is that we should not be complacent that things will remain the same. If either Marine le Pen or, more probably, Nicolas Sarkozy becomes president of France, there will be extremely strong pressure, at least in France, to move in a different direction vis-à-vis Russia.\\nAlso read: \" The crisis of European identity and rapprochement with Russia \" Nevertheless, there is a contradictory factor. Russia, in my view, is today under strong pressure to realize its objectives in Syria and the humanitarian consequences of this are already inflaming European opinion against Russia. So if you factor this in with the other variables, it would be far too optimistic for the Russians to conclude that the sanctions regime will diminish.\\nLook at the example of France, where President Francois Hollande a few months ago was saying that Europe should think about how to diminish sanctions, and now he is talking about increasing them. Well, I do not think they will increase, but I think it is unrealistic to assume that sanctions are going to be reduced either.\\nRD: What we should expect in terms of the Western policy towards Russia? \\nSo, it is really very uncertain, but broadly speaking, many of these developments like Brexit, like the migration crisis, the evident discontent of a leader like Hungarian Prime Minister Viktor Orban, make Russia more comfortable. However, this is not time to be dizzied with success. There is no basis for that.\\nRD: After the recent Normandy Format meeting in Berlin, is there any hope for some positive developments of the Minsk agreements? Do you believe Germany and France will increase their pressure on Kiev in order to implement their part of the agreement? J.S.: In my view, and I believe this is also the view of Kiev, Russia’s aim is not to preserve a frozen conflict – it is to use the warlords [in Eastern Ukraine] as a vehicle, a means to neutralize Ukraine with Western consent . All of the demands of the warlords, and informally those of the Russian leadership, concerning “special status” stipulate first of all absolute autonomy for these regions, something that exists in no federal state in the world.\\nBut secondly, and even more controversially, they stipulate a right of this entity, which is four percent of Ukraine’s territory, to exert a right of veto over Ukraine’s foreign and defense policy. And this is all has been stated explicitly and it’s been reinforced in discussions on a very high level. This is absolutely unacceptable in Kiev.\\nRD: What about Germany and France? What is their stance on that? J.S.: Berlin and Paris are not yet ready to accept it, so they keep looking for a compromise, they keep hoping that if Ukraine compromises, the other side (the rebels in Eastern Ukraine – Editor’s note) will compromise, but I see no evidence of this and from my perspective, they don’t have any reason to do that because the West keeps putting pressure on Kiev to make compromises. So, this leads to what I think is one very dangerous possibility for Ukraine and the West, though it is very encouraging for Russia.\\nIf Ukrainian President Poroshenko is put under pressure by the Ukrainian Parliament, and he insists on legislation that would be harmful to Ukraine’s national interests, the Parliament will reject it. The president will then have to exercise his financial or administrative resources to try to deal with this. He might do that successfully or not: if he does it successfully, then the street will revolt. In my view, this is exactly what Moscow wants to happen.\\nThe problem is that in Europe there is not enough clarity about this situation and the West can blunder into a situation with an endangered Poroshenko regime. They do not want to do that, but after this recent Normandy meeting in Berlin , the risk of such a sequence of errors is more likely than it was before.\\nAnd therefore, I would predict the Ukrainians would do everything that is necessary to stall, resist, divert until they can talk to a new set of players in Washington after the November presidential election .\\nSo, the Normandy Format meeting has not solved anything, it is not going to solve anything, it is an awkward bump on the road. It is going to continue until facts are created that no party can question anymore.\\nRD: Many experts say that one of Russia’s major goals in Syria is to divert attention from Ukraine in order to compel the West to cooperate and thus to prove that Russia is an inevitable partner, which the West has to deal with. So, do you think that it is legitimate to say so and did Russia achieve its goals in Syria? J.S.: Russia today is not only militarily but intellectually a very capable state, a very serious opponent . A great power like Russia never does something as significant as this for only one reason.\\nSo, the strongest motivation for Russia to deploy its forces to Syria in the fall of 2015 is to recognize the Assad regime and to preserve it and preserve it on Russian terms, which means preserve it in a “usable” Syria. Russia is not interested in whether or not Syrian President Bashar al-Assad re-establishes control over all of Syria. What they want is a “usable” Syria, which means the Alawites areas, the Western areas on the coast – areas where Russia’s air base and naval facility are located and so on. This is one reason.\\nAlso read: \" The rivalry between Moscow and Washington for the right to defeat ISIS \" The second is to enjoy regional dividends. The expenses do not break Russia, but if it goes on for five more years then you can talk about it. The U.S. Obama Administration created the power vacuum in the Middle East and this was for many reasons. They came into office and said the Middle East would be less important. In 2012 they decided on the “pivot to Asia,” there are all sorts of new priorities. So, Russia is enjoying now increased authority in the region, including tangible results in Turkey . This is the second.\\nThe third is to show the West that there is no global question Russia is interested in that can’t be solved without Russia and without Russia’s opinion being accepted. In other words, there is no solution to any international problem that will be legitimate or workable without Russia’s participation.\\nAnd the fourth factor is to divert the West’s attention from everything that is going on in Europe . And that’s it.\\nSo, this are four factors there. They each reinforce the other but again, the certain paradox is that, the more Russia does to accomplish its aims in Syria, the bigger the humanitarian consequences, the more Russia’s image suffers in the West, the more pressure there is for sanctions for tough policy and everything else. So, it does not all mesh perfectly.\\nBut this is a very well thought-through, powerful policy which I think in the short-to mid-term is likely to succeed, but not over the long-term. This is because the fundamental factor is that Syria is a country where 60-65 percent of its population is Sunni and it’s true that the Sunni elites are in a sense part of the state’s structure, but others are not; this insurgency is very strong and even after Aleppo, the insurgency is going to remain very strong. I don’t think it will go away.'"}, "time": 1742564375.9800022}