{"duration": 0.05217480659484863, "input_args": {"text": "'Megyn Kelly has come under fire for a planned Father’s Day interview with InfoWars founder Alex Jones on her new Sunday night NBC News program, with social media users calling for a boycott of the program’s advertisers and urging others to tune out the show when it airs later this month. [Kelly shared a preview clip of the interview with Jones on her Twitter account Sunday.  In the clip, Jones defends against being called “the most paranoid man in the world,” calls the September 11 terrorist attacks in the U. S. an “inside job,” and attempts to deflect criticism for his assertion that the 2012 mass shooting at Sandy Hook Elementary School was a hoax. Next Sunday, I sit down with conservative radio host @RealAlexJones to discuss controversies and conspiracies #SundayNight June 18 on NBC pic. twitter.   —   Megyn Kelly (@megynkelly) June 11, 2017,  In response to the preview, several Twitter users identifying themselves as family members of the 27 victims of the horrific attack tweeted directly to the Sunday Night with Megyn Kelly host to express their outrage that the anchor and NBC would give Jones a platform to discuss his views. Cristina Hassinger  —   daughter of Sandy Hook Elementary principal Dawn Hoschsprung, who was killed in the attack  —   and Nelba Marquez Greene, who reportedly lost a daughter in the attack, both sent messages to Kelly denouncing the interview. “Shame on you,” Hassinger wrote. This piece of actual garbage encourages people to call my mom’s death a hoax and harass other Sandy Hook families. Shame on you @megynkelly. https:  .   —   cristina hassinger (@chass63) June 12, 2017,  Here you go @megynkelly  —   her name is Ana Grace  . Say her   stare at this  tell me it’s worth it. @nbc #SandyHook pic. twitter.   —   Nelba   (@Nelba_MG) June 12, 2017,  Hey @megynkelly  —   this is what I’m talking about. Is this what you’re shining a light on? #ShameOnMegynKelly https:  .   —   Nelba   (@Nelba_MG) June 12, 2017,  As the backlash grew on social media Sunday, Kelly responded to a user who said that Jones’ appearance on her show would help “legitimize” the radio host and commentator. Kelly replied that Jones’ previous interactions with President Donald Trump were newsworthy and that her job was to “shine a light” on the media figure. But that explanation was not satisfactory to a number of other social media users, who called for a boycott campaign against NBC and Kelly’s new show. #GrabYourWallet Take down Alex Jones and anyone who supports him.  @nbc https:  .   —   Anita was here (@VennMultiverse) June 12, 2017,  When I was growing up, NBC News was my favorite TV news show. If this vile interview airs, I’ll NEVER watch it again. https:  .   —   Jon Cooper (@joncoopertweets) June 12, 2017,  This is the mother of a child murdered at Sandy Hook  —   a tragedy Alex Jones says never happened. How could you @megynkelly? #shameonNBC https:  .   —   Shannon Watts (@shannonrwatts) June 12, 2017,  Boycott @NBC  @megynkelly for the @RealAlexJones interview. Jones is an incendiary conspiracy theorist who makes up news to fit his agenda,  —   D. Fitz Allgood 🌞🚴 (@FitzAllgoodlife) June 12, 2017,  Very disappointed in @nbc giving airtime to hideous Alex Jones. Won’t watch, and won’t watch @megynkelly ever for providing him a platform. https:  .   —   Heather Whaley (@HeatherWhaley) June 12, 2017,  @NBCNews Please, for the love of goodness  decency, do not give Alex Jones a platform on Sun. It’s disrespectful to    Newtown victims.  —   Nathaniel (@Hoosier2012) June 12, 2017,  A representative for NBC News did not immediately respond to a request for comment. Sunday Night with Megyn Kelly premiered earlier this month with a   interview with Russian president Vladimir Putin. Putin told Kelly that American media had created a “sensation out of nothing” with allegations that Russia interfered in the 2016 U. S. presidential race.   Follow Daniel Nussbaum on Twitter: @dznussbaum'"}, "time": 1742564130.7228673}